[
 [
  [
   12, 
   null, 
   "admin", 
   "Should we do Stem cell research?", 
   {
    "post_info": {
     "post_title": "Stem cell research"
    }
   }, 
   null, 
   null, 
   1043621160.0
  ], 
  [
   4577, 
   null, 
   "AKonsen", 
   "If you're talking about human embryonic stem cell research, then my answer is \"no.\" I've researched the issue exhaustively, and it's clearly illegal (if federally funded), immoral, and scientifically unnecessary.\n \n If you're talking about research on human adult stem cells or stem cells from animals, then I say \"have at it.\"", 
   {
    "post_info": {
     "post_title": "That depends on which kind of stem cell research you're talking about"
    }
   }, 
   12, 
   null, 
   1047539040.0
  ], 
  [
   5602, 
   null, 
   "Yukon", 
   "Originally posted by admin \n Should we do Stem cell research? \n \n \n Darn right....the benefits are enormous. Only a fool would block such work ( or a religious zealot).", 
   {
    "post_info": {
     "post_title": "Re: Stem cell research"
    }
   }, 
   12, 
   null, 
   1048663860.0
  ], 
  [
   5674, 
   null, 
   "AKonsen", 
   "You advocate human embryonic stem cell research over other types of stem cell research?", 
   {
    "post_info": {
     "post_title": "What do you mean?"
    }
   }, 
   12, 
   null, 
   1048718580.0
  ], 
  [
   5883, 
   null, 
   "Yukon", 
   "Originally posted by admin \n Should we do Stem cell research? \n \n \n AK,\n \n You're full of XXXX.........", 
   {
    "post_info": {
     "post_title": "Re: Stem cell research"
    }
   }, 
   12, 
   null, 
   1049062200.0
  ], 
  [
   6066, 
   null, 
   "AKonsen", 
   "I love you too, Yukon. emoticon_rolleyes \n \n Don't you realize that human embryonic stem cell research is immoral and unnecessary? It's also illegal if it's federally-funded, FYI. Here, do some reading you brilliant genius, you.", 
   {
    "post_info": {
     "post_title": "Nice non-argument."
    }
   }, 
   12, 
   null, 
   1049355060.0
  ], 
  [
   11220, 
   null, 
   "Morfos", 
   "Of course we should have Stem Cell Research, it would save thousands of lives. Those Stem Cells can't become babies anyway, so whats with the big \"moral\" issue with Conservatives and this research. Bush oppeses it btw.", 
   {}, 
   6066, 
   null, 
   1056868980.0
  ], 
  [
   11221, 
   null, 
   "Broker", 
   "Bush doesnt oppose it... he supports limited stem cell research. He opposes certain research procedures.", 
   {}, 
   11220, 
   null, 
   1056869220.0
  ], 
  [
   22453, 
   null, 
   "Priscilla2", 
   "Darn right....the benefits are enormous. Only a fool would block such work ( or a religious zealot).\n\n \n Personally, I think stem cell research will be a long and expensive dead end. \n I do not believe that we should even have stem cells. Even though their growth into an adult human has been ruined, they should all be destroyed. However, scientists in Europe have them, and our scientists are so eager to get ahead.\n Yet, I cannot help but actually laugh over the whole issue. We have available to us billions of new stem cells each year that would not require using and embryo or human bone marrow (which has limited stem cell research usage, I&#8217;ve heard). After a baby is born, we cut the umbilical cord and get rid of it and the placenta. Its examined and thrown away. Scientists are screaming for more lines of stem cells and yet they have a whole ton of them to experiment on without causing any moral dilemma. Why don't they use those cord blood stem cells to research on instead? If only a few people actually freeze their children&#8217;s cord in case they need to use it later, why can't scientists experiment on all the ones that are thrown away?", 
   {}, 
   5602, 
   null, 
   1068713580.0
  ], 
  [
   22461, 
   null, 
   "Charchuk", 
   "Should we do Stem cell research?\n\n \n Yes, we should have it. The benefits are enormous. Even though fetal stem cells are the most choice I don't think that women should be paid have abortions just to provide some. They should take the cells from either miscarred, or already aborted fetuses and clone the cells for more when needed.", 
   {}, 
   12, 
   null, 
   1068731940.0
  ], 
  [
   23849, 
   null, 
   "SmokingRabbit", 
   "Do you believe it is right to exploit one human being for another's benefit? If you have a good eye and I have a bad eye, can I take your good eye to make my bad eye feel better?", 
   {}, 
   22461, 
   null, 
   1069687440.0
  ], 
  [
   23850, 
   null, 
   "SmokingRabbit", 
   "Hey, I just wanted to say how nice it is to see another pro-lifer here who knows what he/she believes and is willing to stand up to the pro-abortion pro-embryonic stem cell research rhetoric.", 
   {}, 
   6066, 
   null, 
   1069687620.0
  ], 
  [
   25845, 
   null, 
   "cblan88", 
   "Stem cell research has huge potential. could you imagine if you could regrow a portion of your spine if you were paralyzed? What would you give to be able to walk again? Look abortion is the law of the land, and no one in politics has the guts to change it (actually I don't think the government has the power to change it at this point). So now there is a chance for a fetus that is going to be aborted anyway to regrow portions of the nervous system in a terribly injured person. I can't see how we can morally not allow this research to go on. Whether you agree with abortion or not.", 
   {}, 
   23850, 
   null, 
   1070718720.0
  ], 
  [
   26255, 
   null, 
   "SmokingRabbit", 
   "Do you believe it is right to exploit one human being for another's benefit? If you have a good eye and I have a bad eye, can I take your good eye to make my bad eye feel better? \n \n \"Stem cell research has huge potential. could you imagine if you could regrow a portion of your spine if you were paralyzed? What would you give to be able to walk again?\"\n \n A lot I'm sure. I wouldn't kill someone for that opportunity though. You need to keep something else in mind, adult stem cells are actually MORE effective in some ways. I don't have a problem with the research as long as you aren't killing the donor. Why not simply use adult stem cells for the research? \n \n \"Look abortion is the law of the land, and no one in politics has the guts to change it (actually I don't think the government has the power to change it at this point).\"\n \n I'm working on that, however that doesn't mean embryonic stem cell research is moral.\n \n \"I can't see how we can morally not allow this research to go on.\"\n \n Answer the questions marked in blue.\n \n \"Whether you agree with abortion or not.\"\n \n Most pro-lifers are against abortion because we believe it takes the life of an innocent human being without justification. If you think it's wrong to do that and if you believe embryonic stem cell research does that then embryonic stem cell research is wrong. I don't believe there are any consistent pro-lifers that support ESCR.", 
   {
    "unicode_changes_made": true
   }, 
   25845, 
   null, 
   1070915100.0
  ], 
  [
   26448, 
   null, 
   "superbuddhaman", 
   "Do you believe it is right to exploit one human being for another's benefit? If you have a good eye and I have a bad eye, can I take your good eye to make my bad eye feel better?\n\n \n \n \n Ummmm...what? \n Using tissue from an aborted fetus is no different from organ donation. Once the life has left the being, why shouldn't it's carcass be used for research?\n And no religious hooey", 
   {}, 
   23849, 
   null, 
   1070985180.0
  ], 
  [
   28019, 
   null, 
   "unkerpaulie", 
   "Ummmm...what? \n Using tissue from an aborted fetus is no different from organ donation. Once the life has left the being, why shouldn't it's carcass be used for research?\n And no religious hooey\n\n lol, yeah, the problem is surgeons dont go around looking for living donors and kill them to take their organs; they wait for them to die! with stem cell research, its totally the other way around. fetuses dont volunteer to be stem cell donors.\n \n LMAO@\"Once the life has left the being\"... you just advocated killing the being, then arguing that its OK to use the organs cos the being is dead! I just find this hilarious", 
   {}, 
   26448, 
   null, 
   1071687840.0
  ], 
  [
   28256, 
   null, 
   "superbuddhaman", 
   "lol, yeah, the problem is surgeons dont go around looking for living donors and kill them to take their organs; they wait for them to die! with stem cell research, its totally the other way around. fetuses dont volunteer to be stem cell donors.\n \n LMAO@\"Once the life has left the being\"... you just advocated killing the being, then arguing that its OK to use the organs cos the being is dead! I just find this hilarious\n\n \n \n okay, first of all, doctors don't go into obstetricians offices trying to round up women to donate their children for stem cell research. It is not even discussed with a woman until she has decided to have an abortion, and then, only in certain areas, by certain doctors, in certain cases.\n You are completely and intentionally misinterpreting my statement. i never advocated killing anything or anyone. And yes, it is my opinion that once death has occured, there is no reason not to use the body for research, to hopefully help others, to hopefully prevent another's death.\n there is no logical reason not to be an organ donor, likewise, if a woman has already chosen to terminate her pregnancy, there is no logical reason why that choice could not be used to try to benefit another. This would be one form of compassion.", 
   {}, 
   28019, 
   null, 
   1071778080.0
  ], 
  [
   28269, 
   null, 
   "unkerpaulie", 
   "okay, first of all, doctors don't go into obstetricians offices trying to round up women to donate their children for stem cell research. It is not even discussed with a woman until she has decided to have an abortion, and then, only in certain areas, by certain doctors, in certain cases.\n You are completely and intentionally misinterpreting my statement. i never advocated killing anything or anyone. And yes, it is my opinion that once death has occured, there is no reason not to use the body for research, to hopefully help others, to hopefully prevent another's death.\n \n\n due respect, you handle mild ridicule admirably... :)\n \n however, you do seem to advocate abortion, as well as impregnation for the purpose of fetal donation.\n \n basically, granting abortion for the purpose of stem research is equal to exploiting a human being for the sake of other humans. this can arguably be ethically wrong or right, but the issue is that a life is killed for this type of stem research to take place. \n \n This debate can also veer off onto how \"life\" is defined. apparently, society would rather redefine the word \"life\" to morally justify abortions rather than admit that they are killing babies and just move on. (I might be rambling, if this last paragraph is off-topic feel free to ignore it :p)\n \n \nthere is no logical reason not to be an organ donor, likewise, if a woman has already chosen to terminate her pregnancy, there is no logical reason why that choice could not be used to try to benefit another. This would be one form of compassion\n\n \n this I can agree with. however, to me the problem is abortion, i.e. taking a life, to get the stem cells", 
   {}, 
   28256, 
   null, 
   1071781740.0
  ], 
  [
   31453, 
   null, 
   "treat2", 
   "If you're talking about human embryonic stem cell research, then my answer is \"no.\" I've researched the issue exhaustively, and it's clearly illegal (if federally funded), immoral, and scientifically unnecessary.\n \n If you're talking about research on human adult stem cells or stem cells from animals, then I say \"have at it.\"\n\n \n Absolute garbage. The typical regressive argument founded on nothing but religious dogma, and without any consideration for healing human suffering.\n \n The entire thing should be and will be tossed in the trash, where it belongs, when Bush and his extremist followers are out! \n \n There's absolutely nothing immoral, nor wrong stem cell research. What is immoral are the laws that limit the research, as the current backward irrational religious based laws do.\n \n Why stem cell research is in an abortion Forum is beyond me. It's a Scinece topic, if there ever was one, and has nothing to do with abortion except in the mind of the most backwards extremist minds in the entire World.\n \n Stem cell research will happen, in full, and not be limmited by the absurd laws created by the pope's extremists. It's only a matter of time, before all those ridiculous laws are undone and trashed.", 
   {
    "post_info": {
     "post_title": "Absolute Garbage"
    }
   }, 
   4577, 
   null, 
   1074242700.0
  ], 
  [
   35389, 
   null, 
   "jitobear", 
   "Yes we should do this research.", 
   {}, 
   31453, 
   null, 
   1077318480.0
  ], 
  [
   37194, 
   null, 
   "Tastyfish", 
   "I'm for it, but not in the US so less of an issue for me doing a biotech degree\n There is a difference between these and adult stem cells, most cells have limits on how often they can reproduce and the adult undiffereniated cells can usually only replicate a few times, nowhere near enough to grow an organ, whether imoratlising them helps I do not know, but this has more added complications. Other than the source of these cells how is this an issue at all, alowing abortion and not stem cell research seems bizarre and purely a political vote gathering thing.", 
   {}, 
   35389, 
   null, 
   1078172400.0
  ], 
  [
   37316, 
   null, 
   "Nallyo", 
   "I agree that this research has enormous implications in the regeneration of lost tissue. HOWEVER, as many have said, it should be taken from adults (I believe the liver and the base of the brain have an abundance of stem cells and regenerate them regularly) or from the umbilical cords of already born babies. If you get into \"dead babies\"/aborted fetuses, the legal issues become a lot more complicated and the moral battles will be endless. Stick to the stem cells that can be taken without any controversy and the research will go farther.", 
   {}, 
   37194, 
   null, 
   1078201020.0
  ], 
  [
   37456, 
   null, 
   "Tastyfish", 
   "There are complications with adult cells, they are more undifferentiated cells than the 'ideal' stem cells (i.e one that will grow into an organ) as there is anti cancer mechanisms that limit the number of times they can divide. Not sure if what the problem with umilical cord tissue is, or if there is one (though if it is part of the placenta rather the baby there may be- some genetic wierdness goes on here with DNA from specific sources (paternal DNA only or something similar, something unusual) being activated rather than going on normal equal expression)\n \n The research on feotal stem cells is primarily to find out what seperates them from normal cells and to find away to transform adult cells into the type of stem cells we want. \n \n Still, as long as the abortions are going on for other reasons and this provides a large source of stem cells whcih would otherwise be burnt what's the problem, if abortion was illegal then fair enough that these stem cells wouldn't be used.", 
   {}, 
   37316, 
   null, 
   1078256100.0
  ], 
  [
   37540, 
   null, 
   "Nallyo", 
   "The problem some people see with getting them from abortions is that it will continue to provide a \"market\" for aborted fetuses, which will make it that much harder to make illegal. It's a whole moral debate that I believe could be avoided if stem cells from the umbilical cord, or as you pointed out, the placenta were used. I mean, how many people have a problem with those being used for scientific research?", 
   {}, 
   37456, 
   null, 
   1078277820.0
  ], 
  [
   37557, 
   null, 
   "Tastyfish", 
   "Only problem might be that they are not really that useful for the 'stem cell' research side of the research but arn't really sure.\n I really don't think anyone ever suggests production of stem cells for research is even a benefit of having abortion, let alone a possible reason (however much a small one) I would say it is entirely out of abortion debate (or at least really should be) and along the same lines as gun ownership providing practice for military doctors at treating gun shot wounds- clearly not a deciding factor for or against but just something that may as well happen if it is going on.\n \n Only time I can see there being a big conflict would be in the future once the technology has been sorted about halfway (can get the organs to grow but not normal cells to become stem cells) and parents creating an embryo (before any differentiation occurs- so it is just plain cells) to provide stem cells for a very badly physically disabled child (not sure whether rejection is that much of an issue, would imagine it is). But this is going to be a very unusual situation and hopefully won't occur due ot the order of breakthroughs made.", 
   {}, 
   37540, 
   null, 
   1078281480.0
  ], 
  [
   39522, 
   null, 
   "amycus", 
   "You advocate human embryonic stem cell research over other types of stem cell research?\n\n \n Stem cell research using embryonic cells is, so far, the easiest way for scientists to research the specialization code. Once they have figured out what biochemical code triggers the specialization process, then they can figure out the way to research adult cells. Until then, I am a supporter of human embryonic stem cell research. \n \n If you look at it from a religious stand point, God put us in this world and gave us the ability to do all those things.", 
   {
    "post_info": {
     "post_title": "Stem Cell Research"
    }
   }, 
   5674, 
   null, 
   1079369160.0
  ], 
  [
   39617, 
   null, 
   "Alex", 
   "The reason this issue is so closely tied to the abortion debate is because it all comes down to one question: are the unborn human?\n \n If a fetus is human, then it darn well deserves protection. I myself wouldn't appreciate it much if someone killed me to do research, just because I wasn't developed enough yet to defend myself.\n \n If a fetus is not human, then go ahead and kill it.\n \n The same goes for abortion; the root question is all about whether the unborn deserve protection.", 
   {}, 
   39522, 
   null, 
   1079436840.0
  ], 
  [
   39685, 
   null, 
   "Sigma", 
   "The reason this issue is so closely tied to the abortion debate is because it all comes down to one question: are the unborn human?\n \n\n \n I don't think it really relates that way. If a woman had a miscarriage and concented to having the stem cells harvested, would you object using the same reasoning?", 
   {}, 
   39617, 
   null, 
   1079481720.0
  ], 
  [
   61844, 
   null, 
   "duck", 
   "I read in the newspaper a women went from being completely paralized to able to walk using adult stem cells. And what about the fetuses suffering?", 
   {}, 
   39685, 
   null, 
   1092288960.0
  ], 
  [
   61845, 
   null, 
   "duck", 
   "The reason this issue is so closely tied to the abortion debate is because it all comes down to one question: are the unborn human?\n \n If a fetus is human, then it darn well deserves protection. I myself wouldn't appreciate it much if someone killed me to do research, just because I wasn't developed enough yet to defend myself.\n \n If a fetus is not human, then go ahead and kill it.\n \n The same goes for abortion; the root question is all about whether the unborn deserve protection.\n\n Most humans wouldn't treat an animal that way.", 
   {}, 
   39617, 
   null, 
   1092289020.0
  ], 
  [
   61851, 
   null, 
   "Sigma", 
   "Most humans wouldn't treat an animal that way.\n\n \n Sure we do emoticon_confused Animal testing and all that.\n \n If everything can be done using adult stem cells, there would be no call for fetus stem cells.", 
   {}, 
   61845, 
   null, 
   1092291360.0
  ], 
  [
   62150, 
   null, 
   "duck", 
   "Sure we do emoticon_confused Animal testing and all that.\n \n If everything can be done using adult stem cells, there would be no call for fetus stem cells.\n\n Everything can be done with adult stem cells. Have you read my last post? The woman went from paralyzed to walking. Fetus stem cells have done nothing like that. And these adult stem cells were used from the womans snot.", 
   {}, 
   61851, 
   null, 
   1092453720.0
  ], 
  [
   62154, 
   null, 
   "Sigma", 
   "Everything can be done with adult stem cells. Have you read my last post? The woman went from paralyzed to walking. Fetus stem cells have done nothing like that. And these adult stem cells were used from the womans snot.\n\n \n Do you... have a source on it?", 
   {}, 
   62150, 
   null, 
   1092454740.0
  ], 
  [
   62171, 
   null, 
   "Mach", 
   "We can already do stem cell research on any stem cells.\n \n The only issue right now is that federal money can't be used for some types of stem cell research. Private money can be used on any stem cell research.\n \n Being for or against stem cell research IMO should have nothing to do with abortion rights, two different issues, do not confuse them.\n \n Remember too, dear Republicans, as you're so fond of pointing out the free-market economy, scientific research follows the same evolution. If we restrict it, instead of research growing in the US at least partially under our care, it will grow in other countries without such restrictions. Job loss, IP/patent loss, and we won't be the leaders in an emerging bio-tech. Not good for America. \n \n \n And DUCK:\n No one knows the limitations or potential for either embryonic or adult stem cells yet. Adult stem cells have about 10x the funding but it's still barely getting started. It is known that embryonic stem cells are more \"flexible\" in terms of differentiation, but really, no one yet knows. Way too soon to know things like that, even as a guess.\n \n -Mach", 
   {
    "post_info": {
     "post_title": "stem cell"
    }
   }, 
   12, 
   null, 
   1092462300.0
  ], 
  [
   62236, 
   null, 
   "duck", 
   "Do you... have a source on it?\n\n The newspaper.", 
   {}, 
   62154, 
   null, 
   1092526500.0
  ], 
  [
   62238, 
   null, 
   "duck", 
   "Adult stem cells have about 10x the funding \n \n Adult stem cells also don't requrie killing anyone for them.", 
   {}, 
   62236, 
   null, 
   1092526980.0
  ], 
  [
   62245, 
   null, 
   "Mach", 
   "Adult stem cells also don't requrie killing anyone for them.\n\n \n I seriously doubt the primary method for a researcher to obtain embryonic stem cells is to kill someone. If you mean that an adult couple that use IV fertilization is \"killing\" someone, then you have an issue with IV fertilziation, in my opinion, not embryonic stem cell research.\n \n -Mach", 
   {
    "post_info": {
     "post_title": "stem"
    }
   }, 
   62238, 
   null, 
   1092528120.0
  ], 
  [
   62247, 
   null, 
   "duck", 
   "I seriously doubt the primary method for a researcher to obtain embryonic stem cells is to kill someone. If you mean that an adult couple that use IV fertilization is \"killing\" someone, then you have an issue with IV fertilziation, in my opinion, not embryonic stem cell research.\n \n -Mach\n\n THats how they have to get the cells. Dead baby carcuses. Or they pay people to make a baby then kill it so they can use the stem cells.", 
   {}, 
   62245, 
   null, 
   1092528420.0
  ], 
  [
   62267, 
   null, 
   "Sigma", 
   "THats how they have to get the cells. Dead baby carcuses. Or they pay people to make a baby then kill it so they can use the stem cells.\n\n \n Or... they use stem cells from a dead fetus that will be destroyed anyway. With as many abortions that occur, do you really think they need to pay someone to get pregnant for this sole purpose?\n \n Would you please link the article that you got that story from? I'd like to read it.", 
   {}, 
   62247, 
   null, 
   1092543840.0
  ], 
  [
   62283, 
   null, 
   "duck", 
   "Or... they use stem cells from a dead fetus that will be destroyed anyway. With as many abortions that occur, do you really think they need to pay someone to get pregnant for this sole purpose?\n \n Would you please link the article that you got that story from? I'd like to read it.\n\n Its not what I think, its what I know.\n I have no idea how to do that on the internet.", 
   {}, 
   62267, 
   null, 
   1092554400.0
  ], 
  [
   62298, 
   null, 
   "Sigma", 
   "Its not what I think, its what I know.\n I have no idea how to do that on the internet.\n\n \n In a debate, if you do not have a way to prove what you say (unless it is common knowledge), by linking to a source, you cannot expect other parties to believe what you say.", 
   {}, 
   62283, 
   null, 
   1092559080.0
  ], 
  [
   63942, 
   null, 
   "Tastyfish", 
   "Adult stem cells are totally different things from fetal ones, an adult stem cell is a cell that devides and produces a copy of itself and other differentiated cell and can only do this a few times. Fetal ones can devide indefinitely and often produce a wider range of cell types rather than just one.", 
   {}, 
   62298, 
   null, 
   1093438680.0
  ], 
  [
   64625, 
   null, 
   "kickin50", 
   "Should we do Stem cell research?\n\n \n Only in America would we think we can control this issue. Are we just a tad full of ourselves? Research does go on the rest of the world. Some of those countries are even civilized. The question is not whether to do it. The question is whether to invent it or buy it.", 
   {
    "post_info": {
     "post_title": "Only In America"
    }
   }, 
   12, 
   null, 
   1093726080.0
  ], 
  [
   73978, 
   null, 
   "|3asic /-\\ce", 
   "I love you too, Yukon. emoticon_rolleyes \n \n Don't you realize that human embryonic stem cell research is immoral and unnecessary? It's also illegal if it's federally-funded, FYI. Here, do some reading you brilliant genius, you.\n\n \n Dear Mr.AK\n I read your link and it is highly biased. You can not honastly say that you got your opinion from reading that nonsense. Also I ask all of you who oppose embryonic stem cell reasearch and say it is immoral to kill the embryo, would you kill your neighbor to save hundreds of thousands of lives. Killing an embryo is the same, this research can cure cancer and diabetes and I say killing one is worth saving thousands or even millions.", 
   {}, 
   6066, 
   null, 
   1098993420.0
  ], 
  [
   74310, 
   null, 
   "jitobear", 
   "Only in America would we think we can control this issue. Are we just a tad full of ourselves? Research does go on the rest of the world. Some of those countries are even civilized. The question is not whether to do it. The question is whether to invent it or buy it.\n\n \n Excellent point.", 
   {}, 
   64625, 
   null, 
   1099115520.0
  ], 
  [
   74317, 
   null, 
   "Dzeron", 
   "Adult stem cells also don't requrie killing anyone for them.\n\n \n Yeah, I heard they can get stem cells out of your teeth now.", 
   {}, 
   62238, 
   null, 
   1099117260.0
  ], 
  [
   75639, 
   null, 
   "kickin50", 
   "My hat is off to California!\n \n Was my post #43 right or wrong? Now we just need New York to follow suit.\n \n Now my question. If the federally funded programs can not create new stem cell lines, can California create them and then share? Voila! Federal funding on useful research.\n \n Then watch 'em all stand in line for the cure.\n \n Another question. Has anybody else thought to ask GWB why, if stem cell research is false hope, did he fund any of it -- badly?", 
   {}, 
   74317, 
   null, 
   1099680720.0
  ], 
  [
   75801, 
   null, 
   "zachvac", 
   "OK, I've read both sides here and I don't know too much about stem cell research, but...\n \n if you already have the fetus and you have 2 options (throw it in the trash or do research) wouldn't it make sense to do research on it? It shouldn't be used as an excuse for an abortion and I've never heard of that (except for the other side claiming that they might do it). There are other civilized countries that do stem cell research and they don't seem to have the problem of people paying people for fetuses and embryos, right? I'm confused about what the problem is with using something you will throw away anyway for research that could save millions.", 
   {}, 
   75639, 
   null, 
   1099720200.0
  ], 
  [
   75854, 
   null, 
   "kickin50", 
   "OK, I've read both sides here and I don't know too much about stem cell research, but...\n \n if you already have the fetus and you have 2 options (throw it in the trash or do research) wouldn't it make sense to do research on it? It shouldn't be used as an excuse for an abortion and I've never heard of that (except for the other side claiming that they might do it). There are other civilized countries that do stem cell research and they don't seem to have the problem of people paying people for fetuses and embryos, right? I'm confused about what the problem is with using something you will throw away anyway for research that could save millions.\nExactly. Why put it down the drain? The concept of women donating eggs for this purpose just flys in the face of logic. It's not only unnecessary, donating eggs is pretty unpleasant. The whole idea that that could or would happen is just another baselsss scare tactic.", 
   {}, 
   75801, 
   null, 
   1099762260.0
  ], 
  [
   75965, 
   null, 
   "faeden", 
   "Here is an angle I'm struggling with..... Is it moral to use the medical results of the Nazi torture doctors? They did some barbaric tests on humans which resulted in some serious medical advancements.\n \n It boils down to this: Do the ends justify the means?\n \n What do you think?", 
   {
    "post_info": {
     "post_title": "principals"
    }
   }, 
   75854, 
   null, 
   1099811280.0
  ], 
  [
   76024, 
   null, 
   "Tastyfish", 
   "Its more than that seeing as there is enough debate anyway as to whether these 'means' are actually all that bad anyway.", 
   {}, 
   75965, 
   null, 
   1099852260.0
  ], 
  [
   76077, 
   null, 
   "kickin50", 
   "There just isn't any \"means\" to deal with. The other choice is thawing it out and putting it in the medical waste bin.\n \n I've always been a pragmatic person. I make it through life with a certain amount of suspicion. I believe in the saying, if it seems too good to be true. Of late, I guess I'd have to say I'm downright synical. Has it occured to anybody else that actually curing disease rather than treating it chronically isn't in the best financial interest of the health care industry. Has it occured to any pro-lifers out there that that's the real link between them and the money grubbing Republican Party? Drug companies don't want stem-cell research for the same reason they don't want to dicker for price with Medicare.", 
   {}, 
   76024, 
   null, 
   1099870380.0
  ], 
  [
   151840, 
   null, 
   "Morfos", 
   "California is funding stem cell research! :)", 
   {}, 
   76077, 
   null, 
   1122737400.0
  ], 
  [
   151930, 
   null, 
   "Pravda", 
   "Bill Frist, of all people, has declared his support for embryonic stem cell research (with qualifications, of course).\n \n Here's a link\n \n Off-hand, I found his comment about transplanting a heart from a brain-dead subject into a living person interesting. I wonder how he knew that supposedly brain-dead person didn't have a rich inner life?", 
   {}, 
   151840, 
   null, 
   1122771960.0
  ], 
  [
   151979, 
   null, 
   "Tastyfish", 
   "Think there is a difference between brain dead and coma, if there is no electrical activity whatsoever then there is no inner life either. Nothing is happening, whilst I think coma pateints show some baseline brain activity", 
   {}, 
   151930, 
   null, 
   1122813540.0
  ], 
  [
   152003, 
   null, 
   "Adept", 
   "Here is an angle I'm struggling with..... Is it moral to use the medical results of the Nazi torture doctors? They did some barbaric tests on humans which resulted in some serious medical advancements.\n \n It boils down to this: Do the ends justify the means?\n \n What do you think?\n\n \n Well, will not using those results somehow make the behaviour of the Nazi's acceptable? No. Will it (potentially) enrich and save lives? Yes. \n \n Seems like a pretty easy question to me.\n \n Do the ends justify the means? Of course. They are, after all, the only thing that ever can.\n \n I find that 'The end cannot justify the means' is a phrase often used without full consideration. In order to achieve certain goals, certain acts must be undertaken. More accurately, the phrase should be 'The end only justifies the requisite means'. For example, Giving someone a blast on the horn after they cut you off in traffic is justified. Shooting them is not. However, shooting someone is justified if it is in self defense, the defense of another, in times of war, state sanctioned executions, etc.\n \n So the ends don't justify any means at all, only the means that are required in order to achieve said ends.\n \n If any of that made any sense...", 
   {}, 
   75965, 
   null, 
   1122831060.0
  ], 
  [
   152126, 
   null, 
   "Steeeeve", 
   "Think there is a difference between brain dead and coma, if there is no electrical activity whatsoever then there is no inner life either. Nothing is happening, whilst I think coma pateints show some baseline brain activity\n\n \n well...we assume this. I'm not sure we really know.", 
   {}, 
   151979, 
   null, 
   1122911400.0
  ], 
  [
   152127, 
   null, 
   "Steeeeve", 
   "Bill Frist, of all people, has declared his support for embryonic stem cell research (with qualifications, of course).\n \n Here's a link\n \n Off-hand, I found his comment about transplanting a heart from a brain-dead subject into a living person interesting. I wonder how he knew that supposedly brain-dead person didn't have a rich inner life?\n\n \n Just a few people in Tenn. are upset about this action. emoticon_rolleyes \n \n Right afterwards some pro-life republicans came out and said they were against what Frist had said. Definitly a let down for his state though..which is pretty pro-lifey.", 
   {}, 
   151930, 
   null, 
   1122911520.0
  ], 
  [
   152142, 
   null, 
   "Tastyfish", 
   "well...we assume this. I'm not sure we really know.\n Yes we do, its pretty obvious whether or not something is happening, its the coma level which is more dubious - the boundary between being permanantly alseep or unconcious and just autonomic messages, however if there is no brain activity then the patient is clearly dead, regardless of what machines are doing to there heart, kidneys and lungs etc.", 
   {}, 
   152126, 
   null, 
   1122917760.0
  ], 
  [
   152170, 
   null, 
   "Steeeeve", 
   "Yes we do, its pretty obvious whether or not something is happening, its the coma level which is more dubious - the boundary between being permanantly alseep or unconcious and just autonomic messages, however if there is no brain activity then the patient is clearly dead, regardless of what machines are doing to there heart, kidneys and lungs etc.\n\n or just a single feeding tube now.", 
   {}, 
   152142, 
   null, 
   1122930420.0
  ], 
  [
   152174, 
   null, 
   "Tastyfish", 
   "Admittedly yeah, that is the grey area we are talking about between higher functions and just the autonomic system - but the way it was told here was that several doctors had all ruled her brain dead. If the activity is only in certain regions then the vague area involved is known, we don't know quite how the brain works, but we do know what bits do what.", 
   {}, 
   152170, 
   null, 
   1122931680.0
  ], 
  [
   153187, 
   null, 
   "Cush", 
   "Just a few people in Tenn. are upset about this action. emoticon_rolleyes \n \n Right afterwards some pro-life republicans came out and said they were against what Frist had said. Definitly a let down for his state though..which is pretty pro-lifey.\n\n \n I'm sitting here in Nashville, and honestly, this isn't a big issue. You may hear a couple of extremists, but that would be in any state. Nobody I know is upset about Frist.\n \n Most people don't even understand basic biology, much less the stem cell debate. To them, if Frist says it's cool, then it's cool. Also, most people can figure out the difference between coma and braindead. In a nutshell, one is asleep, dreaming.. and the other is dead, but we're keeping their body alive. No big.", 
   {}, 
   152127, 
   null, 
   1123286760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Stem cell research", 
  "url": "http://www.4forums.com/political/abortion-debates/10-stem-cell-research.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 10, 
  "discussion_files": [
   [
    "12089.html", 
    "http://www.4forums.com/political/abortion-debates/10-stem-cell-research-print.html"
   ], 
   [
    "12090.html", 
    "http://www.4forums.com/political/abortion-debates/10-stem-cell-research-5-print.html"
   ], 
   [
    "12091.html", 
    "http://www.4forums.com/political/abortion-debates/10-stem-cell-research-4-print.html"
   ], 
   [
    "12092.html", 
    "http://www.4forums.com/political/abortion-debates/10-stem-cell-research-3-print.html"
   ], 
   [
    "12093.html", 
    "http://www.4forums.com/political/abortion-debates/10-stem-cell-research-2-print.html"
   ]
  ], 
  "identifier": 10
 }
]