[
 [
  [
   268693, 
   null, 
   "Kronus", 
   "The Massachusetts legislature voted down the proposed amendment that would have banned same sex marriage. For an amendment started via petition the legislature has to approve it twice in a row, with only 25% having to support it. They voted today, and the results were 45 for, 151 against, out of 200. I'm sure opponents of gay rights will try again, but they'll have to start from scratch, and opposition will be much steeper. I think it's safe to say that gays getting married in Massachusetts is here to stay.\n \n http://www.boston.com/news/globe/city_region/breaking_news/2007/06/legislators_vot_1.html\n \n And once again we see this same tired argument:\n \"I don't believe it's dead because the people have not had the opportunity to have their vote,\" Mineau told the Associated Press. \"This will not go away until the citizens have their opportunity to decide what the definition of marriage is.\"\n \n Hundreds if not thousands of legal definitions are decided every year without the voters getting any direct say. Unless anyone can show why this legal definition should get special treatment I can't see them getting much real traction with that argument for much longer. It's good for generating some emotional responses, pretending that Democracy is under attack or something, but it has no real substance. And over time, more and more people seem to be realizing that.", 
   {
    "post_info": {
     "post_title": "Marriage rights in MA are secure"
    }
   }, 
   null, 
   null, 
   1181852160.0
  ], 
  [
   268701, 
   null, 
   "ShadowPikachu", 
   "The Massachusetts legislature voted down the proposed amendment that would have banned same sex marriage. For an amendment started via petition the legislature has to approve it twice in a row, with only 25% having to support it. They voted today, and the results were 45 for, 151 against, out of 200. I'm sure opponents of gay rights will try again, but they'll have to start from scratch, and opposition will be much steeper. I think it's safe to say that gays getting married in Massachusetts is here to stay.\n \n http://www.boston.com/news/globe/city_region/breaking_news/2007/06/legislators_vot_1.html\n \n And once again we see this same tired argument:\n \"I don't believe it's dead because the people have not had the opportunity to have their vote,\" Mineau told the Associated Press. \"This will not go away until the citizens have their opportunity to decide what the definition of marriage is.\"\n \n Hundreds if not thousands of legal definitions are decided every year without the voters getting any direct say. Unless anyone can show why this legal definition should get special treatment I can't see them getting much real traction with that argument for much longer. It's good for generating some emotional responses, pretending that Democracy is under attack or something, but it has no real substance. And over time, more and more people seem to be realizing that.\n\n \n Excellent News! Between this and all of the new states (Washington, Oregon, etc.) that are moving toward gay marriage, I really hope it won't be very long until every gay in America can legally marry the person they love.", 
   {}, 
   268693, 
   null, 
   1181853600.0
  ], 
  [
   268708, 
   null, 
   "samiinh", 
   "Good News. Very good news.", 
   {}, 
   268701, 
   null, 
   1181855100.0
  ], 
  [
   268724, 
   null, 
   "lesz", 
   "The Massachusetts legislature voted down the proposed amendment that would have banned same sex marriage. For an amendment started via petition the legislature has to approve it twice in a row, with only 25% having to support it. They voted today, and the results were 45 for, 151 against, out of 200...\n\n \n I was going to say, \"Excellent news!\" but I was beaten to it. emoticon_xgood \n \n Massachusetts leads the US. This is, essentially, the legislature endorsing a court decision, that gay citizens deserve equal rights.\n \n No doubt, religious bigots will keep trying. But this is good news. Massachusetts has had gay marriage for four years now... meteors haven't fallen, straight marriage has not disintegrated -- indeed, MA has the best record in divorce of any state. Intelligent straight people realise it's not such a big deal for them, though it is a big deal for gay citizens of MA. \n \n Kudos to the legislature for standing up for equal rights.", 
   {}, 
   268693, 
   null, 
   1181857260.0
  ], 
  [
   268730, 
   null, 
   "robbie0517", 
   "Wow, this is wonderful news! I applaud the legislator. The governor played a big part in this as well, he is excellent!", 
   {}, 
   268724, 
   null, 
   1181858520.0
  ], 
  [
   268732, 
   null, 
   "Matthew S", 
   "What can I say but \"Thank the Lord and sing His praise\" He has answered my prayer. Sing hallelujah emoticon_xhoho emoticon_xgood \n \n He preparest a table before me in the presence of mine enemies;\n He annointest my head with oil; My cup runneth over.", 
   {}, 
   268724, 
   null, 
   1181858700.0
  ], 
  [
   268739, 
   null, 
   "samiinh", 
   "A survey of NH Republican Voters published just this week stated that SSM was near the bottom of their list of concerns. MA must be rubbing off.", 
   {}, 
   268732, 
   null, 
   1181859900.0
  ], 
  [
   268807, 
   null, 
   "Unriggable", 
   "Kickass! :) \n This bothers me: Why do these guys even care if gays get married?\n \n What the hell is SSM?", 
   {}, 
   268739, 
   null, 
   1181889420.0
  ], 
  [
   268817, 
   null, 
   "lesz", 
   "Kickass! :) \n This bothers me: Why do these guys even care if gays get married?\n\n \n Good question! emoticon_xgood If you ever find the answer, share! ;)\n \n \nWhat the hell is SSM?\n\n \n It's a form of ritual bondage in which two mates struggle for dominance and vie to embarrass the socks and jock straps off each other, aka single sex marriage. ;)", 
   {}, 
   268807, 
   null, 
   1181902140.0
  ], 
  [
   268830, 
   null, 
   "samiinh", 
   "I think of SSM as Same Sex Marriage, but Single Sex Marriage would mean the same thing.", 
   {}, 
   268817, 
   null, 
   1181907900.0
  ], 
  [
   268834, 
   null, 
   "Matthew S", 
   "Kickass! :) \n This bothers me: Why do these guys even care if gays get married?\n \n What the hell is SSM?\n\n \n Here is the answer to your question. Those who oppose same sex marriage do so because they are 1 Mean and cruel. 2 They want to protect their privledge. 3 They want to continue to assume that if a man says he is married it is to a woman. 4 They want to impose their religious beliefs on gay people. 4 They hate gay people. 5 Their marriages will be destroyed if gay people are allowed to marry. Take your pick but it all comes down to hate, bigotry, and evil religious beliefs.", 
   {}, 
   268807, 
   null, 
   1181912940.0
  ], 
  [
   268840, 
   null, 
   "samiinh", 
   "Kickass! :) \n This bothers me: Why do these guys even care if gays get married?\n \n What the hell is SSM?\n\n \n They don't have enough to do. Their lives suck.", 
   {}, 
   268807, 
   null, 
   1181916300.0
  ], 
  [
   268842, 
   null, 
   "lesz", 
   "One Mass. lawmaker, in her own words, who changed her vote on same-sex marriage\n \n \nIn January at the end of the last legislative session, Representative Gale Candaras, a Democrat from Wilbraham, voted in favor of a constitutional amendment that would have banned same-sex marriage. Candaras returned to the Legislature as a senator and changed her position, voting today against the same-sex marriage ban.\n \n Candaras issued a statement today after the Constitutional Convention to explain her vote. It appears below in its entirety...\n\n \n It's worth reading in its entirety, but here's a snippet:\n \n \n\"For me, what all this comes down to is this: Same gendered couples are taxpaying, law-abiding citizens, who are important community contributors, well-loved and well-respected by their families, friends, neighbors and employers. They deserve and are entitled to the same legal protections enjoyed by all others citizens of our state. This is the law of the Commonwealth, articulated by our Supreme Judicial Court in Goodrich v. The Department of Public Health, decided in November, 2003.\n \n \"Despite dire predictions, there has been no adverse societal impact from this decision and most people now express little concern about same gender marriage.\n \n \"Springfield and Western Massachusetts needs these families, and all our families, to help rebuild our neighborhoods and the peaceful and productive society to which I know, whatever our differences on some things, we all aspire. As a practical matter, I believe we simply cannot afford to marginalize our human resources. Most importantly, I feel strongly that no child should ever be made to feel \"less than\" or \"second-best\" nor should any of our children be exposed to a public campaign focused on adult matters of personal privacy. There is altogether too much unseemly information brought into our homes and schools already. It is in the best interests of our children that we accept fully these new families.\"\n \n\n If the Christian right were \"pro-family\" as they always claim, they would not agitate as they always do to hurt the families of gay people. But as we all know, the label \"pro-family\" is lying code for anti-gay. Obviously, more and more people are finally beginning to figure it out.", 
   {
    "unicode_changes_made": true
   }, 
   268840, 
   null, 
   1181916600.0
  ], 
  [
   268845, 
   null, 
   "Kronus", 
   "Kickass! :) \n This bothers me: Why do these guys even care if gays get married?\n \n\n \n Reasons must vary widely, but here's my guess for alot of them. There are people out there who don't like gays, but refuse to admit that they're homophobic. These are the folks who say things like \"It's always been that way\" or \"It just isn't natural\" or my favorite \"love the sinner hate the sin\". They have their dislike, but don't want to admit, even to themselves, that the source of their dislike is in fact themselves. Disliking people for no reason is wrong and they don't want to think of themselves badly, therefore there's simply \"something\" about gays that makes it ok to marginalize them. The key to maintaining this mental defense is to not be exposed to too much input that says being gay is just fine. And of course if the government allows gays to get married that's a big old indication that there's nothing wrong with being gay. It puts gay families on the same footing as straight families, it says that gays aren't second class citizens. Such an obvious and visible stamp of acceptance makes it very difficult to maintain the illusion that their dislike has some external, socially acceptable source. They have to take responsibility for their feelings, and given the negative nature of their feelings they would really rather not do that. Thus, their strident opposition to any official pronouncement that being gay is ok.", 
   {}, 
   268807, 
   null, 
   1181922000.0
  ], 
  [
   269070, 
   null, 
   "lesz", 
   "Nice commentary on the approval of gay marriages by the Massachusetts legislature by Andrew Sullivan, the conservative whom conservative homophobes love to hate:\n \n The Unlikely Triumph Of Marriage Equality\n \n \nYes, we have much more to do. Yes, we still have to win over those who see our loves as somehow destructive of the families we seek merely to affirm. Yes, we don't have federal recognition of our basic civic equality. Yes, in many, many states, we have been locked out of equality for a generation, because of the politics of fear and backlash. But look how far we've come. From a viral holocaust to full equality - somewhere in America, in the commonwealth where American freedom was born. In two decades. This is history. What a privilege to have witnessed it.\n \n It was driven above all by ordinary gay and lesbian couples and their families - not activists, not lobbyists, not intellectuals. Couples and their families. It was driven by a brutal, sudden realization that we were far more vulnerable than we knew. In the plague years, husbands reeled as they were denied access to their own spouses in hospitals, as they were evicted from their shared homes in the immediate aftermath of terrible grief, and refused access even to funerals by estranged and often hostile in-laws. This day is for them, for all those who were abused and maligned and cast aside because they loved another human being. It's also for all the lesbian mothers who realized in the last two decades just how much contempt and hatred existed for their care of their own children, who lived in constant insecurity, or who, at best, had to endure erasure from visibility. It's for gay families in Virginia today, denied dignity and protection multiple times over, enduring popular votes of meretricious contempt, and carrying on regardless, living their lives, building their relationships, cherishing their homes, caring for their kids, honoring their parents. And it's for the countless, countless gay couples throughout human history - who for so long had to live lives in which their deepest longings and loves were denied, crushed, ignored or threatened.\n \n The media didn't much notice yesterday. But America changed. The world changed. And an ancient and deep wound began, ever so slightly, to heal.\n\n \n The decision by the Mass. legislature is a blow for human decency. There is no decency in bigotry.", 
   {}, 
   268845, 
   null, 
   1182018420.0
  ], 
  [
   269081, 
   null, 
   "jyoshu", 
   "Given all the factors here, I think this is the right outcome. Govt. shouldn't be imposing itself on groups via amendments to begin with--that goes against everything we're supposed to be in this country, as a constitutional republic democracy. Those who wanted this outcome, naturally, are portraying this event as much more far-reaching than it really is--as Sullivan put it (so longingly), \"America changed. The world changed.\" Well, no, not really. On the other hand, it's ridiculous for its opponents to be sick over it too--marriage as an institution is not going to fall apart, the sky is not going to fall, and civilization will not come to some screeching halt. In reality, the effects will be somewhere in the middle of all that: Massachusetts will continue being the state calling gay unions a 'marriage', at least for 4 more years. The sky will not fall as some people who oppose gay marriage say, and straight marriages will be unharmed. Gay lobbyist partisans will continue generalizing and using their favorite word, calling religious people \"bigots\", trying to pretend they aren't prejudiced themselves. And unfortunately, real bigots out there will still attack gays, though thank goodness such attacks are getting less and less over time. Life goes on. This is a good outcome, because the legislature has been allowed to play their role rather than just the judicial branch, and let's face it: it's excessive to legislate against a group of people like gays or anyone else. Govt. needs to be LESS intrusive, not more.", 
   {}, 
   269070, 
   null, 
   1182021900.0
  ], 
  [
   269087, 
   null, 
   "lesz", 
   "Those who wanted this outcome, naturally, are portraying this event as much more far-reaching than it really is--as Sullivan put it (so longingly), \"America changed. The world changed.\" Well, no, not really.\n\n \n You wish. But however much I disagree with Sullivan on many political issues, he's right about that. The world did change when the Mass. legislature ratified a court decision for equal rights. It may be a big change in a small state, but it is a recognition that the winds of change are blowing against homophobic bigotry. You are just going to have to get over it.\n \n The world just isn't as anti-gay as it used to be. And that means that you are going to have to accept equal rights eventually, as gay marriage. Presumably you will hope than in a few years, bigots in Massachusetts will find enough votes to overturn equality. I think you'll be out of luck.", 
   {}, 
   269081, 
   null, 
   1182023580.0
  ], 
  [
   269089, 
   null, 
   "jyoshu", 
   "You wish.\n\n \n You wish that I wish. emoticon_xangel \n \n \nBut however much I disagree with Sullivan on many political issues, he's right about that. The world did change when the Mass. legislature ratified a court decision for equal rights. It may be a big change in a small state, but it is a recognition that the winds of change are blowing against homophobic bigotry. You are just going to have to get over it.\n\n \n Do you just like to argue for the sake of being argumentative? You've picked out the one single thing I said there that you could disagree with and are making an issue of it, not even willing to agree on anything else I said. But fine, go ahead and think this is some world-changing event if it makes you feel better.\n \n \nPresumably you will hope than in a few years, bigots in Massachusetts will find enough votes to overturn equality.\n\n \n Well, clearly you didn't even read my post. (shrug)", 
   {}, 
   269087, 
   null, 
   1182024000.0
  ], 
  [
   269091, 
   null, 
   "lesz", 
   "Well, clearly you didn't even read my post. (shrug)\n\n \n You have often posted here that you oppose gay marriage. That means you oppose equal rights for gays. If you have changed your mind, and hope that Massachusetts doesn't overturn gay marriage, you would have said so. Since you didn't, you don't.", 
   {}, 
   269089, 
   null, 
   1182024240.0
  ], 
  [
   269093, 
   null, 
   "jyoshu", 
   "You have often posted here that you oppose gay marriage. That means you oppose equal rights for gays. If you have changed your mind, and hope that Massachusetts doesn't overturn gay marriage, you would have said so. Since you didn't, you don't.\n\n \n No, you said you I \"will hope than in a few years, bigots in Massachusetts will find enough votes to overturn equality\". I had said, very plainly, that I think such legislation is an over-intrusion by the government. Clearly you didn't read my post.", 
   {}, 
   269091, 
   null, 
   1182025260.0
  ], 
  [
   269098, 
   null, 
   "lesz", 
   "No, you said you I \"will hope than in a few years, bigots in Massachusetts will find enough votes to overturn equality\". I had said, very plainly, that I think such legislation is an over-intrusion by the government. Clearly you didn't read my post.\n\n \n Are you claiming now you are in favour of legal marriage for gays in Massachusetts now the legislature has voted for it? Because if so, that would be a change.", 
   {}, 
   269093, 
   null, 
   1182030660.0
  ], 
  [
   269132, 
   null, 
   "jyoshu", 
   "Are you claiming now you are in favour of legal marriage for gays in Massachusetts now the legislature has voted for it? Because if so, that would be a change.\n\n \n I'm saying that I would not want an amendment put in place banning it, because that would be an over-intrusion into peoples' lives by the government. So naturally, I wouldn't want such an amendment voted into creation, either, and that's why I took issue with your claim that I would. That's been my position here for as long as I remember. And it's a true conservative position (as opposed to neocon), BTW.", 
   {}, 
   269098, 
   null, 
   1182048420.0
  ], 
  [
   269134, 
   null, 
   "Kronus", 
   "No, you said you I \"will hope than in a few years, bigots in Massachusetts will find enough votes to overturn equality\". I had said, very plainly, that I think such legislation is an over-intrusion by the government. Clearly you didn't read my post.\n\n \n What is happening here is that she's read all your posts. You have opposed gay marriage very strongly, in numerous posts. The fact that in one post you now defend non-intrusive government doesn't erase that fact. You oppose gay marriage, and like it or not marriage is defined by the government. As much as you would like to tout your small government credentials, the facts remain that the only way to stop gay marriage is via the government. Since we have no reason to believe that you now support gay marriage we can only assume that you would still like to see it outlawed in Massachusetts, no matter how distateful you might pretend to find the process by which it would happen. If you would like to publically repudiate your previous stance and state that the government should allow all gays everywhere to get married, in the interests of being less intrusive, then that would be a very different, and quite welcome, matter. But, given your history, it would need to be a very clear statement, without your usual caveats and disclaimers, if it were to be taken seriously.", 
   {}, 
   269093, 
   null, 
   1182048960.0
  ], 
  [
   269137, 
   null, 
   "jyoshu", 
   "What is happening here is that she's read all your posts. You have opposed gay marriage very strongly, in numerous posts. The fact that in one post you now defend non-intrusive government doesn't erase that fact. You oppose gay marriage\n\n \n Yes, from a personal moral standpoint I certainly do. I think I've made it clear that I am, from the get-go, as you point out. That's not the same as saying I'd approve of an amendment banning it. I've been against that all along, and have said so in other posts. So naturally, I wouldn't want such an amendment voted into place, which is what I was taking issue with Lesz on. There's a huge difference between opposing something philosophically and the belief it should be imposed.\n \n \nBut, given your history, it would need to be a very clear statement, without your usual caveats and disclaimers, if it were to be taken seriously.\n\n \n Frankly, given your history here, I could care less whether you take it seriously or not.", 
   {}, 
   269134, 
   null, 
   1182049620.0
  ], 
  [
   269165, 
   null, 
   "Unriggable", 
   "I think that if we have to vote n gay marriage, we should also vote on straight marriage.", 
   {}, 
   269137, 
   null, 
   1182055800.0
  ], 
  [
   269220, 
   null, 
   "Matthew S", 
   "I think that if we have to vote n gay marriage, we should also vote on straight marriage.\n\n \n That has been my point. I am at a point that I want to pick someone at random and go to court and get their marriage anulled. If they have the right to vote on my marriage then I want the right to say where or not they stay married.", 
   {}, 
   269165, 
   null, 
   1182086700.0
  ], 
  [
   269222, 
   null, 
   "Kronus", 
   "Yes, from a personal moral standpoint I certainly do. I think I've made it clear that I am, from the get-go, as you point out. That's not the same as saying I'd approve of an amendment banning it. I've been against that all along, and have said so in other posts. \n\n \n I have never seen you once speak out against this amendment or any other amendment that would restrict marriage to mixed gendered couples. You have in fact called such amendments the will of the people, and backed the people's so called \"right to vote\". Can you show me a single instance where you say anything bad about said amendments?", 
   {}, 
   269137, 
   null, 
   1182087240.0
  ], 
  [
   269281, 
   null, 
   "jyoshu", 
   "I have never seen you once speak out against this amendment or any other amendment that would restrict marriage to mixed gendered couples. \n \n Can you show me a single instance where you say anything bad about said amendments?\n\n \n I can show you several examples of posts where I've said I would not support such amendments, and was against them. My position on amendments banning gay marriage has been consistent. \n \n \"I'm against the amendment\" (http://www.4forums.com/political/215857-post39.html)\n \n \n \"He seems to be talking about overall effect on society and traditional family. But I'm still against the amendment; amending the constitution over something like this is just not the right thing to do.\" (http://www.4forums.com/political/215758-post5.html)\n \n \n \"That's why conservatives have, at times, sought to clarify the law in ALL cases with an amendment saying marriage is between one man and one woman (because there are some loopholes). While I don't think that is necessary\" (http://www.4forums.com/political/261139-post48.html)\n \n \n \"nor would I want it to happen in terms of an amendment\" (http://www.4forums.com/political/225592-post80.html)", 
   {}, 
   269222, 
   null, 
   1182111900.0
  ], 
  [
   269282, 
   null, 
   "lesz", 
   "I'm saying that I would not want an amendment put in place banning it, because that would be an over-intrusion into peoples' lives by the government. So naturally, I wouldn't want such an amendment voted into creation, either, and that's why I took issue with your claim that I would. That's been my position here for as long as I remember. And it's a true conservative position (as opposed to neocon), BTW.\n\n \n Are you saying that you are not in favour of a government ban on gay marriage? You oppose DOMA laws? Does that mean you are now, contrary to your previous posts, in favour of legal recognition of gay marriage?\n \n emoticon_confused", 
   {}, 
   269132, 
   null, 
   1182112020.0
  ], 
  [
   269283, 
   null, 
   "lesz", 
   "Oh. He's only against constitutional amendments, not against laws banning gay marriage.\n \n No progress there, after all. He's still anti-gay equality.", 
   {}, 
   269282, 
   null, 
   1182112200.0
  ], 
  [
   269285, 
   null, 
   "jyoshu", 
   "Oh. He's only against constitutional amendments, not against laws banning gay marriage.\n\n \n Constitutional amendments ARE laws. But no, you are wrong, I wouldn't support a law specifically 'banning' gay marriage either. My view is that gays are the ones who should be pushing to change the law to include them if they want it changed. That would be the way to follow precedent (for the most part) in this country in terms of giving rights. (e.g. the Civil Rights Act, Voting Rights Act, 19th amendment, etc.)", 
   {}, 
   269283, 
   null, 
   1182112560.0
  ], 
  [
   269287, 
   null, 
   "lesz", 
   "Constitutional amendments ARE laws. But no, you are wrong, I wouldn't support a law specifically 'banning' gay marriage either. My view is that gays are the ones who should be pushing to change the law to include them if they want it changed. That would be the way to follow precedent (for the most part) in this country in terms of giving rights. (e.g. the Civil Rights Act)\n\n \n We are. You oppose the change.", 
   {}, 
   269285, 
   null, 
   1182112680.0
  ], 
  [
   269288, 
   null, 
   "jyoshu", 
   "We are. You oppose the change.\n\n \n You're pushing for an amendment and laws specifying legal gay marriage? Examples and cases?", 
   {}, 
   269287, 
   null, 
   1182112800.0
  ], 
  [
   269289, 
   null, 
   "lesz", 
   "You're pushing for an amendment and laws specifying legal gay marriage? Examples and cases?\n\n \n Of course we are seeking changes in laws banning or failing to recognise gay marriage, and supporting laws extending recognition to gay marriages. What other laws would be relevant?\n \n emoticon_confused", 
   {}, 
   269288, 
   null, 
   1182112980.0
  ], 
  [
   269292, 
   null, 
   "jyoshu", 
   "Of course we are seeking changes in laws banning or failing to recognise gay marriage, and supporting laws extending recognition to gay marriages. What other laws would be relevant?\n\n \n Translation: you can't come up with any examples of amendments and/or laws being pushed for that would guarantee the rights you seek.", 
   {}, 
   269289, 
   null, 
   1182113280.0
  ], 
  [
   269293, 
   null, 
   "lesz", 
   "Translation: you can't come up with any examples of amendments and/or laws being pushed for that would guarantee the rights you seek.\n\n \n Sweetums, check local states. In California, New Jersey, Connecticut and elsewhere, laws recognising gay marriage have been proposed in legislatures. They don't usually get anywhere because of religious bigotry against gay people. But Vermont and Connecticut passed civil union laws. Eventually, they and other states will pass gay marriage laws. Massachusetts just voted to deny abolition of gay marriage, which is pretty much acceptance of the status quo.\n \n We don't have a single strategy here, you know. Some activists propose revision of laws through legislatures, others seek to overturn anti-constitutional laws through judicial review. Depends on who and where they are. Both are perfectly legitimate ways of seeking redress for injury.\n \n One of the functions of courts, whether you like it or not, is to address the constitutionality of laws. Deal with it.", 
   {}, 
   269292, 
   null, 
   1182114420.0
  ], 
  [
   269302, 
   null, 
   "lesz", 
   "You're pushing for an amendment and laws specifying legal gay marriage? Examples and cases?\n\n \n I don't usually do research for the terminally lazy, but since you insist on at least one example, I'll give you one from the list I mentioned earlier:\n \n \n California Legislature Approves Gay Marriage\n SACRAMENTO, Sept. 6 -- The California Assembly voted Tuesday to allow gay and lesbian couples to marry, making the state's legislature the first in the nation to deliberately approve same-sex marriages and handing a political hot potato to an already beleaguered Gov. Arnold Schwarzenegger (R).\n \n After a vehement floor debate in which legislators quoted the Pledge of Allegiance and accused each other of abusing moral principles, the state Assembly passed the Religious Freedom and Civil Marriage Protection Act, which recasts the definition of marriage as between \"two persons,\" not between a man and a woman. The state Senate passed the bill last week.\n \n \"There are moments in the history of any movement when the corner is turned,\" said Geoff Kors, the executive director of Equality California, a gay rights group. \"This is it. This is the tipping point.\"\n Hmmmm... seems that as usual, you don't have your facts right before sticking your neck in the noose. Hoist by your own petard again. Of course, the GOP Governator of California vetoed this legislation, but don't pretend that we aren't going the legislative route as well.\n \n We support justice and equal rights; you and the GOP you support favour prejudicial discrimination against gay Americans.", 
   {}, 
   269288, 
   null, 
   1182116880.0
  ], 
  [
   269306, 
   null, 
   "jyoshu", 
   "I don't usually do research for the terminally lazy\n\n \n \"terminally lazy\"? Where the heck did that come from? Lesz, seriously, why the heck are you so irascible and hostile? What reason have I given you to make you think I'm \"terminally lazy\"? I can think of no good reason for someone to throw something like that into discussion.\n \n \nbut since you insist on at least one example, I'll give you one from the list I mentioned \n \n California Legislature Approves Gay Marriage\n \n the Religious Freedom and Civil Marriage Protection Act\n\n \n Thank you; I asked for an example for you to back up your statements, and you provided one. Fair enough; at least CA is following some precedent in the way they're going about doing this. \n \n \nyou and the GOP you support\n\n \n I just told you I don't support the GOP.", 
   {}, 
   269302, 
   null, 
   1182118380.0
  ], 
  [
   269324, 
   null, 
   "foundit66", 
   "Translation: you can't come up with any examples of amendments and/or laws being pushed for that would guarantee the rights you seek.\n\n \n emoticon_xdonno \n http://www.365gay.com/newscon05/09/090605calAss.htm\n \n And for the record, it's amusing to note how you phrase that.\n \"guarantee the rights you seek\".\n \n The CONSTITUTION is there to \"guarantee rights\".\n Are you now admitting that gay marriage is a right?", 
   {}, 
   269292, 
   null, 
   1182131880.0
  ], 
  [
   269336, 
   null, 
   "Nwarth", 
   ":\n The CONSTITUTION is there to \"guarantee rights\".\n Are you now admitting that gay marriage is a right?\n\n \n Life, liberty, and the pursuit of happiness mean anything? [ignore poor logic here, but I think there is something to be said about this statement from a gut level, so i'll just say it.]", 
   {}, 
   269324, 
   null, 
   1182134340.0
  ], 
  [
   269338, 
   null, 
   "Kronus", 
   "I can show you several examples of posts where I've said I would not support such amendments, and was against them. My position on amendments banning gay marriage has been consistent. \n\n \n I stand corrected.", 
   {}, 
   269281, 
   null, 
   1182134760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Marriage rights in MA are secure", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10009-marriage-rights-ma-secure.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10009, 
  "discussion_files": [
   [
    "14675.html", 
    "http://www.4forums.com/political/gay-rights-debates/10009-marriage-rights-ma-secure-print.html"
   ], 
   [
    "14676.html", 
    "http://www.4forums.com/political/gay-rights-debates/10009-marriage-rights-ma-secure-3-print.html"
   ], 
   [
    "14677.html", 
    "http://www.4forums.com/political/gay-rights-debates/10009-marriage-rights-ma-secure-2-print.html"
   ]
  ], 
  "identifier": 10009
 }
]