[
 [
  [
   268851, 
   null, 
   "wascallywabbit", 
   "**\n \n FYI--\n \n \"Landmark Study Prompts DNA Rethink\n Richard Ingham, AFP \n \n June 14, 2007 - The most detailed probe yet into the workings of the human genome has led scientists to conclude that a cornerstone concept about the chemical code for life is badly flawed. \n \n The ground-breaking study, published in more than two dozen papers in journals on both sides of the Atlantic, takes a small percentage of the genome to pieces to draw up a \"parts list,\" identifying the biological role of every component. \n \n For the international team of investigators, the four-year project was the computer-equivalent of passing a fine-toothed comb through a mountain of raw data.\n \n Reporting in the British journal Nature and the U.S. journal Genome Research on Thursday, they suggest that an established theory about the genome should be consigned to history.\n \n Under this view, the genome is rather like a ribbon studded with some 22,000 \"nuggets\" in the form of genes, which make proteins, the essential stuff of life. \n \n Genes - deemed so valuable that some discoverers of them have been prompted to file patents over them for commercial gain - amount to only around a twentieth, or even less, of the genetic code.\n \n In between the genes and the sequences known to regulate their activity are long, tedious stretches that appear to do nothing. The term for them is \"junk\" DNA, reflecting the presumption that they are merely driftwood from our evolutionary past and have no biological function. \n \n But the work by the ENCODE (ENCyclopaedia of DNA Elements) consortium implies that this nuggets-and-dross concept of DNA should be, well, junked.\n \n The genome turns out to a highly complex, interwoven machine with very few inactive stretches, the researchers report. \n \n Genes, it transpires, are just one of many types of DNA sequences that have a functional role.\n \n And \"junk\" DNA turns out to have an essential role in regulating the protein-making business.\n \n Previously written off as silent, it emerges as a singer with its own discreet voice, part of a vast, interacting molecular choir.\n \n \"The majority of the genome is copied, or transcribed, into RNA, which is the active molecule in our cells, relaying information from the archival DNA to the cellular machinery,\" said Tim Hubbard of the Wellcome Trust Sanger Institute, a British research group that was part of the team. \n \n \"This is a remarkable finding, since most prior research suggested only a fraction of the genome was transcribed.\"\n \n Francis Collins, director of the U.S. National Human Genome Research Institute (NHGRI), which coralled 35 scientific groups from around the world into the ENCODE project, said the scientific community \"will need to rethink some long-held views about what genes are and what they do.\" \n \n \"(...) This could have significant implications for efforts to identify the DNA sequences involved in many human diseases,\" he said.\n \n Another rethink is in offing about how the genome has evolved, said Collins. \n \n Until now, researchers had thought that the pressure to survive would relentlessly sculpt the human genome, leaving it with a slim, efficient core of genes that are essential for biological function. \n \n But the ENCODE consortium were surprised to find that the genome appears to be stuffed with functional elements that offer no identifiable benefits in terms of survival or reproduction. \n \n The researchers speculate that there is a point behind this survival of the evolutionary cull. Humans could share with other animals a large pool of functional elements - a \"warehouse\" stuffed with a variety of tools on which each species can draw, enabling it to adapt according to its environmental niche. \n \n The ENCODE endeavour flows from the Human Genome Project, which concluded in April 2003 with the publication of a polished draft of the human genetic code. \n \n But having the draft is not the same as knowing what is in it or how it works. \n \n And this is essential for unlocking knowledge about our evolutionary odyssey, just as it is needed for engineering new treatments for inherited disease. \n \n The collaborative study focussed on 44 strategically chosen targets which together account for about one percent of the genome, or about 30 million of the three billion \"rungs\" in the DNA double-helix ladder. \n \n The data is being placed in the public domain to help medical and other research. \n \n http://dsc.discovery.com/news/2007/06/14/genetics_hea.html", 
   {
    "post_info": {
     "post_title": "Darwinism/geneticism takes another shot to the head."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1181926980.0
  ], 
  [
   268857, 
   null, 
   "Symbiote", 
   "You don't actually read the things you post, do you?", 
   {}, 
   268851, 
   null, 
   1181931360.0
  ], 
  [
   268863, 
   null, 
   "chemist99a", 
   "Wow BIOLOGISTS have been working on strteches of DNA of previously unknown function and found what they went looking for - function. That sure knocks genetics and evolution off its feet. Yep no question about it at all. Darwin will be trashed when junk DNA is explained, all his predictions about junk DNA being functionless will be falsified. Oh, oh wait a second. Darwins theory and the NDS make zero predictions about \"junk\" DNA! Guess that if one has nothing to falsify then falsification is pretty unlikely. :xbanghead", 
   {}, 
   268857, 
   null, 
   1181931900.0
  ], 
  [
   268871, 
   null, 
   "lesz", 
   "Board should be retitled: Bugs Shoots Self in Foot Again.\n \n So geneticists don't yet understand everything there is to know about how the genome works to make an organism. So there are new discoveries to be made about how genomes work.\n \n This disproves Darwinian theory... how? On that, our loquacious lagomorph is curiously silent. \"Oh,\" he says, \"geneticists were wrong about one thing, therefore they were wrong about everything!\"\n \n Lagomorphs should stick to munching lettuce.", 
   {}, 
   268863, 
   null, 
   1181932800.0
  ], 
  [
   268880, 
   null, 
   "chemist99a", 
   "Carrots for the cartoon lagomorphs, surely our resident bunny does not qualify as the genuine article.", 
   {}, 
   268871, 
   null, 
   1181934960.0
  ], 
  [
   268884, 
   null, 
   "Klown", 
   "Do you read what you copy and paste?\n \n There is nothing against Darwinism or Geneticism in there...", 
   {}, 
   268880, 
   null, 
   1181935680.0
  ], 
  [
   268902, 
   null, 
   "wascallywabbit", 
   "**\n \n For you idologues who understand nothing of what you read, the OP article says nothing against evolution, but blows the stupid notion that evolution is driven by random, genetic mutation sorted out by the fanciful, and meaningless, \"Natural Selection\", right out of the water. It really amazes me how quick you guys are to make fools of yourselves. Have you no pride in yourselves, [arrogant egotism and misplaced conceit notwithstanding], or dignity?!?", 
   {}, 
   268884, 
   null, 
   1181940720.0
  ], 
  [
   268927, 
   null, 
   "chemist99a", 
   "**\n \n For you idologues who understand nothing of what you read, the OP article says nothing against evolution, but blows the stupid notion that evolution is driven by random, genetic mutation sorted out by the fanciful, and meaningless, \"Natural Selection\", right out of the water. It really amazes me how quick you guys are to make fools of yourselves. Have you no pride in yourselves, [arrogant egotism and misplaced conceit notwithstanding], or dignity?!?\n\n \n It does no such thing and the authors of all those papers would disagree with you. Your interpretation is to say the least idiotsyncratic.", 
   {}, 
   268902, 
   null, 
   1181944620.0
  ], 
  [
   268928, 
   null, 
   "Hi_Its_Me", 
   "Board should be retitled: Bugs Shoots Self in Foot Again.\n\n He's going to accumulate a record-breaking amount of lead in his body pretty soon.", 
   {}, 
   268902, 
   null, 
   1181944680.0
  ], 
  [
   268973, 
   null, 
   "Unriggable", 
   "He's going to accumulate a record-breaking amount of lead in his body pretty soon.\n\n \n http://www.alexross.com/CJ0081.jpg", 
   {}, 
   268928, 
   null, 
   1181958480.0
  ], 
  [
   268992, 
   null, 
   "chemist99a", 
   "And lead is not very good for wabbit branes is it?", 
   {}, 
   268973, 
   null, 
   1181966640.0
  ], 
  [
   268997, 
   null, 
   "wascallywabbit", 
   "**\n \n \n Congrats on this very active \"Support Group for Losers\" you guys have put together. I'm sure all the group hugs will help lessen the terrible anxiety attacks you've been suffering lately, thanks to me. \n Ah, well, girls, if you can't shop, malicious snickering will have to do, won't it?", 
   {}, 
   268992, 
   null, 
   1181968500.0
  ], 
  [
   269001, 
   null, 
   "Demon38", 
   "For you idologues who understand nothing of what you read, the OP article says nothing against evolution, but blows the stupid notion that evolution is driven by random, genetic mutation sorted out by the fanciful, and meaningless, \"Natural Selection\", right out of the water.\n \n Then explain it to us ( and the researchers who conducted the study!) because it sure doesn't look like this research does anything to disprove random mutation and natural selection. So put up or shut up.........", 
   {}, 
   268997, 
   null, 
   1181970720.0
  ], 
  [
   269004, 
   null, 
   "chemist99a", 
   "**\n \n \n Congrats on this very active \"Support Group for Losers\" you guys have put together. I'm sure all the group hugs will help lessen the terrible anxiety attacks you've been suffering lately, thanks to me. \n Ah, well, girls, if you can't shop, malicious snickering will have to do, won't it?\n\n \n Cannot be helped. You make it far too easy. But do not think of yourself as a loser, think of yourself as a student with significant learning deficets.", 
   {}, 
   268997, 
   null, 
   1181973120.0
  ], 
  [
   269048, 
   null, 
   "wascallywabbit", 
   "**\n \n Follow up to OP--\n \n Excerpt--\n \n \"Susan Celniker emphasizes that transposable elements, of which 96 families have been found in Drosophila so far, \"can be very dangerous. They are viruses - literally.\" She points out that during subsequent sequencing efforts, DNA was made three times from the same strain of flies - in 1990, 1998, and 1999 - and that new patterns of transposons were found in each. \"We can see intact transposons moving from one position to the next.\" \n \n \n [interjection]\n I have maintained the opinion for a long time that 'viruses' are genetic artefacts that escaped the control of the organisms who originally generated them, probably wiping out those organisms, and have since operated freely as chemical machinery run amok, not as live organisms per se. Good to see another of my hypotheses being vindicated by someone actually in the business.[/interjection]\n \n Excerpt-\n \n \"Smith uses the metaphor of dark matter to suggest the significance of heterochromatin. \"We don't know what holds the galaxies together, and the same is true of the genome. We're pretty good at understanding how individual genes work, but we don't understand, for example, how the large-scale structure of genomes affects cellular processes. We hear too much about the 'post-genomic era' - it's underappreciated that we don't understand the genome yet.\" \n \n [interjection]\n Finally an admission!! That the genomic system is greater than the sum of its parts, and that the notion that any simple accidental mutation could generate an increase in systemic productivity by and of itself alone, is garbage. Bye Bye, RMNS.[/interjection]\n \n Excerpt--\n \"Karpen notes that one intensively studied and puzzling problem in chromosome biology will benefit enormously from the new findings: epigenetics - the inheritance of traits and genetic information as controlled by proteins associated with the chromosomes, rather than by DNA sequence. Starting in the 1920s, epigenetics was discovered through biological studies of heterochromatin, and is now known to regulate essential functions such as those of the centromeres. The heterochromatin sequence of Drosophila will provide an essential foundation for identifying the proteins and components involved in epigenetic inheritance, as well as other mysteries surrounding the genome's \"dark matter.\" \"\n \n [interjection]\n \n RMNS dies. Long live EAM as evolution's mechanism.\n \n Citations taken from--\n \n http://tech.groups.yahoo.com/group/evolutionary-psychology/message/54906", 
   {
    "unicode_changes_made": true
   }, 
   269004, 
   null, 
   1182012780.0
  ], 
  [
   269053, 
   null, 
   "lesz", 
   "RMNS dies. Long live EAM as evolution's mechanism.\n\n \n I have no idea what \"EAM\" is supposed to be, but the lagomorph's unthinking assumption this disproves Darwinian theory, or even random mutation which Darwinian theory does NOT depend on, is a pile of wabbit pellets.\n \n But then, lagomorphs are well known for their habit of coprophagy.", 
   {}, 
   269048, 
   null, 
   1182014220.0
  ], 
  [
   269056, 
   null, 
   "T.Q", 
   "Are you honestly this delusional?\n \n \n[interjection]\n I have maintained the opinion for a long time that 'viruses' are genetic artefacts that escaped the control of the organisms who originally generated them, probably wiping out those organisms, and have since operated freely as chemical machinery run amok, not as live organisms per se. Good to see another of my hypotheses being vindicated by someone actually in the business.[/interjection]\n\n How does this support what you're saying? No where in there do they say \"transposons turn into viruses\", or even hint at it. It's speculated that transposons and viruses share a common ancestor, but that doesn't mean that transposons become viruses as you're stating here (and where you got that idea from in the quoted passage, I have no idea).\n \n \n[interjection]\n Finally an admission!! That the genomic system is greater than the sum of its parts, and that the notion that any simple accidental mutation could generate an increase in systemic productivity by and of itself alone, is garbage. Bye Bye, RMNS.[/interjection]\n\n Jesus! Nobody ever said that the genome was not \"greater than the sum of it's parts\". That's your little straw man that you've been whaling away at for the last 6 months, remember? We \"materialist, \"bits of stuff\" boneheads\" know that in order to understand a complex system (like the genome, or, oh, cosmology, LIKE THEY SAID RIGHT ABOVE, you have to study the parts that make up the whole because the whole is too complex to study in and of itself. You must first understand the parts of the whole (the \"bits of stuff\" as you put it). Or do you think cosmologists (again, USING THE EXAMPLE ABOVE!), look at the entire universe as a whole, and that's how they study it? No, of course not (not if you're even a little bit rational you don't)\n \n So of course, this in no way even hints that \"any simple accidental mutation could generate an increase in systemic productivity by and of itself alone, is garbage.\" And, \"Bye Bye, RMNS\"? Not even close.\n Where do you get these ideas from? I mean, you must read this before you post it, don't you?\n \n \n[interjection]\n \n RMNS dies. Long live EAM as evolution's mechanism.\n\n And again, doesn't say anything close to what you think it says.\n \n You know how you like laughing at the fundies (which you insist us \"Darwinist materialists\" are as well)? I hate to break it to you, but you show all the characteristics of a fundy: Quote mining, ignorance of evidence (show them the evidence, it's ignored, and they keep demanding the evidence-see recent SS posts for this), inability to read for comprehension, inability to understand evidence-this is your most common. No matter what article you read, it's evidence for EAM (which you have never yet defined in any useable way, explained in and straightforward manner, or laid out any evidence for whatsoever that didn't come back to RMNS=bad!). So you post your articles, we read them, wonder why you posted them when they so perfectly show how the ToE seems to work so well, and you wonder why you get ridiculed when you post with your pompous airs, when even a layman like me can see that you're completely off base.\n \n Keep it up little guy! You can do it!", 
   {}, 
   269048, 
   null, 
   1182014880.0
  ], 
  [
   269072, 
   null, 
   "chemist99a", 
   "Simply more Wabbit pellets. WW needs a diaper.", 
   {}, 
   269056, 
   null, 
   1182018660.0
  ], 
  [
   269080, 
   null, 
   "wascallywabbit", 
   "Are you honestly this delusional?\n \n \n How does this support what you're saying? No where in there do they say \"transposons turn into viruses\", or even hint at it.\n\n \n **\n No, they do not say that transposable elements [transposons] \"turn into\" viruses. What they do say, as quoted and here repeated with my emphasis added so that you don't miss it again, is this--\"Susan Celniker emphasizes that transposable elements, of which 96 families have been found in Drosophila so far, \"can be very dangerous. They _are_ viruses - literally.\n \n \n \n\n It's speculated that transposons and viruses share a common ancestor, but that doesn't mean that transposons become viruses as you're stating here (and where you got that idea from in the quoted passage, I have no idea).\n\n \n **\n Where you get this notion, of transposons 'turning into viruses', I have no idea, but it wasn't from this paper.\n \n \n\n Jesus! Nobody ever said that the genome was not \"greater than the sum of it's parts\". \n\n \n **\n Yes, you have. Consistently, ever since, and indeed long prior to, the invention of the silly notion that evolution proceeded according to the fiddling of a 'blindwatchmaker' following the dictates of a 'selfish gene', as summed up in the pseudo-scientific bumper-sticker, \"Evolution by NS and RM\". RM is ridiculous if the genome is greater than the sum of its parts, i.e., genes. And \"NS\" has always been ridiculous pseudoscience.\n \n \n\n That's your little straw man that you've been whaling away at for the last 6 months, remember? We \"materialist, \"bits of stuff\" boneheads\" know that in order to understand a complex system (like the genome, or, oh, cosmology, LIKE THEY SAID RIGHT ABOVE, you have to study the parts that make up the whole because the whole is too complex to study in and of itself. \n\n \n **\n Horse manure. You 'biological reductionists', \n 'point mutationists', and 'evolutionary psychologists', [i.e., you materialist/darwinist/genetic determinists], blatantly and consistently attribute the the evolution of phenotypic traits to particular genes, and not to the systemic operation of the genome; particularly not as the genome as the sub-system of the uber-system that is the organism itself. Just as you have just said. And every time youtry to back up your contention that the selfish gene over-rides not only the genome, but the organism as well, you run to micro-organisms, falsely asserting that their evolution is in the point mutations of single cells, when in fact it lies in the development, including genomic developmnent, of the eusocial colony as a single organism. Or even the eusocial species as a single, wholistic organism.\n \n \n\n You must first understand the parts of the whole (the \"bits of stuff\" as you put it).\n\n \n **\n No-one here, in the article, nor myself, is saying that it is not 'a good thing' to know what the parts, the 'bits of stuff', found in a complex productive system are, and to describe how they interact with one another. That'\n s just your strawman. But there is nothing to 'understand' about 'bits of stuff'. They simply are what they are, even if they are called, 'genes'. And how they they interact, with themselves gathered in a complex, productive subsystem, called a 'genome', or as parts of a greater productive complex of complex productive systems called an organism, simply cannot be 'understood' reductively, your assertions notwithstanding. IOW, the point, purpose, and place of any part or parts in any complex productive system cannot be understood until the productive ends of the system as whole are first understood. For example, your own automobile.\n \n Once again, your understanding of reality is dead wrong.\n \n \n\n Or do you think cosmologists (again, USING THE EXAMPLE ABOVE!), look at the entire universe as a whole, and that's how they study it? No, of course not (not if you're even a little bit rational you don't)\n\n \n **\n And do you think that astronomers and cosmologists think that understanding the universe starts with understanding one moon, planet, star, constellation, at a time? That would be a stupid thing to do, since cosmology begins with the universe as a whole, with a given understanding of the universe as a whole, before it begins to concern itself with the place and operation of individual parts within that whole. We first examined 'the starry, starry night', before we focused on polaris, venus, mars, the moon, and the rest of the parts to which it has been subsequently reduced. You people start with a materialist cosmological principle, the creationists start with a different cosmological principle, and I start with one that is different still.\n \n \n\n So of course, this in no way even hints that \"any simple accidental mutation could generate an increase in systemic productivity by and of itself alone, is garbage.\" And, \"Bye Bye, RMNS\"? Not even close.\n Where do you get these ideas from? I mean, you must read this before you post it, don't you?\n\n \n \n **\n Well, unlike you, I not ony perceive the written words, I actually comprehend their meaning, and take time to think about their implications. But who am I to expect you, and other darwinists, to that, since it is clearly more than your intellects can handle.\n \n \n\n And again, doesn't say anything close to what you think it says.\n\n \n **\n Sez u. But wadda you know? Nothing I've ever seen.\n \n \n\n You know how you like laughing at the fundies (which you insist us \"Darwinist materialists\" are as well)? I hate to break it to you, but you show all the characteristics of a fundy: Quote mining, ignorance of evidence (show them the evidence, it's ignored, and they keep demanding the evidence-see recent SS posts for this), inability to read for comprehension, inability to understand evidence-this is your most common.\n\n \n **\n Telling unfounded lies about someone, [in this case, me], is malice and spite, not argument.\n \n \n\n No matter what article you read, it's evidence for EAM (which you have never yet defined in any useable way, explained in and straightforward manner, or laid out any evidence for whatsoever that didn't come back to RMNS=bad!). \n\n \n **\n Been there, done that. You just dismiss what I say, gainsay the hypothesis, and pretend that I never said anything at all. Are you really trying to lie to the world again, claiming that I have never given you so much as a clue to the nature of the EAM mechanism driving evolution? Get real.\n \n If you think, [ooops, make that, 'believe'], that EAM has \"never yet defined in any useable way, explained in and straightforward manner, or laid out any evidence for whatsoever that didn't come back to RMNS=bad!).\", then quote the material of which you speak , and let me rip you up some more. I'd love it!\n \n \n\n So you post your articles, we read them, wonder why you posted them when they so perfectly show how the ToE seems to work so well, and you wonder why you get ridiculed when you post with your pompous airs, when even a layman like me can see that you're completely off base.\n\n \n **\n What \"a layman\" like you, or \"a priest\" like chem, see in my posted articles, through your horribly distorted darwinian goggles, is of no concern to me. But when, as above, you post what you have misread and/or misinterpreted, I'm always glad to show you where you make your goofy mistakes.\n \n \n\n Keep it up little guy! You can do it!\n\n \n **\n Hey, you too!! I luv all the yucks you clowns provide for my entertainment. Please don't ever stop. I'd be bored if you ever wised up to yourselves.", 
   {
    "unicode_changes_made": true
   }, 
   269056, 
   null, 
   1182021360.0
  ], 
  [
   269084, 
   null, 
   "lesz", 
   "Consistently, ever since, and indeed long prior to, the invention of the silly notion that evolution proceeded according to the fiddling of a 'blindwatchmaker' following the dictates of a 'selfish gene', as summed up in the pseudo-scientific bumper-sticker, \"Evolution by NS and RM\". RM is ridiculous if the genome is greater than the sum of its parts, i.e., genes. And \"NS\" has always been ridiculous pseudoscience.\n\n \n Inconsequential fiddle-faddle. Natural selection and random mutation are not negated by the concept that a genome is greater than the sum of its parts. \n \n Vitalists just as much as Creationists need to provide proof of concept. That they are intellectually incapable of doing so is no surprise.", 
   {}, 
   269080, 
   null, 
   1182022860.0
  ], 
  [
   269107, 
   null, 
   "chemist99a", 
   "Lets face it WW your MO is known and you are busted.", 
   {}, 
   269084, 
   null, 
   1182035580.0
  ], 
  [
   269118, 
   null, 
   "wascallywabbit", 
   "Lets face it WW your MO is known and you are busted.\n\n \n **\n That's strange, since I've never felt better. Well, OK, there is some residual soreness in my ribs, from laughing so hard and so often at all the silliness provided by your little clique.", 
   {}, 
   269107, 
   null, 
   1182039780.0
  ], 
  [
   269121, 
   null, 
   "chemist99a", 
   "**\n That's strange, since I've never felt better. Well, OK, there is some residual soreness in my ribs, from laughing so hard and so often at all the silliness provided by your little clique.\n\n Thus proving only what we already knew, you are subject to hallucinations.", 
   {}, 
   269118, 
   null, 
   1182040920.0
  ], 
  [
   269142, 
   null, 
   "wascallywabbit", 
   "Thus proving only what we already knew, you are subject to hallucinations.\n\n \n **\n Nah, it only seems like I'm hallucinating when I'm confronted with the 'Wonderland' characters of the wierd and wacky darwinist world.", 
   {}, 
   269121, 
   null, 
   1182052440.0
  ], 
  [
   269166, 
   null, 
   "chemist99a", 
   "**\n Nah, it only seems like I'm hallucinating when I'm confronted with the 'Wonderland' characters of the wierd and wacky darwinist world.\n\n \n Science is even stranger than hallucinations.", 
   {}, 
   269142, 
   null, 
   1182056340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Darwinism/geneticism takes another shot to the head.", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10013-darwinism-geneticism-takes-another-shot-head.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10013, 
  "discussion_files": [
   [
    "30902.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10013-darwinism-geneticism-takes-another-shot-head-print.html"
   ], 
   [
    "30903.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10013-darwinism-geneticism-takes-another-shot-head-2-print.html"
   ]
  ], 
  "identifier": 10013
 }
]