[
 [
  [
   269237, 
   null, 
   "supersport", 
   "I would like for the materialists here to answer a simple question for me. Do you believe there is a fundamental difference between a living thing and a non-living thing? If so, what exactly is it that makes/causes this difference? I'm guessing that you guys would say that both living and non-living entities are products of the laws of chemistry and physics, but what exactly is it that makes something alive? Is it a physical thing? If so, what? Is it a non-physical thing? If so, what? \n \n \n I asked this question at a different forum, but instead of getting answers as to what makes something alive, I got a mere laundry list of characteristics of life. For example, one person said we are alive because we have metabolism and because we are able to replicate ourselves. Another said we are alive because all living things have cells. Another said living organisms are self-stablizing and self-activating.\n \n \n But while all these are examples of characteristics of life, none of these explain what makes or causes a living organism to be different from non-life. \n \n For example: If I had a cold, I might have a runny nose, a sore throat, drainage, a cough, etc -- but these things are not the CAUSE of my cold. Likewise the things just listed (respiration, metabolic processes, cells etc) are not the cause of life -- they are merely characteristics of life. \n \n Cold symptoms are not the cause of a cold just like respiration or metabolism is not the cause of life.\n \n I noticed WW talking about an organism being aware, while rocks or sticks are not aware. And while it's true that organisms have varying degrees of awareness, this is still not a cause -- it's just another characteristic, albeit a good one.\n \n But I am looking for the underlying cause: just like a cold is caused from a virus, life must have a cause; there must be something fundamentally different about a living organism than a non-living organism.\n \n I would suggest that whatever it is that makes something or someone alive, is the same thing that sees, hears tastes, feels and senses. It's the same entity that deciphers its environment and makes intelligent decisions accordingly. \n \n Here's Yahoo's definition of life:\n \n http://education.yahoo.com/reference/dictionary/entry/life\n \n The property or quality that distinguishes living organisms from dead organisms and inanimate matter\n \n \n Ok.....so they've called life a property. Now what exactly IS this property? Is it a thing or a non-thing?\n \n \n So why is any of this important?\n \n For one thing, the whole is what interacts with the environment. Environmental cues do not work directly on parts, they work on the whole. But for this to be the case, there must be a whole entity -- or \"property\" -- of sorts lurking on the inside to accept and decipher the environmental feedback. Individual parts can't think or decide or make adjustments without being able to process information.\n \n But materialists deny that they are a whole -- they deny the entity that is themself. They deny that they -- the person who sees out the windows of their eyes -- is a non-physical entity who was created at the moment of their conception -- who's not only in control of their faculties, but also able to interact with their surroundings and make intelligent, complex decisions. They deny this because they deny they exist!\n \n But while evolutionists do not admit there is an internal \"whole\" otherwise known as \"them\" inside their bodies, the scientific evidence shows otherwise. \n \n Epigenetics and phenotypic plasticity are so destructive to ToE because they refute and disprove ToE by showing that organisms function as coherent wholes, a functional unity -- a non-physical property -- and not simply a conglomeration of independently-acting physical parts. This is why Robert Fisher, regarding phenotypic plasticity, once reported to have said that it is not surprising that such elaborate machinery should sometimes go wrong. (taken from Not By Chance by Lee Spetner.)\n \n But what this means is that since biological change stems -- not from an accidental change in parts -- but from the interaction of the property or whole, that there is no longer anything fundamental or concrete about life -- because you can't measure what you can't see or even detect! Thus, there are no building blocks or laws or equations to measure when it comes to life or change....which is ironic because that's exactly what today's science is all about -- measuring things and quantifying them. But if there's nothing fundamental or concrete about life -- including how life evolves -- it makes you wonder about the whole premise of science in regards to the study of life.\n \n It tells me that today's science -- the study of physical things -- is almost worthless.", 
   {
    "post_info": {
     "post_title": "What makes something alive?"
    }
   }, 
   null, 
   null, 
   1182099060.0
  ], 
  [
   269242, 
   null, 
   "Symbiote", 
   "No, there's no fundamental distinction, the terms are a shorthand way of referring to a host of characteristics which usually, rather than necessarily, go hand in hand.\n \n Just like the term \"species\", its useful shorthand but useless for fine-grained technical analysis or reasoning, or \"intelligence\", as in \"Joe is more intelligent than Jim\".\n \n Save us the garbage about how \"functional unity\" is non-physical, there's no necessary connection between the two things. You can design a computer with functional unity, and you can design one with a host of modular subsystems, both computers are equally \"physical\".\n \n \nthe study of physical things -- is almost worthless.\n\n \n Is there any point to nonsensically ignorant comments like this?\n \n \n \n Your \"philosophical\" (for want of a better word) ideas about control of an organism can be summed up as follows; people are so complex they couldn't be controlled by anything so simple as a neural network with billions of neurons and complex interconnected systems for storage and processing, they need a MAGIC GHOST TO PILOT THEM, and this magic ghost doesn't need a pilot of his own, to control him, because he's MAGIC.", 
   {}, 
   269237, 
   null, 
   1182101160.0
  ], 
  [
   269244, 
   null, 
   "supersport", 
   "Here's my question...please answer it:\n \n I would like for the materialists here to answer a simple question for me. Do you believe there is a fundamental difference between a living thing and a non-living thing? If so, what exactly is it that makes/causes this difference? I'm guessing that you guys would say that both living and non-living entities are products of the laws of chemistry and physics, but what exactly is it that makes something alive? Is it a physical thing? If so, what? Is it a non-physical thing? If so, what? ", 
   {}, 
   269242, 
   null, 
   1182101760.0
  ], 
  [
   269246, 
   null, 
   "Symbiote", 
   "Here's my reply...please read it:\n \n No, there's no fundamental distinction, the terms are a shorthand way of referring to a host of characteristics which usually, rather than necessarily, go hand in hand.", 
   {}, 
   269244, 
   null, 
   1182102300.0
  ], 
  [
   269249, 
   null, 
   "wascallywabbit", 
   "**\n Good questions, SS, and issues fundamental, basic, essential, to the evolutionary debate.\n \n You are right to point out that traits, characterists, and properties are always effects, not causes, and certainly never their own causes. Despite darwinism's fondness for \"spontaneous generation\" and creatio ex nihilo, ab nihilo. \n \n All causation reduces to the action of something ineffable that we, without a clue to what it actually is, call a force. Forces are known solely from what they do, not from what they are, because they are insubstantial, non-corporeal, and not the least materialistic. Forces are whatever it is that overcomes inertia and stasis and effects a change in current, immediate. proximate, local reality. Effects are always, as said before, current, immediate, proximate, and local with regard to the force/s acting upon that l something which is affected by that/those forces. The actual forces are never strictly local, but always universal and constanyt, although their applications/effects may be local and inconstant, relative and irregular.\n \n In short, every observable change in any given state of affairs, that is, any difference that is a difference, that is, every ex post facto observation of novel traits, properties, characteristics (essential or accidental, primary or secondary) is the observation of the after-effect of an exerted force. Stasis, or perfect entropy, i.e., perpetually undisturbed inertia, is the natural state of corporeal substance. Without force, matter does, and can do, nothing.\n \n With corporeal bits of stuff this is all readily observable, although darwinists and other mechanist/materialialists, having long ago hitched their horse behind the cart (and gotten reality exactly backwards), will howl in outraged denial. They still belief that matter is the essential substrate, therefore, that matter generates forces, not the actual and true opposite understanding. But never mind.\n \n The passive bits of stuff that move thanks to forces have made some forces obliquely identifiable and obliquely measurable--at least over the past few centuries since Newton. We now have identified four forces, and named them, and have found mathematical measures for them. Everyone knows them as gravity, etc. But moving bits of stuff are not the only phenomena empirically observable in our world. Moving bits of passive, corporeal stuff simply does not account for something as simple as a change of attitude or emotion. In short, the fouyr physical forces simply do not account for life, or any of the characteristics, properties, traits, i.e., observable effects, peculiar and particularly reserved for lifeforms, organisms that are still alive.\n \n That is why thinkers have long sought the psychical counterpart to the physical forces that overcome the natural inertia of corporeal stuff. The common solution is to simply posit a 'life force', and since that is all that was ever done wrt physical phenomena, it seems perfectly legitimate to do it for real and natural psychical phenomena., i.e., the phenomena that are intrinsic and inherent to biological forms, living organisms, only. Bergson called this necessary but elusive force, the \"elan vital\". I simply call it, \"Vitality\".", 
   {}, 
   269237, 
   null, 
   1182102660.0
  ], 
  [
   269250, 
   null, 
   "chemist99a", 
   "Here's my question...please answer it:\n \n I would like for the materialists here to answer a simple question for me. Do you believe there is a fundamental difference between a living thing and a non-living thing? If so, what exactly is it that makes/causes this difference? I'm guessing that you guys would say that both living and non-living entities are products of the laws of chemistry and physics, but what exactly is it that makes something alive? Is it a physical thing? If so, what? Is it a non-physical thing? If so, what? \n\n hum\n No there is NOT a fundamental difference in that there is a clear and definable threshold between life and non-life. Living is a taxonomic category (binary) overlaid on a continuium of states and conditions. At or near the border between classifying objects as living/non-living the resolution between the two catagories becomes increasingly difficult to make. \n \n For example a rock is clearly non-living, A human is living (or used to be). A complex of protein and nucleic acid which can replicate under some conditions can be living or non-living depending on the biases of the taxonomist. Thats why its difficuolt to put viruses on one side of the border or the other! Thats because there is no sharp line between the two catagories. MOST taxonomic catagories have this property.", 
   {}, 
   269244, 
   null, 
   1182103200.0
  ], 
  [
   269251, 
   null, 
   "chemist99a", 
   "With corporeal bits of stuff this is all readily observable, although darwinists and other mechanist/materialialists, having long ago hitched their horse behind the cart (and gotten reality exactly backwards), will howl in outraged denial. They still belief that matter is the essential substrate, therefore, that matter generates forces, not the actual and true opposite understanding. But never mind.\n So you have perhaps an example of gravity absent mass, or mass absent gravity? And you may have noticed a few physics concepts which are not due to matter - something called energy for example? Although the two are interconvertible. And then there is the idea of time (which I think is neither matter nor energy?). \n \n Does matter cause gravity, or does gravity cause matter? How ya gonna tell since you cannot separate the two? well for starters consider that gravity has the property of propagation in time/distance. Ie a speed which is less than infinity. Its temporally separable from mass!", 
   {}, 
   269250, 
   null, 
   1182103560.0
  ], 
  [
   269252, 
   null, 
   "chemist99a", 
   "Moving bits of passive, corporeal stuff simply does not account for something as simple as a change of attitude or emotion. In short, the fouyr physical forces simply do not account for life, or any of the characteristics, properties, traits, i.e., observable effects, peculiar and particularly reserved for lifeforms, organisms that are still alive.\n Good luck testing your hypothesis. How do you propose to falsify the hypothesis that moving bits of matter/energy do not account for life? Do you have an example of life which is not composed of matter/energy? Please provide your empirical data. Thanks.\n \n Your position is equivalnt to me making the claim that life is based on guitws an ineffable and unobserved form of universal intelligence and causation. I happen to be from Missouri (methaphorically) show us that your claim is true or that physics as we know CANNOT account for life as we know it!", 
   {}, 
   269251, 
   null, 
   1182103860.0
  ], 
  [
   269253, 
   null, 
   "chemist99a", 
   "] Bergson called this necessary but elusive force, the \"elan vital\". I simply call it, \"Vitality\". \n \n And I call the forces etc that move a locomotive down a railway \"elan locomotive\". and we also have elan automotive and elan electromotive, and elan visual, and elan photomotive etc etc etc. Its pure mysticism and there are no observables involved. You can postulate any force you wish but so what? How about centripetal force, and angelic force, and of course the ultimate one - the force of the will of GOD? Its all mental self-abuse.", 
   {}, 
   269252, 
   null, 
   1182104100.0
  ], 
  [
   269258, 
   null, 
   "chemist99a", 
   "As to what makes something alive the following article takes a laymans look at the question of whether viruses are alive or not. Not too bad, but on the light humor side. \n \n http://www.beyondbooks.com/lif72/2c.asp\n \n Key language\n As humans, we like to classify things because it helps us understand the physical world. Viruses must have a host cell to live and reproduce. Outside of the host cell, viruses are pieces of genetic molecules that can do nothing by themselves. Viruses are right on the border between living and nonliving. Some biologists currently see the virus as a nonliving infectious particle. Other biologists disagree and suggest they are alive because of what happens inside the host cell.\n \n Getting a definite answer if viruses are alive or not may never happen.\n \n But hey, that's life.", 
   {}, 
   269253, 
   null, 
   1182105960.0
  ], 
  [
   269263, 
   null, 
   "Nwarth", 
   "Living v. non-living\n \n Well, multiple ways I can go with this. The one that makes the most sense is that something is alive if it can act on its own and multiply in some way, if it intakes resources and expels waste (note here one things waste may be another's resource and vice-versa).\n \n So I guess the way i differentiated between the two is to list a few characteristics that one group has that the other group does not have. Though both groups are essentially made up of material. This is not to say I am a materialist, however, I am an existentialist. Though that doesn't preclude me from sharing some things in common with materialists.", 
   {}, 
   269258, 
   null, 
   1182107700.0
  ], 
  [
   269272, 
   null, 
   "chemist99a", 
   "Well, multiple ways I can go with this. The one that makes the most sense is that something is alive if it can act on its own and multiply in some way, if it intakes resources and expels waste (note here one things waste may be another's resource and vice-versa).\n \n So I guess the way i differentiated between the two is to list a few characteristics that one group has that the other group does not have. Though both groups are essentially made up of material. This is not to say I am a materialist, however, I am an existentialist. Though that doesn't preclude me from sharing some things in common with materialists.\n All attempts at drawing that boundary sharply are doomed to defeat by the fuzziness of the borderline. Just no way around it, although one could establish a brigh-line by arbitrary convention. There are simply too many intermediate cases between what is clearly non-life and what is clearly life! It is in fact just matter organized at differing degrees of organizational complexity. From rocks to viruses to humans. Biologists and chemists have never yet encountered any results which indicate otherwise. No non-material or non-physical entities, forces, beings, elans, or spirits etc. Life is the result of the functioning of very complex assemblages of matter, its as \"mechanical\" meaning materialist as a watch or an automobile or a virus or a rock. Vitalism became non-viable as a world view at least 70 years ago actually logically untenable more than a century ago or even 150 years back. You might as well try to revive alchemy to replace modern chemisty as to revive vitalism to replace biochemistry and biophysics.", 
   {}, 
   269263, 
   null, 
   1182110460.0
  ], 
  [
   269307, 
   null, 
   "supersport", 
   "hum\n No there is NOT a fundamental difference in that there is a clear and definable threshold between life and non-life. Living is a taxonomic category (binary) overlaid on a continuium of states and conditions. At or near the border between classifying objects as living/non-living the resolution between the two catagories becomes increasingly difficult to make. \n \n For example a rock is clearly non-living, A human is living (or used to be). A complex of protein and nucleic acid which can replicate under some conditions can be living or non-living depending on the biases of the taxonomist. Thats why its difficuolt to put viruses on one side of the border or the other! Thats because there is no sharp line between the two catagories. MOST taxonomic catagories have this property.\n\n \n I'm not sure that answered my question. I'm looking for the cause of something being alive.\n \n And see this conjures up origin of life issues. As I see it, the reason science can't create life is because life is not a culmination of random parts stacked on top of each other. You can't take a kidney and some blood cells and some bones and some molecules and make a new life....and that's because all you'd have is a bunch of random, independently-acting parts. Unfortunately for scientists and other assorted reductionists/materialists, life requires the birth of a \"whole\" first....then after the birth of the whole, the process of creating/modifying individual parts can go about happening. But see, science doesn't like recognizing wholes...so since that is the case, they've really put themselves behind the 8-ball logically. As you seem to be admitting and what symbiote has admitted, you don't really see a difference between life and non-life. But even a small child has more sense than this, which makes it obvious that your materialist theory breaks down when it gets to the fundamental level.\n \n And if you do ever admit that each organism is a functional whole, you would then have to try and define what this whole is. What exactly is this thing that's lurking beneath the surface making decisions? Is it a ghost? Is it a spiritual non-thing? Is it a process? What the heck is it?...whatever it is certainly isnt' scientific.", 
   {}, 
   269250, 
   null, 
   1182118800.0
  ], 
  [
   269308, 
   null, 
   "chemist99a", 
   "As I see it, the reason science can't create life is because life is not a culmination of random parts stacked on top of each other.\n Your logic is faulty. Science would not make a living cell by \"stacking random parts on top of each other\" it would be a deliberate effort with purpose. Just as the construction of the polio virus was a deliberate intentional effort.\n \n You don't think that science makes 747s by stacking random parts do ya?\n \n As to the natural origins of life thats not stacking random parts either. That is natural selection at the molecular level applied to potential imperfect self-replicating molecules (and yes we CAN make such molecules and they are not all that complex either) eventually resulting in an imperfect self-replicating assemblage of atoms and organic compounds. Once that happend life could evolve into increasingly diverse forms via VSI processes. In principle all one ever needed was a SINGLE molecule or assemblage to start things off. And it appears the chemistry alone is sufficient to generate that beginning.\n \n =====================================\n \n Nature. 1996 Aug 8;382(6591):525-8. Related Articles, Links\n A self-replicating peptide.\n \n Lee DH, Granja JR, Martinez JA, Severin K, Ghadri MR.\n \n Department of Chemistry, The Scripps Research Institute, La Jolla, California 92037, USA.\n \n The production of amino acids and their condensation to polypeptides under plausibly prebiotic conditions have long been known. But despite the central importance of molecular self-replication in the origin of life, the feasibility of peptide self-replication has not been established experimentally. Here we report an example of a self-replicating peptide. We show that a 32-residue alpha-helical peptide based on the leucine-zipper domain of the yeast transcription factor GCN4 can act autocatalytically in templating its own synthesis by accelerating the thioester-promoted amide-bond condensation of 15- and 17-residue fragments in neutral, dilute aqueous solutions. The self-replication process displays parabolic growth pattern with the initial rates of product formation correlating with the square-root of initial template concentration.\n =======================================", 
   {}, 
   269307, 
   null, 
   1182119520.0
  ], 
  [
   269309, 
   null, 
   "chemist99a", 
   "The design of self-replicating helical peptides.\n \n Issac R, Ham YW, Chmielewski J.\n \n Curr Opin Struct Biol. 2001 Aug;11(4):458-63.\n \n Department of Chemistry, Purdue University, West Lafayette, Indiana 47907, USA.\n \n The self-assembly of helical peptides and information transfer through autocatalysis and cross-catalysis are the foundation of peptide-based molecular evolution models. Many fundamental properties of living systems, such as environmental sensitivity, chiroselectivity, cross-catalysis, dynamic error correction and conditional selection, are exhibited by various self-replicating peptide systems. Recently, advances have been made in the design of peptide systems with autocatalytic and cross-catalytic properties.\n \n \n AND\n \n Peptide self-assembly as a model of proteins in the pre-genomic world.\n \n Ghosh I, Chmielewski J.\n \n Curr Opin Chem Biol. 2004 Dec;8(6):640-4.\n \n Department of Chemistry, University of Arizona, 1306 E. University Blvd, Tuscon, AZ 85721, USA. ghosh@email.arizona.edu\n \n Excellent catalytic efficiency has been obtained within a series of self replicating peptides, and nucleobase inclusion into a salt-switchable self replicating peptide is found to override the switch. Interestingly, cross-catalytic formation of an RNA aptamer is reported with a cationic peptide, and novel, amide-based biopolymers have been designed to self assemble.", 
   {}, 
   269308, 
   null, 
   1182119820.0
  ], 
  [
   269310, 
   null, 
   "supersport", 
   "As I see it, the reason science can't create life is because life is not a culmination of random parts stacked on top of each other.\n Your logic is faulty. Science would not make a living cell by \"stacking random parts on top of each other\" it would be a deliberate effort with purpose. Just as the construction of the polio virus was a deliberate intentional effort.\n \n You don't think that science makes 747s by stacking random parts do ya?\n \n As to the natural origins of life thats not stacking random parts either. That is natural selection at the molecular level applied to potential imperfect self-replicating molecules (and yes we CAN make such molecules and they are not all that complex either) eventually resulting in an imperfect self-replicating assemblage of atoms and organic compounds. Once that happend life could evolve into increasingly diverse forms via VSI processes. In principle all one ever needed was a SINGLE molecule or assemblage to start things off. And it appears the chemistry alone is sufficient to generate that beginning.\n \n =====================================\n \n Nature. 1996 Aug 8;382(6591):525-8. Related Articles, Links\n A self-replicating peptide.\n \n Lee DH, Granja JR, Martinez JA, Severin K, Ghadri MR.\n \n Department of Chemistry, The Scripps Research Institute, La Jolla, California 92037, USA.\n \n The production of amino acids and their condensation to polypeptides under plausibly prebiotic conditions have long been known. But despite the central importance of molecular self-replication in the origin of life, the feasibility of peptide self-replication has not been established experimentally. Here we report an example of a self-replicating peptide. We show that a 32-residue alpha-helical peptide based on the leucine-zipper domain of the yeast transcription factor GCN4 can act autocatalytically in templating its own synthesis by accelerating the thioester-promoted amide-bond condensation of 15- and 17-residue fragments in neutral, dilute aqueous solutions. The self-replication process displays parabolic growth pattern with the initial rates of product formation correlating with the square-root of initial template concentration.\n =======================================\n\n \n but without a whole there to interpret these parts, they might as well be random because there'd be no intelligence behind them telling them how to behave.", 
   {}, 
   269308, 
   null, 
   1182120000.0
  ], 
  [
   269311, 
   null, 
   "Ripskar", 
   "life\n \n \u0095 noun (pl. lives) 1 the condition that distinguishes animals and plants from inorganic matter, including the capacity for growth and functional activity. 2 the existence of an individual human being or animal. 3 a particular type or aspect of people's existence: school life. 4 living things and their activity. 5 a biography. 6 vitality, vigour, or energy. 7 informal a sentence of imprisonment for life. 8 (in various games) each of a specified number of chances each player has before being put out. 9 before a noun (in art) based on a living rather than an imagined form: a life drawing. \n\n \n http://www.askoxford.com/concise_oed/life?view=uk\n \n A bacterium is alive because it respires, possesses the capacity for growth and reproduction.\n A Virus is classified as non-living because although it has the capacity for reproduction it does not perform respiration.\n Again the Creationists/ID proponents, rely on strawmen to make a point.emoticon_xdonno \n Begining wirth false assertions they make no progress whatsoever.", 
   {
    "unicode_changes_made": true
   }, 
   269308, 
   null, 
   1182120120.0
  ], 
  [
   269317, 
   null, 
   "Symbiote", 
   " As you seem to be admitting and what symbiote has admitted, you don't really see a difference between life and non-life. But even a small child has more sense than this, which makes it obvious that your materialist theory breaks down when it gets to the fundamental level.\n\n \n Matching the intuitions of a small child is not a criteria for truth in science.", 
   {}, 
   269311, 
   null, 
   1182130500.0
  ], 
  [
   269318, 
   null, 
   "chemist99a", 
   "On the other hand some bacteria also do not \"respire\" at least not in the usual sense! And strictly speaking anaerobes do not either although they do metabolize. Also strictly speaking viruses do \"respire\" in a sense when they hijack existing metabolic enzymes of the host to reproduce themselves. The energy has to come from somewhere after all! Life is and always has been ducedly difficult to define.", 
   {}, 
   269311, 
   null, 
   1182130740.0
  ], 
  [
   269319, 
   null, 
   "chemist99a", 
   "but without a whole there to interpret these parts, they might as well be random because there'd be no intelligence behind them telling them how to behave.\n ID babble. The operation of the machinery of life is not dependent on intelligence. DNA transcription, translation, and enzyme activities are not guided by any discernable intelligence. Life just does not work that way.", 
   {}, 
   269318, 
   null, 
   1182130920.0
  ], 
  [
   269321, 
   null, 
   "chemist99a", 
   "Oh yes a bit on respiration. Nematode cysts can go dormant for many years (see Anguina triticii) without exhibiting any perceptible respiration or metabolism. So can tardigrades, and many bacteria and fungi. Not to mention seed which are dormant sometimes for centuries. Are we to conder these objects alive or dead????? Are human embryos frozen at liquid N2 temps alive or dead. They certainly are NOT going to respire at those temps!!!!!", 
   {}, 
   269319, 
   null, 
   1182131580.0
  ], 
  [
   269325, 
   null, 
   "chemist99a", 
   "=================================\n \n Peptides and the origin of life.\n \n Rode BM.\n \n Peptides. 1999;20(6):773-86.\n \n Department of Theoretical Chemistry, Institute for General, Inorganic and Theoretical Chemistry, University of Innsbruck, Austria. Bernd.M.Rode@uibk.ac.at\n \n Considering the state-of-the-art views of the geochemical conditions of the primitive earth, it seems most likely that peptides were produced ahead of all other oligomer precursors of biomolecules. Among all the reactions proposed so far for the formation of peptides under primordial earth conditions, the salt-induced peptide formation reaction in connection with adsorption processes on clay minerals would appear to be the simplest and most universal mechanism known to date. The properties of this reaction greatly favor the formation of biologically relevant peptides within a wide variation of environmental conditions such as temperature, pH, and the presence of inorganic compounds. The reaction-inherent preferences of certain peptide linkages make the argument of 'statistical impossibility' of the evolutionary formation of the 'right' peptides and proteins rather insignificant. Indeed, the fact that these sequences are reflected in the preferential sequences of membrane proteins of archaebacteria and prokaryonta distinctly indicates the relevance of this reaction for chemical peptide evolution. On the basis of these results and the recent findings of self-replicating peptides, some ideas have been developed as to the first steps leading to life on earth.\n ==================================================", 
   {}, 
   269321, 
   null, 
   1182132000.0
  ], 
  [
   269329, 
   null, 
   "chemist99a", 
   "And there are other chemical systems which self-replicate. This one is rather more simple than the peptides made to date.\n \n ===============================\n \n Self-Reproducing Molecules Reported by MIT Researchers\n \n PRIMITIVE LIFE\n \n Self-Reproducing Molecules\n \n Reported by MIT Researchers\n \n By Eugene F. Mallove\n \n News Office\n \n A significant step toward understanding the origin of life may have been \n made by a group of MIT researchers. Led by Professor Julius Rebek, Jr. \n of the Department of Chemistry, they have created an extraordinary self-\n replicating molecular system that they say might be regarded as a \n \"primitive sign of life.\"\n \n It is not life itself, of course, but it is a kind of molecular model of \n how self-replicationÑa most fundamental life processÑcan occur.\n \n In work recently reported in the Journal of the American Chemical \n Society, Professor Rebek and his coworkers, Tjama Tjivikua, a graduate \n student from Namibia, and Pablo Ballester, a visiting scientist from \n the University of Palma in Mallorca, Spain, described the creation of an \n extraordinary self-replicating molecular system. \n \n Ordinarily, it takes the complex biochemical machinery of a cell to \n reproduce protein molecules. The building blocks of life simply don't \n replicate themselves by themselves they need helpÑlots of itÑfrom \n enzymes and above all from information carried in DNA and RNA.\n \n How the whole business of molecular replication got started has been and \n remains one of the central mysteries of the origin of life. The origin \n of life is a classic \"chicken-and-egg\" dilemma. In the presumed \n molecular evolution on primitive Earth, what came first, proteins or the \n nucleic acids RNA and DNA? And remember that the enzymes necessary to \n make proteins are themselves proteins, where did they come from? \n \n Amazingly, the laboratory-made molecule that Professor Rebek and his \n colleagues have created can reproduce itself without the \"outside\" \n assistance of enzymes. As such, and because of its specific \n constitution, the molecule embodies some of the \"template\" qualities of \n a nucleic acid, and some of the structural qualities of a protein.\n \n The researchers say in their paper, \"At best, this can be regarded as a \n primitive sign of life; at the very least, the system offers a bridge \n between the information of nucleic acids and the synthesis of amide \n bonds. It should be possible to design systems capable of peptide \n [protein] synthesis on a nucleic acid backbone and thereby provide \n models for events that occurred some time ago.\" That \"some time ago\"Ñin \n case you missed it in the understated scientific proseÑis four billion \n years ago on primitive Earth.\n \n Technically, the self-replicating compound made by the MIT group is \n called an amino adenosine triacid ester (AATE). This molecule was \n initially formed by reacting two other molecules. [\n \n The AATE replicates by attracting to one of its ends anester molecule, \n and to its other end an amino adenosine molecule. These molecules react \n to form another AATE. The \"parent\" and \"child\" AATE molecules then break \n apart and can go on to build still more AATE molecules.\n \n Professor Rebek's research is a continuation of work he began at the \n University of Pittsburgh. Professor Rebek has been on the MIT faculty \n since the spring of 1989. His work is supported by the National Science \n Foundation. \n ======================================", 
   {}, 
   269325, 
   null, 
   1182133020.0
  ], 
  [
   269330, 
   null, 
   "chemist99a", 
   "And this one is interesting:\n \n ==========================================\n \n Letters to Nature\n \n Nature 390, 591-594 (11 December 1997) | doi:10.1038/37569; Received 20 June 1997; Accepted 20 October 1997\n Emergence of symbiosis in peptide self-replication through a hypercyclic network\n \n David H. Lee1, Kay Severin1, Yohei Yokobayashi1 and M. Reza Ghadiri1\n \n 1. Departments of Chemistry and Molecular Biology, and the Skaggs Institute for Chemical Biology, The Scripps Research Institute, La Jolla, California 92037, USA \n \n Correspondence to: M. Reza Ghadiri1 Correspondence and requests for materials should be addressed to M.R.G. (e-mail: Email: ghadiri@scripps.edu).\n Top of page\n \n Symbiosis is an association between different organisms that leads to a reciprocal enhancement of their ability to survive. Similar mutually beneficial relationships can operate at the molecular level in the form of a hypercycle, a collective of two or more self-replicating species interlinked through a cyclic catalytic network1, 2, 3, 4, 5. The superposition of cross-catalysis onto autocatalytic replication integrates the members of the hypercycle into a single system that reproduces through a second-order (or higher) form of nonlinear autocatalysis. The hypercycle population as a whole is therefore able to compete more efficiently for existing resources than any one member on its own. In addition, the effects of beneficial mutations of any one member are spread over the entire population. The formation of hypercycles has been suggested as an important step in the transition from inanimate to living chemistry6 , and a large number of hypercycles are expected to be embedded within the complex networks of living systems7. But only one naturally occurring hypercycle has been well documented8, while two autocatalytic chemical systems may contain vestiges of hypercyclic organization9,10. Here we report a chemical system that constitutes a clear example of a minimal hypercyclic network, in which two otherwise competitive self-replicating peptides symbiotically catalyse each others' production.", 
   {}, 
   269329, 
   null, 
   1182133260.0
  ], 
  [
   269333, 
   null, 
   "chemist99a", 
   "http://ccsl.mae.cornell.edu/research/selfrep/faq.htm\n \n And self replication is not limited to animate objects either. See the link.", 
   {}, 
   269330, 
   null, 
   1182134040.0
  ], 
  [
   269335, 
   null, 
   "chemist99a", 
   "Oh yes this little pub should not be overlooked in this area.\n \n \n \n http://www.squid-labs.com/projects/folding/naturepub.pdf", 
   {}, 
   269333, 
   null, 
   1182134220.0
  ], 
  [
   269567, 
   null, 
   "Ripskar", 
   "On the other hand some bacteria also do not \"respire\" at least not in the usual sense! And strictly speaking anaerobes do not either although they do metabolize. Also strictly speaking viruses do \"respire\" in a sense when they hijack existing metabolic enzymes of the host to reproduce themselves. The energy has to come from somewhere after all! Life is and always has been ducedly difficult to define.\n\n \n Chemotrophic organisms etc. certainly do perform energy transfer which is the is the whole point of respiration/metabolic reactions. The metabolic products used by viruses are more a property of the host cell than something intrinsic to the virus, which is the essence of the debate on whether to define a virus as living/non-living. \n The debate may be more a product of semantics rather than observation and viruses clearly fall within the realm of biology even though they don't belong to any of the Kingdoms.", 
   {}, 
   269318, 
   null, 
   1182352620.0
  ], 
  [
   269569, 
   null, 
   "chemist99a", 
   "Chemotrophic organisms etc. certainly do perform energy transfer which is the is the whole point of respiration/metabolic reactions. The metabolic products used by viruses are more a property of the host cell than something intrinsic to the virus, which is the essence of the debate on whether to define a virus as living/non-living. \n The debate may be more a product of semantics rather than observation and viruses clearly fall within the realm of biology even though they don't belong to any of the Kingdoms.\n\n \n Which of course only indicates that they are the ultimate in advanced obligate parasites does it not (prions excepted). emoticon_xangel But you are right its a semantics problem much more than anything else. Such is always the case with taxonomic catagories like life, death, etc. Many many such problems are present in the real world because we overlay a rigid classification matrix onto continua of properties. Can't win that game.", 
   {}, 
   269567, 
   null, 
   1182353340.0
  ], 
  [
   269758, 
   null, 
   "Unriggable", 
   "Sweet jesus chemist, you need to stop posting so many times in a row.\n \n Okay creationists have a tendency to introduce completely irrelevant arguments to aid their side of the debate. This one is second only to the \"the conditions of the universe are so perfect for life that everything must be / have been created\". Which is stupid, and the best counterargument is saying that 9-11 made the conditions perfect for an Iraq attack so obviously the two must have been coordinated by the same designer right?", 
   {}, 
   269569, 
   null, 
   1182402120.0
  ], 
  [
   269759, 
   null, 
   "Unriggable", 
   "Forgot to post this:\n \n http://www.projectmessiah.com/x4/images/gallery/taron/Scarecrow.jpg", 
   {}, 
   269758, 
   null, 
   1182402240.0
  ], 
  [
   269783, 
   null, 
   "supersport", 
   "Sweet jesus chemist, you need to stop posting so many times in a row.\n \n\n \n \n lol....\n \n to chemist's defense I must say that occasionally he links some interesting things.", 
   {}, 
   269758, 
   null, 
   1182405600.0
  ], 
  [
   270434, 
   null, 
   "chemist99a", 
   "Sorry boredom combined with relative immobility and a desire to provide information. Oh yes I am an insomniac due to my medical conditions. Guess you are stuck with me.", 
   {}, 
   269783, 
   null, 
   1182673080.0
  ], 
  [
   270751, 
   null, 
   "supersport", 
   "Sorry boredom combined with relative immobility and a desire to provide information. Oh yes I am an insomniac due to my medical conditions. Guess you are stuck with me.\n\n \n immobility/inactivity by itself can cause insomnia....so can drugs if you're taking any for your medical conditions. I'm actually a recovered insomniac...I know quite a bit about it, unfortunately.", 
   {}, 
   270434, 
   null, 
   1182797880.0
  ], 
  [
   270759, 
   null, 
   "chemist99a", 
   "Lets put it this way. Insomina is the least of my medical problems.", 
   {}, 
   270751, 
   null, 
   1182799080.0
  ], 
  [
   270789, 
   null, 
   "supersport", 
   "Lets put it this way. Insomina is the least of my medical problems.\n\n \n I bet I could cure you in less than 3 months. (No, no magic potions or witchcraft.)", 
   {}, 
   270759, 
   null, 
   1182808800.0
  ], 
  [
   270803, 
   null, 
   "chemist99a", 
   "No, I absolutey refuse to read the congressional record sorry!", 
   {}, 
   270789, 
   null, 
   1182816600.0
  ], 
  [
   270928, 
   null, 
   "Iuris", 
   "Good one, chemist ;)\n \n As for the question of life, as intended to be asked by supersport:\n \n The difference between life and non-living matter is the same as the difference between a working car and a broken one. Life functions. If it doesn't, it stops living, that is, it dies. Yet, just like there is no need for a tangible \"workingness\" of a working car to distinguish it from a broken one, there is no need for an inherent \"life\" to make living matter alive. Life is a function. It is most similar to a very complex form of fire.", 
   {}, 
   270803, 
   null, 
   1182872280.0
  ], 
  [
   270959, 
   null, 
   "wascallywabbit", 
   "Good one, chemist ;)\n\n \n **\n Actually, I thought he was disdainfully mocking SS's sincere offer of help, so I didn't see it as a \"good one.\", in any sense of those words. But maybe you have to be a materialist in order to see the humour in such things.\n \n \n\n As for the question of life, as intended to be asked by supersport:\n \n The difference between life and non-living matter is the same as the difference between a working car and a broken one.\n\n \n **\n No it is not. In fact, that comparison is blatantly silly. A car is an artefact, and builder/designers can repair their own artefacts with no help from the artefact itself. IOW, a totally broken down car, one that does not 'function' at all, can be repaired, so that it 'functions' once again. And as it happens, many, if not all of them, are repaired, have their 'function' restored, at some time or other. To the best of my knowledge, no living organism that loses all power to function, that is, dies, has ever recovered that ability, with or without the aid of repairmen. The same applies to parts of cars and parts of organisms. A dead brain cannot become 'undead'. A dead heart can only be replaced,(by a pump, or by somebody else's healthy, functioning heart), not 'sent to the shop to be rebuilt'--whereas batteries can be re-charged, and motors can be rebuilt. This would-be analogy does not stand up to scrutiny.\n \n \n\n Life functions. If it doesn't, it stops living, that is, it dies. \n\n \n **\n As always with mechanists, effect is mistaken for cause. The horse is firmly placed at the back of the cart. The actual case is that if something stops living, then death, (i.e., loss of life), causes it to cease to function. It does not die, i.e., lose its life because it ceases to to function. A paralysed person may have limbs that do not function, but are not dead. Just as a car can, and often does, have parts that do not function, but are not 'dead', either.\n To be inoperative is not to be 'dead', although to be dead is to be 'inoperative'. They are correlated, but not synonymous, (as you would have us believe).\n \n \n\n Yet, just like there is no need for a tangible \"workingness\" of a working car to distinguish it from a broken one,\n\n \n **\n Duh?!?!? Just try getting to work in a broken-down car. That's a fairly 'tangible' experience,-- one that is 'tangibly' different from that of not getting to work in a broken-down car. At least it is where I come from.\n \n \n \n\n there is no need for an inherent \"life\" to make living matter alive.\n\n \n **\n Sez u, all evidence to the contrary notwithstanding.\n \n \n\n Life is a function.\n\n \n **\n No, it is not. Life is that which enables certain functions in certain systems, includiong, but not restricted to, intelligence and volition.\n \n \n\n It is most similar to a very complex form of fire.\n\n \n \n **\n Gee, in a very mystical, allegorical way, that's actually true. But you need to re-read your Heraklitus before you misinterpret things any further.", 
   {}, 
   270928, 
   null, 
   1182877620.0
  ], 
  [
   271122, 
   null, 
   "supersport", 
   "I ran across this today. It seems to kind of relate to the point in my OP, which is that whatever it is that makes something alive is some sort of internal, singular, holistic, non-physical unit.\n \n We know that the environment cannot work directly on specific body parts, it works directly on the organism itself. Thus, something somewhere inside the organism has to not only be aware of its surroundings, but it also must be able to react accordingly and organize a physical response. \n \n The following is about brain function, but notice how science is learning that the brain cannot be dissected an analyzed in chunks; it must be seen as a system:\n \n http://www.creationsafaris.com/crev200706.htm\n \n Systems neuroscience aims to understand how billions of neurons in the mammalian brain support goal-directed behavior, such as decision making. Deciphering how individual neurons respond to sensory inputs or motor decisions has focused on delineating the neural basis of these processes in discrete regions of the brain's cortex, and has provided key insights into the physiological basis of behavior. However, evidence from neuropsychological, electrophysiological, and neuroimaging studies in humans has revealed that interactions between widespread neural regions in the brain underlie fluid, organized behavior. Two papers in this issue, by Womelsdorf et al. on page 1609 and Saalmann et al. on page 1612, and a recent paper in Science by Buschman and Miller, unravel the details of these interactions by assessing the simultaneous activity of neurons in multiple sites of the mammalian brain. The studies show that network interactions among anatomically discrete brain regions underlie cognitive processing and dispel any phrenological notion that a given innate mental faculty is based solely in just one part of the brain\n \n So it sounds like the brain operates much like the genome. Somehow, different areas of the brain operate simultaneously to accomplish tasks, which, to me, would require direct communication from a common source. What is the source? Who knows...but whatever it is, is probably what makes the organism alive; it's the thing/non-thing that distinguishes life from non-life because something that's not alive would not have such a thing.", 
   {
    "unicode_changes_made": true
   }, 
   270959, 
   null, 
   1182931740.0
  ], 
  [
   271143, 
   null, 
   "chemist99a", 
   "I ran across this today. It seems to kind of relate to the point in my OP, which is that whatever it is that makes something alive is some sort of internal, singular, holistic, non-physical unit.\n\n \n When anyone starts throwing terms like \"some sort of internal, singlular, holistic, non-physical unit\" its a good sign they are not dealing with the problem at any substantive level at all. The words are for all practical purposes meaningless when used that way. Particulary the term non-physical since we have no evidence at all for anything which is non-physical. None! And indeed its very very very very difficult to even imagine something which is non-physical since it would in fact be no-thing at all let alone a \"unit\" of some sort.", 
   {}, 
   271122, 
   null, 
   1182953280.0
  ], 
  [
   271144, 
   null, 
   "chemist99a", 
   "The following is about brain function, but notice how science is learning that the brain cannot be dissected an analyzed in chunks; it must be seen as a system:\n\n \n Except of course the brain can be and is being analyzed in \"chunks\" depending on how you define chunki of course. And in any case brain function would not seem to have much relevance to whether or not a virus or a bacterium is alive. The real issue is to determine \"why\" in mechanistic terms the simplist of things we consider to be alive are considered to be so! And why other things which are simpler yet are NOT considered to be alive. Its a taxonomic problem and thus has no bright line analytical solution. The living non-living question becomes uncertain near the borders of the concept.", 
   {}, 
   271143, 
   null, 
   1182953640.0
  ], 
  [
   271146, 
   null, 
   "chemist99a", 
   "The classical taxonomic dilemma has long been known to be a serious problem\n \n \n There were six men of Hindustan,\n to learning much inclined,\n Who went to see an elephant,\n though all of them were blind,\n That each by observation\n might satisfy his mind.\n \n The first approached the elephant,\n and happening to fall\n Against his broad and sturdy side,\n at once began to bawl,\n \"This mystery of an elephant\n is very like a wall.\"\n \n The second, feeling of the tusk,\n cried, \"Ho, what have we here,\n So very round and smooth and sharp?\n To me 'tis mighty clear,\n This wonder of an elephant\n is very like a spear.\"\n \n The third approached the elephant,\n and happening to take\n The squirming trunk within his hands,\n thus boldly up and spake,\n \"I see,\" quoth he,\n \"the elephant is very like a snake.\"\n \n The fourth reached out an eager hand,\n and felt above the knee,\n \"What this most wondrous beast\n is like is very plain\" said he,\n \"'Tis clear enough the elephant\n is very like a tree.\"\n \n The fifth who chanced to touch the ear\n said, \"E'en the blindest man\n Can tell what this resembles most;\n deny the fact who can;\n This marvel of an elephant\n is very like a fan.\"\n \n The sixth no sooner had begun\n about the beast to grope,\n Than seizing on the swinging tail\n that fell within his scope;\n \"I see,\" said he, \"the elephant\n is very like a rope.\"\n \n So six blind men of Hindustan\n disputed loud and long,\n Each in his own opinion\n exceeding stiff and strong;\n Though each was partly in the right,\n they all were in the wrong!", 
   {}, 
   271144, 
   null, 
   1182953820.0
  ], 
  [
   271153, 
   null, 
   "lesz", 
   "We know that the environment cannot work directly on specific body parts, it works directly on the organism itself.\n\n \n We do? You mean that when the sun tans your skin, it's not your skin it's tanning, it's every cell in your body?\n \n \nThus, something somewhere inside the organism has to not only be aware of its surroundings, but it also must be able to react accordingly and organize a physical response. \n\n \n Ummmm... I think it's called a brain in metazoa. Of course, even bacteria are able to sense their environments and act accordingly. \n \n \nSomehow, different areas of the brain operate simultaneously to accomplish tasks, which, to me, would require direct communication from a common source. What is the source? Who knows...but whatever it is, is probably what makes the organism alive; it's the thing/non-thing that distinguishes life from non-life because something that's not alive would not have such a thing.\n\n \n Ah, the homunculus lives! It must be this soul thingy that some people keep harping on about. Well, when someone measures it, I'll take it seriously. Till then, there's no reason to suppose there's anything more to animals than we see: biochemistry.", 
   {}, 
   271122, 
   null, 
   1182954840.0
  ], 
  [
   271157, 
   null, 
   "supersport", 
   "a suntan is caused by the release of hormones, which release melanin. \n \n \n Sure, I could hit someone in the arm and cause a bruise. That is not the same as acknowledging that adaptations come from internal signals.", 
   {}, 
   271153, 
   null, 
   1182955680.0
  ], 
  [
   271163, 
   null, 
   "lesz", 
   "Sure, I could hit someone in the arm and cause a bruise. That is not the same as acknowledging that adaptations come from internal signals.\n\n \n Again, let me stress there are two distinct kinds of adaptations in biology.\n \n (1) There is the adaptability of the individual organism to transient and often seasonal changes in its environment. Organisms that can achieve such adaptation have genomes that specifically encode appropriate responses to appropriate environments. Epigenetic factors alter gene expression, which alters the phenotype. Suntanning is a minor example.\n \n (2) Then there is evolutionary adaptation, such as fish fins evolving into land legs, or dinosaur forelimbs evolving into wings. These adaptations which often accompany speciation entail more fundamental rearrangements of chromosomes that permanently alter developmental pathways.\n \n Please don't confuse adaptation with adaptability -- the evolution of adaptability as an adaptation is a field in itself. Speciation is not known to be merely a matter of epigenetic change. The vast majority of the evidence, some of which I've posted here, is that these require minor to major chromosomal rearrangement or alteration, aka mutation.", 
   {}, 
   271157, 
   null, 
   1182957420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What makes something alive?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10027-what-makes-something-alive.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10027, 
  "discussion_files": [
   [
    "15213.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10027-what-makes-something-alive-print.html"
   ], 
   [
    "15214.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10027-what-makes-something-alive-3-print.html"
   ], 
   [
    "15215.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10027-what-makes-something-alive-2-print.html"
   ]
  ], 
  "identifier": 10027
 }
]