[
 [
  [
   271295, 
   null, 
   "robbie0517", 
   "Another attack on gays by this president. With support growing daily for the gay equality, I hope this turns on him. \n \n \n http://365gay.com/Newscon07/06/062707dc.htm\n \n (Washington) President Bush issued a warning to Congress on Wednesday that he will veto budget appropriations for the District of Columbia unless the measure contains language barring the district from using any of the money for its domestic partner registry.\n \n The registry allows same and opposite-sex unmarried couples to register their relationships.\n \n Three quarters of the District of Columbia's budget comes from local revenue - city taxes and fees. But, about $120 million in additional funds comes from the federal government. \n \n That money is contained in the Financial Services and General Government Appropriations Act. \n \n Under Republicans the legislation stated that none of the federal money could be used to support the partner registry. When Democrats took control of Congress the requirement was removed.\n \n In threatening a veto the White House on Wednesday issued a statement saying: \"The Administration strongly opposes the bill's exclusion of a longstanding provision that disallows the use of Federal funds to register unmarried, cohabitating couples in the District, to enable them to qualify for benefits on the same basis as legally married couples. Under Federal law, legal marriage is the union between a man and a woman. Federal tax dollars are not used to extend employment benefits to domestic partners of Federal employees, and D.C. should not enjoy an exception to this rule.\"\n \n The Domestic Partner registry includes such partner rights as hospital and nursing home visitations, medical decisions, and inheritance rights.\n \n \"With his popularity at an all time low, this President has yet again dipped his cup into the well of anti-gay bigotry,\" said Human Rights Campaign President Joe Solmonese. \n \n \"He has issued a veto threat on funding for the District of Columbia because long-term, committed couples want to have such basic rights as visiting each other in the hospital and making medical decisions for their partner. The anti-gay zeal of this Administration has reached a new low.\"\n \n Gay Democrats seized on the veto threat as another example of wedge politics.\n \n \"This is a misleading veto threat designed to parrot the talking points of the anti-gay special interests which control and finance the Republican Party, said National Stonewall Democrats Executive Director Jo Wyrick, \n \n \"President Bush would never threaten to withhold federal funds from California because it employs a domestic partnership registry. Yet, Republicans feel that the District of Columbia is their financial playground that they can use to bully local families at the pleasure of their anti-gay agenda. That is wrong.\"\n \n The District of Columbia established a local domestic partnership registry in 1992. However, the Republican congressional leadership routinely prevented the registry from being enacted until 2002. \n \n Since that time, the Republican-led Congress have repeatedly attached anti-gay language to past appropriations bills which stipulate that federal funds cannot be used to operate the program. Since local funds are used, observers have noted that the provision was simply used as a way for Republicans to demonstrate their disapproval for the law and for same-sex families.\n \n The removal of the domestic partner provision from the financial services act came at the request of Congressman José Serrano (D-NY) and other Democrats. \n \n \"There are serious issues for the country to deal with, yet the President wants to focus on this,\" said Congressman José Serrano (D-NY) in a statement. \n \n \"This was a redundant provision that bashes the District of Columbia. There are no federal funds directed at the domestic partners registry. Its like putting out a statement that says that José Serrano is not a Republican. Yeah, we know that already. I took out this past provision because it is a bad statement that doesn't bring people together, but tries to divide them instead.\"\n \n Ironically the legislation also provides financial support for federal programs including the salary of the President.\n \n It is the second time in two months the president has threatened a veto over a gay issue.\n \n In May the White House said that if legislation adding gays and lesbians to federal hate crime laws the president would nix it.", 
   {
    "post_info": {
     "post_title": "Bush Threatens To Veto DC Budget For Not Blocking Domestic Partner Funds"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1183001640.0
  ], 
  [
   271337, 
   null, 
   "lesz", 
   "Bush is an unprintable, *expletive deleted*, :xcensored jackass.", 
   {}, 
   271295, 
   null, 
   1183027440.0
  ], 
  [
   271338, 
   null, 
   "Symbiote", 
   "Wouldn't worry about it, if there's one thing Bush values more than differential treatment for gays, its spending as much money as he possibly can.", 
   {}, 
   271337, 
   null, 
   1183027500.0
  ], 
  [
   271352, 
   null, 
   "samiinh", 
   "Yep, the Bushies want to bankrupt the country.", 
   {}, 
   271338, 
   null, 
   1183031520.0
  ], 
  [
   271356, 
   null, 
   "chemist99a", 
   "Yep, the Bushies want to bankrupt the country.\n\n \n But only in a good cause - which is defined as putting money into the pockets of friends of the Bush dynasty. Registering gays in DC is not going to do that. Nor will a lot of other worthy programs. On the other hand tearing down a country with one hand while rebuilding it with the other and paying for both ones own armaments and those of the \"enemy\" manages the job nicely. And after all \"the right people\" will come out ahead since they can hire all the cheap servants they want.", 
   {}, 
   271352, 
   null, 
   1183036200.0
  ], 
  [
   271364, 
   null, 
   "Symbiote", 
   "Not really, he'll spend on just about anything, expansion of healthcare, prescription medicine, education.. virtually every department has grown enormously, causes good or bad, the main thing is to spend", 
   {}, 
   271356, 
   null, 
   1183038540.0
  ], 
  [
   271366, 
   null, 
   "chemist99a", 
   "Well its NOT his money after all, and he can borrow more from the Chinese and the Arabs. No problem at least right away. Who needs an exit plan? That up to the next guy in line.", 
   {}, 
   271364, 
   null, 
   1183039080.0
  ], 
  [
   271483, 
   null, 
   "samiinh", 
   "Not really, he'll spend on just about anything, expansion of healthcare, prescription medicine, education.. virtually every department has grown enormously, causes good or bad, the main thing is to spend\n\n \n Don't forget worthless missile systems, wars in the middle east, and abstinence education.", 
   {}, 
   271364, 
   null, 
   1183079280.0
  ], 
  [
   271790, 
   null, 
   "jyoshu", 
   "While Bush did indeed threaten to veto if there was no such amendment, I'm not sure why he's the focus here, or at least the total focus--the House of Representatives is the one that voted 224-200 for passing this amendment ensuring federal dollars couldn't be used. That's right--your Democratic-majority congress. (http://www.hrc.org/Template.cfm?Section=Press_Room&CONTENTID=37248&TEMPLATE=/ContentManagement/ContentDisplay.cfm) (and given the numbers, obviously a lot of Democrats voted against the funding. And of course, I'm just certain we'll see those Democrats criticized with the same fervor here in this forum as has been levied toward Bush. emoticon_xangel )\n \n Other sources I've read also state that the vote will have little practical effect because the city uses local funds for the partner registry.", 
   {}, 
   271295, 
   null, 
   1183224720.0
  ], 
  [
   271805, 
   null, 
   "lesz", 
   "While Bush did indeed threaten to veto if there was no such amendment, I'm not sure why he's the focus here, or at least the total focus--the House of Representatives is the one that voted 224-200 for passing this amendment ensuring federal dollars couldn't be used. That's right--your Democratic-majority congress. (http://www.hrc.org/Template.cfm?Section=Press_Room&CONTENTID=37248&TEMPLATE=/ContentManagement/ContentDisplay.cfm) (and given the numbers, obviously a lot of Democrats voted against the funding. And of course, I'm just certain we'll see those Democrats criticized with the same fervor here in this forum as has been levied toward Bush. emoticon_xangel )\n \n Other sources I've read also state that the vote will have little practical effect because the city uses local funds for the partner registry.\n\n \n I think we are all perfectly happy to criticise Democrats for not standing up to GOP homophobia! Let's not forget it was Bush who made gay people an issue here. It's your GOP that's the problem.", 
   {}, 
   271790, 
   null, 
   1183231260.0
  ], 
  [
   271846, 
   null, 
   "jyoshu", 
   "I think we are all perfectly happy to criticise Democrats for not standing up to GOP homophobia!\n\n \n Odd, since I don't remember ever seeing you do so when it was called for. You wish homophobia were limited to the GOP! :p The difference, of course, is that the GOP is not in the closet with their views about gays ... unlike much of your DNC, which strings you along with token favors, for the votes, making you think that they are aren't homophobic.", 
   {}, 
   271805, 
   null, 
   1183249380.0
  ], 
  [
   271850, 
   null, 
   "chemist99a", 
   "Odd, since I don't remember ever seeing you do so when it was called for. You wish homophobia were limited to the GOP! The difference, of course, is that the GOP is not in the closet with their views about gays ... unlike much of your DNC, which strings you along with token favors, for the votes, making you think that they are aren't homophobic.\n\n \n One can only wish that nobody was homophobic and than in fact both parties and all citizens were (homophobic)phobic.", 
   {}, 
   271846, 
   null, 
   1183250220.0
  ], 
  [
   271852, 
   null, 
   "jyoshu", 
   "One can only wish that nobody was homophobic and than in fact both parties\n\n \n Amen! Both parties are so far off the beaten path of actually doing the peoples' business, I've long given up on them.", 
   {}, 
   271850, 
   null, 
   1183251120.0
  ], 
  [
   271879, 
   null, 
   "foundit66", 
   "Odd, since I don't remember ever seeing you do so when it was called for. You wish homophobia were limited to the GOP! :p The difference, of course, is that the GOP is not in the closet with their views about gays ... unlike much of your DNC, which strings you along with token favors, for the votes, making you think that they are aren't homophobic.\n\n \n emoticon_rolleyes \n The democrat majority is fairly slim. If all of the Republicans voted for the bigotted amendment (which was brought up by a Republican), and a handful of the democrats also did, you'd get the 224-200 vote tally you saw.\n \n Took a little searching, but I eventually found the vote.\n http://clerk.house.gov/evs/2007/roll603.xml\n Republicans in italics. Democrats in Roman font on the web-page.\n You can see a flurry of italic names under \"Ayes\", with few democrats.\n Under the \"Noes\", it's a lot of Democrats, with few Republicans.\n Just like I expected.\n \n Quite frankly, homophobia IS more pronounced in the GOP, as seen by repeated demonstrations. Democratic party has some homophobia, but NOWHERE near as much. A few recent examples:\n 1) DADT. Republican candidates oppose repealing the military gay exclusion. Democrat candidates support repealing the military gay exclusion.\n \n 2) Hate crime legislation.\n \n 3) And despite what Jyoshu wants to exaggerate, THIS issue is also an example underscoring the Republicans being anti-gay, and the Democrats favoring gay equality.\n \n And NONE of these issues would even be coming up for gay support if it weren't for the democrats.\n NONE of these issues are \"token favors\" as Jyoshu would like to pretend.", 
   {}, 
   271846, 
   null, 
   1183269180.0
  ], 
  [
   271883, 
   null, 
   "MrWriteLA", 
   "All anyone has to do to see which party is more pro-gay is peruse the Congressional Scorecards put out by the HRC every other year. Republicans overwhelmingly back anti-gay legislation every time; Democrats overwhelmingly vote against it. And vice-versa on pro-gay legislation. It's a no-brainer.\n \n http://www.hrc.org/Template.cfm?Section=Congress_and_Scorecard&Template=/ContentManagement/ContentDisplay.cfm&ContentID=34269\n \n This particular poster's perennial insistance that the opposite is true is one of his more surreal delusions--as well as one that instantly identifies him to those of us who've encountered him over the years on other boards. Other anti-gay posters may be nuts, but only he's crazy enough to repeatedly insist in the face of blatant and easily demonstrable facts to the contrary that Republicans have the interests of gays at heart more than the Democrats. \n \n Just plain weird.", 
   {}, 
   271879, 
   null, 
   1183271760.0
  ], 
  [
   271907, 
   null, 
   "samiinh", 
   "Republicans have found gay-bashing to be an effective tool in getting votes. That's the reason they do it. If they didn't get votes from the low class ignorants who vote on such issues, mostly rightwing christers btw, they wouldn't do it. As shown last year with Mark Foley, there are lots of gays who work for repuke congress people on capital hill.", 
   {}, 
   271883, 
   null, 
   1183296900.0
  ], 
  [
   271945, 
   null, 
   "jyoshu", 
   "Democratic party has some homophobia, but NOWHERE near as much. A few recent examples:\n 1) DADT. Republican candidates oppose repealing the military gay exclusion. Democrat candidates support repealing the military gay exclusion.\n \n 2) Hate crime legislation.\n \n 3) And despite what Jyoshu wants to exaggerate, THIS issue is also an example underscoring the Republicans being anti-gay, and the Democrats favoring gay equality.\n \n And NONE of these issues would even be coming up for gay support if it weren't for the democrats.\n NONE of these issues are \"token favors\" as Jyoshu would like to pretend.\n\n \n They are politicians, just like the GOP are, and if all gays suddenly just stopped voting for Democrats for some reason, most of them would drop you like a hot potato. \n But it's ok, Foundit. You go right on believing the DNC really truly cares about gay people, rather than their votes. I'm sure the kool-aid tastes delicious. emoticon_xangel", 
   {}, 
   271879, 
   null, 
   1183319040.0
  ], 
  [
   271985, 
   null, 
   "Kronus", 
   "They are politicians, just like the GOP are, and if all gays suddenly just stopped voting for Democrats for some reason, most of them would drop you like a hot potato. \n But it's ok, Foundit. You go right on believing the DNC really truly cares about gay people, rather than their votes. I'm sure the kool-aid tastes delicious. emoticon_xangel\n\n \n When presented by hard data showing that Dems support gay rights while Rep fight them what do you do? Resort to sarcasm and insults. That's kinda sad. Given how divisive the issue is and how small the gay population is are you really trying to claim that Dems are going out on a political limb just to court the gay vote? Are you really trying to claim that, for example, Dem think tanks have calculated that supporting gay right will win more votes than it loses, and that's the sole reason that Dems do it? Or is this, as I suspect, one of your blind spots, where you simply can't imagine the side you support being on the wrong side, and the side you dislike being in the right?\n \n And, before you go there, I'm \"attacking the messenger\" because he abandoned civil debate and resorted to insults and sarcasm. Just FYI.", 
   {}, 
   271945, 
   null, 
   1183332780.0
  ], 
  [
   271989, 
   null, 
   "jyoshu", 
   "When presented by hard data showing that Dems support gay rights while Rep fight them what do you do?\n\n \n On the contrary, the \"hard data\" demonstrated tokenism quite well. emoticon_xgood \n \n \nGiven how divisive the issue is and how small the gay population is are you really trying to claim that Dems are going out on a political limb just to court the gay vote?\n \n \n Yep. Because special interest groups add up in terms of votes when you put them with other special interest groups. You get enough of those smaller groups like gays voting, and they start to make a big difference in terms of who gets elected if they're all voting the way you want them too. ;) Think of it like this--a $1 bill may not buy much these days, but get enough of 'em together and you may have some substantial cash in your wallet.", 
   {}, 
   271985, 
   null, 
   1183334280.0
  ], 
  [
   271997, 
   null, 
   "foundit66", 
   "They are politicians, just like the GOP are, and if all gays suddenly just stopped voting for Democrats for some reason, most of them would drop you like a hot potato. \n But it's ok, Foundit. You go right on believing the DNC really truly cares about gay people, rather than their votes. I'm sure the kool-aid tastes delicious. emoticon_xangel\n\n 1) Whatever you say Jyoshu.\n Obviously, democrat politicians are all just voting in favor to garner votes, and they secretly wish that they could all escort us to the gas chambers. emoticon_rolleyes \n \n 2) Quite frankly, even if what you claim were true, should I care?\n I vote for people who will vote a certain way.\n If their inner tree wants to fall towards the north instead of the south, but nobody hears it, does it really matter?\n \n 3) Maybe you're confusing them with the Republicans who claim to be for Christian values, but then spend so much time acting in obvious direct violation of Christ's values. emoticon_emb \n \n 4) Just out of curiousity, do you believe half the lame #### you type?\n \n \n \nOn the contrary, the \"hard data\" demonstrated tokenism quite well. \n\n We have offered actual voting records.\n What have you offered?\n \n What \"hard data\" do you think is out there that supports your claims?\n \n \"If you are going to make that accusation, you need to pony up and prove it.\"\n ***Jyoshu", 
   {}, 
   271945, 
   null, 
   1183336200.0
  ], 
  [
   272001, 
   null, 
   "jyoshu", 
   "1) Whatever you say Jyoshu.\n Obviously, democrat politicians are all just voting in favor to garner votes, and they secretly wish that they could all escort us to the gas chambers. emoticon_rolleyes \n\n \n Now you're just exaggerating, to the point of absurdity. That's not what I said at all. What's so hard for you to believe about the concept of politicians (of all people!) actually doing things for the votes? Are you so naive as to think that isn't common practice in Washington?\n \n \n2) Quite frankly, even if what you claim were true, should I care?\n I vote for people who will vote a certain way.\n\n \n Did I say you needed to care? That's up to you. \n \n \n3) Maybe you're confusing them with the Republicans who claim to be for Christian values, but then spend so much time acting in obvious direct violation of Christ's values.\n\n \n I think I did say they were ALL politicians, the GOP included. But I'm not so naive as to think that voting pro-gay on a few things equates to being some Gandhi or Jesus of a congressperson, either. They have their ulterior motives, which is the point.\n \n \n4) Just out of curiousity, do you believe half the lame #### you type?\n\n \n Now, now, that's not very nice. I'm not even going to bother responding to that bit of obvious ad hominem (that would get deleted and get you a warning if I cared enough to bother reporting it, which I don't).\n \n \nWe have offered actual voting records.\n What have you offered?\n \n What \"hard data\" do you think is out there that supports your claims?\n\n \n Wow. I can't believe I'm actually being asked to support the basic idea that politicians do things for ulterior motives--the votes! emoticon_xdonno Are you serious?? You have a very naive view of Washington, my friend. The record of votes you've presented only speaks to what they voted on--it does nothing to speak to their motivations.", 
   {}, 
   271997, 
   null, 
   1183337100.0
  ], 
  [
   272003, 
   null, 
   "foundit66", 
   "Now you're just exaggerating, to the point of absurdity. That's not what I said at all.\n\n Yes. It's hyperbole.\n I was essentially trying to put up the entire spectrum, ranging from Democratic politicians losing sleep at night over gays not having equal rights, and secretly wishing to herd them off to the gas chambers.\n I never claimed it was what you were saying.\n \n \n \nWhat's so hard for you to believe about the concept of politicians (of all people!) actually doing things for the votes? Are you so naive as to think that isn't common practice in Washington?\n\n What's so hard for you to believe about the concept of \"I don't care\"?\n And what's so hard for you to believe about the concept that you HAVEN'T PROVEN ANY of this ####?\n \n I'm not talking about the idea that politicians will vote as political whores for votes, but rather regarding your SPECIFIC claims regarding the democrats.\n Prove it.\n \n \n \nDid I say you needed to care? That's up to you. \n\n No. You didn't.\n I just thought there must be something in the way you kept bringing this up, and kept trying to worm in some claim of yours.\n I mean, the earlier one was shot down definitively, so now you have to work on something else, right?\n \n I really don't care if they vote one way and inwardly feel another.\n But since YOU keep bringing it up, maybe the question should be why do you care?\n \n \n \nI think I did say they were ALL politicians, the GOP included. But I'm not so naive as to think that voting pro-gay on a few things equates to being some Gandhi or Jesus of a congressperson, either.\n\n Gee. What did you just say to me?\n I think it is so fitting to use your own words against you...\n \"Now you're just exaggerating, to the point of absurdity. That's not what I said at all.\"\n emoticon_xgood \n \n \n \nNow, now, that's not very nice. I'm not even going to bother responding to that bit of obvious ad hominem (that would get deleted and get you a warning if I cared enough to bother reporting it, which I don't).\n\n emoticon_xdonno \n Jyoshu, I've seen you try this dumb tactic the first time I came to the board.\n Trying to scare me with threats of reporting me and the like...\n \n That wasn't ad hominem.\n I was talking about your argument.\n My thoughts about you are purposely not stated... emoticon_xangel \n \n \n \nWow. I can't believe I'm actually being asked to support the basic idea that politicians do things for ulterior motives--the votes! emoticon_xdonno Are you serious?? You have a very naive view of Washington, my friend. The record of votes you've presented only speaks to what they voted on--it does nothing to speak to their motivations.\n\n Again, I am talking about you proving a SPECIFIC claim.\n The claim regarding the democratic politician personal opinions on gays, despite their voting records.\n \n Don't try to change the subject.\n I know it's easy and what you're used to, but I'm not going to let you get away with it.\n I'm asking you for proof about your SPECIFIC claim. Not the generality of the issue, which is your current obfuscation.\n \"If you are going to make that accusation, you need to pony up and prove it.\"\n ***Jyoshu\n \n This is like you claiming that John murdered Jane. Me asking for proof.\n And you responding that you don't understand how I could be so naive to think that humans don't murder other humans.\n That's not the point.\n The point is you to prove what you ACTUALLY said...\n \n \n And on a separate note, I could just as honestly claim that the Republicans secretly support gays. And the only reason they vote against gay rights is because they are catering to their religious right minority group. emoticon_xgood", 
   {}, 
   272001, 
   null, 
   1183337940.0
  ], 
  [
   272006, 
   null, 
   "jyoshu", 
   "I'm not talking about the idea that politicians will vote as political whores for votes, but rather regarding your SPECIFIC claims regarding the democrats.\n Prove it.\n \n I'm asking you for proof about your SPECIFIC claim. Not the generality of the issue, which is your current obfuscation.\n\n \n What suffices as proof here? There is the idea, as you just said, that politicians will vote as political whores, and (guess what!) the democrats we're talking about ARE politicians. Why would this issue (gay rights) be any different than any other thing politicians do? There's no reason to think it would be, so I see no reason not to think that's proof enough right there.\n \n You seem to want to give them the benefit of the doubt when it comes to votes on gay rights issues. I don't. I see no more reason to do so in such cases than votes for anything other special interest group. \n \n \nI really don't care if they vote one way and inwardly feel another. But since YOU keep bringing it up, maybe the question should be why do you care?\n\n \n The reason you should care, or at least be cognizant of the fact, is that it's the sort of thing to watch out for in that it can work against you at some point. But again, it's up to you. If you don't care about the motivations of your congresspeople, that's your business. \n \n \nAnd on a separate note, I could just as honestly claim that the Republicans secretly support gays. And the only reason they vote against gay rights is because they are catering to their religious right minority group. emoticon_xgood\n\n \n No, not exactly. Your view would attribute real benevolent intentions to one group, while mine would attribute the more realistic hunger-for-power motivation. But I would certainly agree one of the biggest reasons they vote the way they do is because they want to cater to the RR. Though it's not the only reason. Rest assured, my cynicism crosses both sides of the aisle. \n \n It looks like our main difference here is that I tend to be cynical and suspicious of politicians in general when it comes to motivations, and apparently you're much more inclined to give them the benefit of the doubt on motivations (particularly when they vote the way you prefer on gay rights-related issues).", 
   {}, 
   272003, 
   null, 
   1183342620.0
  ], 
  [
   272009, 
   null, 
   "foundit66", 
   "What suffices as proof here?\n\n Why don't you start by actually showing what you consider as \"proof\" and we'll go from there, okay?\n I just plain don't think you have any.\n I could be wrong, but I welcome you to try to substantiate what you claimed.\n \n \n \nThere is the idea, as you just said, that politicians will vote as political whores, and (guess what!) the democrats we're talking about ARE politicians. Why would this issue (gay rights) be any different than any other thing politicians do? There's no reason to think it would be, so I see no reason not to think that's proof enough right there.\n\n :xbanghead \n No. I take that back. What you just said was HILARIOUS!\n I mean, using the example I gave earlier, you're accusing John of ACTUALLY murdering Jane.\n And NOW you claim that just because humans obviously can kill one another, then that OBVIOUSLY means that John ACTUALLY murdered Jane...\n \n That's funny! emoticon_xagree \n \n \n \nYou seem to want to give them the benefit of the doubt when it comes to votes on gay rights issues. I don't. I see no more reason to do so in such cases than votes for anything other special interest group.\n\n Jyoshu, I am giving them an astonishing idea that their thoughts may ACTUALLY coincide with their actions.\n I am taking the *leap of faith* that they may not be hypocrites on this issue WITHOUT PROOF of such.\n \n I know. It's a bizarre concept for people's PUBLIC STATEMENTS on a matter actually aligning with their inner thoughts.\n I can understand why some have difficulty with that concept... emoticon_rolleyes \n \n \n \nThe reason you should care, or at least be cognizant of the fact, is that it's the sort of thing to watch out for in that it can work against you at some point. But again, it's up to you. If you don't care about the motivations of your congresspeople, that's your business.\n\n \"work against me\"?\n Jyoshu, try to think of this logically for a minute.\n \n A) Person A states that homosexuals are an abomination. He votes against any domestic partner recognition, gays in the military, gay adoption, ...\n B) Person B states that he supports gay equality. He votes for domestic partner recognition, gays in the military, gay adoption, ...\n \n Now, you come along and tell me that Person B (with NO proof supplied by you) has an anti-gay inner core.\n Where does that leave me?\n Should I vote for Person A???\n Of course not.\n \n Should I vote for Person B, and then if any semblance of abandonment of a gay equality platform is seen, I can act upon that?\n Yes. Much more rational.\n \n So you see, you have conjured up a pretense of how a group MIGHT be thinking, and that leaves me exactly with WHAT action??? emoticon_rolleyes \n \n \n All this aside, what you are REALLY trying to do is boringly transparent... emoticon_cool \n \n \n \nNo, not exactly. Your view would attribute real benevolent intentions to one group, while mine would attribute the more realistic hunger-for-power motivation.\n\n No, jyoshu, you're wrong again.\n MY view would not care about their \"intentions\" at all.\n \n It's their ACTIONS which are important.\n Why get bogged down in trying to second guess how hypocritical they are WITH NO EVIDENCE???\n \n \n \nIt looks like our main difference here is that I tend to be cynical and suspicious of politicians in general when it comes to motivations, and apparently you're much more inclined to give them the benefit of the doubt on motivations (particularly when they vote the way you prefer on gay rights-related issues).\n\n Again, no.\n It's that I really don't care.\n \n Tell me Jyoshu. If a politician stepped forward who said he was going to vote for X, and you wanted him to vote for X, HOW MUCH would it change things if you suddenly found out that he didn't really want to vote for X?\n \n ESPECIALLY when his opponent did not support X???", 
   {}, 
   272006, 
   null, 
   1183345440.0
  ], 
  [
   272010, 
   null, 
   "foundit66", 
   "In retrospect, I think I am possibly beginning to understand a little bit more about the origins of Jyoshu's concern over *Democrats \"token\" voting gay, but opposing them in their hearts* rant.\n \n I think it comes from a mis-placed desire to apply REPUBLICAN fixation and scandals to the whole \"Democrat\" thing.\n I mean, there are a lot of gay republicans who are elected to office but they HAVE to stay in the closet. Being outed could mean the end of their career.\n And often, these closeted gay republicans support anti-gay measures. Consistent with the party line, but sacrificing ideals of self-equality in order to support prejudice and discrimination.\n \n And I think we can come up with a variety of examples along these lines. \n Both in and out of office.\n \n Another area of parallel is in the christian church itself. Like Haggard, who was avidly anti-gay, but gay in the closet. Just look at how Falwell and his fellow christian power-houses scurried away from the spotlight when it was shown on him!\n And ex-gays who revert, and then are subsequently abandoned and ignored? Don't get me started...\n \n Maybe THAT is why he thinks we should be overly concerned with the idea that democrat politicians may be inwardly opposed to how they are actually talking and voting?\n Because we should be more like Republicans and Christians who do so? emoticon_rolleyes \n \n \n And unlike Jyoshu's rantings, these are REAL LIFE examples.\n This is \"hard data\" as Jyoshu would put it.\n Stuff he claimed to have, but obviously has not yet produced... emoticon_rolleyes", 
   {}, 
   272009, 
   null, 
   1183347360.0
  ], 
  [
   272011, 
   null, 
   "robbie0517", 
   "On the contrary, the \"hard data\" demonstrated tokenism quite well. emoticon_xgood \n \n \n \n Yep. Because special interest groups add up in terms of votes when you put them with other special interest groups. You get enough of those smaller groups like gays voting, and they start to make a big difference in terms of who gets elected if they're all voting the way you want them too. ;) Think of it like this--a $1 bill may not buy much these days, but get enough of 'em together and you may have some substantial cash in your wallet.\n\n \n It's not just hte gay dollar. It the money from the friends, family , co-workers and just sensible people that support equality.", 
   {}, 
   271989, 
   null, 
   1183349640.0
  ], 
  [
   272012, 
   null, 
   "robbie0517", 
   "They are politicians, just like the GOP are, and if all gays suddenly just stopped voting for Democrats for some reason, most of them would drop you like a hot potato. \n But it's ok, Foundit. You go right on believing the DNC really truly cares about gay people, rather than their votes. I'm sure the kool-aid tastes delicious. emoticon_xangel\n\n \n \n And you go on thinking the GOP really cares about you and your family. It's about your money and your vote.", 
   {}, 
   271945, 
   null, 
   1183350000.0
  ], 
  [
   272030, 
   null, 
   "lesz", 
   "To be honest, I think most Democratic pols just wish the earth would open up and swallow every last gay person. And it is also true that there are bigots among Democrats.\n \n However, even though not every Democrat is as supportive of equal rights as a gay person might wish, and even though a few are relatively hostile, that's as nothing compared to the anti-gay activism of the GOP. Now that is malice on speed.\n \n Of course, to be fair, not every GOP pol is viciously hostile to gay people, or willing to sell them for votes from the harsh right, but that wing of the party has far too much influence to make it comfortable for most gays to vote Republican. One might as well ask the condemned man to smile on his executioner.\n \n The Democrats aren't perfect, but in an imperfect but democratic world, you have to pick the least worst option, because the best isn't always going to be viable or available. Democrats won't do everything gay Americans need to have done, and they won't do it as quickly as one might wish, but at the very least, they'll cause less harm to gays than the GOP in its present state.\n \n And of course, there are so many other reasons not to support the GOP as well, that even gay voters who aren't single issue voters -- and few people really are -- have little incentive to vote GOP.", 
   {}, 
   272012, 
   null, 
   1183382880.0
  ], 
  [
   272039, 
   null, 
   "jyoshu", 
   "Maybe THAT is why he thinks we should be overly concerned with the idea that democrat politicians may be inwardly opposed to how they are actually talking and voting?\n Because we should be more like Republicans and Christians who do so?\n\n \n \"Overly concerned\"??? The thing that blows me away is that you are apparently totally unconcerned in any way whatsoever! This is not about republicans versus Democrats, sex scandals, or how many gays are in each party. This is about the fact that Washington is a culture of people doing things for the votes, and that you seem to think gay-rights voting people are above that in terms of motivation. Then, when you started to realize that such a view is pretty downright naive, you switch over to this canard about \"I don't care\" or \"why should I care\". You apparently think gay-rights voting politicians only use pure bona fide integrity as their motivation. And I say most of them are probably more like every other politician out there. That's been our difference here, no matter how much you try to change the subject.\n \n \nAnd you go on thinking the GOP really cares about you and your family. It's about your money and your vote.\n\n \n Actually, no I don't. I think the are a bunch of scoundrels as well.", 
   {}, 
   272010, 
   null, 
   1183389360.0
  ], 
  [
   272080, 
   null, 
   "foundit66", 
   "\"Overly concerned\"??? The thing that blows me away is that you are apparently totally unconcerned in any way whatsoever! This is not about republicans versus Democrats, sex scandals, or how many gays are in each party. This is about the fact that Washington is a culture of people doing things for the votes, and that you seem to think gay-rights voting people are above that in terms of motivation. Then, when you started to realize that such a view is pretty downright naive...\n\n When WHAT view was \"naive\" jyoshu? (Please quote my naive statement for the sake of accuracy.)\n \n Wow. Even when you haven't a foot-hold to go on, you STILL press on with your obfuscation and falsehoods.\n Let me guess. I'll get no answer to that question?\n \n \n \n..., you switch over to this canard about \"I don't care\" or \"why should I care\". You apparently think gay-rights voting politicians only use pure bona fide integrity as their motivation.\n\n And there he goes again.\n The issue at hand has ALWAYS been YOUR claims on this subject, but you keep trying to twist it back around on me because you CANNOT PROVE your claims on this subject.\n Not going to work.\n \n In retrospect, it's funny to watch. You have back-tracked from trying to blame democrats for the anti-gay D.C. funding amendment passing, to claiming that democrats just give gays \"token\" moves, to professing that there were \"hard facts\" that democrat politicians were anti-gay at their core, to proclaiming that just because it was POSSIBLE, he didn't need to prove anything.\n \n And of course, at NO stage of ANY of this have you actually truly tried to \"prove\" anything. \n And now, since you KNOW you can't prove your claims, you instead try to twist this around on me and use it to criticize me for a statement I NEVER MADE, and have REPEATEDLY REFUTED, but you keep on trying to pin it on me because it takes the heat off of you proving your claims. emoticon_rolleyes \n \n \n \nAnd I say most of them are probably more like every other politician out there. That's been our difference here, no matter how much you try to change the subject.\n\n ROFLMAO!!!!\n That got a belly laugh!\n \n No, jyoshu, this has NOT been about that.\n This has been about you claiming that democrats just offer \"token\" legislation for gays.\n But the subject got changed off of that when you were pressed for proof, and when your claim was refuted.\n This has been about you claiming that you had \"hard facts\" that democratic politicians (in general) thought differently than supporting gay equality.\n But the subject got changed off of that when you were pressed for proof, and when your claim was refuted.\n \n No, Jyoshu, it has been YOU who has been trying to change this subject from the start. emoticon_rolleyes", 
   {}, 
   272039, 
   null, 
   1183423380.0
  ], 
  [
   272090, 
   null, 
   "jyoshu", 
   "When WHAT view was \"naive\" jyoshu? (Please quote my naive statement for the sake of accuracy.)\n\n I'm talking about your apparent overall VIEW that the democrats who vote for gay rights aren't doing it just to get the votes. Why don't you just stop the games like \"I-don't-really-care\" and come out and say whether or not you think they do, once and for all?\n \n \nAnd there he goes again.\n The issue at hand has ALWAYS been YOUR claims on this subject, but you keep trying to twist it back around on me because you CANNOT PROVE your claims on this subject. In retrospect, it's funny to watch. You have back-tracked from trying to blame democrats for the anti-gay D.C. funding amendment passing blah, blah, blah, blah, blah, blah ...\n\n \n Maybe that's YOUR issue Foundit, but it ain't mine. GEEEEZ!  I've never seen someone try to avoid the issue of the forest fire so much by quibbling over the #### trees. :xbanghead Good lord. emoticon_xdonno If you don't agree with me that Dems are just as much scoundrel politicians as the GOP then just say so and MOVE ON.", 
   {}, 
   272080, 
   null, 
   1183432140.0
  ], 
  [
   272091, 
   null, 
   "foundit66", 
   "I'm talking about your apparent overall VIEW that the democrats who vote for gay rights aren't doing it just to get the votes.\n\n And THERE is the key-word...\n \"apparent\"...\n You have to throw that in there because I NEVER SAID what you want to associate with me.\n In fact, I EXPLICITLY made it clear that it just plain does not matter. I don't bother with such pointless conjecture, because it CHANGES NOTHING.\n And that is a fact which you continually avoid.\n \n Like I stated earlier, WHAT DOES IT CHANGE???\n If the democrat who votes for gay equality is doing it just for the votes, does it change my options any? Does it make Republicans more viable? The party that has built its back-bone on anti-gay prejudice? The party that slurs gays as a voting drive mechanism?\n \n And more importantly, like I keep pointing out but you keep on avoiding, this is you CHANGING THE SUBJECT.\n Earlier you claimed there were \"hard facts\" that you could show ...\n And when pressed, you THOROUGHLY FAILED to offer any.\n \n You're trying to put the focus on me to ignore the absolutely ridiculous claims you have made, which you KNOW you can't prove.\n \n \n \nWhy don't you just stop the games like \"I-don't-really-care\" and come out and say whether or not you think they do, once and for all?\n\n Because I'm waiting on YOU to supply the proof YOU CLAIMED to have that I asked you EARLIER.\n Only fair, right? emoticon_xgood \n \n \n \nMaybe that's YOUR issue Foundit, but it ain't mine. GEEEEZ!  I've never seen someone try to avoid the issue of the forest fire so much by quibbling over the #### trees. :xbanghead\n\n Oh my LANTA!\n You are SO blatantly dishonest it isn't funny.\n It \"aint your\" issue???\n \n And I imagine after I point out the truth on this, you'll bawl and cry and complain about \"ad hominem\" when there isn't any...\n \n Anyways, let's take a trip down memory lane, shall we?\n And HONESTLY see what YOUR REAL \"issues\" have been about.\n \n Jyoshu: I'm not sure why he's the focus here, or at least the total focus--the House of Representatives is the one that voted 224-200 for passing this amendment ensuring federal dollars couldn't be used. That's right--your Democratic-majority congress. (http://www.hrc.org/Template.cfm?Sect...entDisplay.cfm) (and given the numbers, obviously a lot of Democrats voted against the funding. Proven false. The vast majority of democrats voted against this prejudiced amendment.\n Next false Jyoshu claim?\n \n Jyoshu: unlike much of your DNC, which strings you along with token favorsAnd when the \"favors\" were examined, they were far from \"token\".\n They pretty much cover all the major issues at hand. DADT, gay adoption, gay union recognition...\n Next false Jyoshu claim?\n \n Jyoshu: On the contrary, the \"hard data\" demonstrated tokenism quite well.When pressed for this \"hard data\", he thoroughly fails. Instead, he gives the laughable explanation that just because it could be the situation, that\\'s proof that it is...\n http://www.4forums.com/political/272006-post23.html\n \n \n And since you have FAILED so miserably in all these attempts, you are now attempting to press me on something that, like I said, is essentially irrelevant to my future actions.\n (And of course, the fact that it is completely irrelevant to my voting actions is never refuted either...)\n \n \n \nGood lord. emoticon_xdonno If you don't agree with me that Dems are just as much scoundrel politicians as the GOP then just say so and MOVE ON.\n\n Jyoshu, I have explicitly explained above what I do not agree with you on.\n If you no longer hold those positions, and you agree that it was laughable to even to try to make those arguments, I suggest that you move on.\n \n Oh wait. You already have?\n Hmmmm. Where does that leave us?\n Oh yeah. Let's refer to YOUR own words again...\n \"Well since you didn't address my points, I'll assume you're done! A simple \"ok, I concede that ... and moving on back to the issues ...\"\n ***Jyoshu\n \n Thank you for finally \"agreeing\" that you were inexplicably wrong in what you said, as much as you are obviously \"capable\" of...\n (quotes denoting sarcasm)", 
   {}, 
   272090, 
   null, 
   1183435020.0
  ], 
  [
   272132, 
   null, 
   "lesz", 
   "If you don't agree with me that Dems are just as much scoundrel politicians as the GOP then just say so and MOVE ON.\n\n \n On the specific issue of gay rights, there are many more Democrats who have become convinced that justice requires equality for gay Americans than there are Republicans. It doesn't matter whether the rest are scoundrels to some extent. Nor does it really matter whether they vote our way from expediency or conviction.\n \n However, given public reservations, I doubt there are many pols who support equal rights out sheer expediency, and very few congressional districts where taking an anti-equal rights stance will cost you more votes than it will gain -- and they are mostly solid Democrat anyway.\n \n The GOP as it currently stands is solidly anti-gay, anti-equal rights. They are beholden to Christian mullahs. The Democrats may not be solidly pro-equality, but it is stupid to suggest there is nothing to choose between them on this issue. That's the sort of argument made by right-wing activists who want to muddy the water in an effort to shore up a crumbling GOP vote.", 
   {}, 
   272090, 
   null, 
   1183458900.0
  ], 
  [
   272139, 
   null, 
   "samiinh", 
   "On the specific issue of gay rights, there are many more Democrats who have become convinced that justice requires equality for gay Americans than there are Republicans. It doesn't matter whether the rest are scoundrels to some extent. Nor does it really matter whether they vote our way from expediency or conviction.\n \n However, given public reservations, I doubt there are many pols who support equal rights out sheer expediency, and very few congressional districts where taking an anti-equal rights stance will cost you more votes than it will gain -- and they are mostly solid Democrat anyway.\n \n The GOP as it currently stands is solidly anti-gay, anti-equal rights. They are beholden to Christian mullahs. The Democrats may not be solidly pro-equality, but it is stupid to suggest there is nothing to choose between them on this issue. That's the sort of argument made by right-wing activists who want to muddy the water in an effort to shore up a crumbling GOP vote.\n\n \n I like that...christian mullahs. The GOP uses the gay issue to get votes. They really don't care, as long as the ignorant like AA continue to vote for them.", 
   {}, 
   272132, 
   null, 
   1183466940.0
  ], 
  [
   272141, 
   null, 
   "chemist99a", 
   "Problem is of course that then they end up having to hire say lawyers from Pat Robisnsons law school. And of course those folks are not up to the defense of their employers. However worry not, there is always the Scooter manuver. They find you guilty but you don't get punished because you have a get out of jail free card!\n \n Even the Republicans may start to question whether they really want a monopoly on the mullah votes. At least in the past (as in Nixon) their legal talent could put up a better fight than claiming that the VP is not part of the executive branch, and find better supreme court nominees than Harriet Meyers. \n \n Who knows maybe the two parties will next go to war over the gay voter block, I would love to see Brownback for example speaking to a gay audience trying to get votes, now that would be a sight. Or Romney for that matter.", 
   {}, 
   272139, 
   null, 
   1183470720.0
  ], 
  [
   281097, 
   null, 
   "robbie0517", 
   "I thought this would be the proper thread to post this.. It's pretty much a continuous of his anti-gay agenda to appease his shrinking religious base. \n \n http://www.hrcbackstory.org/hate_crimes/index.html\n \n \nToday, in another misguided swipe at the hate crimes bill, President Bush has again threatened to veto the Defense Authorization bill if it is sent to his desk with the hate crimes language, the Washington Times reported today: \n \n President Bush is committed to vetoing the latest effort to expand federal \"hate crimes\" laws to include sexual orientation, even if it means sending a defense authorization bill back to Congress, the White House said.\n \n \"The qualifications [in the bill] are so broad that virtually any crime involving a homosexual individual has potential to have hate crimes elements,\" said White House spokesman Tony Fratto....\n \n Mr. Fratto said the president, who has pushed for quick approval of spending for U.S. troops, would send the defense bill back to Capitol Hill if the hate-crime amendment remains attached.\n \n Obviously, this latest threat presents a legislative challenge for us to overcome. Keep in mind that the last time hate crimes passed in the Senate, we secured 65 votes. That makes a VERY strong statement. But that's why it's good to have friends in the leadership who will work with us to find a vehicle to get the hate crimes protections signed into law, as Joe Solmonese stated in a post at Bilerico: \n \n Progress on pro-GLBT legislation in this Congress is real, meaningful and significant. Congress often moves slower than people want or expect, so it is understandable that some grow frustrated when the final results are not immediate. In this Congress, we have already witnessed a heightened visibility and concern for GLBT issues that affect our community, including hate crimes. Senators Kennedy and Smith and the Senate Democratic Leadership remain committed to passage of the Matthew Shepard Local Law Enforcement Hate Crimes Prevention Act this year. They are working with us to find ways to ensure enactment of the legislation. \n \n It's really sad, but apparently Bush never tires of catering to his base, despite the undeniable (and well publicized) loss of confidence in his judgment and leadership by the majority of Americans. It's not that complicated. In May, Gallup released a poll that showed overwhelming support for adding sexual orientation and gender identity to the new hate crimes law. There was strong support across demographic lines. There were just 26% of Americans against the new law. A recent Newsweek poll shows Bush's approval hovering around 29%. I bet if we ran the cross-tabs, we'd see they are the same people. George Bush is simply playing to his ever shrinking base - and against the wishes of most Americans who know how badly updated federal hate crimes laws are needed.\n\n \n \n \nConstitutional law professor calls the claims by religious conservatives that the hate crimes bill threatens free speech \"ridiculous\"\n August 23, 2007\n Chris Johnson\n A University of Chicago law professor with expertise in constitutional law, Geoffrey Stone, refutes the claims by members of the religious right that the hate crimes legislation threatens free speech in an editorial in the LA Times today. He grounds his arguments in three important points:\n \n For at least three reasons, this argument is completely unfounded. First, the Matthew Shepard Act would not prohibit \"attempts to incite.\" It would prohibit only the infliction of bodily harm and attempts to cause bodily harm. The latter refers to firing a gun and missing, not giving a sermon.\n \n Second, it is settled 1st Amendment law that an individual cannot constitutionally be punished for attempting to incite others to commit crimes unless the speaker expressly incites unlawful conduct and such conduct is likely to occur imminently. The last time the Supreme Court upheld a criminal conviction for incitement was more than half a century ago, in the case of Dennis vs. U.S., and that involved incitement to violent overthrow of the government. Unless the pastors intend to expressly incite wild-eyed mobs to beat up gays because of their sexual orientation, they are in no danger from this law.\n \n Third, the legislation expressly provides that \"nothing in this act . . . shall be construed to prohibit any expressive conduct protected\" by the 1st Amendment. In other words -- indeed, in the most explicit words possible -- the act could not be applied to the pastors unless their sermons are unprotected by the 1st Amendment, a concept that is impossible to imagine. \n \n The 1st Amendment protects the right of Nazis to march in Skokie, the right of racists to assert that blacks are inferior, the right of atheists to denounce Christianity and the right of homophobes to condemn homosexuality. The argument of the pastors that the proposed legislation in any way threatens their right to preach their version of the Gospel is, to be frank, ridiculous. \n \n Congress will be reconvening in a few weeks to wrap up unfinished business, including passing the Department of Defense reauthorization bill in the Senate that the hate crimes bill is currently attached to as an amendment. We know that the religious right will continue to fight the hate crimes bill each step of the way - and we'll be ready.\n", 
   {
    "post_info": {
     "post_title": "In a high-five to his base, President Bush threatens to veto hate crimes bill (again)"
    }, 
    "unicode_changes_made": true
   }, 
   272141, 
   null, 
   1188269700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush Threatens To Veto DC Budget For Not Blocking Domestic Partner Funds", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10064-bush-threatens-veto-dc-budget-not-blocking-domestic-partner-funds.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10064, 
  "discussion_files": [
   [
    "15137.html", 
    "http://www.4forums.com/political/gay-rights-debates/10064-bush-threatens-veto-dc-budget-not-blocking-domestic-partner-funds-print.html"
   ], 
   [
    "15138.html", 
    "http://www.4forums.com/political/gay-rights-debates/10064-bush-threatens-veto-dc-budget-not-blocking-domestic-partner-funds-3-print.html"
   ], 
   [
    "15139.html", 
    "http://www.4forums.com/political/gay-rights-debates/10064-bush-threatens-veto-dc-budget-not-blocking-domestic-partner-funds-2-print.html"
   ]
  ], 
  "identifier": 10064
 }
]