[
 [
  [
   271591, 
   null, 
   "wascallywabbit", 
   "**\n \n FYI--\n \n http://www.nytimes.com/2007/06/26/science/26essay.html?_r=2&oref=slogin&oref=slogin", 
   {
    "post_info": {
     "post_title": "Me, (EAM), against you lot (darwinism)"
    }
   }, 
   null, 
   null, 
   1183134060.0
  ], 
  [
   271594, 
   null, 
   "lesz", 
   "Sweetums, if you weren't so pigheaded, you'd have realised we already have a board on this here:\n \n http://www.4forums.com/political/showthread.php?t=10055", 
   {}, 
   271591, 
   null, 
   1183134540.0
  ], 
  [
   271597, 
   null, 
   "chemist99a", 
   "http://www.sciencemag.org/cgi/content/abstract/316/5833/1862\n http://www.sciencemag.org/cgi/content/abstract/316/5833/1893\n http://www.sciencemag.org/cgi/content/abstract/316/5833/1895\n \n FYI WW. And thats just this week in a single journal. Not a mention of EAM. Plenty of mention of selection, evolution, genes, etc. Guess you are badly outnumbered.\n \n And incidentally that article has been covered elsewhere and is not supportive of your POV either. Per SOP.", 
   {}, 
   271594, 
   null, 
   1183136280.0
  ], 
  [
   271598, 
   null, 
   "chemist99a", 
   "National Liberation Front (Greece)\n From Wikipedia, the free encyclopedia\n Jump to: navigation, search\n \n The National Liberation Front (EAM) (Greek: &#917;&#952;&#957;&#953;&#954;&#972; &#913;&#960;&#949;&#955;&#949;&#965;&#952;&#949;&#961;&#969;&#964;&#953;&#954;&#972; &#924;&#941;&#964;&#969;&#960;&#959; (&#917;&#913;&#924;), Ethniko Apeleftherotiko Metopo) was the main movement of the Greek Resistance during the Axis occupation of Greece during World War II. Its main driving force was the Communist Party of Greece (KKE), but its membership throughout the Occupation period included several other leftist and republican groups. EAM became the first true mass social movement in modern Greek history, and even established its own government, the Political Committee of National Liberation, in the areas it had liberated in spring 1944. At the same time, from late 1943 onwards, the political enmity between EAM and rival resistance groups from the right evolved into a virtual civil war, which was ended only with the Lebanon conference in May 1944. The organization reached its peak after Liberation in late 1944, when it controlled most of the country, before suffering a catastrophic military and political defeat against British forces in the December 1944 events. This marked the beginning of its gradual decline and the open persecution of its members by the Allied-backed conservative post-war Greek elite, leading eventually to the outbreak of the Greek Civil Wa", 
   {}, 
   271597, 
   null, 
   1183136520.0
  ], 
  [
   271654, 
   null, 
   "wascallywabbit", 
   "Sweetums, if you weren't so pigheaded, you'd have realised we already have a board on this here:\n \n http://www.4forums.com/political/showthread.php?t=10055\n\n \n **\n Girly, if you weren't so puffed-up, petty, and vain you wouldn't have bothered to mention it.\n \n After all, it was simply one of several articles you mention in your OP, one which is never brought up again, even though the thread extends for four pages of creationism vs darwinism junk.\n \n And of course, in your top-lofty girlish vanity, your only mention of the article was to airily dismiss its author's contention of a scientific paradigm shift, denigrating it to a mere extension of your ideology's Borg-like ability to assimilate everything and anything that contradicts it.\n \n Now, now, don't go throwing another of your little hissy-fits over this. You'll just smear your make-up and make your wig tilt at an awkward angle.", 
   {}, 
   271594, 
   null, 
   1183148760.0
  ], 
  [
   271656, 
   null, 
   "wascallywabbit", 
   "[QUOTE=chemist99a;271597]http://www.sciencemag.org/cgi/content/abstract/316/5833/1862\n http://www.sciencemag.org/cgi/content/abstract/316/5833/1893\n http://www.sciencemag.org/cgi/content/abstract/316/5833/1895/[quote]\n \n **\n Like so much of what you post, these links are non-sequitur in this thread. You have a real talent for offering the irrelevent and impertinent out of a blue sky.\n \n \n\n FYI WW. And thats just this week in a single journal. Not a mention of EAM.\n\n \n **\n Golly!! You don't say?! And here we all know that if it isn't printed in \"the literature\", it isn't real, so it can't be true. That, folks, is because like the creationist's bible, the darwinist academic literature is the source and well-spring of all possible TRUTH.\n \n \n\n Plenty of mention of selection, evolution, genes, etc. Guess you are badly outnumbered.\n\n \n **\n Big surprise, since I'm vastly outnumbered here, too. Good thing that reality, truth, sanity, and rightness, are not matters of democratic vote and popularity contests. I guess. Except among you darwinists, of course.\n \n \n\n And incidentally that article has been covered elsewhere and is not supportive of your POV either. Per SOP.\n\n \n **\n No, it has not, despite what you and your girlfriend say. And, whether it supports my POV, as I believe it does, is not the point. The point is that my POV is valid, scientific, and becoming increasingly accepted, while your darwinist boat, riddled with leaks and worm holes from day one, is finally being allowed to sink to the bottom without further plugging up and bailing out.", 
   {}, 
   271597, 
   null, 
   1183149840.0
  ], 
  [
   271662, 
   null, 
   "chemist99a", 
   "Consider the battle of Lyete Gulf.\n \n Every breath you take\n Every move you make\n Every bond you break\n Every step you take\n Ill be watching you\n \n Every single day\n Every word you say\n Every game you play\n Every night you stay\n Ill be watching you", 
   {}, 
   271656, 
   null, 
   1183152360.0
  ], 
  [
   271679, 
   null, 
   "chemist99a", 
   "No, it has not, despite what you and your girlfriend say. And, whether it supports my POV, as I believe it does, is not the point. The point is that my POV is valid, scientific, and becoming increasingly accepted, while your darwinist boat, riddled with leaks and worm holes from day one, is finally being allowed to sink to the bottom without further plugging up and bailing out\n\n \n Well actually I have not seen your point of view expressed anywhere but on these forums. Seems to me if its rising to ascendancy at least ONE scientist somewhere would have recently at least mentioned it. Quick search reveals NO mentions at all. Of course if you say its displacing NDS then I guess I will have to agree - you being a well known biologist and all, but I remain perhaps a bit irrationaly skeptical.", 
   {}, 
   271656, 
   null, 
   1183154640.0
  ], 
  [
   271784, 
   null, 
   "lesz", 
   "Wabbits should stick to wettuce... science is beyond their ability to digest!", 
   {}, 
   271679, 
   null, 
   1183223280.0
  ], 
  [
   271808, 
   null, 
   "wascallywabbit", 
   "Wabbits should stick to wettuce... science is beyond their ability to digest!\n\n \n **\n If you check the times on her posts, gang, you'll find that it took les all of 8 minutes to come up with this gem of a mature, considered, information-rich response. Says it all.", 
   {}, 
   271784, 
   null, 
   1183237440.0
  ], 
  [
   271848, 
   null, 
   "chemist99a", 
   "Indeed its fairly easy to make self-evidently true observations quickly and get them onto paper. Go Les. Your comment on lagomorph nutrition is very good. Indeed you and I both know how rabbits DO digest their intake. They usually don't eat a very protein (or science rich diet) and after the first attempt at digestion (which is inefficient and largely ineffective) they recycle to now bacterial loaded feces and pass them by the stomach again. Its disgustion, but it evolved that way, and it works for most rabbits. Some however have dominant mutations which cause them to NEVER be able to digest their inputs no matter how many times they recycle it.", 
   {}, 
   271808, 
   null, 
   1183250040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Me, (EAM), against you lot (darwinism)", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10068-me-eam-against-you-lot-darwinism.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10068, 
  "discussion_files": [
   [
    "4223.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10068-me-eam-against-you-lot-darwinism-print.html"
   ]
  ], 
  "identifier": 10068
 }
]