[
 [
  [
   271539, 
   null, 
   "samiinh", 
   "'\n (Los Angeles, California) Three former leaders of an international ministry that counsels gays to change their sexual orientation apologized for their efforts, saying that though they acted sincerely, their message had caused isolation, shame and fear. \n \n http://www.365gay.com/", 
   {
    "post_info": {
     "post_title": "Former 'Ex-Gay' Leaders Apologize For 'Bringing Harm"
    }
   }, 
   null, 
   null, 
   1183117260.0
  ], 
  [
   271549, 
   null, 
   "Archangel", 
   "'\n (Los Angeles, California) Three former leaders of an international ministry that counsels gays to change their sexual orientation apologized for their efforts, saying that though they acted sincerely, their message had caused isolation, shame and fear. \n \n http://www.365gay.com/\n\n \n Here's a link to the actual article rather than the home page of 365gay.\n \n http://www.365gay.com/Newscon07/06/062807exodus.htm\n \n And as Alan Chambers said, who was delivered from the gay lifestyle, there is room for more than one opinion on this issue. But I agree that any deliverence from any sinful lifestyle whether it be gay or straight must be by supernatural intervention from God Himself and that will only come about by the submission and turning away from the lifestyle by the person seeking the deliverance.", 
   {}, 
   271539, 
   null, 
   1183122660.0
  ], 
  [
   271563, 
   null, 
   "lesz", 
   "Alan Chambers is a homophobic shill. He has yet to be delivered from his own dishonesty.", 
   {}, 
   271549, 
   null, 
   1183126620.0
  ], 
  [
   271569, 
   null, 
   "samiinh", 
   "deliverence from any sinful lifestyle whether it be gay or straight must be by supernatural intervention from God Himself\n The screeching of the mentally insane.", 
   {}, 
   271563, 
   null, 
   1183128600.0
  ], 
  [
   271799, 
   null, 
   "Foxtuba", 
   "deliverence from any sinful lifestyle whether it be gay or straight must be by supernatural intervention from God Himself\n The screeching of the mentally insane.\n\n \n Based on AA's statement, I just imagined God looking like a blonde lady with big hooters. \"Oh, my God (that's me, tee hee!), you, like, need deliverance from, like, any sinful lifestyle, ya know?\" \n \n Wait! Maybe God is actually Paris Hilton? That would explain why the media is treating her like the second coming!", 
   {}, 
   271569, 
   null, 
   1183230420.0
  ], 
  [
   271800, 
   null, 
   "samiinh", 
   "Based on AA's statement, I just imagined God looking like a blonde lady with big hooters. \"Oh, my God (that's me, tee hee!), you, like, need deliverance from, like, any sinful lifestyle, ya know?\" \n \n Wait! Maybe God is actually Paris Hilton? That would explain why the media is treating her like the second coming!\n\n \n We are in deep dodo!!!!", 
   {}, 
   271799, 
   null, 
   1183230720.0
  ], 
  [
   271804, 
   null, 
   "Foxtuba", 
   "We are in deep dodo!!!!\n\n \n We certainly are!\n \n emoticon_xagree Might as well print up my Paris Hilton Bible off of Wikipedia...", 
   {}, 
   271800, 
   null, 
   1183231080.0
  ], 
  [
   271807, 
   null, 
   "Archangel", 
   "Here's a link to the actual article rather than the home page of 365gay.\n \n http://www.365gay.com/Newscon07/06/062807exodus.htm\n \n And as Alan Chambers said, who was delivered from the gay lifestyle, there is room for more than one opinion on this issue. But I agree that any deliverence from any sinful lifestyle whether it be gay or straight must be by supernatural intervention from God Himself and that will only come about by the submission and turning away from the lifestyle by the person seeking the deliverance.\n\n \n \nBased on AA's statement, I just imagined God looking like a blonde lady with big hooters. \"Oh, my God (that's me, tee hee!), you, like, need deliverance from, like, any sinful lifestyle, ya know?\" \n \n Wait! Maybe God is actually Paris Hilton? That would explain why the media is treating her like the second coming!\n\n \n I realize you are here for the sole purpose of TROLLING after me tuba, but just for once, could you explain how your personal attack on me applies to my post at all ?", 
   {}, 
   271804, 
   null, 
   1183234560.0
  ], 
  [
   271844, 
   null, 
   "samiinh", 
   "It doesn't really connect to your comment, the whole Paris Hilton theory spawned from eating a whopper and trying to be a nuisance, both of which were highly successful. \n \n TROLLS UNITE!\n\n \n Actually, I read that the god of the bible was really a macaroni monster. He likes cheese, too.", 
   {}, 
   271807, 
   null, 
   1183248660.0
  ], 
  [
   271849, 
   null, 
   "jyoshu", 
   "Here's a link to the actual article rather than the home page of 365gay.\n\n \n Better still, here's the same story from an actual mainstream source: http://www.cbsnews.com/stories/2007/06/28/national/main2991850.shtml?source=RSSattr=U.S._2991850\n \n Personally, I don't see any problems with these guys saying what they did. The early focus of the \"ex-gay movement\" was indeed ill-informed and misdirected, being one of actually trying to make someone into a straight person. People have to understand that the \"ex-gay movement\" has been around a very long time,since the mid-1970s, when people didn't even understand sexuality nearly as much. So it's no surprise that the messages coming out of the movement didn't coincide well with what we now know about sexuality. Heck, nobody knew much about it back then. The problem with Exodus in particular (who these guys were from originally) is that it's taken too long to change it's focus to fit more with what we know about sexuality. They're not really on-board at all with the focus of the \"ex-gay movement\" in this day and time.", 
   {}, 
   271549, 
   null, 
   1183250100.0
  ], 
  [
   271881, 
   null, 
   "foundit66", 
   "Better still, here's the same story from an actual mainstream source: http://www.cbsnews.com/stories/2007/06/28/national/main2991850.shtml?source=RSSattr=U.S._2991850\n Personally, I don't see any problems with these guys saying what they did.\n\n I think the real problem is why did it take ONE group so long to reach this conclusion.\n And why does this ONE group seem to be fairly alone in reaching that conclusion?\n \n \n \nThe early focus of the \"ex-gay movement\" was indeed ill-informed and misdirected, being one of actually trying to make someone into a straight person. People have to understand that the \"ex-gay movement\" has been around a very long time,since the mid-1970s, when people didn't even understand sexuality nearly as much.\n\n The ex-gay movement has been ignoring any \"understanding\" of \"sexuality\" for a long time. It's only a recent move for this one group, and there are tons more that are mired in backwards thinking.\n \n And for the record, attempts to change gays pre-date the 1970's. The earlier ones included lobotomies and castration.\n \n And the main reason people \"didn't even understand sexuality\" is because backwards people like this insisted that it would be dirty for us to try to understand sexuality. THESE guys are finally being dragged into more modern knowledge, and you're treating it like they didn't get the memo on Monday, but on Wednesday it's not an issue because they finally understand.\n \n \n \nSo it's no surprise that the messages coming out of the movement didn't coincide well with what we now know about sexuality. Heck, nobody knew much about it back then.\n\n As soon as you can find me somebody who is criticizing them for 1970's, let me know.\n It's three decades later, and knowledge which has been around during most of that time but ignored because of their \"christian\" values that is the issue.\n \n \n \nThe problem with Exodus in particular (who these guys were from originally) is that it's taken too long to change it's focus to fit more with what we know about sexuality. They're not really on-board at all with the focus of the \"ex-gay movement\" in this day and time.\n\n Say whaa???\n And can you substantiate exactly WHAT the \"focus of the 'ex-gay movement'\" supposedly is that EXODUS is supposedly finally catching up to?\n Exodus is the exception to the rule NOT because it is late to the party, but because it is one of the FIRST of the groups to be admitting a lot of this #### which has been explicitly noted for decades now.", 
   {}, 
   271849, 
   null, 
   1183269960.0
  ], 
  [
   271909, 
   null, 
   "samiinh", 
   "It is all connected to the sexual repression of the christer church.\n \n The Right Talk:\n How Conservatives Transformed the Great Society into the Economic Society\n Mark A. Smith\n \n To read the entire book description or the introduction, please visit: http://press.princeton.edu/titles/8385.html\n \n Political analyst Mark Smith offers the most original and compelling explanation yet of America's startling swing to the political right. How did the GOP transform itself from a party outgunned and outmaneuvered into one that today defines the nation's most important policy choices? Why have Democrats in recent decades often been unable to get their message heard? And where does the country go from here?\n \n Conventional wisdom attributes the Republican resurgence to a political bait and switch--the notion that conservatives win elections on social issues like abortion and religious expression, but once in office implement far-reaching policies on the economic issues downplayed during campaigns. Smith illuminates instead the eye-opening reality that economic matters have become more central, not less, to campaigns and the public agenda.", 
   {}, 
   271881, 
   null, 
   1183297140.0
  ], 
  [
   271942, 
   null, 
   "jyoshu", 
   "The ex-gay movement has been ignoring any \"understanding\" of \"sexuality\" for a long time. It's only a recent move for this one group, and there are tons more that are mired in backwards thinking.\n\n \n I think it's been a slow process for a lot of it, just like the understanding of sexuality in general has been a slow process for society in general. That's not to condone the problems the ex-gay movement has had.\n \n \nAnd for the record, attempts to change gays pre-date the 1970's. The earlier ones included lobotomies and castration.\n\n \n And that only helps make my point--as society's understanding of sexuality has changed and improved, the ex-gay movement, in fact, HAS changed it's ways of doing things.\n \n \nAnd the main reason people \"didn't even understand sexuality\" is because backwards people like this insisted that it would be dirty for us to try to understand sexuality. THESE guys are finally being dragged into more modern knowledge, and you're treating it like they didn't get the memo on Monday, but on Wednesday it's not an issue because they finally understand.\n\n \n No, I'm treating it the way it is--that change takes time, and all of society has not understood sexuality the whole time, much less the ex-gay movement.\n \n \nIt's three decades later, and knowledge which has been around during most of that time but ignored because of their \"christian\" values that is the issue.\n \n And can you substantiate exactly WHAT the \"focus of the 'ex-gay movement'\" supposedly is that EXODUS is supposedly finally catching up to?\n Exodus is the exception to the rule NOT because it is late to the party, but because it is one of the FIRST of the groups to be admitting a lot of this #### which has been explicitly noted for decades now.\n\n \n Exodus (as well as some other groups) is still in a mindset that involves someone actually changing into a straight person, in terms of innateness and nature. But much of what you refer to as the 'ex-gay movement' now has a much different focus than Exodus does. These days, most religious/church groups (which is most of the \"ex-gay movement\") is simply focusing on living the Christian life, and focusing on the behavioral aspect, not on making someone into a straight person. The focus is much more religious, and more about one's relationship with God. Clearly the Bible doesn't allow for Christians to have gay relationships, so obviously these men and women who love God and believe this have to move closer to God in their beliefs and relationship to find fulfillment. You'd call it celibacy, but of course, Christianity has always involved celibacy for everyone to some degree. It doesn't allow for sex outside of marriage, and for many straight people it involves life-long celibacy as well. A lot of people feel they are called by God to celibacy. \n \n Of course, deep down you think that they shouldn't do that either, and that Christians should abandon their beliefs and do things the way you think they should do--that religion should just, overnight, drop it's beliefs on the way relationships should be conducted and allow for any and all degree of consensual same-sex and bi-sexual, and opposite-sex relationships. And I suspect you'd also prefer they drop their beliefs that people shouldn't be promiscuous, as well as their belief that they should save sex for the marriage commitment, and just not have any opinion on anything related to sexual relationships. None of that is going to happen. The church isn't going to just drop any of these fundamental issues about relationships any time soon. The only way the church would completely give up their views on any of this is if the Bible were pretty much re-written to say what it doesn't, in fact, say. So since that's not going to happen, you're just going to have to live with the fact that some gays don't want to live like a gay person. Their relationship with God is simply more important than their sexuality, and that's the bottom line. While that may be a very foreign concept to you, it really is the way they view things. Look, you are free to reject religion all you want, but you are not free to tell people they can't live like they want. So reject their religion, but they still get to do what they want. At the end of the day, opposing \"ex-gay movement\" is really about letting people do what they want to do. If there are gays out there who don't want to live like a gay person, that's their business. You want people to leave YOU alone and stay out of your business of being out and gay, so then you could extend them the same courtesy. If you want people to not concern themselves with what goes on in your bedroom, then you'd do well to not concern yourself with what doesn't go on in theirs.", 
   {}, 
   271881, 
   null, 
   1183317900.0
  ], 
  [
   271944, 
   null, 
   "jyoshu", 
   "It is all connected to the sexual repression of the christer church.\n\n \n Actually, I believe you are absolutely right on this. Many Christians just aren't going to stop believing what it does about sex. Many are not, for instance, going to stop saying that people shouldn't be promiscuous, or that they shouldn't have sex outside of the marriage commitment. And they're not going to stop believing that gay relationships are not viewed as allowable to God as well. That's going to remain. So you might as well settle in and learn to live with the fact that not all gays want to live the way you do.", 
   {}, 
   271909, 
   null, 
   1183318380.0
  ], 
  [
   271974, 
   null, 
   "robbie0517", 
   "I think it's been a slow process for a lot of it, just like the understanding of sexuality in general has been a slow process for society in general. That's not to condone the problems the ex-gay movement has had.\n \n \n \n And that only helps make my point--as society's understanding of sexuality has changed and improved, the ex-gay movement, in fact, HAS changed it's ways of doing things.\n \n \n \n No, I'm treating it the way it is--that change takes time, and all of society has not understood sexuality the whole time, much less the ex-gay movement.\n \n \n \n Exodus (as well as some other groups) is still in a mindset that involves someone actually changing into a straight person, in terms of innateness and nature. But much of what you refer to as the 'ex-gay movement' now has a much different focus than Exodus does. These days, most religious/church groups (which is most of the \"ex-gay movement\") is simply focusing on living the Christian life, and focusing on the behavioral aspect, not on making someone into a straight person. The focus is much more religious, and more about one's relationship with God. Clearly the Bible doesn't allow for Christians to have gay relationships, so obviously these men and women who love God and believe this have to move closer to God in their beliefs and relationship to find fulfillment. You'd call it celibacy, but of course, Christianity has always involved celibacy for everyone to some degree. It doesn't allow for sex outside of marriage, and for many straight people it involves life-long celibacy as well. A lot of people feel they are called by God to celibacy. \n \n Of course, deep down you think that they shouldn't do that either, and that Christians should abandon their beliefs and do things the way you think they should do--that religion should just, overnight, drop it's beliefs on the way relationships should be conducted and allow for any and all degree of consensual same-sex and bi-sexual, and opposite-sex relationships. And I suspect you'd also prefer they drop their beliefs that people shouldn't be promiscuous, as well as their belief that they should save sex for the marriage commitment, and just not have any opinion on anything related to sexual relationships. None of that is going to happen. The church isn't going to just drop any of these fundamental issues about relationships any time soon. The only way the church would completely give up their views on any of this is if the Bible were pretty much re-written to say what it doesn't, in fact, say. So since that's not going to happen, you're just going to have to live with the fact that some gays don't want to live like a gay person. Their relationship with God is simply more important than their sexuality, and that's the bottom line. While that may be a very foreign concept to you, it really is the way they view things. Look, you are free to reject religion all you want, but you are not free to tell people they can't live like they want. So reject their religion, but they still get to do what they want. At the end of the day, opposing \"ex-gay movement\" is really about letting people do what they want to do. If there are gays out there who don't want to live like a gay person, that's their business. You want people to leave YOU alone and stay out of your business of being out and gay, so then you could extend them the same courtesy. If you want people to not concern themselves with what goes on in your bedroom, then you'd do well to not concern yourself with what doesn't go on in theirs.\n\n \n Jyoshu I actually agree with you on this. The problem I have is with the term \"ex-gay\". There is no such thing as ex-gay. It has been shown that sexuality can not be changed. Now if someone wants to remain celebate (with regards to gay sex), so be it. But going around calling themselves ex-gay gives the impression that being gay is changeable, which it is not. I had a cousin that was petecostal and decided to live his life as a heterosexual and have children. I was fine with this, however he was no less gay than I am. He just didn't act on it.\n \n Edited later: Now that I think about it, he was still having gay sex on the side, contracted HIV and died.", 
   {}, 
   271942, 
   null, 
   1183329720.0
  ], 
  [
   271978, 
   null, 
   "jyoshu", 
   "Jyoshu I actually agree with you on this. The problem I have is with the term \"ex-gay\". There is no such thing as ex-gay. It has been shown that sexuality can not be changed. Now if someone wants to remain celebate (with regards to gay sex), so be it. But going around calling themselves ex-gay gives the impression that being gay is changeable, which it is not. I had a cousin that was petecostal and decided to live his life as a heterosexual and have children. I was fine with this, however he was no less gay than I am. He just didn't act on it.\n \n Edited later: Now that I think about it, he was still having gay sex on the side, contracted HIV and died.\n\n \n Well, I agree on that as well. Religious conservatives who have yet to do so (such as Exodus) would do well to understand that sexuality is hard wired.", 
   {}, 
   271974, 
   null, 
   1183330260.0
  ], 
  [
   271988, 
   null, 
   "samiinh", 
   " So you might as well settle in and learn to live with the fact that not all gays want to live the way you do.\n\n \n What do you mean by this?", 
   {}, 
   271944, 
   null, 
   1183333920.0
  ], 
  [
   271999, 
   null, 
   "jyoshu", 
   "What do you mean by this?\n\n \n I'm saying the \"ex-gay\" movement isn't going anywhere as long as religion is in this world. And since religion isn't going to go away, you might as well learn to live with the fact that some gays don't want to live like they are gay (preferring to live like an \"ex-gay\" instead). Live and let live, and let them live their lives the way they want. That is, after all, the latitude you want people to give to you yourself as a gay person.", 
   {}, 
   271988, 
   null, 
   1183336320.0
  ], 
  [
   272000, 
   null, 
   "samiinh", 
   "I'm saying the \"ex-gay\" movement isn't going anywhere as long as religion is in this world. And since religion isn't going to go away, you might as well learn to live with the fact that some gays don't want to live like they are gay (preferring to live like an \"ex-gay\" instead). Live and let live, and let them live their lives the way they want. That is, after all, the latitude you want people to give to you yourself as a gay person.\n\n \n Ok. Now I understand what you were trying to say.", 
   {}, 
   271999, 
   null, 
   1183336920.0
  ], 
  [
   272008, 
   null, 
   "foundit66", 
   "I think it's been a slow process for a lot of it, just like the understanding of sexuality in general has been a slow process for society in general. That's not to condone the problems the ex-gay movement has had.\n\n \"Slow process\" is an interesting way to put it.\n In this \"slow process\", most of mankind has essentially evolved from getting around by walking, to using bicycles, to automobiles, to airplanes.\n But in the \"reparative therapy\" world, we finally have somebody who is FINALLY starting to use a bicycle.\n \n I guess the point is that why are the christian-motivated \"ex-gay\" groups so much slower than the rest of the \"society in general\"?\n \n \n \nAnd that only helps make my point--as society's understanding of sexuality has changed and improved, the ex-gay movement, in fact, HAS changed it's ways of doing things.\n\n Really?\n I mean, moving past the whole \"lobotomy and castration\" thing, has the ex-gay movement really \"changed\" much since the 1970's / 1980's?\n I mean, they adapted to the loss of the APA as their center for espousing a demand that gays change because of a pretense of \"mental illness\", but that was pretty much done by forming their own \"reparative therapy\" groups. Independent of the APA.\n \n But what have they REALLY changed since then.\n This story is about ONE group.\n \n Where are the rest of the groups with the same admission?\n \n \n \nNo, I'm treating it the way it is--that change takes time, and all of society has not understood sexuality the whole time, much less the ex-gay movement.\n\n It's funny how you say that, but then your response completely ignores what I ACTUALLY said.\n The point is that when \"all of society\" (as you put it) finally DID start to understand the whole \"gay\" thing, the reparative therapy groups stayed behind.\n \n It's a sub-group (the RTs) in a society that is evolving.\n And eventually in the year 1888, the society learns how to make the automobile. And people start driving.\n The RTs insist bizarre things about how internal combustion engines work, despite the evidence that society is demonstrating.\n \n Now in that situation above, YOU want to fixate on what happened BEFORE 1888. YOU want to talk about how society took a while to drive, therefore the RTs situation is down-played.\n But the TRUTH is that we don't need to talk about just 1888, and the RTs ignored DECADES of research and analysis which demonstrated something about their thought processes.\n \n So you keep fixating on the \"before\" picture if you like.\n I don't blame the RTs for their failure to learn something when society in general hadn't learned it, EVEN THOUGH the RTs are supposed to be guys who are ACTIVELY STUDYING the issue in the first place and THEY should have learned this stuff BEFORE the rest of society did.\n I understand they had a christian handicap.\n \n I will keep talking about what happened AFTER society started realizing that the RTs were full of ####, except for the RT faithful of course...\n \n \n \nExodus (as well as some other groups) is still in a mindset that involves someone actually changing into a straight person, in terms of innateness and nature. But much of what you refer to as the 'ex-gay movement' now has a much different focus than Exodus does.\n\n Really???? emoticon_rolleyes \n Because after a quick google, I found a NARTH article professing the joys of CHANGING gays into straight people.\n \n What reparative therapy groups do you know of that don't profess to be able to \"change someone into a straight person\"?\n \n \n \nThese days, most religious/church groups (which is most of the \"ex-gay movement\") is simply focusing on living the Christian life, and focusing on the behavioral aspect, not on making someone into a straight person.\n\n So you claim.\n I eagerly await any proof you have on the issue.\n \n \n \nOf course, deep down you think that they shouldn't do that either, and that Christians should abandon their beliefs and do things the way you think they should do--that religion should just, overnight, drop it's beliefs on the way relationships should be conducted and allow for any and all degree of consensual same-sex and bi-sexual, and opposite-sex relationships.\n\n Yeah. I know.\n And I'm such a hypocrite because OBVIOUSLY Christians do not insist that I abandon my homosexuality, and do things the way they think I should do.\n That would NEVER happen... ;) \n \n \n \nAnd I suspect you'd also prefer they drop their beliefs that people shouldn't be promiscuous, as well as their belief that they should save sex for the marriage commitment, and just not have any opinion on anything related to sexual relationships.\n\n And I note that you are wrong. Not a suspicion, but actually noting that you don't know what you're talking about here.\n I see one of the problems with the situation is that a lot of the christian churches do such a good job in pushing gays away, that the gays lose sight of some of the good ideas in the christian dogma that can still apply even though they are gay.\n I don't support promiscuity, and I wonder if you have ever met anybody on this forum who actually does. Although I guess there would be a few you just assume do... emoticon_rolleyes \n \n \n \nThe church isn't going to just drop any of these fundamental issues about relationships any time soon. The only way the church would completely give up their views on any of this is if the Bible were pretty much re-written to say what it doesn't, in fact, say.\n\n Yes.\n And THAT is why Christians, to this very day, still kill people who talk back to their parents.\n They still condemn people who plant two different types of crops in the same field.\n They still abhor touching pig-skin, and unilaterally boycott the NFL.\n They still support the Bible's teachings on the place of women.\n They acknowledge that the bible directs god's people in numerous places to commit genocide and to own people in slavery.\n They acknowledge that the bible EXPLICITLY forbids divorce except in the case of unfaithfulness, and on top of that they realize that it ALSO forbids remarriage, without exception. And that is why the Christian divorce rate is lower than the atheists'\n \n Yes Jyoshu. The church NEVER \"gives up their views\" because it's ALL \"written in the bible\".\n < end sarcasm <\n \n I really don't care how absurd christians get on the issue of homosexuality.\n Stick to your guns if you like, but pretending that you're doing it JUST because it's written in the bible is patently hypocritical.\n \n \n \nSo since that's not going to happen, you're just going to have to live with the fact that some gays don't want to live like a gay person. Their relationship with God is simply more important than their sexuality, and that's the bottom line. While that may be a very foreign concept to you, it really is the way they view things.\n\n Not a foreign concept to me at all.\n (Sigh. There you go again assuming things... emoticon_rolleyes )\n \n Quite frankly, I don't believe that god made me gay just so I could be miserable. I believe god loves us, and made us with a purpose.\n And I see homosexuality observed in nature around me, so I realize that OBVIOUSLY god must not have a problem with people being gay, cause there sure as heck ain't a rational reason to be against homosexuality.\n \n No, Jyoshu, I believe a relationship with God is not contradictory with being gay. And that such a relationship can even be a part of homosexuality.\n Is that a foreign concept to you?\n \n \n \nLook, you are free to reject religion all you want, but you are not free to tell people they can't live like they want.\n\n I see.\n And I said people were not free to \"live like they want\" exactly WHERE???", 
   {}, 
   271942, 
   null, 
   1183344660.0
  ], 
  [
   272013, 
   null, 
   "robbie0517", 
   "I'm saying the \"ex-gay\" movement isn't going anywhere as long as religion is in this world. And since religion isn't going to go away, you might as well learn to live with the fact that some gays don't want to live like they are gay (preferring to live like an \"ex-gay\" instead). Live and let live, and let them live their lives the way they want. That is, after all, the latitude you want people to give to you yourself as a gay person.\n\n \n Buy Jyoshu, It has been shown that the tactics employed in \"ex-gay\" movement are or can be harmful. They just need to be honest and tell that you well never \"not be gay\" but here's what you can do to live you life you seem so desparately to want.", 
   {}, 
   271999, 
   null, 
   1183350600.0
  ], 
  [
   272023, 
   null, 
   "Matthew S", 
   "I'm saying the \"ex-gay\" movement isn't going anywhere as long as religion is in this world. And since religion isn't going to go away, you might as well learn to live with the fact that some gays don't want to live like they are gay (preferring to live like an \"ex-gay\" instead). Live and let live, and let them live their lives the way they want. That is, after all, the latitude you want people to give to you yourself as a gay person.\n\n \n In short religion is the evil that perpetuates the evil of the exgay movement", 
   {}, 
   271999, 
   null, 
   1183372080.0
  ], 
  [
   272032, 
   null, 
   "lesz", 
   "I'm saying the \"ex-gay\" movement isn't going anywhere as long as religion is in this world. And since religion isn't going to go away, you might as well learn to live with the fact that some gays don't want to live like they are gay (preferring to live like an \"ex-gay\" instead). Live and let live, and let them live their lives the way they want. That is, after all, the latitude you want people to give to you yourself as a gay person.\n\n \n I think the vast majority of people who try to become \"ex-gay\" are to be pitied, though those who promote the ex-gay industry deserve censure. They are exploiting people's fears and anxieties, and in many cases are offering false hope. Then when the ex-gay \"therapy\" (more usually ministry) doesn't work, there is a heightened sense of personal failure.\n \n We do have to accept that some people, for a variety of reasons, not all of them good ones, do want to try that path. Maybe they want to raise a family heterosexually, maybe they are responding to family pressures and expectations, maybe they are afraid of homophobia, maybe they have deeply held religious beliefs about sexuality. I don't condemn anyone for trying to be true to themselves, or trying to become what they would rather be, but when we see people going down pathways that are likely to result in more sorrow, it's good to be able to talk to them about alternatives.\n \n The ex-gay path simply isn't healthy, as the existence more and more ex-ex-gays shows.", 
   {}, 
   271999, 
   null, 
   1183384140.0
  ], 
  [
   272033, 
   null, 
   "lesz", 
   "In short religion is the evil that perpetuates the evil of the exgay movement\n\n \n With the exception (until lately) of NARTH, the ex-gay industry has been very much religious in nature, which is not surprising, as religion is a major promoter of homophobia. From what I've read, most people caught in the ex-gay mill are there for religious reasons. \n \n I can see that some gay people in a predominantly homophobic society might wish they were straight, and might desperately want to believe those who claim they can straighten themselves out. I think we have to respect that, but although I certainly condemn those who run the industry, I can only pity those caught up in it. They have my deepest sympathy.", 
   {}, 
   272023, 
   null, 
   1183384500.0
  ], 
  [
   272035, 
   null, 
   "Archangel", 
   "Go ahead, delude yourselves. That's what you do best. emoticon_rolleyes", 
   {}, 
   272033, 
   null, 
   1183384680.0
  ], 
  [
   272036, 
   null, 
   "jyoshu", 
   "They just need to be honest and tell that you well never \"not be gay\" but here's what you can do to live you life you seem so desparately to want.\n\n \n I agree. And that's where groups like Exodus have missed the boat.", 
   {}, 
   272013, 
   null, 
   1183387620.0
  ], 
  [
   272038, 
   null, 
   "jyoshu", 
   "\"Slow process\" is an interesting way to put it.\n In this \"slow process\", most of mankind has essentially evolved from getting around by walking, to using bicycles, to automobiles, to airplanes.\n But in the \"reparative therapy\" world, we finally have somebody who is FINALLY starting to use a bicycle.\n\n \n And let me guess .. the 'airplane' is to abandon all religious beliefs about this. emoticon_rolleyes \n \n \nI mean, moving past the whole \"lobotomy and castration\" thing, has the ex-gay movement really \"changed\" much since the 1970's / 1980's? I mean, they adapted to the loss of the APA as their center for espousing a demand that gays change because of a pretense of \"mental illness\", but that was pretty much done by forming their own \"reparative therapy\" groups. Independent of the APA.\n\n \n Foundit, as long as this is a religion versus APA thing, religion is going to win out in religion. These days, the focus of churches is more on living the Christian life in a way that doesn't involve gay behavior.\n \n \nThe RTs insist bizarre things about how internal combustion engines work, despite the evidence that society is demonstrating.\n\n \n And the point of my original post is that RTs are getting less and less common. More and more churches and Christians on this issue are going a route that focuses more on the behavioral aspect. In other words, the view would not so much be a bizarre idea on internal combustion, but that one just shouldn't drive the car to begin with.\n \n \nReally???? emoticon_rolleyes \n Because after a quick google, I found a NARTH article professing the joys of CHANGING gays into straight people.\n\n \n I'm sure there are other groups out there that haven't embraced the direction many churches are going. I never said Exodus was the ONLY one.\n \n \nWhat reparative therapy groups do you know of that don't profess to be able to \"change someone into a straight person\"?\n\n \n Foundit, this movement is not definable merely by non-profit orgs. Churches all over the country are into this. The churches I've seen that are focus on the behavioral aspect.\n \n \nAnd THAT is why Christians, to this very day, still kill people who talk back to their parents.\n They still condemn people who plant two different types of crops in the same field.\n They still abhor touching pig-skin, and unilaterally boycott the NFL.\n They still support the Bible's teachings on the place of women.\n They acknowledge that the bible directs god's people in numerous places to commit genocide and to own people in slavery.\n They acknowledge that the bible EXPLICITLY forbids divorce except in the case of unfaithfulness, and on top of that they realize that it ALSO forbids remarriage, without exception. And that is why the Christian divorce rate is lower than the atheists'\n \n Yes Jyoshu. The church NEVER \"gives up their views\" because it's ALL \"written in the bible\".\n < end sarcasm <\n\n \n Look, you can whine all day long about inconsistencies in Christianity and it won't change the fact that Christianity isn't going to budge on this. For whatever reason, they've drawn a line in the sand here and on the issue of homoseuxal sex they believe the Bible is emphatic about it. I'm not going to get into a discussion with you here on whether or not the Bible really does do so--that's been covered here in other threads. The point is that THEY BELIEVE THAT IT DOES. So you might as well get used to the \"ex-gay\" movement. It's here to stay.\n \n \nQuite frankly, I don't believe that god made me gay just so I could be miserable. I believe god loves us, and made us with a purpose. And I see homosexuality observed in nature around me, so I realize that OBVIOUSLY god must not have a problem with people being gay, cause there sure as heck ain't a rational reason to be against homosexuality.\n\n \n So you believe that just because a given thing exists in nature that God has no problem with it? Do you not see the problems inherent in that view? But look, I respect your beliefs, and that's fine. Just know that not everyone views things that way.", 
   {}, 
   272008, 
   null, 
   1183388880.0
  ], 
  [
   272043, 
   null, 
   "jitobear", 
   "Go ahead, delude yourselves. That's what you do best. emoticon_rolleyes\n\n \n I love it when straight, Christian folk who disapprove of gays seem to know so much about what it is to be gay - how it feels, how they became that way, the nature of their relationships and whether or not its something they can control.\n \n Hey Archangel - if you ever need brain surgery I know a FANTASTIC auto mechanic you can talk to.\n \n emoticon_rolleyes", 
   {}, 
   272035, 
   null, 
   1183392420.0
  ], 
  [
   272055, 
   null, 
   "samiinh", 
   "I love it when straight, Christian folk who disapprove of gays seem to know so much about what it is to be gay - how it feels, how they became that way, the nature of their relationships and whether or not its something they can control.\n \n Hey Archangel - if you ever need brain surgery I know a FANTASTIC auto mechanic you can talk to.\n \n emoticon_rolleyes\n\n \n Maybe a septic tank cleaner could also do the job.", 
   {}, 
   272043, 
   null, 
   1183402680.0
  ], 
  [
   272069, 
   null, 
   "Matthew S", 
   "Go ahead, delude yourselves. That's what you do best. emoticon_rolleyes\n\n \n From a gay perspective what the fundies and the ex gay movement is doing is evil. They even admit that they have caused harm. Evil, evil, evil. If they do not full accept gay people and support are type of sexual activiteis then they are evil.", 
   {}, 
   272035, 
   null, 
   1183416180.0
  ], 
  [
   272070, 
   null, 
   "Matthew S", 
   "I love it when straight, Christian folk who disapprove of gays seem to know so much about what it is to be gay - how it feels, how they became that way, the nature of their relationships and whether or not its something they can control.\n \n Hey Archangel - if you ever need brain surgery I know a FANTASTIC auto mechanic you can talk to.\n \n emoticon_rolleyes\n\n \n I hear the Maytag repairman is free.", 
   {}, 
   272043, 
   null, 
   1183416300.0
  ], 
  [
   272077, 
   null, 
   "foundit66", 
   "And let me guess .. the 'airplane' is to abandon all religious beliefs about this. emoticon_rolleyes \n\n Nope. Not at all.\n But even when they finally admitted the earth was round and not the center of the universe, they were still able to adapt their mythology to the truth.\n I really don't care what they do, as long as they start realizing that it is something that THEY do in THEIR lives, and not something they enforce on others via legislation.\n \n \n \nFoundit, as long as this is a religion versus APA thing, religion is going to win out in religion. These days, the focus of churches is more on living the Christian life in a way that doesn't involve gay behavior.\n\n Yeah, but the funny thing is WHY does RELIGION have to make it a \"religion vs APA\" thing?\n They do that a lot in history. Pretend that just because they have some religious interpretation, that they know better than science what is actually going on. Devoid of any facts or evidence, relying solely on belief.\n \n But regardless, it's high time that religion stopped ignoring some facts on the issue regarding their impact upon PEOPLE. \n You know. That whole \"Love thy Neighbor\" stuff.\n Maybe they should start realizing when their actions are actually HURTING people instead of helping them?\n \n \n \nAnd the point of my original post is that RTs are getting less and less common. More and more churches and Christians on this issue are going a route that focuses more on the behavioral aspect. In other words, the view would not so much be a bizarre idea on internal combustion, but that one just shouldn't drive the car to begin with.\n\n You know, it's funny how you keep claiming this, but when I ask for significant substantiation of your claim you keep on watering down your claim.\n Like here, you claim \"more and more churches and christians...\", when earlier you were trying to proclaim that Exodus was the exception to the rule. And now it is apparent that you are watering down your comment that it could be going from 1 to 2.\n \n I guess that's what happens when you are pressed for proof on your claims.\n \n \n \nI'm sure there are other groups out there that haven't embraced the direction many churches are going. I never said Exodus was the ONLY one.\n\n No. You didn't say Exodus was the \"only one\".\n But you did indicate you thought exodus was in the minority and finally catching up to the rest of the crowd.\n \n And now you state that you are \"sure there are other groups\"? Indicating that you really don't know?\n \n Why not just admit that you're clueless on the issue?\n \n \n \n I asked you point-blank: What reparative therapy groups do you know of that don't profess to be able to \"change someone into a straight person\"?\n \n Should have been an easy question for you IF you really had any knowledge of the issue, but you avoided the question.\n Keep on back-pedalling Jyoshu. emoticon_xgood \n \nFoundit, this movement is not definable merely by non-profit orgs. Churches all over the country are into this. The churches I've seen that are focus on the behavioral aspect.\n\n And there's the dodge reply to my question.\n The truth is that I can name you organization after organization that EXPLICITLY states they can change you from gay to straight.\n It has nothing to do with \"profit\" vs \"non-profit\", although I think it would be interesting to see some of these non-licensed hack organizations sued for their failures to make good on their claims.\n \n \n \nLook, you can whine all day long about inconsistencies in Christianity and it won't change the fact that Christianity isn't going to budge on this.\n\n emoticon_rolleyes \n Hate to break it to you sunshine, but \"Christianity\" has already been \"budging\" on this issue for a while now. And I can understand why you don't want to talk about the inconsistencies, but the important thing that you should realize is that OTHERS DO NOTE the inconsistencies, and they are asking questions.\n And when those questions come from within as to asking why they don't adopt the same policy for divorcees or people who insist on working on Sunday, THAT is when the change happens, and is happening.\n \n But regardless, I really don't care if christians make this a sticking point. It's only going to hurt them in the long run as others see them as back-water guys who can't get their head out of two millenia old thinking.\n \n \n \nSo you might as well get used to the \"ex-gay\" movement. It's here to stay.\n\n Jyoshu, do you ever tire of ranting away against a position that you imagine me to have?\n Have you ever stopped to actually ask yourself EXACTLY WHAT is my beef with the ex-gays?\n \n 1) Honesty. They need to start being more honest about what they can and can't do.\n 2) Compassion. They need to start caring for these people as FELLOW HUMAN BEINGS and not chattle that they drive into submission. Because the truth is that their actions are doing a LOT more to hurt people who start despairing when they cannot change from gay to straight than they are with helping them.\n And by hurt, I'm not talking about \"hurting\" people by \"changing\" them from gay to straight or \"changing\" them to celibate. I'm talking about the harm that is done on the psychological level where you psychologically beat people up in ways that are just plain not necessary.\n If you need examples of this, please ask. There's a lovely quote to that Tennessee kid in that brain-washing camp that I will happily share.\n It would do more to further the conversation to explain the situation than you just deciding to run off and misinterpret what I'm saying which I am sure you're eager to do.\n \n Wow. That's about it. I can't think of another complaint I got that can't be summed up in those two groups.\n \n Jyoshu, can YOU think of another complaint I have ACTUALLY MADE which doesn't fit into one of those two categories?\n \n \n \nSo you believe that just because a given thing exists in nature that God has no problem with it?\n\n You're so predictable.\n Did you miss that portion of my explanation where I CLEARLY stated: \"...cause there sure as heck ain't a rational reason to be against homosexuality\"\n \n I had hoped that would clue you in that existing in nature wasn't the only thing, but somehow I knew that was too optimistic for you...\n \n \n \nJust know that not everyone views things that way.\n\n emoticon_wow \n You mean that is NOT the christian view at all?\n Gee. Somebody call 911 because a feather just bowled me over and I'm in shock!\n < end sarcasm <\n \n Nice attempt at redirect, but the reason I brought this up is because it seemed like YOU were the one who couldn't imagine others not viewing things differently. Remember?", 
   {}, 
   272038, 
   null, 
   1183422720.0
  ], 
  [
   272089, 
   null, 
   "jyoshu", 
   "I really don't care what they do, as long as they start realizing that it is something that THEY do in THEIR lives, and not something they enforce on others via legislation.\n\n \n Ha! For someone who's only concerned about legislation here, you sure are being winded about it. And for the record, I don't know of a single group or church trying legislate the idea of being an \"ex-gay\". \n \n \nYeah, but the funny thing is WHY does RELIGION have to make it a \"religion vs APA\" thing? \n\n \n Foundit, YOU'RE making it a religion-versus-APA thing. YOU are. YOU are the one all hot and bothered that they don't go by what the APA says. Now I agree with you that RT's (those who want gay to change to straights) aren't on board with what the APA says. But the ones I see getting all bent out of shape about that are those like yourself.\n \n \nYou know, it's funny how you keep claiming this, but when I ask for significant substantiation of your claim you keep on watering down your claim. Like here, you claim \"more and more churches and christians...\", when earlier you were trying to proclaim that Exodus was the exception to the rule. \n\n \n Frankly, it's a stupid request on your part--go look up most any church that has ministries to homosexuals struggling with their desires and you'll find what you're looking for. If you really care, you can do your own homework. Because frankly, I don't really care that much if you're convinced or not. The fact of the matter is that convincing you is just simply not worth the effort of looking any of them up, because my experience with you in the past lets me know that it won't do any good. I could give you the names of a thousand churches that do things that way and you wouldn't admit I had proven anything. You've demonstrated that sort of belligerence time and time again, and you're doing it right here in this thread give that you can hardly go a single post without throwing some rude and insulting comment in.\n \n \nHate to break it to you sunshine, but \"Christianity\" has already been \"budging\" on this issue for a while now. \n\n \n Yeah, like probably a drop in the bucket. emoticon_rolleyes You forget, Catholicism ALONE comprises most of Christianity, and you know good and well where they stand on it. And evangelicals? I don't think you want to go there. What you should say is that a few churches out there don't interpret the Bible like most of the rest of Christianity, and they happen to make the news more because they're so different. And other groups, like Unitarian Universalists basically aren't Christian in any substantial and identifiable sense anyway; they're more of anything-goes sort of groups that have no real defined sense of doctrine and beliefs to begin with. Since you never like to your own homework, I found a few stats for you just for american protestants which scratches the surface the gay-sex disapproving Christian world ..\n \n - around 80% of protestants are opposed to gay marriage\n - and nearly 60% say their churches actively discourage homosexuality (that doesn't include the scores of churches that don't make an issue of it but who's doctrine isn't compatible with it)\n \n And that's from a site that would more than likely tend to be biased against such Christian churches.\n \n (http://www.exgaywatch.com/wp/2003/11/poll-tracks-chu/)\n \n \nBut regardless, I really don't care if christians make this a sticking point.\n\n \n LOL! Ummm hmm. Yeah, it's so obvious you don't care, Foundit. emoticon_rolleyes \n \n \n1) Honesty. They need to start being more honest about what they can and can't do.\n\n \n What do you think they're being dishonest about? Changing their sexual orientation? Well, maybe they think they really have. I find it fascinating that you and others just won't take a self-described ex-gay at their word, but I find it even MORE fascinating that you go out of your way to not do so WHEN IT'S ABOUT THEIR LIFE, and NOT yours. Maybe they ARE full of it, Foundit. But it's their business.\n \n \nCompassion ... I'm talking about the harm that is done on the psychological level where you psychologically beat people up in ways that are just plain not necessary. If you need examples of this, please ask. There's a lovely quote to that Tennessee kid in that brain-washing camp that I will happily share. It would do more to further the conversation to explain the situation than you just deciding to run off and misinterpret what I'm saying which I am sure you're eager to do.\n\n \n You can give the example if you want but I think I understand what you're talking about, and I would agree. Compassion is always a good thing.", 
   {}, 
   272077, 
   null, 
   1183431480.0
  ], 
  [
   272101, 
   null, 
   "foundit66", 
   "Ha! For someone who's only concerned about legislation here, you sure are being winded about it.\n\n That's not to say that I think their choices are intelligent or rational.\n It's just that when they muck up THEIR OWN lives, I have little concern. The whole \"self-induced\" thing. I'll happily voice my opinion, but as for \"concern\", ...\n \n See the difference?\n \n \n \nAnd for the record, I don't know of a single group or church trying legislate the idea of being an \"ex-gay\".\n\n And considering I never claimed there were any, that's a rather pointless comment with spurious innuendo.\n \n \n \nFoundit, YOU'RE making it a religion-versus-APA thing. YOU are. YOU are the one all hot and bothered that they don't go by what the APA says.\n\n No. You're missing the point, as usual.\n Religion and science both have their domains. Sometimes they intersect. Sometimes, they are MADE to intersect.\n Here, religion is making claims in an area that is essentially science and psychology.\n Now again, it's not really a \"hot and bothered\" aspect, because it essentially helps to separate the wheat from the chaff. It helps demonstrate, to those that are intelligent enough to observe, that these guys really don't have a clue...\n \n Why should I get hot and bothered by individuals who essentially demonstrate them clueless? It's a waste of energy!\n I'm reminded of a Farside cartoon where they show a variety of things that are captioned \"Nature's way of saying 'Do Not Touch'\". Christianity puts itself in that category WAYYYY too eagerly.\n \n \n \nFrankly, it's a stupid request on your part\n\n < Jyoshu filter on < : \"Ahhh! Ad Hominem!!!\"\n < Jyoshu filter off <\n It's funny how you keep on back-pedalling. At first, you try to pretend that Exodus is a rarity because it is finally CATCHING UP to where you claim the rest of the reparative therapy groups are.\n When it is disputed and pointed out that MOST reparative therapy groups are STILL claiming that they can \"cure\" gays and make them straight, you call requests for YOU TO PROVE your earlier allegations as \"stupid\".\n \n :) I learned a long time ago that you'll never admit to the reality of these discussions, but I do get a kick out of others realizing it.\n \n \n \ngo look up most any church that has ministries to homosexuals struggling with their desires and you'll find what you're looking for.\n\n Oh brother! You're just asking for trouble with this lame junk.\n I already pointed out NARTH, which is a major \"reparative therapy\" group like \"Exodus\" is.\n What's another big group? How about PFOX?\n Reviewing PFOX's web-site, I can see one attempted pretense at \"research\" where they try to confirm that the \"reparative therapy ex-gays\" have indeed transitioned to \"in the high heterosexual range\". i.e. They became straight.\n On their \"about us\" page, they create some hilarious pretense at discrimination when \"they decided to fulfill their heterosexual potential\".\n \n I can keep this up as long as this takes. Each post you come up with obfuscating the request for you to PROVE YOUR CLAIM, I'll give yet another major group which proves your claim wrong. emoticon_xgood \n \n \n \nIf you really care, you can do your own homework.\n\n < giggle <\n Oh Jyoshu, I don't think you get that I HAVE done my own homework, and quickly came to the conclusion that you were undeniably wrong.\n But of course, I whole-heartedly acknowledge that you will unexplicably deny this, and continue to either:\n a) falsely claim that Exodus is a rarity because it is finally stating what most other reparative therapy groups have supposedly already realized, or\n b) start back-pedalling your little heart out into demanding that I prove something irrelevant which I never even claimed.\n \n \n \nBecause frankly, I don't really care that much if you're convinced or not.\n\n Even a stopped watch is right twice a day. And those two times of being right are:\n 1) \"If you are going to make that accusation, you need to pony up and prove it.\"\n ***Jyoshu\n 2) \"Well since you didn't address my points, I'll assume you're done! A simple \"ok, I concede that ... and moving on back to the issues ...\"\n ***Jyoshu\n \n \n \nI could give you the names of a thousand churches that do things that way and you wouldn't admit I had proven anything.\n\n Of COURSE you could...\n And I see we're back on the same ol' obfuscational ploy of \"I'm not going to supply you with ANY proof because it won't sway your opinion\".\n \n Like I've stated in the past, I don't offer proof to sway YOUR opinion Jyoshu. I don't think you're capable of admitting you're wrong.\n I do it to prove you wrong to others.\n And if you think the current exchange is helping you prove your point to them, then more power to you.\n \n \n \nYeah, like probably a drop in the bucket. emoticon_rolleyes You forget, Catholicism ALONE comprises most of Christianity, and you know good and well where they stand on it.\n\n You make it just SOOOO easy to prove you wrong.\n Catholics have a \"plurality\" as a name-brand group, but not a majority. They do not constitute \"most\".\n Protestants are well over double the number of Catholics.\n \n And since you brought them up, it kind of cuts to the quick with your \"Christianity won't change\" by simply referencing the number of gay-friendly catholic parishes in the U.S. that HAVE changed.\n http://www.stbernadette.org/frparish.htm\n \n \n \nAnd evangelicals? I don't think you want to go there.\n\n ROFLMAO!\n I swear. It's like watching a comedy.\n I am asking YOU for proof.\n YOU REFUSE to give me any proof.\n Yet you don't think I \"want to go there\".\n emoticon_xdonno \n Man. PURE comedy!\n \n If you were smart, you SHOULD start back-pedalling by claiming that maybe \"most\" of Christianity won't budge. And then, I'll forget how wrong you were as time proves you wrong...\n \n \n \nWhat you should say is that a few churches out there don't interpret the Bible like most of the rest of Christianity, and they happen to make the news more because they're so different.\n\n \"What I should say...\"?\n What I should say instead of WHAT Jyoshu?\n What did I actually say that the above is supposedly a modification of?\n \n Or maybe you forgot WHY we're having this conversation in the first place, and it was actually YOUR claim which sparked this...\n \n \n \nSince you never like to your own homework, I found a few stats for you just for american protestants which scratches the surface the gay-sex disapproving Christian world ..\n - around 80% of protestants are opposed to gay marriage\n - and nearly 60% say their churches actively discourage homosexuality (that doesn't include the scores of churches that don't make an issue of it but who's doctrine isn't compatible with it)\n\n I honestly didn't think it was this high, but it doesn't refute my point.\n In fact, it reaffirms it.\n \n The church IS changing. You claimed it wouldn't, but it IS changing.\n Brick by brick. Bit by bit.\n \n \n \nLOL! Ummm hmm. Yeah, it's so obvious you don't care, Foundit. emoticon_rolleyes \n\n Oh. Don't get me wrong.\n I thoroughly enjoy USING it to my own ends to make a point.\n But as far as you detrimenting your own lives and relying on mythology, I really don't care.\n It's your choice, and I'm not responsible for it.\n \n \n \nWhat do you think they're being dishonest about? Changing their sexual orientation? Well, maybe they think they really have.\n\n 1) I am referring to the GROUPS involved.\n 2) They are being dishonest about their \"success\" in changing people's lives / sexual orientations.\n When they are confronted with people who revert, they put their head in the sand.\n \n \n \nI find it fascinating that you and others just won't take a self-described ex-gay at their word, but I find it even MORE fascinating that you go out of your way to not do so WHEN IT'S ABOUT THEIR LIFE, and NOT yours. Maybe they ARE full of it, Foundit. But it's their business.\n\n ROFLMAO! AGAIN amused at how you charge forth and attack me for something I NEVER SAID!\n I am talking about the ORGANIZATIONS here.\n That IS what we have been talking about.\n And suddenly YOU try to CHANGE THE SUBJECT towards the individual \"ex-gays\" themselves?\n \n \n \nYou can give the example if you want but I think I understand what you're talking about, and I would agree. Compassion is always a good thing.\n\n This is from one teen-ager who went to a reparative therapy organization against his will. (And I guess the whole \"kids being forced into reparative therapy\" would be a third category.)\n Particular attention was given to a quote attributed to the man running the program, John Smid:\n \n I would rather you commit suicide than have you leave Love In Action wanting to return to the gay lifestyle. In a physical death you could still have a spiritual resurrection; whereas, returning to homosexuality you are yielding yourself to a spiritual death from which there is no recovery.http://www.answers.com/topic/love-in-action-1\n \n There is one quote that I heard that stuck with me describing these organizations. \"Too often, they are about the people who sent the person there than they are about the people who are there.\"", 
   {}, 
   272089, 
   null, 
   1183438620.0
  ], 
  [
   272131, 
   null, 
   "lesz", 
   "These days, the focus of churches is more on living the Christian life in a way that doesn't involve gay behavior.\n\n \n Only churches so irredeemably steeped in homophobia they can no longer distinguish between hate and love. There are Christian churches that do not take such antiquated and dismal views of gay people. The rest will eventually come around, just as many Christian churches eventually came around to a common sense view of the humanity of black people.\n \n \nSo you might as well get used to the \"ex-gay\" movement. It's here to stay.\n\n \n It's an antediluvian hang-over, and it's well past time it disappeared, and disappear it will. Don't hold out any hopes in this direction.", 
   {}, 
   272038, 
   null, 
   1183457700.0
  ], 
  [
   272176, 
   null, 
   "ShadowPikachu", 
   "Sorry, jyoshu, but I agree with the others here. You claimed that \"Christianity isn't going to 'budge' on this\", and it has been shown to you that it has - every day it \"budges\", and every day new churches accept the fact that homosexuality is an inherent sexual orientation, just as heterosexuality is.\n \n I really think it is better if you tip your hat and acknowledge that your claim was wrong and completely false (especially with the whole \"we-know-the-Catholic-stance-on-homosexuality\", which was also shown to be wrong).\n \n Really, it is best to admit you are wrong and save face rather than continuing to look the fool. Be Christian about it.", 
   {}, 
   272131, 
   null, 
   1183491180.0
  ], 
  [
   272180, 
   null, 
   "jyoshu", 
   "I can keep this up as long as this takes. Each post you come up with obfuscating the request for you to PROVE YOUR CLAIM, I'll give yet another major group which proves your claim wrong.\n\n \n Keep WHAT up? Foundit, none of this on your part proves anything, because the vast majority of the \"ex-gay\" movement goes on in CHURCHES, not non-profit orgs. I've already told you that. But of course, you ignored it. Coming up with a few names of organizations that aren't on par with where most of these churches are isn't do your point any good.\n \n As far as the rest of your post, forget it. I'm not going to waste my time with you and your ad hominem-laced posts even though I'm sure you'll be up to your usual antics of portraying that refusal as me unable to prove my point. I simply don't think you're capable of admitting you are wrong. I've never seen you do it here before. It's absolutely stupid for you to expect someone to prove the obvious, and so I'm not going to start listing names of all the hundreds of churches for you that have ministries to struggling homosexuals. You've already admitted you don't care, so I'm not going to bother. If you really did care, I would be more inclined to Google their names and paste them all into a big post. But why should I when you just said, right there, you don't really care anyway? I've been down this road with you too many times. This is nothing more than a game to you (given your comments about it being a 'comedy' and \"<giggle<\" and all your other silly non-serious antics), and I'm not here to play you a game. Have your petty last word. Convincing you just isn't a priority, and you've basically even admitted now you're just in this for others to see, not for the sake of any real discourse with me. So take your game elsewhere.\n \n \nSorry, jyoshu, but I agree with the others here. You claimed that \"Christianity isn't going to 'budge' on this\", and it has been shown to you that it has - every day it \"budges\", and every day new churches accept the fact that homosexuality is an inherent sexual orientation, just as heterosexuality is.\n\n \n Most of Christianity isn't going to change on this, anytime soon. And of course, I meant 'most' and not 'all' of Christianity, despite Foundit's quibbling over semantics. Naturally it would be 'most', and he knows I meant it that way because he's not stupid. When everyone knows it's impossible to speak for every single person out of billions, it's a little ridiculous to hold people to qualifiers like the term \"most\" in a discussion such as this. But of course, since it's the way I had to have naturally meant it, I'll amend the comment to be \"most Christians\".\n \n Can I speak for Christianity a hundred years from now? No, of course not. maybe a long time from now the standard will be that the Bible is ignored on this matter and gay sex is viewed as just fine and dandy. Hell, maybe marriage won't even be considered important anymore, or maybe sex before marriage will be fine. I don't know, as I can't see into the future. But what I do feel I can confidently say is that it isn't going to change anytime soon for the most part with Christianity in general. And by that I man general doctrines and beliefs. That's not the same as saying a few more Christians are open to gay people.\n \n \nI really think it is better if you tip your hat and acknowledge that your claim was wrong and completely false (especially with the whole \"we-know-the-Catholic-stance-on-homosexuality\", which was also shown to be wrong).\n\n \n No, the Catholic stance certainly is NOT open to gay sexual relations. Just because some rogue Catholics think it's ok doesn't mean the RCC is changing one iota in terms of it's policy and doctrines. They haven't.\n \n \nBe Christian about it.\n\n \n But I'd be lying if I said otherwise. And that would not be Christian at all. emoticon_xgood", 
   {}, 
   272176, 
   null, 
   1183493820.0
  ], 
  [
   272185, 
   null, 
   "ShadowPikachu", 
   "\n Most of Christianity isn't going to change on this, anytime soon. And of course, I meant 'most' and not 'all' of Christianity, despite Foundit's quibbling over semantics. Naturally it would be 'most', and he knows I meant it that way because he's not stupid. When everyone knows it's impossible to speak for every single person out of billions, it's a little ridiculous to hold people to qualifiers like the term \"most\" in a discussion such as this. But of course, since it's the way I had to have naturally meant it, I'll amend the comment to be \"most Christians\".\n\n See here, folks - a classic example of a Jyoshu backpedal!\n \n Sorry Jyoshu, but YOU made the generalization - but at least we see that you are man enough to admit that you should have said \"most Christians\" (even though I wouldn't really go that far - millions of Christians accept gays for who they are. I should know - I'm a member of the largest Lutheran Church in America, which does just that - and our around 5 million members are just one church of many).\n \n \n\n Can I speak for Christianity a hundred years from now? No, of course not. maybe a long time from now the standard will be that the Bible is ignored on this matter and gay sex is viewed as just fine and dandy. Hell, maybe marriage won't even be considered important anymore, or maybe sex before marriage will be fine. I don't know, as I can't see into the future. But what I do feel I can confidently say is that it isn't going to change anytime soon for the most part with Christianity in general. And by that I man general doctrines and beliefs. That's not the same as saying a few more Christians are open to gay people.\n\n EXACTLY! You CAN'T speak for Christianity a hundred years from now. That is exactly why you SHOULDN'T have made that statement. \n \n As to \"Bible is ignored on this matter\", no, we do not ignore it - we just choose to interpret it differently than you: I really do not see anywhere that loving gay couples are condemned in the bible - temple prostitution, rape, and pagan rituals involving gay sex, yes, but not loving gay couples. \n \n \n\n No, the Catholic stance certainly is NOT open to gay sexual relations. Just because some rogue Catholics think it's ok doesn't mean the RCC is changing one iota in terms of it's policy and doctrines. They haven't.\n\n And yet, you generalized, and now you are backpedaling when it is shown that some catholics ARE open to gays - \"rogue Catholics\" my arse. emoticon_rolleyes\n \n \n\n But I'd be lying if I said otherwise. And that would not be Christian at all. emoticon_xgood\n\n \n Sorry, but your post up till now just showed that you DID admit you were wrong. You can label it as something else if you need that as a security blanket, but I do commend you on your mind - not every person can admit they are wrong without actually admitting it. emoticon_xgood", 
   {}, 
   272180, 
   null, 
   1183495140.0
  ], 
  [
   272199, 
   null, 
   "jyoshu", 
   "See here, folks - a classic example of a Jyoshu backpedal!\n\n \n If that's what you consider a \"backpedal\", then by golly, so be it. Goodness, I just assumed that no one would actually think I mean every single individual Christian in the entire world! emoticon_frazzled And frankly, I really don't think that's an unreasonable assumption.\n \n \nSorry Jyoshu, but YOU made the generalization - but at least we see that you are man enough to admit that you should have said \"most Christians\"\n\n \n Oh good grief. emoticon_rolleyes Yes, Shadow, \"most.\"", 
   {}, 
   272185, 
   null, 
   1183502040.0
  ], 
  [
   272206, 
   null, 
   "ShadowPikachu", 
   "If that's what you consider a \"backpedal\", then by golly, so be it. Goodness, I just assumed that no one would actually think I mean every single individual Christian in the entire world! emoticon_frazzled And frankly, I really don't think that's an unreasonable assumption.\n \n \n \n Oh good grief. emoticon_rolleyes Yes, Shadow, \"most.\"\n\n \n sorry, Jyoshu, but I'm not gonna sit around and let you make generlizations on Christians like myself and millions of others who accept gays, and their relationships.\n \n And your terminology was that \"Christianity\" would not budge - that implies ALL Christians.", 
   {}, 
   272199, 
   null, 
   1183504680.0
  ], 
  [
   272210, 
   null, 
   "foundit66", 
   "Keep WHAT up? Foundit, none of this on your part proves anything, because the vast majority of the \"ex-gay\" movement goes on in CHURCHES, not non-profit orgs.\n\n I've high-lighted this because of the incredible irony in all this.\n I am PROVING my point. REFUTING his earlier claim that Exodus was just the exception to the rule in his pretense that it was just finally coming to a position that others had come to for so long. \n And these aren't small organizations I speak of. They are the BIG guns. NARTH. Exodus. PFOX. The name-brands you see on the shelves when you hear about the ex-gays...\n And NONE of that \"proves anything\" to him.\n \n What is \"proof\" to him?\n \n \nI've already told you that. But of course, you ignored it.\n \n Jyoshu \"telling\" me something is \"proof\".\n NO actual substantiation on his part. Just because he told me something.\n \n And for the record, I'm not \"ignoring\" it.\n I need PROOF of your claim before it can be considered valid.\n \n Because quite frankly, NOT ONLY have you JUST made a claim (with no substantiation) that most ex-gays are with the churches, but you have ALSO JUST made a claim (with no substantiation) that these churches primarily preach a story that does NOT coincide with just \"abstinence\" instead of the usual \"we can change you from gay to straight\".\n \n NONE of his side has had ANY proof.\n None whatsoever.\n Just him yapping...\n \n Despite Jyoshu's incessant unsubstantiated claims and what he has \"told me\", the truth is that the primary message sent out there by these ex-gay organizations IS that they can change you from gay to straight.\n I'm feeling charitable, so I'll offer two more now.\n One, a referral to a christian \"therapist\" by FOF, who believes gays can become straight.\n Another by evergreen international.\n http://www.evergreeninternational.org/testimonies.htm\n http://dir.salon.com/story/news/feature/2005/07/19/gaytherapy/index.html\n \n \n \nComing up with a few names of organizations that aren't on par with where most of these churches are isn't do your point any good.\n\n Jyoshu, like I've told you in the past, NOTHING will convince you. I know that.\n Me coming up with a few names of organizations, easily and at will, is never going to be comparable to you coming up with ABSOLUTELY NO NAMES. I get that.\n You coming up with NO examples, and just your claims, is always going to trump my evidence in your head.\n \n \n \nAs far as the rest of your post, forget it. I'm not going to waste my time with you and your ad hominem-laced posts even though I'm sure you'll be up to your usual antics of portraying that refusal as me unable to prove my point.\n\n They weren't ad hominem. That is a ploy you utilize whenever you ARE about to ignore everything I have said.\n And it is just LAME.\n Anybody can see through it.\n \n \n \nI simply don't think you're capable of admitting you are wrong.\n\n Pot? Meet kettle!\n On another board, you claimed there were \"hard facts\" that democrats employed tokenism for gays. When pressed for proof, you tried to change the subject.\n You claimed that the democrats were behind the passing of the anti-gay funding amendment for D.C. When proven wrong, you ignored it.\n \n Jyoshu, I'm NOT wrong on this issue. I have been happily putting up proof left and right.\n \n \n \nIt's absolutely stupid for you to expect someone to prove the obvious, and so I'm not going to start listing names of all the hundreds of churches for you that have ministries to struggling homosexuals.\n\n 1) Notice the obvious ploy here?\n Claiming that he shouldn't have to \"prove the obvious\" is such an \"obvious\" cop-out. A demonstration that he won't prove it, and just wants you to ASSUME it's \"obvious\".\n 2) Also notice how he has subtly SHIFTED THE FOCUS AGAIN.\n Well. Not so subtle when I put it in caps...\n I'm not challenging him to show me \"ministries to struggling homosexuals\".\n I want to see reparative therapy groups which DO NOT CLAIM that they can change gays to straight.\n \n Because despite what he wants to pretend is truth, that IS what you hear about.\n Over and over they send out the message: \"We can make you straight!\"\n When have you EVER heard one of these organizations shout out \"We can make you celibate!\" ???\n \n \n \nYou've already admitted you don't care, so I'm not going to bother. If you really did care, I would be more inclined to Google their names and paste them all into a big post.\n\n And you'll notice EVEN MORE falsehoods.\n The SPECIFIC thing I said I didn't care about was whether or not christians detrimented their own lives on their own mythology.\n I NEVER said I didn't care about getting WHAT I HAVE SPECIFICALLY REQUESTED ALL ALONG.\n \n So if it helps Jyoshu, I care so much about you giving me those names that it positively HURTS.\n Don't you care that I hurt?\n < end sarcasm <\n \n More obfuscation.\n More falsehoods from Jyoshu.\n Must be a day that ends in \"y\"...\n \n \n \nBut why should I when you just said, right there, you don't really care anyway?\n\n Are you sure you're not quoting YOURSELF INSTEAD Jyoshu???\n Jyoshu: Because frankly, I don't really care that much if you're convinced or not.\n \n \n \nConvincing you just isn't a priority, and you've basically even admitted now you're just in this for others to see, not for the sake of any real discourse with me.\n\n Jyoshu, I'm not in this for HONEST and INTELLIGENT discourse with you because I don't think you're capable of that.\n If you ever are, let me know.\n \n \n \nMost of Christianity isn't going to change on this, anytime soon. And of course, I meant 'most' and not 'all' of Christianity, despite Foundit's quibbling over semantics.\n\n More falsehoods from Jyoshu.\n You said Christianity would not budge.\n This isn't semantics. It's a common sense application.\n Obviously, it IS budging.\n \n \n \nCan I speak for Christianity a hundred years from now?\n\n Again, you said christianity would not budge on the gay issue.\n You have already professed to.\n \n \n \nIf that's what you consider a \"backpedal\", then by golly, so be it. Goodness, I just assumed that no one would actually think I mean every single individual Christian in the entire world!\n\n And again with the obfuscation.\n As ShadowPikachu pointed out, we're talking about MILLIONS of Christians.\n That's a pretty big \"budge\".\n Not just \"single individual Christians\"...", 
   {}, 
   272180, 
   null, 
   1183509660.0
  ], 
  [
   272218, 
   null, 
   "jyoshu", 
   "~ \"Say ... the weather sure is hot these summer days.\"\n \n \n ~ \"Whoa!! \"these days\"? That's a generalization!! Not every single day is hot! Sometimes it rains and cools things off! You're telling a falsehood!\"\n \n \n ~ \"Huh? No, no, I don't mean every single day.\"\n \n \n ~ \"No, you meant EVERY day! So prove you claim that it's hot every single day of this summer!\"\n \n \n ~ \"But I didn't mean every single summer day that there is. Surely you understand that's not what I meant. All I said was that 'the weather sure is hot these days.' \"\n \n \n ~ \"No! You meant EVERY SINGLE SUMMER DAY. So now you're backpedaling! And obfuscating too!\" And telling falsehoods! ROFLMAO! < giggle < \"This is like watching a comedy!\" < giggle < \"A comedy!\" ROFLMAO! \n \n \n ~ \"Uh ... yeeaaah ... ok.\" [completely freaked out and stepping away backwards carefully]", 
   {}, 
   272210, 
   null, 
   1183520040.0
  ], 
  [
   272224, 
   null, 
   "ShadowPikachu", 
   "~ \"Say ... the weather sure is hot these summer days.\"\n \n \n ~ \"Whoa!! \"these days\"? That's a generalization!! Not every single day is hot! Sometimes it rains and cools things off! You're telling a falsehood!\"\n \n \n ~ \"Huh? No, no, I don't mean every single day.\"\n \n \n ~ \"No, you meant EVERY day! So prove you claim that it's hot every single day of this summer!\"\n \n \n ~ \"But I didn't mean every single summer day that there is. Surely you understand that's not what I meant. All I said was that 'the weather sure is hot these days.' \"\n \n \n ~ \"No! You meant EVERY SINGLE SUMMER DAY. So now you're backpedaling! And obfuscating too!\" And telling falsehoods! ROFLMAO! < giggle < \"This is like watching a comedy!\" < giggle < \"A comedy!\" ROFLMAO! \n \n \n ~ \"Uh ... yeeaaah ... ok.\" [completely freaked out and stepping away backwards carefully]\n\n \n And yet, who would be the one attacking one of US if we made a similar generalization. YOU.\n \n So, Jyoshu, I say to you, Christians are degenerate, homophobic, bigoted, racial cleansers and Nazi supporters. Christianity supports genocide, infanticide, ethnic cleansing, filicide, burning of human beings, and the slaughter of gays.\n \n And boy, if I said that out of this current argument, you and Archie and Jims would be all over me. Funny that. emoticon_rolleyes", 
   {}, 
   272218, 
   null, 
   1183523880.0
  ], 
  [
   272227, 
   null, 
   "jyoshu", 
   "And boy, if I said that out of this current argument, you and Archie and Jims would be all over me. Funny that. emoticon_rolleyes\n\n \n Fair enough.", 
   {}, 
   272224, 
   null, 
   1183524780.0
  ], 
  [
   272230, 
   null, 
   "ShadowPikachu", 
   "Fair enough.\n\n \n Good man.\n \n It's much easier to see our complaints when you look at the total picture, isn't it?emoticon_xgood", 
   {}, 
   272227, 
   null, 
   1183525620.0
  ], 
  [
   272236, 
   null, 
   "foundit66", 
   "~ \"Say ... the weather sure is hot these summer days.\"\n ~ \"Whoa!! \"these days\"? That's a generalization!! Not every single day is hot! Sometimes it rains and cools things off! You're telling a falsehood!\"\n ~ \"Huh? No, no, I don't mean every single day.\"\n ~ \"No, you meant EVERY day! So prove you claim that it's hot every single day of this summer!\"\n ~ \"But I didn't mean every single summer day that there is. Surely you understand that's not what I meant. All I said was that 'the weather sure is hot these days.' \"\n ~ \"No! You meant EVERY SINGLE SUMMER DAY. So now you're backpedaling! And obfuscating too!\" And telling falsehoods! ROFLMAO! < giggle < \"This is like watching a comedy!\" < giggle < \"A comedy!\" ROFLMAO! \n ~ \"Uh ... yeeaaah ... ok.\" [completely freaked out and stepping away backwards carefully]\n\n \n \"Well since you didn't address my points, I'll assume you're done! A simple \"ok, I concede that ... and moving on back to the issues ...\"\n ***Jyoshu", 
   {}, 
   272218, 
   null, 
   1183528620.0
  ], 
  [
   272246, 
   null, 
   "samiinh", 
   "And yet, who would be the one attacking one of US if we made a similar generalization. YOU.\n \n So, Jyoshu, I say to you, Christians are degenerate, homophobic, bigoted, racial cleansers and Nazi supporters. Christianity supports genocide, infanticide, ethnic cleansing, filicide, burning of human beings, and the slaughter of gays.\n \n And boy, if I said that out of this current argument, you and Archie and Jims would be all over me. Funny that. emoticon_rolleyes\n\n \n But what you say IS true.", 
   {}, 
   272224, 
   null, 
   1183553220.0
  ], 
  [
   272247, 
   null, 
   "samiinh", 
   "http://www.soulforce.org/article/1277\n \n Here's another piece of the ex-gay apology.", 
   {}, 
   272246, 
   null, 
   1183554000.0
  ], 
  [
   272250, 
   null, 
   "Archangel", 
   "And yet, who would be the one attacking one of US if we made a similar generalization. YOU.\n \n So, Jyoshu, I say to you, Christians are degenerate, homophobic, bigoted, racial cleansers and Nazi supporters. Christianity supports genocide, infanticide, ethnic cleansing, filicide, burning of human beings, and the slaughter of gays.\n \n And boy, if I said that out of this current argument, you and Archie and Jims would be all over me. Funny that. emoticon_rolleyes\n\n \n And this coming from a so called, self proclaimed \"rational christian\" ? It appears you have blown your cover as a poser by showing your true colors as an anti-christian atheist and a hatemonger. Thanks for revealing your true Nature. emoticon_xgood", 
   {}, 
   272224, 
   null, 
   1183559580.0
  ], 
  [
   272267, 
   null, 
   "ShadowPikachu", 
   "And this coming from a so called, self proclaimed \"rational christian\" ? It appears you have blown your cover as a poser by showing your true colors as an anti-christian atheist and a hatemonger. Thanks for revealing your true Nature. emoticon_xgood\n\n \n emoticon_wow emoticon_wow emoticon_wow emoticon_wow emoticon_wow emoticon_wow emoticon_wow emoticon_wow\n \n Wow, Archie, I knew you were clueless, but this just tops every other dense statement you made. Do you even know what context is?\n \n Read the entire set of replies between myself and Jyoshu.\n \n Maybe even in your cluelessness you will see that I used those statements to make a point - they are not something I beleive, being a Christian myself - that showed Jyoshu why Foundit and I were arguing about his generalization, by exggerating a generalization myself to make my point. \n \n If, after reading the set of replies, you still do not understand, ask Jyoshu, who realised what my entire point of that post was. I'm sure he'll be willing to explain it to you.\n \n It's alright that you are clueless, Archie, we all still luv ya! ;)", 
   {}, 
   272250, 
   null, 
   1183573560.0
  ], 
  [
   272268, 
   null, 
   "ShadowPikachu", 
   "But what you say IS true.\n\n \n Only of some who claim to be Christian.\n \n As a Christian myself I would hope that I am not and never will be any one of those. :)", 
   {}, 
   272246, 
   null, 
   1183573740.0
  ], 
  [
   272292, 
   null, 
   "foundit66", 
   "\"Well since you didn't address my points, I'll assume you're done! A simple \"ok, I concede that ... and moving on back to the issues ...\"\n ***Jyoshu\n\n I was reminded of yet another example, explicitly \"church-based\", of how the vast majority of the \"ex-gay\" thrust revolves around claims of changing people from gay to straight.\n \n After the scandal was publicized, Haggard entered three weeks of intensive counseling, overseen by four ministers. On February 6, 2007, one of those ministers, Tim Ralph stated that Haggard \"is completely heterosexual.\"[3] Ralph later said he meant to say that therapy \"gave Ted the tools to help to embrace his heterosexual side.\"[4]http://en.wikipedia.org/wiki/Ted_Haggard\n \n That's right! In just THREE WEEKS, these evangelicals can erase your gay! emoticon_xgood \n emoticon_rolleyes", 
   {}, 
   272236, 
   null, 
   1183602720.0
  ], 
  [
   272327, 
   null, 
   "samiinh", 
   "I was reminded of yet another example, explicitly \"church-based\", of how the vast majority of the \"ex-gay\" thrust revolves around claims of changing people from gay to straight.\n \n After the scandal was publicized, Haggard entered three weeks of intensive counseling, overseen by four ministers. On February 6, 2007, one of those ministers, Tim Ralph stated that Haggard \"is completely heterosexual.\"[3] Ralph later said he meant to say that therapy \"gave Ted the tools to help to embrace his heterosexual side.\"[4]http://en.wikipedia.org/wiki/Ted_Haggard\n \n That's right! In just THREE WEEKS, these evangelicals can erase your gay! emoticon_xgood \n emoticon_rolleyes\n\n \n \n What a laugh that is. Yet people will believe it. Some people are incredibly stupid and gullible. That's why bible salesmen and other snake oil salesmen do so will in this country of ignorant uneducated people.", 
   {}, 
   272292, 
   null, 
   1183636500.0
  ], 
  [
   272333, 
   null, 
   "Matthew S", 
   "I was reminded of yet another example, explicitly \"church-based\", of how the vast majority of the \"ex-gay\" thrust revolves around claims of changing people from gay to straight.\n \n After the scandal was publicized, Haggard entered three weeks of intensive counseling, overseen by four ministers. On February 6, 2007, one of those ministers, Tim Ralph stated that Haggard \"is completely heterosexual.\"[3] Ralph later said he meant to say that therapy \"gave Ted the tools to help to embrace his heterosexual side.\"[4]http://en.wikipedia.org/wiki/Ted_Haggard\n \n That's right! In just THREE WEEKS, these evangelicals can erase your gay! emoticon_xgood \n emoticon_rolleyes\n\n \n I have wondered how they tested that? Did they use the test where they hook his penis up to electrodes, show him pictures of naked men and women then measure his response? Did Tim Ralph try and have sex with him? Did they look inside his mind and see he had no homosexual impulses? Or was it, like many being tortured, he gave them what they wanted to hear? \n \n BTW how goes the Ted Haggard falling off the hetero wagon betting pool going?", 
   {}, 
   272292, 
   null, 
   1183641780.0
  ], 
  [
   272362, 
   null, 
   "jyoshu", 
   "I was reminded of yet another example, explicitly \"church-based\", of how the vast majority of the \"ex-gay\" thrust revolves around claims of changing people from gay to straight.\n \n After the scandal was publicized, Haggard entered three weeks of intensive counseling, overseen by four ministers. On February 6, 2007, one of those ministers, Tim Ralph stated that Haggard \"is completely heterosexual.\"[3] Ralph later said he meant to say that therapy \"gave Ted the tools to help to embrace his heterosexual side.\"[4]http://en.wikipedia.org/wiki/Ted_Haggard\n \n That's right! In just THREE WEEKS, these evangelicals can erase your gay! emoticon_xgood \n emoticon_rolleyes\n\n \n It seems to me that statement that he was \"completely heterosexual\" was not as a statement that he had been changed into a heterosexual, but rather as a statement (perhaps untrue) that it was simply what he was and had been. IOW, after spending time with him their conclusion was that he wasn't gay, after all. (Now whether that's accurate or not is another debate.) I've certainly seen no evidence around the Haggard case that he was entering any sort of \"ex-gay\" program designed to change him into a straight person. In fact, the leaders who met with him called it a \"restoration process\" (as in , restoration of his relationship with God) not an ex-gay program. And it stands to reason, given how much they think being gay is bad, that they would have made no bones about calling it \"becoming an ex-gay\" or \"changing to a straight\" if that's what it was. And particularly since the followup statement was that he had been given the tools to embrace his heterosexual side, it's all the more evidence they weren't saying he had been morphed from gay to a straight person (since the implication is that there are two sides).\n \n As an aside, I hear Haggard has become bedfellows ... er, joined with environmentalists now on the global warming issue. emoticon_xangel", 
   {}, 
   272292, 
   null, 
   1183656000.0
  ], 
  [
   272379, 
   null, 
   "samiinh", 
   "It seems to me that statement that he was \"completely heterosexual\" was not as a statement that he had been changed into a heterosexual, but rather as a statement (perhaps untrue) that it was simply what he was and had been. IOW, after spending time with him their conclusion was that he wasn't gay, after all. (Now whether that's accurate or not is another debate.) I've certainly seen no evidence around the Haggard case that he was entering any sort of \"ex-gay\" program designed to change him into a straight person. In fact, the leaders who met with him called it a \"restoration process\" (as in , restoration of his relationship with God) not an ex-gay program. And it stands to reason, given how much they think being gay is bad, that they would have made no bones about calling it \"becoming an ex-gay\" or \"changing to a straight\" if that's what it was. And particularly since the followup statement was that he had been given the tools to embrace his heterosexual side, it's all the more evidence they weren't saying he had been morphed from gay to a straight person (since the implication is that there are two sides).\n \n As an aside, I hear Haggard has become bedfellows ... er, joined with environmentalists now on the global warming issue. emoticon_xangel\n\n \n More mumbly-jumbly god talk. Ugh. I believe Haggard had joined the environmental cause before his celebrity as an acid-head.", 
   {}, 
   272362, 
   null, 
   1183659480.0
  ], 
  [
   272442, 
   null, 
   "foundit66", 
   "It seems to me that statement that he was \"completely heterosexual\" was not as a statement that he had been changed into a heterosexual, but rather as a statement (perhaps untrue) that it was simply what he was and had been. IOW, after spending time with him their conclusion was that he wasn't gay, after all. (Now whether that's accurate or not is another debate.)\n\n Oh yes.\n A guy who goes out and cheats on his wife with another man obviously is NOT gay. And it's easily overlooked by mounds of words that sound like \"blah, blah, blah\", all intent on distracting by the fact that he CHEATED ON HIS WIFE WITH A MAN.\n But I'm sure that is a \"debate\" for some.\n \n The guy was either bisexual or gay.\n Obfuscating that is pointless.\n \n \n \nI've certainly seen no evidence around the Haggard case that he was entering any sort of \"ex-gay\" program designed to change him into a straight person. In fact, the leaders who met with him called it a \"restoration process\" (as in , restoration of his relationship with God) not an ex-gay program.\n\n I'm sorry, but are we really expecting honesty from this group? emoticon_emb \n Seriously???\n \n The guy LIED when it first came out, and he has continued to LIE afterwards.\n Changing his story just long enough so the evangelicals could shove him out of the public eye, claiming he had been \"cured\" or \"restored\" or whatever word that they need to use to say \"Nothing to see here...\"\n \n I could care less what the evangelicals \"called\" it.\n \n \n \nAnd it stands to reason, given how much they think being gay is bad, that they would have made no bones about calling it \"becoming an ex-gay\" or \"changing to a straight\" if that's what it was.\n\n No. That does not \"stand to reason\".\n It stands to reason that this PARTICULAR guy was a HIGH-PROFILE PREACHER who many people had donated money to these guys' churches because he had spoken.\n And he was a LIAR.\n \n So the easiest thing to do to try and minimize the whole situation is to persuade the gullible that he was not lying, to minimize the amount that they felt deceived and keep that ever loving $$$ flowing into the church. emoticon_xagree \n \n Not only are they trying to minimize their OWN embarrassment at the situation, they're trying to return everything to \"business as usual\" as quickly as possible.\n It's just too difficult to do that with the truth.\n WHY do you think Haggard was lying from square one?\n WHY do you think the church veiled his infidelities in such RIDICULOUSLY VAGUE terms as they did?\n They never even came out and ADMITTED what he ACTUALLY did.\n And you think they would have \"no problem\" with calling him \"ex-gay\"???\n Puh-leaZE!!!\n \n \n \nAnd particularly since the followup statement was that he had been given the tools to embrace his heterosexual side, it's all the more evidence they weren't saying he had been morphed from gay to a straight person (since the implication is that there are two sides).\n\n Oh Jyoshu.\n I KNOW what they were \"saying\"...\n \n Part of the whole argument on this has been that the religious perspective on gays has never been known for honesty.\n So quoting them doesn't really do much to help the situation...", 
   {}, 
   272362, 
   null, 
   1183683540.0
  ], 
  [
   272443, 
   null, 
   "jyoshu", 
   "It stands to reason that this PARTICULAR guy was a HIGH-PROFILE PREACHER who many people had donated money to these guys' churches because he had spoken. And he was a LIAR. \n So the easiest thing to do to try and minimize the whole situation is to persuade the gullible that he was not lying, to minimize the amount that they felt deceived and keep that ever loving $$$ flowing into the church.\n\n \n Ah, so you're thinking this was about money.\n \n \nNot only are they trying to minimize their OWN embarrassment at the situation, they're trying to return everything to \"business as usual\" as quickly as possible.\n It's just too difficult to do that with the truth.\n WHY do you think Haggard was lying from square one?\n WHY do you think the church veiled his infidelities in such RIDICULOUSLY VAGUE terms as they did?\n They never even came out and ADMITTED what he ACTUALLY did.\n And you think they would have \"no problem\" with calling him \"ex-gay\"???\n Puh-leaZE!!!\n\n \n Well, let me tell you what I think based upon my experiences in evangelical Christianity. If you care. (which you probably don't, given what I've seen.)\n \n He and his fellow church leaders really did (and still do) genuinely believe that he is 'straight', and simply strayed--fell into temptation--temptation he is susceptible to (because he is really gay). You see, what they really think is that 'straight' is the correct way, and that anything else is a departure from the way life is supposed to be. He wasn't lying about that. Well, not intentionally. He really does think he fell into temptation, and really, in his thinking, whether or not he is gay in reality is irrelevant anyway.\n \n Then his \"sins\" came to light, and at that point he did intentionally lie, minimizing what he was up to regarding gay sex and meth.\n \n Yes, you'll probably do your usual thing and act as though my thoughts on it are ridiculous, or that accuse me of some \"falsehood\". Do your usual if you want; I don't care.\n \n \nPart of the whole argument on this has been that the religious perspective on gays has never been known for honesty.\n\n \n Maybe not honesty in the sense that they reject what groups like the APA focus on--orientation. Orientation is irrelevant in the thinking of many evangelical Christians. But I find it odd, and frankly misguided on your part, that you seem to think they must not actually genuinely believe what they are saying (hence your insistence they are being dishonest). Make no mistake--they do.", 
   {}, 
   272442, 
   null, 
   1183685820.0
  ], 
  [
   272444, 
   null, 
   "ShadowPikachu", 
   "Ah, so you're thinking this was about money.\n \n\n That's pretty much all it IS about for many Evangelical Christians (those in the upper echelons, of course - not the poor average Joe who falls for their bull$hit teachings, and is the one that is PROVIDING the money).", 
   {}, 
   272443, 
   null, 
   1183686000.0
  ], 
  [
   272449, 
   null, 
   "foundit66", 
   "Ah, so you're thinking this was about money.\n\n Money. Image. Vanity.\n PR...\n \n Looking at how they have acted on this example, it's kind of hard to deny that there is something else going on.\n \n \n \nWell, let me tell you what I think based upon my experiences in evangelical Christianity. If you care. (which you probably don't, given what I've seen.)\n He and his fellow church leaders really did (and still do) genuinely believe that he is 'straight', and simply strayed--fell into temptation--temptation he is susceptible to (because he is really gay). You see, what they really think is that 'straight' is the correct way, and that anything else is a departure from the way life is supposed to be. He wasn't lying about that. Well, not intentionally. He really does think he fell into temptation, and really, in his thinking, whether or not he is gay in reality is irrelevant anyway.\n\n See, THAT is PART OF THE PROBLEM.\n I don't see it as \"evil\" lying with the intention to inflict mental horrors upon gays.\n These guys just DO NOT KNOW, and from their perspective they do not care beyond the bottom line of \"so you tell me you're not going to do it again, right?\"\n \n A lot of this revolves around rationalization. An attempt to FORCE what really happened into their belief system.\n And that's can be a pretty big problem...\n \n \n \nThen his \"sins\" came to light, and at that point he did intentionally lie, minimizing what he was up to regarding gay sex and meth.\n Yes, you'll probably do your usual thing and act as though my thoughts on it are ridiculous, or that accuse me of some \"falsehood\". Do your usual if you want; I don't care.\n\n Quite the drama queen, aren't you...\n You can be rational at times Jyoshu.\n At other times...\n \n \n \nMaybe not honesty in the sense that they reject what groups like the APA focus on--orientation. Orientation is irrelevant in the thinking of many evangelical Christians.\n\n And unfortunately, that's a problem.\n \n Because if you don't really care to understand the problem, how can you presume to fix it?\n \n \n \nBut I find it odd, and frankly misguided on your part, that you seem to think they must not actually genuinely believe what they are saying (hence your insistence they are being dishonest). Make no mistake--they do.\n\n Jyoshu, genuine belief in something does not negate the situation.\n Willful ignorance is still ignorance.", 
   {}, 
   272443, 
   null, 
   1183688280.0
  ], 
  [
   272502, 
   null, 
   "samiinh", 
   "[QUOTE=foundit66[/QUOTE]\n \n I can imagine that for Ted Hazzard, his time with the gay prostitute, was the first time in his life that he felt totally free and totally himself. But because of all the snakeoil he'd consumed since the beginning, the guilt was too much for him. Religion is child abuse.", 
   {}, 
   272449, 
   null, 
   1183721400.0
  ], 
  [
   272504, 
   null, 
   "samiinh", 
   "http://www.365gay.com/opinion/besen/besen.htm\n \n The christer view of life for homosexuals: Unfortunately, the opposite of homosexuality is not heterosexuality for ex-gays - it is a lifetime of loneliness, despair and celibacy.", 
   {
    "unicode_changes_made": true
   }, 
   272502, 
   null, 
   1183722600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Former 'Ex-Gay' Leaders Apologize For 'Bringing Harm", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10067-former-ex-gay-leaders-apologize-bringing-harm.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10067, 
  "discussion_files": [
   [
    "32557.html", 
    "http://www.4forums.com/political/gay-rights-debates/10067-former-ex-gay-leaders-apologize-bringing-harm-print.html"
   ], 
   [
    "32558.html", 
    "http://www.4forums.com/political/gay-rights-debates/10067-former-ex-gay-leaders-apologize-bringing-harm-5-print.html"
   ], 
   [
    "32559.html", 
    "http://www.4forums.com/political/gay-rights-debates/10067-former-ex-gay-leaders-apologize-bringing-harm-4-print.html"
   ], 
   [
    "32560.html", 
    "http://www.4forums.com/political/gay-rights-debates/10067-former-ex-gay-leaders-apologize-bringing-harm-3-print.html"
   ], 
   [
    "32561.html", 
    "http://www.4forums.com/political/gay-rights-debates/10067-former-ex-gay-leaders-apologize-bringing-harm-2-print.html"
   ]
  ], 
  "identifier": 10067
 }
]