[
 [
  [
   271726, 
   null, 
   "supersport", 
   "http://www.arn.org/blogs/index.php/literature/2007/05/\n \n Now that the opossum genome has been sequenced, both winners and losers have emerged. The main loser is the 'Genes-R-Us' school, who have argued that genes are the only really interesting components of the genome. This group is a loser because the \"vast majority of the opossum's genes are identical to other placental mammals\". Genes do not distinguish marsupials from placentals, but the non-coding elements (previously referred to as 'Junk DNA' are distinctly different. Thus, \"most of the genetic difference between marsupials and placental mammals comes from non-coding sequences, not proteins.\"\n \n The Evo-Devo community appears to consider itself a winner. The new research \"is bound to make the [evolutionary developmental biology] community very happy, because they've been saying all along that it's the regulation of genes that is what's driving the changes that we see in the evolution of animals.\" Some of this confidence is, however, misplaced: it is one thing to say that gene regulation is the key to understanding the difference between placentals and marsupials, but linking this to origins is theory-laden. The data does not speak for itself but is interpreted, often through an evolutionary filter.\n \n The ID community is also a winner. ID scholars have long been sceptical of the genetic reductionism displayed by most evolutionary biologists, and have also been quick to recognise the functionality of much of the so-called Junk DNA. These scholars have much in common with evo-devo, but see the regulation system as an extraordinarily complex system that invites design inferences when considering origins.\n \n ID scholars will also welcome the recognition that marsupials are not primitive mammals: \"The study helps to erode a common misconception that marsupials are somehow an archaic or second-rate category of mammal. One scientist comments on the discovery of a gene that encodes for a unique form of T-cell receptor not found in placental mammals: this \"knocks that assumption on its head [. . .] It shows that they have a very sophisticated immune system, but one that's very different.\"\n \n I underlined a sentence above......so tell me....if the vast majority of the opposum's genes are identical to other placental mammals, where exactly is the evolution?????????", 
   {
    "post_info": {
     "post_title": "The first marsupial genome"
    }
   }, 
   null, 
   null, 
   1183178460.0
  ], 
  [
   271727, 
   null, 
   "T.Q", 
   "Why would you start a new thread on a topic that has already been addressed only three threads down less than 24 hours ago? Do you think our memories are that short?", 
   {}, 
   271726, 
   null, 
   1183179420.0
  ], 
  [
   271728, 
   null, 
   "supersport", 
   "Why would you start a new thread on a topic that has already been addressed only three threads down less than 24 hours ago? Do you think our memories are that short?\n\n \n oh, must have missed it. Obviously I wouldn't have done that on purpose. what's the name of the thread?", 
   {}, 
   271727, 
   null, 
   1183179840.0
  ], 
  [
   271729, 
   null, 
   "chemist99a", 
   "oh, must have missed it. Obviously I wouldn't have done that on purpose.\n\n \n Including I suppose the underling of the same words in both places?", 
   {}, 
   271728, 
   null, 
   1183179900.0
  ], 
  [
   271730, 
   null, 
   "supersport", 
   "Including I suppose the underling of the same words in both places?\n\n \n so where is the evolution?", 
   {}, 
   271729, 
   null, 
   1183179960.0
  ], 
  [
   271732, 
   null, 
   "chemist99a", 
   "Previously covered you realize. The best counter argument is that possoms and placentals share by far the vast majority of their basic structures. Same metabolism, same tissues, same basic body form, four limbs ....... and so forth. Indeed depending on the way you count the features they share the vast majority. Why would you require that the genetic differences be at odds with the metabolic, physiological, structural, and morphological differences which are relatively small? Its just a failure of preception.", 
   {}, 
   271730, 
   null, 
   1183180500.0
  ], 
  [
   271736, 
   null, 
   "supersport", 
   "Previously covered you realize. The best counter argument is that possoms and placentals share by far the vast majority of their basic structures. Same metabolism, same tissues, same basic body form, four limbs ....... and so forth. Indeed depending on the way you count the features they share the vast majority. Why would you require that the genetic differences be at odds with the metabolic, physiological, structural, and morphological differences which are relatively small? Its just a failure of preception.\n\n \n you could say the same about humans and chimps -- we both share many basic structures....likewise our genes are quite similar. But the thing is, evolutionists have told a story for decades that even the smallest changes happen by way of random mutation and natural selection. They've counted up all the molecular events that had to happen to gradually lead from a chimp-like creature to a human...they even put a clock on it. But now they're saying the big differences aren't in the genes, but in how these genes are expressed. \n \n Gene Regulation Separates Humans from Chimps - Study\n \n http://www.planetark.com/dailynewsstory.cfm/newsid/35540/story.htm\n \n \n The story is starting to sound like a broken record. Dogs are the same way.\n \n 'All dogs have same genes'\n \n Scientists baffled\n \n http://www.news24.com/News24/Technology/News/0,6119,2-13-1443_1846880,00.html\n \n The problem seems to be there's never any actual evolution going on.", 
   {
    "unicode_changes_made": true
   }, 
   271732, 
   null, 
   1183181280.0
  ], 
  [
   271744, 
   null, 
   "Symbiote", 
   "You're trying to equate \"mostly the same genes\" with \"exactly the same genes\", which is completely untrue.\n \n Dogs share the vast majority of genes with each other, and surprise surprise they all have a lot of similarities.\n \n The question for you is, why are there genetic similarities between most closely related organisms, and less similarity between more distantly related organisms, why aren't whales and snakes 99% the same?\n \n Scientists aren't \"baffled\" by these findings, they're roughly what was expected. If a chihuaha and a great dane had 0 genetic similarity, that would be baffling.", 
   {}, 
   271736, 
   null, 
   1183184160.0
  ], 
  [
   271767, 
   null, 
   "lesz", 
   "Scientists aren't \"baffled\" by these findings, they're roughly what was expected. If a chihuaha and a great dane had 0 genetic similarity, that would be baffling.\n\n \n Precisely. No two animals of the same species even have identical genes, unless they are identical twins (and even then...).\n \n Of course, one problem is with the definition of a gene. With the discovery of master genes and control DNA sequences, this is becoming fuzzier. In principle, two different species might have the same genes, if by genes we mean DNA sequences that are translated into RNA or protein, but if they are differently arranged with different control sequences, then they might very well give rise to different species simply by differential gene expression.\n \n That's the main insight of evo-devo.", 
   {}, 
   271744, 
   null, 
   1183212600.0
  ], 
  [
   271771, 
   null, 
   "supersport", 
   "You're trying to equate \"mostly the same genes\" with \"exactly the same genes\", which is completely untrue.\n \n Dogs share the vast majority of genes with each other, and surprise surprise they all have a lot of similarities.\n \n The question for you is, why are there genetic similarities between most closely related organisms, and less similarity between more distantly related organisms, why aren't whales and snakes 99% the same?\n \n Scientists aren't \"baffled\" by these findings, they're roughly what was expected. If a chihuaha and a great dane had 0 genetic similarity, that would be baffling.\n\n \n No I'm not trying to equate \"mostly the same genes\" with \"exactly the same genes.\" I would never do that because I know even family members' genes can vary quite a bit. And I'm beginning to believe that evolution doesn't happen in the genome anyway, for it appears to be locked to major evolutionary change...and any changes that do happen seem to be an effect, not a cause. \n \n What does seem to evolve, however, is the epigenome, which is what controls phenotype. It's like a blanket....the top of the blanket is often imprinted with a pattern (the epigenome)...this pattern can be re-drawn or re-expressed by the artist (the individual), but the material of the blanket can never be changed because a blanket is not and could never be something it's not -- such as a shoe or a microwave.\n \n But like I said before, evolutionists have told us for decades that every new little trait got to be by way of RMNS....that these little events are what separated chimps from humans, for instance. This has been their whole justification for their millions-year-old timeline -- because it would have taken this long for so many random molecular events to happen! But now they're finally admitting this isn't reality. Instead, all it takes is an environmentally-induced re-expression for a completely new and different body style to emerge. So what does this do to the timeline? Either chimps and humans separated instantly as individuals by way of epigenetics, or it didn't happen at all.", 
   {}, 
   271744, 
   null, 
   1183217220.0
  ], 
  [
   271779, 
   null, 
   "lesz", 
   "Either chimps and humans separated instantly as individuals by way of epigenetics, or it didn't happen at all.\n\n \n Unfortunately for this rosy little scenario, there is distinction between human and chimp genomes. They aren't identical, or merely expressed differently. They don't even have the same number of chromosomes, because a fusion -- mutation, to you -- occurred in two human chromosomes that did not occur in the chimp/gorilla line.\n \n Epigenetics alone is not responsible for the differences between chimps and humans. Their genomes, including genes and control sequences, are the key.", 
   {}, 
   271771, 
   null, 
   1183222800.0
  ], 
  [
   271809, 
   null, 
   "wascallywabbit", 
   "Unfortunately for this rosy little scenario, there is distinction between human and chimp genomes. They aren't identical, or merely expressed differently. They don't even have the same number of chromosomes, because a fusion -- mutation, to you -- occurred in two human chromosomes that did not occur in the chimp/gorilla line.\n \n Epigenetics alone is not responsible for the differences between chimps and humans. Their genomes, including genes and control sequences, are the key.\n\n \n \n **\n Just as a point of interest for us non-geneticists, could you guys please tell us, (apart from chimps and ourselves), how many other species, of every and any kind, were formed when two chromosomes in another, older species, fused into one chromsome in a new species? With examples, please?", 
   {}, 
   271779, 
   null, 
   1183237860.0
  ], 
  [
   271811, 
   null, 
   "chemist99a", 
   " But like I said before, evolutionists have told us for decades that every new little trait got to be by way of RMNS....that these little events are what separated chimps from humans, for instance. This has been their whole justification for their millions-year-old timeline -- because it would have taken this long for so many random molecular events to happen! But now they're finally admitting this isn't reality. Instead, all it takes is an environmentally-induced re-expression for a completely new and different body style to emerge. So what does this do to the timeline?\n \n\n Not exactly. You are decades out of date. Scientists have recognized the role of gene expression under control of (variable) genetic regulation switches for quite some time. For example homeobox genes have been recognized since 1983 about a quarter of a century. But of course variations in homeobox genes themselves come about by NDS type mechanisms. Development processes are themselves evolved and by NDS mechanisms. The problem with your statement is that you are confusing various mechanisms for generating variation with what amounts to vitalism. Tis not so. And random molecular events happen rather often. Often enough that one can find them in volumes of less than 1 liter containing bacteria or viruses or even cultured metazoan cells.\n \n \n Either chimps and humans separated instantly as individuals by way of epigenetics, or it didn't happen at all.\n\n \n Well we can agree that \"it\" happened I suppose. Chimps and humans presumably have a common ancestor. But it certainly is unlikely to have happened instantly regardless of the mechanism given the fossil record since there are ape-like ancestors in our linage which are NOT apparently in the chimp linage and vice versa. If \"it\" happened instantly there would (and could) be NO intermediates between the the chimp/human common ancestor and the chimp linage or the human linage. And of course there are. And there is no reason to conclude that epigentics is the sole mechanism involve or even that it played a measurable role.\n \n You really are an uninformed debater are you not. This is absolutely basic stuff which any intelligent layman should have noticed.", 
   {}, 
   271779, 
   null, 
   1183238460.0
  ], 
  [
   271813, 
   null, 
   "chemist99a", 
   "Of course, one problem is with the definition of a gene. With the discovery of master genes and control DNA sequences, this is becoming fuzzier. In principle, two different species might have the same genes, if by genes we mean DNA sequences that are translated into RNA or protein, but if they are differently arranged with different control sequences, then they might very well give rise to different species simply by differential gene expression.\n\n \n Ah but how does differential gene expression arise? From variations in the regualtory genes themselves? Or is it by magic as WW might have it?", 
   {}, 
   271811, 
   null, 
   1183238640.0
  ], 
  [
   271814, 
   null, 
   "chemist99a", 
   "Just as a point of interest for us non-geneticists, could you guys please tell us, (apart from chimps and ourselves), how many other species, of every and any kind, were formed when two chromosomes in another, older species, fused into one chromsome in a new species? With examples, please?\n\n \n Nope that would require knowledge we do not have. For example just doing it for the millions of species of beetles would take perhaps a few hundred years and by that time there would of course be new species! Feel free to submit your grant proposal to the relevant funding sources!", 
   {}, 
   271813, 
   null, 
   1183238880.0
  ], 
  [
   271815, 
   null, 
   "wascallywabbit", 
   "Nope that would require knowledge we do not have. For example just doing it for the millions of species of beetles would take perhaps a few hundred years and by that time there would of course be new species! Feel free to submit your grant proposal to the relevant funding sources!\n\n \n **\n So you duck out on producing any, simply because there are, or so you seem to be claiming, so many?!? You are an absolute expert at the art of dishonest evasion and misdirection, chemmy. You must have devoted your entire career to the practice of chicanery.\n \n Try ducking out of this one--name three [3] _mammalian_ species, not including our own, that have evolved by fusing two chromsomes of an earlier species into the single, fused chromsome now found in the novel species. Surely that won't be too much work for you, since you seem to believe that the world is full of examples,-- so full that you just can't seem to come up with any.", 
   {}, 
   271814, 
   null, 
   1183239360.0
  ], 
  [
   271820, 
   null, 
   "chemist99a", 
   "] So you duck out on producing any, simply because there are, or so you seem to be claiming, so many?!? You are an absolute expert at the art of dishonest evasion and misdirection, chemmy. You must have devoted your entire career to the practice of chicanery.\n \n I answered your original question clearly. If you consider that chicanry then get lost. You wanted ALL species, you can't have it.", 
   {}, 
   271815, 
   null, 
   1183240860.0
  ], 
  [
   271821, 
   null, 
   "chemist99a", 
   "] Try ducking out of this one--name three [3] _mammalian_ species, not including our own, that have evolved by fusing two chromsomes of an earlier species into the single, fused chromsome now found in the novel species. Surely that won't be too much work for you, since you seem to believe that the world is full of examples,-- so full that you just can't seem to come up with any.\n \n Ok its not my field and I am not going to waste the time to do the necessary reserach. Why should I. You can use your own time to find what you want to know. emoticon_xbye", 
   {}, 
   271820, 
   null, 
   1183240920.0
  ], 
  [
   271822, 
   null, 
   "supersport", 
   "**\n Just as a point of interest for us non-geneticists, could you guys please tell us, (apart from chimps and ourselves), how many other species, of every and any kind, were formed when two chromosomes in another, older species, fused into one chromsome in a new species? With examples, please?\n\n \n good question...I'd be interested in knowing that as well. \n \n Also, what does a fused chromosome have to do with differences in physiology? I realize different creatures have different numbers of chromosomes, but that does not necessarily mean that the numbers of chromosomes cause these differences in morphology. Likewise, all humans have different fingerprints -- that does not make fingerprints responsible for our differences. Darwinists seem to be implying that humans weren't yet humans until our chromosomes fused.", 
   {}, 
   271809, 
   null, 
   1183241160.0
  ], 
  [
   271823, 
   null, 
   "supersport", 
   "Chemist: Well we can agree that \"it\" happened I suppose. Chimps and humans presumably have a common ancestor. But it certainly is unlikely to have happened instantly regardless of the mechanism given the fossil record since there are ape-like ancestors in our linage which are NOT apparently in the chimp linage and vice versa. If \"it\" happened instantly there would (and could) be NO intermediates between the the chimp/human common ancestor and the chimp linage or the human linage. And of course there are\n \n I would like to see these intermediates. What's their names?\n \n Also, do you believe the human brain evolved (got larger) from an ape gradually, or very very quickly?", 
   {}, 
   271814, 
   null, 
   1183241580.0
  ], 
  [
   271826, 
   null, 
   "wascallywabbit", 
   "] So you duck out on producing any, simply because there are, or so you seem to be claiming, so many?!? You are an absolute expert at the art of dishonest evasion and misdirection, chemmy. You must have devoted your entire career to the practice of chicanery.\n \n I answered your original question clearly. If you consider that chicanry then get lost. You wanted ALL species, you can't have it.\n\n \n **\n Oh, man , you are such a grotesque LIAR. I did not not ask you to name every species, nor to give an example of every species. Here is what I said--\n \n \"Just as a point of interest for us non-geneticists, could you guys please tell us, (apart from chimps and ourselves), how many other species, of every and any kind, were formed when two chromosomes in another, older species, fused into one chromsome in a new species? With examples, please?\"\n \n All you, or lesly, or whoever, had to give was a rough number total, and an example or three. Trying to distort that request into a demand for the name and description of all species of lifeforms that have ever resulted from chromosome fusion is such bald-faced mendacity that you make a fool of yourself by trying it on. My god but you are a pathetic ideologue.", 
   {}, 
   271820, 
   null, 
   1183242900.0
  ], 
  [
   271829, 
   null, 
   "wascallywabbit", 
   "] Try ducking out of this one--name three [3] _mammalian_ species, not including our own, that have evolved by fusing two chromsomes of an earlier species into the single, fused chromsome now found in the novel species. Surely that won't be too much work for you, since you seem to believe that the world is full of examples,-- so full that you just can't seem to come up with any.\n \n Ok its not my field and I am not going to waste the time to do the necessary reserach. Why should I. You can use your own time to find what you want to know. emoticon_xbye\n\n \n **\n If you couldn;'t answer my question because, as you now admit, you simply did not know the answer to it, why were you incapable of simply keeping your mouth shut?", 
   {}, 
   271821, 
   null, 
   1183243260.0
  ], 
  [
   271857, 
   null, 
   "chemist99a", 
   "If you couldn;'t answer my question because, as you now admit, you simply did not know the answer to it, why were you incapable of simply keeping your mouth shut?\n\n \n If you could not answer your own question why did you not do the same?", 
   {}, 
   271829, 
   null, 
   1183252920.0
  ], 
  [
   271859, 
   null, 
   "chemist99a", 
   "WW said\"\n \n \n \n \n\"Just as a point of interest for us non-geneticists, could you guys please tell us, (apart from chimps and ourselves), how many other species, of every and any kind, were formed when two chromosomes in another, older species, fused into one chromsome in a new species? With examples, please?\"\n\n \n He later made this claim for his inquiry:\n \n \nOh, man , you are such a grotesque LIAR. I did not not ask you to name every species, nor to give an example of every species.\n \n \n Which is of course patently false given the language \"of every and any kind\" in the question! What an idiot.\n \n Now a second response on my part.\n \n ll you want you go count em. Grab a few billion bucks of spare cash and buy yourself a staff of genetics guys turn em loose. You did NOT only ask for examples here you asked for a count including \"every and any kind\" that means an exhaustive list. No such data exists and probably never will. So I did answer your question when I said I was unable to give you the answer. Frankly I did an honest job which you tried to distort into a dishonest job. That in itself is dishonesty.", 
   {}, 
   271857, 
   null, 
   1183253940.0
  ], 
  [
   271861, 
   null, 
   "chemist99a", 
   "All you, or lesly, or whoever, had to give was a rough number total, and an example or three. Trying to distort that request into a demand for the name and description of all species of lifeforms that have ever resulted from chromosome fusion is such bald-faced mendacity that you make a fool of yourself by trying it on. My god but you are a pathetic ideologue.\n\n \n I don't have a rough number which has any meaning, I do not think anyone does though I could be wrong. And an example or three would not have filled your question adequately. Your own words are your own words - edit them to mean what you intended if you choose. Else my reply stands.", 
   {}, 
   271826, 
   null, 
   1183254300.0
  ], 
  [
   271862, 
   null, 
   "chemist99a", 
   "I would like to see these intermediates. What's their names?\n\n \n Whats their names? Check out the following tree display of the human linage.\n \n http://www2.wwnorton.com/college/anthro/bioanth/ch11/welcome.htm\n \n See that link for a list of early homonoids. There are quite a few. The earliest one may or may not be the common ancestor of humans and chimps.\n \n As for chimps some now place the divergence at perhaps 4.5 million years ago long before there were any actual humans about. So you can see that the evolution of humans from our ancestors held in common by chimps was NOT instantaneous and that the divergence took time. You can check out the fossil record evidence on the web there are lots of sites. Suffice it to say that there are non-human fossils in the human linage which are NOT shared by the chimpanzee linage. I do not know the fossil record for the chimp linage as well as that for humans, but you will find it out there.\n \n \nAlso, do you believe the human brain evolved (got larger) from an ape gradually, or very very quickly?\n\n \n The evidence in our fossil linage seem to indcate a multistep increase in brain size over millions of years. Whether thats sudden or slow is in the eye of the beholder.", 
   {}, 
   271861, 
   null, 
   1183254960.0
  ], 
  [
   271864, 
   null, 
   "chemist99a", 
   "And if you must have an example of divergence due to chromosome fusions and such consider the house mouse\n \n ===========================\n \n Genetics, Vol 136, 1105-1120, Copyright © 1994\n \n INVESTIGATIONS\n Mitochondrial DNA Variation and the Evolution of Robertsonian Chromosomal Races of House Mice, Mus domesticus\n \n M. W. Nachman, S. N. Boyer, J. B. Searle and C. F. Aquadro\n Section of Genetics and Development, Biotechnology Building, Cornell University, Ithaca, New York 14853\n \n The house mouse, Mus domesticus, includes many distinct Robertsonian (Rb) chromosomal races with diploid numbers from 2n = 22 to 2n = 38. Although these races are highly differentiated karyotypically, they are otherwise indistinguishable from standard karyotype (i.e., 2n = 40) mice, and consequently their evolutionary histories are not well understood. We have examined mitochondrial DNA (mtDNA) sequence variation from the control region and the ND3 gene region among 56 M. domesticus from Western Europe, including 15 Rb populations and 13 standard karyotype populations, and two individuals of the sister species, Mus musculus. mtDNA exhibited an average sequence divergence of 0.84% within M. domesticus and 3.4% between M. domesticus and M. musculus. The transition/transversion bias for the regions sequenced is 5.7:1, and the overall rate of sequence evolution is approximately 10% divergence per million years. The amount of mtDNA variation was as great among different Rb races as among different populations of standard karyotype mice, suggesting that different Rb races do not derive from a single recent maternal lineage. Phylogenetic analysis of the mtDNA sequences resulted in a parsimony tree which contained six major clades. Each of these clades contained both Rb and standard karyotype mice, consistent with the hypothesis that Rb races have arisen independently multiple times. Discordance between phylogeny and geography was attributable to ancestral polymorphism as a consequence of the recent colonization of Western Europe by mice. Two major mtDNA lineages were geographically localized and contained both Rb and standard karyotype mice. The age of these lineages suggests that mice have moved into Europe only within the last 10,000 years and that Rb populations in different geographic regions arose during this time.", 
   {}, 
   271857, 
   null, 
   1183255500.0
  ], 
  [
   271865, 
   null, 
   "pandion", 
   "Unfortunately for this rosy little scenario, there is distinction between human and chimp genomes. They aren't identical, or merely expressed differently. They don't even have the same number of chromosomes, because a fusion -- mutation, to you -- occurred in two human chromosomes that did not occur in the chimp/gorilla line.\n \n Epigenetics alone is not responsible for the differences between chimps and humans. Their genomes, including genes and control sequences, are the key.\nJust as a point of interest for us non-geneticists, could you guys please tell us, (apart from chimps and ourselves), how many other species, of every and any kind, were formed when two chromosomes in another, older species, fused into one chromsome [sic] in a new species? With examples, please?\nFirst, there was no claim made that the chromosome fusion was the event that caused speciation. If you read carefully, all that was said was that the fusion of chromosome 2 in humans demonstrates that the two genomes are not the same, as was asserted by SS.\n \n Second, you did ask for all species and then you denied that you had done so. Specifically, you asked \"how many species.\" Please explain how You could be given a number that did not include \"all species.\" The answer was that we don't know because the genome of every species has not been examined to that extent.\n \n Third, even though the event is relatively rare, there are many known examples of chromosome fusion in different species of a single genus. Some that I was able to find quite easily were: Arabidopsis (several), Drosophilae (several), Myzus, Mutiacus, and Orgyia.\n \n Edit: I see I missed Mus.", 
   {}, 
   271809, 
   null, 
   1183255560.0
  ], 
  [
   271890, 
   null, 
   "chemist99a", 
   "http://article.pubs.nrc-cnrc.gc.ca/ppv/RPViewDoc?_handler_=HandleInitialGet&journal=gen&volume=47&calyLang=eng&articleFile=g04-016.pdf\n \n And the very complex situation in Rice is very interesting, especially now that we have a draft sequence for it thanks to the Chinese and their emerging computer technology.", 
   {}, 
   271865, 
   null, 
   1183273980.0
  ], 
  [
   271919, 
   null, 
   "supersport", 
   "chemist:\n \n http://www2.wwnorton.com/college/ant...11/welcome.htm\n \n See that link for a list of early homonoids. There are quite a few. The earliest one may or may not be the common ancestor of humans and chimps.\n \n every one of those are apes. And none of them are a common ancestor. What you are going to have to show me are the links between Australopithecus (ape) and homo erectus (human)....and if you believe in gradual evolution..aka natural selection....you need to show me a gradual lineage of fossils. Try again.\n \n (or, if you'd like me to save you some time, there aren't any.)", 
   {}, 
   271890, 
   null, 
   1183302780.0
  ], 
  [
   271920, 
   null, 
   "chemist99a", 
   "(or, if you'd like me to save you some time, there aren't any.)\n\n \n \n Standard creo doctrine and as always wrong. God of the gaps arguments simply do not fly my friend.\n \n Guess you missed the extended link from the home link. Try:\n \n http://www.talkorigins.org/faqs/homs/specimen.html\n \n For more comparisons.\n \n Oh yes in case you did not notice humans (genus Homo) are apes a branch of the primates.\n \n For the branching pattern see the following illustration:\n http://www.amonline.net.au/human_evolution/images/image002.gif\n \n And for a fossil layout on a tree scheme for humans see:\n http://www.globalchange.umich.edu/gctext/Inquiries/Inquiries_by_Unit/Unit_5_files/image017.jpg", 
   {}, 
   271919, 
   null, 
   1183307520.0
  ], 
  [
   271922, 
   null, 
   "wascallywabbit", 
   "First, there was no claim made that the chromosome fusion was the event that caused speciation.\n\n \n **\n Really?! I've heard darwinists make that claim at least a million times, and as a matter of fact, I've never even found a reason to debate it with them until now. Always assumed (silly me) that when they spoke with such confidence about it, it could only come from knowing that such chromosome fusion was quite the regular thing in evolution. But this time a little doubt assailed my confidence in darwinist self-assurance, so I asked a simple question--give a number re the actual instances of chromsome fusion generating a new species, any kind of species, and mention some examples to go with the number.\n Your special friend Chemmy played the flaming idiot by acting as one who could legitimately turn that question into a demand for a full list of particular species generated by chromosomal fusion, along with their antecedents, stretching all the way back to the beginnings of life on earth!! I thought that he was just being deliberately moronic in order to evade a legitimate question that he thought might cloak an attack on his precious ideology, but then he was imbecilic enough to actually quote my words back to me as if there was anyway in the world what I actually said could correspond to his loopy interpretation. \n Just to cap off this lunacy, he then admitted that his snide and shirty response was truly because he had no intelligent, sensible, reasonable, mature and sane response to give, and when I asked him why he posted a \n the #### he did if that was the case, instead of simply staying silent, he made an astoundingly stupid and irrational response, above, to the effect that it was no more stupid of him to respond stupidly to a question for which he had no real answer, than it was for me to 'ask the experts' for a response to a legitimate question to which I did not know the answer in advance!!!!\n \n Louis Carroll must have known dozens like chemmy, or he would never have been able to create his \"Wonderland\". But I'm sick of trying to dialogue with people from that strange little world.\n \n \n\n If you read carefully, all that was said was that the fusion of chromosome 2 in humans demonstrates that the two genomes are not the same, as was asserted by SS.\n\n \n **\n All that was said by whom?!? I've been following the \"anthropoid to hominid\"\n debate for years, and the darwinist position has invariably been stated as RMNS--that is, an accidental chromsomal fusion mutation in an 'ape-like' creature generated/evolved a new, 'man-like' creature, which then, by NS, survived and multiplied, yadayadayada. Granted, a very Goldschmidtian[sp.?], anti-Darwinian, case of abrupt and robust (i.e., non-gradual, non-cumulative), \"hopeful monster\"-style evolution, but still RMNS. So, tell me, did you guys recently change your tune on this, when I wasn't paying attention?!?\n \n \n\n Second, you did ask for all species and then you denied that you had done so. Specifically, you asked \"how many species.\"\n\n \n **\n The words \"how many\" is a request for a number, not a list of names. I'\n d have been satisfied with something like, 'hundreds', 'thousands', or 'millions', with a short list of examples. That you are actually tryiong to back up chemmy's wackadoo interpretation shows that you are from the same \"Wonderland\" that he inhabits--the one where plain English can be misinterpreted to mean anythjing you wish it to mean, a la Humpty Dumpty.\n \n \n\n Please explain how You could be given a number that did not include \"all species.\" \n\n \n **\n Wow, you guys are so totally off the wall. You and your special friend deserve a room all to yourselves.\n \n \n \n\n The answer was that we don't know because the genome of every species has not been examined to that extent.\n\n \n **\n That answer is stupid because my question had nothing to do with the species you DO NOT KNOW about, but was clearly confined to the number of species that you DO KNOW about. Apparently, as per the Bush administration, that number is a matter of darwinian national security.\n \n \n\n Third, even though the event is relatively rare, there are many known examples of chromosome fusion in different species of a single genus. Some that I was able to find quite easily were: Arabidopsis (several), Drosophilae (several), Myzus, Mutiacus, and Orgyia.\n \n Edit: I see I missed Mus.\n\n \n **\n Meaning you found nothing like it except in, a/ mustard plants, b/fruitflies, c/aphids, d/barking deer,an d/, certain moths. Oh, and e/, some mice. Interesting. And obviously not the impossibly huge task that you and chemmy pretend it was.\n \n P.S.\n \n You really shouldn't parade your cattiness like you do, girl. It is unnecessary in these BBs to add \"[sic]\", for any reason, where your citation has been blocked out by the quote function. It is only used legitimately, [as opposed to spitefully and maliciously], where a direct quote is blocked out by quotation marks within a response.\n \n Not that the mean girls of this world care about such protocols, right?", 
   {}, 
   271865, 
   null, 
   1183308540.0
  ], 
  [
   271923, 
   null, 
   "chemist99a", 
   "Really?! I've heard darwinists make that claim at least a million times,\n\n \n Really? A MILLION times. At once per second that would take up some 278 hours of your life about one month continuous! Seems unlikely.\n \n \nChemmy played the flaming idiot by acting as one who could legitimately turn that question into a demand for a full list of particular species generated by chromosomal fusion, along with their antecedents, stretching all the way back to the beginnings of life on earth!!\n\n \n Surely you do not need me to quote you yet again?!!!emoticon_xbouncer \n OK here is your question:\n \n http://www.4forums.com/political/member.php?u=4590\n \njust as a point of interest for us non-geneticists, could you guys please tell us, (apart from chimps and ourselves), how many other species, of every and any kind, were formed when two chromosomes in another, older species, fused into one chromsome in a new species? With examples, please?\n\n \n Emphas added. I will rest my case and let other posters decide for themselves whether your complaint is justified or honest.", 
   {}, 
   271922, 
   null, 
   1183309080.0
  ], 
  [
   271924, 
   null, 
   "wascallywabbit", 
   "Really? A MILLION times. At once per second that would take up some 278 hours of your life about one month continuous! Seems unlikely.\n \n \n \n Surely you do not need me to quote you yet again?!!!emoticon_xbouncer \n OK here is your question:\n \n http://www.4forums.com/political/member.php?u=4590\n \n \n Emphas added. I will rest my case and let other posters decide for themselves whether your complaint is justified or honest.\n\n \n **\n Fine by me, tho' why you are so intent upon showing yourself up as a complete fool is quite beyond me.", 
   {}, 
   271923, 
   null, 
   1183309500.0
  ], 
  [
   271925, 
   null, 
   "chemist99a", 
   "Meaning you found nothing like it except in, a/ mustard plants, b/fruitflies, c/aphids, d/barking deer,an d/, certain moths. Oh, and e/, some mice. Interesting. And obviously not the impossibly huge task that you and chemmy pretend it was.\n\n \n But then of course you altered your request before that was posted did you not? And you got what you asked for - a few examples. Its what you wanted and now you P&M about it! Why one must ask if you are honest?emoticon_xkill \n \n Just to remind you your second question was phrased this way:\n \n http://www.4forums.com/political/member.php?u=4590\n \nAll you, or lesly, or whoever, had to give was a rough number total, and an example or three. \n\n \n I would say that the four examples (including a mammal) more than satisfy your question. Now admit it, you got an honest answer and the answer runs counter to your expectations.", 
   {}, 
   271923, 
   null, 
   1183309500.0
  ], 
  [
   271926, 
   null, 
   "chemist99a", 
   "And WW might want to inform himself a little bit more about fusion of chromosomes in humans. Abstract below, full article at\n \n\n http://www.genome.org/cgi/reprint/12/11/1663\n \n \n Gene Content and Function of the Ancestral\n Chromosome Fusion Site in Human Chromosome\n 2q13-2q14.1 and Paralogous Regions\n Yuxin Fan, Tera Newman, Elena Linardopoulou, and Barbara J. Trask1\n Division of Human Biology, Fred Hutchinson Cancer Research Center, Seattle, Washington 98109-1024, USA\n Various portions of the region surrounding the site where two ancestral chromosomes fused to form human\n chromosome 2 are duplicated elsewhere in the human genome, primarily in subtelomeric and pericentromeric\n locations. At least 24 potentially functional genes and 16 pseudogenes reside in the 614-kb of sequence\n surrounding the fusion site and paralogous segments on other chromosomes. By comparing the sequences of\n genomic copies and transcripts, we show that at least 18 of the genes in these paralogous regions are\n transcriptionally active. Among these genes are new members of the cobalamin synthetase W domain (CBWD)\n and forkhead domain FOXD4 gene families. Copies of RPL23A and SNRPA1 on chromosome 2 are\n retrotransposed-processed pseudogenes that were included in segmental duplications; we find 53 RPL23A\n pseudogenes in the human genome and map the functional copy of SNRPA1 to 15qter. The draft sequence of the\n human genome also provides new information on the location and intron-exon structure of functional copies of\n other 2q-fusion genes (PGM5, retina-specific F379, helicase CHLR1, and acrosin). This study illustrates that the\n duplication and rearrangement of subtelomeric and pericentromeric regions have functional relevance to human\n biology; these processes can change gene dosage and/or generate genes with new functions.\n", 
   {
    "unicode_changes_made": true
   }, 
   271919, 
   null, 
   1183310100.0
  ], 
  [
   271927, 
   null, 
   "wascallywabbit", 
   "But then of course you altered your request before that was posted did you not?\n\n \n **\n NO, I certainly did not alter anything. You guys are the only one's doing any 'altering' around here.\n \n \n\n And you got what you asked for - a few examples. Its what you wanted and now you P&M about it! Why one must ask if you are honest?emoticon_xkill \n\n \n **\n Yeah, now you admit that that is what I asked for in the first place. As for this \"P&M\" [whatever that means] comment, for you to ask if I am honest prompts me to ask if you a really sane?\n \n \n\n Just to remind you your second question was phrased this way:\n \n http://www.4forums.com/political/member.php?u=4590\n\n \n \n **\n So what? Where is there any meaningful difference? Only in your funny little head, that's where!\n \n \n\n I would say that the four examples (including a mammal) more than satisfy your question. Now admit it, you got an honest answer and the answer runs counter to your expectations.\n\n \n **\n Yes, despite your looney little toonz, (and your girlfriend lesly's defense of them), I finally got a genuine answer. And yes, it did run counter to my expectations;-- since darwinists had falsely convinced me, up to now, that chromosomal fusion events where common throughout evolutionary history. But now it turns out that they are extremely anomalous, especially above the plant and insect level. That news certainly runs counter to my expectations;-- your paranoid assumptions about \"[my] expectations\" not withstanding.\n answer", 
   {}, 
   271925, 
   null, 
   1183310340.0
  ], 
  [
   271928, 
   null, 
   "chemist99a", 
   "Black Knight are you WW. A pocket version of Baghdad Bob.", 
   {}, 
   271927, 
   null, 
   1183310580.0
  ], 
  [
   271930, 
   null, 
   "wascallywabbit", 
   "Black Knight are you WW. A pocket version of Baghdad Bob.\n\n \n **\n March Hare, are you, chemmy? A mini Mad Hatter?", 
   {}, 
   271928, 
   null, 
   1183311060.0
  ], 
  [
   271932, 
   null, 
   "supersport", 
   "Standard creo doctrine and as always wrong. God of the gaps arguments simply do not fly my friend.\n \n Guess you missed the extended link from the home link. Try:\n \n http://www.talkorigins.org/faqs/homs/specimen.html\n \n For more comparisons.\n \n Oh yes in case you did not notice humans (genus Homo) are apes a branch of the primates.\n \n For the branching pattern see the following illustration:\n http://www.amonline.net.au/human_evolution/images/image002.gif\n \n And for a fossil layout on a tree scheme for humans see:\n http://www.globalchange.umich.edu/gctext/Inquiries/Inquiries_by_Unit/Unit_5_files/image017.jpg\n\n \n I guess you evidently think throwing links at me is going to somehow answer my challenge. My challenge was to provide me fossil evidence of creatures linking Australopithecus and humans. \n \n Now here's a chart to explain your conundrum:\n \n http://www.mnh.si.edu/anthro/humanorigins/ha/a_tree.html\n \n please notice the dotted lines and the question marks....now snap to it -- I want the actual names of the organisms that link Australopithecus to homo erectus...aka...apes to humans.", 
   {}, 
   271920, 
   null, 
   1183311180.0
  ], 
  [
   271934, 
   null, 
   "chemist99a", 
   "Are you saying you cannot read the diagram? The dotted lines have no stated significane in the figure. The question marks do. There is a single question mark in the path from A to H namely H. ergaster. Otherwise there is a nice pathway. Or do you disagree (of course you do or will - its inevitable but like the dotted lines without much meaning). I suggest that you note the brance from Ergaster to both Erectus (a dead end) and to other Homo spp. \n \n And if you want the names of the organisms look at the chart my friend. Its our best current knowledge or so it claims.\n \n Of course there will always be controversy given the nature of the data. Note well that the link I supplied puts ergaster in a different relationship. Does any of that suprise anyone? It should not. This is science not the bible.\n \n And I also have to say that they are not going to let a lowly chemist get near the actual fossil evidence. Perhaps if you filed a request they would mail it to you by Fed Ex. I'd be careful with it though.", 
   {}, 
   271932, 
   null, 
   1183311780.0
  ], 
  [
   271958, 
   null, 
   "chemist99a", 
   "Posted for information purposes. Interesting.\n =============================\n \n \n Science 29 June 2007:\n Vol. 316. no. 5833, p. 1836\n DOI: 10.1126/science.316.5833.1836\n P\n Prev | Table of Contents | Next\n News Focus\n EVOLUTIONARY BIOLOGY:\n Relative Differences: The Myth of 1%\n Jon Cohen\n \n Genomewise, humans and chimpanzees are quite similar, but studies are showing that they are not as similar as many tend to believe\n In a groundbreaking 1975 paper published in Science, evolutionary biologist Allan Wilson of the University of California (UC), Berkeley, and his erstwhile graduate student Mary-Claire King made a convincing argument for a 1% genetic difference between humans and chimpanzees. \"At the time, that was heretical,\" says King, now a medical geneticist at the University of Washington, Seattle. Subsequent studies bore their conclusion out, and today we take as a given that the two species are genetically 99% the same.\n \n But truth be told, Wilson and King also noted that the 1% difference wasn't the whole story. They predicted that there must be profound differences outside genes--they focused on gene regulation--to account for the anatomical and behavioral disparities between our knuckle-dragging cousins and us. Several recent studies have proven them perspicacious again, raising the question of whether the 1% truism should be retired.\n \n \"For many, many years, the 1% difference served us well because it was underappreciated how similar we were,\" says Pascal Gagneux, a zoologist at UC San Diego. \"Now it's totally clear that it's more a hindrance for understanding than a help.\"\n \n Using novel yardsticks and the flood of sequence data now available for several species, researchers have uncovered a wide range of genomic features that may help explain why we walk upright and have bigger brains--and why chimps remain resistant to AIDS and rarely miscarry. Researchers are finding that on top of the 1% distinction, chunks of missing DNA, extra genes, altered connections in gene networks, and the very structure of chromosomes confound any quantification of \"humanness\" versus \"chimpness.\" \"There isn't one single way to express the genetic distance between two complicated living organisms,\" Gagneux adds.\n \n When King and the rest of the researchers in the Chimpanzee Sequencing and Analysis Consortium first detailed the genome of our closest relative in 2005, they simultaneously provided the best validation yet of the 1% figure and the most dramatic evidence of its limitations. The consortium researchers aligned 2.4 billion bases from each species and came up with a 1.23% difference. However, as the chimpanzee consortium noted, the figure reflects only base substitutions, not the many stretches of DNA that have been inserted or deleted in the genomes. The chimp consortium calculated that these \"indels,\" which can disrupt genes and cause serious diseases such as cystic fibrosis, alone accounted for about a 3% additional difference (Science, 2 September 2005, p. 1468).\n \n Figure 1 The 6.4% difference. Throughout evolution, the gain (+) in the number of copies of some genes and the loss (-) of others have contributed to humanchimp differences.\n \n SOURCE: J. P. DEMUTH ET AL.\n \n Entire genes are also routinely and randomly duplicated or lost, further distinguishing humans from chimps. A team led by Matthew Hahn, who does computational genomics at Indiana University, Bloomington, has assessed gene gain and loss in the mouse, rat, dog, chimpanzee, and human genomes. In the December 2006 issue of PLoS ONE, Hahn and co-workers reported that human and chimpanzee gene copy numbers differ by a whopping 6.4%, concluding that \"gene duplication and loss may have played a greater role than nucleotide substitution in the evolution of uniquely human phenotypes and certainly a greater role than has been widely appreciated.\"\n \n Yet it remains a daunting task to link genotype to phenotype. Many, if not most, of the 35 million base-pair changes, 5 million indels in each species, and 689 extra genes in humans may have no functional meaning. \"To sort out the differences that matter from the ones that don't is really difficult,\" says David Haussler, a biomolecular engineer at UC Santa Cruz, who has identified novel elements in the human genome that appear to regulate genes (Science, 29 September 2006, p. 1908).\n \n Daniel Geschwind, a neuroscientist at UC Los Angeles (UCLA), has taken at stab at figuring out what matters by applying systems biology to quantifying and analyzing genetic differences between human and chimpanzee brains. Working with his graduate student Michael Oldham and UCLA biostatistician Steve Horvath, Geschwind compared which of 4000 genes were turned on at the same time, or \"coexpressed,\" in specific regions of the dissected brains.\n \n With these data, they built gene networks for each species. \"A gene's position in a network has huge implications,\" Geschwind says. Genes that are coexpressed most frequently with other genes have the most functional relevance, he argues.\n \n Geschwind and his colleagues clustered the networks into seven modules that correspond to various brain regions, such as the cortex. Comparisons of the map of each cluster's network in each species plainly showed that certain connections exist in humans but not chimps. In the cortex, for example, 17.4% of the connections were specific to humans, Geschwind and co-workers reported in the 21 November 2006 Proceedings of the National Academy of Sciences. Although the differences don't immediately reveal why, say, humans get Alzheimer's and chimps don't, the maps clearly organize and prioritize differences. \"It really brings the critical hypotheses into strong relief,\" says Geschwind.\n \n Could researchers combine all of what's known and come up with a precise percentage difference between humans and chimpanzees? \"I don't think there's any way to calculate a number,\" says geneticist Svante Pääbo, a chimp consortium member based at the Max Planck Institute for Evolutionary Anthropology in Leipzig, Germany. \"In the end, it's a political and social and cultural thing about how we see our differences.\"", 
   {}, 
   271814, 
   null, 
   1183322520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The first marsupial genome", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10071-first-marsupial-genome.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10071, 
  "discussion_files": [
   [
    "20452.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10071-first-marsupial-genome-print.html"
   ], 
   [
    "20453.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10071-first-marsupial-genome-3-print.html"
   ], 
   [
    "20454.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10071-first-marsupial-genome-2-print.html"
   ]
  ], 
  "identifier": 10071
 }
]