[
 [
  [
   272106, 
   null, 
   "supersport", 
   "The story goes in all the evolutionists books that mammals evolved from reptiles. But for this to happen, lots of physiological changes would have had to take place. I would like to focus on one: the breast. I would like to know how or why reptiles would have formed them in the first place, because at some point a breast would have to form (and be selected) from a non-breasted reptile.\n \n First of all I would like to say that any reptile -- let's say lizard -- that happened to develop a random breast would still be a lizard -- a breasted lizard, but still a lizard. In fact, no matter how many mammal body parts you stack on top of a lizard, it will always be a lizard.\n \n Second, no mutation has ever formed a new body part, such as a new breast on a lizard. Anyone who cares to dispute this is welcome to provide a link.\n \n Third, even if in fairytale land a mutation did form a breast, who's to say that actual milk would flow from it? Would there also be lobes to produce the milk? How about the milk ducts to transport the milk to the nipple? Would both these accidentally form at the same time? How?\n \n Fourth, how about a nipple? Without that there is no feeding. So which formed first, the breast, the lobes, the milk ducts, or the nipple? You can't have a functional breast without each of these...and if the breasts aren't functional then the little cold-blooded lizards who don't drink milk to begin with would never get the opportunity to do so.\n \n Fifth, aren't there some signals that need to be sent from the brain before milk starts flowing? Ah -- well yes there are:\n \n http://www.asklenore.info/breastfeeding/induced_lactation/biology.html\n \n a signal is sent to the brain from the breast to release oxytocin which initiates the milk ejection or let down reflex (MER) and causes the milk to flow. \n \n Thus, how would a brain communicate with a feature it was not wired to communicate with? Did evolution somehow create the wiring for the breast at the same time as the milk ducts, the nipple and the breast itself?\n \n Also, how would the animal, since it is cold-blooded, keep the milk warm? You don't want your babies drinking cold milk do you?\n \n And who's to say that the male lizard wouldn't develop breasts? It's a 50/50 chance, you know. \n \n And how would a lizard crawl around effectively with multiple breasts hanging off him/her? Wouldn't they get drug across the ground? How could he climb a tree? His/her legs wouldn't reach the trunk if the breasts were full of milk!\n \n And don't lizards have multiple offspring? Like dozens? So what if the mother lizard only has like 5 breasts ---- simple math will tell you that most will go hungry.\n \n Finally, lizards don't generally hang around and tend to their offspring after they're born -- er, hatched. So what would make a lizard go against all previous instincts just because it happened to evolve a breast?", 
   {
    "post_info": {
     "post_title": "reptiles turning to mammals"
    }
   }, 
   null, 
   null, 
   1183442460.0
  ], 
  [
   272115, 
   null, 
   "T.Q", 
   "There are so many flaws and basic fundamental errors in reasoning here... I think my IQ dropped an even 50 points just from reading it. \n \n SS, you're beyond help", 
   {}, 
   272106, 
   null, 
   1183446060.0
  ], 
  [
   272117, 
   null, 
   "chemist99a", 
   "It can get worse. For example its difficult to justify a sponge turning into a mammal. The number of changes is enormous and sponges are also not known for being particulary caring of their young.", 
   {}, 
   272115, 
   null, 
   1183447200.0
  ], 
  [
   272119, 
   null, 
   "supersport", 
   "There are so many flaws and basic fundamental errors in reasoning here... I think my IQ dropped an even 50 points just from reading it. \n \n SS, you're beyond help\n\n \n lol...well why don't you use your brain and tell me how and why breasts formed then. Why would they get selected for in the first place? NS can't see into the future. Have any evidence of a reptile with breasts?", 
   {}, 
   272115, 
   null, 
   1183448100.0
  ], 
  [
   272120, 
   null, 
   "supersport", 
   "It can get worse. For example its difficult to justify a sponge turning into a mammal. The number of changes is enormous and sponges are also not known for being particulary caring of their young.\n\n \n yea but ToE doesn't say mammals evolved from sponges -- it says we evolved from reptiles.", 
   {}, 
   272117, 
   null, 
   1183448280.0
  ], 
  [
   272122, 
   null, 
   "T.Q", 
   "well why don't you use your brain and tell me how and why breasts formed then.\n\n Sure, here you go SS:\n SS's handy-dandy answer site\n \n I am NOT going to spend the next 3 months of my life teaching you basic biology so I can get you to the point where you would understand how many errors and bone headed questions you asked in your OP. Do your own research and ask for clarification. It's all out there. Do your own legwork for a change. Show that you're actually wanting to learn something. So far all you've done is asked inane questions, then laughed in ignorance. Amusing as it is, I think it's time to change it up a bit. So, tell you what: You tell us how breasts are thought to have come about. Then, if (sigh, when) you disagree, give us detailed, fact based reasons as to how this is impossible, and offer a reasonable, fact based alternative.", 
   {}, 
   272120, 
   null, 
   1183450740.0
  ], 
  [
   272123, 
   null, 
   "chemist99a", 
   "I am NOT going to spend the next 3 months of my life teaching you basic biology so I can get you to the point where you would understand how many errors and bone headed questions you asked in your OP.\n\n \n Just three months. Man you have to be the best biology teacher in the world. Where did you learn to pull off a miracle like that?", 
   {}, 
   272122, 
   null, 
   1183452780.0
  ], 
  [
   272124, 
   null, 
   "chemist99a", 
   "yea but ToE doesn't say mammals evolved from sponges -- it says we evolved from reptiles.\n\n \n Yes but as you know some breasts resemble some sponges its not too big a jump to get from one to the other and of course there are other spongy tissues derived in the same way. This was all published as an appendix to the Book of Official Rules which is an addendum to The One True Book of the Round Church of which I am the hereditary pope. However I have lent my copy out and its not available on the web.", 
   {}, 
   272122, 
   null, 
   1183453260.0
  ], 
  [
   272130, 
   null, 
   "Symbiote", 
   "When you see SS's own thoughts, it becomes clear why he usually just copies and pastes links.", 
   {}, 
   272124, 
   null, 
   1183456200.0
  ], 
  [
   272134, 
   null, 
   "lesz", 
   "Behold the platypus! An egg-laying, non-placental mammal, it secretes milk from ducts in its abdomen. It has mammary glands but no teats.\n \n We may never know how mammalian breasts evolved, but there's no difficulty in figuring out plausible scenarios in getting from reptile to teated mammal! I really don't know why SS keeps bringing up these red herrings. They don't refute evolution, and they don't support his belief in his bible.", 
   {}, 
   272130, 
   null, 
   1183460100.0
  ], 
  [
   272137, 
   null, 
   "chemist99a", 
   "It all started with a cosmetics ad pitched at female reptiles.\n \n Are you tired of scaley skin,.....\n Are you tired of bad breath....\n Are you tired of laying egg after egg after egg and being tied down to the nest?\n Are you tired of dragging food back to the nest for the little peepers?\n If so then you may wish to consider becoming a mammal.\n New models evolving daily.", 
   {}, 
   272134, 
   null, 
   1183465980.0
  ], 
  [
   272147, 
   null, 
   "supersport", 
   "Behold the platypus! An egg-laying, non-placental mammal, it secretes milk from ducts in its abdomen. It has mammary glands but no teats.\n \n We may never know how mammalian breasts evolved, but there's no difficulty in figuring out plausible scenarios in getting from reptile to teated mammal! I really don't know why SS keeps bringing up these red herrings. They don't refute evolution, and they don't support his belief in his bible.\n\n \n who brought up the Bible? T.Q. seems to think the answer is quite clear....maybe he can tell you, me and the rest of the forum how this happened. I brought up many reasons why the evolution of breasts would be implausible, yet no one has bothered to refute any of them...starting with how you could have a functional breast without the whole thing being evolved at once and why a newly-hatched batch of lizards would even bother with drinking the milk.", 
   {}, 
   272134, 
   null, 
   1183475700.0
  ], 
  [
   272151, 
   null, 
   "Symbiote", 
   "Maybe you can start by explaining why you think evolution is as fixated on lizard-breasts as you are?", 
   {}, 
   272147, 
   null, 
   1183476480.0
  ], 
  [
   272155, 
   null, 
   "Kronus", 
   "As is not unusual, SS has taken an interesting question and presented his ignorance of the topic as proof of something. For those with any interest in the question itself, I found this:\n \n http://www.madsci.org/posts/archives/dec2001/1008253501.An.r.html\n \n Note that this link is not meant to address anything that SS said except in the broadest sense, since most of his post is just mindless trolling.", 
   {}, 
   272137, 
   null, 
   1183476960.0
  ], 
  [
   272162, 
   null, 
   "T.Q", 
   "who brought up the Bible? T.Q. seems to think the answer is quite clear....maybe he can tell you, me and the rest of the forum how this happened. I brought up many reasons why the evolution of breasts would be implausible, yet no one has bothered to refute any of them...starting with how you could have a functional breast without the whole thing being evolved at once and why a newly-hatched batch of lizards would even bother with drinking the milk.\n\n \n No, what TQ seemed to think was that you were capable of forming a coherent thought, and had an attention span sufficient to type \"breast evolution\" and \"reptile mammal evolution\" into google. Once again, I expected too much from you SS. Though you did prove my point-you have absolutely no interest in actually learning anything-you are proud of your ignorance, and see your lack of knowledge as a badge of honour. \n \n I was hoping no one would do your homework for you, but it looks like Kronus and Lesz couldn't help themselves and gave you some starting points. However, we all know you won't do anything with it, will you? You're misconceptions from your OP and following posts confirm that you lack the basic understanding neccessary to even form a cognizant argument", 
   {}, 
   272147, 
   null, 
   1183478160.0
  ], 
  [
   272166, 
   null, 
   "Kronus", 
   "\n I was hoping no one would do your homework for you, but it looks like Kronus and Lesz couldn't help themselves and gave you some starting points.\n\n \n Well, they would only count as starting points if we had any belief that SS might actually start. As you said, SS relies on his ignorance. I didn't post the link with the delusion that SS might read the info and learn anything; I posted that link for the sake of others who have some actual interest in learning.", 
   {}, 
   272162, 
   null, 
   1183479960.0
  ], 
  [
   272171, 
   null, 
   "chemist99a", 
   "Well, they would only count as starting points if we had any belief that SS might actually start. As you said, SS relies on his ignorance. I didn't post the link with the delusion that SS might read the info and learn anything; I posted that link for the sake of others who have some actual interest in learning.\n\n \n And of course to keep others from taking SS seriously I presume :)", 
   {}, 
   272166, 
   null, 
   1183482840.0
  ], 
  [
   272174, 
   null, 
   "Kronus", 
   "And of course to keep others from taking SS seriously I presume :)\n\n \n Not really, no. I can't imagine that anyone actually takes him seriously, I see no need to refute his nonsense. Honestly, I don't know why people respond to his trolling at all.", 
   {}, 
   272171, 
   null, 
   1183490460.0
  ], 
  [
   272175, 
   null, 
   "sinjin", 
   "It all started when the female lizards noticed that the males weren't listening.emoticon_xclown", 
   {}, 
   272174, 
   null, 
   1183491120.0
  ], 
  [
   272201, 
   null, 
   "Ripskar", 
   "In essence mammary glands are just modified sweat glands. \n From this I predict SS next question; \"How did reptiles develop sweat glands?\"\n Reptiles are ectothermic so don't require a cooling system as such, instead during the Permian (Which is also the period when the first Mammal-like reptiles-Therapsids, appear) reptiles that experimented with temperature control appear in the fossil record such as Dimetrodon. As Mammals developed and became endothermic they would have needed finer control of their core temperature than a reptile so mutants with this ability had a definate edge over those that did not.", 
   {}, 
   272175, 
   null, 
   1183503300.0
  ], 
  [
   272231, 
   null, 
   "supersport", 
   "In essence mammary glands are just modified sweat glands. \n From this I predict SS next question; \"How did reptiles develop sweat glands?\"\n Reptiles are ectothermic so don't require a cooling system as such, instead during the Permian (Which is also the period when the first Mammal-like reptiles-Therapsids, appear) reptiles that experimented with temperature control appear in the fossil record such as Dimetrodon. As Mammals developed and became endothermic they would have needed finer control of their core temperature than a reptile so mutants with this ability had a definate edge over those that did not.\n\n \n \n modified sweat glands?....give me a freaking break.\n \n I've noticed nobody has attempted to deal with the issues I raised in my OP regarding the initial formation of breasts.", 
   {}, 
   272201, 
   null, 
   1183525800.0
  ], 
  [
   272234, 
   null, 
   "chemist99a", 
   "Yep modified sweat glands. Never throw something away, adapt it for a new use you know. Thats evolution in action. Also possible that glands used to keep eggs moist in amphibia were modified to serve a new role.", 
   {}, 
   272231, 
   null, 
   1183527180.0
  ], 
  [
   272235, 
   null, 
   "supersport", 
   "Yep modified sweat glands. Never throw something away, adapt it for a new use you know. Thats evolution in action. Also possible that glands used to keep eggs moist in amphibia were modified to serve a new role.\n\n \n now do you have any actual evidence of this, or is this kind of like a materialistic version of \"Goddidit.\" ??", 
   {}, 
   272234, 
   null, 
   1183527960.0
  ], 
  [
   272239, 
   null, 
   "chemist99a", 
   "Comparative anatomy.\n \n Back to the 1950s\n \n http://jcs.biologists.org/cgi/reprint/s3-95/29/79.pdf\n \n And some odd stuff from more recent times:\n \n \nAnogenital \"sweat\" glands. Histology and pathology of a gland that may mimic mammary glands.\n \n van der Putte SC.\n \n Department of Pathology, Utrecht University Hospital, University of Utrecht, The Netherlands.\n \n A new variant of cutaneous glands is described that occurs in the anogenital region, with its highest concentration in the interlabial sulcus of the vulva. The glands are characterized by a wide coiled tube from which originate acini, diverticula, and short branches; a lining of a compact simple columnar epithelium with prominent cytoplasmic snouts protruding into the lumen; and a broad mantle of loose fibromyxoid to dense collagenous connective tissue. Occasionally, true lobuli are formed resembling those of mammary glands. A close relationship to eccrine glands was evidenced by intermediate variants and the occasional observation of typical eccrine segments in otherwise characteristic anogenital glands. The glands revealed periodic changes of epithelium and stroma. Their strict localization around the derivatives of the embryonic cloacal entrance suggests a possible role in sexual functions. Their characteristic histology links and explains a series of disorders of the anogenital region in women (including functional vulvar mammary glands after pregnancy, fibrocystic disease, fibroadenoma, hidradenoma papilliferum, and some cases of adenocarcinoma, including Paget's disease) and in men [including fibroadenoma or apocrine cystadenoma, and cases of Paget's disease].\n", 
   {}, 
   272235, 
   null, 
   1183529580.0
  ], 
  [
   272266, 
   null, 
   "johnhanks", 
   "modified sweat glands?....give me a freaking break.\n\n SS's usual well constructed, meticulously thought out forensic response.\n \nI've noticed nobody has attempted to deal with the issues I raised in my OP regarding the initial formation of breasts.\n\n What issues? You drivel on about breasts forming on lizards (even though the most primitive milk secretors we have today don't have anatomically distinct mammary glands, and the earliest mammals evolved from reptiles not remotely like lizards), then triumphantly crown your straw man with what you seem to think is a knock-down point about nerve connections.\n \n Yes, SS, the most primitive milk-secreting structures we know are modified sweat glands; your incredulity does not alter that fact one iota. And guess what? Sweat glands have nerve connections to the hypothalamus...", 
   {}, 
   272231, 
   null, 
   1183571640.0
  ], 
  [
   272283, 
   null, 
   "Ripskar", 
   "As has been stated previously early mammals did not have breasts.\n We'll go through this by the numbers, Evolution of Mammals from Reptiles;\n \n 1) Synapsids; Definately Reptile.\n http://en.wikipedia.org/wiki/Synapsid\n \n 2) Therapsids; Mammal-like reptiles.\n http://en.wikipedia.org/wiki/Therapsids\n \n 3) Cynodonts; Transition from Reptile to Mammal.\n http://en.wikipedia.org/wiki/Cynodont\n \n 4) Mammaliaformes; Possible Lactation.\n http://en.wikipedia.org/wiki/Mammaliaformes\n \n 5) Mammals; See previous statements regarding Platypus.\n http://en.wikipedia.org/wiki/Mammalia\n \n Cynodonts walked in an upright manner with the legs directly underneath the body. They did not drag their bellies across the floor, thus there would be no problem with anatomy as lactation did not occur until the evolution of Mammaliaformes at the earliest.", 
   {}, 
   272266, 
   null, 
   1183589760.0
  ], 
  [
   272460, 
   null, 
   "prschuster", 
   "I want Super Sport to explain why God gave male mammals vestigial nipples and why He made Adam and Eve with belly buttons. They did have belly buttons, didn't they? I mean, if they didn't then those naked pictures that artists draw in holy books must be faked drawings just like Haeckel's drawings were. Heck, that counts as a major creationist hoax, every bit as bad as Piltdown man. Hey, maybe the whole cynodont sequence is nothing but an elaborate paleontological hoax perpetrated by thousands of scientists acting in collusion over many generations from different universities located on separate continents. emoticon_confused", 
   {}, 
   272283, 
   null, 
   1183693680.0
  ], 
  [
   272471, 
   null, 
   "supersport", 
   "As has been stated previously early mammals did not have breasts.\n We'll go through this by the numbers, Evolution of Mammals from Reptiles;\n \n 1) Synapsids; Definately Reptile.\n http://en.wikipedia.org/wiki/Synapsid\n \n 2) Therapsids; Mammal-like reptiles.\n http://en.wikipedia.org/wiki/Therapsids\n \n 3) Cynodonts; Transition from Reptile to Mammal.\n http://en.wikipedia.org/wiki/Cynodont\n \n 4) Mammaliaformes; Possible Lactation.\n http://en.wikipedia.org/wiki/Mammaliaformes\n \n 5) Mammals; See previous statements regarding Platypus.\n http://en.wikipedia.org/wiki/Mammalia\n \n Cynodonts walked in an upright manner with the legs directly underneath the body. They did not drag their bellies across the floor, thus there would be no problem with anatomy as lactation did not occur until the evolution of Mammaliaformes at the earliest.\n\n \n er...did I miss something? Where was the formation of breasts in those? Did breasts just pop out instantly? Also, I love those cute little cartoonish artistic renditions of mammal/reptile creatures....do you have any actual fossils to go along with those?", 
   {}, 
   272283, 
   null, 
   1183703400.0
  ], 
  [
   272472, 
   null, 
   "supersport", 
   "I want Super Sport to explain why God gave male mammals vestigial nipples and why He made Adam and Eve with belly buttons. They did have belly buttons, didn't they? I mean, if they didn't then those naked pictures that artists draw in holy books must be faked drawings just like Haeckel's drawings were. Heck, that counts as a major creationist hoax, every bit as bad as Piltdown man. Hey, maybe the whole cynodont sequence is nothing but an elaborate paleontological hoax perpetrated by thousands of scientists acting in collusion over many generations from different universities located on separate continents. emoticon_confused\n\n \n Why would Adam and eve have belly buttons? As far as nipples go, he gave both man and women nipples -- he just gave women breasts to go along with them. duh.", 
   {}, 
   272460, 
   null, 
   1183703520.0
  ], 
  [
   272476, 
   null, 
   "T.Q", 
   "er...did I miss something?\n\n More than likely\n \n \nWhere was the formation of breasts in those?\n\n Read. Do some actually research. It's not a hidden secret.\n \n \nDid breasts just pop out instantly?\n\n No, first the female stuck her finger in her mouth and blew really hard. That's what took so long-they had to wait to evolve fingers.\n \n \nAlso, I love those cute little cartoonish artistic renditions of mammal/reptile creatures\n\n That's nice. I like the cute picture you have of the guy in agony nailed to two sticks of wood.\n \n \ndo you have any actual fossils to go along with those?\n\n Nope, not a one. Don't you know, fossils were all planted by the devil. We just make this stuff up as we go along to screw with you.\n \n \n You do know what www.google.com is, right? \n \n \nWhy would Adam and eve have belly buttons? As far as nipples go, he gave both man and women nipples -- he just gave women breasts to go along with them. duh.\n\n \n (I know I'm going to regret this but...)\n \n Why?", 
   {}, 
   272472, 
   null, 
   1183704840.0
  ], 
  [
   272478, 
   null, 
   "supersport", 
   "More than likely\n \n \n Read. Do some actually research. It's not a hidden secret.\n \n \n No, first the female stuck her finger in her mouth and blew really hard. That's what took so long-they had to wait to evolve fingers.\n \n \n That's nice. I like the cute picture you have of the guy in agony nailed to two sticks of wood.\n \n \n Nope, not a one. Don't you know, fossils were all planted by the devil. We just make this stuff up as we go along to screw with you.\n \n \n You do know what www.google.com is, right? \n \n \n \n (I know I'm going to regret this but...)\n \n Why?\n\n \n \n what a dumb post. You contribute nothing.", 
   {}, 
   272476, 
   null, 
   1183705080.0
  ], 
  [
   272479, 
   null, 
   "T.Q", 
   "what a dumb post. You contribute nothing.\n\n \n :( \n That hurts my feelings coming from such an insightful poster such as yourself.\n \n So, what problems with the proposed mechanism for breast development have you turned up in your exhaustive research? If Adam and Eve didn't have belly buttons, why have all the pictures always depicted them with such an accessory? And why do men have nipples?", 
   {}, 
   272478, 
   null, 
   1183705740.0
  ], 
  [
   272480, 
   null, 
   "ShadowPikachu", 
   "what a dumb post. You contribute nothing.\n\n \n Funny.... that exact same comment can be made about every single post you've made on this and the many other forums you post on.", 
   {}, 
   272478, 
   null, 
   1183705860.0
  ], 
  [
   272481, 
   null, 
   "supersport", 
   ":( \n That hurts my feelings coming from such an insightful poster such as yourself.\n \n So, what problems with the proposed mechanism for breast development have you turned up in your exhaustive research? If Adam and Eve didn't have belly buttons, why have all the pictures always depicted them with such an accessory? And why do men have nipples?\n\n \n Men have nipples for the same reason they have any other body part -- because they were created that way. Besides that, according to this link, men can breastfeed....(maybe as a substitute if something happened to mom?)\n \n http://www.unassistedchildbirth.com/miscarticles/milkmen.html\n \n so take that...\n \n \n Why would nipples be selected for in males in a darwinian world?", 
   {}, 
   272479, 
   null, 
   1183706940.0
  ], 
  [
   272482, 
   null, 
   "supersport", 
   "Funny.... that exact same comment can be made about every single post you've made on this and the many other forums you post on.\n\n \n So what are all these forums?", 
   {}, 
   272480, 
   null, 
   1183707060.0
  ], 
  [
   272484, 
   null, 
   "T.Q", 
   "Men have nipples for the same reason they have any other body part -- because they were created that way. Besides that, according to this link, men can breastfeed....(maybe as a substitute if something happened to mom?)\n \n http://www.unassistedchildbirth.com/miscarticles/milkmen.html\n \n so take that...\n\n Take that?!? That supports the evolutionary theory! \n http://menshealth.about.com/od/conditions/a/Nipples_Men.htm\n \n \n \nWhy would nipples be selected for in males in a darwinian world?\n\n See above. Now, explain to me why god would create his most prized creation with useless nipples. \n \n And you never answered my other questions", 
   {}, 
   272481, 
   null, 
   1183707480.0
  ], 
  [
   272485, 
   null, 
   "T.Q", 
   "So what are all these forums?\n\n \n Are you now going to deny that you post the same drivel on multiple forums? You've been called on it and admitted it numerous times, remember? And each time you say it's because you were just too smart for them, so they banned you.", 
   {}, 
   272482, 
   null, 
   1183707540.0
  ], 
  [
   272486, 
   null, 
   "supersport", 
   "Are you now going to deny that you post the same drivel on multiple forums? You've been called on it and admitted it numerous times, remember? And each time you say it's because you were just too smart for them, so they banned you.\n\n \n \n oh, and what are these forums I've been banned from? I post here and at Carm. I very occasionally will pop in somewhere else, but very rarely.", 
   {}, 
   272485, 
   null, 
   1183708080.0
  ], 
  [
   272487, 
   null, 
   "T.Q", 
   "oh, and what are these forums I've been banned from? I post here and at Carm. I very occasionally will pop in somewhere else, but very rarely.\n\n \n LMAO! Too good, too good! I can't believe you're actually denying that you have been banned from numerous forums after you've confirmed that very fact when you were called on it by Electrolyte and others when they saw you copy and paste the same threads to numerous boards.\n \n Now when are you going to answer my questions?", 
   {}, 
   272486, 
   null, 
   1183708380.0
  ], 
  [
   272488, 
   null, 
   "ShadowPikachu", 
   "So what are all these forums?\n\n \n Are you actually, seriously, going to try to play dumb here? Let's see - You once posted on Internet Infidels Discussion Boards (IIDB - remember your \"Butterfly Wombs\" fiasco there?), and eventually were banned from there for infractions of the rules - then you came in under the sockpuppet handle of \"YourWorstNightMare\", and then rather dumbly revealed that you were really \"Supersport\" who had been banned (right in your first post, I might add); Richard Dawkins Foundation Forums (RDFF); TheologyWeb (TWeb) (with a choice post of yours); Darwin Central (where you lasted less than a day); and Christian Discussion Forums (known as CARM.org).\n \n Just to name a few.\n \n Edit: Looks like T.Q. already beat me to calling you on your bull, but as I went to the trouble to look up several places you actually posted (already knew about IIDB, and CARM, as I post there), I'll leave them up for everyone to investigate.", 
   {}, 
   272482, 
   null, 
   1183709100.0
  ], 
  [
   272489, 
   null, 
   "supersport", 
   "Are you actually, seriously, going to try to play dumb here? Let's see - You once posted on Internet Infidels Discussion Boards (IIDB - remember your \"Butterfly Wombs\" fiasco there?), and eventually were banned from there for infractions of the rules - then you came in under the sockpuppet handle of \"YourWorstNightMare\", and then rather dumbly revealed that you were really \"Supersport\" who had been banned (right in your first post, I might add); Richard Dawkins Foundation Forums (RDFF); TheologyWeb (TWeb) (with a choice post of yours); Darwin Central (where you lasted less than a day); and Christian Discussion Forums (known as CARM.org).\n \n Just to name a few.\n \n Edit: Looks like T.Q. already beat me to calling you on your bull, but as I went to the trouble to look up several places you actually posted (already knew about IIDB, and CARM, as I post there), I'll leave them up for everyone to investigate.\n\n \n Yeap, I had about a 2 week stint at Secular web...a 2-days stint at Darwin Central -- both atheist forums who banned me for nothing. I have not regularly posted at the richard dawkins forum (not banned) in many many months....I also no longer post at TheologyWeb...(not banned) Nowdays I mainly post here and at Carm. What exactly does it matter though? I guarantee you most everybody on here posts at different forums as well. Quite honestly the only reason I visit this forum on occasion is to read WW's posts.", 
   {}, 
   272488, 
   null, 
   1183709640.0
  ], 
  [
   272490, 
   null, 
   "T.Q", 
   "Yeap, I had about a 2 week stint at Secular web...a 2-days stint at Darwin Central -- both atheist forums who banned me for nothing. I have not regularly posted at the richard dawkins forum (not banned) in many many months....I also no longer post at TheologyWeb...(not banned) Nowdays I mainly post here and at Carm. What exactly does it matter though? I guarantee you most everybody on here posts at different forums as well.\n \n \n Yeah, so in other words, you lied and were caught out.\n \n \nQuite honestly the only reason I visit this forum on occasion is to read WW's posts.\n\n \n You do realize he holds creationists in as much contempt as he does us \"mechanistic/mechanical/darwinists\", right?", 
   {}, 
   272489, 
   null, 
   1183710180.0
  ], 
  [
   272491, 
   null, 
   "ShadowPikachu", 
   "Yeap, I had about a 2 week stint at Secular web...a 2-days stint at Darwin Central -- both atheist forums who banned me for nothing. I have not regularly posted at the richard dawkins forum (not banned) in many many months....I also no longer post at TheologyWeb...(not banned) Nowdays I mainly post here and at Carm. What exactly does it matter though? I guarantee you most everybody on here posts at different forums as well. Quite honestly the only reason I visit this forum on occasion is to read WW's posts.\n\n \n You asked what forums (playing dumb of course), and you were given an answer that shows we won't tolerate your playing dumb (A.K.A. lying - rather un-Christian, isn't it?).\n \n Ah, they banned you for nothing, eh? I invite everyone to go to those forum and use the search function to look up SS's posts there (by Secular Web he means IIDB, I believe), and then the notices of his banning and the reasons.\n \n I note you ignored that you attempted to come back at IIDB under the handle \"YourWorstNightmare\".", 
   {}, 
   272489, 
   null, 
   1183710420.0
  ], 
  [
   272493, 
   null, 
   "ShadowPikachu", 
   "Ooops! Forgot to add this place to the list - ChristianForums\n \n \n Oh, anyone interested about Supersport's infamous \"Butterfly wombs\", here you go: Butterfly Wombs. As a Bonus, here are two posts on his Finch Wombs.", 
   {}, 
   272491, 
   null, 
   1183712340.0
  ], 
  [
   272499, 
   null, 
   "supersport", 
   "You asked what forums (playing dumb of course), and you were given an answer that shows we won't tolerate your playing dumb (A.K.A. lying - rather un-Christian, isn't it?).\n \n Ah, they banned you for nothing, eh? I invite everyone to go to those forum and use the search function to look up SS's posts there (by Secular Web he means IIDB, I believe), and then the notices of his banning and the reasons.\n \n I note you ignored that you attempted to come back at IIDB under the handle \"YourWorstNightmare\".\n\n \n um...don't you think if I actually did something specific to be banned they would have said it? But no, they list like 5 things, thinking/hoping I must have done something wrong. Not only that but I get banned for life...no suspension of a few days or a week -- total ban for life. Yet they have those foul-mouthed jokers on that site who do little more than call names and engage in a constant barrage of personal insults because that's all they've got to support their nonsense theory. Please notice I'm not banned from this forum after many many months. Don't you think if I didn't know how to act it would show up here?\n \n And I was just being honest when I went back on under a different name -- if they wanted to ban me again, then so be it....which they did. What exactly is your point?\n \n The Darwin Central place banned me before 2 whole days for nothing but debating the issue. They obviously did not want me around....but gave no real reason for banning me....they're just chickens.\n \n Since you like following my movements, why don't you respond to my latest OP:\n \n http://www.christiandiscussionforums.org/v/showthread.php?t=60848", 
   {}, 
   272491, 
   null, 
   1183715460.0
  ], 
  [
   272524, 
   null, 
   "T.Q", 
   "How bout you respond to my questions SS?", 
   {}, 
   272499, 
   null, 
   1183740060.0
  ], 
  [
   272530, 
   null, 
   "supersport", 
   "regarding mammal evolution from reptiles.... \n \n Scientist Magazine:\n \n Each species of mammal-like reptile that has been found appears suddenly in the fossil record and is not preceded by the species that is directly ancestral to it. It disappears some time later, equally abruptly, without leaving a directly descended species.\n \n George Gaylord Simpson:\n \n This is true of all thirty-two orders of mammals...the earliest and most primitive known members of every order already have the basic orginal characters, and in no case is an approximately continuous sequence from one order to another know. In most cases the break is so sharp anx the gap so large that the origin of the order is speculative and much disputed.", 
   {}, 
   272471, 
   null, 
   1183741200.0
  ], 
  [
   272548, 
   null, 
   "Klown", 
   "How bout you respond to my questions SS?\n\n \n I wouldn't hold your breath...", 
   {}, 
   272524, 
   null, 
   1183744920.0
  ], 
  [
   272551, 
   null, 
   "ShadowPikachu", 
   " um...don't you think if I actually did something specific to be banned they would have said it? But no, they list like 5 things, thinking/hoping I must have done something wrong. Not only that but I get banned for life...no suspension of a few days or a week -- total ban for life. Yet they have those foul-mouthed jokers on that site who do little more than call names and engage in a constant barrage of personal insults because that's all they've got to support their nonsense theory. Please notice I'm not banned from this forum after many many months. Don't you think if I didn't know how to act it would show up here?\n \n And I was just being honest when I went back on under a different name -- if they wanted to ban me again, then so be it....which they did. What exactly is your point?\n \n The Darwin Central place banned me before 2 whole days for nothing but debating the issue. They obviously did not want me around....but gave no real reason for banning me....they're just chickens.\n\n \n Yeah. I totally believe you. Dude, I was there on IIDB when you were posting your spam and other $hit. As I said before, everyone is invited to go and actully look at your posts and such. I like how you admt to using different usernames now. Wonder what other handles you use here. Archie perhaps? Nah, that'd be too obvious. Wascally I suppose, would be a more sensible assumption. Then there was that whole BlackWodin poster back around February or so (and several other new posters) that were your loyal cheerleading fans. Too bad you got banned under them, eh SS?\n \n \n\n Since you like following my movements, why don't you respond to my latest OP:\n \n http://www.christiandiscussionforums.org/v/showthread.php?t=60848\n\n \n Ah, but I have. I don't use the \"ShadowPikachu\" handle there - I only use that name on here. Hint: I'm right there on page 1.", 
   {}, 
   272548, 
   null, 
   1183746480.0
  ], 
  [
   272615, 
   null, 
   "Ripskar", 
   "er...did I miss something? Where was the formation of breasts in those? Did breasts just pop out instantly? Also, I love those cute little cartoonish artistic renditions of mammal/reptile creatures....do you have any actual fossils to go along with those?\n\n \n Did you miss something? The whole of of the Enlightenment apparently.\n Got a breast obsession do we? As stated lactation is thought to have begun with the Mammaliaformes. To give them their proper title, Mammary glands have developed from sweat glands as previously stated. The \"breasts\" found in Homonid females are largely fatty deposits, the mammary glands of other mammals are not so obvious, and going back to the OP female seals lactate but do not have problems tearing themselves open when they haul out onto rocks. \n Fossils;\n http://www.palaeos.com/Vertebrates/Units/Unit390/390.300.html#Ophiacodontidae\n http://www.palaeos.com/Vertebrates/Units/400Therapsida/300.html#Dinocephalia\n http://www.palaeos.com/Vertebrates/Units/410Cynodontia/410.120.html#Procynosuchidae\n http://www.palaeos.com/Vertebrates/Units/410Cynodontia/410.400.html#Tritylodontidae\n http://www.palaeos.com/Vertebrates/Units/Unit420/420.100.html#Allotheria\n http://www.palaeos.com/Vertebrates/Units/430Mammalia/430.400.html#Triconodonta", 
   {}, 
   272471, 
   null, 
   1183766400.0
  ], 
  [
   272643, 
   null, 
   "pandion", 
   "Why would Adam and eve have belly buttons? As far as nipples go, he gave both man and women nipples -- he just gave women breasts to go along with them. duh.\nRight. Women have breasts. But do cattle have breasts? How about a platypus? How about the echidna or any of the other monotremes? Do they have breasts?\n \n Please define \"breast\".", 
   {}, 
   272472, 
   null, 
   1183792740.0
  ], 
  [
   272729, 
   null, 
   "supersport", 
   "ShadowPikachu, why don't you quit playing games and admit to your identity over at Carm?", 
   {}, 
   272643, 
   null, 
   1183863060.0
  ], 
  [
   272740, 
   null, 
   "ShadowPikachu", 
   "ShadowPikachu, why don't you quit playing games and admit to your identity over at Carm?\n\n \n Why? I don't owe anything to you.\n \n BTW, like the quote of you in my sig from the \"Did the earth move for you\" thread?", 
   {}, 
   272729, 
   null, 
   1183870140.0
  ], 
  [
   272745, 
   null, 
   "supersport", 
   "Why? I don't owe anything to you.\n \n BTW, like the quote of you in my sig from the \"Did the earth move for you\" thread?\n\n \n I don't even know who you are...I'm not going on a wild goose chase.", 
   {}, 
   272740, 
   null, 
   1183874580.0
  ], 
  [
   272750, 
   null, 
   "ShadowPikachu", 
   "I don't even know who you are...I'm not going on a wild goose chase.\n\n \n No one asked you to, did they? You were the one (and still the one) with their panties in a knot over my username on carm.org.\n \n So, you never answered the question - like the quote of you in my sig?", 
   {}, 
   272745, 
   null, 
   1183876200.0
  ], 
  [
   272751, 
   null, 
   "supersport", 
   "No one asked you to, did they? You were the one (and still the one) with their panties in a knot over my username on carm.org.\n \n So, you never answered the question - like the quote of you in my sig?\n\n \n uh yea...love it.", 
   {}, 
   272750, 
   null, 
   1183877400.0
  ], 
  [
   272831, 
   null, 
   "Unriggable", 
   "This is god damned stupid. I'm going to debunk your theory in a single sweep.\n \n \"...IN THE BEGINNING God created the heaven and the earth. The earth was without form and void, and darkness was upon the face of the deep; and the Spirit of God was moving over the face of the waters. And God said, \"Let there be light\" and there was light. And God saw that the light was good; and God separated the light from the darkness. God called the light Day, and the darkness he called Night. And there was evening and there was morning, one day.\"\n \n Now here's the problem. There is no sun. And if there is no sun, the light has to come from a certain something else. But there is no foreign body. Only god. But that's impossible, since if he was the light than there would be no night, since he is omnipresent. Questions? Post.", 
   {}, 
   272751, 
   null, 
   1183953660.0
  ], 
  [
   272856, 
   null, 
   "supersport", 
   "This is god damned stupid. I'm going to debunk your theory in a single sweep.\n \n \"...IN THE BEGINNING God created the heaven and the earth. The earth was without form and void, and darkness was upon the face of the deep; and the Spirit of God was moving over the face of the waters. And God said, \"Let there be light\" and there was light. And God saw that the light was good; and God separated the light from the darkness. God called the light Day, and the darkness he called Night. And there was evening and there was morning, one day.\"\n \n Now here's the problem. There is no sun. And if there is no sun, the light has to come from a certain something else. But there is no foreign body. Only god. But that's impossible, since if he was the light than there would be no night, since he is omnipresent. Questions? Post.\n\n \n God is the light of the world. Your assumption that light came from all angles is just that: an assumption. \n \n If this is your version of \"debunking\" anything, you've got a screw loose.....the fact is nobody was there so nobody knows the details. Since you don't know the details, you can't say one way or the other if Genesis is accurate. Life is miraculous, and for you or anyone else to discount the possibility of miraculousness at the beginning is a big mistake.", 
   {}, 
   272831, 
   null, 
   1183962180.0
  ], 
  [
   272857, 
   null, 
   "ShadowPikachu", 
   "God is the light of the world. \n\n \n It's a figure of speech, Supersport! Ever heard of one of those? :xbanghead\n \n Just as when I say that my husband is the light of my life, I do not mean that he glows and gives off light in the dark.", 
   {}, 
   272856, 
   null, 
   1183962720.0
  ], 
  [
   272862, 
   null, 
   "supersport", 
   "It's a figure of speech, Supersport! Ever heard of one of those? :xbanghead\n \n Just as when I say that my husband is the light of my life, I do not mean that he glows and gives off light in the dark.\n\n \n The reality is God is referred to or even called light numerous times in the Bible. Here's one: \n \n http://www.biblegateway.com/passage/?search=1JOHN%201:5&version=9;\n \n This then is the message which we have heard of him, and declare unto you, that God is light, and in him is no darkness at all. 1 John 1:5", 
   {}, 
   272857, 
   null, 
   1183965240.0
  ], 
  [
   272885, 
   null, 
   "gman", 
   "Wow, 4 pages of weirdness. 3.5 pages spent on personal attacks.\n .5 pages of wipkedia links. Which provide what? Proof or organized speculation? \n Consensus by people who make their living (damn good livings paid by tax payers) speculating, then exhibiting their skills of etymology? \n The idea that reptiles. even supported by the rock hard proof of scientific consensus, stood up, grew teats and nipples and became soccer moms is a fine example of faith. Pure un-adulterated faith in consensus of the white coated, clip board carrying bespectacled gods. \n All the fun that gets fired at religious people for some of the comical things they believe pale in comparison to some of the absurdity that comes from ye followers of UH, Uh, uh. What's their names...............................Prof. Wipkedia? \n The next four pages should be a blast too.", 
   {}, 
   272862, 
   null, 
   1183985160.0
  ], 
  [
   272927, 
   null, 
   "ShadowPikachu", 
   "The reality is God is referred to or even called light numerous times in the Bible. Here's one: \n \n http://www.biblegateway.com/passage/?search=1JOHN%201:5&version=9;\n \n This then is the message which we have heard of him, and declare unto you, that God is light, and in him is no darkness at all. 1 John 1:5\n\n \n Thanks for providing that to prove my point that it is a figure of speech, SS. emoticon_xhoho", 
   {}, 
   272862, 
   null, 
   1184005500.0
  ], 
  [
   273040, 
   null, 
   "Ripskar", 
   "Wow, 4 pages of weirdness. 3.5 pages spent on personal attacks.\n .5 pages of wipkedia links. Which provide what? Proof or organized speculation? \n Consensus by people who make their living (damn good livings paid by tax payers) speculating, then exhibiting their skills of etymology? \n The idea that reptiles. even supported by the rock hard proof of scientific consensus, stood up, grew teats and nipples and became soccer moms is a fine example of faith. Pure un-adulterated faith in consensus of the white coated, clip board carrying bespectacled gods. \n All the fun that gets fired at religious people for some of the comical things they believe pale in comparison to some of the absurdity that comes from ye followers of UH, Uh, uh. What's their names...............................Prof. Wipkedia? \n The next four pages should be a blast too.\n\n \n Reptiles have laterally splayed limbs and undifferentiated teeth in a jaw which lacks latteral movement.\n Mammals support their body with their limbs vertically underneath the body and have differentiated teeth for different tasks, their jaws can move latterally, they have cheeks to hold food during this process, several bones from the reptilian jaw are now found in the mammalian ear.\n Synapsids exhibit entirely reptilian features, closely related Therapsids appear later in the fossil sequance and have differentiated teeth setting them apart from other reptiles. Cynodonts are a late form of Theraspsid where the limbs have moved into a vertically supporting position and teeth have settled into the three forms inherited by all mammals; Incisors, Canines, Molars.\n Mammaliaformes show almost all mammalian features including the migration of the reptilian jawbones into the ear.\n These are textbook transitional fossils, I learned this by the age of 7 what did you do with your youth?", 
   {}, 
   272885, 
   null, 
   1184072220.0
  ], 
  [
   273078, 
   null, 
   "ShadowPikachu", 
   " These are textbook transitional fossils, I learned this by the age of 7 what did you do with your youth?\n\n \n Personally, I think he's still in it. emoticon_xangel", 
   {}, 
   273040, 
   null, 
   1184092980.0
  ], 
  [
   273151, 
   null, 
   "Count Otto", 
   "God is the light of the world. Your assumption that light came from all angles is just that: an assumption.\n\n \n So God said 'let there be light' and he...whoops, he already was?\n \n Since we're on the subject, it seems you also post at the Evolution Fairytale forum.\n \n I always read that site with my morning coffee. Watching fundies do science is likely watching fish trying to operate power tools.", 
   {}, 
   272856, 
   null, 
   1184113620.0
  ], 
  [
   273164, 
   null, 
   "supersport", 
   "So God said 'let there be light' and he...whoops, he already was?\n \n Since we're on the subject, it seems you also post at the Evolution Fairytale forum.\n \n I always read that site with my morning coffee. Watching fundies do science is likely watching fish trying to operate power tools.\n\n \n yea I made one post the other day. And? do you not contribute there? I love that site even though I don't post much because the mods don't put up with the \"evo-babbler\" obnoxious dialog that goes on elsewhere. They only allow discussions on the topic at hand. No insults, no name-calling, no insulting the Creator, no cursing, no nonsense. It's quite refreshing. That's one reason I like Carm, too....though they are more lenient than EF.", 
   {}, 
   273151, 
   null, 
   1184130480.0
  ], 
  [
   273171, 
   null, 
   "Count Otto", 
   "yea I made one post the other day. And?\n\n \n What do you mean \"and\"? We were discussing other sites you post on.\n \n \ndo you not contribute there?\n\n \n Nah. Why do that when you can save time by banging your head repeatedly against the wall and then banning yourself from the kitchen?", 
   {}, 
   273164, 
   null, 
   1184150880.0
  ], 
  [
   273211, 
   null, 
   "supersport", 
   "What do you mean \"and\"? We were discussing other sites you post on.\n \n ?\n\n \n yea I post there once every few months. And? I told you I that I post at Carm and here, while also popping into other forums very occasionally. My last post at EF was probably a couple months ago. Since when is contributing to different discussions in different forums against the law? Evos do it all the time. There's one here that I know for a fact contributes to at least 4 forums full time. Yea you, Barry.", 
   {}, 
   273171, 
   null, 
   1184188860.0
  ], 
  [
   273252, 
   null, 
   "T.Q", 
   "Somebody wave something shiny in your general direction and distract you? You were the one who denied posting on other boards, you got called on it. Then, and only then, did you admit to posting on other boards. You posting on EF (which, by the way, is such a depressing site I never want to read it again-read the thread about Lucy at the bottom of page 1. I've never seen that much ignorance and arrogance on display) is further proof that you tried to lie.", 
   {}, 
   273211, 
   null, 
   1184203320.0
  ], 
  [
   273254, 
   null, 
   "supersport", 
   "Somebody wave something shiny in your general direction and distract you? You were the one who denied posting on other boards, you got called on it. Then, and only then, did you admit to posting on other boards. You posting on EF (which, by the way, is such a depressing site I never want to read it again-read the thread about Lucy at the bottom of page 1. I've never seen that much ignorance and arrogance on display) is further proof that you tried to lie.\n\n \n no, what I denied is getting banned at numerous forums, which was the insinuation.", 
   {}, 
   273252, 
   null, 
   1184205060.0
  ], 
  [
   273258, 
   null, 
   "ShadowPikachu", 
   "no, what I denied is getting banned at numerous forums, which was the insinuation.\n\n \n Wow, supersport, you really stepped in it this time. Are you pathological liar or something?\n \n The discussion started in post #33 here where I said:\n \nFunny.... that exact same comment can be made about every single post you've made on this and the many other forums you post on.\n\n \n Then, you tried to play dumb, \"insinuating\" (to use your word), that you were denying that you posted on any other forums - here in post #35:\n \nSo what are all these forums?\n \n\n \n Funny, I sure don't see any \"insinuation\" that you were banned on \"numerous forums\" at the time you tried to deny it.\n \n No, \"insinuation\" of that didn't come until I posted links in post#40, and noted that on several you had been banned (an \"insinuation\" which was entirely true, as anyone can see on the links of the websites I noted you had been banned on (just look up Supersport's profile, and you will se he is banned).\n \n Then, in post #41, here, you AGREED that you had been banned on the forums I \"insinuated\" you were banned on.\n \n So (unless you can post where I \"insinuated\" that you were banned on more forums than the two I noted and you agreed on), we now see that you are lying in your statement I quoted at the beginning of this post.\n \n Have fun eating your humble pie (that's \"crow\" to you, Supersport)!", 
   {}, 
   273254, 
   null, 
   1184207340.0
  ], 
  [
   273266, 
   null, 
   "T.Q", 
   "What comment? You didn't offer any opposing evidence. What you said boils down to \"Sez you!\", followed by a random racist comment and an attempted appeal to authority (by implying you were in WWII). Explain to me exactly what I'm supposed to address in there.", 
   {}, 
   273040, 
   null, 
   1184211000.0
  ], 
  [
   273324, 
   null, 
   "gman", 
   "Your \"comment\" had nothing of substance to address, besides your racist words, and your implication that parents are \"sick\" if they educate their kids.\n \n Post something of substance, i.e. a well-thought out post replete with scientific sources that present opposing evidence to the evidence/sources provided you, and then we'll address it. Until then, emoticon_xbye\n\n \n \"I knew more than you by the time I was 7\".........? That's substantive. \n That adds power to an argument built on consensus. \n Consensus on a subject that's being argued in a thread called creation vs evolution. Seems like evolutionist are screaming \"HERETIC\"!!!!!!!!!!!!\n Believe in our consensus or be damned. Much the same as the fanatical religious zealots have through history. \n The point being that this branch of science, offers what? An argument of a subject that provides what? Something irrelevant to argue about? Based on what? Faith, built on consensus. No evidence other than bones. \n BTW, shadow, you've offered little more than myself in this thread other than personal attacks on any one who dare question the content of faith based argument. I simply represent the many who, like it or not, pay for the study of irrelevant subjects. The problem I present to the Ripskars is that they are supposed to convince us that their religion is more believable than someone else's. Sorry, the cheerleader section doesn't get to dismiss the class. See you tomorrow.", 
   {}, 
   273040, 
   null, 
   1184242080.0
  ], 
  [
   273360, 
   null, 
   "johnhanks", 
   "The point being that this branch of science, offers what? An argument of a subject that provides what? Something irrelevant to argue about? Based on what? Faith, built on consensus. No evidence other than bones.\n\n Now, this poster writes like an educated person, so I can't believe he really imagines the theory of evolution is supported by 'nothing but bones'. What I can believe (all too readily) is that he, like many others, looks determinedly away from any other evidence which is placed before him, all the while repeating his mantra 'nothing but bones - nothing but bones - nothing but bones'.", 
   {}, 
   273324, 
   null, 
   1184261940.0
  ], 
  [
   273366, 
   null, 
   "T.Q", 
   "\"I knew more than you by the time I was 7\".........? That's substantive. \n That adds power to an argument built on consensus. \n Consensus on a subject that's being argued in a thread called creation vs evolution. Seems like evolutionist are screaming \"HERETIC\"!!!!!!!!!!!!\n Believe in our consensus or be damned. Much the same as the fanatical religious zealots have through history. \n The point being that this branch of science, offers what? An argument of a subject that provides what? Something irrelevant to argue about? Based on what? Faith, built on consensus. No evidence other than bones. \n BTW, shadow, you've offered little more than myself in this thread other than personal attacks on any one who dare question the content of faith based argument. I simply represent the many who, like it or not, pay for the study of irrelevant subjects. The problem I present to the Ripskars is that they are supposed to convince us that their religion is more believable than someone else's. Sorry, the cheerleader section doesn't get to dismiss the class. See you tomorrow.\n\n \n Again, if you want a reply, offer somthing more substantive than \"Sez you!\" \n \n The fossil record is an excellent line of evidence supporting the ToE. Look at it this way: If you had a series of pictures of an individual, from birth to death, each taken on their birthday, you could see that they are pictures of the same individual, despite the changes in appearance. A fossil series works much the same way-a series of snapshots, in chronological order, which show a definite relationship due to similarity of features, and in which changes are evident.\n \n So, do you have anything more meaningful to say besides \"La-la-la, I can't hear you!\"?", 
   {}, 
   273324, 
   null, 
   1184264820.0
  ], 
  [
   273368, 
   null, 
   "ShadowPikachu", 
   "\"I knew more than you by the time I was 7\".........? That's substantive. \n That adds power to an argument built on consensus. \n Consensus on a subject that's being argued in a thread called creation vs evolution. Seems like evolutionist are screaming \"HERETIC\"!!!!!!!!!!!!\n Believe in our consensus or be damned. Much the same as the fanatical religious zealots have through history. \n The point being that this branch of science, offers what? An argument of a subject that provides what? Something irrelevant to argue about? Based on what? Faith, built on consensus. No evidence other than bones. \n BTW, shadow, you've offered little more than myself in this thread other than personal attacks on any one who dare question the content of faith based argument. I simply represent the many who, like it or not, pay for the study of irrelevant subjects. The problem I present to the Ripskars is that they are supposed to convince us that their religion is more believable than someone else's. Sorry, the cheerleader section doesn't get to dismiss the class. See you tomorrow.\n\n \n So, nothing of substance. Thought so. emoticon_xbye", 
   {}, 
   273324, 
   null, 
   1184265480.0
  ], 
  [
   273372, 
   null, 
   "jim's trucking", 
   "It all started when the female lizards noticed that the males weren't listening.emoticon_xclown\nOh, I see....they 'thought up' some bouncers for them to look at.;)", 
   {}, 
   272175, 
   null, 
   1184268180.0
  ], 
  [
   273373, 
   null, 
   "Ripskar", 
   "You want something substantive? YOU have 3 types of teeth, Incisors, canines and molars. If you want to check we can get a brick and count them into piles. If we take the teeth from *any* reptile we will be unable to distinguish any different types. \n Mammals support their bodies vertically with their limbs directly underneath the body, unless you're some sort of weirdo whose limbs are splayed laterally like a reptile and your man-boobs skim the carpet.\n Even SS has demonstrated a knowledge of the features of a reptile and mammal.\n If you want to discuss this you can find the relavent material in any textbook worthy of the name that covers the relavent periods; Permian and Triassic.\n Ergo; get off your backside, go to your local library and read a book, they're rectangular things with bits of paper in them.", 
   {}, 
   273372, 
   null, 
   1184269140.0
  ], 
  [
   273390, 
   null, 
   "Hi_Its_Me", 
   "No evidence other than bones.\n\n In other words, there is no such thing as a vestigial structure, and evolution cannot be observed today. Right?\n \nEven SS has demonstrated a knowledge of the features of a reptile and mammal.\n\n Well, he's had so many facts forced on him that he was forced to learn something...\n He just chose to learn about the small details rather than about evolution. emoticon_xangel", 
   {}, 
   273373, 
   null, 
   1184284080.0
  ], 
  [
   273428, 
   null, 
   "gman", 
   " \n The fossil record is an excellent line of evidence supporting the ToE. Look at it this way: If you had a series of pictures of an individual, from birth to death, each taken on their birthday, you could see that they are pictures of the same individual, despite the changes in appearance. A fossil series works much the same way-a series of snapshots, in chronological order, which show a definite relationship due to similarity of features, and in which changes are evident.\n \n\n \n Problem, the example of a life series of photos are of an individual. The characteristics that define him as Joe are his in all the photos. \n A fossil \"series\" would consist of different individuals. Offering a view of the subject at one point in it's existence. The moment of it's death. Multiplied by however many fossils of said species available. Simply put, comparing apples to oranges. And, another irrelevant point, because it is anything but proof of a transition to mammal. \"Similarities\", an extremely vague thing being applied to wrap the event of transition is still a matter of consensus. Not proof. \n By the way, I would like to clarify something for those of you who out of frustration feel the need to get nasty. I don't mind the nastiness, it's kinda fun. By all means don't stop. But I am not opposed to education or the study of anything. I appreciate you and your efforts. You're a damned site smarter than myself. You may of course dismiss me as the class clown, but, in this particular thread I recognize that your proof is based on the same thing that religious folks base their evidence on. \"Faith\" built on consensus supported by evidence of similarities.", 
   {}, 
   273366, 
   null, 
   1184332020.0
  ], 
  [
   273434, 
   null, 
   "gman", 
   "You want something substantive? YOU have 3 types of teeth, Incisors, canines and molars. If you want to check we can get a brick and count them into piles. If we take the teeth from *any* reptile we will be unable to distinguish any different types. \n Mammals support their bodies vertically with their limbs directly underneath the body, unless you're some sort of weirdo whose limbs are splayed laterally like a reptile and your man-boobs skim the carpet.\n Even SS has demonstrated a knowledge of the features of a reptile and mammal.\n If you want to discuss this you can find the relavent material in any textbook worthy of the name that covers the relavent periods; Permian and Triassic.\n Ergo; get off your backside, go to your local library and read a book, they're rectangular things with bits of paper in them.\n\n \n Sorry Rip, I'm not on a particular quest. I don't have a government job so I don't have the time to invest in digging for proof that supports \"your\" side of an argument. Which I am not opposed to. But, I am not shying away from you zealots of consensus because you reprimand me for having the audacity to challenge your lack of proof that evolution eliminates God as the source of life. I do not dismiss the possibility that evolution is simply a tool of God. Any one gullible enough to accept the similarities and imagined developments offered as examples of transition should at least be open minded enough to the \"possibility\" that other forces are at play in our existence. To deny the possibility simply creates one more religion with the goal of being \"the one true religion\", all others, going to hell.", 
   {}, 
   273373, 
   null, 
   1184334300.0
  ], 
  [
   273448, 
   null, 
   "sinjin", 
   "Sorry Rip, I'm not on a particular quest. I don't have a government job so I don't have the time to invest in digging for proof that supports \"your\" side of an argument. Which I am not opposed to. But, I am not shying away from you zealots of consensus because you reprimand me for having the audacity to challenge your lack of proof that evolution eliminates God as the source of life. I do not dismiss the possibility that evolution is simply a tool of God. Any one gullible enough to accept the similarities and imagined developments offered as examples of transition should at least be open minded enough to the \"possibility\" that other forces are at play in our existence. To deny the possibility simply creates one more religion with the goal of being \"the one true religion\", all others, going to hell.\nThe belief that supernatural forces are not required to explain reality is not a religion.", 
   {}, 
   273434, 
   null, 
   1184345460.0
  ], 
  [
   273450, 
   null, 
   "Klown", 
   "The belief that supernatural forces are not required to explain reality is not a religion.\n\n \n Sez you!\n \n emoticon_rolleyes", 
   {}, 
   273448, 
   null, 
   1184347680.0
  ], 
  [
   273451, 
   null, 
   "wascallywabbit", 
   "The belief that supernatural forces are not required to explain reality is not a religion.\n\n \n **\n When did belief in 'the spontaneous generation' of adaptive genomic changes, i.e., \"Randomly adaptive genetic Mutation\", stop being a belief in a supernatural force? \n When did the belief that a metaphor, an abstraction, a label for a mystical something that, like live organisms, [and ancient demi-gods], actually had the power to choose and separate the chosen from the unchosen, so that the chosen might have protracted life, whilst the unchosen were damned to an early demise,-- that is, \"Natural Selection\",-- stop being a belief in a supernatural force?!?\n \n \n Much as it disturbs me to agree with gman about anything, he is right to point out that darwinism is a religious faith in supernatural forces that all the while pretends that it is not a religion acting as a religion, even though it is entirely dependent upon the assumption of those supernatural forces mentioned above as if they were real physical forces at work in evolutionary biology.\n \n As to 'evolution' per se, if you believe in the reality of change, then you believe in the reality of evolution, in its broadest terms. I do not think that that anyone seeing the vast differences in the 'bones' of the fossil record can deny that they change from one to the other, and putting that change together with geological change and its 'time' constraints, deny that they 'changed over time'. At least not rationally; the irrational alternative being that the earth, its 'bones', and everything else, arose instantaneously, as is, all at once. That what it is is exactly what it has always been, and that 'change over time' is an illusion.\n \n Once the rational position, that is, that the 'bones' found in the fossil record 'changed over time' is accepted, then the issue becomes the question of 'how' and in what manner they changed, and in what correlation with time did they change?\n \n The time correlation is the big issue, with darwinists opting for a universal uniformitarian gradualism [teeny-weeny changes]at the phenotypic level, but instantaneous spontaneous magical 'poofs' [powerful,meaningful changes] at the genetic level, and opposed to that, with creationists opting for one single instance, or a series of anomalous individual instances, of instantaneous spontaneous miraculous 'poofs', at all levels. \n \n From this the darwinists maintain that life is one thing that is seen to change its forms over time, while creationists insist that that there is no single continuity, but simply forms that pop into existence, at least for a certain space of time, unique, disconnected and independent of all and any other forms.\n \n They are both wrong, of course, but the creationists are even more wrong, i.e., irrational, than the darwinists, on this point. And if gman is adopting the creationist view that the fossil record is not evidence of change in one unity, Life, over time, and holds to the creationist view that all 'lives' are particular, distinct, separate, unique and disconnected anomalous entities, then I can once more cheerfully disagree with him. Thank heavens!!", 
   {}, 
   273448, 
   null, 
   1184350020.0
  ], 
  [
   273461, 
   null, 
   "sinjin", 
   "**\n When did belief in 'the spontaneous generation' of adaptive genomic changes, i.e., \"Randomly adaptive genetic Mutation\", stop being a belief in a supernatural force? \n When did the belief that a metaphor, an abstraction, a label for a mystical something that, like live organisms, [and ancient demi-gods], actually had the power to choose and separate the chosen from the unchosen, so that the chosen might have protracted life, whilst the unchosen were damned to an early demise,-- that is, \"Natural Selection\",-- stop being a belief in a supernatural force? \nI haven't the patience to argue semantics with you. There is no \"chooser\" in the conscious sense and anything taking place naturally like genetic mutation is by definition not supernatural. You seem determined to project consciousness into arenas that it clearly doesn't exist. Words used to describe elements of evolution can in other contexts be used to describe acts of volition. So what? You mistake the concepts employed by language for the actual things language attempts to describe.", 
   {}, 
   273451, 
   null, 
   1184354100.0
  ], 
  [
   273490, 
   null, 
   "wascallywabbit", 
   "I haven't the patience to argue semantics with you. \n\n \n **\n No, you'd rather dismiss solid points that you cannot refute as mere \"semantics\".\n \n \n\n There is no \"chooser\" in the conscious sense and anything taking place naturally like genetic mutation is by definition not supernatural.\n\n \n **\n There is no \"chooser in the conscious sense\" in darwinian \"Natural Selection\", and since the word \"selection\", in honest English usage, entails \"conscious choice\", darwinian \"Natural Selection\" is Bull Sh-t.\n \n The truth of the matter is that there is a 'chooser' in evolution; in fact. trillions of 'em. That 'chooser', in every instance, is the evolving organism itself. Not some ethereal demi-goddess or flying spaghetti monster practicing \"natural selection\".\n \n \n\n You seem determined to project consciousness into arenas that it clearly doesn't exist. \n\n \n **\n ROTFLMAO!!!! To the contrary!!. I am trying to take 'consciousness' back out of where you people falsely stuffed it--in your \"Natural Selection\"!!!! Anytime you guys want to start being honest with the public and change the name of your hypothetical mechanism from, \"Natural Selection\", to, \"Mechanical Sorting\", [therebye removing the 'consciousness' falsely insinuated by the word 'selection' , and so honestly revealing to the world the materialist process you are truly talking about], you let me know. Until then, you are speaking religiously, not scientifically, animistically projecting anthropomorphic traits on a nebulous abstraction that was never any more real than a poetic figure of speech, from the git-go.\n \n \n\n Words used to describe elements of evolution can in other contexts be used to describe acts of volition. So what?\n\n \n **\n No idea what you are referring to here, but where I come from, using a word equivocally in order to present a meaning it does not have, simply to serve your own purposes, is a lie, a deception, an overt act of dishonesty and duplicity. If you can say \"So what?\" to that, then you must have checked your morals at the door to biology class.\n \n \n \n\n You mistake the concepts employed by language for the actual things language attempts to describe.\n\n \n **\n Horse manure. First, you got it backwards, like all darwinists always do, everywhere and always. Concepts are not \"employed by language\". To the contrary--language is employed by minds with concepts in order to communicate them honestly and accurately, to other minds. Language is the servant, not the master, here. The \"actual things\" that \"language attempts to describe\" are the mutually understood \"concepts\" shared by minds that can communicate with one another. We never share the \"actual things\", i.e., a real rabbit or a real photon.\n \n The master in semantics,-- communication, information sharing,-- is common usage,-- the natural, unforced and non-artificial mutual understanding of what 'concepts' are represented/signified/entailed by what language tool [most often a word], used in the communication process. Forcing the naturally and historically entailed qualities of consciousness and volition signified by the word, 'selection', onto a mindless mechanical process [or nebulous, supernatural abstraction] called \"Natural Selection\", was a corrupt, dishonest attempt to mislead the public understanding of evolution, right from the jump.", 
   {}, 
   273461, 
   null, 
   1184364780.0
  ], 
  [
   273493, 
   null, 
   "T.Q", 
   "WW, give me the definition of the word \"port\". Note I said \"definition\", not \"definitions\".", 
   {}, 
   273490, 
   null, 
   1184365620.0
  ], 
  [
   273498, 
   null, 
   "wascallywabbit", 
   "WW, give me the definition of the word \"port\". Note I said \"definition\", not \"definitions\".\n\n \n **\n TQ, take your simple-minded, ignorant misunderstanding of how language operates, and stuff it.\n \n Either that, or explain to the world what the various common usage meanings attached to the word, 'port', or any other word, have to do with anything under discussion here; in particular the darwinian corruption of the word, 'selection'. We all await your well-reasoned argument proving that the two cases are exactly the same.", 
   {}, 
   273493, 
   null, 
   1184366280.0
  ], 
  [
   273499, 
   null, 
   "ShadowPikachu", 
   "**\n TQ, take your simple-minded, ignorant misunderstanding of how language operates, and stuff it.\n \n Either that, or explain to the world what the various common usage meanings attached to the word, 'port', or any other word, have to do with anything under discussion here; in particular the darwinian corruption of the word, 'selection'. We all await your well-reasoned argument proving that the two cases are exactly the same.\n\n \n Says the one whose personal version of a \"well reasoned\" argument is \"stuff it!\" emoticon_rolleyes", 
   {}, 
   273498, 
   null, 
   1184366400.0
  ], 
  [
   273501, 
   null, 
   "sinjin", 
   "**\n There is no \"chooser in the conscious sense\" in darwinian \"Natural Selection\", and since the word \"selection\", in honest English usage, entails \"conscious choice\", darwinian \"Natural Selection\" is Bull Sh-t.\nI could say nature does this or that without meaning to imply that nature is a conscious entity. Poetic maybe but hardly intentional deception. \n \n \nThe truth of the matter is that there is a 'chooser' in evolution; in fact. trillions of 'em. That 'chooser', in every instance, is the evolving organism itself.\nIndividuals cannot \"evolve\" physical traits that are passed on to their descendants genetically. I know you believe otherwise. \n \n \nROTFLMAO!!!! To the contrary!!. I am trying to take 'consciousness' back out of where you people falsely stuffed it--in your \"Natural Selection\"!!!! Anytime you guys want to start being honest with the public and change the name of your hypothetical mechanism from, \"Natural Selection\", to, \"Mechanical Sorting\", [therebye removing the 'consciousness' falsely insinuated by the word 'selection' , and so honestly revealing to the world the materialist process you are truly talking about], you let me know. Until then, you are speaking religiously, not scientifically, animistically projecting anthropomorphic traits on a nebulous abstraction that was never any more real than a poetic figure of speech, from the git-go.\nExactly. Poetic in a manner of speaking. Nothing more. No conspiracy.\n \n \nNo idea what you are referring to here, but where I come from, using a word equivocally in order to present a meaning it does not have, simply to serve your own purposes, is a lie, a deception, an overt act of dishonesty and duplicity. If you can say \"So what?\" to that, then you must have checked your morals at the door to biology class.\nWhat purposes are served? Nevermind my morals. \n \n \nHorse manure. First, you got it backwards, like all darwinists always do, everywhere and always. Concepts are not \"employed by language\". To the contrary--language is employed by minds with concepts in order to communicate them honestly and accurately, to other minds. Language is the servant, not the master, here. The \"actual things\" that \"language attempts to describe\" are the mutually understood \"concepts\" shared by minds that can communicate with one another. We never share the \"actual things\", i.e., a real rabbit or a real photon.\nYes, I know. I didn't mean to suggest that language was a conscious entity either. You have trouble in this area, don't you?\n \n \nThe master in semantics,-- communication, information sharing,-- is common usage,-- the natural, unforced and non-artificial mutual understanding of what 'concepts' are represented/signified/entailed by what language tool [most often a word], used in the communication process. Forcing the naturally and historically entailed qualities of consciousness and volition signified by the word, 'selection', onto a mindless mechanical process [or nebulous, supernatural abstraction] called \"Natural Selection\", was a corrupt, dishonest attempt to mislead the public understanding of evolution, right from the jump. \nMislead to what conclusion? That nature has a mind? I don't follow.", 
   {}, 
   273490, 
   null, 
   1184367720.0
  ], 
  [
   273503, 
   null, 
   "gman", 
   "The belief that supernatural forces are not required to explain reality is not a religion.\n\n \n In the eyes of God, what you describe as supernatural, is not. \n Of course it is a religion, it is all based on consensus of speculated ideas. \n Detractors attacked for questioning the reality of it.", 
   {}, 
   273448, 
   null, 
   1184368680.0
  ], 
  [
   273505, 
   null, 
   "T.Q", 
   "In the eyes of God, what you describe as supernatural, is not.\n\n If god is not supernatural, he is natural, so he conforms to natural laws. There goes your omnipotent, omniscient god. Which way do you want it?\n \n \nOf course it is a religion, it is all based on consensus of speculated ideas.\n\n So is medicine, electronics, atomics, the internal combustion engine, etc. Everything is \"based on consensus of speculated ideas\". The thing is, all the above \"speculated ideas\" (including the ToE), are based on numerous lines of evidence (a whole bunch of \"speculated ideas\", in your lingo) and rigorous testing and experimentation.\n \n \nDetractors attacked for questioning the reality of it.\n\n No, detractors are attacked for denying reality on the basis of a book written by bronze age PR reps (Go team Israel!)\n \n And yet again, all you say is \"Sez you!\" Do you have a better explanation for the fossil evidence? What is your explanation for why so many extinct animals are found in chronological order, with features that strongly suggest decent with modification? If fossils are all just a load of garbage, why are they found in the order predicted by the ToE? \n \n I have to admit, I think it's funny that the fundies have resorted to \"well, if creationism is bad cuz it's a religion, then the ToE is a religion too!\". If you can't elevate yourself, try and drag your opponent down to your level seems to be the strategy.", 
   {}, 
   273503, 
   null, 
   1184371260.0
  ], 
  [
   273506, 
   null, 
   "Hi_Its_Me", 
   "**\n There is no \"chooser in the conscious sense\" in darwinian \"Natural Selection\", and since the word \"selection\", in honest English usage, entails \"conscious choice\", darwinian \"Natural Selection\" is Bull Sh-t.\n\n So we are arguing semantics, then?\n \nThe truth of the matter is that there is a 'chooser' in evolution; in fact. trillions of 'em. That 'chooser', in every instance, is the evolving organism itself. Not some ethereal demi-goddess or flying spaghetti monster practicing \"natural selection\".\n\n Part 1: 0/10\n Part 2: 10/10\n You get a 50%.\n \n You see, the organism does not choose its evolution any more than this practitioner of natural selection you made up.\n \n**\n ROTFLMAO!!!! To the contrary!!. I am trying to take 'consciousness' back out of where you people falsely stuffed it--in your \"Natural Selection\"!!!!\n\n Quote a supporter of evolution making that claim.\n \nAnytime you guys want to start being honest with the public and change the name of your hypothetical mechanism from, \"Natural Selection\", to, \"Mechanical Sorting\", [therebye removing the 'consciousness' falsely insinuated by the word 'selection' , and so honestly revealing to the world the materialist process you are truly talking about], you let me know.\n\n Quote a supporter of evolution claiming that \"natural selection\" implies consciousness.\n \nUntil then, you are speaking religiously, not scientifically, animistically projecting anthropomorphic traits on a nebulous abstraction that was never any more real than a poetic figure of speech, from the git-go.\n\n Actually, we are not doing that, and your concern about the wording and meaning of \"natural selection\" will not change that.\n We consider natural selection to be a completely mindless process which works because of differing rates of reproduction and has no supernatural connotations whatsoever.\n \n**\n No idea what you are referring to here, but where I come from, using a word equivocally in order to present a meaning it does not have, simply to serve your own purposes, is a lie, a deception, an overt act of dishonesty and duplicity. If you can say \"So what?\" to that, then you must have checked your morals at the door to biology class.\n\n 1) WW argues that \"natural selection\" implies consciousness.\n 2) WW denounces us for implying that natural selection is a conscious process.\n \n Who else sees the irony here?\n \nThe master in semantics,-- communication, information sharing,-- is common usage,-- the natural, unforced and non-artificial mutual understanding of what 'concepts' are represented/signified/entailed by what language tool [most often a word], used in the communication process.\n\n Which is why words are never understood unless they are used in the most common fashion. Right?", 
   {}, 
   273501, 
   null, 
   1184371560.0
  ], 
  [
   273508, 
   null, 
   "wascallywabbit", 
   "I could say nature does this or that without meaning to imply that nature is a conscious entity. Poetic maybe but hardly intentional deception. \n\n \n **\n Certain things do happen naturally, and not artificially or anthropomorphically, so in those cases it is perfectly OK to speak of natural events as things that 'nature' does; since in that case the word, 'nature', acts simply as a collective noun for all things natural, taken together.\n \n But that is not at all the case with the duplicitous misuse of the word, 'selection', by darwinists. \"Selection\" is not a property of anything that lacks an aware mind, sense perceptions, a values system, a sense of identity, an ability to analyse options, and to voluntarily choose among those options the one that best suits its own purposes. That means that 'selection' is a psychical trait limited to live organisms, and is not shared among the non-living, purely physical parts of 'nature', as a whole. Including such natural non-psychical, physical phenomena as climate, weather, plate tectonics, planetary motion, erosion, chemical reactions, and so on and so forth.\n No sieve ever 'selected', 'chose', what it would withold or what it would not.\n \n \n\n Individuals cannot \"evolve\" physical traits that are passed on to their descendants genetically. I know you believe otherwise.\n\n \n **\n What makes you think this? What evidence do you have to back yourself up on this bold declaration? Since it is factual that novel, original traits do 'evolve', organismically, later to be passed on to that organism's descendents, if these individual organisms are not responsible for it, then who or what is? God? Mother Nature? The Great Flying Spaghetti Monster? Random, spontaneously generated reconfigurations of acid molecules? \"Natural Selection\"? Aliens from Outer Space?\n \n \n \n \n Exactly. Poetic in a manner of speaking. Nothing more. No conspiracy.\n\n \n **\n So long as it was merely a poetic metaphor, no problem. But right from the jump Darwin and pals passed it off as an actual, empirical, natural force that drove organismic change over time. And passing off a metaphor as a scientific mechanism was, and still is, an egregious violation of scientific ethics. It is a lie, and a deliberate, cunning lie, pure and simple.\n \n \n\n What purposes are served? Nevermind my morals. \n\n \n **\n The purposes, as all the world knows, was to make it look like evolution, and by extension, Life itself, could 'just happen, that's all'; without any need for the 'god' or 'divine something' that 19th century atheists, 20th century atheists, and you guys, today, are desperately trying to banish from social reality. That's what, and whose, \"purposes are served\".\n \n As for your morals, if you and your friends were to mind them as you ought, nobody else would have to.\n \n \n \n\n Yes, I know. I didn't mean to suggest that language was a conscious entity either. You have trouble in this area, don't you?\n\n \n **\n Since it is you, not me, that screwed up the distinction, it is obviously you who has the trouble in this area, and me, who had to point it out to you, who has no trouble with it at all. I see that, havimng run out of anything admirable to offer, you now sink to slimy and false insinuation. How darwinian of you!\n \n \n\n Mislead to what conclusion? That nature has a mind? I don't follow.\n\n \n **\n To mislead the public into believing that you were not putting forth an explanation for life that was, and still is, mindless, pointless, meaningless, mechanical, and absurd. But cunningly cloaked behind anthropomophic and teleological language that IS ENTIRELY INNAPROPRIATE, AND THUS ENTIRELY DISHONEST, within the context of your purely materialist/mechanical ateleological conception of biology and its evolution.\n \n And if you still cannot \"follow\" that, then you are lying to yourself and no-one can help you.", 
   {}, 
   273501, 
   null, 
   1184372940.0
  ], 
  [
   273510, 
   null, 
   "gman", 
   "**\n They are both wrong, of course, but the creationists are even more wrong, i.e., irrational, than the darwinists, on this point. And if gman is adopting the creationist view that the fossil record is not evidence of change in one unity, Life, over time, and holds to the creationist view that all 'lives' are particular, distinct, separate, unique and disconnected anomalous entities, then I can once more cheerfully disagree with him. Thank heavens!!\n\n \n I have not attempted to deny that fossil record is inaccurate as evidence of adaptive evolution. Simply that it is not proof of reptile ancestry of mammals. \n The claim of such a dramatic event is more rediculous than creationism and just as unprovable.", 
   {}, 
   273451, 
   null, 
   1184375100.0
  ], 
  [
   273512, 
   null, 
   "T.Q", 
   "I have not attempted to deny that fossil record is inaccurate as evidence of adaptive evolution. Simply that it is not proof of reptile ancestry of mammals. \n The claim of such a dramatic event is more rediculous than creationism and just as unprovable.\n\n \n OK, so exactly how is it ridiculous? If you want a meaningful dialogue you have to actually say somthing worth responding to. You were provided with numerous links backing up the claim, and so far you've responded with nothing more than \"nuh-uh, not true!\"", 
   {}, 
   273510, 
   null, 
   1184375700.0
  ], 
  [
   273513, 
   null, 
   "T.Q", 
   "Once again, WW is reduced to arguing semantics. Seems to come to this point faster and faster with each new thread he starts.", 
   {}, 
   273512, 
   null, 
   1184375760.0
  ], 
  [
   273514, 
   null, 
   "T.Q", 
   "**\n TQ, take your simple-minded, ignorant misunderstanding of how language operates, and stuff it.\n \n Either that, or explain to the world what the various common usage meanings attached to the word, 'port', or any other word, have to do with anything under discussion here; in particular the darwinian corruption of the word, 'selection'. We all await your well-reasoned argument proving that the two cases are exactly the same.\n\n \n Well, I suppose I could match your \"well-reasoned argument\" and say \"bite me\", but unlike you, I can actually see the connection between the two. You argue that using the word evolution is \"dishonest\" because it means xyz. To which I respond, \"OK, give me the single definition of the word port\", using this single word to illustrate that a word can have multiple dissimilar definitions in different contexts. Unfortunately I don't have a large piece of paper and crayons to more adequately explain this concept to you, so I'm afraid you'll just have to muddle through and ask for clarification if you're still lost. \n \n I would have thought that since you're \"more intelligent than 99%\" of the posters here, I wouldn't have had to explain this concept to you the half dozen times I've now done so.", 
   {}, 
   273498, 
   null, 
   1184376120.0
  ], 
  [
   273516, 
   null, 
   "wascallywabbit", 
   "So we are arguing semantics, then?\n\n \n **\n Of course we are. What we are not doing, is allowing you guys to disregard semantics as if semantics were 'mere' semantics, i.e., points that you could just hand-wave away as if they were of no real importance. We are not discussing unimportant trivialities here, but _meanings_ that go right to the heart of the conceptual disagreement.\n \n \n [quote]\n Part 1: 0/10\n Part 2: 10/10\n You get a 50%.[/quopte]\n \n **\n Who knows and who cares what you think this junk is supposed to mean?!?\n \n \n\n You see, the organism does not choose its evolution any more than this practitioner of natural selection you made up.\n\n \n **\n Since you, as a darwinist, have no better nor more honest an understanding of the word 'choose' than you do for the words 'select', or 'selection', or, for that matter, 'evolution', you'll just have to pardon my scorn.\n \n \n\n Quote a supporter of evolution making that claim.\n\n \n **\n Me. It's my claim, I just finished making it for the umpteenth time, and I am convinced of the fact of evolution. Just not the ideological pseudo-scientific malarkey called darwinism that tries to explain it in a way that could, supposedly, support atheism as an intellectually valid theological assumption.\n \n \n\n Quote a supporter of evolution claiming that \"natural selection\" implies consciousness.\n\n \n **\n The word 'selection' does entail at least primitive consciousness, i.e., awareness. That is simply a fact. In view of that fact, by using that term, Charles Darwin and every darwinist who has ever used 'natural selection' as the signification for a real phenomenon has implicitly endowed the term with a perceiving and comprehending awareness, value judgement/evaluation, and directed choice.\n \n To say that 'selection', like 'competition', can be unaware and involuntary is to talk pure semantic rubbish.\n \n See below, from answers.com\n \n \"se·lec·tion (s&#301;-l&#277;k'sh&#601;n) \n n.\n \n The act or an instance of selecting or the fact of having been selected.\n One that is selected.\n A carefully chosen or representative collection of people or things. See synonyms at choice.\n A literary or musical text chosen for reading or performance.\"\n \n Interjection. The abovwe is what 'selection' truly means. Now note the total dissimilarity between the above and the \"biological\" [meaning, \"darwinist\"] definition that follows--\n \n \"Biology. A natural or artificial process that favors or induces survival and perpetuation of one kind of organism over others that die or fail to produce offspring.\"\n \n See? No semantic correlation that would excuse the contrived equivocation.\n Not to mention that the biological 'definition' is so nebulous as to be meaningless in any scientific context.\n \n Let's try the root word, 'to select', shall we?\n \n \"se·lect (s&#301;-l&#277;kt') \n \n v., -lect·ed, -lect·ing, -lects.\n \n v.tr.\n To take as a choice from among several; pick out.\n \n v.intr.\n To make a choice or selection.\"\n \n Just try to subtract awareness, analysis, and volition from that, why don't you? Just try and turn 'to select', into a blind, come-by-chance, mindless accidental, unintentional operation, why don't you?\n \n \n\n Actually, we are not doing that, and your concern about the wording and meaning of \"natural selection\" will not change that.\n\n \n **\n Nothing can change darwinism, because there is nothing of substance in it that would be susceptible to change. You cannot change the meaning of the meaningless.\n \n \n \n\n We consider natural selection to be a completely mindless process which works because of differing rates of reproduction and has no supernatural connotations whatsoever.\n\n \n **\n Now you are doing a stupid thing--you are trying to turn an effect [\"differing rates of reproduction\", into their own cause, or, equally stupid, you are claiming that because this effect is observable, its cause must be the notional fabrication, \"NS\", that you choose to apply to it out of pure speculation and imagination. The old, \"We do not know what causes this, but we are going to call that unknown something, \"Natural Selection\", and then we can just act as if we actually know something!\" Duh!!\n \n \n\n 1/ WW argues that \"natural selection\" implies consciousness.\n\n \n A lie. WW argues that \"natural selection\" [FALSELY] implies consciousness.\"\n A consciousness falsely implied by the dishonestly employed word, 'selection'.\n \n \n\n 2) WW denounces us for implying that natural selection is a conscious process.\n\n \n **\n Exactly. You know that your notion has no place in it for conscious intended behaviour of any kind, and yet, in order to make your soulless mechanics palatable to the public, you use anthropomorphic and teleological language that will cloak its true nature from their understanding, implying, in contravention of your true beliefs, that your mechanism does behave as the real selection process does, and so you make it palatable to the public. Or some of them, at least. [See, \"truthspeak\", \"Ministry of Peace\" etc., Dr. Goebbels et al.].", 
   {}, 
   273506, 
   null, 
   1184376840.0
  ], 
  [
   273517, 
   null, 
   "gman", 
   "\n 1. If god is not supernatural, he is natural, so he conforms to natural laws. There goes your omnipotent, omniscient god. Which way do you want it?\n \n 2. So is medicine, electronics, atomics, the internal combustion engine, etc. Everything is \"based on consensus of speculated ideas\". The thing is, all the above \"speculated ideas\" (including the ToE), are based on numerous lines of evidence (a whole bunch of \"speculated ideas\", in your lingo) and rigorous testing and experimentation.\n \n 3. No, detractors are attacked for denying reality on the basis of a book written by bronze age PR reps (Go team Israel!)\n \n 4. And yet again, all you say is \"Sez you!\" Do you have a better explanation for the fossil evidence? What is your explanation for why so many extinct animals are found in chronological order, with features that strongly suggest decent with modification? If fossils are all just a load of garbage, why are they found in the order predicted by the ToE? \n \n I have to admit, I think it's funny that the fundies have resorted to \"well, if creationism is bad cuz it's a religion, then the ToE is a religion too!\". If you can't elevate yourself, try and drag your opponent down to your level seems to be the strategy.\n\n \n 1. Or, natural laws are \"conformed\" by him. But, I'm not attempting to prove God. Belief is by choice. \n 2. au contraire, the comparison of the science of evolution is but a slap in the face to all of the afore mentioned as they are the result of action and reaction. Physically proven by real science. Perfect examples of the real function of science vs being used as a tool in a futile, pointless and fruitless attempt to dis-prove God. \n 3. Once again, I do not deny the realities of fossil record as evidence of adaptive evolution. Simply that mammals evolving from reptiles is no where near proven. Other than by consensus. \n 4. Not considering myself a fundy, I'm not trying to drag anybody down. Just not buying into something proven only by consensus.", 
   {}, 
   273505, 
   null, 
   1184378520.0
  ], 
  [
   273522, 
   null, 
   "wascallywabbit", 
   "I have not attempted to deny that fossil record is inaccurate as evidence of adaptive evolution. Simply that it is not proof of reptile ancestry of mammals. \n The claim of such a dramatic event is more rediculous than creationism and just as unprovable.\n\n \n **\n Oops, my bad. Sorry for the misunderstanding. But I'm still not sure why you choose the reptile/mammal event as the place to draw the line. There are a lot of dramatic 'switch points' [if you will permit the expression], in evolution, each as amazing and apparently incredible as the others. For me, the position that mammals evolved from reptiles is, on its face, more believable and reasonable than that mammals simply popped into existence out of nothing and nowhere, or that they evolved from fish or crustaceans or whatever. How do you explain the origins of mammals?", 
   {}, 
   273510, 
   null, 
   1184380740.0
  ], 
  [
   273524, 
   null, 
   "T.Q", 
   "1. Or, natural laws are \"conformed\" by him. But, I'm not attempting to prove God. Belief is by choice. \n 2. au contraire, the comparison of the science of evolution is but a slap in the face to all of the afore mentioned as they are the result of action and reaction. Physically proven by real science. Perfect examples of the real function of science vs being used as a tool in a futile, pointless and fruitless attempt to dis-prove God. \n 3. Once again, I do not deny the realities of fossil record as evidence of adaptive evolution. Simply that mammals evolving from reptiles is no where near proven. Other than by consensus. \n 4. Not considering myself a fundy, I'm not trying to drag anybody down. Just not buying into something proven only by consensus.\n\n \n 1. No, you're just saying that what you consider \"god\" is weak enough to be undone by a study of nature. If reality and your idea of god conflict, which is wrong?\n 2. No, they operate by the same principles. In fact, evolution is very important in the study of medicine (to give one example). What are the differences between the fields I mentioned and the ToE? They all follow the scientific method, they are all supported by observation and experimentation, and they are all used in a predictive manner. You saying \"there's no proof of evolution but a bunch of people saying evolution is true\" is not only false, you don't even attempt to support it. If you want to post on a debating board you have to do better than that.\n 3. And again, on what basis?\n 4. But you are a fundy, and again, how is it \"proven only by consensus\"? There are libraries full of evidence supporting evolution. It dovetails neatly with every other branch of the natural sciences, and it is the basis of biology and related fields.\n \n Do you ever plan on offering any sort of explanation or supporting evidence, because the whole \"You're wrong cuz\" thing is wearing thin.", 
   {}, 
   273517, 
   null, 
   1184381820.0
  ], 
  [
   273540, 
   null, 
   "gman", 
   "OK, so exactly how is it ridiculous? If you want a meaningful dialogue you have to actually say somthing worth responding to. You were provided with numerous links backing up the claim, and so far you've responded with nothing more than \"nuh-uh, not true!\"\n\n \n I have viewed links provided by others. So many I'm not sure if your's was some of them. Nothing has been provided that proves the transition from reptile to mammal. The discovery of Yanoconodon and the separation between the jawbone and the inner-ear bones being presented as evidence of the transition is short of proof even amongst the white coats, as the stirrup, anvil and hammer bones are \"still\" connected to the jaw by another bone. Gone between adult modern mammals. \n Links and evolutionist break all the rules of keeping conversation interesting and believable. \n KEEP IT BRIEF. Give the reader the most information, and take from him the \n least time. Polonius in Hamlet said, \"Brevity is the soul of wit\".", 
   {}, 
   273512, 
   null, 
   1184400240.0
  ], 
  [
   273541, 
   null, 
   "gman", 
   "**\n Oops, my bad. Sorry for the misunderstanding. But I'm still not sure why you choose the reptile/mammal event as the place to draw the line. There are a lot of dramatic 'switch points' [if you will permit the expression], in evolution, each as amazing and apparently incredible as the others. For me, the position that mammals evolved from reptiles is, on its face, more believable and reasonable than that mammals simply popped into existence out of nothing and nowhere, or that they evolved from fish or crustaceans or whatever. How do you explain the origins of mammals?\n\n \n I haven't drawn any line. It was the subject and I threw my two cents in. lol. TQ is right in his harsh assessment of me, I am not studied. But, I have opinions and am I'm not bashful. But not stupid either. If any of these issues had been unequivically proven absolute without needing the support of consensus I would concede the issue. The reason I challenge consensus is because believers in God are ridiculed for belief in something they too can not prove and labeled unkindly by people who in kind can not disprove their belief. However unbelievable a presentation is, possibilities exist. I wish I could explain the origin of mammals. I'd be a popular fellow, eh?", 
   {}, 
   273522, 
   null, 
   1184401260.0
  ], 
  [
   273542, 
   null, 
   "gman", 
   "\n 1. No, you're just saying that what you consider \"god\" is weak enough to be undone by a study of nature. If reality and your idea of god conflict, which is wrong?\n 2. No, they operate by the same principles. In fact, evolution is very important in the study of medicine (to give one example). What are the differences between the fields I mentioned and the ToE? They all follow the scientific method, they are all supported by observation and experimentation, and they are all used in a predictive manner. You saying \"there's no proof of evolution but a bunch of people saying evolution is true\" is not only false, you don't even attempt to support it. If you want to post on a debating board you have to do better than that.\n 3. And again, on what basis?\n 4. But you are a fundy, and again, how is it \"proven only by consensus\"? There are libraries full of evidence supporting evolution. It dovetails neatly with every other branch of the natural sciences, and it is the basis of biology and related fields.\n \n Do you ever plan on offering any sort of explanation or supporting evidence, because the whole \"You're wrong cuz\" thing is wearing thin.\n\n \n 1. What I actually said was that I am not attempting to prove God. There's no conflict.\n 2. Wrong. The study of medicine doesn't need the theories of evolution to progress. EMF produces action by producing power. The difference is that theories tested and proven in medicine and power generation and control actually accomplish something. The result is the difference. \n 3. Lack of evidence.\n 4. You do understand the words on the page, right? It dovetails neatly for you as you have chosen to bow to the white coats who have detailed their theories for the doctrine. Key word, \"theories\". \n If it's worn thin, let it go. Don't stress yourself. Of course defending the unprovable to someone who recognizes a spade and calls it a spade would be frustrating.", 
   {}, 
   273524, 
   null, 
   1184402160.0
  ], 
  [
   273549, 
   null, 
   "Ripskar", 
   "Sorry Rip, I'm not on a particular quest. I don't have a government job so I don't have the time to invest in digging for proof that supports \"your\" side of an argument. Which I am not opposed to. But, I am not shying away from you zealots of consensus because you reprimand me for having the audacity to challenge your lack of proof that evolution eliminates God as the source of life. I do not dismiss the possibility that evolution is simply a tool of God. Any one gullible enough to accept the similarities and imagined developments offered as examples of transition should at least be open minded enough to the \"possibility\" that other forces are at play in our existence. To deny the possibility simply creates one more religion with the goal of being \"the one true religion\", all others, going to hell.\n\n \n Your unsubstantiated assertion that this is some sort of religion, (presumably in competition with \"Christianity\") is incorrect as made clear by the statements of both Pope John Paul II and Archbishop of Canterbury Dr. Rowan Williams. The concept of \"Heresy\" is not applicable and would be incoherant with the concept of No-God if that were what we were on about in the first place. The inescapable conclusion is that you have begun with an incorrect assupmtion and are determined to carry through with it despite it's incoherance.\n The charge was never \"heresy\", it was stunning ignorance, akin to an admitance of illiteracy to which we responded by suggesting you educate yourself, as indeed we did.\n Science is neutral as regards religion the attacks by certain sections of the Evangelical community simply reflect their own insecurities.\n \n \nOxford English Dictionary \n heresy\n \n \u0095 noun (pl. heresies) belief or opinion contrary to orthodox religious (Christian) doctrine. \n", 
   {}, 
   273434, 
   null, 
   1184420400.0
  ], 
  [
   273559, 
   null, 
   "ShadowPikachu", 
   "3. Lack of evidence.\n\n Of what?\n \n \n4. You do understand the words on the page, right? It dovetails neatly for you as you have chosen to bow to the white coats who have detailed their theories for the doctrine. Key word, \"theories\". \n If it's worn thin, let it go. Don't stress yourself. Of course defending the unprovable to someone who recognizes a spade and calls it a spade would be frustrating.\n\n \n Ah yes. Well, if you are so determined to avoid the \"white coats\" and their \"doctrine\" and their \"theories\" , I suggest you go back to believing that it is demons that cause illnesses (after all, it is the \"white coats\" Germ \"Theory\" that is used to study illnesses); After that, I suggest you get the :xcensored off the computer, because most of it's workings are depedent on Atomic \"theory\" (another of those evil \"Theories\"); When you're done with that, I suggest you consider jumping off a cliff - after all, those \"white coats are just brainwashing us - the Gravity (just as \"proven\" as Evolution) is just another doctrine of theirs.\n \n Sorry gman, but what you show here is quite common among the Creationist populace - an ignorance of what a \"theory\" really is in science, and an absurd idea that \"theories\" are somehow poorer than \"facts\", when really one cannot compare the two as such.", 
   {}, 
   273542, 
   null, 
   1184431860.0
  ], 
  [
   273565, 
   null, 
   "Hi_Its_Me", 
   "Let's just get to the main points here:\n \nA lie. WW argues that \"natural selection\" [FALSELY] implies consciousness.\"\n A consciousness falsely implied by the dishonestly employed word, 'selection'.\n\n The word \"selection\" is completely irrelevant to the process described by \"natural selection.\" \"Natural selection\" is simply a name for a well-defined, well understood (by scientists, at least), and well-supported process.\n \n**\n Exactly. You know that your notion has no place in it for conscious intended behaviour of any kind, and yet, in order to make your soulless mechanics palatable to the public, you use anthropomorphic and teleological language that will cloak its true nature from their understanding, implying, in contravention of your true beliefs, that your mechanism does behave as the real selection process does, and so you make it palatable to the public.\n\n Scientists have no inclination or need to try to convince the general public that natural selection has a conscious entity behind it. In fact, the use of the word, \"natural\" implies that this form of selection is done by \"nature,\" or, in other words, that it is done randomly.\n \n Also consider that the people who completely misunderstand evolution tend to argue that the ToE claims that evolution happens randomly.", 
   {}, 
   273559, 
   null, 
   1184433300.0
  ], 
  [
   273569, 
   null, 
   "pandion", 
   "TQ is right in his harsh assessment of me, I am not studied.\nAnd therefore, your opinions on the subject are worthless. Unless you at least have the integrity to learn the basics of what you claim to oppose, how can you claim to oppose them?\n \nBut, I have opinions and am I'm not bashful.\nNo matter how much your opinions make you look foolish.\n \nBut not stupid either.\nNot as yet established.\n \nIf any of these issues had been unequivically [sic] proven absolute without needing the support of consensus I would concede the issue.\nThen you know nothing about science since none of it is proven unequivocally. To claim otherwise demonstrates gross ignorance of what science is and how it works.\n \nThe reason I challenge consensus is because believers in God are ridiculed for belief in something they too can not prove and labeled unkindly by people who in kind can not disprove their belief.\nNot quite. Believers in some magic god are ridiculed when they try to present their religion as science, or, as in your case, try to lower science to the status of belief in mythology without evidence. Of course, such believers always argue that \"evolution is only a theory\", just as you do. Rarely do you ever argue that gravity is only a theory, or that germs cause diseases is only a theory, nor to you protest nuclear power plants because their operation is based completely on theory. Perhaps you wouldn't make yourself look so foolish if you actually learned what is meant by the word \"theory\" in science. Would you like me to explain it to you?\n \nHowever unbelievable a presentation is, possibilities exist.\nRight. You display a common argument of creationism, one that caused believers to be ridicules so strongly. Your argument boils down to \"it cudda been.\" There confidence that we place in possibilities varies with the evidence in support of that possibility. \"A magical sky being did it,\" merits no confidence. Though we might technically say that it is possible, it is so fantastically improbable that it is illogical not to reject such possibility out of hand.\n \nI wish I could explain the origin of mammals. I'd be a popular fellow, eh?\nBut you know so little that it isn't even possible that you could explain the origin of mammals. That's the way it is with crusaders against science like you. You prefer to cling to medieval mythology rather than accept science.", 
   {}, 
   273541, 
   null, 
   1184435400.0
  ], 
  [
   273579, 
   null, 
   "wascallywabbit", 
   "Let's just get to the main points here:\n \n The word \"selection\" is completely irrelevant to the process described by \"natural selection.\" \n\n \n **\n Then why is it there?!?\n \n \n\n \"Natural selection\" is simply a name for a well-defined, well understood (by scientists, at least), and well-supported process.\n\n \n **\n Ah, that which started out as the explanatory mechanism, the driving force behind darwinian evolution, has been downgraded to a simple 'process', just like evolution itself is a 'process'. Funnily enough, darwinists seem to define these two 'processes' in the same way, as if they were the same 'process', with two different names! Hmmm. \n \n Well, nevermind, the whole point of our debates is to establish the mechanism that drives the evolutionary process, so at this point it seems logical to ask, so what mechanism drives the \"Natural Selection\" 'process'?\n A 'process' being-- [from answers.com]\n \n \"proc·ess1 (pr&#335;s'&#277;s', pr&#333;'s&#277;s') \n n., pl. proc·ess·es (pr&#335;s'&#277;s'&#301;z, pr&#333;'s&#277;s'-, pr&#335;s'&#301;-s&#275;z', pr&#333;'s&#301;-).\n A series of actions, changes, or functions bringing about a result: the process of digestion; the process of obtaining a driver's license.\n A series of operations performed in the making or treatment of a product: a manufacturing process; leather dyed during the tanning process.[bold mine]\n Progress; passage: the process of time; events now in process.\n Law. The entire course of a judicial proceeding.\n Law. \n A summons or writ ordering a defendant to appear in court.\n The total quantity of summonses or writs issued in a particular proceeding.\n Biology. An outgrowth of tissue; a projecting part: a bony process.\n Any of various photomechanical or photoengraving methods.\n Computer Science. \n A running software program or other computing operation.\n A part of a running software program or other computing operation that does a single task.\n See conk3.\"\n \n IMO, the bolded meanings are the most applicable here. Basically they say that a process is an historical series of cause/effect change events. Or, IOW, stuff that happens. Which is basically meaningless unless and until particularized in a given case, with specific origins, causes, effects, and final outcomes. Which brings us to an interesting aspect of the word--though it does not entail teleology, it implies it. With teleology the mechanism driving a process is 'motive'--the motivation to create or achieve a product/goal.\n \n But what about an ateleological process? What mechanism drives mindless, purposeless, mechanical processes? Darwinists insist that all biological processes are simply chemical processes, and even 'evolution' is simply the chemical process of being reconfiguered within a 'genome'. That is, genomes are what evolve--organismic evolution is merely an 'epiphenomenon' of genomic evolution.\n \n So what is their 'mechanism' for this mechanical process? They do not have a real one. Instead they appeal to the magic of \"spontaneous generation\" and \"emergence\". All they can claim, in the end, is that all of the effects of this process are 'random',-- because some of them are. Crazy, but they do say this.\n \n So what is the driving mechanism behind darwinism's newly re-categorized ateleological 'process', \"Natural Selection\"? More 'spontaneous, random, emergent, ethereal, quasi-mystical' forces of some unspecified kind? Such as what, I wonder?\n \n \n\n Scientists have no inclination or need to try to convince the general public that natural selection has a conscious entity behind it.\n\n \n **\n Scientists don't that's true. But I'm not talking about scientists. I'm talking about the evangelical atheists who make up the ranks of darwinists. They need to hide from the public that their worldview, the view that concocted 'natural selection', is a mindless, souless, absurd, pointless world of zombies and automatons, all passive slaves to their own chemistry.\n \n \n\n In fact, the use of the word, \"natural\" implies that this form of selection is done by \"nature,\" or, in other words, that it is done randomly.\n\n \n **\n I do not think that, 'natural', naturally implies any such thing. I look up 'natural', and nowhere do I find the slightest indication that 'nature' implies, 'random'. You're making that up.\n But it is a fact that that darwinists always use the word 'natural' where the honest word for their true intended meaning is, 'mechanical'. They do this for the same duplicitous reasons we've been speaking of, and they do it with a lot of words.\n \n \n\n Also consider that the people who completely misunderstand evolution tend to argue that the ToE claims that evolution happens randomly.\n\n \n **\n On the contrary. What I am pointing out here is that darwinists claim that their \"TOE\" does _not_ happen 'randomly', is _not_ 'chance-based', when in fact that is exactly what it truly is. One more lie to fool the public withal.\n \n The fact is that there are only three ways that any event or series of events can come to pass--\n a/by pure chance, stochastically, accidentally, purposelessly and ateleologically.\n b/mechanically, regularly, deterministically, inevitably, automatically and with no immediate, proximate or extended intrinsic purpose or end, but entirely ateleologically and meaninglessly.\n c/teleologically, intentionally, purposefully, meaningfully.\n \n You guys dismiss \"c/\" out of hand. You insist that your evolution is not \"a/\", but you have absolutely no empirical evidence of any kind to support your claim that your 'RMNS' evolution is a matter of \"b/\". On the contrary, any good empirical look at the natural world quickly shows that RMNS is \"a/\", right down to its toes. \"RM\" is 'chance' personified, and \"NS\" has no element of \"b/\" in it, except what darwinists project upon it, psychologically.", 
   {}, 
   273565, 
   null, 
   1184446740.0
  ], 
  [
   273583, 
   null, 
   "pandion", 
   "Ah, that which started out as the explanatory mechanism, the driving force behind darwinian evolution, has been downgraded to a simple 'process', just like evolution itself is a 'process'. Funnily enough, darwinists seem to define these two 'processes' in the same way, as if they were the same 'process', with two different names! Hmmm.\nNo, they don't. You'd think that if you were going to argue about evolutionary theory you would want to learn the basics so that you don't make yourself look foolish.\n \nWell, nevermind, the whole point of our debates is to establish the mechanism that drives the evolutionary process, so at this point it seems logical to ask, so what mechanism drives the \"Natural Selection\" 'process'?\nA perfect example. Only a person who is ignorant of evolutionary theory would ask to establish the mechanism that drives the evolutionary process. Natural selection is only one of the mechanisms of evolution.\n \n But since you want to learn, and since all of this seems so new to you, I'll explain what drives natural selection for you.\n \n Darwin's Explanatory Model of Natural Selection\n \n Fact 1. Every population has such high fertility that its size would increase exponentially if it were not constrained.\n \n Fact 2. The size of populations, except for temporary annual fluctuations, remains stable over time.\n \n Fact 3. The resources available to every species are limited.\n Inference 1. There is intense competition among the members of a species.\n Fact 4. No two individuals of a population are exactly the same.\n Inference 2. Individuals of a population differ from each other in the probability of survival (i.e., natural selection).\n Fact 5. Many of the differences among the individuals of a population are, at least in part, heritable.\n Inference 3. Natural selection, continued over many generations, results in evolution.\n Notice that there isn't a hint of some intelligence behind any of it. Natural selection is the probability of survival. It has also been called differential reproductive success. Perhaps that will help you to clear up the confusion that causes you to equate evolution, a process that is the result of many mechanisms, from natural selection (one of those mechanisms).\n \n Hope that helps.", 
   {}, 
   273579, 
   null, 
   1184452620.0
  ], 
  [
   273636, 
   null, 
   "gman", 
   "Your unsubstantiated assertion that this is some sort of religion, (presumably in competition with \"Christianity\") is incorrect as made clear by the statements of both Pope John Paul II and Archbishop of Canterbury Dr. Rowan Williams. \n\n \n True, it is unsubstantiated. It's simply an opinion. Most subjects on a \"debate site\" consist of opinions. Statements by yourself are opinion as you can not prove reptile to mammal transition. And it's burning your XXX up. \n I consider it a religion because it is supported by theories supported by consensus. I could care less what popes and archbishops state. \n Do you need to resort to spelling lessons to feel relevant?", 
   {}, 
   273549, 
   null, 
   1184482560.0
  ], 
  [
   273638, 
   null, 
   "gman", 
   "And therefore, your opinions on the subject are worthless........................................... \n\n \n This is your first post addressing me. All I can get out of it is that you don't like me. I still haven't read anything that proves reptile to mammal transition. Do you have proof other than \"consensus\"? \n \n I'll only respond to your accusation concerning my attitude on science. I respect science and scientist. Theory and testing has produced all of industrial, commercial, home and medical abilities, processes and conveniences we indulge ourselves in today. I've stated numerous times my only objection to the practice of presenting consensus as proof. The problem being that it is forced on students as the truth rather than a possibility.", 
   {}, 
   273569, 
   null, 
   1184484060.0
  ], 
  [
   273639, 
   null, 
   "pandion", 
   "This is your first post addressing me.\nI think that your are correct.\n \nAll I can get out of it is that you don't like me.\nDon't be stupid. I don't know you. I responded to your post based on your admitted ignorance of the topic.\n \nI still haven't read anything that proves reptile to human transition. Do you have proof other than \"consensus\"?\nDo you have any proof other than your admitted ignorance?\n \nI'll only respond to your accusation concerning my attitude on science. I respect science and scientists.\nI suspect that you don't know what science is (by your own admission) and wouldn't know a scientist if you met one.\n \nTheory and testing has produced all of industrial, commercial, home and medical abilities, processes and conveniences we indulge ourselves in today.\nNot exactly. All of that is the application of scientific knowledge. My be is that you don't know what a scientific theory is.\n \nI've stated numerous times my only objection to the practice of presenting consensus as proof.\nWell then. Rest at ease. No scientist presents consensus as proof. Only a scientific illiterate would think otherwise. Science doesn't prove anything.\n \nThe problem being that it is forced on students as the truth rather than a possibility.\nThat's stupid. I spent a lot of years teaching science and I never met a science teacher who did so. Perhaps you didn't pay attention or lack the ability to understand the lessons.\n \n Seriously, from what university did you earn your degree in biology, or in any science, for that matter? (Mine are from St. Mary's College, California, Montana State University, El Instituto de Estudios Superiores de Monterrey, Mexico, and the University of Montana)\n \n Oh! Wait! You admitted up front that you don't know what you are talking about. My bad. So why should we not laugh at your ignorant opinions and distortions or reality? What reasons can you offer for your opinions, based on nothing, can you give other than you believe your mythology. What evidence can you offer that supports your \"opinion?\"\n \n 'mon back now, ya hear?", 
   {}, 
   273638, 
   null, 
   1184485620.0
  ], 
  [
   273647, 
   null, 
   "Ripskar", 
   "True, it is unsubstantiated. It's simply an opinion. Most subjects on a \"debate site\" consist of opinions. Statements by yourself are opinion as you can not prove reptile to mammal transition. And it's burning your XXX up. \n I consider it a religion because it is supported by theories supported by consensus. I could care less what popes and archbishops state. \n Do you need to resort to spelling lessons to feel relevant?\n\n Not spelling, DEFINITION.\n \n \nOxford English Dictionary\n religion\n \n \u0095 noun 1 the belief in and worship of a superhuman controlling power, especially a personal God or gods. 2 a particular system of faith and worship. 3 a pursuit or interest followed with devotion.\n \n Does not match the definition of a religion, therefore you are creating a false analogy.\n In a similar vein you attempted to assert that we would accuse you of heresy\n when as by definition heresy can only be applied to Christianity, and that's one of the more liberal definitions, others restrict it to Catholics and Orthodox Christians. You are attempting to impose something which simply does not fit, presumably based on your own ignorant predjudices.", 
   {}, 
   273636, 
   null, 
   1184507940.0
  ], 
  [
   273648, 
   null, 
   "gman", 
   " \n Don't be stupid............................................................... \n \n 'mon back now, ya hear?\n\n \n Excellent post.\n Still no proof? \n Well, glad you got the chance to post your resume.", 
   {}, 
   273639, 
   null, 
   1184508780.0
  ], 
  [
   273657, 
   null, 
   "Hi_Its_Me", 
   "Still no proof? \n\n The closest thing to \"proof\" you will get from science is a list of a few thousand transitional fossils.\n You will get nothing that will allow you to draw a conclusion with absolute certainty.", 
   {}, 
   273648, 
   null, 
   1184514600.0
  ], 
  [
   273658, 
   null, 
   "Ripskar", 
   "1) Geological timescale, established for at least 2 centuries by James Hutton.\n \n 2) Within this we see that early on there are no mammals, thus at some point they must have come into being.\n \n 3) They appear in the fossil record during the Jurassic period, assuming they didn't materialise out of thin air they must have come from closely related previous forms.\n \n 4) Closely related forms appear in the fossil record previous to the appearance of mammals as described.", 
   {}, 
   273657, 
   null, 
   1184516760.0
  ], 
  [
   273692, 
   null, 
   "ShadowPikachu", 
   "Excellent post.\n Still no proof? \n Well, glad you got the chance to post your resume.\n\n \n Excellent post.\n \n Still nothing of substance?\n \n Well, glad you got the chance to post again.", 
   {}, 
   273648, 
   null, 
   1184538180.0
  ], 
  [
   273733, 
   null, 
   "pandion", 
   "Excellent post.\nThank you. I observe that you can't respond.\n \nStill no proof?\nStill don't understand science?\n \nWell, glad you got the chance to post your resume.\nDo you know what a resume is? What I posted was not.\n \n Why can't you answer my objections? Please, don't be afraid because you haven't \"studied\" the topic and therefore know nothing. After all, only a scientific illiterate talks about proof in science.", 
   {}, 
   273648, 
   null, 
   1184563740.0
  ], 
  [
   273763, 
   null, 
   "trebor", 
   "In the eyes of God, what you describe as supernatural, is not. \n Of course it is a religion, it is all based on consensus of speculated ideas. \n Detractors attacked for questioning the reality of it.\n\n \n And how do you know?? Let's see evidence of this. Or, it is just one of your proclamations?? That statement says to me 'I can close my eyes to all evidence, all common sense, because I believe in God'.", 
   {}, 
   273503, 
   null, 
   1184598900.0
  ], 
  [
   273786, 
   null, 
   "chemist99a", 
   "And how do you know?? Let's see evidence of this. Or, it is just one of your proclamations?? That statement says to me 'I can close my eyes to all evidence, all common sense, because I believe in God'.\n\n \n So much easier than actually doing the thinking thing for yourself is it not emoticon_xangel", 
   {}, 
   273763, 
   null, 
   1184605980.0
  ], 
  [
   274755, 
   null, 
   "gman", 
   "And how do you know?? Let's see evidence of this. Or, it is just one of your proclamations?? That statement says to me 'I can close my eyes to all evidence, all common sense, because I believe in God'.\n\n \n How do I know what? That the acts of God are not viewed by him as supernatural? Or that evo is a religion? \n \n The easy response to this for you, is \"both\". \n \n I have never attempted to prove God to anyone. I do not have that ability. \n Evo is a religion as much as belief in God. Based on the fact that it is supported by nothing more than consensus of theory. Fossil record is of course the tool of evidence. Which has mounds of volumes of written theory. But, in the end, the gaps are too large to present as solid proof of evolution of reptile to mammal transition. thus, the factor of faith. Mine is not a denial of the evolution of species for the sake of adaptation. Simply an argument against reptile to mammal.", 
   {}, 
   273763, 
   null, 
   1185026640.0
  ], 
  [
   274756, 
   null, 
   "Kronus", 
   "\n Evo is a religion as much as belief in God. ...\n thus, the factor of faith. \n\n \n Faith and religion are not the same thing at all. Religion involves belief in a supernatural entity or entities which have an interest in humanity. Faith just means you believe something without proof. I have faith the sun will rise tomorrow, that doesn't make that belief a religion.", 
   {}, 
   274755, 
   null, 
   1185026940.0
  ], 
  [
   274768, 
   null, 
   "supersport", 
   "Faith and religion are not the same thing at all. Religion involves belief in a supernatural entity or entities which have an interest in humanity. Faith just means you believe something without proof. I have faith the sun will rise tomorrow, that doesn't make that belief a religion.\n\n \n it takes faith to believe that a complex organ such as a pancreas or an eye could arise from randomness....not to mention a cell or DNA. There are 3 billion base pairs in the genome and for randomness to be a reality you would have to believe that the odds are 1 in 3 billion that the correct random mutation would add on top of another random mutation to complete a structure. Multiply this times tens of millions of structures across the animal kingdom and you have odds that are stacked so against you that it's just plain stupid. And knowing that there is absolutely no evidence that mutations can add part of a lung or part of a knee or part of an eye or ear, and nowing that natural selection has never been even been scientifically tested/proven in a population of animals, then it's pretty safe to say that you are indeed living on blind, evidence-less faith.", 
   {}, 
   274756, 
   null, 
   1185031980.0
  ], 
  [
   274770, 
   null, 
   "chemist99a", 
   "then it's pretty safe to say that you are indeed living on blind, evidence-less faith.\n\n \n Except of course one has evidence that those organs exist, and one has evidence of the variations that exist in living animals and that one has evidence of common underlying genes and developmental processes. \n \n By the way your probability analysis is laughable in the extreme. The core ideas of evolution instantly throw out any substantive use of fully independent random events. Evolution is NOT random.", 
   {}, 
   274768, 
   null, 
   1185037500.0
  ], 
  [
   274775, 
   null, 
   "supersport", 
   "Except of course one has evidence that those organs exist, and one has evidence of the variations that exist in living animals and that one has evidence of common underlying genes and developmental processes. \n \n By the way your probability analysis is laughable in the extreme. The core ideas of evolution instantly throw out any substantive use of fully independent random events. Evolution is NOT random.\n\n \n sorry the appearance of the raw material for selection to select from IS random....which is my point. You still do not get around there being potentially 3 billion base pairs in the genome, all being likely to mutate. Not only that, but you are assuming that the emergence of organs has direct ties to genes, which is a wild guess at best.", 
   {}, 
   274770, 
   null, 
   1185039000.0
  ], 
  [
   274812, 
   null, 
   "Ripskar", 
   "Evo is a religion as much as belief in God. Based on the fact that it is supported by nothing more than consensus of theory. \n\n \n \nOxford English Dictionary\n religion\n \n \u0095 noun 1 the belief in and worship of a superhuman controlling power, especially a personal God or gods. 2 a particular system of faith and worship. 3 a pursuit or interest followed with devotion.\n \n \n Contradition(s) of the definition of religion;\n No supernatural entity involved, (Unless you're sprecifically citing Theistic Evolution). Does not include *any* concept of worship.\n Exactly how many times do you need to be told?emoticon_rolleyes", 
   {}, 
   274755, 
   null, 
   1185051540.0
  ], 
  [
   274822, 
   null, 
   "chemist99a", 
   "sorry the appearance of the raw material for selection to select from IS random....which is my point. You still do not get around there being potentially 3 billion base pairs in the genome, all being likely to mutate. Not only that, but you are assuming that the emergence of organs has direct ties to genes, which is a wild guess at best.\n\n \n Why be sorry? The real hole in the argument is that the events are not independent across time because of the effects of natural selection. Its not like shaking a bunch of parts together and coming up with a 747.", 
   {}, 
   274812, 
   null, 
   1185059340.0
  ], 
  [
   274828, 
   null, 
   "Kronus", 
   "it takes faith to believe that a complex organ such as a pancreas or an eye could arise from randomness..\n\n Ok, so you utterly missed the whole religion vs. faith part of the discussion, got it.\n \n \n then it's pretty safe to say that you are indeed living on blind, evidence-less faith.\n\n Well, it's safe to say it in that no one will beat you up for doing so. You would, however, be utterly and completely wrong if you did say it. Not that that has been any problem for you in the past...", 
   {}, 
   274768, 
   null, 
   1185064320.0
  ], 
  [
   274836, 
   null, 
   "gman", 
   "Faith and religion are not the same thing at all. Religion involves belief in a supernatural entity or entities which have an interest in humanity. Faith just means you believe something without proof. I have faith the sun will rise tomorrow, that doesn't make that belief a religion.\n\n \n If you believe in transition from reptile to mammal, you are placing faith in an unproven theory.", 
   {}, 
   274756, 
   null, 
   1185071220.0
  ], 
  [
   274838, 
   null, 
   "gman", 
   "Contradition(s) of the definition of religion;\n \n No supernatural entity involved, \n \n (Unless you're sprecifically citing Theistic Evolution). Does not include *any* concept of worship.\n\n \n At least none claimed. ", 
   {}, 
   274812, 
   null, 
   1185071640.0
  ], 
  [
   274841, 
   null, 
   "Kronus", 
   "If you believe in transition from reptile to mammal, you are placing faith in an unproven theory.\n\n \n You clearly think you made a point there, but you didn't. Science doesn't prove anything, not in the way that things get proven in math anyway. It simply comes up with the most likely explanation for the observed data. That isn't a religion, nor does the leap of faith required compare in any way to that required to believe in the big bearded guy in the sky. Science asks you to have faith that the observed data can mean something, that the universe is in some way understandable. That faith has been shown to be well placed time and time again, unlike your religious faith, which has never been shown to be based on reality. So sure, science requires you to accept certain axioms \"on faith\", but to pretend that in any way equates to a religion or weakens science somehow is simple foolishness.\n \n If you want to refute my stance, I suggest you try using more than one sentence at a go, you might find it easier to present a full fledged idea that way.", 
   {}, 
   274836, 
   null, 
   1185073080.0
  ], 
  [
   274851, 
   null, 
   "chemist99a", 
   "I\nf you believe in transition from reptile to mammal, you are placing faith in an unproven theory.\n Reply With Quote\n\n \n Its more like transition from reptiles to mammal like reptiles to reptile like mammals to mammals. The fossil record provides the links necessary to rough it out.", 
   {}, 
   274841, 
   null, 
   1185082920.0
  ], 
  [
   274869, 
   null, 
   "Ripskar", 
   "At least none claimed. \n\n \n \nOxford English Dictionary\n science\n \n \u0095 noun 1 the intellectual and practical activity encompassing the systematic study of the structure and behaviour of the physical and natural world through observation and experiment. 2 a systematically organized body of knowledge on any subject. \n\n If it includes anything supernatural it immediately falls outside the study of the natural and thus isn't science. \n That's why Intelligent Design isn't science, even before considereing all the methodological errors that would preclude it.\n That's why you don't get parapsychological papers published in peer reviewed scientific journals.\n By definition science is not, nor can it ever be a religion.", 
   {}, 
   274838, 
   null, 
   1185108900.0
  ], 
  [
   274886, 
   null, 
   "gman", 
   " \n By definition science is not, nor can it ever be a religion.\n\n \n I cede the point of definition. \n However, defensive reaction to challenges of unproven theory is merely by faith.\n Once the world was proven round, the argument ended. Consensus favored flat. Exposing consensus as unworthy.", 
   {}, 
   274869, 
   null, 
   1185117660.0
  ], 
  [
   274888, 
   null, 
   "trebor", 
   "I cede the point of definition. \n However, defensive reaction to challenges of unproven theory is merely by faith.\n Once the world was proven round, the argument ended. Consensus favored flat. Exposing consensus as unworthy.\n\n \n \n You don't understand science at all.\n \n \"Theories\" are never proven. They merely explain all the available data, or they don't.\n \n What scientists do is take a theory, and try to come up with ways to DISPROVE it. The theory of evolution has successfully shown to meet all the challenges trying to disprove it. It is one of the theories that has the best evidence for it, and it has withstood challenges for 150 years.", 
   {}, 
   274886, 
   null, 
   1185119940.0
  ], 
  [
   274979, 
   null, 
   "gman", 
   "\n 1. You don't understand science at all.\n \n 2. \"Theories\" are never proven. They merely explain all the available data, or they don't.\n \n 3. What scientists do is take a theory, and try to come up with ways to DISPROVE it. The theory of evolution has successfully shown to meet all the challenges trying to disprove it. It is one of the theories that has the best evidence for it, and it has withstood challenges for 150 years.\n\n \n 1. Science? Have I attacked the function of science? Are you sure you're current with the conversation? \n 2. Thank you for supporting my statements. Now, stop legally blocking the teaching of creation in schools as a possibility since you agree. \n 3. It has not withstood anything. Theory, supported by consensus does not stand as any more realistic than beliefs.", 
   {}, 
   274888, 
   null, 
   1185162600.0
  ], 
  [
   274984, 
   null, 
   "T.Q", 
   "1. Science? Have I attacked the function of science? Are you sure you're current with the conversation? \n 2. Thank you for supporting my statements. Now, stop legally blocking the teaching of creation in schools as a possibility since you agree. \n 3. It has not withstood anything. Theory, supported by consensus does not stand as any more realistic than beliefs.\n\n \n 1. You have with 2. above\n 2. Creationism is not a \"theory\" except in the loosest sense of the laymen's use of the term.\n 3. The consensus comes from the overwhelming amount of supporting evidence.", 
   {}, 
   274979, 
   null, 
   1185165660.0
  ], 
  [
   274985, 
   null, 
   "chemist99a", 
   "3. The consensus comes from the overwhelming amount of supporting evidence.\n\n \n Yes indeed the consensus is forced by the evidence, the consensus is not the supporting argument, it is the conclusion FORCED by the overwhelming evidence.\n \n As to teaching of science, the objective is to teach the best supported theories that we have, NOT to make public classrooms advanced debating arenas.", 
   {}, 
   274984, 
   null, 
   1185165840.0
  ], 
  [
   275001, 
   null, 
   "pandion", 
   "1. Science? Have I attacked the function of science?\nNo. You have demonstrated that you are scientifically illiterate. You have misrepresented the function of science because of your apparent ignorance.\n \nAre you sure you're current with the conversation?\nMore or less. Certainly more current with the conversation than you are with science. I'm actually fairly current with science, especially those topics under discussion here.\n \n2. Thank you for supporting my statements. Now, stop legally blocking the teaching of creation in schools as a possibility since you agree.\nBut science isn't about teaching possibilities. Science education is about teaching the body of knowledge gained through the investigation of natural phenomena through observation, theoretical explanation, and experimentation.\n \n But of course, when you make such statements in response to the fact that scientific theories do not prove anything, then you show your ignorance. You demand that science \"prove\" something while you also claim that your mythology should be given equal status without any requirement of proof.\n \n3. It has not withstood anything. Theory, supported by consensus does not stand as any more realistic than beliefs.\nThen it's a good thing that scientific theory isn't a matter of consensus.\n \n I wonder. Do you really want science teachers to present the mythology of creationism along with science? Do you really think that it is a good idea to present mythology in an environment where examination of facts is encouraged? The fact is, creationism can't even get past court decisions, much less actual curriculum evaluation in schools.", 
   {}, 
   274979, 
   null, 
   1185173820.0
  ], 
  [
   275031, 
   null, 
   "Count Otto", 
   "Based on the fact that it is supported by nothing more than consensus of theory.\n\n \n Wow. So much ignorance squashed into such a small space. It's like a singularity of ignorance ready to expand inexorably into a Universe of just being completely wrong...", 
   {}, 
   274755, 
   null, 
   1185198840.0
  ], 
  [
   275039, 
   null, 
   "chemist99a", 
   "Wow. So much ignorance squashed into such a small space. It's like a singularity of ignorance ready to expand inexorably into a Universe of just being completely wrong...\n\n \n Yes and the monoblock here is composed of dark (ie inactive) grey matter and its full of stringy things made of inappropriate concepts. But never fear after inflation light will emerge.", 
   {}, 
   275031, 
   null, 
   1185203640.0
  ], 
  [
   275201, 
   null, 
   "trebor", 
   "1. Science? Have I attacked the function of science? Are you sure you're current with the conversation? \n \n\n \n Yes, I am sure. You keep on mentioning 'unproven theories'.. and that shows you do not understand science. \n \n\n \n 2. Thank you for supporting my statements. Now, stop legally blocking the teaching of creation in schools as a possibility since you agree. \n \n \n\n \n If we do, which creations story should we teach?? The turtles all the way down? THe hindu one?? You see, there is this thing about not promoting one religion over another in this country. Teaching 'Creation' should be in a comparative religion class, not science. The fact you even bring it up shows again, you are attacking science and trying to replace it with superstition\n \n \n\n \n \n 3. It has not withstood anything. Theory, supported by consensus does not stand as any more realistic than beliefs.\n\n \n Now, that again, shows totally ignorance about scientific theories. There is a big difference between the layman's idea of a theory,and a scientific theory.\n You are using the logical fallacy of equivocation for the word theory.\n \n Scientific theories have to be backed up with objective evidence,and for things like evolution and gravity, be able to make predictions. That is certainly more realistic than religious beliefs.", 
   {}, 
   274979, 
   null, 
   1185242760.0
  ], 
  [
   275220, 
   null, 
   "chemist99a", 
   "If we do, which creations story should we teach?? The turtles all the way down? THe hindu one?? You see, there is this thing about not promoting one religion over another in this country. Teaching 'Creation' should be in a comparative religion class, not science. The fact you even bring it up shows again, you are attacking science and trying to replace it with superstition\n\n \n Teach the controversy. Require each student to be proficient in every theory or notion ever presented by any human anywhere that we can identify. No problem it should not take more than three or four years to run through them all in the classroom. All the gods, all the creators, all the wacko theories. THEN our children will be well equipped to think their way through the problems of their lives.", 
   {}, 
   275201, 
   null, 
   1185251160.0
  ], 
  [
   275237, 
   null, 
   "Count Otto", 
   "No problem it should not take more than three or four years to run through them all in the classroom.\n\n \n I should think it would take 3 or 4 years just to go through the differerent 'dreamings' of the various aboriginal tribes in Australia. That, for my money, would be a much better use of resources than teaching those strange Middle-Eastern religions anyway. The Dreamtime makes much more sense...", 
   {}, 
   275220, 
   null, 
   1185273960.0
  ], 
  [
   275312, 
   null, 
   "Ripskar", 
   "Neither Creationism, nor Intelligent Design should be taught in science lessons on the grounds that nethier are science. Both reference supernatural entities which immediately puts them outside of science.\n If you want to teach that sort of thing stick it Religious Studies, and there would be little defence against the teaching of Flat Earthism as per the Flat Earth Society;\n http://www.alaska.net/~clund/e_djublonskopf/FlatHome.htm\n http://www.lhup.edu/~dsimanek/fe-scidi.htm\n http://www.sacred-texts.com/earth/za/", 
   {}, 
   275237, 
   null, 
   1185311520.0
  ], 
  [
   275374, 
   null, 
   "supersport", 
   "Neither Creationism, nor Intelligent Design should be taught in science lessons on the grounds that nethier are science. Both reference supernatural entities which immediately puts them outside of science.\n If you want to teach that sort of thing stick it Religious Studies, and there would be little defence against the teaching of Flat Earthism as per the Flat Earth Society;\n http://www.alaska.net/~clund/e_djublonskopf/FlatHome.htm\n http://www.lhup.edu/~dsimanek/fe-scidi.htm\n http://www.sacred-texts.com/earth/za/\n\n \n ToE is not science either -- its god is chance.\n \n Neither chance nor God can be proven. Neither are science. Your assertion that the only thing that can be considered science is that which leads to the conclusion that we got here randomly and by chance is obsurd. The evidence is the same for everyone. Your interpretation of the given evidence is no more science than creationism.", 
   {}, 
   275312, 
   null, 
   1185327000.0
  ], 
  [
   275381, 
   null, 
   "chemist99a", 
   "ToE is not science either -- its god is chance.\n \n\n \n Nope. NDS has no god with the p ossible exception of the search for a solid explanation! You seem unable to grasp the concept of natural selection applied to underlying variability in a cyclic ongoing proecess. I cannot help you see the effects of that and I am sorry for you that you lack the vision to grasp the implications. Its an extremely seductive and marvellous idea once you grasp the fundamentals. It really does clarify the world of observation of life forms to an astonishing degree. Sorry you miss the point.", 
   {}, 
   275374, 
   null, 
   1185330540.0
  ], 
  [
   275388, 
   null, 
   "chemist99a", 
   "Or to quote the most eloquent Darwin at the end of his major work:\n \n \n \nIt is interesting to contemplate a tangled bank, clothed with many plants\n of many kinds, with birds singing on the bushes, with various insects\n flitting about, and with worms crawling through the damp earth, and to\n reflect that these elaborately constructed forms, so different from each\n other, and dependent upon each other in so complex a manner, have all been\n produced by laws acting around us. These laws, taken in the largest sense,\n being Growth with reproduction; Inheritance which is almost implied by\n reproduction; Variability from the indirect and direct action of the\n conditions of life, and from use and disuse; a Ratio of Increase so high as\n to lead to a Struggle for Life, and as a consequence to Natural Selection,\n entailing Divergence of Character and the Extinction of less improved\n forms. Thus, from the war of nature, from famine and death, the most\n exalted object which we are capable of conceiving, namely, the production\n of the higher animals, directly follows. There is grandeur in this view of\n life, with its several powers, having been originally breathed by the\n Creator into a few forms or into one; and that, whilst this planet has gone\n circling on according to the fixed law of gravity, from so simple a\n beginning endless forms most beautiful and most wonderful have been, and\n are being evolved.\n \n", 
   {}, 
   275381, 
   null, 
   1185335760.0
  ], 
  [
   275423, 
   null, 
   "Ripskar", 
   "<Snipage of irrelavent non argument<\n Oh dear..\n\n \n Nuclear decay; radioactive halflife of unstable elements caused by the random breakdown of atomic nucleii. \n Using this random effect we produce electricity, tell the time and destroy cities. \n Are you claiming that nuclear physics isn't science?emoticon_xdonno", 
   {}, 
   275374, 
   null, 
   1185366720.0
  ], 
  [
   275430, 
   null, 
   "charlie horse", 
   "... Neither chance nor God can be proven. Neither are science ... Your interpretation of the given evidence is no more science than creationism.\n\n When you say chance, do you mean by accident, or a ratio of probabilities?\n \n Certainly the likelihood of accident or a ratio of probabilities can be deduced mathematically, but you're saying that this isn't science. Then what is it? But I do agree with you wholeheartedly that God is not science and cannot be proven. Why therefore build your life around such an illogical notion?\n \n You also admit that creationism is found wanting. On what precepts is creationism founded, other than wishful thinking and admitted non-science?", 
   {}, 
   275374, 
   null, 
   1185370020.0
  ], 
  [
   276083, 
   null, 
   "Unriggable", 
   "ToE is not science either -- its god is chance.\n \n\n \n No, you can't seem to envision a world without a supreme ruler. You don't need to have order. Look at today's world - most chaotic thing you've ever seen in your life.\n \n I can't figure out how the idea of \"The fossils don't show up until 2 million years ago\" escapes you. Besides, how does a plesiosaur go extinct but the blue whale not? It makes no sense.", 
   {}, 
   275374, 
   null, 
   1186073460.0
  ], 
  [
   278572, 
   null, 
   "chemist99a", 
   "Like I said somewhere reptiles evolved to mammal-like reptiles which evolved to reptile-like mammals which evolved to mammals. Of course the reptiles kept on going through it all and it was only by chance that many of the specialized reptiles got themselves whacked and the mammals managed to survive. Kind of lucky for us that we were not more specialized when the big one hit us! But hey maybe if we to had gone down then the birds (or even reptiles) would occupy our niche. Personally I would like to think of intelligent pterosaurs dominating the earth, but thats just my fantasy.", 
   {}, 
   276083, 
   null, 
   1187257020.0
  ], 
  [
   279285, 
   null, 
   "N.Wells", 
   "**The word 'selection' does entail at least primitive consciousness, i.e., awareness. That is simply a fact. In view of that fact, by using that term, Charles Darwin and every darwinist who has ever used 'natural selection' as the signification for a real phenomenon has implicitly endowed the term with a perceiving and comprehending awareness, value judgement/evaluation, and directed choice.\n \n To say that 'selection', like 'competition', can be unaware and involuntary is to talk pure semantic rubbish.\n \n See below, from answers.com\n \n \"se·lec·tion (s&#301;-l&#277;k'sh&#601;n) \n n.\n \n The act or an instance of selecting or the fact of having been selected.\n One that is selected.\n A carefully chosen or representative collection of people or things. See synonyms at choice.\n A literary or musical text chosen for reading or performance.\"\n \n Interjection. The abovwe is what 'selection' truly means. Now note the total dissimilarity between the above and the \"biological\" [meaning, \"darwinist\"] definition that follows--\n \n \"Biology. A natural or artificial process that favors or induces survival and perpetuation of one kind of organism over others that die or fail to produce offspring.\"\n \n See? No semantic correlation that would excuse the contrived equivocation.\n Not to mention that the biological 'definition' is so nebulous as to be meaningless in any scientific context.\n \n Let's try the root word, 'to select', shall we?\n \n \"se·lect (s&#301;-l&#277;kt') \n \n v., -lect·ed, -lect·ing, -lects.\n \n v.tr.\n To take as a choice from among several; pick out.\n \n v.intr.\n To make a choice or selection.\"\n \n Just try to subtract awareness, analysis, and volition from that, why don't you? Just try and turn 'to select', into a blind, come-by-chance, mindless accidental, unintentional operation, why don't you?\n \n\n \n Another piece of WW nonsense, which I intended to respond to but forgot.\n \n Let's repeat that first bit again for emphasis, because it is wrong: \n\"The word 'selection' does entail at least primitive consciousness, i.e., awareness. That is simply a fact. In view of that fact, by using that term, Charles Darwin and every darwinist who has ever used 'natural selection' as the signification for a real phenomenon has implicitly endowed the term with a perceiving and comprehending awareness, value judgement/evaluation, and directed choice.\"\n\n \n Let's see what Darwin actually said on this matter, because he was, in fact, quite explicit that he intended otherwise: \n(from the 5th edition of the Origin of Species) Others have objected that the term selection implies conscious choice in the animals which become modified; and it has even been urged that, as plants have no volition, natural selection is not applicable to them! In the literal sense of the word, no doubt, natural selection is a false term; but who ever objected to chemists speaking of the elective affinities of the various elements?-and yet an acid cannot strictly be said to elect the base with which it in preference combines. It has been said that I speak of natural selection as an active power or Deity; but who objects to an author speaking of the attraction of gravity as ruling the movements of the planets? Every one knows what is meant and is implied by such metaphorical expressions; and they are almost necessary for brevity. So again it is difficult to avoid personifying the word Nature; but I mean by Nature, only the aggregate action and product of many natural laws, and by laws the sequence of events as ascertained by us. With a little familiarity such superficial objections will be forgotten.\n\n \n Darwin explains elsewhere that he chose \"natural selection\" as a comparison to artificial selection, by breeding plus culling. He saw that 'nature\" (events in the normal courses of the lives of the members of a species) were directly but unconciously culling the species and conferring on them very different degrees of reproductive success.\n \n (However, Darwin was in fact wrong on the last point, in failing to anticipate WW.)\n \n \n (Incidentally, Mike, you were complaining about lost posts: FWIW, I noticed yesterday that on my system editing in the regular edit & save facility takes a while to post a change and caused one edit to be lost, whereas using the \"go advanced\" edit always seems to get the edit posted very quickly.)", 
   {
    "unicode_changes_made": true
   }, 
   273516, 
   null, 
   1187549520.0
  ], 
  [
   279289, 
   null, 
   "chemist99a", 
   "Indeed the concept of selection and selectivity are deeply embedded in science and technology. We speak of selective filters, selective reactions, selective mechanical processes, selective this and selective that. And its all process related. Suppose we have things with a composition vector Xi and those things are subjected to a process such that Xi give rise to Xj. If Xit is the total count of Xi and Xjt is the total count for Xj then selection is present if the input vector Xi/Xit is not equal to the output vector Xj/Xjt. In other words selectivity only requires that the composition vector changes during the process.\n \n This is of course what Darwin meant by the term and it does not in any way require that the process involved be intelligent, intentional, externally directed, or anything but existant.\n \n One can joust in the verbal mode forever on this sort of thing, but a simple and clear mathematical definition leaves no room to debate what we mean by selection. Its clumsy here without notational conveniences and one is forced to use words instead, but surely even WW can grasp the actual meaning as intended by biologists and chemists etc. Common usage and technical usage often are a loggerheads, but technical usage is usually tightly defined by those who use the term. Selection is such a term. WW is simply wrong here.\n \n And one must needs consider Darwins admonitions. The term is in fact \"natural selection\" which implies selection caused by natural processes or variables and indeed the contrarst to \"artificial selection\" done by humans which IS volitional, intentional, and directed to a goal is striking. \"Natural selection\" has none of those properties you realize. The processes underlying natural selection are not set in place by minds (divine or human) but rather by the operation of nature via (ultimately) physics and chemistry.\n \n Now just for the fun of it lets apply the dictionary to the term \"natural selection\" and what turns up?\n \n natural selection\n One entry found for natural selection.\n Main Entry: natural selection\n Function: noun\n : a natural process that results in the survival and reproductive success of individuals or groups best adjusted to their environment and that leads to the perpetuation of genetic qualities best suited to that particular environment", 
   {}, 
   279285, 
   null, 
   1187550540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  reptiles turning to mammals", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10076, 
  "discussion_files": [
   [
    "8013.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-print.html"
   ], 
   [
    "8014.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-11-print.html"
   ], 
   [
    "8015.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-9-print.html"
   ], 
   [
    "8016.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-7-print.html"
   ], 
   [
    "8017.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-5-print.html"
   ], 
   [
    "8018.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-4-print.html"
   ], 
   [
    "8019.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-6-print.html"
   ], 
   [
    "8020.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-8-print.html"
   ], 
   [
    "8021.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-10-print.html"
   ], 
   [
    "8022.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-3-print.html"
   ], 
   [
    "8023.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10076-reptiles-turning-mammals-2-print.html"
   ]
  ], 
  "identifier": 10076
 }
]