[
 [
  [
   272520, 
   null, 
   "wascallywabbit", 
   "**\n \n Or darwinist geneticism--it's all the same thing.\n \n \"A Challenge to Gene Theory, a Tougher Look at Biotech \n Christophe Vorlet\n \n E-MailPrint Single Page Reprints Save Share\n DiggFacebookNewsvinePermalink\n \n By DENISE CARUSO\n Published: July 1, 2007\n THE $73.5 billion global biotech business may soon have to grapple with a discovery that calls into question the scientific principles on which it was founded.\n \n Skip to next paragraph \n Podcast\n Weekend Business \n This week: The launch of the Apple Iphone, China's trade problems, Susan Decker taking over Yahoo and riding the bond wave.\n \n How to Subscribe This Week's Podcast (mp3)Last month, a consortium of scientists published findings that challenge the traditional view of how genes function. The exhaustive four-year effort was organized by the United States National Human Genome Research Institute and carried out by 35 groups from 80 organizations around the world. To their surprise, researchers found that the human genome might not be a \"tidy collection of independent genes\" after all, with each sequence of DNA linked to a single function, such as a predisposition to diabetes or heart disease.\n \n Instead, genes appear to operate in a complex network, and interact and overlap with one another and with other components in ways not yet fully understood. According to the institute, these findings will challenge scientists \"to rethink some long-held views about what genes are and what they do.\" \n \n Biologists have recorded these network effects for many years in other organisms. But in the world of science, discoveries often do not become part of mainstream thought until they are linked to humans.\n \n With that link now in place, the report is likely to have repercussions far beyond the laboratory. The presumption that genes operate independently has been institutionalized since 1976, when the first biotech company was founded. In fact, it is the economic and regulatory foundation on which the entire biotechnology industry is built. \n \n Innovation begets risk, almost by definition. When something is truly new, only so much can be predicted about how it will play out. Proponents of a discovery often see and believe only in the benefits it will deliver. But when it comes to innovations in food and medicine, belief can be dangerous. Often, new information is discovered that invalidates the principles - thus the claims of benefit and, sometimes, safety - on which proponents have built their products. \n \n For example, antibiotics were once considered miracle drugs that, for the first time in history, greatly reduced the probability that people would die from common bacterial infections. But doctors did not yet know that the genetic material responsible for conferring antibiotic resistance moves easily between different species of bacteria. Overprescribing antibiotics for virtually every ailment has given rise to \"superbugs\" that are now virtually unkillable.\n \n The principle that gave rise to the biotech industry promised benefits that were equally compelling. Known as the Central Dogma of molecular biology, it stated that each gene in living organisms, from humans to bacteria, carries the information needed to construct one protein.\n \n Proteins are the cogs and the motors that drive the function of cells and, ultimately, organisms. In the 1960s, scientists discovered that a gene that produces one type of protein in one organism would produce a remarkably similar protein in another. The similarity between the insulin produced by humans and by pigs is what once made pig insulin a life-saving treatment for diabetics.\n \n The scientists who invented recombinant DNA in 1973 built their innovation on this mechanistic, \"one gene, one protein\" principle. \n \n Because donor genes could be associated with specific functions, with discrete properties and clear boundaries, scientists then believed that a gene from any organism could fit neatly and predictably into a larger design - one that products and companies could be built around, and that could be protected by intellectual-property laws. \n \n This presumption, now disputed, is what one molecular biologist calls \"the industrial gene.\"\n \n \"The industrial gene is one that can be defined, owned, tracked, proven acceptably safe, proven to have uniform effect, sold and recalled,\" said Jack Heinemann, a professor of molecular biology in the School of Biological Sciences at the University of Canterbury in New Zealand and director of its Center for Integrated Research in Biosafety. \n \n 1 2 Next Page >>\n Denise Caruso is executive director of the Hybrid Vigor Institute, which studies collaborative problem-solving. E-mail: dcaruso@nytimes.com \"\n \n **\n at--\n http://www.nytimes.com/2007/07/01/business/yourmoney/01frame.html?_r=1&ref=science&oref=slogin", 
   {
    "post_info": {
     "post_title": "Genetic darwinism take another boot in the butt."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1183737900.0
  ], 
  [
   272552, 
   null, 
   "charlie horse", 
   "...According to the institute, these findings will challenge scientists \"to rethink some long-held views about what genes are and what they do...\"\n\n And that's what scientists will do. No change there, then.\n \n Now, on the subject of long-held religious views, how many so-called Christians will have a rethink when presented with new findings?", 
   {
    "unicode_changes_made": true
   }, 
   272520, 
   null, 
   1183746840.0
  ], 
  [
   272562, 
   null, 
   "Master_Shake", 
   "Here we go again.", 
   {}, 
   272552, 
   null, 
   1183748520.0
  ], 
  [
   272569, 
   null, 
   "Klown", 
   "Here we go again.\n\n \n Yep...\n \n emoticon_rolleyes", 
   {}, 
   272562, 
   null, 
   1183750920.0
  ], 
  [
   272571, 
   null, 
   "Klown", 
   "Summarize that article, please. Cutting-and-pasting literally everything on a webpage is usually good evidence that meaningful comprehension is lacking.", 
   {}, 
   272520, 
   null, 
   1183750980.0
  ], 
  [
   272583, 
   null, 
   "Jo Bennett", 
   "I thought it had been known for some time that genes were multi-functional?", 
   {}, 
   272571, 
   null, 
   1183756980.0
  ], 
  [
   272608, 
   null, 
   "supersport", 
   "The genome is a network. Sounds like that link the other day that said the brain was a network. So if genes don't go off and do things independently, and instead, get their instructions from the network, then where exactly does randomness come in? Not only that but this emphasizes the concept of epistasis:\n \n http://www.arn.org/blogs/index.php/literature/2006/12/15/epistasis_affects_the_fitness_landscape\n \n Epistasis effects constrain evolutionary trajectories associated with random mutations. Go past the threshold and the apparently \"fit\" mutations are revealed as deleterious. For a long time, Darwinists have resisted any critical examination of their mechanism for evolution, but the evidence is getting stronger every year that 'mutations + natural selection' will not deliver the transformations required.", 
   {
    "unicode_changes_made": true
   }, 
   272583, 
   null, 
   1183764180.0
  ], 
  [
   272609, 
   null, 
   "supersport", 
   "I thought it had been known for some time that genes were multi-functional?\n\n \n it has been known for a long time -- it's just been surpressed because it contradicts genetic determinism and neo-darwinsm in general.", 
   {}, 
   272583, 
   null, 
   1183764240.0
  ], 
  [
   272624, 
   null, 
   "Master_Shake", 
   "it has been known for a long time -- it's just been surpressed because it contradicts genetic determinism and neo-darwinsm in general.\n\n Yes, it's been supressed. Only 14 people knew it before some brave soul tortured them until they confessed the horrible truth!!", 
   {}, 
   272609, 
   null, 
   1183769040.0
  ], 
  [
   272635, 
   null, 
   "Jo Bennett", 
   "it has been known for a long time -- it's just been surpressed because it contradicts genetic determinism and neo-darwinsm in general.\n\n \n I'm not sure what you mean by either genetic determinism or neo-darwinism, but there is no contradiction between multi-purpose genes and evolution by natural selection, or the principle that genotypic alterations have a phenotypic expression. Just because a gene may have more than one function, or multiple genes make contribute to a single characteristic, doesn't make any substantive difference to the theory of evolution, which you should recall was inititally developed before there was any understanding of genetics at all.", 
   {}, 
   272609, 
   null, 
   1183778100.0
  ], 
  [
   272638, 
   null, 
   "supersport", 
   "I'm not sure what you mean by either genetic determinism or neo-darwinism, .\n\n \n that's where you should have stopped....if you don't know the meaning of those terms then it's probably safe to say you're not versed enough to know the specifics of the theory itself. No offense.", 
   {}, 
   272635, 
   null, 
   1183789260.0
  ], 
  [
   272641, 
   null, 
   "Master_Shake", 
   "that's where you should have stopped....if you don't know the meaning of those terms then it's probably safe to say you're not versed enough to know the specifics of the theory itself. No offense.\n\n Just SS's way of not addressing the pertinent issues.", 
   {}, 
   272638, 
   null, 
   1183791480.0
  ], 
  [
   272647, 
   null, 
   "supersport", 
   "You know what the horrible reality is for darwinists here, don't you? It's a deep, dark, seedy secret that rips giant holes through 100 years of science: The reality is, despite decades of biologists saying otherwise, when it comes to biological change, it's not the genes themselves that we should be looking at....what makes animals different from each other and what what causes them to evolve/change has very little to do with the genes themselves, but the relationship between the genes. It's not the hardware that dictates anything -- it's the software...this is what manipulates the hardware. This of course kicks Neo-darwinism right in the nads because this is a theory centered around genes themselves. It's already a dying, if not dead, theory. Biologists are running from it everywhere. And the thing is, if neo-darwinism dies, so does natural selection as its currently defined. No longer will natural selection play the role of creator, but merely a role of eliminator.......and the sad thing for evolutionists is, all the lifeforms around us could not have gotten here by elimination. Something needs to play the role of creator.....and mutations don't do it either because they only degrade what's already there. They create nothing.\n \n You people are in a canoe without a paddle, headed towards a waterfall.", 
   {}, 
   272641, 
   null, 
   1183795260.0
  ], 
  [
   272648, 
   null, 
   "T.Q", 
   "that's where you should have stopped....if you don't know the meaning of those terms then it's probably safe to say you're not versed enough to know the specifics of the theory itself. No offense.\n\n \n SS, you've amply demonstrated a complete lack of knowledge on this and many other subjects in your posts (Butterfly wombs anyone). I think you should be the last one to speak about being \"versed enough to know the specifics of the theory itself\"\n \n No offense.", 
   {}, 
   272638, 
   null, 
   1183795380.0
  ], 
  [
   272653, 
   null, 
   "Jo Bennett", 
   "I have a fair layman's knowledge of genetics and evolution, what I can't speak to is your bizarre use of terminology, supersport.", 
   {}, 
   272648, 
   null, 
   1183811340.0
  ], 
  [
   272664, 
   null, 
   "wascallywabbit", 
   "I'm not sure what you mean by either genetic determinism or neo-darwinism, but there is no contradiction between multi-purpose genes and evolution by natural selection, or the principle that genotypic alterations have a phenotypic expression. Just because a gene may have more than one function, or multiple genes make contribute to a single characteristic, doesn't make any substantive difference to the theory of evolution, which you should recall was inititally developed before there was any understanding of genetics at all.\n\n \n **\n Hi jo;\n \n Going by your various posts that I've read, I think that you are probably a person that I could like and whose opinions I could respect. But quite frankly, on the issue of darwinism and the way darwinists play sly games with the English language, corrupting trhe language to suit their ideology, you seem to have been very much duped by their semantic dishonesty.\n \n \"Genetic determinism\" and \"neo-darwinism\" are terms that, as a result of constant and perpetual darwinist equivocation are among those that no longer have one, single, and definite meaning among those that employ them. That is, you can never be sure what they mean when darwinists employ them.\n \n What do they mean when you use them?\n \n IAC, if 'genetic determinism' depends upon the linear chemical process of one gene maps to one protein [it is now known that this is not the case], then a 'theory' of evolution dependent upon phenotypic mutations determined by genotypic mutations is plausible, [not necessarily true, but plausible], even when the genotypic mutations are accidental/undirected/random. But such a \"theory\", [that is, a hypothesis whereby the origin/evolution of biological novelty and increased sytematic complexity and productivity is held to be directly and linearly and mechanically and deterministically traceable to accidental genetic alterations], becomes entirely implausible when you have \"multi-purpose genes\", and whole genomes self-organising their own genetic 'pieces'. Then phenotypic expression is not the sum, or anything like, the deterministic linear outcome of any given mutated gene, or collection of mutated genes, taken together. The entire fisherian notion of \"Random genetic mutation as the source of adaptive phenotypic traits\" goes straight down the tubes,-- just as it always should have done, from day one.\n \n But now you are back to where Darwin was, 150 years ago--he had no explanation for the ORIGINS of species. All he had was a mechanism [\"NS\"] for the numerical distribution [aka 'fitness'] of species. That \"theory\" can \"explain\" [well, not really :)] why some species are plentiful, while others are extinct, but it cannot and does not explain how they 'evolved' in the first place. It was because Darwin had this fact rubbed in his face by his contemporaries that he cribbed from Lamarck, and came up with a 'theory' of origins that he called, 'pangenesis'. And without \"RM\", latterday darwinists are in the same position neo-darwinists were in prior to fisherism's 'modern synthesis'. They have no mechanism for the origin of traits [evolution], but only one for the preservation and distribution of traits [inheritance, heretibility, conservation]. And a very nebulous 'mechanism' that is, anyway.\n \n Now you may be among those who conveniently forget or ignore the fact that \"NS\" does not, and cannot, account for evolution, i.e., the origins of species, but some of us refuse to do that, despite much pressure from darwinists. And we have been \"recalling\" that fact on a regular basis for 150+ years.", 
   {}, 
   272635, 
   null, 
   1183820280.0
  ], 
  [
   272707, 
   null, 
   "Jo Bennett", 
   "**\n Hi jo;\n \n Going by your various posts that I've read, I think that you are probably a person that I could like and whose opinions I could respect. But quite frankly, on the issue of darwinism and the way darwinists play sly games with the English language, corrupting trhe language to suit their ideology, you seem to have been very much duped by their semantic dishonesty.\n \n \"Genetic determinism\" and \"neo-darwinism\" are terms that, as a result of constant and perpetual darwinist equivocation are among those that no longer have one, single, and definite meaning among those that employ them. That is, you can never be sure what they mean when darwinists employ them.\n \n What do they mean when you use them?\n \n IAC, if 'genetic determinism' depends upon the linear chemical process of one gene maps to one protein [it is now known that this is not the case], then a 'theory' of evolution dependent upon phenotypic mutations determined by genotypic mutations is plausible, [not necessarily true, but plausible], even when the genotypic mutations are accidental/undirected/random. But such a \"theory\", [that is, a hypothesis whereby the origin/evolution of biological novelty and increased sytematic complexity and productivity is held to be directly and linearly and mechanically and deterministically traceable to accidental genetic alterations], becomes entirely implausible when you have \"multi-purpose genes\", and whole genomes self-organising their own genetic 'pieces'. Then phenotypic expression is not the sum, or anything like, the deterministic linear outcome of any given mutated gene, or collection of mutated genes, taken together. The entire fisherian notion of \"Random genetic mutation as the source of adaptive phenotypic traits\" goes straight down the tubes,-- just as it always should have done, from day one.\n \n But now you are back to where Darwin was, 150 years ago--he had no explanation for the ORIGINS of species. All he had was a mechanism [\"NS\"] for the numerical distribution [aka 'fitness'] of species. That \"theory\" can \"explain\" [well, not really :)] why some species are plentiful, while others are extinct, but it cannot and does not explain how they 'evolved' in the first place. It was because Darwin had this fact rubbed in his face by his contemporaries that he cribbed from Lamarck, and came up with a 'theory' of origins that he called, 'pangenesis'. And without \"RM\", latterday darwinists are in the same position neo-darwinists were in prior to fisherism's 'modern synthesis'. They have no mechanism for the origin of traits [evolution], but only one for the preservation and distribution of traits [inheritance, heretibility, conservation]. And a very nebulous 'mechanism' that is, anyway.\n \n Now you may be among those who conveniently forget or ignore the fact that \"NS\" does not, and cannot, account for evolution, i.e., the origins of species, but some of us refuse to do that, despite much pressure from darwinists. And we have been \"recalling\" that fact on a regular basis for 150+ years.\n\n \n Actually, multi-function genes make evolution more plausible, because it makes an argument from irreducible complexity totally unviable - any individually useless intermediate stages could have evolved by accident as a side effect of a mutation whose benefits were selected. There is not contradiction between genes having overlapping functions and there being a deterministic outcome. A rough analogy would be the 3 body problem in physics - there is a deterministic solution, but it is not necessarily available analytically, changes in any one of the three bodies causes changes in the others, which in turn feeds back to the first body. The 3 body problem is eminently open to modelling, and is entirely predictable (how do you think we got people to the moon?).", 
   {}, 
   272664, 
   null, 
   1183845000.0
  ], 
  [
   272715, 
   null, 
   "wascallywabbit", 
   "Actually, multi-function genes make evolution more plausible,\n\n \n **\n Yes, of course it does. But I was not talking about 'evolution', I was talking about darwinism, and its \"RMNS\" notion of what causes the fact6 of evolution. Apparently you have fallen for the darwinian deception of equivocating and conflating their notion of evolution's mechanism with evolution itself. In fairness it should be noted that creationists foster the same falsehood.\n \n In any case, where multi-function genes do make evolution ever more understandable [evolution is not 'plausible'--it is an established historical fact, except among those made insane by religion], they also render darwinism, (or more accurately, \"RMNS\", 'fisherism',after Ronald Fisher and crew, and sometimes called \"The Modern Synthesis\"), utterly implausible as the mechanism for evolution.\n \n \n\n because it makes an argument from irreducible complexity totally unviable - any individually useless intermediate stages could have evolved by accident as a side effect of a mutation whose benefits were selected.\n\n \n \n **\n I'm not sure what you are getting at, here. As I understand it, 'irreducible complexity' is concerned with the darwinist claim that accidental, spontaneous, unintentional increase in productive/adaptive systemic complexity is possible, plausible, and actual. If anything this modern understanding of genes and genomes makes the above darwinian/fisherian assumption totally untenable. What you are saying here makes no sense at all. \n \n \n\n There is not contradiction between genes having overlapping functions and there being a deterministic outcome.\n\n \n **\n The point is that we now know that the same gene may be expressed in two [or possibly more?]different organic outcomes is very much the definition of 'indeterminate'. So again what you are saying simply makes no sense, unless you are redefining mechanical determinism.\n \n \n\n A rough analogy would be the 3 body problem in physics - there is a deterministic solution, but it is not necessarily available analytically, changes in any one of the three bodies causes changes in the others, which in turn feeds back to the first body The 3 body problem is eminently open to modelling, and is entirely predictable (how do you think we got people to the moon?).\n\n \n **\n Uhm, I think we used rockets, but what do I know? IAC, here is an encapsulation of \"The Three Body Problem\". After reading it therough, please explain to us where you are able to relate it to a/the new understanding of genomic mechanics, and much more importantantly, b/the fisherian notion of evolution by RM+NS.\n \n \"Three-body problem\n For very little is known about the n-body problem. The case n=3 was most studied, for many results can be generalised to larger n. The first attempts to understand the 3-body problem were quantitative, aiming at finding explicit solutions.\n \n In 1767 Euler found the collinear periodic orbits, in which three bodies of any masses move such that they oscillate along a rotation line. \n In 1772 Lagrange discovered some periodic solutions which lie at the vertices of a rotating equilateral triangle that shrinks and expands periodically. Those solutions led to the study of central configurations , for which for some constant k<0 . \n The three-body problem is much more complicated; its solution can be chaotic. A major study of the Earth-Moon-Sun system was undertaken by Charles Delaunay, who published two volumes on the topic, each of 900 pages in length, in 1860 and 1867. Among many other accomplishments, the work already hints at chaos, and clearly demonstrates the problem of so-called \"small denominators\" in perturbation theory.\n \n \n The chaotic movement of 3 interacting particlesThe restricted three-body problem assumes that the mass of one of the bodies is negligible; the circular restricted three-body problem is the special case in which two of the bodies are in circular orbits (approximated by the Sun - Earth - Moon system). For a discussion of the case where the negligible body is a satellite of the body of lesser mass, see Hill sphere; for binary systems, see Roche lobe; for another stable system, see Lagrangian point.\n \n The restricted problem (both circular and elliptical) was worked on extensively by many famous mathematicians and physicists, notably Lagrange in the 18th century and Poincaré in at the end of the 19th century. Poincaré's work on the restricted three-body problem was the foundation of deterministic chaos theory. In the circular problem, there exist five equilibrium points. Three are collinear with the masses (in the rotating frame) and are unstable. The remaining two are located on the third vertex of both equilateral triangles of which the two bodies are the first and second vertices. This may be easier to visualize if one considers the more massive body (e.g., Sun) to be \"stationary\" in space, and the less massive body (e.g., Jupiter) to orbit around it, with the Lagrangian points maintaining the 60 degree-spacing ahead of and behind the less massive body in its orbit (although in reality neither of the bodies is truly stationary; they both orbit the center of mass of the whole system). For sufficiently small mass ratio of the primaries, these triangular equilibrium points are stable, such that (nearly) massless particles will orbit about these points as they orbit around the larger primary (Sun). The five equilibrium points of the circular problem are known as the Lagrange points.\" found at answers.com", 
   {}, 
   272707, 
   null, 
   1183850100.0
  ], 
  [
   272718, 
   null, 
   "Klown", 
   "WW, there is a slight problem with your arguments and the articles you gave to support them.\n \n Namely, that they are entirely unconnected.", 
   {}, 
   272715, 
   null, 
   1183852920.0
  ], 
  [
   272834, 
   null, 
   "Unriggable", 
   "What surprises me is how you find that even the smallest alteration in the theory is the same as a full-fledged debunkation. Let me remind you what the alternative is: Sky daddy decides to create life, not any kind of life but a malicious live, and conveniently delivers his word through an easily and conveniently mistranslatable manner.\n \n \nWW, there is a slight problem with your arguments and the articles you gave to support them.\n \n Namely, that they are entirely unconnected.\n\n \n QFT", 
   {}, 
   272718, 
   null, 
   1183954200.0
  ], 
  [
   272865, 
   null, 
   "Klown", 
   "QFT\n\n \n Sorry for the OT question but what does QFT mean? :)\n \n EDIT: Nevermind, found out on me own'. ;)", 
   {}, 
   272834, 
   null, 
   1183965660.0
  ], 
  [
   277402, 
   null, 
   "wascallywabbit", 
   "**\n Yet another boot--\n \n http://www.physorg.com/news105888062.html", 
   {}, 
   272865, 
   null, 
   1186696380.0
  ], 
  [
   277406, 
   null, 
   "chemist99a", 
   "**\n Yet another boot--\n \n http://www.physorg.com/news105888062.html\n\n \n If so its the old soft shoe yet again. That regulatory systems for genes play a part in evolution is precisely what NDS would predict. Why not genes for regulating other genes - suprise, suprise, suprise. The Darwinists are probably cowering in fear in their foxholes.", 
   {}, 
   277402, 
   null, 
   1186697280.0
  ], 
  [
   277450, 
   null, 
   "wascallywabbit", 
   "If so its the old soft shoe yet again. That regulatory systems for genes play a part in evolution is precisely what NDS would predict. Why not genes for regulating other genes - suprise, suprise, suprise. The Darwinists are probably cowering in fear in their foxholes.\n\n \n **\n Nah. There are no atheists in foxholes.", 
   {}, 
   277406, 
   null, 
   1186711080.0
  ], 
  [
   277490, 
   null, 
   "Peeling", 
   "As I understand it, 'irreducible complexity' is concerned with the darwinist claim that accidental, spontaneous, unintentional increase in productive/adaptive systemic complexity is possible, plausible, and actual. If anything this modern understanding of genes and genomes makes the above darwinian/fisherian assumption totally untenable. What you are saying here makes no sense at all.\n\n \n If I could take a moment to refresh your memory...\n \n In our discussions a while ago we talked in great detail about related matters, including gene-splicing and the detailed sequencing of adaptive mutations. You explicitly conceded that gene splicing proved that single genes can deterministically induce traits. You don't get to brush that fact under the carpet just because some traits emerge from the interactions of several genes.\n \n Furthermore, the detailed sequencing of adaptive mutations has shown many, many occasions where an atomic (indivisibly simple) change to the genome is responsible. We devoted pages to the subject. In extremis, your most telling response was:\n \n \nSo I see you pointing me at point mutations that seem both to be purely random and yet to mechanically, linearly, determine an adaptive organismic outcome. I know there's a 'trick' there, somewhere, but I cannot yet figure out what it is.\n\n \n In other words, logically and rationally you could perceive no error in my sources or argument; only your abhorrence for the cockeyed strawman of Darwinian 'philosophy' you entertain prevents you from accepting the possibility that unintentional random change can confer an advantage.\n \n At the point where our discussions left off, you were asserting that if a point mutation conferred an advantage in the current - or even a later - environment, it must have been intentional. In other words, the random energetic particles by which almost all organisms are bombarded, which we empirically know can induce point mutations, must, according to you, magically avoid ever accidentally inducing just those point mutations that could confer an advantage now, or at any unspecified later time. Those incoming UV rays can turn this G into an A, or this one or this one, because they disrupt the function of the gene or leave it unchanged, but this G has a shield that only Vitality can penetrate, because if it changes into an A the organism would gain an advantage.\n \n Oh, hang on, turning the first G into an A and switching off that gene would actually confer an advantage in certain environments, so we'd better put a shield around that nucleotide too.\n \n Pretty nasty of Vitality, knowing that a certain mutations would confer an advantage but deliberately preventing them from happening...", 
   {}, 
   277450, 
   null, 
   1186750560.0
  ], 
  [
   277533, 
   null, 
   "sinjin", 
   "**\n Nah. There are no atheists in foxholes.\nIn the film I saw recently Iwo Jima was riddled with them.", 
   {}, 
   277450, 
   null, 
   1186766460.0
  ], 
  [
   277536, 
   null, 
   "GiantOreo", 
   "**\n Nah. There are no atheists in foxholes.\n\n \n The fact that there are foxholes does not make much of a case for faith. emoticon_xgood", 
   {}, 
   277450, 
   null, 
   1186766880.0
  ], 
  [
   277541, 
   null, 
   "snakespit", 
   "And the thing is, if neo-darwinism dies, so does natural selection as its currently defined. No longer will natural selection play the role of creator, but merely a role of eliminator.......and the sad thing for evolutionists is, all the lifeforms around us could not have gotten here by elimination.\n\n \n Who actually agrues that natural selection \"creates\" anything? Certainly not someone who actually understands natural selection. The term \"selection\" should clue you in to the fact that it already had to be there in the first place.\n \n \nSomething needs to play the role of creator.....and mutations don't do it either because they only degrade what's already there. They create nothing.\n\n \n POLYDACTYLY?\n Polydactyly can occur by itself, or more commonly, as one feature of a syndrome of congenital anomalies. When it occurs by itself, it is associated with autosomal dominant mutations in single genes, i.e. it is not a multifactorial trait. But mutation in a variety of genes can give rise to polydactyly. Typically the mutated gene is involved in developmental patterning, and a syndrome of congenital anomalies results, of which polydactyly is one feature.", 
   {}, 
   272647, 
   null, 
   1186768500.0
  ], 
  [
   277607, 
   null, 
   "wascallywabbit", 
   "\n Quote:[ww]\n As I understand it, 'irreducible complexity' is concerned with the darwinist claim that accidental, spontaneous, unintentional increase in productive/adaptive systemic complexity is possible, plausible, and actual. If anything this modern understanding of genes and genomes makes the above darwinian/fisherian assumption totally untenable. What you are saying here makes no sense at all. \n \n [peeling]\n If I could take a moment to refresh your memory...\n\n \n **\n So you drop out of an ongoing debate that you are losing, disappear for months without a word, and then inject yourself back in by pompously proposing to refresh _my_ memory?! I see that your ego has been given a good, if undeserved, preening.\n \n \n \n In our discussions a while ago we talked in great detail about related matters, including gene-splicing and the detailed sequencing of adaptive mutations. You explicitly conceded that gene splicing proved that single genes can deterministically induce traits. You don't get to brush that fact under the carpet just because some traits emerge from the interactions of several genes.\n\n \n **\n Speaking of faulty memory, what you forget is that in the course of those discussions I pointed out to you that that which is systematic is NOT, in my words that you have just quoted, 'accidental, spontaneous, unintentional'. And yes I said that single point mutation, 1-<1 linear events, i.e., one gene change-<one trait change, could occur, by simple mechanical chemical action.\n What I did not say, and as you here falsely imply that I said, was that darwinian-style \"accidental, spontaneous, unintentional\" single gene, [ 'point'], mutations could do any such thing. What I did say, which you've obviously either forgotten, or wish to deceive the world concerning, is that such 'point mutations', whether in eubacteria, yeast, protists and such other very simple organisms as may be, are adaptive solely and only when they are produced SYSTEMATICALLY, as per an autopoietic systemic self-ordering mechanism. Meaning that your darwinian leap to an assumption of random, accidental, coincidental, undirected, ateleological causation wrt increase in productive/adaptive systemic complexity is still nothing but an article of faith in the darwinian religion.And when you heard that, that's when you immediately left town in hurry.\n \n \n\n Furthermore, the detailed sequencing of adaptive mutations has shown many, many occasions where an atomic (indivisibly simple) change to the genome is responsible.\n\n \n **\n Turning the drive wheel/s can move a car or even a train. Usually in the 'right' direction. That does not mean that that wheel turned 'by accident'.\n So---\n Show me, in any of your \"many occasions\", where an externally injected, but purely accidental [no intelligent design by biochemists, please],\n \"atomic\" mutagen made a natural molecular change in a genome; one that linked directly, 1-<1, mechanically, linearly, to an adaptive trait change in even the simplest asexually reproducing cell. I won't even ask about the complex remainder of the biosphere, in which this scenario would play no part at all.\n \n Remember, that any genetic mutation which does not involve an external mutagen transforming a passive genomic molecule is, but leads to an adaptive organismic trait mutation, is, unless and until proven otherwise, the result of a systematic, dynamic response by the organism/cell to the proximate stimulus which provokes it. Just like every other behaviour that we empirically observe in such organisms, every and any day of the week.\n \n \n\n We devoted pages to the subject. In extremis, your most telling response was:\n \n \n Quote:\n So I see you pointing me at point mutations that seem both to be purely random and yet to mechanically, linearly, determine an adaptive organismic outcome. I know there's a 'trick' there, somewhere, but I cannot yet figure out what it is. \n \n \n In other words, logically and rationally you could perceive no error in my sources or argument; only your abhorrence for the cockeyed strawman of Darwinian 'philosophy' you entertain prevents you from accepting the possibility that unintentional random change can confer an advantage.\n\n \n **\n You are quote-mining me. More deception and deliberate falsehood. You get more darwinist everyday, peeling. That admission (that I had not yet found the flaw in your argument) was shortly prior to my finding that flaw, which I soon did, (and which I have reiterated, above), causing you, apparently, to run away in frustration.\n \n \n\n At the point where our discussions left off, you were asserting that if a point mutation conferred an advantage in the current - or even a later - environment, it must have been intentional.\n\n \n **\n I have no recollection of making any such assertion. Before you tell the world that I said a certain thing, maybe you shoul.d quote my exact words, and tell us in which post in what thread they are to be found.\n \n Knowing myself and my hypothesis, I would never do a darwinists do, and claim that genertic mutations that are presently useless or mildy harmful at time of occurence could and are saved up, presciently, for a future occasion in which they will suddently turn out to be adaptive. That is strictly darwinist rubbish. EAM is always immediate and proximate and strictly 'in the present', although like any other biological mechanism, it has biosystem 'memory', and if an occurence has been repeated often enough in the evolutionary history of that organism, it may, and very often does, 'remember' past responses, and systematically 'recalls' them as needed. I have pointed this out to you many times, particularly wrt 'revertant' mutations.\n \n But as for the rest, I not only left off with my never-altered assertion that if \"a point mutation,[or any mutation-ww], conferred an advantage in the current [] environment, it must have been intentional\", but I repeat it, here and now. You have never yet managed to give me any unassailable reason to retract that assertion. I confidently believe that you never will be able to do so.\n \n \n\n In other words, the random energetic particles by which almost all organisms are bombarded, which we empirically know can induce point mutations, must, according to you, magically avoid ever accidentally inducing just those point mutations that could confer an advantage now, or at any unspecified later time.\n\n \n **\n I do not know what random particles \"must\" do. How you would know such a thing is beyond me! I do know what accidents \"must not\" do, and that is, over-ride the 'prime directive' of all things rational--\"Ex nihilo, ab nihilo, nihil fit\". So no, \"random energetic particles\" cannot, and do not, \"magically\", spontaneously generate \"an adavantage\", [i.e., novel adaptive productivity],\n in any complex biosystem, [i.e., organism/cell], \"now, or at any unspecified later time\". And I know that you have not a single shred of empirical evidence, despite your bluster, to show that that they do.\n \n \n\n Those incoming UV rays can turn this G into an A, or this one or this one, because they disrupt the function of the gene or leave it unchanged, but this G has a shield that only Vitality can penetrate, because if it changes into an A the organism would gain an advantage.\n \n Oh, hang on, turning the first G into an A and switching off that gene would actually confer an advantage in certain environments, so we'd better put a shield around that nucleotide too.\n \n Pretty nasty of Vitality, knowing that a certain mutations would confer an advantage but deliberately preventing them from happening...\n\n \n **\n This dreck is only the usual snide, sneeing, darwinist schoolboy posturing that we are all accustomed to hearing from you people. It is, in a word, infantile.\n \n OOOPS!! Now the unbiased mod/admin will erase my entire post!!\n \n --------------------------------------------------------------------------------", 
   {}, 
   277541, 
   null, 
   1186784220.0
  ], 
  [
   277637, 
   null, 
   "GiantOreo", 
   "[Mod Hat]\n Wascallywabbit, please refrain from using terms like \"usual snide, sneeing, darwinist schoolboy posturing\", and \"infantile\" in a description of your debate opponent. Not only does it not add anything positive or of substance to the debate, it is also against the rules:\n \n2) No Personal attacks, insults, name calling, offensive generalizations, or labeling. \n\n Thank you.[/Mod Hat]", 
   {}, 
   277607, 
   null, 
   1186791720.0
  ], 
  [
   277644, 
   null, 
   "wascallywabbit", 
   "[Mod Hat]\n Wascallywabbit, please refrain from using terms like \"usual snide, sneeing, darwinist schoolboy posturing\", and \"infantile\" in a description of your debate opponent. Not only does it not add anything positive or of substance to the debate, it is also against the rules:\n \n Thank you.[/Mod Hat]\n\n \n **\n So darwinists are allowed to make snide, sneering, infantile and puerile comment intended to mock me and my opinions, but I'm not aloud to draw attebntion to their antics? Except to report them, which accomplishes doodley-squat? OK. Now I know how this board operates. Thanks for the heads-up.", 
   {}, 
   277637, 
   null, 
   1186794360.0
  ], 
  [
   277646, 
   null, 
   "N.Wells", 
   " \nOriginally Posted by Jo Bennett \n I thought it had been known for some time that genes were multi-functional? \n[Response from SS]: it has been known for a long time -- it's just been surpressed because it contradicts genetic determinism and neo-darwinsm in general.\n SS shows that it's much easier to critique a scientific field when you are unaware of the details - that way you aren't encumbered by facts and can therefore enjoy a larger potential scope for your pronouncements. For example, that whole need-to-suppress claim would not be possible for someone who knows that the effect was long ago given its own name (\"pleiotropy\") and that it's been an active area of research for a long time. (Check terms like 'pleiotropic gene' on Pubmed.)\n \n \n \n[From WW] I was talking about darwinism, and its \"RMNS\" notion of what causes the fact of evolution\n And here we have yet another example of arguing by insisting on your own wrong version of reality. No actual biologists restrict evolutionary processes to RM&NS alone, but why let that ruin a good rant? To cite some examples, without recombination, changes that require multiple base pair substitutions can become less likely by many orders of magnitude. Sweepstakes colonization of an isolated habitat can create a distinctly different organism without a single new mutation or even any natural selection (genetic drift). Alleles can get fixed or lost without any contribution from natural selection or mutation (drift again). Recombination can provide brand new combinations of alleles and regulatory genes without any new mutations being involved.", 
   {}, 
   277607, 
   null, 
   1186795080.0
  ], 
  [
   278263, 
   null, 
   "SLP", 
   "**\n Nah. There are no atheists in foxholes.\n\n \n Of course there are.", 
   {}, 
   277450, 
   null, 
   1187110140.0
  ], 
  [
   278310, 
   null, 
   "chemist99a", 
   "**\n So darwinists are allowed to make snide, sneering, infantile and puerile comment intended to mock me and my opinions, but I'm not aloud to draw attebntion to their antics? Except to report them, which accomplishes doodley-squat? OK. Now I know how this board operates. Thanks for the heads-up.\n\n \n Humm: Perhaps you should take your experimental data into account in evaluating your hypothesis?", 
   {}, 
   277644, 
   null, 
   1187124300.0
  ], 
  [
   278318, 
   null, 
   "chemist99a", 
   "OK, I'm going to get a cup of coffee and then take this apart bit by bit.\n \n \n \n \n**\n Hi jo;\n\n \n \nGoing by your various posts that I've read, I think that you are probably a person that I could like and whose opinions I could respect. But quite frankly, on the issue of darwinism and the way darwinists play sly games with the English language, corrupting trhe language to suit their ideology, you seem to have been very much duped by their semantic dishonesty.\n\n \n Thats merely an accusation and requires no response as such - other than to say its not true.\n \n \n\"Genetic determinism\" and \"neo-darwinism\" are terms that, as a result of constant and perpetual darwinist equivocation are among those that no longer have one, single, and definite meaning among those that employ them. That is, you can never be sure what they mean when darwinists employ them.\n\n \n If you look into who uses the term \"genetic determinism\" you will find that its not evolutionary biologists. Its primarily people like yourself who aspire to be scientific critics of NDS. Same with \"neo-darwinism\" but not to quite the same extent. The New Darwinian Synthesis (NDS) is well characterized and its components understood within the field. That you cannot grasp it means only that you have not examined it in detail.\n \n \n \nWhat do they mean when you use them?\n\n \n Its obvious you do not actually have an answer to your question.\n \n \nIAC, if 'genetic determinism' depends upon the linear chemical process of one gene maps to one protein [it is now known that this is not the case], then a 'theory' of evolution dependent upon phenotypic mutations determined by genotypic mutations is plausible, [not necessarily true, but plausible], even when the genotypic mutations are accidental/undirected/random. \n\n \n If the assumption is true then NDS still works just fine. You got that part more or less correct. The evolutionary process requries only variability which can be inherited and differential selection on that population of variants.\n \n \nBut such a \"theory\", [that is, a hypothesis whereby the origin/evolution of biological novelty and increased sytematic complexity and productivity is held to be directly and linearly and mechanically and deterministically traceable to accidental genetic alterations], becomes entirely implausible when you have \"multi-purpose genes\", and whole genomes self-organising their own genetic 'pieces'. \n\n \n Nope the theory is perfectly applicable to \"multi purpose genes\" and even to genes which are highly interactive with other genes in produciing phenotypic variation. And of course genetic rearrangements leading to altered patterns of gene expression are just as much a source of variability as are point mutations. Indeed the core of NDS was developed well before point mutations were understood. Any heritable variability no matter the underlying mechanism is meat on the table so far as NDS is concerned.\n \n \nThen phenotypic expression is not the sum, or anything like, the deterministic linear outcome of any given mutated gene, or collection of mutated genes, taken together. The entire fisherian notion of \"Random genetic mutation as the source of adaptive phenotypic traits\" goes straight down the tubes,-- just as it always should have done, from day one.\n\n \n Linear additivity was never an assumption of NDS at least to my knowldedge. After all many genes are part of a chain of mechanisms which lead to the trait . Such systems are definitively not additive nor were they ever assumed to be. And random genetic variation with selection as a source of evolutionary change does NOT go down the tubes at all. All you need is heritable variability to work on, its source is not particulary relevant. \n \n \nBut now you are back to where Darwin was, 150 years ago--he had no explanation for the ORIGINS of species. All he had was a mechanism [\"NS\"] for the numerical distribution [aka 'fitness'] of species. That \"theory\" can \"explain\" [well, not really :)] why some species are plentiful, while others are extinct, but it cannot and does not explain how they 'evolved' in the first place.\n \n \n Darwin did in fact have an explanation for the origins of species. And his scheme has held up in practice for 150 years although it has been modified as we learned a great deal more about genetics and molecular biology! And you have to understand what he meant by \"Origins\" which you clearly do not. He did not mean to explain the Origins of life but rather how species arise from other species. This he did rather well - better than any of his predecessors and without invoking vitalism or any external \"director\" or any such similar mystical and untestable notion. And I would point out that the concept of variation, inheritance, and selection DOES provide an excellent basis for evolving new forms and even forms which can no longer freely interbreed (ie species). Its clear you fail to grasp this elementary fact. \n \n \nIt was because Darwin had this fact rubbed in his face by his contemporaries that he cribbed from Lamarck, and came up with a 'theory' of origins that he called, 'pangenesis'. And without \"RM\", latterday darwinists are in the same position neo-darwinists were in prior to fisherism's 'modern synthesis'. They have no mechanism for the origin of traits [evolution], but only one for the preservation and distribution of traits [inheritance, heretibility, conservation]. And a very nebulous 'mechanism' that is, anyway.\n\n \n Lets look at pangenesis for a second: WIKI sums it up nicely--\n \n \nPangenesis was Charles Darwin's hypothetical mechanism for heredity. He presented this 'provisional hypothesis' in his 1868 work The Variation of Animals and Plants Under Domestication and felt that it brought 'together a multitude of facts which are at present left disconnected by any efficient cause'. The etymology of the word comes from the Greek words pan (a prefix meaning \"whole\", \"encompassing\") and genesis (\"birth\") or genos (\"origin\").\n \n The idea itself is now seen as deeply flawed and not supported by observation, yet it represents Darwin's attempt to explain such diverse phenomena as\n \n * atavisms,\n * the intermediate nature of hybrids (blending inheritance),\n * Lamarckian use and disuse, and\n * limb regeneration.\n \n Simply put, the theory holds that body cells shed gemmules which collect in the reproductive organs prior to fertilization. Thus every cell in the body has a 'vote' in the constitution of the offspring. Atavisms arise due to the awaking of long-dormant gemmules while limbs regenerate due to the activation of gemmules from the missing limb which circulate in the main part of the body.\n \n In his later work, The Descent of Man, Darwin elaborated further on the model. In a section on the \"Laws of inheritance,\" Darwin specified that two elements in particular were most important: the transmission and the development of inherited characteristics. Darwin's insights were that characteristics could be transmitted which were not at the time of transmission actually being manifest in the parent organism, and that certain traits would manifest themselves at the same point of development (say, old age) in both the parent and child organisms. In order to make sense of his theory of sexual selection, he also stipulated that certain traits could be passed through organisms but would only develop depending on the sex of the organism in question.\n\n \n From which we learn only that Darwin did not have a valid theory of genetics. On the other hand all thats needed to explain evolution is the insight that traits ARE inherited - If you get the mechanism wrong then you get the mechanism wrong - but the process still works even so. And of course pangenesis is not a component of the NDS in any way whatsoever. And I might point out its not even what you claim for NDS! In other words its a non-issue at this time.\n \n \nNow you may be among those who conveniently forget or ignore the fact that \"NS\" does not, and cannot, account for evolution, i.e., the origins of species, but some of us refuse to do that, despite much pressure from darwinists. And we have been \"recalling\" that fact on a regular basis for 150+ years.\n\n \n And its clear that you are among those who cannot understand the basics. Its not natural selection alone that you must consider, you also have to consider the underlying variability and the effects of natural selection in an iterative cycle on where the centroid of that variability is! This is a matter of some curiosity since the basic math is easily grasped and the idea can be grasped in verbal terms alone - yet you still fail to understand - tis a pity.", 
   {}, 
   272664, 
   null, 
   1187126880.0
  ], 
  [
   278322, 
   null, 
   "chemist99a", 
   "Lets consider what WIKI says of genetic determinism. That is concordant with what I observe to be the view of biologists in general.\n \n \nDefinitions of genetic determinism vary. It is usually thought of as the belief that all physical and behavioural phenotypes are determined mostly or exclusively by the genes. This belief is sometimes attributed to biologists by the media or some in the social sciences, or attributed to proponents of evolutionary psychology, though in this sense many biologists would consider it a straw man.[2] Although there is considerable evidence that some behavioral traits in animals and humans are influenced by genetics to some extent, there is, however, no empirical support for the hypothesis that genes act unaffected by environmental factors, and virtually no modern-day geneticists would take a strong determinist stance in this regard.\n", 
   {}, 
   278318, 
   null, 
   1187127780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Genetic darwinism take another boot in the butt.", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10097-genetic-darwinism-take-another-boot-butt.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10097, 
  "discussion_files": [
   [
    "26841.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10097-genetic-darwinism-take-another-boot-butt-print.html"
   ], 
   [
    "26842.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10097-genetic-darwinism-take-another-boot-butt-3-print.html"
   ], 
   [
    "26843.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10097-genetic-darwinism-take-another-boot-butt-2-print.html"
   ]
  ], 
  "identifier": 10097
 }
]