[
 [
  [
   272385, 
   null, 
   "jyoshu", 
   "\"Organisers of the Live Earth concerts should not sell burgers or hot dogs at the high profile gigs, an animal rights group claimed today.\n \n Peta said that selling meat at a concert for the environment would be like selling cigarettes at an anti-cancer fundraiser because of the amount of greenhouse gas emitted by the meat farming industry.\n \n And Peta activists said that Wembley should take meat off the menu after a recent UN report found that the meat industry creates more greenhouse gases than all the cars, trucks, ships and planes in the world combined.\n \n Wembley Stadium is set to host the London Live Earth on Saturday, and will see acts including Madonna, the Red Hot Chili Peppers, Duran Duran, Damien Rice, James Blunt, Razorlight and the Pussycat Dolls perform to draw attention to global warming.\"\n http://www.lse.co.uk/ShowStory.asp?story=SX539337P&news_headline=wembley_urged_to_take_meat_off_live_earth_menu\n \n LOL, what a circus. This is the problem with hyper-environmentalism--it is ultimately self-defeating. (not to mention intrusive on freedoms.) I guess a real test of Live Earth sincerity would be if they'll say that jet fuel shouldn't be used in getting to the event for international travelers, or that automobiles shouldn't be used to get to London. :)", 
   {
    "post_info": {
     "post_title": "'Live Earth' ... 'No Meat'!"
    }
   }, 
   null, 
   null, 
   1183661160.0
  ], 
  [
   272396, 
   null, 
   "Master_Shake", 
   "So, it is bad to be consistent and follow through on your convictions. I see.", 
   {}, 
   272385, 
   null, 
   1183664700.0
  ], 
  [
   272399, 
   null, 
   "Jo Bennett", 
   "I thought jyoshu was implying that if you can't be perfect then you shouldn't bother at all.\n \n Peta do (unusually) make a valid point. Meat production is pretty wasteful when it comes to both land and energy use. As the global population expands, the only viable meat sources in Europe are likely to be hill farms, producing lamb and mutton - places where the land isn't up to growing crops. I expect the same will be true in borderline desert regions in the middle east and africa.", 
   {}, 
   272396, 
   null, 
   1183665540.0
  ], 
  [
   272409, 
   null, 
   "jyoshu", 
   "Actually it may be that PETA is right--it's not the first time I've heard the claim. But at some point we have to accept that some things are naturally going to take up more resources than others. Something is always going to fit that description, if meat stopped being consumed then something else would then be the biggest contributor.\n \n Anyway, if it's true that meat production is the greatest contributor to global warming, creating \"more greenhouse gases than all the cars, trucks, ships and planes in the world combined\", then the entire global warming environmentalist movement is completely going in the wrong direction, and has been for a long time. Shouldn't its main focus be vegetarianism? emoticon_wow", 
   {}, 
   272399, 
   null, 
   1183670100.0
  ], 
  [
   272410, 
   null, 
   "Jo Bennett", 
   "Actually it may be that PETA is right--it's not the first time I've heard the claim. But at some point we have to accept that some things are naturally going to take up more resources than others. Something is always going to fit that description, if meat stopped being consumed then something else would then be the biggest contributor.\n \n Anyway, if it's true that meat production is the greatest contributor to global warming, creating \"more greenhouse gases than all the cars, trucks, ships and planes in the world combined\", then the entire global warming environmentalist movement is completely going in the wrong direction, and has been for a long time. Shouldn't its main focus be vegetarianism? emoticon_wow\n\n \n Deforestation is already (a big) part of the focus of the environmental movement, and that is the major issue with meat production - rainforest in Brazil and other countries being cleared for cattle. Petrol derived fertilisers are another big issue, the use of which is already discouraged by environmentalists. Also, it's not a question of going in the wrong direction, reducing transport emissions will have a big impact.", 
   {}, 
   272409, 
   null, 
   1183670820.0
  ], 
  [
   272454, 
   null, 
   "Symbiote", 
   "Ironically deforestation would be less of a problem if the animals were kept in confined indoor batteries and pumped with antibiotics. So remember, when you buy free range, you're killing the planet.", 
   {}, 
   272410, 
   null, 
   1183690860.0
  ], 
  [
   272496, 
   null, 
   "Jo Bennett", 
   "Ironically deforestation would be less of a problem if the animals were kept in confined indoor batteries and pumped with antibiotics. So remember, when you buy free range, you're killing the planet.\n\n \n That rather depends on whether your free range animals are kept on cleared forest. The best quality free range meat is often from animals (e.g. pigs) that forage in woodland. It's true that the lowest carbon footprint is currently from battery chickens, but as in any situation you have to balance animal welfare and human health concerns against the climate impact.", 
   {}, 
   272454, 
   null, 
   1183714740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  'Live Earth' ... 'No Meat'!", 
  "url": "http://www.4forums.com/political/environmental-debates/10092-live-earth-no-meat.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 10092, 
  "discussion_files": [
   [
    "22544.html", 
    "http://www.4forums.com/political/environmental-debates/10092-live-earth-no-meat-print.html"
   ]
  ], 
  "identifier": 10092
 }
]