[
 [
  [
   272723, 
   null, 
   "samiinh", 
   "The Homosexual Lifestyle / Gay Lifestyle is:\n \n * Get up in the morning, moaning at the alarm clock.\n * Shower, dress, eat breakfast.\n * Go to work.\n * Complain about traffic. Work. Worry about the job getting outsourced to India.\n * Go home. Worry about gas prices.\n * Stop for groceries on the way once or twice a week.\n * Cook dinner. Realize there's no butter.\n * Eat dinner. Worry about blood pressure and cholesterol.\n * Do laundry. Try to figure out how to get that tomato stain out of that t-shirt.\n * Clean the house. Realize that a sock didn't make it into the laundry.\n * Pay bills. Worry about saving for retirement.\n * Watch a little TV, spend time with any family members in the house, talk with friends on the Internet.\n * Go to sleep.\n * Repeat.\n \n Decadent, isn't it?\n Gay and lesbian people live our lives like everyone else. We have jobs, bills, housework, and families like everyone else.", 
   {
    "post_info": {
     "post_title": "The Gay Agenda"
    }
   }, 
   null, 
   null, 
   1183859880.0
  ], 
  [
   272728, 
   null, 
   "smiley", 
   "2 things\n \n 1 - What has the alarm clock ever done to you?\n 2 - I thought 'your type' all knew how to get tomato stains out of a t-shirt.:) \n \n Carry on.", 
   {}, 
   272723, 
   null, 
   1183862820.0
  ], 
  [
   272731, 
   null, 
   "Archangel", 
   "Leave it to you to title a thread the gay agenda and then go on to describe the day in the life of a gay. Here's a clue samiinh, the lifestyle does not equal the agenda. And besides misleading thread titles, you guys can't even hold on to the only copy of your agenda as your copy boy lost it. Weird huh ? emoticon_smile emoticon_xgood See ? If we gave you guys the right to marry you'd probably lose that to. emoticon_rolleyes \n \n Gay Agenda Misplaced, Feared Lost\n \n The Human Rights Campaign (HRC), the nation's largest national gay, lesbian, bisexual and transgender political organization is facing harsh criticism from other gay rights groups over the apparent loss of the 2006 Gay Agenda.\n \n HRC spokesperson, Steven Fisher, broke the news yesterday at a press conference in New York. \"We had this year's final gay agenda drafted. We sent one of our interns to make copies, and he inadvertently left it on a crosstown bus on his way to Kinkos.\"\n \n The highly sensitive document, a political playbook of sorts for homosexual activists, was to be distributed to a select group of high-ranking gay rights leaders next month at the annual Lavender Law conference and Tea Dance.\n \n When asked why HRC kept no backup copies, Fisher went on the defensive. \"You can't have multiple copies of the Agenda just floating around. As in prior years, we maintained only one copy of the 2006 Agenda to make certain it didn't fall into the wrong hands. Obviously, conservative Christian groups would love to get an advance peek of what we're up to. Secrecy is vital! Our continued, successful assault on traditional family values depends on the element of surprise.\"\n \n Fisher closed yesterday's press conference with assurances that steps were being taken to rectify the situation. \"HRC takes full responsibility for the Agenda's loss. The intern has, of course, been shot. Also, we've made repeated calls to New York Transit Authority's Lost and Found department.\"\n \n But Fisher added that since the binder containing the Agenda has not been turned in as yet, \"we are appealing to the homosexual bus-riding community to be on the lookout for it. It's in a vinyl Hello Kitty Trapper Keeper. If anyone sees it, please contact HRC immediately.\"\n by Fake Gay News Staff 03/26/2006 :)", 
   {
    "unicode_changes_made": true
   }, 
   272723, 
   null, 
   1183863240.0
  ], 
  [
   272732, 
   null, 
   "Matthew S", 
   "Leave it to you to title a thread the gay agenda and then go on to describe the day in the life of a gay. Here's a clue samiinh, the lifestyle does not equal the agenda. And besides misleading thread titles, you guys can't even hold on to the only copy of your agenda as your copy boy lost it. Weird huh ? emoticon_smile emoticon_xgood See ? If we gave you guys the right to marry you'd probably lose that to. emoticon_rolleyes \n \n Gay Agenda Misplaced, Feared Lost\n \n The Human Rights Campaign (HRC), the nation&#8217;s largest national gay, lesbian, bisexual and transgender political organization is facing harsh criticism from other gay rights groups over the apparent loss of the 2006 Gay Agenda.\n \n HRC spokesperson, Steven Fisher, broke the news yesterday at a press conference in New York. &#8220;We had this year&#8217;s final gay agenda drafted. We sent one of our interns to make copies, and he inadvertently left it on a crosstown bus on his way to Kinkos.&#8221;\n \n The highly sensitive document, a political playbook of sorts for homosexual activists, was to be distributed to a select group of high-ranking gay rights leaders next month at the annual Lavender Law conference and Tea Dance.\n \n When asked why HRC kept no backup copies, Fisher went on the defensive. &#8220;You can&#8217;t have multiple copies of the Agenda just floating around. As in prior years, we maintained only one copy of the 2006 Agenda to make certain it didn&#8217;t fall into the wrong hands. Obviously, conservative Christian groups would love to get an advance peek of what we&#8217;re up to. Secrecy is vital! Our continued, successful assault on traditional family values depends on the element of surprise.&#8221;\n \n Fisher closed yesterday&#8217;s press conference with assurances that steps were being taken to rectify the situation. &#8220;HRC takes full responsibility for the Agenda&#8217;s loss. The intern has, of course, been shot. Also, we&#8217;ve made repeated calls to New York Transit Authority&#8217;s Lost and Found department.&#8221;\n \n But Fisher added that since the binder containing the Agenda has not been turned in as yet, &#8220;we are appealing to the homosexual bus-riding community to be on the lookout for it. It&#8217;s in a vinyl Hello Kitty Trapper Keeper. If anyone sees it, please contact HRC immediately.&#8221;\n by Fake Gay News Staff 03/26/2006 \n\n \n The real gay agenda and one that I support 1000000%\n http://www.fordham.edu/halsall/pwh/swift1.html\n \nby\n Michael Swift: \"Gay Revolutionary\"\n We shall sodomize your sons, emblems of your feeble masculinity, of your shallow dreams and vulgar lies. We shall seduce them in your schools, in your dormitories, in your gymnasiums, in your locker rooms, in your sports arenas, in your seminaries, in your youth groups, in your movie theater bathrooms, in your army bunkhouses, in your truck stops, in your all male clubs, in your houses of Congress, wherever men are with men together. Your sons shall become our minions and do our bidding. They will be recast in our image. They will come to crave and adore us. \n \n Women, you cry for freedom. You say you are no longer satisfied with men; they make you unhappy. We, connoisseurs of the masculine face, the masculine physique, shall take your men from you then. We will amuse them; we will instruct them; we will embrace them when they weep. Women, you say you wish to live with each other instead of with men. Then go and be with each other. We shall give your men pleasures they have never known because we are foremost men too, and only one man knows how to truly please another man; only one man can understand the depth and feeling, the mind and body of another man. \n \n All laws banning homosexual activity will be revoked. Instead, legislation shall be passed which engenders love between men. \n \n All homosexuals must stand together as brothers; we must be united artistically, philosophically, socially, politically and financially. We will triumph only when we present a common face to the vicious heterosexual enemy. \n \n If you dare to cry XXXXXX, fairy, XXXXX, at us, we will stab you in your cowardly hearts and defile your dead, puny bodies. \n \n We shall write poems of the love between men; we shall stage plays in which man openly caresses man; we shall make films about the love between heroic men which will replace the cheap, superficial, sentimental, insipid, juvenile, heterosexual infatuations presently dominating your cinema screens. We shall sculpt statues of beautiful young men, of bold athletes which will be placed in your parks, your squares, your plazas. The museums of the world will be filled only with paintings of graceful, naked lads. \n \n Our writers and artists will make love between men fashionable and de rigueur, and we will succeed because we are adept at setting styles. We will eliminate heterosexual liaisons through usage of the devices of wit and ridicule, devices which we are skilled in employing. \n \n We will unmask the powerful homosexuals who masquerade as heterosexuals. You will be shocked and frightened when you find that your presidents and their sons, your industrialists, your senators,your mayors, your generals, your athletes, your film stars, your television personalities, your civic leaders, your priests are not the safe, familiar, bourgeois, heterosexual figures you assumed them to be. We are everywhere; we have infiltrated your ranks. Be careful when you speak of homosexuals because we are always among you; we may be sitting across the desk from you; we may be sleeping in the same bed with you. \n \n There will be no compromises. We are not middle-class weaklings. Highly intelligent, we are the natural aristocrats of the human race, and steely-minded aristocrats never settle for less. Those who oppose us will be exiled. \n \n We shall raise vast private armies, as Mishima did, to defeat you. We shall conquer the world because warriors inspired by and banded together by homosexual love and honor are invincible as were the ancient Greek soldiers. \n \n The family unit-spawning ground of lies, betrayals, mediocrity, hypocrisy and violence--will be abolished. The family unit, which only dampens imagination and curbs free will, must be eliminated. Perfect boys will be conceived and grown in the genetic laboratory. They will be bonded together in communal setting, under the control and instruction of homosexual savants. \n \n All churches who condemn us will be closed. Our only gods are handsome young men. We adhere to a cult of beauty, moral and esthetic. All that is ugly and vulgar and banal will be annihilated. Since we are alienated from middle-class heterosexual conventions, we are free to live our lives according to the dictates of the pure imagination. For us too much is not enough. \n \n The exquisite society to emerge will be governed by an elite comprised of gay poets. One of the major requirements for a position of power in the new society of homoeroticism will be indulgence in the Greek passion. Any man contaminated with heterosexual lust will be automatically barred from a position of influence. All males who insist on remaining stupidly heterosexual will be tried in homosexual courts of justice and will become invisible men. \n \n \"We shall rewrite history, history filled and debased with your heterosexual lies and distortions. We shall portray the homosexuality of the great leaders and thinkers who have shaped the world. We will demonstrate that homosexuality and intelligence and imagination are inextricably linked, and that homosexuality is a requirement for true nobility, true beauty in a man. \n \n \"We shall be victorious because we are fueled with the ferocious bitterness of the oppressed who have been forced to play seemingly bit parts in your dumb, heterosexual shows throughout the ages. We too are capable of firing guns and manning the barricades of the ultimate revolution. \n \n Tremble, hetero swine, when we appear before you without our masks.\n \n \n\n \n If it means you loose your religious freedom, a choice and should not be constitutionally protected or given special rights, then so be it.", 
   {}, 
   272731, 
   null, 
   1183863720.0
  ], 
  [
   272734, 
   null, 
   "Archangel", 
   "by\n Michael Swift: \"Gay Revolutionary\"\n We shall sodomize your sons, emblems of your feeble masculinity, of your shallow dreams and vulgar lies. We shall seduce them in your schools, in your dormitories, in your gymnasiums, in your locker rooms, in your sports arenas, in your seminaries, in your youth groups, in your movie theater bathrooms, in your army bunkhouses, in your truck stops, in your all male clubs, in your houses of Congress, wherever men are with men together. Your sons shall become our minions and do our bidding. They will be recast in our image. They will come to crave and adore us. \n \n Women, you cry for freedom. You say you are no longer satisfied with men; they make you unhappy. We, connoisseurs of the masculine face, the masculine physique, shall take your men from you then. We will amuse them; we will instruct them; we will embrace them when they weep. Women, you say you wish to live with each other instead of with men. Then go and be with each other. We shall give your men pleasures they have never known because we are foremost men too, and only one man knows how to truly please another man; only one man can understand the depth and feeling, the mind and body of another man. \n \n All laws banning homosexual activity will be revoked. Instead, legislation shall be passed which engenders love between men. \n \n All homosexuals must stand together as brothers; we must be united artistically, philosophically, socially, politically and financially. We will triumph only when we present a common face to the vicious heterosexual enemy. \n \n If you dare to cry XXXXXX, fairy, XXXXX, at us, we will stab you in your cowardly hearts and defile your dead, puny bodies. \n \n We shall write poems of the love between men; we shall stage plays in which man openly caresses man; we shall make films about the love between heroic men which will replace the cheap, superficial, sentimental, insipid, juvenile, heterosexual infatuations presently dominating your cinema screens. We shall sculpt statues of beautiful young men, of bold athletes which will be placed in your parks, your squares, your plazas. The museums of the world will be filled only with paintings of graceful, naked lads. \n \n Our writers and artists will make love between men fashionable and de rigueur, and we will succeed because we are adept at setting styles. We will eliminate heterosexual liaisons through usage of the devices of wit and ridicule, devices which we are skilled in employing. \n \n We will unmask the powerful homosexuals who masquerade as heterosexuals. You will be shocked and frightened when you find that your presidents and their sons, your industrialists, your senators,your mayors, your generals, your athletes, your film stars, your television personalities, your civic leaders, your priests are not the safe, familiar, bourgeois, heterosexual figures you assumed them to be. We are everywhere; we have infiltrated your ranks. Be careful when you speak of homosexuals because we are always among you; we may be sitting across the desk from you; we may be sleeping in the same bed with you. \n \n There will be no compromises. We are not middle-class weaklings. Highly intelligent, we are the natural aristocrats of the human race, and steely-minded aristocrats never settle for less. Those who oppose us will be exiled. \n \n We shall raise vast private armies, as Mishima did, to defeat you. We shall conquer the world because warriors inspired by and banded together by homosexual love and honor are invincible as were the ancient Greek soldiers. \n \n The family unit-spawning ground of lies, betrayals, mediocrity, hypocrisy and violence--will be abolished. The family unit, which only dampens imagination and curbs free will, must be eliminated. Perfect boys will be conceived and grown in the genetic laboratory. They will be bonded together in communal setting, under the control and instruction of homosexual savants. \n \n All churches who condemn us will be closed. Our only gods are handsome young men. We adhere to a cult of beauty, moral and esthetic. All that is ugly and vulgar and banal will be annihilated. Since we are alienated from middle-class heterosexual conventions, we are free to live our lives according to the dictates of the pure imagination. For us too much is not enough. \n \n The exquisite society to emerge will be governed by an elite comprised of gay poets. One of the major requirements for a position of power in the new society of homoeroticism will be indulgence in the Greek passion. Any man contaminated with heterosexual lust will be automatically barred from a position of influence. All males who insist on remaining stupidly heterosexual will be tried in homosexual courts of justice and will become invisible men. \n \n \"We shall rewrite history, history filled and debased with your heterosexual lies and distortions. We shall portray the homosexuality of the great leaders and thinkers who have shaped the world. We will demonstrate that homosexuality and intelligence and imagination are inextricably linked, and that homosexuality is a requirement for true nobility, true beauty in a man. \n \n \"We shall be victorious because we are fueled with the ferocious bitterness of the oppressed who have been forced to play seemingly bit parts in your dumb, heterosexual shows throughout the ages. We too are capable of firing guns and manning the barricades of the ultimate revolution. \n \n\n \n You're absolutely right Matthew, mine was far to humorous where as yours is much truer to form and reflects the true nature of the radical gay agenda. Thanks for revealing the true beast that lies within your little subculture.", 
   {}, 
   272732, 
   null, 
   1183864380.0
  ], 
  [
   272736, 
   null, 
   "smiley", 
   "You're absolutely right Matthew, mine was far to humorous where as yours is much truer to form and reflects the true nature of the radical gay agenda. Thanks for revealing the true beast that lies within your little subculture.\n\n \n That's strange. I didn't see Matthew S say anything like that. It would appear that you are misinterpretting him, Archie. What dya know? I thought you were above that sort of thing.", 
   {}, 
   272734, 
   null, 
   1183866840.0
  ], 
  [
   272737, 
   null, 
   "Matthew S", 
   "You're absolutely right Matthew, mine was far to humorous where as yours is much truer to form and reflects the true nature of the radical gay agenda. Thanks for revealing the true beast that lies within your little subculture.\n\n \n Your side started this war. Your side isn't willing to just let us live our lives. Your side must make laws that restrict our freedom. Your side disrespects our families, our lives, our rights , and our very being. If it is war you want then I say, in the words or your hero, \"BRING IT ON\" we will fight you.", 
   {}, 
   272734, 
   null, 
   1183866960.0
  ], 
  [
   272741, 
   null, 
   "Archangel", 
   "That's strange. I didn't see Matthew S say anything like that. It would appear that you are misinterpretting him, Archie. What dya know? I thought you were above that sort of thing.\n\n \n What's your major malfunction smiley ? I posted a humorous, funny article about the gay agenda and Matthew posted one reflecting a hateful, vindictive and threatening article that showed a venomous hatred for the Society and the people gays inhabit it with. And I didn't say Matthew SAID anything. I referred to my article and yours/his article. Are you completely unable to comprehend plain english ? see, read my response again...\n \n \n \n You're absolutely right Matthew, mine was far to humorous where as yours is much truer to form and reflects the true nature of the radical gay agenda. Thanks for revealing the true beast that lies within your little subculture.\n\n \n Now where do I say that Matthew personally said anything here ? His article did his talking and he admitted that it represents his true feelings. So he has openly admitted that he is a hate filled sociopathic degenerate who hates his Country, its Culture and the people he shares it with. Why would you possibly question my agenda after he posts such a disturbing article ? What is wrong with you that you wouldn't question what lies in Matthews heart to post something so disturbing. And then to basically declare war on America with his response to my post.", 
   {}, 
   272736, 
   null, 
   1183870800.0
  ], 
  [
   272762, 
   null, 
   "Matthew S", 
   "What's your major malfunction smiley ? I posted a humorous, funny article about the gay agenda and Matthew posted one reflecting a hateful, vindictive and threatening article that showed a venomous hatred for the Society and the people gays inhabit it with. And I didn't say Matthew SAID anything. I referred to my article and yours/his article. Are you completely unable to comprehend plain english ? see, read my response again...\n \n \n \n Now wear do I say that Matthew personally said anything here ? His article did his talking and he admitted that it represents his true feelings. So he has openly admitted that he is a hate filled sociopathic degenerate who hates his Country, its Culture and the people he shares it with. Why would you possibly question my agenda after he posts such a disturbing article ? What is wrong with you that you wouldn't question what lies in Matthews heart to post something so disturbing. And then to basically declare war on America with his response to my post.\n\n \n \n See we come to it. You feel your values, your life, your beliefs are the only ones that are trully american and anything that disagrees with them is declaring war on america. I am anrgry and mad as hell an I am not going to take it anymore. That agenda is a repersentation of that anger. You have an agenda also, as do most fundies, to make this a christian nation. Do away with deversity, force fundie laws down our throats, do away with our freedom to express ourselves, choose who we associate with, and who we love. As with most fundies you don't want to admit it. It is you and your fundie kind that has declared war upon america not us.\n \n Then again you believe the hate filled book of leviticus is the word of God, which commands you to kill people, is moral.", 
   {}, 
   272741, 
   null, 
   1183899240.0
  ], 
  [
   272763, 
   null, 
   "samiinh", 
   "It seems it always returns to the evil ancient man-made religion and its god/man and its profits. The bible is filled with hate and evil.", 
   {}, 
   272762, 
   null, 
   1183900260.0
  ], 
  [
   274349, 
   null, 
   "Green Knight", 
   "So what if the gays get up in the morning and have the same routine as everyone else? Is that the issue? Is not the issue whether or not their sexual actions are acceptable and allowable??? Everyone has the right to live and many things are necessary for life, i.e. eating, sleeping, etc. but does the right to life also include the right to do everything that a man's heart desires?", 
   {
    "post_info": {
     "post_title": "Is that the issue?"
    }
   }, 
   272763, 
   null, 
   1184809140.0
  ], 
  [
   274350, 
   null, 
   "MrWriteLA", 
   "does the right to life also include the right to do everything that a man's heart desires?\n I think it's called \"the pursuit of happiness.\" If it doesn't negatively impact anyone else, why the hell not?", 
   {}, 
   274349, 
   null, 
   1184809620.0
  ], 
  [
   274351, 
   null, 
   "robbie0517", 
   "So what if the gays get up in the morning and have the same routine as everyone else? Is that the issue? Is not the issue whether or not their sexual actions are acceptable and allowable??? Everyone has the right to live and many things are necessary for life, i.e. eating, sleeping, etc. but does the right to life also include the right to do everything that a man's heart desires?\n\n \n You certainly have the right to be who you are without judgement as long as you are doing no one harm. Depriving someone of something as innate as their sexual orientation is very immoral.", 
   {}, 
   274349, 
   null, 
   1184809680.0
  ], 
  [
   274356, 
   null, 
   "thelmoose", 
   "So what if the gays get up in the morning and have the same routine as everyone else? Is that the issue? Is not the issue whether or not their sexual actions are acceptable and allowable??? Everyone has the right to live and many things are necessary for life, i.e. eating, sleeping, etc. but does the right to life also include the right to do everything that a man's heart desires?\n\n \n Getting up in the morning, having the same routine as everyone is exactly the issue. One of those routine things is having sex now and then with an adult in a consensual manner. Is this not part of life? That ought to be \"acceptable and allowable\" for everyone, should it not?\n \n No one is asking for the right to \"do everything that a man's heart desires\", but merely to do those things that every man in his heart desires that is a part of living.", 
   {}, 
   274349, 
   null, 
   1184811600.0
  ], 
  [
   274381, 
   null, 
   "Symbiote", 
   "You certainly have the right to be who you are without judgement \n\n \n Not \"without judgement\", without legal sanction, you can't police peoples' thoughts to make sure they are thinking well of you.", 
   {}, 
   274356, 
   null, 
   1184817900.0
  ], 
  [
   274385, 
   null, 
   "robbie0517", 
   "Not \"without judgement\", without legal sanction, you can't police peoples' thoughts to make sure they are thinking well of you.\n\n \n I can live with that. However, there seems to be many a christian that's judging gays when their bible clearly tells them they shouldn't. I guess their just one of those \"cafeteria christians\" I hear so much about.", 
   {}, 
   274381, 
   null, 
   1184818260.0
  ], 
  [
   274418, 
   null, 
   "Archangel", 
   "One major aspect of the Gay Agenda is to indoctrinate our young children to accept homosexuality as normal and right and has been proven on another thread in this forum with evidence of that indoctrination taking place in American Schools TODAY.", 
   {}, 
   274385, 
   null, 
   1184852220.0
  ], 
  [
   274419, 
   null, 
   "Jo Bennett", 
   "One major aspect of the Gay Agenda is to indoctrinate our young children to accept homosexuality as normal and right and has been proven on another thread in this forum with evidence of that indoctrination taking place in American Schools TODAY.\n\n \n One major aspect of the Fundamentalist Agenda is to indoctrinate our young children to accept Fundamentalism as normal and right...", 
   {}, 
   274418, 
   null, 
   1184854320.0
  ], 
  [
   274420, 
   null, 
   "samiinh", 
   "One major aspect of the Fundamentalist Agenda is to indoctrinate our young children to accept Fundamentalism as normal and right...\n\n \n It has been going on for generations. And we have generations of brainwashed nincompoops living in this country because of this indoctrination.", 
   {}, 
   274419, 
   null, 
   1184854440.0
  ], 
  [
   274451, 
   null, 
   "Matthew S", 
   "One major aspect of the Gay Agenda is to indoctrinate our young children to accept homosexuality as normal and right and has been proven on another thread in this forum with evidence of that indoctrination taking place in American Schools TODAY.\n\n \n And this is a bad thing?\n \n I say more power to them.", 
   {}, 
   274418, 
   null, 
   1184866260.0
  ], 
  [
   274456, 
   null, 
   "samiinh", 
   "And this is a bad thing?\n \n I say more power to them.\n\n \n Actually, AA is using hyperbole again. It was one school, a private Quaker school, in liberal MA. Let's see if he can show us another school, say, in Mississippi or Texas even that has a similar program.", 
   {}, 
   274451, 
   null, 
   1184867160.0
  ], 
  [
   274459, 
   null, 
   "Aivlis", 
   "Sometimes it really disturbs me when someone like Arch says \"if we let you get married blah blah\"...who is we? Christians? What makes you think that you have the right to make decisions for other people, does your bible say that is okay? How is this fair? Really, tell me how it is just for Christians to prevent others from marrying who they please.\n \n Arch, you say that you disagree with the indoctrination of young children into believing that homosexuality is okay but do you really think that it is your right to discriminate against others in such a way as to deeply impact their life.\n \n I can't believe the audacity of some Americans. This country claims to be free without prejudice and discrimination. How can people pat themselves on the back about living in a free country when our fellow countrymen are being told that they are horrible and disgusting people for something as private as their sexual orientation. It is none of your business. I don't agree with the radicals on their side any more than the radicals on your side. I only think that it is morally wrong to prevent these people from marrying and living happy, fulfilled lives.", 
   {}, 
   274456, 
   null, 
   1184869200.0
  ], 
  [
   274560, 
   null, 
   "Matthew S", 
   "Yeah, it makes so much more sense to teach them that it's OK to plug their buddy's butt instead. emoticon_rolleyes\n\n \n And this is a bad thing?", 
   {}, 
   274420, 
   null, 
   1184899560.0
  ], 
  [
   274562, 
   null, 
   "robbie0517", 
   "Yeah, it makes so much more sense to teach them that it's OK to plug their buddy's butt instead. emoticon_rolleyes\n\n \n A large portion of heteros seem to think its ok to plug their wife/girlfriends butt, so I guess it would be no different now would it emoticon_xgood", 
   {}, 
   274420, 
   null, 
   1184899620.0
  ], 
  [
   274581, 
   null, 
   "JakeCJB", 
   "One major aspect of the Gay Agenda is to indoctrinate our young children to accept homosexuality as normal and right and has been proven on another thread in this forum with evidence of that indoctrination taking place in American Schools TODAY.\n\n \n Yes, we want to teach acceptance of homosexuality. What is your issue with that?", 
   {}, 
   274418, 
   null, 
   1184914140.0
  ], 
  [
   274582, 
   null, 
   "JakeCJB", 
   "Yeah, it makes so much more sense to teach them that it's OK to plug their buddy's butt instead. emoticon_rolleyes\n\n \n Yeah, they should only teach the sexual positions the Pope would approve of.", 
   {}, 
   274420, 
   null, 
   1184915220.0
  ], 
  [
   274635, 
   null, 
   "JPSartre12", 
   "A large portion of heteros seem to think its ok to plug their wife/girlfriends butt, so I guess it would be no different now would it emoticon_xgood\n\n \n Personally, I see a Big difference. emoticon_wow", 
   {}, 
   274562, 
   null, 
   1184955480.0
  ], 
  [
   274636, 
   null, 
   "JPSartre12", 
   "Obviously, you are one of those brainwashed dildos.\n\n \n And, obviously, you're one of those anal orifices. :)", 
   {}, 
   274420, 
   null, 
   1184955540.0
  ], 
  [
   274644, 
   null, 
   "thelmoose", 
   "Yeah, it makes so much more sense to teach them that it's OK to plug their buddy's butt instead. emoticon_rolleyes\n\n \n \nObviously, you are one of those brainwashed dildos.\n\n \n \nAnd, obviously, you're one of those anal orifices. :)\n\n \n Finally, we are having a discussion on an adult level! It is so refreshing!\n Neener, neener!", 
   {}, 
   274636, 
   null, 
   1184959380.0
  ], 
  [
   274646, 
   null, 
   "JPSartre12", 
   "Finally, we are having a discussion on an adult level! It is so refreshing!\n Neener, neener!\n\n \n I had to respond with something that he was capable of comprehending. emoticon_xangel", 
   {}, 
   274644, 
   null, 
   1184960040.0
  ], 
  [
   274647, 
   null, 
   "jim's trucking", 
   "Yeah, it makes so much more sense to teach them that it's OK to plug their buddy's butt instead. emoticon_rolleyes\n\n \n \nAnd this is a bad thing?\nUnnatural.\n \n \nA large portion of heteros seem to think its ok to plug their wife/girlfriends butt, so I guess it would be no different now would it emoticon_xgood\nStill unnatural, abnormal, deviant, hedonistic behavior. (If it feels good...do it!)\n \n Thermometers, proctoscopes, doctor's exploratory digits, enema delivery tubes and suppository medicines are legitimate intruders of the colon. Penises are not.\n \n Check out the human body and ponder what functions all the various parts are intended to perform. Anal sex is a deviant behavior, whether you are gay or not.", 
   {}, 
   274562, 
   null, 
   1184960520.0
  ], 
  [
   274650, 
   null, 
   "JimStPete", 
   "Unnatural.\n \n Still unnatural, abnormal, deviant, hedonistic behavior. (If it feels good...do it!)\n \n Thermometers, proctoscopes, doctor's exploratory digits, enema delivery tubes and suppository medicines are legitimate intruders of the colon. Penises are not.\n \n Check out the human body and ponder what functions all the various parts are intended to perform. Anal sex is a deviant behavior, whether you are gay or not.\n\n \n Yeah, and your an adulterer/fornicator/divorcee (boy, this judging thing is fun!!). You have no right to judge anyone.", 
   {}, 
   274647, 
   null, 
   1184961060.0
  ], 
  [
   274651, 
   null, 
   "thelmoose", 
   "Check out the human body and ponder what functions all the various parts are intended to perform. Anal sex is a deviant behavior, whether you are gay or not.\n\n \n You need to look up two things:\n 1. The proportion of couples that engage in that practice.\n 2. The definition of deviant.\n \n Celibacy is more deviant than anal sex.", 
   {}, 
   274647, 
   null, 
   1184961120.0
  ], 
  [
   274657, 
   null, 
   "samiinh", 
   "Unnatural.\n \n Still unnatural, abnormal, deviant, hedonistic behavior. (If it feels good...do it!)\n \n Thermometers, proctoscopes, doctor's exploratory digits, enema delivery tubes and suppository medicines are legitimate intruders of the colon. Penises are not.\n \n Check out the human body and ponder what functions all the various parts are intended to perform. Anal sex is a deviant behavior, whether you are gay or not.\n\n \n Maybe you should try it sometime and maybe you'll like it. Like they say, \"don't knock it 'til y've tried it.\" The mid-night guys in the White House apparently do.", 
   {}, 
   274647, 
   null, 
   1184962320.0
  ], 
  [
   274658, 
   null, 
   "jim's trucking", 
   "\n Michael Swift: \"Gay Revolutionary\"\n We shall sodomize your sons, emblems of your feeble masculinity, of your shallow dreams and vulgar lies. We shall seduce them in your schools, in your dormitories, in your gymnasiums, in your locker rooms, in your sports arenas, in your seminaries, in your youth groups, in your movie theater bathrooms, in your army bunkhouses, in your truck stops, in your all male clubs, in your houses of Congress, wherever men are with men together. Your sons shall become our minions and do our bidding. They will be recast in our image. They will come to crave and adore us. \nAre gays born gay or recruited in locker rooms by deviant men looking for like-acting company and some false sense of legitimacy?\n \n You and many others argue that you just can't help being gay because you were born gay...then you post what is likely the practiced method of enlarging the flock you're in...proselytizing by tempting malleable minds with deviant pleasure.\n \n I know some people who were obviously born gay (lesbian) and they truly cannot change their orientation. I'm guessing the percentage of the entire gay population is 5 to 10 percent naturally gay. Those who chose to be gay or were seduced by others who chose to be gay are just sick puppies in need of reprogramming.", 
   {
    "post_info": {
     "post_title": "Which is it, Matthew?"
    }
   }, 
   274647, 
   null, 
   1184962440.0
  ], 
  [
   274661, 
   null, 
   "jim's trucking", 
   "Yeah, and your an adulterer/fornicator/divorcee (boy, this judging thing is fun!!). You have no right to judge anyone.\nThis has nothing to do with infidelity. It has to do with intended functions of body parts...and if you met the woman that seduced me into unfaithfulness, you'd likely turn straight just to have a go at her.\n \n Whether you're being faithful or not, anal sex is deviant behavior. Based upon the patently obvious intended functions of body parts, this is not judgemental.\n \n Anal sex and unfaithfulness both come as a result of weakness. I am weak...but I ain't that weak!", 
   {}, 
   274650, 
   null, 
   1184963160.0
  ], 
  [
   274663, 
   null, 
   "samiinh", 
   "Are gays born gay or recruited in locker rooms by deviant men looking for like-acting company and some false sense of legitimacy?\n \n You and many others argue that you just can't help being gay because you were born gay...then you post what is likely the practiced method of enlarging the flock you're in...proselytizing by tempting malleable minds with deviant pleasure.\n \n I know some people who were obviously born gay (lesbian) and they truly cannot change their orientation. I'm guessing the percentage of the entire gay population is 5 to 10 percent naturally gay. Those who chose to be gay or were seduced by others who chose to be gay are just sick puppies in need of reprogramming.\n\n \n You really need to read the whole \"agenda\" to understand that this guy was trying to be so obnoxious as to be ridiculous, but taken out of context, it becomes something else that the rightwing has used to lie about gay people. And you have been had too, it would appear, if you truly believe this ####.", 
   {}, 
   274658, 
   null, 
   1184964000.0
  ], 
  [
   274664, 
   null, 
   "jim's trucking", 
   "You need to look up two things:\n 1. The proportion of couples that engage in that practice.\n 2. The definition of deviant.\n \n \nIf ALL couples engaged in it, it would still be deviant.\n \n deviant: deviating esp. from an accepted norm\n \n Now, if you convince me that our body's design, whether created by God or whatever you believe controlled our development into homo sapiens, includes the intent to have the penis inserted in the arse of another homo sapien, I'll listen to more of your argument.\n \n \nCelibacy is more deviant than anal sex.\nAgreed. This is the basis of the main problem with the Catholic Church. Pompous, self-righteous denial of sex to clergy creates horny preists and nuns who crave orgasm naturally...just like the rest of us homo sapiens...and it feels better when someone else 'helps' you.\n \n So who do the preists pick?..malleable young boys who fear God (represented by 'Father' Jones in a gilded robe). That way they leave the nuns to each other (and young girls) and have their own 'silent' partners.\n \n Yes, I agree...abstinance is deviant behavior....more so than anal sex. Both, however deviant from the norm.", 
   {}, 
   274651, 
   null, 
   1184964360.0
  ], 
  [
   274665, 
   null, 
   "jim's trucking", 
   "You really need to read the whole \"agenda\" to understand that this guy was trying to be so obnoxious as to be ridiculous, but taken out of context, it becomes something else that the rightwing has used to lie about gay people. And you have been had too, it would appear, if you truly believe this ####.\nAre you denying that such proselytizing takes place?", 
   {}, 
   274663, 
   null, 
   1184964480.0
  ], 
  [
   274668, 
   null, 
   "jim's trucking", 
   "Maybe you should try it sometime and maybe you'll like it. Like they say, \"don't knock it 'til y've tried it.\" The mid-night guys in the White House apparently do.\nAn example of proselytizing gayness. Are you too saying that it's not a 'born with' trait?\n \n If I reach the age of 80, I may try it once...and if I like it, I'll shoot myself!", 
   {}, 
   274657, 
   null, 
   1184964720.0
  ], 
  [
   274673, 
   null, 
   "samiinh", 
   "An example of proselytizing gayness. Are you too saying that it's not a 'born with' trait?\n \n If I reach the age of 80, I may try it once...and if I like it, I'll shoot myself!\n\n \n LOL, JT. Thanks for the afternoon laugh.", 
   {}, 
   274668, 
   null, 
   1184966280.0
  ], 
  [
   274674, 
   null, 
   "Waxy", 
   "If ALL couples engaged in it, it would still be deviant.\n \n deviant: deviating esp. from an accepted norm\n\n \n Did you read what you typed here?\n \n If ALL couples engaged in it, how could it not be considered \"an acceptable norm\". emoticon_confused \n \n How do you reconcile these? Bizarre, especially coming from someone who's normally so \"anal\" about such things.\n \n \nNow, if you convince me that our body's design, whether created by God or whatever you believe controlled our development into homo sapiens, includes the intent to have the penis inserted in the arse of another homo sapien, I'll listen to more of your argument.\n\n \n \"God\" created your body to be able to perceive pleasure. \"God\" made sex (including anal sex) pleasureable for humans and humans have the ability to engage in sexual activity at essentially any time and for any reason.\n \n If anal sex provides pleasure, how can it not be natural, how is it deviant?\n \n If humans were not wired to received pleasure from sex, you might have a leg to stand on. In that case, humans would only engage in sexual activites for the purpose of sexual reproduction.\n \n That's clearly not the case, so as much as you'd like the law of jim's trucking to be the law of reality, it ain't.\n \n Waxy\n \n P.S. Please feel free to define the \"norm\", especially as it pertains to human sexuality as a whole. You'll need to provide support for the definition beyond your personal opinion of course...", 
   {}, 
   274664, 
   null, 
   1184966520.0
  ], 
  [
   274676, 
   null, 
   "thelmoose", 
   "If ALL couples engaged in it, it would still be deviant.\n \n deviant: deviating esp. from an accepted norm\n \n \n\n \n You looked up \"deviant\". Now you need to look up \"norm\".\n If all couples engaged in it, by definition it most certainly would not be deviant.\n Humans do all sorts of things with their bodies, sexually and otherwise, that we weren't designed for. Dancers, athletes, and acrobats do some very deviant things. Running a marathon or climbing a mountain is using the body for things it wasn't designed for. They are deviants. Every marathon runner I know feels terrible for days and weeks after because of damage done to his body. That is deviant. \n \n You are equating deviant with bad. \n You are saying using our bodies creatively is bad. \n It is clear you are disgusted by anal sex. There are many sexual practices (that may or may not include anal sex) that I find disgusting, and guess what? I don't do them.\n You need to understand that their is a BROAD spectrum of sexual behavior out there and most people are doin' it (even in Stockbridge.)", 
   {}, 
   274664, 
   null, 
   1184966640.0
  ], 
  [
   274678, 
   null, 
   "thelmoose", 
   "Are gays born gay or recruited in locker rooms by deviant men looking for like-acting company and some false sense of legitimacy?\n \n You and many others argue that you just can't help being gay because you were born gay...then you post what is likely the practiced method of enlarging the flock you're in...proselytizing by tempting malleable minds with deviant pleasure.\n \n I know some people who were obviously born gay (lesbian) and they truly cannot change their orientation. I'm guessing the percentage of the entire gay population is 5 to 10 percent naturally gay. Those who chose to be gay or were seduced by others who chose to be gay are just sick puppies in need of reprogramming.\n\n \n That quote you posted was taking some literary license. You interpreted it literally apparently.\n Barring those criminals who attempt non-consensual sex:\n There is no recruitment.\n There is no proselytizing.\n There is no choosing. \n There is no seduction. \n \n You do not seem to understand this basic phenomenon of sexual orientation. You have one. Everybody has one.", 
   {}, 
   274658, 
   null, 
   1184967060.0
  ], 
  [
   274682, 
   null, 
   "jim's trucking", 
   "Did you read what you typed here?\nSeveral times.\n \n \n\n If ALL couples engaged in it, how could it not be considered \"an acceptable norm\". emoticon_confused \nIf you could separate what we consider 'an acceptable norm' from what God's design of our bodies intended to be 'an acceptable norm', you'd see that 100% of the people could exhibit deviant behavior.\n \n \n\n How do you reconcile these? Bizarre, especially coming from someone who's normally so \"anal\" about such things.\nI doubt you have any valid conception about what I normally do. Your only exposure to me is in this text driven site.\n \n \n \n\n \"God\" created your body to be able to perceive pleasure. \"God\" made sex (including anal sex) pleasureable for humans and humans have the ability to engage in sexual activity at essentially any time and for any reason.\nPartially true. God gave us sensuous bodies and no instructions. He merely gave us a desire to feel pleasure and complete freedom to choose methods of attainment. He gave us the ability to explore various ways of attaining pleasurable feelings...physical and mental. We conjured up the use of the anus as a sexual orifice. We also conjured up sex acts with animals, sex with molded latex, sex with ourselves. Nothing you have said makes anal sex normal in the sense of design intent.\n \n \n\n If anal sex provides pleasure, how can it not be natural, how is it deviant?\nBecause it is not within the design intent of our bodies.\n \n Perhaps you could extend that argument to justify incest, pedophilia, orgies and the like. Heck, even rape gives pleasure to the rapist. How can it be deviant?emoticon_rolleyes \n \n \n\n If humans were not wired to received pleasure from sex, you might have a leg to stand on. In that case, humans would only engage in sexual activites for the purpose of sexual reproduction.\nIf the pleasure factor weren't wired in, as you say, we'd likely not have any for any reason.\n \n \n\n That's clearly not the case, so as much as you'd like the law of jim's trucking to be the law of reality, it ain't.\n \n Waxy\nI'm not espousing that I write nature's laws. I'm discerning from the anatomy of mammals in general, homo sapiens in particular, that the anus has no intended function other than controlling the flow of feces from the body.\n \n \n \n\n P.S. Please feel free to define the \"norm\", especially as it pertains to human sexuality as a whole. You'll need to provide support for the definition beyond your personal opinion of course...\nWe're not talking about total human sexuality...just the use of the anus. Explain to me another use for it that was intended by design. The fact that it (the anus) is similar to and in close proximity to the proper sexual orifice likely explains its common misuse...(though even if it were placed on the bottom of one foot, we'd have likely still have experimented with poking it with a penis to find pleasure) still does not make it 'normal' within consideration of the intent.\n \n The 'any port in a storm just because it feels good' argument does not preclude abnormality...no matter what percentage of the people do it.", 
   {}, 
   274674, 
   null, 
   1184970240.0
  ], 
  [
   274683, 
   null, 
   "JakeCJB", 
   "Unnatural.\n \n Still unnatural, abnormal, deviant, hedonistic behavior. (If it feels good...do it!)\n \n Thermometers, proctoscopes, doctor's exploratory digits, enema delivery tubes and suppository medicines are legitimate intruders of the colon. Penises are not.\n \n Check out the human body and ponder what functions all the various parts are intended to perform. Anal sex is a deviant behavior, whether you are gay or not.\n\n \n Is clitoral stimulation deviant, hedonistic? Is oral sex or masturbation wrong? The use of contraceptives may offend another's religious beliefs. Your morality isn't necessarily my morality.", 
   {}, 
   274647, 
   null, 
   1184970660.0
  ], 
  [
   274684, 
   null, 
   "Waxy", 
   "Several times.\n \n If you could separate what we consider 'an acceptable norm' from what God's design of our bodies intended to be 'an acceptable norm', you'd see that 100% of the people could exhibit deviant behavior.\n\n \n Oh I see, you're speaking for God. Gotcha. emoticon_xgood \n \n \nI doubt you have any valid conception about what I normally do.\n \n \n Nor do I want to have any conception.\n \n \nYour only exposure to me is in this text driven site.\n\n \n Your response is abnormal based on this exposure.\n \n \nPartially true. God gave us sensuous bodies and no instructions. He merely gave us a desire to feel pleasure and complete freedom to choose methods of attainment. He gave us the ability to explore various ways of attaining pleasurable feelings...physical and mental. We conjured up the use of the anus as a sexual orifice. We also conjured up sex acts with animals, sex with molded latex, sex with ourselves. Nothing you have said makes anal sex normal in the sense of design intent.\n\n \n Right, so anal sex is equivalent to rape, incest, bestiality, etc... emoticon_rolleyes\n \n \nBecause it is not within the design intent of our bodies.\n\n \n Says who? You? You as the voice of God?\n \n \nPerhaps you could extend that argument to justify incest, pedophilia, orgies and the like. Heck, even rape gives pleasure to the rapist. How can it be deviant?emoticon_rolleyes \n\n \n Why would I, it is you that introduced such absurdity.\n \n \nI'm not espousing that I write nature's laws. \n \n \n Yes you are.\n \n \nI'm discerning from the anatomy of mammals in general, homo sapiens in particular, that the anus has no intended function other than controlling the flow of feces from the body.\n\n \n You're free to discern as such. Doesn't make you right, nor does it make it deviant.\n \n \nWe're not talking about total human sexuality...just the use of the anus. \n \n \n I disagree. Human sexuality is incredibly complex, anal sex is only one small facet of it, and is not inseparable from human sexuality as a whole. If you want to define the \"norm\" of human sexuality, you have a monumental task ahead of you. \n \n \nExplain to me another use for it that was intended by design. The fact that it (the anus) is similar to and in close proximity to the proper sexual orifice likely explains its common misuse...(though even if it were placed on the bottom of one foot, we'd have likely still have experimented with poking it with a penis to find pleasure) still does not make it 'normal' within consideration of the intent.\n\n \n Again, says you. \n \n Unless you're the designer, I don't see how you can speak with authority on the intended use of the anus.\n \n \nThe 'any port in a storm just because it feels good' argument does not preclude abnormality...no matter what percentage of the people do it.\n\n \n Interesting argument. \n \n So even if 100% of people engage in an activity, that activity can still be considered \"abnormal\".\n \n That's logic best left to speak for itself...\n \n Waxy", 
   {}, 
   274682, 
   null, 
   1184971260.0
  ], 
  [
   274685, 
   null, 
   "JakeCJB", 
   "Several times.\n \n If you could separate what we consider 'an acceptable norm' from what God's design of our bodies intended to be 'an acceptable norm', you'd see that 100% of the people could exhibit deviant behavior.\n \n I doubt you have any valid conception about what I normally do. Your only exposure to me is in this text driven site.\n \n \n Partially true. God gave us sensuous bodies and no instructions. He merely gave us a desire to feel pleasure and complete freedom to choose methods of attainment. He gave us the ability to explore various ways of attaining pleasurable feelings...physical and mental. We conjured up the use of the anus as a sexual orifice. We also conjured up sex acts with animals, sex with molded latex, sex with ourselves. Nothing you have said makes anal sex normal in the sense of design intent.\n \n Because it is not within the design intent of our bodies.\n \n Perhaps you could extend that argument to justify incest, pedophilia, orgies and the like. Heck, even rape gives pleasure to the rapist. How can it be deviant?emoticon_rolleyes \n \n If the pleasure factor weren't wired in, as you say, we'd likely not have any for any reason.\n \n I'm not espousing that I write nature's laws. I'm discerning from the anatomy of mammals in general, homo sapiens in particular, that the anus has no intended function other than controlling the flow of feces from the body.\n \n \n We're not talking about total human sexuality...just the use of the anus. Explain to me another use for it that was intended by design. The fact that it (the anus) is similar to and in close proximity to the proper sexual orifice likely explains its common misuse...(though even if it were placed on the bottom of one foot, we'd have likely still have experimented with poking it with a penis to find pleasure) still does not make it 'normal' within consideration of the intent.\n \n The 'any port in a storm just because it feels good' argument does not preclude abnormality...no matter what percentage of the people do it.\n\n \n Not everyone believes in your God, the God who opposes anal sex. Perhaps it's the fact that the anus had many of the same sensitive nerve endings as the vagina, and the fact that a man's \"g-spot\" is located there in the prostate gland, which explains why it is used for sexual purposes. One could look at it as one of the purposes for which it was designed. All of our body parts perform multiple functions, and anything we can do with them is natural, as we humans are a part of nature. Whether it is good or bad is a subjective moral question. In terms of rape and pedophilia, which you mention in your not so highly original argument, we can see that there is \n no consent, and objectively see that there is harm involved.", 
   {}, 
   274682, 
   null, 
   1184971380.0
  ], 
  [
   274695, 
   null, 
   "jim's trucking", 
   "You looked up \"deviant\". Now you need to look up \"norm\".\n If all couples engaged in it, by definition it most certainly would not be deviant.\nYou suffer from the same lack of understanding as does Waxy. The 'norm' in my statement is that which is strongly and obviously suggested by the design of our bodies. It has nothing to do with what people choose to do.\n \n \n\n Humans do all sorts of things with their bodies, sexually and otherwise, that we weren't designed for. Dancers, athletes, and acrobats do some very deviant things. Running a marathon or climbing a mountain is using the body for things it wasn't designed for. They are deviants. Every marathon runner I know feels terrible for days and weeks after because of damage done to his body. That is deviant.\nCan't agree with much of this. The thrill of competition, curiosity and the desire to win all contribute to the normal behavior amongst humans to do various uncommon things. It is plausible that since most people don't run marathons that marathonists are deviating from normal behavior of humans. It is not true that running 'til you drop deviates from the intended design functions, running being one of them. \n \n \n\n You are equating deviant with bad. \nNope...just with opposing the design intent.\n \n\n You are saying using our bodies creatively is bad.\nNope. Most people use their bodies creatively. There's nothing bad about that. What is deviant is to use the anus to recieve the penis. It deviates from the design intent.\n \n \n\n It is clear you are disgusted by anal sex.\nNot at all. It does not bother me that some people have anal sex. What bothers me is that people try to tell other people that it's normal. It ain't.\n There are many sexual practices (that may or may not include anal sex) that I find disgusting, and guess what? I don't do them.\nYour choice.\n \n\n You need to understand that their is a BROAD spectrum of sexual behavior out there and most people are doin' it (even in Stockbridge.)\nI already understand that...and locale has little to do with it. EVERYBODY who's healthy wants another orgasm.\n \n \nThat quote you posted was taking some literary license. You interpreted it literally apparently.\n Barring those criminals who attempt non-consensual sex:\n There is no recruitment.\n There is no proselytizing.\n There is no choosing. \n There is no seduction. \n \n You do not seem to understand this basic phenomenon of sexual orientation. You have one. Everybody has one.\nOh, I recognized that there was some theatrical sarcasm in the piece, but your four claims are invalid.\n \n Selling porn to naturally curious people is recruitment (proselytizing).\n \n Many people choose to continue the practice after their first experience.\n \n Priests seduce boys daily...the Church makes a big payoff now and then...the seduction continues. I doubt they are the only men who seduce or attempt to seduce other males (of all ages). I myself was approached by a deviant, pimply-faced, raincoat-wearing slickster in Enid, Oklahoma while on a band trip...and by another drive-by-and-offer-to-suck wierdo on a college campus.\n \n Don't try to blow smoke up my dress about what does and does not happen in the gay crusade.", 
   {}, 
   274678, 
   null, 
   1184972700.0
  ], 
  [
   274697, 
   null, 
   "jim's trucking", 
   "Is clitoral stimulation deviant, \nOf course not.\n \n \n...hedonistic? \nNot in itself. Taken as a 24hour activity, it could be so.\n \n \nIs oral sex or masturbation wrong? \nNo.\n \n \nThe use of contraceptives may offend another's religious beliefs. \nStill has nothing to do with anal sex being opposed to the body's design intent.\n \n \nYour morality isn't necessarily my morality.\nWe're snowflakes. I don't ask you to embrace my morality. I ask you to cease telling people that anal sex is intended by design. Do it all you want...just don't lie about your justification of it.", 
   {}, 
   274683, 
   null, 
   1184973300.0
  ], 
  [
   274699, 
   null, 
   "MrWriteLA", 
   "It seems I have to re-post this every few weeks, since some people apparently have the retention capacity of a seive...\n \n http://www.cdc.gov/nchs/data/ad/ad362.pdf (This is a government report folks, not some gay or \"non-mainstream\" site. We clear on that?)\n \n \nSexual Behavior and Selected Health Measures: Men and Women 15-44 Years of Age, United States, 2002\n \n * * *\n \n Results-Among adults 25-44 years of age, 97 percent of men and 98 percent of women have had vaginal intercourse; 90 percent of men and 88 percent of women have had oral sex with an opposite-sex partner; and 40 percent of men and 35 percent of women have had anal sex with an opposite-sex partner.\n Do the math. 38% percent or so of heterosexuals between 25 and 44 is numerically a ****load more than all the gay people in the country, half of which (they're called lesbians, deary) hardly engage in the \"distusging\" practice at all, and a percentage of the remainder don't either (think of that!)", 
   {
    "unicode_changes_made": true
   }, 
   272723, 
   null, 
   1184973720.0
  ], 
  [
   274700, 
   null, 
   "Foxtuba", 
   "Not everyone believes in your God, the God who opposes anal sex. Perhaps it's the fact that the anus had many of the same sensitive nerve endings as the vagina, and the fact that a man's \"g-spot\" is located there in the prostate gland, which explains why it is used for sexual purposes. One could look at it as one of the purposes for which it was designed. All of our body parts perform multiple functions, and anything we can do with them is natural, as we humans are a part of nature. Whether it is good or bad is a subjective moral question. In terms of rape and pedophilia, which you mention in your not so highly original argument, we can see that there is \n no consent, and objectively see that there is harm involved.\n\n \n Oh, trust me, I took AA off my ignore list when I remembered that jim's trucking is around. You won't have to worry about hollow arguments if you don't bother with him.", 
   {}, 
   274685, 
   null, 
   1184974200.0
  ], 
  [
   274702, 
   null, 
   "thelmoose", 
   "You suffer from the same lack of understanding as does Waxy. The 'norm' in my statement is that which is strongly and obviously suggested by the design of our bodies. It has nothing to do with what people choose to do. \n\n No. Norm does not mean normal.\n \nNope...just with opposing the design intent.\n Nope. Most people use their bodies creatively. There's nothing bad about that. What is deviant is to use the anus to recieve the penis. It deviates from the design intent.\n\n How do you get to tell anyone what the design intent of our bodies is? How is it you seem to know what no one else does?\n \n You are saying that the anus was \"obviously\" not designed to receive a penis. It sure seems to work pretty effectively for lots of people. \n \nNot at all. It does not bother me that some people have anal sex. What bothers me is that people try to tell other people that it's normal. It ain't.Your choice.\n\n How do you get to decide what is normal?\n \nSelling porn to naturally curious people is recruitment (proselytizing).\n\n How is this specific to gays?\n Also, porn is sold to anyone who wants to buy it. There is no overt attempt to convert or recruit. You need to look up \"proselytize.\" Damn, fella, use a dictionary!\n \nMany people choose to continue the practice after their first experience.\n\n Everyone has a first time. Usually people continue if they enjoy it. How is this a problem for you?\n \nPriests seduce boys daily...the Church makes a big payoff now and then...the seduction continues. I doubt they are the only men who seduce or attempt to seduce other males (of all ages). \n \n Non-consensual sex or child sexual abuse is criminal. Not related. Don't bring that up again. That is stupid. \n \n Seduction implies a snowball's chance of success. To that end, gays will usually attempt to seduce someone who is not repulsed by gay sex. Wouldn't that make sense? Are you suggesting it is possible to seduce someone to consent to sex that they don't want to engage in??\n \n You seem to be confusing this with your typical attempts to seduce women with whom you have no chance of success. \n \nI myself was approached by a deviant, pimply-faced, raincoat-wearing slickster in Enid, Oklahoma while on a band trip...and by another drive-by-and-offer-to-suck wierdo on a college campus.\n\n First, everyone looks like that in Enid. Second, your option in both those cases was to politely decline. \n Don't see any recruitment there. Maybe you just look gay.\n \n What is a slickster?\n \nDon't try to blow smoke up my dress about what does and does not happen in the gay crusade. \n \n Look, you were approached by two men in your life. Is that the extent of your experience and understanding of gay sexuality?? You sure don't seem to be an authority. In fact, you sure sound like you don't know what the heck you are talking about. \n \n And why do you wear dresses, straight boy?\n \n Lastly, WHY ARE YOU SO CONCERNED ABOUT ANAL INTERCOURSE?????\n \n Maybe you connected with that guy in Enid and feel guilty??", 
   {}, 
   274695, 
   null, 
   1184974740.0
  ], 
  [
   274703, 
   null, 
   "Waxy", 
   "\n Is oral sex or masturbation wrong?\n \n No.\n\n \n LOL. You're losing it Jim.\n \n Please explain to me how the mouth is designed for accepting the genitals any more so than the anus in God's plan.\n \n Why are oral sex and masturbation justifiable and natural?\n \n Because I said so, or because I do it and enjoy it, are not an acceptable answers.\n \n Waxy", 
   {}, 
   274697, 
   null, 
   1184974740.0
  ], 
  [
   274704, 
   null, 
   "jim's trucking", 
   "Oh I see, you're speaking for God. Gotcha. emoticon_xgood \nRead back a bit, my friend. You mentioned God in the post previous to mine. I was merely acknowledging your statement that God designed our bodies. Check back further and in the Natural thread and you will see that I gave the scrapper of the day the same leeway. Either God designed our bodies or nature designed them or 'whatever you want to believe designed them' designed them.\n \n \n \n\n Nor do I want to have any conception.\nThen why express your opinion as to it? (Don't let adolescence take over here, Waxy. You're generally above that.)\n \n \n \n\n Your response is abnormal based on this exposure.\nOne might expect that a heterosexual's response will be abnormal in a site replete with homosexuals.\n \n \n \n\n Right, so anal sex is equivalent to rape, incest, bestiality, etc... emoticon_rolleyes\nHow silly of you to infer that from what I really said.\n \n \n \n\n Says who? You? You as the voice of God?\nAre you again saying that you believe God designed our bodies?\n \n As I have already explained in other places near here, a study of anatomy of mammals using logic will lead any sane person with an IQ exceeding room temperature to know the intended functions of body parts regardless of who or what designed us.\n \n \n \n\n Why would I, it is you that introduced such absurdity.\nI beg your pardon. It was Waxy who said:\n \n \nIf anal sex provides pleasure, how can it not be natural, how is it deviant?\nThat is to say 'If something provides pleasure, how can it not be natural, how is it deviant?'\n \n This was following your statement that:\n \n \n\"God\" created your body to be able to perceive pleasure. \"God\" made sex (including anal sex) pleasureable for humans and humans have the ability to engage in sexual activity at essentially any time and for any reason.\n\n \n It follows that you would argue that rape, incest, orgies etc are merely different ways to perceive pleasure...a gift from \"God\". Therefore you justify all the above...just as another poster did in the Natural thread.\n \n \n \n \n\n Yes you are.\n \n \n \n You're free to discern as such. Doesn't make you right, nor does it make it deviant.\n \n \n \n I disagree. Human sexuality is incredibly complex, anal sex is only one small facet of it, and is not inseparable from human sexuality as a whole. If you want to define the \"norm\" of human sexuality, you have a monumental task ahead of you. \n \n \n \n Again, says you. \n \n Unless you're the designer, I don't see how you can speak with authority on the intended use of the anus.\n \n \n \n Interesting argument. \n \n So even if 100% of people engage in an activity, that activity can still be considered \"abnormal\".\n \n That's logic best left to speak for itself...\n \n Waxy\nYour inability to understand the separation of the obvious intent of design being a norm and the actions of people creating a norm is obvious to me.\n \n Come up with a statement logically arrived at that supports any intended function of the anus other than to release feces from the body.", 
   {}, 
   274684, 
   null, 
   1184974860.0
  ], 
  [
   274705, 
   null, 
   "jim's trucking", 
   "LOL. You're losing it Jim.\n \n Please explain to me how the mouth is designed for accepting the genitals any more so than the anus in God's plan.\n \n Why are oral sex and masturbation justifiable and natural?\n \n Because I said so, or because I do it and enjoy it, are not an acceptable answers.\n \n Waxy\nI've already explained this in another thread. Gentle, pleasurable foreplay between those about to sexually gratify each other includes kissing, licking, rubbing, probing the ears, armpits, kneepits, legpits and other areas with the tongue. Tongue bathing is natural anywhere on the body, including when giving a rim job. Some mammals, including dogs, lick their pups genitals to stimulate excretion [which they often eat in order to hide the odor from predators] Licking is natural. (I have said this elsewhere, too.) Fellatio is natural. Cunnilingus is natural, too. (Thank God!)", 
   {}, 
   274703, 
   null, 
   1184975400.0
  ], 
  [
   274708, 
   null, 
   "Waxy", 
   "Read back a bit, my friend. You mentioned God in the post previous to mine. I was merely acknowledging your statement that God designed our bodies. Check back further and in the Natural thread and you will see that I gave the scrapper of the day the same leeway. Either God designed our bodies or nature designed them or 'whatever you want to believe designed them' designed them.\n\n \n I think we both know that I don't believe God designed the human body. It's my understanding that you do, either directly or through the process of evolution. Correct me if I'm wrong. \n \n \nThen why express your opinion as to it? (Don't let adolescence take over here, Waxy. You're generally above that.)\n\n \n Simply because your response was so out of character. Take it as a compliment, you're generally far more logical and detail focused than you are proving to be in this case.\n \n \nOne might expect that a heterosexual's response will be abnormal in a site replete with homosexuals.\n\n \n That's one possible explanation, kinda like watching 100 soldiers marching, 99 in perfect step, one way off, and hearing the one out of step yelling at the others to get into step. He might be right, maybe the other 99 are out to lunch, but not likely...\n \n \nHow silly of you to infer that from what I really said.\n\n \n How silly of you to bring them into the thread as comparisons, or logical extensions of, the choice to engage in anal sex due to the fact it's pleasureable, and then plead innocence as though you never intended as such. \n \n Now that's the jim's trucking I've come to know. :p\n \n \nAre you again saying that you believe God designed our bodies?\n\n \n Not in the least, only attempting to acknowledge your belief as such, and juxtapose that position with your claim of righteousness regarding their intended design.\n \n \nAs I have already explained in other places near here, a study of anatomy of mammals using logic will lead any sane person with an IQ exceeding room temperature to know the intended functions of body parts regardless of who or what designed us.\n\n \n I agree. How does this support your argument though? \n \n \nI beg your pardon. It was Waxy who said:\n \n That is to say 'If something provides pleasure, how can it not be natural, how is it deviant?'\n \n This was following your statement that:\n \n It follows that you would argue that rape, incest, orgies etc are merely different ways to perceive pleasure...a gift from \"God\". Therefore you justify all the above...just as another poster did in the Natural thread.\n\n \n They are natural. If it occurs in nature, it is by definition natural. \n \n That doesn't make these actions right or acceptable. The reasons for that, and the differences between them and engaging in consentual anal sex are abvious to anyone with an IQ over room temperature.\n \n \nYour inability to understand the separation of the obvious intent of design being a norm and the actions of people creating a norm is obvious to me.\n\n \n It would seem to me that you're the only one with problems of definition and understanding. \n \n I am curious as to how you would define \"the intent of design being a norm\" and \"people creating a norm\". It would seem to me the two are synonymous.\n \n If I create an item with the intent of it being used as a screw driver, but most people find it very useful as a hammer and use it as such, which is the norm?\n \n Your argument rests entirely on the intent of design, a point you have completely failed to make. Your only justification is \"because I said so\", suported by adolescent personal attacks of the intelligence of those that disagree with you. \n \n \nCome up with a statement logically arrived at that supports any intended function of the anus other than to release feces from the body.\n\n \n JakeCJB alread has in post #51.\n \n Waxy", 
   {}, 
   274704, 
   null, 
   1184976720.0
  ], 
  [
   274709, 
   null, 
   "Waxy", 
   "I've already explained this in another thread. Gentle, pleasurable foreplay between those about to sexually gratify each other includes kissing, licking, rubbing, probing the ears, armpits, kneepits, legpits and other areas with the tongue. Tongue bathing is natural anywhere on the body, including when giving a rim job. Some mammals, including dogs, lick their pups genitals to stimulate excretion [which they often eat in order to hide the odor from predators] Licking is natural. (I have said this elsewhere, too.) Fellatio is natural. Cunnilingus is natural, too. (Thank God!)\n\n \n Unreal. \n \n So, barring a really lame alusion to animals apparently engaging in incestous oral sex, your only justification for this is personal opinion. \n \n Did you miss this part of my post?\n \n \nBecause I said so, or because I do it and enjoy it, are not an acceptable answers.\n\n \n Waxy", 
   {}, 
   274705, 
   null, 
   1184977080.0
  ], 
  [
   274824, 
   null, 
   "JPSartre12", 
   "Unreal. \n \n So, barring a really lame alusion to animals apparently engaging in incestous oral sex, your only justification for this is personal opinion. \n \n Did you miss this part of my post?\n \n Waxy\n\n \n Waxy, don't you have better things to do than cruise gay threads. ;)", 
   {}, 
   274709, 
   null, 
   1185059640.0
  ], 
  [
   274826, 
   null, 
   "Waxy", 
   "Waxy, don't you have better things to do than cruise gay threads. ;)\n\n \n LOL, probably, but I need to blow off a little steam now and then too. jim's trucking just happened to come in real handy in this case. :)\n \n Waxy\n \n P.S. I notice even one of the board's more notorious \"anti anal sex\" (to put if far more politely than he ever has) posters isn't rushing to jim's aid. :p", 
   {}, 
   274824, 
   null, 
   1185062760.0
  ], 
  [
   274924, 
   null, 
   "jim's trucking", 
   "No. Norm does not mean normal.\nGet out your dictionary and read it where it says:\n \n norm abbr normal \n \n \n \n\n How do you get to tell anyone what the design intent of our bodies is? How is it you seem to know what no one else does?\nI doubt it's only me that's picked up on it. Anatomical study by dissection, drawing and pondering has led to great medical knowledge. Observations and logic lead me to believe certain things. I have challenged others here to come up with a logically deduced intended function of the anus other than what I have said. Can you do that?\n \n \n \n\n You are saying that the anus was \"obviously\" not designed to receive a penis. It sure seems to work pretty effectively for lots of people. \nThe fact that something can be used to function in other than its intended way does not mean that the alternate uses were intended by the designer. I can use a hammer or a baseball bat to kill someone, but that was not the intent of either designer.\n \n \n\n How do you get to decide what is normal?\nI decide what I think is normal. In this case, I back that with deductive thought. One can guess at what the intended uses of organs are. What you need is a logical way present a different intent.\n \n \n\n How is this specific to gays?\nThe sale of porn is not perculiar to gays. I didn't say it was.\n \n \n\n Also, porn is sold to anyone who wants to buy it. There is no overt attempt to convert or recruit. You need to look up \"proselytize.\" Damn, fella, use a dictionary!\nI do. Getting the message out is a form of proselytizing.\n \n \n\n Everyone has a first time. Usually people continue if they enjoy it. How is this a problem for you?\nIt isn't a problem for me. In the context of this topic, it points to the argument of being born gay or being converted to gayness.\n \n \n\n Non-consensual sex or child sexual abuse is criminal. Not related. Don't bring that up again. That is stupid. \nRegarding seduction of possibly not-already-gay boys, what I said was appropriate. It is likely that an intelligent priest would be able to convince his victim that it's God's plan and everything is okay, making the sex 'consentual'\n \n \n\n Seduction implies a snowball's chance of success. \nA brilliant statement.emoticon_rolleyes \n \n \nTo that end, gays will usually attempt to seduce someone who is not repulsed by gay sex. Wouldn't that make sense? \nI doubt you have anything to back this up.\n \n \nAre you suggesting it is possible to seduce someone to consent to sex that they don't want to engage in??\nOf course I am. It is.\n \n \n \n\n You seem to be confusing this with your typical attempts to seduce women with whom you have no chance of success. \nYou have no knowledge of my attempts to seduce women...or my chances of success.\n \n \n \n\n First, everyone looks like that in Enid. Second, your option in both those cases was to politely decline. \n Don't see any recruitment there. Maybe you just look gay.\nNo. I saw quite a few pretty people there.\n \n To a gay pervert, all young males look like fresh meat.\n \n \n \n\n What is a slickster?\nCon artist, misleader, deceiver, swindler, fraud...take your pick of anything similar.\n \n \n \n Look, you were approached by two men in your life. Is that the extent of your experience and understanding of gay sexuality?? You sure don't seem to be an authority. In fact, you sure sound like you don't know what the heck you are talking about. \nI related two instances. Why did you conclude that's all that's happened in my life regarding lessons from gays? I gave them as examples of gays proselytizing by trying to get heteros to join them in gay sex. I had only to give one example to make the point that such things happen. I gave two and you erroneously concluded that's the extent of my experience regarding gays.\n \n \n\n And why do you wear dresses, straight boy?\n \n .......\n \n Maybe you connected with that guy in Enid and feel guilty?? \nUnworthy of reply.\n \n \nLastly, WHY ARE YOU SO CONCERNED ABOUT ANAL INTERCOURSE?????\nIt's not that I'm concerned about anal sex as much as I am revealing the true gay agenda and exploring the thoughts of gays regarding this 'born gay' argument. As I have said before, gay men can develop callouses on their asses for all I care. I just will not ignore the asinine arguments that anal sex is normal and that gays don't attempt to convert heteros with this and other such ridiculous arguments.", 
   {}, 
   274702, 
   null, 
   1185144480.0
  ], 
  [
   274926, 
   null, 
   "jim's trucking", 
   "LOL, probably, but I need to blow off a little steam now and then too. jim's trucking just happened to come in real handy in this case. :)\n \n Waxy\n \n P.S. I notice even one of the board's more notorious \"anti anal sex\" (to put if far more politely than he ever has) posters isn't rushing to jim's aid. :p\nGlad to oblige.\n \n In case you haven't noticed, I'm not 'anti anal sex'. I've said it several times already. Have at it, if you wish. \n \n I am 'anti anal sex being presented as a natural thing to do based simply on the fact that a lot of y'all do it'.", 
   {}, 
   274826, 
   null, 
   1185144960.0
  ], 
  [
   274933, 
   null, 
   "jim's trucking", 
   "Unreal. \n \n So, barring a really lame alusion to animals apparently engaging in incestous oral sex, your only justification for this is personal opinion. \n \n Did you miss this part of my post?\n Because I said so, or because I do it and enjoy it, are not an acceptable answers.\n \n \n Waxy\nEverything stated here is opinion. Some of it is logically arrived at. Some of it is not. Intimacy between consenting adults could be logically expected to include carressing with the tongue. I see no reason to put any part of the exterior off limits to tongue carresses. Can you think of any?\n \n You statement:\n \"Because I said so, or because I do it and enjoy it, are not an acceptable answers.\"...\n \n ...shoots a hole in the gay argument that it must be okay because so many people are doing it.", 
   {}, 
   274709, 
   null, 
   1185145860.0
  ], 
  [
   274934, 
   null, 
   "Jo Bennett", 
   "Just out of curiosity, JT, is there any evidence short of divine revelation that would convince you that anal sex is natural? e.g. sociological reasons for it, evidence of it taking place in other mammal species", 
   {}, 
   274926, 
   null, 
   1185145860.0
  ], 
  [
   274937, 
   null, 
   "samiinh", 
   "I've read that many Europeans practice anal sex as a method of birth control while maintaining an intimate relationship. Is that normal for those people?", 
   {}, 
   274934, 
   null, 
   1185146100.0
  ], 
  [
   274941, 
   null, 
   "thelmoose", 
   "\n I am 'anti anal sex being presented as a natural thing to do based simply on the fact that a lot of y'all do it'. \n\n \n By your own unusual definition of normal, it is natural if a lot of people do it.\n Are you concerned that someone is calling this mandatory or something. No one is pressuring you to so this (that I know of.)\n \n \n \nGet out your dictionary and read it where it says:\n \n norm abbr normal \n\n \n What you have written there is that \"norm.\" is an abbreviation for \"normal\". \n Look up the word \"abbreviation\".\n \n \n \n\n Anatomical study by dissection, drawing and pondering has led to great medical knowledge. \n\n Yes it has. \n None of which agrees with your conclusions. If you can show me any medical data about the \"intended\" use of any body part, I would be interested. \n \n \n \nObservations and logic lead me to believe certain things. I have challenged others here to come up with a logically deduced intended function of the anus other than what I have said. Can you do that?\n\n \n Your argument is based on the fact that their is an \"intended\" function for anything. You would need to prove that for your argument to make sense. Your \"logic\" has been to state something and disagree with others. I haven't seen you deduce anything.\n \n \n In any event, this function seems to work pretty well and lots of people like to do it. How's that for logic.\n \n \n \nThe fact that something can be used to function in other than its intended way does not mean that the alternate uses were intended by the designer. \n\n Nor does it mean the opposite. Again with the designer.\n \n \nI decide what I think is normal. \n\n \n For you, fine. No one has any problem with that. \n \n \nIn this case, I back that with deductive thought. One can guess at what the intended uses of organs are. \n\n Is making a guess what you call deduction.\n \n \n \nWhat you need is a logical way present a different intent.\n\n No I don't. \n I never said anything was intended for anything. For there to be intent, there has to be an intender, which is not my position. \n \n You said anal sex is not normal. I am saying that is merely your opinion. I really don't care if is \"normal\" or not, whatever that means. I would submit, however, if half the population is doing it, that speaks against calling something abnormal.", 
   {}, 
   274926, 
   null, 
   1185146760.0
  ], 
  [
   274942, 
   null, 
   "jim's trucking", 
   "Just out of curiosity, JT, is there any evidence short of divine revelation that would convince you that anal sex is natural? e.g. sociological reasons for it, evidence of it taking place in other mammal species\nI've seen the \"evidence\" of it taking place in the animal kingdom. I have stipulated that it does occur in the animal kingdom. I have stipulated that it is a naturally occuring phenomon in the animal kingdom. I have said that I believe the animals do it solely because it feels good and they have opportunities now and then to do it. I do understand that humans are quite a bit more sophisticated and more intelligent than other animals and have the ability to establish reasons for taking certain actions other than 'it feels good and I want to do it again'.\n \n I cannot fathom why any intelligent human could not understand that each body part has an intended function. Something designed us the way we are. Whether it be God or whatever does not matter. We didn't end up here with so many similarities amongst mammals by way of totally accidental development and evolution. Each body part has a function. Those functions can be discerned only by study as we will not have the designer come and explain them to us.\n \n I could be convinced by a logical, truthful argument detailing the trail to a conclusion that the anus has some other intended function.\n \n Waxy has directed me to Post #51. I think there's not one there because that's my post.\n \n Perhaps you can come up with a logical argument.", 
   {}, 
   274934, 
   null, 
   1185147000.0
  ], 
  [
   274945, 
   null, 
   "jim's trucking", 
   "Not everyone believes in your God, the God who opposes anal sex. Perhaps it's the fact that the anus had many of the same sensitive nerve endings as the vagina, and the fact that a man's \"g-spot\" is located there in the prostate gland, which explains why it is used for sexual purposes. One could look at it as one of the purposes for which it was designed. All of our body parts perform multiple functions, and anything we can do with them is natural, as we humans are a part of nature. Whether it is good or bad is a subjective moral question. In terms of rape and pedophilia, which you mention in your not so highly original argument, we can see that there is \n no consent, and objectively see that there is harm involved.\nSorry. I disagree.\n \n The 'g-spot' argument doesn't convince me either. Sensitivity near the anus is more likely related to the function of the anus in opening and shutting at appropriate times and possibly to attach some bit of a pleasurable feeling to a good BM. I can say from personal experience that I have released many a sigh of relief afterwards\n \n A man's real g-spot is directly below the glans on the underside of the head of the penis. ...sort of like where the 'face' would be under the 'helmet'", 
   {}, 
   274685, 
   null, 
   1185147840.0
  ], 
  [
   274958, 
   null, 
   "jyoshu", 
   "By your own unusual definition of normal, it is natural if a lot of people do it.\n Are you concerned that someone is calling this mandatory or something. No one is pressuring you to so this (that I know of.)\n\n \n No, he's saying by YOUR definition of normal it because a lot of people (gays) are doing it. But these 'debates' about what's normal and what's not never get anywhere, because everyone has their own views of what's normal. There's no official standard. Personally, I don't see the problem of having sex in the way our species is biologically evolved/designed to do as being the norm. (And that's not to say that deviating from that is bad.) And it's evolved that way because that's what propagates the species--reproduction. And I see no reason that shouldn't be the norm even if reproduction as a goal can't take place. Male and female sex organs are made to fit together--that's the point of sex organs. This whole thing is sorta like someone who, for some reason, prefers to walk on his hands instead of his feet. Sure, some people out there can do it, and it can do the job just fine, but is it the norm? Well, no. Nothing wrong with doing it that way, either. Heck, for some people it may be the only way they're going to be able to walk--the only option they have ... but that still doesn't make it the norm.", 
   {}, 
   274941, 
   null, 
   1185153780.0
  ], 
  [
   274962, 
   null, 
   "thelmoose", 
   "No, he's saying by YOUR definition of normal it because a lot of people (gays) are doing it. But these 'debates' about what's normal and what's not never get anywhere, because everyone has their own views of what's normal. There's no official standard. Personally, I don't see the problem of having sex in the way our species is biologically evolved/designed to do as being the norm. (And that's not to say that deviating from that is bad.) And it's evolved that way because that's what propagates the species--reproduction. And I see no reason that shouldn't be the norm even if reproduction as a goal can't take place. Male and female sex organs are made to fit together--that's the point of sex organs. This whole thing is sorta like someone who, for some reason, prefers to walk on his hands instead of his feet. Sure, some people out there can do it, and it can do the job just fine, but is it the norm? Well, no. Nothing wrong with doing it that way, either. Heck, for some people it may be the only way they're going to be able to walk--the only option they have ... but that still doesn't make it the norm.\n\n \n I completely agree the discussion of \"normal\" is pointless. \n \n But I was not saying that \"a normal practice\" has anything to do with the proportion of a population that engaged in it. That was the disagreement we were having. He was confusing that concept (the \"norm\") with \"normal\". The discussion started with calling anal sex deviant. And his argument continued that because most people do not do it, it is therefore abnormal. \n \n I personally don't care if it is the norm or if someone wants to call it normal. I agree with your take on it. \n \n One more thing, in absolute numbers, many, many more straight people do it than gay. \n \n I can't believe I actually am spending this much time discussing this topic.", 
   {}, 
   274958, 
   null, 
   1185155340.0
  ], 
  [
   274967, 
   null, 
   "MrWriteLA", 
   "Most people are not red-headed; therefore being red-headed is not the norm.\n Are redheads not \"normal\"?\n \n Most people are not left-handed; therefore bing left-handed is not the norm.\n Are left-handed people not \"normal\"?\n \n Most people are not Southern Baptists; therefore being a Southern Baptist is not the norm.\n Are Southern Baptists not \"normal\"?\n \n Most people are not 16 years of age; therefore being 16 is not the norm.\n Are 16-year-olds not \"normal.\"\n \n Has the distinction been made sufficiently clear than we can finally lay this fallacious argument to rest?", 
   {}, 
   274962, 
   null, 
   1185159360.0
  ], 
  [
   274971, 
   null, 
   "Archangel", 
   "Most people are not red-headed; therefore being red-headed is not the norm.\n Are redheads not \"normal\"?\n \n Most people are not left-handed; therefore bing left-handed is not the norm.\n Are left-handed people not \"normal\"?\n \n Most people are not Southern Baptists; therefore being a Southern Baptist is not the norm.\n Are Southern Baptists not \"normal\"?\n \n Most people are not 16 years of age; therefore being 16 is not the norm.\n Are 16-year-olds not \"normal.\"\n \n Has the distinction been made sufficiently clear than we can finally lay this fallacious argument to rest?\n\n \n Are you incapable of telling the difference between moral norms and physical/experiential norms ? I mean, hair color, ones predominant hand, Religion, nor ones age are moral issues of judgement. So as much as you would like to compare them to sexual norms, it is only your argument that is totally fallacious.", 
   {}, 
   274967, 
   null, 
   1185160500.0
  ], 
  [
   274976, 
   null, 
   "JakeCJB", 
   "No, he's saying by YOUR definition of normal it because a lot of people (gays) are doing it. But these 'debates' about what's normal and what's not never get anywhere, because everyone has their own views of what's normal. There's no official standard. Personally, I don't see the problem of having sex in the way our species is biologically evolved/designed to do as being the norm. (And that's not to say that deviating from that is bad.) And it's evolved that way because that's what propagates the species--reproduction. And I see no reason that shouldn't be the norm even if reproduction as a goal can't take place. Male and female sex organs are made to fit together--that's the point of sex organs. This whole thing is sorta like someone who, for some reason, prefers to walk on his hands instead of his feet. Sure, some people out there can do it, and it can do the job just fine, but is it the norm? Well, no. Nothing wrong with doing it that way, either. Heck, for some people it may be the only way they're going to be able to walk--the only option they have ... but that still doesn't make it the norm.\n\n \n Well good for straight and bi-sexual people! They connect their penis to a vagina and the vagina to a penis, even though it rarely leads to reproduction. The rest don't fit this contrived norm.", 
   {}, 
   274958, 
   null, 
   1185161820.0
  ], 
  [
   274995, 
   null, 
   "JakeCJB", 
   "Sorry. I disagree.\n \n The 'g-spot' argument doesn't convince me either. Sensitivity near the anus is more likely related to the function of the anus in opening and shutting at appropriate times and possibly to attach some bit of a pleasurable feeling to a good BM. I can say from personal experience that I have released many a sigh of relief afterwards.\n\n \n Men can achieve orgasm with sexual stimulation of the prostate gland.", 
   {}, 
   274945, 
   null, 
   1185170460.0
  ], 
  [
   275004, 
   null, 
   "Ohioprof", 
   "Glad to oblige.\n \n In case you haven't noticed, I'm not 'anti anal sex'. I've said it several times already. Have at it, if you wish. \n \n I am 'anti anal sex being presented as a natural thing to do based simply on the fact that a lot of y'all do it'.\n\n \n Anything that people do is a \"natural thing to do.\" It may not be a natural thing for YOU to do, but you are not everyone. \n \n I do not have anal sex. I am gay. I don't care whether other people have anal sex. Why should you care?\n \n All this focus on anal sex by opponents of equality shows (1) their personal preoccupation with other people's sex acts and (2) their failure to notice, as usual, that roughly half the gay people are women.", 
   {}, 
   274926, 
   null, 
   1185174840.0
  ], 
  [
   275005, 
   null, 
   "Ohioprof", 
   "So what if the gays get up in the morning and have the same routine as everyone else? Is that the issue? Is not the issue whether or not their sexual actions are acceptable and allowable??? Everyone has the right to live and many things are necessary for life, i.e. eating, sleeping, etc. but does the right to life also include the right to do everything that a man's heart desires?\n\n \n No, the issue is not whether our \"sexual actions are acceptable and allowable.\" The issue is whether we will be treated equally under the law, have equal rights. \n \n The Supreme Court has already ruled that states cannot declare our private sexual relations illegal, that our relationships are protected under the right to privacy just as heterosexual relationships are. We do have the right to have intimate relationships with other consenting adults just as our hearts desire. \n \n Also, there are gay women, not just men. Women have hearts with desires too.", 
   {}, 
   274349, 
   null, 
   1185175200.0
  ], 
  [
   275006, 
   null, 
   "Ohioprof", 
   "Thermometers, proctoscopes, doctor's exploratory digits, enema delivery tubes and suppository medicines are legitimate intruders of the colon. Penises are not.\n \n Check out the human body and ponder what functions all the various parts are intended to perform. Anal sex is a deviant behavior, whether you are gay or not.\n\n \n The Gospel according to Lord Jim. God INTENDED the anus to hold a proctoscope (once they were invented). \n \n The whole notion that someone \"intended\" body parts to do anything sounds silly to me. Our bodies have evolved. We humans have evolved to include gay people in our population. And that's natural; it has happened in nature, as we are part of nature.", 
   {}, 
   274647, 
   null, 
   1185175740.0
  ], 
  [
   275007, 
   null, 
   "Ohioprof", 
   "I know some people who were obviously born gay (lesbian) and they truly cannot change their orientation. I'm guessing the percentage of the entire gay population is 5 to 10 percent naturally gay. Those who chose to be gay or were seduced by others who chose to be gay are just sick puppies in need of reprogramming.\n\n \n And who are they? \n \n And why do you care why other people are gay? \n \n Even if all gay people chose to be gay, shouldn't people have the right to make this choice? Reputable psychologists and psychiatrists do not try to \"reprogram\" gay people. Why do you want to do this? Aren't there real problems in the world that deserve your attention?", 
   {}, 
   274658, 
   null, 
   1185176040.0
  ], 
  [
   275008, 
   null, 
   "Ohioprof", 
   "God gave us sensuous bodies and no instructions. He merely gave us a desire to feel pleasure and complete freedom to choose methods of attainment. He gave us the ability to explore various ways of attaining pleasurable feelings...physical and mental. We conjured up the use of the anus as a sexual orifice. We also conjured up sex acts with animals, sex with molded latex, sex with ourselves. Nothing you have said makes anal sex normal in the sense of design intent.\n \n Because it is not within the design intent of our bodies.\n \n Perhaps you could extend that argument to justify incest, pedophilia, orgies and the like. Heck, even rape gives pleasure to the rapist. How can it be deviant?emoticon_rolleyes \n \n If the pleasure factor weren't wired in, as you say, we'd likely not have any for any reason.\n \n I'm not espousing that I write nature's laws. I'm discerning from the anatomy of mammals in general, homo sapiens in particular, that the anus has no intended function other than controlling the flow of feces from the body.\n \n \n We're not talking about total human sexuality...just the use of the anus. Explain to me another use for it that was intended by design. The fact that it (the anus) is similar to and in close proximity to the proper sexual orifice likely explains its common misuse...(though even if it were placed on the bottom of one foot, we'd have likely still have experimented with poking it with a penis to find pleasure) still does not make it 'normal' within consideration of the intent.\n \n The 'any port in a storm just because it feels good' argument does not preclude abnormality...no matter what percentage of the people do it.\n\n \n You are assuming that our bodies were \"designed\" with an \"intent.\" Many of us see our bodies as having evolved. You also assume that you know the \"intent\" of the \"designer.\" Those are huge assumptions on your part. \n \n You are the one judging what you think is normal and attributing your beliefs to a \"designer.\"", 
   {}, 
   274682, 
   null, 
   1185176280.0
  ], 
  [
   275009, 
   null, 
   "Ohioprof", 
   "Priests seduce boys daily...the Church makes a big payoff now and then...the seduction continues. I doubt they are the only men who seduce or attempt to seduce other males (of all ages). I myself was approached by a deviant, pimply-faced, raincoat-wearing slickster in Enid, Oklahoma while on a band trip...and by another drive-by-and-offer-to-suck wierdo on a college campus.\n \n Don't try to blow smoke up my dress about what does and does not happen in the gay crusade.\n\n \n And when I was younger, I had men of all kinds try to seduce me. I am female. All kinds of weirdos (male) hit on young women all the time. This had nothing to do with my sexual orientation, nor were these attempted seductions part of a \"crusade\" to make me heterosexual. They were just weirdos (male) hitting on a young woman.", 
   {}, 
   274695, 
   null, 
   1185176640.0
  ], 
  [
   275010, 
   null, 
   "Ohioprof", 
   "Either God designed our bodies or nature designed them or 'whatever you want to believe designed them' designed them.\n \n As I have already explained in other places near here, a study of anatomy of mammals using logic will lead any sane person with an IQ exceeding room temperature to know the intended functions of body parts regardless of who or what designed us.\n \n\n \n I have an IQ exceeding room temperature. I do not regard the human body as \"designed\" at all. I see our bodies as having evolved. I do not see anyone out there \"intending\" our bodies to do anything, other than we ourselves intending them to function on our behalf.\n \n If the \"intent\" of a designer for the human body is obvious to you, what did this designer intend as the function or functions of the clitoris?", 
   {}, 
   274704, 
   null, 
   1185177060.0
  ], 
  [
   275017, 
   null, 
   "samiinh", 
   "JT's interest in anal sex seems a bit obsessive. Why is that?", 
   {}, 
   275010, 
   null, 
   1185190200.0
  ], 
  [
   275025, 
   null, 
   "lesz", 
   "Anyone whose argument for heterosexism is based on heterosexual behaviour being normative just isn't firing on all cylinders. We need not be slaves to evolutionary biology, and heaven help those who are. Folk who seem to have an emotional need to feel superior to gay people because they are straight have a sexual problem of their own.", 
   {}, 
   275017, 
   null, 
   1185196680.0
  ], 
  [
   275026, 
   null, 
   "lesz", 
   "As for any blithering idiot who argues against gay sexual orientation because \"the parts don't fit\", they are beyond reclaim or education. They reduce relationships to plumbing, probably because they haven't a clue what goes into one.", 
   {}, 
   275025, 
   null, 
   1185196800.0
  ], 
  [
   275082, 
   null, 
   "Waxy", 
   "Glad to oblige.\n \n In case you haven't noticed, I'm not 'anti anal sex'. I've said it several times already. Have at it, if you wish. \n \n I am 'anti anal sex being presented as a natural thing to do based simply on the fact that a lot of y'all do it'.\n\n \n You can disagree all you like, and you're free to do so, however, by any definition of \"natural\" or \"normal\", you've failed to prove your point, miserably. \n \n There's far more than an appeal to numbers being presented here, the fact you choose to ignore or dismiss those facts is largely irrelevent.\n \n \nEverything stated here is opinion. Some of it is logically arrived at. Some of it is not. Intimacy between consenting adults could be logically expected to include carressing with the tongue. I see no reason to put any part of the exterior off limits to tongue carresses. Can you think of any?\n\n \n Nope.\n \n Why can intimacy logically include caressing with the tongue, but not anal sex? You've completely failed to make a distinction or provide evidence (not personal opinion) in any way as to why one is logical and acceptable, and the other is not. The burden is squarely on you in this case to support your assertions. You haven't been able to do so, all you've done is repeat the mantra of \"intended design\" and attack the intelligence of those who disagree with you, for 5 pages.\n \n \nI've seen the \"evidence\" of it taking place in the animal kingdom. I have stipulated that it does occur in the animal kingdom. I have stipulated that it is a naturally occuring phenomon in the animal kingdom. I have said that I believe the animals do it solely because it feels good and they have opportunities now and then to do it. I do understand that humans are quite a bit more sophisticated and more intelligent than other animals and have the ability to establish reasons for taking certain actions other than 'it feels good and I want to do it again'.\n \n I cannot fathom why any intelligent human could not understand that each body part has an intended function. Something designed us the way we are. Whether it be God or whatever does not matter. We didn't end up here with so many similarities amongst mammals by way of totally accidental development and evolution. Each body part has a function. Those functions can be discerned only by study as we will not have the designer come and explain them to us.\n\n \n What's the intended function of the appendix?\n \n The whole argument that every body part has an \"intended function\", let alone a sole intended function, is a non sequitor. Your inability to fathom that has little bearing on the issue.\n \n If you want to get into arguing design, then you've got a whole new kettle of fish, and that's best left to another thread in the evolution vs. creationism forum. You can't prove that humans were designed any more than I can prove that God doesn't exist.\n \n I'll humour you though, simply because I don't believe you can come up with a strong counterargument to support your position, even if you're granted that gift - \n \n Let's agree that hypothetically, we were designed. My logically arrived at conclusion is that the anus was designed to double as a sexual organ, the conclusion is based on the following basic points -\n \n -things fit together, rather nicely I'm told\n -it provides pleasure to both parties\n -it provides a means to have intercourse without fear of pregnancy\n \n It seems like a darn good idea by whomever designed the human body. Afterall, a good designer is capable of creating a design where each part is capable of many functions. The design is more streamlined and efficient that way.\n \n \nI could be convinced by a logical, truthful argument detailing the trail to a conclusion that the anus has some other intended function.\n\n \n Firstly, it doesn't have to be \"intended\", intended is a word of your creation, and irrelevent.\n \n Secondly, no you couldn't be. You'd bury your head in the sand and disagree regardless, or come up with some bogus personal theory, like you've done here -\n \n I've never received a great deal of pleasure from a bowel movement, relief maybe, but I find the notion of a BM being \"pleasurable\" quite odd. I've certainly never reached orgasm. (That's a bizarre thought. emoticon_xdonno ) \n \n \nSorry. I disagree.\n \n The 'g-spot' argument doesn't convince me either. Sensitivity near the anus is more likely related to the function of the anus in opening and shutting at appropriate times and possibly to attach some bit of a pleasurable feeling to a good BM. I can say from personal experience that I have released many a sigh of relief afterwards\n \n A man's real g-spot is directly below the glans on the underside of the head of the penis. ...sort of like where the 'face' would be under the 'helmet'\n\n \n At any rate, this entire thread started due to you labelling anal sex as being \"deviant\", and has taken on a life of its own from there. The point has been made, definitively, that anal sex is not deviant. You're free to refuse to acknowledge that should you so choose. \n \n I like to think I haven't gone insane as of yet, and I've blown off enough steam, so unless you return with a new, or actually logical, response, I'm finished with this debate.\n \n Waxy", 
   {}, 
   274933, 
   null, 
   1185215580.0
  ], 
  [
   275090, 
   null, 
   "Ohioprof", 
   "No, he's saying by YOUR definition of normal it because a lot of people (gays) are doing it. But these 'debates' about what's normal and what's not never get anywhere, because everyone has their own views of what's normal. There's no official standard. Personally, I don't see the problem of having sex in the way our species is biologically evolved/designed to do as being the norm. (And that's not to say that deviating from that is bad.) And it's evolved that way because that's what propagates the species--reproduction. And I see no reason that shouldn't be the norm even if reproduction as a goal can't take place. Male and female sex organs are made to fit together--that's the point of sex organs. \n\n \n If that is the point of sex organs, what is the point of the clitoris?", 
   {}, 
   274958, 
   null, 
   1185217020.0
  ], 
  [
   275101, 
   null, 
   "MrWriteLA", 
   "What's the single intended purpose of the mouth?\n \n (Remember, there can only be one.)", 
   {}, 
   275090, 
   null, 
   1185217920.0
  ], 
  [
   275102, 
   null, 
   "Ohioprof", 
   "What's the single intended purpose of the mouth?\n \n (Remember, there can only be one.)\n\n \n Oh, I know! The intended purpose of the mouth is to play the harmonica! (People were very frustrated before harmonicas were invented. They just knew their mouths were not fulfilling their intended purpose.)", 
   {}, 
   275101, 
   null, 
   1185218100.0
  ], 
  [
   275111, 
   null, 
   "JSDKoeln", 
   "If that is the point of sex organs, what is the point of the clitoris?\n\n \n You're actually asking one of these het males that? hehe This will be interesting.", 
   {}, 
   275090, 
   null, 
   1185219660.0
  ], 
  [
   275114, 
   null, 
   "samiinh", 
   "You're actually asking one of these het males that? hehe This will be interesting.\n\n \n Perhaps Mr. AA can tell us all about it.", 
   {}, 
   275111, 
   null, 
   1185220260.0
  ], 
  [
   275117, 
   null, 
   "jim's trucking", 
   "You can disagree all you like, and you're free to do so, however, by any definition of \"natural\" or \"normal\", you've failed to prove your point, miserably. \nI think it cannot be proved. This is merely a discussion involving something I call design intent, the rest call accidental evolution.\n \n It is difficult to understand why some cannot grasp the concept of design intent as applies to mammals and their various body parts. Some are easy to figure out. Some are not.\n \n \n\n \n ...\n \n \n \n ...\n \n Why can intimacy logically include caressing with the tongue, but not anal sex? You've completely failed to make a distinction or provide evidence (not personal opinion) in any way as to why one is logical and acceptable, and the other is not. The burden is squarely on you in this case to support your assertions. You haven't been able to do so, all you've done is repeat the mantra of \"intended design\" and attack the intelligence of those who disagree with you, for 5 pages.\nI've stated it too many times already. I gave logical reasons supporting my contention that the penis is not meant for the anus. I have yet to see those reasons invalidated. I have yet to see any reason presented that even hints toward a separately derived function for the anus.\n \n \n \n\n What's the intended function of the appendix?\nI don't know. I've heard it was larger when we ate nothing but raw meat. Perhaps it aids in digestion of raw meat. Perhaps it has evolved into a smaller organ due to our no longer eating much raw meat.\n \n \n \n\n The whole argument that every body part has an \"intended function\", let alone a sole intended function, is a non sequitor. Your inability to fathom that has little bearing on the issue.\nIf you cannot understand that there is an intended function for each bady part, you're totally beyond help. Would you deny that the suckers on octopus tentacles have the function of holding onto things? Would you deny that the hair in your armpit has the function of lubricating the joint? Would you deny that the function of your eyes is to enable vision? Would you deny that the function of your ears is to transpose sound into recognizable brain waves? Would you deny that the function of the lungs is to exchange CO2 and O? WOuld you deny that the function of the vocal cords is to aid in speaking sounds?\n \n Can you not see that somehow a need for each of these functions precipitated the development of parts to perform them? Cannot you fathom this to be an intended function?\n \n Whatever it is that intended the needed function to be provided is unimportant. By SOME method, our bodies came to have all the parts necessary to perform all the functions that they do. Whatever that method was is unimportant, but there can be attached to each function an intent of design.\n \n\n If you want to get into arguing design, then you've got a whole new kettle of fish, and that's best left to another thread in the evolution vs. creationism forum. You can't prove that humans were designed any more than I can prove that God doesn't exist.\nLikely, I can't prove it to you because you'd have to agree that there's a supreme being that designed all this life that we see around us. I can see it no other way. There is a method to this madness. We're not accidental in our evolution from sea life to mammals.\n \n \n \n\n ... \n \n Let's agree that hypothetically, we were designed. My logically arrived at conclusion is that the anus was designed to double as a sexual organ, the conclusion is based on the following basic points -\n \n -things fit together, rather nicely I'm told\n -it provides pleasure to both parties\n -it provides a means to have intercourse without fear of pregnancy\n \n It seems like a darn good idea by whomever designed the human body. Afterall, a good designer is capable of creating a design where each part is capable of many functions. The design is more streamlined and efficient that way.\n \n \nThose uses were discovered by the owners of the bodies rather than intended by the designer...just as we figured out how we could kill someone with a hammer designed to drive nails, or a bat designed to hit baseballs. The intended design is the primary function\n \n \n \n\n Firstly, it doesn't have to be \"intended\", intended is a word of your creation, and irrelevent.\nIf there's no intent everything is accidental. Totally accidental is not the way we came about. There had to be some intent in the development of body parts and placement thereof. The flounder appears sort of odd with both eyes on the same side of a relatively flat fish. The are blind fish in caves who have ceased to need, therefore squelched the development of eyesight...and eyes. (They have only the remnants of eye sockets.)\n \n \n \n\n ....\n \n Waxy\n", 
   {}, 
   275082, 
   null, 
   1185220560.0
  ], 
  [
   275118, 
   null, 
   "jim's trucking", 
   "If that is the point of sex organs, what is the point of the clitoris?\nMy guess is to provide pleasure during the stimulation thereof. It does feel goooooooood, doesn't it...when someone rocks the little man in the boat? I'm also guessing it is the female equivalent to that small area under the glans of the male organ...the one that feels so gooooooood when stimulated properly.", 
   {}, 
   275090, 
   null, 
   1185220980.0
  ], 
  [
   275119, 
   null, 
   "Symbiote", 
   "Perhaps if men continuing having anal sex their penises will evolve to better fit that organ.", 
   {}, 
   275117, 
   null, 
   1185221040.0
  ], 
  [
   275120, 
   null, 
   "jim's trucking", 
   "Perhaps if men continuing having anal sex their penises will evolve to better fit that organ.\nThen that would be the INTENT of the evolutionary machine.\n \n It's not that hard to see that there must be some intent to our design.\n \n Tell your friends about it!", 
   {}, 
   275119, 
   null, 
   1185221400.0
  ], 
  [
   275122, 
   null, 
   "Ohioprof", 
   "I gave logical reasons supporting my contention that the penis is not meant for the anus. I have yet to see those reasons invalidated. I have yet to see any reason presented that even hints toward a separately derived function for the anus.\n \n If you cannot understand that there is an intended function for each bady part, you're totally beyond help. Would you deny that the suckers on octopus tentacles have the function of holding onto things? Would you deny that the hair in your armpit has the function of lubricating the joint? Would you deny that the function of your eyes is to enable vision? Would you deny that the function of your ears is to transpose sound into recognizable brain waves? Would you deny that the function of the lungs is to exchange CO2 and O? WOuld you deny that the function of the vocal cords is to aid in speaking sounds?\n \n Can you not see that somehow a need for each of these functions precipitated the development of parts to perform them? Cannot you fathom this to be an intended function?\n \n Likely, I can't prove it to you because you'd have to agree that there's a supreme being that designed all this life that we see around us. I can see it no other way. There is a method to this madness. We're not accidental in our evolution from sea life to mammals.\n \n Those uses were discovered by the owners of the bodies rather than intended by the designer...just as we figured out how we could kill someone with a hammer designed to drive nails, or a bat designed to hit baseballs. The intended design is the primary function\n \n If there's no intent everything is accidental. Totally accidental is not the way we came about. There had to be some intent in the development of body parts and placement thereof. The flounder appears sort of odd with both eyes on the same side of a relatively flat fish. The are blind fish in caves who have ceased to need, therefore squelched the development of eyesight...and eyes. (They have only the remnants of eye sockets.)\n\n \n You argue that there had to be some intent in the development of the body parts. How do you know this? You think that there must have been an intent, and therefore there must have been a designer having the intent, and therefore you say that anyone who cannot see this is \"totally beyond help.\" But all you have stated is your belief that there is a designer who intended our body parts to have particular functions; you offer no evidence beyond the fact that the body parts happen to be used in certain ways. When they are used in ways you don't approve of, you say this is contrary to the intent of the designer. But it's just your belief about what you think a function of a body part should be, and you attribute your belief to a designer, as intention. \n \n Perhaps there is a God and perhaps there is not. Perhaps this God created the universe to evolve. Perhaps body parts can have multiple functions. This is certainly true of the mouth, isn't it? We use it to eat, to speak, to give and receive pleasure, to sing, to hold things, to express happiness and sadness....the list can go on. Which of these did your presumed designer \"intend?\" The clitoris, on the other hand, has no other apparent function than to give pleasure to women. It is not used for reproduction, and yet it is a sex organ. Is that what your presumed designer \"intended?\" Perhaps the anus has several functions, notably to eliminate waste and to give pleasure. If your presumed designer intended the clitoris to give pleasure, why couldn't your presumed designer likewise intend the anus to give pleasure. \n \n Your argument contain quite a few assumptions. You assume a designer with specific intentions for body parts. You can believe that, but it's just your belief. There is no evidence to support this belief. Others may assume a designer that let species evolve according to random selection. Still others may assume no designer at all.", 
   {}, 
   275117, 
   null, 
   1185221520.0
  ], 
  [
   275123, 
   null, 
   "Ohioprof", 
   "Then that would be the INTENT of the evolutionary machine.\n \n It's not that hard to see that there must be some intent to our design.\n \n Tell your friends about it!\n\n \n What is the \"evolutionary machine,\" and how do you know it has \"intent?\"", 
   {}, 
   275120, 
   null, 
   1185221580.0
  ], 
  [
   275125, 
   null, 
   "Ohioprof", 
   "My guess is to provide pleasure during the stimulation thereof. It does feel goooooooood, doesn't it...when someone rocks the little man in the boat? I'm also guessing it is the female equivalent to that small area under the glans of the male organ...the one that feels so gooooooood when stimulated properly.\n\n \n Yeah, it gives pleasure. The clitoris has no direct role in reproduction. We have sex organs that serve no function in reproduction; they just give people pleasure.\n \n And if that is so, why can't the anus be viewed as a sex organ that also gives pleasure, since it does give pleasure to many people? Or is the problem that you disapprove of pleasure involving the anus while you approve of pleasure involving the clitoris?", 
   {}, 
   275118, 
   null, 
   1185221880.0
  ], 
  [
   275126, 
   null, 
   "sinjin", 
   "If that is the point of sex organs, what is the point of the clitoris?\nTo get you to sit still long enough to possibly be impregnated.emoticon_emb Just a guess.emoticon_xlove", 
   {}, 
   275090, 
   null, 
   1185221940.0
  ], 
  [
   275127, 
   null, 
   "samiinh", 
   "Then that would be the INTENT of the evolutionary machine.\n \n It's not that hard to see that there must be some intent to our design.\n \n Tell your friends about it!\n\n \n You have me confused. do you believe in evolution or intelligent design or both?", 
   {}, 
   275120, 
   null, 
   1185222360.0
  ], 
  [
   275129, 
   null, 
   "thelmoose", 
   " \n Would you deny that the hair in your armpit has the function of lubricating the joint? \n\n \n What kind of mind has thoughts like this?", 
   {}, 
   275117, 
   null, 
   1185223200.0
  ], 
  [
   275136, 
   null, 
   "Waxy", 
   "What kind of mind has thoughts like this?\n\n \n A closed one.\n \n This entire argument boils down to \"god's intention\" unfortunately, and as such, logic and rationality will never really have anything to do with it, they never did.\n \n It's a perfect example of how otherwise seemingly rational and logical people become completely illogical and irrational, often being forced to willfully abandon those traits, when religious faith becomes involved.\n \n Waxy", 
   {}, 
   275129, 
   null, 
   1185224580.0
  ], 
  [
   275137, 
   null, 
   "thelmoose", 
   "A closed one.\n \n This entire argument boils down to \"god's intention\" unfortunately, and as such, logic and rationality will never really have anything to do with it, they never did.\n \n It's a perfect example of how otherwise seemingly rational and logical people become completely illogical and irrational, often being forced to willfully abandon those traits, when religious faith becomes involved.\n \n Waxy\n\n \n I agree and moreover, I think it reflects the lack of examination of the opinions one professes. That silly armpit thing came from somewhere and Jim blithely parroted it without evaluating the meaning. It is obviously ludicrous and yet he typed it in as though it was obviously fact. And that's just an unimportant piece of trivia. The consequences of the inability or unwillingness or the failure to see the importance in engaging in the constant examination of one's larger philosophical opinions that reflect your world view can be very damaging to oneself and others. It is intellectual retardation.", 
   {}, 
   275136, 
   null, 
   1185225060.0
  ], 
  [
   275168, 
   null, 
   "jim's trucking", 
   "You argue that there had to be some intent in the development of the body parts. How do you know this?\nI'm guessing...based on logic.\n \n \n You think that there must have been an intent, and therefore there must have been a designer having the intent, and therefore you say that anyone who cannot see this is \"totally beyond help.\" \nIn this regard, yes..beyond help. They will never be convinced that there is some method by which body parts evolve in certain ways on certain animals. Logically it cannot be random or some method by which the parts are made then a function established by the user.\n \n Whether it was God, a god or the mental power of the animal wishing it had certain features...I don't know. SOMETHING besides randomness made us (and each other animal) the way we are.\n \n \nBut all you have stated is your belief that there is a designer who intended our body parts to have particular functions; you offer no evidence beyond the fact that the body parts happen to be used in certain ways. \nI think we developed body parts to fullfill the various needs of the body. For instance, the organism needed something to pump blood throughout...so there was developed a heart and circulatory system. The organism needed something to exchange oxygen and carbon dioxide...the lungs were developed.\n \n You sound as if the parts came along then the organism found a use for them. I think the need came first, then the development of the organ. This implies that SOMETHING fashioned the organ so that it would perform the desired function. Whether it was a single supreme being or the implementation of successful mind over matter...I don't know. I have no ironclad belief regarding what the method of development was...but something happened to make the organs fit their need in the body.\n \n \nWhen they are used in ways you don't approve of, you say this is contrary to the intent of the designer.\nI don't believe I've approved of disapproved of anything of the sort. I have said that I think some (of our creative uses) are not intended. \n \n \nBut it's just your belief about what you think a function of a body part should be, and you attribute your belief to a designer, as intention.\nI attribute my belief in a designer to logic. Either the animals were designing themselves (more likely than an outside source designing all animals) or there's something else that controls how we change over time.\n \n I read of some animals that adjust there family sizes depending on whether food is plentiful or in short supply. Plenty of food, they have three or four young at a time. Short supply, they have two. Something within the animal is determining this.\n \n Stepping away from mammals for a while, how do you think it is that most small poisonous animals advertize their danger to others by having bright colors on their exteriors? IIRC, the most poisonous frog in the world is a tiny, extremely bright green frog. The gila monster has orange markings (I think). The corral snake (a relatively small snake) has red and yellow adjacent rings. [There's another similar but non-poisonous snake that has the same three colored rings but in its case, red and black are adjacent. How do you suppose that snake came to mimic the corral snake? Was it by accident?] How is it that the puffer fish developed spiny elastic skin that would allow it to swell up like a beach ball when threatened or eaten? [I watched a video of a large grouper swallowing a puffer fish, then spitting out the puffed up ball of spines.]\n \n Did all of these things happen by accident?\n \n I think not. \n \n \n\n Perhaps there is a God and perhaps there is not.\nPerhaps.\n \n \n Perhaps this God created the universe to evolve. Perhaps body parts can have multiple functions. \nPerhaps they can. Some definitely do.\n \n \nThis is certainly true of the mouth, isn't it? We use it to eat, to speak, to give and receive pleasure, to sing, to hold things, to express happiness and sadness....the list can go on. \nTrue.\n \n The hands come to mind also...although their main function seems to be to grasp or just touch things so that those things can be moved. We've learn how to sign with them, caress with them, scratch with them (with the nails provided with them)\n \n \nWhich of these did your presumed designer \"intend?\" The clitoris, on the other hand, has no other apparent function than to give pleasure to women. It is not used for reproduction, and yet it is a sex organ. Is that what your presumed designer \"intended?\"\nLikely so...and you have agreed that some parts have only one apparent function.\n \n \n Perhaps the anus has several functions, notably to eliminate waste and to give pleasure. \nI'm doubting that based on the fact that the vagina is obviously meant to receive the penis during intercourse, giving pleasure to both male and female with the sensitivity given to each of those organs. \n \n \nIf your presumed designer intended the clitoris to give pleasure, why couldn't your presumed designer likewise intend the anus to give pleasure.\nIt just doesn't seem plausible to me. \n \n \n \n\n Your argument contain quite a few assumptions. You assume a designer with specific intentions for body parts. You can believe that, but it's just your belief. There is no evidence to support this belief. Others may assume a designer that let species evolve according to random selection. Still others may assume no designer at all.\nQuite true. People can believe what they wish to. I'm not saying that I am positive that what I say is the way it is. All I'm saying is that my explanations make more sense to me than most all of what you and others have said about this issue of design intent.\n \n I cannot believe that parts came about and then we figured out what to do with them...such as livers, kidneys, retinas, gall bladders, spleens (what does your spleen do anyway?), ear lobes, eye lashes (what do you think they're for? I think it's to keep water droplets out of your eyes. I bet you think they're for extending and curling.)\n \n Why do cats have long whiskers? Why do some birds have short beaks and others have long ones? How did the angler fish come to have a pole and lure growing out of the center of its head? How did waterfowl come to have webbed feet while other birds have talons? Why do venomous snakes have hollow fangs? How did the skunk come to use a pungent spray to escape danger.\n \n I believe there's SOMETHING within each species that makes up for needs by altering the genetic code to produce the 'desired' trait. (intended)", 
   {}, 
   275122, 
   null, 
   1185232800.0
  ], 
  [
   275174, 
   null, 
   "jim's trucking", 
   "What is the \"evolutionary machine,\" and how do you know it has \"intent?\"\nIt is the complicated mechanism by which animals evolve to fit their environment. If finches inhabit an island and find thick hard flower seeds to eat, their beaks will evolve into thicker shorter beaks for breaking that hard seed. (I believe this has been documented.)\n \n Even grass that normally grows tall to seed out will alter its growth pattern if you keep it mowed really short.", 
   {}, 
   275123, 
   null, 
   1185233340.0
  ], 
  [
   275180, 
   null, 
   "lesz", 
   "It is the complicated mechanism by which animals evolve to fit their environment. If finches inhabit an island and find thick hard flower seeds to eat, their beaks will evolve into thicker shorter beaks for breaking that hard seed. (I believe this has been documented.)\n \n Even grass that normally grows tall to seed out will alter its growth pattern if you keep it mowed really short.\n\n \n This may come as news to you, but gay people aren't finches. We are just as evolved as you.", 
   {}, 
   275174, 
   null, 
   1185235440.0
  ], 
  [
   275183, 
   null, 
   "thelmoose", 
   "It is the complicated mechanism by which animals evolve to fit their environment. If finches inhabit an island and find thick hard flower seeds to eat, their beaks will evolve into thicker shorter beaks for breaking that hard seed. (I believe this has been documented.)\n \n Even grass that normally grows tall to seed out will alter its growth pattern if you keep it mowed really short.\n\n \n You seem to have a misunderstanding of evolution, which might explain why you have this concept of evolutionary \"intent.\" Genetic changes in a species do not occur because the organism \"wishes\" or \"needs\" it to be so. Normal genetic variation within a species allows some members to be more or less likely to reproduce. Finches didn't grow different beaks because they needed to. The members of the group that already had genetically different beaks that were better at chomping hard seeds got more food into them and were more likely to pass on their genetic characteristics (that is, because they didn't starve to death before reproducing) than those with flimsier beaks. [I vaguely recall the study you are talking about and if I have the details wrong, the evolutionary concepts are correct.)\n \n Pruning plants to alter their growth habit (or mowing grass shorter) is another thing altogether is merely a characteristic of normal plant physiology. It has nothing to do with evolution. Get thee back to biology class. \n \n I am trying to say, there is no such thing as some kind of intention that led or encouraged one evolutionary path over another. \n \n However, even if there was, how are we supposed to know it?\n \n Double however, even if we knew it, why can't we use our body any old way we want to and let that still be considered normal?", 
   {
    "unicode_changes_made": true
   }, 
   275174, 
   null, 
   1185236400.0
  ], 
  [
   275202, 
   null, 
   "samiinh", 
   "Many body parts perform more than one function. For example, take the penis. It eliminates waste water as well is used in sexual activity. Why then can't the anus also function in both capacity.", 
   {}, 
   275183, 
   null, 
   1185243240.0
  ], 
  [
   275247, 
   null, 
   "jim's trucking", 
   "You seem to have a misunderstanding of evolution, which might explain why you have this concept of evolutionary \"intent.\" Genetic changes in a species do not occur because the organism \"wishes\" or \"needs\" it to be so. Normal genetic variation within a species allows some members to be more or less likely to reproduce. Finches didn't grow different beaks because they needed to. The members of the group that already had genetically different beaks that were better at chomping hard seeds got more food into them and were more likely to pass on their genetic characteristics (that is, because they didn't starve to death before reproducing) than those with flimsier beaks. [I vaguely recall the study you are talking about and if I have the details wrong, the evolutionary concepts are correct.)\n \n Pruning plants to alter their growth habit (or mowing grass shorter) is another thing altogether is merely a characteristic of normal plant physiology. It has nothing to do with evolution. Get thee back to biology class. \n \n I am trying to say, there is no such thing as some kind of intention that led or encouraged one evolutionary path over another. \n \n However, even if there was, how are we supposed to know it?\n \n Double however, even if we knew it, why can't we use our body any old way we want to and let that still be considered normal?\nNeither you nor anyone else here has disproved what I've said regarding a driving force behind the 'design' of animals. There is a design mechanism for each animal. Whether it is a common thing pointing toward the existense of God or an individual thing whereby each animal adapts its own physical construction to satisfy individual needs does not matter. There is something that designed us and is continuously, albeit slowly perfecting the design. (Are you aware that our appendices are smaller now than in the days when we ate raw meat of a regular basis?) The same is true for all animals.", 
   {
    "unicode_changes_made": true
   }, 
   275183, 
   null, 
   1185292440.0
  ], 
  [
   275249, 
   null, 
   "Ohioprof", 
   "Neither you nor anyone else here has disproved what I've said regarding a driving force behind the 'design' of animals. There is a design mechanism for each animal. Whether it is a common thing pointing toward the existense of God or an individual thing whereby each animal adapts its own physical construction to satisfy individual needs does not matter. There is something that designed us and is continuously, albeit slowly perfecting the design.\n\n \n This is your belief, but there is no evidence that this is true. It's religious belief, apparently, or else a belief that you plucked out of the air. Scientists can seek to explain how life evolves, but whether there is a \"designer\" or not is a religious question, not a question that science can answer.", 
   {}, 
   275247, 
   null, 
   1185293100.0
  ], 
  [
   275254, 
   null, 
   "Waxy", 
   "Many body parts perform more than one function. For example, take the penis. It eliminates waste water as well is used in sexual activity. Why then can't the anus also function in both capacity.\n\n \n LOL. That hadn't even occurred to me. I'll be interested to hear jim's take on this one. :p\n \n Waxy", 
   {}, 
   275202, 
   null, 
   1185294900.0
  ], 
  [
   275255, 
   null, 
   "thelmoose", 
   "Neither you nor anyone else here has disproved what I've said regarding a driving force behind the 'design' of animals. There is a design mechanism for each animal. Whether it is a common thing pointing toward the existense of God or an individual thing whereby each animal adapts its own physical construction to satisfy individual needs does not matter. There is something that designed us and is continuously, albeit slowly perfecting the design. (Are you aware that our appendices are smaller now than in the days when we ate raw meat of a regular basis?) The same is true for all animals.\n\n \n You present your position without any evidence. It is not up to us to disprove your invented ideas. What evidence do you have to support your argument?\n \n You have made it clear you don't understand evolution, or biology for that matter- from grasses to armpits that lubricate shoulder joints and now some story about the appendix and meat. You credibility in this matter is therefore rather low. Why should anyone put any credence behind these ideas of yours, given this tendency to make these false statements?", 
   {}, 
   275247, 
   null, 
   1185295500.0
  ], 
  [
   275256, 
   null, 
   "Waxy", 
   "I am trying to say, there is no such thing as some kind of intention that led or encouraged one evolutionary path over another. \n\n \n Exactly.\n \n No \"design mechanism\" for animals exists, at least not one that can be identified or proven in any way. Evolution is not a \"goal based\" system, it is a system of opportunity and adaptation.\n \n Maybe jim and wascallywabbit should get together and write a book. Apparently they both believe that evolution is driven by the organism itself \"desiring\" a change and affecting it's own genetic code to work toward that change. Jim can throw in a little ID theory to spice things up.\n \n Of course, it would contrary to thoughts and data of the vast majority of evolutionary biologists, but who's to say it's wrong... emoticon_rolleyes\n \n At any rate, the last couple posts have certainly shed some light onto the thought processes involved here.\n \n Waxy", 
   {}, 
   275183, 
   null, 
   1185295500.0
  ], 
  [
   275331, 
   null, 
   "jim's trucking", 
   "Many body parts perform more than one function. For example, take the penis. It eliminates waste water as well is used in sexual activity. Why then can't the anus also function in both capacity.\n\n \n \nLOL. That hadn't even occurred to me. I'll be interested to hear jim's take on this one. :p\n \n Waxy\n\n \n Waxy, had you read this thread (or maybe it's in the Natural thread) thoroughly, you would have seen that I already wrote a 'take' on that. I said that the penis had multiple functions. (urination and sex) I said that the vagina had multiple functions. (urination, sex and birth) These multiple functions can be recognized by observation and study. We had no choice in defining these functions. They were included in the package when we were born. Those functions were INTENDED by whatever it is that shaped us. I can discern only one obviously intended function of the anus.\n \n \nThis is your belief, but there is no evidence that this is true. It's religious belief, apparently, or else a belief that you plucked out of the air. Scientists can seek to explain how life evolves, but whether there is a \"designer\" or not is a religious question, not a question that science can answer.\nThere is no evidence that it is not true. Religion has little to do with it. I gave the option of believing that the design was by God or by some other thing. Whether there is a designer or not is not a religious question. I believe it to be obvious that there must be something in existence that causes animals to be shaped and to function as they do. There's no need to attach Divinity to it just to oppose the argument that such a thing exists.\n \n \n \n \nExactly.\n \n No \"design mechanism\" for animals exists, at least not one that can be identified or proven in any way. Evolution is not a \"goal based\" system, it is a system of opportunity and adaptation.\n \n Maybe jim and wascallywabbit should get together and write a book. Apparently they both believe that evolution is driven by the organism itself \"desiring\" a change and affecting it's own genetic code to work toward that change. Jim can throw in a little ID theory to spice things up.\n \n Of course, it would contrary to thoughts and data of the vast majority of evolutionary biologists, but who's to say it's wrong... emoticon_rolleyes\n \n At any rate, the last couple posts have certainly shed some light onto the thought processes involved here.\n \n Waxy\nThe simple fact that neither you nor I understand how it works doesn't mean that it doesn't exist.\n \n Nobody has answered any of my questions about animal construction.\n \n Maybe if you could successfully answer just one, I'd be rethinking the existence of a design mechanism.\n \n Try this one:\n \n How did the markings on the back wings of a Speckled Emperor Moth come about?\n \n http://seabed.nationalgeographic.com/ngm/wallpaper3.tmpl?issue_id=20060801&week=1&priority=1\n \n How was information encoded to the moth dna to make hairs grow on its wings in the color pattern necessary to produce the illusion of a mammal's face? Was this by accident?\n \n If not by accident, it must have been by design.\n \n Can you explain otherwise?\n \n Please try, oh ye that seem to know it all. Enlighten me.", 
   {}, 
   275256, 
   null, 
   1185315900.0
  ], 
  [
   275335, 
   null, 
   "jim's trucking", 
   "You present your position without any evidence. It is not up to us to disprove your invented ideas. What evidence do you have to support your argument?\n \n You have made it clear you don't understand evolution, or biology for that matter- from grasses to armpits that lubricate shoulder joints and now some story about the appendix and meat. You credibility in this matter is therefore rather low. Why should anyone put any credence behind these ideas of yours, given this tendency to make these false statements?\nThe hair lubricates the arm pit, not the shoulder joint. It keeps the skin from chaffing under the arms. The same is true for pubic area hair and the hair around your anus. It 'lubricates'.\n \n Surely, you don't think I meant that it lubricates the bone sockets! Jesus! That would be a stretch!\n \n The hair rolls over when the skin is rubbed back and forth in the course of walking and swinging one's arms. It provides a dry lubricant that hangs with you through thick and thin.", 
   {}, 
   275255, 
   null, 
   1185316680.0
  ], 
  [
   275342, 
   null, 
   "thelmoose", 
   "The hair lubricates the arm pit, not the shoulder joint. It keeps the skin from chaffing under the arms. The same is true for pubic area hair and the hair around your anus. It 'lubricates'.\n \n Surely, you don't think I meant that it lubricates the bone sockets! Jesus! That would be a stretch!\n \n The hair rolls over when the skin is rubbed back and forth in the course of walking and swinging one's arms. It provides a dry lubricant that hangs with you through thick and thin.\n\n \n You said\n \nWould you deny that the hair in your armpit has the function of lubricating the joint? \n\n \n Pardon me for taking you literally. \n I should have known what you meant based upon the accuracy of your other biological knowledge.\n \n Also, I didn't know that hair was a particularly good lubricant. And a \"dry\" lubricant at that! Live and learn. I guess that's why my hat falls off all the time. Damn slippery hair! You are a fount of knowledge, Jim. I can see how fruitful further discussion is going to be. Adios for now.", 
   {}, 
   275335, 
   null, 
   1185317820.0
  ], 
  [
   275343, 
   null, 
   "Waxy", 
   "Waxy, had you read this thread (or maybe it's in the Natural thread) thoroughly, you would have seen that I already wrote a 'take' on that. I said that the penis had multiple functions. (urination and sex) I said that the vagina had multiple functions. (urination, sex and birth) These multiple functions can be recognized by observation and study. We had no choice in defining these functions. They were included in the package when we were born. Those functions were INTENDED by whatever it is that shaped us. I can discern only one obviously intended function of the anus.\n\n \n No, you simply refuse to acknowledge that there is, or even may be, another intended function of the anus.\n \n I can recognize this additional function very simply through observation and study. \n \n I'm not sure what \"choice\" has to do with it, especially given your previously posted stance on oral sex, etc...\n \n \nThe simple fact that neither you nor I understand how it works doesn't mean that it doesn't exist.\n \n Nobody has answered any of my questions about animal construction.\n \n Maybe if you could successfully answer just one, I'd be rethinking the existence of a design mechanism.\n \n Try this one:\n \n How did the markings on the back wings of a Speckled Emperor Moth come about?\n \n http://seabed.nationalgeographic.com/ngm/wallpaper3.tmpl?issue_id=20060801&week=1&priority=1\n \n How was information encoded to the moth dna to make hairs grow on its wings in the color pattern necessary to produce the illusion of a mammal's face? Was this by accident?\n \n If not by accident, it must have been by design.\n \n Can you explain otherwise?\n \n Please try, oh ye that seem to know it all. Enlighten me.\n\n \n Obviously many have failed before me, but I'll try nonetheless.\n \n Coles notes version - \n \n Moths are being preyed upon.\n \n Over the course of time, random mutations (accidents) in moth's genetic code produce hairs on its back in various patterns and shapes. Some of these patterns turn out to be quite beneficial, as they reduce predation, and those particular moths have a greater survival and reproduction rate. As a result, they pass on this successful pattern to their offspring. Over time, and countless generations of moths, the coloring pattern is altered by genetic mutation until comes to exist as we observe it today.\n \n If the moth's environment changes, the current pattern may in fact become a disadvantage, and those moths in which the current pattern is poorly developed or different would then possibly have a much greater survival rate.\n \n Evolution is in no way guided or goal oriented, it's fluid in nature - it's a function of genetic mutation and natural selection. The organism doesn't have a final physical shape or camoflauge pattern as a goal or a preset design, the particular pattern is selected for by it's environment. \n \n In an abstract way I suppose you could say a combination of genetic accidents and an organism's environment are it's designers, as genetic code and it's interaction with the environment will ultimately determine it's success, and physiology.\n \n This is VERY elementary stuff. Google \"peppered moths\" for a similarly elementary explanation of moth evolution through camoflauge and color pattern. \n \n I'm sure there are others on this board that could give you a far more detailed description, right down to the \"nuts and bolts\" so to speak, should you genuinely be interested in increasing your understanding of the subject.\n \n Waxy", 
   {}, 
   275331, 
   null, 
   1185318300.0
  ], 
  [
   275345, 
   null, 
   "jim's trucking", 
   "You said\n \n \n Pardon me for taking you literally. \n I should have known what you meant based upon the accuracy of your other biological knowledge.\n \n Also, I didn't know that hair was a particularly good lubricant. And a \"dry\" lubricant at that! Live and learn. I guess that's why my hat falls off all the time. Damn slippery hair!\nYou should have known what I meant since you know that the hair is on the outside of the skin and could not possibly lubricate the bone socket. Pardon me for thinking you would understand. \n \n Hairs (not beard stubble) of sufficient length will act as a lubricant by decreasing the friction between the two pieces of skin being rubbed together. They roll and move between the two. Try rubbing your hand on a completely bald head, then rubbing it on a full head of hair. You'll see the difference.\n \n Rub the bald head really fast and it'll heat up the skin of both your hand and the head being rubbed. Rub a full head of hair the same way and you'll see the difference. Try this and then come back and tell me hair doesn't lubricate.\n \n You're obviously associating the word 'lubricant' with a need to be greasy. Please be aware that dry baby powder is a lubricant.", 
   {}, 
   275342, 
   null, 
   1185318600.0
  ], 
  [
   275349, 
   null, 
   "jim's trucking", 
   "No, you simply refuse to acknowledge that there is, or even may be, another intended function of the anus.\nAre you agreeing that the single function I identified is intended?\n \n \n\n I can recognize this additional function very simply through observation and study. \nBY study of animal activity...not by study of the anatomy of the male and female animals. You're conjuring an intended function from observations of what animals and people choose to do with each other.\n \n \n...\n \n \n \n Obviously many have failed before me, but I'll try nonetheless.\n \n Coles notes version - \n \n Moths are being preyed upon.\n \n Over the course of time, random mutations (accidents) in moth's genetic code produce hairs on its back in various patterns and shapes. Some of these patterns turn out to be quite beneficial, as they reduce predation, and those particular moths have a greater survival and reproduction rate. As a result, they pass on this successful pattern to their offspring. Over time, and countless generations of moths, the coloring pattern is altered by genetic mutation until comes to exist as we observe it today.\n \n If the moth's environment changes, the current pattern may in fact become a disadvantage, and those moths in which the current pattern is poorly developed or different would then possibly have a much greater survival rate.\n \n Evolution is in no way guided or goal oriented, it's fluid in nature - it's a function of genetic mutation and natural selection. The organism doesn't have a final physical shape or camoflauge pattern as a goal or a preset design, the particular pattern is selected for by it's environment. \n \n In an abstract way I suppose you could say a combination of genetic accidents and an organism's environment are it's designers, as genetic code and it's interaction with the environment will ultimately determine it's success, and physiology.\n \n This is VERY elementary stuff. Google \"peppered moths\" for a similarly elementary explanation of moth evolution through camoflauge and color pattern. \n \n I'm sure there are others on this board that could give you a far more detailed description, right down to the \"nuts and bolts\" so to speak, should you genuinely be interested in increasing your understanding of the subject.\n \n Waxy\nIt's hard to believe you didn't provide a link to this. It's not likely I'll accept unsubstantiated (by scientific evidence) claims that it's accidental.\n \n There's a snake that appears to have another head where his tail should be (and actually is). I suppose this is purely accidental also.", 
   {}, 
   275343, 
   null, 
   1185319260.0
  ], 
  [
   275358, 
   null, 
   "samiinh", 
   "You should have known what I meant since you know that the hair is on the outside of the skin and could not possibly lubricate the bone socket. Pardon me for thinking you would understand. \n \n Hairs (not beard stubble) of sufficient length will act as a lubricant by decreasing the friction between the two pieces of skin being rubbed together. They roll and move between the two. Try rubbing your hand on a completely bald head, then rubbing it on a full head of hair. You'll see the difference.\n \n Rub the bald head really fast and it'll heat up the skin of both your hand and the head being rubbed. Rub a full head of hair the same way and you'll see the difference. Try this and then come back and tell me hair doesn't lubricate.\n \n You're obviously associating the word 'lubricant' with a need to be greasy. Please be aware that dry baby powder is a lubricant.\n\n \n I have often wondered what all that body hair was for.", 
   {}, 
   275345, 
   null, 
   1185321120.0
  ], 
  [
   275361, 
   null, 
   "Waxy", 
   "Are you agreeing that the single function I identified is intended?\n \n BY study of animal activity...not by study of the anatomy of the male and female animals. You're conjuring an intended function from observations of what animals and people choose to do with each other.\n\n \n I'm done with this, I'm not sure why I even responded the last time. \n \n Twist it and think as you will. I'm beyond caring.\n \n \nIt's hard to believe you didn't provide a link to this. It's not likely I'll accept unsubstantiated (by scientific evidence) claims that it's accidental.\n \n There's a snake that appears to have another head where his tail should be (and actually is). I suppose this is purely accidental also.\n\n \n A link to what? A biology text book? One of hundreds of threads in the evo vs. creation forum where the mechanics of genetic mutation and natural selection are explained in excruciating detail? Do you not have a search engine on your computer?\n \n Don't be so intellectually lazy and obstinate. I'm not your high school teacher. If you want more, go and find it. Better yet, go to your local community college and sign up for an elementary biology course. \n \n However, I suspect ignorance is bliss.\n \n Waxy", 
   {}, 
   275349, 
   null, 
   1185321480.0
  ], 
  [
   275363, 
   null, 
   "thelmoose", 
   "I have often wondered what all that body hair was for.\n\n \n Now you know. \n \n I guess that's why swimmers shave their body hair, to increase friction in the water. \n I guess that's why the hair rubs off the skin that chronically rubs against clothing, because it's such a good lubricant. \n Not only is hair a good lubricant, that is its intended use!", 
   {}, 
   275358, 
   null, 
   1185321780.0
  ], 
  [
   275391, 
   null, 
   "Ohioprof", 
   "Waxy, had you read this thread (or maybe it's in the Natural thread) thoroughly, you would have seen that I already wrote a 'take' on that. I said that the penis had multiple functions. (urination and sex) I said that the vagina had multiple functions. (urination, sex and birth) These multiple functions can be recognized by observation and study. We had no choice in defining these functions. They were included in the package when we were born. Those functions were INTENDED by whatever it is that shaped us. I can discern only one obviously intended function of the anus.\n \n There is no evidence that it is not true. Religion has little to do with it. I gave the option of believing that the design was by God or by some other thing. Whether there is a designer or not is not a religious question. I believe it to be obvious that there must be something in existence that causes animals to be shaped and to function as they do. There's no need to attach Divinity to it just to oppose the argument that such a thing exists.\n \n \n \n The simple fact that neither you nor I understand how it works doesn't mean that it doesn't exist.\n \n Nobody has answered any of my questions about animal construction.\n \n Maybe if you could successfully answer just one, I'd be rethinking the existence of a design mechanism.\n \n Try this one:\n \n How did the markings on the back wings of a Speckled Emperor Moth come about?\n \n http://seabed.nationalgeographic.com/ngm/wallpaper3.tmpl?issue_id=20060801&week=1&priority=1\n \n How was information encoded to the moth dna to make hairs grow on its wings in the color pattern necessary to produce the illusion of a mammal's face? Was this by accident?\n \n If not by accident, it must have been by design.\n \n Can you explain otherwise?\n \n Please try, oh ye that seem to know it all. Enlighten me.\n\n \n \"You see, my dear Candide,\" said the teacher Pangloss. \"Everything is designed to happen exactly as it happens. It's the intention of the designer. This is the best of all possible worlds.\"\n \n \"Then why, good teacher, did that man fall into the sea and drown?\"\n \n \"Ah, you must understand that the sea was put there precisely for the man to drown in! That was the intent of the designer. This is, after all, the best of all possible worlds.\"", 
   {}, 
   275331, 
   null, 
   1185337680.0
  ], 
  [
   275437, 
   null, 
   "samiinh", 
   "Now you know. \n \n I guess that's why swimmers shave their body hair, to increase friction in the water. \n I guess that's why the hair rubs off the skin that chronically rubs against clothing, because it's such a good lubricant. \n Not only is hair a good lubricant, that is its intended use!\n\n \n You might have thought \"the designer\" could have come up with a better way. Of course, if you're into bears, I suppose you're happy with this design.", 
   {}, 
   275363, 
   null, 
   1185371760.0
  ], 
  [
   275451, 
   null, 
   "jim's trucking", 
   "Now you know. \n \n I guess that's why swimmers shave their body hair, to increase friction in the water. \nThe pit hair reduces friction between two areas of skin being rubbed together, not between skin and water.\n \n \n\n I guess that's why the hair rubs off the skin that chronically rubs against clothing, because it's such a good lubricant. \nQuite true. Excessive rubbing will pull the hairs out.\n \n\n Not only is hair a good lubricant, that is its intended use!\nOne of them as related to the arm pits and the leg pit.\n \n \n http://www.everything2.com/index.pl?node_id=640082\n \n http://www.bernsteinmedical.com/hair-loss/functions-of-hair.php\n \n http://www.goaskalice.columbia.edu/1930.html\n \n http://tights-for-men.com/catalog/faq.php\n \n \n I don't expect you to take my word for it.", 
   {}, 
   275363, 
   null, 
   1185380460.0
  ], 
  [
   275452, 
   null, 
   "jitobear", 
   "The pit hair reduces friction between two areas of skin being rubbed together, not between skin and water.\n \n Quite true. Excessive rubbing will pull the hairs out.\n One of them as related to the arm pits and the leg pit.\n \n \n http://www.everything2.com/index.pl?node_id=640082\n \n http://www.bernsteinmedical.com/hair-loss/functions-of-hair.php\n \n http://www.goaskalice.columbia.edu/1930.html\n \n http://tights-for-men.com/catalog/faq.php\n \n \n I don't expect you to take my word for it.\n\n \n Are you saying we broads shold stop shaving? :p", 
   {}, 
   275451, 
   null, 
   1185383160.0
  ], 
  [
   275453, 
   null, 
   "samiinh", 
   "Are you saying we broads shold stop shaving? :p\n\n \n NO. Hairy women are very unattractive, IMHO.", 
   {}, 
   275452, 
   null, 
   1185383580.0
  ], 
  [
   275454, 
   null, 
   "thelmoose", 
   "Are you saying we broads shold stop shaving? :p\n\n \n You should stop shaving armpits because that hair is needed to lubricate something. Do not shave your legs because otherwise your socks won't stay up.", 
   {}, 
   275452, 
   null, 
   1185383640.0
  ], 
  [
   275455, 
   null, 
   "jim's trucking", 
   "Are you saying we broads should stop shaving? :p\nNot at all. Personally, I prefer smooth skin. I'm just providing proof that I didn't just dream up the lubricant feature.\n \n Besides...I know a man who shaves his armpits, too...says it's a hygiene thing...he hates to stink. I just gob on the deodorant.", 
   {}, 
   275452, 
   null, 
   1185384660.0
  ], 
  [
   275488, 
   null, 
   "sinjin", 
   "Not at all. Personally, I prefer smooth skin. I'm just providing proof that I didn't just dream up the lubricant feature.\n \n Besides...I know a man who shaves his armpits, too...says it's a hygiene thing...he hates to stink. I just gob on the deodorant.\nI do this. My Tahitian friend said it's the way to go in hot weather. Lots of guys do it there. Works well and my wife digs it.\n \n And yes to your next question too.", 
   {}, 
   275455, 
   null, 
   1185406140.0
  ], 
  [
   275490, 
   null, 
   "Big Orn", 
   "And yes to your next question too.\n\n \n emoticon_xdonno :p \n \n You ain't afraid of erosion in times of flood, sinjin? emoticon_rolleyes emoticon_xclown", 
   {}, 
   275488, 
   null, 
   1185407040.0
  ], 
  [
   275493, 
   null, 
   "sinjin", 
   "emoticon_xdonno :p \n \n You ain't afraid of erosion in times of flood, sinjin? emoticon_rolleyes emoticon_xclown\nSharp steel is the handmaid of natural selection.", 
   {}, 
   275490, 
   null, 
   1185408360.0
  ], 
  [
   275494, 
   null, 
   "Big Orn", 
   "Sharp steel is the handmaid of natural selection.\n\n \n WAGH!!! \n \n I do have a good pair of hip waders handy...not that your spreading that BS too thick or nuthin, but....emoticon_rolleyes :p", 
   {}, 
   275493, 
   null, 
   1185408900.0
  ], 
  [
   275535, 
   null, 
   "Coyote", 
   "I can discern only one obviously intended function of the anus.\n\n \n Tsk, tsk. Such a lack of imagination.", 
   {}, 
   275331, 
   null, 
   1185479460.0
  ], 
  [
   276451, 
   null, 
   "samiinh", 
   "If The Homosexual Agenda is all-powerful and all-consuming, why are we still second-class taxpaying citizens in our own nation? We do not have marriage equality, in many places we can still be fired from a job for being gay, we cannot serve openly in the military; in some states, such as Florida, we cannot adopt or foster children, the list goes on and on.\n http://www.pamshouseblend.com/showDiary.do?diaryId=48", 
   {}, 
   275535, 
   null, 
   1186319340.0
  ], 
  [
   276455, 
   null, 
   "Archangel", 
   "If The Homosexual Agenda is all-powerful and all-consuming, why are we still second-class taxpaying citizens in our own nation? We do not have marriage equality, in many places we can still be fired from a job for being gay, we cannot serve openly in the military; in some states, such as Florida, we cannot adopt or foster children, the list goes on and on.\n http://www.pamshouseblend.com/showDiary.do?diaryId=48\n\n \n Just because you don't have a centralized document outlining your unified goals as a group, doesn't mean you don't have a coordnated agenda that you're dedicated to as an extreme group. This pretty well defines your agenda to the T.\n Lest you think this indoctrination has been the natural progression of our illuminated society, remember that an active agenda has existed for decades to legitimize the homosexual lifestyle. Shockingly candid evidence of this agenda ran in Christopher Street Magazine, a revered gay rights magazine of the late 1970s and early 1980s. Excerpts from its article outlining \"Six Principles for the Persuasion of 'Straights'\" reveal how the public homosexual image has been shrewdly manipulated and crafted:\n \n 1. The first order of business is desensitization of the American public concerning gays and gay rights. The principle behind this advice is simple: almost any behavior begins to look normal if you are exposed to enough of it....The visual media . . . [is] a gateway into the private world of straights, through which a Trojan Horse might be passed.... The National Gay Task Force has had to cultivate quiet backroom liaisons with broadcast companies and newsrooms in order to make sure that issues important to the gay community receive some coverage.\n \n 2. Portray gays as victims, not as aggressive challengers. In any campaign to win over the public, gays must be cast as victims in need of protection so that straights will be inclined by ref lex to assume the role of protector.... We must forego the temptation to strut our \"gay pride\" publicly whenever it conf licts with the Gay Victim image.\n \n 3. Our campaign should not demand direct support for homosexual practices, but should instead take anti-discrimination as its theme. [Hence, the improper equating of racism with discrimination against homosexuality.]\n \n 4. Make gays look good. In order to make a Gay Victim sympathetic to straights you have to portray him as Everyman . . . the campaign should paint gays as superior pillars of society . . . in no time, a skillful and clever media campaign could have the gay community looking like the veritable fairy godmother to Western civilization.\n \n 5. Make the victimizers look bad....To be blunt, they must be vilified ...we intend to make the anti-gays look so nasty that average Americans will want to dissociate themselves from such types.\n [And I thought all the gay-love floating around our nation was from our own innate kindness!]\n \n 6. Solicit funds . . . those gays not supporting families usually have more discretionary income than average.\n \n The homosexual movement's tactics have so cleverly seduced our society that it is nearly impossible for Middle America not to fall for its radical agenda, an agenda demanding many of us to surrender beliefs rooted in our families for generations. Honestly, what \"bigot\" today could disapprove of the sincere, savvy Will Truman or the funny, huggable Jack McFarland of Will and Grace? The duo-tyranny of the thought police and societal pressure has such a strong grip on American society that most of us today will not breathe a word in public against homosexuality for fear of being ostracized and maligned.\n (With friends like that, who needs hate crimes?)\n ", 
   {}, 
   276451, 
   null, 
   1186323660.0
  ], 
  [
   276457, 
   null, 
   "jitobear", 
   "Just because you don't have a centralized document outlining your unified goals as a group, doesn't mean you don't have a coordnated agenda that you're dedicated to as an extreme group. This pretty well defines your agenda to the T.\n\n \n Sure there are coordinated efforts to bring about tolerance. So? You guys have websites and gatherings and specialized groups and political activity trying to ram rod the Christian crud down our throats (Focus on the Family, etc.). Welcome to America.\n \n \nLest you think this indoctrination has been the natural progression of our illuminated society, remember that an active agenda has existed for decades to legitimize the homosexual lifestyle. Shockingly candid evidence of this agenda ran in Christopher Street Magazine, a revered gay rights magazine of the late 1970s and early 1980s. Excerpts from its article outlining \"Six Principles for the Persuasion of 'Straights'\" reveal how the public homosexual image has been shrewdly manipulated and crafted:\n \n 1. The first order of business is desensitization of the American public concerning gays and gay rights. The principle behind this advice is simple: almost any behavior begins to look normal if you are exposed to enough of it....The visual media . . . [is] a gateway into the private world of straights, through which a Trojan Horse might be passed.... The National Gay Task Force has had to cultivate quiet backroom liaisons with broadcast companies and newsrooms in order to make sure that issues important to the gay community receive some coverage.\n\n \n The \"gay community\" (gays - not really a single community) are part of the American public.\n \n \n2. Portray gays as victims, not as aggressive challengers. In any campaign to win over the public, gays must be cast as victims in need of protection so that straights will be inclined by ref lex to assume the role of protector.... We must forego the temptation to strut our \"gay pride\" publicly whenever it conf licts with the Gay Victim image.\n\n \n They can be fired, lose their home, in some places lose their children and are still more than a little likely to have violence visited upon them just for being gay. Standing up and saying \"No, I will not just lay here and allow you to treat me like this anymore\" may make them aggressive challengers, but they have every reason to be so.\n \n \n3. Our campaign should not demand direct support for homosexual practices, but should instead take anti-discrimination as its theme. [Hence, the improper equating of racism with discrimination against homosexuality.]\n\n \n Thats because \"homosexual practices\" (SEX) is really none of your damned business. It is not the issue at hand. The discrimination is. Discrimination is discrimination - just because you think that people of color are OK but gays aren't does not mean the dicrimination isn't there. It is. I have witnessed it first hand - it is real, it is real ugly, and it is not OK.\n \n \n4. Make gays look good. In order to make a Gay Victim sympathetic to straights you have to portray him as Everyman . . . the campaign should paint gays as superior pillars of society . . . in no time, a skillful and clever media campaign could have the gay community looking like the veritable fairy godmother to Western civilization.\n\n \n This is easy. Many gays are just this. They are responsible, kind, law-abiding, generous, capable, giving, amazingly cool people. Some are jerks, but they same can be said of Christains. Character can not be derived using stereotypes. Thats why I know some Christians are cool.\n \n \n5. Make the victimizers look bad....To be blunt, they must be vilified ...we intend to make the anti-gays look so nasty that average Americans will want to dissociate themselves from such types.\n [And I thought all the gay-love floating around our nation was from our own innate kindness!]\n\n \n If you are being hateful towards gays - beating them up, discriminating, calling them ugly names like \"reprobate\", the only person making you look bad is you.\n \n \n6. Solicit funds . . . those gays not supporting families usually have more discretionary income than average.\n\n \n As is any double-income, childless couple. People can financially support whatever they want. You don't tithe at your church? Stupid Dobson who will get his XXX kicked if he ever tries to focus on my family, doesn't get financial support?\n \n \nThe homosexual movement's tactics have so cleverly seduced our society that it is nearly impossible for Middle America not to fall for its radical agenda, an agenda demanding many of us to surrender beliefs rooted in our families for generations. \n\n \n NOT MINE! I learned homophobia was bad at the same time I learned racism was bad - about 30 years ago. All it took was reality, I have a gay aunt - a great lady, to know what you preach about gays is ####.\n \n \nHonestly, what \"bigot\" today could disapprove of the sincere, savvy Will Truman or the funny, huggable Jack McFarland of Will and Grace? \n\n \n I personally find that show tedious - except Karen - she's stitch.\n \n \nThe duo-tyranny of the thought police and societal pressure has such a strong grip on American society that most of us today will not breathe a word in public against homosexuality for fear of being ostracized and maligned.\n (With friends like that, who needs hate crimes?)\n\n \n I don't breath it because I don't believe it. Its not hard for me.", 
   {}, 
   276455, 
   null, 
   1186326660.0
  ], 
  [
   276459, 
   null, 
   "Bassman", 
   "AA, As much as I disagree with Jito about nearly everything, you need to post a link to your last statement.", 
   {}, 
   276457, 
   null, 
   1186327620.0
  ], 
  [
   276460, 
   null, 
   "Jo Bennett", 
   "Am I the only one thinking this is starting to sound earily like the Protocols of the Learned Elders of Zion?", 
   {}, 
   276459, 
   null, 
   1186328100.0
  ], 
  [
   276461, 
   null, 
   "Archangel", 
   "AA, As much as I disagree with Jito about nearly everything, you need to post a link to your last statement.\n\n \n I posted it right off of samiinhs link. Like so many others who obviously ignore the dung he posts, so do I, but I clicked on this one so I posted that list. See #2 ?\n \n http://www.pamshouseblend.com/showDiary.do?diaryId=48", 
   {}, 
   276459, 
   null, 
   1186328280.0
  ], 
  [
   276489, 
   null, 
   "jitobear", 
   "I posted it right off of samiinhs link. Like so many others who obviously ignore the dung he posts, so do I, but I clicked on this one so I posted that list. See #2 ?\n \n http://www.pamshouseblend.com/showDiary.do?diaryId=48\n\n \n The woman who wrote the artyicle is not gay-friendly and she needs to do her homework. The agenda she talks about came out of a book written by two men on how to counter negative (and false) stereotypes of gay people.", 
   {}, 
   276461, 
   null, 
   1186343940.0
  ], 
  [
   276494, 
   null, 
   "JSDKoeln", 
   "The woman who wrote the artyicle is not gay-friendly and she needs to do her homework. The agenda she talks about came out of a book written by two men on how to counter negative (and false) stereotypes of gay people.\n\n \n He probably knew that. Just, again, spewing his christer hate. Lying lying lying... all the time.", 
   {}, 
   276489, 
   null, 
   1186345980.0
  ], 
  [
   276499, 
   null, 
   "Archangel", 
   "He probably knew that. Just, again, spewing his christer hate. Lying lying lying... all the time.\n\n \n The agenda outlined in this list isn't a lie at all. Whatever the source may be.\n Lest you think this indoctrination has been the natural progression of our illuminated society, remember that an active agenda has existed for decades to legitimize the homosexual lifestyle. Shockingly candid evidence of this agenda ran in Christopher Street Magazine, a revered gay rights magazine of the late 1970s and early 1980s. Excerpts from its article outlining \"Six Principles for the Persuasion of 'Straights'\" reveal how the public homosexual image has been shrewdly manipulated and crafted:\n \n 1. The first order of business is desensitization of the American public concerning gays and gay rights. The principle behind this advice is simple: almost any behavior begins to look normal if you are exposed to enough of it....The visual media . . . [is] a gateway into the private world of straights, through which a Trojan Horse might be passed.... The National Gay Task Force has had to cultivate quiet backroom liaisons with broadcast companies and newsrooms in order to make sure that issues important to the gay community receive some coverage.\n \n 2. Portray gays as victims, not as aggressive challengers. In any campaign to win over the public, gays must be cast as victims in need of protection so that straights will be inclined by ref lex to assume the role of protector.... We must forego the temptation to strut our \"gay pride\" publicly whenever it conf licts with the Gay Victim image.\n \n 3. Our campaign should not demand direct support for homosexual practices, but should instead take anti-discrimination as its theme. [Hence, the improper equating of racism with discrimination against homosexuality.]\n \n 4. Make gays look good. In order to make a Gay Victim sympathetic to straights you have to portray him as Everyman . . . the campaign should paint gays as superior pillars of society . . . in no time, a skillful and clever media campaign could have the gay community looking like the veritable fairy godmother to Western civilization.\n \n 5. Make the victimizers look bad....To be blunt, they must be vilified ...we intend to make the anti-gays look so nasty that average Americans will want to dissociate themselves from such types.\n [And I thought all the gay-love floating around our nation was from our own innate kindness!]\n \n 6. Solicit funds . . . those gays not supporting families usually have more discretionary income than average.\n \n The homosexual movement's tactics have so cleverly seduced our society that it is nearly impossible for Middle America not to fall for its radical agenda, an agenda demanding many of us to surrender beliefs rooted in our families for generations. Honestly, what \"bigot\" today could disapprove of the sincere, savvy Will Truman or the funny, huggable Jack McFarland of Will and Grace? The duo-tyranny of the thought police and societal pressure has such a strong grip on American society that most of us today will not breathe a word in public against homosexuality for fear of being ostracized and maligned.\n (With friends like that, who needs hate crimes?)\n ", 
   {}, 
   276494, 
   null, 
   1186348440.0
  ], 
  [
   276504, 
   null, 
   "jyoshu", 
   "It seems to me that it's obvious the gay rights movement has it's talking points and strategies. I think there's probably some truth to Star Parker list.", 
   {}, 
   276499, 
   null, 
   1186350060.0
  ], 
  [
   276537, 
   null, 
   "thelmoose", 
   "The agenda outlined in this list isn't a lie at all. Whatever the source may be.\n\n \n \n It doesn't matter what the source is, Archie has divined that it is the truth, because....? \n wishful thinking?\n God told him?\n \n Look, somebody somewhere wrote something and you think it is the homo manifesto. What a maroon!", 
   {}, 
   276499, 
   null, 
   1186355160.0
  ], 
  [
   276538, 
   null, 
   "chemist99a", 
   "Every interest group (or affinity group) under the sun has its own spin-meisters. The right wing Christians have theirs, the Islamic terrorists have theirs, the supporters of Fred Thompson (either one) have theirs. Why should not those who are gay have theirs? Whats wrong with that? How can anyone object or even be suprised or upset in any way? Its a free society and we all are in various debates with each other and we all have our agendas do we not?", 
   {}, 
   276537, 
   null, 
   1186355580.0
  ], 
  [
   276539, 
   null, 
   "samiinh", 
   "Archie and his christer thugs have an agenda, that's for damn sure.", 
   {}, 
   276538, 
   null, 
   1186357140.0
  ], 
  [
   276549, 
   null, 
   "ShadowPikachu", 
   "It doesn't matter what the source is, Archie has divined that it is the truth, because....? \n wishful thinking?\n God told him?\n \n Look, somebody somewhere wrote something and you think it is the homo manifesto. What a maroon!\n\n \n Maybe because he's gay himself? emoticon_xangel ;)", 
   {}, 
   276537, 
   null, 
   1186367160.0
  ], 
  [
   276550, 
   null, 
   "Archangel", 
   "It seems to me that it's obvious the gay rights movement has it's talking points and strategies. I think there's probably some truth to Star Parker list.\n\n \n All one has to do is look at their public game plan objectively and their is no doubt that this list is totally accurate.\n \n \nThe agenda outlined in this list isn't a lie at all. Whatever the source may be. And it is so much sweeter that samiinh made it available to us. Thanks for outing yourself samiinh. emoticon_smile \n Lest you think this indoctrination has been the natural progression of our illuminated society, remember that an active agenda has existed for decades to legitimize the homosexual lifestyle. Shockingly candid evidence of this agenda ran in Christopher Street Magazine, a revered gay rights magazine of the late 1970s and early 1980s. Excerpts from its article outlining \"Six Principles for the Persuasion of 'Straights'\" reveal how the public homosexual image has been shrewdly manipulated and crafted:\n \n 1. The first order of business is desensitization of the American public concerning gays and gay rights. The principle behind this advice is simple: almost any behavior begins to look normal if you are exposed to enough of it....The visual media . . . [is] a gateway into the private world of straights, through which a Trojan Horse might be passed.... The National Gay Task Force has had to cultivate quiet backroom liaisons with broadcast companies and newsrooms in order to make sure that issues important to the gay community receive some coverage.\n \n 2. Portray gays as victims, not as aggressive challengers. In any campaign to win over the public, gays must be cast as victims in need of protection so that straights will be inclined by ref lex to assume the role of protector.... We must forego the temptation to strut our \"gay pride\" publicly whenever it conf licts with the Gay Victim image.\n \n 3. Our campaign should not demand direct support for homosexual practices, but should instead take anti-discrimination as its theme. [Hence, the improper equating of racism with discrimination against homosexuality.]\n \n 4. Make gays look good. In order to make a Gay Victim sympathetic to straights you have to portray him as Everyman . . . the campaign should paint gays as superior pillars of society . . . in no time, a skillful and clever media campaign could have the gay community looking like the veritable fairy godmother to Western civilization.\n \n 5. Make the victimizers look bad....To be blunt, they must be vilified ...we intend to make the anti-gays look so nasty that average Americans will want to dissociate themselves from such types.\n [And I thought all the gay-love floating around our nation was from our own innate kindness!]\n \n 6. Solicit funds . . . those gays not supporting families usually have more discretionary income than average.\n \n The homosexual movement's tactics have so cleverly seduced our society that it is nearly impossible for Middle America not to fall for its radical agenda, an agenda demanding many of us to surrender beliefs rooted in our families for generations. Honestly, what \"bigot\" today could disapprove of the sincere, savvy Will Truman or the funny, huggable Jack McFarland of Will and Grace? The duo-tyranny of the thought police and societal pressure has such a strong grip on American society that most of us today will not breathe a word in public against homosexuality for fear of being ostracized and maligned.\n (With friends like that, who needs hate crimes?)\n \n", 
   {}, 
   276549, 
   null, 
   1186367940.0
  ], 
  [
   276551, 
   null, 
   "thelmoose", 
   "It seems to me that it's obvious the gay rights movement has it's talking points and strategies. I think there's probably some truth to Star Parker list.\n\n \n \n Who the heck is Star Parker and what makes her a qualified spokesperson to set the \"gay agenda\"?", 
   {}, 
   276504, 
   null, 
   1186368060.0
  ], 
  [
   276554, 
   null, 
   "Archangel", 
   "Who the heck is Star Parker and what makes her a qualified spokesperson to set the \"gay agenda\"?\n\n \n Star Parker\n \n \n Star Parker is the founder and president of CURE, the Coalition on Urban Renewal & Education, a 501c3 non-profit think tank that provides a national voice of reason on issues of race and poverty in the media, inner city neighborhoods, and public policy.\n \n Prior to her involvement in social activism, Star Parker was a single welfare mother in Los Angeles, California. After receiving Christ, Star returned to college, received a BS degree in marketing and launched an urban Christian magazine. The 1992 Los Angeles riots destroyed her business, yet served as a springboard for her focus on faith and market-based alternatives to empower the lives of the poor.\n As a social policy consultant, Star Parker gives regular testimony before the United States Congress, and is a national expert on major television and radio shows across the country.\n \n \n Currently, Star is a regular commentator on CNN, MSNBC, and FOX News. She has debated Jesse Jackson on BET; fought for school choice on Larry King Live; and defended welfare reform on the Oprah Winfrey Show.\n \n Star Parker's personal transformation from welfare fraud to conservative crusader has been chronicled by ABC's 20/20; Rush Limbaugh; Readers Digest; Dr. James Dobson; The 700 Club; Dr. George Grant; the Washington Times; Christianity Today; Charisma, and World Magazine. Articles and quotes by Star have appeared in major publications including the Wall Street Journal, the Washington Post, and the New York Times.\n \n Star has written three books, \"Pimps, Whores, and Welfare Brats\" (1996), \"Uncle Sam's Plantation\" (2003), and \"White Ghetto\" (2006), resides in Southern California. \n \n Today, in addition to heading CURE, Star is a syndicated columnist for Scripps Howard News Service, offering weekly op-eds to more than 400 newspapers worldwide.", 
   {
    "unicode_changes_made": true
   }, 
   276551, 
   null, 
   1186368600.0
  ], 
  [
   276556, 
   null, 
   "jitobear", 
   "Star Parker\n \n \n Star Parker is the founder and president of CURE, the Coalition on Urban Renewal & Education, a 501c3 non-profit think tank that provides a national voice of reason on issues of race and poverty in the media, inner city neighborhoods, and public policy.\n \n Prior to her involvement in social activism, Star Parker was a single welfare mother in Los Angeles, California. After receiving Christ, Star returned to college, received a BS degree in marketing and launched an urban Christian magazine. The 1992 Los Angeles riots destroyed her business, yet served as a springboard for her focus on faith and market-based alternatives to empower the lives of the poor.\n \n As a social policy consultant, Star Parker gives regular testimony before the United States Congress, and is a national expert on major television and radio shows across the country.\n \n Currently, Star is a regular commentator on CNN, MSNBC, and FOX News. She has debated Jesse Jackson on BET; fought for school choice on Larry King Live; and defended welfare reform on the Oprah Winfrey Show.\n \n Star Parker's personal transformation from welfare fraud to conservative crusader has been chronicled by ABC's 20/20; Rush Limbaugh; Readers Digest; Dr. James Dobson; The 700 Club; Dr. George Grant; the Washington Times; Christianity Today; Charisma, and World Magazine. Articles and quotes by Star have appeared in major publications including the Wall Street Journal, the Washington Post, and the New York Times.\n \n Star has written three books, \"Pimps, Whores, and Welfare Brats\" (1996), \"Uncle Sam's Plantation\" (2003), and \"White Ghetto\" (2006), resides in Southern California. \n \n Today, in addition to heading CURE, Star is a syndicated columnist for Scripps Howard News Service, offering weekly op-eds to more than 400 newspapers worldwide.\n\n \n \nWho the heck is Star Parker and what makes her a qualified spokesperson to set the \"gay agenda\"?\n\n \n Per Archie's post - some conservative broad and nothing.", 
   {
    "unicode_changes_made": true
   }, 
   276554, 
   null, 
   1186369740.0
  ], 
  [
   276558, 
   null, 
   "Bassman", 
   "Per Archie's post - some conservative broad and nothing.\n\n \n Dang Jito, the woman came from the welfare roles and has lived the life of \"Liberal Compassion\" only to experience the incredible incompetence and fallacy thereto. I see you have a problem with anyone who is not dependent on the government dole one way or another.", 
   {}, 
   276556, 
   null, 
   1186369860.0
  ], 
  [
   276561, 
   null, 
   "jitobear", 
   "Dang Jito, the woman came from the welfare roles and has lived the life of \"Liberal Compassion\" only to experience the incredible incompetence and fallacy thereto. I see you have a problem with anyone who is not dependent on the government dole one way or another.\n\n \n Who said I have a problem with her? Moose asked who she was and what qualifications she has to speak about any gay agenda. She is conservative and she has none. I am not Catholic, never been Catholic, am not particularly sensitive to the Catholic religion and therefore am in no position to speak for the Catholic Church. Get it?", 
   {}, 
   276558, 
   null, 
   1186370400.0
  ], 
  [
   276566, 
   null, 
   "Archangel", 
   "Who said I have a problem with her? Moose asked who she was and what qualifications she has to speak about any gay agenda. She is conservative and she has none. I am not Catholic, never been Catholic, am not particularly sensitive to the Catholic religion and therefore am in no position to speak for the Catholic Church. Get it?\n\n \n She's obviously very observant, intelligent and concise as she has made her case very well. She's also an African American Woman and they tend to be more liberal than conservative.\n Lest you think this indoctrination has been the natural progression of our illuminated society, remember that an active agenda has existed for decades to legitimize the homosexual lifestyle. Shockingly candid evidence of this agenda ran in Christopher Street Magazine, a revered gay rights magazine of the late 1970s and early 1980s. Excerpts from its article outlining \"Six Principles for the Persuasion of 'Straights'\" reveal how the public homosexual image has been shrewdly manipulated and crafted:\n \n 1. The first order of business is desensitization of the American public concerning gays and gay rights. The principle behind this advice is simple: almost any behavior begins to look normal if you are exposed to enough of it....The visual media . . . [is] a gateway into the private world of straights, through which a Trojan Horse might be passed.... The National Gay Task Force has had to cultivate quiet backroom liaisons with broadcast companies and newsrooms in order to make sure that issues important to the gay community receive some coverage.\n \n 2. Portray gays as victims, not as aggressive challengers. In any campaign to win over the public, gays must be cast as victims in need of protection so that straights will be inclined by ref lex to assume the role of protector.... We must forego the temptation to strut our \"gay pride\" publicly whenever it conf licts with the Gay Victim image.\n \n 3. Our campaign should not demand direct support for homosexual practices, but should instead take anti-discrimination as its theme. [Hence, the improper equating of racism with discrimination against homosexuality.]\n \n 4. Make gays look good. In order to make a Gay Victim sympathetic to straights you have to portray him as Everyman . . . the campaign should paint gays as superior pillars of society . . . in no time, a skillful and clever media campaign could have the gay community looking like the veritable fairy godmother to Western civilization.\n \n 5. Make the victimizers look bad....To be blunt, they must be vilified ...we intend to make the anti-gays look so nasty that average Americans will want to dissociate themselves from such types.\n [And I thought all the gay-love floating around our nation was from our own innate kindness!]\n \n 6. Solicit funds . . . those gays not supporting families usually have more discretionary income than average.\n \n The homosexual movement's tactics have so cleverly seduced our society that it is nearly impossible for Middle America not to fall for its radical agenda, an agenda demanding many of us to surrender beliefs rooted in our families for generations. Honestly, what \"bigot\" today could disapprove of the sincere, savvy Will Truman or the funny, huggable Jack McFarland of Will and Grace? The duo-tyranny of the thought police and societal pressure has such a strong grip on American society that most of us today will not breathe a word in public against homosexuality for fear of being ostracized and maligned.\n (With friends like that, who needs hate crimes?)\n [/QUOTE]", 
   {}, 
   276561, 
   null, 
   1186375200.0
  ], 
  [
   276578, 
   null, 
   "Jo Bennett", 
   "So just because she's black she must be a liberal? Way to go with the stereotyping... how about you look at the evidence rather than just going by here skin colour?", 
   {}, 
   276566, 
   null, 
   1186392840.0
  ], 
  [
   276581, 
   null, 
   "Matthew S", 
   "This is what Archangel and fundies in general think of gay people.\n \n One sick video emoticon_xkill \n http://www.youtube.com/watch?v=ihdQXQGucC8\n \n Also what any heterosexual thinks of gay people esp the ones on this board that have compared us to child molesters.", 
   {}, 
   276578, 
   null, 
   1186396200.0
  ], 
  [
   276586, 
   null, 
   "JakeCJB", 
   "1. The first order of business is desensitization of the American public concerning gays and gay rights. The principle behind this advice is simple: almost any behavior begins to look normal if you are exposed to enough of it....The visual media . . . [is] a gateway into the private world of straights, through which a Trojan Horse might be passed.... The National Gay Task Force has had to cultivate quiet backroom liaisons with broadcast companies and newsrooms in order to make sure that issues important to the gay community receive some coverage.\n\n \n Indeed, gays do need to expose the U.S. to more of how we are and live, by coming out of the closet. People need to be desensitized to reactions of fear. ignorance and hate by seeing the truth. \"Gateway into the...world of straights\"? Is there some reason gays should be excluded from straight society and the media? No, there is not. \n \n \n2. Portray gays as victims, not as aggressive challengers. In any campaign to win over the public, gays must be cast as victims in need of protection so that straights will be inclined by ref lex to assume the role of protector.... We must forego the temptation to strut our \"gay pride\" publicly whenever it conf licts with the Gay Victim image.\n\n \n I happens that gays are victimized. The only way to stop that is to challenge.\n \n \n3. Our campaign should not demand direct support for homosexual practices, but should instead take anti-discrimination as its theme. [Hence, the improper equating of racism with discrimination against homosexuality.]\n\n \n If I am being discriminated against for my homosexuality, it is no different than being discriminated against for my being black or being Jewish. It's all discrimination on a person based on an aspect of one's identity. I think there is extremely little support for discriminating against private sex acts where they don't effect anyone else.\n \n \nMake gays look good. In order to make a Gay Victim sympathetic to straights you have to portray him as Everyman . . . the campaign should paint gays as superior pillars of society . . . in no time, a skillful and clever media campaign could have the gay community looking like the veritable fairy godmother to Western civilization.\n\n \n So what? Gay people are everyman or everywoman. Sometimes we are very brilliant too. Is this to suggest the proper way is to portray gay people as evil and bad?\n \n \n5. Make the victimizers look bad....To be blunt, they must be vilified ...we intend to make the anti-gays look so nasty that average Americans will want to dissociate themselves from such types.\n [And I thought all the gay-love floating around our nation was from our own innate kindness!]\n\n \n As opposed to making victimizers look good??!!\n \n \n6. Solicit funds . . . those gays not supporting families usually have more discretionary income than average.\n\n \n Those supremely nice anti-gay victimizers, raise funds too for their good works.\n \n \nThe homosexual movement's tactics have so cleverly seduced our society that it is nearly impossible for Middle America not to fall for its radical agenda, an agenda demanding many of us to surrender beliefs rooted in our families for generations. Honestly, what \"bigot\" today could disapprove of the sincere, savvy Will Truman or the funny, huggable Jack McFarland of Will and Grace? The duo-tyranny of the thought police and societal pressure has such a strong grip on American society that most of us today will not breathe a word in public against homosexuality for fear of being ostracized and maligned.\n (With friends like that, who needs hate crimes?)\n [/COLOR][/SIZE][/FONT][/I][/INDENT]\n\n \n Considering all the illogical and silly arguments of the good anti-gay victimizers, the excluders, the discriminators, it's not hard to see why America would support the opposing agenda.", 
   {}, 
   276499, 
   null, 
   1186402860.0
  ], 
  [
   276594, 
   null, 
   "samiinh", 
   "1. The first order of business is desensitization of the American public concerning christers and christer rights. The principle behind this advice is simple: almost any christer belief begins to look rational if you are exposed to enough of it....T\n \n 2. Portray christers as victims, not as aggressive challengers. In any campaign to win over the public, christers must be cast as victims in need of protection. \n \n 3. Our campaign should not demand direct support for christerl practices, but should instead take anti-discrimination as its theme. [Hence, the improper equating of racism with discrimination against christerism.]\n \n 4. Make christers look good. In order to make a christer victim sympathetic to all you have to portray him as Everyman . . . the campaign should paint christers as superior pillars of society . . . in no time, a skillful and clever media campaign could have the christer community looking like the veritable fairy godmother to Western civilization instead of the evil institution it really is.\n \n 5. Make the victimizers look bad....To be blunt, they must be vilified ...we intend to make the anti-christers look so nasty that average Americans will want to dissociate themselves from such types.\n [And I thought all the christer-love floating around our nation was from our own innate kindness!]\n \n 6. Solicit funds . . . those christers not supporting families usually have more discretionary income than average.", 
   {}, 
   276586, 
   null, 
   1186405200.0
  ], 
  [
   276607, 
   null, 
   "jitobear", 
   "She's obviously very observant, intelligent and concise as she has made her case very well. She's also an African American Woman and they tend to be more liberal than conservative.\n\n \n Thats all swell. However, she is a conservative woman with no ties or sympathies towards gays and is no place to speak for gays.", 
   {}, 
   276566, 
   null, 
   1186411320.0
  ], 
  [
   276613, 
   null, 
   "Archangel", 
   "This is what Archangel and fundies in general think of gay people.\n \n One sick video emoticon_xkill \n http://www.youtube.com/watch?v=ihdQXQGucC8\n \n Also what any heterosexual thinks of gay people esp the ones on this board that have compared us to child molesters.\n\n \n So you think warning kids about the dangers of getting into strangers cars is SICK ? Only someone who is sick Matt would object to such a video being made. In fact I can point to more than 30 couples who wish they had taught their teenage sons about the dangers of getting into the car of a friendly stranger, because it may have saved their lives from being snuffed out by thist gay predator.\n Story Location: http://www.crimelibrary.com/serial_killers/notorious/gacy/gacy_1.html\n \n JOHN WAYNE GACY, JR.\n John Wayne Gacy By Rachael Bell and Marilyn Bardsley\n \n It is no surprise that John Wayne Gacy, Jr. was admired and liked by most who had known him. He was a sharp businessman who had spent his time, when not building up his contracting company, hosting elaborate street parties for friends and neighbors, dressing as a clown and entertaining children at local hospitals and immersing himself in organizations such as the Jaycees, working to make his community a better place to live. People who knew Gacy thought of him as a generous, friendly and hard-working man, devoted to his family and community. However, there was another side to Gacy that few had ever witnessed...\n \n It was May 22, 1978, and Jeffrey Ringall had recently returned from a winter vacation in Florida to his home in Chicago. He decided to reacquaint himself with the city by visiting New Town, a popular area of Chicago where many popular bars and discos could be found. While walking through the area, his path was blocked by a black Oldsmobile. The heavy-set driver leaned out from the window and complimented Ringall on his unseasonable tan. He continued to make small talk and then asked if Ringall wanted to share a joint with him while they rode around town.\n \n Ringall was delighted to escape the cold and share a marijuana cigarette with the stranger. He hopped in the car and began to smoke with his friendly new acquaintance. Before they were half way through with the joint, the man grabbed Ringall and quickly shoved a rag over his face doused with chloroform. Ringall lost consciousness and only briefly reawakened a couple of times during the car ride. During his wakeful periods Ringall watched in a daze as street signs passed, trying to make sense of what was happening to him. Yet before he was able to understand where he was and what was happening, the stranger again covered his face with the chloroform-soaked rag and he passed out.\n \n Once when he was awake, Ringall remembered being in a house and seeing the heavy-set man naked before him. Ringall also remembered seeing on the floor a number of varying sized dildos that the stranger pointed out to him and remarked on how he was going to use them on his unwilling prisoner. That evening Ringall was viciously raped, tortured and drugged by the sadistic stranger.\n \n Later the next morning, Ringall awoke from one of his blackouts fully clothed and under a statue in Chicago's Lincoln Park. He was surprised to be alive after the trauma that was inflicted on his body. He made his way to his girlfriend's and later to the hospital where he stayed for six days. During his hospital stay, Ringall reported the incident to the police who were sceptical about finding his rapist, given the little information that Ringall could provide. Along with skin lacerations, burns and permanent liver damage caused from the chloroform, Ringall suffered severe emotional trauma.\n \n Yet, he was fortunate to be alive. Ringall was one of the few victims of John Wayne Gacy, Jr. to have survived. During a three-year-period, Gacy went on to viciously torture, rape and murder more than thirty other young men, who would later be discovered under the floorboards of his home and in the local river.\n ", 
   {}, 
   276581, 
   null, 
   1186412220.0
  ], 
  [
   276625, 
   null, 
   "smiley", 
   "So you think warning kids about the dangers of getting into strangers cars is SICK ? Only someone who is sick Matt would object to such a video being made. In fact I can point to more than 30 couples who wish they had taught their teenage sons about the dangers of getting into the car of a friendly stranger, because it may have saved their lives from being snuffed out by thist gay predator.\n Story Location: http://www.crimelibrary.com/serial_killers/notorious/gacy/gacy_1.html\n \n JOHN WAYNE GACY, JR.\n John Wayne Gacy By Rachael Bell and Marilyn Bardsley\n \n It is no surprise that John Wayne Gacy, Jr. was admired and liked by most who had known him. He was a sharp businessman who had spent his time, when not building up his contracting company, hosting elaborate street parties for friends and neighbors, dressing as a clown and entertaining children at local hospitals and immersing himself in organizations such as the Jaycees, working to make his community a better place to live. People who knew Gacy thought of him as a generous, friendly and hard-working man, devoted to his family and community. However, there was another side to Gacy that few had ever witnessed...\n \n It was May 22, 1978, and Jeffrey Ringall had recently returned from a winter vacation in Florida to his home in Chicago. He decided to reacquaint himself with the city by visiting New Town, a popular area of Chicago where many popular bars and discos could be found. While walking through the area, his path was blocked by a black Oldsmobile. The heavy-set driver leaned out from the window and complimented Ringall on his unseasonable tan. He continued to make small talk and then asked if Ringall wanted to share a joint with him while they rode around town.\n \n Ringall was delighted to escape the cold and share a marijuana cigarette with the stranger. He hopped in the car and began to smoke with his friendly new acquaintance. Before they were half way through with the joint, the man grabbed Ringall and quickly shoved a rag over his face doused with chloroform. Ringall lost consciousness and only briefly reawakened a couple of times during the car ride. During his wakeful periods Ringall watched in a daze as street signs passed, trying to make sense of what was happening to him. Yet before he was able to understand where he was and what was happening, the stranger again covered his face with the chloroform-soaked rag and he passed out.\n \n Once when he was awake, Ringall remembered being in a house and seeing the heavy-set man naked before him. Ringall also remembered seeing on the floor a number of varying sized dildos that the stranger pointed out to him and remarked on how he was going to use them on his unwilling prisoner. That evening Ringall was viciously raped, tortured and drugged by the sadistic stranger.\n \n Later the next morning, Ringall awoke from one of his blackouts fully clothed and under a statue in Chicago's Lincoln Park. He was surprised to be alive after the trauma that was inflicted on his body. He made his way to his girlfriend's and later to the hospital where he stayed for six days. During his hospital stay, Ringall reported the incident to the police who were sceptical about finding his rapist, given the little information that Ringall could provide. Along with skin lacerations, burns and permanent liver damage caused from the chloroform, Ringall suffered severe emotional trauma.\n \n Yet, he was fortunate to be alive. Ringall was one of the few victims of John Wayne Gacy, Jr. to have survived. During a three-year-period, Gacy went on to viciously torture, rape and murder more than thirty other young men, who would later be discovered under the floorboards of his home and in the local river.\n \n\n \n Yet again Archie tries to twist an objection to the statement that homosexuality is a sickness of the mind into an objection to warning kids to be wary of strangers. Ever thought of being a politician Archie?\n \n The message to be wary of strangers is a good one for everyone, but hijacking this message with a warped idiology is just plain wrong.\n \n The first instance just used innuendo to suggest that the man involved had done something wrong. Other than that the kid had just made a friend that bought him coke and took him fishing.\n \n Just as a side note: In the last section, did you notice that Jerry left his bicycle unattended outside his friend's house even though the whole ruse was to do with stolen bicycles? He obviously wasn't as smart a kid as they were trying to make out.\n \n Smiley\n \n PS I picked up 2 hitch-hikers yesterday. We chatted in a friendly manner, and when I got to my destination they got out and thanked me for the lift.\n \n The horrific truth behind this otherwise innocent tale? They were FRENCH!!!!!!!emoticon_frazzled", 
   {}, 
   276613, 
   null, 
   1186416060.0
  ], 
  [
   276688, 
   null, 
   "samiinh", 
   "Archie must spends hours trying to find these things to belittle gay people. How evil is that. BTW, the video was made when I was a boy 50 years ago. Can't come up with anything new, AA? Loser.", 
   {}, 
   276625, 
   null, 
   1186432020.0
  ], 
  [
   276712, 
   null, 
   "Archangel", 
   "Archie must spends hours trying to find these things to belittle gay people. How evil is that. BTW, the video was made when I was a boy 50 years ago. Can't come up with anything new, AA? Loser.\n\n \n First of all samiinh, only an idiot wouldn't recognize that it was Matthew who posted that video and referred to it as sick. All I did was post the follow up article about a gay mass murderer who single handedly killed more than 30 BOYS and buried them under his house before being caught. And I didn't search for it at all as I lived 30 miles from Gacy during the Christmas season of 1978 when they caught him. You see it was my first year of marriage and with each of the last 12 days of Christmas new boys were dug up leaving a palpable pall of depression over an entire major US City. It was the most depressing Holiday season of my life, all thanks to this gay psychopath who pleasured himself with the dead corpses of young boys. Just google JOHN WAYNE GACY and see the selection of info on him that comes up.", 
   {}, 
   276688, 
   null, 
   1186438080.0
  ], 
  [
   276722, 
   null, 
   "Matthew S", 
   "First of all samiinh, only an idiot wouldn't recognize that it was Matthew who posted that video and referred to it as sick. All I did was post the follow up article about a gay mass murderer who single handedly killed more than 30 BOYS and buried them under his house before being caught. And I didn't search for it at all as I lived 30 miles from Gacy during the Christmas season of 1978 when they caught him. You see it was my first year of marriage and with each of the last 12 days of Christmas new boys were dug up leaving a palpable pall of depression over an entire major US City. It was the most depressing Holiday season of my life, all thanks to this gay psychopath who pleasured himself with the dead corpses of young boys. Just google JOHN WAYNE GACY and see the selection of info on him that comes up.\n\n \n See the problem here is that I find the whole addition of homosexuals in the video sick. I find the video sick because it says homosexuals are mentally ill. Besides what do you care you think all gay people are child molestors and I am sure applauded at this video.", 
   {}, 
   276712, 
   null, 
   1186440660.0
  ], 
  [
   276725, 
   null, 
   "jyoshu", 
   "This is what Archangel and fundies in general think of gay people.\n \n One sick video emoticon_xkill \n http://www.youtube.com/watch?v=ihdQXQGucC8\n \n Also what any heterosexual thinks of gay people esp the ones on this board that have compared us to child molesters.\n\n \n Well one thing is for sure--no matter how you line up on the issue of homosexuality, that video sure demonstrates how much things have changed since the 1950s, in terms of the way it is approached.", 
   {}, 
   276581, 
   null, 
   1186440960.0
  ], 
  [
   276729, 
   null, 
   "Matthew S", 
   "Well one thing is for sure--no matter how you line up on the issue of homosexuality, that video sure demonstrates how much things have changed since the 1950s, in terms of the way it is approached.\n\n \n Not in the minds of some heteros and all fundamentalist christians. I however do see your point attitudes have changed.", 
   {}, 
   276725, 
   null, 
   1186443660.0
  ], 
  [
   276733, 
   null, 
   "thelmoose", 
   "Well one thing is for sure--no matter how you line up on the issue of homosexuality, that video sure demonstrates how much things have changed since the 1950s, in terms of the way it is approached.\n\n \n That's for sure. Nowadays, you don't hear anyone equating homosexuals with child molesters nor do you hear anyone calling them sick (or reprobates.) I would agree that things have changed some, but not for everyone.", 
   {}, 
   276725, 
   null, 
   1186444680.0
  ], 
  [
   276734, 
   null, 
   "Archangel", 
   "See the problem here is that I find the whole addition of homosexuals in the video sick. I find the video sick because it says homosexuals are mentally ill. Besides what do you care you think all gay people are child molestors and I am sure applauded at this video.\n\n \n You may not see that otherwise intelligent people who spend complete lifetimes having sex with members of their own gender with no hope of ever procreating and continuing their lineage as normal, but to many people such a wasted lifetime of redundant effort with no hope of procreating, while never correcting their error is the perfectly definitive sign of a mental illness. \n \n Just think Matthew, your chosen lifestyle goes against the natural drive of the other 93% of all life on Earth to reproduce, procreate and continue to live on by leaving their own progeny behind as their contribution to the World they inevitably leave behind. It's the most natural desire found in every species within the animal kingdom, and humanity. It's the reason life on Earth has continued to flourish. So ask yourself Matthew, is it normal to spend ones life seeking only gratuitous sex with no hope of ever procreating ? Or might such a tendency be properly considered a mental illness. And remember, you raised the issue by posting the video.", 
   {}, 
   276722, 
   null, 
   1186446480.0
  ], 
  [
   276736, 
   null, 
   "Jo Bennett", 
   "So, AA, do you consider celibacy as advocated by St. Paul to be a sign of mental illness?", 
   {}, 
   276734, 
   null, 
   1186446840.0
  ], 
  [
   276741, 
   null, 
   "foundit66", 
   "So you think warning kids about the dangers of getting into strangers cars is SICK ? Only someone who is sick Matt would object to such a video being made. In fact I can point to more than 30 couples who wish they had taught their teenage sons about the dangers of getting into the car of a friendly stranger, because it may have saved their lives from being snuffed out by thist gay predator.\n\n 1) Most victims of pedophiles are GIRLS.\n Yet people like you fixate on the gays... emoticon_rolleyes \n Why is that?\n \n 2) I wonder if we substituted \"Catholic priest\" in for the focus of the type of offender instead of \"gay\" would you be so willing to ignore the offense of this video.\n \n 3) The video is offensive because it stereo-types ALL gays.\n It makes a sweeping declaration about ALL gays.\n If it just stuck to the issue of child molestation, boys AND girls, that would be one thing. But to declare ALL gays as sick because of child molestation is stupid.", 
   {}, 
   276613, 
   null, 
   1186447560.0
  ], 
  [
   276743, 
   null, 
   "jitobear", 
   "Archie - \n \n Why in the hell are you bringing up that pyschopath anyway? Are you trying to make the claim that this is what homsexuals are, what they do? Do you even have any proof that he was homosexual? (He was twice married so I would bet not.) Are you aware that rape is violence, not sex? Perpetrators do not select victims based on sexual attraction but perceived vulnerability. Why a serial killer targets a specific group also has nothing to do sexual attraction. This is the vilest thing I have ever seen on a board ever. You disgust me to my core. \n \n Ted Bundy raped and killed women - are you like him, straight man?", 
   {}, 
   276725, 
   null, 
   1186447800.0
  ], 
  [
   276744, 
   null, 
   "Archangel", 
   "So, AA, do you consider celibacy as advocated by St. Paul to be a sign of mental illness?\n\n \n Jo can't you tell the difference between choosing not to reproduce by remaining celibate, and actively and consistently participating in sex for a lifetime with no hope of procreating ? One is a choice, the other is an act of perpetual futility. Doesn't the latter option sound like mental illness to you you ?", 
   {}, 
   276736, 
   null, 
   1186448100.0
  ], 
  [
   276747, 
   null, 
   "thelmoose", 
   "So you think warning kids about the dangers of getting into strangers cars is SICK ? Only someone who is sick Matt would object to such a video being made. \n\n \n Here is why your posts are so vehemently opposed. \n \n You\n \n \n twist\n \n \n facts.\n \n Advising children not to go with strangers is, of course, very prudent advice and an essential piece of information all competent parents should teach their children.\n Advising children that all homosexuals are predatory, or that all predators are homosexual (both implied by this film) is misinformation. It is also dangerous information because children may be safer if the stranger is not a homosexual.\n \n This movie is obviously laughable to anyone with the slightest bit of intellectual discernment. It is the equivalent of Reefer Madness. Other posters have remarked that things happily have changed since the 50s. I truly think that the maker of this film was concerned about the safety of children but unfortunately was sadly misinformed. That person had an excuse. You do not. \n \n What is scary is that you (and many others would) believe the information in that film today. We have the Dobsons, Robertsons and Falwells preaching that to millions of people who get suckered into believing it because the speaker has the unearned monicker of \"Reverend\" pr has some affinity to religion. \n \n We know now that this information is innaccurate. That doesn't stop anyone from persisting in spouting these lies. Your position is indefensible and unconscionable.", 
   {}, 
   276613, 
   null, 
   1186448640.0
  ], 
  [
   276748, 
   null, 
   "Jo Bennett", 
   "Jo can't you tell the difference between choosing not to reproduce by remaining celibate, and actively and consistently participating in sex for a lifetime with no hope of procreating ? One is a choice, the other is an act of perpetual futility. Doesn't the latter option sound like mental illness to you you ?\n\n \n Futility implies that they are having sex with the intention of procreating. It happens that there is more than one reason to have sex, yes lust is one of them, but it can also be an expression of commitment, a physical expression of love, there's a reason it's called \"making love\". It's not just limited to gay people either, heterosexual people have sex for reasons other than procreation too.\n \n And up until recently I'm reasonably sure you were claiming homosexuality was a choice, will you please make your mind up?", 
   {}, 
   276744, 
   null, 
   1186448700.0
  ], 
  [
   276754, 
   null, 
   "Archangel", 
   "1) Most victims of pedophiles are GIRLS.\n Yet people like you fixate on the gays... emoticon_rolleyes \n Why is that?\n\n \n I'm not fixated on gays foundit. This is the gay rights forum and the subject is about gays so forgive me for staying on point. \n \n \n2) I wonder if we substituted \"Catholic priest\" in for the focus of the type of offender instead of \"gay\" would you be so willing to ignore the offense of this video.\n\n \n That's fine with me. Gay priests join the priesthood just for easy access to boys. Did you really think I would make excuses for priests just because they call themselves christians ? They're sick perverts and never should have been allowed to commit their crimes twice. And for that i blame the RCC all the way. \n \n \n3) The video is offensive because it stereo-types ALL gays.\n It makes a sweeping declaration about ALL gays.\n If it just stuck to the issue of child molestation, boys AND girls, that would be one thing. But to declare ALL gays as sick because of child molestation is stupid.\n\n \n We don't know that there weren't a whole series of movies at that time that focussed on different types of predators and abuse, and we're just seeing one of them. But leave it to you guys to once again play the persecuted victims of the mean heteros who seek to demonize you at every turn. Not to mention the fact that the video was found on You Tube mixed in with about 10 million other random videos that Matt happened by. But build it into a conspiricy to demonize all gays why dontya. \n \n \nArchie - \n \n Why in the hell are you bringing up that pyschopath anyway? Are you trying to make the claim that this is what homsexuals are, what they do? Do you even have any proof that he was homosexual? (He was twice married so I would bet not.) Are you aware that rape is violence, not sex? Perpetrators do not select victims based on sexual attraction but perceived vulnerability. Why a serial killer targets a specific group also has nothing to do sexual attraction. This is the vilest thing I have ever seen on a board ever. You disgust me to my core. \n \n Ted Bundy raped and killed women - are you like him, straight man?\n\n \n I brought bundy up because he was relevant to Matts claim that the video was sick. I wanted to show him what a gay predator looks like. One who dresses like a clown no less. And you can claim he wasn't gay if you like but he sure had his way sexually with those boys. And he wasn't a pedophile because the boys weren't children but upper aged teens and early 20s. Oh, and by the way, I'm not implying at all, in any way that all gays are like Gacy. Only an irrational extremist would get such a message from anything I wrote in the post in question.", 
   {}, 
   276744, 
   null, 
   1186449780.0
  ], 
  [
   276758, 
   null, 
   "jitobear", 
   "I wanted to show him what a gay predator looks like. One who dresses like a clown no less. And you can claim he wasn't gay if you like but he sure had his way sexually with those boys. And he wasn't a pedophile because the boys weren't children but upper aged teens and early 20s. Oh, and by the way, I'm not implying at all, in any way that all gays are like Gacy. Only an irrational extremist would get such a message from anything I wrote in the post in question.\n\n \n \n You don't know what the #### you are talking about. I used to work for the Hennepin County Violence Center. I have been a peer counselor for rape victims. I was also a mental health worker. I am also a victim of rape.\n \n When you rape it is not the person that turns you on, its the violence. As a matter of fact - many rapists CAN'T get it up becuase it ISN'T a sex act.\n \n Gacy didn't pick boys because they turned him on. \n \n I hate HATE HATE this argument. Its so completely and utterly wrong. Damned fundies. You completely trivialize what rape is really about when you do this. You insult homosexuals AND victims with this ####.\n \n emoticon_angry emoticon_angry emoticon_angry emoticon_angry emoticon_xkill emoticon_xkill emoticon_xkill", 
   {}, 
   276754, 
   null, 
   1186450560.0
  ], 
  [
   276762, 
   null, 
   "foundit66", 
   "Just think Matthew, your chosen lifestyle goes against the natural drive of the other 93% of all life on Earth to reproduce, procreate and continue to live on by leaving their own progeny behind as their contribution to the World they inevitably leave behind. It's the most natural desire found in every species within the animal kingdom, and humanity. It's the reason life on Earth has continued to flourish.\n\n \n 1Cr 7:8 I say therefore to the unmarried and widows, It is good for them if they abide even as I. \n 1Cr 7:9 But if they cannot contain, let them marry: for it is better to marry than to burn. \n \n Funny.\n I would think the Bible would advocate people NOT get married and NOT leave progeny...", 
   {}, 
   276734, 
   null, 
   1186450980.0
  ], 
  [
   276763, 
   null, 
   "JSDKoeln", 
   "You don't know what the #### you are talking about. I used to work for the Hennepin County Violence Center. I have been a peer counselor for rape victims. I was also a mental health worker. I am also a victim of rape.\n \n When you rape it is not the person that turns you on, its the violence. As a matter of fact - many rapists CAN'T get it up becuase it ISN'T a sex act.\n \n Gacy didn't pick boys because they turned him on. \n \n I hate HATE HATE this argument. Its so completely and utterly wrong. Damned fundies. You completely trivialize what rape is really about when you do this. You insult homosexuals AND victims with this ####.\n \n emoticon_angry emoticon_angry emoticon_angry emoticon_angry emoticon_xkill emoticon_xkill emoticon_xkill\n\n \n YOu know, there's the man, I believe in LA, who is a pedophile and has all these pictures of young girls plastered all over the internet. Authorities are are trying to shut him down (as they should) but he's just doing his evil deeds.\n \n By AAs logic, Het = like's girls. so, therefor AA is a pederast. Better take his daughters away from him because all hets are pederasts. So, voila! there you have it!\n \n grrrrrrrrrr His logic is beyond reproach. No, I hope AA is not one, but what a\n ####ing loser he is. All these silly arguments because of the \"ilk\" factor. I wish ban him from this board.", 
   {}, 
   276758, 
   null, 
   1186451340.0
  ], 
  [
   276765, 
   null, 
   "foundit66", 
   "I'm not fixated on gays foundit. This is the gay rights forum and the subject is about gays so forgive me for staying on point.\n\n Forest for the trees Archie...\n That VIDEO was a fixation on gays.\n The only way somebody could support THAT VIDEO is that if they SHARE the fixation on gays, ignoring the similar problems with pedophiles who molest girls. \n \n \n \nThat's fine with me. Gay priests join the priesthood just for easy access to boys. Did you really think I would make excuses for priests just because they call themselves christians ? They're sick perverts and never should have been allowed to commit their crimes twice. And for that i blame the RCC all the way.\n\n Silly me.\n I should have checked a list of your prejudices before trying the analogy... \n \n \n \nWe don't know that there weren't a whole series of movies at that time that focussed on different types of predators and abuse, and we're just seeing one of them.\n\n Oh cut the bull-spit Archie...\n There is no point in focusing as EXCLUSIVELY on \"gays\" as that video DID focus on GAYS.\n You'll notice that the video didn't talk about \"pedophiles\".\n It talked about GAYS.\n When it labelled the \"sickness\", it labelled the sickness as HOMOSEXUALITY.\n \n We could do a special on rapists and gang-bangers and mass murderers, educating thepublic on how to avoid being a victim.\n And then if we tossed \"Christianity\" onto the list, insisting that people should avoid christianity as well...\n THAT would be a problem for you.\n \n But lumping gays in with rapists and pedophiles, you have no problem with.\n \n \n \nBut build it into a conspiricy to demonize all gays why dontya. \n\n You really are thick.\n THAT is how people LOOKED AT GAYS in the 1950's.\n THAT was an acceptable \"public service announcement\".\n \n It WAS a conspiracy to demonize all gays.\n The fact that you deny that is astounding!\n \n \n \nI brought bundy up because he was relevant to Matts claim that the video was sick. I wanted to show him what a gay predator looks like. One who dresses like a clown no less. And you can claim he wasn't gay if you like but he sure had his way sexually with those boys. And he wasn't a pedophile because the boys weren't children but upper aged teens and early 20s. Oh, and by the way, I'm not implying at all, in any way that all gays are like Gacy. Only an irrational extremist would get such a message from anything I wrote in the post in question.\n\n Ahhh.\n I get the picture now.\n \n So likewise, we should bring up Christian nazis as an example of how Christianity is evil, and that's all well and good... emoticon_xgood \n http://www.nobeliefs.com/Hitler1.htm\n \n After all, we can just include it as a group of public service announcements, like showing Fred Phelps and other examples of Christianity.\n http://moose-and-squirrel.com/bozo/bozo.html", 
   {}, 
   276754, 
   null, 
   1186451700.0
  ], 
  [
   276766, 
   null, 
   "Archangel", 
   "You don't know what the #### you are talking about. I used to work for the Hennepin County Violence Center. I have been a peer counselor for rape victims. I was also a mental health worker. I am also a victim of rape.\n \n When you rape it is not the person that turns you on, its the violence. As a matter of fact - many rapists CAN'T get it up becuase it ISN'T a sex act.\n \n Gacy didn't pick boys because they turned him on. \n \n I hate HATE HATE this argument. Its so completely and utterly wrong. Damned fundies. You completely trivialize what rape is really about when you do this. You insult homosexuals AND victims with this ####.\n \n emoticon_angry emoticon_angry emoticon_angry emoticon_angry emoticon_xkill emoticon_xkill emoticon_xkill\n\n \n I know exactly what I'm talking about jito. But I find it interesting that you think you can define the complete parameters, and all of the different motivations and reasons for rape, homicidal abuses and gay rape in one short paragraph. As a victim, what makes you think you understand the mind and motivation of every different type of victimizer out there ? \n \n \n1Cr 7:8 I say therefore to the unmarried and widows, It is good for them if they abide even as I. \n 1Cr 7:9 But if they cannot contain, let them marry: for it is better to marry than to burn. \n \n Funny.\n I would think the Bible would advocate people NOT get married and NOT leave progeny...\n\n \n Then you would be wrong foundit. In the passages in question Paul was speaking specifically to those who want to serve God full time in the ministry. He was saying it is better that ones attention not be divided by dealing with another full time relationship with a wife. But only if they are able to live such a life of discipline meaning don't have sex outside of marriage while serving God. Better to marry than to burn means better to marry than to burn with lust as in the physical need for sex.", 
   {}, 
   276762, 
   null, 
   1186452060.0
  ], 
  [
   276767, 
   null, 
   "foundit66", 
   "I know exactly what I'm talking about jito. But I find it interesting that you think you can define the complete parameters, and all of the different motivations and reasons for rape, homicidal abuses and gay rape in one short paragraph. As a victim, what makes you think you understand the mind and motivation of every different type of victimizer out there ? \n\n emoticon_xdonno \n Man Archie, I wonder if there is ANYBODY on this message board who finds you a credible resource at this stage.\n Jito EXPLICITLY noted that IN ADDITION to being a rape victim, there is ALSO KNOWLEDGE because of \"work for the Hennepin County Violence Center. I have been a peer counselor for rape victims.\"\n \n We could link you numerous articles on the issue of \"rape\" and its REAL connection to VIOLENCE, but of course you wouldn't listen unless some guy claimed he heard it from a burning bush thousands of years ago...\n \n \n \nThen you would be wrong foundit. In the passages in question Paul was speaking specifically to those who want to serve God full time in the ministry.\n\n QUOTE the passage which establishes that context.\n http://www.blueletterbible.org/kjv/1Cr/1Cr007.html#8", 
   {}, 
   276766, 
   null, 
   1186452840.0
  ], 
  [
   276773, 
   null, 
   "Archangel", 
   "emoticon_xdonno \n Man Archie, I wonder if there is ANYBODY on this message board who finds you a credible resource at this stage.\n Jito EXPLICITLY noted that IN ADDITION to being a rape victim, there is ALSO KNOWLEDGE because of \"work for the Hennepin County Violence Center. I have been a peer counselor for rape victims.\"\n \n We could link you numerous articles on the issue of \"rape\" and its REAL connection to VIOLENCE, but of course you wouldn't listen unless some guy claimed he heard it from a burning bush thousands of years ago...\n\n \n I absolutely agree that violence is one of the motivations for rape foundit and jito. The point of my post was to say it isn't the be all and end all reason and motivation behind all rapes. Although I believe this sense of power motivated Gacy, it in no way means it also wasn't about getting his rocks off with young men. \n \n Complete libraries exist to try to understand the psychosis behind mass murderers so forgive me for not being impressed with the one paragraph jito gave to explain what created and motivated Gacy.", 
   {}, 
   276767, 
   null, 
   1186453860.0
  ], 
  [
   276775, 
   null, 
   "foundit66", 
   "I absolutely agree that violence is one of the motivations for rape foundit and jito. The point of my post was to say it isn't the be all and end all reason and motivation behind all rapes. Although I believe this sense of power motivated Gacy, it in no way means it also wasn't about getting his rocks off with young men.\n Complete libraries exist to try to understand the psychosis behind mass murderers so forgive me for not being impressed with the one paragraph jito gave to explain what created and motivated Gacy.\n\n 1) It isn't \"mass murderers\" which is the focus, but rather RAPISTS.\n You keep trying to blur the issue / change the subject.\n \n 2) I would be curious as to what information from these \"libraries\" you can show which demonstrate legitimate sexual arousal, as opposed to arousal from the violence, in rapists.\n \n You claim \"libraries\" exist, so it shouldn't be too hard for you to substantiate.\n Unless of course you're just talking out your :xcensored", 
   {}, 
   276773, 
   null, 
   1186454760.0
  ], 
  [
   276778, 
   null, 
   "Archangel", 
   "\n 1) It isn't \"mass murderers\" which is the focus, but rather RAPISTS.\n You keep trying to blur the issue / change the subject.\n\n \n I'm not trying to blur the issue at all. I'm just commenting on the complete violation against these guys. Murder is violent foundit, and rape too can be based on power and violence. I understand that and agree with it. But the psychosis that creates these types of monsters is not to be defined so easily. That is all I'm saying. \n \n \n2) I would be curious as to what information from these \"libraries\" you can show which demonstrate legitimate sexual arousal, as opposed to arousal from the violence, in rapists.\n\n \n All I'm trying to get through to you is the FACT that no one else was controlling Gacy except Gacy. And he chose to abduct, drug, rape and kill guys. He could have targeted girls if he preferred them but he obviously didn't because he targeted young men exclusively. Not one girl was victimized by him. This isn't to say that the arousal wasn't in the violence somewhat, but I'm just not concluding that it was exclusively based on the violence. As for researching sources that would fit with Gacy's case, I'm not qualified to determine those facts and neither are you or jito.", 
   {}, 
   276775, 
   null, 
   1186456740.0
  ], 
  [
   276780, 
   null, 
   "Jo Bennett", 
   "You don't have to be a psychologist to work out that the impulse to rape and murder people is qualitatively different from the impulse to make a lifelong commitment to someone and engage in mutually consensual acts with them as part of that relationship. This applies whatever the sexuality or gender of the people involved.", 
   {}, 
   276778, 
   null, 
   1186457160.0
  ], 
  [
   276781, 
   null, 
   "Bassman", 
   "Here's a fact that I don't think anyone has considered. Tendencies. What I mean is this. People have tendencies towards certain behaviors, such as homosexuality, violence, alcohol/substance abuse, etc. It's the old argument of \"nature vs. nurture\" conundrum. The question is. Do we act on those tendencies??", 
   {}, 
   276780, 
   null, 
   1186458000.0
  ], 
  [
   276782, 
   null, 
   "ShadowPikachu", 
   "Here's a fact that I don't think anyone has considered. Tendencies. What I mean is this. People have tendencies towards certain behaviors, such as homosexuality, heterosexuality, violence, alcohol/substance abuse, etc. It's the old argument of \"nature vs. nurture\" conundrum. The question is. Do we act on those tendencies??\n\n \n Added a word to make it more accurate.\n \n But as to your last bit, the question really is - is it wrong to act on those tendencies?", 
   {}, 
   276781, 
   null, 
   1186458240.0
  ], 
  [
   276783, 
   null, 
   "Bassman", 
   "Added a word to make it more accurate.\n \n But as to your last bit, the question really is - is it wrong to act on those tendencies?\nGood clarifcation and to answer the question: Alot of times it is wrong. For example: a person who is recovering from years of alcohol abuse, became a Christian and had good friends who are also Christians may not fall back into his old habits. Why? Accountability.", 
   {}, 
   276782, 
   null, 
   1186458660.0
  ], 
  [
   276784, 
   null, 
   "smiley", 
   "Good clarifcation and to answer the question: Alot of times it is wrong. For example: a person who is recovering from years of alcohol abuse, became a Christian and had good friends who are also Christians may not fall back into his old habits. Why? Accountability.\n\n \n Presumably, the same could be said if his new friends were atheists, muslims (especially strict muslims), buddhists, or any other denomination.", 
   {}, 
   276783, 
   null, 
   1186458780.0
  ], 
  [
   276785, 
   null, 
   "Bassman", 
   "Presumably, the same could be said if his new friends were atheists, muslims (especially strict muslims), buddhists, or any other denomination.\n\n The idea is that steel sharpens steel.", 
   {}, 
   276784, 
   null, 
   1186459020.0
  ], 
  [
   276787, 
   null, 
   "smiley", 
   "The idea is that steel sharpens steel.\n\n \n Meaning?\n \n Are you making a sweeping, baseless generalisation?", 
   {}, 
   276785, 
   null, 
   1186459260.0
  ], 
  [
   276788, 
   null, 
   "Bassman", 
   "Meaning?\n \n Are you making a sweeping, baseless generalisation?\n\n Me?? Heavens no. The point I'm making is that when you have a friend, sponsor, etc. looking out for you, your chances of recovery increase exponentially. It's called accountability.", 
   {}, 
   276787, 
   null, 
   1186459380.0
  ], 
  [
   276790, 
   null, 
   "thelmoose", 
   "Here's a fact that I don't think anyone has considered. Tendencies. What I mean is this. People have tendencies towards certain behaviors, such as homosexuality, violence, alcohol/substance abuse, etc. It's the old argument of \"nature vs. nurture\" conundrum. The question is. Do we act on those tendencies??\n\n \n Tendencies. \n Whether it is OK to act upon a \"tendency\" may depend upon whether the outcome of that activity is favorable or not.\n \n We have lots more tendencies, like kindness, generosity, playfulness. These are good ones. Why is it you lumped \"homosexuality, violence, alcohol/substance abuse\" together? The last two are mostly bad things, but \"one of those things is not like the other\". Homosexuality is just as good or bad as blue eyes or lefthandedness.\n \n We all have a \"tendency\" toward sexual behavior that aligns with our sexual orientation. Heteros \"tend\" to want to do it with the opposite sex and homos with the same sex. I am not sure I understand your point here.", 
   {}, 
   276781, 
   null, 
   1186459560.0
  ], 
  [
   276791, 
   null, 
   "Bassman", 
   "Tendencies. \n Whether it is OK to act upon a \"tendency\" depends whether the outcome of that activity is favorable or not.\n \n We have lots more tendencies, like kindness, generosity, playfulness. These are good ones. Why is it you lumped \"homosexuality, violence, alcohol/substance abuse\" together? The last two are mostly bad things, but \"one of those things is not like the other\". Homosexuality is just as good or bad as blue eyes or lefthandedness.\n \n We all have a \"tendency\" toward sexual behavior that aligns with our sexual orientation. Heteros \"tend\" to want to do it with the opposite sex and homos with the same sex. I am not sure I understand your point here.\n\n That's where you and I differ. See I view human sexuality as being the exclusive province of the monogamous heterosexual marriage bond. And as a man of faith, I can understand the reasons why human sexuality must have strict rules and guidlines.", 
   {}, 
   276790, 
   null, 
   1186459800.0
  ], 
  [
   276792, 
   null, 
   "smiley", 
   "Me?? Heavens no. The point I'm making is that when you have a friend, sponsor, etc. looking out for you, your chances of recovery increase exponentially. It's called accountability.\n\n \n Aaah! So, I was right. The friends could be atheists, buddhists, muslims etc.\n \n Just so we are clear on that.", 
   {}, 
   276788, 
   null, 
   1186459800.0
  ], 
  [
   276793, 
   null, 
   "Bassman", 
   "Aaah! So, I was right. The friends could be atheists, buddhists, muslims etc.\n \n Just so we are clear on that.\n\n Now, here's a distinct difference. Humans, without a living, vital relationship with G-d, rely on finite human understanding and very little power to chang their lives. Christians, OTOH, have the infinite power of Heaven available to them.\n \n Here's a tangible example of what I'm speaking of:\n \n I have a good friend named William \"Big Bill\" McCutchen.\n \n Bill was an alcoholic and heavy drug user for over 20 years until he ended up at the Erie County Medical Center (ECMC). Upon leaving, and entering a halfway house, he discovered Celebrate Recovery. What is CR? It is a twelve-step recovery ministry that helps address habits, hurts, and hangups; similar to AA or NA but with a huge difference. It is Christ-centered and I have seen first hand, the effects and outcomes of CR. Until his Homegoing (That's \"passing\" for those of you in Rio Linda), Bill was a vibrant, gentle, strong , and solid man of G-d. He died last month of complications from pneumonia. The lives he impacted and the testimony he leaves behind will affect future generations to come.", 
   {}, 
   276792, 
   null, 
   1186460280.0
  ], 
  [
   276795, 
   null, 
   "smiley", 
   "Now, here's a distinct difference. Humans, without a living, vital relationship with G-d, rely on finite human understanding and very little power to chang their lives. Christians, OTOH, have the infinite power of Heaven available to them.\n\n \n So I was right. You were making a sweeping, baseless generalisation.\n \n Wow! I'm 2 for 2. emoticon_xhoho (Oops)\n \n Smiley", 
   {}, 
   276793, 
   null, 
   1186460460.0
  ], 
  [
   276796, 
   null, 
   "Bassman", 
   "So I was right. You were making a sweeping, baseless generalisation.\n \n Wow! I'm 2 for 2. emoticon_xhoho (Oops)\n \n Smiley\n\n \n Baseless?? How??", 
   {}, 
   276795, 
   null, 
   1186460640.0
  ], 
  [
   276797, 
   null, 
   "Foxtuba", 
   "Now, here's a distinct difference. Humans, without a living, vital relationship with G-d, rely on finite human understanding and very little power to chang their lives. Christians, OTOH, have the infinite power of Heaven available to them.\n \n \n\n \n Heaven is a place where nothing ever happens. Sounds like a crappy place to live.\n \n Oh, and heaven isn't real.\n \n Also, there is very little in nature to understand. We are advanced biological creatures, but nothing more than that. We have potent intellectual capabilities, but since physics remains confined, all we can do is speculate and think ourselves to death. For example, we can spend our entire lives praying to a fictional deity, before passing away and returning to nature without conflicting thoughts present.", 
   {}, 
   276793, 
   null, 
   1186460760.0
  ], 
  [
   276798, 
   null, 
   "Bassman", 
   "Heaven is a place where nothing ever happens. Sounds like a crappy place to live.\n \n Oh, and heaven isn't real.\n \n Also, there is very little in nature to understand. We are advanced biological creatures, but nothing more than that. We have potent intellectual capabilities, but since physics remains confined, all we can do is speculate and think ourselves to death. For example, we can spend our entire lives praying to a fictional deity, before passing away and returning to nature without conflicting thoughts present.\n\n \n Again, that's where I beg to differ. We were created with eternal souls. And the choice is entirely up to us whether we accept G-d at His Word, or reject him and suffer the eternal consquences thereto.", 
   {}, 
   276797, 
   null, 
   1186460880.0
  ], 
  [
   276800, 
   null, 
   "thelmoose", 
   "That's where you and I differ. See I view human sexuality as being the exclusive province of the monogamous heterosexual marriage bond. And as a man of faith, I can understand the reasons why human sexuality must have strict rules and guidlines.\n\n \n We clearly differ. \n I don't think the clearest information about \"other people's\" sexuality can be obtained from one's religion faith. I think you are confusing sexuality with sexual mores. As a \"man of faith\" you can choose to believe things about your sexuality, knock yourself out. However, outside of that narrow religious view, our understanding of human sexuality is much different from that. Sexuality is a biological and psychological phenomenon. I don't think you look to your faith to understand cardiology or neurology or psychiatry, do you? We have social rules regarding our behavior as well, but those are unrelated to our sexuality. You said yourself we have \"tendencies\". If you want to believe that only your tendecies are OK, go for it. But limit that to your behavior and not the whole world.", 
   {}, 
   276791, 
   null, 
   1186462620.0
  ], 
  [
   276854, 
   null, 
   "jitobear", 
   "All I'm trying to get through to you is the FACT that no one else was controlling Gacy except Gacy. And he chose to abduct, drug, rape and kill guys. He could have targeted girls if he preferred them but he obviously didn't because he targeted young men exclusively. Not one girl was victimized by him. This isn't to say that the arousal wasn't in the violence somewhat, but I'm just not concluding that it was exclusively based on the violence.\n\n \n Sex is an expression of love, lust, pleasure. Sex in rape is a WEAPON. Sex is used to HURT someone. There is no question Gacy specifically targeted boys for a reason - for some reason he wanted to hurt them. It wasn't that he liked them. \n \n You completely trivialize what a rape is. It is an act of violence done by someobody who desires to hurt you - not somebody who loves you or desires you. You are completely offensive here - and completely wrong.\n \n There is no evidence Gacy was gay, and even if he was, that is not why he raped and killed boys and young men.", 
   {}, 
   276778, 
   null, 
   1186503660.0
  ], 
  [
   276857, 
   null, 
   "foundit66", 
   "That's where you and I differ. See I view human sexuality as being the exclusive province of the monogamous heterosexual marriage bond.\n\n That's like looking at a rainbow and insisting it only has the color red in it.\n \n \n \nAnd as a man of faith, I can understand the reasons why human sexuality must have strict rules and guidlines.\n\n Care to elaborate on these reasons?\n \n \n \nNow, here's a distinct difference. Humans, without a living, vital relationship with G-d, rely on finite human understanding and very little power to chang their lives. Christians, OTOH, have the infinite power of Heaven available to them.\n\n And yet, despite this \"living, vital relationship with God\", they screw up just as often as the rest of us.\n In fact, the Christian divorce rate is EVEN HIGHER than the divorce rate for atheists.\n Research into ANY type of \"reparative therapy\" group demonstrates an abysmal \"success\" rate.\n \n Can you show me ANY research which demonstrates people with a connection to this \"infinite power\" do any better than a placebo group?", 
   {}, 
   276791, 
   null, 
   1186504560.0
  ], 
  [
   276860, 
   null, 
   "foundit66", 
   "I'm not trying to blur the issue at all. I'm just commenting on the complete violation against these guys. Murder is violent foundit, and rape too can be based on power and violence. I understand that and agree with it. But the psychosis that creates these types of monsters is not to be defined so easily. That is all I'm saying. \n\n It's amazing how you talk, but say absolutely nothing.\n And you do absolutely nothing to counter what was ACTUALLY said.\n \n I'm not talking about defining the \"psychosis that creates these types of monsters\".\n I'm talking about whether rape is about \"violence\", and whether or not it has ANY basis in \"sexual desire\".\n \n Evidently you comprehend that rape is, at least in some part, about violence.\n But you cannot show how it is in any way based on sexual desire.\n \n And you refuse to admit you cannot show that...\n \n \n \nAll I'm trying to get through to you is the FACT that no one else was controlling Gacy except Gacy. And he chose to abduct, drug, rape and kill guys. He could have targeted girls if he preferred them but he obviously didn't because he targeted young men exclusively. Not one girl was victimized by him. This isn't to say that the arousal wasn't in the violence somewhat, but I'm just not concluding that it was exclusively based on the violence.\n\n It's funny to watch you back-pedal.\n Earlier, you claimed there was \"libraries\" of evidence.\n And now that I have asked you to quote any information from those \"libraries\", you utterly fail to do so.\n \n The vast majority of rapists are heterosexual. I have actually looked for \"homosexual\" rape statistics, but have repeatedly been unable to find ANY statistics on it.\n So, does that mean that heterosexual rape is tied to the heterosexual orientation?\n If we were to put out a video similar to the one posted earlier and declare that the \"sickness\" was the heterosexual male, would that be sensible?\n \n Maybe if I were to take your approach, I could just blindly claim that I could not conclude that heterosexual rape cannot be excluded from having some basis in heterosexuality... emoticon_frazzled \n \n \n \nAs for researching sources that would fit with Gacy's case, I'm not qualified to determine those facts and neither are you or jito.\n\n You are right that you are not qualified.\n Jito has explicitly stated the history and work personally done. That gives Jito qualification.\n I have also done a fair amount of research on the subject. If I thought you had ANY capability to actually learn, I would quote you some literature on the subject.\n \n But I don't think you want to learn. I think you prefer ignorance. You prefer to be able to hold onto positions based on \"belief\" because it's conveniently something you can make up as you go along.\n \n You never did get back to me to show WHERE that bible passage from Paul stated that he was talking ONLY about people who were setting their life to serve God, did you. emoticon_emb \n \n Do you even care if anybody finds you as credible?", 
   {}, 
   276778, 
   null, 
   1186505220.0
  ], 
  [
   276865, 
   null, 
   "Archangel", 
   "Sex is an expression of love, lust, pleasure. Sex in rape is a WEAPON. Sex is used to HURT someone. There is no question Gacy specifically targeted boys for a reason - for some reason he wanted to hurt them. It wasn't that he liked them.\n\n \n But rape is also committed by a rapist in order to satisfy some sexual urge in the rapist. The violence perpetrated against the victim is often to somehow justify that the victim caused the rape by something they did to deserve it. A twisted justification of sorts by the rapist. It isn't as nearly cut and dry as you like to paint it jito. \n \n \nYou completely trivialize what a rape is. It is an act of violence done by someobody who desires to hurt you - not somebody who loves you or desires you. You are completely offensive here - and completely wrong.\n\n \n How am I trivializing what rape is when \"I\" posted the story of what Gacy did ? Gacy is a brutal and blood curdling example of the violence man is capable of perpetrating against man for totally self indulgent reasons. And it is Gacy who is offensive jito, not me posting what he did.\n \n \nThere is no evidence Gacy was gay, and even if he was, that is not why he raped and killed boys and young men.\n\n \n You can speculate all you like. The evidence say's he was a gay predator of young men who killed them once he got what he wanted, which was sexual gratification.", 
   {}, 
   276854, 
   null, 
   1186505760.0
  ], 
  [
   276877, 
   null, 
   "samiinh", 
   "\n \n \n \n You can speculate all you like. The evidence say's he was a gay predator of young men who killed them once he got what he wanted, which was sexual gratification.\n\n \n How do you know what goes on in the mind of psychopath like this guy?", 
   {}, 
   276865, 
   null, 
   1186510800.0
  ], 
  [
   276883, 
   null, 
   "foundit66", 
   "But rape is also committed by a rapist in order to satisfy some sexual urge in the rapist.\n\n Part of the problem is that you keep saying junk but refuse to acknowledge or recognize when your junk is just plain WRONG.\n \n It DOES NOT satisfy \"sexual urge\" on the part of the rapist.\n The \"urge\" is for VIOLENCE in the form of a sexual act.\n The \"sexual act\" is just a tool to implement the violence.\n \n \n \nThe violence perpetrated against the victim is often to somehow justify that the victim caused the rape by something they did to deserve it. A twisted justification of sorts by the rapist. It isn't as nearly cut and dry as you like to paint it jito.\n \n This is closer to the truth.\n It does not have ANYTHING to do with sexual desire for the rape victim.\n The rape victim supposedly \"deserved\" the violence.\n \n During sex, do you ever find yourself thinking that your sex partner \"deserves\" what they are getting?\n \n Sexual desire and raping thoughts are two ENTIRELY different animals.\n \n \n \nHow am I trivializing what rape is when \"I\" posted the story of what Gacy did ?\n\n The same way a person can post a story of rape and claim the rape victim \"deserved\" what they got.\n You are trivializing the actual mechanisms that underly rape.\n \n \n \nGacy is a brutal and blood curdling example of the violence man is capable of perpetrating against man for totally self indulgent reasons. And it is Gacy who is offensive jito, not me posting what he did.\n\n You aren't offensive for posting what Gacy ACTUALLY did.\n You are offensive for your claims regarding rape and what rape is, independent of Gacy's actions.\n \n \n \nYou can speculate all you like. The evidence say's he was a gay predator of young men who killed them once he got what he wanted, which was sexual gratification.\n\n \"The evidence\"?\n You have presented NO evidence.\n You have made CLAIMS that rape is, at least in part, about \"sexual gratification\", but you have IN NO WAY SUBSTANTIATED this claim despite stating that there are \"libraries\" of information.\n \n Moreover, to claim he was \"gay\" is just plain wrong.\n Take pedophiles for example.\n The vast majority of pedophiles who molest boys ARE HETEROSEXUAL in their adult relationships.\n They don't sleep with men. They sleep with WOMEN.\n \n What you don't seem to get is that people who RAPE are in it for the VIOLENCE.", 
   {}, 
   276865, 
   null, 
   1186511700.0
  ], 
  [
   276889, 
   null, 
   "Archangel", 
   "How do you know what goes on in the mind of psychopath like this guy?\n\n \n Feel free to post a link that discusses Gacy that say's he was anything other than a gay serial killer samiinh. I welcome the input as I searched for one but couldn't find it. Every link I checked referred to him as gay. Now that isn't to imply that he his at all representative of all gays, or even the majority of gays. It's just to say that Gacy was gay. Just as he was a true aberration to the gay community as a straight serial killer is unique to straight men. Thankfully for all of us, these types of men are rare.", 
   {}, 
   276877, 
   null, 
   1186512240.0
  ], 
  [
   276894, 
   null, 
   "thelmoose", 
   "I was going to post and ask how this topic veered to rape and Gacy. And what that had to do with the gay \"agenda\". I then let that go and looked up Gacy in wikipedia. A section regarding possible explanations for his behavior is below. I KNOW this is not the greatest source, but it is referenced and I simply couldn't find one of those libraries arch was talking about and failed to produce. I still cannot understand what this has to do with anything, but I figured I could be as irrelevant as anyone else.\n \n \nPossible explanations\n \n Some have pointed to his poor relationship with his alcoholic father, his head trauma and subsequent blackouts in his teenage years as some basis for his acts. There has also been some speculation that murdering men and boys - whom he called \"worthless little XXXXXX and punks\" - was Gacy's subconscious expression of self-hatred for his own homosexuality (Gacy claimed to hate gays and \"gay-acting people,\" and that he was bisexual).[6] He often stated he was \"uninhibited\" when it came to sex. However, his victims were mostly heterosexual males. Their most common attributes were youth and good looks.\n \n After his execution, Gacy's brain was removed. It is currently in the possession of Dr. Helen Morrison, who interviewed Gacy and other serial killers in an attempt to isolate common personality traits held by such people. However, an examination of Gacy's brain after his execution by the forensic psychiatrist hired by his lawyers revealed no abnormalities. She has said Gacy did not fit into any psychological profile associated with serial killers, and the psychological reasons for his rampage will probably never be known. During Gacy's trial, Dr. Morrison herself appeared as a psychiatric witness and told the court that he had \"the emotional makeup of an infant\" (Sullivan and Maiken, 1983).\n", 
   {
    "unicode_changes_made": true
   }, 
   276889, 
   null, 
   1186513080.0
  ], 
  [
   276903, 
   null, 
   "Archangel", 
   "Possible explanations\n \n Some have pointed to his poor relationship with his alcoholic father, his head trauma and subsequent blackouts in his teenage years as some basis for his acts. There has also been some speculation that murdering men and boys - whom he called \"worthless little XXXXXX and punks\" - was Gacy's subconscious expression of self-hatred for his own homosexuality (Gacy claimed to hate gays and \"gay-acting people,\" and that he was bisexual).[6] He often stated he was \"uninhibited\" when it came to sex. However, his victims were mostly heterosexual males. Their most common attributes were youth and good looks.\n \n After his execution, Gacy's brain was removed. It is currently in the possession of Dr. Helen Morrison, who interviewed Gacy and other serial killers in an attempt to isolate common personality traits held by such people. However, an examination of Gacy's brain after his execution by the forensic psychiatrist hired by his lawyers revealed no abnormalities. She has said Gacy did not fit into any psychological profile associated with serial killers, and the psychological reasons for his rampage will probably never be known. During Gacy's trial, Dr. Morrison herself appeared as a psychiatric witness and told the court that he had \"the emotional makeup of an infant\" (Sullivan and Maiken, 1983).\n\n \n \nI was going to post and ask how this topic veered to rape and Gacy. And what that had to do with the gay \"agenda\". I then let that go and looked up Gacy in wikipedia. A section regarding possible explanations for his behavior is below. I KNOW this is not the greatest source, but it is referenced and I simply couldn't find one of those libraries arch was talking about and failed to produce. I still cannot understand what this has to do with anything, but I figured I could be as irrelevant as anyone else.\n\n \n That's as rational as any explanation as I've seen for his psychosis. I also saw it and didn't bother posting it because it also concluded that he was a homosexual and I was seeking opposing evidence of that conclusion. It stands to reason that if Gacy wasn't seriously twisted, he would have sought out gays to have consensual sex with rather than do what he did to straight kids. Either way, no one denies he was selfishly satisfying some homosexual desires as he most likely also was lashing out at good looking straight kids he envied or just resented because of what they represented to him as something he never was, or could be.", 
   {
    "unicode_changes_made": true
   }, 
   276894, 
   null, 
   1186514580.0
  ], 
  [
   276905, 
   null, 
   "foundit66", 
   "I was going to post and ask how this topic veered to rape and Gacy. And what that had to do with the gay \"agenda\". I then let that go and looked up Gacy in wikipedia. A section regarding possible explanations for his behavior is below. I KNOW this is not the greatest source, but it is referenced and I simply couldn't find one of those libraries arch was talking about and failed to produce. I still cannot understand what this has to do with anything, but I figured I could be as irrelevant as anyone else.\n Possible explanations\n Some have pointed to his poor relationship with his alcoholic father, his head trauma and subsequent blackouts in his teenage years as some basis for his acts. There has also been some speculation that murdering men and boys - whom he called \"worthless little XXXXXX and punks\" - was Gacy's subconscious expression of self-hatred for his own homosexuality (Gacy claimed to hate gays and \"gay-acting people,\" and that he was bisexual).[6] He often stated he was \"uninhibited\" when it came to sex. However, his victims were mostly heterosexual males. Their most common attributes were youth and good looks.\n \n After his execution, Gacy's brain was removed. It is currently in the possession of Dr. Helen Morrison, who interviewed Gacy and other serial killers in an attempt to isolate common personality traits held by such people. However, an examination of Gacy's brain after his execution by the forensic psychiatrist hired by his lawyers revealed no abnormalities. She has said Gacy did not fit into any psychological profile associated with serial killers, and the psychological reasons for his rampage will probably never be known. During Gacy's trial, Dr. Morrison herself appeared as a psychiatric witness and told the court that he had \"the emotional makeup of an infant\" (Sullivan and Maiken, 1983).\n\n \n Just another example of what repressed homosexuality / homophobia can drive a person to do.\n Unfortunately, some people can't seem to grasp that it is HEALTHIER to accept yourself for who you ACTUALLY are instead of trying to insist that you're straight when the truth is that you're actually gay.", 
   {
    "unicode_changes_made": true
   }, 
   276894, 
   null, 
   1186515060.0
  ], 
  [
   276911, 
   null, 
   "jitobear", 
   "Rape is a form of assault where one individual forces another to have sexual intercourse against that person's will. Most experts believe the primary cause of rape is an aggressive desire to dominate the victim rather than an attempt to achieve sexual fulfillment. [1] They consider rape an act of violence rather than principally a sexual encounter.\n \n http://en.wikipedia.org/wiki/Rape\n \n Rape is about power, not sex. A rapist uses actual force or violence - or the threat of it - to take control over another human being. Some rapists use drugs to take away a person's ability to fight back. Rape is a crime, whether the person committing it is a stranger, a date, an acquaintance, or a family member.\n \n http://69.7.225.164/teen/your_mind/problems/rape_what_to_do.html\n \n \"Many people think that rape and sexual abuse is about the rapist trying to get sex. However, studies conducted with convicted rapists show that this isn't the case. Research shows that men who sexually offend do so to gain a sense of power and authority, while women sexually offend to either maintain or establish an emotional relationship. Sexual activity is the means by which this is achieved, not the reason for the rape.\" \n \n http://www.rapecrisis.org.nz/content.aspx?id=53\n \n Myth: Sexual assault is a crime of passion and lust.\n Fact: Sexual assault is a crime of violence. Assailants seek to overpower their victims.\n \n http://www.welcometobarbados.org/stand.html\n \n \n Archangel - Let me explain why you saying rape is about sex is offensive.\n \n If somebody shoots me, cuts me, beats me - there is no question that I have been a victim of violence. When someone uses sex as a weapon its exactly the same thing. I am a victim of violence. You saying that the perpetrator was acting on sexual impulse trivializes the fact that I was a victim of violence. It also feeds into the idea that victims \"asked for it\" or could have prevented it by not being somewhere or dressing in a certain way. \n \n It also cheapens sex. Even when you were a womanizer woud you be so turned on that you would continue to have sex without a woman's consent? A terrified and hurting woman not into the moment would have been hot for you?", 
   {
    "unicode_changes_made": true
   }, 
   276894, 
   null, 
   1186515720.0
  ], 
  [
   276914, 
   null, 
   "thelmoose", 
   "That's as rational as any explanation as I've seen for his psychosis. I also saw it and didn't bother posting it because it also concluded that he was a homosexual and I was seeking opposing evidence of that conclusion. It stands to reason that if Gacy wasn't seriously twisted, he would have sought out gays to have consensual sex with rather than do what he did to straight kids. Either way, no one denies he was selfishly satisfying some homosexual desires as he most likely also was lashing out at good looking straight kids he envied or just resented because of what they represented to him as something he never was, or could be.\n\n \n \n How can two people read the same thing and come to such a different conclusion. What part of \"the psychological reasons for his rampage will probably never be known\" do you not understand?\n \n It did NOT conclude anything about this sexuality or his \"sexual desires\" - quite the opposite. You seem very adept at taking any informational input and spitting out your pre-conceived notions.", 
   {}, 
   276903, 
   null, 
   1186516080.0
  ], 
  [
   276925, 
   null, 
   "Archangel", 
   "How can two people read the same thing and come to such a different conclusion. What part of \"the psychological reasons for his rampage will probably never be known\" do you not understand?\n \n It did NOT conclude anything about this sexuality or his \"sexual desires\" - quite the opposite. You seem very adept at taking any informational input and spitting out your pre-conceived notions.\n\n \n Either we read different things or you're not comprehending what you yourself posted moose. How do you interpret this if not as I defined it ?\n There has also been some speculation that murdering men and boys - whom he called \"worthless little XXXXXX and punks\" was Gacy's subconscious expression of self-hatred for his own homosexuality (Gacy claimed to hate gays and \"gay-acting people,\" and that he was bisexual).[6] He often stated he was \"uninhibited\" when it came to sex. However, his victims were mostly heterosexual males. Their most common attributes were youth and good looks.\n By his own admission he was bisexual, so even he didn't deny his gay tendencies. So what am I missing moose ?", 
   {
    "unicode_changes_made": true
   }, 
   276914, 
   null, 
   1186519440.0
  ], 
  [
   276928, 
   null, 
   "thelmoose", 
   "Either we read different things or you're not comprehending what you yourself posted moose. How do you interpret this if not as I defined it ?\n \n \nThere has also been some speculation that murdering men and boys ... was Gacy's subconscious expression of self-hatred for his own homosexuality.\n\n \n By his own admission he was bisexual, so even he didn't deny his gay tendencies. So what am I missing moose ?\n\n No one knows his orientation. It was speculated that he actions could have been due to self-hatred from a closeted gay.\n \n \nThat's as rational as any explanation as I've seen for his psychosis. \n \n No one said he was psychotic. And no explanation was given. Here is what was said:\n \nGacy did not fit into any psychological profile associated with serial killers, and the psychological reasons for his rampage will probably never be known.\n\n \n \nI also saw it and didn't bother posting it because it also concluded that he was a homosexual and I was seeking opposing evidence of that conclusion. \n\n \n It did not conclude anything and why would you suddenly change your stance and seek any evidence that doesn't align with your ideas?\n \n \nIt stands to reason that if Gacy wasn't seriously twisted, he would have sought out gays to have consensual sex with rather than do what he did to straight kids. \n\n A rather facile and unsubstantiated conclusion. Nothing \"stands to reason\" here. I would not be willing to make such blithe conclusions about a topic I know next to nothing about especially when the experts themselves are baffled.\n \n \n \nEither way, no one denies he was selfishly satisfying some homosexual desires as he most likely also was lashing out at good looking straight kids he envied or just resented because of what they represented to him as something he never was, or could be. \n \n No one denies this, but no one has ever claimed anything of the kind. This is entirely your conjecture and I would be the concerned that your putative explanations that you claim are \"most likely\" are projection on your part.", 
   {}, 
   276925, 
   null, 
   1186522740.0
  ], 
  [
   277021, 
   null, 
   "robbie0517", 
   "Who the heck is Star Parker and what makes her a qualified spokesperson to set the \"gay agenda\"?\n\n \n \n I know this is no longer in line with the current conversation but Star Parker was mentioned a while back.. She is a Very conservative, right wing, religious extremist. Getting the \"gay agenda\" from her is like getting it from Fred Phelps. For a glance into her views here is a youtube clip... \n \n http://youtube.com/watch?v=VB6WnoB4vak", 
   {}, 
   276551, 
   null, 
   1186557360.0
  ], 
  [
   277036, 
   null, 
   "samiinh", 
   "I know this is no longer in line with the current conversation but Star Parker was mentioned a while back.. She is a Very conservative, right wing, religious extremist. Getting the \"gay agenda\" from her is like getting it from Fred Phelps. For a glance into her views here is a youtube clip... \n \n http://youtube.com/watch?v=VB6WnoB4vak\n\n \n She was replaced with Rosie O'Donnell on The View, who in turn is being replaced by Whoopie Goldberg, both gay friendly stars.", 
   {}, 
   277021, 
   null, 
   1186573080.0
  ], 
  [
   277061, 
   null, 
   "Archangel", 
   "She was replaced with Rosie O'Donnell on The View, who in turn is being replaced by Whoopie Goldberg, both gay friendly stars.\n\n \n Uhh, it was Star Jones, a Lawyer and ex-Judge who was replaced by the extremist Rosie O'Donnel on the View, not Star Parker.", 
   {}, 
   277036, 
   null, 
   1186584780.0
  ], 
  [
   277194, 
   null, 
   "samiinh", 
   "Uhh, it was Star Jones, a Lawyer and ex-Judge who was replaced by the extremist Rosie O'Donnel on the View, not Star Parker.\n\n \n You are right. Why do you call Rosie and extremist? My mother taught us that if we couldn't say anything nice, we shouldn't say anything (expect in forums with immoral religious bigots).", 
   {}, 
   277061, 
   null, 
   1186619880.0
  ], 
  [
   277221, 
   null, 
   "robbie0517", 
   "Uhh, it was Star Jones, a Lawyer and ex-Judge who was replaced by the extremist Rosie O'Donnel on the View, not Star Parker.\n\n \n Why is Rosie O'Donnel extremist AA? Because she spoke openly of her gay partner and children?", 
   {}, 
   277061, 
   null, 
   1186624020.0
  ], 
  [
   277222, 
   null, 
   "Archangel", 
   "You are right. Why do you call Rosie and extremist? My mother taught us that if we couldn't say anything nice, we shouldn't say anything (expect in forums with immoral religious bigots).\n\n \n Then why don't you practice what your mother taught you rather than personally attacking me by calling me a religious bigot ? And as to why I call Rosie an extremist ? Because she is one. And a lowlife loud mouth too.", 
   {}, 
   277194, 
   null, 
   1186624260.0
  ], 
  [
   277224, 
   null, 
   "robbie0517", 
   "Then why don't you practice what your mother taught you rather than personally attacking me by calling me a religious bigot ? And as to why I call Rosie an extremist ? Because she is one. And a lowlife loud mouth too.\n\n \n Well thanks for the details AA, that clears it up. Ya know, I really don't care of your opinion of her. She does more charity work for children and families than any celebrity I know of. Please don't respond as I honestly don't care.\n \n Added as an afterthought: That Christian love for your fellow human sure is showing again, calling other human beings you have never met vile names must be something you learned from the book.", 
   {}, 
   277222, 
   null, 
   1186624620.0
  ], 
  [
   277225, 
   null, 
   "Matthew S", 
   "Then why don't you practice what your mother taught you rather than personally attacking me by calling me a religious bigot ? And as to why I call Rosie an extremist ? Because she is one. And a lowlife loud mouth too.\n\n \n Well then you would agree that Pat Robertson and James Dobson are, as you put it \"extremist lowlife loudmouths\"", 
   {}, 
   277222, 
   null, 
   1186624740.0
  ], 
  [
   277226, 
   null, 
   "samiinh", 
   "Then why don't you practice what your mother taught you rather than personally attacking me by calling me a religious bigot ? And as to why I call Rosie an extremist ? Because she is one. And a lowlife loud mouth too.\n\n \n Why did you think I was referring to you? Like the old saying goes, \"if the pumps fit, wear 'em.\"", 
   {}, 
   277222, 
   null, 
   1186624800.0
  ], 
  [
   277227, 
   null, 
   "samiinh", 
   "Well then you would agree that Pat Robertson and James Dobson are, as you put it \"extremist lowlife loudmouths\"\n\n \n Most of their charity work is charity for themselves.", 
   {}, 
   277225, 
   null, 
   1186624860.0
  ], 
  [
   277228, 
   null, 
   "robbie0517", 
   "Pertaining to the this thread \"the gay agenda\"\n \n Desperate Houswives is adding a gay couple to next season.. our agenda is advancing well :)", 
   {}, 
   277227, 
   null, 
   1186625100.0
  ], 
  [
   277229, 
   null, 
   "samiinh", 
   "If you want a good laugh.....off topic, but I thought this was rich:\n \n Republican presidential hopeful Mitt Romney on Wednesday defended his five sons' decision not to enlist in the military, saying they're showing their support for the country by \"helping me get elected.\"\n \n Romney, who did not serve in Vietnam due to his Mormon missionary work and a high draft lottery number, was asked the question by an anti-war activist after a speech in which he called for \"a surge of support\" for U.S. forces in Iraq.", 
   {}, 
   277228, 
   null, 
   1186625280.0
  ], 
  [
   277237, 
   null, 
   "Matthew S", 
   "If you want a good laugh.....off topic, but I thought this was rich:\n \n Republican presidential hopeful Mitt Romney on Wednesday defended his five sons' decision not to enlist in the military, saying they're showing their support for the country by \"helping me get elected.\"\n \n Romney, who did not serve in Vietnam due to his Mormon missionary work and a high draft lottery number, was asked the question by an anti-war activist after a speech in which he called for \"a surge of support\" for U.S. forces in Iraq.\n\n \n That is odd for someone who supports the war. Then again it is allways easier to send someone elses child off to die in vain.", 
   {}, 
   277229, 
   null, 
   1186626900.0
  ], 
  [
   277239, 
   null, 
   "samiinh", 
   "That is odd for someone who supports the war. Then again it is allways easier to send someone elses child off to die in vain.\n\n \n I read today that over 1000 independent contractors have also died in Iraq. If you add them to the list, close to 5000 have been sacrificed for a lie about oil.", 
   {}, 
   277237, 
   null, 
   1186627020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Gay Agenda", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10100, 
  "discussion_files": [
   [
    "25339.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-print.html"
   ], 
   [
    "25340.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-16-print.html"
   ], 
   [
    "25341.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-14-print.html"
   ], 
   [
    "25342.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-12-print.html"
   ], 
   [
    "25343.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-10-print.html"
   ], 
   [
    "25344.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-8-print.html"
   ], 
   [
    "25345.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-7-print.html"
   ], 
   [
    "25346.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-5-print.html"
   ], 
   [
    "25347.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-9-print.html"
   ], 
   [
    "25348.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-4-print.html"
   ], 
   [
    "25349.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-13-print.html"
   ], 
   [
    "25350.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-6-print.html"
   ], 
   [
    "25351.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-15-print.html"
   ], 
   [
    "25352.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-11-print.html"
   ], 
   [
    "25353.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-3-print.html"
   ], 
   [
    "25354.html", 
    "http://www.4forums.com/political/gay-rights-debates/10100-gay-agenda-2-print.html"
   ]
  ], 
  "identifier": 10100
 }
]