[
 [
  [
   274638, 
   null, 
   "wascallywabbit", 
   "**\n \"One species, many genomes\"\n \n \"Adaptation to the environment has a stronger effect on the genome than anticipated\"\n \n \"Faster growth, darker leaves, a different way of branching - wild varieties of the plant Arabidopsis thaliana are often substantially different from the laboratory strain of this small mustard plant, a favorite of many plant biologists. Which detailed differences distinguish the genomes of strains from the polar circle or the subtropics, from America, Africa or Asia has been investigated for the first time by research teams from Tübingen, Germany, and California led by Detlef Weigel from the Max Planck Institute for Developmental Biology. The results were surprising: The extent of the genetic differences far exceeds the expectations for such a streamlined genome, as the scientists write in this week's edition of Science magazine.\n \n \n \n Fig. 1: Arabidopsis plants from different geographical origins differ in many traits (the background shows schematically sequence variation in the DNA of these plants).\n \n Image: MPI for Developmental Biology\n \n To track down the variation in the genome of the different Arabidopsis strains, the researchers compared the genetic material of 19 wild strains with that of the genome of the lab strain, which was sequenced in the year 2000. Using a very elaborate procedure, they examined every one of the roughly 120 million building blocks of the genome. For their molecular sleuthing they used almost one billion specially designed DNA probes. \"All together, these probes would have seven times the length of human genome,\" illustrates Weigel the extent of the project. The data were evaluated with several specially designed statistical methods, including a variant of machine learning.\n \n The result of this painstaking analysis: on average, every 180th DNA building block is variable. And about four percent of the reference genome either looks very different in the wild varieties, or cannot be found at all. Almost every tenth gene was so defective that it could not fulfill its normal function anymore!\n \n Results such as these raise fundamental questions. For one, they qualify the value of the model genomes sequenced so far. \"There isn't such a thing as the genome of a species,\" says Weigel. He adds \"The insight that the DNA sequence of a single individual is by far not sufficient to understand the genetic potential of a species also fuels current efforts in human genetics.\"\n \n Still, it is surprising that Arabidopsis has such a plastic genome. In contrast to the genome of humans or many crop plants such as corn, that of Arabidopsis is very much streamlined, and its size is less than a twentieth of that of humans or corn-even though it has about the same number of genes. In contrast to these other genomes, there are few repeats or seemingly irrelevant filler sequences. \"That even in a minimal genome every tenth gene is dispensable, has been a great surprise,\" admits Weigel.\n \n Detailed analyses showed that genes for basic cellular functions such as protein production or gene regulation rarely suffer knockout hits. Genes that are important for the interaction with other organisms, on the other hand, such as those responsible for defense against pathogens or infections, are much more variable than the average gene. \"The genetic variability appears to reflect adaptation of local circumstances,\" says Weigel. It is likely that such variable genes allow plants to withstand dry or wet, hot or cold conditions, or make use of short and long growing seasons.\n \n Such genome analyses of unprecedented details will allow a much better understanding of local adaptation, and this was indeed one of the main reasons for conduction the study. \"By extending these types of studies to other species we hope to help breeders to produce varieties that are optimally adapted to rapidly changing environmental conditions,\" explains Weigel. He is already collaborating with the International Rice Research Institute (IRRI) in the Philippines to apply the methods and experience gathered with Arabidopsis to twenty different rice varieties.\n \n How environment and genome interact is also the goal of new, even more powerful methods. While the technology used so far can only identify genes that have changed or are lost relative to the reference genome, direct sequencing of the genome of wild strains will allow the detection of new genes. The plan is to decipher the genomes of at least 1001 Arabidopsis varieties. A new instrument, with which the entire genome of a plant can be read in just a few days, is already available. Still missing are the computational algorithms to interpret the anticipated flood of data.\n \n Researchers from Tübingen who contributed to the study include Richard Clark, Stephan Ossowski and Norman Warthmann from the MPI for Developmental Biology, Georg Zeller and Gunnar Rätsch from the Friedrich Miescher Laboratory of the Max Planck Society, Gabriele Schweikert and Bernhard Schölkopf from the MPI for Biological Cybernetics, and Daniel Huson from the University Tübingen. Researchers from California who contributed to this study include Huaming Chen, Paul Shinn and Joseph Ecker from the Salk Institute, Christopher Toomajian, Tina Hu and Magnus Nordborg from the University of Southern California, and Glenn Fu, David Hinds and Kelly Frazer from Perlegen Sciences, Inc. \n [DW/CB]\n \n Original work:\n \n Richard M. Clark, Gabriele Schweikert, Christopher Toomajian, Stephan Ossowski, Georg Zeller, Paul Shinn, Norman Whartmann, Tina T. Hu, Glenn Fu, David A. Hinds, Huaming Chen, Kelly A. Frazer, Daniel H. Huson, Bernhard Schölkopf, Magnus Nordborg, Gunnar Rätsch, Joseph R. Ecker, Detlef Weigel\n Common Sequence Polymorphisms Shaping Genetic Diversity in Arabidopsis thaliana\n Science, July 20, 2007Max Planck Society\n for the Advancement of Science\n Press and Public Relations Department\n \n Hofgartenstrasse 8\n D-80539 Munich\n Germany\n \n PO Box 10 10 62\n D-80084 Munich\n \n Phone: +49-89-2108-1276\n Fax: +49-89-2108-1207\n \n E-mail: presse@gv.mpg.de\n Internet: www.mpg.de/english/ \n \n Responsibility for content:\n Dr. Bernd Wirsing (-1276)\n \n ISSN 0170-4656\n \n PDF (168 KB)\n \n Contact:\n \n Prof. Dr. Detlef Weigel\n Max Planck Institute for Developmental Biology, Tübingen\n Tel.: +49 7071 601-1411\n E-mail: weigel@tuebingen.mpg.de\"\n \n **\n at-- http://www.mpg.de/english/illustrationsDocumentation/documentation/pressReleases/2007/pressRelease20070718", 
   {
    "post_info": {
     "post_title": "Yet another kick in the teeth for darwinist/materialist &quot;particle biology&quot;"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1184956620.0
  ], 
  [
   274640, 
   null, 
   "wascallywabbit", 
   "**\n \n For more on how darwinist/geneticist proponents of \"bits of stuff biology\" cannot tell the evolution of the cart from the evolution of the horse, [or the evolution of the 'dog' from the evolution of the 'tail', if you prefer],see below--\n \n \"Species Detectives Track Unseen Evolution\"\n \n \"Science Daily - New species are evading detection using a foolproof disguise -- their own unchanged appearance. Research published in the journal, BMC Evolutionary Biology, suggests that the phenomenon of different animal species not being visually distinct despite other significant genetic differences is widespread in the animal kingdom. \n \n DNA profiles and distinct mating groups are the only way to spot an evolutionary splinter group from their look-alike cousins, introducing uncertainty to biodiversity estimates globally.\n \n Markus Pfenninger and Klaus Schwenk searched the Zoological Record database (1978-2006) to pinpoint reports of hidden (cryptic) species both biogeographically and taxonomically, and found 2207 examples. Pfenninger and Schwenk, who are from Germany based at J.W. Goethe-Universität in Frankfurt found evidence for cryptic species evenly spread among all major branches of the animal kingdom. They also found that cryptic species were just as likely to be found in all biogeographical regions.\n \n The findings go against received wisdom that the insect or reptile branches of the animal kingdom are more likely to harbour cryptic species, and that these are more likely to be found in the tropics than in temperate regions. Zoologists should therefore consider factoring in a degree of cryptic diversity as a random error in all biodiversity assessments.\n \n A cryptic species complex is a group of species that is reproductively isolated from each other - but lacking conspicuous differences in outward appearance. Researchers using techniques such as polymerase chain reaction (PCR) and DNA sequencing have increasingly discovered - often unexpectedly - that similar-looking animals within a presumed species are in fact genetically divergent. \n \n As well as highlighting hidden biodiversity among creatures zoologists have already catalogued, the findings have implications for conservation efforts. Another possibility is that pathogens, parasites and invasive species disguised as their relatives may yet remain undetected, representing a potential human health threat.\n \n Article: Markus Pfenninger and Klaus Schwenk, \"Cryptic animal species are homogeneously distributed among taxa and biogeographical regions\" BMC Evolutionary Biology (in press) \n \n Note: This story has been adapted from a news release issued by BioMed Central.\"\n \n at--\n http://www.sciencedaily.com/releases/2007/07/070719011423.htm", 
   {
    "unicode_changes_made": true
   }, 
   274638, 
   null, 
   1184958360.0
  ], 
  [
   274645, 
   null, 
   "Kronus", 
   "WW's posts are always fun. Yet another paper showing further evidence of evolution presented as a \"kick in the teeth\" to Darwin. :p", 
   {}, 
   274640, 
   null, 
   1184959440.0
  ], 
  [
   274670, 
   null, 
   "chemist99a", 
   "Indeed the second paper quoted only establishes that the base of genetic variability is broader than might be expected from morphology alone. Which of course means there is more for natural selection to work on than is apparent to the eye.", 
   {}, 
   274645, 
   null, 
   1184965920.0
  ], 
  [
   274720, 
   null, 
   "Symbiote", 
   "You ever get the impression that WW isn't actually a person, but one of those bots that is designed to participate in conversation in ways vaguely resembling one, but lacking the essential characteristics of diversity of response and the ability to follow an argument?", 
   {}, 
   274670, 
   null, 
   1184987700.0
  ], 
  [
   274730, 
   null, 
   "supersport", 
   "Indeed the second paper quoted only establishes that the base of genetic variability is broader than might be expected from morphology alone. Which of course means there is more for natural selection to work on than is apparent to the eye.\n\n \n delete........", 
   {}, 
   274670, 
   null, 
   1184994360.0
  ], 
  [
   274731, 
   null, 
   "Hi_Its_Me", 
   "delete........\n\n What?\n \n \n Also, I fail to see how WW's post above is even relevant to this discussion (except as evidence for a genetics-based view of evolution)...", 
   {}, 
   274730, 
   null, 
   1184995440.0
  ], 
  [
   274764, 
   null, 
   "James", 
   "WW's posts are always fun. Yet another paper showing further evidence of evolution presented as a \"kick in the teeth\" to Darwin. :p\n\n Would any light be thrown on WW's attacks on Darwinism, by a thread in which the doctrine of vitalism was examined?\n \n James.", 
   {}, 
   274645, 
   null, 
   1185030780.0
  ], 
  [
   274771, 
   null, 
   "wascallywabbit", 
   "Would any light be thrown on WW's attacks on Darwinism, by a thread in which the doctrine of vitalism was examined?\n \n James.\n\n \n **\n Feel free to research the topic and start the thread, James.\n \n Here, from the philosophy dictionary at answers.com, is little something to get you started--\n \n \"vitalism \n The doctrine that there is some feature of living bodies that prevents their nature being entirely explained in physical or chemical terms. This feature may be the presence of a further 'thing' (such as a soul), but it may also be simply the emergence of special relations or principles of organization arising from the complexity of the biological organism. The former kind of doctrine envisages Life as a kind of fiery fluid (animal electricity, life force), that needs pouring into an inanimate body in order for it to become alive. Aristotle (De Anima and De Generatione) is the principal source of a more sophisticated vitalism, holding that the life of an animal consists in its psyche, which provides a principle of explanation determining the morphological development of the organism, by a principle of teleological or final causation. In the 19th century the two great exponents of vitalism were Bergson and the biologist Hans Driesch (1867-1941).\"", 
   {
    "unicode_changes_made": true
   }, 
   274764, 
   null, 
   1185037800.0
  ], 
  [
   274772, 
   null, 
   "chemist99a", 
   "Would any light be thrown on WW's attacks on Darwinism, by a thread in which the doctrine of vitalism was examined?\n\n \n Probably not since the doctrine is dead as a duck. It would be like trying to throw light on evolution by examining the Egyptian Book of the Dead.", 
   {}, 
   274771, 
   null, 
   1185038100.0
  ], 
  [
   274773, 
   null, 
   "wascallywabbit", 
   "**\n James, if Vitalism were as dead as a duck, it wouldn't be kicking darwinism's sorry butt up and down the length of this forum, the way it has been doing ever since I got here.", 
   {}, 
   274772, 
   null, 
   1185038400.0
  ], 
  [
   274779, 
   null, 
   "chemist99a", 
   "And the black knight will any day now slay everyone, right after he sews his arms legs and head back onto his torso. Any day now, just you wait.", 
   {}, 
   274773, 
   null, 
   1185039660.0
  ], 
  [
   274782, 
   null, 
   "chemist99a", 
   "Consider this excerpt from WIKI:\n \n \n \nOpponents of vitalism believe that it is pseudoscience, since its core ideas are metaphysical and impossible to prove or disprove using scientific method.\n \n Bechtel and Richardson[7] state that vitalism lacks credibility because it is often viewed as unfalsifiable, and is \"therefore a pernicious metaphysical doctrine.\" While many vitalistic theories have in fact been falsified, notably Mesmerism and the phlogiston theory (see above), the pseudoscientific retention of these falsified theories continues to this day in a fashion that ignores the testability criterion of the scientific method.\n \n For many scientists, \"vitalist\" theories are unsatisfactory \"holding positions\" on the pathway to mechanistic understanding. In 1967, Francis Crick, the co-discoverer of the structure of DNA, stated \"And so to those of you who may be vitalists I would make this prophecy: what everyone believed yesterday, and you believe today, only cranks will believe tomorrow.\"[26]\n \n Alan Sokal published an analysis of efforts within the field of nursing to describe vitalistic beliefs as \"new science\" (Pseudoscience and Postmodernism: Antagonists or Fellow-Travelers?).[27] Pseudoscientific accounts within the field of nursing of practices such as therapeutic touch were reviewed by Sokal and he concluded, \"nearly all the pseudoscientific systems to be examined in this essay are based philosophically on vitalism\". Sokal also noted that, \"Mainstream science has rejected vitalism since at least the 1930s, for a plethora of good reasons that have only become stronger with time.\"[27]\n \n In his book \"Kinds of Minds\", philosopher Daniel Dennett wrote, \"Dualism...and Vitalism (the view that living things contain some special physical but equally mysterious stuff -élan vital- have been relegated to the trash heap of history....\" (Chapter 2).[28]\n \n Joseph C. Keating, Jr., PhD, [29] discusses vitalism's past and present roles in chiropractic and calls vitalism \"a form of bio-theology.\" He further explains that:\n \n \"Vitalism is that rejected tradition in biology which proposes that life is sustained and explained by an unmeasurable, intelligent force or energy. The supposed effects of vitalism are the manifestations of life itself, which in turn are the basis for inferring the concept in the first place. This circular reasoning offers pseudo-explanation, and may deceive us into believing we have explained some aspect of biology when in fact we have only labeled our ignorance. 'Explaining an unknown (life) with an unknowable (Innate),' suggests philosopher Joseph Donahue, D.C., 'is absurd'.\"[18]\n \n He views vitalism as incompatible with scientific thinking:\n \n \"Chiropractors are not unique in recognizing a tendency and capacity for self-repair and auto-regulation of human physiology. But we surely stick out like a sore thumb among professions which claim to be scientifically based by our unrelenting commitment to vitalism. So long as we propound the 'One cause, one cure' rhetoric of Innate, we should expect to be met by ridicule from the wider health science community. Chiropractors can't have it both ways. Our theories cannot be both dogmatically held vitalistic constructs and be scientific at the same time. The purposiveness, consciousness and rigidity of the Palmers' Innate should be rejected.\"[18]\n \n He also mentions Skinner's viewpoint:\n \n \"Vitalism has many faces and has sprung up in many areas of scientific inquiry. Psychologist B.F. Skinner, for example, pointed out the irrationality of attributing behavior to mental states and traits. Such 'mental way stations,' he argued, amount to excess theoretical baggage which fails to advance cause-and-effect explanations by substituting an unfathomable psychology of 'mind'.\"[18]\n \n According to Williams [30] \"today, vitalism is one of the ideas that form the basis for many pseudoscientific health systems that claim that illnesses are caused by a disturbance or imbalance of the body's vital force.\" \"Vitalists claim to be scientific, but in fact they reject the scientific method with its basic postulates of cause and effect and of provability. They often regard subjective experience to be more valid than objective material reality.\"\n \n Stenger[31] states that \"This term is applied in biochemistry to refer to the readily measurable exchanges of energy within organisms, and between organisms and the environment, which occur by normal physical and chemical processes. This is not, however, what the new vitalists have in mind. They imagine the bioenergetic field as a holistic living force that goes beyond reductionist physics and chemistry.\"[32]\n \n Vitalism, or bioenergy, is often explained as being an electromagnetic(EM) field and is supported by the theory of quantum physics. [17] Joanne Stefanatos states that \"The principles of energy medicine originate in quantum physics.\"[33] Victor Stenger [32] offers several explanations as to why this line of reasoning may be misplaced. He explains that energy is recognized as matter and exists in discrete packets called quanta. The quanta of EM fields are known to be photons. Energy fields are composed of their component parts and so only exist when quanta are present. Therefore energy fields are not holistic, but are rather a system of discrete parts that must obey by the laws of physics. This also means that energy fields are not instantaneous. These facts of quantum physics place limitations on the infinite, continuous field that is used by some theorists to describe so-called \"human energy fields\".[34] Stenger continues, explaining that the effects of EM forces have been measured by physicists as accurately as one part in a billion and there is yet to be any evidence that living organisms emit a unique field.[32]\n\n \n [edit] References", 
   {
    "unicode_changes_made": true
   }, 
   274779, 
   null, 
   1185040140.0
  ], 
  [
   274794, 
   null, 
   "Hi_Its_Me", 
   "**\n James, if Vitalism were as dead as a duck, it wouldn't be kicking darwinism's sorry butt up and down the length of this forum, the way it has been doing ever since I got here.\n\n This isn't even funny anymore.\n You ignore everything we post as evidence, post threads consisting of nothing but quoted articles which you think support your case, deny our rebuttals of your claims, and do not even consider what we post as having the slightest chance of being true.\n \n Also note that you have allied yourself with two people who are arguing for something completely different from yourself. Could that mean that you are desperate for support of your position?", 
   {}, 
   274773, 
   null, 
   1185044400.0
  ], 
  [
   274795, 
   null, 
   "wascallywabbit", 
   "**\n \n Posted Wiki entry on vitalism, author unknown from post--\n \n \n\n Opponents of vitalism believe that it is pseudoscience, since its core ideas are metaphysical and impossible to prove or disprove using scientific method.\n\n \n **\n Which is only true if gravity and the other forces are also deemed, \"metaphysical\". More truly metaphysical is the assumption that life, and all of its empirically observable phenomena, is just an epiphenomena of particles interacting chemically,-- just as they do in rocks, gasses, and so on.\n \n \n\n Bechtel and Richardson[7] state that vitalism lacks credibility because it is often viewed as unfalsifiable, and is \"therefore a pernicious metaphysical doctrine.\"\n\n \n **\n Which does not mean that it truly is \"unfalsifiable\", only that some people say that it is, and other people, such as this author, insinuate that it is. That of course depends on whether you are trying to 'falsify' a 'force' such as 'gravity or vitality, or if you are trying to falsify a theory about that theory. You might be able to falsify Newton, but can anyone 'falsify' the fact of Gravity itself? Can anyone falsify the fact of Life itself? These guys are just blowing typical materialist smoke.\n \n \n \n\n While many vitalistic theories have in fact been falsified, notably Mesmerism and the phlogiston theory (see above), the pseudoscientific retention of these falsified theories continues to this day in a fashion that ignores the testability criterion of the scientific method.\n\n \n **\n Says this guy, without substantiating anything.\n \n \n\n For many scientists, \"vitalist\" theories are unsatisfactory \"holding positions\" on the pathway to mechanistic understanding.\n\n \n **\n By \"scientists\", he intends \"mechanists\". Apparently he doesn't know any better than to assume that science equates to materialism/mechanism.\n \n \n\n In 1967, Francis Crick, the co-discoverer of the structure of DNA, stated \"And so to those of you who may be vitalists I would make this prophecy: what everyone believed yesterday, and you believe today, only cranks will believe tomorrow.\"[26]\n\n \n **\n Perfectly true of darwinism, (although Crick has been something of crank himself about a lot of things, including 'directed panspermia' and the now disproven, \"Central Dogma\" [1-way germ-<soma information flow], and all that stuff he wrote about the chemistry of prayer, and whatnot), but not at all the case with modern vitalism.\n \n \n\n Alan Sokal published an analysis of efforts within the field of nursing to describe vitalistic beliefs as \"new science\" (Pseudoscience and Postmodernism: Antagonists or Fellow-Travelers?).[27] Pseudoscientific accounts within the field of nursing of practices such as therapeutic touch were reviewed by Sokal and he concluded, \"nearly all the pseudoscientific systems to be examined in this essay are based philosophically on vitalism\". Sokal also noted that, \"Mainstream science has rejected vitalism since at least the 1930s, for a plethora of good reasons that have only become stronger with time.\"[27]\"\n\n \n **\n This is called 'poisoning the well', and is a sophist debate tactic and a logical fallacy.\n \n \n\n In his book \"Kinds of Minds\", philosopher Daniel Dennett wrote, \"Dualism...and Vitalism (the view that living things contain some special physical but equally mysterious stuff -élan vital- have been relegated to the trash heap of history....\" (Chapter 2).[28]\n\n \n **\n As if Dennett, one of the last remaining materialist/mechanist philosophers, had an objective and unbiased opinion, and could be quoted as an authority.\n \n Fact is, most of this wiki piece relies on the fallacy of argument from biased authority and personal preference.\n \n \n\n Joseph C. Keating, Jr., PhD, [29] discusses vitalism's past and present roles in chiropractic and calls vitalism \"a form of bio-theology.\" He further explains that:\n \n \"Vitalism is that rejected tradition in biology which proposes that life is sustained and explained by an unmeasurable, intelligent force or energy. The supposed effects of vitalism are the manifestations of life itself, which in turn are the basis for inferring the concept in the first place. This circular reasoning offers pseudo-explanation, and may deceive us into believing we have explained some aspect of biology when in fact we have only labeled our ignorance. 'Explaining an unknown (life) with an unknowable (Innate),' suggests philosopher Joseph Donahue, D.C., 'is absurd'.\"[18]\n\n \n **\n As above, garbage argumentation.\n \n \n\n He views vitalism as incompatible with scientific thinking:\n \n \"Chiropractors are not unique in recognizing a tendency and capacity for self-repair and auto-regulation of human physiology. But we surely stick out like a sore thumb among professions which claim to be scientifically based by our unrelenting commitment to vitalism. So long as we propound the 'One cause, one cure' rhetoric of Innate, we should expect to be met by ridicule from the wider health science community. Chiropractors can't have it both ways. Our theories cannot be both dogmatically held vitalistic constructs and be scientific at the same time. The purposiveness, consciousness and rigidity of the Palmers' Innate should be rejected.\"[18]\n\n \n **\n As above. More irrelevent junk. Vitalism is false because chiropractors favour it? Get real.\n \n \n\n He also mentions Skinner's viewpoint:\n\n \n \n **\n Would this be the infamous B.F. Skinner, whose commitment to materialism/mechanism and its behaviourist psychology led him to raise his own daughter by the same 'learning' principles he used on his lab rats, until her suicide at an early age?\n \n \n\n \"Vitalism has many faces and has sprung up in many areas of scientific inquiry. Psychologist B.F. Skinner, for example, pointed out the irrationality of attributing behavior to mental states and traits. Such 'mental way stations,' he argued, amount to excess theoretical baggage which fails to advance cause-and-effect explanations by substituting an unfathomable psychology of 'mind'.\"[18]\n\n \n **\n Yup, it's that very same schmuck.\n \n \n\n According to Williams [30] \"today, vitalism is one of the ideas that form the basis for many pseudoscientific health systems that claim that illnesses are caused by a disturbance or imbalance of the body's vital force.\" \"Vitalists claim to be scientific, but in fact they reject the scientific method with its basic postulates of cause and effect and of provability. They often regard subjective experience to be more valid than objective material reality.\"\n\n \n **\n This long and hysterical attack on vitalism has been accepted by wicki as a valid description of the theory?!? Incredible !!\n \n \n\n Stenger[31] states that \"This term is applied in biochemistry to refer to the readily measurable exchanges of energy within organisms, and between organisms and the environment, which occur by normal physical and chemical processes. This is not, however, what the new vitalists have in mind. They imagine the bioenergetic field as a holistic living force that goes beyond reductionist physics and chemistry.\"[32]\n\n \n **\n Vic Stenger, (another, {like Dennett, above}, board member at Internet Infidels) is a rabid evangelizing atheist crank. Check out his garbage at--\n http://www.infidels.org/library/modern/vic_stenger/\n \n \n\n Vitalism, or bioenergy, is often explained as being an electromagnetic(EM) field and is supported by the theory of quantum physics. [17] Joanne Stefanatos states that \"The principles of energy medicine originate in quantum physics.\"[33]\n\n \n **\n A bit of fact, for a change!!\n \n \n\n Victor Stenger [32] offers several explanations as to why this line of reasoning may be misplaced. He explains that energy is recognized as matter and exists in discrete packets called quanta. The quanta of EM fields are known to be photons. Energy fields are composed of their component parts and so only exist when quanta are present. Therefore energy fields are not holistic, but are rather a system of discrete parts that must obey by the laws of physics. This also means that energy fields are not instantaneous. These facts of quantum physics place limitations on the infinite, continuous field that is used by some theorists to describe so-called \"human energy fields\".[34] Stenger continues, explaining that the effects of EM forces have been measured by physicists as accurately as one part in a billion and there is yet to be any evidence that living organisms emit a unique field.[32] \n\n \n **\n Supposedly to be shot down by Vic Stenger's opinion. This constant argument against vitalism by appeal to bigoted and unproven materialist/mechanist/atheist 'authority' is a disgrace to wikipedia. I've had enough of this garbage, I'm outta here.", 
   {
    "unicode_changes_made": true
   }, 
   274782, 
   null, 
   1185044400.0
  ], 
  [
   274798, 
   null, 
   "chemist99a", 
   "Which is only true if gravity and the other forces are also deemed, \"metaphysical\". More truly metaphysical is the assumption that life, and all of its empirically observable phenomena, is just an epiphenomena of particles interacting chemically,-- just as they do in rocks, gasses, and so on.\n\n \n Not exactly. The formulation is that life is explicable in terms of physics and chemistry. And life so far as anyone can tell is strictly a physico-chemical effect . There is no evidence of any substantiality to the contrary. Thus far the physico-chemical hypothesis has proven robust and of great utility. Be glad to toss the whole thing out if an when you can produce something about life which cannot possibly be explained in physico-chemical contexts.", 
   {}, 
   274795, 
   null, 
   1185045300.0
  ], 
  [
   274830, 
   null, 
   "N.Wells", 
   "WW claims that a new paper by Pfenninger and Schwenk (which demonstrates widespread occurrence of cryptic species) somehow argues against evolution. To no one's surprise (other than WW's), it doesn't. \n \n (Cryptic species are populations that are incapable of successful interbreeding due to genetic or chromosomal differences without being phenotypically different. The concept can be a bit murky, because sometimes the lack of differences turns out to be a matter of insufficiently detailed studies. Sometimes the species look alike and can interbreed a bit when placed together in the lab, but normally live apart. Sometimes the two populations can tell each other apart and won't interbreed, and sometimes not. Moreover, nearly all species show some regional variations when examined closely enough.)\n \n Evolutionary biology has shown that many species begin separation by showing genetic and or phenotypic differences and/or restictions in gene flow between local populations. According to our understanding of speciation, species should show all positions along a gradient from barely different to singificantly different, with all degrees of hybridization from completely interfertile through partially infertile, to totally incapable of fertilization. Differences between species or populations can vary from major effects attributable to single genes to effects (both major and minor) attributable to changes in multiple genes. Thus we are not surprised by sister species that are separated only by differences in genomes that do not happen to have major consequences for their phenotypes (i.e., genetic differences without major phenotypic differences). Indeed, the portion of genetic drift explained by neutral theory suggests that there would be a lot of this sort of thing. \n \n Evolution deniers who ignore anything but \"RM&NS\" would of course completely fail to understand this.\n \n Back when it was easiest to see genetic differences in terms of differences in chromosomes, some sister species were discovered that looked identical but which had distinctly different chromosomal arrangements (as seen either in Giemsa banding studies or in chromosome numbers and shapes). Now that geneticists can read whole genomes quickly, it is not the greatest of surprises that they are now discovering some sister species where differences in genes (rather than chromosomes) far outweigh differences in morphology.\n \n Cryptic species (species that the experts cannot tell apart on the basis of their morphology alone) are not uncommon. These closely related species are usually allopatric (physically isolated from each other), which is fine with evolutionary theory. Nothing says that physically separated populations must immediately experience different conditions or quickly adapt differently from one another. \n \n Sympatric cryptic species (morphologically identical but incapable of successful interbreeding) that remain in contact with each other and which are confused into frequent but unsuccessful matings should very quickly (a few hundred generations) evolve ways to tell each other apart. We would expect a few of these, because any slice of time should present at least a few species in early stages of evolutionary divergence. However, if we found a lot of sympatric cryptic species then perhaps we might be wrong in our theoretical understanding (either in expecting quick separation, or that this sort of separation arises a lot more than we think it does, or that we are even more fundamentally wrong).\n \n Pffeninger and Schwenk found 2207 instances of cryptic species out of 771931 cases that were appropriate to finding such species. The instances were nearly equal in all major metazoan taxonomic groups and in all biomes. This alone is, if anything, expected. However, they didn't address whether these cryptic species were allopatrical or sympatrical.\n \n In a study of sympatric versus allopatric origination of cryptic species in bonefish (genus Albula) Colborn et al. (April 2001, Evolution, 55(4):807-820) concluded, \"Despite multiple cases of sympatry, sister-taxa relationships inferred from mtDNA indicate that divergence in allopatry has been the predominant speciation mechanism in Albula.\"\n \n This is unlikely to be the last word on this subject - many more of these sorts of studies should be forthcoming in the next decade or so.", 
   {}, 
   274798, 
   null, 
   1185065040.0
  ], 
  [
   274833, 
   null, 
   "wascallywabbit", 
   "[quote]\nThis isn't even funny anymore.\n You ignore everything we post as evidence, \n\n \n **\n \"Evidence\"? What a joke!! This just shows that you cannot distinguish scientific evidence from corn on the cob, him!!\n I invite everyone to read that link so that they can see this for themselves.\n \n \n\n post threads consisting of nothing but quoted articles which you think support your case, \n\n \n **\n \n The above link is flawed, and yields \"No matches\". IAC, the fact of the matter is not \"think\", not 'believe', but 'know for a fact'. They support my case, be it anti-darwinism or pro-EAM, or both, because the facts presented, [although not necessarily the darwinist misinterpretations of those facts], are always self-evidently anti-darwinian, or pro-EAM, or both.\n \n \n\n deny our rebuttals of your claims,\n\n \n **\n Of course I deny them!! They are so pathetically childish that no intelligent and reasonable adult would ever grant that they \"rebut\" anything at all!! Get over yourselves! Any rational, reasonable, intelligent and unbiased adult is strongly urged, by me, to go to that link and see for themselves just how ridiculously preposterous him's claim to \"rebuttal\" truly is!\n \n \n\n and do not even consider what we post as having the slightest chance of being true.\n\n \n **\n That's just you projecting your bigotry onto me.\n \n \n\n Also note that you have allied yourself with two people who are arguing for something completely different from yourself. Could that mean that you are desperate for support of your position?\n\n \n **\n Since this is as vague as a puff of smoke, I have no idea what you think you are talking about?!? I ally myself with facts, and with compatible inferences rationally derived from those facts, [if and when they occur]--nothing else.", 
   {}, 
   274794, 
   null, 
   1185066000.0
  ], 
  [
   274834, 
   null, 
   "wascallywabbit", 
   "WW claims that a new paper by Pfenninger and Schwenk (which demonstrates widespread occurrence of cryptic species) somehow argues against evolution. To no one's surprise (other than WW's), it doesn't. \n\n \n **\n Yawn. \n \n \n\n (Cryptic species are populations that are incapable of successful interbreeding due to genetic or chromosomal differences without being phenotypically different. The concept can be a bit murky, because sometimes the lack of differences turns out to be a matter of insufficiently detailed studies. Sometimes the species look alike and can interbreed a bit when placed together in the lab, but normally live apart. Sometimes the two populations can tell each other apart and won't interbreed, and sometimes not. Moreover, nearly all species show some regional variations when examined closely enough.)\n\n \n **\n \"Murky\" scarce covers the ground in this case. But here is the point--the paper shows two different genotypes, one shared phenotype, as a fairly common state of affairs. As an example, fish that regular comes into our rivers to spawn each spring is known by the acadian word, gaspareaux. There is no way, outwardly, for anyone, no matter how expert, to discover that gaspereaux are not one distinct species of herring, but two. The alewife and the blueback herring. Only close internal examination yields any phenotypic difference at all, and then only to a trained biologist. Genomes are quite distinct, all the same.\n \n This means that trying to shift 'evolution' from organisms to genomes, as darwinists have done since Fisher et al, claiming that their genomic evolution equates to everybody else's organismic evolution, is, in a word, horsepucky.\n \n \n\n Evolutionary biology has shown that many species begin separation by showing genetic and or phenotypic differences and/or restictions in gene flow between local populations.\n\n \n **\n No, it [genetics, to use the proper expression] has not. Field biology has shown, to the contrary, that organisms begin to differ from one another in the environments they inhabit, first, behaviour next, then morphology, and finally taxonomic classification. Unless some geneticist discovers, as with the gaspereau, that nothing non-trivial is distinctly different between two populations-- except their genetic makeup,-- and insists upon classifying them as two or more distinct species, taxonomically, on that basis alone.\n \n \n\n According to our understanding of speciation, species should show all positions along a gradient from barely different to singificantly different, with all degrees of hybridization from completely interfertile through partially infertile, to totally incapable of fertilization.\n\n \n **\n Meaning that, for darwinism, the only true distinction between species is total genetic incapacity for viable hybridization. Which may be problematic wrt gaspareaux, who seem to breed together, i.e., two species, same place, same time, through scattered eggs and sperm. I do not know any further particulars on this, but I haveto wonder. At any rate, by this genomic determination of taxonomic distinction, dogs, coyotes, and timber wolves are all one species, while gaspareau, apparently, are not. Very confusing, murky stuff, speciation. You end by wondering if the wored, 'species', means anything at all.\n \n More later, maybe.", 
   {}, 
   274830, 
   null, 
   1185069060.0
  ], 
  [
   274846, 
   null, 
   "wascallywabbit", 
   "**\n \n\n Differences between species or populations can vary from major effects attributable to single genes to effects (both major and minor) attributable to changes in multiple genes. Thus we are not surprised by sister species that are separated only by differences in genomes that do not happen to have major consequences for their phenotypes (i.e., genetic differences without major phenotypic differences). Indeed, the portion of genetic drift explained by neutral theory suggests that there would be a lot of this sort of thing. \n\n \n **\n Anybody else notice how all this smoke is starting to distort all those mirrors?\n Rationalization piled on rationalization piled on rationalization. That is,-- yadayadayadayadayadayadayada--but its all random genetic mutation to me.\n \n \n\n Evolution deniers who ignore anything but \"RM&NS\" would of course completely fail to understand this.\n\n \n **\n True, my yadayadayada is getting a little rusty.\n \n \n\n Back when it was easiest to see genetic differences in terms of differences in chromosomes, some sister species were discovered that looked identical but which had distinctly different chromosomal arrangements (as seen either in Giemsa banding studies or in chromosome numbers and shapes). Now that geneticists can read whole genomes quickly, it is not the greatest of surprises that they are now discovering some sister species where differences in genes (rather than chromosomes) far outweigh differences in morphology.\n\n \n **\n Gee, I'm for sure not surprised. One thing that for sure does not surprise me is hearing a darwinist rationalise one more piece of science that sucks all the wind out of darwinian, 'evolution is a matter of randomly fluctuating particles, i.e., genes,-- not evolving and adapting organisms'.\n \n \n\n Cryptic species (species that the experts cannot tell apart on the basis of their morphology alone) are not uncommon. These closely related species are usually allopatric (physically isolated from each other), which is fine with evolutionary theory. Nothing says that physically separated populations must immediately experience different conditions or quickly adapt differently from one another. \n\n \n **\n Nothing in thy philosophy, horatio. To the contrary, in fact. Your 'theory' says they have to spend several generations standing around, twiddling whatever they have in place of thumbs, waiting for a lucky mutation to spontaneously generate itself for them.\n \n \n\n Sympatric cryptic species (morphologically identical but incapable of successful interbreeding) that remain in contact with each other and which are confused into frequent but unsuccessful matings should very quickly (a few hundred generations) evolve ways to tell each other apart.\n\n \n **\n It won't happen quickly if, as you claim, it can only happen by genetic accident,-- and not, as I say, by an organismic, systematic, response to a chronic impediment to their goal of self-reproduction.\n \n \n\n We would expect a few of these, because any slice of time should present at least a few species in early stages of evolutionary divergence.\n\n \n **\n \"Should\"? Is this a variation on the famous darwinian law/magic of great big numbers?\n \n \n\n However, if we found a lot of sympatric cryptic species then perhaps we might be wrong in our theoretical understanding (either in expecting quick separation, or that this sort of separation arises a lot more than we think it does, or that we are even more fundamentally wrong).\n\n \n **\n No chance. I feel that, on the basis of the fundamental regularity of darwinian theoretical response to contradictory empirical observation, in the past, that I can safely predict that you will immediately take every step to rationalise the problem, and assiumilate, in Borg-fashion, the contradiction into your all-embracing, impossible to contradict, metaphysical speculation.\n \n \n\n Pffeninger and Schwenk found 2207 instances of cryptic species out of 771931 cases that were appropriate to finding such species. The instances were nearly equal in all major metazoan taxonomic groups and in all biomes. This alone is, if anything, expected.\n\n \n **\n Not by darwinism, it's not. Your hand-waving notwithstanding. Bluster away, big guy. Your bluff is called.\n \n \n \n\n However, they didn't address whether these cryptic species were allopatrical or sympatrical.\n \n In a study of sympatric versus allopatric origination of cryptic species in bonefish (genus Albula) Colborn et al. (April 2001, Evolution, 55(4):807-820) concluded, \"Despite multiple cases of sympatry, sister-taxa relationships inferred from mtDNA indicate that divergence in allopatry has been the predominant speciation mechanism in Albula.\"\n\n \n \n **\n What's your point?\n \n \n\n This is unlikely to be the last word on this subject - many more of these sorts of studies should be forthcoming in the next decade or so.\n\n \n **\n Not if they threaten darwinism, they won't. But what am I saying?!?! Nothing can threaten darwinism,--it would be like threatening to nail jello to the wall. Duh, what was I thinking?!?", 
   {}, 
   274834, 
   null, 
   1185075180.0
  ], 
  [
   274847, 
   null, 
   "Kronus", 
   "So once again we get the standard WW response to a well thought out response. \"nuh-uh! *fingers in ears*\" No facts, no data, not even any arguments. Just, \"you're wrong cause I don't want you to be right\". Sigh.", 
   {}, 
   274846, 
   null, 
   1185078240.0
  ], 
  [
   274850, 
   null, 
   "chemist99a", 
   "So once again we get the standard WW response to a well thought out response. \"nuh-uh! *fingers in ears*\" No facts, no data, not even any arguments. Just, \"you're wrong cause I don't want you to be right\". Sigh.\n\n \n Good summary WW either does not understand basic biology or else pretends to ignorance. He is right any critic wrong. Evidence, observation, history not withstanding.", 
   {}, 
   274847, 
   null, 
   1185082620.0
  ], 
  [
   274855, 
   null, 
   "Hi_Its_Me", 
   "**\n \"Evidence\"? What a joke!! This just shows that you cannot distinguish scientific evidence from corn on the cob, him!!\n I invite everyone to read that link so that they can see this for themselves.\n\n Oh, yes. Thanks for reminding me. I forgot to add that you always assume that \"intelligent\" people will agree with you. You do so despite the large number of people with degrees who disagree with you.\n Out of curiosity, how many people do you know who do agree with you?\n \n Regarding your statement: while it is true that the post in question was an argument more than evidence, it revolved around a piece of evidence which you did dismiss.\n I suppose I should have said that you ignore our arguments, because then I would have had many more obvious options to choose from.\n \n**\n The above link is flawed, and yields \"No matches\".\n\n For the record: the link was supposed to lead to a search for all threads started by WW. Also note that his opening post for almost every one of those threads consists of either a quoted article or a link to the same.\n \nIAC, the fact of the matter is not \"think\", not 'believe', but 'know for a fact'. They support my case, be it anti-darwinism or pro-EAM, or both, because the facts presented, [although not necessarily the darwinist misinterpretations of those facts], are always self-evidently anti-darwinian, or pro-EAM, or both.\n\n Again, you need to recognize that your interpretation of the data is not always self-evident to others or even correct. As far as I'm concerned, you are simply seeing what you want to see and nothing more.\n \n**\n Of course I deny them!! They are so pathetically childish that no intelligent and reasonable adult would ever grant that they \"rebut\" anything at all!!\n\n Please, stop referring to \"intelligent\" people who would by definition agree with you. Consider that you may not be able to judge the facts as well as you think and that there is a distinct possibility that you may be wrong.\n \n For the record: I do this, and I am willing to admit it when I am losing a debate. As far as I know, WW is unwilling to admit to ever losing a debate (at least on the subject of the ToE and EAM).\n \nGet over yourselves! Any rational, reasonable, intelligent and unbiased adult is strongly urged, by me, to go to that link and see for themselves just how ridiculously preposterous him's claim to \"rebuttal\" truly is!\n\n I believe that I made a valid point about quotes indicating the use of a metaphor. You completely ignored my post.\n \n I, too, am willing to have that post judged, and I, too, believe that my position will be upheld. I am even willing to say this in your terms: Any rational, reasonable, intelligent and unbiased adult is strongly urged, by me, to go to that link and see for themselves that my post contains a strong rebuttal of WW's argument.\n My point here is that both sides of the debate can say that they are right but that saying you are right is nowhere near enough. Similarly, saying that you win every debate against us is also useless.\n \n**\n That's just you projecting your bigotry onto me.\n\n Remember: I am willing to back down on a debate (though it often takes time before I do so). You, on the other hand, deny that even one of your threads was anything but supportive of EAM.\n \n**\n Since this is as vague as a puff of smoke, I have no idea what you think you are talking about?!? I ally myself with facts, and with compatible inferences rationally derived from those facts, [if and when they occur]--nothing else.\n\n And yet you support the statements of SS and AA on a regular basis, just as they support yours.\n \n \n Now: please consider what I have said, and try to improve your debating style rather than simply dismissing this as nonsense.", 
   {}, 
   274847, 
   null, 
   1185084420.0
  ], 
  [
   274856, 
   null, 
   "chemist99a", 
   "Not if they threaten darwinism, they won't. But what am I saying?!?! Nothing can threaten darwinism,--it would be like threatening to nail jello to the wall. Duh, what was I thinking?!?\n Reply With Quote\n\n \n Many things could falsify NDS, however none of them have yet been observed. You on the other hand are no threat at all given your transparent faulty logic.", 
   {}, 
   274855, 
   null, 
   1185086040.0
  ], 
  [
   274857, 
   null, 
   "N.Wells", 
   "What's your point?\n\n One careful study of a large but phenotypically uniform group showed within it quite a few instances of cryptic speciation, which consisted of a few instances of sympatric speciation, but many more instances of allopatric speciation, as an evolutionary biologist would expect. Although not a final statement, it indicates that you are, yet once again, spouting nonsense. \n \n \n(From me) Evolutionary biology has shown that many species begin separation by showing genetic and or phenotypic differences and/or restictions in gene flow between local populations. \n\n (From WW) No, it [genetics, to use the proper expression] has not. Field biology has shown, to the contrary, that organisms begin to differ from one another in the environments they inhabit, first, behaviour next, then morphology, and finally taxonomic classification. Unless some geneticist discovers, as with the gaspereau, that nothing non-trivial is distinctly different between two populations-- except their genetic makeup,-- and insists upon classifying them as two or more distinct species, taxonomically, on that basis alone.\n\n Since your last exception (the unless sentence) is exactly what I was talking about and what I had just described in terms of an ideal cryptic species (with the addition that the two species should not be capable of successfully interbreeding), why are you disagreeing with me only to turn around and make the same point as me? Your gaspereau (and thanks for bringing it to my attention) sounds like a good example of a speciation where genetic change is ahead of phenotypic change, instead of the other way around.\n \n (And before you criticize my use of \"evolutionary biology\", which is correct, you might consider your own mangled usage of \"genetics\" and \"field biology\".) \n \n Also, studies have shown that this varies. Often geographic separation takes the lead, but sometimes it's morphology, sometimes behavior (especially courtship behavior), and sometimes even genetics.\n \n \n \n Your 'theory' says they have to spend several generations standing around, twiddling whatever they have in place of thumbs, waiting for a lucky mutation to spontaneously generate itself for them. \n No, it doesn't. To cite just one counter-example, as the first paper you cited shows, the variation is more often than not already there, available to be tapped into. You can't even keep your arguments consistent, let alone correct. Don't you get tired of parading your lack of understanding of evolutionary biology?\n \n \nVery confusing, murky stuff, speciation. You end by wondering if the wored, 'species', means anything at all.\n\n If modern evolutionary understanding of speciation is correct, then at least some species are required to show incomplete separation, because they will be partway along the journey to speciation.\n \n Some processes of speciation (for example polyploidy in plants) will cause speciation events that are to all intents instantaneous, occuring in one individual and between one generation and the next. Build up of differences due to mutations, recombination, selection, and/or drift in allopatric populations could be extremely slow and gradual, and could even go partway to speciation and return to one fully interbreeding population, so we should see a lot of those in intermediate conditions of separation. So far, Pfenning and Schwenk's findings fit comfortably within expected evolutionary outcomes, so you are (yet once again) wrong, WW. Bad habit, that. Makes you look a fool.\n \n If numerous patterns of partial speciation aren't seen, it would require going back to the drawing board. In this particular area, a wide range of possible outcomes would not falsify the ToE. However, possible falsifications of the ToE are much easier to come by in other areas, so you are wrong that it is not falsifiable - it is simply a matter of picking appropriate tests. For example, physicists did not look to planetary orbits to help choose between newtonian and einsteinian explanations of gravity.\n \n Find me an unquestionable Cambrian rabbit, WW, or a similarly genuine Precambrian hominid, and I will conclude that either the physicists are wrong about time travel, or the biologists are wrong about evolution.\n \n In the meantime, what if anything would you take as evidence against EAM?", 
   {}, 
   274856, 
   null, 
   1185092280.0
  ], 
  [
   274859, 
   null, 
   "Symbiote", 
   "I can't even read his posts anymore, I'm not sure if quoting huge slabs of text and responding with some \"witty\" remark like \"you're wrong I'm right lol\" is a genuine attempt at argument or just an excercise in time-wasting.\n \n I believe good posting in general uses a minimum of quotes, I generally attempt myself to quote only when a direct reference is necessary and instead respond to the general points made in a post, rather than fragments of them... but this 10+ quotes in a post is really, really unreadable.", 
   {}, 
   274857, 
   null, 
   1185093780.0
  ], 
  [
   274887, 
   null, 
   "wascallywabbit", 
   "\n One careful study of a large but phenotypically uniform group showed within it quite a few instances of cryptic speciation, which consisted of a few instances of sympatric speciation, but many more instances of allopatric speciation, as an evolutionary biologist would expect. \n\n \n **\n Whether or not \"an evolutionary biologist\" might expect instances of cryptic sympatric speciation is not the issue. The issue is that no darwinist should,--not if he stuck to his darwinian principles. In fact, the entire issue of sympatric speciation, (not just the cryptic form), is antithetical to RM+NS, forcing darwinists to feverishly attempt to to reconcile/rationalise the empirical fact of its existence with its theoretical impossibility, [according to their 'theory'], over all the decades since Fisherian darwinists first began their, \"Modern Synthesis\".\n \n Allopatric speciation they can rationalise in terms of different places representing different \"NS\" operating upon geographically separated, hence physically distinct, 'populations'. N.B.--always rember that darwinian particulate/genomic evolution is ALWAYS a matter of 'populations, NOT 'organisms'. Hence both their \"RM\" and their \"NS\" apply to separate, distinct 'populations', supposedly undergoing immediate and particular \"RM\", aka, \"Genetic Drift\", followed by immediate and particular, \"NS\". BUT--there is no room in that theory for evolution that transpires when one single population, in exactly the same ecosystem, with exactly the same \"RM\"(\"Drift\") and, more importantly, the same \"NS\", for all members, diverges/speciates, 'sympatrically'.\n When this contradiction of darwinist theory in actual populations was first brought to the fore [60's] by Kimura, as 'neutral' theory, [i.e., random genetic mutation [drift] without any \"NS\" involved], it took a while for darwinists to assimilate it back into their theory. But, just as they had done before and would do again, with altruism, symbiosis, punk eek, and on and on, they eventually blew enough smoke and arranged a sufficient number of monkey-house mirrors to make it look like they were actually talking science, instead of cr-p. See-- http://home.planet.nl/~gkorthof/kortho37.htm , in order to understand exactly how they pulled this off.\n \n The central point is still inescapable--there is no 1-<1 mapping, \n genome-<organism, as darwinism, aka, 'genetic determinism', aka, \"The Modern Synthesis\", aka, 'particulate/genomic evolution', requires. And the fact of 'cryptic' sympatric speciation simply reinforces that fact.\n \n \n\n Although not a final statement, it indicates that you are, yet once again, spouting nonsense. \n\n \n **\n The truth is, that you are the one talking nonsense, trying to 'blind them with science', i.e., 'baffle them with bullsh-t', and when you get called on it, you, as always, accuse your detractors, usually me, of doing what in truth it is you that are doing it, not them/me.\n \n \n\n Quote:\n Quote:\n (From me) Evolutionary biology has shown that many species begin separation by showing genetic and or phenotypic differences and/or restictions in gene flow between local populations. \n \n (From WW) No, it [genetics, to use the proper expression] has not. Field biology has shown, to the contrary, that organisms begin to differ from one another in the environments they inhabit, first, behaviour next, then morphology, and finally taxonomic classification. Unless some geneticist discovers, as with the gaspereau, that nothing non-trivial is distinctly different between two populations-- except their genetic makeup,-- and insists upon classifying them as two or more distinct species, taxonomically, on that basis alone. \n \n Since your last exception (the unless sentence) is exactly what I was talking about and what I had just described in terms of an ideal cryptic species (with the addition that the two species should not be capable of successfully interbreeding), why are you disagreeing with me only to turn around and make the same point as me?\n\n \n **\n My point is, and has been since the OP, the fact that genomic 'speciation' does not 'map' 1-<1 with organismic mutation, as RM+NS darwinist 'particulate evolution' requires. Simply describing the fact of cryptic speciation, especially [but not exclusively, 'cryptic sympatric speciation'], as you did, in no way actually reconciles it with your \"theory\", as you pretend that it does. That is my point. And it is very different from yours.\n \n \n\n Your gaspereau (and thanks for bringing it to my attention) sounds like a good example of a speciation where genetic change is ahead of phenotypic change, instead of the other way around.\n\n \n **\n That's one possibility. Another is that, given identical niches, two distinct species, genetically speaking, have closed together, (i.e., evolved )phenotypically/organismically, morphologically/behaviourally speaking, while their genomes have remained distinct, (i.e., did not evolve), over many thousands of generations. That is, that it is also possible that phenotypic change is ahead of genotypic change.\n \n \n\n (And before you criticize my use of \"evolutionary biology\", which is correct, you might consider your own mangled usage of \"genetics\" and \"field biology\".)\n\n \n **\n Same right back atcha.\n \n \n\n Also, studies have shown that this varies. Often geographic separation takes the lead, but sometimes it's morphology, sometimes behavior (especially courtship behavior), and sometimes even genetics.\n\n \n **\n Which leaves your \"RM+NS\" theory, where, exactly ?!?\n \n \n \n\n Quote:\n Your 'theory' says they have to spend several generations standing around, twiddling whatever they have in place of thumbs, waiting for a lucky mutation to spontaneously generate itself for them. \n \n No, it doesn't. To cite just one counter-example, as the first paper you cited shows, the variation is more often than not already there, available to be tapped into.\n\n \n **\n Where in that paper is this \"shown\", as opposed to \"supposed\" or \"assumed\"?\n When you are making a claim, back it up with a citation. If you can.\n \n \n\n You can't even keep your arguments consistent, let alone correct.\n\n \n **\n Sez you, without any evidence.\n \n [quoting]\n Don't you get tired of parading your lack of understanding of evolutionary biology?[/quote]\n \n **\n Meaning, do I never tire of poking darwinist ideologues, such as yourself, with the sharp stick of empirical science? Well, uh, no, I don't, as a matter of fact.l\n \n \n Quote:\n Very confusing, murky stuff, speciation. You end by wondering if the wored, 'species', means anything at all. \n \n \n\n If modern evolutionary understanding of speciation is correct, then at least some species are required to show incomplete separation, because they will be partway along the journey to speciation.\n \n Some processes of speciation (for example polyploidy in plants) will cause speciation events that are to all intents instantaneous, occuring in one individual and between one generation and the next. Build up of differences due to mutations, recombination, selection, and/or drift in allopatric populations could be extremely slow and gradual, and could even go partway to speciation and return to one fully interbreeding population, so we should see a lot of those in intermediate conditions of separation. So far, Pfenning and Schwenk's findings fit comfortably within expected evolutionary outcomes, so you are (yet once again) wrong, WW. Bad habit, that. Makes you look a fool.\n\n \n **\n How is it that your 'theory' \"accounts\" for everything and anything seen in nature, supposed to make me, rather than you and your fellow ideologues, look like a fool?\n \n \n\n If numerous patterns of partial speciation aren't seen, it would require going back to the drawing board. In this particular area, a wide range of possible outcomes would not falsify the ToE. However, possible falsifications of the ToE are much easier to come by in other areas, so you are wrong that it is not falsifiable - it is simply a matter of picking appropriate tests. For example, physicists did not look to planetary orbits to help choose between newtonian and einsteinian explanations of gravity.\n\n \n **\n First law of darwinism--The \"ToE\" must always be said to be falsifiable, but must never be falsified. And god knows what the aside on gravity has to do with anything.\n \n \n\n Find me an unquestionable Cambrian rabbit,\n\n \n **\n More stupidity. The infamous \"Cambrian rabbit\" is supposed to show that evolution itself is an historical fact; that is, that their actually is an unfolding, evolving, directional process of biological change over time. This simplistic argument, whatever its rational merits, is fair ball wrt creationists, those who deny evolution as described above. It has absolutely no pertinence wrt to myself and others who fully accept the fact of evolution, as described, but deny the darwinist ideology that pretends to explain that factual historical process. When are you going to wake up and catch on to with whom you are dealing?!?\n \n \n\n In the meantime, what if anything would you take as evidence against EAM?\n\n \n **\n Empirical observation of a pre-existing genetic variation that must, deterministically, lead linearly to a specific phenotypic expression of a trait that would be adaptive given a certain environmental event, an event that is theoretically very possible but as yet never actually experienced by that species of genotype.", 
   {}, 
   274859, 
   null, 
   1185118140.0
  ], 
  [
   274898, 
   null, 
   "N.Wells", 
   "Whether or not \"an evolutionary biologist\" might expect instances of cryptic sympatric speciation is not the issue. The issue is that no darwinist should,--not if he stuck to his darwinian principles.\n\n And there is a strawman. 1) Biologists aren't 'strict darwinians' (and haven't been for a century*), and 2) Darwin's principles' don't address gene flow issues, since he didn't know about genes. I agree that sympatric speciation has been controversial as to whether it is a significant mode of speciation, but the potential has long been recognized (polyploidy does not require allopatry, and neither would massive translocations).\n \n (*However, strictly Darwinian explanations, i.e., natural selection, may be all that's needed to explain certain evolutionary changes. Darwin was not so much wrong as superceded.)\n \n \n How is it that your 'theory' \"accounts\" for everything and anything seen in nature\n It doesn't. You are grossly exaggerating.\n \n \nMore stupidity. The infamous \"Cambrian rabbit\" is supposed to show that evolution itself is an historical fact; that is, that their actually is an unfolding, evolving, directional process of biological change over time. This simplistic argument, whatever its rational merits, is fair ball wrt creationists, those who deny evolution as described above. It has absolutely no pertinence wrt to myself and others who fully accept the fact of evolution, as described, but deny the darwinist ideology that pretends to explain that factual historical process. When are you going to wake up and catch on to with whom you are dealing?!?\n\n That was not directed at EAM. It was an example of something that would tell me that we were seriously wrong in our understanding of evolution, with respect to both history and process. Evolutionary processes do not seem capable of accounting for such an outcome.\n \n \nMy point is, and has been since the OP, the fact that genomic 'speciation' does not 'map' 1-<1 with organismic mutation\n\n If you'd come up for air once in a while, you'd note that I'm agreeing with you on that (except that you, being you, have to twist my statements into something that you can disagree with). My disgreement with you is that this is not required by evolutionary biology (which is also not reducible to RM&NS). I don't recall a single biology or paleontology course where I was was taught that mutations must map one-to-one with phenotypic change. Individual traits certainly can be controlled by sinlge mutations: we were shown many examples, and those are inevitably the ones one studies in labs in low-level genetics courses, but my genetics textbook from 1973 goes on at some length about gene interactions, traits controlled by multiple genes, models for infinitesimally small changes controlled by an infinity of genes, and so on. If we are so against such a concept, how come I was taught about it? I have no problem with phenotypic change being ahead of genotypic change, or behind it (in the sense of a lot of phenotypic change caused by very minor genetic differences on the one hand, and considerable genetic changes that have not as yet caused much significant phenotypic change).", 
   {}, 
   274887, 
   null, 
   1185128760.0
  ], 
  [
   274916, 
   null, 
   "wascallywabbit", 
   "And there is a strawman. 1) Biologists aren't 'strict darwinians' (and haven't been for a century*), and 2) Darwin's principles' don't address gene flow issues, since he didn't know about genes. \n\n \n **\n After all these years, you should know that in the context of this debate, 'darwinist' and 'darwinian' apply to the notion, and its adherents, that biological evolution is driven ateleologically, by chance and physical mechanics, as represented by either or both of a/random, accidental genetic change of any kind,(RM) b/fortuitous trait inheritance enabling an extended survival differential to some organisms, (relative to others of the same genotype), in the same local population, at approximately the same time, and under approximately the same circumstances (NS). There are a dozen labels for this hypothetical evolutionary mechanism, but darwinism is the shortest, most direct, and has stood up to the test of time for 150 years. \n \n \n\n It doesn't. You are grossly exaggerating.\n\n \n **\n No, I am not. It \"accounts\" for ruthless competition, and it \"accounts\" for co-operation, including symbiosis and altruism. It \"accounts\" for uniformitarian gradualism, and it \"accounts\" for punctuated equilibrium. It will \"account\" for saltationism just as soon as it is forced to do so. It \"accounts\" for teleological adaptation, and it \"accounts\" for ateleological random change. It \"accounts\" for one organism that supposedly survives because it is big, while it \"accounts\" for another that supposedly survives because it is little little, and so on. It \"accounts\" for birds that can fly, and for birds that cannot fly, for animals that are fast, and for animals that are slow, and on and on and on. It has, (because that is all that it is), a \"just so story\" to reconcile every possible irreconcilable difference in the biosphere. And every time we talk of any single trait, biological or psychological, darwinism comes up with a randomly generated 'gene', (as it supposes),to \"account\" for it.\n \n The fact is that darwinism has no integrity, and that when you cut through all the posing, all the arcane gibberish, it has not one single thing to say about biological evolution except this--\"It just happens, that's all!\"\n \n \n\n That was not directed at EAM. It was an example of something that would tell me that we were seriously wrong in our understanding of evolution, with respect to both history and process. Evolutionary processes do not seem capable of accounting for such an outcome.\n\n \n **\n It [the cambrian rabbit argument] is still entirely impertinent and inappropriate in any post directed at me and my ideas on evolution. And since that was the case, how can you now claim that it \"was not directed at EAM\"? \n \n \n\n My disgreement with you is that this is not required by evolutionary biology (which is also not reducible to RM&NS).\n\n \n **\n Must I constantly remind you that 'evolutionary biology' is not \"reducible to RMNS\", and that I have never said that it is?!? I only say that darwinism, by whatever euphemism you prefer to label it, IS REDUCIBLE to \"RMNS\", in any 'style' you wish to cloak these 'principles' withal.\n \"EAM\" is 'theoretical evolutionary biology', for pete's sake.\n \n \n\n I don't recall a single biology or paleontology course where I was was taught that mutations must map one-to-one with phenotypic change.\n\n \n **\n How soon we forget, eh, senator? The fact is that without linear genetic determinism, direct and exact gene-<trait mapping, you darwinists have nothing at all; and that is precisely what this very thread is all about.\n \n If you truly have forgotten the necessity of genetic determinism to your theory, just ask chemmy and friends--they'll remind you.\n \n \n\n Individual traits certainly can be controlled by sinlge mutations: we were shown many examples, and those are inevitably the ones one studies in labs in low-level genetics courses, but my genetics textbook from 1973 goes on at some length about gene interactions, traits controlled by multiple genes, models for infinitesimally small changes controlled by an infinity of genes, and so on.\n\n \n **\n So why is it then, that whenever your RMNS notion is questioned you guys resurrect Luria and Delbruck 1943, and/or, Lederberg and Lederberg 1958?\n Despite the fact that microbiology has moved its understanding of bacteria light years beyond the simplistic notions that prompted their assumptions/conclusions?\n \n \n\n I have no problem with phenotypic change being ahead of genotypic change,\n\n \n **\n If so, then you have trouble with the fundamental principles of darwinism, just as I do.\n \n \n\n or behind it (in the sense of a lot of phenotypic change caused by very minor genetic differences on the one hand, and considerable genetic changes that have not as yet caused much significant phenotypic change).\n\n \n **\n And we have now returned to our regularly programmed yadayadayadayada.", 
   {}, 
   274898, 
   null, 
   1185141120.0
  ], 
  [
   274943, 
   null, 
   "chemist99a", 
   "Whether or not \"an evolutionary biologist\" might expect instances of cryptic sympatric speciation is not the issue. The issue is that no darwinist should,--not if he stuck to his darwinian principles. In fact, the entire issue of sympatric speciation, (not just the cryptic form), is antithetical to RM+NS, forcing darwinists to feverishly attempt to to reconcile/rationalise the empirical fact of its existence with its theoretical impossibility, [according to their 'theory'], over all the decades since Fisherian darwinists first began their, \"Modern Synthesis\".\n\n \n Sorry but thats only your imaginary Darwinians. NDS is NOT strict Darwinism and indeed it cannot be. And sympatric speciation is NOT excluded by NDS at all. If you want to argue against an imaginary TOE then you certainly are free to do so, but frankly there is no point in doing sol", 
   {}, 
   274916, 
   null, 
   1185147240.0
  ], 
  [
   274944, 
   null, 
   "chemist99a", 
   "How is it that your 'theory' \"accounts\" for everything and anything seen in nature\nIt doesn't. You are grossly exaggerating.\n\n Of course it does not. Consider that biochemistry is not accounted for by evolutionary theory, and that most certainly neutron stars are not involved in TOE! In addition its possible that NDS can be falsified under quite a number of conditions. For example should the genetic code as such be different for different species! The theory is hardly invulnerable else it would not be scientific in nature.", 
   {}, 
   274943, 
   null, 
   1185147480.0
  ], 
  [
   274946, 
   null, 
   "chemist99a", 
   "The central point is still inescapable--there is no 1-<1 mapping,\n genome-<organism, as darwinism, aka, 'genetic determinism', aka, \"The Modern Synthesis\", aka, 'particulate/genomic evolution', requires. And the fact of 'cryptic' sympatric speciation simply reinforces that fact.\n \n\n \n Except of course that no 1-<1 mapping is requried, only some form of mapping. 1-<1 works, 1-<many works, many-< 1 works, and many-<many works also. NDS does not require any particular mapping of gene to trait.", 
   {}, 
   274943, 
   null, 
   1185148020.0
  ], 
  [
   274953, 
   null, 
   "N.Wells", 
   "WW, you asked \"How is it that your 'theory' 'accounts' for everything and anything seen in nature?\" I said that it doesn't and that you are exaggerating. You came back with a long list, but which (as Chemist pointed out) falls far short of everything and anything in nature. Hurricanes, granites, nitrogen, continental drift, gravity, Boyle's gas law, brownian motion, radioactivity, the origin of life and a near-infinity of other things fall outside the ToE, while being inside \"nature\". Since there is a big difference between \"a lot of things in biology\" and \"everything and anything seen in nature\", you are exaggerating.\n \n This would be no great problem, except that 1) you always insist that you are being precise in meaning while no one else ever is, 2) you proceeded flatly to deny that you had exaggerated, and 3) this therefore becomes yet another instance of your meaning being totally elastic and your words lacking integrity. \n \n \n \nMust I constantly remind you that 'evolutionary biology' is not \"reducible to RMNS\", and that I have never said that it is?!? I only say that darwinism, by whatever euphemism you prefer to label it, IS REDUCIBLE to \"RMNS\", in any 'style' you wish to cloak these 'principles' withal.\n \"EAM\" is 'theoretical evolutionary biology', for pete's sake.\n\n You need to choose between your arguments, because they are not consistent. You cannot refer to standard evolutionary biologists as \"GDists like you\" and \"you darwinists\", and then claim that darwinism is solely RM&NS. The modern ToE (what I meant to refer to as standard evolutionary biology, sorry) is not strict darwinism, nor does it rely solely on RM&NS. You are arguing against a strawman of your own imagination, not against the modern theory of evolution.\n \n My comment about Carmbrian rabbits and precambrian hominids refutes your claim that \"Nothing can threaten darwinism,--it would be like threatening to nail jello to the wall. Duh, what was I thinking?!?\" Something can be directed at refutation of standard evolutionary explanations without involving EAM one way or another. Also, the ToE is indeed very broad and varied, so if you want to disprove it, you'd be best off going to those areas that provide the potential for clear falsification, rather than just citing things that you think offer refutations to claims that are only made in your peculiar versions of the ToE.\n \n With respect to one-to-one mapping, Chemist just made the same point that I've been trying to get across to you.", 
   {}, 
   274943, 
   null, 
   1185151020.0
  ], 
  [
   275066, 
   null, 
   "SLP", 
   "So once again we get the standard WW response to a well thought out response. \"nuh-uh! *fingers in ears*\" No facts, no data, not even any arguments. Just, \"you're wrong cause I don't want you to be right\". Sigh.\n\n \n \n Having read (and laughed at) WW's inane, self-serving, underinformed, hilariously overconfident insult-laden gibberish for several years, I can say that I came to expect no less than what you describe after reading about the first 5 or 6 posts of his way back when.", 
   {}, 
   274847, 
   null, 
   1185210660.0
  ], 
  [
   275306, 
   null, 
   "wascallywabbit", 
   "**\n \n More facts, more data, for the darwinists, (like kronus and all his pals) who will make the standard darwinist response to a meaningful post--that is, \" \"nuh-uh! *fingers in ears*\" No facts, no data, not even any arguments [here]. Just, \"you're wrong cause I don't want you to be right\". Sigh.\"\n \n \"Source: University of Virginia \n Date: July 24, 2007 \n More on: Stem Cells, Lymphoma, Brain Tumor, Immune System, Molecular Biology, Biotechnology \n \n Specialized Cells: A Question Of Identity\n Science Daily - Human development has long been seen as a one-way street. During gestation, stem cells were thought to develop into a succession of ever more specialized cells. As Dr. R. Ariel Gomez has discovered, the final identity of these cells is not as definite as once thought. \"The identity of many cell types is in a constant state of flux,\" Gomez says.\n \n Gomez, a professor of pediatrics who also serves as the University's vice president for research and graduate studies, specializes in the juxtaglomerular (JG) cell. This is a highly specialized cell that in adults resides in the glomerulal area of the kidney and produces renin, a substance that increases blood pressure. Renin is essential for maintaining our fluids and electrolytes at healthy levels.\n \n Working with colleagues Dr. Maria Sequeira Lopez and Ellen Pentz from the Department of Pediatric Nephrology, Gomez tracked the lineage of the JG cell back to its ancestor, a renin-producing progenitor cell that is widely distributed in the embryo. They also discovered that this progenitor cell evolves into a variety of different cell types besides the JG cell, including smooth muscle cells that line the blood vessels and cells that appear in the adrenal gland and other tissues.\n \n Under normal conditions, there are enough JG cells producing renin to ensure that blood pressure remains at proper levels, but these cells alone cannot meet the demand in an emergency. \"We discovered that when the body is threatened and blood pressure drops, those smooth muscle and adrenal cells derived from the renin progenitor return to an earlier type and produce renin,\" says Gomez. \"It is as if they have memory. We're interested in cues in their immediate environment that cause them to revert.\"\n \n Gomez's target is deep within the nucleus of the cell, in the chromatin scaffold that holds its DNA in place. A gene is expressed when the lattice around it opens up and allows the factors that transcribe the gene's formula for a particular protein to come in contact with it. Gomez and his colleagues are working to pinpoint the factors that open the lattice around the renin gene in smooth muscle cells.\n \n In Gomez's view, the plasticity of the renin cells confers an evolutionary advantage. \"It's an efficient way of providing additional renin-producing capacity exactly when it's needed,\" he says. This dual identity also suggests the possibility of new therapies. \"If we can describe the process by which cells revert to their renin-producing ancestor,\" he notes, \"it will open new possibilities for cell-based therapies in general and in the treatment of people with kidney and blood pressure diseases in particular.\"\n \n Note: This story has been adapted from a news release issued by University of Virginia.\"\n \n at-- http://www.sciencedaily.com/releases/2007/07/070722110230.htm", 
   {
    "unicode_changes_made": true
   }, 
   275066, 
   null, 
   1185308340.0
  ], 
  [
   275333, 
   null, 
   "N.Wells", 
   "I'm not sure why you posted that. It's an interesting example in humans of something that was not previously known to happen naturally in humans. However, similar backing up and starting over (reversal of specialized cells to pluripotency or even totipotency) happens naturally ALL THE TIME in plants, and frequently enough in amphibians, reptiles, echinoderms, flatworms, and others.", 
   {}, 
   275306, 
   null, 
   1185316140.0
  ], 
  [
   275368, 
   null, 
   "chemist99a", 
   "In Gomez's view, the plasticity of the renin cells confers an evolutionary advantage. \n\n \n Ok so these cell lines are able to reverse certain portions of their developmental program. Happens you know, indeed our ability to clone from somatic cells is based on much the same process - removing the epigentic switches which generate differentiation of somatic cells. Right now its done by starvation and shock - rough treatments indeed, but that will become more sophisticated as we learn more. And yes in the specific situtaion described the ability to alter gene expression may confer an evolutionary advantage. But guess what its just plain old genetics and NDS. Nothing there which seems to be otherwise. Somatic cell lines (including their stem cells) are adaptable and flexible, Suprised?", 
   {
    "unicode_changes_made": true
   }, 
   275333, 
   null, 
   1185325200.0
  ], 
  [
   281765, 
   null, 
   "chemist99a", 
   "A final, hopefully, note to WW. Its better to have a theory based on bits of stuff than one like EAM which is based on bits of fluff.", 
   {}, 
   275368, 
   null, 
   1188631740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Yet another kick in the teeth for darwinist/materialist \"particle biology\"", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10147-yet-another-kick-teeth-darwinist-materialist-particle-biology.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10147, 
  "discussion_files": [
   [
    "15567.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10147-yet-another-kick-teeth-darwinist-materialist-particle-biology-print.html"
   ], 
   [
    "15568.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10147-yet-another-kick-teeth-darwinist-materialist-particle-biology-3-print.html"
   ], 
   [
    "15569.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10147-yet-another-kick-teeth-darwinist-materialist-particle-biology-2-print.html"
   ]
  ], 
  "identifier": 10147
 }
]