[
 [
  [
   16484, 
   null, 
   "TheoMorphic", 
   "I want to stress the importance of keeping religion and science separate. Both areas of thought use radically different motivations for doing the things they do. Any mixing of the two can result in the intruding side being severely ridiculed and insulted. \n \n \n Usually when science and religion mix one side is intruding on the other. It's difficult to identify which side is intruding on the other... it's easy to be biased and decide one side is always the defender, and the other side is unjustly infringing.\n \n this infringement can go both ways. When scientists try to prove the bible is logically flawed, or a certain idea of god is logically flawed... this is science infringing on religion. Religions are systems of though that instruct people on how to live their lives, and to what end they should live their lives. It has to do with morals, ethics and opinions. Science has no business commenting on any of these three topics. \n \n The mixing can go the other way too. When individuals try to use commonly accepted ideas in their religion to change accepted practices in science... this is religion infringing on science. Science has a unique perspective of the natural world that relies only on what can be objectively observed. \n \n I say it's improper to mix science and religion... but this does NOT mean an individual can not be actively involved in both areas. There does not necessarily have to be any contradictions between these 2 idea. as an example: the bible says a world wide flood occurred, while science says there is no evidence for a world wide flood. \n \n if the bible was right, and a flood actually did occur, how does this impact science? science still depends on objective evidence, and would continue to support the wrong conclusion until evidence to the contrary was found. This does not detract from science because science depends on objective evidence to conduct itself. It would hold onto this incorrect view until evidence was found to contradict it. It is perfectly alright for science to draw the wrong conclusions... just as long as those conclusions derive from the current evidence.\n \n What if science is right, and no flood occurred. how does this impact religion? The bible has the same message, and the messages from god do not change. he still instructs you on how to live your life, and why you should give him thanks, regardless of what other individuals say. \n \n in conclusions... umm... just try to keep it separate people. No one's basic beliefs about a given system are shaken when these two groups collide... but opinions about the other side are damaged instead..", 
   {
    "post_info": {
     "post_title": "Religon and Science"
    }
   }, 
   null, 
   null, 
   1064131620.0
  ], 
  [
   16498, 
   null, 
   "montalban", 
   "science still depends on objective evidence\n\n \n In a sense, there is no such thing. Evidence could sit by itself and be said to be objective, but it would be useless. You'd need to try to apply that evidence to something, asking 'what's it evidence for?' Once you do this, it becomes subjective.\n \n It is wrong to conlcude that 'religion relies on subjective evidence and science relies on objective evidence'.\n \n \nWhat if science is right, and no flood occurred. how does this impact religion? The bible has the same message, and the messages from god do not change. he still instructs you on how to live your life, and why you should give him thanks, regardless of what other individuals say. \n\n \n God does not change. His message might. Our interpretation of the message might.\n \n \nin conclusions... umm... just try to keep it separate people. No one's basic beliefs about a given system are shaken when these two groups collide... but opinions about the other side are damaged instead..\n\n \n Again, ideally, but in reality no.\n \n When I believe that God says He created the world, then I must object to a belief system that says other than what God says.\n \n Furthermore, the real implications of naturalistic materialism, as supported by most evolutionaries is, I think, the ultimate degradation of humanity.\n \n As Crick says (and I'm fond to quote)...\n \"Your joys and your sorrows, your memories and ambitions, your sense of personal identity and free will are in fact no more than the behaviour of a vast assembly of nerve cells and their associated molecules\"\n - Francis Crick (quoted in Carroll, V, & Shiflett, D \"Christianity on Trial\", p83)\n \n This de-humaninsing tenet is something I will fight.", 
   {}, 
   16484, 
   null, 
   1064140380.0
  ], 
  [
   16504, 
   null, 
   "TheoMorphic", 
   "In a sense, there is no such thing. Evidence could sit by itself and be said to be objective, but it would be useless. You'd need to try to apply that evidence to something, asking 'what's it evidence for?' Once you do this, it becomes subjective.\n\n \n conclusions drawn partially depend on presuppositions. when science examines evidence they always use the same basic assumption(s) that will be able to address all objective evidence (objective in this case meaning of a more reproducible nature). \n \n \nIt is wrong to conlcude that 'religion relies on subjective evidence and science relies on objective evidence'.\n\n \n i never said religion relies on subjective evidence. \n \n \nGod does not change. His message might. Our interpretation of the message might.\n\n \n regarding this... have you ever thought you've misinterpreted god's word? maybe he didn't mean a literal flood happened. \n \n \nAs Crick says (and I'm fond to quote)...\n \"Your joys and your sorrows, your memories and ambitions, your sense of personal identity and free will are in fact no more than the behaviour of a vast assembly of nerve cells and their associated molecules\"\n - Francis Crick (quoted in Carroll, V, & Shiflett, D \"Christianity on Trial\", p83) \n\n \n science carries along with it an invisible affirmation of uncertainty. Crick can claim this as fact, but it should be interpreted as \"so far the evidence supports this, and nothing more\". science only wants to describe observable, natural things. \n \n if you think there is more than what we can observe, why do you have to change science? why can't you just start a new school of thought?", 
   {}, 
   16498, 
   null, 
   1064141820.0
  ], 
  [
   16509, 
   null, 
   "montalban", 
   "regarding this... have you ever thought you've misinterpreted god's word? maybe he didn't mean a literal flood happened. \n\n \n As I've said on other posts... the Orthodox Church relies on revleation and the guidance of the Holy Spirit. We have a wealth of commentators through-out our history to help guide us on issues. And there's a large number of Orthodox who talk of the creation of Genesis in literal manner.\n \n I wrote this on another forum...\n The connexion of Adam to Jesus is always being made in Christianity. \n Irenaeus (Bishop of Lyons c.177-200) says \"in the first Adam we offended God by not performing his command; in the second Adam* we have been reconciled, becoming 'obedient unto death'. Adversus Haereses v.xvi.3 \n Fellowship with God is light and life...separation from God is death.\" Ibid v.xxvii.2 \n Right down to our own day... \n \"A knowledge of the beginning and end of all things is essential for us to understand the purpose of our existence here on this earth, and what lies beyond it\" Fr.Seraphim Rose's commentary on St. Symeon The New Theologian's \"The First-Created Man.\" \n To undermine Genesis is to undermine Jesus. \n \n *The Second Adam is Jesus. And it is a literal Adam they talk of.\n \n Thus the position of Adam is crucial if Christians are to understand why Jesus came.\n \n But, it can't be made more clear than... \n \"No one should think that the Creation of Six Days is allegory...\" St. Ephraim the Syrian (quoted in Fr. Seraphim Rose, \"Genesis, Creation and Early Man: The Orthodox Christian Vision p86). \n \n \nscience carries along with it an invisible affirmation of uncertainty. Crick can claim this as fact, but it should be interpreted as \"so far the evidence supports this, and nothing more\". science only wants to describe observable, natural things. \n \n if you think there is more than what we can observe, why do you have to change science? why can't you just start a new school of thought?\n\n \n See above with regards to changing science.\n \n As for Crick, he's one of your 'strays' ie. someone who strayed into commenting on religion. And, he's not the only one. Dawkins is probably the most prominent.", 
   {}, 
   16504, 
   null, 
   1064144160.0
  ], 
  [
   16527, 
   null, 
   "TheoMorphic", 
   "See above with regards to changing science.\n\n \n sorry, i missed where you addressed creating a new school of though. can you restate it?\n \n \nAs for Crick, he's one of your 'strays' ie. someone who strayed into commenting on religion. \n\n \n i'm not positive, but i'm pretty sure he didn't suggest the bible was incorrect because all we can observe of the human brain is an intricate connection of nerve cells and molecules. So far there is no reason to believe there is anything more to the brain than nerve cells, chemicals, and molecules. \n \n If the story of creation in the bible were shown to not have happened, \n would this drastically change christian religion? man still sins. they still need to ask for forgiveness. the only being that can forgive them is god. the morals and rules still hold to be right in the eyes of god. repentance is still the only way you can be saved. \n \n \nAnd, he's not the only one. Dawkins is probably the most prominent.\n\n \n how does dawkins wander into the religion and start spewing science to disprove religion?", 
   {}, 
   16509, 
   null, 
   1064170500.0
  ], 
  [
   16573, 
   null, 
   "montalban", 
   "TheoMorphic\n I know you don't want to believe it, but Dawkins has always hated religion...\n \n Try this for size...\n \n http://www.ffrf.org/dawkins.html\n \n or..\n \"It is fashionable to wax apocalyptic about the threat to humanity posed by the AIDS virus, \"mad cow\" disease, and many others, but I think a case can be made that faith is one of the world's great evils, comparable to the smallpox virus but harder to eradicate. \"\n http://www.thehumanist.org/humanist/articles/dawkins.html\n \n You're really in denial mode, when it comes to Dawkins!\n \n The fact I started a thread on religion as a virus, based on Dawkins writings seems to have passed you by.\n \n Here's a lesser piece... in promoting his new book on Amazon, the review says \"Dawkins will antagonize some readers by his attacks on religion: his tone in these essays may fall just short of intellectual arrogance, but he certainly exhibits an intellectual impatience not always beneficial to his argument.\"\n http://www.amazon.com/exec/obidos/ASIN/0618335404/ref=pd_sxp_f/102-9483651-7492134", 
   {}, 
   16527, 
   null, 
   1064198100.0
  ], 
  [
   16591, 
   null, 
   "TheoMorphic", 
   "You're really in denial mode, when it comes to Dawkins!\n\n \n yeesh...\"denial\"? i asked you to elaborate, and yeah you're right, he does do a lot of bashing of religion. I don't agree with a lot of the points he made... but at least he backs up his claims with reasoning. \n \n \nThe fact I started a thread on religion as a virus, based on Dawkins writings seems to have passed you by.\n\n \n when did you start this thread? i've only joined this forum about a week ago.\n \n again, i seem to have missed where you addressed this, but what did you say about starting a new school of thought. Why do you insist on changing science because of it's supposed fundamental limitations concerning the supernatural? Why not create (or support if one already exists) something new, and let science die in it's inadequacy?", 
   {}, 
   16573, 
   null, 
   1064202360.0
  ], 
  [
   16599, 
   null, 
   "montalban", 
   "yeesh...\"denial\"? i asked you to elaborate, and yeah you're right, he does do a lot of bashing of religion. I don't agree with a lot of the points he made... but at least he backs up his claims with reasoning. \n\n \n I have what's now bordering a pathological hatred of Dawkins... because he hates religion. He basically said that anyone who believes in God needs there head examined.\n \n \nwhen did you start this thread? i've only joined this forum about a week ago.\n\n \n It's under \"RELIGION\" subject\n \n \nagain, i seem to have missed where you addressed this, but what did you say about starting a new school of thought. Why do you insist on changing science because of it's supposed fundamental limitations concerning the supernatural? Why not create (or support if one already exists) something new, and let science die in it's inadequacy?\n\n \n Letting science die? I've got nothing against 'science'. But, I've got an axe to grind here with some scientists. (Well, I got picked-on at school by my biology teacher because I had faith in God. It was made abundantly clear that I was 'irrational' because of my deeply held beliefs (and this was going to a Catholic school!).)\n \n Throughout my life I've encountered people who hold science up to be more than what it is... and on this forum and www.creationtalk.com this has continued.* I don't believe that I am unintelligent, ugly yes, but unintelligent, no.\n \n When people smuggly deny all my evidence as evidence, then I look at what they temselves believe, and find for the most part they have stored great faith in faith themselves, rather than 'facts'.**\n \n Then I look to why do these people so passionately want to undermine Christianity? What is it about Christ's message that is so abhorrent? Then I feel that the reason that they attack someone so good, because they themselves are intrinsiclly not very good themselves; full of hate for anything they don't understand.\n \n I have nothing against 'science'. Science and religion should be able to sit together. But, because religion deals with more than science ever can, it should be deemed the greater of the two. I put religion above science. Anything that science says that religion says otherwise, probably means that the science is wrong.\n \n I don't put scientists above the machinations of mere mortals.\n \n \n \n \n \n *Even in debating say Richard Milton, or Philip Johnson, they'll not discuss the merits of the argument, but attack him personally. 'If he's religious... nothing he says is rational'. This coming from so-called rationalists themselves.\n \n \n **Science for the most part deals with only the observable, this is wholly limiting. What about 'love' for instance? (Or the inspiration that leads someone to paint a beautiful picture.)", 
   {}, 
   16591, 
   null, 
   1064203620.0
  ], 
  [
   16618, 
   null, 
   "Demosthenes", 
   "I'd just like to say that montalban's last post was excellent and had some really good points to it.", 
   {}, 
   16599, 
   null, 
   1064206140.0
  ], 
  [
   16620, 
   null, 
   "Crim", 
   "I have nothing against 'science'. Science and religion should be able to sit together. But, because religion deals with more than science ever can, it should be deemed the greater of the two. I put religion above science. Anything that science says that religion says otherwise, probably means that the science is wrong.\n \n \n I disagree completely. Religion does not deal with more than science because they deal with different things. Religion answers the questions of ultimate origins and questions of life's meaning (whys). Science answers questions of secondary origins and how things have occured, do occur, and will occur (hows). When religion tries to answer the questions which science is best fit to handle, religion loses time and time again.", 
   {}, 
   16618, 
   null, 
   1064206560.0
  ], 
  [
   16625, 
   null, 
   "TheoMorphic", 
   "I have what's now bordering a pathological hatred of Dawkins... because he hates religion. He basically said that anyone who believes in God needs there head examined.\n\n \n ok... i can see this. go right on ahead spreading the word of why these conclusions are in error... but not all the information that comes from his mouth is inherently evil. \n \n \nWhen people smuggly deny all my evidence as evidence, then I look at what they temselves believe, and find for the most part they have stored great faith in faith themselves, rather than 'facts'.**\n \n **Science for the most part deals with only the observable, this is wholly limiting. What about 'love' for instance? (Or the inspiration that leads someone to paint a beautiful picture.)\n\n \n it may be limiting in your eyes, but that's just the nature of the system. It doesn't WANT to explain love, or fear, or hatred, or god, or the devil, or evil, or magic, or miracles, or the tiny green door dinging gnomes that ding your car with screwdrivers when you're grocery shopping. Science has it's area of focus, and it's not inherently interested in explaining anything else. \n \n A butter knife is inherently limited because it can't cut down a redwood tree. But does that mean the butter knife is flawed in anyway? no. it serves it's purpose quite well, and is in no need for design changes (even if there are trees that need to be cut down). We have saws to cut down trees. \n \n \nThen I look to why do these people so passionately want to undermine Christianity? What is it about Christ's message that is so abhorrent? Then I feel that the reason that they attack someone so good, because they themselves are intrinsiclly not very good themselves; full of hate for anything they don't understand.\n\n \n bla... well again that's a personal score to settle with some individuals. I certainly don't try to bash religion, or claim it's ignorant, or stupid, or whatever. I only show interest when people try to change ideas shown in science using religious means. \n \n \nBut, because religion deals with more than science ever can, it should be deemed the greater of the two. I put religion above science. Anything that science says that religion says otherwise, probably means that the science is wrong.\n\n \n again, this is fine if you hold anything science to deem \"true\" to be incorrect if it conflicts with your religion, but please don't try to change the scientific method, or change conclusions it has drawn. Science deals with the purely objective and observable. if you do feel the need to change something in science because it conflicts with your religious model, then you MUST do it using the scientific method.", 
   {}, 
   16599, 
   null, 
   1064207160.0
  ], 
  [
   16639, 
   null, 
   "montalban", 
   "ok... i can see this. go right on ahead spreading the word of why these conclusions are in error... but not all the information that comes from his mouth is inherently evil. \n\n \n I think his brand of ignorance is evil... the fact he's a popular author of ignorance makes him dangerous.\n \n \nit may be limiting in your eyes, but that's just the nature of the system. It doesn't WANT to explain love, or fear, or hatred, or god, or the devil, or evil, or magic, or miracles, or the tiny green door dinging gnomes that ding your car with screwdrivers when you're grocery shopping. Science has it's area of focus, and it's not inherently interested in explaining anything else. \n\n \n I don't dislike science because of its limitations. I dislike people who proclaim such a limited outlook is the ultimate source of all that is real and unreal. And if only scientists kept to their own camp, but Dawkins et al won't leave it alone.\n \n \nA butter knife is inherently limited because it can't cut down a redwood tree. But does that mean the butter knife is flawed in anyway? no. it serves it's purpose quite well, and is in no need for design changes (even if there are trees that need to be cut down). We have saws to cut down trees. \n\n \n Actually a butter knife could, it would take longer. And you have scientists to cut down religion\n \n \n \nbla... well again that's a personal score to settle with some individuals. I certainly don't try to bash religion, or claim it's ignorant, or stupid, or whatever. I only show interest when people try to change ideas shown in science using religious means. \n\n \n Well, I see people trying to change religious ideas with science as a tool; that one is rational, and the other isn't.\n \n \nagain, this is fine if you hold anything science to deem \"true\" to be incorrect if it conflicts with your religion, but please don't try to change the scientific method, or change conclusions it has drawn. Science deals with the purely objective and observable.\n\n \n I agree it deals with the observable, and because of this, it can't be objective.\n \n \nif you do feel the need to change something in science because it conflicts with your religious model, then you MUST do it using the scientific method.\n\n \n This is what I attempt here to do, by going through the evidences of evolution to show how lame they are. Computer modelling, complex systems, speciation, survival of the fittest \n etc.\n \n A lot of people ask me why I bother with this, especially as\n a) I get rude about it\n b) I've already made up my mind\n \n a) I don't intend to be\n b) It helps strengthen my own faith, by having it challenged", 
   {}, 
   16625, 
   null, 
   1064215980.0
  ], 
  [
   16652, 
   null, 
   "TheoMorphic", 
   " Actually a butter knife could, it would take longer. And you have scientists to cut down religion\n\n \n so those people are stupid for trying to cut down a tree with a butter knife. And it's equally irrational to butter a piece of bread with a chain saw (I realize I originally simply said saw, but a chain saw makes the action more ridiculous). \n \n \nI agree it deals with the observable, and because of this, it can't be objective.\n\n \n yeesh. Look, observations can be objective. Conclusions, based on those observations can vary, so those conclusions are subjective, depending on presuppositions. Water boiling at 100 degrees C is an objective observation, bacteria dancing under a light is an objective observation, the fossil record is an objective observation. \n \n \nThis is what I attempt here to do, by going through the evidences of evolution to show how lame they are. Computer modelling, complex systems, speciation, survival of the fittest \n etc.\n \n A lot of people ask me why I bother with this, especially as\n a) I get rude about it\n b) I've already made up my mind\n \n a) I don't intend to be\n b) It helps strengthen my own faith, by having it challenged\n \n \n ... so you don't deny that you've already made up your mind... umm... why the HELL would ANYONE want to discuss ANYTHING with you? Tell me... is there any piece or group of evidence (the sky is the limit) that would make you believe evolution happened?", 
   {
    "unicode_changes_made": true
   }, 
   16639, 
   null, 
   1064222100.0
  ], 
  [
   16677, 
   null, 
   "montalban", 
   "yeesh. Look, observations can be objective. Conclusions, based on those observations can vary, so those conclusions are subjective, depending on presuppositions. Water boiling at 100 degrees C is an objective observation, bacteria dancing under a light is an objective observation, the fossil record is an objective observation.\n\n \n How do you know it's an objective reality? Water only boils at 100C in some circumstances. The angle at which you look at the thermometer is also to be considered.\n \n If you accept that there can be objective reality, then it's a crying shame that you seem determined to argue that only the evidence you already believe in is objective evidence and any other evidence, such as a belief in God is wholly subjective.\n \n Seems rather as dogmatic as what you're accusing me of. I do think at best, you're just as arrogant as I am on this issue, because we both believe we are right, but for different reasons. You haven't been able to see that your own rejection of evidence as evidence is based on your own a priori beliefs.\n \n I understand this happens in my camp too, which is WHY I don't put my faith in a system as weak as evolutionary science. At very best because it can't deal with the real issues of life, that is, life itself, it's pretty pointless as a belief system.\n \n [QUOTE=TheoMorphic]\n Quote:\n Originally Posted by montalban\n This is what I attempt here to do, by going through the evidences of evolution to show how lame they are. Computer modelling, complex systems, speciation, survival of the fittest \n etc.\n A lot of people ask me why I bother with this, especially as\n a) I get rude about it\n b) I've already made up my mind\n a) I don't intend to be\n b) It helps strengthen my own faith, by having it challenged\n \n \n? so you don?t deny that you?ve already made up your mind? umm? why the HELL would ANYONE want to discuss ANYTHING with you? Tell me? is there any piece or group of evidence (the sky is the limit) that would make you believe evolution happened?\n\n \n Is being honest a problem for you? If it is let me know. Or are you now going to tell me that after arguing in favour of scientific materialism (Darwinism) you're going to 'keep an open-mind' and entertain the though that God might just might exist? I doubt that, because otherwise I'd have to question why you've been arguing so forcefully against religious evidence as evidence, unless you just enjoy debating (see above if you want to know my reasons).", 
   {}, 
   16652, 
   null, 
   1064244420.0
  ], 
  [
   16707, 
   null, 
   "TheoMorphic", 
   "How do you know it's an objective reality? Water only boils at 100C in some circumstances. The angle at which you look at the thermometer is also to be considered.\n\n \n because everyone agrees water boils at 100 degrees Celsius (at 1 atm at least). The angle you look at the thermometer doesn't change the boiling point. That just means someone made a faulty observation. \n \n [quote=montalban]If you accept that there can be objective reality, then it's a crying shame that you seem determined to argue that only the evidence you already believe in is objective evidence and any other evidence, such as a belief in God is wholly subjective.\n \n Because belief in God is subjective. Water boiling at 100 degrees Celsius can be verified by anyone who has the desire and the means to test it. The existence of God can not be independently verified. There are no tests that produce predetermined results that can be observed. Not even \"miracles\" are evidence, because you don't know when they will actually happen. How many times is a person prayed for, and they are not healed, or they go on suffer, or they still die?\n \n \nSeems rather as dogmatic as what you're accusing me of. I do think at best, you're just as arrogant as I am on this issue, because we both believe we are right, but for different reasons. You haven't been able to see that your own rejection of evidence as evidence is based on your own a priori beliefs.\n\n \n The a prior beliefs is not a rejection of the spiritual or supernatural world.... The a prior belief is that science does not have the means to make any decisions about the spiritual or supernatural. The rejection of evidence comes on the unverifiable nature of the evidence you suggest. \n \n \nI understand this happens in my camp too, which is WHY I don't put my faith in a system as weak as evolutionary science. At very best because it can't deal with the real issues of life, that is, life itself, it's pretty pointless as a belief system.\n\n \n so since you think both thought systems are flawed, you go with the one that assumes it already has the answers for everything... even if physical evidence points to different conclusions. If you think the \"real\" issues of life focus on the spiritual world, so be it. Science only focuses on the physical issues of life. Since that is it's only area of interest, and attempt to get science to accept \"real\" evidence won't work, unless you can show it has an impact on the physical world. \n \n \nIs being honest a problem for you? If it is let me know. Or are you now going to tell me that after arguing in favor of scientific materialism (Darwinism) you're going to 'keep an open-mind' and entertain the though that God might just might exist? I doubt that, because otherwise I'd have to question why you've been arguing so forcefully against religious evidence as evidence, unless you just enjoy debating (see above if you want to know my reasons).\n\n \n Evolution is falsifiable. If a fossil were found in a rock later that dated back to a radically different date than what has previously been found, and a study was done to show there was not a mistake, or a fluke, then evolution would have to be changed or dropped. If the earth was shown to be much less than 4.5 billion years old then evolution would be changed or dropped. Like all scientific theories, it is falsifiable, and tentative. \n \n The supposed \"limitations\" of science are not limitations at all because science doesn't try to explain morals, or ethics, or the afterlife. It only deals with the physical world, and systems that have an impact on the physical world. The attempt to convince science to support your \"evidence\" is asking science to out step it's bounds. If you do that then subjective experiences would be admissible as evidence, and ancient documents that contain stories that are not possible by any physical process studied today would have to be taken as historic documents. If this were the case the limit would not be just on what you offer. Science would have to accept all subjective experiences from all religions, as well as all ancient texts, no matter what they say.", 
   {
    "unicode_changes_made": true
   }, 
   16677, 
   null, 
   1064258040.0
  ], 
  [
   16778, 
   null, 
   "montalban", 
   "Water only boils at 100C in some circumstances. The angle at which you look at the thermometer is also to be considered.\n \n \nbecause everyone agrees water boils at 100 degrees Celsius (at 1 atm at least). The angle you look at the thermometer doesn?t change the boiling point. That just means someone made a faulty observation.\n\n \n So, it's not because it does do it, but because everyone agrees that it does. What if everyone's making the same faulty observation - see my example on describing bacteria... how do you know that the refractive qualities of the glass in the thermometer aren't affecting your observation?\n \n \nThe a prior beliefs is not a rejection of the spiritual or supernatural world?. The a prior belief is that science does not have the means to make any decisions about the spiritual or supernatural. The rejection of evidence comes on the unverifiable nature of the evidence you suggest.\n\n \n But are you trying to judge the evidence by scientific standards which you already acknowledge can't deal with religion?\n \n \n Originally Posted by montalban\n I understand this happens in my camp too, which is WHY I don't put my faith in a system as weak as evolutionary science. At very best because it can't deal with the real issues of life, that is, life itself, it's pretty pointless as a belief system.\n \n \nso since you think both thought systems are flawed, you go with the one that assumes it already has the answers for everything? even if physical evidence points to different conclusions. If you think the ?real? issues of life focus on the spiritual world, so be it. Science only focuses on the physical issues of life. Since that is it?s only area of interest, and attempt to get science to accept ?real? evidence won?t work, unless you can show it has an impact on the physical world.\n\n \n Any system that involves humans is flawed. That is why we rely on God, who is perfect. Our lives are worked at being back with God.\n SO you're saying feelings aren't real? I'd hate to be your child especially at Christmas \"No presents because there's no proof of Santa, and you can't feel disappointed because your feelings are wholly subjective and in no way verifiable!'", 
   {}, 
   16707, 
   null, 
   1064285160.0
  ], 
  [
   16782, 
   null, 
   "TheoMorphic", 
   "The a prior beliefs is not a rejection of the spiritual or supernatural world?. The a prior belief is that science does not have the means to make any decisions about the spiritual or supernatural. The rejection of evidence comes on the unverifiable nature of the evidence you suggest.\n \n \nBut are you trying to judge the evidence by scientific standards which you already acknowledge can't deal with religion?\n\n \n yes i'm judging it by scientific standards since you are trying to impress religious claims on science. Science can't accept any evidence that is unverifiable. If you want to have science take into account spiritual evidence then you must make it verifiable... until you do that it won't be considered. Until you do that it is outside the bounds of science.\n \n \nAny system that involves humans is flawed. That is why we rely on God, who is perfect. Our lives are worked at being back with God.\n\n \n um... even your religion (aside from when god directly talks to you) is based pretty much only on human's interpretations of what God said and did. Why don't you accept that that is a flawed system? and just because a system is flawed, or limited in some way doesn't make it completely arbitrary. Science is very good at explaining the physical world. \n \n \nSO you're saying feelings aren't real?\n\n \n i'm saying feelings are subjective, and not permissible as scientific evidence.", 
   {}, 
   16778, 
   null, 
   1064286060.0
  ], 
  [
   16795, 
   null, 
   "montalban", 
   "The a prior beliefs is not a rejection of the spiritual or supernatural world?. The a prior belief is that science does not have the means to make any decisions about the spiritual or supernatural. The rejection of evidence comes on the unverifiable nature of the evidence you suggest.\n\n \n No. You've accepted science. And you're trying to judge religion by scientific standards... as you here say...\n \n \nyes i'm judging it by scientific standards since you are trying to impress religious claims on science. Science can't accept any evidence that is unverifiable. If you want to have science take into account spiritual evidence then you must make it verifiable... until you do that it won't be considered. Until you do that it is outside the bounds of science.\n\n \n So, you are saying that you're trying to do something impossible, because I'm trying to do the same thing?\n \n I don't want science to take into account spiritual evidence. I'm not debating here with science. I'm debating here with you. I want you to admit the possibility of religious evidence.\n \n If you freely admit the limitations of science, why hold it up as the be-all and end-all determiner of truth?\n \n You already admit that science can't/won't deal with a certain amount of things, so what have you got against religion per se?\n \n \num... even your religion (aside from when god directly talks to you) is based pretty much only on human's interpretations of what God said and did. Why don't you accept that that is a flawed system? and just because a system is flawed, or limited in some way doesn't make it completely arbitrary. Science is very good at explaining the physical world. \n\n \n It is a better system than believing only in science. We Orthodox believe our Church is without error. But people in it can be in error.\n \n Science is very good at explaining... well of course it is. So is religion. Except you don't believe one over the other.\n \n \n\n i'm saying feelings are subjective, and not permissible as scientific evidence.\n\n \n But they exist. Again you're holding up science as the master rule of what is and what isn't. You don't believe in God, because you can't use science to measure God. Now you say you believe in emotions without the benefit of scienftific evidence. Again, as I've said a number of times, you've started with the belief in no God, and you've worked your way back from there, so, you will make exceptions to scienfitic limitations only in so far as things you've already committed to believing in. No wonder you don't accept religious evidence, because you don't believe in God!", 
   {}, 
   16782, 
   null, 
   1064289360.0
  ], 
  [
   16842, 
   null, 
   "TheoMorphic", 
   "Do you realize how many words your putting in my mouth?\n \n \nNo. You've accepted science. And you're trying to judge religion by scientific standards... \n\n \n I don't judge religion. However, religious evidence is inadmissible as scientific evidence as long as it is unverifiable.\n \n \nI don't want science to take into account spiritual evidence. I'm not debating here with science. I'm debating here with you. I want you to admit the possibility of religious evidence.\n\n \n My though process, and what I accept and reject is based a lot on science. For me religious evidence is not evidence to believe in any religion because it is not verifyable. If it were my experience, that would be different... but I'm not going to take someone's word that what they felt was real. \n \n \nIf you freely admit the limitations of science, why hold it up as the be-all and end-all determiner of truth?\n\n \n I have NEVER claimed it to be this end all determiner of truth. If I have ever used the word \"truth\" it comes with the implied uncertainty that any scientific explanation comes with.\n \n \nYou already admit that science can't/won't deal with a certain amount of things, so what have you got against religion per se?\n\n \n nothing against religion. I just wont accept any given religion unless there is supporting evidence for it. Subjective experiences (except for mine) are not admissible as evidence when it comes to my beliefs. \n \n \nScience is very good at explaining... well of course it is. So is religion. Except you don't believe one over the other.\n\n \n explaining the physical world. What aspects of the physical world does religion explain (don't include the original creation, because that is debatable).\n \n \nBut they exist. Again you're holding up science as the master rule of what is and what isn't. You don't believe in God, because you can't use science to measure God. Now you say you believe in emotions without the benefit of scienftific evidence. Again, as I've said a number of times, you've started with the belief in no God, and you've worked your way back from there, so, you will make exceptions to scienfitic limitations only in so far as things you've already committed to believing in. No wonder you don't accept religious evidence, because you don't believe in God!\n\n \n It doesn't matter how many times you state \"you've started with the belief in no God\", it doesn't make it true. So far I have seen no evidence for a God. Again I do not accept religious evidence because most (if not all) is subjective and not independently verifiable", 
   {
    "unicode_changes_made": true
   }, 
   16795, 
   null, 
   1064303460.0
  ], 
  [
   16847, 
   null, 
   "montalban", 
   "Do you realize how many words your putting in my mouth?\n\n \n No, I didn't realise.\n \n \n \nI don?t judge religion. However, religious evidence is inadmissible as scientific evidence as long as it is unverifiable.\n\n \n But it is evidence. We've already, and repeatedly established the limitations of science for judging the truth or not of anything\n \n So why just rely on it?\n \n \nMy though process, and what I accept and reject is based a lot on science. For me religious evidence is not evidence to believe in any religion because it is not verifyable. If it were my experience, that would be different? but I?m not going to take someone?s word that what they felt was real. \n\n \n It is verifyable.\n \n But you already base your experiences on others... show me where or when you experienced abiogenesis?", 
   {}, 
   16842, 
   null, 
   1064308320.0
  ], 
  [
   16851, 
   null, 
   "TheoMorphic", 
   "But it is evidence. We've already, and repeatedly established the limitations of science for judging the truth or not of anything\n \n So why just rely on it?\n\n \n because i have no reason to believe there is anything more. 1) science has the potential to explain everything i have ever experienced, and 2) i was brought up catholic, and i never had any inexplicable experiences with any kind of spiritual world (this was before I ever put much stock in the scientific method). Why should i go on looking for something that pretty much has no impact on the world i live in, and has never given me any reason to believe it's there, even when i was looking for it.\n \n \nIt is verifyable.\n\n \n please devise an experiment that could objectively verify religious testimony. \n \n \nBut you already base your experiences on others... show me where or when you experienced abiogenesis?\n\n \n There is no fundamental physical limitation of abiogenesis. at any rate, i'm not a huge supported of abiogenesis because i don't think it's very developed as it is, and i don't know much about it. the \"experiences\" i rely on is the testable, verifiable body of knowledge science has built up over the years.", 
   {}, 
   16847, 
   null, 
   1064310180.0
  ], 
  [
   16855, 
   null, 
   "montalban", 
   "because i have no reason to believe there is anything more. 1) science has the potential to explain everything i have ever experienced, and 2) i was brought up catholic, and i never had any inexplicable experiences with any kind of spiritual world (this was before I ever put much stock in the scientific method). Why should i go on looking for something that pretty much has no impact on the world i live in, and has never given me any reason to believe it's there, even when i was looking for it.\n\n \n How does science explain love? How does science explain religion - you were, after-all religious for some period of your life. Is it the virus Dawkins claims?\n \n \n \nplease devise an experiment that could objectively verify religious testimony. \n\n \n I told you that there is no such thing as objective evidence.\n \n However, if you want proof, the Catholic Church claims to have a method so, knock yourself out...\n http://www.udayton.edu/mary/questions/faq/faq16.html\n They actually have a team that verifies miracles, but in the time given I can't find a link.\n \n \nThere is no fundamental physical limitation of abiogenesis. at any rate, i'm not a huge supported of abiogenesis because i don't think it's very developed as it is, and i don't know much about it. the \"experiences\" i rely on is the testable, verifiable body of knowledge science has built up over the years.\n\n \n Do you believe in planets outside this solar system? Have you ever actually seen one - probably relying wholly on some blurred photo huh?\n \n What about prions? Do you believe in them?", 
   {}, 
   16851, 
   null, 
   1064310720.0
  ], 
  [
   16859, 
   null, 
   "TheoMorphic", 
   "How does science explain love? How does science explain religion - you were, after-all religious for some period of your life. Is it the virus Dawkins claims?\n\n \n a way \"love\" could have evolved: early humans who had a strong emotional desire to be with or close to a single human of the opposite sex would have been selected for because humans that did not have this feeling would have had less healthy offspring (two parents caring for one child is more efficient than one). Please don't tell me how this is wrong, or dehumanizing humans... this is how science would explain something like love. Definitions of love actually belong more in psychology, but psychology has many many variables because it deals with the human brain, which is not fully understood yet. Indeed it is our most complex organ.\n \n \n However, if you want proof, the Catholic Church claims to have a method so, knock yourself out...\n http://www.udayton.edu/mary/questions/faq/faq16.html\n\n \n That's all well and good if the church wants to decide if someone experienced a miracle (apparition) or not... but to show science that something is verifiable you have to play by their rules. The church's method was to accept whatever the person said they saw as an apparition, just as long as it didn't contradict any pre established facts (and the person who had the experience had to be honest, and not in it for the money). Devise a scientific process that could verify miracles (or apparitions).\n \n As a side note, do you accept this as a process to verify miracles or visions? If so would you accept religious testimony from other religions as evidence for their religion? If not, I'm guessing it would be because it conflicts with your religion which is already established \"fact\". How did this established fact come to be? It can't have been through these apparitions, because that would be circular reasoning. What other evidence is there?\n \n \nDo you believe in planets outside this solar system? Have you ever actually seen one - probably relying wholly on some blurred photo huh?\n \n What about prions? Do you believe in them?\n[/quote]\n \n What are prions?\n \n I believe there are planets in other solar systems. Actually I haven't seen a photo that claimed it was a picture of a planet in another solar system. What I've heard is that planets can be found by how much they pull a sun off it's \"center\" as the planet orbits around it. I haven't gone too in-depth, but I don't see why this is unreasonable.", 
   {
    "unicode_changes_made": true
   }, 
   16855, 
   null, 
   1064312700.0
  ], 
  [
   16863, 
   null, 
   "montalban", 
   "a way ?love? could have evolved: early humans who had a strong emotional desire to be with or close to a single human of the opposite sex would have been selected for because humans that did not have this feeling would have had less healthy offspring (two parents caring for one child is more efficient than one). Please don?t tell me how this is wrong, or dehumanising humans? this is how science would explain something like love. Definitions of love actually belong more in psychology, but psychology has many many variables because it deals with the human brain, which is not fully understood yet. Indeed it is our most complex organ.\n\n \n So you're hopeful that one day science will explain it, whereas before you seemed to say that you just believe in science.\n \n Now you believe in things that may be explained one day by science?\n \n Come Valentine's Day, you can say to your love \"Let's have a romantic night in, I'm feeling those evolutionary urges again, and my chemicals are imbalance\" very romantic stuff!\n \n How does science explain...\n \n art?\n fashion?\n the Beatles?\n religion?\n \n And yes, what is it, to be 'human'?\n \n \nThat?s all well and good if the church wants to decide if someone experienced a miracle (apparition) or not? but to show science that something is verifiable you have to play by their rules. The church?s method was to accept whatever the person said they saw as an apparition, just as long as it didn?t contradict any pre established facts (and the person who had the experience had to be honest, and not in it for the money). Devise a scientific process that could verify miracles (or apparitions).\n\n \n They have scientists on their teams. They look at things, and if there is no 'rational' explanation or even likelihood, then ipso facto, it is a miracle!\n \n \nAs a side note, do you accept this as a process to verify miracles or visions? If so would you accept religious testimony from other religions as evidence for their religion? If not, I?m guessing it would be because it conflicts with your religion which is already established ?fact?. How did this established fact come to be? It can?t have been through these apparitions, because that would be circular reasoning. What other evidence is there?\n\n \n Well, we Orthodox don't feel the need to rationalise every little nuance of God. We are a 'mysterious' faith, in that there's a lot we accept without need to have it 'proclaimed' a miracle, so, I don't feel I can judge this, as it's not anti-Orthodox.\n \n [/quote]\n \n What are prions?\n \n I first heard about them years ago, so I'm sure they've updated the idea... but someone suggested that some diseases are caused by things smaller than viruses, called prions. They were, at the time, not widely accepted by all science... so I thought it's another good example to bring up... how do you judge a truth when science hasn't accepted it? How long before you do accept it? Is it like, when 50.1% of scientists agree, or do you have to have 66.6% agree?\n \n \nI believe there are planets in other solar systems. Actually I haven?t seen a photo that claimed it was a picture of a planet in another solar system. What I?ve heard is that planets can be found by how much they pull a sun off it?s ?centre? as the planet orbits around it. I haven?t gone too in-depth, but I don?t see why this is unreasonable.\n\n \n So, again you're double standards in that you accept things based on other people's judgements.\n \n \n Let's recap\n \n You believe in science, but also, some things that science hasn't explained, such as love.\n You believe in scientific method, excepting when used in looking at miracles\n You believe in your own judgment, but you accept things as true that you have no direct experience of.\n \n I hope this isn't putting words into your mouth. But it tells me again, that you've established a belief system, simply because it's without God.", 
   {}, 
   16859, 
   null, 
   1064316780.0
  ], 
  [
   16908, 
   null, 
   "TheoMorphic", 
   "So you're hopeful that one day science will explain it, whereas before you seemed to say that you just believe in science.\n \n Now you believe in things that may be explained one day by science?\n\n \n I'm confident there won't be some boundary that science will hit when explaining the brain. If you want to see this as faith, then fine. I exhibit faith every day by pressing on the break pedal, and stepping into elevators, and putting my hand down the garbage disposal to get a spoon. \n \n \n \nHow does science explain...\n \n art?\n fashion?\n the Beatles?\n religion?\n\n \n yeeesh... what do you want me to say? Oh these things must be magical in nature because science doesn't make scientific theories about why the beatles were great? Things that fall outside the realm of science are things that can not be tested. All of the things you just mentioned rely on human opinions to judge them. Science is not some process as to evaluate something, it's job is to build a body of knowledge about the physical world. \n \n \nThey have scientists on their teams. They look at things, and if there is no 'rational' explanation or even likelihood, then ipso facto, it is a miracle!\n\n \n please provide a few examples where the scientific community failed to find a rational explanation for something, and so dubbed it a miracle. What actually happens is science sees something as untestable, and says it's outside the realm of science. \n \n \nI first heard about them years ago, so I'm sure they've updated the idea... but someone suggested that some diseases are caused by things smaller than viruses, called prions. They were, at the time, not widely accepted by all science... so I thought it's another good example to bring up... how do you judge a truth when science hasn't accepted it? How long before you do accept it? Is it like, when 50.1% of scientists agree, or do you have to have 66.6% agree?\n\n \n whatever the % is, both sides probably want to prove the other wrong. So they devise objective tests to show that what they believe is right, and what the other people believe is wrong. With objective tests it's possible to find out who the evidence support, and who the evidence does not support. One side will loose support until the only one rational theory stands. \n \n \nSo, again you're double standards in that you accept things based on other people's judgements.\n\n \n Insofar as that I can actually verify scientific work to see if it's true. Or at least cross check it with other work. I don't rely on people's judgments of religious experience because no one other than that person knows what happened in that person's head. How can I verify to see if their experience was real or not?\n \n \nYou believe in science, but also, some things that science hasn't explained, such as love.\n\n \n there is a LOT science has not explained. But that doesn't mean it won't. As technology advances our ability to observer the world increases. \n \n \nYou believe in scientific method, excepting when used in looking at miracles\n\n \n Subjective experiences can not be verified through science. Miracles, well it depends on the miracle. If it is someone suddenly healing from cancer because of a prayer, a study could be done to see how many cancer patients suddenly heal from cancer... then that could be checked against what religion they belong to, and how many people are praying for them.\n \n \nYou believe in your own judgment, but you accept things as true that you have no direct experience of.\n\n \n I tend to accept things as true with no direct experience under my belt if multiple sources report the same thing, and I tend to not believe what only one source claims (or is able to verify).\n \n \nI hope this isn't putting words into your mouth. But it tells me again, that you've established a belief system, simply because it's without God.\n\n \n It's a belief system that doesn't make a decision on god one way or the other. It's like there is a treasure chest in a cage possibly containing a treasure. Science doesn't assume the treasure chest is empty... they just say \"well as long as it's in that cage that we can't get into, we can't make a decision one way or the other if there is treasure in it.", 
   {
    "unicode_changes_made": true
   }, 
   16863, 
   null, 
   1064339460.0
  ], 
  [
   16968, 
   null, 
   "montalban", 
   "I?m confident there won?t be some boundary that science will hit when explaining the brain. If you want to see this as faith, then fine. I exhibit faith every day by pressing on the break pedal, and stepping into elevators, and putting my hand down the garbage disposal to get a spoon. \n\n \n Yes, you have faith in science. Despite its limitations. Is your 'faith' in science testable?\n \n \nyeeesh? what do you want me to say? Oh these things must be magical in nature because science doesn?t make scientific theories about why the Beatles were great? Things that fall outside the realm of science are things that can not be tested. All of the things you just mentioned rely on human opinions to judge them. Science is not some process as to evaluate something, it?s job is to build a body of knowledge about the physical world. \n\n \n See above. You recognise that these things exist, based on no science... the 'greatness' of the Beatles, as it is a subjective experience can never be explained by science, so you say below with regards to miracles.\n \n So now we have something wholly based on experience, that you agree exists, that science can never explain, that is the truth.\n \n \nplease provide a few examples where the scientific community failed to find a rational explanation for something, and so dubbed it a miracle. What actually happens is science sees something as untestable, and says it?s outside the realm of science. \n\n \n They wouldn't be a 'miracle' if they could be explained. That's the definition.\n \n \nwhatever the % is, both sides probably want to prove the other wrong. So they devise objective tests to show that what they believe is right, and what the other people believe is wrong. With objective tests it?s possible to find out who the evidence support, and who the evidence does not support. One side will loose support until the only one rational theory stands. \n\n \n They can't devise objective tests if their raison d'etre is to prove the other wrong.\n \n So, again, what % makes it right? Some will in deed lose support, some will re-gain support, so effectively, what is right now, might be wrong next day, and then next year is right again. Sounds rather faddish for a belief system.\n \n \nInsofar as that I can actually verify scientific work to see if it?s true. Or at least cross check it with other work. I don?t rely on people?s judgments of religious experience because no one other than that person knows what happened in that person?s head. How can I verify to see if their experience was real or not?\n\n \n You could ask them. After all, I believe the Beatles are great, and most people agree. Therefore they ARE great, because that's the test!\n \n \nthere is a LOT science has not explained. But that doesn?t mean it won?t. As technology advances our ability to observer the world increases. \n\n \n Faith in science again\n \n \nSubjective experiences can not be verified through science. Miracles, well it depends on the miracle. If it is someone suddenly healing from cancer because of a prayer, a study could be done to see how many cancer patients suddenly heal from cancer? then that could be checked against what religion they belong to, and how many people are praying for them.\n\n \n See below\n \n \nI tend to accept things as true with no direct experience under my belt if multiple sources report the same thing, and I tend to not believe what only one source claims (or is able to verify).\n\n \n Not all miracles are experiential. Some, such as the miracle cure fo a cancer can be tested. If doctors say someone has no hope at all, because of the extent of cancer, then wowee! the cancer goes away, then that can be tested. And they have, that's why the Catholic Church will declare something miraculous.\n \n There's a number of Catholics reading this who'd know more about it. I wish they'd not remain silent\n \n \nIt?s a belief system that doesn?t make a decision on god one way or the other. It?s like there is a treasure chest in a cage possibly containing a treasure. Science doesn?t assume the treasure chest is empty? they just say ?well as long as it?s in that cage that we can?t get into, we can?t make a decision one way or the other if there is treasure in it.\n\n \n If only.", 
   {}, 
   16908, 
   null, 
   1064361120.0
  ], 
  [
   16972, 
   null, 
   "TheoMorphic", 
   "Yes, you have faith in science. Despite its limitations. Is your 'faith' in science testable?\n \n Faith in science again\n\n \n I have \"faith\" in science that it will explain many thing not understood today because it has done exactly that in the past. Science has been able to explain how snowflakes form, why the days get longer in the summer, why people have seizures, and what causes most diseases. I'de be a fool to say \"well, that's it, science has finished being useful. They won't be able to explain anything else\". Instead I say \"Science will still be able to explain many inexplicable thing we see today (not all, or maybe even not most... but many).\"\n \n \nSee above. You recognise that these things exist, based on no science... the 'greatness' of the Beatles, as it is a subjective experience can never be explained by science, so you say below with regards to miracles.\n \n So now we have something wholly based on experience, that you agree exists, that science can never explain, that is the truth.\n\n \n Look, from a human perspective I can make judgments on things that require opinions. I can hear the Beatles for myself. I can be moved by them. I can ask other people what they thought of the Beatles, and why the harmonics, and rhythm, and message was so powerful. Religious experiences can not be experienced in such depth. All I can do is ask someone \"did you have a religious experience?\", and I have to take their word for it. I don't have any religious experiences to compare his or her experience to... unlike the Beatles where I can listen to them and think \"ahh, yeah I see where this person is coming from.\"\n \n Opinions, social matters, morals, and ethics are all outside the bounds of science. Just because science can't explain it doesn't mean it's not there. But before you jump all over that, just because science can't explain it doesn't mean it IS there either. And since I have seen no evidence to support the existence of any god, I simply leave it at that. I have seen no evidence for the existence of a god. \n \n \nThey can't devise objective tests if their raison d'etre is to prove the other wrong.\n \n So, again, what % makes it right? Some will in deed lose support, some will re-gain support, so effectively, what is right now, might be wrong next day, and then next year is right again. Sounds rather faddish for a belief system.\n\n \n Overwhelming support from evidence makes it \"right\". And you CAN have objective tests even though the individual is biased. If they cheat on their tests, or the bias seeps into their work, then when other scientists try to verify the work they will say \"look dude, you did something wrong\" and the evidence they found won't support them anymore (it won't exist any more). \n \n \nYou could ask them. After all, I believe the Beatles are great, and most people agree. Therefore they ARE great, because that's the test!\n\n \n So popular opinion makes it true in matters that science won't touch? What is the most common religion in the world?\n \n \nNot all miracles are experiential. Some, such as the miracle cure fo a cancer can be tested. If doctors say someone has no hope at all, because of the extent of cancer, then wowee! the cancer goes away, then that can be tested. And they have, that's why the Catholic Church will declare something miraculous.\n \n There's a number of Catholics reading this who'd know more about it. I wish they'd not remain silent\n\n \n Occams razor tells us to, at first, not consider needlessly complex parts of a system. So we have two ideas. 1) (yours) Sometimes God decides to heal cancer sick patients... when he does this it is inexplicable, and a miracle. 2) (mine) some percentage of cancer patients inexplicably heal from cancer for no cause, other than it's random. The outcome of both of these ideas are exactly the same (in that some people who are prayed for do not get healed, and some patients who are not prayed for do get healed). Which one is right? They could both be right since the outcomes are the same (connected to given the exact same outcome for 2 situations, how could you tell the difference?). Occams razor tells us to not assume the existence of god, and to instead do tests to discover how random the healings are, who gets healed, what religion they belong to, how many people were praying for them... etc. \n \n And it's very bad form to rely on other people to find supporting evidence for you. If you think it's out there, go get it. \n \n \nIf only.\n\n \n if only what? When the scientists walk by the cage they see people on the outside saying they saw inside the treasure chest? What if several different people say they saw different things inside the treasure chest?\n \n (do you actually get this analogy, or is it flying way over your head?)", 
   {
    "unicode_changes_made": true
   }, 
   16968, 
   null, 
   1064363100.0
  ], 
  [
   16981, 
   null, 
   "montalban", 
   "Look, from a human perspective I can make judgments on things that require opinions. I can hear the Beatles for myself. I can be moved by them. I can ask other people what they thought of the Beatles, and why the harmonics, and rhythm, and message was so powerful. Religious experiences can not be experienced in such depth. All I can do is ask someone ?did you have a religious experience??, and I have to take their word for it. I don?t have any religious experiences to compare his or her experience to? unlike the Beatles where I can listen to them and think ?ahh, yeah I see where this person is coming from.?\n\n \n Yes, the Beatles and God are two different experiences. But then you don't believe in God anyway (see below)\n \n \nOpinions, social matters, morals, and ethics are all outside the bounds of science. Just because science can?t explain it doesn?t mean it?s not there. But before you jump all over that, just because science can?t explain it doesn?t mean it IS there either. And since I have seen no evidence to support the existence of any god, I simply leave it at that. I have seen no evidence for the existence of a god. \n\n \n You can't see evidence for the existence of God, because you've already\n a) denied personal experience/witness testimony\n b) shown that science can't/shouldn't deal with the super-natural\n \n It's like saying \"I'm only going to judge things by what I can touch\" and then closing your eyes denying that the moon is because you won't open your eyes... you wait until you can touch it. And all the testimony by me and others to tell you that we see it, you'll keep saying \"Prove it to me by the methods I have determined to judge things by\"\n \n However, you've chosen, despite your own rule of thumb, to believe in ethics, morals etc.\n \n \nOverwhelming support from evidence makes it ?right?. And you CAN have objective tests even though the individual is biased. If they cheat on their tests, or the bias seeps into their work, then when other scientists try to verify the work they will say ?look dude, you did something wrong? and the evidence they found won?t support them anymore (it won?t exist any more). \n\n \n Semiotics argues against that statement about objective tests.\n \n \nSo popular opinion makes it true in matters that science won?t touch? What is the most common religion in the world?\n\n \n Christianity. But no, I was talking about the Beatles... and a judgment of what makes them 'great'.\n \n \nOccams razor tells us to, at first, not consider needlessly complex parts of a system. So we have two ideas. 1) (yours) Sometimes God decides to heal cancer sick patients? when he does this it is inexplicable, and a miracle. 2) (mine) some percentage of cancer patients inexplicably heal from cancer for no cause, other than it?s random. The outcome of both of these ideas are exactly the same (in that some people who are prayed for do not get healed, and some patients who are not prayed for do get healed). Which one is right? They could both be right since the outcomes are the same (connected to given the exact same outcome for 2 situations, how could you tell the difference?). Occams razor tells us to not assume the existence of god, and to instead do tests to discover how random the healings are, who gets healed, what religion they belong to, how many people were praying for them? etc. \n \n And it?s very bad form to rely on other people to find supporting evidence for you. If you think it?s out there, go get it. \n\n \n Occam was a Christian monk. How ironic.\n \n Taken out of real life this seems to make sense. However, when you see a hundred people all with different types of malladies, going to Lourdes, and all coming away healed, and that many times the healing is instantaneous, then pure statistical chance seems rather naive\n \n I believe Hindus too when they say they are healed. So I don't know what your point is.\n \n The Devil is a great deceiver, sometimes he will 'cure' people in order to deceive them.\n \n \nif only what?\n\n \n If only they would keep to science!", 
   {}, 
   16972, 
   null, 
   1064365440.0
  ], 
  [
   16994, 
   null, 
   "TheoMorphic", 
   "It's like saying \"I'm only going to judge things by what I can touch\" and then closing your eyes denying that the moon is because you won't open your eyes... you wait until you can touch it. And all the testimony by me and others to tell you that we see it, you'll keep saying \"Prove it to me by the methods I have determined to judge things by\"\n\n \n This \"opening of eyes\" is putting blind faith in the existence of something (you don't need personal testimony to believe... right?). So if I were to actually open my eyes, and expect to see a moon... I could see a light bulb, and call it the moon... or the sun, and call it the moon... or a paper plate floating above my head and call it the moon. \n \n As for all the personal testimony I'm ignoring... some are saying there is a moon, but some are saying it is really a block of cheese, and some are saying \"err... I don't see a moon\" and other are saying \"my eyes are closed too, don't listen to me\".\n \n How can I listen to testimony if it doesn't even come close to agreeing on one thing? Should I listed to you to filter out all the bad testimony? \n \n \nHowever, you've chosen, despite your own rule of thumb, to believe in ethics, morals etc.\n\n \n I've felt ethics and morals. However I don't try to present my feelings as scientific evidence, or even evidence to anyone to believe what I believe, or have the same morals as me.\n \n \nSemiotics argues against that statement about objective tests.\n \n \n ahh semiotics again... care to explain how the study of signs and pictures says there are no objective tests?\n \n \nTaken out of real life this seems to make sense. However, when you see a hundred people all with different types of malladies, going to Lourdes, and all coming away healed, and that many times the healing is instantaneous, then pure statistical chance seems rather naïve\n\n \n all coming away healed? Care to provide any other evidence this happened? I'm sure someone must have taken notice if it's that reliable. Has an experiment been conducted to take into account the placebo effect.\n \n \nThe Devil is a great deceiver, sometimes he will 'cure' people in order to deceive them.\n\n \n and of course it's not possible that the devil could be deceiving you.\n \n \nIf only they would keep to science!\n\n \n Scientists do. But you keep saying these people who claim they saw something in the chest should be taken as evidence.", 
   {
    "unicode_changes_made": true
   }, 
   16981, 
   null, 
   1064368560.0
  ], 
  [
   17080, 
   null, 
   "montalban", 
   "Quote:ahh semiotics again? care to explain how the study of \n signs and pictures says there are no objective tests?\n \n \n \n \n It would the moment you put pen to paper.\n \n When I did a post-grad course in teaching English I had to devise a lesson. At the end of each question I put two solid lines; space for the answers.\n \n I was told not to, because it's making the expectation that the answer should in fact, take up all that space.\n \n The way I had set out the lesson on paper was just as important as preparing it's structure.\n \n The fact that we all use smilies here and there is usually for reasons relating to smeiotics, to punctuate points.\n \n \n \n \n \n \n And by the way, as you said you were laughing at me in a previous thread, I see now no reason to restrain my natural urges to retaliate in kind.\n \n Such is the method of argument that you have chosen! Which itself shows levels of semiotics.", 
   {}, 
   16994, 
   null, 
   1064412900.0
  ], 
  [
   17121, 
   null, 
   "TheoMorphic", 
   "I don't see how any of that related to objective tests. maybe that people interpret lines on a piece of paper differently... but that isn't a test or evidence. But no one denies the lines are actually on the paper. \n \n please explain in more detail how semiotics tells us there is no objective evidence.", 
   {}, 
   17080, 
   null, 
   1064428980.0
  ], 
  [
   17221, 
   null, 
   "montalban", 
   "I don't see how any of that related to objective tests. maybe that people interpret lines on a piece of paper differently... but that isn't a test or evidence. But no one denies the lines are actually on the paper. \n \n please explain in more detail how semiotics tells us there is no objective evidence.\n\n \n Cleary if I am testing them, and they each interpret the form of the test differently, then that will affect the test. The way I'd structured the test affected the type of answers I'd get... because of the expectation I'd have created unintentionally upon my students.\n \n Likewise, consider the studies into IQ tests which are shown to be culturally biased, based on the questions that they ask.\n \n If you gave a standard IQ test to a Bushman of the Khallihari you'd conclude, based on the results of the test, that the bloke was sub-normal. Thus the 'objective test' that the IQ test is supposed to be, is actually quite relative.\n \n This is actually leaving semiotics, which does concern itself more with the signs and symbols, the layout etc. However, clearly the IQ test was established to make meaningful comparisons of intelligence. That is why they have a standard... so that they can compare your results to mine based on the same test.\n \n A better analogy perhaps;\n That Miller-Urey test for abiogenesis.\n Miller hypothesised about the conditions that existed in the pre-life world, in order to see if he could get amino acids, or whatever to form.\n \n As Behe countered; it was akin to a chef saying \"I wonder how a chocolate cake might come about - what if I take cake mix, water, eggs, etc, and add some energy (heat) voila! A cake!\"\n Nothing miraculous there in the kitchen, the test got what you'd created!\n \n This might be a poorer analogy\n At school I'd set up a test for separating oil from water based on the different boiling points/evaporation points of the two. I asked the lab assistant to turn the apparatus on. When the two markers came in to test it, it wasn't ready. I actually got marked down for not actually 'proving' anything... because it wasn't working.\n \n The assessment of me was based on a test that would have worked, had they only had the patience to see it.\n \n \n Perhaps you can come up with an 'objective test'. I can't think of any, but that doesn't mean much.\n \n Just for fun I typed 'objective test' into ixquick search engine. One of the first responses was (http://www.columbialab.com/products/j4alert.shtml) a breath-tester. It immediately claims to be 'objective', I suppose in a sense it is as it gives a result without making a judgment, though the result will be varied, depending on if the testee has had mouthwash or not... which some police services will recognise can give varied and inaccurate results.", 
   {}, 
   17121, 
   null, 
   1064484120.0
  ], 
  [
   17224, 
   null, 
   "TheoMorphic", 
   "some personal bias may effect the results of the test, but as soon as other try to verify the test, the nature of the test is realized. \n \n If someone were fudging their results, or trying to see what they wanted to see, then when other experiments were conducted the same results would not be found. \n \n Tests in science are objective and verifiable because if someone conducts the tests in the exact same way, you get the exact same results. \n \n personal experiences are not objective because they are PERSONAL. whether they are real or not, they only exist in the person's head. no amount of documentation can verify if the experience is real or not (any documentation would stem from the person's personal experiences).", 
   {}, 
   17221, 
   null, 
   1064486400.0
  ], 
  [
   17243, 
   null, 
   "montalban", 
   "some personal bias may effect the results of the test, but as soon as other try to verify the test, the nature of the test is realized. \n \n If someone were fudging their results, or trying to see what they wanted to see, then when other experiments were conducted the same results would not be found. \n \n Tests in science are objective and verifiable because if someone conducts the tests in the exact same way, you get the exact same results. \n\n \n Not if everyone had an a priori belief. Although not a test - but an endeavour; and itself not testable - I mentioned about Crick's search for truth behind abiogenesis. He'd already ruled out God, so he came up with 'aliens', as the best option based on the evidence he had.\n \n \npersonal experiences are not objective because they are PERSONAL. whether they are real or not, they only exist in the person's head. no amount of documentation can verify if the experience is real or not (any documentation would stem from the person's personal experiences).\n\n \n I have no problem in saying that personal experiences are subjective. What I did say was the Roman Catholic Church does conduct scientific tests into miracles*... not just cures, there's also apparitions, crying statues, bodies that don't decompose etc.\n \n One of the more famous being in relation to Our Lady of Guadalupe - Patroness of the Americas\n http://www.sancta.org/nican.html (see under aspiration). This aspiration is not just a vision, but has left physical evidence; in the form of a photo-like image on an item of cloth.\n \n \n A 'miracle' is defined by them at http://www.newadvent.org/cathen/10338a.htm\n \n I've no idea what constitutes a miracle for Orthodoxy!", 
   {}, 
   17224, 
   null, 
   1064502960.0
  ], 
  [
   17296, 
   null, 
   "TheoMorphic", 
   "Not if everyone had an a priori belief. Although not a test - but an endeavour; and itself not testable - I mentioned about Crick's search for truth behind abiogenesis. He'd already ruled out God, so he came up with 'aliens', as the best option based on the evidence he had.\n\n \n Behe mentioned the possibility of aliens in his book... are you going to be consistent and say he had an a prior belief too?\n \n Are you complaining about ALL of science in that it assumes there is no God, and then goes about to prove how thing could have happened with out him? Or is your only complaint about abiogenesis (why not evolution). And does this complaint extend to every person who is working for abiogenesis, or just crik? \n \n 1) evolution does not depend on abiogenesis to be true,\n 2) The conditions of early earth have to be guesses.\n 3) What the fist self replicating molecules could have been is also a wild guess.\n If Crik attributes the first self replicating molecules to aliens, he would have to provide positive proof as to why he thinks that... until he does it's just his opinion. And tests he conducts and publishes will be open to peer review, and then the bias (if it seeped into his work) will be shown for what it is. \n \n \n \nI have no problem in saying that personal experiences are subjective. What I did say was the Roman Catholic Church does conduct scientific tests into miracles*... not just cures, there's also apparitions, crying statues, bodies that don't decompose etc.\n\n \n Would you mind quoting some of the site so that I know what you got out of it... It was long, so I just skimmed over it... but I found this:\n \n \"Hence, as soon as we have reason to suspect that any event, however uncommon or rare it appear, may arise from natural causes or be conformable to the usual course of nature, we immediately lose the conviction of its being a miracle.\"\n \n It looks a lot like a god of the gaps argument.\n \n Even if a lack of a natural explanation for an event was positive existence for god (either or reasoning/argument from ignorance) it wouldn't say WHICH god. Unexplained events happen to every religious denomination on the planet... should all miracles be taken at face value? You commented before that the devil deceives... and... well I got the idea that the devil does not deceive you.\n \n Does this mean he deceives every religious denomination that is not your own... if that is the case, isn't the devil doing way more healing than god?\n \n In order to present a miracle as positive existence for any particular god, you would have to show that it happens consistently, and disproportionately (more often to any one given religion, rather then equally to all). Until you do miracles will only be proof that unexplained things happen to everyone.", 
   {
    "unicode_changes_made": true
   }, 
   17243, 
   null, 
   1064515320.0
  ], 
  [
   18156, 
   null, 
   "montalban", 
   "Are you complaining about ALL of science in that it assumes there is no God, and then goes about to prove how thing could have happened with out him? Or is your only complaint about abiogenesis (why not evolution). And does this complaint extend to every person who is working for abiogenesis, or just crik? \n\n \n I am not against true science. True science is not anti-Christian. Evolutionary theory is anti-Christian\n \n \nEven if a lack of a natural explanation for an event was positive existence for god (either or reasoning/argument from ignorance) it wouldn?t say WHICH god. Unexplained events happen to every religious denomination on the planet? should all miracles be taken at face value? You commented before that the devil deceives? and? well I got the idea that the devil does not deceive you.\n\n \n I never made any comment upon my own deceptions/lack of. However, you're talking past your own point now. You would claim that no miracles can be attributed to the supernatural. If you were to admit to just one miracle being super-natural, regardless of whether it is performed by God, or a pantheon of gods, then your whole world basis would fall apart.\n \n \nDoes this mean he deceives every religious denomination that is not your own? if that is the case, isn?t the devil doing way more healing than god?\n\n \n You're assuming you know what 'healing' is! If I bring you into slavery but feed clothe, educate you, you'd put that down as healing. It is the ultimate goal of Satan to deceive. If he gives a little sugar out, that doesn't mean people are healed.\n \n \nIn order to present a miracle as positive existence for any particular god, you would have to show that it happens consistently, and disproportionately (more often to any one given religion, rather then equally to all). Until you do miracles will only be proof that unexplained things happen to everyone.\n\n \n I told you already that miracles have happened over the course of human history. All miracles combined point to super-natural causes. You simply keep mixing things up between does it prove God, does it prove gods? You need to work at this one step at a time. First, can miracles be attributed to a supernatural being?", 
   {}, 
   17296, 
   null, 
   1065258060.0
  ], 
  [
   18174, 
   null, 
   "TheoMorphic", 
   "I am not against true science. True science is not anti-Christian. Evolutionary theory is anti-Christian\n\n \n just to clarify, is \"true science\" any practice so long as it is not \"anti-Christian\", or is it any process that follows the scientific method and is not \"anti-Christian\". Either way that is a wholly unscientific way to go about studying the natural world. Assume you have the answers before looking at the evidence? (or giving that miracles, the bible, and holy documents are evidence: assuming that any evidence found in the natural world that contradicts these three things is false, or twist the evidence to support the bible/miracles/holy documents). \n \n \nYou would claim that no miracles can be attributed to the supernatural. If you were to admit to just one miracle being super-natural, regardless of whether it is performed by God, or a pantheon of gods, then your whole world basis would fall apart.\n\n \n Sure it's possible miracles are due to supernatural powers... but it's also possible that they are unexplained events that we just don't know the cause of yet... hell we may never know the cause. But they are still unexplained events. \n \n And well I don't know about falling apart. But what's to stop me from concluding that other events in my life are better explained by exceedingly complex/unseen things? \n \n \nYou're assuming you know what 'healing' is! If I bring you into slavery but feed clothe, educate you, you'd put that down as healing. It is the ultimate goal of Satan to deceive. If he gives a little sugar out, that doesn't mean people are healed.\n\n \n I don't quite get this analogy. I'm assuming healing is the miraculous curing of diseases and cancer and whatnot. If you see healing as being brought into the light of Christianity... well how do you know that is actual healing?\n \n \nI told you already that miracles have happened over the course of human history. All miracles combined point to super-natural causes. You simply keep mixing things up between does it prove God, does it prove gods? You need to work at this one step at a time.\n\n \n either way you won't get very far. Since miracles happen to every religious group (including non religious groups) miracles can't be used to prove any 1 god... or at least any one god preferring any one religion over another. And 2) since these miracles have always been with us why assume a god is responsible? We don't know how many of these miracles are due to divine intervention (if any). Why assume there is a god pulling the strings when random chance can explain the exact same thing with fewer moving parts? \n \n If you take a million people and had them all flip a coin, about 50 % would be expected to get heads. Take whoever got heads and have them flip their coin again. Again 50 % are expected to arrive at heads. At first so what... but by the time everyone flips a tail you will probably have someone who has flipped 20 heads in a row. Were the stars aligned just right for this person? was it an act of god? Did he have his lucky rabbit's foot? No... it would be an even greater coincidence if you DIDN'T have several dozen people tossing 15 heads in a row. \n \n \nFirst, can miracles be attributed to a supernatural being?\n\n \n but... I'll see where you are going with this. Yes, miracles can be attributed to a supernatural being (that is one possibility).", 
   {
    "unicode_changes_made": true
   }, 
   18156, 
   null, 
   1065272220.0
  ], 
  [
   18179, 
   null, 
   "montalban", 
   "I am not against true science. True science is not anti-Christian. Evolutionary theory is anti-Christian\n\n \n \njust to clarify, is ?true science? any practice so long as it is not ?anti-Christian?, or is it any process that follows the scientific method and is not ?anti-Christian?. Either way that is a wholly unscientific way to go about studying the natural world. Assume you have the answers before looking at the evidence? (or giving that miracles, the bible, and holy documents are evidence: assuming that any evidence found in the natural world that contradicts these three things is false, or twist the evidence to support the bible/miracles/holy documents)\n\n \n Religious truth and scientific truth won't contradict.\n \n \nYou would claim that no miracles can be attributed to the supernatural. If you were to admit to just one miracle being super-natural, regardless of whether it is performed by God, or a pantheon of gods, then your whole world basis would fall apart.\n\n \n \nSure it?s possible miracles are due to supernatural powers? but it?s also possible that they are unexplained events that we just don?t know the cause of yet? hell we may never know the cause. But they are still unexplained events. \n And well I don?t know about falling apart. But what?s to stop me from concluding that other events in my life are better explained by exceedingly complex/unseen things?\n\n \n There's slight of hand at foot. Are you saying now you believe in the super-natural? I thought you'd just spent days believing only what science can explain, and a few added perceptions such as love?\n \n Are you becoming religious? No, but you're not really saying that you believe miracles do happen, just that they might somewhere some day.\n \n [QUOTE=Montalban]You're assuming you know what 'healing' is! If I bring you into slavery but feed clothe, educate you, you'd put that down as healing. It is the ultimate goal of Satan to deceive. If he gives a little sugar out, that doesn't mean people are healed.\n \n \nI don?t quite get this analogy. I?m assuming healing is the miraculous curing of diseases and cancer and whatnot. If you see healing as being brought into the light of Christianity? well how do you know that is actual healing?\n\n \n When the Nazis occupied Europe, they treated PoWs from Western nations comparatively well. Treating them well did not make them saints. If the devil 'heals' someone physically it is a small price to pay to get their soul.\n \n \n \nI told you already that miracles have happened over the course of human history. All miracles combined point to super-natural causes. You simply keep mixing things up between does it prove God, does it prove gods? You need to work at this one step at a time.\n\n \n \neither way you won?t get very far. Since miracles happen to every religious group (including non religious groups) miracles can?t be used to prove any 1 god? or at least any one god preferring any one religion over another. And 2) since these miracles have always been with us why assume a god is responsible? We don?t know how many of these miracles are due to divine intervention (if any). Why assume there is a god pulling the strings when random chance can explain the exact same thing with fewer moving parts? \n If you take a million people and had them all flip a coin, about 50 % would be expected to get heads. Take whoever got heads and have them flip their coin again. Again 50 % are expected to arrive at heads. At first so what? but by the time everyone flips a tail you will probably have someone who has flipped 20 heads in a row. Were the stars aligned just right for this person? was it an act of god? Did he have his lucky rabbit?s foot? No? it would be an even greater coincidence if you DIDN?T have several dozen people tossing 15 heads in a row.\n\n \n I'm not trying to prove to you any one God. I'm trying to see if you'll actually say miracles do actually happen (in a super-natural sense), but instead you keep spinning away.\n \n You don't know what a miracle is! It's not random chance. You're thinking of a miracle as if you win the lottery and declare, despite the odds, it's a miracle I've won. Or even of a miracle cure, you might even say that every 1 in a 1,000,000 will make a strange recovery from cancer. Nor am I talking about 'the miracle of life'. The problem with modernity is that these words are bandied about so often.* Though some cures are miracles, I'm talking about other miracles... \n \n Check out a real miracle at http://www.sancta.org/intro.html\n But if you're lazy...\n There is a garment that has the image of Mary miraculously on it. It even has in her eyes, a reflection of the people looking at the garment when the image first appeared. The image is photographic in a sense, but it is hundreds of years old. The image is not painted onto the garment, nor is it weaved on. The garment still exists\n \n There are other miracles such as Stigmata (http://www.newadvent.org/cathen/14294b.htm)\n \n \n For a comprehensive definition go to http://www.newadvent.org/cathen/10338a.htm", 
   {}, 
   18174, 
   null, 
   1065275880.0
  ], 
  [
   18183, 
   null, 
   "TheoMorphic", 
   "Religious truth and scientific truth won't contradict.\n\n \n if they seemingly contradict each other, which is wrong?\n \n \nThere's slight of hand at foot. Are you saying now you believe in the super-natural? I thought you'd just spent days believing only what science can explain, and a few added perceptions such as love?\n\n \n what is wrong with you? I'm not ruling out the possibility of divine intervention... but it's along the same lines of probability as alien abductions, haunted houses, mediums that contact loved ones from beyond the grave, and psychics. Any of these things could be possible, but in lack of supporting evidence (anecdotal does not count) I'm going to try to find natural explanations. \n \n \nAre you becoming religious? No, but you're not really saying that you believe miracles do happen, just that they might somewhere some day.\n\n \n yup... and someday, somewhere all the wrist watched of the world might bite of their owner's hands. \n \n \nWhen the Nazis occupied Europe, they treated PoWs from Western nations comparatively well. Treating them well did not make them saints. If the devil 'heals' someone physically it is a small price to pay to get their soul.\n\n \n Do these people of other religions know they are selling their souls to be healed by the devil? \n \n \nThough some cures are miracles, I'm talking about other miracles... \n\n \n how do you tell cures that are miracles apart from cures due to random chance?\n \n As for the other sites, it's late and I'm tired. I'll read them tomorrow and give them the attention that you think they deserve. \n \n But just real quick, make sure these miracles happen uniquely with your religion... otherwise you can't provide them as proof that your religion is true with out admitting other similar events as evidence that another religion is true.", 
   {
    "unicode_changes_made": true
   }, 
   18179, 
   null, 
   1065277500.0
  ], 
  [
   18199, 
   null, 
   "TheoMorphic", 
   "Check out a real miracle at http://www.sancta.org/intro.html\n\n \n http://www.csicop.org/sb/2002-06/guadalupe.html\n \n I'm not saying this site with out a doubt proves how the lady of Guadalupe was created naturally, but it has just as much evidence as other sites I've found. I could not find any sties that described a study of the tilma. All I saw were religious oriented sites proclaiming that several scientists couldn't explain the garment (the same scientists for all pages).\n \n I admit that the appearance of the painting is incredible as long as there was no way to produce the image, and ensure longevity at the time of it's creation. However since it seems like most websites are offering this image as religious proof, and not scientific proof you're somewhat alone in the fight for getting science to admit that it's limitations are detrimental to understanding the world. \n \n As for the people in the eyes... do you have some pictures of the actual people? I found 2, but one of them didn't like part of the picture at all, and the other just looked like a couple white blobs. Several web sites say the same people are found in both eyes but in slightly different positions. I'd really like to see a comparison of these pictures... but I really doubt they would be very convincing. Are you sure these people in the eyes are meant to be people, and not just shapes that humans wanted to see?\n \n \nThere are other miracles such as Stigmata (http://www.newadvent.org/cathen/14294b.htm)\n\n \n but how many are actual cases that are not cased by self mutilation? How many cases of the perceived pain are actually psychological in nature? Granted sometimes it's unexplainable... but how many similar wounds happen to Christians that are not in the religiously significant places? How many similar wounds and random pangs of pain occur to non Christians?\n \n \"However, newer archaeological research shows that nails were more likely driven into the wrists of the crucified, where the arms' bone structure would better support the weight of the body, Martinez said.\n More recent stigmatics have had wounds in their wrists instead of in their hands, Martinez said.\"\n  http://www.tennessean.com/local/archives/02/07/20134669.shtml?Element_ID=2013466\\\n \nFor a comprehensive definition go to http://www.newadvent.org/cathen/10338a.htm\n\n \n I'm having trouble getting through this one. It's long a dry. Care to point out how miracles are more than just seemingly improbable events? And how there is a static way to gauge if an event is a miracle (a \"miracles\" that ceases to be a miracles when a natural process is shown to be the likely cause is simply a god of the gaps argument)?", 
   {
    "unicode_changes_made": true
   }, 
   18183, 
   null, 
   1065307560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Religon and Science", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1014-religon-science.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 1014, 
  "discussion_files": [
   [
    "20231.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1014-religon-science-print.html"
   ], 
   [
    "20232.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1014-religon-science-3-print.html"
   ], 
   [
    "20233.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1014-religon-science-2-print.html"
   ]
  ], 
  "identifier": 1014
 }
]