[
 [
  [
   275259, 
   null, 
   "simone", 
   "The Higgs boson? A bump in data?", 
   {
    "post_info": {
     "post_title": "The God Particle?"
    }
   }, 
   null, 
   null, 
   1185296220.0
  ], 
  [
   275313, 
   null, 
   "Ripskar", 
   "http://www.newscientist.com/channel/fundamentals/mg19325934.600-higgs-boson-glimpses-of-the-god-particle.html%7C\n \n What about it?", 
   {}, 
   275259, 
   null, 
   1185312060.0
  ], 
  [
   275327, 
   null, 
   "Jo Bennett", 
   "The more I know about particle physics, the more I'm convinced it is one of those frontiers of science where the difference between the actual theories and stoned postdocs making stuff up is paper thin. One of the supersymmetric particles posited is the wino for crying out loud...", 
   {}, 
   275313, 
   null, 
   1185314820.0
  ], 
  [
   275459, 
   null, 
   "simone", 
   "What? You don't believe in stuff that goes bump in the night?\n \n Or bump in the waves of the universe?", 
   {}, 
   275327, 
   null, 
   1185388620.0
  ], 
  [
   275476, 
   null, 
   "Jo Bennett", 
   "I'm sure many things go bump in the night, I'm just not convinced that the standard model is going to survive the next 50 years.", 
   {}, 
   275459, 
   null, 
   1185394980.0
  ], 
  [
   276031, 
   null, 
   "Liminus", 
   "Jo, maybe you can help me out here:\n \n Just where exactly are the 'superpartners' supposed to be? (I can't find the answer to this anywhere)\n \n and (if you can comment; I don't know what your field is)\n \n Do you see the standard model being merely improved upon, or blown out of the water?\n \n I ask because I agree with you that while a lot of physicists are very excited about this stuff, it seems to be the area of physics least concerned with actual observational data. Apparently some of these questions will be answered when they finally get the LHC going, but other than that, much of what I've read about contemporary particle physics seems to resemble not much more than extended self-examination of the rectal areas on the part of the theorists!", 
   {}, 
   275476, 
   null, 
   1186018680.0
  ], 
  [
   276047, 
   null, 
   "Jo Bennett", 
   "My understanding is that the supersymmetric partners are expected to be found at higher mass-energies - starting just beyond the range of the currently active colliders. This is part of the reason I suspect the theory of being a bit dodgy, it smacks of \"well, if you give us another 10 billion for this much bigger collider we'll know EVERYTHING\". Now I'm the first to admit my knowledge of advanced particle physics is fairly limited - one bachelors and one masters level course in my undergrad degree a couple of years ago, but the impression is very much that the standard model has serious problems. The biggest of these is of course the quantum gravity issue - the fact that general relativity and the standard model don't currently match up. More directly challenging is that fact that the model assumes massless neutrinos, which we know not to be the case (they have small but non-zero masses). I would suspect that the standard model will survive in some form and be heavily ammended to fit the current evidence, until someone comes up with a new model that simplifies everything again. An appropriate comparison might be the geocentric versus heliocentric models with all the ptolemaic epicycles and what not, there is probably something fundamental we are missing that will suddenly make everything make sense. It might be that supersymmetry holds the answer, might be string theory, might be something nobody's thought of yet. As I say I'm no expert in the field, my specialism is newtonian mechanics (that's the other alternative of course; that the standard model remains important but gets displaced in certain applications by something more accurate).\n \n My faith in particle physics was not restored by hearing that one particular feynman diagram achieved a particular shape and label as a result of a bet between particle physicists that one of them couldn't get the word \"penguin\" into a scientific paper. :xbanghead One example can be found here:\n http://asymptotia.com/wp-images/2007/05/penguin_diagram.jpg", 
   {}, 
   276031, 
   null, 
   1186055700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The God Particle?", 
  "url": "http://www.4forums.com/political/science-math-debates/10155-god-particle.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 10155, 
  "discussion_files": [
   [
    "22651.html", 
    "http://www.4forums.com/political/science-math-debates/10155-god-particle-print.html"
   ]
  ], 
  "identifier": 10155
 }
]