[
 [
  [
   275785, 
   null, 
   "Phyllis", 
   "MSNBC has an article examining what penalties should be given to a women who has an abortion if the law were to criminalize it.\n \n http://www.msnbc.msn.com/id/20010696/site/newsweek/\n \n Read and discuss if you like.\n \n I, for one, do not see the issue as being only between two options, as I think the author of the article seems to suggest. I'll await the input of others before I elaborate more.", 
   {
    "post_info": {
     "post_title": "How Much Jail Time?"
    }
   }, 
   null, 
   null, 
   1185842040.0
  ], 
  [
   275787, 
   null, 
   "snakespit", 
   "Personally, I don't see why it should be even debated. Abortion is legal...for now. Kinda one of those cross that bridge if we get there type of things.\n \n One thing that did catch my attention.\n \n Such a view seemed to be a vestige of the past until the Supreme Court handed down its most recent abortion decision upholding a federal prohibition on a specific procedure. Justice Anthony Kennedy, obviously feeling excessively paternal, argued that the ban protected women from themselves. \"While we find no reliable data to measure the phenomenon,\" he wrote, \"it seems unexceptionable to conclude some women come to regret their choice to abort the infant life they once created and sustained.\" Even with \"no reliable data,\" he went on to conclude that \"severe depression and loss of esteem can follow.\" (Apparently, no one has told Justice Kennedy about the severe depression and loss of esteem that can follow bearing and raising a baby you can't afford and didn't want.) Luckily, there still remains one justice on the court who has actually been pregnant, and Ruth Bader Ginsburg roared back with a dissent that called Kennedy's caveat about regret an \"anti-abortion shibboleth\" and his opinion a reflection of \"ancient notions about women's place in the family and under the Constitution-ideas that have long since been discredited.\"\n \n Is Justice Kennedy saying that we should legislate against acts that people may later regret? \n \n If this is the line of thinking of our highest judicial minds, I'm not impressed. I'm sorry, but it's buyer beware. If I make a choice that I later regret, that's my business, not the governments. A little too \"big brother\" for my taste.", 
   {
    "unicode_changes_made": true
   }, 
   275785, 
   null, 
   1185843240.0
  ], 
  [
   275788, 
   null, 
   "Jo Bennett", 
   "Surely if one believes that the fetus is fully human, then you must consider abortion to be 1st degree murder on the part of the woman concerned and the doctor performing the procedure. Given how many pro-lifers are also pro death penalty it would be reasonable to expect them to call for the death penalty in such cases, or at least life imprisonment. Alternatively they can admit that the life of the fetus is not equal to the life of a born human.", 
   {}, 
   275787, 
   null, 
   1185845340.0
  ], 
  [
   275790, 
   null, 
   "thelmoose", 
   "Surely if one believes that the fetus is fully human, then you must consider abortion to be 1st degree murder on the part of the woman concerned and the doctor performing the procedure. Given how many pro-lifers are also pro death penalty it would be reasonable to expect them to call for the death penalty in such cases, or at least life imprisonment. Alternatively they can admit that the life of the fetus is not equal to the life of a born human.\n\n \n Agree. If illegal, this should be treated as first degree murder for both mother and doctor, punishable by whatever penality is required in the jurisdiction. \n \n You can't continue to call abortion \"baby murder\" and then back down when it comes to punishing the murderers.", 
   {}, 
   275788, 
   null, 
   1185846840.0
  ], 
  [
   275808, 
   null, 
   "jitobear", 
   "I always thought that if it were criminalized the punishment would go to the doctors not the women.\n \n What if she left the country/state (depending on the laws) to get it done? Did something to induce miscarriage. Did it in privacy and just told people it was miscarriage (if she told them she was pregnant at all) It seems to be this would be really hard to prosecute.", 
   {}, 
   275790, 
   null, 
   1185899640.0
  ], 
  [
   275844, 
   null, 
   "Steeeeve", 
   "Personally, I don't see why it should be even debated. Abortion is legal...for now. Kinda one of those cross that bridge if we get there type of things.\n \n \n I agree with this. Penalties for breaking the law have never been consistent anyway so who knows what it should or would be. The penalty is not really issue.\n \n \nIs Justice Kennedy saying that we should legislate against acts that people may later regret? \nNo one claims justice Kennedy made an opinion that made any sense (or is even consistent with his other rulings). I do not see why we wouldn't sometimes legislate against actions people might later regret but this isn't exactly something a Justice should be telling us in an opinion. He is not the King.", 
   {}, 
   275787, 
   null, 
   1185907560.0
  ], 
  [
   275848, 
   null, 
   "JPSartre12", 
   "MSNBC has an article examining what penalties should be given to a women who has an abortion if the law were to criminalize it.\n \n http://www.msnbc.msn.com/id/20010696/site/newsweek/\n \n Read and discuss if you like.\n \n I, for one, do not see the issue as being only between two options, as I think the author of the article seems to suggest. I'll await the input of others before I elaborate more.\n\n \n If abortion is, once again, made illegal, then the states need to establish penalties. For non-medically needed partial birth abortions, I'd throw the woman and doctor in jail without a second thought. NEXT!!", 
   {}, 
   275785, 
   null, 
   1185908220.0
  ], 
  [
   275855, 
   null, 
   "jim's trucking", 
   "How about a slap on the wrist and a suspended three day jail term?\n \n Actually, a concensus on what the penalty should be is likely harder to attain than an agreement that it should be illegal.\n \n Should it ever become illegal again, I hope the penalty is no harsher than that actually meted out these days for rape. \n \n If we punish abortionists similarly as we do child-molesting priests, we'll simply move them to another venue and act like nothing happened.", 
   {}, 
   275848, 
   null, 
   1185909360.0
  ], 
  [
   275859, 
   null, 
   "thelmoose", 
   "I always thought that if it were criminalized the punishment would go to the doctors not the women.\n \n What if she left the country/state (depending on the laws) to get it done? Did something to induce miscarriage. Did it in privacy and just told people it was miscarriage (if she told them she was pregnant at all) It seems to be this would be really hard to prosecute.\n\n \n We need to think about this, then, before declaring something illegal. That seems to be the point of the article. \n \n I don't see why the mother should get off scot-free and leave the doc holding the bag. Murder for hire is first degree murder. \n \n \nI agree with this. Penalties for breaking the law have never been consistent anyway so who knows what it should or would be. The penalty is not really issue.\n \n\n \n If something is to be made illegal, the penalty is certainly the issue, otherwise, why make it illegal? And the point of this discussion is the penalty, so that makes it the issue here. Why should abortion be illegal? One reason is for something to be illegal is to deter it. How would you feel if the penalty was a $10 fine? \n \n The question is going out to you. What do you think the penalty ought to be? Specifically, for those that think abortion is infanticide, what do you think the penalty should be?\n \n \nIf abortion is, once again, made illegal, then the states need to establish penalties. For non-medically needed partial birth abortions, I'd throw the woman and doctor in jail without a second thought. NEXT!!\n\n \n But would you treat the crime similarly to first degree murder? Why or why not?", 
   {}, 
   275855, 
   null, 
   1185910200.0
  ], 
  [
   275860, 
   null, 
   "thelmoose", 
   "How about a slap on the wrist and a suspended three day jail term?\n \n Actually, a concensus on what the penalty should be is likely harder to attain than an agreement that it should be illegal.\n \n Should it ever become illegal again, I hope the penalty is no harsher than that actually meted out these days for rape. \n \n If we punish abortionists similarly as we do child-molesting priests, we'll simply move them to another venue and act like nothing happened.\n\n \n We needn't reach a consensus here and now. What is your opinion on the penalty?\n Perhaps the complaints about wimpy liberal judges and child molesting priests could be left to another thread.", 
   {}, 
   275855, 
   null, 
   1185910320.0
  ], 
  [
   275862, 
   null, 
   "jim's trucking", 
   "We needn't reach a consensus here and now. What is your opinion on the penalty?\n Perhaps the complaints about wimpy liberal judges and child molesting priests could be left to another thread.\nHow about a slap on the wrist and a suspended three day jail term?", 
   {}, 
   275860, 
   null, 
   1185911280.0
  ], 
  [
   275876, 
   null, 
   "thelmoose", 
   "How about a slap on the wrist and a suspended three day jail term?\n\n \n Oh, sorry, I didn't think that was a serious answer. Thanks.", 
   {}, 
   275862, 
   null, 
   1185916620.0
  ], 
  [
   275901, 
   null, 
   "thelmoose", 
   "By the way, here is the YouTube video upon which the Anna Quindlen article is based.", 
   {}, 
   275876, 
   null, 
   1185933540.0
  ], 
  [
   275906, 
   null, 
   "gman", 
   " \n One thing that did catch my attention.\n \n [/B](Apparently, no one has told Justice Kennedy about the severe depression and loss of esteem that can follow bearing and raising a baby you can't afford and didn't want.) Luckily, there still remains one justice on the court who has actually been pregnant, and Ruth Bader Ginsburg roared back with a dissent that called Kennedy's caveat about regret an \"anti-abortion shibboleth\" and his opinion a reflection of \"ancient notions about women's place in the family and under the Constitution-ideas that have long since been discredited.\"\n \n Is Justice Kennedy saying that we should legislate against acts that people may later regret? \n \n If this is the line of thinking of our highest judicial minds, I'm not impressed. I'm sorry, but it's buyer beware. If I make a choice that I later regret, that's my business, not the governments. A little too \"big brother\" for my taste.\n\n \n You take lightly the fact that your regrettable act involves more than just your own selfishness. Assuming that having sex carried with it no responsibility. Regret for difficult times brought about by permitting a child to live comes off as having the ability to sacrifice a life for not accepting the responsibilities that are the result of one's actions. A sad condition for our species.", 
   {
    "unicode_changes_made": true
   }, 
   275787, 
   null, 
   1185941760.0
  ], 
  [
   275909, 
   null, 
   "Symbiote", 
   "In english please.", 
   {}, 
   275906, 
   null, 
   1185955620.0
  ], 
  [
   275936, 
   null, 
   "Steeeeve", 
   "If something is to be made illegal, the penalty is certainly the issue, otherwise, why make it illegal? And the point of this discussion is the penalty, so that makes it the issue here. Why should abortion be illegal? One reason is for something to be illegal is to deter it. How would you feel if the penalty was a $10 fine? \n \n The question is going out to you. What do you think the penalty ought to be? Specifically, for those that think abortion is infanticide, what do you think the penalty should be?\nA reason to make something illegal is because it is wrong. My point is that it is wrong....seems we should think of a penalty after we establish abortion to be wrong.", 
   {}, 
   275859, 
   null, 
   1185986820.0
  ], 
  [
   275954, 
   null, 
   "thelmoose", 
   "A reason to make something illegal is because it is wrong. My point is that it is wrong....seems we should think of a penalty after we establish abortion to be wrong.\n\n \n I respect you opinion. I disagree, however. Establishing whether something is \"wrong\" is different from making it \"illegal\". A simple consideration of the penalty does not seem far-fetched if you desire to make something illegal. I am not a legislator, but I cannot imagine passing a law to make some activity illegal without writing a penalty into the statute, can you?\n \n No matter what, the point of this thread is to ask you what you think the penalty ought to be. What would be appropriate and why?\n \n Specifically, to all you who call abortion baby murder (who have been uncharacteristically silent), what is the appropriate penalty for this crime?", 
   {}, 
   275936, 
   null, 
   1185991860.0
  ], 
  [
   275982, 
   null, 
   "Sigma", 
   "\n Specifically, to all you who call abortion baby murder (who have been uncharacteristically silent), what is the appropriate penalty for this crime?\n\n \n If it were affirmed that abortion is morally and legally equivalent to murdering a newborn infant, it is logical that both penalties be comparable. Is murdering a newborn considered in the same way as murdering an adult? The death penalty would then apply in that case in some States.\n \n I'm unfamiliar with the laws regarding hiring a hitman to kill a family member, but I assume those may apply as well.", 
   {}, 
   275954, 
   null, 
   1186004760.0
  ], 
  [
   275991, 
   null, 
   "thelmoose", 
   "If it were affirmed that abortion is morally and legally equivalent to murdering a newborn infant, it is logical that both penalties be comparable. Is murdering a newborn considered in the same way as murdering an adult? The death penalty would then apply in that case in some States.\n \n I'm unfamiliar with the laws regarding hiring a hitman to kill a family member, but I assume those may apply as well.\n\n \n At least according to Law & Order (and I trust Elliott and Olivia), hiring a hitman is first degree murder. \n I don't know how one could \"affirm\" any two things as morally equivalent, but the legal equivalence has not been achieved. Short of that, if abortion were made illegal tomorrow, would you be in favor of those penalties?", 
   {}, 
   275982, 
   null, 
   1186006500.0
  ], 
  [
   275998, 
   null, 
   "Sigma", 
   "Short of that, if abortion were made illegal tomorrow, would you be in favor of those penalties?\n\n \n Since I could not and would not agree with the premise that a fetus and a newborn are equivalent in this way, I would not be in favor of such penalties. I would not be in favor of disallowing abortion in the first place, but I suppose that's a moot point ;)\n \n If, for the sake of the argument, I agreed with the pro-life position that a two week old embryo and a newborn were equivalent, I would be in favor of such penalities. There is no other logical position in that case.", 
   {}, 
   275991, 
   null, 
   1186007220.0
  ], 
  [
   276003, 
   null, 
   "thelmoose", 
   "Since I could not and would not agree with the premise that a fetus and a newborn are equivalent in this way, I would not be in favor of such penalties. I would not be in favor of disallowing abortion in the first place, but I suppose that's a moot point ;)\n \n If, for the sake of the argument, I agreed with the pro-life position that a two week old embryo and a newborn were equivalent, I would be in favor of such penalities. There is no other logical position in that case.\n\n \n I would agree with all you say.", 
   {}, 
   275998, 
   null, 
   1186008780.0
  ], 
  [
   276079, 
   null, 
   "Steeeeve", 
   "I respect you opinion. I disagree, however. Establishing whether something is \"wrong\" is different from making it \"illegal\". A simple consideration of the penalty does not seem far-fetched if you desire to make something illegal. I am not a legislator, but I cannot imagine passing a law to make some activity illegal without writing a penalty into the statute, can you?\n \n No matter what, the point of this thread is to ask you what you think the penalty ought to be. What would be appropriate and why?\n \n Specifically, to all you who call abortion baby murder (who have been uncharacteristically silent), what is the appropriate penalty for this crime?\n\n \n I realize this. The law and its penalties are hardly fair though and often times attempt to make up for a flawed system (naturally flawed). So if we were going to make a law I'd probably do something in phases considering we have had abortion around for awhile now. The first laws would be directed towards those getting abortions and would be something around the \"manslaughter\" range. The penalties for the woman in this case is a bit trickier at first but after awhile should go up to the same as the abortionists. \n \n This obviously has no basis in whats fair or whether or not some lives are more important than others but just what our society can handle ok. Even with murder you have a wide range of jail time which makes no logical sense.", 
   {}, 
   275954, 
   null, 
   1186072200.0
  ], 
  [
   276172, 
   null, 
   "snakespit", 
   "You take lightly the fact that your regrettable act involves more than just your own selfishness. Assuming that having sex carried with it no responsibility. Regret for difficult times brought about by permitting a child to live comes off as having the ability to sacrifice a life for not accepting the responsibilities that are the result of one's actions. A sad condition for our species.\n\n \n Who brought all that #### up? I simply stated that if I make a choice that I later regret, it's my business, not the governments business.", 
   {}, 
   275906, 
   null, 
   1186098720.0
  ], 
  [
   276249, 
   null, 
   "simone", 
   "If abortion is, once again, made illegal, then the states need to establish penalties. For non-medically needed partial birth abortions, I'd throw the woman and doctor in jail without a second thought. NEXT!!\nSure! And toss the woman's kids in jail with them and let them all starve to death!\n \n Is that punishment enough?", 
   {}, 
   275848, 
   null, 
   1186164540.0
  ], 
  [
   276284, 
   null, 
   "thelmoose", 
   "Sure! And toss the woman's kids in jail with them and let them all starve to death!\n \n Is that punishment enough?\n\n \n No, they wouldn't toss the kids in jail, silly. As the lifers say, there's always adoption. Mom's in jail for life anyway. (I guess that would make her a \"lifer\", too. Ironic.)", 
   {}, 
   276249, 
   null, 
   1186177260.0
  ], 
  [
   280799, 
   null, 
   "mpc755", 
   "The reason this issue must be debated is in order to stop giving pro-lifers a free pass on the issue.\n \n I was just watching a news program and one of the Republican pro-lifers was on and he was saying how life begins at conception and all live must be protected.\n \n Well, let's ask him if a woman who takes the morning after pill is committing the same crime as a woman who kills her new born baby. If he answers, yes, then great, he is truly pro-life and I commend him for taking such a stand. There's also no way he will ever be elected in a general election. If he says no, or comes up with one of those non-answers (you know it when you hear it), then keep the pressure on him and ask him how long a woman who takes the morning after pill should spend in jail.\n \n If a pro-life person makes any difference between the taking of the morning after pill and the murder of a new born, ask them how they can feel that way if all life is precious.\n \n This is THE question pro-choice people should be asking any and all pro-lifers. For anyone who considers taking the morning after pill not to be the same crime as killing a newborn baby, the next question becomes, well, when does terminating a pregnancy become the same thing as killing a new born baby? Once you get to this question, everyone participating in the discussion is pro-choice and \"all\" you are debating is when does terminating the pregnancy become the same crime as killing a new born.\n \n If we can get American society to this point in the debate, we will realize that only a very, very, small percentage of Americans are pro-life and we can put this debate behind us and move forward as a society.\n \n We must have this debate, and we must ask this question, because it puts pro-lifers in a position of having to answer directly a very difficult question.\n \n If they answer that it is the same crime, then great, how would they feel if a loved one went to jail for 10+ years for taking the morning after pill? Would they feel justice has been served? \n \n When a woman kills her newborn, we immediately feel there is something wrong with the woman, and we as a society take her other children away from her and usually put her in an institution for a considerable amount of time.\n \n Should we do the same with a woman who takes the morning after pill? If you say no, then you are really pro-choice because you are stating that there is indeed a difference between a fertilized egg and a newborn.\n \n Only those who consider taking the morning after pill the same crime as killing a new born baby, and would feel justice would be served by punishing the morning after pill taker the same as the new born baby killer, is truly pro-life.", 
   {}, 
   275909, 
   null, 
   1188163560.0
  ], 
  [
   280806, 
   null, 
   "thelmoose", 
   "The reason this issue must be debated is in order to stop giving pro-lifers a free pass on the issue.\n \n I was just watching a news program and one of the Republican pro-lifers was on and he was saying how life begins at conception and all live must be protected.\n \n Well, let's ask him if he feels a woman who takes the morning after pill is committing the same crime as a woman who kills her new born baby. If he answers, yes, then great, he is truly pro-life and I commend him for taking such a stand. There's also no way he will ever be elected in a general election. If he says no, or comes up with one of those non-answers (you know it when you hear it), then keep the pressure on him and ask him how long a woman who takes the morning after pill should spend in jail.\n \n If a pro-life person makes any difference between the taking of the morning after pill and the murder of a new born, ask them how they can feel that way if all life is precious.\n \n We must have this debate, and we must ask this question, because it puts pro-lifers in a position of having to answer directly a very difficult question.\n \n If they answer that it is the same crime, then great, how would they feel if a loved one went to jail for 10+ years for taking the morning after pill? Would they feel justice has been served? \n \n When a woman kills her newborn, we immediately feel there is something wrong with the woman, and we as a society take her other children away from her and usually put her in an institution for a considerable amount of time.\n \n Should we do the same with a woman who takes the morning after pill? If you say no, then you are really pro-choice because you are stating that there is indeed a difference between a fertilized egg and a newborn.\n \n Only those who consider taking the morning after pill the same crime as killing a new born baby, and would feel justice would be served by punishing the morning after pill taker the same as the new born baby killer, is truly pro-life.\n\n \n Thanks.\n It goes farther than that. The plain ol' birth control pill (which is also part of the morning after stuff) usually prevents pregnancy by preventing ovulation. It appears that it also work a minority of the time by preventing implantation of a conceptus. Bingo, that's abortion, too.\n \n Are any pro-lifers for banning the bcp as well?", 
   {}, 
   280799, 
   null, 
   1188164160.0
  ], 
  [
   280811, 
   null, 
   "chemist99a", 
   "Its all abortion to the RCC. They want us to breed like rabbits. More troops for the cause you know. Same reason they oppose homosexuality I suppose - it reduces reproductive potential. If thats their worry the very first thing they need to do is to release their priests and nuns from vows of chasity, that should provide a bump in the demographics till they get it out of their system. Specially if they use no birth control etc.", 
   {}, 
   280806, 
   null, 
   1188164280.0
  ], 
  [
   280817, 
   null, 
   "chemist99a", 
   "Sure! And toss the woman's kids in jail with them and let them all starve to death!\n \n Is that punishment enough?\n\n \n Nope thats not a heavy enough penalty. It should be a capital offense with a mandated death penalty by lethal injection. And to rebuild traditional family values you have to execute the woman, her husband, and any offspring they HAVE had since such offspring will be contaminated. Eventually we can build a master race with stable reliable family values in this way. Its tough initially but things will settle down when the new family emerges.\n \n Of course should the woman be an adulter the family would be spared and she should be stoned to death.\n And should she have been raped and become pregnant then the council of village elders must decide the penalty but her family must immediatly disown her and force her into the sex industry - provided that the elders do not have her soaked in kerosene and burned or have a wall pushed onto her now that she has been spoiled.\n \n You gotta be tough on these Jesabelles you know if you let them go unpunished then the finer aspects of our civilization which we have worked so hard to build and maintain will be utterly destroyed and we will become mere uncivilized barbarian tribes!", 
   {}, 
   276249, 
   null, 
   1188164580.0
  ], 
  [
   280824, 
   null, 
   "mpc755", 
   "Thanks.\n It goes farther than that. The plain ol' birth control pill (which is also part of the morning after stuff) usually prevents pregnancy by preventing ovulation. It appears that it also work a minority of the time by preventing implantation of a conceptus. Bingo, that's abortion, too.\n \n Are any pro-lifers for banning the bcp as well?\n\n \n Let's keep the focus on the \"crime\" of taking the morning after pill vs. the crime of killing a new born. There is much more of a pre-mediated state with taking the morning after pill. Until pro-lifers, the vast majority of who, I think, feel that taking the morning after pill is NOT the same crime as killing a new born, can answer this question, let's not give them an out.", 
   {}, 
   280806, 
   null, 
   1188165060.0
  ], 
  [
   280848, 
   null, 
   "chemist99a", 
   "Until pro-lifers, the vast majority of who, I think, feel that taking the morning after pill is NOT the same crime as killing a new born, can answer this question, let's not give them an out.\n\n \n They already have an out. If they think the MAP is immoral then they are not required to take it. \n \n And MANY ardent pro-lifers DO consider MAP as equivalent to an abortion since in rare cases it may terminate slightly after implantation. You know those few celled zygotes are just like a baby. The precious little zygote citizens entitled to full protection even if they are somewhat limited in their capabilities as humans. They have a soul just as you and I and there is no question about it. You certainly cannot wish to kill a soul can you even if its just a few cells? And how do we know this you ask? A celibate old man with lifetime job security who has taken vows of chastity and never fathered (and certainly not been pregnant) has told us so based on HIS intrepretation of ancient texts which are supposedly the word of GOD even though those texts and the founder of his religion are silent on the matter of MAP. Of course his predecessors supported a different point of view - and that was true in its day- that a fetus was not ensouled at conception but at the quickening which was I believe 40 days for boys and 60 days for girls (but how they knew the sex of the fetus in those days I do not know). Somehow I do not think this issue is exactly bright and clear in factual or scientific terms.", 
   {}, 
   280824, 
   null, 
   1188166980.0
  ], 
  [
   280855, 
   null, 
   "mpc755", 
   "They already have an out. If they think the MAP is immoral then they are not required to take it. \n\n But that's missing the point. It's not a matter of them taking the morning after pill. It's a matter of what CRIME is being committed. Is it the same CRIME as a woman who kills her new born? And if not, then why not.", 
   {}, 
   280848, 
   null, 
   1188167640.0
  ], 
  [
   280863, 
   null, 
   "chemist99a", 
   "But that's missing the point. It's not a matter of them taking the morning after pill. It's a matter of what CRIME is being committed. Is it the same CRIME as a woman who kills her new born? And if not, then why not.\n\n \n Of course its not the same crime, it is not and should not BE a crime. If it ever is then I suggest we rebel (preferably at the ballot box). Its no more a crime than saying no to sex when one is fertile is! Wasting an egg of course is immoral isn't it? Should that be a crime????", 
   {}, 
   280855, 
   null, 
   1188169500.0
  ], 
  [
   280866, 
   null, 
   "mpc755", 
   "Of course its not the same crime, it is not and should not BE a crime. If it ever is then I suggest we rebel (preferably at the ballot box). Its no more a crime than saying no to sex when one is fertile is! Wasting an egg of course is immoral isn't it? Should that be a crime????\n\n \n For a person who is pro-choice that is an easy question to answer.\n \n For someone who is pro-life, who believes life begins at conception, it cannot, and should not be an easy question to answer.\n \n We are both on the same side on this issue, but you are missing the bigger issue. This issue can, and should, be used to make many so called pro-lifers realize that if they are not willing to call it a crime for a woman to take the morning after pill, if they are not willing to put a woman who takes the morning after pill in jail for the same amount of time that a woman who kills her newborn, then they are, in fact, pro-choice.", 
   {}, 
   280863, 
   null, 
   1188170820.0
  ], 
  [
   280874, 
   null, 
   "Steeeeve", 
   "The reason this issue must be debated is in order to stop giving pro-lifers a free pass on the issue.\n \n I was just watching a news program and one of the Republican pro-lifers was on and he was saying how life begins at conception and all live must be protected.\n \n Well, let's ask him if a woman who takes the morning after pill is committing the same crime as a woman who kills her new born baby. If he answers, yes, then great, he is truly pro-life and I commend him for taking such a stand. There's also no way he will ever be elected in a general election. If he says no, or comes up with one of those non-answers (you know it when you hear it), then keep the pressure on him and ask him how long a woman who takes the morning after pill should spend in jail.\n The question is whether they are equally wrong and that answer is yes.\n \n equal jail time is hardly an indicator of the seriousness of a crime. Some people murder and they get the death penalty while others get life in jail...does that make the two lives different in value? I'd say no. The justice system has never worked on a policy of consistency.\n \n \nIf a pro-life person makes any difference between the taking of the morning after pill and the murder of a new born, ask them how they can feel that way if all life is precious.\nI'd like to add that the morning after pill does not always destroy a life. Sometimes it prevents like a birth control pill does. This doesn't change anything but should be understood.\n \n \nIf we can get American society to this point in the debate, we will realize that only a very, very, small percentage of Americans are pro-life and we can put this debate behind us and move forward as a society.\nRight, you will find most Americans are inconsistent in their beliefs. Congrats. On the flip side you will find pro-choice folks that are in fact not always pro-choice. Welcome to reality.", 
   {}, 
   280799, 
   null, 
   1188174600.0
  ], 
  [
   280876, 
   null, 
   "Steeeeve", 
   " It appears that it also work a minority of the time by preventing implantation of a conceptus.\nIt only works that way if you just started taking it after becoming pregnant...after conception has taken place that is.", 
   {}, 
   280806, 
   null, 
   1188174720.0
  ], 
  [
   280883, 
   null, 
   "thelmoose", 
   "It only works that way if you just started taking it after becoming pregnant...after conception has taken place that is.\n\n No. That would be like the morning after pill. \n \n \nMECHANISMS OF ACTION - While OCs have several mechanisms of action, the most important for providing contraception is estrogen-induced inhibition of the midcycle surge of gonadotropin secretion, so that ovulation does not occur. (See \"The normal menstrual cycle\"). Combination OCs are potent in this regard, but progestin-only pills are not.\n \n Another potential mechanism of contraceptive action is suppression of gonadotropin secretion during the follicular phase of the cycle, thereby preventing follicular maturation. However, a substantial number of women develop follicles while taking an OC that contains 20 to 35 mcg of ethinyl estradiol [2,3].\n \n Clinicians often recommend that back-up contraception be used in the first cycle of OC use, due to concern that early follicular development could result in breakthrough ovulation (most package inserts recommend starting the pill on the first Sunday after menses, which could be as late as day seven). In a study of 140 women randomly assigned to start their oral contraceptive (containing 30 ug ethinyl estradiol/day) on day 1, 4, or 7 of menses, follicular development (diameter < 13 mm) was more common with the later start days (10.3, 17.2, and 44.4 percent for days 1, 4, and 7, respectively) [4]. However, rates of ovulation were no different in the three groups (7, 3, and 0 percent, respectively). Thus, back-up contraception might not be necessary in the first month of OC use, but a larger study is needed before changing clinical practice.\n \n This observation highlights the importance of preventing the midcycle surge of gonadotropin secretion.\n \n Other estrogenic mechanisms of action include suppression of ovarian steroid production, due to suppression of gonadotropin secretion, and a possible decrease in responsiveness of the pituitary to gonadotropin-releasing hormone.\n \n Progestin-related mechanisms also may contribute to the contraceptive effect. These include:\n \n Effects on the endometrium, rendering it less suitable for implantation \n Alterations in cervical mucus, which becomes less permeable to penetration by sperm \n Impairment of normal tubal motility and peristalsis \n \n", 
   {
    "unicode_changes_made": true
   }, 
   280876, 
   null, 
   1188176640.0
  ], 
  [
   280887, 
   null, 
   "mpc755", 
   "equal jail time is hardly an indicator of the seriousness of a crime. Some people murder and they get the death penalty while others get life in jail...does that make the two lives different in value? I'd say no. The justice system has never worked on a policy of consistency.\n \n\n But as far as I know, people who are convicted of pre-meditated murder don't walk or get fined a few dollars. They get years in jail. Take either punishment you describe, either the death penalty or life in jail; which do you suppose is the appropriate punishment for a woman who takes the morning after pill? Are you saying a woman who takes the morning after pill is committing first degree murder but shouldn't be punished? Your argument is flawed and exactly the argument I expect from a pro-lifer who really isn't truly pro-life.\n \n Let's make this a simple as possible. How much time should a woman who takes the morning after pill spend in jail?", 
   {}, 
   280874, 
   null, 
   1188179220.0
  ], 
  [
   280890, 
   null, 
   "Steeeeve", 
   "No. That would be like the morning after pill.\n\n \n i'm not sure how that negates what I said about birth control pills.", 
   {}, 
   280883, 
   null, 
   1188180060.0
  ], 
  [
   280892, 
   null, 
   "chemist99a", 
   "Let's make this a simple as possible. How much time should a woman who takes the morning after pill spend in jail?\n\n \n One word - NONE at all!", 
   {}, 
   280890, 
   null, 
   1188180600.0
  ], 
  [
   280893, 
   null, 
   "Steeeeve", 
   "But as far as I know, people who are convicted of pre-meditated murder don't walk or get fined a few dollars. They get years in jail. Take either punishment you describe, either the death penalty or life in jail; which do you suppose is the appropriate punishment for a woman who takes the morning after pill? Are you saying a woman who takes the morning after pill is committing first degree murder but shouldn't be punished? Your argument is flawed and exactly the argument I expect from a pro-lifer who really isn't truly pro-life.\n How is it flawed? I simply stated our justice system is not consistent and never will be. \n \n But if you like, if the morning after pill is deemed to be illegal and is considered first degree murder then I would say she should be punished for first degree murder for using it.\n \n What you really want to know though is what should the punishment be and this question really doesn't matter. I'm not afraid to say there should be one but I'm also not going to be stupid enough to think you are only consistent if you equate it to other laws when no other law works that way.\n \n \nLet's make this a simple as possible. How much time should a woman who takes the morning after pill spend in jail?\nDunno, haven't really thought it. I'm not sure just taking a morning after pill is that bad. For example if a male took one I'm not so sure that's a big deal or even a female that just randomly took one.", 
   {}, 
   280887, 
   null, 
   1188180660.0
  ], 
  [
   280895, 
   null, 
   "mpc755", 
   "Dunno, haven't really thought it. I'm not sure just taking a morning after pill is that bad. For example if a male took one I'm not so sure that's a big deal or even a female that just randomly took one.\n\n Ok, now we're getting some where. Obfuscation is phase one. \n \n Let's try and make the question more straight forward. The person who takes the morning after pill is a woman. The woman had unprotected sex the night before. The woman, through an X-Ray, ultrasound, or some other means, knows she has a fertilized egg inside her. She decides to take the morning after pill. She takes the morning after pill. \n \n What crime has she committed and what is an appropriate punishment?", 
   {}, 
   280893, 
   null, 
   1188181080.0
  ], 
  [
   280896, 
   null, 
   "mpc755", 
   "One word - NONE at all!\n\n I know that and you know that but it's not that simple for most pro-lifers. Stop answering the question, it's not intended for you! It is a way to move the argument forward. Please read all of the other posts more carefully and realize the larger issue I'm trying to bring focus to. Every time you answer as a logical pro-choicer, you're making me respond to put the focus back on pro-lifers.", 
   {}, 
   280892, 
   null, 
   1188181200.0
  ], 
  [
   280897, 
   null, 
   "thelmoose", 
   "i'm not sure how that negates what I said about birth control pills.\n\n \n You said it works that way only after starting the pill after becoming pregnant. \n \n \nIt appears that it also work a minority of the time by preventing implantation of a conceptus. \n\n \n This means after conception occurs.\n \n \n \nIt only works that way if you just started taking it after becoming pregnant...after conception has taken place that is.\n\n \n You said it ONLY works this way if you START the pill AFTER you became pregnant. \n \n That is not what I said. Occasionally, rarely actually, ovulation and then fertilization occurs while ALREADY ON THE PILL. In that case, implantation can be discouraged. Thus, rarely the BCP is an abortifacient even if you have been taking the pill all along.\n \n Good god, man.", 
   {}, 
   280890, 
   null, 
   1188181380.0
  ], 
  [
   280900, 
   null, 
   "Steeeeve", 
   "Ok, now we're getting some where. Obfuscation is phase one. \n \n Let's try and make the question more straight forward. The person who takes the morning after pill is a woman. The woman had unprotected sex the night before. The woman, through an X-Ray, ultrasound, or some other means, knows she has a fertilized egg inside her. She decides to take the morning after pill. She takes the morning after pill. \n \n What crime has she committed and what is an appropriate punishment?\n\n \n I assume you mean if it were illegal what laws would I have assuming I could be king. \n \n Well, I haven't really thought about it too much. We could also get into the idea of where she got it from...but that aside it seems like it would be similar to current laws where one kills an unborn child (like Scott Peterson). I don't recall if it is 2nd degree murder but that seems like the most likely scenario.", 
   {}, 
   280895, 
   null, 
   1188181620.0
  ], 
  [
   280901, 
   null, 
   "mpc755", 
   "I assume you mean if it were illegal what laws would I have assuming I could be king. \n \n Well, I haven't really thought about it too much. We could also get into the idea of where she got it from...but that aside it seems like it would be similar to current laws where one kills an unborn child (like Scott Peterson). I don't recall if it is 2nd degree murder but that seems like the most likely scenario.\n\n Ok, so it's 2nd degree murder. How long should the woman who took the morning after pill go to jail for for committing a 2nd degree murder?\n \n And don't fall back on the law or anything else. I am asking you. What do you feel is an appropriate punishment? How long do YOU feel the woman who took the morning after pill should spend in jail to make sure justice is served?", 
   {}, 
   280900, 
   null, 
   1188181920.0
  ], 
  [
   280902, 
   null, 
   "Steeeeve", 
   "That is not what I said. Occasionally, rarely actually, ovulation and then fertilization occurs while ALREADY ON THE PILL. In that case, implantation can be discouraged. Thus, rarely the BCP is an abortifacient even if you have been taking the pill all along.\n \nDuring the first month of taking the pill you have a chance to get pregnant and thus implantation may not happen after conception. I'm fully aware of this but I was under the impression that after the first month this does not happen. \n \n I could be wrong, It has been some time since I've read up on the birth control pill. \n \n I ask that you lose the smart tone though as I was asking the question is a true manner as I was unclear about what your post was stating.", 
   {}, 
   280897, 
   null, 
   1188182340.0
  ], 
  [
   280903, 
   null, 
   "Steeeeve", 
   "Ok, so it's 2nd degree murder. How long should the woman who took the morning after pill go to jail for for committing a 2nd degree murder?\n I don't know what the sentencing guidelines are for second degree murder to be honest with you. I think they vary by state.\n \n \nAnd don't fall back on the law or anything else. I am asking you. What do you feel is an appropriate punishment? How long do YOU feel the woman who took the morning after pill should spend in jail to make sure justice is served?\nI'm not sure how I could answer it any better. Given an inconsistent legal system I would say the law should be similar to what the law currently says and therefore the closest thing of comparison are unborn child laws which many states have as 2nd degree murder such as the Scott Peterson Case.", 
   {}, 
   280901, 
   null, 
   1188182520.0
  ], 
  [
   280907, 
   null, 
   "mpc755", 
   "I don't know what the sentencing guidelines are for second degree murder to be honest with you. I think they vary by state.\n \n I'm not sure how I could answer it any better. Given an inconsistent legal system I would say the law should be similar to what the law currently says and therefore the closest thing of comparison are unborn child laws which many states have as 2nd degree murder such as the Scott Peterson Case.\n\n Since you like to mention the Scott Peterson case, I looked him up in Wikipedia and this is what I found:\n \n \"Peterson was sentenced to death and currently resides on death row in San Quentin State Prison.\"\n \n So you think a woman who takes the morning after pill should be sentenced to death?", 
   {}, 
   280903, 
   null, 
   1188183060.0
  ], 
  [
   280908, 
   null, 
   "Steeeeve", 
   "Since you like to mention the Scott Peterson case, I looked him up in Wikipedia and this is what I found:\n \n \"Peterson was sentenced to death and currently resides on death row in San Quentin State Prison.\"\n \n So you think a woman who takes the morning after pill should be sentenced to death?\n\n \n I'm not a big fan of the death penalty so no and I don't think Peterson should get the death penalty.\n \n Scott Peterson was convicted of a double murder which puts him into the death penalty category. Oddly enough this is another example of how our legal system really is not consistent with itself.", 
   {}, 
   280907, 
   null, 
   1188183420.0
  ], 
  [
   280910, 
   null, 
   "chemist99a", 
   "Regardless the penalty for taking a MAP should be no more than for taking an aspirin tablet. Both deal with a minor medical problem effectively and efficiently with a high degree of safety. Not only no jail time, no arrest, no harassment, no invasion of privacy, no open records, no constraints with the possible exception of sex and age (why would a male take the MAP?).", 
   {}, 
   280908, 
   null, 
   1188184380.0
  ], 
  [
   280911, 
   null, 
   "chemist99a", 
   "Regardless the penalty for taking a MAP should be no more than for taking an aspirin tablet. Both deal with a minor medical problem effectively and efficiently with a high degree of safety. Not only no jail time, no arrest, no harassment, no invasion of privacy, no open records, no constraints with the possible exception of sex and age (why would a male take the MAP?).", 
   {}, 
   280908, 
   null, 
   1188184680.0
  ], 
  [
   280912, 
   null, 
   "mpc755", 
   "I'm not a big fan of the death penalty so no and I don't think Peterson should get the death penalty.\n \n Scott Peterson was convicted of a double murder which puts him into the death penalty category. Oddly enough this is another example of how our legal system really is not consistent with itself.\n\n I tried to find some prison sentences for killing an unborn child that did not have associated crimes (like the mother almost being killed):\n \n The projected length of stay for the offense of killing an unborn child is 17.6 months. \n \n In addition, the bill creates the crime of assault of an unborn child and classifies the crime as a Class B felony punishable by a maximum prison sentence of 10 years, a fine of up to $250,000 or both.\n \n Canadian Man Given One Year Sentence for Killing His Unborn Child\n \n We have a low of one year, a possible 10 years, and a medium of 17.6 months.\n \n So do you think a woman how takes the morning after pill should go to jail for 17.6 months?", 
   {}, 
   280908, 
   null, 
   1188184980.0
  ], 
  [
   280915, 
   null, 
   "Steeeeve", 
   "I tried to find some prison sentences for killing an unborn child that did not have associated crimes (like the mother almost being killed):\n \n The projected length of stay for the offense of killing an unborn child is 17.6 months. \n \n In addition, the bill creates the crime of assault of an unborn child and classifies the crime as a Class B felony punishable by a maximum prison sentence of 10 years, a fine of up to $250,000 or both.\n \n Canadian Man Given One Year Sentence for Killing His Unborn Child\n \n We have a low of one year, a possible 10 years, and a medium of 17.6 months.\n \n So do you think a woman how takes the morning after pill should go to jail for 17.6 months?\n I think I stated I support the laws that have an unborn being 2nd degree murder and the penalties as such. If the average for 2nd degree murder is 17.6 months (and I doubt it is) then so be it.", 
   {}, 
   280912, 
   null, 
   1188185340.0
  ], 
  [
   280916, 
   null, 
   "mpc755", 
   "Reposting with links:\n \n I tried to find some prison sentences for killing an unborn child that did not have associated crimes (like the mother almost being killed):\n \n The projected length of stay for the offense of killing an unborn child is 17.6 months.\n (http://64.233.169.104/search?q=cache:Tbf49sGpCd8J:www.leg.state.co.us/2000/inetcbill.nsf/billcontainers/D8420BD4B64A59558725685E007078C3/%24FILE/HB1231_r2.pdf+prison+sentences+unborn&hl=en&ct=clnk&cd=6&gl=us&client=firefox-a)\n \n In addition, the bill creates the crime of assault of an unborn child and classifies the crime as a Class B felony punishable by a maximum prison sentence of 10 years, a fine of up to $250,000 or both.\n (http://64.233.169.104/search?q=cache:fRajN7udMhgJ:www.leg.state.or.us/press_releases/minnis_speaker_051205.pdf+unborn+child+killed+prison+sentences&hl=en&ct=clnk&cd=4&gl=us&client=firefox-a)\n \n Canadian Man Given One Year Sentence for Killing His Unborn Child\n (http://www.lifesite.net/ldn/2004/may/04051902.html)\n \n We have a low of one year, a possible 10 years, and a medium of 17.6 months.\n \n So do you think a woman how takes the morning after pill should go to jail for 17.6 months?", 
   {}, 
   280912, 
   null, 
   1188185340.0
  ], 
  [
   280917, 
   null, 
   "mpc755", 
   "I think I stated I support the laws that have an unborn being 2nd degree murder and the penalties as such. If the average for 2nd degree murder is 17.6 months (and I doubt it is) then so be it.\n\n Are you saying you think the sentence for 2nd degree murder is longer than 17.6 months, ans so should the sentence for a woman who takes the morning after pill?", 
   {}, 
   280915, 
   null, 
   1188185400.0
  ], 
  [
   280918, 
   null, 
   "Steeeeve", 
   "Reposting with links:\n \n I tried to find some prison sentences for killing an unborn child that did not have associated crimes (like the mother almost being killed):\n \n The projected length of stay for the offense of killing an unborn child is 17.6 months.\n (http://64.233.169.104/search?q=cache:Tbf49sGpCd8J:www.leg.state.co.us/2000/inetcbill.nsf/billcontainers/D8420BD4B64A59558725685E007078C3/%24FILE/HB1231_r2.pdf+prison+sentences+unborn&hl=en&ct=clnk&cd=6&gl=us&client=firefox-a)\n \n In addition, the bill creates the crime of assault of an unborn child and classifies the crime as a Class B felony punishable by a maximum prison sentence of 10 years, a fine of up to $250,000 or both.\n (http://64.233.169.104/search?q=cache:fRajN7udMhgJ:www.leg.state.or.us/press_releases/minnis_speaker_051205.pdf+unborn+child+killed+prison+sentences&hl=en&ct=clnk&cd=4&gl=us&client=firefox-a)\n \n Canadian Man Given One Year Sentence for Killing His Unborn Child\n (http://www.lifesite.net/ldn/2004/may/04051902.html)\n \n We have a low of one year, a possible 10 years, and a medium of 17.6 months.\n \n So do you think a woman how takes the morning after pill should go to jail for 17.6 months?\nIt is important to point out that every state is different.", 
   {}, 
   280916, 
   null, 
   1188185520.0
  ], 
  [
   280920, 
   null, 
   "Steeeeve", 
   "Are you saying you think the sentence for 2nd degree murder is longer than 17.6 months, ans so should the sentence for a woman who takes the morning after pill?\nFor the fourth or 5th time....assuming the woman in question was pregnant and the morning after pill caused her to abort then yes.\n \n Of course you seem to fail to realize that sentencing and law have nothing to do with whether something is right or wrong. This is exactly why a question of what the law should be is irrelevant until you first decide that the action in question is wrong.", 
   {}, 
   280917, 
   null, 
   1188185580.0
  ], 
  [
   280921, 
   null, 
   "mpc755", 
   "For the fourth or 5th time....assuming the woman in question was pregnant and the morning after pill caused her to abort then yes.\n\n You would think justice was served if a loved one of yours (i.e. a sister, an aunt, a cousin, an old girl friend, a current girl friend, your wife, your daughter) went to jail for at least a year and a half for taking the morning after pill?", 
   {}, 
   280920, 
   null, 
   1188185700.0
  ], 
  [
   280924, 
   null, 
   "Steeeeve", 
   "You would think justice was served if a loved one of yours (i.e. a sister, an aunt, a cousin, an old girl friend, a current girl friend, your wife, your daughter) went to jail for at least a year and a half for taking the morning after pill?\n Are you just going to ask the question over and over again?\n \n \nFor the fourth or 5th time....assuming the woman in question was pregnant and the morning after pill caused her to abort then yes.\n\n \n If you have any other similar questions then please refer to the quote above.", 
   {}, 
   280921, 
   null, 
   1188186420.0
  ], 
  [
   280925, 
   null, 
   "mpc755", 
   "Are you just going to ask the question over and over again?\n\n \n Why can't you just answer yes and we can move on.\n \n You think justice would be served if a loved one of yours (i.e. a sister, an aunt, a cousin, an old girl friend, a current girl friend, your wife, your daughter) went to jail for at least a year and a half for taking the morning after pill?\n \n Yes or No?", 
   {}, 
   280924, 
   null, 
   1188186600.0
  ], 
  [
   280926, 
   null, 
   "Steeeeve", 
   "Why can't you just answer yes and we can move on.\n Alright, you ask again and I'm just gonna put you on the ignore list because I have no idea what you can't understand my answer.\n \n \nassuming the woman in question was pregnant and the morning after pill caused her to abort then yes.\n", 
   {}, 
   280925, 
   null, 
   1188187140.0
  ], 
  [
   280927, 
   null, 
   "mpc755", 
   "The point I am trying to make is that I don't think the vast majority of pro-lifers would think justice was served if their daughter went to jail for 18+ months for taking the morning after pill.", 
   {}, 
   280926, 
   null, 
   1188187800.0
  ], 
  [
   280928, 
   null, 
   "Steeeeve", 
   "The point I am trying to make is that I don't think the vast majority of pro-lifers would think justice was served if their daughter went to jail for 18+ months for taking the morning after pill.\n\n \n And like I said the majority of people are not consistent in belief. Even pro-choicers are guilty of this.", 
   {}, 
   280927, 
   null, 
   1188188040.0
  ], 
  [
   280929, 
   null, 
   "mpc755", 
   "And like I said the majority of people are not consistent in belief. Even pro-choicers are guilty of this.\n\n Not the same. Pro-lifers say life begins at conception, equate a fertilized egg to a new born, but unlike you, the vast majority of them would not think justice is being served if their daughter goes to jail for 10+ years for taking the morning after pill.\n \n That is hypocrisy, not non-consistency.", 
   {}, 
   280928, 
   null, 
   1188188520.0
  ], 
  [
   280930, 
   null, 
   "Steeeeve", 
   "Not the same. Pro-lifers say life begins at conception, equate a fertilized egg to a new born, but unlike you, the vast majority of them would not think justice is being served if their daughter goes to jail for 10+ years for taking the morning after pill.\n \n That is hypocrisy, not non-consistency.\n\n \n I don't think that is hypocrisy. It is being inconsistent. Hypocrisy implies believing one thing and doing the opposite. There is a difference when you are just not consistent with the beliefs. \n \n But pro-choice people can be inconsistent too. Many \"pro-choice\" people think abortion should only be in the first trimester but there is no difference in 3 months 0 days and 3 months 1 day. \n \n That is just one example.", 
   {}, 
   280929, 
   null, 
   1188188940.0
  ], 
  [
   280931, 
   null, 
   "mpc755", 
   "I don't think that is hypocrisy. It is being inconsistent. Hypocrisy implies believing one thing and doing the opposite. There is a difference when you are just not consistent with the beliefs. \n\n \n It is hypocritical because pro-lifers believe one thing and do the opposite. They believe life begins at conception and a fertilized egg is the same thing as a new born, but if their daughter killed their grand child, they would have no problem taking the other grand children away from her while she goes to an institution or to jail. I doubt the vast majority of pro-lifers would have no problem taking the other grand children while their daughter goes to an institution or to jail for 5+ years for taking the morning after pill. If murder is murder, then the pro-lifer should feel the same and want the same justice for a fertilized egg as they do a new born.\n \n Seeing them as being different is not inconsistent it is hypocritical.", 
   {}, 
   280930, 
   null, 
   1188189420.0
  ], 
  [
   280932, 
   null, 
   "Steeeeve", 
   "It is hypocritical because pro-lifers believe one thing and do the opposite. They believe life begins at conception and a fertilized egg is the same thing as a new born, but if their daughter killed their grand child, they would have no problem taking the other grand children away from her while she goes to an institution or to jail. I doubt the vast majority of pro-lifers would have no problem taking the other grand children while their daughter goes to an institution or to jail for 5+ years for taking the morning after pill. If murder is murder, then the pro-lifer should feel the same and want the same justice for a fertilized egg as they do a new born.\n \n Seeing them as being different is not inconsistent it is hypocritical.\n\n \n That is a weak definition of \"hypocrite\". I disagree that inconsistent belief is hypocritical in the common sense of the word.", 
   {}, 
   280931, 
   null, 
   1188189900.0
  ], 
  [
   280933, 
   null, 
   "mpc755", 
   "That is a weak definition of \"hypocrite\". I disagree that inconsistent belief is hypocritical in the common sense of the word.\n\n No, it is the definition of hypocrite. A pro-lifer who feels there is no punishable crime committed when a woman takes the morning after pill is not a pro-lifer. They are placing a different \"value\" on the fertilized egg than a new born baby, which makes them a hypocrite.", 
   {}, 
   280932, 
   null, 
   1188191040.0
  ], 
  [
   280936, 
   null, 
   "Steeeeve", 
   "No, it is the definition of hypocrite. A pro-lifer who feels there is no punishable crime committed when a woman takes the morning after pill is not a pro-lifer. They are placing a different \"value\" on the fertilized egg than a new born baby, which makes them a hypocrite.\n\n \n Ok, we are just going to disagree on what a hypocrite is.", 
   {}, 
   280933, 
   null, 
   1188192300.0
  ], 
  [
   308311, 
   null, 
   "bhbcu64", 
   "mpc,\n \n A pro-lifer who feels there is no punishable crime committed when a woman takes the morning after pill is not a pro-lifer.\n \n Neither is a pro-lifer who supports the Death Penalty.", 
   {}, 
   280936, 
   null, 
   1207954800.0
  ], 
  [
   308399, 
   null, 
   "Colonel Ingus", 
   "And like I said the majority of people are not consistent in belief. Even pro-choicers are guilty of this.\n\n No me. My beliefs are completely rock steady with no justification.\n \n So you want to put a woman in jail when some states have mandated emergency contraception? Wow, that's some sound reasoning there emoticon_rolleyes", 
   {}, 
   280928, 
   null, 
   1208031060.0
  ], 
  [
   311235, 
   null, 
   "Christina_Castl", 
   "I believe that if abortion should ever become illegal again that the mother should be charged with murder in the first. A fetus is a human from the moment the sperm and the egg meet. If a husband murders his preagnant wife he is charged with murder not only for the mother but for the fetus as well. Not to mention a fetus is murdered in a very brutall way, they dont even get the luxery of being shot or stabbed they get dismembered.", 
   {}, 
   275909, 
   null, 
   1211185260.0
  ], 
  [
   311240, 
   null, 
   "iangb", 
   "I'm curious. Given that a 'foetus is human from the instant that sperm and egg meet', how can early-aborted foetuses be 'dismembered' when they don't actually have anything to dismember yet?", 
   {}, 
   311235, 
   null, 
   1211205840.0
  ], 
  [
   311260, 
   null, 
   "Steeeeve", 
   "I'm curious. Given that a 'foetus is human from the instant that sperm and egg meet', how can early-aborted foetuses be 'dismembered' when they don't actually have anything to dismember yet?\nWhere did this come from? Some adults are born without limbs so how do you dismember them? \n \n I'm not sure the relevance to this topic.", 
   {}, 
   311240, 
   null, 
   1211219220.0
  ], 
  [
   311272, 
   null, 
   "iangb", 
   "Sorry, I have a bad habit of responding to non sequiters. This was responding to the post above mine:\n \nA fetus is a human from the moment the sperm and the egg meet.\n ...\n Not to mention a fetus is murdered in a very brutall way, they dont even get the luxery of being shot or stabbed they get dismembered.\n", 
   {}, 
   311260, 
   null, 
   1211222640.0
  ], 
  [
   311285, 
   null, 
   "Steeeeve", 
   "Sorry, I have a bad habit of responding to non sequiters. This was responding to the post above mine:\n\n \n My mistake. Yeah, not all abortions are dismemberments although some are.", 
   {}, 
   311272, 
   null, 
   1211230260.0
  ], 
  [
   311289, 
   null, 
   "Christina_Castl", 
   "I dont believe that taking the morning after pill in so do speak an abortion, that is taking percaution after the fact and I do think a women should take those percautions befor the fact, of course rape cases are different. But I also see those who are out thier having unprotected sex, and everyone knows what happens. These women need to either protect themselves from preagnancy or dont have sex and for the love of god do not use abortion as a birthcontrol. I only became intrested in this subject because I am doing research for a class and I watched some vidioes and seen many pictures of babies from 7 weeks to 24 weeks and I am sorry but at 24 weeks it is a baby not a fetus, it is a child created in its parents image. It is sad, and I dont know how a mother can feel her child move inside her and then have an abortion, yes it is murder and yes she should sit in prison", 
   {}, 
   311285, 
   null, 
   1211231400.0
  ], 
  [
   311308, 
   null, 
   "electrolyte", 
   "I dont believe that taking the morning after pill in so do speak an abortion, that is taking percaution after the fact and I do think a women should take those percautions befor the fact, of course rape cases are different. But I also see those who are out thier having unprotected sex, and everyone knows what happens. These women need to either protect themselves from preagnancy or dont have sex and for the love of god do not use abortion as a birthcontrol. I only became intrested in this subject because I am doing research for a class and I watched some vidioes and seen many pictures of babies from 7 weeks to 24 weeks and I am sorry but at 24 weeks it is a baby not a fetus, it is a child created in its parents image. It is sad, and I dont know how a mother can feel her child move inside her and then have an abortion, yes it is murder and yes she should sit in prison\n\n What about couples who are using contraception responsibly but end up pregnant due to whatever fluke happened to have occurred? If the woman gets an abortion, does she also deserve to be imprisoned as a felon?", 
   {}, 
   311289, 
   null, 
   1211241480.0
  ], 
  [
   311313, 
   null, 
   "Christina_Castl", 
   "What about couples who are using contraception responsibly but end up pregnant due to whatever fluke happened to have occurred? If the woman gets an abortion, does she also deserve to be imprisoned as a felon?\n\n \n Well I believe that every thing happens for a reason, for whatever reason she became preagnant it is a gift, at the time it may not seem like a gift. This is such a touchy subject I think that women who are useing abortion as a birth control are in the wrong, I would not want to have a child out of a rape situation, but I do believe in God and as I said befor it happend for a reason.", 
   {}, 
   311308, 
   null, 
   1211242500.0
  ], 
  [
   311320, 
   null, 
   "electrolyte", 
   "Well I believe that every thing happens for a reason, for whatever reason she became preagnant it is a gift, at the time it may not seem like a gift. This is such a touchy subject I think that women who are useing abortion as a birth control are in the wrong, I would not want to have a child out of a rape situation, but I do believe in God and as I said befor it happend for a reason.\n\n Ah, then our development of safe and reliable abortion procedures must have happened for a reason.\n \n Just because you think that any pregnancy is a gift doesn't mean that it is. Either way, though, you didn't answer the question. I specifically asked you if a woman who is using contraception responsibly but happens to become pregnant through no fault of her own should be convicted of murder for having an abortion. What is your answer?", 
   {}, 
   311313, 
   null, 
   1211244780.0
  ], 
  [
   311322, 
   null, 
   "Christina_Castl", 
   "Ah, then our development of safe and reliable abortion procedures must have happened for a reason.\n \n Just because you think that any pregnancy is a gift doesn't mean that it is. Either way, though, you didn't answer the question. I specifically asked you if a woman who is using contraception responsibly but happens to become pregnant through no fault of her own should be convicted of murder for having an abortion. What is your answer?\n\n \n Yes, it is still inhuman", 
   {}, 
   311320, 
   null, 
   1211244960.0
  ], 
  [
   311325, 
   null, 
   "Christina_Castl", 
   "I guess I am really sesitive to this subject after observing this procedure. So I have asked myself this question. When is it appropriate to have an abortion? When the child or the mother is sick and very early in preagnancy, say befor 7 weeks. I am a mother of eight, my own mother has dried to convince me to have an abortion because I have so many children and most were accidents, my ex was not a nice man and had I had my choice would not have had children with him, it was a control issue. But I still went through with it and yes it is stressfull at times, but they are blessings. Yesterday I had no idea how an abortion procedure was done. As I said the child does not ask to be concieved, it is a resposibility of the mother. I dont think we have the right to take life away, I believe they feel pain. The procedure I seen the mother was 24 weeks along, it mad me sad and angry with the mother.", 
   {}, 
   311322, 
   null, 
   1211245860.0
  ], 
  [
   311328, 
   null, 
   "electrolyte", 
   "Yes, it is still inhuman\n\n And you still haven't answered my question. Why not?\n And here's another: If everything happens for a reason, then don't abortions happen for a reason?\n \n \nYesterday I had no idea how an abortion procedure was done.\n\n And if you saw one at 24 weeks, then you still have no idea how a typical abortion is done. Either you have been duped into believing that those abortions are representative of the whole, or you know that they aren't but pretend that they are. Either way, you have some work to do.\n \n \nAs I said the child does not ask to be concieved, it is a resposibility of the mother.\n\n And not all mothers ask to conceive. Which brings us back to the question that you won't answer.\n \n \nI dont think we have the right to take life away,\n\n In order for this argument to work, you have to show that a fetus qualifies as \"alive.\"\n \n \nI believe they feel pain.\n\n And the science says that you're wrong for the representative case.", 
   {}, 
   311325, 
   null, 
   1211246700.0
  ], 
  [
   311332, 
   null, 
   "Steeeeve", 
   "And you still haven't answered my question.\nwas the \"Yes, it is still inhuman\" an answer to the question or was it a response to the bolded part?", 
   {}, 
   311328, 
   null, 
   1211247960.0
  ], 
  [
   311335, 
   null, 
   "electrolyte", 
   "was the \"Yes, it is still inhuman\" an answer to the question or was it a response to the bolded part?\n\n Actually, it seemed to miss the point entirely. I'd like clarification before I start another round of evisceration.", 
   {}, 
   311332, 
   null, 
   1211248320.0
  ], 
  [
   311336, 
   null, 
   "Christina_Castl", 
   "When does an embryo become a fetus and when is a fetus a person? Before 1973 this question lacked importance in the political field. But with the announcement of Roe v. Wade it took on a greater value. Now doctors, aided by new technology, are constantly redefining when it is an embryo becomes a living thing - saving babies as young as just 23 weeks old. Acts like these make science look as though it is often siding with the pro-life activists. (4)\n \n A human gestation period is divided into three trimesters of approximately three months each for nine months total. In the first trimester the pregnancy starts with a fertilized egg that divides to become tissue and cleavage, which become an embryo. In these first three months the embryo goes through organogenesis and develops body organs, its heart beats after the fourth week, brain waves can be monitored after six weeks, and by the eighth week all major body parts are present. (4) At the end of the trimester the embryo has matured into a fetus. During the second trimester the fetus grows from the approximately 5cm it was at the end of the first trimester to about 30cm long. It also begins to move as it is continuing to mature. By the third trimester it becomes fully-grown, completely fills the capacity of the womb, and fully matured at about 50cm long. (5) Since the heart has been beating since the beginning of the first trimester, a fetus in the stages of the second and third trimesters are almost always considered alive and, therefore, state property to some extent unless there are extenuating circumstances. This means almost all abortions are received in the first trimester.\n here is why it is inhumane, because the fetus is alive. and for the record man created many things that are and abortion is one of thise things and I still feel it is a crime and yes the mother should take responsibility and have the baby, if she dont want it thier is someone out thier who does. The people commiting crimes should be put away to create room for the innocent children being killed. Yes this includes the mother and the doctor", 
   {}, 
   311335, 
   null, 
   1211248980.0
  ], 
  [
   311339, 
   null, 
   "Steeeeve", 
   "You should probably stick with addressing points as this is a debate forum. I have debated with electrolyte before and electrolyte knows how a pregnancy happens.", 
   {}, 
   311336, 
   null, 
   1211249580.0
  ], 
  [
   311341, 
   null, 
   "chester", 
   "I guess I am really sesitive to this subject after observing this procedure. So I have asked myself this question. When is it appropriate to have an abortion? When the child or the mother is sick and very early in preagnancy, say befor 7 weeks. I am a mother of eight, my own mother has dried to convince me to have an abortion because I have so many children and most were accidents, my ex was not a nice man and had I had my choice would not have had children with him, it was a control issue. But I still went through with it and yes it is stressfull at times, but they are blessings. Yesterday I had no idea how an abortion procedure was done. As I said the child does not ask to be concieved, it is a resposibility of the mother. I dont think we have the right to take life away, I believe they feel pain. The procedure I seen the mother was 24 weeks along, it mad me sad and angry with the mother.\n\n \n C Casti,\n \n Do you really expect this forum to believe that you had a number of OOPS'es?\n \n Do you really expect the forum to believe that you witnessed an abortion at 24 weeks?\n \n Ever hear of contraception?\n \n Ever hear of grammar and spelling?\n \n Ever hear of safe houses?\n \n PUHLEEEZZZZEEEEE!!!emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "Choice, an all-American family value!"
    }
   }, 
   311325, 
   null, 
   1211250300.0
  ], 
  [
   311349, 
   null, 
   "Christina_Castl", 
   "C Casti,\n \n Do you really expect this forum to believe that you had a number of OOPS'es?\n \n Do you really expect the forum to believe that you witnessed an abortion at 24 weeks?\n \n Ever hear of contraception?\n \n Ever hear of grammar and spelling?\n \n Ever hear of safe houses?\n \n PUHLEEEZZZZEEEEE!!!emoticon_rolleyes\n\n \n Well you better believe that yes I had 6 opps and 2 step children, and yes I am a college student and I started researching abortions, and I have a vidieo with numerouse abortions on it. my grammer and spelling may be a little incorrect, I usually use a spell checker and generally I am not into politics or any of this ####, oh and I dont need a safe house, that time of my life has passed. I am a christian mother and abortion is morally wrong, at 4 weeks thier is a heartbeat, so thier is life.", 
   {}, 
   311341, 
   null, 
   1211253900.0
  ], 
  [
   314551, 
   null, 
   "John24", 
   "MSNBC has an article examining what penalties should be given to a women who has an abortion if the law were to criminalize it.\n \n http://www.msnbc.msn.com/id/20010696/site/newsweek/\n \n Read and discuss if you like.\n \n I, for one, do not see the issue as being only between two options, as I think the author of the article seems to suggest. I'll await the input of others before I elaborate more.\n\n \n Wow......................", 
   {}, 
   275785, 
   null, 
   1214865780.0
  ], 
  [
   314557, 
   null, 
   "chester", 
   "Seems to me that if the profetallifers really do believe that abortion is the murder of the most helpless among us, nothing short of LWOP or the DP is sufficient punishment for both the woman and her doctor.\n \n Anything short of that would be criminal coddling, right?", 
   {}, 
   314551, 
   null, 
   1214866740.0
  ], 
  [
   315090, 
   null, 
   "simone", 
   "MSNBC has an article examining what penalties should be given to a women who has an abortion if the law were to criminalize it.\n \n http://www.msnbc.msn.com/id/20010696/site/newsweek/\n \n Read and discuss if you like.\n \n I, for one, do not see the issue as being only between two options, as I think the author of the article seems to suggest. I'll await the input of others before I elaborate more.\n\n What about the criminality of those who oppose liberty for women?\n \n Those who oppose the right of women to life, liberty and the pursuit of happiness? What punishment for them?", 
   {
    "post_info": {
     "post_title": "How Much Jail Time for Idiots..."
    }
   }, 
   275785, 
   null, 
   1215189360.0
  ], 
  [
   315091, 
   null, 
   "simone", 
   "If abortion is, once again, made illegal, then the states need to establish penalties. For non-medically needed partial birth abortions, I'd throw the woman and doctor in jail without a second thought. NEXT!!\n\n And the man who impregnated the woman should walk away totally free of all responsibility!\n \n Spoken just like an total misogynist!", 
   {}, 
   275848, 
   null, 
   1215189960.0
  ], 
  [
   315092, 
   null, 
   "simone", 
   "You take lightly the fact that your regrettable act involves more than just your own selfishness. Assuming that having sex carried with it no responsibility. Regret for difficult times brought about by permitting a child to live comes off as having the ability to sacrifice a life for not accepting the responsibilities that are the result of one's actions. A sad condition for our species.\n\n Again, no mention of the irresponsibility of the male party involved.\n \n Another case of extreme misogyny.\n \n Um. little sex lesson, it takes two to create a pregnancy and \n \n SURPRISE!\n \n One of them is male!", 
   {}, 
   275906, 
   null, 
   1215190080.0
  ], 
  [
   315110, 
   null, 
   "Shooterandproud", 
   "Again, no mention of the irresponsibility of the male party involved.\n \n Another case of extreme misogyny.\n \n Um. little sex lesson, it takes two to create a pregnancy and \n \n SURPRISE!\n \n One of them is male!\n\n \n Bigoted male proponents of fetal life over woman's life are sexist, and will not accept any responsibility for impregnating a woman. Its funny how most of the anti-choicers are men, isn't it?", 
   {}, 
   315092, 
   null, 
   1215199320.0
  ], 
  [
   315111, 
   null, 
   "Shooterandproud", 
   "Well you better believe that yes I had 6 opps and 2 step children, and yes I am a college student and I started researching abortions, and I have a vidieo with numerouse abortions on it. my grammer and spelling may be a little incorrect, I usually use a spell checker and generally I am not into politics or any of this ####, oh and I dont need a safe house, that time of my life has passed. I am a christian mother and abortion is morally wrong, at 4 weeks thier is a heartbeat, so thier is life.\n\n \n If we constructed a little beating heart and put it in a rock, is the rock alive? I am not debating that an embryo is alive, because I know it is. However, since it has not mental existence, it has not rights. A cat has a mental existence, therefore it has rights (Animal Cruelty laws). A plant does not have a mental existence, therefore it doesn't have rights.", 
   {}, 
   311349, 
   null, 
   1215199860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How Much Jail Time?", 
  "url": "http://www.4forums.com/political/abortion-debates/10166-how-much-jail-time.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 10166, 
  "discussion_files": [
   [
    "4521.html", 
    "http://www.4forums.com/political/abortion-debates/10166-how-much-jail-time-print.html"
   ], 
   [
    "4522.html", 
    "http://www.4forums.com/political/abortion-debates/10166-how-much-jail-time-7-print.html"
   ], 
   [
    "4523.html", 
    "http://www.4forums.com/political/abortion-debates/10166-how-much-jail-time-5-print.html"
   ], 
   [
    "4524.html", 
    "http://www.4forums.com/political/abortion-debates/10166-how-much-jail-time-4-print.html"
   ], 
   [
    "4525.html", 
    "http://www.4forums.com/political/abortion-debates/10166-how-much-jail-time-6-print.html"
   ], 
   [
    "4526.html", 
    "http://www.4forums.com/political/abortion-debates/10166-how-much-jail-time-3-print.html"
   ], 
   [
    "4527.html", 
    "http://www.4forums.com/political/abortion-debates/10166-how-much-jail-time-2-print.html"
   ]
  ], 
  "identifier": 10166
 }
]