[
 [
  [
   275800, 
   null, 
   "Archangel", 
   "I like it because it isn't reruns and it's a true Social experiment. The clicks that are formed and the consequent betrayals speak volumes about peoples ambitions, sense of loyalty and the lengths they will go to to fit in and be accepted, even by people they don't really like. I get the live feed each year and am able to watch them 24/7 if I chose to, and find the drama that isn't televised as interesting as that which is televised. \n \n Anyone else watching and want to discuss their observations on the human condition when a house full of strangers must interact with each other while suffering from the symptoms of Cabin Fever ?", 
   {
    "post_info": {
     "post_title": "Is anyone watching BIG BROTHER ?"
    }
   }, 
   null, 
   null, 
   1185894420.0
  ], 
  [
   275805, 
   null, 
   "Ripskar", 
   "Evidently the American version is somewhat different to the British collection of exhibitionists, muppets and other time wasters...", 
   {}, 
   275800, 
   null, 
   1185896640.0
  ], 
  [
   275807, 
   null, 
   "Jo Bennett", 
   "Either that or Archangel has no taste or ethics. Either's possible :p", 
   {}, 
   275805, 
   null, 
   1185897240.0
  ], 
  [
   275810, 
   null, 
   "Archangel", 
   "Either that or Archangel has no taste or ethics. Either's possible :p\n\n \n I can't post even the most non-confrontational thread without being attacked, can I.", 
   {}, 
   275807, 
   null, 
   1185899760.0
  ], 
  [
   275814, 
   null, 
   "Jo Bennett", 
   "I was joking AA, hence the smilie.", 
   {}, 
   275810, 
   null, 
   1185901680.0
  ], 
  [
   275827, 
   null, 
   "gamehuis", 
   "IMO, anyone that either watches or participates in BB (or any other kind of \"reality\" show) should be deemed a waste of human flesh and be shot on sight.\n \n And I wouldn't consider it a true social experiment because there are camera's there and the participants know it. This inevitably leads to people acting differently because they like to attention whore. \n \n The worst of the \"shows\" is the one we have here in Holland. It's called The Golden Cage. The premise is that a bunch of contestants pay \u0080 10.000,- and then get locked inside a multi-million dollar villa. Whoever leaves the villa last gets to keep the villa.\n These cutthroat rules of the show have led to some really disgusting behavior like sexual molestation etc.\n \n What a sick world we live in these days. Our \"entertainment\" needs ever more extreme variations to satisfy the people. Won't be long now before we have bulls raping Christians again in the Colosseum...", 
   {}, 
   275814, 
   null, 
   1185904140.0
  ], 
  [
   275833, 
   null, 
   "Ripskar", 
   "http://www.channel4.com/bigbrother/?intcmp=homepage_flash_bb\n Here's the link for the British version if anyone can stomach it.\n It's the 8th series now, the 1st had potential to be what Archie describes with a range of people. Since the 2nd series it's just been wall to wall exhibitionism.\n What series is the US version on?", 
   {}, 
   275827, 
   null, 
   1185905940.0
  ], 
  [
   275834, 
   null, 
   "Waxy", 
   "What a microcosm of American culture this post is.\n \n A living dichotomy.\n \n Waxy", 
   {}, 
   275827, 
   null, 
   1185906480.0
  ], 
  [
   275849, 
   null, 
   "JPSartre12", 
   "What a microcosm of American culture this post is.\n \n A living dichotomy.\n \n Waxy\n\n \n I wouldn't watch BB if I lived in the frozen north next door to you. :p", 
   {}, 
   275834, 
   null, 
   1185908460.0
  ], 
  [
   275914, 
   null, 
   "peteratwar", 
   "Must be one of the most awful programmes created", 
   {}, 
   275849, 
   null, 
   1185962400.0
  ], 
  [
   275945, 
   null, 
   "Zardoz", 
   "I've never been into the paper thin propaganda of 'Big Brother' especially when Little Sister is much more insidious.\n \n I mean, we all know we can take a swing at Big Brother...even if he'll stomp you down but who'd in their right mind pick on Little Sister without not only getting a guilt trip but a smack down by the rest of The Family.\n \n So, yeah, Big Brother may be watching but you all know it's Little Sister who'll snitch...heck, she'll even make stuff up just to get you into trouble. And everyone believes Little Sister. \n \n \n Oh...you're talking about the silly TV show.\n Thought this was a political philosophy thread...\n \n \n Still...\n \n Watch out for Little Sister.\n She's the most favorite offspring of The Man.", 
   {}, 
   275914, 
   null, 
   1185989700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is anyone watching BIG BROTHER ?", 
  "url": "http://www.4forums.com/political/current-events-debates/10169-anyone-watching-big-brother.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 10169, 
  "discussion_files": [
   [
    "6720.html", 
    "http://www.4forums.com/political/current-events-debates/10169-anyone-watching-big-brother-print.html"
   ]
  ], 
  "identifier": 10169
 }
]