[
 [
  [
   276010, 
   null, 
   "Liminus", 
   "(I wasn't sure where to put this, philosophy or politics might have been better but here it is.)\n \n I ask this question mainly for the americans on this forum, mainly because in the UK patriotism isn't really the flashpoint issue that it seems to be in the states. This could be because people overreact to the idea of patriotism because they associate it with Nazi Germany, and also because Britain has already had its decline and fall (to an extent) so we are not so wrapped up in notions of being a 'great' country.\n \n I also ask with reference to the oft-repeated accusations of someone being 'un-american' or 'anti-american'. This is definitely not something you ever see in the UK; never in my life have I heard or read someone using the phrase 'anti-British'. I am hard pressed, in fact, to recall a single instance of any culture outside the US using this turn of phrase, with the exception of supranational religion ('un-christian', 'anti-muslim' etc).\n \n It seems to me to be a meaningless label, particularly (and ironically) so for the 'land of the free' where evryone is supposed to be able to pursue their own crazy lifestyle and espouse their own crazy views without this sort of vilification. \n \n An extension of this is people being told that they obviously 'hate their own country' etc, with the tacet implication that they are supposed to absolutely love it, a form of flag-worship in my opinion. This makes no sense to me, because as a UK citizen I neither love nor hate my 'country' as a whole. How can I? There are aspects of British life that I love, such as our cynical attitude and irreverent sense of humour, and there are aspects that I hate, such as our readiness to follow the US into wars, and our woefully one-dimensional politics. \n \n So what do think patriotism is?\n \n How do you define a patriot?\n \n What (if anything) does it mean to be 'anti-american'?", 
   {
    "post_info": {
     "post_title": "What is patriotism?"
    }
   }, 
   null, 
   null, 
   1186011120.0
  ], 
  [
   276099, 
   null, 
   "James", 
   "\n I ask this question mainly for the americans on this forum, mainly because in the UK patriotism isn't really the flashpoint issue that it seems to be in the states. This could be because people overreact to the idea of patriotism because they associate it with Nazi Germany, and also because Britain has already had its decline and fall (to an extent) so we are not so wrapped up in notions of being a 'great' country.\n\n There is a distinction between patriotism and nationalism - which I think you've tended to obscure in your reference to Nazi Germany by comparison with Britain. \n \n Patriotism is a sentiment of attachment - i.e. love of one's country; while nationalism is associated with an ideology of national superiority. Another contrast is between a respect for political institutions and laws (patriotism), and a belligerent devotion to race, language, and custom (nationalism). \n \nIt seems to me to be a meaningless label, particularly (and ironically) so for the 'land of the free' where everyone is supposed to be able to pursue their own crazy lifestyle and espouse their own crazy views without this sort of vilification. \n\n Doesn't any vilification arise from confusing the difference between between patriot and nationalist?\n \nAn extension of this is people being told that they obviously 'hate their own country' etc, with the tacet implication that they are supposed to absolutely love it, a form of flag-worship in my opinion. This makes no sense to me, because as a UK citizen I neither love nor hate my 'country' as a whole. How can I? \n\n To answer this question, you might need to ask another: would you be prepared to fight and even die in defence of your country? An affirmative answer might go some way towards defining what patriotism is.\n \n James.", 
   {}, 
   276010, 
   null, 
   1186075860.0
  ], 
  [
   276730, 
   null, 
   "Liminus", 
   "There is a distinction between patriotism and nationalism - which I think you've tended to obscure in your reference to Nazi Germany by comparison with Britain. \n \n Patriotism is a sentiment of attachment - i.e. love of one's country; while nationalism is associated with an ideology of national superiority. Another contrast is between a respect for political institutions and laws (patriotism), and a belligerent devotion to race, language, and custom (nationalism). \n \n Doesn't any vilification arise from confusing the difference between between patriot and nationalist?\n\n \n But that confusion is exactly what I think exists in alot of people's minds; I think that one reason we don't have a major cultural element of patriotism is because it's almost a dirty word. Look at Labour's attempts to talk about 'British values' and how it was treated by the media. \n \n This is partly because I think we are very aware that the concept of 'British values' is meaningless, because people from different subcultures, different class, different regions have conflicting values, at least those that go beyond basic human ones. \n \n What is the meaning of saying \"I love my country\" when what you really mean is \"I love the things about my country that I identify with\"? I think this is best exemplified by the fact that both pro- and anti-war americans believe that they are more patriotic than the other.\n \n \nTo answer this question, you might need to ask another: would you be prepared to fight and even die in defence of your country? An affirmative answer might go some way towards defining what patriotism is.\n\n \n Absolutely not. I would fight and die in defence of my family, but if (a big if, in the UK) we were invaded I would try to get my family together and bugger off to Canada, or wherever. If that proved impossible, then I would fight the invasion, but only for the sake of my family.", 
   {}, 
   276099, 
   null, 
   1186443780.0
  ], 
  [
   276731, 
   null, 
   "Jo Bennett", 
   "Very few invaders have the intention of killing the population, surely it depends who was invading?\n \n Attachment to a particular state is absurd as they are artificial constructs, look at the spread of celts across the western end of europe, celtic cultures survive in 6 countries, only one of which is an independent state. In any case, even if all states were nation states, it would still ignore the fundamental commonality of experience between people of the same class in different countries. The concerns of factory workers in Britain and Germany are likely to be closer to each other than they are to the concerns of, say, lawyers in either country.", 
   {}, 
   276730, 
   null, 
   1186444260.0
  ], 
  [
   276839, 
   null, 
   "James", 
   "\n This is partly because I think we are very aware that the concept of 'British values' is meaningless, because people from different subcultures, different class, different regions have conflicting values, at least those that go beyond basic human ones. \n\n I agree that the economic and cultural concerns of the \"average\" working man are hardly identical to the director in the boardroom. But there is a core of values that I believe most British people would say is meaningful to them.\n \n \n Absolutely not. I would fight and die in defence of my family, but if (a big if, in the UK) we were invaded I would try to get my family together and bugger off to Canada, or wherever. If that proved impossible, then I would fight the invasion, but only for the sake of my family.\n\n In the event of a foreign invasion, defence of one's family can hardly be separated from defence of the nation. If the country goes under, what will become of the individual's family?\n \n You might justify your willingness to fight an enemy on the grounds that you're only interested in the welfare of your family. This is what, I imagine, many soldiers have said (to themselves) when they've been called up. But personal motives hardly matter in the \"big picture\" which materialises when the country is at war. \n \n James.", 
   {}, 
   276730, 
   null, 
   1186499700.0
  ], 
  [
   276842, 
   null, 
   "Jo Bennett", 
   "If fighting for one's family and one's country were equivalent, why would governments spend so much energy promoting patriotism in wartime. The fact remains that throughout most of history until the 20th century, the lives of individuals were only minimally affected by invasion. Do you really think the life of the average serf changed drastically when William invaded England?", 
   {}, 
   276839, 
   null, 
   1186500300.0
  ], 
  [
   276851, 
   null, 
   "James", 
   " The fact remains that throughout most of history until the 20th century, the lives of individuals were only minimally affected by invasion. \n\n \n Have you never studied the history of the Thirty Years War (1618-1648) when almost the whole of central Europe was ruined by invasion and counter invasion in the struggle for mastery? The suffering and destruction was immense - even with the limited weapons available at that time. \n \n On the general idea of patriotism - which predictably you wish to discredit - it ought to be remembered (to paraphrase Orwell) that as you sleep safely in your bed dreaming your liberal dreams, rough men must stand ready to do violence on your behalf. \n \n James.", 
   {}, 
   276842, 
   null, 
   1186502700.0
  ], 
  [
   276897, 
   null, 
   "Phunting", 
   "Heh. I notice despite the thread being aimed at Yanks, everyone who has answered is British!\n \n Personally I consider myself a patriot. I love my country, I want it to do well, and I generally support it. The same can be said of my Rugby team, and I think the two equate. I know that my team is not inherently superior to any other (far from it with our current position emoticon_cry ) but I still enjoy belonging to them, and having them belong to me. I think this is a natural human response, and patriotism in such a form is harmless and probably healthy.\n \n The problem is when patriots, and sports fans, actually begin to believe their own words and hate other countries/ clubs because of their blind adherence. Fortunately most aren't stupid enough to go down this road.", 
   {}, 
   276851, 
   null, 
   1186513380.0
  ], 
  [
   276939, 
   null, 
   "sinjin", 
   "There is a distinction between patriotism and nationalism...\nNot much of one unless patriotism is simply a more PC term. Sort of like the difference between \"White Pride\" and \"White Supremecy\" IMO.", 
   {}, 
   276099, 
   null, 
   1186525800.0
  ], 
  [
   277026, 
   null, 
   "James", 
   "Not much of one unless patriotism is simply a more PC term. Sort of like the difference between \"White Pride\" and \"White Supremecy\" IMO.\n\n I don't agree. This is a tendentious sophistry.\n \n James.", 
   {}, 
   276939, 
   null, 
   1186562220.0
  ], 
  [
   277030, 
   null, 
   "Liminus", 
   "Very few invaders have the intention of killing the population, surely it depends who was invading?\n \n Attachment to a particular state is absurd as they are artificial constructs, look at the spread of celts across the western end of europe, celtic cultures survive in 6 countries, only one of which is an independent state. In any case, even if all states were nation states, it would still ignore the fundamental commonality of experience between people of the same class in different countries. The concerns of factory workers in Britain and Germany are likely to be closer to each other than they are to the concerns of, say, lawyers in either country.\n\n \n Absolutlely! I completely agree, and this is what leads me to question the idea of 'patriotism' because my 'country' consists of a huge variety of people who I will never know, whose goals and purposes (as opposed to values) I do not share.", 
   {}, 
   276731, 
   null, 
   1186564080.0
  ], 
  [
   277032, 
   null, 
   "Liminus", 
   "I agree that the economic and cultural concerns of the \"average\" working man are hardly identical to the director in the boardroom. But there is a core of values that I believe most British people would say is meaningful to them.\n\n \n But I would say that this so-called 'core of values' is common to the vast majority of humans and is therefore not something that can be called upon as 'British' values.\n \n \n \nIn the event of a foreign invasion, defence of one's family can hardly be separated from defence of the nation. If the country goes under, what will become of the individual's family?\n\n \n Well that was kind of my point. Your second sentence above assumes that I and my family cannot get out of the country before it's too late!\n \n \nYou might justify your willingness to fight an enemy on the grounds that you're only interested in the welfare of your family. This is what, I imagine, many soldiers have said (to themselves) when they've been called up. But personal motives hardly matter in the \"big picture\" which materialises when the country is at war. \n\n \n Oh, it 'materialises' does it? Pray tell, seeing as we are at war, what has materialised for you that has not for me?\n \n ON EDIT: I should add that the Orwell quote is very applicable to modern society, but that does not mean that it is applicable to me. Maybe that is due to my dissatisfaction with modern society, and the obvious class-based inequalities within the nation that outstrip any national brotherhood?", 
   {}, 
   276839, 
   null, 
   1186564320.0
  ], 
  [
   277087, 
   null, 
   "sinjin", 
   "I don't agree. This is a tendentious sophistry.\n \n James.\n\"Tendentious sophistry\"? I had to look that up. Thanks. A \"patriot\" is what your nationalist countrymen call you when you volunteer.", 
   {}, 
   277026, 
   null, 
   1186594860.0
  ], 
  [
   277090, 
   null, 
   "Symbiote", 
   "A patriot is someone who wants the best for their country.\n \n A nationalist is someone who wants the best for their country, and believes that to achieve this requires doing harm to other peoples' countries.\n \n If you do not see a distinction between the two, then it would seem you agree with the nationalists, that the way for one nation to prosper is to harm others, eg by going to war for resources, by blocking their exports from entering your country.\n \n The classical liberals were certainly patriots, but they believed that the road to prosperity was built on peace and trade with other nations. Their opponents were the nationalists.\n \n Nationalism prospers precisely because of this false belief, that to prosper you must do harm, and though you may consider yourself anti-nationalist, if you propagate this falsity, you will fuel nationalism. There is nothing wrong with patriotism, there is plenty wrong with nationalism, because it is built on a false premise.", 
   {}, 
   277087, 
   null, 
   1186595280.0
  ], 
  [
   277108, 
   null, 
   "sinjin", 
   "A patriot is someone who wants the best for their country.\n \n A nationalist is someone who wants the best for their country, and believes that to achieve this requires doing harm to other peoples' countries.\n \n If you do not see a distinction between the two, then it would seem you agree with the nationalists, that the way for one nation to prosper is to harm others, eg by going to war for resources, by blocking their exports from entering your country.\n \n The classical liberals were certainly patriots, but they believed that the road to prosperity was built on peace and trade with other nations. Their opponents were the nationalists.\n \n Nationalism prospers precisely because of this false belief, that to prosper you must do harm, and though you may consider yourself anti-nationalist, if you propagate this falsity, you will fuel nationalism. There is nothing wrong with patriotism, there is plenty wrong with nationalism, because it is built on a false premise.\nOf course this presumes that a country can prosper without it being at the expense of some other country(s).\n \n nationalist -\n \n 1. one who loves and defends his or her country [syn: patriot] \n \n WordNet&#174; 3.0 \n &#169; 2006 Princeton University\n Published by Princeton University. All rights reserved.\n \n \n patriot -\n \n * one who loves, supports, and defends one's country. \n \n American Heritage Dictionary", 
   {}, 
   277090, 
   null, 
   1186599720.0
  ], 
  [
   277112, 
   null, 
   "sinjin", 
   "What is patriotism? \n \n Patriotism is the last refuge of a scoundrel.\n \n -Samuel Johnson.", 
   {}, 
   277108, 
   null, 
   1186600380.0
  ], 
  [
   288455, 
   null, 
   "RudyRocker", 
   "I don't think you are correct in saying that terms equivalent to anti-americanism have not been used elsewhere. Accuse elderly germans of \"anti-germanism\", ditto for italians, or start chatting about \"anti-sovietism\" in an eastern european old peoples home. See what kinds of reactions you get.\n \n If you are interested in a scholarly analysis of nationalism and patriotism as cultural phenomenon, and in particular how they developed, Benedict Anderson's Imagined Communities is brilliant.", 
   {}, 
   277112, 
   null, 
   1192941540.0
  ], 
  [
   288464, 
   null, 
   "Mucusaur", 
   "Patriotism is obeying all the rules - the antithesis of Hiccadoola", 
   {}, 
   288455, 
   null, 
   1192969260.0
  ], 
  [
   288493, 
   null, 
   "unkerpaulie", 
   "The problem is when patriots, and sports fans, actually begin to believe their own words and hate other countries/ clubs because of their blind adherence. Fortunately most aren't stupid enough to go down this road.\n\n actually reality suggests that a significant number of people do go down this road. thats exactly what liminus is pointing out. if the country is at war with another country, you would be immediately and unanimously labelled unpatriotic if you had ANY feelings other than hatred for that country. the label also extends to anybody who doesnt fully worship all american leaders, policies, historical figures and inanimate objects that represent abstract aspects of america", 
   {}, 
   276897, 
   null, 
   1192998420.0
  ], 
  [
   288740, 
   null, 
   "Winston Smith", 
   "this is because Bush and Co. have convinced the majority of the people that he is the embodiment of America. So to criticise him is to be a traitor.\n \n It is unbelievable that he managed to link Hussein with 9/11 and to have gone to war on the strength of lies. But he did.\n \n He perverted and misused patriotic sentiment.", 
   {}, 
   288493, 
   null, 
   1193185080.0
  ], 
  [
   289089, 
   null, 
   "Aivlis", 
   "Anybody who blindly believes what their government tells them without question is unpatriotic. You cannot be a patriot unless you feel comfortable with criticizing your government. Here are some interesting quotes on patriotism:\n \n \nEMMA GOLDMAN: \n Patriotism ... is a superstition artificially created and maintained through a network of lies and falsehoods; a superstition that robs man of his self-respect and dignity, and increases his arrogance and conceit.\n \n G. K. CHESTERTON: \n \"My country, right or wrong\" is a thing no patriot would ever think of saying except in a desperate case. It is like saying \"My mother, drunk or sober.\"\n \n GEORGE BERNARD SHAW: \n Patriotism is your conviction that this country is superior to all others because you were born in it.\n \n GOETHE: \n Patriotism ruins history.\n \n H. L. MENCKEN: \n The notion that a radical is one who hates his country is naïve and usually idiotic. He is, more likely, one who likes his country more than the rest of us, and is thus more disturbed than the rest of us when he sees it debauched. He is not a bad citizen turning to crime; he is a good citizen driven to despair.\n \n H. L. MENCKEN: \n In the United States, doing good has come to be, like patriotism, a favorite device of persons with something to sell.\n \n HENRY STEELE COMMAGER: \n Men in authority will always think that criticism of their policies is dangerous. They will always equate their policies with patriotism, and find criticism subversive.\n \n JAMES BALDWIN: \n I love America more than any other country in this world, and, exactly for this reason, I insist on the right to criticize her perpetually.\n \n For more quotes visit http://www.wisdomquotes.com/cat_patriotism.html\n \n\n \n my personal favorites in bold.", 
   {}, 
   288740, 
   null, 
   1193430540.0
  ], 
  [
   289244, 
   null, 
   "Winston Smith", 
   "there is patriotism and then there is misguided patriotism", 
   {}, 
   289089, 
   null, 
   1193641260.0
  ], 
  [
   289373, 
   null, 
   "Phunting", 
   "this is because Bush and Co. have convinced the majority of the people that he is the embodiment of America. So to criticise him is to be a traitor.\n \n It is unbelievable that he managed to link Hussein with 9/11 and to have gone to war on the strength of lies. But he did.\n \n He perverted and misused patriotic sentiment.\nUtterly. What is seen in the states is not patriotism, it is being blinded and manipulated.", 
   {}, 
   288740, 
   null, 
   1193798520.0
  ], 
  [
   296823, 
   null, 
   "tell-tale", 
   "Just face it, our Britain is seen throughout the world as a safe place for every crook, illegal immigrant, political asylum seeker, including even terrorists of various sorts. Take, for instance, growing number of extradition requests from only Poland for criminals, who are suspected of such serious crimes in their native country, as murder, rape, robbery, burglary or drugs. In the last 12 months, officers from our Metropolitan Police's Extradition Unit have been asked to track down 257 Poles across the UK (dailymail.co.uk/pages/live/articles/news/worldnews.html?in_article_id=504532&in_page_id=1811). All of them have found shelter with this country. Why did they prefer Great Britain, not Spain or Germany? \n And what about those terrorist leaders, who lost their citizenship long ago and, by this time, have turned into international killers? Look, for example, at Y. Ahmadov, whose name has recently come to light in connection with discovered attempt on life of B. Patarkatsishvili, a Georgian tycoon, who decided to suggest himself for Georgian president now (htt://timesonline.co.uk/tol/news/uk/crime/acticle3087485.ece). \n It is understatement to say that this Chechen mercenary has prepared realization of his bloody plans on the territory of this country. Our special services have been unable to prevent his appearance in the state, whose citizens he headhunted in far Chechnya just in the 90-s years! \n Thus, one can arrive at a conclusion that our SIS officers may even have some contacts with such cutthroats as Mr. Ahmadov, using them for solving certain own problems. For crying out loud! How much should British people exercise patience towards regular bandits like Y. Ahmadov, whose hands are stained with blood of 4 of our country fellows? Well, our authorities grant them political asylum only because our special services are not qualified enough for maintenance of own country's security...", 
   {
    "unicode_changes_made": true
   }, 
   277112, 
   null, 
   1200066000.0
  ], 
  [
   297931, 
   null, 
   "cap2b", 
   "Whatever \"patriotism\" may be, this\n \n http://www.rockymountainnews.com/news/2008/jan/18/rosen-the-virtue-of-patriotism/\n \n is not it.:xbanghead", 
   {}, 
   296823, 
   null, 
   1200701580.0
  ], 
  [
   299542, 
   null, 
   "jitobear", 
   "\"Patriotism is supporting your country all the time, and your government when it deserves it.\" - Mark Twain", 
   {
    "unicode_changes_made": true
   }, 
   297931, 
   null, 
   1201822620.0
  ], 
  [
   299543, 
   null, 
   "Ghost Rider", 
   "Patriotism is refusing to tolerate the way things currently are in this country and demanding things change for the better, and not being afraid to back up our demands!", 
   {}, 
   299542, 
   null, 
   1201822740.0
  ], 
  [
   299773, 
   null, 
   "snakespit", 
   "\"Patriotism is wanting the best for your nation, and being willing to make personal sacrifice to achieve it.\" -?", 
   {}, 
   299543, 
   null, 
   1201954140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is patriotism?", 
  "url": "http://www.4forums.com/political/government-debates/10177-what-patriotism.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 10177, 
  "discussion_files": [
   [
    "3979.html", 
    "http://www.4forums.com/political/government-debates/10177-what-patriotism-print.html"
   ], 
   [
    "3980.html", 
    "http://www.4forums.com/political/government-debates/10177-what-patriotism-2-print.html"
   ]
  ], 
  "identifier": 10177
 }
]