[
 [
  [
   275907, 
   null, 
   "gman", 
   "MARICOPA ARIZONA COUNTY SHERIFF\n KEEPS GETTING ELECTED OVER AND OVER\n \n THIS IS WHY:\n \n Sheriff Joe Arpaio (in Arizona) who created the \"tent city jail\":\n \n He has jail meals down to 40 cents a serving ! and charges the inmates for them.\n \n He stopped smoking and porno magazines in the jails. Took away their weights. Cut off all but \"G\" movies.\n \n He started chain gangs so the inmates could do free work on county and city projects.\n \n Then he started chain gangs for women so he wouldn't get sued for discrimination.\n \n He took away cable TV until he found out there was a federal court order that required cable TV for jails so he hooked up the cable TV again with only the Disney channel and the weather channel.\n \n When asked why the weather channel he replied, so they will know how hot it's gonna be while they are working on my chain gangs.\n \n He cut off coffee since it has zero nutritional value and saved the county over $90,000 a year.\n \n When the inmates complained, he told them, \"This isn't the Ritz/Carlton -- If you don't like it, don't come back.\"\n \n He bought Newt Gingrich's lecture series on tape that he pipes into the jails.\n \n When asked by a reporter if he had any lecture series by a Democrat, he replied that a democratic lecture series might explain why a lot of the inmates were in his jails in the first place.\n \n More on the Arizona Sheriff:\n \n With temperatures being even hotter than usual in Phoenix (116 degrees just set a new record), the Associated Press reports: About 2,000 inmates living in a barbed-wire-surrounded tent encampment at the Maricopa County Jail have been given permission to strip down to their government-issued pink boxer shorts\n \n On Wednesday, hundreds of men wearing boxers were either curled up on their bunk beds or chatted in the tents, which reached 138 degrees inside the week before.\n \n Many were also swathed in wet, pink towels as sweat collected on their chests and dripped down to their pink socks.\n \n \"It feels like we are in a furnace,\" said James Zanzot, an inmate who has lived in the tents for 1 year . \"It's inhumane.\"\n \n Joe Arpaio, the sheriff who created the tent city and long ago started making his prisoners wear pink, and eat bologna sandwiches, is not one bit sympathetic. He said Wednesday that he told all of the inmates: \"It's 120 degrees in Iraq and our soldiers are living in tents too, and they have to wear full battle gear, but they didn't commit any crimes, so shut your damned mouths!\"\n \n Maybe if all prisons were like this one there would be a lot less crime and/or repeat offenders. Criminals should be punished for their crimes - not live in luxury until it's time for their parole, only to go out and commit another crime so they can get back in to live on taxpayers' money and enjoy things taxpayers can't afford to have for themselves.", 
   {
    "post_info": {
     "post_title": "Appropiate, effective punishment"
    }
   }, 
   null, 
   null, 
   1185942000.0
  ], 
  [
   276114, 
   null, 
   "Unriggable", 
   "Keep in mind that not everybody actually did commit the crimes, some of them are innocent. Besides, its not luxury living at 100 degrees.", 
   {}, 
   275907, 
   null, 
   1186077600.0
  ], 
  [
   276127, 
   null, 
   "Steeeeve", 
   "I think many of the ideas this guy had are good but the heat one is a little much. Those inmates aren't there for a death sentence and 138 degrees and lead to one really quickly if you aren't careful. The cable TV restrictions, diet restrictions, and working I think are good ideas. Get them on a healthy diet would be a good one too and perhaps that might help with health care costs :)", 
   {}, 
   276114, 
   null, 
   1186081200.0
  ], 
  [
   276145, 
   null, 
   "Aivlis", 
   "This guy is awesome...I love it!\n \n Although, the heat could cause heat stroke and potentially it could be lethal...maybe put on some AC to make the temp a nice 98 deg. Still hot : ) make 'em sweat.\n \n I agree whole-heartedly with what he is doing with his jail and I think all other jails should follow his example...Although, I love how he makes 'em wear pink and watch the disney channel hahahaha", 
   {}, 
   276127, 
   null, 
   1186088940.0
  ], 
  [
   276174, 
   null, 
   "snakespit", 
   "I think many of the ideas this guy had are good but the heat one is a little much. Those inmates aren't there for a death sentence and 138 degrees and lead to one really quickly if you aren't careful.\n\n Oh...come on, It's a dry heat...so 138 really only feels like 108. That's not too bad. From what I understand, they get all the cool water they want. As long as they drink it, there is really no danger. \n \n This guy is my hero. I just wish his ideas and methods would catch on in more places.", 
   {}, 
   276127, 
   null, 
   1186099560.0
  ], 
  [
   276220, 
   null, 
   "Iuris", 
   "Well, remember all the support shown now the next time you are caught speeding or some such criminal activity.\n \n Oh, yes, but of course \"Those guy are all murderers and rapists\", that makes sense. Just hope your speeding on a slippery road doesn't make you lose control and run into a pedestrian on the side...\n \n It's so easy to gloat at the \"criminals\". So easy to forget they're human too.", 
   {}, 
   276174, 
   null, 
   1186131600.0
  ], 
  [
   276233, 
   null, 
   "snakespit", 
   "Well, remember all the support shown now the next time you are caught speeding or some such criminal activity.\n\n They don't typically throw you in jail for speeding. \n \n \nOh, yes, but of course \"Those guy are all murderers and rapists\", that makes sense. Just hope your speeding on a slippery road doesn't make you lose control and run into a pedestrian on the side...\n\n If I am speeding and I kill someone, then I deserve to go to jail. I might not like it, but I deserve it. And yes, I know that a lot of people in jail or prison are not \"bad\" people. They are simply good people who got caught up in a bad set of circumstances or where in the wrong place at the wrong time. However, that does not change the fact that they were found guilty of a crime, and as such, belong in jail to serve their sentence. Accidents are one thing, criminal acts are another.", 
   {}, 
   276220, 
   null, 
   1186154340.0
  ], 
  [
   276246, 
   null, 
   "Zardoz", 
   "Some of his methods are good, some are too extreme. \n \n I've always thought that short sentences should be hard ones so as to make it so you don't want to return.\n \n The longer you are imprisoned, the easier it would be (to prevent some from going crazy and lashing out) until you reach the 20 year sentence mark and be deemed irrevocably unredeemable and sentenced to death.", 
   {}, 
   276233, 
   null, 
   1186162860.0
  ], 
  [
   276627, 
   null, 
   "andjustice4all", 
   "Maybe if all prisons were like this one there would be a lot less crime and/or repeat offenders. Criminals should be punished for their crimes - not live in luxury until it's time for their parole, only to go out and commit another crime so they can get back in to live on taxpayers' money and enjoy things taxpayers can't afford to have for themselves.\n\n \n During my undergrad days I remember watching a documentary on this guy. It's all a political stunt so he can make a name for himself, which he definitely has accomplished! However, the one question remains, how have his punitive tactics affected the crime rate in Maricopa County? Do you have any numbers?", 
   {}, 
   275907, 
   null, 
   1186416540.0
  ], 
  [
   276632, 
   null, 
   "Symbiote", 
   "The statistics will tell you whether reported crime goes up or down, but will not give you cause and effect. This is why pro and anti gun ownership debates never go anywhere.", 
   {}, 
   276627, 
   null, 
   1186418460.0
  ], 
  [
   276737, 
   null, 
   "snakespit", 
   "During my undergrad days I remember watching a documentary on this guy. It's all a political stunt so he can make a name for himself, which he definitely has accomplished! However, the one question remains, how have his punitive tactics affected the crime rate in Maricopa County? Do you have any numbers?\n\n \n Crime statistics are easily available if you want to look them up. \n \n And actually, the Tent City Jal was put in place because Arpaio did not want to release inmates back into public due to jail overcrowding before their sentences were served. Contrary to what many believe, this is not the only jail in Phoenix...it is actually 1 out of 8 total. And whether us non-residents of Maricopa County like it or not, he maintains a high popularity amongst his constituents. He must be doing something right.", 
   {}, 
   276627, 
   null, 
   1186446900.0
  ], 
  [
   276807, 
   null, 
   "daewoo", 
   "Crime statistics are easily available if you want to look them up. \n \n And actually, the Tent City Jal was put in place because Arpaio did not want to release inmates back into public due to jail overcrowding before their sentences were served. Contrary to what many believe, this is not the only jail in Phoenix...it is actually 1 out of 8 total. And whether us non-residents of Maricopa County like it or not, he maintains a high popularity amongst his constituents. He must be doing something right.\n\n \n But it is the primary minimum security jail. Inmates in tent city are shoplifters, DUI offenders, folks who didn't pay speeding tickets, people who got caught with a joint. Murderers, rapists, and gang members are in the real jails (actual buildings) with cable TV, air conditioning, and coffee carts. \n \n Sheriff Joe is a JOKE. His tent city is nothing but a publicity stunt. That is all it has ever been.\n \n the phoenix news times dogs him pretty relentlessly...mostly because he is a scumbag.\n \n I don't necessarily disagree with the idea of the tent city prison. It jsut seems that if you are going to do something like that, MAYBE DUI offenders are not the ones to toss in there. Also, it would be interesting to see if it is actually useful. \n \n Contrary to the inferrence of the posted claims, tent city ultimatly has cost the county a lot more than a regular jail. What they have saved in jail costs they have MORE than lost in lawsuits because in order to keep jail costs down, it has been badly understaffed and neglected. Due to sucessful wrongful death lawsuits, the counties insurance decustibal has gone from an aggregate $1 million per year, to $5 million PER INCIDENT. The latest verdict (that I am aware of) was last year...$9 million becuase a bunch of his jailers killed a guy strapping him in a restraint chair:\n \n http://www.phoenixnewtimes.com/2006-03-30/news/the-cost-of-cruelty/\n \n Use the search function there are search his name. You can spend hours reading about what a scumbag he is. They have actually won several state and national awards for reproting on what a scumbag he is...largely becuase he has done everything in his power to shut them up and they have persisted.\n \n I would not be opposed to spending a little more on tent city type jails if they actually worked, but it does not appear to me that they do. as far as I can tell crime in sheriff jokes jurisdiction has roughly tracked with crime nationwide, and their repeat offender rate seems to be about the same.", 
   {}, 
   276737, 
   null, 
   1186468320.0
  ], 
  [
   276941, 
   null, 
   "jim's trucking", 
   "But it is the primary minimum security jail. Inmates in tent city are shoplifters, DUI offenders, folks who didn't pay speeding tickets, people who got caught with a joint. Murderers, rapists, and gang members are in the real jails (actual buildings) with cable TV, air conditioning, and coffee carts. \n \n Sheriff Joe is a JOKE. His tent city is nothing but a publicity stunt. That is all it has ever been.\n \n the phoenix news times dogs him pretty relentlessly...mostly because he is a scumbag.\n \n I don't necessarily disagree with the idea of the tent city prison. It jsut seems that if you are going to do something like that, MAYBE DUI offenders are not the ones to toss in there. Also, it would be interesting to see if it is actually useful. \n \n Contrary to the inferrence of the posted claims, tent city ultimatly has cost the county a lot more than a regular jail. What they have saved in jail costs they have MORE than lost in lawsuits because in order to keep jail costs down, it has been badly understaffed and neglected. Due to sucessful wrongful death lawsuits, the counties insurance decustibal has gone from an aggregate $1 million per year, to $5 million PER INCIDENT. The latest verdict (that I am aware of) was last year...$9 million becuase a bunch of his jailers killed a guy strapping him in a restraint chair:\n \n http://www.phoenixnewtimes.com/2006-03-30/news/the-cost-of-cruelty/\n \n Use the search function there are search his name. You can spend hours reading about what a scumbag he is. They have actually won several state and national awards for reproting on what a scumbag he is...largely becuase he has done everything in his power to shut them up and they have persisted.\n \n I would not be opposed to spending a little more on tent city type jails if they actually worked, but it does not appear to me that they do. as far as I can tell crime in sheriff jokes jurisdiction has roughly tracked with crime nationwide, and their repeat offender rate seems to be about the same.\n\n The article mentions two jailhouse deaths, but does not mention the tent city jail. It appears those problems occurred in a real jailhouse. Do you have some argument against the tent city jail besides the moanings of liberals who think convicts should have all the comforts of home?", 
   {}, 
   276807, 
   null, 
   1186525920.0
  ], 
  [
   277011, 
   null, 
   "daewoo", 
   "The article mentions two jailhouse deaths, but does not mention the tent city jail. It appears those problems occurred in a real jailhouse. Do you have some argument against the tent city jail besides the moanings of liberals who think convicts should have all the comforts of home?\n\n \n HUH? Any more arguments? No...it costs more and does not work is about all I feel I need to say. As I said, I would not be opposed to tent city type jails if they WORKED, but they don't. They just cost more money.\n \n At one time I thought that cheriff joke was just the bees knees. He pretty much lost my support in about 2002. At that point, there were 15,000 lawsuits against him, the county was loosing about 80% of them, he was 9 million over budget, and the county was putting him on a line item budget because he was spending so much. Then I took a little harder look and found that most of the claims made by him were BS. The \"40 cents per meal\" is total ####...the prisoners at tent city eat exactly what inmated in other jails eat, the vast majority of their food is donated, and his 40 cents per meal is ONLY the food, not prep staff time, support, etc... \n \n One of my projects after I retired was starting a food kitchen. Our meals only cost about 20 cents each to provide..if you count JUST the cost of the food portion...and 3 nights a week we have steak (there are advantages to having a local meat packing plant). When your food is mostly free, and that is all you count, you can really feed people \"cheap\"\n \n The guy is a scumbag, his ideas don't work. I don't particulalrly care about the humanity of the situation. That is a moral value and moral values are flexible. All I care about is what works and what doesn't. The only 2 things that we actually KNOW for sure work to prevent repeat criminal offenses are education and sealing records or making it illegal for employers to inquire about cirminal convictions. Since those 2 WE KNOW work, I support them. IF you want to support multi million loosers that don't work, more power to you, but don't try to claim that you are taking the conservative position. Traditionally conservatives are opposed to flushing millions of dollars down the toilet.", 
   {}, 
   276941, 
   null, 
   1186549800.0
  ], 
  [
   277434, 
   null, 
   "grammy", 
   "I like Sheriff Joe. I have done no research, but I would bet that Maricopa County is not the only place in the country with jailhouse lawsuits.\n \n As for the heat - we are not talking 365 days year, here. I think we had something like 21 days over 110 this summer, and that was more than normal. As far as I am concerned, when all the law-abiding citizens of Maricopa County have A/C to keep them comfortable, then we can address the issue of keeping criminals comfortable.", 
   {}, 
   277011, 
   null, 
   1186704540.0
  ], 
  [
   277507, 
   null, 
   "andjustice4all", 
   "I like Sheriff Joe. I have done no research, but I would bet that Maricopa County is not the only place in the country with jailhouse lawsuits.\n \n As for the heat - we are not talking 365 days year, here. I think we had something like 21 days over 110 this summer, and that was more than normal. As far as I am concerned, when all the law-abiding citizens of Maricopa County have A/C to keep them comfortable, then we can address the issue of keeping criminals comfortable.\n\n \n See, it's this type of perception/attitude that continues to drive the \"get tough on crime\" movement. You said it yourself, that is, you haven't been made aware of the facts. Why base an opinion on false perceptions?? Just because it makes us (free society) feel better when criminals are harshly punished for their wrongdoing, doesn't necessarily mean that it's appropriate or effective. In most cases, such methods are neither appropriate or effective.\n \n C'mon, America...wake up!! Take more pride in forming an educated opinion on serious matters. Don't be ignorant any longer!!!", 
   {}, 
   277434, 
   null, 
   1186758420.0
  ], 
  [
   277513, 
   null, 
   "grammy", 
   "See, it's this type of perception/attitude that continues to drive the \"get tough on crime\" movement. You said it yourself, that is, you haven't been made aware of the facts. Why base an opinion on false perceptions?? Just because it makes us (free society) feel better when criminals are harshly punished for their wrongdoing, doesn't necessarily mean that it's appropriate or effective. In most cases, such methods are neither appropriate or effective.\n \n C'mon, America...wake up!! Take more pride in forming an educated opinion on serious matters. Don't be ignorant any longer!!!\nThe lawsuit article that daewoo noted was not even related to tent city. But the fact that there are lawsuits against sheriff joe doesn't indicate that he is doing anything wrong - there are lawsuits against jailhouses all across the country, and only a small percentage actually have merit: http://www.ojp.usdoj.gov/bjs/abstract/ccopaj.htm\n \n I have no issues with actually PUNISHING criminals for the sake of PUNISHMENT. If you ask me, cruel and unusual has gone way overboard in this politically correct society. As for effective, this certainly depends on what you mean. But I can tell you that a friend of mine's DH was in tent city, and it was certainly effective with him. It wasn't even the heat - it was the pink...", 
   {}, 
   277507, 
   null, 
   1186759560.0
  ], 
  [
   277522, 
   null, 
   "Archangel", 
   "See, it's this type of perception/attitude that continues to drive the \"get tough on crime\" movement. You said it yourself, that is, you haven't been made aware of the facts. Why base an opinion on false perceptions?? Just because it makes us (free society) feel better when criminals are harshly punished for their wrongdoing, doesn't necessarily mean that it's appropriate or effective. In most cases, such methods are neither appropriate or effective.\n \n C'mon, America...wake up!! Take more pride in forming an educated opinion on serious matters. Don't be ignorant any longer!!!\n\n \n What is WRONG with getting tough on criminals again ? Cuz I don't understand your complaint. Can you point to any Law that say's that says that criminals who deprive others of their rights and property don't deserve to be actually punished rather than just housed by the State with all of the comforts of home for a period of time ?\n \n Where's the deterrent in just placing men in jails where they can network and perfect their craft as if they're in a Social Club with a Gym ? Punishment and paying a real price that is burnt into ones memory that Prison sucks is the best deterrent to recidivism. And why do you refer to the law abiding citizens in our Society as the free society ? We are free because we don't commit felonies. But many of us are victims of felons and therefore lack the empathy of one who has suffered the consequences of breaking the laws of the land. Is that what your complaint is based upon ? Empathy from first hand experience ?", 
   {}, 
   277507, 
   null, 
   1186762500.0
  ], 
  [
   277545, 
   null, 
   "JPSartre12", 
   "President Joe Arpaio has a nice ring to it. emoticon_xagree", 
   {}, 
   277522, 
   null, 
   1186770960.0
  ], 
  [
   277575, 
   null, 
   "jim's trucking", 
   "President Joe Arpaio has a nice ring to it. emoticon_xagree\nI don't know that he's qualified for that post, but we do need more sheriffs like him.\n \n Here's another sheriff story that makes me smile.\n \n http://www.snopes.com/crime/cops/judd.asp", 
   {}, 
   277545, 
   null, 
   1186774740.0
  ], 
  [
   278533, 
   null, 
   "thecap0", 
   "jim's\n \n I don't know that he's qualified for that post, but we do need more sheriffs like him.\n \n Thus proving yet once more that the so-called \"Law and Order\" types are really Maoists who believe that all power comes out of the barrel of a gun.\n I hope you never get pulled over by some trigger-happy pig with a tin badge (as opposed to the vast majority of cops who do a dangerous job bravely and well)", 
   {}, 
   277575, 
   null, 
   1187233380.0
  ], 
  [
   278550, 
   null, 
   "Archangel", 
   "jim's\n \n I don't know that he's qualified for that post, but we do need more sheriffs like him.\n \n Thus proving yet once more that the so-called \"Law and Order\" types are really Maoists who believe that all power comes out of the barrel of a gun.\n I hope you never get pulled over by some trigger-happy pig with a tin badge (as opposed to the vast majority of cops who do a dangerous job bravely and well)\n\n \n What do you mean by your barrel of a gun comment ? Can you post where Arpaio has executed prisoners by firing squad ? All he's done is make their incarceration hell on Earth and made them think twice before doing anything to end up back in there. Now what is wrong with that agenda ?\n \n And by the way capo, do you know how to use the quote feature ? It's a real neat way to quote other people and separate what they say from your response. Here's how it works. \n \n \nThe third button from the right just above the posting window is the quote button. It looks like a page with writing on it. Just click on it and copy and paste the part of your oponents statement within it. Or you can just click on the quote button on the bottom right of any post to quote the whole post. Give it a shot.\n", 
   {}, 
   278533, 
   null, 
   1187242860.0
  ], 
  [
   278558, 
   null, 
   "chemist99a", 
   "All he's done is make their incarceration hell on Earth and made them think twice before doing anything to end up back in there. Now what is wrong with that agenda ?\n\n \n Simple - cruel and unusual punishment is illegal under the constitution. I assume that the term \"hell on earth\" would mandate cruel and unusual punishment. I have worked with people who were in super-max prisons and believe me its cruel and unusual to turn a persons mind into swiss cheese like that.", 
   {}, 
   278550, 
   null, 
   1187249100.0
  ], 
  [
   278560, 
   null, 
   "chemist99a", 
   "He bought Newt Gingrich's lecture series on tape that he pipes into the jails.\n\n \n That of course goes well beyond the line in being cruel and unusual. And of course it DOES turn brains into the equivalent of swiss cheese. Witness Ann Coulter for example.", 
   {}, 
   277434, 
   null, 
   1187249280.0
  ], 
  [
   278591, 
   null, 
   "thecap0", 
   "A,\n \n All he's done is make their incarceration hell on Earth and made them think twice before doing anything to end up back in there. Now what is wrong with that agenda ?\n \n Nothing at all, of course. The Prince of Peace whom you cite in your tag would have heartily approved of his denying the humanity of the men under his control. After all, it is the good sheriff's place, and not the Master's, to determine who is placed in Hell.\n BTW, I prefer my way of citing folks' postings. That way, they come straight from the horse's...er...mouth.", 
   {
    "post_info": {
     "post_title": "Wwjd?"
    }
   }, 
   278560, 
   null, 
   1187262120.0
  ], 
  [
   278890, 
   null, 
   "grammy", 
   "Simple - cruel and unusual punishment is illegal under the constitution. I assume that the term \"hell on earth\" would mandate cruel and unusual punishment. I have worked with people who were in super-max prisons and believe me its cruel and unusual to turn a persons mind into swiss cheese like that.\nthis is a medium security jail - and where does it say anything about swiss cheese or anything of the sort? The tent city jail is just another jail - medium security. The ONLY differences are they sleep in tents and they do not have A/C. If that is cruel and unusual, then there is something severely wrong with that concept. Unless of course making them wear pink underwear is somehow cruel and unusual, in which case there is even MORE wrong with that concept. \n \n The big difference between Sheriff Joe and most sheriff's is that he has no issues with actually PUNISHING criminals. He does not run a hotel service, he runs a JAIL.", 
   {}, 
   278558, 
   null, 
   1187393640.0
  ], 
  [
   278892, 
   null, 
   "grammy", 
   "his denying the humanity of the men under his control\nwhat are you talking about? He doesn't provide A/C, so that is somehow denying the humanity? GET REAL !!!", 
   {}, 
   278591, 
   null, 
   1187393700.0
  ], 
  [
   279166, 
   null, 
   "fjp8000", 
   "MARICOPA ARIZONA COUNTY SHERIFF\n KEEPS GETTING ELECTED OVER AND OVER\n \n THIS IS WHY:\n \n Sheriff Joe Arpaio (in Arizona) who created the \"tent city jail\":\n \n He has jail meals down to 40 cents a serving ! and charges the inmates for them.\n \n He stopped smoking and porno magazines in the jails. Took away their weights. Cut off all but \"G\" movies.\n \n He started chain gangs so the inmates could do free work on county and city projects.\n \n Then he started chain gangs for women so he wouldn't get sued for discrimination.\n \n He took away cable TV until he found out there was a federal court order that required cable TV for jails so he hooked up the cable TV again with only the Disney channel and the weather channel.\n \n When asked why the weather channel he replied, so they will know how hot it's gonna be while they are working on my chain gangs.\n \n He cut off coffee since it has zero nutritional value and saved the county over $90,000 a year.\n \n When the inmates complained, he told them, \"This isn't the Ritz/Carlton -- If you don't like it, don't come back.\"\n \n He bought Newt Gingrich's lecture series on tape that he pipes into the jails.\n \n When asked by a reporter if he had any lecture series by a Democrat, he replied that a democratic lecture series might explain why a lot of the inmates were in his jails in the first place.\n \n More on the Arizona Sheriff:\n \n With temperatures being even hotter than usual in Phoenix (116 degrees just set a new record), the Associated Press reports: About 2,000 inmates living in a barbed-wire-surrounded tent encampment at the Maricopa County Jail have been given permission to strip down to their government-issued pink boxer shorts\n \n On Wednesday, hundreds of men wearing boxers were either curled up on their bunk beds or chatted in the tents, which reached 138 degrees inside the week before.\n \n Many were also swathed in wet, pink towels as sweat collected on their chests and dripped down to their pink socks.\n \n \"It feels like we are in a furnace,\" said James Zanzot, an inmate who has lived in the tents for 1 year . \"It's inhumane.\"\n \n Joe Arpaio, the sheriff who created the tent city and long ago started making his prisoners wear pink, and eat bologna sandwiches, is not one bit sympathetic. He said Wednesday that he told all of the inmates: \"It's 120 degrees in Iraq and our soldiers are living in tents too, and they have to wear full battle gear, but they didn't commit any crimes, so shut your damned mouths!\"\n \n Maybe if all prisons were like this one there would be a lot less crime and/or repeat offenders. Criminals should be punished for their crimes - not live in luxury until it's time for their parole, only to go out and commit another crime so they can get back in to live on taxpayers' money and enjoy things taxpayers can't afford to have for themselves.\n\n \n He is my kind of guy. More power to him!", 
   {}, 
   275907, 
   null, 
   1187492580.0
  ], 
  [
   279242, 
   null, 
   "thecap0", 
   "fjp,\n \n He is my kind of guy. More power to him!\n \n The barbarians of the world from Jengis Khan to Vlad the Impaler to Henry Wirz to Idi Amin salute you!", 
   {}, 
   279166, 
   null, 
   1187535300.0
  ], 
  [
   291363, 
   null, 
   "gman", 
   "fjp, \n \n The barbarians of the world from Jengis Khan to Vlad the Impaler to Henry Wirz to Idi Amin salute you!\n\n \n You're comparing an officer of the law who's tactics work toward making prison life an effective deterrent to the barbarians of the world?", 
   {}, 
   279242, 
   null, 
   1195856340.0
  ], 
  [
   291371, 
   null, 
   "thecap0", 
   "gman,\n \n You're comparing an officer of the law who's tactics work toward making prison life an effective deterrent to the barbarians of the world?\n \n Absolutely! A barbarian is a barbarian is a barbarian.\n \n \n \n Why do we kill people to teach people that killing people is wrong?emoticon_frazzled", 
   {}, 
   291363, 
   null, 
   1195863840.0
  ], 
  [
   291422, 
   null, 
   "JPSartre12", 
   "gman,\n \n You're comparing an officer of the law who's tactics work toward making prison life an effective deterrent to the barbarians of the world?\n \n Absolutely! A barbarian is a barbarian is a barbarian.\n \n \n \n Why do we kill people to teach people that killing people is wrong?emoticon_frazzled\n\n \n We execute criminals as punishment for their crime, not to teach them. Dead men aren't supposed to learn squat. emoticon_xagree", 
   {}, 
   291371, 
   null, 
   1195944000.0
  ], 
  [
   291436, 
   null, 
   "E Mutz", 
   "The barbarians of the world from Jengis Khan to Vlad the Impaler to Henry Wirz to Idi Amin salute you!\n \n My you do have it in for Henry Wirz don't you? This is the second time that you have rather ignorantly pilloried the commandant of Andersonville as though his was the only prison at which inmates died. \n \n \n Mortality rate of Andersonville(Confederate POW camp): 28%.\n Mortality rate of Elmira (Union POW camp): 24%\n (Source: Burke Davis)\n \n Now explain to me how the commandant of the former, located in a remote town in Central Georgia is more cuplable for the deaths in his charge than the commandant of the latter, located in the industrial heart of the Union. I would really like to know how it was that this Northern prison, with all the industrial might, with all the rail capacity, with all the weath of a victorious nation managed to kill so many of its prisoners and why you do not find its commandant in the same league as Kahn, Vlad, et al.\n \n If you can back up your claim that Wirz or the Confederacy were more culpable in their treatment of prisoners than the North I would be delighted to be so educated. Moreover, I would challenge you to do so in a formal debate. I would argue that the South was no more culpable than the North viz the statistics, (15.5% mortality rate US vs 12.2% mortality rate CS) despite the overwhelming Northern resources.", 
   {}, 
   291422, 
   null, 
   1195963200.0
  ], 
  [
   291453, 
   null, 
   "gman", 
   " \n Absolutely! A barbarian is a barbarian is a barbarian.\n \n Why do we kill people to teach people that killing people is wrong?emoticon_frazzled\n\n \n Actually, Arpaio is not charged with maintaining a maximum security system. He does not deal with dispatching criminals convicted of killing innocent victims. \n Recividism rate at his prison is nearly -0-. Now, I would venture to say that released prisoners likely move to a new state before returning to their craft. If all states had an Arpaio, the real barbarians, (criminals) may well seek a new profession. \n If you would, elaborate on how this compares to the people you mentioned whose histories had to do with attacking, massacring and burning villages (Ghengis) or maintaining prisons that existed for the purpose of torture and death (Vlad), or maintaining concentration camps for the purpose of reducing the effective fighting force of the enemy (north and south) which truly were barbaric. Or Idi Amin, who personally killed his own people unfortunate enough to get within his arm reach. Not to mention the people killed by his military. (reasons, unknown to me). \n \n People are not killed to teach lessons. They are simply reaping the reward due them.", 
   {}, 
   291371, 
   null, 
   1196000100.0
  ], 
  [
   291455, 
   null, 
   "gman", 
   "Keep in mind that not everybody actually did commit the crimes, some of them are innocent. Besides, its not luxury living at 100 degrees.\n\n \n Assuming your statement is true, it's not the punitive system that needs fixed. It's the judicial system.", 
   {}, 
   276114, 
   null, 
   1196000460.0
  ], 
  [
   291456, 
   null, 
   "thecap0", 
   "mutz,\n \n If you can back up your claim that Wirz or the Confederacy were more culpable in their treatment of prisoners than the North I would be delighted to be so educated.\n \n Kindly show me where I made such a claim.\n \n The commandant of Elmira, which was near where I grew up, should have been tried just like Wirz.\n \n Tibbets should have been prosecuted the same way Yamashita was.\n \n The butchers of Dresden should have been prosecuted the same way as the butchers of the Warsaw Ghetto.emoticon_angry", 
   {
    "post_info": {
     "post_title": "Whose ox is being gored now?"
    }
   }, 
   291453, 
   null, 
   1196000760.0
  ], 
  [
   291457, 
   null, 
   "gman", 
   "Well, remember all the support shown now the next time you are caught speeding or some such criminal activity.\n \n It's so easy to gloat at the \"criminals\". So easy to forget they're human too.\n\n \n Once again, the judicial system, exposed as incompetent and unjust. \n Criminals earn their circumstances because they chose to \"forget\" the rights of their innocent \"human\" victims. \n In the case of Michael Vick, their doggy victims.", 
   {}, 
   276220, 
   null, 
   1196001000.0
  ], 
  [
   291471, 
   null, 
   "E Mutz", 
   "mutz,\n \n If you can back up your claim that Wirz or the Confederacy were more culpable in their treatment of prisoners than the North I would be delighted to be so educated.\n \n Kindly show me where I made such a claim.\n \n \n\n \n Jump in the way back machine and travel back to your post where you noted:\n \n The barbarians of the world from Jengis Khan to Vlad the Impaler to Henry Wirz to Idi Amin salute you!\n \n Wirz merits mention in you triumvirate of evil but Col Hoffman does not. \n \n Connect the dots.", 
   {
    "post_info": {
     "post_title": "Vlad and Genghis and Wirz Oh My!"
    }
   }, 
   291456, 
   null, 
   1196016060.0
  ], 
  [
   291475, 
   null, 
   "JPSartre12", 
   "Jump in the way back machine and travel back to your post where you noted:\n \n The barbarians of the world from Jengis Khan to Vlad the Impaler to Henry Wirz to Idi Amin salute you!\n \n Wirz merits mention in you triumvirate of evil but Col Hoffman does not. \n \n Connect the dots.\n\n \n If we wanted to be completely accurate in historical context, Vlad the Impaler was instrumental in preventing the Turks from invading and taking over Europe. The Turks were scared to death of him, mostly because of the reputation that he had for brutality, a reputation that is somewhat questionable even to this day.", 
   {}, 
   291471, 
   null, 
   1196019120.0
  ], 
  [
   291999, 
   null, 
   "snakespit", 
   "[B]The butchers of Dresden should have been prosecuted the same way as the butchers of the Warsaw Ghetto.emoticon_angry\n\n \n The what? Butchers of Dresden? Can you explain that a little?", 
   {}, 
   291456, 
   null, 
   1196377200.0
  ], 
  [
   292015, 
   null, 
   "JPSartre12", 
   "The what? Butchers of Dresden? Can you explain that a little?\n\n \n Winston Churchill is dead. ;)", 
   {}, 
   291999, 
   null, 
   1196386860.0
  ], 
  [
   292016, 
   null, 
   "snakespit", 
   "Winston Churchill is dead. ;)\n\n \n I know who he is speaking of, I'm just not sure how you can apply the label of butcher to the British.", 
   {}, 
   292015, 
   null, 
   1196387280.0
  ], 
  [
   292018, 
   null, 
   "JPSartre12", 
   "I know who he is speaking of, I'm just not sure how you can apply the label of butcher to the British.\n\n \n War is Hell. Few leaders can claim sainthood. Churchill wanted the German people punished. The firebombings were the instruments of that punishment.", 
   {}, 
   292016, 
   null, 
   1196387640.0
  ], 
  [
   292082, 
   null, 
   "snakespit", 
   "War is Hell. Few leaders can claim sainthood. Churchill wanted the German people punished. The firebombings were the instruments of that punishment.\n\n \n Punishment...no. Perhaps an important side effect of the bombing was that it helped to destroy what was left of German morale...but I would be hesitant to call this punishment. Dresden was an important strategic target. It was a massive hub for transportation feeding the eastern front, an important communications center, and a large industrial area supplying the Wehrmacht with munitions and vehicles. Firebombings, however horrific and barbaric they may seem, probably saved far more innocent lives than they took. War is hell, but sometimes the ends justify the means.", 
   {}, 
   292018, 
   null, 
   1196418720.0
  ], 
  [
   292302, 
   null, 
   "gman", 
   "Punishment...no. Perhaps an important side effect of the bombing was that it helped to destroy what was left of German morale...but I would be hesitant to call this punishment. Dresden was an important strategic target. It was a massive hub for transportation feeding the eastern front, an important communications center, and a large industrial area supplying the Wehrmacht with munitions and vehicles. Firebombings, however horrific and barbaric they may seem, probably saved far more innocent lives than they took. War is hell, but sometimes the ends justify the means.\n\n \n \n Not only the facts stated by snakespit, the ultimate fact remains that when venturing into a war. Killing innocents such as the Nazi's, Japanese and Al Queda have done, will always demand an unpleasant response even from nations who pride themselves on civility and reason.", 
   {}, 
   292082, 
   null, 
   1196640300.0
  ], 
  [
   292369, 
   null, 
   "snakespit", 
   "Bottom line is that Arpaio is a man who believes in making jail an unpleasant place for those who have transgressed the laws set forth by our society. Good for him. Jail should be an unpleasant place. If it indeed does cost a few extra dollars as some have stated...so be it. There must be some savings in reducing recidivism one would think. \n \n Comparing Arpaio to the Nazi's or Khan or Vlad the Impaler is rediculous. Call me when Arpaio starts slaughtering thousands or millions of innocent men women and children based on the land they occupy, the government the are allied with, the god they pray to, or the political beliefs they subscribe to. Until then...", 
   {}, 
   292302, 
   null, 
   1196673480.0
  ], 
  [
   292408, 
   null, 
   "JPSartre12", 
   "Punishment...no. Perhaps an important side effect of the bombing was that it helped to destroy what was left of German morale...but I would be hesitant to call this punishment. Dresden was an important strategic target. It was a massive hub for transportation feeding the eastern front, an important communications center, and a large industrial area supplying the Wehrmacht with munitions and vehicles. Firebombings, however horrific and barbaric they may seem, probably saved far more innocent lives than they took. War is hell, but sometimes the ends justify the means.\n\n \n \nNot only the facts stated by snakespit, the ultimate fact remains that when venturing into a war. Killing innocents such as the Nazi's, Japanese and Al Queda have done, will always demand an unpleasant response even from nations who pride themselves on civility and reason.\n\n \n I agree with both sentiments. I just was pointing out that, during war, nobody is a saint. The two aren't compatible.", 
   {}, 
   292369, 
   null, 
   1196709360.0
  ], 
  [
   292950, 
   null, 
   "snakespit", 
   "I agree with both sentiments. I just was pointing out that, during war, nobody is a saint. The two aren't compatible.\n\n \n I hate to keep sniping at this since it seems as though you feel the same way I do about the general issue, but again I must disagree. \n \n I agree that many do find the action of firebombing a city to be a terrible act. I will even go as far as saying that it is tragic in it's scope of destruction and loss of life. However, in regards to Dresden it is important to look at the reasons for the bombing, most importantly the consequences of not bombing the city in the first place. Dresden was not about retribution or punishment of the German people. The bombing served a strategic end designed to cripple the military capabilities of the Germans and potentiate the Russian advance on the eastern front. Looking on a grand scale, Dresden was about the salvation of millions of innocent victims. Ending the war came with the benefit of saving countless millions of lives. \n \n Had the allies won the war and continued to firebomb German cities, I would certainly find such actions nothing more than pointless and malicious retribution. Of coarse, we stopped bombing German cities and killing German citizens when Germany surrendered. The difference is, had the Germans won the war, a mass genocide would have continued indeffinately costing countless lives in gas chambers, shooting galleries, and crematories. \n \n I agree that war is always tragic in that innocent people die. I disagree however that \"saintliness\" and war are incompatible. Surely those who would have died at the hands of the Germans had the allies lost the war or turned a blind eye must find our actions saintly. Risking ones life for total strangers against a cruel and brutal enemy carries a certain nobility. It's a simple matter of perspective.", 
   {}, 
   292408, 
   null, 
   1197022140.0
  ], 
  [
   294634, 
   null, 
   "JPSartre12", 
   "I hate to keep sniping at this since it seems as though you feel the same way I do about the general issue, but again I must disagree. \n \n I agree that many do find the action of firebombing a city to be a terrible act. I will even go as far as saying that it is tragic in it's scope of destruction and loss of life. However, in regards to Dresden it is important to look at the reasons for the bombing, most importantly the consequences of not bombing the city in the first place. Dresden was not about retribution or punishment of the German people. The bombing served a strategic end designed to cripple the military capabilities of the Germans and potentiate the Russian advance on the eastern front. Looking on a grand scale, Dresden was about the salvation of millions of innocent victims. Ending the war came with the benefit of saving countless millions of lives. \n \n Had the allies won the war and continued to firebomb German cities, I would certainly find such actions nothing more than pointless and malicious retribution. Of coarse, we stopped bombing German cities and killing German citizens when Germany surrendered. The difference is, had the Germans won the war, a mass genocide would have continued indeffinately costing countless lives in gas chambers, shooting galleries, and crematories. \n \n I agree that war is always tragic in that innocent people die. I disagree however that \"saintliness\" and war are incompatible. Surely those who would have died at the hands of the Germans had the allies lost the war or turned a blind eye must find our actions saintly. Risking ones life for total strangers against a cruel and brutal enemy carries a certain nobility. It's a simple matter of perspective.\n\n \n \n Here's some perspective for you:\n http://www.spartacus.schoolnet.co.uk/2WWdresden.htm", 
   {}, 
   292950, 
   null, 
   1198216200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Appropiate, effective punishment", 
  "url": "http://www.4forums.com/political/crime-debates/10173-appropiate-effective-punishment.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 10173, 
  "discussion_files": [
   [
    "2244.html", 
    "http://www.4forums.com/political/crime-debates/10173-appropiate-effective-punishment-print.html"
   ], 
   [
    "2245.html", 
    "http://www.4forums.com/political/crime-debates/10173-appropiate-effective-punishment-4-print.html"
   ], 
   [
    "2246.html", 
    "http://www.4forums.com/political/crime-debates/10173-appropiate-effective-punishment-3-print.html"
   ], 
   [
    "2247.html", 
    "http://www.4forums.com/political/crime-debates/10173-appropiate-effective-punishment-2-print.html"
   ]
  ], 
  "identifier": 10173
 }
]