[
 [
  [
   276255, 
   null, 
   "wascallywabbit", 
   "**\n \n Just something I found interesting re eusocial amoeba colonies. Wonder if someday they'll discover a similar 'mechanism' in eusocial bacteria colonies? Sure wouldn't surprise me, for one.\n \n \"Public release date: 2-Aug-2007\n [ Print Article | E-mail Article | Close Window ]\n \n Contact: Kimberlee Barbour\n kbarbour@bcm.edu\n 713-798-4712\n Baylor College of Medicine \n \n Immunity in social amoeba suggests ancient beginnings\n Finding an immune system in the social amoeba (Dictyostelium discoideum) is not only surprising but it also may prove a clue as to what is necessary for an organism to become multicellular, said the Baylor College of Medicine researcher who led the research that appears today in the journal Science.\n \n Dictyostelium discoideum usually exists as a single-celled organism. However, when stressed by starvation, the single cells band together to form a slug that can move. Eventually the slug changes to produce cells that perform specific functions - spores and stalks. In this new report, Dr. Adam Kuspa, chair of biochemistry and molecular biology at BCM, and his colleagues describe a new kind of cell they dubbed a \"sentinel\" cell. \n \n Sentinel cells circulate within the slug, engulfing invading bacteria and sequestering poisons or toxins, eventually eliminating these from the slug. These cells often operate through a particular mechanism in the cells controlled by a Toll/Interleukin-1 Receptor domain protein (TirA), Kuspa and his team found. \n \n This signaling pathway or a very similar one is present in plants and animals, he said. Now it has been identified in amoeba. It has not been found in fungi. \n \n \"Amoeba have, in the last 10 years, become appreciated as one of the four main forms of life in the crown group of eukaryotic (multicellular) organisms - plants, animals, fungi and amoeba,\" said Kuspa. \"What allowed them to become multicellular\"\" \n \n One way to estimate the characteristics of the organism that went before those that were multicellular is to look for characteristics that are present in two, three or all four of these main groups, he said.\n \n \"Those were likely present in the progenitor organism,\" said Kuspa. Because three of the four major groups of organisms have this pathway, \"I argue that means that the progenitor of all multicellular organisms had this pathway. Since that organism was not likely multicellular, it must have used it as some kind of signaling to respond to bacteria in the environment.\" \n \n Looking at it from another point of view, \"it's possible that one of the properties of those (crown) organisms that allowed them to become multicellular was the ability to distinguish self from non-self - the hallmark of an immune system,\" said Kuspa. \"The speculation is that a requirement of multicellularity is that you develop systems to recognize pathogens and other non-self cells from yourself.\" \n \n Kuspa sees two paths for future research in the area. One is to look for evidence of the same immune mechanism and protein in other kinds of amoeba. The other is to look at unicellular organisms to determine if they have this same kind of immune signaling pathway. \n \n \"If none of the early diverging organisms that never became multicellular developed this kind of signaling system, it would subtly strengthen our argument,\" he said.\n \n \n ###\n Others who took part in this work include Drs. Guokai Chen and Olga Zhuchenko, both of BCM. \n \n Funding for this work came from the National Institutes of Health.\"\n \n **\n Found at alternet.org", 
   {
    "post_info": {
     "post_title": "On the the subject of &quot;immune systems&quot;."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1186166280.0
  ], 
  [
   276269, 
   null, 
   "Unriggable", 
   "That's pretty exciting news. Perhaps amoebas were the first multicellular organisms, and as time went on they no longer needed and subsequently lost their 'stretch' function (along with other notable single-cell properties)", 
   {}, 
   276255, 
   null, 
   1186175220.0
  ], 
  [
   276272, 
   null, 
   "SLP", 
   "That is not immuity, that is a particular cell eating bacteria.\n \n Shame that some can't tell the difference between metaphorical or descriptive terminology and real life.", 
   {}, 
   276269, 
   null, 
   1186175460.0
  ], 
  [
   276359, 
   null, 
   "chemist99a", 
   "http://www.sciencemag.org/cgi/content/summary/317/5838/611\n \n \nIntroduction to special issue\n Testing Our Defenses\n Stephen J. Simpson and John Travis\n \n Figure 1\n CREDIT: C. BICKEL/SCIENCE\n \n Challenge the immune system, and you might well induce a vigorous response. Challenge an immunologist, and you can be confident of eliciting something rather similar. Indeed, our rate of progress in understanding the immune system has been anything but sluggish over the past few decades. This has encouraged a mood of optimism that new vaccines for infectious diseases and immune-based therapies for cancer and autoimmune diseases are just around the corner. Yet despite this brisk pace of discovery and some enticing glimpses of how the immune system might be manipulated, there is much that is clearly left to explore about its inner workings. In this special issue, we consider a selection of fundamental immunological questions that still test investigators.\n \n As Casanova and Abel explain (p. 617), the genetic study of human primary immunodeficiencies is an emerging field that is revealing surprises about our evolving relationship with the world of pathogens. Kioussis and Georgopoulos (p. 620) discuss the epigenetic rules that govern lymphocyte function and development, and, Reiner et al. (p. 622) frame some of the most pertinent issues in T cell fate determination. Cell biology and immunology have long been intimate partners, and Mellman (p. 625) uses the study of antigen presentation to explain how discoveries in basic cell biology continue to underpin our understanding of the immune system. Finally, Sakaguchi and Powrie (p. 627) reveal just how much there is still to learn about the regulatory T cell and its power in preventing overzealous immune responses and autoimmunity. In News, Leslie (p. 614) describes how immunologists have struggled to understand the purpose of mast cells, and Cohen (p. 612) updates the daring efforts of gene therapists to reboot the human immune system with cells impervious to HIV. Science's STKE focuses on some molecular challenges for immunologists (www.sciencemag.org/sciext/immunology07). Lind&#233;n describes how the adaptor protein Act1 mediates interleukin-17 receptor signaling. Serfling et al. discuss the importance of NFAT transcription factors to memory lymphocytes. Finally, Wattenberg and Raben describe the negative regulation of various immune responses by diacylglycerol kinase.\n \n We are still learning about how immune cells move around the body, and in the research section a Report by Auffrey et al. (p. 666) describes a subset of monocytes that patrol the surfaces of blood vessels for damage and inflammation, contrasting their behavior with that of typical leukocytes. Mueller et al. (p. 670) offer up some intriguing evidence that lymphoid organs \"close up shop\" for new business during an immune response, by using chemokine regulation to prevent the admission of circulating na&#239;ve lymphocytes. In research that may shed some evolutionary light on an ancient system, Chen et al. (p. 678 and see related News item) describe how the social amoeba Dictyostelium uses specialized cells akin to phagocytes in animals. Finally, Carmody et al. (p. 675) reveal the means by which normally potent signals mediated by the innate immune Toll-like receptors are placated by blocking ubiquity-nation. With so much left to discover about our immune system, there seems little doubt that immunologists will find plenty to challenge them in the years to come.\n\n \n And its all evolved via NDS - marvellous!", 
   {}, 
   276272, 
   null, 
   1186208580.0
  ], 
  [
   276395, 
   null, 
   "chemist99a", 
   "By the way the slime mold case is not techically an immune response. Its a self vs non-self response at most. Immune responses as I understand it are limited to vertebrates and involve very specific cellular systems. Self-nonself systems are much much more widespread of course being known in plants, invertebrates, even bacteria. The mechanisms are multitudinous and difficult to classify into an integrated framework. Neverless they are essential.", 
   {}, 
   276359, 
   null, 
   1186258140.0
  ], 
  [
   276651, 
   null, 
   "prschuster", 
   "I was just wondering how & why wascally Wabbit interprets all this as evidence against neodarwinism.", 
   {}, 
   276395, 
   null, 
   1186423860.0
  ], 
  [
   276659, 
   null, 
   "wascallywabbit", 
   "I was just wondering how & why wascally Wabbit interprets all this as evidence against neodarwinism.\n\n \n **\n And those of us who are not dittoheads are wondering why and how you do not.", 
   {}, 
   276651, 
   null, 
   1186425960.0
  ], 
  [
   276660, 
   null, 
   "ShadowPikachu", 
   "**\n And those of us who are not dittoheads are wondering why and how you do not.\n\n \n What is truly sad is that you think that your drivel can pass for an intelligent post, and be totally unaware--the irony is soooo sweet--that your post is perfectly self-descriptive, both of itself and its author.\n \n emoticon_xgood", 
   {}, 
   276659, 
   null, 
   1186426080.0
  ], 
  [
   276683, 
   null, 
   "wascallywabbit", 
   "**\n Since someone [is shadowpicachu the moderator?] delights in erasing every response I make to her above piece of infantile plagiarism [of my own words, sans quotes], I shall now return to my usual practice of totally ignoring dittoheads who have nothing of their own to offer anyone.\n \n [Best read this quickly folks, before the the unbiased unknown eraser erases it.]", 
   {}, 
   276660, 
   null, 
   1186431300.0
  ], 
  [
   276686, 
   null, 
   "GiantOreo", 
   "**\n Since someone [is shadowpicachu the moderator?] delights in erasing every response I make to her above piece of infantile plagiarism [of my own words, sans quotes], I shall now return to my usual practice of totally ignoring dittoheads who have nothing of their own to offer anyone.\n \n [Best read this quickly folks, before the the unbiased unknown eraser erases it.]\n\n \n No, there are no \"moderators\" on these fora (although some people have called for a moderation staff - there's a thread on that visible on the front page). So now, Shadowpikachu is not \"the moderator\" \n \n Only the Administrator of the site (look at your PM's - you might have one from the Admin). And I'd also note that the Admin has also erased Shadowpikachu's responses to your responses as well - I'd guess due to both of you being very far off-topic of both the thread and the Evo/ID forum.", 
   {}, 
   276683, 
   null, 
   1186431960.0
  ], 
  [
   276704, 
   null, 
   "chemist99a", 
   "WW to prshuster!\n \n \nAnd those of us who are not dittoheads are wondering why and how you do not.\n\n \n Yes thats a very detailed and constructive response. But if fails to answer the question as to why you think NDS is somehow negated or falsified because slime molds have cells which differentiate to attack bacteria. Do you think the human immune system somehow negates NDS for the same reason? Please detail your thoughts on the subject since if you are correct then NDS cannot be valid - given the innumberable numbers of immune systems which exist in metazoans.", 
   {}, 
   276686, 
   null, 
   1186436340.0
  ], 
  [
   276705, 
   null, 
   "chemist99a", 
   "**\n Since someone [is shadowpicachu the moderator?] delights in erasing every response I make to her above piece of infantile plagiarism [of my own words, sans quotes], I shall now return to my usual practice of totally ignoring dittoheads who have nothing of their own to offer anyone.\n \n [Best read this quickly folks, before the the unbiased unknown eraser erases it.]\n\n \n Perhaps your posts are not reaching the board? Perahaps their quality does not meet the bar? Anyway if you would explain why immune systems negate NDS that almost surely would be posted - indeed it would be of wide interest to all of biology. I wait with bated breath.", 
   {}, 
   276683, 
   null, 
   1186436460.0
  ], 
  [
   276714, 
   null, 
   "wascallywabbit", 
   "No, there are no \"moderators\" on these fora (although some people have called for a moderation staff - there's a thread on that visible on the front page). So now, Shadowpikachu is not \"the moderator\" \n \n Only the Administrator of the site (look at your PM's - you might have one from the Admin). And I'd also note that the Admin has also erased Shadowpikachu's responses to your responses as well - I'd guess due to both of you being very far off-topic of both the thread and the Evo/ID forum.\n\n \n **\n Admin/mod what's the dif? I don't know who erased them, but I do know that they did not erase shadowpikachu's infantile little crib that started the exchange. Why not, if they are to erase everything that follows from it?\n {Can you spell 'bias', class? Good for you.}\n \n And no, to my knowledge I have received no explanatory rationalization from anyone.", 
   {}, 
   276686, 
   null, 
   1186438440.0
  ], 
  [
   276718, 
   null, 
   "sinjin", 
   "Try not starting any new threads for a while. Maybe you've exhausted your allowance.", 
   {}, 
   276714, 
   null, 
   1186438860.0
  ], 
  [
   276720, 
   null, 
   "chemist99a", 
   "And no, to my knowledge I have received no explanatory rationalization from anyone.\n\n \n Thats logical given your ongoing difficulties with recognizing rational explantaions in general. But not to worry you shall overcome this minor setback.", 
   {}, 
   276718, 
   null, 
   1186439400.0
  ], 
  [
   276808, 
   null, 
   "prschuster", 
   "**\n And those of us who are not dittoheads are wondering why and how you do not.\n\n \n \n \n Walking-fish:\n This insulting ad hominem response to my question about how your post counts as an argument against neodarwinism doesn't do much to make you appear very articulate. Is it that hard to explain yourself?", 
   {}, 
   276659, 
   null, 
   1186470720.0
  ], 
  [
   276810, 
   null, 
   "chemist99a", 
   "What else do you expect nothing WW has produced from the literature so far argues against neo-Darwinism. So far at least. Indeed what he brings forth often supports NDS rather than otherwise. Its a curious approach on his part and he often seems to actually know very little about NDS.", 
   {}, 
   276808, 
   null, 
   1186475100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  On the the subject of \"immune systems\".", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10185-subject-immune-systems.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10185, 
  "discussion_files": [
   [
    "13590.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10185-subject-immune-systems-print.html"
   ], 
   [
    "13591.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10185-subject-immune-systems-2-print.html"
   ]
  ], 
  "identifier": 10185
 }
]