[
 [
  [
   16661, 
   null, 
   "montalban", 
   "Why do Americans want so many guns?\n \n emoticon_xkill \n \n What are you most afraid of?", 
   {
    "post_info": {
     "post_title": "Why do Americans want so many guns?"
    }
   }, 
   null, 
   null, 
   1064228400.0
  ], 
  [
   16671, 
   null, 
   "kelvin90701", 
   "Why do Americans want so many guns?\n \n emoticon_xkill \n \n What are you most afraid of?\n\n \n Define \"many\". What you really mean one is too much. Even when the one is used soles for personal defense. Besides your in Austraila, no one cares what you think.", 
   {}, 
   16661, 
   null, 
   1064242500.0
  ], 
  [
   16682, 
   null, 
   "montalban", 
   "Define \"many\". What you really mean one is too much. Even when the one is used soles (sic) for personal defense. Besides your (sic) in Austraila, no one cares what you think.\n\n \n Ouch! And we're one of your best allies!\n \n You know that really hurts. Maybe that \"We're American, screw the world\" attitude is why you're getting planes hurled at you. And we're one of your best allies and you don't care about us?\n \n But, yes, one is too many. A nut case who is so freaked out that he thinks his own government is out to steal everything he has, is one too many.\n \n The good thing though, is you've now painted yourself into a corner.\n \n You say no one cares about me because I'm from Australia.\n \n So, if you reply to this, it means you do care. And if you don't then as far as we're concerned, I've had the last word. Thank you. emoticon_xgood", 
   {}, 
   16671, 
   null, 
   1064245860.0
  ], 
  [
   16719, 
   null, 
   "tarawa12", 
   "Why do Americans want so many guns?\n \n emoticon_xkill \n \n What are you most afraid of?\n\n Not afraid of anything... I want them and buy them because I CAN. They all have different uses and history I collect some of them for that reason.", 
   {}, 
   16661, 
   null, 
   1064262660.0
  ], 
  [
   16721, 
   null, 
   "Rev. HellH0und", 
   "Why do Americans want so many guns?\n \n emoticon_xkill \n \n What are you most afraid of?\n\n \n \n \n Actually what are YOU most afraid of.. Perhaps your skyrocketing violence since they confiscated your guns is not enough of an eyeopener as to the perils of tyrannical government intrusion into a persons life, liberty, etc at the expense of your personal saftey.. Perhaps the hail mary at the bottom of your post is all you have left!\n \n \n Britain, Australia top U.S.\n in violent crime\n \n \n g'day mate!\n \n \n MOLON LABE", 
   {}, 
   16661, 
   null, 
   1064263200.0
  ], 
  [
   16742, 
   null, 
   "outdoorsman260", 
   "From a hunting standpoint, the least you would need would be 3, a shotgun, a rifle, and a .22rimfire.\n \n Add a semi-auot pistol or a specially modified shotgun for home defense.\n \n Maybe you're into target shooting also? There's an AR-15, or a 50BMG, or some other super accurate rifle.\n \n Then there's just collecting. I like to celebrate diversity with my firearms collection. Some people's flavor is to collect old guns, such as military bolt actions of a country, say Russia. The Mosin Nagant was in production from 1890 to the 1950's. There were several variants, made at several arsenals. A complete collection could have no less than and example of each arselals version of each variant.\n \n Afraid of? Well guns are a pretty good deterrent from the government trying to take away my rights. And shooting at criminals makes criminals rethink trying to steal my stuff. I'm sure invading armies would be deterred by people sniping them off at random (which is what would happen if any ever tried an invasion of America, especially in the rural areas)", 
   {}, 
   16721, 
   null, 
   1064278620.0
  ], 
  [
   16785, 
   null, 
   "DHard3006", 
   "Why do Americans want so many guns?\n \n emoticon_xkill \n \n What are you most afraid of?\n\n \n One has to wonder why gun haters always ask this quesion. \n \n Has this question ever been asked of people that read books? It is interesting how people that want to ban the right to bear arms never apply their logic to the rights they like. The gun haters clearly like the 1st amend. \n \n The gun haters use their 1st amend right to attack the right to bear arms. When racist use their 1st amend right to attack other peoples right it is called hate speech. So why is it that gun haters demanding the banning of the right to bear arms is not considered hate speech? After all gun haters are just like the other hate groups. All they do is attack the right to bear arms. Not once has a gun hater ever demand that dangerous criminals be punished.", 
   {}, 
   16661, 
   null, 
   1064286360.0
  ], 
  [
   16787, 
   null, 
   "kelvin90701", 
   "Ouch! And we're one of your best allies!\n \n You know that really hurts. Maybe that \"We're American, screw the world\" attitude is why you're getting planes hurled at you. And we're one of your best allies and you don't care about us?\n \n But, yes, one is too many. A nut case who is so freaked out that he thinks his own government is out to steal everything he has, is one too many.\n \n The good thing though, is you've now painted yourself into a corner.\n \n You say no one cares about me because I'm from Australia.\n \n So, if you reply to this, it means you do care. And if you don't then as far as we're concerned, I've had the last word. Thank you. emoticon_xgood\n\n You got it completely wrong. We do care about our allies. WE do not care about YOU.", 
   {}, 
   16682, 
   null, 
   1064286660.0
  ], 
  [
   17180, 
   null, 
   "sundowner", 
   "I have guns for hunting, which is something I like to do.\n I have guns for target shooting, which is a hobby of mine.\n I have the right to own firearms, which I do not need to justify the ownership of.\n \n That is my answer to the original topic. But to you other people...damn. Why do \"gun enthusiests\" or \"gun lovers\" have to get to get so damn ignorant when someone states they disagree with you. Why is anyone who challenges your supreme wisdom and beliefs automatically a \"gun hater\"? The reason for a militia was that at the time our country was small comparatively speaking about other nations. We needed a militia because our army was small, and if we did not have a militia, it was possible that france, germany, england, or spain would have come over, kicked our XXX, and taken our country for themselves. THIS IS AN OUT OF DATE IDEA. Do we have the right to have a gun...yes, i'm glad for that. Do we have the right to protect our property and loved ones...yes. Do we need guys in camo running around in south dakota with guns preparing for an invasion from Iran...HELL NO. Our country is bigger, has a bigger military, and we would now know if the Iranian military was attacking us before they left their own country. We no longer have to worry about \"invasion\" by another nation. IMHO, it is the the modern quasi-militia type people and those who are continuously stocking up on sterno, camo, ammo, and NBC gear that are the major problem in this country that makes everybody else wonder why we allow our citizens to still carry guns. You can own guns responsibly, the can be a source of entertainment, and a great hobby. But seriously guys...what is wrong with someone questioning why we have guns? Some of your responses make ALL gun owners look like paranoid, itchy people just waiting for the russians to come. GROW UP.", 
   {}, 
   16787, 
   null, 
   1064459700.0
  ], 
  [
   17183, 
   null, 
   "kelvin90701", 
   "Check out the best load for the AR-15 thread, here were the gun collectors and owners is OK too. This is what we do with our guns. Go to the range shoot a little, hunt a little, and sit around and talk. We talk about wives, girlfriends, children, family, cars, fishing, politics, and of course guns and hunting.\n \n We do not talk about robbing banks, raping women, stealing cars, selling drugs, or killing cops.\n \n The gun owners here are HARMLESS and productive members of society. Felons are not.\n \n The law must focus on the bank robbers, rapist, car jackers, dealers, and cop killers; and not on the harmless gun owners. That is why gun control as it is envisioned and practiced in this country is fundamentally wrong.", 
   {}, 
   17180, 
   null, 
   1064460360.0
  ], 
  [
   17212, 
   null, 
   "sundowner", 
   "Check out the best load for the AR-15 thread, here were the gun collectors and owners is OK too. This is what we do with our guns. Go to the range shoot a little, hunt a little, and sit around and talk. We talk about wives, girlfriends, children, family, cars, fishing, politics, and of course guns and hunting.\n \n We do not talk about robbing banks, raping women, stealing cars, selling drugs, or killing cops.\n \n The gun owners here are HARMLESS and productive members of society. Felons are not.\n \n The law must focus on the bank robbers, rapist, car jackers, dealers, and cop killers; and not on the harmless gun owners. That is why gun control as it is envisioned and practiced in this country is fundamentally wrong.\n\n \n But a harmless gun owner can become a felon at any given moment. Again, I am all for the right to bear arms, but there is no way to seperate those who will commit a crime and those who will not. Yes, once you become a felon, you forfeit your right to a gun. However, as much as some of you might not like to hear this...guns should not be on airplanes, in schools, or in federal buildings (unless you are law enforcement). A little common sense would go a long way with these laws. What about a gun in the workplace? Unless you have a job that you need a gun for, ie...police officer, professional hunter, armed security, or soldier, you do not need a gun in your workplace. These are common sense gun control measures that should not really need any support. The problem with the entire gun control debate is that a lot of felons do not come by their guns legally. How can you write laws to stop felons from getting a gun illegally? You can't. So until we can develope a brain scan device that can tell if you are ever going to committ a gun related crime...the safest measure is to prohibit guns from certain areas. Example...if we can screen everyone at the airport and verify that nobody has a gun, there is no need for me to carry a gun to protect myself. Same with schools, federal buildings and such. If you feel that this infringes on your right to bear arms, deal with it. You can still take your gun to the range, the woods, or carry it on the street. This gives you the ability to target shoot, hunt, and protect yourself in an environment where others might have a gun. But if we can screen everyone for guns in one location where it is deemed they could represent an unecessary theat to others, ie..the airport (where there is no hunting or indoor ranges), then why should someone feel that they need to carry it with them?", 
   {}, 
   17183, 
   null, 
   1064475180.0
  ], 
  [
   17246, 
   null, 
   "kelvin90701", 
   "But a harmless gun owner can become a felon at any given moment. Again, I am all for the right to bear arms, but there is no way to seperate those who will commit a crime and those who will not. Yes, once you become a felon, you forfeit your right to a gun. However, as much as some of you might not like to hear this...guns should not be on airplanes, in schools, or in federal buildings (unless you are law enforcement). A little common sense would go a long way with these laws. What about a gun in the workplace? Unless you have a job that you need a gun for, ie...police officer, professional hunter, armed security, or soldier, you do not need a gun in your workplace. These are common sense gun control measures that should not really need any support. The problem with the entire gun control debate is that a lot of felons do not come by their guns legally. How can you write laws to stop felons from getting a gun illegally? You can't. So until we can develope a brain scan device that can tell if you are ever going to committ a gun related crime...the safest measure is to prohibit guns from certain areas. Example...if we can screen everyone at the airport and verify that nobody has a gun, there is no need for me to carry a gun to protect myself. Same with schools, federal buildings and such. If you feel that this infringes on your right to bear arms, deal with it. You can still take your gun to the range, the woods, or carry it on the street. This gives you the ability to target shoot, hunt, and protect yourself in an environment where others might have a gun. But if we can screen everyone for guns in one location where it is deemed they could represent an unecessary theat to others, ie..the airport (where there is no hunting or indoor ranges), then why should someone feel that they need to carry it with them?\n\n \n There is no such thing as a potentional criminal. People who you think might commit a crime? Well they are all innocent and must be treated so. There is no such thing as casting a net to see who is a criminal. That totally violates probable cause.\n \n You are right once convicted a citizen becomes a fellon and looses rights, but never before. It is even wrong to be suspicious of the innocent without probable cause. Thinking someone is innocent is not probable cause. The possibility that someone is guilty is not probable cause. There must be sufficient evidence and an actual crime before there is probable cause.", 
   {}, 
   17212, 
   null, 
   1064503500.0
  ], 
  [
   17252, 
   null, 
   "Rev. HellH0und", 
   "I have guns for hunting, which is something I like to do.\n I have guns for target shooting, which is a hobby of mine.\n I have the right to own firearms, which I do not need to justify the ownership of.\n \n That is my answer to the original topic. But to you other people...damn. Why do \"gun enthusiests\" or \"gun lovers\" have to get to get so damn ignorant when someone states they disagree with you. Why is anyone who challenges your supreme wisdom and beliefs automatically a \"gun hater\"? The reason for a militia was that at the time our country was small comparatively speaking about other nations. We needed a militia because our army was small, and if we did not have a militia, it was possible that france, germany, england, or spain would have come over, kicked our XXX, and taken our country for themselves. THIS IS AN OUT OF DATE IDEA. Do we have the right to have a gun...yes, i'm glad for that. Do we have the right to protect our property and loved ones...yes. Do we need guys in camo running around in south dakota with guns preparing for an invasion from Iran...HELL NO. Our country is bigger, has a bigger military, and we would now know if the Iranian military was attacking us before they left their own country. We no longer have to worry about \"invasion\" by another nation. IMHO, it is the the modern quasi-militia type people and those who are continuously stocking up on sterno, camo, ammo, and NBC gear that are the major problem in this country that makes everybody else wonder why we allow our citizens to still carry guns. You can own guns responsibly, the can be a source of entertainment, and a great hobby. But seriously guys...what is wrong with someone questioning why we have guns? Some of your responses make ALL gun owners look like paranoid, itchy people just waiting for the russians to come. GROW UP.\n\n \n \n \n I don't believe you are a gun owner, My b r o t h a. Your illogic on the whole purpose of the militia aside..... What guns do you own? What grain bullets do you shoot? What are the serial numbers? Your phobic rant on people who are concious of self prepardness shows your true colors.... Should we all just sit back and wait for tom ridge to tell us to go get some duct tape? A source of entertainment and a hobby and if not we should be restricted simply because we prepare for ourselves, our families, and if possible members of our community? scary dood... Tell that to those Koreans with AK-47s who succsessfully protected thier stores during the LA riots. \n \n In response to you\n \n And you look like a socialist mommas boy who has nothing better to do then to attack LAW ABIDING CITIZENS under the guise of a \"fellow gun owner\" thinking that he can out smart those with different views by being \"one of us\".", 
   {}, 
   17180, 
   null, 
   1064505420.0
  ], 
  [
   17256, 
   null, 
   "Rev. HellH0und", 
   "But a harmless gun owner can become a felon at any given moment. Again, I am all for the right to bear arms, but there is no way to seperate those who will commit a crime and those who will not. Yes, once you become a felon, you forfeit your right to a gun. However, as much as some of you might not like to hear this...guns should not be on airplanes, in schools, or in federal buildings (unless you are law enforcement). A little common sense would go a long way with these laws. What about a gun in the workplace? Unless you have a job that you need a gun for, ie...police officer, professional hunter, armed security, or soldier, you do not need a gun in your workplace. These are common sense gun control measures that should not really need any support. The problem with the entire gun control debate is that a lot of felons do not come by their guns legally. How can you write laws to stop felons from getting a gun illegally? You can't. So until we can develope a brain scan device that can tell if you are ever going to committ a gun related crime...the safest measure is to prohibit guns from certain areas. Example...if we can screen everyone at the airport and verify that nobody has a gun, there is no need for me to carry a gun to protect myself. Same with schools, federal buildings and such. If you feel that this infringes on your right to bear arms, deal with it. You can still take your gun to the range, the woods, or carry it on the street. This gives you the ability to target shoot, hunt, and protect yourself in an environment where others might have a gun. But if we can screen everyone for guns in one location where it is deemed they could represent an unecessary theat to others, ie..the airport (where there is no hunting or indoor ranges), then why should someone feel that they need to carry it with them?\n\n \n \n ***YAWN***\n \n \n The Rifle,the Pistol, the knife, the hammer, my hands, are the tools, I am the weapon. I train each equally (cept maybe the hammer) I could just as easily (and more discreetly) kill you with my hands as I could with a pistol.. But I won't because I am a law abiding citizen. Why do you fear me? If anything I am somebody you could count on to save your sorry a$$ in the event that your plane DOES get hijacked. Calling 911 wont get the authorities to fly up in choppers to save you... And those pretty flyboys in thier f16s are not there to help you... Tthey are there to shoot you down if they need to. Federal Air marshals will eventually reach 5000... how many flights are there a day? You do the math.", 
   {}, 
   17212, 
   null, 
   1064506140.0
  ], 
  [
   17264, 
   null, 
   "montalban", 
   "I originally asked \"Why so many guns? What are you most afraid of?\"\n \n \nOne has to wonder why gun haters always ask this quesion (sic).\n \n Has this question ever been asked of people that read books? It is interesting how people that want to ban the right to bear arms never apply their logic to the rights they like.\n\n \n Spot the difference between reading a book and carrying a gun. I'm sorry if you can't. People don't carry books because they're worried about being assailed by someone with an eraser.\n \n \nThe gun haters clearly like the 1st amend. \n\n \n Do you want to debate this too? Do you support the 2nd Amendment or do you think exceptions should be made?\n \n \nThe gun haters use their 1st amend right to attack the right to bear arms. When racist use their 1st amend right to attack other peoples right it is called hate speech. So why is it that gun haters demanding the banning of the right to bear arms is not considered hate speech? After all gun haters are just like the other hate groups. All they do is attack the right to bear arms. \n\n \n Probably because the 'hate' is directed at the gun, not the person. Are you defending the rights of racists to exercise their free speech? I thought 'slander' was against the law in the US.\n \n \nNot once has a gun hater ever demand that dangerous criminals be punished.\n\n \n What? You did a poll?", 
   {}, 
   16785, 
   null, 
   1064507340.0
  ], 
  [
   17266, 
   null, 
   "montalban", 
   "Afraid of? Well guns are a pretty good deterrent from the government trying to take away my rights. And shooting at criminals makes criminals rethink trying to steal my stuff.\n\n \n Finally someone answered the question. Thanks. I thought it might be the government.\n \n Does your government attempt to do this?\n \n What do you think about other democratic nations that have citizens that are less armed? Do you think that they're in danger - or is it only the American government that's out to do this?\n \n \nI'm sure invading armies would be deterred by people sniping them off at random (which is what would happen if any ever tried an invasion of America, especially in the rural areas)\n\n \n There is some truth here. Did you ever see \"Independence Day\"? They were taking pot-shots at the alien ships when they first arrived. It didn't stop the aliens... sure only a film... let's look at real life...\n \n modern - Iraq - Sadaam gave guns out to the people just before Gulf War II\n \n not so modern - Boer War - Dutch farmers in South Africa were all excellent marksmen - Britain still invaded.\n \n US Civil War - I believe that the Confederate States were pretty well armed as far as the white citizens were concerned. US still invaded.", 
   {}, 
   16742, 
   null, 
   1064507700.0
  ], 
  [
   17297, 
   null, 
   "sundowner", 
   "I don't believe you are a gun owner, My b r o t h a. Your illogic on the whole purpose of the militia aside..... What guns do you own? What grain bullets do you shoot? What are the serial numbers? Your phobic rant on people who are concious of self prepardness shows your true colors.... Should we all just sit back and wait for tom ridge to tell us to go get some duct tape? A source of entertainment and a hobby and if not we should be restricted simply because we prepare for ourselves, our families, and if possible members of our community? scary dood... Tell that to those Koreans with AK-47s who succsessfully protected thier stores during the LA riots. \n \n \n Ok: \n \n 1. Desert Eagle Pistol (Israel Military Industries LTD (IMI)\n .40\"S&W \n UMC 40 S&W 180Gr. alternated every other one in the clip with Federal Hydrashoks. \n \n 2. Taurus (Taurus INT.MFG)\n .38 SPECIAL\n UMC rounds...when I have them\n \n 3. Ithica Model 37 Featherlight \n 20Ga.\n Usually the cheapest high-brass shell I can find...use them for rabbit and turkey.\n \n 4. Mossberg \n Old .22Mag, currently at my parents house in PA. Do not have a clip for it, and i have never fired it. It was given to me in my grandfathers will. \n \n 5. Marlin\n .22 LR\n Who cares what kind of ammo, it's a .22! I usually buy Rem I think.\n \n 6. Winchester\n 300 WIN MAG Model 700\n Usually: 300 Win. Magnum 180Gr. Trophy Bonded Bear Claw (Federal Premium) \n \n -not a chance in hell i will wrte the serial numbers down here.\n \n Oh...and DOOD is spelled Dude.\n \n And I was pointing out that these paramilitary militia types are what gives the anti-gun control argument a bad name. Good for the Koreans. You have the right to protect yourself, sure...but some people take this to extremes. (Maybe we will call them...extremists..yeah thats it) The people who stand up loudly screaming \"the only way you'll ever get my gun is by to pry it from my cold dead fingers...\" News for you. The way a lot of these militia types act, the general public fears them. This fear is doing more harm to the gun movement than anything else. I'm not talking about someone who has a shotgun by his bed ready for John Q. Criminal to walk in, I keep my .40 by my bed. I'm talking about anti-government militia types who think that they will one day be fighting Russians from their doorstep. You said something about my \"phobic rant\"? Have you ever heard these paranoid people?", 
   {}, 
   17264, 
   null, 
   1064515560.0
  ], 
  [
   17316, 
   null, 
   "Rev. HellH0und", 
   "Ok: \n \n 1. Desert Eagle Pistol (Israel Military Industries LTD (IMI)\n .40\"S&W \n UMC 40 S&W 180Gr. alternated every other one in the clip with Federal Hydrashoks. \n \n 2. Taurus (Taurus INT.MFG)\n .38 SPECIAL\n UMC rounds...when I have them\n \n 3. Ithica Model 37 Featherlight \n 20Ga.\n Usually the cheapest high-brass shell I can find...use them for rabbit and turkey.\n \n 4. Mossberg \n Old .22Mag, currently at my parents house in PA. Do not have a clip for it, and i have never fired it. It was given to me in my grandfathers will. \n \n 5. Marlin\n .22 LR\n Who cares what kind of ammo, it's a .22! I usually buy Rem I think.\n \n 6. Winchester\n 300 WIN MAG Model 700\n Usually: 300 Win. Magnum 180Gr. Trophy Bonded Bear Claw (Federal Premium) \n \n -not a chance in hell i will wrte the serial numbers down here.\n \n Oh...and DOOD is spelled Dude.\n \n And I was pointing out that these paramilitary militia types are what gives the anti-gun control argument a bad name. Good for the Koreans. You have the right to protect yourself, sure...but some people take this to extremes. (Maybe we will call them...extremists..yeah thats it) The people who stand up loudly screaming \"the only way you'll ever get my gun is by to pry it from my cold dead fingers...\" News for you. The way a lot of these militia types act, the general public fears them. This fear is doing more harm to the gun movement than anything else. I'm not talking about someone who has a shotgun by his bed ready for John Q. Criminal to walk in, I keep my .40 by my bed. I'm talking about anti-government militia types who think that they will one day be fighting Russians from their doorstep. You said something about my \"phobic rant\"? Have you ever heard these paranoid people?\n\n \n \n \"d00d\" (do you really think I do not know how to spell d00d?) I am one of these so called paranoid people... But it is not paranoia it is vigilance. I don't expect any ill to come my way but if it does... well lets say I am \"well-regulated\"... Should you thank your government overlords to allow you to protect your family with a shotgun as opposed to a FLASH SUPPRESSED carbine? Ever fire a shotgun or rifle not flash suppressed at night? lets just say pray there is only one of them and he got the lead or you'll be running around like mr-magoo while he rapes your wife and steals your government cheese. OH and not so good for the Koreans... Those very same AK's which saved those individuals AND the state millions of dollars can't own those weapons anymore... hmmmm.....\n \n \n Oh and its not the russians.. Its the jack booted blue helmets that will come knockin when some skirt wearing liberal turns over our soveriegnty to the UN. Don't laugh Klinton tried it.\n \n \n Standing up screaming the cold dead hands mantra is not extremism. Its called defending the constitution. Personally I usually wear a MOLON LABE! tshirt (Avaliable here when I attend council meetings, at the airport, various functions were the libs tend to hang out... Its a declaration of freedom... Not paranoia.... vigilance not rebellion. \n \n Get educated.. read Unintended Consequences then reflect on your position. You will see that \"reasonable\" gun control is not so \"reasonable\".\n \n \n BTW you half passed the test.. Personally I would never under ANY circumstance list the weapons or most other property for that matter. Why would you alternate hydrashocks with UMC? besides the supersonic 135gr hydrashock is a much better man-stopper...", 
   {}, 
   17297, 
   null, 
   1064522820.0
  ], 
  [
   17318, 
   null, 
   "sundowner", 
   "So what is your answer...no gun control...no gun laws what so ever? I believe in speed limits, but that does not mean I am anti-car. Some law is neccesary...the alternative is anarchy.", 
   {}, 
   17316, 
   null, 
   1064527320.0
  ], 
  [
   17319, 
   null, 
   "Rev. HellH0und", 
   "So what is your answer...no gun control...no gun laws what so ever? I believe in speed limits, but that does not mean I am anti-car. Some law is neccesary...the alternative is anarchy.\n\n \n \n I would go as far as I would with the second as I would the first... You can not yell fire in a movie theater. You can not menace people with firearms. (menacing) You can not discharge your firearm in a quite community (disturbing the peace). You can not clean your gun while driving because you are swerving all over the road (reckless driving) you can not leave your gun unattended in public. (negligence). you can not bring your gun onto private property if the owner does not want it (trespassing). You can not show your weapon to make somebody do something they do not want to do (under the law). (coersion).\n \n You notice something here though all these things don't make the gun illegal they are actions that are illegal. Gun or no gun you can still get into the same trouble. Punish the action not the lifless item.\n \n \n The right of the people to keep (i.e. to have, own, possess) and bear (carry concealed or otherwise) shall not be infringed. It says nothing about a right to act like an idiot with your gun.\n \n If that were the intent of gun control then I would be on board. But gun control is about control of the government over its subjects... Read all the victim disarmament web sites.. Read about the UN \"gun Burning day\"... Its part of a global socialist agenda that wants you! \n \n A response to Kofi Cakes", 
   {}, 
   17318, 
   null, 
   1064528280.0
  ], 
  [
   17325, 
   null, 
   "sundowner", 
   "Let me ask you then Rev, should there be places that you cannot carry a gun? You said you cannot take it into someones home if they object, or private property...but what about the airport? What about in a federal building? You seem to be able to at least make a rational, thoughtful debate unlike DHARD3006. I find it very hard to even argue with someone when thee is no logic in their argument. So what about it? Should you have the right to carry a weapon into the federal courthouse? I seriously don't think anyone has the right to take my guns away. I will not willingly let my guns be taken away. But I understand that in our world there are some LIMITATIONS on what we can do.", 
   {}, 
   17319, 
   null, 
   1064534820.0
  ], 
  [
   17337, 
   null, 
   "DHard3006", 
   "Let me ask you then Rev, should there be places that you cannot carry a gun? You said you cannot take it into someones home if they object, or private property...but what about the airport? What about in a federal building? You seem to be able to at least make a rational, thoughtful debate unlike DHARD3006. I find it very hard to even argue with someone when thee is no logic in their argument. So what about it? Should you have the right to carry a weapon into the federal courthouse? I seriously don't think anyone has the right to take my guns away. I will not willingly let my guns be taken away. But I understand that in our world there are some LIMITATIONS on what we can do.\n\n \n It is pathetic that gun haters must claim to own guns so they can push their gun control agenda. But then again what do you expect from hate group members but this type of action.\n \n Gun hater pilot has a problem with law abiding citizens taking guns into public places. So gun hater pilot wants gun control laws prohibiting this. The only problem with this logic or as gun hater pilot calls it common sense is dangerous criminals and terrorist do not obey gun control laws.\n \n Gun haters like gun hater pilot think common sense is to regulate the law abiding citizen while allowing dangerous criminals to go free. This is called gun hater common sense.\n \n The common sense thing is to allow law abiding people to be armed because dangerous criminals are. This common sense goes over the heads of gun haters like gun hater pilot because gun hater pilot does not want people to have the right to bear arms.\n \n Another tactic of gun haters is to claim to be a gun owner. The this gun hater will attack anybody that points out that this self proclaimed gun owner wants the same gun control laws that gun hater Sarah Brady does.\n \n Another thing gun hater pilot fails to mention is I defended the airlines right to deny people to bring guns onto airplanes. Because that is private property. The other thing I pointed out and gun hater pilot does not like is that when the airlines do prohibit a person to bring a gun onto their airplanes, the airlines are responsible for that persons safety.", 
   {}, 
   17325, 
   null, 
   1064539860.0
  ], 
  [
   17349, 
   null, 
   "kelvin90701", 
   "Let me ask you then Rev, should there be places that you cannot carry a gun? You said you cannot take it into someones home if they object, or private property...but what about the airport? What about in a federal building? You seem to be able to at least make a rational, thoughtful debate unlike DHARD3006. I find it very hard to even argue with someone when thee is no logic in their argument. So what about it? Should you have the right to carry a weapon into the federal courthouse? I seriously don't think anyone has the right to take my guns away. I will not willingly let my guns be taken away. But I understand that in our world there are some LIMITATIONS on what we can do.\n\n \n You can not take firearms into a court house. It is a non verbal message to judge and jurry when armed people are at court proceedings. That is a violation of due process. Not allowing accused due process is unconstitutional.\n \n Limitations are placed on priviledges. If you want to restrict a right, then change the Constitution.", 
   {}, 
   17325, 
   null, 
   1064545440.0
  ], 
  [
   17352, 
   null, 
   "kelvin90701", 
   "So what is your answer...no gun control...no gun laws what so ever? I believe in speed limits, but that does not mean I am anti-car. Some law is neccesary...the alternative is anarchy.\n\n \n Laws I want to control guns:\n \n 1) Instant background checks. No waiting period. No cool off time.\n 2) No central data base of gun ownership.\n 3) No balistic finger printing.\n 4) Instant loss of firearm rights for felons for life.\n \n Driving a car is not a right. It is a priviledge and can be restricted, controlled, and taken away at will by the state. There is no valid comparison between a right and a priviledge.", 
   {}, 
   17318, 
   null, 
   1064545920.0
  ], 
  [
   17356, 
   null, 
   "kelvin90701", 
   "Finally someone answered the question. Thanks. I thought it might be the government.\n \n Does your government attempt to do this?\n \n What do you think about other democratic nations that have citizens that are less armed? Do you think that they're in danger - or is it only the American government that's out to do this?\n\n \n I could really do not care how other countries legislate firearms. That is their business. They are free to do what ever they want in thier own borders.\n \n It comes down to authority, no one will have authority over me. I am not a government slave. I will not obey the government, when I do so, I will do so in my best interest. I owe the government nothing. The government is my servant. The government job is to stay out of my way. I only want the government to interfer only when a dispute or damages have been inflicted on me. Then I want to the government and laws as a tool to settle damages and disputes. I do not want the government to modify, engineer, or socially evolve me. If they do, then I am just a slave to thier will.\n \n This is not about guns. This is about loss of abilility to control my own destiny.", 
   {}, 
   17266, 
   null, 
   1064546580.0
  ], 
  [
   17387, 
   null, 
   "montalban", 
   "It comes down to authority, no one will have authority over me. I am not a government slave. I will not obey the government, when I do so, I will do so in my best interest. I owe the government nothing. The government is my servant. The government job is to stay out of my way. I only want the government to interfer only when a dispute or damages have been inflicted on me. Then I want to the government and laws as a tool to settle damages and disputes. I do not want the government to modify, engineer, or socially evolve me. If they do, then I am just a slave to thier will.\n \n This is not about guns. This is about loss of abilility to control my own destiny.\n\n \n I can understand that you believe you have a right, and you don't want that right, infringed upon. I understand that it is an important right, because it's been placed in the constitution, with a special proviso just for it.\n \n The problem I have is that the right is not an absolute, because Americans give up their right to carry a gun into courts (which is the government), onto aeroplanes (private business).\n \n From where I stand, pro-gun rights people should be either pushing for the \"Shall not be infringed\" or, they should accept that the government has the right to legislate for the greater good.\n \n Although not 'protected' by the constitution, you could argue that, as a very good driver, you shouldn't have to be subjected to the same legal limitations as poor drivers; such as the speed limit... Somone may be perfectly capable of driving about well above that limit. Yet, for the public good, the limit is set by law.\n \n Likewise the government says no private guns in court. For the benefit of public justice.\n \n I'm sure that there are 17year olds* who go to school, but they can't take their guns to school.\n \n *This was I believe, the minimum age stated for 'militia'", 
   {}, 
   17356, 
   null, 
   1064552040.0
  ], 
  [
   17409, 
   null, 
   "kelvin90701", 
   "I\n \n From where I stand, pro-gun rights people should be either pushing for the \"Shall not be infringed\" or, they should accept that the government has the right to legislate for the greater good.\n \n \n\n There is no such thing as greater good in a courthouse or private property in the example above. There is the accused in a court and armed people who want to influence due process in a courthouse. There is the trespasser and the property owner. There is no public that is offended. There is no society that is offended. There is no greater good served. There is no \"public\" involved. The protection of accused serves no public good. It serves the individual. Protection of propety owners serves no public good, it protects the individual owner. It is about protecting the rights of individuals at risk. The accused about to loose all rights if convicted. The property owner violated by trespass about to loose control over his own property. If you loose control of property, then is stolen from you. If it is real-estate or a coin in your pocket. If you loose control over it without permission, then it is stolen from you.\n \n Driving and rights is not a valid comparison. Driving is a priviledge regulated by law, it is not a right.\n \n 17 year olds are not full citizens and do not have full rights.", 
   {}, 
   17387, 
   null, 
   1064558040.0
  ], 
  [
   17410, 
   null, 
   "kelvin90701", 
   "\n \n I'm sure that there are 17year olds* who go to school, but they can't take their guns to school.\n \n *This was I believe, the minimum age stated for 'militia'\n\n \n \"That each and every free able-bodied white male citizen of the respective States, resident therein, who is or shall be of age of eighteen years, and under the age of forty-five years\"\n \n http://www.constitution.org/mil/mil_act_1792.htm", 
   {}, 
   17387, 
   null, 
   1064558460.0
  ], 
  [
   17465, 
   null, 
   "DHard3006", 
   "So what is your answer...no gun control...no gun laws what so ever? I believe in speed limits, but that does not mean I am anti-car. Some law is neccesary...the alternative is anarchy.\n\n \n Gun hater pilot is using another gun hater tactic. Any time a person defends no limits on the right to bear arms gun haters like gun hater pilot start chanting this lie. \n \n No one is defending no laws. The only laws that gun hater pilot wants are to limit or ban the right to bear arms. No one has demanded that laws against murder, robbery, assault, or extortion be removed. Gun hater pilot has to say things like this to distract people from the gun hater goal of banning the right to bear arms!\n \n Not once will gun hater like gun hater pilot demand that dangerous criminals be punished. But gun hater pilot will demand that the right to bear arms be limited or banned to keep criminals from getting guns. And since dangerous criminals do not obey gun control laws, just which people are going to be affected by these laws? The law abiding citizens!", 
   {}, 
   17318, 
   null, 
   1064595660.0
  ], 
  [
   17466, 
   null, 
   "DHard3006", 
   "But a harmless gun owner can become a felon at any given moment. Again, I am all for the right to bear arms, but there is no way to seperate those who will commit a crime and those who will not. Yes, once you become a felon, you forfeit your right to a gun. However, as much as some of you might not like to hear this...guns should not be on airplanes, in schools, or in federal buildings (unless you are law enforcement). A little common sense would go a long way with these laws. What about a gun in the workplace? Unless you have a job that you need a gun for, ie...police officer, professional hunter, armed security, or soldier, you do not need a gun in your workplace. These are common sense gun control measures that should not really need any support. The problem with the entire gun control debate is that a lot of felons do not come by their guns legally. How can you write laws to stop felons from getting a gun illegally? You can't. So until we can develope a brain scan device that can tell if you are ever going to committ a gun related crime...the safest measure is to prohibit guns from certain areas. Example...if we can screen everyone at the airport and verify that nobody has a gun, there is no need for me to carry a gun to protect myself. Same with schools, federal buildings and such. If you feel that this infringes on your right to bear arms, deal with it. You can still take your gun to the range, the woods, or carry it on the street. This gives you the ability to target shoot, hunt, and protect yourself in an environment where others might have a gun. But if we can screen everyone for guns in one location where it is deemed they could represent an unecessary theat to others, ie..the airport (where there is no hunting or indoor ranges), then why should someone feel that they need to carry it with them?\n\n \n Remember that gun hater pilot stated that gun hater pilot would not allow a law enforcement officer with the proper paper work for a gun on a airplane! Gun hater pilot stated gun hater pilot would base that decision on racial profiling!\n \n Again we get the common sense lie. Why do gun hater like gun hater pilot feel unarmed people die such a kinder gentler death? \n The dangerous criminals are not going to obey gun free zones, as seen at columbine! \n The dangerous criminals are not going to obey the gun control laws forbidding converting guns to full auto!\n The dangerous criminals are not going to bey laws against carry guns concealed!\n The dangerous criminals are not going respect the rights of the law abiding citizen!\n \n Gun hater pilot just wants to ban the right to bear arms. Gun hater pilot says common sense is to limit the places to a few right now. So what is to prevent gun hater pilot from adding more places where guns cannot be taken by the law abiding citizen later on. Nothing!\n \n Why? Simple, once gun hater pilot got these gun free zones the logic gun hater pilot will use is. You allowed the gun haters to ban guns here in the name of common sense, why can't we add more places to ban guns from. The only problem with gun hater pilot's common sense bs is that the dangerous criminals these laws are meant to keep guns away from do not obey gun control laws!", 
   {
    "unicode_changes_made": true
   }, 
   17212, 
   null, 
   1064596740.0
  ], 
  [
   17467, 
   null, 
   "DHard3006", 
   "I have guns for hunting, which is something I like to do.\n I have guns for target shooting, which is a hobby of mine.\n I have the right to own firearms, which I do not need to justify the ownership of.\n \n That is my answer to the original topic. But to you other people...damn. Why do \"gun enthusiests\" or \"gun lovers\" have to get to get so damn ignorant when someone states they disagree with you. Why is anyone who challenges your supreme wisdom and beliefs automatically a \"gun hater\"? The reason for a militia was that at the time our country was small comparatively speaking about other nations. We needed a militia because our army was small, and if we did not have a militia, it was possible that france, germany, england, or spain would have come over, kicked our XXX, and taken our country for themselves. THIS IS AN OUT OF DATE IDEA. Do we have the right to have a gun...yes, i'm glad for that. Do we have the right to protect our property and loved ones...yes. Do we need guys in camo running around in south dakota with guns preparing for an invasion from Iran...HELL NO. Our country is bigger, has a bigger military, and we would now know if the Iranian military was attacking us before they left their own country. We no longer have to worry about \"invasion\" by another nation. IMHO, it is the the modern quasi-militia type people and those who are continuously stocking up on sterno, camo, ammo, and NBC gear that are the major problem in this country that makes everybody else wonder why we allow our citizens to still carry guns. You can own guns responsibly, the can be a source of entertainment, and a great hobby. But seriously guys...what is wrong with someone questioning why we have guns? Some of your responses make ALL gun owners look like paranoid, itchy people just waiting for the russians to come. GROW UP.\n\n \n Why would gun haters like gun hater pilot say there are reasons to have guns? To answer this a person must know that the only reason the 2nd amend gives to bear arms is it is your right to!\n \n The 2nd amend does not say people must be in a militia to bear arms! \n \n The 2nd amend does not say people need guns for self defense!\n \n The 2nd amend does not say people need guns to hunt with!\n \n The 2nd amend does not say people need guns to target shoot with!\n \n Gun hater pilot will then later start saying since we have a standing army there is no reason for militias.\n \n Gun hater pilot will then say hey we have police to protect us, so why do people need guns to defend themselves. \n \n Gun hater pilot will then say we have grocery store so why do people need to hunt?\n \n Gun hater pilot will then say why do you need to target shoot if you no longer need guns to hunt or defend yourself?\n \n Gun hater pilot will continue adding why do you need guns reasons until the reason gun hater pilot said are gone.\n \n It is always interesting how gun haters like gun hater pilot apply the common sense lie to banning the right to bear arms. \n \n What gun hater pilot will never apply the common sense thing is to demand that dangerous criminals be removed from the streets of America to make it safe.\n \n The only paranoid people are the gun haters that want to ban the right to bear arms of law abiding citizens. Notice gun hater pilot did state if you cannot trust one person you must suspect all people! That is what being paranoid is!", 
   {}, 
   17180, 
   null, 
   1064598240.0
  ], 
  [
   17489, 
   null, 
   "voiceofreason", 
   "Actually what are YOU most afraid of.. Perhaps your skyrocketing violence since they confiscated your guns is not enough of an eyeopener as to the perils of tyrannical government intrusion into a persons life, liberty, etc at the expense of your personal saftey.. Perhaps the hail mary at the bottom of your post is all you have left!\n \n \n Britain, Australia top U.S.\n in violent crime\n \n \n g'day mate!\n \n \n MOLON LABE\n\n An interesting analysis of that article you keep quoting from the World Net Daily. http://www.saneguns.org/commentary/comment002.html", 
   {}, 
   16721, 
   null, 
   1064607960.0
  ], 
  [
   17493, 
   null, 
   "Rev. HellH0und", 
   "An interesting analysis of that article you keep quoting from the World Net Daily. http://www.saneguns.org/commentary/comment002.html\n\n \n \n More propaganda! \n \n Analysys my thoin! its propagandist opinionary\n \n \"The news does reach the press -- including WorldNetDaily, which gives it a particularly... ah..... WorldnetDaily spin. (WND, out of California, still believes Ken Starr is part of the Vince Foster cover-up).\"\n \n ^^^Ad Hominen? They hold a certain opinion on something completley unrelated to prove that WND does not know what its talking about....\n \n Nothing to back this claim up, nor any attempt to show contradicting data. They mysteriously have data from a website from what I could tell was last updated in 1996 that does not even ASK THE QUESTION ABOUT USE OF GUNS IN CRIME!\n \n \n Pitiful.", 
   {}, 
   17489, 
   null, 
   1064610660.0
  ], 
  [
   17554, 
   null, 
   "kelvin90701", 
   "An interesting analysis of that article you keep quoting from the World Net Daily. http://www.saneguns.org/commentary/comment002.html\n\n \n WND is not some guy on the internet who is 30 years old and has only had summer jobs on his resume.", 
   {}, 
   17489, 
   null, 
   1064625960.0
  ], 
  [
   17560, 
   null, 
   "kelvin90701", 
   "Let me ask you then Rev, should there be places that you cannot carry a gun? You said you cannot take it into someones home if they object, or private property...but what about the airport? What about in a federal building? You seem to be able to at least make a rational, thoughtful debate unlike DHARD3006. I find it very hard to even argue with someone when thee is no logic in their argument. So what about it? Should you have the right to carry a weapon into the federal courthouse? I seriously don't think anyone has the right to take my guns away. I will not willingly let my guns be taken away. But I understand that in our world there are some LIMITATIONS on what we can do.\n\n \n I believe I was standing in your shoes just a few short years ago. All my firearms are strictly for shooting targets on a closed range or hunting. The personal defense part of guns is just a niffy extra.\n \n What I saw surfing the TV changed my life. The Million Mom Marchers convinced my to join the NRA. I was never a member until the first MMM march. By chance I caught a MMM on the mall in Washington DC proudly proclaim: \"First we get the guns. Then we get a ship. Put all the guns on the ship. Then sink the ship.\" Then everyone cheered. At that point there is no hinding the motive. They want ALL the guns. Don't you believe them when they say it is about reasonable gun control. They want gun CONFISCATION.", 
   {}, 
   17325, 
   null, 
   1064626620.0
  ], 
  [
   17600, 
   null, 
   "Rev. HellH0und", 
   "I believe I was standing in your shoes just a few short years ago. All my firearms are strictly for shooting targets on a closed range or hunting. The personal defense part of guns is just a niffy extra.\n \n What I saw surfing the TV changed my life. The Million Mom Marchers convinced my to join the NRA. I was never a member until the first MMM march. By chance I caught a MMM on the mall in Washington DC proudly proclaim: \"First we get the guns. Then we get a ship. Put all the guns on the ship. Then sink the ship.\" Then everyone cheered. At that point there is no hinding the motive. They want ALL the guns. Don't you believe them when they say it is about reasonable gun control. They want gun CONFISCATION.\n\n \n \n Call it by its non newspeak name.... The 349 mom march.", 
   {}, 
   17560, 
   null, 
   1064670780.0
  ], 
  [
   17700, 
   null, 
   "kelvin90701", 
   "Call it by its non newspeak name.... The 349 mom march.\n\n \n No, it is the 348 Mom March + 1 Convicted Felon for attempted murder with a handgun.", 
   {}, 
   17600, 
   null, 
   1064791200.0
  ], 
  [
   17993, 
   null, 
   "sundowner", 
   "Gun hater pilot will then say hey we have police to protect us, so why do people need guns to defend themselves. \n \n \n Never said that, never will.\n \n \nGun hater pilot will then say we have grocery store so why do people need to hunt?\n \n \n Never said that, never will.\n \n \nGun hater pilot will then say why do you need to target shoot if you no longer need guns to hunt or defend yourself?\n \n \n Never said that, never will.\n \n \nGun hater pilot will continue adding why do you need guns reasons until the reason gun hater pilot said are gone.\n \n \n What? Is english your first language? Learn to communicate effectively. \n \n \nIt is always interesting how gun haters like gun hater pilot apply the common sense lie to banning the right to bear arms.\n \n \n Maybe you can't read english either...I have and never will argue for the banning of anyone's right to bear arms. \n \n \nWhat gun hater pilot will never apply the common sense thing is to demand that dangerous criminals be removed from the streets of America to make it safe.\n \n \n Sure, remove all the dangerous criminals from the street...I love that idea. Only problem is, how do you know who is a criminal? You don't know until they commit a crime. Everyone is a POTENTIAL felon, not that most of us will ever commit the crime, but everone who is physically capable has the POTENTIAL to do so. We cannot lock people up because they might commit a crime, so justice is after the fact. If you know of a better way to get criminals off the street than we have now, then by all means, bring it to the table. I would love to not have to lock my doors or worry about my property or life. \n \n \nThe only paranoid people are the gun haters that want to ban the right to bear arms of law abiding citizens. Notice gun hater pilot did state if you cannot trust one person you must suspect all people! That is what being paranoid is!\n \n \n Where did i say this? \n \n I think he real problem is that common sense hater XXXXX is irrational and unstable. I think common sense hater XXXXX need help.", 
   {}, 
   17700, 
   null, 
   1065125040.0
  ], 
  [
   17994, 
   null, 
   "sundowner", 
   "It is pathetic that gun haters must claim to own guns so they can push their gun control agenda. But then again what do you expect from hate group members but this type of action.\n \n Gun hater pilot has a problem with law abiding citizens taking guns into public places. So gun hater pilot wants gun control laws prohibiting this. The only problem with this logic or as gun hater pilot calls it common sense is dangerous criminals and terrorist do not obey gun control laws.\n \n Gun haters like gun hater pilot think common sense is to regulate the law abiding citizen while allowing dangerous criminals to go free. This is called gun hater common sense.\n \n The common sense thing is to allow law abiding people to be armed because dangerous criminals are. This common sense goes over the heads of gun haters like gun hater pilot because gun hater pilot does not want people to have the right to bear arms.\n \n Another tactic of gun haters is to claim to be a gun owner. The this gun hater will attack anybody that points out that this self proclaimed gun owner wants the same gun control laws that gun hater Sarah Brady does.\n \n Another thing gun hater pilot fails to mention is I defended the airlines right to deny people to bring guns onto airplanes. Because that is private property. The other thing I pointed out and gun hater pilot does not like is that when the airlines do prohibit a person to bring a gun onto their airplanes, the airlines are responsible for that persons safety.\n\n \n \n Again, common sense hater XXXXX has missed the main point and twisted my words to make me into a \"gun hater\". Once again, I OWN GUNS, I SHOOT GUNS, I HUNT, I TARGET SHOOT, I KEEP A LOADED PISTOL BY MY BED, I BELIEVE IN AND WILL FOREVER DEFEND MY RIGHT TO SHOOT SOME A$$HOLE WHO ENTERS MY HOME IN THE NIGHT, I SOMETIMES CARRY MY PISTOL IN MY CAR OR ON MY PERSON. IF THESE THINGS MAKE ME A GUN HATER, I GUESS I AM. CAN YOU HEAR ME NOW? \n \n Common sense hater XXXXX says that I want to regulate law abiding citizens and let the criminals go free. Nothing could be further from the truth. Common sense hater XXXXX must not be able to read very well, and common sense hater XXXXX has a serious comprehension problem. Common sense hater XXXXX does not realize that my point was not that we should take guns away from law abiding people. My point was: THERE ARE PLACES WHERE PEOPLE IN GENERAL...LAW ABIDING OR CRIMINAL SHOULD NOT BE ALLOWED TO CARRY GUNS. THIS WAS THE WHOLE ARGUEMENT ABOUT THE AIRPLANES. IF WE CAN SCREEN EVERYONE AND ASSURE THAT NOBODY HAS A GUN, THEN WE CAN BE ASSURED THAT WE DON'T NEED A GUN TO DEFEND OURSELVES. DOES THIS MAKE SENSE ON THE STREETS IN MIAMI OR THE STREETS OF NEW YORK? $HIT NO. I WILL BE CARRYING MY PISTOL IN THESE PLACES. WHY, BECAUSE WE CANNOT SCREEN PEOPLE WALKING DOWN THE STREET, WE CAN'T CHECK EVERYONE. AT THE AIRPORT, WE CAN. WE CAN VERIFY THAT EVERYONE GETTING ON A PLANE DOES NOT HAVE A GUN. TRY IT YOUR WAY, PUT UP A SIGN SAYING THAT ONLY LAW ABIDING CITIZENS MAY BRING GUNS INTO THE AIRPORT OR THE FEDERAL BUILDING...I'M SURE THAT WILL WORK. I don't think i should be banned from carrying a gun down the street, but through the airport...oh hell yeah. And guess what...there are already laws stating that you cannot carry guns in airports, federal buildings, some banks, some businesses, etc. Are these a violation of your civil rights...yes, but get over it. This is no longer 1776. We did not have airports and airplanes back then. Guns are considered by lawmakers as a threat to the security of airports and airplanes. So is the solution let everyone carry, then end up with wild west shootouts in terminal B? Or should we restrict everone from carrying a gun in the airport, then nobody shoots anyone. Common sense hater XXXXX will not see the logic in this, but then again, that is the why common sense hater XXXXX is called common sense hater XXXXX.", 
   {}, 
   17337, 
   null, 
   1065126540.0
  ], 
  [
   17995, 
   null, 
   "DHard3006", 
   "Never said that, never will.\n \n \n \n Never said that, never will.\n \n \n \n Never said that, never will.\n \n \n \n What? Is english your first language? Learn to communicate effectively. \n \n \n \n Maybe you can't read english either...I have and never will argue for the banning of anyone's right to bear arms. \n \n \n \n Sure, remove all the dangerous criminals from the street...I love that idea. Only problem is, how do you know who is a criminal? You don't know until they commit a crime. Everyone is a POTENTIAL felon, not that most of us will ever commit the crime, but everone who is physically capable has the POTENTIAL to do so. We cannot lock people up because they might commit a crime, so justice is after the fact. If you know of a better way to get criminals off the street than we have now, then by all means, bring it to the table. I would love to not have to lock my doors or worry about my property or life. \n \n \n \n Where did i say this? \n \n I think he real problem is that common sense hater XXXXX is irrational and unstable. I think common sense hater XXXXX need help.\n\n \n \n Once again paranoid gun hater pilot wants to punish all people because a few may break the law. \n \n How do you tell if a person is a criminal? Simple you wait until that person breaks the law then you punish the criminal. \n \n So gun hater pilots goal is to treat all people like criminals. So just how many rights can be limited if we use gun hater pilots common sense approach to making America safe?\n \n Gun hater pilot made this statement :\"HOWEVER, as pilots...we have veto power. If i don't like the way you look at me when you hand me your FS508 form, I will ask you to leave my airplane.\"\n \n So gun hater pilot simply because you do not like the way a person looks you can tell if that person is going to commit a crime. Do you have a crystal ball that helps you do this?\n \n The racist based their decisions on how to deal with people because they did not like how some people looked. Even the Nazi's based their decisions on the way they treated people simply because they did not like the way they looked. So how are you different from hate groups like the racist and Nazi's?\n \n Gun haters are compared to hate groups like the KKK and Nazi's because they act like these hate groups!\n \n Gun hater pilots common sense it to treat all people like criminals! What does the law say, innocent until proven guilty. I guess gun hater pilots common sense is guilty until proven innocent.", 
   {
    "unicode_changes_made": true
   }, 
   17993, 
   null, 
   1065126900.0
  ], 
  [
   17996, 
   null, 
   "sundowner", 
   "Gun hater pilot is using another gun hater tactic. Any time a person defends no limits on the right to bear arms gun haters like gun hater pilot start chanting this lie. \n \n No one is defending no laws. The only laws that gun hater pilot wants are to limit or ban the right to bear arms. No one has demanded that laws against murder, robbery, assault, or extortion be removed. Gun hater pilot has to say things like this to distract people from the gun hater goal of banning the right to bear arms!\n \n Not once will gun hater like gun hater pilot demand that dangerous criminals be punished. But gun hater pilot will demand that the right to bear arms be limited or banned to keep criminals from getting guns. And since dangerous criminals do not obey gun control laws, just which people are going to be affected by these laws? The law abiding citizens!\n\n \n Common sense hater XXXXX thinks that I believe that banning guns or the right to bear arms will keep criminals from having guns. I think common sense hater XXXXX has been sniffing glue for some time now. Anyone who would believe this XXXX is dumber than common sense hater XXXXX. Banning guns is not going to keep criminals from having guns. I never said that law abiding citizens should not be allowed to have / own / carry guns. I said there should be SOME control.", 
   {}, 
   17465, 
   null, 
   1065127200.0
  ], 
  [
   17999, 
   null, 
   "sundowner", 
   "Gun hater pilot made this statement :\"HOWEVER, as pilots...we have veto power. If i don't like the way you look at me when you hand me your FS508 form, I will ask you to leave my airplane.\"\n \n \n You took this out of context and also from another thread. I was making a broad statement that pilots have the final authority aboard an aircraft, and if the pilot says that you cannot carry a gun on his plane, then you get off the plane. I personally have had many people carry aboard my aircraft. My usual statement is: \"what kind is it...i want to know what kind of boom to expect when you touch it off\". I have never asked anyone to leave my airplane because they have had a gun. If the paperwork is not correct, I would. If they are acting irrational, I would. If they are drunk or appear intoxicated, I would. If they got on screaming about how they are going to kill anyone who moves, I would. Fortunately, the vast majority of people who carry on flights are great people just doing their job. Pay attention to what you write and how you respond to what other people write.", 
   {
    "unicode_changes_made": true
   }, 
   17995, 
   null, 
   1065128700.0
  ], 
  [
   18000, 
   null, 
   "DHard3006", 
   "Again, common sense hater XXXXX has missed the main point and twisted my words to make me into a \"gun hater\". Once again, I OWN GUNS, I SHOOT GUNS, I HUNT, I TARGET SHOOT, I KEEP A LOADED PISTOL BY MY BED, I BELIEVE IN AND WILL FOREVER DEFEND MY RIGHT TO SHOOT SOME A$$HOLE WHO ENTERS MY HOME IN THE NIGHT, I SOMETIMES CARRY MY PISTOL IN MY CAR OR ON MY PERSON. IF THESE THINGS MAKE ME A GUN HATER, I GUESS I AM. CAN YOU HEAR ME NOW? \n \n Common sense hater XXXXX says that I want to regulate law abiding citizens and let the criminals go free. Nothing could be further from the truth. Common sense hater XXXXX must not be able to read very well, and common sense hater XXXXX has a serious comprehension problem. Common sense hater XXXXX does not realize that my point was not that we should take guns away from law abiding people. My point was: THERE ARE PLACES WHERE PEOPLE IN GENERAL...LAW ABIDING OR CRIMINAL SHOULD NOT BE ALLOWED TO CARRY GUNS. THIS WAS THE WHOLE ARGUEMENT ABOUT THE AIRPLANES. IF WE CAN SCREEN EVERYONE AND ASSURE THAT NOBODY HAS A GUN, THEN WE CAN BE ASSURED THAT WE DON'T NEED A GUN TO DEFEND OURSELVES. DOES THIS MAKE SENSE ON THE STREETS IN MIAMI OR THE STREETS OF NEW YORK? $HIT NO. I WILL BE CARRYING MY PISTOL IN THESE PLACES. WHY, BECAUSE WE CANNOT SCREEN PEOPLE WALKING DOWN THE STREET, WE CAN'T CHECK EVERYONE. AT THE AIRPORT, WE CAN. WE CAN VERIFY THAT EVERYONE GETTING ON A PLANE DOES NOT HAVE A GUN. TRY IT YOUR WAY, PUT UP A SIGN SAYING THAT ONLY LAW ABIDING CITIZENS MAY BRING GUNS INTO THE AIRPORT OR THE FEDERAL BUILDING...I'M SURE THAT WILL WORK. I don't think i should be banned from carrying a gun down the street, but through the airport...oh hell yeah. And guess what...there are already laws stating that you cannot carry guns in airports, federal buildings, some banks, some businesses, etc. Are these a violation of your civil rights...yes, but get over it. This is no longer 1776. We did not have airports and airplanes back then. Guns are considered by lawmakers as a threat to the security of airports and airplanes. So is the solution let everyone carry, then end up with wild west shootouts in terminal B? Or should we restrict everone from carrying a gun in the airport, then nobody shoots anyone. Common sense hater XXXXX will not see the logic in this, but then again, that is the why common sense hater XXXXX is called common sense hater XXXXX.\n\n \n Hey gun hater pilot what is with this statement from you \"I WILL BE CARRYING MY PISTOL IN THESE PLACES. WHY, BECAUSE WE CANNOT SCREEN PEOPLE WALKING DOWN THE STREET, WE CAN'T CHECK EVERYONE.\" \n Did you not say you would deny a police officer the right to carry a gun onto airplane because of their looks? \n So why can't you walk down the street unarmed? \n I mean if you have the ability to tell when a person may break the law simply by looking at them, why can't you just run away from dangerous people? \n \n Hey here is the definition of infringement\n \n 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n \n Gun hater pilots common sense is to limit or encroach on the right to bear arms in the name of safety by passing gun control laws.. The only problem with this encroachment or infringement is that only law abiding citizens obey gun control laws!\n This makes true the old saying that \"if you outlaw guns only outlaws will have them! \"\n Example, columbine. The law abiding citizens obeyed the no guns at school policy. The criminals that came onto school property with guns did not obey this law! Result 11 dead kids!\n Example, LA bank robbery bank customers obeyed the no guns policy. The bank robbers that robbed the bank did not! Results, numerous unarmed people hurt.\n Example, LA bank robbers did not obey the gun control law that forbids a person from converting their guns to full auto. Law abiding citizens obeyed this law. Result LA police officers were forced to fight these criminals with handguns and shotguns.\n \n I simply said if a person or government denies a person the right to self defense that person or government is responsible for the safety of the people they deny this right. The courts have ruled that the airlines and port authority can be held accountable for the terrorist actions of criminals on 9/11.\n So gun hater pilot if you want to limit my right to bear arms then you will be held accountable if I am injured or killed by the very criminals or terrorist you are trying to keep guns away from!\n So gun hater pilot is your common sense to deny law abiding citizens the right to self defense and then say sorry when they are harmed or killed by criminals?\n \n One has to remember that gun hater common sense is to pass law banning the right to bear arms while doing nothing to punish dangerous criminals!", 
   {
    "unicode_changes_made": true
   }, 
   17994, 
   null, 
   1065128760.0
  ], 
  [
   18002, 
   null, 
   "DHard3006", 
   "You took this out of context and also from another thread. I was making a broad statement that pilots have the final authority aboard an aircraft, and if the pilot says that you cannot carry a gun on his plane, then you get off the plane. I personally have had many people carry aboard my aircraft. My usual statement is: \"what kind is it...i want to know what kind of boom to expect when you touch it off\". I have never asked anyone to leave my airplane because they have had a gun. If the paperwork is not correct, I would. If they are acting irrational, I would. If they are drunk or appear intoxicated, I would. If they got on screaming about how they are going to kill anyone who moves, I would. Fortunately, the vast majority of people who carry on flights are great people just doing their job. Pay attention to what you write and how you respond to what other people write.\n\n \n I quoted you by using the exact statement from you! No way was it taken out of context!\n \n gee and pilots never fly drunk!\n \n Gun hater common sense is to unarm the law abiding by infringing on the right to bear arms while allowing dangerous criminals to run free!", 
   {}, 
   17999, 
   null, 
   1065129300.0
  ], 
  [
   18009, 
   null, 
   "sundowner", 
   "I quoted you by using the exact statement from you! No way was it taken out of context!\n \n gee and pilots never fly drunk!\n \n Gun hater common sense is to unarm the law abiding by infringing on the right to bear arms while allowing dangerous criminals to run free!\n\n \n Actually, it was taken out of context. \nThere are people right now that are allowed to carry firearms aboard commercial aircraft, if they have the proper documentation. HOWEVER, as pilots...we have veto power. If i don't like the way you look at me when you hand me your FS508 form, I will ask you to leave my airplane.\n \n \n What i was saying, is that the pilots have the final authority...damn you are dense. Get over it. It is not racial or ethnically motivated. Did you also read my other post concerning this subject? \n \n I never fly drunk. Where did that come from? That's like saying \"gee, and law abiding citizens never snap and gun down 13 of their co-workers in the post office\". Get a grip. This happens, but I don't argue for banning guns. Pilots do show up to work drunk, I also don't argue to make alcohol illegal, what the hell is your point?\n \n And I noticed how common sense hater XXXXX went from saying I am trying to ban his right to bear arms and now I am infringing on his right to bear arms. I find that really funny. Oh, and I am letting the dangerous criminals run free. \n \n Ok smartass, you go get all the dangerous criminals off the street. \n \n My point is that we need some control in some places. Obviously someone out there agrees with me, because you cannot take a gun on a plane (unless you are properly authorized), you cannot carry a gun into a federal building, a lot of schools have metal detectors and screeners to keep guns out. You don't agree. Fine. It does not bother me. But I know that you will not be on my airplane with a gun, and that makes me feel safer. My point is that if nobody has a gun, nobody needs protection from a gun. In a controlled environment like an airport or on an airplane, why put people in the situation to have a shootout. You have argued that you cannot tell who is a criminal...this is true. Anyone could be a criminal. So how do you know who the law abiding citizen with the gun is, and who the maniac with the gun is? You don't know, you never will know until he pulls it out and shoots you. You always say that people like me (gun hater pilots) only ever talk about the bad what ifs. You always say what about the good what ifs, like what if i pull my gun out, shoot the terrorist, and save the entire plane load of people? Think about this you deranged little XXXXX: IF WE DON'T ALLOW ANY GUNS ON THE PLANE AT ALL, THEN YOU WOULD NOT HAVE TO SAVE EVERYONE. Problem solved. \n \n Let me ask you: Should children be allowed to take guns to school?\n If yes, why? How old should they be? What sort of security checks should the child have to go through in order to take a gun to school? Would you want your children to go to a school where everyone was allowed to have a gun? Answer these questions honestly common sense hater XXXXX. I am curious what you believe.", 
   {}, 
   18002, 
   null, 
   1065140160.0
  ], 
  [
   18011, 
   null, 
   "sundowner", 
   "Gun hater pilots common sense is to limit or encroach on the right to bear arms in the name of safety by passing gun control laws.. The only problem with this encroachment or infringement is that only law abiding citizens obey gun control laws!\n \n \n If you think that preventing you from taking a gun on a plane, into a school, into a federal building, or any other secured place is encroaching on your right to bear arms, then i am guilty as charged. This is not aimed at law abiding citizens, it is aimed at everyone, because we don't know who is law abiding and who is not. If we expected everyone to obey gun control laws, then we would not need screeners and x-ray equipment at the airport.", 
   {}, 
   18002, 
   null, 
   1065140760.0
  ], 
  [
   18019, 
   null, 
   "DHard3006", 
   "If you think that preventing you from taking a gun on a plane, into a school, into a federal building, or any other secured place is encroaching on your right to bear arms, then i am guilty as charged. This is not aimed at law abiding citizens you XXXXX, it is aimed at everyone, because we don't know who is law abiding and who is not. If we expected everyone to obey gun control laws, then we would not need screeners and x-ray equipment at the airport.\n\n \n Gun hater pilot stated gun hater pilot would kick off of gun haters pilot airplane any law enforcement officer with a gun that looked at gun hater pilot wrong. So gun hater pilot tell us what you base this ability on. Gun hater pilot do you have the ability to look at a person and tell if that person will commit a crime? Because if you do have this ability gun hater pilot you will be in big demand at the airports, shipping terminals, public buildings, and even prisons. Gun hater pilot you could be a ride along person with a cop. Then when you used your supernatural ability to tell if a person was going to commit a crime you could tell the cop to arrest that person and prevent a crime. Just think how safe America would be with gun hating people like you roaming the streets. I am sure the Blacks and Jewish people felt the very same way, you know like when the hate groups that hated them were running around using your methods of telling who would commit a crime against them. Based on looks that is!\n \n The only people that obey gun control laws that prevent people from taking guns any where are law abiding people. Case in point columbine, the law abiding citizens obeyed the no gun law, the criminals did not. 11 dead children.\n \n Well it appears all the people on the airplanes obeyed the gun ban on the airplanes. The only problem is that the terrorist used the next available thing like box cutters to take the airplanes over from all the unarmed people and fly them into some big buildings!\n \n Now gun hater pilot since you denied all of these victims of this crime to defend ones self you gun hater pilot are responsible for their deaths! The courts have ruled that people that make people give up their right to self defense can be held accountable. \n \n Would we be safer if everybody carried a gun? I don't know if we would or would not. But gun shows sure have a low rate if any of murder. Could this be because guns are there?", 
   {
    "unicode_changes_made": true
   }, 
   18011, 
   null, 
   1065149100.0
  ], 
  [
   18068, 
   null, 
   "sundowner", 
   "Gun hater pilot do you have the ability to look at a person and tell if that person will commit a crime?\n \n \n No. Never said I did. Nobody does, that's the point. If we cannot tell who will commit a crime, why let anyone on a plane with a gun.\n \n \nJust think how safe America would be with gun hating people like you roaming the streets.\n \n \n I think if you look back, you will see that I said that the streets are a good place to carry a firearm, because there are no controls on the streets, we cannot screen people, and you may be called upon to defend yourself from someone else with a gun. Airports are different. We do have controls, they are called security checkpoints. There are these guys called TSA screeners that work there, they use metal detectors, x-ray machines, explosive detection devices, sometimes dogs, and if needed hand searching to assure that there is no threat of someone pulling a gun out on your flight and shooting you. This eliminates the need for you to carry your gun to protect yourself from another gun. This is the point, no guns means that nobody can shoot anyone. \n \n \nI am sure the Blacks and Jewish people felt the very same way, you know like when the hate groups that hated them were running around using your methods of telling who would commit a crime against them. Based on looks that is!\n \n \n Strangely, I have never mentioned my race to you. I guess you just assumed that I am white....WRONG...TRY AGAIN.\n \n \nThe only people that obey gun control laws that prevent people from taking guns any where are law abiding people. Case in point columbine, the law abiding citizens obeyed the no gun law, the criminals did not. 11 dead children.\n \n \n It is not like we just have a sign in front of the airport that says you may not bring a gun past this point. They do have signs illustrating the prohibition of weapons in certain areas. But we also have the screeners, x-ray machines, metal detectors, etc. They check everyone. A law is a concept, a guidline, on paper. Enforcement is the act of upholding and asuring compliance with the laws. Yes, the law may have been in effect at Columbine, it was not enforced. To my knowledge, hey now have metal detectors, screeners, and have enacted other measures to ensure that nobody bring a gun into that school. Sadly, not all schools have yet, and there will probably be another tragedy before we realize that we need to keep guns out of the schools at all costs. And by the way, 12 children died, not 11. 1 teacher was also killed for a total of 13. \n \n \n \nWell it appears all the people on the airplanes obeyed the gun ban on the airplanes. The only problem is that the terrorist used the next available thing like box cutters to take the airplanes over from all the unarmed people and fly them into some big buildings!\n \n \n Yes, and everyone else on those planes could have been carrying up to a 4 inch blade to protect themselves, apparently they were not. We now do not allow knives, boxcutters, knitting needles, hammers, or anything else that has good potential to be used as a lethal weapon aboard a plane. The idea is to make it safer. You seem to want to be armed as well as the terrorists. Well if the terrorists only have their hands as weapons, would it not be true that you have the same weapons as them? Why did they not have guns? The no gun law for airplanes was being enforced. Now we are enforcing a no weapons policy on the planes. \n \n \nNow gun hater pilot since you denied all of these victims of this crime to defend ones self you gun hater pilot are responsible for their deaths! The courts have ruled that people that make people give up their right to self defense can be held accountable. \n \n \n No, not quite. If i tell you that you cannot bring your gun on board an airplane, and you still get on without it, then aren't you again taking responsibility for your safety? If you really feel that you cannot travel without your gun, then don't get on the plane. By the way, do you have a link for this legislation? \n \n \nWould we be safer if everybody carried a gun? I don't know if we would or would not. But gun shows sure have a low rate if any of murder. Could this be because guns are there?\n \n \n No. Probably because the law abiding citizen who go to gun shows are not going to murder anyone, and the criminals who go to gun shows go to get a gun, and again are not going to murder anyone there. The last thing a criminal would want to do is go to a gun show and draw attention to himself. Show me a statistic about how many criminals have gone to gun shows, purchased a gun, and then used it in the commision of a felony elsewhere, I would be curious to see that. I have and never will argued against gun shows, I have even been the the one in Ft. Lauderdale the last 2 years. But your arguement of a low gun show murder rate is pretty dumb.", 
   {
    "unicode_changes_made": true
   }, 
   18019, 
   null, 
   1065208740.0
  ], 
  [
   18077, 
   null, 
   "kelvin90701", 
   "No. Never said I did. Nobody does, that's the point common sense hater XXXXX. If we cannot tell who will commit a crime, why let anyone on a plane with a gun.\n \n .\n\n \n Because they are ALL innocent. Even if you might commit a crime, you are STILL innocent of no crime.", 
   {}, 
   18068, 
   null, 
   1065216300.0
  ], 
  [
   18078, 
   null, 
   "DHard3006", 
   "[QUOTE=sundowner]\n Strangely, I have never mentioned my race to you. I guess you just assumed that I am white....WRONG...TRY AGAIN.QUOTE]\n \n I compared your tactics to the racist. I stated you use the very same tactics of the racist KKK or the nazis. I never said you were white. The fact that gun haters like gun hater pilot uses the very same tactics of hate groups is what makes gun haters a hate group!\n \n Gun hater pilot stated gun hater pilot would not allow a law enforcement officer with the proper paperwork on gun hater pilots airplane based on simply how the law enforcement looked at gun hater pilot.\n \n So gun hater pilot you must have some ability to tell if a person will commit a crime if you would do as you stated. Or are you just like all hate group members, just running off at the mouth to take rights away from people.", 
   {}, 
   18068, 
   null, 
   1065216480.0
  ], 
  [
   18080, 
   null, 
   "DHard3006", 
   "If you think that preventing you from taking a gun on a plane, into a school, into a federal building, or any other secured place is encroaching on your right to bear arms, then i am guilty as charged. This is not aimed at law abiding citizens you XXXXX, it is aimed at everyone, because we don't know who is law abiding and who is not. If we expected everyone to obey gun control laws, then we would not need screeners and x-ray equipment at the airport.\n\n \n Yes, gun hater pilot you may do this. However gun hater if you do this, the people that push these laws are responsible for the safety of the people they deny the right to bear arms! \n \n Gun hater pilot this means you assume responsibility for the safety of the people you denied the right to bear arms!", 
   {}, 
   18011, 
   null, 
   1065216780.0
  ], 
  [
   18099, 
   null, 
   "sundowner", 
   "Yes, gun hater pilot you may do this. However gun hater if you do this, the people that push these laws are responsible for the safety of the people they deny the right to bear arms! \n \n Gun hater pilot this means you assume responsibility for the safety of the people you denied the right to bear arms!\n\n \n No it does not. If you see a sign saying that you cannot take your gun past this point due to security reasons, and you drop your gun and walk on through, you are still responsible for yourself. I did not make you walk through, you made that choice on your own, knowing you don't have a gun. If you don't like that, stay outside the security points with your gun, and watch the rest of society (those of us who realize in order to achieve some sort of safety we must be willing to give up a few personal rights) go get on the airplanes. If you think you need your gun in order to be safe everywhere you go, carry it. I realize that is a controlled environment like an airport where we screen everyone for guns, that I have very little to be afraid of. Sure, there is some risk, but risk is everywhere. We can never make something 100% safe, only safer, but letting everyone carry a gun on a plane is certainly not the answer.", 
   {}, 
   18080, 
   null, 
   1065231480.0
  ], 
  [
   18100, 
   null, 
   "sundowner", 
   "Because they are ALL innocent. Even if you might commit a crime, you are STILL innocent of no crime.\n\n \n Ok. Let me see if I understand this. If everyone is innocent, (true until proven otherwise) then we should let everyone carry a gun on a plane and just hope that nobody decides to start shooting. Is that right? Would you leave your daughter alone with a group of strange men? I hope not. Point is, you don't know them, or what they are capable of. So would you want to wait until they molest, rape, or kill her to find out they are criminals? No, I did not say lock everyone up because they might commit a crime. No, I did not say we can tell who criminals are just by appearance (despite what DHARD thinks I meant). I said, we don't know who might get on a plane and start shooting, so why let anyone carry a gun on the plane and take a chance? Because they are innocent? Give me a break. So were the hypothetical strange men you left your daughter with, and now she is dead. Every convicted murderer was at one time innocent until they killed the first time. Airplanes are vunerable targets to terrorists. Why make it easy for them to take an airplane over, or put hundreds of lives at risk?", 
   {}, 
   18077, 
   null, 
   1065232260.0
  ], 
  [
   18102, 
   null, 
   "sundowner", 
   "Let me ask you: Should children be allowed to take guns to school?\n \n \n \nIf yes, why? How old should they be? What sort of security checks should the child have to go through in order to take a gun to school? Would you want your children to go to a school where everyone was allowed to have a gun? Answer these questions honestly common sense hater XXXXX. I am curious what you believe.\n \n \n You never answered this DHARD. Or is that just your style, to avoid any questions that might make you think, keep twisting everyones words around, calling them gun haters and racists, and making yourself sound like a total XXX?", 
   {}, 
   18100, 
   null, 
   1065232620.0
  ], 
  [
   18109, 
   null, 
   "DHard3006", 
   "You never answered this DHARD. Or is that just your style, to avoid any questions that might make you think, keep twisting everyones words around, calling them gun haters and racists, and making yourself sound like a total XXX?\n\n \n \n Gun hater pilot's gun control laws failed the law abiding citizens at columbine!\n \n Who should be held accountable for this failure? Well, since the government passed the gun control laws that gun hater pilot wanted the government should be held responsible. That means the tax payer will pay for gun haters pilot gun free bs!\n \n Gun hater pilot wants to disarm the law abiding citizens so criminals like the ones at columbine can freely walk around and kill their victims!\n \n Gun hater pilot wants to disarm the law abiding citizens so criminals like the ones on 9/11 that used box cutters to take over airplanes crowed with people!", 
   {}, 
   18102, 
   null, 
   1065237600.0
  ], 
  [
   18131, 
   null, 
   "sundowner", 
   "Gun hater pilot's gun control laws failed the law abiding citizens at columbine!\n \n Who should be held accountable for this failure? Well, since the government passed the gun control laws that gun hater pilot wanted the government should be held responsible. That means the tax payer will pay for gun haters pilot gun free bs!\n \n Gun hater pilot wants to disarm the law abiding citizens so criminals like the ones at columbine can freely walk around and kill their victims!\n \n Gun hater pilot wants to disarm the law abiding citizens so criminals like the ones on 9/11 that used box cutters to take over airplanes crowed with people!\n\n \n First off, what laws are you speaking of? They are not my laws. My law would be a metal detector in every damn school with screeners present to keep ANYONE from bringing a gun to school and to prevent another Columbine from happening. \n \n Second, the ones that should be held responsible are dead. Remember those little bastards that walked in and killed everyone? Yeah, the criminals...they are to blame. Should the school have had a metal detector...perhaps, but at the most they are guilty of negligence. They did not cause it. I did not cause it. Where did they get the guns? Are the parents partly responsible? The government did not give them the guns and tell them to go kill their classmates. \n \n Third, don't pretend to know my agenda or tell others what I want to do. I don't want to disarm anyone. I don't want killers to be free to walk around and kill people. I want there to be enforced laws at schools that actually keep guns out. (metal detectors...screeners...etc) I think I have said this all before...if you were listening. This is not disarming people, it is telling them that they may not carry their guns in this particular area. In a school, that's not a bad idea.\n \n And lastly, your last point had the wording of a 3 y/o, but i think i know what you meant. No, I don't want to disarm law abiding citizens. I don't want terrorists to take over planes. But my way (nobody has a gun on a plane, verified by x-ray, metal detectors, screeners..) the only weapons the terrorists will have is their hands. I would rather fight fist to fist with a terrorist than to have a gun battle at 37000 feet. This is not disarming people, it is telling them that they may not carry their guns in this particular area. In a plane, that's not a bad idea.", 
   {}, 
   18109, 
   null, 
   1065245280.0
  ], 
  [
   18133, 
   null, 
   "sundowner", 
   "Oh, and you never answered post 55 DHARD. Still avoiding it? emoticon_xchicken", 
   {}, 
   18131, 
   null, 
   1065245400.0
  ], 
  [
   18138, 
   null, 
   "kelvin90701", 
   "You never answered this DHARD. Or is that just your style, to avoid any questions that might make you think, keep twisting everyones words around, calling them gun haters and racists, and making yourself sound like a total XXX?\n\n \n Children are not full citizens and do not enjoy the full rights in the Constitution.", 
   {}, 
   18102, 
   null, 
   1065246600.0
  ], 
  [
   18186, 
   null, 
   "DHard3006", 
   " No, I don't want to disarm law abiding citizen.\n\n \n \n What laws do you want that will keep a criminal from taking a gun anywhere they want? \n \n Gee criminals that are going to kill people will simply walk up to your metal detectors and start their killing spree there.\n \n Terrorist will simply obey the rules to board airplanes as they did on 9/11 and take over the airplanes with the next thing the terrorist are allowed bring on them. Interesting how gun hater pilots can fight off a group a terrorist while still flying the plane. \n \n \n All gun hater pilots laws will do is disarm the law abiding citizen!\n \n As I said gun hater pilot will never what if a good scenarios with guns.\n What if a law abiding citizen at columbine had a gun?\n Could the deaths of the students have been avoided? \n Would the only people killed at columbine been the criminals?\n Would the simple fact that criminals and terrorist knowing that law abiding citizens can defend themselves with guns force the criminals and terrorist to not attack people?\n \n Yes to all of the above questions!\n \n Ask a criminal or terrorist if they want to go up against an armed victim.\n \n So gun hater pilot are your laws and screening and safety laws will do is disarm the law abiding citizen!\n \n Criminals and terrorist will not obey the gun control laws gun hater pilot wants!\n \n As for who is responsible for laws that make victims out of law abiding citizens, the people such as gun hater pilot that demand them! Why? Simply by passing laws that disarm law abiding citizens the government and people that demand the laws are responsible for the unarmed citizens safety!", 
   {}, 
   18131, 
   null, 
   1065287400.0
  ], 
  [
   18201, 
   null, 
   "kelvin90701", 
   "First off, what laws are you speaking of? They are not my laws. My law would be a metal detector in every damn school with screeners present to keep ANYONE from bringing a gun to school and to prevent another Columbine from happening. \n \n \n .\n\n That is the current law right now. It is in jeapordy: http://www.csmonitor.com/2003/0729/p01s02-uspo.html\n \n I think you are confusing the nature of criminal law. \n \n Criminal law is meant to punish accused after they are found guilty and nothing else. There is no such thing as preventative criminal law. You can not have a Constitutional law that targets individuals for crime prevention. There are so many violations of civil rights from that notion that I rather not even try to count them.\n \n There is an aspect of deterrence in criminal law. Deterrence is not the same as prevention before the fact. Deterrence is watching people who have violated the law, watching them get punished, then learning from their mistake where the limits of laws are at. There is no such thing as the active prevention of crime without trampling all over the Constitution. There is no such thing as Constitutionally legal restrictions of civil rights on the innocent.", 
   {}, 
   18131, 
   null, 
   1065312120.0
  ], 
  [
   18217, 
   null, 
   "sundowner", 
   "What laws do you want that will keep a criminal from taking a gun anywhere they want? \n \n \n We already have these laws in airports and federal buildings. We need them is schools now. Some schools have metal detectors already and screeners, a lot still do not have these. We need these in all schools. Why not, it would even create more jobs. I am not opposed to properly trained law enforcement professionals at schools with guns, but not teachers, janitors, or couselors. That is not their job. \n \n \nGee criminals that are going to kill people will simply walk up to your metal detectors and start their killing spree there.\n \n \n Sure, that is possible, it happened in LA a few months back. Armed law enforcement in an airport is not a bad idea. But armed, untrained citizens with guns are a bad idea. You might be proficient with a gun, but I would be willing to bet that for every 1 person who is properly trained, you would have 3 who are not. An untrained person with a gun can be very dangerous. \n \n \nTerrorist will simply obey the rules to board airplanes as they did on 9/11 and take over the airplanes with the next thing the terrorist are allowed bring on them. Interesting how gun hater pilots can fight off a group a terrorist while still flying the plane. \n \n \n We screen for weapons of all kinds. Of coarse we can not control the fact that just about anything can be used as a weapon. Human hands are good weapons, but we cannot cut everyone hands off when they fly. The only way to guarantee total safety would be to chain every passenger to thier seat naked, but this is not likely to happen. We have already seen that especially in the post 9/11 climate, ordinary passengers are much more vigilant and ready to act when posed with danger on board an aircraft. Several incidents have occured post 9/11 in which passengers have subdued would be \"terrorists\", like the richard reed case. As a pilot, my job is to fly the plane. There is no chance I will be getting out of my seat to deal with unruley passengers. The cockpit door will remained locked, and I will get the plane on the ground where outside intervention can take place. \n \n \nAll gun hater pilots laws will do is disarm the law abiding citizen!\n \n \n In an airport, they disarm everyone. This is the kind of law I am supporting. No weapons means less potential for weapons to be used. This fits for schools as well. \n \n \nAs I said gun hater pilot will never what if a good scenarios with guns.\n \n \n Like what, you shoot it out with a terrorist at 37 thousand feet and save the plane? If there were no guns on the plane to begin with, there would be no shootout. I would rather fight hand to hand in a plane with plenty of others to help me, than to fight bullet to bullet. \n \n \nWhat if a law abiding citizen at columbine had a gun?\n \n He might have killed them, he might have been in a different part of the building, he might have been killed, he might have run away, he might have shot innocent people by accident...you don't know.\n \n \nCould the deaths of the students have been avoided? \n \n Maybe, maybe not...you don't know. Chance seem slim that he would have been standing right next to the 2 gunmen and been able to shoot them both before they started killing, it is possible, but not likely.\n \n \nWould the only people killed at columbine been the criminals?\n \n Again, maybe, probably not. See reasons above.\n \n \nWould the simple fact that criminals and terrorist knowing that law abiding citizens can defend themselves with guns force the criminals and terrorist to not attack people?\n \n In some cases, yes. But at Columbine, probably not. The gunmen did not care if they lived or died, this was obvious. They were there to hurt as many people as they could before they died. They even killed themselves when they got done. I don't think they would have been deterred in any way by armed citizens. \n \n \nSo gun hater pilot are your laws and screening and safety laws will do is disarm the law abiding citizen!\n \n Partially right. Laws themselves will only disarm law abiding citizens. Enforcement of laws by screening will assure compliance with the laws by everyone. This is what they do in airports every day. \n \n \nCriminals and terrorist will not obey the gun control laws gun hater pilot wants!\n \n They probably will not obey the laws, but if they do not, the guns will be found in the screening process. That is why the ENFORCEMENT BY SCREENING is so important. A \"gun free zone\" and 35 cents...you can make a phone call with an uzi in your hand. An Enforced \"gun free zone\" means no guns, you can hold the phone in one hand and dial with the other. Silly, but it illustrates the point.\n \n \nAs for who is responsible for laws that make victims out of law abiding citizens, the people such as gun hater pilot that demand them! Why? Simply by passing laws that disarm law abiding citizens the government and people that demand the laws are responsible for the unarmed citizens safety!\n \n So if I say you can't bring a gun into my house, you leave it in the car, and while you are in there someone breaks in and shoots you, it is my responsibility? Good luck proving that one! You would first have to be able to prove that your gun would have prevented you being shot. You mentioned that courts have ruled this way? Show me some proof.", 
   {}, 
   18186, 
   null, 
   1065329640.0
  ], 
  [
   18218, 
   null, 
   "sundowner", 
   "Oh, and DHARD, you never answered my question to you in post 55 yet. Still avoiding it huh?", 
   {}, 
   18217, 
   null, 
   1065329940.0
  ], 
  [
   18219, 
   null, 
   "kelvin90701", 
   "Oh, and DHARD, you never answered my question to you in post 55 yet. Still avoiding it huh?\n\n \n Please allow me. Students do not have the full rights under the Constitution. Then not allowing them to have the right to bear arms is perfectly Constitutional.", 
   {}, 
   18218, 
   null, 
   1065330180.0
  ], 
  [
   18221, 
   null, 
   "kelvin90701", 
   "\n \n So if I say you can't bring a gun into my house, you leave it in the car, and while you are in there someone breaks in and shoots you, it is my responsibility? Good luck proving that one! You would first have to be able to prove that your gun would have prevented you being shot. You mentioned that courts have ruled this way? Show me some proof.\n\n \n Unfortunately you are responsible for your visitors saftey weather you like it or not. That is why there is homeowners insurance. That is why supermarkets mop up the floor quickly after a spill. That is why employers institute saftey programs. That is why our courts are filled up with injury law suits on private and public property. You are responsible for your visitors saftey even if they DO have a gun and get shot by a home invader. You are responsible for protecting them under civil law. If you fail to take reasonalbe measures to protect guests, then you are liable under civil law. The criminal who does the shooting is guilty under criminal law.\n \n So yes. If your guest get injured or die in a home invasion, and you prevented one of your guest from taking a firearm on your private property, then you are liable. For proof? Just check any search engine under \"trip and fall\" accidents or personal injury.", 
   {}, 
   18217, 
   null, 
   1065330900.0
  ], 
  [
   18222, 
   null, 
   "kelvin90701", 
   "We already have these laws in airports and federal buildings. We need them is schools now. Some schools have metal detectors already and screeners, a lot still do not have these. We need these in all schools. Why not, it would even create more jobs. I am not opposed to properly trained law enforcement professionals at schools with guns, but not teachers, janitors, or couselors. That is not their job. \n \n \n \n Sure, that is possible, it happened in LA a few months back. Armed law enforcement in an airport is not a bad idea. But armed, untrained citizens with guns are a bad idea. You might be proficient with a gun, but I would be willing to bet that for every 1 person who is properly trained, you would have 3 who are not. An untrained person with a gun can be very dangerous. \n \n \n \n We screen for weapons of all kinds. Of coarse we can not control the fact that just about anything can be used as a weapon. Human hands are good weapons, but we cannot cut everyone hands off when they fly. The only way to guarantee total safety would be to chain every passenger to thier seat naked, but this is not likely to happen. We have already seen that especially in the post 9/11 climate, ordinary passengers are much more vigilant and ready to act when posed with danger on board an aircraft. Several incidents have occured post 9/11 in which passengers have subdued would be \"terrorists\", like the richard reed case. As a pilot, my job is to fly the plane. There is no chance I will be getting out of my seat to deal with unruley passengers. The cockpit door will remained locked, and I will get the plane on the ground where outside intervention can take place. \n \n \n \n In an airport, they disarm everyone. This is the kind of law I am supporting. No weapons means less potential for weapons to be used. This fits for schools as well. \n \n \n \n Like what, you shoot it out with a terrorist at 37 thousand feet and save the plane? If there were no guns on the plane to begin with, there would be no shootout. I would rather fight hand to hand in a plane with plenty of others to help me, than to fight bullet to bullet. \n \n \n He might have killed them, he might have been in a different part of the building, he might have been killed, he might have run away, he might have shot innocent people by accident...you don't know.\n \n \n Maybe, maybe not...you don't know. Chance seem slim that he would have been standing right next to the 2 gunmen and been able to shoot them both before they started killing, it is possible, but not likely.\n \n \n Again, maybe, probably not. See reasons above.\n \n \n In some cases, yes. But at Columbine, probably not. The gunmen did not care if they lived or died, this was obvious. They were there to hurt as many people as they could before they died. They even killed themselves when they got done. I don't think they would have been deterred in any way by armed citizens. \n \n \n Partially right. Laws themselves will only disarm law abiding citizens. Enforcement of laws by screening will assure compliance with the laws by everyone. This is what they do in airports every day. \n \n \n They probably will not obey the laws, but if they do not, the guns will be found in the screening process. That is why the ENFORCEMENT BY SCREENING is so important. A \"gun free zone\" and 35 cents...you can make a phone call with an uzi in your hand. An Enforced \"gun free zone\" means no guns, you can hold the phone in one hand and dial with the other. Silly, but it illustrates the point.\n \n \n So if I say you can't bring a gun into my house, you leave it in the car, and while you are in there someone breaks in and shoots you, it is my responsibility? Good luck proving that one! You would first have to be able to prove that your gun would have prevented you being shot. You mentioned that courts have ruled this way? Show me some proof.\n\n \n Regarding your post on airport security. Please read my signature. It is not a proof or a fact. Just a statement from a very wise man.", 
   {}, 
   18217, 
   null, 
   1065331200.0
  ], 
  [
   18236, 
   null, 
   "sundowner", 
   "\"A country that forsakes freedom for security deserves neither freedom nor security.\" - Ben Franklin\n \n \n Looks good on paper. Now apply that theory to the MODERN world and see how well it fits in. Without security we would not have a country, and probably very little freedom. Security is not possible without giving up a little freedom. It is a sliding scale concept. You can give up all freedom and have great security. You can keep all freedom and have little security. The idea is to balance freedom against security, thus achieving the greatest amount of both. Or were you reffering to Stalin as the wise man? ;)", 
   {}, 
   18222, 
   null, 
   1065336660.0
  ], 
  [
   18243, 
   null, 
   "kelvin90701", 
   "Looks good on paper. Now apply that theory to the MODERN world and see how well it fits in. Without security we would not have a country, and probably very little freedom. Security is not possible without giving up a little freedom. It is a sliding scale concept. You can give up all freedom and have great security. You can keep all freedom and have little security. The idea is to balance freedom against security, thus achieving the greatest amount of both. Or were you reffering to Stalin as the wise man? ;)\n\n \n Pick who ever you want to consider wise. Yes he was wise and he was also a sicko and crazy from power.\n \n I suspect you are afraid of chaos and lack of security. If you are prepared and self-reliant, then uncertainty and insecurity is not frightening. I am concerned about my personal saftey. I have taken as many reasonalbe measures as possible considering my economics, my family, and environment. I am aware and concerned, I am not afraid of the uncertainty. I have done all I humanly can and prepared to accept the worst. When the worst happens, no matter what it is, flood,fire, riots, terrorist, etc. I have done everything humanly and reasonably possible. I am free from fear. How about you? I am ready for the worst. If the worst is greater than what I have prepared for, then so be it. I have no control over that. What ever happens, I will not be depending on the government. I will glady take what assistance they offer, but I am not depending on them to be there.\n \n The sliding scale only encourages more people to be reliant on the government.", 
   {}, 
   18236, 
   null, 
   1065344460.0
  ], 
  [
   18249, 
   null, 
   "Tim", 
   "Looks good on paper. Now apply that theory to the MODERN world and see how well it fits in. Without security we would not have a country, and probably very little freedom. Security is not possible without giving up a little freedom. It is a sliding scale concept. You can give up all freedom and have great security. You can keep all freedom and have little security. The idea is to balance freedom against security, thus achieving the greatest amount of both. Or were you reffering to Stalin as the wise man? ;)\n\n \n I agree. There definitely has to be a balance.No restrictions of freedom is anarchy. Some people who call themselves pro-freedom are actually more pro-anarchy. Libertarians would probably fall into this category. The philosopher John Locke, known as the intellectual father of this country, had a great influence on the founding fathers of this nation. Locke said that in a state of nature we have certain rights and freedoms. We, however, agree to have these freedoms be somewhat restricted when we enter a civilized society. Locke in his book The Second Treatise of Civil Government explained, \"MEN being, as has been said, by nature, all free, equal, and independent, no one can be put out of this estate, and subjected to the political power of another, without his own consent. The only way whereby any one divests himself of his natural liberty, and puts on the bonds of civil society, is by agreeing with other men to join and unite into a community for their comfortable, safe, and peaceable living one amongst another, in a secure enjoyment of their properties, and a greater security against any, that are not of it.\" (Chapter 8 Section 95)", 
   {}, 
   18236, 
   null, 
   1065349800.0
  ], 
  [
   18262, 
   null, 
   "sundowner", 
   "Pick who ever you want to consider wise. Yes he was wise and he was also a sicko and crazy from power.\n \n I suspect you are afraid of chaos and lack of security. If you are prepared and self-reliant, then uncertainty and insecurity is not frightening. I am concerned about my personal saftey. I have taken as many reasonalbe measures as possible considering my economics, my family, and environment. I am aware and concerned, I am not afraid of the uncertainty. I have done all I humanly can and prepared to accept the worst. When the worst happens, no matter what it is, flood,fire, riots, terrorist, etc. I have done everything humanly and reasonably possible. I am free from fear. How about you? I am ready for the worst. If the worst is greater than what I have prepared for, then so be it. I have no control over that. What ever happens, I will not be depending on the government. I will glady take what assistance they offer, but I am not depending on them to be there.\n \n The sliding scale only encourages more people to be reliant on the government.\n\n \n So in other words it is an \"every man for himself\" type deal for you. That is very noble. You are always talking about the violation of your constitutional rights, but you only seem to be concerned with yourself. The consitution is designed to protect EVERYONE, not just the individual. It does not say that the only people who deserve protection are those who choose to pick up a gun. So if it serves the majority to make laws that limit rights and freedom for the sake of security, then it seems that to not do so would be unconsitutional. Sure, I fear the idea of chaos, why not? I am also prepared to defend myself if neccesary through any means neccesary. But security, regardless of who provides it is still security. Your guns give you security, as do mine. But they are not the only kind of security. I choose to entrust the government with part of my security, you trust your guns. Security makes it less likely that I will be required to defend myself, my home, or others. This again is where the balancing act comes in. In order to achieve a greater amount of security, we must give up some freedom. The idea is the greatest amount of both. You make it sound like you need no security, but that is what your preparedness brings you, security. You might choose to take ALL responsibility for your security. I realize that it is a task that is too large for me to accomplish myself, so I prepare the best I can and trust the rest to my neighbors, community, government, and fellow human beings. This is what living in a community is all about.", 
   {}, 
   18243, 
   null, 
   1065379200.0
  ], 
  [
   18270, 
   null, 
   "kelvin90701", 
   "So in other words it is an \"every man for himself\" type deal for you. That is very noble. You are always talking about the violation of your constitutional rights, but you only seem to be concerned with yourself. The consitution is designed to protect EVERYONE, not just the individual. It does not say that the only people who deserve protection are those who choose to pick up a gun. So if it serves the majority to make laws that limit rights and freedom for the sake of security, then it seems that to not do so would be unconsitutional. Sure, I fear the idea of chaos, why not? I am also prepared to defend myself if neccesary through any means neccesary. But security, regardless of who provides it is still security. Your guns give you security, as do mine. But they are not the only kind of security. I choose to entrust the government with part of my security, you trust your guns. Security makes it less likely that I will be required to defend myself, my home, or others. This again is where the balancing act comes in. In order to achieve a greater amount of security, we must give up some freedom. The idea is the greatest amount of both. You make it sound like you need no security, but that is what your preparedness brings you, security. You might choose to take ALL responsibility for your security. I realize that it is a task that is too large for me to accomplish myself, so I prepare the best I can and trust the rest to my neighbors, community, government, and fellow human beings. This is what living in a community is all about.\n\n \n The \"community\", the cops, and the government; are not responsible for your saftey. If your attacked by a felon and injured, you can not sue them for failure to provide protection. Basically they are not responisble for you. If your attacked by a felon and your neighbor comes to help, without a firearm, there are now two victims, not just one. Most likely if your attacked by felon, your neighbors will do what most people will do in a big city: lock the door, shut the drapes, and not get involved.\n \n I do not just trust guns. I trust all legal and Constitutionally allowed methods of protection and defense. Yes the Constitution protects everyone. I am not Constitutionally bound to protect your rights or your life. I am not willing to give up my guns, unless everyone else as a \"community\" also makes a sacrafice. Why just me? If all the anti-gunners want security, then ask them to give something up first. How about thier right to illegal search? It only takes 2-3 minutes and it will make the whole country safe.", 
   {}, 
   18262, 
   null, 
   1065392280.0
  ], 
  [
   18284, 
   null, 
   "sundowner", 
   "That is the beauty of being American. I do not have to co-operate, be socially constructive, or have a world view. It is about me. Only me knows what is best for me. Any other way it is a group or government deciding what is best for me. As far as help from the state? The less the better. The less restriction, intrustion, and authority the state has, the better I can do what is best for me. The less you take care of yourself and have to rely on others, the more likely your just sheep.\n \n \n This was from another post by kelvin, but it seems to fit in rather well with this thread. \n \n \"a group or government deciding what is best for me.\"\n -America was founded on these principles. We elect the government. They are our voice. We carry concerns to them. They write legislation. This legislation is voted on. The majority vote decides whether or not the vote will pass and a law is enacted. You talk about the beauty of being an American, but it is clear you only want to be an American when it is convienient to your life. If you don't believe in the process in which we set up and enforce the laws, you have no right to try to change the laws. You do have the right to try to change the process. There is a difference. \n \n \nI trust all legal and Constitutionally allowed methods of protection and defense. \n \n \n Unless you feel that they violate your rights...correct?", 
   {}, 
   18270, 
   null, 
   1065410460.0
  ], 
  [
   18316, 
   null, 
   "DHard3006", 
   "This again is where the balancing act comes in. In order to achieve a greater amount of security, we must give up some freedom. The idea is the greatest amount of both. You make it sound like you need no security, but that is what your preparedness brings you, security. You might choose to take ALL responsibility for your security. I realize that it is a task that is too large for me to accomplish myself, so I prepare the best I can and trust the rest to my neighbors, community, government, and fellow human beings. This is what living in a community is all about.\n\n \n \n Gun haters pilots greatest amount of both is always at the cost of the law abiding citizens right to bear arms!", 
   {}, 
   18262, 
   null, 
   1065459180.0
  ], 
  [
   18344, 
   null, 
   "DHard3006", 
   "This again is where the balancing act comes in. In order to achieve a greater amount of security, we must give up some freedom. The idea is the greatest amount of both. You make it sound like you need no security, but that is what your preparedness brings you, security. You might choose to take ALL responsibility for your security. I realize that it is a task that is too large for me to accomplish myself, so I prepare the best I can and trust the rest to my neighbors, community, government, and fellow human beings. This is what living in a community is all about.\n\n \n Gun hater pilots logic is to give up the right bear arms of the law abiding citizens in the name of safety. This worked on 9/11 as unarmed law abiding citizens were hijacked and flown into the WTC. \n \n Why is it that gun haters like gun hater pilot never ask the criminals ore terrorist to give up anything?\n \n If a government or business denies you the right to self defense then that government or business is responsible for your safety. Gun hater pilot does not like this because gun hater pilots want to deny people the right to self defense. Then gun hater pilot denies the unarmed law abiding citizens the right to hold the business or government that disarmed you responsible if you are harmed or killed by criminals or terrorist!\n \n Gun hater pilots logic is to ban the right to bear arms. This is what gun hater pilot called common sense!", 
   {}, 
   18262, 
   null, 
   1065474000.0
  ], 
  [
   18347, 
   null, 
   "sundowner", 
   "Gun hater pilots logic is to give up the right bear arms of the law abiding citizens in the name of safety. This worked on 9/11 as unarmed law abiding citizens were hijacked and flown into the WTC. \n \n Why is it that gun haters like gun hater pilot never ask the criminals ore terrorist to give up anything?\n \n If a government or business denies you the right to self defense then that government or business is responsible for your safety. Gun hater pilot does not like this because gun hater pilots want to deny people the right to self defense. Then gun hater pilot denies the unarmed law abiding citizens the right to hold the business or government that disarmed you responsible if you are harmed or killed by criminals or terrorist!\n \n Gun hater pilots logic is to ban the right to bear arms. This is what gun hater pilot called common sense!\n\n \n No, I am not asking anyone to give anything up. You are already not allowed to carry guns on planes. How can you give that up if you cannot do it already? Gun laws did work on 9/11. No terrorist had a gun on the planes. They had boxcutters, which by law were allowed. And as far as those \"unarmed\" citizens...you mean the ones that were allowed by law to carry knives up with up to a 4 inch blade on a plane? Those unarmed citizens? If the gun law worked, why would a weapons law not work...your logic (or lack of) seems very flawed here.\n \n What do you mean that I never asked terrorist or criminals to give up anything. Do you know who the terrorists or criminals are? If so, please go to the FBI and tell them. Since we cannot distinguish them from the law abiding citizens (just like on 9/11), we should not allow anyone to carry weapons on board. THIS IS WHAT I CALL COMMON SENSE...GET IT RIGHT! Don't pretend to know what my logic is or is not. You say I want to ban the right to bear arms, and that this is what I call logic and common sense. I do not want to ban your right to bear arms, I want my own right to bear arms. I do believe that it is right to impose a LIMIT though, such as not allowing people other than law enforcement to take a gun on a plane or in a school. There is no need for a gun in these places, nor any weapons for that matter. That is my logic and common sense.", 
   {}, 
   18344, 
   null, 
   1065476940.0
  ], 
  [
   18396, 
   null, 
   "DHard3006", 
   "No, I am not asking anyone to give anything up. You are already not allowed to carry guns on planes. How can you give that up if you cannot do it already? Gun laws did work on 9/11. No terrorist had a gun on the planes. They had boxcutters, which by law were allowed. And as far as those \"unarmed\" citizens...you mean the ones that were allowed by law to carry knives up with up to a 4 inch blade on a plane? Those unarmed citizens? If the gun law worked, why would a weapons law not work...your logic (or lack of) seems very flawed here.\n \n What do you mean that I never asked terrorist or criminals to give up anything. Do you know who the terrorists or criminals are? If so, please go to the FBI and tell them. Since we cannot distinguish them from the law abiding citizens (just like on 9/11), we should not allow anyone to carry weapons on board. THIS IS WHAT I CALL COMMON SENSE...GET IT RIGHT! Don't pretend to know what my logic is or is not. You say I want to ban the right to bear arms, and that this is what I call logic and common sense. I do not want to ban your right to bear arms, I want my own right to bear arms. I do believe that it is right to impose a LIMIT though, such as not allowing people other than law enforcement to take a gun on a plane or in a school. There is no need for a gun in these places, nor any weapons for that matter. That is my logic and common sense.\n\n \n \n Gun haters like gun hater pilot commonly use this lie 'I do not want to ban your right to bear arms\". This is then followed by the words but you should not be able to have a guns here or you should not be able to have that type of gun. \n \n If gun hater pilot did not have a problem with the law abiding citizen with guns, gun hater pilot would not be demanded that law abiding citizens be disarmed. Why doesn't gun hater pilot demand that criminals be held accountable?\n \n As for gun hater pilots defense of the airline refusing to allow guns onboard airplane. I said the airlines can do this. However by denying a person the right to bear arms the airlines are responsible for the safety of the unarmed law abiding citizen. Which they failed to protect on9/11 and the courts have ruled can be held accountable.\n \n Now gun hater pilot does not like this. Why? Simple like all gun haters gun hater pilot does not want to be held responsible for all of the law abiding citizens lives that are lost to criminals while in gun free zones like schools, airports, government building!\n \n If gun haters wanted to stop criminals from having guns they would simply demand that dangerous criminals be retained in prison!\n \n Once again we see gun hater logic. Disarm the law abiding citizen by limiting or banning the right to bear arms. Then the gun haters do not want to be held responsible when they fail to protect the unarmed law abiding citizen!\n \n Gun hater pilot's lack of logic is to not allow law abding citizens the right to bear arms, and do nothing to protect the unarmed law abiding citizens.", 
   {
    "unicode_changes_made": true
   }, 
   18347, 
   null, 
   1065490200.0
  ], 
  [
   18398, 
   null, 
   "epaphras_faith", 
   "Gun haters like gun hater pilot commonly use this lie 'I do not want to ban your right to bear arms\". This is then followed by the words but you should not be able to have a guns here or you should not be able to have that type of gun. \n \n If gun hater pilot did not have a problem with the law abiding citizen with guns, gun hater pilot would not be demanded that law abiding citizens be disarmed. Why doesn't gun hater pilot demand that criminals be held accountable?\n \n As for gun hater pilots defense of the airline refusing to allow guns onboard airplane. I said the airlines can do this. However by denying a person the right to bear arms the airlines are responsible for the safety of the unarmed law abiding citizen. Which they failed to protect on9/11 and the courts have ruled can be held accountable.\n \n Now gun hater pilot does not like this. Why? Simple like all gun haters gun hater pilot does not want to be held responsible for all of the law abiding citizens lives that are lost to criminals while in gun free zones like schools, airports, government building!\n \n If gun haters wanted to stop criminals from having guns they would simply demand that dangerous criminals be retained in prison!\n \n Once again we see gun hater logic. Disarm the law abiding citizen by limiting or banning the right to bear arms. Then the gun haters do not want to be held responsible when they fail to protect the unarmed law abiding citizen!\n \n Gun hater pilot's lack of logic is to not allow law abding citizens the right to bear arms, and do nothing to protect the unarmed law abiding citizens.\n\n \n Could you please stop referring to \"gun hater pilot.\" Start using the names. It is simply a point of respect for the person. You don't have to agree with their position and can argue vehemently against it. However your continual use of \"gun hater pilot\" is ad hominem and only harms your position not supports it. I personally am FOR the right to bear arms but if you refer to me in a derogatory fashion then that shall even more prove my point. Grow up.", 
   {
    "unicode_changes_made": true
   }, 
   18396, 
   null, 
   1065490980.0
  ], 
  [
   18401, 
   null, 
   "sundowner", 
   "If gun haters wanted to stop criminals from having guns they would simply demand that dangerous criminals be retained in prison!\n \n \n Have you ever heard me argue for dangerous criminals to be released from prison? HAS ANYONE HERE HEARD ME SAY THAT? I do not set prison terms. I have no control over when someone is released. I am in favor of longer prison terms or even the death penalty in cases involving the use of a gun in the commision of the crime. Again, don't pretend to know my agenda, and please don't attempt to present MY agenda on this thread. Post YOUR own agenda, or stop posting. Make a real argument for once, and maybe someone would be a little more interested in what you have to say.", 
   {}, 
   18398, 
   null, 
   1065491820.0
  ], 
  [
   18407, 
   null, 
   "kelvin90701", 
   "\"a group or government deciding what is best for me.\"\n -America was founded on these principles. We elect the government. They are our voice. We carry concerns to them. They write legislation. This legislation is voted on. The majority vote decides whether or not the vote will pass and a law is enacted. ?\n\n \n \n Fine. Then repeal the 2nd Amendment. That is perfectly Constitutional.\n \n You know that WILL never happen. That is why anti-gunners must come up with all sorts of uncontitutional trickery.", 
   {}, 
   18284, 
   null, 
   1065495480.0
  ], 
  [
   18410, 
   null, 
   "sundowner", 
   "Fine. Then repeal the 2nd Amendment. That is perfectly Constitutional.\n \n You know that WILL never happen. That is why anti-gunners must come up with all sorts of uncontitutional trickery.\n\n \n I have and never will support the repeal of the 2nd amendment. I do think it needs to be modified slightly to fit in with modern times, but we should still have the right to own guns. Do you see it as an all or none type deal for you? Either no laws or no guns? I think this can meet in the middle, but there still needs to be some gun control. I would rather see common sense measures in place, than to never be able to hunt, go to the range, or carry my pistol for protection. You know my stance on schools and airplanes, and I know yours. They need not be repeated, but what do you propose as common sense legislation to appease the masses?", 
   {}, 
   18407, 
   null, 
   1065496200.0
  ], 
  [
   18428, 
   null, 
   "DHard3006", 
   "I have and never will support the repeal of the 2nd amendment. I do think it needs to be modified slightly to fit in with modern times, but we should still have the right to own guns. Do you see it as an all or none type deal for you? Either no laws or no guns? I think this can meet in the middle, but there still needs to be some gun control. I would rather see common sense measures in place, than to never be able to hunt, go to the range, or carry my pistol for protection. You know my stance on schools and airplanes, and I know yours. They need not be repeated, but what do you propose as common sense legislation to appease the masses?\n\n \n \n Hey here is the definition of infringement\n \n 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n \n So tell me how you are pro right to bear arms if you want \n limits on that right? \n \n If you want to limit or ban a right you are not defending that right!", 
   {}, 
   18410, 
   null, 
   1065502620.0
  ], 
  [
   18430, 
   null, 
   "sundowner", 
   "Hey here is the definition of infringement\n \n 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n \n So tell me how you are pro right to bear arms if you want \n limits on that right? \n \n If you want to limit or ban a right you are not defending that right!\n\n \n I was not addressing you.", 
   {}, 
   18428, 
   null, 
   1065502860.0
  ], 
  [
   18446, 
   null, 
   "kelvin90701", 
   "I have and never will support the repeal of the 2nd amendment. I do think it needs to be modified slightly to fit in with modern times, but we should still have the right to own guns. Do you see it as an all or none type deal for you? Either no laws or no guns? I think this can meet in the middle, but there still needs to be some gun control. I would rather see common sense measures in place, than to never be able to hunt, go to the range, or carry my pistol for protection. You know my stance on schools and airplanes, and I know yours. They need not be repeated, but what do you propose as common sense legislation to appease the masses?\n\n \n \n Fine. Repeal the the 2nd Amendment and put in a common sense amendment.\n \n Again you know it will never happen, that is why anti-gunners need unconstitutional trickery.", 
   {}, 
   18410, 
   null, 
   1065515760.0
  ], 
  [
   18448, 
   null, 
   "sundowner", 
   "Fine. Repeal the the 2nd Amendment and put in a common sense amendment.\n \n Again you know it will never happen, that is why anti-gunners need unconstitutional trickery.\n\n \n Yes, that makes sense. Why do we need a 200+ y/o document that cannot be interpreted into modern times. Do you see the point? Times change, and we need to include these changes in how we interpret the constitution. There is nothing wrong with the second amendment, other than the fact that it is 200+ y/o. Complete repeal of all the gun laws will not happen either...including that pesky one about guns in airplanes. But does it strike you as interesting that when the 2nd amendment was written that there were no airplanes, terrorists, or school shootings? I support the amendment as is, it just needs to be logically applied to modern times. The all or none concept does nothing for the cause.", 
   {}, 
   18446, 
   null, 
   1065516840.0
  ], 
  [
   18459, 
   null, 
   "montalban", 
   "Fine. Then repeal the 2nd Amendment. That is perfectly Constitutional.\n \n You know that WILL never happen. That is why anti-gunners must come up with all sorts of unconstitutional trickery.\n\n \n There are several concentric (and circular) arguments at work here.\n \n a) the assumption that something will never happen, because it hasn't so far\n \n b) that the only reason it would is out of trickery - obviously you have little faith in US democracy! In fact you don't really seem to like your country very much indeed! I wonder why you'd want to live there...\n \n You don't trust your government. I mean, are their politicians in your country so evil that they are just sitting around all day waiting for you to turn your back so they can steal your freedoms. Is this the sort of democracy you want to export to the world?\n \n You don't trust a very large portion of your own fellow citizens - whom you accuse of using illegal methods to achieve ends - obviously such an alarming set of actions can only happen in a poor democratic state.\n \n In fact historically you're not alone - hence so much bloodshed expended against your own government!", 
   {
    "post_info": {
     "post_title": "Why do you hate America so much?"
    }
   }, 
   18407, 
   null, 
   1065532080.0
  ], 
  [
   18462, 
   null, 
   "Rev. HellH0und", 
   "I have and never will support the repeal of the 2nd amendment. I do think it needs to be modified slightly to fit in with modern times, but we should still have the right to own guns. Do you see it as an all or none type deal for you? Either no laws or no guns? I think this can meet in the middle, but there still needs to be some gun control. I would rather see common sense measures in place, than to never be able to hunt, go to the range, or carry my pistol for protection. You know my stance on schools and airplanes, and I know yours. They need not be repeated, but what do you propose as common sense legislation to appease the masses?\n\n \n \n \n Name ONE RATIONAL MODERRN gun law that has been succsesfu in reducing crime. Name which gun laws the criminals at Columbine broke. Name the one that saved the victims there.\n \n \n You know.. When dupes call for \"common sense\" gun laws its rather insulting because obviously myself and others who support civil rights (including the 2nd) do not have this coveted \"comon sense\" that you lefties have. \n \n \n What is \"common sense\" about banning bayonett lugs?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning flash suppressors?\n How many lives did this ban save? 0\n \n What is \"common sense\" about limiting guns to 10 rounds?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning folding stocks?\n How many lives did this ban save? 0\n \n What is \"common sense\" about these new one gun a month laws?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning imported ammo?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning foriegn made rifles?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning pistol grips?\n How many lives did this ban save? 0\n \n \n \n The argument is not about guns its about control. Either you are to blinded by the media whores to see this or you actually believe that \"the people\" can not be trusted.\n \n \n The Second Amendment is not about duck hunting.", 
   {}, 
   18410, 
   null, 
   1065538140.0
  ], 
  [
   18463, 
   null, 
   "AMD4EVER", 
   "What is \"common sense\" about banning bayonett lugs?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning flash suppressors?\n How many lives did this ban save? 0\n \n What is \"common sense\" about limiting guns to 10 rounds?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning folding stocks?\n How many lives did this ban save? 0\n \n What is \"common sense\" about these new one gun a month laws?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning imported ammo?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning foriegn made rifles?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning pistol grips?\n How many lives did this ban save? 0\n\n \n I could just as easily answer 1,000 for each of these questions and no one would be able to prove that I am wrong. Isn't it great throwing out questions for which there is no proven answer and then announcing that you know the answer!\n \n Instead of just stating this how about I ask for you to prove that the new one gun a month law hasn't saved any lives! lol, lets see what you got emoticon_xclown", 
   {}, 
   18462, 
   null, 
   1065539400.0
  ], 
  [
   18468, 
   null, 
   "Rev. HellH0und", 
   "I could just as easily answer 1,000 for each of these questions and no one would be able to prove that I am wrong. Isn't it great throwing out questions for which there is no proven answer and then announcing that you know the answer!\n \n Instead of just stating this how about I ask for you to prove that the new one gun a month law hasn't saved any lives! lol, lets see what you got emoticon_xclown\n\n \n \n \n Simple... The one gun a month law has not been passed therefore there are no statistics.\n \n See in debate I make this claim and it is your job to disprove it if you can. Can you find a case of gang warefare by bayonett charge? If so lets see it otherwise move on.", 
   {}, 
   18463, 
   null, 
   1065542880.0
  ], 
  [
   18472, 
   null, 
   "AMD4EVER", 
   "Simple... The one gun a month law has not been passed therefore there are no statistics.\n\n \n lol, no wonder 0 is the answer then. Fine, then prove that in theory that a one gun a month law couldn't have saved 1,000 lives. Or prove that 1,000 isn't the answer to one of the valid questions.\n \n \nSee in debate I make this claim and it is your job to disprove it if you can. Can you find a case of gang warefare by bayonett charge? If so lets see it otherwise move on.\n\n \n lol, there is no way to disprove what you are stating. It would be like me asking you to prove that nuclear weapons have actually cost us more lives than they have saved. In theory it has saved lives but that cannot be shown. It is obvious that nuclear weapons use on Japan ended the war with less deaths than would have occurred without nuclear weapons but how exactly can we prove this? It is just theoretical just like the responses to your questions are. So I'll be the first to admit that I cannot disprove anything that you have said as it pertains to those questions.", 
   {}, 
   18468, 
   null, 
   1065545880.0
  ], 
  [
   18474, 
   null, 
   "Rev. HellH0und", 
   "lol, no wonder 0 is the answer then. Fine, then prove that in theory that a one gun a month law couldn't have saved 1,000 lives. Or prove that 1,000 isn't the answer to one of the valid questions.\n \n \n \n lol, there is no way to disprove what you are stating. It would be like me asking you to prove that nuclear weapons have actually cost us more lives than they have saved. In theory it has saved lives but that cannot be shown. It is obvious that nuclear weapons use on Japan ended the war with less deaths than would have occurred without nuclear weapons but how exactly can we prove this? It is just theoretical just like the responses to your questions are. So I'll be the first to admit that I cannot disprove anything that you have said as it pertains to those questions.\n\n \n \n Actually there is.. They have statistics on the web that show from police reports that what I say is true. You are free to find it yourself.\n \n \n Can I add LOL into every sentence like you?", 
   {}, 
   18472, 
   null, 
   1065546360.0
  ], 
  [
   18475, 
   null, 
   "AMD4EVER", 
   "Actually there is.. They have statistics on the web that show from police reports that what I say is true. You are free to find it yourself.\n \n \n Can I add LOL into every sentence like you?\n\n \n \"How many lives did this ban save?\"\n \n Now how can this be proven? Lets say that this ban occurred in 1980 or whatever. Lets then say that had it no been in place in 1984 then 3 lives would have been lost because of it. How could you prove that this would have happened if the ban had not been put into place? You can only theoretically say that lives have or have not been saved because of this ban. It is the same with nuclear weapons. It is only theoretical.\n \n As for the lol's, I'm just in a laughing mood for some reason. I feel the need to write lol if something makes me smile :) You can join along if you wish.", 
   {}, 
   18474, 
   null, 
   1065546540.0
  ], 
  [
   18478, 
   null, 
   "Rev. HellH0und", 
   "\"How many lives did this ban save?\"\n \n Now how can this be proven? Lets say that this ban occurred in 1980 or whatever. Lets then say that had it no been in place in 1984 then 3 lives would have been lost because of it. How could you prove that this would have happened if the ban had not been put into place? You can only theoretically say that lives have or have not been saved because of this ban. It is the same with nuclear weapons. It is only theoretical.\n \n As for the lol's, I'm just in a laughing mood for some reason. I feel the need to write lol if something makes me smile :) You can join along if you wish.\n\n \n You want to get caught up in this as a tactic NOT to be proven wrong. When there are clear statisitic on all cept the one a month ban lets turn our focus on:\n \n \n What is \"common sense\" about banning bayonett lugs?\n \n \n What is \"common sense\" about banning flash suppressors?\n \n \n What is \"common sense\" about limiting guns to 10 rounds?\n \n \n What is \"common sense\" about banning folding stocks?\n \n \n What is \"common sense\" about these new one gun a month laws?\n \n \n What is \"common sense\" about banning imported ammo?\n \n \n What is \"common sense\" about banning foriegn made rifles?\n \n \n What is \"common sense\" about banning pistol grips?\n \n \n As you are one who brings up \"conventional logic\" please explain this \"logic to me\" Also tell me how it helps you?", 
   {}, 
   18475, 
   null, 
   1065546840.0
  ], 
  [
   18483, 
   null, 
   "AMD4EVER", 
   "As you are one who brings up \"conventional logic\" please explain this \"logic to me\" Also tell me how it helps you?\n\n \n Let me get this straight. I had a logical answer to your original questions and now without giving me credit for providing logical insite into those questions you simply change what the question is.\n \n Even these questions are simply a matter of what you believe makes sense and what you believe doesn't make sense. Because of your mindset you may never believe that any of these make sense based on theoretical data and even proven data. To try and answer these for you will only result in you saying the responses are all wrong based on some other theoretical data that can then be disputed again by the other side. It is just a circle.\n \n Let us test my theory:\n \n \"What is \"common sense\" about limiting guns to 10 rounds?\"\n \n It will allow you 10 shots therefore making the gun less deadly for attacks than one with 20, 50, or a billion shots.\n \n Now you put down your first piece of the circle.", 
   {}, 
   18478, 
   null, 
   1065547800.0
  ], 
  [
   18486, 
   null, 
   "epaphras_faith", 
   "You want to get caught up in this as a tactic NOT to be proven wrong. When there are clear statisitic on all cept the one a month ban lets turn our focus on:\n \n \n What is \"common sense\" about banning bayonett lugs?\n \n \n What is \"common sense\" about banning flash suppressors?\n \n \n What is \"common sense\" about limiting guns to 10 rounds?\n \n \n What is \"common sense\" about banning folding stocks?\n \n \n What is \"common sense\" about these new one gun a month laws?\n \n \n What is \"common sense\" about banning imported ammo?\n \n \n What is \"common sense\" about banning foriegn made rifles?\n \n \n What is \"common sense\" about banning pistol grips?\n \n \n As you are one who brings up \"conventional logic\" please explain this \"logic to me\" Also tell me how it helps you?\n\n \n Actually: The reason behind banning all of these items as they are used on the weapons of choice for criminals (except perhaps the bayonet) the rest like the folding stock make the gun easier to hide or easier to hide where it is fired or as far as imported items they would include ammunition that can do extensive harm to an unarmed civilian and limiting to ten rounds makes it harder for many criminals to obtain automatic weapons. It does not stop it but it does help. YOU look for the statistics on it. \n \n Also please note that I am pro gun. I also support the background checks. I work in the mental health field and there are many people that I work with that guns should be absoultely kept away.", 
   {}, 
   18478, 
   null, 
   1065548340.0
  ], 
  [
   18489, 
   null, 
   "DHard3006", 
   "Actually: The reason behind banning all of these items as they are used on the weapons of choice for criminals (except perhaps the bayonet) the rest like the folding stock make the gun easier to hide or easier to hide where it is fired or as far as imported items they would include ammunition that can do extensive harm to an unarmed civilian and limiting to ten rounds makes it harder for many criminals to obtain automatic weapons. It does not stop it but it does help. YOU look for the statistics on it. \n \n Also please note that I am pro gun. I also support the background checks. I work in the mental health field and there are many people that I work with that guns should be absoultely kept away.\n\n \n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell me how you are pro right to bear arms if you want \n limits on that right? \n \n Criminals do not obey gun bans!\n \n Background checks just check for police and court records!\n \n Gun hater logic with background checks is to allow dangerous criminals out of prison and then try to keep guns away from the dangerous criminals. Simple and common sense solution for this problem would be to keep the dangerous criminals in prison! This common sense approach is to hard for the gun haters to grasp!\n \n More gun hater logic! Gun bans do not stop it but it helps, what XXXX! It sure helped the unarmed people on the airplanes on 9/11, it sure help the unarmed victims at columbine! What is the gun hater logic, criminals will obey gun bans? Not! \n \n The only people affected by gun bans are the law abiding citizens!\n \n More gun hater logic, it is kinder and gentler if you are shot with a gun limited to 10 bullets!\n \n Oh what is wrong with limiting how many bullets a gun can hold? It infringes on the right to bear arms!\n \n Plus gun hater Sarah Brady now wants to reduce the limit even more! Let a gun hater ban one gun and the gun hater will ban all guns later on!\n \n Proof of this. On the gun haters web that started out just to ban cheap guns, the gun haters now want to ban all handguns!\n \n Remember that gun hater lie is just that a lie. You know the one where the gun haters claim they do not want your guns!\n Why is this a lie? Simple if the gun haters did not want your guns why do gun haters only want gun control laws that law abiding citizens obey and criminals do not?", 
   {}, 
   18486, 
   null, 
   1065549420.0
  ], 
  [
   18491, 
   null, 
   "Rev. HellH0und", 
   "Actually: The reason behind banning all of these items as they are used on the weapons of choice for criminals (except perhaps the bayonet) the rest like the folding stock make the gun easier to hide or easier to hide where it is fired or as far as imported items they would include ammunition that can do extensive harm to an unarmed civilian and limiting to ten rounds makes it harder for many criminals to obtain automatic weapons. It does not stop it but it does help. YOU look for the statistics on it. \n \n Also please note that I am pro gun. I also support the background checks. I work in the mental health field and there are many people that I work with that guns should be absoultely kept away.\n\n \n \n Show me where a criminal has used a flash supressor. Show me how a criminal is willing to not use a \"folding stock\" because it is out lawed\". You are confusing imported ammo ban with the so-called armor piercing bullet ban....\n \n Show me that these weapons are the weapons of choice for criminals.. Statistically it is less than 1% of all gun crimes. \n \n \n I know the statistics, m y b r o t h a...", 
   {}, 
   18486, 
   null, 
   1065549720.0
  ], 
  [
   18500, 
   null, 
   "AMD4EVER", 
   "Fine we will cut down the talk on the \"Master of my destiny\" although I can't see what the hell you can be thinking to believe you are truly master of your destiny. It simply makes no sense at all!\n \n \nRepeal of unconstitutional laws Gun laws, Drug laws, etc. You are just now figuring out I am a Libertarian? I mentioned several times in the past that I run for various offices under the Libertarian party!\n\n \n Your moving dangerously close to anarchy then.\n \n \nI would not deny ANYONE any of these things... I Libertarian, Your respons TOTALITARIAN.\n\n \n Well if one simply statement can define a person then your one statement about gun control does make you in favor of anarchy. :)\n \n \nbecause you want to regulate me based on the actions of your (criminal) brother...\n\n \n I have to believe that you have a criminal mindset based on some of the things you have mentioned here.\n \n \nAh eliminate guns for \"the common good\". Eliminate the jews \"for the common good\", Eliminate freedom of religion \"for the common good\".\n\n \n I don't understand what you are getting at here. Why is eliminating the Jews part of the common good or eliminating religion? There has to be a reason before you can make a determination for something like this. I mean why is gun freedom part of the common good? If there is no reason then it is clear that it is not part of the common good. So don't ask me stupid questions like that and hope to make a point by doing it.\n \n \n\"So although you are not my brother, I cannot trust you more than I trust my brother\"\n \n But you trust your government more? The government has killed many more people than I have. In fact have I EVER indicated I would be willing to shoot anyone? (invading armies aside).\n\n \n I trust the government to do what is in their best interest and in the past what has been in their interest has been in my interest. It trust that the trend will continue. Your wish is to trust common individuals over the government. This is far more unstable and dangerous in my view although it is not as well tested as the government idea is.\n \n \nYou are trying to take a literal approach to a non literal concept. And for this thread lets move on. \n\n \n If it is non-literal then can you admit that you are not literally the master of your own destiny? I just have to know that you have the ability to do this still. Also, why do you even claim something that you don't actually mean?\n \n \nAnd your willing to bet your life on this?\n\n \n Are you willing to bet your life against it?\n \n \nI bet you are wrong if you were honest.\n\n \n How so?\n \n \nNow answer the same question specifically if this guy has a gun and says he is going to kill you..\n \n If you respond to nothing in this post respond to this.\n\n \n You are already dead then. If he is going to kill you then he isn't even going to tell you that he will do it. There is no list. There is just instant death. Now if he had a gun and instead of sipmly saying he was going to kill me instead went through the above list, then #3 is still where I would make my move. Nothing would have changed since he is still in my range regardless as to whether he has a gun or knife. I would actually prefer for him to have a gun as oppose to a knife in this situation since you WILL get cut by the knife but you will likely be able to take the gun out of the situation without harm.", 
   {}, 
   18491, 
   null, 
   1065554940.0
  ], 
  [
   18501, 
   null, 
   "sundowner", 
   "Name ONE RATIONAL MODERRN gun law that has been succsesfu in reducing crime. Name which gun laws the criminals at Columbine broke. Name the one that saved the victims there.\n \n \n You know.. When dupes call for \"common sense\" gun laws its rather insulting because obviously myself and others who support civil rights (including the 2nd) do not have this coveted \"comon sense\" that you lefties have. \n \n \n What is \"common sense\" about banning bayonett lugs?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning flash suppressors?\n How many lives did this ban save? 0\n \n What is \"common sense\" about limiting guns to 10 rounds?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning folding stocks?\n How many lives did this ban save? 0\n \n What is \"common sense\" about these new one gun a month laws?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning imported ammo?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning foriegn made rifles?\n How many lives did this ban save? 0\n \n What is \"common sense\" about banning pistol grips?\n How many lives did this ban save? 0\n \n \n \n The argument is not about guns its about control. Either you are to blinded by the media whores to see this or you actually believe that \"the people\" can not be trusted.\n \n \n The Second Amendment is not about duck hunting.\n\n \n How can you really know if a law worked? You must first be able to prove that the person was going to commit the crime, then you must prove that the law prevented them from commiting the crime. You cannot do this. The only way we can tell if a law seems to be effective, is statistical comparison of an equal amount of time bofore the law and after the law. Obviously the laws at Columbine did not prevent the shooting...I think we all agree on this, and I have never disputed this. A gun free school zone means nothing. Looks good on paper, but if you do not enforce it, you might as well wipe your butt with it. The only way laws work is if they are enforced. Screeners and security physically checking for guns will prevent another Columbine. Think about the highway. Would we obey the speed limit if there were no cops to enforce it? \n \n Lefty? No. The only way I am a lefty is that I am left handed. If I affiliated myself on the political scale, I would put myself directly dead center. I like to think for myself, not let the views of a group sway my opinion to one side or another. \n \n All of these so called \"common sense\" laws you put up are nothing more than XXXX. Who cares if you have a flash suppressor, it does not make the gun less lethal. I don't subscribe to the thought that these are common sense laws. I have stated very clearly in the past what I think common sense laws, and I will not repeat them again. \n \n It is about gun control, I know that. I am not saying get rid of guns. The majority of gun control laws are XXXX. I know criminals don't obey gun control laws. But when properly enforced, everyone obeys them. So it comes down to a question of whether it is better to grant unlimited rights with guns to everyone (criminals included), or to ask that everyone give up a few rights in order to be able to enforce gun control laws and prevent future crimes like Columbine.", 
   {}, 
   18462, 
   null, 
   1065555000.0
  ], 
  [
   18505, 
   null, 
   "Rev. HellH0und", 
   "\n Your moving dangerously close to anarchy then.\n \n \n \n Well if one simply statement can define a person then your one statement about gun control does make you in favor of anarchy. :)\n \n\n \n \n I will again refer to our founding fathers:\n \n They that can give up essential liberty to purchase a little temporary safety deserve neither liberty or safety. \n --Benjamin Franklin \n \n It is in vain, sir, to extenuate the matter. Gentlemen may cry, Peace, Peace--but there is no peace. The war is actually begun! The next gale that sweeps from the north will bring to our ears the clash of resounding arms! Our brethren are already in the field! Why stand we here idle? What is it that gentlemen wish? What would they have? Is life so dear, or peace so sweet, as to be purchased at the price of chains and slavery? Forbid it, Almighty God! I know not what course others may take; but as for me, give me liberty or give me death! \n --Patrick Henry March 23,1775 \n \n \n \n\n I have to believe that you have a criminal mindset based on some of the things you have mentioned here.\n\n \n This is a bigoted and predjudiced statement. What have I said/done to make you dare call me one of \"a criminal mindset\". This is an ignorant viewpoint and an insult to say the least.\n \n \n \n\n I don't understand what you are getting at here. Why is eliminating the Jews part of the common good or eliminating religion? There has to be a reason before you can make a determination for something like this. I mean why is gun freedom part of the common good? If there is no reason then it is clear that it is not part of the common good. So don't ask me stupid questions like that and hope to make a point by doing it.\n\n \n Your coveted conventional wisdom thought all these things were good to the nazi's and the communist purges, pol pot, etc etc.\n \n \n \n\n I trust the government to do what is in their best interest and in the past what has been in their interest has been in my interest. It trust that the trend will continue. Your wish is to trust common individuals over the government. This is far more unstable and dangerous in my view although it is not as well tested as the government idea is.\n \n\n \n I will refer once again to people of the past:\n \n Liberty has never come from the government. Liberty has always come from the subjects of government. The history of liberty is the history of resistance. The history of liberty is a history of the limitation of governmental power, not the increase of it \n --Woodrow Wilson \n \n \"[It is] the people, to whom all authority belongs.\" --Thomas Jefferson to Spencer Roane, 1821. ME 15:328 \n \n \"The constitutions of most of our States assert that all power is inherent in the people; that they may exercise it by themselves in all cases to which they think themselves competent (as in electing their functionaries executive and legislative, and deciding by a jury of themselves in all judiciary cases in which any fact is involved), or they may act by representatives, freely and equally chosen; that it is their right and duty to be at all times armed; that they are entitled to freedom of person, freedom of religion, freedom of property, and freedom of the press.\" --Thomas Jefferson to John Cartwright, 1824. ME 16:45\n \n \n \"Governments are instituted among men, deriving their just powers from the consent of the governed.\" --Thomas Jefferson: Declaration of Independence, 1776. ME 1:29, Papers 1:429 \n \n \n \"I consider the source of authority with us to be the Nation. Their will, declared through its proper organ, is valid till revoked by their will declared through its proper organ again also.\" --Thomas Jefferson to George Washington, 1792. ME 8:301 \n \n \n \"What government [a nation] can bear depends not on the state of science, however exalted, in a select band of enlightened men, but on the condition of the general mind.\" --Thomas Jefferson to Lafayette, 1817. (*) ME 15:114 \n \n Directly responsed to your silly position:\n \n \n \"Independence can be trusted nowhere but with the people in mass. They are inherently independent of all but moral law.\" --Thomas Jefferson to Spencer Roane, 1819. \n \n \n \n \n \n \n \n \n Governments have killed 170 million people over the last century. \n \n \n \n \n \n\n If it is non-literal then can you admit that you are not literally the master of your own destiny? I just have to know that you have the ability to do this still. Also, why do you even claim something that you don't actually mean?\n\n \n Have I not done that over and over again. No I cannot predict the future absolute. no I do not have control over everything... I do have the ability to make choices though... You do not understand this and I say again move on.\n \n \n \n\n Are you willing to bet your life against it?\n \n\n non responsive\n \n \n\n You are already dead then. If he is going to kill you then he isn't even going to tell you that he will do it. There is no list. There is just instant death. Now if he had a gun and instead of sipmly saying he was going to kill me instead went through the above list, then #3 is still where I would make my move. Nothing would have changed since he is still in my range regardless as to whether he has a gun or knife. I would actually prefer for him to have a gun as oppose to a knife in this situation since you WILL get cut by the knife but you will likely be able to take the gun out of the situation without harm.\n\n \n \n Oh no... he is going to do all those things on the list first.... before he shoots you... When do you resist?", 
   {}, 
   18500, 
   null, 
   1065555660.0
  ], 
  [
   18506, 
   null, 
   "Rev. HellH0und", 
   "How can you really know if a law worked? You must first be able to prove that the person was going to commit the crime, then you must prove that the law prevented them from commiting the crime. You cannot do this. The only way we can tell if a law seems to be effective, is statistical comparison of an equal amount of time bofore the law and after the law. Obviously the laws at Columbine did not prevent the shooting...I think we all agree on this, and I have never disputed this. A gun free school zone means nothing. Looks good on paper, but if you do not enforce it, you might as well wipe your butt with it. The only way laws work is if they are enforced. Screeners and security physically checking for guns will prevent another Columbine. Think about the highway. Would we obey the speed limit if there were no cops to enforce it? \n \n\n \n By looking at crime reports and covictions based on these \"laws\"\n \n \n\n Lefty? No. The only way I am a lefty is that I am left handed. If I affiliated myself on the political scale, I would put myself directly dead center. I like to think for myself, not let the views of a group sway my opinion to one side or another. \n\n \n If it quacks like a duck...\n \n \n\n All of these so called \"common sense\" laws you put up are nothing more than XXXX. Who cares if you have a flash suppressor, it does not make the gun less lethal. I don't subscribe to the thought that these are common sense laws. I have stated very clearly in the past what I think common sense laws, and I will not repeat them again. \n \n\n \n Then fight to repeal these oppressive laws.\n \n \n\n It is about gun control, I know that. I am not saying get rid of guns. The majority of gun control laws are XXXX. I know criminals don't obey gun control laws. But when properly enforced, everyone obeys them. So it comes down to a question of whether it is better to grant unlimited rights with guns to everyone (criminals included), or to ask that everyone give up a few rights in order to be able to enforce gun control laws and prevent future crimes like Columbine.\n\n \n Gun control laws are about CONTROL of the SHEEPLE! Repeal every last one of these unconstitutional laws before even daring to propose another!", 
   {}, 
   18501, 
   null, 
   1065555840.0
  ], 
  [
   18508, 
   null, 
   "Rev. HellH0und", 
   "I trust the government to do what is in their best interest and in the past what has been in their interest has been in my interest. It trust that the trend will continue. Your wish is to trust common individuals over the government. This is far more unstable and dangerous in my view although it is not as well tested as the government idea is.\n \n\n \n \n I repeat:\n \n \n \"Independence can be trusted nowhere but with the people in mass. They are inherently independent of all but moral law.\" --Thomas Jefferson to Spencer Roane, 1819. \n \n \n This is liberty and where Libertarians stand. The 2nd Amendment gives these foundiing priniples thier teeth.", 
   {}, 
   18500, 
   null, 
   1065556260.0
  ], 
  [
   18510, 
   null, 
   "AMD4EVER", 
   "Oh no... he is going to do all those things on the list first.... before he shoots you... When do you resist?\n\n \n As I said, #3", 
   {}, 
   18505, 
   null, 
   1065556860.0
  ], 
  [
   18513, 
   null, 
   "Rev. HellH0und", 
   "As I said, #3\n\n \n \n He has a gun and you don't know what he wants... He may kill you if you resist.... maybe if you go for a ride then he will let you go..\n \n \n Would you rather have a gun and #3 or not?\n \n I think You just contradicted yourself d00d.", 
   {}, 
   18510, 
   null, 
   1065557040.0
  ], 
  [
   18516, 
   null, 
   "AMD4EVER", 
   "He has a gun and you don't know what he wants... He may kill you if you resist.... maybe if you go for a ride then he will let you go..\n\n \n But in #3 he is distracted. What better chance would you have to take his weapon from him? Heck if he is going to give me a chance like that then he deserves to be at the disadvantage.\n \n \n \nWould you rather have a gun and #3 or not?\n\n \n Honestly I have no idea what I would do differently if I had a gun in this situation. I'm not going to pull a gun while he has one. The first thing I would do either way is to take his gun. Wouldn't you do the same?\n \n \nI think You just contradicted yourself d00d.\n\n \n How did I do this?", 
   {}, 
   18513, 
   null, 
   1065557280.0
  ], 
  [
   18518, 
   null, 
   "Rev. HellH0und", 
   "But in #3 he is distracted. What better chance would you have to take his weapon from him? Heck if he is going to give me a chance like that then he deserves to be at the disadvantage.\n \n \n \n \n Honestly I have no idea what I would do differently if I had a gun in this situation. I'm not going to pull a gun while he has one. The first thing I would do either way is to take his gun. Wouldn't you do the same?\n \n \n \n How did I do this?\n\n \n \n \n \n \n You contradicted yourself by saying in previous posts that resistance will get you killed. Now here you are acting like a stand up guy (like me) thinking/acting/moving in defense of yourself and loved ones. Willing no doubt to risk your life by trying to wrestle the gun from your attacker even though you know most likley you WILL be shot.\n \n Now if you have a gun and he is distracted.... You may have a chance to end it all right here.... Do you have the training? What if you used your karate to knock the gun out of his hand while he is distracted draw a bead on him... You don't shoot him but subdue him.... Which is a better outcome. (fictional unlikley that a karate kick will do anything but get you shot btw, but lets play)\n \n \n You should apply this self preservation to your own story...\n \n \n \n This is my WHOLE POINT on this tangent.", 
   {}, 
   18516, 
   null, 
   1065557520.0
  ], 
  [
   18521, 
   null, 
   "sundowner", 
   "By looking at crime reports and covictions based on these \"laws\"\n \n \n no, this actually showed when the law did not work. If it did work, then there was no crime report or conviction. \n \n \nIf it quacks like a duck...\n \n \n AFLAC!\n \n \nThen fight to repeal these oppressive laws.\n \n \n Who says I haven't?\n \n \nGun control laws are about CONTROL of the SHEEPLE! Repeal every last one of these unconstitutional laws before even daring to propose another!\n \n \n No sheeple control laws would be about control of the sheeple. Gun control laws are about the control of guns. It's just like keeping dangerous criminals in jail is not gun control, it is prisoner control. And oh yes, lets just get rid of all the laws, every single one of them. You act like they were all written yesterday. Laws change as time changes. Perhaps many need changed, some are outdated, some need to be repealed, and we need to write a few new ones. But let's just get rid of them all and then start over. Great idea. Why is it always all or none with you? Can't there be some comprimising? By the way, have you flown commercially since 9/11?", 
   {}, 
   18506, 
   null, 
   1065557820.0
  ], 
  [
   18522, 
   null, 
   "AMD4EVER", 
   "You contradicted yourself by saying in previous posts that resistance will get you killed. Now here you are acting like a stand up guy (like me) thinking/acting/moving in defense of yourself and loved ones. Willing no doubt to risk your life by trying to wrestle the gun from your attacker even though you know most likley you WILL be shot.\n \n \n You should apply this self preservation to your own story...\n \n \n \n This is my WHOLE POINT on this tangent.\n\n \n Resistance for no reason is what would worry me. Just pulling your gun because someone is taking your wallet or car doesn't make sense in my opinion. Even fighting the criminal at that point doesn't make sense unless he does something really stupid to put himself at a disadvantage.", 
   {}, 
   18518, 
   null, 
   1065558000.0
  ], 
  [
   18523, 
   null, 
   "Rev. HellH0und", 
   "no, this actually showed when the law did not work. If it did work, then there was no crime report or conviction. \n \n\n \n You got it backwards flyboy.. If it did work then criminals would be busted with these things.. .Why do you assume that criminals obey laws? \n \n \n \n \n Who says I haven't?\n \n \n \n No sheeple control laws would be about control of the sheeple. Gun control laws are about the control of guns. It's just like keeping dangerous criminals in jail is not gun control, it is prisoner control. And oh yes, lets just get rid of all the laws, every single one of them. You act like they were all written yesterday. Laws change as time changes. Perhaps many need changed, some are outdated, some need to be repealed, and we need to write a few new ones. But let's just get rid of them all and then start over. Great idea. Why is it always all or none with you? Can't there be some comprimising? By the way, have you flown commercially since 9/11?\n\n \n \n \n My all or nothing is tatamount to the NH motto. LIVE FREE OR DIE! I make no compromises in my fight for my personal liberty. I am all for punishing criminals for crimes they commit with guns. I am not for legislation that hampers or hinders or makes criminals out of law abiding citizens.", 
   {}, 
   18521, 
   null, 
   1065558060.0
  ], 
  [
   18530, 
   null, 
   "sundowner", 
   "You got it backwards flyboy.. If it did work then criminals would be busted with these things.. .Why do you assume that criminals obey laws? \n \n My all or nothing is tatamount to the NH motto. LIVE FREE OR DIE! I make no compromises in my fight for my personal liberty. I am all for punishing criminals for crimes they commit with guns. I am not for legislation that hampers or hinders or makes criminals out of law abiding citizens.\n\n \n Is the whole point of gun control to be able to arrest someone for a gun crime, or to prevent the gun crime in the first place? HMMMMMM......\n \n If you want to live free, move to the backwoods of montana and start your own little country deep in the forest. Stop paying taxes. Disregard the current gun control laws. Be a martyr. Take your gun to the airport and try to go through security. Walk into a school and tell the principle it is your constitutional right to have a gun there. LIVE FREE OR DIE? yeah right.", 
   {}, 
   18523, 
   null, 
   1065559260.0
  ], 
  [
   18532, 
   null, 
   "Rev. HellH0und", 
   "Is the whole point of gun control to be able to arrest someone for a gun crime, or to prevent the gun crime in the first place? HMMMMMM......\n \n\n \n Dont quote me out of context. crimes commited with ANY gun not \"gun control crimes\"\n \n \n\n If you want to live free, move to the backwoods of montana and start your own little country deep in the forest. Stop paying taxes. Disregard the current gun control laws. Be a martyr. Take your gun to the airport and try to go through security. Walk into a school and tell the principle it is your constitutional right to have a gun there. LIVE FREE OR DIE? yeah right.\n\n \n \n Thats funny you should say that... Read the link in my tag line... I am working on it. All legally of course.\n \n The rest is just your own absurdity on my positions so I ignore.....", 
   {}, 
   18530, 
   null, 
   1065559380.0
  ], 
  [
   18535, 
   null, 
   "DHard3006", 
   " Take your gun to the airport and try to go through security. Walk into a school and tell the principle it is your constitutional right to have a gun there. LIVE FREE OR DIE? yeah right.\n\n \n It is then the responsibility of the airport or school to protect you once they have refused you the right to protect yourself! \n \n This logic makes gun hater pilot mad! \n \n Gun haters like gun hater pilot fear armed law abiding citizens more then armed dangerous criminals or terrorist!\n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell me how you are pro right to bear arms if you want \n limits on that right?", 
   {}, 
   18530, 
   null, 
   1065559680.0
  ], 
  [
   18537, 
   null, 
   "sundowner", 
   "Dont quote me out of context. crimes commited with ANY gun not \"gun control crimes\"\n \n \n Thats funny you should say that... Read the link in my tag line... I am working on it. All legally of course.\n \n The rest is just your own absurdity on my positions so I ignore.....\n\n \n For the benefit of MY country, I really hope you succeed. Good luck!", 
   {}, 
   18532, 
   null, 
   1065559800.0
  ], 
  [
   18576, 
   null, 
   "DHard3006", 
   "For the benefit of MY country, I really hope you succeed. Good luck!\n\n \n Gun hater pilot what does this have to do with the topic of gun control gun?\n \n Or maybe just another attempt by a hate group member to disrupt a message board!\n \n Let us examine gun hater pilot little saying :\"Rectocranial inversion \" Now one must understand on gun haters pilot airplane this may apply. Why? Well, simply because if terrorist hijack gun haters pilots airplane this will be the position the unarmed passengers will assume prior to being flown into a tall building! You know the old drill place you head between your legs and kiss your backside goodbye!\n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell me how you are pro right to bear arms if you want \n limits on that right?", 
   {
    "unicode_changes_made": true
   }, 
   18537, 
   null, 
   1065571080.0
  ], 
  [
   18592, 
   null, 
   "kelvin90701", 
   "\n \n Let us test my theory:\n \n \"What is \"common sense\" about limiting guns to 10 rounds?\"\n \n It will allow you 10 shots therefore making the gun less deadly for attacks than one with 20, 50, or a billion shots.\n \n Now you put down your first piece of the circle.\n\n \n There is a link somewhere here. The majority of crimes committed with a firearm use less than 4 bullets. Limiting buns to 10 rounds does NOTHING.", 
   {}, 
   18483, 
   null, 
   1065580500.0
  ], 
  [
   18593, 
   null, 
   "sundowner", 
   "Gun hater pilot what does this have to do with the topic of gun control gun?\n \n Or maybe just another attempt by a hate group member to disrupt a message board!\n \n Let us examine gun hater pilot little saying :\"Rectocranial inversion \" Now one must understand on gun haters pilot airplane this may apply. Why? Well, simply because if terrorist hijack gun haters pilots airplane this will be the position the unarmed passengers will assume prior to being flown into a tall building! You know the old drill place you head between your legs and kiss your backside goodbye!\n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell me how you are pro right to bear arms if you want \n limits on that right?\n\n \n again, I was not addressing you.", 
   {
    "unicode_changes_made": true
   }, 
   18576, 
   null, 
   1065580500.0
  ], 
  [
   18620, 
   null, 
   "AMD4EVER", 
   "There is a link somewhere here. The majority of crimes committed with a firearm use less than 4 bullets. Limiting buns to 10 rounds does NOTHING.\n\n \n The majority of the time it doesn't but if it does something even once then I have made my point that it has a benefit. However you could make a point by showing how the limitation hurts law enforcement. And of course round and round we would go.", 
   {}, 
   18592, 
   null, 
   1065586200.0
  ], 
  [
   18629, 
   null, 
   "DHard3006", 
   "again, I was not addressing you.\n\n \n Once again you do not own this message board!\n \n Let us examine gun hater pilot little saying :\"Rectocranial inversion \" Now one must understand on gun haters pilot airplane this may apply. Why? Well, simply because if terrorist hijack gun haters pilots airplane this will be the position the unarmed passengers will assume prior to being flown into a tall building! You know the old drill assume crash position by placing your head between your legs and kiss your backside goodbye!\n \n This does fit what will happen to the unarmed passengers on any airplane gun hater pilot flies! Because gun hater pilot wants every passenger unarmed. Well once you disarm everybody on the airplane the terrorist will simply use pencils or pens or any other item allowed on the airplane to hijack the airplane. Plus do not forget once terrorist kill the unarmed passengers gun hater pilot does not want to allow the victims to hold the airlines responsible for their deaths! \n \n I mean if you disarm a person then you do assume the responsibility to protect that unarmed person!\n \n Let us not forget that gun hater pilot did state gun hater pilot would fear a airplane full of law abiding citizens with guns.\n \n I guess gun hater pilot does not fear dangerous criminals with guns. After all every law gun hater pilot wants will not be obeyed by criminals!\n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell me how you are pro right to bear arms if you want \n limits on that right?", 
   {
    "unicode_changes_made": true
   }, 
   18593, 
   null, 
   1065589680.0
  ], 
  [
   18633, 
   null, 
   "sundowner", 
   "Once again you do not own this message board!\n \n Let us examine gun hater pilot little saying :\"Rectocranial inversion \" Now one must understand on gun haters pilot airplane this may apply. Why? Well, simply because if terrorist hijack gun haters pilots airplane this will be the position the unarmed passengers will assume prior to being flown into a tall building! You know the old drill assume crash position by placing your head between your legs and kiss your backside goodbye!\n \n This does fit what will happen to the unarmed passengers on any airplane gun hater pilot flies! Because gun hater pilot wants every passenger unarmed. Well once you disarm everybody on the airplane the terrorist will simply use pencils or pens or any other item allowed on the airplane to hijack the airplane. Plus do not forget once terrorist kill the unarmed passengers gun hater pilot does not want to allow the victims to hold the airlines responsible for their deaths! \n \n I mean if you disarm a person then you do assume the responsibility to protect that unarmed person!\n \n Let us not forget that gun hater pilot did state gun hater pilot would fear a airplane full of law abiding citizens with guns.\n \n I guess gun hater pilot does not fear dangerous criminals with guns. After all every law gun hater pilot wants will not be obeyed by criminals!\n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell me how you are pro right to bear arms if you want \n limits on that right?\n\n \n Again, I will not address you until you address me properly. GROW UP.", 
   {
    "unicode_changes_made": true
   }, 
   18629, 
   null, 
   1065590760.0
  ], 
  [
   18642, 
   null, 
   "DHard3006", 
   "Again, I will not address you until you address me properly. GROW UP.\n\n \n Once again you do not own this message board!\n \n Let us examine gun hater pilot little saying :\"Rectocranial inversion \" Now one must understand on gun haters pilot airplane this may apply. Why? Well, simply because if terrorist hijack gun haters pilots airplane this will be the position the unarmed passengers will assume prior to being flown into a tall building! You know the old drill assume crash position by placing your head between your legs and kiss your backside goodbye!\n \n This does fit what will happen to the unarmed passengers on any airplane gun hater pilot flies! Because gun hater pilot wants every passenger unarmed. Well once you disarm everybody on the airplane the terrorist will simply use pencils or pens or any other item allowed on the airplane to hijack the airplane. Plus do not forget once terrorist kill the unarmed passengers gun hater pilot does not want to allow the victims to hold the airlines responsible for their deaths! \n \n I mean if you disarm a person then you do assume the responsibility to protect that unarmed person!\n \n Let us not forget that gun hater pilot did state gun hater pilot would fear a airplane full of law abiding citizens with guns.\n \n I guess gun hater pilot does not fear dangerous criminals with guns. After all every law gun hater pilot wants will not be obeyed by criminals!\n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell me how you are pro right to bear arms if you want \n limits on that right?", 
   {
    "unicode_changes_made": true
   }, 
   18633, 
   null, 
   1065593940.0
  ], 
  [
   18652, 
   null, 
   "epaphras_faith", 
   "There is a link somewhere here. The majority of crimes committed with a firearm use less than 4 bullets. Limiting buns to 10 rounds does NOTHING.\n\n \n Personally I limit my BUNS to just one round. No reason to be greedy emoticon_xangel", 
   {}, 
   18592, 
   null, 
   1065605940.0
  ], 
  [
   18696, 
   null, 
   "DHard3006", 
   "You limit your buns? Must make you a bun hater! ;)\n\n \n \n This is where *********. Gun haters are people like gun hater pilot that want gun control laws that infringe on the right to bear arms. \n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell us *********how you are pro right to bear arms if you want \n limits on that right? \n \n Now with *********this has to deal with the subject of denying a person the right to bear arms to defend themself. ********* logic is for companies and governments to deny a person the right to bears arms to defend ones self then not be held responsible when these companies and governments fail to protect the unarmed citizens! For this gun hater pilots uses insults to respond!\n \n ********* logic is to disarm law abiding people then not be held responsible for their safety! Is this the type of logic that should be demanding common sense limits on a right? No!\n \n Once again we hear the moderate bs. Now to get this moderate bs what must first happen? Well the people defending the right to bear arms must compromise the right to bear arms to the gun haters by allowing what gun haters call common sense limits on a right. \n \n One must notice that every time a gun hater uses the moderate bs it is always at the cost of a right. The racist tried this with Black Americans during the fight for their civil rights. Hate groups will do anything to take rights away from people! Even call themselves a gun owner!\n \n *********would have called the founding fathers extremist for demanding freedom from England!\n \n ********* would have called Black Americans extremist for demanding their civil rights!\n \n ********* would have called Women extremist for demanding their civil rights!\n \n *********would have called Homosexuals extremist for demanding their civil rights!\n \n ********* will call anybody an extremist for defending their rights! Typical hate group tactics!\n \n The only people that are extremist are the gun haters, a hate group that has only one goal and that is to take a right away from the American people!", 
   {}, 
   18652, 
   null, 
   1065648000.0
  ], 
  [
   18712, 
   null, 
   "sundowner", 
   "This is where gun hater pilot is wrong. Gun haters are people like gun hater pilot that want gun control laws that infringe on the right to bear arms. \n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell us gun hater pilot how you are pro right to bear arms if you want \n limits on that right? \n \n Now with gun hater pilot this has to deal with the subject of denying a person the right to bear arms to defend themself. Gun hater pilot logic is for companies and governments to deny a person the right to bears arms to defend ones self then not be held responsible when these companies and governments fail to protect the unarmed citizens! For this gun hater pilots uses insults to respond!\n \n Gun hater pilot's logic is to disarm law abiding people then not be held responsible for their safety! Is this the type of logic that should be demanding common sense limits on a right? No!\n \n Once again we hear the moderate bs. Now to get this moderate bs what must first happen? Well the people defending the right to bear arms must compromise the right to bear arms to the gun haters by allowing what gun haters call common sense limits on a right. \n \n One must notice that every time a gun hater uses the moderate bs it is always at the cost of a right. The racist tried this with Black Americans during the fight for their civil rights. Hate groups will do anything to take rights away from people! Even call themselves a gun owner!\n \n Gun hater pilot would have called the founding fathers extremist for demanding freedom from England!\n \n Gun hater pilot would have called Black Americans extremist for demanding their civil rights!\n \n Gun hater pilot would have called Women extremist for demanding their civil rights!\n \n Gun hater pilot would have called Homosexuals extremist for demanding their civil rights!\n \n Gun hater pilot will call anybody an extremist for defending their rights! Typical hate group tactics!\n \n The only people that are extremist are the gun haters, a hate group that has only one goal and that is to take a right away from the American people!\n\n \n It was a joke, do you read the posts before you start spewing your hate messages? A CCW infringes on your right to bear arms, do you own one? The federal government has infringed on your right to bear arms by telling you you cannot carry them on planes, do you ever fly commercially? Or do you just accept these things as the way it is in America?", 
   {
    "unicode_changes_made": true
   }, 
   18696, 
   null, 
   1065662700.0
  ], 
  [
   18717, 
   null, 
   "epaphras_faith", 
   "This is where gun hater pilot is wrong. Gun haters are people like gun hater pilot that want gun control laws that infringe on the right to bear arms. \n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell us gun hater pilot how you are pro right to bear arms if you want \n limits on that right? \n \n Now with gun hater pilot this has to deal with the subject of denying a person the right to bear arms to defend themself. Gun hater pilot logic is for companies and governments to deny a person the right to bears arms to defend ones self then not be held responsible when these companies and governments fail to protect the unarmed citizens! For this gun hater pilots uses insults to respond!\n \n Gun hater pilot's logic is to disarm law abiding people then not be held responsible for their safety! Is this the type of logic that should be demanding common sense limits on a right? No!\n \n Once again we hear the moderate bs. Now to get this moderate bs what must first happen? Well the people defending the right to bear arms must compromise the right to bear arms to the gun haters by allowing what gun haters call common sense limits on a right. \n \n One must notice that every time a gun hater uses the moderate bs it is always at the cost of a right. The racist tried this with Black Americans during the fight for their civil rights. Hate groups will do anything to take rights away from people! Even call themselves a gun owner!\n \n Gun hater pilot would have called the founding fathers extremist for demanding freedom from England!\n \n Gun hater pilot would have called Black Americans extremist for demanding their civil rights!\n \n Gun hater pilot would have called Women extremist for demanding their civil rights!\n \n Gun hater pilot would have called Homosexuals extremist for demanding their civil rights!\n \n Gun hater pilot will call anybody an extremist for defending their rights! Typical hate group tactics!\n \n The only people that are extremist are the gun haters, a hate group that has only one goal and that is to take a right away from the American people!\n\n \n uh............ It was a short exchange between myself and sundowner. If you are just going to attack people please stop posting. You seem a little extreme in your response to something that had nothing to do with you. I would check myslef a little better before going off like you just did. You only prove the point that you are out of control. Silent Poet has posted a sticky on this thread indicating that personal attacks are not acceptable. Relax...........Okay?", 
   {
    "unicode_changes_made": true
   }, 
   18696, 
   null, 
   1065664620.0
  ], 
  [
   18722, 
   null, 
   "DHard3006", 
   "uh............ It was a short exchange between myself and sundowner. If you are just going to attack people please stop posting. You seem a little extreme in your response to something that had nothing to do with you. I would check myslef a little better before going off like you just did. You only prove the point that you are out of control. Silent Poet has posted a sticky on this thread indicating that personal attacks are not acceptable. Relax...........Okay?\n\n \n \n Once again this is not your private message board!\n \n The only people mad are the gun haters that need to use insults to vilify the person not agreeeing with them!\n \n I have posted no \"personal attacks\". Now *********** did! Would you like for me to go back in the older posts and get them for you?\n \n I simply said ******* wants to label people extremist for defending their right to bear arms.\n \n So I simply pointed out that ********* would also label these people extremist:\n \n ********* would have called the founding fathers extremist for demanding freedom from England!\n \n ********* would have called Black Americans extremist for demanding their civil rights!\n \n ********* would have called Women extremist for demanding their civil rights!\n \n ********* would have called Homosexuals extremist for demanding their civil rights!\n \n ********* will call anybody an extremist for defending their rights! Typical hate group tactics!\n \n Hey ********* here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell us ********* how you are pro right to bear arms if you want \n limits on that right?", 
   {
    "unicode_changes_made": true
   }, 
   18717, 
   null, 
   1065667020.0
  ], 
  [
   18771, 
   null, 
   "epaphras_faith", 
   "Once again this is not your private message board!\n \n The only people mad are the gun haters that need to use insults to vilify the person not agreeeing with them!\n \n I have posted no \"personal attacks\". Now *********** did! Would you like for me to go back in the older posts and get them for you?\n \n I simply said ******* wants to label people extremist for defending their right to bear arms.\n \n So I simply pointed out that ********* would also label these people extremist:\n \n ********* would have called the founding fathers extremist for demanding freedom from England!\n \n ********* would have called Black Americans extremist for demanding their civil rights!\n \n ********* would have called Women extremist for demanding their civil rights!\n \n ********* would have called Homosexuals extremist for demanding their civil rights!\n \n ********* will call anybody an extremist for defending their rights! Typical hate group tactics!\n \n Hey ********* here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell us ********* how you are pro right to bear arms if you want \n limits on that right?\n\n \n Your continual use of the phrase \"gun hater pilot\" without abatement after being requested on multiple occasions is a personal attack. I will ignore your posts and not respond to them further. I would encourage others to do the same. I notice that stars have replaced the phrase \"gun hater pilot\" I don't know if it was edited by admin or if you edited. If you edited then I will not worry about it further. If Admin did, then you should worry.", 
   {
    "unicode_changes_made": true
   }, 
   18722, 
   null, 
   1065720660.0
  ], 
  [
   18774, 
   null, 
   "AMD4EVER", 
   "Your continual use of the phrase \"gun hater pilot\" without abatement after being requested on multiple occasions is a personal attack. I will ignore your posts and not respond to them further. I would encourage others to do the same. I notice that stars have replaced the phrase \"gun hater pilot\" I don't know if it was edited by admin or if you edited. If you edited then I will not worry about it further. If Admin did, then you should worry.\n\n \n Based on Dhards previous works I doubt he put those stars there. I'm glad to see something is being done about him as he is nothing except a pest on this legitimate debate forum.", 
   {}, 
   18771, 
   null, 
   1065721140.0
  ], 
  [
   18778, 
   null, 
   "DHard3006", 
   "Your continual use of the phrase \"gun hater pilot\" without abatement after being requested on multiple occasions is a personal attack. I will ignore your posts and not respond to them further. I would encourage others to do the same. I notice that stars have replaced the phrase \"gun hater pilot\" I don't know if it was edited by admin or if you edited. If you edited then I will not worry about it further. If Admin did, then you should worry.\n\n \n \n \n \nBased on Dhards previous works I doubt he put those stars there. I'm glad to see something is being done about him as he is nothing except a pest on this legitimate debate forum.\n\n Gun haters never answer the post! Gun haters do everything possible to disrupt the post and insult or attack any one speaking out against the hate groups called gun haters!\n \n This the tactics of hate groups like the gun haters! \n \n Anybody that wants gun control laws that infringe on the right to bear arms is a gun haters!", 
   {}, 
   18774, 
   null, 
   1065726060.0
  ], 
  [
   18786, 
   null, 
   "DHard3006", 
   "No...notice that the so called \"gun haters\" will DEBATE with those who will argue logically and actually have something to say other than insults. If you would like to debate, by all means, present your opinion, and argue logically to defend it. Posting what others believe, or what you think others want to do is not making an argument.\n\n \n Once again this is not your private message board!\n \n Gun haters such as you c-note never answer the post! Gun haters do everything possible to disrupt the post and insult or attack any one speaking out against the hate groups called gun haters!\n \n This the tactics of hate groups like the gun haters! \n \n Anybody that wants gun control laws that infringe on the right to bear arms is a gun haters!", 
   {}, 
   18778, 
   null, 
   1065727920.0
  ], 
  [
   18791, 
   null, 
   "epaphras_faith", 
   "Again, I would submit, that until DHARD can discuss with logical argument and not resort ot name calling that we ignore the posts.\n \n That means do not reply to them at all.\n \n DHARD, should you wish to be heard, post a logical argument of the issue. To say that people are gun haters is Ad Hominem. That is a logical fallacy and loses the argument.\n \n Instead, say why you believe that there should be no limits on guns, provide evidence and logic to support your position and then let people argue. To use name calling to support your argument only weakens that. The people on this forum and in the various threads will gladly argue provided they are not attacked. \n \n If admin starred out your name calling then you really should take notice.\n \n thanks", 
   {}, 
   18786, 
   null, 
   1065731040.0
  ], 
  [
   18871, 
   null, 
   "DHard3006", 
   "Again, I would submit, that until DHARD can discuss with logical argument and not resort ot name calling that we ignore the posts.\n \n That means do not reply to them at all.\n \n DHARD, should you wish to be heard, post a logical argument of the issue. To say that people are gun haters is Ad Hominem. That is a logical fallacy and loses the argument.\n \n Instead, say why you believe that there should be no limits on guns, provide evidence and logic to support your position and then let people argue. To use name calling to support your argument only weakens that. The people on this forum and in the various threads will gladly argue provided they are not attacked. \n \n If admin starred out your name calling then you really should take notice.\n \n thanks\n\n \n Once again this is not your private message board!\n \n Gun haters do everything possible to disrupt the post and insult or attack any one speaking out against the hate groups called gun haters!\n \n This the tactics of hate groups like the gun haters! \n \n Anybody that wants gun control laws that infringe on the right to bear arms is a gun haters!\n \n By the way the topic of this post is why do Americans want guns. \n \n This is simple, because it is our right to have them. \n \n No other reason is needed but it is our right to have guns!", 
   {}, 
   18791, 
   null, 
   1065775200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why do Americans want so many guns?", 
  "url": "http://www.4forums.com/political/gun-control-debates/1018-why-do-americans-want-so-many-guns.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1018, 
  "discussion_files": [
   [
    "8313.html", 
    "http://www.4forums.com/political/gun-control-debates/1018-why-do-americans-want-so-many-guns-print.html"
   ], 
   [
    "8314.html", 
    "http://www.4forums.com/political/gun-control-debates/1018-why-do-americans-want-so-many-guns-9-print.html"
   ], 
   [
    "8315.html", 
    "http://www.4forums.com/political/gun-control-debates/1018-why-do-americans-want-so-many-guns-7-print.html"
   ], 
   [
    "8316.html", 
    "http://www.4forums.com/political/gun-control-debates/1018-why-do-americans-want-so-many-guns-5-print.html"
   ], 
   [
    "8317.html", 
    "http://www.4forums.com/political/gun-control-debates/1018-why-do-americans-want-so-many-guns-4-print.html"
   ], 
   [
    "8318.html", 
    "http://www.4forums.com/political/gun-control-debates/1018-why-do-americans-want-so-many-guns-6-print.html"
   ], 
   [
    "8319.html", 
    "http://www.4forums.com/political/gun-control-debates/1018-why-do-americans-want-so-many-guns-8-print.html"
   ], 
   [
    "8320.html", 
    "http://www.4forums.com/political/gun-control-debates/1018-why-do-americans-want-so-many-guns-3-print.html"
   ], 
   [
    "8321.html", 
    "http://www.4forums.com/political/gun-control-debates/1018-why-do-americans-want-so-many-guns-2-print.html"
   ]
  ], 
  "identifier": 1018
 }
]