[
 [
  [
   276582, 
   null, 
   "snakespit", 
   "The thread entitled \"what are you currently reading\" got me thinking about books. I love to read, and I get the impression that a lot of other people do here as well. So I got curious:\n \n What is the best book you ever read and why? I am always looking for an interesting read, so I was hoping that by your responses I might get a few ideas of my own. \n \n For me, it was Black Elk Speaks. This is a semi-autobiographical look at the life of a Oglala Sioux medicine man named Black Elk. It gives insight into the life of the Sioux just prior to the decimation of their land and culture by the settlers and the US government, and looks into the spiritual \"ghost dance movement\" that came about in the Sioux culture at the time. The ghost dance was a major factor in the killing of Sitting Bull and the Wounded Knee massacre. Black Elk's story was documented by John Neihardt following a series of talks between the 2 and other elder Sioux. \n \n I found the book to be both enlightening as to Sioux culture and society at a time when both were rapidly being destroyed, and as a glimpse into the destruction of the individual Sioux known as Black Elk by a ruthless and deceitful enemy. Few people realize what a great and noble culture was detroyed at the hands of greedy settlers and the government that backed them. This book provides an in-depth look into a culture long forgotten by history.", 
   {
    "post_info": {
     "post_title": "Best book you ever read?"
    }
   }, 
   null, 
   null, 
   1186401180.0
  ], 
  [
   276597, 
   null, 
   "Zardoz", 
   "Good Omens by Neil Gaiman and Terry Prachett.", 
   {}, 
   276582, 
   null, 
   1186406940.0
  ], 
  [
   276626, 
   null, 
   "Symbiote", 
   "Atlas Shrugged. Not for its literary merits, I don't know how it stands up on those grounds, but for its ability to provide the emotional grounding with which to challenge conventional wisdom.\n \n I suppose it's like someone gay in a small rural community finding a book that says \"it's ok\", this one says, \"it's ok to reject popular views about how the world works and think for yourself\".", 
   {}, 
   276597, 
   null, 
   1186416060.0
  ], 
  [
   276648, 
   null, 
   "jitobear", 
   "The Poisonwood Bible by Barbara Kingsolver. Its about a fire and brimstone preacher who takes his wife and four daughters to the Congo to \"save the heathens\" and how that journey changes the lives of all five women. Fascinating character development, dialogue and description. And the way the book is organized is brilliant as well.", 
   {}, 
   276626, 
   null, 
   1186423560.0
  ], 
  [
   276658, 
   null, 
   "Aivlis", 
   "Good Omens is a hilarious book...I really loved that one.\n \n I'm an English major with a love for variety when it comes to literature. However, one book that I always come back to is The Old Man and the Sea. You can read it in an afternoon and it never gets dull.", 
   {}, 
   276648, 
   null, 
   1186425960.0
  ], 
  [
   276668, 
   null, 
   "jim's trucking", 
   "Pillars of the Earth-Ken Follett\n \n Fiction mixed with some historical fact...set in the cathedral building era around the time of Thomas Becket's murder (1170)...this is one you don't want to put down after reading the first few chapters.", 
   {}, 
   276658, 
   null, 
   1186427520.0
  ], 
  [
   276699, 
   null, 
   "daewoo", 
   "Pillars of the Earth-Ken Follett\n \n Fiction mixed with some historical fact...set in the cathedral building era around the time of Thomas Becket's murder (1170)...this is one you don't want to put down after reading the first few chapters.\n\n \n I am with Jim here. Best book ever...hands down. It is actually good enough to be worth reading multiple times.", 
   {}, 
   276668, 
   null, 
   1186435320.0
  ], 
  [
   276717, 
   null, 
   "Liminus", 
   "Catch-22. Just a pure work of genius from start to finish. Apart from Hitchhiker's Guide to the Galaxy and some of the best bits of Pratchett, this is the only time I can remember reading something that made me laugh out loud. The chracters are never so ridiculous to be unbelievable, and yet are obviously unrealistic enough to be clear parodies of certain attitudes or beliefs about war. It's also very moving in places, and I think an incredibly honest portrayal of the fears engendered in a man's mind during war. I will never get bored of reading it", 
   {}, 
   276699, 
   null, 
   1186438800.0
  ], 
  [
   276745, 
   null, 
   "snakespit", 
   "I'm an English major with a love for variety when it comes to literature. However, one book that I always come back to is The Old Man and the Sea. You can read it in an afternoon and it never gets dull.\n\n \n I have read all of Hemingway's works, and I can honestly say that I never found even one to be a sub-par read. I would have to say The Sun Also Rises and To Have and Have Not are clearly my favorites. Also fantastic were; Green Hills of Africa, Death in the Afternoon,and A Moveable Feast.", 
   {}, 
   276658, 
   null, 
   1186448100.0
  ], 
  [
   276938, 
   null, 
   "Ripskar", 
   "Consider Phlebas, Iain M. Banks\n Stood well back when the gravitas was being handed out, (and other Culture warships). The first and best of the Culture novels.", 
   {}, 
   276745, 
   null, 
   1186525560.0
  ], 
  [
   277129, 
   null, 
   "Aivlis", 
   "Pillars of the Earth was a fantastic book Jim. I read that probably about four summers ago and it took me the whole summer to finish it. I believe it is 1,000+ pages but it never gets boring. You might think I'm a slow reader but I had a life and I enjoy slow reading anyways.", 
   {}, 
   276938, 
   null, 
   1186605660.0
  ], 
  [
   277870, 
   null, 
   "Collin", 
   "Catch-22. Just a pure work of genius from start to finish. Apart from Hitchhiker's Guide to the Galaxy and some of the best bits of Pratchett, this is the only time I can remember reading something that made me laugh out loud. The chracters are never so ridiculous to be unbelievable, and yet are obviously unrealistic enough to be clear parodies of certain attitudes or beliefs about war. It's also very moving in places, and I think an incredibly honest portrayal of the fears engendered in a man's mind during war. I will never get bored of reading it\n\n \n Did you hear the man? BEST BOOK EVER", 
   {}, 
   276717, 
   null, 
   1186890720.0
  ], 
  [
   277872, 
   null, 
   "Matthew S", 
   "I have too many to list an all out best. Two at the top of my list would be Dragonquest by Anne Mccaffrey and Fellowship of the Ring By JRR Tolkien. A great book, to me, is one that I could read over and over again and never get board with.", 
   {}, 
   277870, 
   null, 
   1186892100.0
  ], 
  [
   277877, 
   null, 
   "Liminus", 
   "Did you hear the man? BEST BOOK EVER\n\n \n Have you seen the film? It's pretty good, as far as films of books can be.\n \n By the way, you've got flies in your eyes.", 
   {}, 
   277870, 
   null, 
   1186896420.0
  ], 
  [
   278745, 
   null, 
   "Collin", 
   "Have you seen the film? It's pretty good, as far as films of books can be.\n \n By the way, you've got flies in your eyes.\n\n \n THE MAN IN WHITE!! He's back!\n \n Oh oh oh my God! Oh God the man in white is back! Ooooooh no!!\n \n THERE'S NOTHING INSIDE! THERE'S NOTHING IN SIDE! THE MAN IN WHITE! HE'S BACK!!!! THERE'S NOTHING INSIDE!!!!!!!\n \n .....\n \n \n \n I SEE EVERYTHING ONCE!\n \n How many fingers am I holding up? (two)\n \n ONE!\n \n How many fingers am I holding up? (ten)\n \n ONE!\n \n \n \n ....\n \n I SEE EVERYTHING TWICE!\n \n How many fingers am I holding up? (five)\n \n TWO!\n \n How many fingers am I holding up? (one)\n \n TWO!\n \n \n .....\n \n \n Sir, we've captured Bologne. It says so on the map.\n \n Great God! Send that up to the colonel!\n \n ..\n \n Colonel, sir, we've captured Bologne according to the captain.\n \n Oh Jesus! Send that up to General Peckham!\n \n ..\n \n General, sir, we've captured Bologne according to the colonel.\n \n \n \n \n \n \n One word: Milo. ROFLMFAO!!\n \n \n God, there so many funny things in that book. My favorite chapter is the one where the 100-year-old Italian pimp talks to that one young, naive American soldier about how losing wars makes a country get along more splendidly than a country that wins them.", 
   {}, 
   277877, 
   null, 
   1187324160.0
  ], 
  [
   283003, 
   null, 
   "Jim Colyer", 
   "INTO THE WILD by Jon Krakaueur\n \n To be in theaters on September 21, 2007. \n \n This is the story of Chris McCandless, a young man from an affluent family who graduated with honors from Emory University in Atlanta. In April, 1992, Chris set off into the Alaska wilderness with a rifle and meager supplies to \"live off the land.\" He headed north of Denali National Park. He was idealistic and strongly influenced by the writings of Tolstoy. Four months later, he was found dead by a party of moose hunters in an abandoned Fairbanks city bus. He had starved to death. \n \n Jon Krakauer traces Chris' odyssey across the west. Chris' parents had assumed their son would go to law school with a major in history. Instead, he donated his college fund to charity and left with no word. He changed his name to Alex Supertramp, abandoned his car and took to hitchhiking. He ate rice. He traipsed through Arizona, Nevada, California, Oregon and Washington. He was liked by the people he met. He worked for a man named Wayne Westerberg in South Dakota. He befriended an 80-year-old veteran. \n \n Chris kept a journal in which he wrote about himself in the third person. He saw himself as a modern Thoreau. He camped in the Grand Canyon. He worked in a restaurant in Las Vegas. Meanwhile, his parents were worried sick. \n \n Krakauer identifies with Chris and portrays him as different from others who wander off in the wilderness. Chris' story and Krakauer's merge. Krakauer grew up in Oregon and learned mountain climbing from his father. He spent time in Alaska as a young man and climbed a peak known as Devils Thumb. He writes about it in detail, relating his mistakes and the unforgiving nature of mountains, ice and freezing temperatures. He questions why he survived Alaska while Chris perished. \n \n It got out of hand with Chris. His disregard for his parents and contempt for the rules of society are hard to defend. His asceticism and high-mindedness are extreme. He became an aimless drifter, a selfish nonconformist. \n \n We are shown the source of Chris' resentment toward his father. His father had a second family by a first marriage. Krakauer exposes the gap between himself and his own father. \n \n As Chris' wanderlust grew, he thought more and more of Alaska. He hitched a ride from Dawson Creek in Canada along the Alaska Highway to Fairbanks. He bought a rifle and hitched on the George Parks Highway toward the wilderness. He wanted to escape all civilization. He saw Mt. McKinley in the distance. He found the bus and made it his home. For awhile, he was able to live off birds, squirrels and other small game. Krakauer's theory that Chris was poisoned by wild potato seeds proved untrue. Krakauer did not want to believe Chris had a death wish as critics have proposed. Still, Chris was not that deep into the bush and might have saved himself had he the will to do so. \n \n \"Into the Wild\" will be a movie in 2007 starring Emile Hirsch and Vince Vaughn. Jon Krakauer went on to climb Mt. Everest, an expedition during which several of his party perished. The disaster produced another bestseller, \"Into Thin Air.\"", 
   {}, 
   276582, 
   null, 
   1189308480.0
  ], 
  [
   283103, 
   null, 
   "bandgeek615", 
   "The DaVinci Code. great book\n \n or To Kill A Mockingbird", 
   {}, 
   283003, 
   null, 
   1189387620.0
  ], 
  [
   283118, 
   null, 
   "snakespit", 
   "INTO THE WILD by Jon Krakaueur\n\n Amazing book. Definately in my top 20. Worth reading...twice.", 
   {}, 
   283003, 
   null, 
   1189402860.0
  ], 
  [
   287540, 
   null, 
   "spicylemonade", 
   "I don't have a best, but the first to spring to mind is \"Infinite Jest\" by David Foster Wallace. I really need to read his other books one of these days.", 
   {}, 
   278745, 
   null, 
   1192138440.0
  ], 
  [
   294951, 
   null, 
   "Penfold", 
   "\"The Ragged-Trousered Philanthropists\" by Robert Tressel. .... Fundamental.", 
   {}, 
   287540, 
   null, 
   1198474800.0
  ], 
  [
   302646, 
   null, 
   "Peeling", 
   "First to spring to mind was Ender's Game, which for maximum effect should be read when you're 8 or 9 years old.\n \n Then I started second-guessing myself. Hitch Hiker's Guide? Reaper Man? I liked Catch 22 but didn't love it. Then there's 'Excession', which just gets better every time I read it.\n \n I suppose, if I were asked which book I would least want never to have been written, for me it would be Ender's Game.\n \n But if you can get hold of it, I urge you to read all four of \"The War against the Chtorr\" - incredibly thought-provoking stuff; even Banks doesn't get that far out.", 
   {}, 
   294951, 
   null, 
   1203514020.0
  ], 
  [
   353554, 
   null, 
   "Winston Smith", 
   "\"Moby-Dick\" not to be confused with the much more popular book of the almost same name: \"Moby's-dick\"", 
   {}, 
   302646, 
   null, 
   1242212040.0
  ], 
  [
   353654, 
   null, 
   "Lakrite", 
   "If Democrats had any Brains They'd be Republicans by Ann Coulter.", 
   {}, 
   353554, 
   null, 
   1242261480.0
  ], 
  [
   353707, 
   null, 
   "snakespit", 
   "If Democrats had any Brains They'd be Republicans by Ann Coulter.\n\n \n When I think of the great minds of literature, Ann Coulter is certainly not on the top of my list. In fact, when I think of minds, I don't even think she has one. I hope that you write this in jest, otherwise...I would seriously suggest that you expand you horizons. emoticon_frazzled", 
   {}, 
   353654, 
   null, 
   1242293580.0
  ], 
  [
   353716, 
   null, 
   "Winston Smith", 
   "she is walking (talking rather) joke. :p\n \n http://politicalhumor.about.com/od/funnyquotes/a/anncoulter.htm\n \n \n \n Only Amerika seems to breed such kind of fauna.", 
   {}, 
   353707, 
   null, 
   1242297960.0
  ], 
  [
   353717, 
   null, 
   "Winston Smith", 
   "If Democrats had any Brains They'd be Republicans by Ann Coulter.\n\n \n \n If Republicans had any brains .... no! impossible!! emoticon_rolleyes", 
   {}, 
   353654, 
   null, 
   1242298380.0
  ], 
  [
   353971, 
   null, 
   "Lakrite", 
   "When I think of the great minds of literature, Ann Coulter is certainly not on the top of my list. In fact, when I think of minds, I don't even think she has one. I hope that you write this in jest, otherwise...I would seriously suggest that you expand you horizons.\n\n Haha I was joking! I can't believe anybody took that seriously! emoticon_smile", 
   {}, 
   353717, 
   null, 
   1242436620.0
  ], 
  [
   384030, 
   null, 
   "snakespit", 
   "Pillars of the Earth-Ken Follett\n \n Fiction mixed with some historical fact...set in the cathedral building era around the time of Thomas Becket's murder (1170)...this is one you don't want to put down after reading the first few chapters.\n\n \n Just got this and World Without End for Christmas from my mother. Funny thing is, I had looked for this book last time I was at B&N, but did not find it. I never even mentioned to her that I wanted to read it, she just got it thinking it might be something I enjoy. I want to get into it right away, but I am currently wrapped up in 3 other books. I am debating if I should just put them down and read \"Pillars\", or if I should clear my plate before starting it.", 
   {}, 
   276668, 
   null, 
   1262100840.0
  ], 
  [
   384068, 
   null, 
   "daewoo", 
   "Just got this and World Without End for Christmas from my mother. Funny thing is, I had looked for this book last time I was at B&N, but did not find it. I never even mentioned to her that I wanted to read it, she just got it thinking it might be something I enjoy. I want to get into it right away, but I am currently wrapped up in 3 other books. I am debating if I should just put them down and read \"Pillars\", or if I should clear my plate before starting it.\n\n \n That is a tough one. On the one hand I want to say READ IT NOW because it is such an awesome book. On the other hand, it may be good to go into it without more distractions. \n \n Either way, I envy you. You have an excellent book ahead of you.", 
   {}, 
   384030, 
   null, 
   1262146440.0
  ], 
  [
   384076, 
   null, 
   "Easyrider", 
   "When I think of the great minds of literature, Ann Coulter is certainly not on the top of my list. \n\n \n Obama and his supporters may have a couple of ounces of smarts, but they're a full quart low on Godly wisdom, as is Clinton, the Goron, Pelosi, Reid, Carter, etc., etc.", 
   {}, 
   353707, 
   null, 
   1262150100.0
  ], 
  [
   384091, 
   null, 
   "jazyjason", 
   "Obama and his supporters may have a couple of ounces of smarts, but they're a full quart low on Godly wisdom, as is Clinton, the Goron, Pelosi, Reid, Carter, etc., etc.\n\n \n And you got your own personal oil rig of spiritual black gold right buddy? emoticon_frazzled\n \n Oh and best book I'd have to say is Return OF The King by JRR Tolkein. And The Maltese Falcon I loved that book...", 
   {}, 
   384076, 
   null, 
   1262176320.0
  ], 
  [
   384097, 
   null, 
   "snakespit", 
   "Obama and his supporters may have a couple of ounces of smarts, but they're a full quart low on Godly wisdom, as is Clinton, the Goron, Pelosi, Reid, Carter, etc., etc.\n\n \n And this has what exactly to do with the subject at hand? Oh, that's right, if I say that Coulter is a recovering brain donor, then I must be a rabid supporter of Obama et al.", 
   {}, 
   384076, 
   null, 
   1262189700.0
  ], 
  [
   384136, 
   null, 
   "jazyjason", 
   "And this has what exactly to do with the subject at hand? Oh, that's right, if I say that Coulter is a recovering brain donor, then I must be a rabid supporter of Obama et al.\n\n \n It's because she wraps herself in an American flag has fake implants and blonde hair makes her a neocon's wet dream....", 
   {}, 
   384097, 
   null, 
   1262231820.0
  ], 
  [
   384232, 
   null, 
   "snakespit", 
   "That is a tough one. On the one hand I want to say READ IT NOW because it is such an awesome book. On the other hand, it may be good to go into it without more distractions. \n \n Either way, I envy you. You have an excellent book ahead of you.\n\n \n Decided to wait until I am done with the others. Believe it or not, one of the books I am reading right now is Oliver Twist. Somehow, I never read it before. That's almost shameful. It's not a difficult read, but I would rather not be distracted because I am enjoying it so much. Gotta love that Artful Dodger.", 
   {}, 
   384068, 
   null, 
   1262306940.0
  ], 
  [
   385819, 
   null, 
   "MarieAntoinette", 
   "The DaVinci Code. great book\n \n or To Kill A Mockingbird\n\n \n I loved To Kill A Mockingbird. The film with Gregory Peck is terrific too.\n \n Had a lot of fun reading The DaVinci Code. (Movie, so-so.) He's got another book out now, a sequel.", 
   {}, 
   283103, 
   null, 
   1263455880.0
  ], 
  [
   395252, 
   null, 
   "Jim Colyer", 
   "2 astronomy books written by Robert H. Baker and published in the 1930s.\n \n 1 Introducing the Constellations\n 2 When the Stars Come Out", 
   {}, 
   276582, 
   null, 
   1268951220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Best book you ever read?", 
  "url": "http://www.4forums.com/political/entertainment-debates/10189-best-book-you-ever-read.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 10189, 
  "discussion_files": [
   [
    "24664.html", 
    "http://www.4forums.com/political/entertainment-debates/10189-best-book-you-ever-read-print.html"
   ], 
   [
    "24665.html", 
    "http://www.4forums.com/political/entertainment-debates/10189-best-book-you-ever-read-3-print.html"
   ], 
   [
    "24666.html", 
    "http://www.4forums.com/political/entertainment-debates/10189-best-book-you-ever-read-2-print.html"
   ]
  ], 
  "identifier": 10189
 }
]