[
 [
  [
   276369, 
   null, 
   "simone", 
   "Darling Zardoz, weird god of some misbegotten universe, I beg of you, check this guy out:\n \n http://billgothard.com/bill/", 
   {
    "post_info": {
     "post_title": "The Worldy Empire of Bill Gothard"
    }
   }, 
   null, 
   null, 
   1186239960.0
  ], 
  [
   276370, 
   null, 
   "simone", 
   "Fathers are umbrellas:\n \nProtection Under Authority\n The use of an umbrella to symbolize protection is commonly understood and accepted. In the insurance industry, an overall coverage of protection is referred to as an \"umbrella policy.\" In the Bible, similar symbols teach the concepts of provision, protection, headship, and leadership.\n \n The use of this symbol in relation to the family is to give special encouragement to fathers to protect, instruct, lead, and provide for their wives, sons, and daughters. It is also to remind the family that no father is perfect, but as they pray for him and encourage him, they can increase his ability and motivation to fulfill his God-given responsibilities.\n \n In addition to the father, Scripture has other umbrella analogies: The cloud of protection that God gave to Israel during their forty years in the wilderness (Exodus 13:21-22), the shadow of God's hand over His people (Isaiah 51:15-16), \"the shadow of the Almighty\" (Psalm 91:1), and the wings of a mother hen (Matthew 23:37).\n \n Understanding the umbrella concept increases our love for God and assures us of His love, protection, and provision for us as His children.\n\n \n http://billgothard.com/bill/teaching/authority/", 
   {
    "unicode_changes_made": true
   }, 
   276369, 
   null, 
   1186240260.0
  ], 
  [
   276375, 
   null, 
   "Archangel", 
   "Fathers are umbrellas:\n \n \n http://billgothard.com/bill/teaching/authority/\n\n \n Could you clarify what you see as Worldly about Bill Gothards Ministry ?", 
   {}, 
   276370, 
   null, 
   1186242060.0
  ], 
  [
   276386, 
   null, 
   "jyoshu", 
   "I'm wondering what the point here is.", 
   {}, 
   276375, 
   null, 
   1186248540.0
  ], 
  [
   276393, 
   null, 
   "Ripskar", 
   "Dr. Billy Boring attended a Basic Seminar when he was a medical student at the University of Texas Medical School. As he began memorizing and meditating on Scripture his grades improved. As a resident at the University of Texas, Southwestern Dallas, he was voted the resident teacher of the year.\n Over the last ten years, he has sent more than 200 of his patients to the Basic Seminar and studied the results of their attendance. Before attending the seminar, they averaged 4.8 doctor visits per year. After attending the seminar, their visits to his office dropped to an average of 1.2 visits per year.\n\n Is that a real name?emoticon_xdonno", 
   {}, 
   276386, 
   null, 
   1186255440.0
  ], 
  [
   276394, 
   null, 
   "Zardoz", 
   "Actually, (I'll see if I can find any links...but it might have been in a book I read) many of these groups engage in non-Christian practices during their meetings.\n Some participate in 'self awareness' and primal 'primal male bonding rituals' commonly associated with paganistic groups.\n Self-awareness without trained experts has been debunked as harmful to the participants by psychologist and psychological groups. \n I've sat in on some with new agers myself.\n \n They were common phenomena in the 1970's as people sought to get in touch with their inner selves.\n \n As shown by the testimony, they are highly emotional driven experiences designed to 'break you down' so that something can be imprinted upon you.\n Events can last days.\n Think of programing and deprogramming tactics.\n Such are used by retreat salesmen pushing those times share condos.\n \n \nMen who had received victory over lust and destructive habits openly shared their testimonies and then separated into small prayer groups with a marvelous spirit of brokenness and oneness. One father wrote: \"I felt like I was entering into the hearts of those I was praying for and with. Their needs became my needs and mine became theirs.\n \n \"We poured out our hearts for each other-our chairs were watered with tears for our brothers in Christ. We were one in spirit and I arose from these times with greater love for my wife and children than I have ever known before.\"\n\n This is self awareness, where people are manipulated to confess private events. Without professional guidance (which most of these group holders invariably LACK), when they later 'crash' after the emotional high wears off, they can experience harm or a reversal. Think, buyers remorse.\n \n A search on the Internet under 'How Cults Work' could prove interesting.\n \n \n As for umbrellas, any Christians (particularly Protestant evangelical types) who've read their bible (and not listened to their pimps) should know that the ONLY covering (umbrella) one needs is their savior, the Christ.\n Many of these types who deride the Catholic priest positions (and quote the bible to say no one should call any man father as that's God's title) often set their own preacher up as 'covering'. Seeing them preach that their 'special anointing and position offers them supernatural protection.' just isn't new covenant biblical. Although some will muddle the relationship chains. Like a man's supposed to be head of the household with his wife serving him and children under his command. \n \n If you note, they quote Psalms and stress \"This is HOW you're SUPPOSED to worship and praise God\" with jumping, singing and hollering.' And biblically illiterate followers with goose step along with it. Feeling induced shame if it's not their nature to jump and scream.\n Once you comply...you're buying the books, the manuals, CD's, DVD's and time share. \n \nPsalm 98:4: \"... Make a loud noise, and rejoice, and sing praise.\"\n \n When the men sang wholeheartedly in one accord, a joy filled the room which caused the entire group to break out in clapping, cheering, and shouting praises to God. It was a glorious time of true worship and triumphant resolve.\n\n \n \n Arch...\n Titus 1:10-11\n \"For there are many rebellious people, mere talkers and deceivers, especially those of the circumcision group. They must be silenced, because they are ruining whole households by teaching things they ought not to teach-and that for the sake of dishonest gain.\"\n This easily applies to these type of people too...\n \n Arch, we're in a prolonged election period for the next president, take some time to watch the campaigning and debates. Take some time to study up on marketing. All of these are worldly. Over time, you should notice psychological manipulation techniques used by both groups that influence the crowd.\n From something so simple as a politician pointing to the crowd as he speaks (even though he points to not one specifically) it makes people think that he personally knows someone in the crowd. In the past, politicians and music artist DID know or were singling one person out when pointing. When their people who are in control of finding out what makes 'man' tick realized the positive influence this got for him in the results and polls, they now simply have the person point...without reason...because the results are the same. Manipulation.\n To something as insidious as the music played. At many of these events (even in churches) there is a specific background music being played. This music often has an underlying tempo that increases the suggestibility of those present. Same with lighting, hand gestures (as presented above), scents...\n \n If a person knows this works and uses it on others without their permission, it's dishonesty. Not very Christian like eh?\n \n If, they end up selling you something, then they are marketing you. Even if they think it's to help you...like pushing their Christian books and such. Tell me where in the bible it says you need something else OTHER than the bible to train and educate a Christian? \n \n Recall the Christ who ran rampant through the temple tossing out money changers and those who sold things and creatures meant to be offerings?\n Recall how Simon the magician was treated with contempt when he sought to buy the free gift so that he could possess the marvelous gifts shown in Acts?\n \n Your fellow Christian is not a market to sell your merchandise too.\n If you have a mission to spread the word of God, and to sincerely help, you don't turn that into a business.\n Recall what they Christ said to his apostles...\n Take only the clothing on your backs and live off of the generosity of those you minister too.\n Paul received assistance from those who supported his ministry...he also worked an honest trade so as not to be a burden upon others.\n \n You don't need manipulative tactics, debunked psychobabble and non-Christian means to spread your message.\n \n If you don't believe such tactics are used...you're really naive.", 
   {
    "unicode_changes_made": true
   }, 
   276386, 
   null, 
   1186256340.0
  ], 
  [
   276467, 
   null, 
   "simone", 
   "Oh Zardoz! Darling Deity, your precious words captured above shall serve as the liturgy for our newly formed Church of the Rapturous Zardoz!", 
   {}, 
   276394, 
   null, 
   1186332840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Worldy Empire of Bill Gothard", 
  "url": "http://www.4forums.com/political/religion-debates/10186-worldy-empire-bill-gothard.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10186, 
  "discussion_files": [
   [
    "2283.html", 
    "http://www.4forums.com/political/religion-debates/10186-worldy-empire-bill-gothard-print.html"
   ]
  ], 
  "identifier": 10186
 }
]