[
 [
  [
   276601, 
   null, 
   "Dora", 
   "That recent outbreak of F&M is just outrageous! In the early 2000's the same disease resulted in multibillion losses. How much is it going to be now I wonder? \n I am absolutely sure this misfortune is due to our govt's inefficiency. Our bombastic pols are reluctant to do routine work. I mean keeping an eye on all those fishy private hi tech labs which have been mushrooming in here in recent times. They say one of them America owned (Merial Animal Health, the British arm of Georgia-based Merial Ltd.) was the source of F&M this time actually.\n I bet you Americans have lots of other secret facilities working here to create ...God knows what...new bio weapons maybe. You know that obsession of theirs... and their habit to test their monstrous inventions in \"real life\". I don't tend to believe into \"unintended\" leakages. Frankly, I suspect that American scholars were no strangers to that odd polonium story as well. And sorting it out with Russians was a blinder just. I am becoming scary... And You?", 
   {
    "post_info": {
     "post_title": "That recent outbreak of F&amp;M is just outrageous!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1186408800.0
  ], 
  [
   276826, 
   null, 
   "peteratwar", 
   "Whilst convolutely planned conspiracies are great for discussion and novels.\n \n I believe in 2 things, the average government employee is not any brighter than the average individual.\n \n The KISS principle is usually the most applicable", 
   {}, 
   276601, 
   null, 
   1186493220.0
  ], 
  [
   278048, 
   null, 
   "rofegater", 
   "soory plz halp", 
   {}, 
   276601, 
   null, 
   1187010180.0
  ], 
  [
   278057, 
   null, 
   "Symbiote", 
   "This is one of our Russian propagandist posters, you will note how the english is of poor quality and leads to the inevitable conclusion that Moscow is being framed for poisioning its' political enemies.", 
   {}, 
   278048, 
   null, 
   1187011500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  That recent outbreak of F&M is just outrageous!", 
  "url": "http://www.4forums.com/political/current-events-debates/10192-recent-outbreak-f-m-just-outrageous.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 10192, 
  "discussion_files": [
   [
    "29025.html", 
    "http://www.4forums.com/political/current-events-debates/10192-recent-outbreak-f-m-just-outrageous-print.html"
   ]
  ], 
  "identifier": 10192
 }
]