[
 [
  [
   276876, 
   null, 
   "pandion", 
   "After 3.2 million years, Lucy (AL 288-1) is becoming a world traveler. She left Ethiopia for the U.S. on Sunday and will begin a 6 year tour of the U.S. at the Houston Museum of Natural Science on Aug 31, 2007 - Apr 20, 2008. She is scheduled to make other stops in Washington, New York, Denver, and Chicago.\n \n \"Lucy's Legacy: The Hidden Treasures of Ethiopia is an international exhibition organized by The Houston Museum of Natural Science in collaboration with the Ministry of Culture and Tourism of the Federal Democratic Republic of Ethiopia and the Ethiopian Exhibition Coordinating Committee.\"\n \n Smithsonian Institution officials and other have objected to the transportation of the valuable and unique fossil. They certainly have a point, but nevertheless, the actual fossil will be on display. Even in Ethiopia the actual fossil has been on display only twice - the Lucy exhibit is usually a replica as the real fossil is locked in a vault.\n \n This is actually Lucy's second visit to the U.S. Her previous visit was to Cleveland and the Cleveland Museum of Natural History where Donald Johanson (who discovered Lucy in 1974) was curator of anthropology. Johanson was allowed to remove Lucy from Ethiopia because of the lack of adequate lab facilities in Ethiopia. She was returned to Ethiopia after study and description.", 
   {
    "post_info": {
     "post_title": "Lucy is coming"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1186510440.0
  ], 
  [
   276878, 
   null, 
   "Archangel", 
   "Explain to me again how this http://en.wikipedia.org/wiki/Image:Lucy_Mexico.jpg is a human descendant ? Does DNA testing prove it ? Cuz you sure can't tell by looking at it. I guess that's where faith comes in in your religion too, huh ? emoticon_xgood", 
   {}, 
   276876, 
   null, 
   1186511160.0
  ], 
  [
   276886, 
   null, 
   "GiantOreo", 
   "Explain to me again how this http://en.wikipedia.org/wiki/Image:Lucy_Mexico.jpg is a human descendant ? Does DNA testing prove it ? Cuz you sure can't tell by looking at it. I guess that's where faith comes in in your religion too, huh ? emoticon_xgood\n\n \n Umm... why should we explain something that is not true, nor claimed by any serious scientist? emoticon_frazzled Methinks you meant \"human ancestor\".", 
   {}, 
   276878, 
   null, 
   1186511940.0
  ], 
  [
   276888, 
   null, 
   "sinjin", 
   "Explain to me again how this http://en.wikipedia.org/wiki/Image:Lucy_Mexico.jpg is a human descendant ? Does DNA testing prove it ? Cuz you sure can't tell by looking at it. I guess that's where faith comes in in your religion too, huh ? emoticon_xgood\nIt is not known that we are directly descended from this particular group of hominids but:\n \n \"In overall anatomy the pelvis is far more human-like than ape-like. The iliac blades are short and wide, the sacrum is wide and positioned directly behind the hip joint, and there is clear evidence of a strong attachment for the knee extensors. While the pelvis is not wholly human-like (being markedly wide with flared with laterally orientated iliac blades), these features point to a structure that can be considered radically remodeled to accommodate a significant degree of bipedalism in the animals' locomotor repertoire. Importantly, the femur also angles in towards the knee from the hip. This trait would have allowed the foot to have fallen closer to the midline of the body, and is a strong indication of habitual bipedal locomotion. Along with humans, present day orangutans and spider monkeys possess this same feature. The feet also feature adducted big toes, making it difficult if not impossible to grasp branches with the hindlimbs.\"\n http://en.wikipedia.org/wiki/Australopithecus_afarensis", 
   {}, 
   276878, 
   null, 
   1186512120.0
  ], 
  [
   276902, 
   null, 
   "thelmoose", 
   "Explain to me again how this http://en.wikipedia.org/wiki/Image:Lucy_Mexico.jpg is a human descendant ? Does DNA testing prove it ? Cuz you sure can't tell by looking at it. I guess that's where faith comes in in your religion too, huh ? emoticon_xgood\n\n \n \nIt is not known that we are directly descended from this particular group of hominids but:\n \n \"In overall anatomy the pelvis is far more human-like than ape-like. The iliac blades are short and wide, the sacrum is wide and positioned directly behind the hip joint, and there is clear evidence of a strong attachment for the knee extensors. While the pelvis is not wholly human-like (being markedly wide with flared with laterally orientated iliac blades), these features point to a structure that can be considered radically remodeled to accommodate a significant degree of bipedalism in the animals' locomotor repertoire. Importantly, the femur also angles in towards the knee from the hip. This trait would have allowed the foot to have fallen closer to the midline of the body, and is a strong indication of habitual bipedal locomotion. Along with humans, present day orangutans and spider monkeys possess this same feature. The feet also feature adducted big toes, making it difficult if not impossible to grasp branches with the hindlimbs.\"\n http://en.wikipedia.org/wiki/Australopithecus_afarensis\n\n \n I guess you CAN tell a lot by looking at it. And faith doesn't enter into anything stated there.", 
   {}, 
   276888, 
   null, 
   1186514160.0
  ], 
  [
   276927, 
   null, 
   "pandion", 
   "Explain to me again how this http://en.wikipedia.org/wiki/Image:Lucy_Mexico.jpg is a human descendant ?\nIt isn't. No such claims have ever been made. As GiantOreo asked, did you mean to say ancestor?\n \nDoes DNA testing prove it ?\nNo DNA has been found. In fact, I don't think it has been looked for since doing so would require destroying part of the specimen and the chances of success are nil.\n \nCuz you sure can't tell by looking at it.\nYou mean that you can't tell by looking. Also, there are no claims that this particular fossil is a human ancestor. While this was an adult and is believed to have been a female, there is no way to tell if she actually had offspring. I'll bet you couldn't tell that by looking either. However, experienced paleoanthropologists can tell a lot by looking. You should also know that in 1996 there were 324 specimens of this species, all found at Hadar or Laetoli. Of those specimens, there are remains of 111 individuals from Hadar and 31 from Laetoli.\n \n sinjin cited some of the material from the article by which it is known that this animal was bipedal - the shape of the pelvis, the upper femur, the lower femur and the knee joint (especially clear with A.L. 129 - 1A+1B). There are also the footprints at Laetoli (3.7 million years as dated from the volcanic ash layer in which they were found). These are most certainly made by bipeds. The prints are quite similar to human footprints - the big toe is abducted.\n \n Lucy was certainly a transitional species. It is the only species from 3 to 4 million years ago to be so well represented. A. anamensis is a bit older and may have been a related or ancestral species. A. anamensis was also bipedal, at least to a great extent. However, the fossil record in the next million years is full of hominid species (8 or more) with as many as 5 or 6 living at the same time at around 2 million years ago.\n \nI guess that's where faith comes in in your religion too, huh ?\nYou have no idea of what my religion is. At least I can deal with reality and are not limited by mythology.", 
   {}, 
   276878, 
   null, 
   1186520280.0
  ], 
  [
   276935, 
   null, 
   "Ripskar", 
   "Archie showing his usual lack of insight, or indeed any background reading of the subject whatsoever...\n You'd think with all the hot air he puts out on the subject he might have at least looked up what marks out A. aferensis from the rest of the primates...", 
   {}, 
   276927, 
   null, 
   1186524900.0
  ], 
  [
   277022, 
   null, 
   "ShadowPikachu", 
   "Interesting. I'll definitely try to go see her when she comes to Denver.\n \n But you know, I can't help but think this is risky. What with the way things are today, I really, truly wouldn't be suprised if some sort of fundie nut tried to blow himself up with the Lucy, or at least try to do something to damage or destroy the fossil.", 
   {}, 
   276935, 
   null, 
   1186559100.0
  ], 
  [
   277029, 
   null, 
   "pandion", 
   "Interesting. I'll definitely try to go see her when she comes to Denver.\n \n But you know, I can't help but think this is risky. What with the way things are today, I really, truly wouldn't be suprised if some sort of fundie nut tried to blow himself up with the Lucy, or at least try to do something to damage or destroy the fossil.\nIndeed. And I think that is part of the worry expressed by scientists at the Smithsonian, UC Berkley, Cleveland Museum of Natural History, and more. These fossils are irreplaceable. There are all kinds of accidents that could happen that could do damage, far beyond the possibility of fundie nuts to try to make their superstitions believable by destroying evidence to the contrary.\n \n But on the other hand, I'm going to get to see the actual fossil.\n \n The purpose is, of course, money to support further research at the Museum of Natural History in Ethiopia. Touring a really good replica wouldn't yield all that much revenue, since really good replicas are available at several museums (for example, Mexico as depicted at Wikipedia) and universities. If you want to see what Lucy looks like, then you can go to many places. If you want to see Lucy, this is going to be your only chance.", 
   {}, 
   277022, 
   null, 
   1186563960.0
  ], 
  [
   277053, 
   null, 
   "Ripskar", 
   "Well that's a possibility, but if the fundies were that violently inclined I doubt the Phelps would still be breathing.", 
   {}, 
   277029, 
   null, 
   1186581600.0
  ], 
  [
   277367, 
   null, 
   "Unriggable", 
   "I wonder if they'll tour the sahelanthropud tchadensis along with it.", 
   {}, 
   277053, 
   null, 
   1186683300.0
  ], 
  [
   277403, 
   null, 
   "pandion", 
   "I wonder if they'll tour the Sahelanthropus tchadensis along with it.\nNo. The exhibit is made up of fossils and artifacts from Ethiopia - not Chad.", 
   {}, 
   277367, 
   null, 
   1186696740.0
  ], 
  [
   277506, 
   null, 
   "simone", 
   "Geesh! You mean this isn't all about Lucy in the Sky with Diamonds?", 
   {}, 
   277403, 
   null, 
   1186757340.0
  ], 
  [
   277704, 
   null, 
   "pandion", 
   "Geesh! You mean this isn't all about Lucy in the Sky with Diamonds?\nNo. It is \"Lucy In The Sky With Diamonds.\" I guess you aren't aware of how A.L. 288-1 got named.", 
   {}, 
   277506, 
   null, 
   1186809480.0
  ], 
  [
   277716, 
   null, 
   "JPSartre12", 
   "No. It is \"Lucy In The Sky With Diamonds.\" I guess you aren't aware of how A.L. 288-1 got named.\n\n \n Supposedly, they played the Beatles St. Pepper album over and over during the dig in which Lucy was discovered, hence the name \"Lucy\".", 
   {}, 
   277704, 
   null, 
   1186811880.0
  ], 
  [
   277726, 
   null, 
   "pandion", 
   "Supposedly, they played the Beatles St. Pepper album over and over during the dig in which Lucy was discovered, hence the name \"Lucy\".\nIs that you, Simone?", 
   {}, 
   277716, 
   null, 
   1186817700.0
  ], 
  [
   277836, 
   null, 
   "JPSartre12", 
   "Is that you, Simone?\n\n \n Not last time I checked.......Nope, not Simone, Simon possibly. ;)", 
   {}, 
   277726, 
   null, 
   1186869420.0
  ], 
  [
   278253, 
   null, 
   "jyoshu", 
   "I've seen Lucy myself (it was under glass of course). Pretty neat, though not being an anthropologist, I wouldn't know what to look for. I do remember noting the differences in the skull from a human's. And that the skeleton seemed small to me.", 
   {}, 
   277836, 
   null, 
   1187108460.0
  ], 
  [
   278359, 
   null, 
   "pandion", 
   "I've seen Lucy myself (it was under glass of course).\nOf course. It will be when it is exhibited in Houston too.\n \nPretty neat, though not being an anthropologist, I wouldn't know what to look for.\nI'm not either, but I am aware of a couple of differences between Lucy and modern humans.\n \nI do remember noting the differences in the skull from a human's.\nThere isn't much of the skull that was found.\n \nAnd that the skeleton seemed small to me.\nIt is. Such an animal would have been only about 3' 8\" tall.\n \n I'm wondering where you saw \"Lucy\". I wasn't aware that she was exhibited when she was at the Cleveland Museum of Natural History when she was there for study and description. That was for 9 years (1975-1984??). Since then, she has been kept at the National Museum of Ethiopia. However, usually, only a plaster replica is displayed. As I understand it, the actual fossil has been displayed only twice before for brief periods.", 
   {}, 
   278253, 
   null, 
   1187132640.0
  ], 
  [
   278678, 
   null, 
   "jim's trucking", 
   "With a click of my Mighty Mouse...\n \n I have found a photgraph of Lucy, taken just before she died. Legend has it that she was on her way to barter for a darker shade of lipstick and to be fitted for a sea-shell bra when she was assaulted and killed by a tall, dark, handsome man who walked with a limp and carried a large stick. To date, nobody has been arrested.\n \n \n http://www.ethiopianhistory.com/Pre-historic_Ethiopia\n \n Caution: Partial nudity", 
   {
    "post_info": {
     "post_title": "Here I am to save the day!"
    }
   }, 
   278359, 
   null, 
   1187297400.0
  ], 
  [
   279075, 
   null, 
   "jyoshu", 
   "I'm wondering where you saw \"Lucy\". I wasn't aware that she was exhibited when she was at the Cleveland Museum of Natural History when she was there for study and description. That was for 9 years (1975-1984??). Since then, she has been kept at the National Museum of Ethiopia. However, usually, only a plaster replica is displayed. As I understand it, the actual fossil has been displayed only twice before for brief periods.\n\n \n I saw Lucy, or what I assumed was Lucy, in the museum it normally resides in, in Addis Ethiopia about 4 or 5 years ago. If the replica is what is normally displayed there, then I guess I saw the replica instead. Though it looked pretty darn real if it was; it didn't look like plaster at all. And there was no sign there that indicated it was a plaster replica, that I can remember. And they were extremely strict on no photo flashes. (though I took a few longer exposure ones without the flash) But again, I'm no expert on these matters, and it's been awhile.", 
   {}, 
   278359, 
   null, 
   1187470920.0
  ], 
  [
   280595, 
   null, 
   "EDO", 
   "Lucy is a fake just ike Piltdown and all the other \"ape-people\" that evolutionists claim we came from (and that those \"ape-people\" came from oozing gunk in a puddle).", 
   {}, 
   277716, 
   null, 
   1188094200.0
  ], 
  [
   280713, 
   null, 
   "pandion", 
   "Lucy is a fake just ike Piltdown and all the other \"ape-people\" that evolutionists claim we came from (and that those \"ape-people\" came from oozing gunk in a puddle).\nNo. Piltdown is a real place, in East Sussex along the southern coast of Great Britain. East Sussex is just south of Dover. Why would you think that it is fake?\n \n And, of course, \"Lucy\" is quite real. The fossil is comprised of the 40% complete skeletal remains of a bipedal creature that lived in Ethiopia about 3.2 million years ago. Since it is possible to actually touch the fossil, I find it a bit weird that you would say that it is fake.\n \n What \"ape-people\" are you talking about? One would have to be a real simpleton to claim that ape-people came from oozing gunk in a puddle.", 
   {}, 
   280595, 
   null, 
   1188154320.0
  ], 
  [
   280716, 
   null, 
   "pandion", 
   "I saw Lucy, or what I assumed was Lucy, in the museum it normally resides in, in Addis Ethiopia about 4 or 5 years ago.\nWell, you were certainly in the right place. If \"Lucy\" was in two wooden boxes in recesses cut in yellow foam rubber, you saw the real thing - no doubt. If she was laid out in a glass case on a green background, it was the replica.", 
   {}, 
   279075, 
   null, 
   1188154500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Lucy is coming", 
  "url": "http://www.4forums.com/political/science-math-debates/10202-lucy-coming.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 10202, 
  "discussion_files": [
   [
    "19089.html", 
    "http://www.4forums.com/political/science-math-debates/10202-lucy-coming-print.html"
   ], 
   [
    "19090.html", 
    "http://www.4forums.com/political/science-math-debates/10202-lucy-coming-2-print.html"
   ]
  ], 
  "identifier": 10202
 }
]