[
 [
  [
   277922, 
   null, 
   "Fisher", 
   "Exciting times for hockey fans another nhl season about to get underway.\n \n Who is going to be the top teams this season. The Rangers look good on paper but they do most years will the big name free agents they signed produce? Anehiem has added some pieces for a potential repeat getting Bertuzzi was silly considering his baggage but all he needs is one good season to get back his to crashem bashem style of play, I feel however that he is dud and waste of valuable cap space. The Oilers are looking better than last season with a new defensive core anchored by Souray they should see improvemnt at both ends of the rink and with Assistant Craig Simpson going to the broadcast booth maybey the PP will start to shine. Colorado is going to be a contendor if they can solve the goaltending fiasco since getting rid and Aebischer and accuring the usless Theaodore. The Penguins are poised for greatness but is it going to be this season?\n \n Really excited about this season lots of changes to some good teams so this should make for some interesting hockey in the fall.\n \n Peace \n \n Fisher", 
   {
    "post_info": {
     "post_title": "Upcoming NHL season"
    }
   }, 
   null, 
   null, 
   1186935660.0
  ], 
  [
   280312, 
   null, 
   "Waxy", 
   "I predict that my Oilers will miss the playoffs, BY A MILE.\n \n To hell in a hand basket...\n \n Waxy", 
   {}, 
   277922, 
   null, 
   1187979780.0
  ], 
  [
   284665, 
   null, 
   "Fisher", 
   "So far the oilers are 2-0 for the preseason, and you want to start it off on the right foot. However preseason is like beer league and I think you are right that the oil will miss the playoffs. The NW is by far the most competitive division in the nhl and this usally spells doom for a club which regularly takes either november or december off.", 
   {}, 
   280312, 
   null, 
   1190282520.0
  ], 
  [
   289235, 
   null, 
   "snakespit", 
   "Philly has some promise this year. It seems to be said every year, but I actually believe it this time. It's still early, but team are starting to come together and were really getting good look at who is going to be a force this year. Look out for Philly, Calgary, Pittsburgh, and Columbus.", 
   {}, 
   284665, 
   null, 
   1193630580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Upcoming NHL season", 
  "url": "http://www.4forums.com/political/sports-debates/10226-upcoming-nhl-season.html", 
  "breadcrumbs": [
   "Sports"
  ], 
  "id_number": 10226, 
  "discussion_files": [
   [
    "19383.html", 
    "http://www.4forums.com/political/sports-debates/10226-upcoming-nhl-season-print.html"
   ]
  ], 
  "identifier": 10226
 }
]