[
 [
  [
   277842, 
   null, 
   "foundit66", 
   "http://www.advocate.com/news_detail_ektid47960.asp\n \n Young GOP leader accused in gay sex crime\n \n On July 7, after a six-month campaign, 33-year-old Glenn Murphy Jr. was elected chairman of the venerable Young Republican National Foundation.\n \n Last week, however, Murphy sent out a strange e-mail announcing his resignation, explaining that a \"life-altering\" business deal had arisen and, after praying with his family, he had decided to pursue this new opportunity. For some reason, Murphy could no longer represent a political party due to a \"gut-wrenching dilemma\" that forced him to step down from his new office.\n \n In fact, as bloggers soon made public, Murphy had been accused of what is called in Indiana \"criminal deviate conduct,\" a class B felony, after attempting to have sex with a sleeping man July 29.\n \n According to a police report from Clark County, Ind., the man, his sister, and Murphy had been drinking at a Young Republican party the previous night. The revelers wound up at the sister's home, where Murphy got into a top bunk bed and the victim took the bottom bunk.\n \n Sometime that morning the victim awoke to find Murphy, in his words, \"holding my dick with one hand and sucking my dick with his mouth,\" police records state. The man kicked Murphy off and left the house.\n \n Later that day, Murphy called the man to explain that he had found himself lying on the floor beside the man's bunk. The man, Murphy said, had fondled Murphy's hair in his sleep, so Murphy took this gesture as a green light for further intimacy. Unconvinced by this alibi and unmoved by Murphy's pleadings, the man filed a complaint.\n \n This was apparently not the first time Murphy had been unable to control his attraction to unconscious men. Another Clark County police report described an incident in 1998 in which Murphy crawled under the covers with a sleeping acquaintance \"and was committing the act of oral sex when [the victim] awoke.\" The victim's girlfriend, who was in the same room at the time, heard her friend yell and observed Murphy extracting himself from the bedclothes and leaving the room.\n \n Evidently, the 1998 incident stayed under wraps, since Murphy went on to become the county leader of the Young Republicans later that year. According to the local press, he served two terms as head of the Indiana Young Republicans and has been the Clark County GOP chairman since 2001.\n \n The national group, an organization of Republicans ages 18 to 40, was founded in 1931.\n \n After his election last month Murphy said he hoped to double the organization's membership by November 2008.\n \n \"I will essentially be the mouthpiece and effective leader for tens of thousands of Young Republicans 18 to 40 across the country,\" he said.\n \n All references to Murphy have now been erased from the Young Republican Web site. (Ann Rostow, Gay.com)", 
   {
    "post_info": {
     "post_title": "Young GOP leader accused in gay sex crime"
    }
   }, 
   null, 
   null, 
   1186874880.0
  ], 
  [
   277852, 
   null, 
   "samiinh", 
   "Just your average \"family values\" kinda guy.", 
   {}, 
   277842, 
   null, 
   1186882140.0
  ], 
  [
   277866, 
   null, 
   "jyoshu", 
   "Sigh. emoticon_rolleyes \n \n You know, I agree, these young gay men sure need to stay away from criminal deviant conduct. Oh, wait, I forgot--we're supposed to only focus on the \"Republican\" part of it. emoticon_xangel \n \n (Wonder if he's a member of the LCR? :p )", 
   {}, 
   277852, 
   null, 
   1186887360.0
  ], 
  [
   277884, 
   null, 
   "foundit66", 
   "Sigh. emoticon_rolleyes \n You know, I agree, these young gay men sure need to stay away from criminal deviant conduct. Oh, wait, I forgot--we're supposed to only focus on the \"Republican\" part of it. emoticon_xangel \n\n I'd be happy to compare the gay sexual assault statistics to the straight sexual assault statistics, if you want to focus on the \"gay\" part of this Jyoshu.\n \n If you can actually FIND some gay sexual assault statistics, that would be helpful.... emoticon_emb \n Cause I have looked. While you can find an abundance of heterosexual sexual assault statistics, the homosexual sexual assault statistics are absent...\n \n I suspect because heterosexuals are so much more prolific with their sexual assault...\n \n \n \n(Wonder if he's a member of the LCR? :p )\n\n It's doubtful.\n He was chairman of the Young Republican National Foundation.\n \n They don't typically allow gays in those types of positions in the Republican party.\n Never more than a tiny fraction of GOP politicians, openly gay Republicans are about to disappear from Congress with the retirement of Rep. Jim Kolbe of Arizona, and Koering is the lone openly gay GOP state legislator - out of 7,382 seats nationwide. The Democrats, by contrast, have 57 openly gay legislators and embrace an array of gay-rights causes.http://online.logcabin.org/news_views/articles/a-tiny-club-openly-gay-gop.html\n \n I would be interested to see if he had just come out as gay with no scandal, would he have been allowed to keep his post?\n \n \n It's sad that the self-induced homophobia of the Republican party puts such mental stress on the gay members who serve it that drives them to such actions.\n It would make so much more sense to accept who you are, and find healthy outlets for such things. The Republican party openly demonizes gays, and makes bashing them a staple of voting drives, so it's not surprising that it takes its toll...", 
   {}, 
   277866, 
   null, 
   1186900560.0
  ], 
  [
   277889, 
   null, 
   "jyoshu", 
   "If you can actually FIND some gay sexual assault statistics, that would be helpful.... emoticon_emb \n Cause I have looked. While you can find an abundance of heterosexual sexual assault statistics, the homosexual sexual assault statistics are absent...\n\n \n Well, you certainly bumped the 'absent' trend by posting the story you did here. ;) \n \n \nIt's sad that the self-induced homophobia of the Republican party puts such mental stress on the gay members who serve it that drives them to such actions.\n It would make so much more sense to accept who you are, and find healthy outlets for such things.\n\n \n But of course, we have no idea if the guy would have found a 'healthy' outlet or not, no matter what the Republican party does--acceptance or otherwise. Unless he were to come out and say so, it can never be anything more than speculation that the party drove him to do this (as you are clearly asserting by saying \"drives them to such actions\"). \n \n There will always be some gays in the supposedly gay-hostile Republican party, because frankly, many people's lives simply don't rise and fall on that one issue of sexuality. For some gays, there are still more important issues out there, and in some cases those issues are best served by that party. I'm sure that reality is hard to believe for a homosexual-centric-minded person; nonetheless, it's obviously true. For many of us, sexuality takes a back seat to other issues, no matter what our orientation. Life really doesn't have to revolve around it. That's why being homosexual and being republican are not automatically incompatible.", 
   {}, 
   277884, 
   null, 
   1186902780.0
  ], 
  [
   277897, 
   null, 
   "JSDKoeln", 
   "Well, you certainly bumped the 'absent' trend by posting the story you did here. ;) \n \n ...\n \n There will always be some gays in the supposedly gay-hostile Republican party, because frankly, many people's lives simply don't rise and fall on that one issue of sexuality. For some gays, there are still more important issues out there, and in some cases those issues are best served by that party. I'm sure that reality is hard to believe for a homosexual-centric-minded person; nonetheless, it's obviously true. For many of us, sexuality takes a back seat to other issues, no matter what our orientation. Life really doesn't have to revolve around it. That's why being homosexual and being republican are not automatically incompatible.\n\n \n Well, I think in theory, \"being homosexual and being republican are not automatically incompatible\", is true. I also don't think that \"we\" as homosexuals go around wearing it on our sleeves 24/7. Being that this is a gay rights forum, we're wearing it on our sleeves more than usual.\n \n But, far from the \"I'm a democrat\" and \"I'm a republican\" thing, the right wing has been hijacked by fundamentalist principles which are appearing more and more hypocritical ever year. Most homosexuals have a knee-jerk reaction to this fundamentalist, and in my opinion, disenlightened and small view of the world. But unfortunately, this is what we see as the face of the right wing. \n \n Religion was not meant to be mixed with politics. In my opinion, the fundamentalist face (meaning the ilk of the Family Research Council and Focus on the Family) are nothing more than the KKK in suits, ties and deep purse strings. So, I think it's understandable to have gays living for the \"cause\" and becoming obsessively critical of the Republicans. Quite honestly, if the Republicans disassociated themselves completely from the Religious Right, they'd have a better chance at winning over more independents and conservative Dems. But they're too scared to do it. Let the Religous Right form their own party and push their own agenda. They'd end up being the severe minority, in my opinion. The Religious Right is nothing more than an incredibly powerful lobbyist group. They've taken the party of Lincoln and turned it on it upside down.\n \n Freedom of religion does not mean religious freedom to repress a minority. I'm well aware of the good deeds that churches do for the community, and to me, being of service is what being a true spiritual being is all about. Is what my fathers taught me when I was a teenager. Most people on this board have fulfilling lives outside of their sexuality. And some people on this board are gay AND Christian. For me, my sexuality does take a back seat to everything else in my life. But I'm fortunate to be recognized as a full human being in the country where I live. \n \n If homosexuals have equal rights and full acceptance in society, then republican, democrat, independant, greene, libertarian labels won't matter as much. Choices of voting and can be made for political beliefs, not religious ones. But the more hypocracy surfaces in the Republican party, expect homosexuals to point out the hypocracy with more and more ferver.", 
   {}, 
   277889, 
   null, 
   1186915980.0
  ], 
  [
   277899, 
   null, 
   "Archangel", 
   "I'd be happy to compare the gay sexual assault statistics to the straight sexual assault statistics, if you want to focus on the \"gay\" part of this Jyoshu.\n \n If you can actually FIND some gay sexual assault statistics, that would be helpful.... emoticon_emb \n Cause I have looked. While you can find an abundance of heterosexual sexual assault statistics, the homosexual sexual assault statistics are absent...\n \n I suspect because heterosexuals are so much more prolific with their sexual assault...\n\n \n Oh really ? Have you forgotten about this case of untold numbers of abused victims ? And all by homosexuals over decades, if not centuries and around the World ? Of course, due to the cover-up the full extent of this crime will never be known. Here are some various stories of these unreported yet disturbing trends. And an excerpt below.\n \n http://www.traditionalvalues.org/urban/one.php\n New York Post Exposes High Rate Of Teacher/Student Molestations\n \n In a story not widely publicized in the mainstream press, the New York Post published a story in its July 30, 2001 edition about the secret epidemic of homosexual child abuse cases that go unreported in New York City's public schools.\n \n The report, \"Secret Shame Of Our Schools: Sexual Abuse Of Students Runs Rampant,\" by Douglas Montero, is the result of an analysis of 117 cases of sexual abuse between January 1999 and June 2001. Sixty percent of those accused of sexual abuse were transferred to desk jobs inside the school district. Forty percent of those transferred suspects were repeat sex offenders.\n \n The report noted that out of the 117 cases, 212 children were victims. In 45% of the cases, the sex offender attacked more than one student. In nearly 16% of the cases, school officials delayed or tried to cover up the sexual molestations. The average victim is a 15-year-old girl and 75% of the victims were girls. According to the report, \"Nearly 20 percent of the offenders are homosexuals and in most of these cases, the attack led to a sexual relationship with the stu- dent.\" The report also discovered that the Board of Education investigated another 347 substantiated sex abuse cases between January 2000 and July 20, 2001. Adding the 117 cases with the 327, it appears that at least one child is sexually abused each day by a school employee-and 20% of these molestations against children are done by homosexuals!\n Considering that according to these most current sources that only approximately 1.2-2% of the population is gay then the actual occurrences per capita are huge when compared to the other 98-99% of the hetero population. But even if the gay population was approximately 7% of the hetero as has been previously alleged, the same case could be made.", 
   {
    "unicode_changes_made": true
   }, 
   277884, 
   null, 
   1186918680.0
  ], 
  [
   277900, 
   null, 
   "samiinh", 
   "Like so many, this one was hiding in a closet, wasn't he? Much like the catholic clergy and other's hiding their true nature...like Ted Haggard.", 
   {}, 
   277897, 
   null, 
   1186918860.0
  ], 
  [
   277903, 
   null, 
   "JSDKoeln", 
   "Oh really ? Have you forgotten about this case of untold numbers of abused victims ? And all by homosexuals over decades, if not centuries and around the World ? Of course, due to the cover-up the full extent of this crime will never be known. Here are some various stories of these unreported yet disturbing trends. And an excerpt below.\n \n http://www.traditionalvalues.org/urban/one.php\n New York Post Exposes High Rate Of Teacher/Student Molestations\n \n In a story not widely publicized in the mainstream press, the New York Post published a story in its July 30, 2001 edition about the secret epidemic of homosexual child abuse cases that go unreported in New York City's public schools.\n \n The report, \"Secret Shame Of Our Schools: Sexual Abuse Of Students Runs Rampant,\" by Douglas Montero, is the result of an analysis of 117 cases of sexual abuse between January 1999 and June 2001. Sixty percent of those accused of sexual abuse were transferred to desk jobs inside the school district. Forty percent of those transferred suspects were repeat sex offenders.\n \n The report noted that out of the 117 cases, 212 children were victims. In 45% of the cases, the sex offender attacked more than one student. In nearly 16% of the cases, school officials delayed or tried to cover up the sexual molestations. The average victim is a 15-year-old girl and 75% of the victims were girls. According to the report, \"Nearly 20 percent of the offenders are homosexuals and in most of these cases, the attack led to a sexual relationship with the stu- dent.\" The report also discovered that the Board of Education investigated another 347 substantiated sex abuse cases between January 2000 and July 20, 2001. Adding the 117 cases with the 327, it appears that at least one child is sexually abused each day by a school employee-and 20% of these molestations against children are done by homosexuals!\n Considering that according to these most current sources that only approximately 1.2-2% of the population is gay then the actual occurrences per capita are huge when compared to the other 98-99% of the hetero population. But even if the gay population was approximately 7% of the hetero as has been previously alleged, the same case could be made.\n\n \n YOu're referencing a right wing hate group Archie. So typical of you. Once again, your credibility took a dive.", 
   {
    "unicode_changes_made": true
   }, 
   277899, 
   null, 
   1186921080.0
  ], 
  [
   277906, 
   null, 
   "Archangel", 
   "YOu're referencing a right wing hate group Archie. So typical of you. Once again, your credibility took a dive.\n\n \n Oh I'm sorry, I forgot that anyone who is a proponent of traditional values must be motivated by hate. How foolish of me not to have noticed that {sarcasm}. And of course foundits source for his OP, the Advocate is based in love and acceptance for all people huh ? Does the word hypocrite mean anything to you JSD ? \n \n And just because you disagree with what the site stands for does that nullify the results of what they're reporting on ? Of course to you it does but in reality it has no bearing on the accuracy of what they say. Unless one is in denial, which is apparently the issue with your side.", 
   {}, 
   277903, 
   null, 
   1186922580.0
  ], 
  [
   277908, 
   null, 
   "JSDKoeln", 
   "Oh I'm sorry, I forgot that anyone who is a proponent of traditional values must be motivated by hate. How foolish of me not to have noticed that {sarcasm}. And of course foundits source for his OP, the Advocate is based in love and acceptance for all people huh ? Does the word hypocrite mean anything to you JSD ? \n \n And just because you disagree with what the site stands for does that nullify the results of what they're reporting on ? Of course to you it does but in reality it has no bearing on the accuracy of what they say. Unless one is in denial, which is apparently the issue with your side.\n\n \n Are you name calling now Archie? What did you just call me? More of your Christian love spewing forth!", 
   {}, 
   277906, 
   null, 
   1186923240.0
  ], 
  [
   277912, 
   null, 
   "Archangel", 
   "Are you name calling now Archie? What did you just call me? More of your Christian love spewing forth!\n\n \n What name calling are you imagining now ? I'm just posting a link that directly refutes foundits very biased OP that seeks to paint all Republicans in the same light as gays by showing that gays are in no position to throw stones. See ? http://www.traditionalvalues.org/urban/one.php \n \n What i find most incredible though, is that your side spends so much time defending homosexuality as right, normal, and even as moral as hetero sex; yet when you want to demonize Republicans as evil and immoral you post stories of them committing homosexual acts thereby agreeing that it is wrong, unnatural and immoral. So I guess when all is said and done we agree on something. And just as I have always said, it doesn't matter who practices homosexuality, it's a sin and is wrong. So thanks for posting this thread and confirming that you agree with the innate wrongness of those who even attempt to engage in gay sex.", 
   {}, 
   277908, 
   null, 
   1186927860.0
  ], 
  [
   277916, 
   null, 
   "jitobear", 
   "I want to know to know upon what they are basing the fact that 20% of the offenders were homosexual? Was it sef-identifications or the very wrong assumption that becasue they were men and victimized boys they are gay? \n \n I am tired of telling you this - Rape is not sex and the choice of victim is not indicative of sexual orienation.", 
   {}, 
   277912, 
   null, 
   1186930740.0
  ], 
  [
   277917, 
   null, 
   "Bassman", 
   "I want to know to know upon what they are basing the fact that 20% of the offenders were homosexual? Was it sef-identifications or the very wrong assumption that becasue they were men and victimized boys they are gay? \n \n I am tired of telling you this - Rape is not sex and the choice of victim is not indicative of sexual orienation.\n\n As much as I disagree with jito about nearly everything, she is spot on with this one. Rape is not about sex as it is about power and control. It is a vicious crime and atrocity.", 
   {}, 
   277916, 
   null, 
   1186931520.0
  ], 
  [
   277927, 
   null, 
   "samiinh", 
   "In typical rightwing fascist fashion, the poster selects a propaganda website that is know by all THINKING people to be nothing more than a terrorist organization and hate group.", 
   {}, 
   277917, 
   null, 
   1186937040.0
  ], 
  [
   277934, 
   null, 
   "Archangel", 
   "In typical rightwing fascist fashion, the poster selects a propaganda website that is know by all THINKING people to be nothing more than a terrorist organization and hate group.\n\n \n And here it is again. Check out the latest on the Gay Crusade what this tiny minority inflicts on the Country they seek to bring down with their moral degradation. Of course you would see the truth spoken as being a terrorist act and anyone daring to speak it against your lies as a hate group but that doesn't make it so samiinh. And BTW, you promised to put me on ignore and yet you keep trolling. Please, for once keep your word and follow through on what you say.\n \n http://traditionalvalues.org/urban/\n Traditional Values Coalition has launched a media effort called the \"Homosexual Urban Legend Series.\"\n \n This informational service is designed to provide reporters, editors, and other opinion leaders with accurate information on the relationship between homosexuality and the molestation of children. It will also expose and debunk dozens of factually inaccurate urban legends created by homosexual activist groups to promote their political and social agenda.\n \n Please share this website with others.\n \n \n urban legend\n n. An apocryphal story involving incidents of the recent past, often including elements of humor and horror, that spreads quickly and is popularly believed to be true.\n \n Source: The American Heritage® Dictionary of the English Language, Fourth Edition\n \n <publication< A story, which may have started with a grain of truth, that has been embroidered and retold until it has passed into the realm of myth. It is an interesting phenomenon that these stories get spread so far, so fast and so often. Urban legends never die, they just end up on the Internet! Some legends that periodically make their rounds include \"The Infamous Modem Tax\", \"Craig Shergold/Brain Tumor/Get Well Cards\", and \"The $250 Cookie Recipe\".\n \n Source: The Free On-line Dictionary of Computing, © 1993-2001 Denis Howe", 
   {
    "unicode_changes_made": true
   }, 
   277927, 
   null, 
   1186942980.0
  ], 
  [
   277935, 
   null, 
   "Archangel", 
   "As much as I disagree with jito about nearly everything, she is spot on with this one. Rape is not about sex as it is about power and control. It is a vicious crime and atrocity.\n\n \n That may be true about violent rape Bassman, but molestation, specifically against children is usually about the offender just getting sexually gratified. As a victim herself, Jito isn't the most objective source out there you know.", 
   {}, 
   277917, 
   null, 
   1186943160.0
  ], 
  [
   277942, 
   null, 
   "jitobear", 
   "That may be true about violent rape Bassman, but molestation, specifically against children is usually about the offender just getting sexually gratified. As a victim herself, Jito isn't the most objective source out there you know.\n\n \n This isn't personal opinion I am giving you here. Its the facts. Call up your local sexual violence center if you don't want to take my word for it.\n \n You are thoroughly insulting to victims here. You trivialize what sexual assualt is and what is even more pathetic, you are doing it to justify your personal prejudices against gays. Your priorities in the matter are completely wrong.\n \n I also do not appreciate the your extremely insensitive and insulting (and subtedly sexist) insinuation that I am incapable of knowing what I am talking about because I have been a rape victim. \n \n The next time you care to refute me on this matter, have the courage to back up your statements. I have provided you with my background, qualifiations and links on this matter. You have provided NOTHING but opportunistic personal opinion and now insult. I am not the one lacking credibility on this subject matter.", 
   {}, 
   277935, 
   null, 
   1186949280.0
  ], 
  [
   277944, 
   null, 
   "Bassman", 
   "That may be true about violent rape Bassman, but molestation, specifically against children is usually about the offender just getting sexually gratified. As a victim herself, Jito isn't the most objective source out there you know.\n\n \n Molestation is also about gaining control over the victim.", 
   {}, 
   277935, 
   null, 
   1186949640.0
  ], 
  [
   277948, 
   null, 
   "Archangel", 
   "This isn't personal opinion I am giving you here. Its the facts. Call up your local sexual violence center if you don't want to take my word for it.\n \n You are thoroughly insulting to victims here. You trivialize what sexual assualt is and what is even more pathetic, you are doing it to justify your personal prejudices against gays. Your priorities in the matter are completely wrong.\n\n \n I guess I wont worry about your feelings as long as you insist on lying about me and saying my opinions are based on my \"personal prejudices against gays.\" By making such a ridiculous statement founded on your own limited understanding and bigotry you just prove how you lack all objectivity. So I guess we should just agree to disagree.", 
   {}, 
   277942, 
   null, 
   1186951140.0
  ], 
  [
   277950, 
   null, 
   "Zardoz", 
   "Molestation is also about gaining control over the victim.\n\n \n Actually, how can you differentiate?\n \n Considering that ANY sex with a 'child' is considered molestation.\n \n Imagine how it'd be if straight sex were always considered rape.\n Or even gay sex.\n \n Would it really be about power and control if you did it because that's your natural inclination?", 
   {}, 
   277944, 
   null, 
   1186951260.0
  ], 
  [
   277958, 
   null, 
   "Bassman", 
   "Actually, how can you differentiate?\nThere is no differentiation; except, of course, in the prison community where paedophiles are marked men.\n \n \nConsidering that ANY sex with a 'child' is considered molestation.\n That is true.\n \n \nImagine how it'd be if straight sex were always considered rape.\n Or even gay sex.\nHmmmm.\n \n \nWould it really be about power and control if you did it because that's your natural inclination?\nIn many respects, it is about control.", 
   {}, 
   277950, 
   null, 
   1186953120.0
  ], 
  [
   277962, 
   null, 
   "thelmoose", 
   "Actually, how can you differentiate?\n \n Considering that ANY sex with a 'child' is considered molestation.\n \n Imagine how it'd be if straight sex were always considered rape.\n Or even gay sex.\n \n Would it really be about power and control if you did it because that's your natural inclination?\n\n \n The issue is consent.\n The victim does not give his consent, so the perpetrator must overpower him. \n Pre-pubertal children do not have an (adult-like) inclination to have sex, therefore it is always non-consensual.", 
   {}, 
   277950, 
   null, 
   1186953900.0
  ], 
  [
   278012, 
   null, 
   "jitobear", 
   "I guess I wont worry about your feelings as long as you insist on lying about me and saying my opinions are based on my \"personal prejudices against gays.\" By making such a ridiculous statement founded on your own limited understanding and bigotry you just prove how you lack all objectivity. So I guess we should just agree to disagree.\n\n \n Can't offer any valid refutation can you? At least you admit to having nothing but an opinion to offer.\n \n And I didn't say your (incorrect) opinion was based on anything. I said you are using it to justify your prejudice against gays. Quote me right. Also - me thinking you are prejudiced hardly makes me a liar. I really honest injun think you are prejudiced against gay people. Really. The fact alone, that you think raping little boys means you are a gay predator indicates to me that your prejudiced against gays. There are other examples of your prejudice as well, but there we are...", 
   {}, 
   277948, 
   null, 
   1186973280.0
  ], 
  [
   278014, 
   null, 
   "Zardoz", 
   "The issue is consent.\n The victim does not give his consent, so the perpetrator must overpower him. \n Pre-pubertal children do not have an (adult-like) inclination to have sex, therefore it is always non-consensual.\n\n \n But, consent is an artificial contemporary legal issue.\n \n That the laws are CURRENTLY based on known data doesn't preclude that fact that (as observed over time) these consent issues could change. More so with possible discoveries in the future/\n \n This is further supported by US state laws that have age of consent listed at differing ages.\n Supporting a notion that it's not exactly clearly defined when one is capable of giving proper consent.\n \n This could be further supported by romeo-juliet laws where minors seem somehow magically able to give consent to other minors.\n \n When we look at the puberty issue, we can also note that dietary changes and health considerations alter when this happens.\n From 11ish up to 16 (for example).\n \n As for mental considerations, even that's been shown to differ from individual to individual.\n \n Also, many predators DON'T overpower their molestation victim.\n Using farming, or familiarity, MOST predators KNOW their victims and have built a raport.\n This could easily be translated to the 'player' mentality.\n Would you consider a charming smooth talker a rapist because they 'disarmed' their victims of the ability to reason reasonably well enough to say 'no' by use of a slick demeanor?\n \n I'd disagree with the notion that pre-pubescent children not having a sexual inclination. Such a belief isn't well supported with science and behavioral observations. Such a sexual drive may not be what adults have and they may very well not have a grasp of what exactly they are doing. But, children well beyond the phalic stage have been observed to 'play with themselves'. \n \n And, then there's those who've stated they have an inclination to have a sexual relationship with a minor YET, have never engaged in sex with one. What do you say to them?\n [/devil's advocate]\n \n \n PS.\n \n I'm curious what 'control' issues rapists had prior to the 1700's.\n You know, when women didn't have any sort of equality.\n \n Viking raiders.\n Invading armies given priviledge to rape and pillage as payment.\n \n The notion of rape being a power issue over (victim) has only been such with the advent of equal rights issues for women.\n In the past, rape of a man (by non-homosexuals) WAS emasculation and power related. But, no such 'ego/ control' trip happened for rape of women. I'm sure there may be something I'm over looking, but if we want to debate this, I'm sure that it will be found that NO single reason exists for ANYTHING a human does fits all cases. Otherwise, profiling for future offenders would find a more solid base of support.\n \n Thus, Arch's position is reasonable. Rape isn't always about power and it's not always about sex. Advocates often have a vested interest to state so with those interviewed who've denied this as a motive being labeled as liars and what not.\n \n And for what it's worth, I do have family members who've been raped.\n I've never considered it the victims fault for anything that befalls them.", 
   {}, 
   277962, 
   null, 
   1186974180.0
  ], 
  [
   278016, 
   null, 
   "Archangel", 
   "Can't offer any valid refutation can you? At least you admit to having nothing but an opinion to offer.\n \n And I didn't say your (incorrect) opinion was based on anything. I said you are using it to justify your prejudice against gays. Quote me right. Also - me thinking you are prejudiced hardly makes me a liar. I really honest injun think you are prejudiced against gay people. Really. The fact alone, that you think raping little boys means you are a gay predator indicates to me that your prejudiced against gays. There are other examples of your prejudice as well, but there we are...\n\n \n Well you are lying jito. You claim to know my heart and mind when you obviously don't. Let's just leave it at that as I need prove nothing to you or anyone else here. What you think of me is about as important to me as what an insect thinks about me. So judge me as harshly as you like. I welcome your condemnation if all it takes is disagreeing with you to earn it. That just shows how small you are, not me.", 
   {}, 
   278012, 
   null, 
   1186974720.0
  ], 
  [
   278018, 
   null, 
   "thelmoose", 
   "But, consent is an artificial contemporary legal issue.\n \n That the laws are CURRENTLY based on known data doesn't preclude that fact that (as observed over time) these consent issues could change. More so with possible discoveries in the future/\n \n This is further supported by US state laws that have age of consent listed at differing ages.\n Supporting a notion that it's not exactly clearly defined when one is capable of giving proper consent.\n \n This could be further supported by romeo-juliet laws where minors seem somehow magically able to give consent to other minors.\n \n When we look at the puberty issue, we can also note that dietary changes and health considerations alter when this happens.\n From 11ish up to 16 (for example).\n \n As for mental considerations, even that's been shown to differ from individual to individual.\n \n Also, many predators DON'T overpower their molestation victim.\n Using farming, or familiarity, MOST predators KNOW their victims and have built a raport.\n This could easily be translated to the 'player' mentality.\n Would you consider a charming smooth talker a rapist because they 'disarmed' their victims of the ability to reason reasonably well enough to say 'no' by use of a slick demeanor?\n \n I'd disagree with the notion that pre-pubescent children not having a sexual inclination. Such a belief isn't well supported with science and behavioral observations. Such a sexual drive may not be what adults have and they may very well not have a grasp of what exactly they are doing. But, children well beyond the phalic stage have been observed to 'play with themselves'. \n \n And, then there's those who've stated they have an inclination to have a sexual relationship with a minor YET, have never engaged in sex with one. What do you say to them?\n [/devil's advocate]\n \n \n PS.\n \n I'm curious what 'control' issues rapists had prior to the 1700's.\n You know, when women didn't have any sort of equality.\n \n Viking raiders.\n Invading armies given priviledge to rape and pillage as payment.\n \n The notion of rape being a power issue over (victim) has only been such with the advent of equal rights issues for women.\n In the past, rape of a man (by non-homosexuals) WAS emasculation and power related. But, no such 'ego/ control' trip happened for rape of women. I'm sure there may be something I'm over looking, but if we want to debate this, I'm sure that it will be found that NO single reason exists for ANYTHING a human does fits all cases. Otherwise, profiling for future offenders would find a more solid base of support.\n \n Thus, Arch's position is reasonable. Rape isn't always about power and it's not always about sex. Advocates often have a vested interest to state so with those interviewed who've denied this as a motive being labeled as liars and what not.\n \n And for what it's worth, I do have family members who've been raped.\n I've never considered it the victims fault for anything that befalls them.\n\n \n I made a mistake in combining pedophilia and rape and considering them as identical. \n \n The desire to have sex with pre-pubertal children is not related to sexual attraction to adults. That is why otherwise hetero men may prey on boys. You are right, many pedophiles do not violently coerce their victims, but the child is most frequently views the behavior as abhorrent, something they would not otherwise choose to do.\n \n Whether puberty comes earlier now is irrelevant. Pedophila is having sex with a person who is not sexually mature, whenever that happens. \n \n Age of consent laws are a different thing, also. Clearly teenagers can have consensual sex. Some adolescents are probably emotionally mature enough to have consensual sex, even with an adult that does not cause them any harm. We have decided that most children do not have the maturity to make that decision, hence the establishment of statutory rape. That is not the same kind of rape jitobear is talking about. \n \n I am talking about one adult forcing him/herself sexually upon another adult without consent. I do know that those who examine this action from a psychological standpoint have noted that this is not a purely sexually related action, often it is not sexual at all. That is, it takes more than libido to force yourself sexually on someone. At least, those who do this habitually, do so out of for reasons of needing to overpower the victim. Pure horniness can turned off when the other person says no. Surely, it can be disappointing, but not enough to ignore those wishes and overpower the victim. And definitely the mentality of the victimizers vary, from the boorish brute to the sexual predator. \n \n One point of this is that which is sexually stimulating, pornography, sexy clothing, etc. is not a cause of rape. \n \n As to the historical aspect, if a woman is treated as a purely sexual object, from the raper/pillagers point of view there was no objection occurring. It was not considered a transgression. The woman was an object, not a person. He had every right to have this and he didn't consider that he was taking anything. But I am only speculating at this. \n \n Lastly, what possible motivation would anti-rape \"Advocates ... have [as] a vested interest to state so with those interviewed who've denied this as a motive being labeled as liars and what not.\" I don't know how you know this to be true, but their is empirical evidence that makes jito's case.", 
   {}, 
   278014, 
   null, 
   1186977000.0
  ], 
  [
   278029, 
   null, 
   "JakeCJB", 
   "What name calling are you imagining now ? I'm just posting a link that directly refutes foundits very biased OP that seeks to paint all Republicans in the same light as gays by showing that gays are in no position to throw stones. See ? http://www.traditionalvalues.org/urban/one.php\n\n \n This is typical right-wing ignorance. They are so quick to propagate hatred and fear of gays, they don't bother to learn the facts. They assume that if the victim is a boy the male perpetrator must be gay and acting on his homosexuality. That isn't true, as this study shows---\n \n http://www.childmolestationprevention.org/pdfs/study.pdf\n \n Page 12: Adult partner preference of men who molested boys showed only 8% of the men were exclusively homosexual, 51% of the men who molested boys were exclusively heterosexual, 19% predominantly heterosexual, 9% were equally homosexual and heterosexual.\n \n It's as simple as looking up the terms heterosexual and homosexual in the dictionary, nowhere will you find the definition of a sexual attraction to, or the molestation of, children.\n \n However, they hope to scare the ignorant and unwashed into associating being gay with something harmful and horrible like threatening the security of children. It's ignorant, irrational; it's bigotry.\n \n No one believes you are not merely propagating your own hatred of gays when you post garbage like this, Archangel.", 
   {}, 
   277912, 
   null, 
   1186987260.0
  ], 
  [
   278035, 
   null, 
   "samiinh", 
   "However, they hope to scare the ignorant and unwashed into associating being gay with something harmful and horrible like threatening the security of children. It's ignorant, irrational; it's bigotry.\n \n No one believes you are not merely propagating your own hatred of gays when you post garbage like this, Archangel.\n You are so right. It is bigotry at its best.", 
   {}, 
   278029, 
   null, 
   1187003940.0
  ], 
  [
   278051, 
   null, 
   "jitobear", 
   "Well you are lying jito. You claim to know my heart and mind when you obviously don't. \n\n \n Do you even know what a lie is? It is telling an untruth. I did no such thing. I made an assessment of you based upon your own behavior. You claim that (all) men who rape boys are gay predators (something you can not and have not substantiated all while igniring the posted evidence to the contrary), you call gays (and those who support them) \"reprobate\" and \"without a moral compass\", and you don't want the children of gay families to have their families acknowledged in schools. I can easily find posts to back up all I just said. The examples above are prejudice. Just because your chosen faith justifies it for you does not change the fact that they are. Don't want me to think you are prejudiced? Quite making insulting, prejudicial comments in here. \n \n \nLet's just leave it at that as I need prove nothing to you or anyone else here.\n\n \n Thats absolutely true. Of course you can't expect to have much credibility if you just expect us to take you at your word. \"Archangel said it so it must be correct\" is not going to fly.\n \n \nWhat you think of me is about as important to me as what an insect thinks about me. So judge me as harshly as you like. \n\n \n OK, I will.\n \n \nI welcome your condemnation if all it takes is disagreeing with you to earn it.\n\n \n Oh don't sell yourself short. You have done so much more than that.\n \n \nThat just shows how small you are, not me.\n\n \n Is that an insult?", 
   {}, 
   278016, 
   null, 
   1187010300.0
  ], 
  [
   278069, 
   null, 
   "Zardoz", 
   "I made a mistake in combining pedophilia and rape and considering them as identical.\n\n They're not. Close in some regards. \n \n \nThe desire to have sex with pre-pubertal children is not related to sexual attraction to adults. That is why otherwise hetero men may prey on boys. You are right, many pedophiles do not violently coerce their victims, but the child is most frequently views the behavior as abhorrent, something they would not otherwise choose to do.\n\n Care to speculate why the child views it that way?\n Societial conditioning? Pain inflicted in some practices?\n There could be ties to the way society via parents typically instills modesty and privacy into children.\n Would you find it odd that some cultures that don't follow this consider their practices normal. It's only western, Christian dominated, society that habitually views this as abhorrent.\n \n \nWhether puberty comes earlier now is irrelevant. Pedophila is having sex with a person who is not sexually mature, whenever that happens.\n\n Actually, it is relevant as is the was current society operates. In past centuries, (even in some areas), marrying off young girls to 'dirty old men' is/ was considered acceptable. \n In the past century+, western civilization has increased the span in which one is considered a child. \n \n \nAge of consent laws are a different thing, also. Clearly teenagers can have consensual sex. Some adolescents are probably emotionally mature enough to have consensual sex, even with an adult that does not cause them any harm. We have decided that most children do not have the maturity to make that decision, hence the establishment of statutory rape. That is not the same kind of rape jitobear is talking about. \n\n It's Not clear that they can have consensual sex. Those are somewhat arbitrary beliefs. Thus, our decisions are based on what we believe and think we know about the subject and using that information to make that decision. \n Such beliefs would most likely fly out the window in some circumstances.\n \n \nI am talking about one adult forcing him/herself sexually upon another adult without consent. I do know that those who examine this action from a psychological standpoint have noted that this is not a purely sexually related action, often it is not sexual at all. That is, it takes more than libido to force yourself sexually on someone. At least, those who do this habitually, do so out of for reasons of needing to overpower the victim. Pure horniness can turned off when the other person says no. Surely, it can be disappointing, but not enough to ignore those wishes and overpower the victim. And definitely the mentality of the victimizers vary, from the boorish brute to the sexual predator. \n\n Force is rape and in most of those cases, power and control issues are at play. \n But, as noted with pre-modern concepts of rape against women 'viewed as objects' used for SEXUAL gratification such still carries over to today's age. Many barbaric men still exist who Objectify women and use them for sexual gratification. Gratification is not a power or control issue. Actually, it's more apathetic to such notions. \n You'll also find that more honest evaluations of such people will note issues with Impulse Control.\n Not being able to control you impulses leads to all sorts of potential problems that can lead to a multitude of crime.\n Impulse problems are about control of self...not control or power over the other.\n \n \nOne point of this is that which is sexually stimulating, pornography, sexy clothing, etc. is not a cause of rape.\n\n Correction, Accepted cause of rape. Meaning it doesn't 'justify' it.\n But, they do tie in with the impulse control problems mentioned about. It potentially ads gas to a fire.\n The logical reasons we would say the above doesn't cause rape is because then some of the issue would lie in society and with the victim for allowing such to begin with. Can't accept that as it would inhibit free speech and put a damper on an individuals right to wear what they pleased. \n Sad fact is, that such behavior does sexually stimulate some people. Toss on impulse control problems and you could have rape. \n \n \nAs to the historical aspect, if a woman is treated as a purely sexual object, from the raper/pillagers point of view there was no objection occurring. It was not considered a transgression. The woman was an object, not a person. He had every right to have this and he didn't consider that he was taking anything. But I am only speculating at this.\n\n Which goes to show that it's a maleable societial way of thinking and has nothing to do with psychological facts. \n \n \nLastly, what possible motivation would anti-rape \"Advocates ... have [as] a vested interest to state so with those interviewed who've denied this as a motive being labeled as liars and what not.\" I don't know how you know this to be true, but their is empirical evidence that makes jito's case.\n\n \n To not be viewed as regressive. To not be viewed as enabling the criminal or to be revictimizing the victim by making them think they had some control over the crime. \n And since this is mostly true, why not jump on the band wagon and say it's universally true?\n If a criminal says that power and control wasn't a factor in his crime and doesn't fit the profile, well, he's a criminal, of course he would say that to displace responsibility and not own up to the fact that he's a weak, pathetic excuse of a man who can't be normal. If he passes psychological screening...then he's a cunning manipulator to boot.\n \n Since rape is more often against women, you'd find that pro-women rights groups have a vested interest in this. Studies have to be financed.\n Just a case of 'follow the money'. But, I'd hazard a guess that like in other cases (global warming) you'd find contradictions if anyone else had a vested interest in dealing with the subject.\n I just don't think there'd be anyone who'd champion rapists. Nor would anyone really care to find the truth of the matter if it's simply going to be shot down and ridiculed or even cost money that'd be best spent elsewhere.\n \n But, in all possibility, I could be wrong.\n Just playing devil's advocate and using the fact that humanity does all sorts of things for all sorts of different reasons to explore accepted convention.", 
   {}, 
   278018, 
   null, 
   1187015400.0
  ], 
  [
   278081, 
   null, 
   "foundit66", 
   "This is typical right-wing ignorance. They are so quick to propagate hatred and fear of gays, they don't bother to learn the facts. They assume that if the victim is a boy the male perpetrator must be gay and acting on his homosexuality. That isn't true, as this study shows---\n \n http://www.childmolestationprevention.org/pdfs/study.pdf\n Page 12: Adult partner preference of men who molested boys showed only 8% of the men were exclusively homosexual, 51% of the men who molested boys were exclusively heterosexual, 19% predominantly heterosexual, 9% were equally homosexual and heterosexual.\n\n \n You beat me to quoting that article. emoticon_xagree \n \n To continue...\n Molesting kids is about the AGE of the intended victim. The gender is typically irrelevant.\n \n Most men who molest boys don't sleep with men in their adult relationships. They sleep with WOMEN.\n \n Blaming child molestation of boys on gays is like blaming any use of the cross on Christians.\n So when the nazi swastika has a cross center, all the Jewish deaths can be blamed on Christianity.\n That obviously makes no sense, but for some it makes perfect sense to blame gays for child molestation.\n \n But then again they can't explain HOW most men who molest boys sleep with women instead... emoticon_emb", 
   {}, 
   278029, 
   null, 
   1187023080.0
  ], 
  [
   278083, 
   null, 
   "foundit66", 
   "Well, you certainly bumped the 'absent' trend by posting the story you did here. ;) \n\n Somewhere in America a woman is raped ever two minutes.\n I think THAT is the \"bumping\" of statistics you should be worried about.\n http://www.paralumun.com/issuesrapestats.htm\n \n But wait! That's about HETEROSEXUAL males isn't it.\n Not gays.\n \n So then I guess the SOLITARY statistic is overwhelmed by how many women were raped in the time it took to type your response.\n 2? 3? maybe 5 or 7?\n \n \n \nBut of course, we have no idea if the guy would have found a 'healthy' outlet or not, no matter what the Republican party does--acceptance or otherwise.\n\n And we have no idea if the child that wasn't malnourished and underfed wouldn't have died anyways if the parent had been competent...\n \n But I think it's fairly safe to say that there is a good chance the outcome would have been different.\n But I'm sure people at the GOP, like you, don't really care about such things...\n \n \n \nUnless he were to come out and say so, it can never be anything more than speculation that the party drove him to do this (as you are clearly asserting by saying \"drives them to such actions\").\n\n It's an educated guess Jyoshu.\n Which is more than you are presenting...\n \n \n \nThere will always be some gays in the supposedly gay-hostile Republican party, because frankly, many people's lives simply don't rise and fall on that one issue of sexuality.\n\n \"supposedly gay-hostile\"?\n How many facts do we have to point to before you drop the facade?\n I just pointed out the abysmally small representation of gay politicians in the GOP.\n We can look at party platform planks too, demonstrating openly anti-gay positions.\n \n The Republican party IS anti-gay.\n I will admit some overlook that, but there is no mistake that it IS anti-gay.\n \n \n \nFor some gays, there are still more important issues out there, and in some cases those issues are best served by that party. I'm sure that reality is hard to believe for a homosexual-centric-minded person; nonetheless, it's obviously true.\n\n \"centric\"?\n Jyoshu, if a party came along and advertised that Christians shouldn't adopt, that Christians shouldn't be able to marry, and that Christians shouldn't be able to serve in the military.\n If they were invited to a religious discussion forum and every single politician declined, presumably because they didn't want to be associated with Christians.\n \n Would YOU vote for them?\n (Don't worry. I think everybody here KNOWS you won't answer that question... emoticon_emb )\n \n It has less to do with \"centric\" and more to do with any concern whatsoever for your own equality.\n \n \n \nFor many of us, sexuality takes a back seat to other issues, no matter what our orientation.\n\n So when those of your religious persuasion proclaim gay issues as a platform issue, you disagree?\n When others of your religious persuasion proclaim that their \"family values\" helped win an election, you find that to be silly and childish?\n \n And on another note, the day that YOUR sexuality makes YOU TAKE a back seat, and provides a source of discrimination for others to discriminate against you, THEN you can talk to me about which seat my own sexuality should take on the bus.\n \n You're like a white man trying to tell Martin Luther King Jr what political issues he should focus on, because you as a white man don't really care too much about your whiteness issues...\n \n \n \nLife really doesn't have to revolve around it.\n\n But it DOES Jyoshu.\n NOT by my own choosing, but by the choosing of others.\n \n Other people who insist that I shouldn't be able to adopt because I'm gay.\n Other people who insist that I should be kicked out of the military because I'm gay.\n \n THEY MAKE my life revolve around it, because THEY make it an issue.\n It's cause and effect, and I've pointed that out to you in the past, but you refuse to get it...", 
   {}, 
   277889, 
   null, 
   1187023980.0
  ], 
  [
   278084, 
   null, 
   "thelmoose", 
   "They're not. Close in some regards. \n \n \n Care to speculate why the child views it that way?\n Societial conditioning? Pain inflicted in some practices?\n There could be ties to the way society via parents typically instills modesty and privacy into children.\n Would you find it odd that some cultures that don't follow this consider their practices normal. It's only western, Christian dominated, society that habitually views this as abhorrent.\n \n \n Actually, it is relevant as is the was current society operates. In past centuries, (even in some areas), marrying off young girls to 'dirty old men' is/ was considered acceptable. \n In the past century+, western civilization has increased the span in which one is considered a child. \n \n \n It's Not clear that they can have consensual sex. Those are somewhat arbitrary beliefs. Thus, our decisions are based on what we believe and think we know about the subject and using that information to make that decision. \n Such beliefs would most likely fly out the window in some circumstances.\n \n \n Force is rape and in most of those cases, power and control issues are at play. \n But, as noted with pre-modern concepts of rape against women 'viewed as objects' used for SEXUAL gratification such still carries over to today's age. Many barbaric men still exist who Objectify women and use them for sexual gratification. Gratification is not a power or control issue. Actually, it's more apathetic to such notions. \n You'll also find that more honest evaluations of such people will note issues with Impulse Control.\n Not being able to control you impulses leads to all sorts of potential problems that can lead to a multitude of crime.\n Impulse problems are about control of self...not control or power over the other.\n \n \n Correction, Accepted cause of rape. Meaning it doesn't 'justify' it.\n But, they do tie in with the impulse control problems mentioned about. It potentially ads gas to a fire.\n The logical reasons we would say the above doesn't cause rape is because then some of the issue would lie in society and with the victim for allowing such to begin with. Can't accept that as it would inhibit free speech and put a damper on an individuals right to wear what they pleased. \n Sad fact is, that such behavior does sexually stimulate some people. Toss on impulse control problems and you could have rape. \n \n \n Which goes to show that it's a maleable societial way of thinking and has nothing to do with psychological facts. \n \n \n \n To not be viewed as regressive. To not be viewed as enabling the criminal or to be revictimizing the victim by making them think they had some control over the crime. \n And since this is mostly true, why not jump on the band wagon and say it's universally true?\n If a criminal says that power and control wasn't a factor in his crime and doesn't fit the profile, well, he's a criminal, of course he would say that to displace responsibility and not own up to the fact that he's a weak, pathetic excuse of a man who can't be normal. If he passes psychological screening...then he's a cunning manipulator to boot.\n \n Since rape is more often against women, you'd find that pro-women rights groups have a vested interest in this. Studies have to be financed.\n Just a case of 'follow the money'. But, I'd hazard a guess that like in other cases (global warming) you'd find contradictions if anyone else had a vested interest in dealing with the subject.\n I just don't think there'd be anyone who'd champion rapists. Nor would anyone really care to find the truth of the matter if it's simply going to be shot down and ridiculed or even cost money that'd be best spent elsewhere.\n \n But, in all possibility, I could be wrong.\n Just playing devil's advocate and using the fact that humanity does all sorts of things for all sorts of different reasons to explore accepted convention.\n\n \n I am not clear what we are arguing about. \n I think rape is bad. Call me an alarmist. \n I think that pedophilia, statutory rape and rape are different topics.\n I think that it take more than libido to rape. \n I think you are being a tad argumentative here and there.\n \n I am not even sure how this topic got started. I remember you saying somewhere that you actually agreed with archie, and horror of horrors, I couldn't have that, so I jumped in. \n However, I am fizzled out on this topic, but thank you.", 
   {}, 
   278069, 
   null, 
   1187024280.0
  ], 
  [
   278087, 
   null, 
   "Zardoz", 
   "\n I am not even sure how this topic got started. I remember you saying somewhere that you actually agreed with archie, and horror of horrors, I couldn't have that, so I jumped in. \n However, I am fizzled out on this topic, but thank you.\n\n \n Yeah, it's a side tangent. More of a commentary on the dispute between Arch's comments and Jitos on the nature of rape.\n \n What I'm basically saying is that human nature has many factors that are cause for doing something.\n I tend in general to have at least 3 reasons for doing anything in particular as an example.\n Thus, rape as sexual gratification with apathy to any particular victim is a possibility right along side the Ted Bundy 'control' issues you can view in exteme cases.\n \n It's just not PC to believe the former. There's also no real vested interest in doing so...other than to displace some responsibility for criminal actions. Who really cares about that?\n I'd say Arch isn't concerned with PC.", 
   {}, 
   278084, 
   null, 
   1187027880.0
  ], 
  [
   278090, 
   null, 
   "Archangel", 
   "This is typical right-wing ignorance. They are so quick to propagate hatred and fear of gays, they don't bother to learn the facts. They assume that if the victim is a boy the male perpetrator must be gay and acting on his homosexuality. That isn't true, as this study shows---\n \n http://www.childmolestationprevention.org/pdfs/study.pdf\n \n Page 12: Adult partner preference of men who molested boys showed only 8% of the men were exclusively homosexual, 51% of the men who molested boys were exclusively heterosexual, 19% predominantly heterosexual, 9% were equally homosexual and heterosexual.\n \n It's as simple as looking up the terms heterosexual and homosexual in the dictionary, nowhere will you find the definition of a sexual attraction to, or the molestation of, children.\n \n However, they hope to scare the ignorant and unwashed into associating being gay with something harmful and horrible like threatening the security of children. It's ignorant, irrational; it's bigotry.\n \n No one believes you are not merely propagating your own hatred of gays when you post garbage like this, Archangel.\n\n \n But Jake, even using your statistics is damming for the gay community on a per-capita basis as according to some statistics, the percentage of gays in our population is around 1.2 to 2%. So if only 8% of the molesters were exclusively gay then the per-capita percentage is much higher than it is for the other 98-99% of the population. I would also point out that if you combine the numbers from your article for the exclusively gay and the 9% were equally homosexual and heterosexual which I question, then you come up with approximately the same percentages of the other article. \n \n Attempting to further itemize and departmentalize statistics is a typical way of fudging the numbers to create a preferred outcome so it tends to blur results rather than clarify them. And here's another perspective: \n \n http://rds.yahoo.com/_ylt=A0geu7TogsBGxBQArn9XNyoA;_ylu=X3oDMTExbTV0dDR1BHNlYwNzcgRwb3MDMQRjb2xvA2FjMgR2dGlkAwRsA1dTMQ--/SIG=13hioi7s7/EXP=1187107944/**http%3a//www.jesus-is-savior.com/Evils%2520in%2520America/Sodomy/pedophilia_and_homosexuals.htm\n \n Homosexuality 'youth-oriented'?\n \n \"Research on the homosexual lifestyle confirms it is almost exclusively a youth-oriented culture,\" Baldwin wrote. \"Very few gays exhibit preference for older men.\"\n \n \"Some admit to focus on teenage boys,\" he said, \"some on prepubescent boys, and many cross over between categories.\"\n \n A 1988 study detailed in Baldwin's report found that most pedophiles even consider themselves to be \"gay.\" According to the study, \"Archives of Sexual Behavior,\" some 86 percent of pedophiles described themselves as homosexual or bisexual. Also, the study found, the number of teenage male prostitutes who identify as homosexuals has risen from 10 percent to 60 percent in the past 15 years.\n \n When asked what he thought about critics who attempt to debunk his research, Baldwin said the results speak for themselves.\n \n \"For them to say this theory is false is to call many of the homosexual movement's leaders liars,\" he said. \"Most of my evidence comes right from the gay community.\"\n \n \"I managed to find enough evidence that my thesis - child molestation is an integral part of the homosexual movement - is a valid thesis,\" Baldwin told WorldNetDaily.\n \n Other experts have also found a distinct pattern between child sex abusers and the incidence of homosexuality.\n \n \"How long can psychologists be in denial about the significance of the dark side, and ignore what it implies about the homosexual condition? And there's a matter of even greater concern. How long will psychologists eagerly throw open the door to gay life for every sexually confused teenager?\" writes Joseph Nicolosi, Ph.D, on behalf of NARTH - the National Association for Research and Therapy of Homosexuality - a group that says it exists to \"provide psychological understanding of the cause, treatment and behavior patterns associated with homosexuality, within the boundaries of a civil public dialogue.\"\n \n The North American Man-Boy Love Association, or NAMBLA, is \"a group that openly promotes sex with minor boys and claims that boy-lovers respond to the needs of the boys they love,\" Baldwin said in his report.\n \n The group is often endorsed by \"many of the homosexual movement's most prominent leaders,\" he said.\n \n \n \n Advocacy moving to schools\n \n Promotion of the \"gay and lesbian lifestyle\" is increasing in the nation's public schools.\n \n A WND survey of homosexual-oriented websites found that almost every group has some sort of program to \"educate\" teachers, school administrators and other school employees about the homosexual lifestyle:\n \n \n \n GLSEN - the Gay Lesbian and Straight Education Network - bills itself as \"the largest national network of parents, students, educators and others\" specifically formed to end \"discrimination based on sexual orientation and gender identity/expression in K-12 schools. Two recent press released boasted of the Broward County (Fla.) school board approving GLSEN-sponsored \"training for teachers.\"\n \n \n A student activist working with GLSEN officials has managed to \"give voice\" recently to \"gay, lesbian, bisexual and transgendered students\" at California schools;\n \n \n PFLAG has created a national campaign called, \"From Our House to the Schoolhouse,\" distributing to school officials - among other materials - a booklet entitled, \"Just the Facts About Sexual Orientation and Youth: A Primer For Principals, Educators, & School Personnel. [Editor's note: Readers need the Adobe PDF reader to open and read this file.]\n Though most school-related programs are sold to administrators and parents as programs designed simply to end persecution of homosexuals and lesbians, none disclose what Baldwin says is compelling evidence that homosexuality is harmful to children.\n \n \"What ... does the academic literature say about the relationship between homosexuality and child molestation? Quite a bit, actually,\" he wrote, quoting data compiled by the Family Research Institute: \"Scientific studies confirm a strong pedophilic predisposition among homosexuals.\"\n \n The institute, after reviewing more than 19 studies and peer-reviewed reports in a 1985 \"Psychological Reports\" article, found that homosexuals account for between 25 and 40 percent of all child molestation.\n \n \"But this number is low,\" Baldwin says, \"due to the fact that many reporters will not report if a child molester is a homosexual, even if he knows that to be the case.\"", 
   {
    "unicode_changes_made": true
   }, 
   278029, 
   null, 
   1187028600.0
  ], 
  [
   278095, 
   null, 
   "foundit66", 
   "But Jake, even using your statistics is damming for the gay community on a per-capita basis as according to some statistics, the percentage of gays in our population is around 1.2 to 2%. So if only 8% of the molesters were exclusively gay then the per-capita percentage is much higher than it is for the other 98-99% of the population.\n\n Archie, those were child molestors WHO MOLESTED ONLY BOYS.\n That's discounting 80% of all child molestations.\n \n \n \nAttempting to further itemize and departmentalize statistics is a typical way of fudging the numbers to create a preferred outcome so it tends to blur results rather than clarify them.\n\n I agree.\n And it is what YOUR side is doing.\n \n A homosexual is a man who prefers to sleep with other men.\n A heterosexual is a man who prefers to sleep with women.\n \n It is improper to claim somebody is a heterosexual because they like molesting dead female colts. But by blindly choosing \"gender of the victim\" as a determining factor, IGNORING what the assailant does in his adult life, you are performing that EXACT error.\n \n \n \nA 1988 study detailed in Baldwin's report found that most pedophiles even consider themselves to be \"gay.\" According to the study, \"Archives of Sexual Behavior,\" some 86 percent of pedophiles described themselves as homosexual or bisexual. Also, the study found, the number of teenage male prostitutes who identify as homosexuals has risen from 10 percent to 60 percent in the past 15 years.\n\n Predictably, NO source for this claim of a \"study\".\n And it is refuted by EVERY other study I have seen which actually EXAMINES the sexual orientation of the pedophile.\n Take the link already given which examines ONLY those pedophiles who molest boys.\n EVEN amongst THAT cross-section, it is MOSTLY HETEROSEXUALS.", 
   {}, 
   278090, 
   null, 
   1187030820.0
  ], 
  [
   278100, 
   null, 
   "thelmoose", 
   "Good God, Archie, if you are suggesting that PFLAG and GLSEN are in any way related to pedophilia, you have exceeded even your usual standard of confusion. You should know that both of those groups consist of mostly straight people. I think PFLAG is only straight people. Is there anything you won't swallow as long as it seems to support your pre-conceived ideas? That website is about as trustworthy as a tabloid. Do you believe in Batboy as well?\n \n I challenge to find a SINGLE paper in a peer-reviewed journal that supports any of those claims. I mean a real reference.", 
   {}, 
   278095, 
   null, 
   1187032140.0
  ], 
  [
   278105, 
   null, 
   "Archangel", 
   "Good God, Archie, if you are suggesting that PFLAG and GLSEN are in any way related to pedophilia, you have exceeded even your usual standard of confusion. You should know that both of those groups consist of mostly straight people. I think PFLAG is only straight people. Is there anything you won't swallow as long as it seems to support your pre-conceived ideas? That website is about as trustworthy as a tabloid. Do you believe in Batboy as well?\n \n I challenge to find a SINGLE paper in a peer-reviewed journal that supports any of those claims. I mean a real reference.\n\n \n Not at all moose, PFLAG is a special interest group created by the families of gays that work for gay issues. And the link speaks for itself in what they are promoting. Here's a link to PFLAG\n \n http://www.pflag.org/", 
   {}, 
   278100, 
   null, 
   1187033100.0
  ], 
  [
   278106, 
   null, 
   "thelmoose", 
   "Not at all moose, PFLAG is a special interest group created by the families of gays that work for gay issues. And the link speaks for itself in what they are promoting. Here's a link to PFLAG\n \n http://www.pflag.org/\n\n \n I am VERY familiar with PLFAG. \n Spell out the letters, nimrod, and it tells you who the members are. They are non-gay parents and friends of lesbians and gays. \n If you would ever go to Gay Pride you would know these things.\n \n PS. I repeat: I challenge to find a SINGLE paper in a peer-reviewed journal that supports any of those claims. I mean a real reference.", 
   {}, 
   278105, 
   null, 
   1187033400.0
  ], 
  [
   278112, 
   null, 
   "Jo Bennett", 
   "Thing is, AA, the only place you'll find the claim of only 1-2% of the population being gay is anti-gay websites. The Kinsey Report, for example, placed the proportion as high as 10%. More recent studies have placed those who self-identify as gay upwards of 3%, but there is necessarily a sampling bias with these questions as most closeted gay people will not self-identify.", 
   {}, 
   278106, 
   null, 
   1187034000.0
  ], 
  [
   278116, 
   null, 
   "Sigma", 
   "\n PS. I repeat: I challenge to find a SINGLE paper in a peer-reviewed journal that supports any of those claims. I mean a real reference.\n\n \n It would take a rare person to challenge conventional wisdom and the current politically correct atmosphere to submit such a paper, imo, even if the facts were correct.\n \n Anyone likely to do so would likely only do so for money and anyone who would fund such a project would be anti-gay groups. No organization who wishes to maintain credibility with the general public would fund such a project even if they believed the results were correct.", 
   {}, 
   278106, 
   null, 
   1187034660.0
  ], 
  [
   278120, 
   null, 
   "foundit66", 
   "It would take a rare person to challenge conventional wisdom and the current politically correct atmosphere to submit such a paper, imo, even if the facts were correct.\n\n 1) The standard mantra for ignoring the absence of proof of the anti-gay position.\n \n A while back there was an article published which some people claimed advocated pedophilia. A LOT of people came out and proclaimed that the APA was endorsing pedophilia, or trying to normalize it, or moving to remove it from the list of mental illnesses.\n All of those claims were lies, and the APA unilaterally tore apart these potential conclusions of the article.\n \n But it WAS PRINTED.\n And that is the point.\n \n EVEN a paper that is on an even more highly charged issue like pedophilia gets published. Even though a lot of people disagreed with it, it STILL got published.\n How un-PC is that?\n So what the heck is the excuse again for why anti-gay papers don't get published?\n \n 2) For the record, I can come up with quite a few people who do \"challenge conventional wisdom\" on the gay issue, proclaiming things that have been proven false.\n A LOT on that list can be shown to saying some bizarre and unprovable things. Some can be shown to be outright lying, or just so off their rocker that it isn't even funny.", 
   {}, 
   278116, 
   null, 
   1187035560.0
  ], 
  [
   278121, 
   null, 
   "thelmoose", 
   "It would take a rare person to challenge conventional wisdom and the current politically correct atmosphere to submit such a paper, imo, even if the facts were correct.\n \n Anyone likely to do so would likely only do so for money and anyone who would fund such a project would be anti-gay groups. No organization who wishes to maintain credibility with the general public would fund such a project even if they believed the results were correct.\n\n \n I am in academia. \n I (attempt to) publish scientific papers. \n I am occasionally asked to review papers. \n Challenging conventional wisdom, if you can back it up with facts, is not discouraged out of hand, even if a few noses do get out of joint. \n \n A pertinent example. One of the psychiatrists ( I forget his name) who was intrumental in getting the APA to change his mind about gayness as a disease in the 70's, published an article in the past few years about reparative therapy for gays. He got a lot of flack (and it was widely misunderstood), but he got the thing published in a mainstream journal because it was well-conducted research. \n \n So I think you are wrong.\n \n Many anti-gay groups have plenty of money to fund their own grants to do the research and publish their own journals and do their own peer-review. There would, however, be no studies to publish. So all you have are these \"institutes\" with websites.\n \n I know not what atmosphere of which you speak. \n That doesn't change the fact that Archie has no facts to back up his claim.", 
   {}, 
   278116, 
   null, 
   1187035560.0
  ], 
  [
   278122, 
   null, 
   "Sigma", 
   "1) The standard mantra for ignoring the absence of proof of the anti-gay position.\n\n \n The absence of proof is not proof. That's just common sense.\n \n \nA while back there was an article published which some people claimed advocated pedophilia. A LOT of people came out and proclaimed that the APA was endorsing pedophilia, or trying to normalize it, or moving to remove it from the list of mental illnesses.\n All of those claims were lies, and the APA unilaterally tore apart these potential conclusions of the article.\n\n \n I am not saying that such a paper could not be printed, I am saying that those likely to do so have an agenda even if what they are advocating (or a form of it) is correct. Perhaps some of the claims that those who advocate pedophilia is defensible but the topic is not treated objectively. I doubt anyone who can be objective would take anything that could be construed as a \"pro-pedophilia\" stance.", 
   {}, 
   278120, 
   null, 
   1187036100.0
  ], 
  [
   278126, 
   null, 
   "Sigma", 
   "\n Many anti-gay groups have plenty of money to fund their own grants to do the research and publish their own journals and do their own peer-review. There would, however, be no studies to publish. So all you have are these \"institutes\" with websites.\n \n I know not what atmosphere of which you speak. \n That doesn't change the fact that Archie has no facts to back up his claim.\n\n \n I have no doubt that those with agendas can get the money. That wasn't my point :P\n \n My point is more that I doubt those who can be objective would not likely get grant money from organizations who do not wish their name attached to something \"anti-gay\" and organizations with agendas want to fund projects that align with those agendas instead of trying to find an objective view.\n \n Just take a step back and realize that the absence of proof is not proof.", 
   {}, 
   278121, 
   null, 
   1187036640.0
  ], 
  [
   278131, 
   null, 
   "Archangel", 
   "Thing is, AA, the only place you'll find the claim of only 1-2% of the population being gay is anti-gay websites. The Kinsey Report, for example, placed the proportion as high as 10%. More recent studies have placed those who self-identify as gay upwards of 3%, but there is necessarily a sampling bias with these questions as most closeted gay people will not self-identify.\n\n \n Interesting that you should bring up the 1948 Kinsey Report. It actually attributes only 4% is exclusively homosexual. This link also gives many more stats that are usually ignored or brushed under the rug for obvious reasons. The part about their numbers is at the bottom of the page though.\n \n http://rds.yahoo.com/_ylt=A0geu66xpcBGJEEAhqVXNyoA;_ylu=X3oDMTExbTV0dDR1BHNlYwNzcgRwb3MDMQRjb2xvA2FjMgR2dGlkAwRsA1dTMQ--/SIG=12hm6kij3/EXP=1187116849/**http%3a//www.traditioninaction.org/HotTopics/a02rStatistcs.html\n The True Number of Homosexuals\n \n The Kinsey study of 1948, which homosexuals often cite to say that 10% of the population is homosexual, actually says that only 4% of the population is exclusively homosexual. This study involved a disproportionate number of people who had been in jail for sex crimes (hardly a random sample of the population). Kinsey also did perverse studies involving young boys and pedophiles.\n \n \"Gays\" at a public manifestation in New York\n Current research shows that the true percentage of homosexuals is in the 1-2% range. Consider how small this number is when compared to most of the numbers above.", 
   {}, 
   278112, 
   null, 
   1187037780.0
  ], 
  [
   278132, 
   null, 
   "thelmoose", 
   "I\n \n Just take a step back and realize that the absence of proof is not proof.\n\n \n Fine. \n If I cannot prove something is may not mean I am wrong, certainly, but one should certainly not conclude I am right. \n The absence of data is the absence of data. \n One shouldn't make a claim about the existence of data that does not exist. It may well exist, but the onus is upon the claimant to present it.", 
   {}, 
   278126, 
   null, 
   1187037900.0
  ], 
  [
   278134, 
   null, 
   "foundit66", 
   "The absence of proof is not proof. That's just common sense.\n\n I agree.\n But the proof demonstrating the OPPOSING view-point DOES exist, while the anti-gay \"proof\" is missing.\n I think that does demonstrate something...\n \n \n \nI am not saying that such a paper could not be printed, I am saying that those likely to do so have an agenda even if what they are advocating (or a form of it) is correct. Perhaps some of the claims that those who advocate pedophilia is defensible but the topic is not treated objectively. I doubt anyone who can be objective would take anything that could be construed as a \"pro-pedophilia\" stance.\n\n Interesting.\n \n On a tangent, the \"pro-pedophilia\" stance (IMO) was more of a spin from the NON-professional observers who freaked out over something they didn't understand. Or just wanted to knee-jerk on. (Ergo, more of a \"PC\" issue...)\n If I remember correctly, the paper itself was not really \"pro-pedophilia\" as much as it addressed the possibility that pedophilia VICTIMS were not as harmed, or irreparably harmed as some might think.\n Some examples were used which demonstrated that SOME of the pedophilia victims were able to 'recover', and were actually perceived as being emotionally stronger after the incident.\n \n Quite frankly, I liken that to a bone being broken healing to be stronger than before the break.\n Such a fact in no way endorses an ideology of breaking bones to help kids...\n \n But then the \"family\" groups got a hold of the article, and the editorialists, and the pundits, and everybody who wanted a sound-bite, and it got turned into \"APA supports pedophilia\" when nothing could be further from the truth.\n \n But regardless, the paper was published and was not published by a group that had an \"agenda\".\n They were just repeating a paper that had the proper documentation and factual backing. In and of itself, it is NOT pro-pedophile, but they could have conceivably been \"PC\" and rejected it because of a prediction of what the \"PC\" crowd would do with it.\n \n And it's not even a really \"PC\" issue, as the unilateral condemnation of pedophilia is a no-brainer.\n \n \n In the end run, I think the REAL reason most of these don't get published by the more main-stream and rational publications is because they are RATIONAL publications, adhering to standards which are often ignored in many of the anti-gay \"papers\".\n Dr Abel, whose work was discussed previously in this thread, has been repeatedly misquoted and used as a reference to condemn gays, although his ACTUAL work leads to a significantly different conclusion.\n I see it as more of a problem with the QUALITY of the paper being insufficient more than anything else.", 
   {}, 
   278122, 
   null, 
   1187038320.0
  ], 
  [
   278139, 
   null, 
   "Sigma", 
   "I agree.\n But the proof demonstrating the OPPOSING view-point DOES exist, while the anti-gay \"proof\" is missing.\n I think that does demonstrate something...\n\n \n If true, it merely demonstrates that there is the absence of evidence. In and of itself it proves nothing.\n \n \nBut then the \"family\" groups got a hold of the article, and the editorialists, and the pundits, and everybody who wanted a sound-bite, and it got turned into \"APA supports pedophilia\" when nothing could be further from the truth.\n \n But regardless, the paper was published and was not published by a group that had an \"agenda\".\n\n \n Not to take this thread off-track, but that is interesting. Even those with an agenda probably would be leery of publishing an article that had it's facts straight but might spark such a reaction (let alone someone who attempts objectivity). This article sounds pretty innocuous and the authors, imo, wouldn't have anticipated such an outcry; I wonder what the outcry would have been like if the article was something along the lines of \"some 'victims' look favorably upon their experience\". I'd forsee death threats.\n \n \nAnd it's not even a really \"PC\" issue, as the unilateral condemnation of pedophilia is a no-brainer.\n\n \n This is likely the basis of the reaction against that article. It sounds like an unthinking \"knee-jerk\" response. I'd guess most would stick to safer topics :P", 
   {}, 
   278134, 
   null, 
   1187039700.0
  ], 
  [
   278142, 
   null, 
   "GiantOreo", 
   "If true, it merely demonstrates that there is the absence of evidence. In and of itself it proves nothing.\n \n \n\n \n \n As thelmoose said: One shouldn't make a claim about the existence of data that does not exist. It may well exist, but the onus is upon the claimant to present it.\n \n I agree that it demonstrates an absense of evidence. However, it would be ludicrous to say that one's position is correct and that there is just an \"absence\" of evidence - it is up to the claimant of that view to own up to the burden of proof and PRESENT the evidence that supports their view. We are not required to take another's claims seriously until such evidence is provided.\n \n It is tantamount to claiming that leprechauns exist, and then appealing to there just being an absense of evidence.\n \n I'm sure you can see the difference here, but I'm not sure that other certain posters seem to understand this.", 
   {}, 
   278139, 
   null, 
   1187040420.0
  ], 
  [
   278144, 
   null, 
   "Sigma", 
   "As thelmoose said: One shouldn't make a claim about the existence of data that does not exist. It may well exist, but the onus is upon the claimant to present it.\n [...]\n It is tantamount to claiming that leprechauns exist, and then appealing to there just being an absense of evidence.\n \n I'm sure you can see the difference here, but I'm not sure that other certain posters seem to understand this.\n\n \n Oh, yes, I do understand that. Claiming something is true with no evidence is an article of faith, not an argument. One at least needs logical supposition. \n \n I just don't think studies are the be-all end-all, since there are or could be very good reasons there are no studies showing the opposite (or those studies are not given the publicity they might warrant).", 
   {}, 
   278142, 
   null, 
   1187040720.0
  ], 
  [
   278145, 
   null, 
   "Jo Bennett", 
   "Interesting that you should bring up the 1948 Kinsey Report. It actually attributes only 4% is exclusively homosexual. This link also gives many more stats that are usually ignored or brushed under the rug for obvious reasons. The part about their numbers is at the bottom of the page though.\n \n http://rds.yahoo.com/_ylt=A0geu66xpcBGJEEAhqVXNyoA;_ylu=X3oDMTExbTV0dDR1BHNlYwNzcgRwb3MDMQRjb2xvA2FjMgR2dGlkAwRsA1dTMQ--/SIG=12hm6kij3/EXP=1187116849/**http%3a//www.traditioninaction.org/HotTopics/a02rStatistcs.html\n The True Number of Homosexuals\n \n The Kinsey study of 1948, which homosexuals often cite to say that 10% of the population is homosexual, actually says that only 4% of the population is exclusively homosexual. This study involved a disproportionate number of people who had been in jail for sex crimes (hardly a random sample of the population). Kinsey also did perverse studies involving young boys and pedophiles.\n \n \"Gays\" at a public manifestation in New York\n Current research shows that the true percentage of homosexuals is in the 1-2% range. Consider how small this number is when compared to most of the numbers above.\n\n \n So you respond with yet another fundie website. While it is technically correct that Kinsey thought there were only a small number of completely homosexual people, he reported exactly the same about heterosexuals - he claimed that most people were somewhere on a contiuum between homo and hetero sexuality. Surveys always underreport the number of gay people because there is still a social stigma attached to being gay. Many surveys report that even those who have engaged in same-sex activity usually consider themselves straight.", 
   {}, 
   278131, 
   null, 
   1187040840.0
  ], 
  [
   278146, 
   null, 
   "JSDKoeln", 
   "So you respond with yet another fundie website. While it is technically correct that Kinsey thought there were only a small number of completely homosexual people, he reported exactly the same about heterosexuals - he claimed that most people were somewhere on a contiuum between homo and hetero sexuality. Surveys always underreport the number of gay people because there is still a social stigma attached to being gay. Many surveys report that even those who have engaged in same-sex activity usually consider themselves straight.\n\n \n Sounds like someone could be lying... hmmm who could it be? emoticon_ic", 
   {}, 
   278145, 
   null, 
   1187041080.0
  ], 
  [
   278148, 
   null, 
   "Archangel", 
   "So you respond with yet another fundie website. While it is technically correct that Kinsey thought there were only a small number of completely homosexual people, he reported exactly the same about heterosexuals - he claimed that most people were somewhere on a contiuum between homo and hetero sexuality. Surveys always underreport the number of gay people because there is still a social stigma attached to being gay. Many surveys report that even those who have engaged in same-sex activity usually consider themselves straight.\n\n \n Any site that conflicts with your liberal perspective is seen as a fundie site Jo.", 
   {}, 
   278145, 
   null, 
   1187041980.0
  ], 
  [
   278150, 
   null, 
   "GiantOreo", 
   "Any site that conflicts with your liberal perspective is seen as a fundie site Jo.\n\n \n I'll leave this to Jo to turn directly around and apply it you you. emoticon_xhoho", 
   {}, 
   278148, 
   null, 
   1187042400.0
  ], 
  [
   278151, 
   null, 
   "thelmoose", 
   "Any site that conflicts with your liberal perspective is seen as a fundie site Jo.\n\n \n It's actually not a fundie site, it is a Catholic site, Tradition in action.\n In the \"about us\":\n \n\n Tradition In Action is committed to defend the perennial Magisterium of Holy Mother Church and Catholic traditions. TIA also works for a restoration of Christian civilization, adapted to contemporary historical circumstances. \n\n Not exactly where I would first think of looking for information about human sexuality. \n But that's me.\n \n Hey, Arch, have you ever considered getting scientific information from a scientific source???\n Just a thought.", 
   {}, 
   278148, 
   null, 
   1187042520.0
  ], 
  [
   278152, 
   null, 
   "Jo Bennett", 
   "Any site that conflicts with your liberal perspective is seen as a fundie site Jo.\n\n \n Not really. Just websites that equate being gay with support for NAMBLA like the last one you posted, claim that being gay stopped being classed as a mental illness for political rather than scientific reasons, and a few other non-sensical claims. Generally any american website with \"tradition\" in the title is a bad sign.", 
   {}, 
   278148, 
   null, 
   1187042520.0
  ], 
  [
   278156, 
   null, 
   "jyoshu", 
   "Somewhere in America a woman is raped ever two minutes.\n I think THAT is the \"bumping\" of statistics you should be worried about.\n http://www.paralumun.com/issuesrapestats.htm\n \n But wait! That's about HETEROSEXUAL males isn't it.\n Not gays.\n\n \n I was making a point. Clearly you were trying to use this incident to infer something abut Republicans (when you really have no idea whether or not that anything whatsoever to do with it). If you can blithely use isolated incidents of corruption (which happen with Dems too sometimes) to try and say something about Republicans, the same twisted logic could be used over the fact he's gay. Of course, it's an invalid way to look at it, but then that's the point, isn't it? A point which clearly went right over your head.\n \n \nIt's an educated guess Jyoshu.\n Which is more than you are presenting...\n\n \n You want me to present a theory?? How about the simple possibility that he was the sort of person that tries to victimizes people in their sleep? We couldn't possibly entertain THAT idea, now could we? You're just wanting to create some dots to connect over him having an \"(R)\" by his name. \n \n \n\"supposedly gay-hostile\"?\n How many facts do we have to point to before you drop the facade?\n I just pointed out the abysmally small representation of gay politicians in the GOP.\n We can look at party platform planks too, demonstrating openly anti-gay positions.\n\n \n But you don't seem content to stop there. You seem to want to infer they are a party of rapists, given this very thread. That's more to the point here.\n \n \n\"centric\"?\n Jyoshu, if a party came along and advertised that Christians shouldn't adopt, that Christians shouldn't be able to marry, and that Christians shouldn't be able to serve in the military.\n If they were invited to a religious discussion forum and every single politician declined, presumably because they didn't want to be associated with Christians. Would YOU vote for them?\n\n \n It depends on the other issues too. Or maybe I'd be dissatisfied with BOTH parties. Most people aren't a one-issue voter, Foundit. Maybe you are. But most aren't. And look, obviously not all gays see it the way you do, because there are out-of-the-closet gays IN the Republican party. The LCR for instance. So, it's not like reality bears out what you say.\n \n \nDon't worry. I think everybody here KNOWS you won't answer that question...\n\n \n Well, you can eat you own words, because I just did.\n \n \nIt has less to do with \"centric\" and more to do with any concern whatsoever for your own equality.\n\n \n So if one party denies you equality, but the other party's policies may deny your very safety and livelihood, you'd still pick the first one? \n \n \nYou're like a white man trying to tell Martin Luther King Jr what political issues he should focus on, because you as a white man don't really care too much about your whiteness issues...\n\n \n ML King Jr.??? You give yourself WAY too much credit, Foundit. :p \n \n No, I'm like the white man who has enough sense to know that republicans don't equate to rapists. Remember, that WAS the issue here--the fact you tried to make a connection with him being part of the GOP and committing a sexual crime. I know you'd prefer to try and defend something more easily defensible by moving to a subject that you can be the victim, but I'm not going to let you off the hook so easily.", 
   {}, 
   278083, 
   null, 
   1187044620.0
  ], 
  [
   278158, 
   null, 
   "lesz", 
   "And look, obviously not all gays see it the way you do, because there are out-of-the-closet gays IN the Republican party. The LCR for instance. So, it's not like reality bears out what you say.\n\n \n The LCR are in the Republican party -- the party of Karl Rove? Oooops, I mean Karl Rove's ex-party. Who knew? The GOP certainly hates to acknowledge the LCR are human, let alone Republican! :)", 
   {}, 
   278156, 
   null, 
   1187045460.0
  ], 
  [
   278161, 
   null, 
   "foundit66", 
   "Any site that conflicts with your liberal perspective is seen as a fundie site Jo.\n\n \n Archie, you DID quote from a fundie site.\n \n From the base web-site, in ITS OWN WORDS:Tradition In Action is committed to defend the perennial Magisterium of Holy Mother Church and Catholic traditions. TIA also works for a restoration of Christian civilization, adapted to contemporary historical circumstances. http://www.traditioninaction.org/\n \n Now riddle me this Archie.\n Are you going to try and claim that it is not a fundie site?\n Or are you just obfuscating like usual? emoticon_rolleyes", 
   {}, 
   278148, 
   null, 
   1187048400.0
  ], 
  [
   278163, 
   null, 
   "Archangel", 
   "It's actually not a fundie site, it is a Catholic site, Tradition in action.\n\n \n See, I told you it wasn't a fundie site. emoticon_xgood", 
   {}, 
   278151, 
   null, 
   1187049180.0
  ], 
  [
   278165, 
   null, 
   "Jo Bennett", 
   "See, I told you it wasn't a fundie site. emoticon_xgood\n\n \n Because of course there aren't any fundamentalist catholics... emoticon_rolleyes I reckon you could find fundamentalist Muslims and Jews who'd agree too.", 
   {}, 
   278163, 
   null, 
   1187049600.0
  ], 
  [
   278166, 
   null, 
   "foundit66", 
   "I was making a point. Clearly you were trying to use this incident to infer something abut Republicans (when you really have no idea whether or not that anything whatsoever to do with it). If you can blithely use isolated incidents of corruption (which happen with Dems too sometimes) to try and say something about Republicans, the same twisted logic could be used over the fact he's gay.\n\n Actually, NO.\n You cannot, as I pointed out.\n Trying to infer something regarding \"gay\" being the causative factor would quickly reach a dead-end when you realize that being STRAIGHT IS MORE of an issue for the corruption at hand than being gay is.\n \n It's like trying to argue that A causes things to catch on fire, when the truth of the matter is that being B is more associated with things catching on fire than A is.\n \n I'm not sure why that is so difficult a concept for you.\n \n I gave an educated statement, based on sound reasoning.\n Your reply was flawed for an entirely different reason.\n \n \n \nYou want me to present a theory?? How about the simple possibility that he was the sort of person that tries to victimizes people in their sleep? We couldn't possibly entertain THAT idea, now could we? You're just wanting to create some dots to connect over him having an \"(R)\" by his name.\n\n Actually, no.\n If I need to make it plain for you, it's not the \"(R)\" by his name which is the factor, but something the \"(R)\"s have in common.\n \n It's like a lot of group A having a fondness for chili. Moreso than group B.\n Being in group A doesn't cause group A to have more gas. It's the CHILI that gives them more gas.\n Likewise, it's not the REPUBLICANISM that causes such distress, but the predilection for being anti-gay that causes the internal stress in gays who want to be republican and gay.\n \n If the Republicans weren't so anti-gay, it wouldn't be a problem!\n Get it?\n \n \n \nBut you don't seem content to stop there. You seem to want to infer they are a party of rapists, given this very thread. That's more to the point here.\n\n I inferred no such thing.\n Can you quote what I said which inferred that?\n \n \n \nIt depends on the other issues too.\n\n I forgot to add on the finale.\n They agree with you on EVERY OTHER ISSUE around.\n Would you be content to see such a group in power, realizing that they could very well adopt amendments to discriminate against Christianity?\n (Obviously for this question to pose any reality, your rights and privileges would have to be completely open to discrimination, so the first amendment is moot.)\n \n \n \nMost people aren't a one-issue voter, Foundit. Maybe you are. But most aren't.\n\n I've got plenty of issues I disagree with Republicans on.\n But the point is that the difference between the Republican homophobia and the Democrat's support for gays is so vast, that it cannot be seen as just \"one-issue\" when it is just so CENTRAL to the person's life.\n \n I mean, we're talking about actions that DIRECTLY impact a person's life. Their ability to adopt, be employed without fear of sexual orientation discrimination, service in the military, and marital rights.\n \n Hardly just \"one issue\", unless you're on the other side of the stick who has never had to worry about ANY of the issues that are at hand...\n \n \n \nAnd look, obviously not all gays see it the way you do, because there are out-of-the-closet gays IN the Republican party. The LCR for instance. So, it's not like reality bears out what you say.\n\n Say whaaa?\n How does the existence of the Log Cabin Republicans refute what I said?\n And please actually QUOTE what I said that is refuted by the existence of the Log Cabin Republicans.\n It seems you just got lost and reached a conclusion that does not bear out reality...\n \n \n \nWell, you can eat you own words, because I just did.\n\n ROFLMAO!\n Actually, NO.\n You did not Jyoshu.\n You did not say whether or not you would vote for them.\n \"It depends...\" is hardly an answer, unless you're a politician attempting to avoid the answer...\n \n \n \nSo if one party denies you equality, but the other party's policies may deny your very safety and livelihood, you'd still pick the first one? \n\n No.\n Nothing I said would lead any rational thinking person to think that I would still pick the first one.\n \n Quit with the strawman arguments already...\n \n \n \nML King Jr.??? You give yourself WAY too much credit, Foundit.\n\n hahaha.\n I was in no way suggesting a comparison between myself and MLK.\n I was simply answering your question, and giving you a good example of WHY people march.\n \n \n \nNo, I'm like the white man who has enough sense to know that republicans don't equate to rapists.\n\n Well, that's another strawman argument as I wasn't claiming they equate to rapists.\n Why do you spend so much time jousting at arguments nobody actually uttered?\n \n \n \nRemember, that WAS the issue here--the fact you tried to make a connection with him being part of the GOP and committing a sexual crime.\n\n Actually, NO. I did not.\n The relationship, since I obviously have to draw a map for you, is between the extreme type of self-denial and self-induced emotion that causes a person to deny who they truly are, and lead them to act out in secret.\n \n If I were trying to make a connection between the GOP and committing sexual crimes, I would have lead with this web-site, which has a long list of examples.\n http://www.armchairsubversive.org/\n \n A little scary looking at it really...\n \n \n \nI know you'd prefer to try and defend something more easily defensible by moving to a subject that you can be the victim, but I'm not going to let you off the hook so easily.\n\n This coming from the guy who just tried to claim that I was arguing that being a part of the GOP causes sexual crime?\n I swear. There HAS to be some reflective surface around as you type that stuff...", 
   {}, 
   278158, 
   null, 
   1187049840.0
  ], 
  [
   281023, 
   null, 
   "samiinh", 
   "Sen. Larry Craig (R-Idaho) was arrested in June at a Minnesota\n airport by a plainclothes police officer investigating lewd conduct\n complaints in a men's public restroom, according to an arrest report\n obtained by Roll Call Monday afternoon.\n \n Craig's arrest occurred just after noon on June 11 at\n Minneapolis-St. Paul International Airport. On Aug. 8, he pleaded\n guilty to misdemeanor disorderly conduct in the Hennepin County\n District Court. He paid more than $500 in fines and fees, and a\n 10-day jail sentence was stayed. He also was given one year of\n probation with the court that began on Aug. 8.\n \n A spokesman for Craig described the incident as a \"he said/he said\n misunderstanding,\" and said the office would release a fuller\n statement later Monday afternoon.\n \n After he was arrested, Craig, who is married, was taken to the\n Airport Police Operations Center to be interviewed about the lewd\n conduct incident, according to the police report. At one point\n during the interview, Craig handed the plainclothes sergeant who\n arrested him a business card that identified him as a U.S. Senator\n and said, \"What do you think about that?\" the report states. [...]\n \n According to the incident report, Sgt. Dave Karsnia was working as a\n plainclothes officer on June 11 investigating civilian complaints\n regarding sexual activity in the men's public restroom in which\n Craig was arrested.\n \n Airport police previously had made numerous arrests in the men's\n restroom of the Northstar Crossing in the Lindbergh Terminal in\n connection with sexual activity.", 
   {
    "post_info": {
     "post_title": "Here's Another One!"
    }
   }, 
   278166, 
   null, 
   1188258660.0
  ], 
  [
   281045, 
   null, 
   "chemist99a", 
   "Its obviously a smear effort instituted by Minnesota democrats.", 
   {}, 
   281023, 
   null, 
   1188261720.0
  ], 
  [
   281054, 
   null, 
   "Easyrider", 
   "Sen. Larry Craig (R-Idaho) was arrested in June at a Minnesota\n airport by a plainclothes police officer investigating lewd conduct\n complaints in a men's public restroom, according to an arrest report\n obtained by Roll Call Monday afternoon.\n \n Craig's arrest occurred just after noon on June 11 at\n Minneapolis-St. Paul International Airport. On Aug. 8, he pleaded\n guilty to misdemeanor disorderly conduct in the Hennepin County\n District Court. He paid more than $500 in fines and fees, and a\n 10-day jail sentence was stayed. He also was given one year of\n probation with the court that began on Aug. 8.\n \n A spokesman for Craig described the incident as a \"he said/he said\n misunderstanding,\" and said the office would release a fuller\n statement later Monday afternoon.\n \n After he was arrested, Craig, who is married, was taken to the\n Airport Police Operations Center to be interviewed about the lewd\n conduct incident, according to the police report. At one point\n during the interview, Craig handed the plainclothes sergeant who\n arrested him a business card that identified him as a U.S. Senator\n and said, \"What do you think about that?\" the report states. [...]\n \n According to the incident report, Sgt. Dave Karsnia was working as a\n plainclothes officer on June 11 investigating civilian complaints\n regarding sexual activity in the men's public restroom in which\n Craig was arrested.\n \n Airport police previously had made numerous arrests in the men's\n restroom of the Northstar Crossing in the Lindbergh Terminal in\n connection with sexual activity.\n\n \n Study up on what one of your vaunted \"intellectuals\" did:\n \n http://www.usdoj.gov/opa/pardonchartlst.htm\n \n LOL!", 
   {}, 
   281023, 
   null, 
   1188262560.0
  ], 
  [
   281058, 
   null, 
   "JSDKoeln", 
   "Study up on what one of your vaunted \"intellectuals\" did:\n \n http://www.usdoj.gov/opa/pardonchartlst.htm\n \n LOL!\n\n \n IRAQ emoticon_xkill", 
   {}, 
   281054, 
   null, 
   1188262800.0
  ], 
  [
   281063, 
   null, 
   "samiinh", 
   "Study up on what one of your vaunted \"intellectuals\" did:\n \n http://www.usdoj.gov/opa/pardonchartlst.htm\n \n LOL!\n\n \n Did you have a point? Clinton's pardons have nothing to do with Republiperv behavior.", 
   {}, 
   281054, 
   null, 
   1188263160.0
  ], 
  [
   281068, 
   null, 
   "Easyrider", 
   "IRAQ emoticon_xkill\n\n \n Surrender at any cost\n \n Hillary Clinton is on record as saying that once she's President (never happen), she would assure that U.S. forces would promptly leave Iraq. Then she flip-flopped and said it would take more time. Other surrender artists from the far left don't have that much patience - they want out now. Like yesterday. Get a new plan, Stan. And set yourself free. APPEASE THAT EVIL! \n \n Sounds real chic. End the bloodshed, or so they believe. \n \n But would it really? We all saw what happened with the 'Killing Fields' after our exit from the Republic of Vietnam. Between one and two million individuals butchered. Terror reigned supreme. The systematic slaughter of innocents actually intensified. When anti-war activist Jane Fonda was reminded about that, her knee-jerk reply was that it was all America's fault to begin with. Sure, Jane. Blame America first. It's like Tourette's Syndrome with them. They can't help it. Out it comes, automatically. Apparently Fonda and the far left are unaware that the communists were slaughtering the South Vietnamese and others long before we ever arrived. One has to marvel at their brand of twisted logic. \n \n The United States has a significant interest in a stable and democratic Iraq. For one thing, a stable Iraq is not an open breeding ground for terrorism. With democratic Afghanistan on the other side, fundamentalist Iran finds itself sandwiched between two fledging democracies. That tends to put a damper, if only a limited one, on Iran's voracious appetite for the export of arms and terrorism. Second, it is becoming increasingly apparent in many Iraqi communities that neither the Sunnis or Shiites are particularly enamored with the blood-thirsty totalitarianism of Al Queda and Taliban fundamentalists. More and more, Iraqi citizens are either turning these extremists in to coalition forces or taking these thugs to task themselves at the muzzle point of an AK-47. The United States would have another partner in freedom. Once people have a taste of freedom, totalitarianism becomes an affront to the human spirit. \n \n But the main question for Mrs. Clinton, Harry Reid, and the other left-wing surrender artists is, what happens in Iraq and the region should the U.S. prematurely depart? If you think Iraq is a bloodbath now, just wait and see what happens next. The Killing Fields will be back with a vengeance. With Iran backing Al Sadr and other like-minded murderers, the Iraqi government would likely disintegrate within a matter of months. Anyone who ever backed coalition forces would be hunted down like the Jews under Adolph Hitler. The lucky ones who do survive would find themselves in fundamentalist \"reeducation\" camps until their views coincided with those of their supremacist slave masters. Nor would the Kurds escape. Their way of life is over too. Once that holocaust ends, and it will go on for quite some time, then you are left with pro-terrorist nations Iran, Iraq, and Syria dominating the Middle East, and very likely the Persian Gulf. Who then will be next? And there will be a \"next.\" Very likely, Saudi Arabia and, most certainly, Israel. Then any Arab or Muslim country with a non-fundamentalist government. You can count on it. The whole region would become a breeding ground for the export of terror and fundamentalism. \n \n And then the vicious circle of far-left liberal statesmanship will become complete. They will once again go back to the impotent U.N. for assistance. Calls for sanctions will once more abound. More senators and statesmen will give blustery speeches. And more long-winded rhetoric and half-baked condemnations will again be meted out, first at Bush and the U.S. for letting this happen, and then at anyone else left standing. This time, though, they'll be showing up at the U.N. on their bicycles, because Middle East oil will be at a serious premium, if available at all. And that's as far as it will all go. That's as far as it ever goes with them. Once the liberals are done at the U.N. - after all the calls for sanctions and bleeding-heart admonitions to play nice are duly pontificated; after their patented appeasement resolutions are passed, and after the bad guys still haven't budged one inch - it's over. Finis. End of story. That's all there is from the libs - there isn't any more. Not even a massive dose of Viagra can get them to stand strong now. The far left crowd doesn't have the stomach for the true cost of freedom. Had they been at Valley Forge they would have packed it in in a San Francisco heartbeat and they'd all be speaking the King's English today. Nope, all that's left is for them to go home, wring their hands, and wait for Osama and Company to eventually come calling. And they will. You can count on it.", 
   {
    "unicode_changes_made": true
   }, 
   281058, 
   null, 
   1188263580.0
  ], 
  [
   281073, 
   null, 
   "samiinh", 
   "Surrender at any cost\n \n Hillary Clinton is on record as saying that once she's President (never happen), she would assure that U.S. forces would promptly leave Iraq. Then she flip-flopped and said it would take more time. Other surrender artists from the far left don't have that much patience - they want out now. Like yesterday. Get a new plan, Stan. And set yourself free. APPEASE THAT EVIL! \n \n Sounds real chic. End the bloodshed, or so they believe. \n \n But would it really? We all saw what happened with the 'Killing Fields' after our exit from the Republic of Vietnam. Between one and two million individuals butchered. Terror reigned supreme. The systematic slaughter of innocents actually intensified. When anti-war activist Jane Fonda was reminded about that, her knee-jerk reply was that it was all America's fault to begin with. Sure, Jane. Blame America first. It's like Tourette's Syndrome with them. They can't help it. Out it comes, automatically. Apparently Fonda and the far left are unaware that the communists were slaughtering the South Vietnamese and others long before we ever arrived. One has to marvel at their brand of twisted logic. \n \n The United States has a significant interest in a stable and democratic Iraq. For one thing, a stable Iraq is not an open breeding ground for terrorism. With democratic Afghanistan on the other side, fundamentalist Iran finds itself sandwiched between two fledging democracies. That tends to put a damper, if only a limited one, on Iran's voracious appetite for the export of arms and terrorism. Second, it is becoming increasingly apparent in many Iraqi communities that neither the Sunnis or Shiites are particularly enamored with the blood-thirsty totalitarianism of Al Queda and Taliban fundamentalists. More and more, Iraqi citizens are either turning these extremists in to coalition forces or taking these thugs to task themselves at the muzzle point of an AK-47. The United States would have another partner in freedom. Once people have a taste of freedom, totalitarianism becomes an affront to the human spirit. \n \n But the main question for Mrs. Clinton, Harry Reid, and the other left-wing surrender artists is, what happens in Iraq and the region should the U.S. prematurely depart? If you think Iraq is a bloodbath now, just wait and see what happens next. The Killing Fields will be back with a vengeance. With Iran backing Al Sadr and other like-minded murderers, the Iraqi government would likely disintegrate within a matter of months. Anyone who ever backed coalition forces would be hunted down like the Jews under Adolph Hitler. The lucky ones who do survive would find themselves in fundamentalist \"reeducation\" camps until their views coincided with those of their supremacist slave masters. Nor would the Kurds escape. Their way of life is over too. Once that holocaust ends, and it will go on for quite some time, then you are left with pro-terrorist nations Iran, Iraq, and Syria dominating the Middle East, and very likely the Persian Gulf. Who then will be next? And there will be a \"next.\" Very likely, Saudi Arabia and, most certainly, Israel. Then any Arab or Muslim country with a non-fundamentalist government. You can count on it. The whole region would become a breeding ground for the export of terror and fundamentalism. \n \n And then the vicious circle of far-left liberal statesmanship will become complete. They will once again go back to the impotent U.N. for assistance. Calls for sanctions will once more abound. More senators and statesmen will give blustery speeches. And more long-winded rhetoric and half-baked condemnations will again be meted out, first at Bush and the U.S. for letting this happen, and then at anyone else left standing. This time, though, they'll be showing up at the U.N. on their bicycles, because Middle East oil will be at a serious premium, if available at all. And that's as far as it will all go. That's as far as it ever goes with them. Once the liberals are done at the U.N. - after all the calls for sanctions and bleeding-heart admonitions to play nice are duly pontificated; after their patented appeasement resolutions are passed, and after the bad guys still haven't budged one inch - it's over. Finis. End of story. That's all there is from the libs - there isn't any more. Not even a massive dose of Viagra can get them to stand strong now. The far left crowd doesn't have the stomach for the true cost of freedom. Had they been at Valley Forge they would have packed it in in a San Francisco heartbeat and they'd all be speaking the King's English today. Nope, all that's left is for them to go home, wring their hands, and wait for Osama and Company to eventually come calling. And they will. You can count on it.\n\n \n What does your rant have to do with Repulicipervs who get caught with their pants down?", 
   {
    "unicode_changes_made": true
   }, 
   281068, 
   null, 
   1188263820.0
  ], 
  [
   281074, 
   null, 
   "Easyrider", 
   "Did you have a point? Clinton's pardons have nothing to do with Republiperv behavior.\n\n \n They have an awful lot to do with Democrat behavior. Sorry you missed it.", 
   {}, 
   281063, 
   null, 
   1188263880.0
  ], 
  [
   281075, 
   null, 
   "samiinh", 
   "They have an awful lot to do with Democrat behavior. Sorry you missed it.\n\n \n Oh, you just wait until Bush leaves office. He'll have many corrupt members of his administration, like Scooter Libbey, to pardon. Just like his daddy did.", 
   {}, 
   281074, 
   null, 
   1188264000.0
  ], 
  [
   281080, 
   null, 
   "samiinh", 
   "Republican Hypocrisy Revealed\n \n \n \n http://www.armchairsubversive.org/\n \n (Isn't the web great...you can find anything you want.)", 
   {}, 
   281075, 
   null, 
   1188264420.0
  ], 
  [
   281081, 
   null, 
   "chemist99a", 
   "Your material is getting funnier and funnier. You should be able to do standup any day nowemoticon_xhoho \n \n \nSurrender at any cost\n \n Hillary Clinton is on record as saying that once she's President (never happen), she would assure that U.S. forces would promptly leave Iraq. Then she flip-flopped and said it would take more time. Other surrender artists from the far left don't have that much patience - they want out now. Like yesterday. Get a new plan, Stan. And set yourself free. APPEASE THAT EVIL!\n\n \n But you know you are joking around with peoples lives here and somehow thats not as funny as you think. By the way just who would we be surrendering to in Iraq? The Maliki government? The shitte militias? The sunni miltias? Nope they are both anti- Al Queda and will gladly shoot the buggers. Indeed the sunni are getting US help in doing so! To Iran perhaps? How so we wanted the Iraquis to have a democracy and they can choose to be an Iranian ally if they wish - or do you want to deny them soveringty? Saddam Hussein? Nope hes dead! Osoma Bin Laden? Nope hes NOT in Iraq and he never attacked us from there. Indeed SH was his enemy! Syria? Nope Iraq will hold them back on its own - they are not allies now. Turkey - oops they are OUR allies. The former Soviet Union - oops thats off the table! Russia? What kind of fools do you think they are? There is simply nobody to surrender to! What we would like to avoid is an intense bloody (but probably short) civil war within Iraq among the various factions. But what we are getting is simply a longer version of the same thing in which US troops stand between the warring parties and slow the process. But we only slow it not stop it and as a result WE bleed slowly to death along with the Iraquis. Our troops deserve better, our nation desrves better, and the Iraquis deserve each other.", 
   {
    "unicode_changes_made": true
   }, 
   281074, 
   null, 
   1188264660.0
  ], 
  [
   281093, 
   null, 
   "richbrmly", 
   "Surrender at any cost\n \n Hillary Clinton is on record as saying that once she's President (never happen), she would assure that U.S. forces would promptly leave Iraq. Then she flip-flopped and said it would take more time. Other surrender artists from the far left don't have that much patience - they want out now. Like yesterday. Get a new plan, Stan. And set yourself free. APPEASE THAT EVIL! \n \n Sounds real chic. End the bloodshed, or so they believe. \n \n But would it really? We all saw what happened with the 'Killing Fields' after our exit from the Republic of Vietnam. Between one and two million individuals butchered. Terror reigned supreme. The systematic slaughter of innocents actually intensified. When anti-war activist Jane Fonda was reminded about that, her knee-jerk reply was that it was all America's fault to begin with. Sure, Jane. Blame America first. It's like Tourette's Syndrome with them. They can't help it. Out it comes, automatically. Apparently Fonda and the far left are unaware that the communists were slaughtering the South Vietnamese and others long before we ever arrived. One has to marvel at their brand of twisted logic. \n \n The United States has a significant interest in a stable and democratic Iraq. For one thing, a stable Iraq is not an open breeding ground for terrorism. With democratic Afghanistan on the other side, fundamentalist Iran finds itself sandwiched between two fledging democracies. That tends to put a damper, if only a limited one, on Iran's voracious appetite for the export of arms and terrorism. Second, it is becoming increasingly apparent in many Iraqi communities that neither the Sunnis or Shiites are particularly enamored with the blood-thirsty totalitarianism of Al Queda and Taliban fundamentalists. More and more, Iraqi citizens are either turning these extremists in to coalition forces or taking these thugs to task themselves at the muzzle point of an AK-47. The United States would have another partner in freedom. Once people have a taste of freedom, totalitarianism becomes an affront to the human spirit. \n \n But the main question for Mrs. Clinton, Harry Reid, and the other left-wing surrender artists is, what happens in Iraq and the region should the U.S. prematurely depart? If you think Iraq is a bloodbath now, just wait and see what happens next. The Killing Fields will be back with a vengeance. With Iran backing Al Sadr and other like-minded murderers, the Iraqi government would likely disintegrate within a matter of months. Anyone who ever backed coalition forces would be hunted down like the Jews under Adolph Hitler. The lucky ones who do survive would find themselves in fundamentalist \"reeducation\" camps until their views coincided with those of their supremacist slave masters. Nor would the Kurds escape. Their way of life is over too. Once that holocaust ends, and it will go on for quite some time, then you are left with pro-terrorist nations Iran, Iraq, and Syria dominating the Middle East, and very likely the Persian Gulf. Who then will be next? And there will be a \"next.\" Very likely, Saudi Arabia and, most certainly, Israel. Then any Arab or Muslim country with a non-fundamentalist government. You can count on it. The whole region would become a breeding ground for the export of terror and fundamentalism. \n \n And then the vicious circle of far-left liberal statesmanship will become complete. They will once again go back to the impotent U.N. for assistance. Calls for sanctions will once more abound. More senators and statesmen will give blustery speeches. And more long-winded rhetoric and half-baked condemnations will again be meted out, first at Bush and the U.S. for letting this happen, and then at anyone else left standing. This time, though, they'll be showing up at the U.N. on their bicycles, because Middle East oil will be at a serious premium, if available at all. And that's as far as it will all go. That's as far as it ever goes with them. Once the liberals are done at the U.N. - after all the calls for sanctions and bleeding-heart admonitions to play nice are duly pontificated; after their patented appeasement resolutions are passed, and after the bad guys still haven't budged one inch - it's over. Finis. End of story. That's all there is from the libs - there isn't any more. Not even a massive dose of Viagra can get them to stand strong now. The far left crowd doesn't have the stomach for the true cost of freedom. Had they been at Valley Forge they would have packed it in in a San Francisco heartbeat and they'd all be speaking the King's English today. Nope, all that's left is for them to go home, wring their hands, and wait for Osama and Company to eventually come calling. And they will. You can count on it.\n\n \n Typical spin.. Completely false. \n \n The Killing Fields happened in Cambodia NOT Vietnam...In Fact, it was Vietnam that ended the horror. If we would have stayed Vietnam could not have saved the lives they safed. We would have been busy still shooting them. Spin central...and Lie\n \n Clinton never said rapid withdraw...nope. Its a good idea though since Al Qeada is the enemy and they'll be crushed 30 days after we leave. The shia militias are a thousand times larger and want to kill them.\n \n Oh and Osama is doing just fine. Better than ever. Last intel. est. has them larger than before and south america is in love with Osama.\n \n Its the stupid that gets me.", 
   {
    "unicode_changes_made": true
   }, 
   281068, 
   null, 
   1188267480.0
  ], 
  [
   281099, 
   null, 
   "Easyrider", 
   "Typical spin.. Completely false. \n \n The Killing Fields happened in Cambodia NOT Vietnam...In Fact, it was Vietnam that ended the horror. If we would have stayed Vietnam could not have saved the lives they safed. We would have been busy still shooting them. Spin central...and Lie\n\n \n You're still in the dark on this, I see. There's numerous accounts of the bloodbath in Vietnam after we left:\n \n http://jim.com/ChomskyLiesCites/When_we_knew_what_happened_in_Vietnam.htm\n \n And if the butchery never happened, why did Jane Fonda blame it on the Americans? \n \n \n (Hillary) Clinton never said rapid withdraw...nope.\n\n \n Depends on what you mean by rapid. \n \n http://www.sourcewatch.org/index.php?title=Hillary_Clinton:_U.S._presidential_election%2C_2008/On_the_war_in_Iraq", 
   {}, 
   281093, 
   null, 
   1188272160.0
  ], 
  [
   281110, 
   null, 
   "richbrmly", 
   "You're still in the dark on this, I see. There's numerous accounts of the bloodbath in Vietnam after we left:\n \n http://jim.com/ChomskyLiesCites/When_we_knew_what_happened_in_Vietnam.htm\n \n And if the butchery never happened, why did Jane Fonda blame it on the Americans? \n \n \n \n Depends on what you mean by rapid. \n \n http://www.sourcewatch.org/index.php?title=Hillary_Clinton:_U.S._presidential_election%2C_2008/On_the_war_in_Iraq\n\n \n The Khmer Rouge killed people if they didn't like them, if didn't work hard enough, if they were educated. He killed over 2 million men women and children.\n After the Vietnamese invaded and liberated the Cambodian people from the Khmer Rouge, 600,000 Cambodians fled to Thai border camps.\n \n Bush's argument is that we could have done something being next door in a war. No...hardly. We would have been busy.\n \n The boat people argument.. True 823,000 came to the U.S..\n \n 165,000 people died in the Socialist Republic of Vietnam's re-education camps.\n \n 350,000 casualties. U.S.\n 58,000 lives U.S.\n \n 2 million Vietnamese deaths\n \n Th math says it was a smart move to stop the war.", 
   {
    "unicode_changes_made": true
   }, 
   281099, 
   null, 
   1188275280.0
  ], 
  [
   281138, 
   null, 
   "robbie0517", 
   "Ok, back on topic of Republican perverts... Here is the official police report-\n \n http://www.talkingpointsmemo.com/docs/craig-arrest-doc/\n \n Good Reading!", 
   {}, 
   281110, 
   null, 
   1188287820.0
  ], 
  [
   281140, 
   null, 
   "robbie0517", 
   "And here's some good commentary. I think that word \"hypocrite\" just might surface again. \n \n \n \nI have a certain sympathy for closeted gay men and lesbians. I think that being so deeply ashamed of a part of yourself that's so fundamental, and that you can do nothing to change, must be close to unbearable; and the knowledge that coming clean would involve not only admitting that you're gay, but also that you have lied for years to people you care about, and who trust you, would only make it that much worse. But my sympathy vanishes when it comes to people who support amending the Constitution to ban gay marriage, as Craig did. There are limits to what you get to do to protect your own secrets, and being willing to permanently destroy gay men and lesbians' chances to marry the people they love, and with whom they have found happiness, is way, way outside them.\n \n (For the record, I don't have much sympathy for straight people who support this idiotic and mean-spirited amendment either.)\n \n Craig seems to have made a habit of voting against laws that would secure the rights of gay men and lesbians. In addition to supporting the Constitutional amendment banning gay marriage, he voted against a bill that would have banned job discrimination on the basis of sexual orientation, against expanding the definition of hate crimes to include sexual orientation, and was rated zero by the Human Rights Campaign in each of the last three Congresses (1, 2, 3; all pdf.) I truly can't imagine what it would be like -- how little self-respect a person would have to have -- to amass that sort of voting record while cruising for gay sex in airport restrooms. \n \n And besides, if I had any sympathy for Larry Craig, the fact that he \"handed the plainclothes sergeant who arrested him a business card that identified him as a U.S. Senator and said, \"What do you think about that?\"\" would have destroyed it. The laws are meant to apply to everyone, Senators included. No one gets to violate laws he himself supports and then use the fact that he has been elected to high office to get himself off the hook. Being elected Senator means being given a position of trust and responsibility that you should work every day to be worthy of, not a Get Out Of Jail Free card.\n\n \n http://andrewsullivan.theatlantic.com/the_daily_dish/2007/08/larry-craig-hil.html", 
   {
    "unicode_changes_made": true
   }, 
   281138, 
   null, 
   1188288480.0
  ], 
  [
   281159, 
   null, 
   "richbrmly", 
   "The more I think about it, the more I believe the gay bashers need to keep their acts a perversion because they get more enjoyment out of it.\n \n I'm not gay, so the last thing I care about is the sexual appetite of a man. To busy wondering about women. Its the only link I can think of because, how can the acts of other men harm a man's marriage? I don't see the link.", 
   {}, 
   281140, 
   null, 
   1188305580.0
  ], 
  [
   281160, 
   null, 
   "samiinh", 
   "Larry Craig's sexuality has been questioned for years. He has a history of a very deep closet. Very sad, really.", 
   {}, 
   281159, 
   null, 
   1188305940.0
  ], 
  [
   281163, 
   null, 
   "richbrmly", 
   "Larry Craig's sexuality has been questioned for years. He has a history of a very deep closet. Very sad, really.\n\n \n How do you sexually aroused at the smell of deification and such? Its something I avoid with a passion and this man seeks it out because its erotic?? I don't think this is gay.\n \n I think Larry is a really sick man.", 
   {}, 
   281160, 
   null, 
   1188307200.0
  ], 
  [
   281218, 
   null, 
   "samiinh", 
   "Better To Be Thought A Fool\n by BC · 8/28/2007 02:48:00 PM ET\n Discuss this post here: Comments (42) · digg it · reddit · FARK · · Link\n \n I find the whole Larry Craig thing quite sad. It's sad for his family, for his constituents, but mostly, sad for Craig.\n \n Craig hates himself, and that is sad, no matter how you slice it. His explanations for the events in Minnesota are so ridiculous, they defy logic and credibility, even in Idaho:\n \n If Craig's actions in the restroom were misconstrued and he was not involved in any inappropriate conduct, as he said in a statement Monday, then why did he plead guilty?\n \n Craig says, in hindsight, he should not have pleaded guilty and \"should have had the advice of counsel in resolving this matter.\" On the surface, it seems implausible that any educated professional - much less an elected official - would face criminal proceedings without hiring an attorney.\n \n By putting out such ridiculous statements, Craig makes it obvious - he'd rather be thought of as an idiot than be thought of as gay. He hates his own orientation that much. How truly sad.", 
   {
    "unicode_changes_made": true
   }, 
   281163, 
   null, 
   1188338700.0
  ], 
  [
   281225, 
   null, 
   "richbrmly", 
   "Better To Be Thought A Fool\n by BC · 8/28/2007 02:48:00 PM ET\n Discuss this post here: Comments (42) · digg it · reddit · FARK · · Link\n \n I find the whole Larry Craig thing quite sad. It's sad for his family, for his constituents, but mostly, sad for Craig.\n \n Craig hates himself, and that is sad, no matter how you slice it. His explanations for the events in Minnesota are so ridiculous, they defy logic and credibility, even in Idaho:\n \n If Craig's actions in the restroom were misconstrued and he was not involved in any inappropriate conduct, as he said in a statement Monday, then why did he plead guilty?\n \n Craig says, in hindsight, he should not have pleaded guilty and \"should have had the advice of counsel in resolving this matter.\" On the surface, it seems implausible that any educated professional - much less an elected official - would face criminal proceedings without hiring an attorney.\n \n By putting out such ridiculous statements, Craig makes it obvious - he'd rather be thought of as an idiot than be thought of as gay. He hates his own orientation that much. How truly sad.\n\n \n I am sorry, it's far worse than that. He betrays his nature and his own brethren. By condemning what he is, clearly he's condemned himself.\n \n Maybe he feels all men of his nature deserve to suffer the same indignity having the life of a lie. False things are in nature; lizards with tails like heads. He's the lizard that forgot which was the tail and which was the head. He is going to have a very hard time confronting himself. Life becomes more than a man can bear when the mirror becomes his worst enemy.", 
   {
    "unicode_changes_made": true
   }, 
   281218, 
   null, 
   1188340620.0
  ], 
  [
   281246, 
   null, 
   "jyoshu", 
   "Larry Craig says, emphatically and publicly, that he's not gay. Why not take him at his word at least until all the facts come out? You'd certainly do so if he someone said they WERE gay, I suspect.\n \"Under fire from leaders of his own party, Idaho Sen. Larry Craig on Tuesday said the only thing he had done wrong was to plead guilty after a complaint of lewd conduct in a men's room. He declared, \"I am not gay. I never have been gay.\" \"I did nothing wrong at the Minneapolis airport,\" he said at a news conference with his wife, Suzanne, at his side. \n \n The senator issued a statement Monday night that said, \"In hindsight, I should have pled not guilty.\" He repeated that assertion at the Idaho news conference. \"In June, I overreacted and made a poor decision,\" he said. \"I chose to plead guilty to a lesser charge in hopes of making it go away.\" Craig was at times defiant, at others apologetic. \"Please let me apologize to my family, friends and staff and fellow Idahoans for the cloud placed over Idaho,\" he said. \"I did nothing wrong at the Minneapolis airport. I did nothing wrong, and I regret the decision to plead guilty and the sadness that decision has brought on my wife, on my family, friends, staff and fellow Idahoans.\" - http://www.breitbart.com/article.php?id=D8RA8QM81&show_article=1 \n People plead guilty all the time to avoid stiffer punishment if they feel they are going to lose a case, or to expedite a process. IOW, a guilty plea doesn't necessarily mean one did it, in reality. It just means one is legally saying they are guilty. And he's made it clear he now regrets the plea. (http://craig.senate.gov/releases/pr082707a.cfm)\n \n And again, I'm ever amazed at how there are such sharks out there (and here) eager to jump on situations like this. There is no guarantee this even has anything whatsoever to do with anyone being gay.", 
   {}, 
   281225, 
   null, 
   1188343080.0
  ], 
  [
   281266, 
   null, 
   "samiinh", 
   "Larry Craig says, emphatically and publicly, that he's not gay. Why not take him at his word at least until all the facts come out? You'd certainly do so if he someone said they WERE gay, I suspect.\n \"Under fire from leaders of his own party, Idaho Sen. Larry Craig on Tuesday said the only thing he had done wrong was to plead guilty after a complaint of lewd conduct in a men's room. He declared, \"I am not gay. I never have been gay.\" \"I did nothing wrong at the Minneapolis airport,\" he said at a news conference with his wife, Suzanne, at his side. \n \n The senator issued a statement Monday night that said, \"In hindsight, I should have pled not guilty.\" He repeated that assertion at the Idaho news conference. \"In June, I overreacted and made a poor decision,\" he said. \"I chose to plead guilty to a lesser charge in hopes of making it go away.\" Craig was at times defiant, at others apologetic. \"Please let me apologize to my family, friends and staff and fellow Idahoans for the cloud placed over Idaho,\" he said. \"I did nothing wrong at the Minneapolis airport. I did nothing wrong, and I regret the decision to plead guilty and the sadness that decision has brought on my wife, on my family, friends, staff and fellow Idahoans.\" - http://www.breitbart.com/article.php?id=D8RA8QM81&show_article=1 \n People plead guilty all the time to avoid stiffer punishment if they feel they are going to lose a case, or to expedite a process. IOW, a guilty plea doesn't necessarily mean one did it, in reality. It just means one is legally saying they are guilty. And he's made it clear he now regrets the plea. (http://craig.senate.gov/releases/pr082707a.cfm)\n \n And again, I'm ever amazed at how there are such sharks out there (and here) eager to jump on situations like this. There is no guarantee this even has anything whatsoever to do with anyone being gay.\n\n \n Larry's been assumed to be gay for years. He's always denied it, but those in the know know.", 
   {}, 
   281246, 
   null, 
   1188344820.0
  ], 
  [
   281269, 
   null, 
   "chemist99a", 
   "Well lets ask what he did. And what a decent defense lawyer might do with itl.\n \n 1) He peeked into a bathroom stall! Well you would not want to walk in on someone who forgot to lock the door would you?\n \n 2) He ran his hand along the base of the stall from his side. SO is that lewed or illegal or even solicitation? Who can say? Its just an action its not evidence of a crime.\n \n 3) His shod foot intruded into the adjacent stall. Well maybe he does have a wide stance? Maybe he was stretching his leg after a long flight? Thousands of other reasons. Does contacting someone elses foot by accident now constitute a crime?\n \n 4) He offered his card to the cop. OK thats certainly illegal isn't it. Don't bother to identify yourself in the future or you will be arrested and hauled away!!!!\n \n Frankly I suspect the cop was operating outside common sense here.", 
   {}, 
   281246, 
   null, 
   1188345000.0
  ], 
  [
   281271, 
   null, 
   "chemist99a", 
   "Larry's been assumed to be gay for years. He's always denied it, but those in the know know.\n\n \n Which of course has no bearing on his actual behavior in this specific instance. The state would have to prove (preponderance of the evidence burden of proof) that his actions were what the state charges them to be. Whether his is gay, bisexual, heterosexual, or non-sexual it matters not.", 
   {}, 
   281269, 
   null, 
   1188345180.0
  ], 
  [
   281275, 
   null, 
   "richbrmly", 
   "Larry Craig says, emphatically and publicly, that he's not gay. Why not take him at his word at least until all the facts come out? You'd certainly do so if he someone said they WERE gay, I suspect.\n \"Under fire from leaders of his own party, Idaho Sen. Larry Craig on Tuesday said the only thing he had done wrong was to plead guilty after a complaint of lewd conduct in a men's room. He declared, \"I am not gay. I never have been gay.\" \"I did nothing wrong at the Minneapolis airport,\" he said at a news conference with his wife, Suzanne, at his side. \n \n The senator issued a statement Monday night that said, \"In hindsight, I should have pled not guilty.\" He repeated that assertion at the Idaho news conference. \"In June, I overreacted and made a poor decision,\" he said. \"I chose to plead guilty to a lesser charge in hopes of making it go away.\" Craig was at times defiant, at others apologetic. \"Please let me apologize to my family, friends and staff and fellow Idahoans for the cloud placed over Idaho,\" he said. \"I did nothing wrong at the Minneapolis airport. I did nothing wrong, and I regret the decision to plead guilty and the sadness that decision has brought on my wife, on my family, friends, staff and fellow Idahoans.\" - http://www.breitbart.com/article.php?id=D8RA8QM81&show_article=1 \n People plead guilty all the time to avoid stiffer punishment if they feel they are going to lose a case, or to expedite a process. IOW, a guilty plea doesn't necessarily mean one did it, in reality. It just means one is legally saying they are guilty. And he's made it clear he now regrets the plea. (http://craig.senate.gov/releases/pr082707a.cfm)\n \n And again, I'm ever amazed at how there are such sharks out there (and here) eager to jump on situations like this. There is no guarantee this even has anything whatsoever to do with anyone being gay.\n\n \n You tell me. With regard to his stand on Gay issues. If he where so anti-gay as his votes have shown. Why would accept the crime for which he did? Most people I know with the same beliefs would rather be shot than admit to what he has admitted to. \n \n Its very odd an Anti-Gay activist would simply admit to such conduct, pay a fine and walk away. Most would be so mad they couldn't see straight. I know for myself, I wouldn't plead guilty to such an act. \n \n You are right though. Every man should get to defend himself. Admitting to it makes it hard though.", 
   {}, 
   281246, 
   null, 
   1188345420.0
  ], 
  [
   281276, 
   null, 
   "thelmoose", 
   "\n People plead guilty all the time to avoid stiffer punishment if they feel they are going to lose a case, or to expedite a process. IOW, a guilty plea doesn't necessarily mean one did it, in reality. It just means one is legally saying they are guilty. And he's made it clear he now regrets the plea. (http://craig.senate.gov/releases/pr082707a.cfm)\n \n\n \n \n US Senators don't plead guilty to a crime , 2 month after the arrest, on their own, without the advice of counsel, if they are innocent. It sounds like he, extremely stupidly, thought this could blow over without anyone ever noticing it, if he did this quickly and quietly. \n \n He should be put in jail for stupidity. \n \n You should read the police report of the event. This feller was looking for love in all the wrong places. He also tried to use his status as a Senator to see if he could intimidate the arresting officer. \n \n So are you generally of the opinion that most people who plead guilty to a lesser offense are NOT guilty?", 
   {}, 
   281246, 
   null, 
   1188345480.0
  ], 
  [
   281278, 
   null, 
   "chemist99a", 
   "The arresting officer was Dave Karsnia. I turned this up on his background.\n \n \n \nSgt. Dave Karsnia handles cart enforcement for the Metropolitan Airport Police.\n \n \"At what point do you say, 'Gosh, we might a problem here?'\" the I-TEAM asked.\n \n \"We know, like I said, we want to get that number down to zero,\" Karsnia replied.\n \n With 37 million passengers coming through every year, Karsnia says 62 accidents in four years is a low number.\n \n A company called G2 Secure operates all of Northwest's carts. G2 and Northwest both declined to be interviewed on camera, but say the carts provide a valuable service to travelers who need assistance.\n \n The cart company also says drivers are closely monitored and trained.\n \n The I-TEAM asked Karsnia, \"Do you think this company is doing a good job? Are they safe?\"\n \n \"We look at how they're driving as they're going through the terminal,\" Karsnia said. \"They are driving slow. They are watching out.\"\n \n", 
   {}, 
   281271, 
   null, 
   1188345840.0
  ], 
  [
   281284, 
   null, 
   "samiinh", 
   "Apparently, the police report says that the good senator stood outside the stall the officer was in, and stared into the stall in the space between the door and the wall for a full two minutes before he entered the stall next to the officer and started tapping his foot.", 
   {}, 
   281278, 
   null, 
   1188346920.0
  ], 
  [
   281308, 
   null, 
   "chemist99a", 
   "He should be put in jail for stupidity.\n \n\n \n Well perhaps, but if equal treatment is extended to all senators and representatives I fear that we would depopulate congress. And the executive branch if they were subject to the same rules. As well as a good part of the nations citizens.", 
   {}, 
   281284, 
   null, 
   1188353580.0
  ], 
  [
   281312, 
   null, 
   "robbie0517", 
   "Whenever you enter a plea wether it be in traffic court or a major felony your typicaly under oath when you say \"yes I did it give me a break\" you can generally get a plea agreement. \n \n There are several things on the plea agreement including\n 1. I have reviewed the arrest report\n 2. I understand the charges\n 3. I now make no claim that I am innocent of the charge\n And Senator Craig SIGNED it. \n \n He made hand getures and stared through the stall door crack for a good 2 minutes. So much so that the cop could see his blue eyes. \n He went into the stall next to the cop and made well known gestures indicating his desire for sex such as tapping his foot, moving his foot into the next stall, even up against the cops foot. Gesturing with his hand under the stall wall more than once. \n \n Then when busted. He lied. He said that he was picking up a peice of paper off the bathrom floor, where there was NO paper on the floor. Saying he has a wide stance IMO would not put your foot so far over as to actually touch the guys shoe in the next stall. \n \n He was accused back in 1982 of abusing congressional pages. He denied. \n \n Now, there is soon to be released, according to MSNBC, a recorded testimony relating to allegations in May from a man who said he and Craig engaged in sex at a men's bathroom in Washington, D.C.'s Union Station. \n \n Another man claimed Craig eyed him up during a half-hour cat and mouse chase in a Boise, Idaho, store in 1994.\n \n He is on Michael Rogers blog that outs senators and congressmen and his name has been on the list for a very long time. \n \n This man is simply so far in the closet that he has to resort to these types of tactics in order to fulfill his true desires. \n \n This man IS gay, there is no doubt in my mind. Very closeted, but very gay. \n Being gay is not the problem, it's his anti-gay voting habit trying to make the rest of us just as miserable as he is. \n \n Those of us that are out and not repressed, wouldn't be caught dead engaging in this type of behavior.", 
   {}, 
   281284, 
   null, 
   1188354900.0
  ], 
  [
   281314, 
   null, 
   "chemist99a", 
   "This man IS gay, there is no doubt in my mind. Very closeted, but very gay.\n Being gay is not the problem, it's his anti-gay voting habit trying to make the rest of us just as miserable as he is. \n\n \n And now society is going to justify his fear which made him hide his sexuality! Now thats a good idea isn't it? And is not voting against even his own interests just indicative of how deep that fear goes? The solution of course is to change society so that one will not have to fear being what one is.", 
   {}, 
   281312, 
   null, 
   1188355440.0
  ], 
  [
   281316, 
   null, 
   "robbie0517", 
   "And now society is going to justify his fear which made him hide his sexuality! Now thats a good idea isn't it? And is not voting against even his own interests just indicative of how deep that fear goes? The solution of course is to change society so that one will not have to fear being what one is.\n\n \n Certainly society will now make him realize his worst fears. I don't think it will be for being gay however, I think it will be for being a nasty pervert. \n \n Of course changing societies views towards gays would put a stop to many of these men feeling as though they must disguise their life with a wife and children and continue digging deeper and deeper into their closet. If society were open to gays, this wouldn't be necessary nor would it be necessary for gay men to prowl around in bathroom stalls to try to \"get some\" for lack of a better term.", 
   {}, 
   281314, 
   null, 
   1188355860.0
  ], 
  [
   281325, 
   null, 
   "richbrmly", 
   "I am for less hypocrisy. Don't say one thing and do another. That's at the heart of this. The man's actions are rude clearly, and he has paid for his actions in full measure. What he did wrong is forgiven by the state. \n \n The issue is how his actions defy his words and power. He preaches from the place where law in born into our land. He creates the laws our families must live by. \n \n If he writes a law that chains 'we the people', then isn't reasonable 'we the people' have him live by laws he creates? I think he paid his due on the crime; the crime has no meaning anymore to me. But the words and deeds are uneven.\n \n We should expect a man to live by the limits he forces the masses to accept. I could care less what the party is. Both parties have issues clearly. This is what's so upsetting to me.\n \n If a Democrat writes a law that forces us to buy high mileage cars, they had better be chained to the same law. It's the hypocrisy of both parties that we should address and address at the voting booth.", 
   {
    "unicode_changes_made": true
   }, 
   281316, 
   null, 
   1188357480.0
  ], 
  [
   281361, 
   null, 
   "JSDKoeln", 
   "I am for less hypocrisy. Don't say one thing and do another. That's at the heart of this. The man's actions are rude clearly, and he has paid for his actions in full measure. What he did wrong is forgiven by the state. \n \n The issue is how his actions defy his words and power. He preaches from the place where law in born into our land. He creates the laws our families must live by. \n \n If he writes a law that chains 'we the people', then isn't reasonable 'we the people' have him live by laws he creates? I think he paid his due on the crime; the crime has no meaning anymore to me. But the words and deeds are uneven.\n \n We should expect a man to live by the limits he forces the masses to accept. I could care less what the party is. Both parties have issues clearly. This is what's so upsetting to me.\n \n If a Democrat writes a law that forces us to buy high mileage cars, they had better be chained to the same law. It's the hypocrisy of both parties that we should address and address at the voting booth.\n\n \n As a straight man, you are seeing the hypocracy that we gay people experience all too often with our elected officials. There will always be politicians in this world but the fact remains that many of these people are incredibly corrupt--blinded by power and money. These are the same types of people that impeached a president for not wanting to share about getting a BJ in the whitehouse which, in turn, wasted millions of dollars on a frivilous lawsuit and stopped our president from doing is job that \"we the people\" elected him to do. (Then several of his accusers were caught with their pants down having extra-marital affairs.) These are the people that brought us IRAQ and all the lies that carried with it... (and how many dead now, latest estimates 300-665 HUNDRED thousand?) Yes, corruption is on both sides of the aisle, but I think the Right has fallen into that world much deeper than the Left. So much for the party of the \"moral\" majority. \n \n It's why I don't trust the \"christian\" right. I'm skeptical of the \"liberal\" left. I wouldn't call them both \"evil\". The left is a little confused. The Right has been hijacked by this type of christian hypocracy. I'm sure there are good Repubs out there; however, they are in the minority at this point.", 
   {
    "unicode_changes_made": true
   }, 
   281325, 
   null, 
   1188380100.0
  ], 
  [
   281372, 
   null, 
   "Matthew S", 
   "Whenever you enter a plea wether it be in traffic court or a major felony your typicaly under oath when you say \"yes I did it give me a break\" you can generally get a plea agreement. \n \n There are several things on the plea agreement including\n 1. I have reviewed the arrest report\n 2. I understand the charges\n 3. I now make no claim that I am innocent of the charge\n And Senator Craig SIGNED it. \n \n He made hand getures and stared through the stall door crack for a good 2 minutes. So much so that the cop could see his blue eyes. \n He went into the stall next to the cop and made well known gestures indicating his desire for sex such as tapping his foot, moving his foot into the next stall, even up against the cops foot. Gesturing with his hand under the stall wall more than once. \n \n Then when busted. He lied. He said that he was picking up a peice of paper off the bathrom floor, where there was NO paper on the floor. Saying he has a wide stance IMO would not put your foot so far over as to actually touch the guys shoe in the next stall. \n \n He was accused back in 1982 of abusing congressional pages. He denied. \n \n Now, there is soon to be released, according to MSNBC, a recorded testimony relating to allegations in May from a man who said he and Craig engaged in sex at a men's bathroom in Washington, D.C.'s Union Station. \n \n Another man claimed Craig eyed him up during a half-hour cat and mouse chase in a Boise, Idaho, store in 1994.\n \n He is on Michael Rogers blog that outs senators and congressmen and his name has been on the list for a very long time. \n \n This man is simply so far in the closet that he has to resort to these types of tactics in order to fulfill his true desires. \n \n This man IS gay, there is no doubt in my mind. Very closeted, but very gay. \n Being gay is not the problem, it's his anti-gay voting habit trying to make the rest of us just as miserable as he is. \n \n Those of us that are out and not repressed, wouldn't be caught dead engaging in this type of behavior.\n\n \n \n They don't understand that their closets will not be protected anymore. There was a time when it was gay etiquette not to out someone. Well those days are over if they work to harm the rest of us that live openly.", 
   {}, 
   281312, 
   null, 
   1188384720.0
  ], 
  [
   281381, 
   null, 
   "samiinh", 
   "Craig's TV appearance last night added to the impression that he is a liar.", 
   {}, 
   281372, 
   null, 
   1188389040.0
  ], 
  [
   281387, 
   null, 
   "richbrmly", 
   "As a straight man, you are seeing the hypocracy that we gay people experience all too often with our elected officials. There will always be politicians in this world but the fact remains that many of these people are incredibly corrupt--blinded by power and money. These are the same types of people that impeached a president for not wanting to share about getting a BJ in the whitehouse which, in turn, wasted millions of dollars on a frivilous lawsuit and stopped our president from doing is job that \"we the people\" elected him to do. (Then several of his accusers were caught with their pants down having extra-marital affairs.) These are the people that brought us IRAQ and all the lies that carried with it... (and how many dead now, latest estimates 300-665 HUNDRED thousand?) Yes, corruption is on both sides of the aisle, but I think the Right has fallen into that world much deeper than the Left. So much for the party of the \"moral\" majority. \n \n It's why I don't trust the \"christian\" right. I'm skeptical of the \"liberal\" left. I wouldn't call them both \"evil\". The left is a little confused. The Right has been hijacked by this type of christian hypocracy. I'm sure there are good Repubs out there; however, they are in the minority at this point.\n\n \n IF we have the higher moral ground as I'm sure we do, we must keep our own house clean. Do what we say and say what we do. We have Vietnam on our party, not the Republican party. As far as forcing religious believes, going to war to prevent people from selecting communism is the same animal.", 
   {}, 
   281361, 
   null, 
   1188395820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Young GOP leader accused in gay sex crime", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10225-young-gop-leader-accused-gay-sex-crime.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10225, 
  "discussion_files": [
   [
    "23736.html", 
    "http://www.4forums.com/political/gay-rights-debates/10225-young-gop-leader-accused-gay-sex-crime-print.html"
   ], 
   [
    "23737.html", 
    "http://www.4forums.com/political/gay-rights-debates/10225-young-gop-leader-accused-gay-sex-crime-7-print.html"
   ], 
   [
    "23738.html", 
    "http://www.4forums.com/political/gay-rights-debates/10225-young-gop-leader-accused-gay-sex-crime-5-print.html"
   ], 
   [
    "23739.html", 
    "http://www.4forums.com/political/gay-rights-debates/10225-young-gop-leader-accused-gay-sex-crime-4-print.html"
   ], 
   [
    "23740.html", 
    "http://www.4forums.com/political/gay-rights-debates/10225-young-gop-leader-accused-gay-sex-crime-6-print.html"
   ], 
   [
    "23741.html", 
    "http://www.4forums.com/political/gay-rights-debates/10225-young-gop-leader-accused-gay-sex-crime-3-print.html"
   ], 
   [
    "23742.html", 
    "http://www.4forums.com/political/gay-rights-debates/10225-young-gop-leader-accused-gay-sex-crime-2-print.html"
   ]
  ], 
  "identifier": 10225
 }
]