[
 [
  [
   277772, 
   null, 
   "Jo Bennett", 
   "http://politics.guardian.co.uk/terrorism/story/0,,2146692,00.html\n \n The British government is urging police to use anti-terrorist legislation to detain people without trial and stop and search people without reasonable suspicion. This is precisely what we warned would happen when the legislation was introduced, that absolutely anything the government wanted would acquire a tenuous connection to terrorism. If the protesters break the law, you put them on trial and let a jury decide, you don't prevent protests on the off-chance they might break the law.", 
   {
    "post_info": {
     "post_title": "UK government continues to abuse anti-terror laws"
    }
   }, 
   null, 
   null, 
   1186853340.0
  ], 
  [
   277824, 
   null, 
   "Ripskar", 
   "Well call me cynical, but I reckon this is why they put the legislation forward in the first place.\n It's been a running theme since Blair came to power, the telegraph is running a story regarding the proposed ID cards and who would have access to the information stored on them or that they would gather on you (where you go, who you associate with, what you buy).", 
   {}, 
   277772, 
   null, 
   1186863960.0
  ], 
  [
   277825, 
   null, 
   "Jo Bennett", 
   "I think whether they we planned with this use in mind is rather a moot point, it was always clear they were going to end up being used for this. I also recall being accused of scaremongering at the time and told they would only be used against suspected terrorists.", 
   {}, 
   277824, 
   null, 
   1186864200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  UK government continues to abuse anti-terror laws", 
  "url": "http://www.4forums.com/political/civil-rights-debates/10224-uk-government-continues-abuse-anti-terror-laws.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 10224, 
  "discussion_files": [
   [
    "12071.html", 
    "http://www.4forums.com/political/civil-rights-debates/10224-uk-government-continues-abuse-anti-terror-laws-print.html"
   ]
  ], 
  "identifier": 10224
 }
]