[
 [
  [
   277624, 
   null, 
   "MrWriteLA", 
   "http://www.dallasnews.com/sharedcontent/dws/dn/latestnews/stories/081007dnmetgayfuneral.3617689.html \nAn Arlington church volunteered to host a funeral Thursday, then reneged on the invitation when it became clear the dead man's homosexuality would be identified in the service. \n \n The event placed High Point Church in the cross hairs of an issue many conservative Christian organizations are discussing: how to take a hard-line theological position on homosexuality while showing compassion toward gay people and their families. \n \n But the dispute between High Point Church and the friends and family of Cecil Sinclair has left confusion and hard feelings on both sides. \n \n Mr. Sinclair, 46, died Monday. He was a native of Fort Worth, a Navy veteran who served in Desert Storm helping rescuers find downed pilots, and a singer in the Turtle Creek Chorale, said his mother, Eva Bowers. He did not belong to a church. \n \n His brother, Lee, is an employee and member of High Point, a nondenominational mega-congregation led by the Rev. Gary Simons. Mr. Simons is the brother-in-law of Joel Osteen, nationally known pastor of Houston's Lakewood Church. \n \n When Cecil Sinclair became ill with a heart condition six years ago, church members started praying for him out of love for his brother, Mr. Simons said Thursday. And when Mr. Sinclair died of an infection, a side effect of surgery intended to keep him alive long enough for a heart transplant, a member of the church staff was immediately sent to minister to the family, he said. \n \n Both the family and church officials agree that the church volunteered to host a memorial service, feed 100 guests and create a multimedia presentation of photos from Mr. Sinclair's life. \n \n But the photos that the family selected alerted church officials that there might be a problem with the service, Mr. Simons said. \n \n Not OK with photos \n \n \"Some of those photos had very strong homosexual images of kissing and hugging,\" he said. \"My ministry associates were taken aback.\" \n \n And then, he said, the family asked to have its own people officiate the service. \"We had no control over the format of the memorial,\" Mr. Simons said. \n \n Family and friends discovered the church had withdrawn its invitation Wednesday evening, when Lee Sinclair called to tell his mother, she said. Ms. Bowers said that her older son is developmentally disabled, with hearing and vision problems. \n \n Nobody from the church called her or Mr. Sinclair's partner, Paul Wagner, to discuss possible changes to the service, Ms. Bowers said. \n \n \"We could have reached a compromise,\" she said. \"That was never attempted.\" \n \n At least some theological questions could have been worked out, she said. For instance, the family was willing to allow the church to issue an \"altar call\" asking people to accept Jesus at the end of the service. \n \n But it's not clear where the two sides could have found common ground on the central issue. High Point Church opposes homosexuality, and there was no way the church could host a service that appeared to endorse it, Mr. Simons said. \n \n \"Can you hold the event and condone the sin and compromise our principles?\" he said. \"We can't.\" \n \n The issue was not so much that Mr. Sinclair was, from the church's perspective, an unrepentant sinner, he said. It's that it was clear from the photos that his friends and family wanted that part of his life to be a significant part of the service. \n \n The pastor said that he could imagine a similar situation involving a different sin. Perhaps a mother who is a member of the church loses a son who is a thief or murderer, Mr. Simons said. The church would surely volunteer to hold a service, he said. \n \n \"But I don't think the mother would submit photos of her son murdering someone,\" he said. \"That's a red light going off.\" \n \n \"Knew it, accepted it' \n \n Mr. Sinclair's family and friends reject any such comparison between homosexuality and criminal behavior. Mr. Sinclair came out officially to his family shortly after his service in the Gulf War, his mother said. \n \n \"We all knew it,\" she said. \"We knew it and accepted it.\" \n \n After the church decided it would not host the funeral service, it offered to pay for another facility, Mr. Simons said. The family declined and found a local funeral home to hold the event Thursday night.Even so, the church sent over food and the video - minus the images church officials found to be offensive. \n \n \"Some of our people will be there at the memorial service,\" Mr. Simons said. \"We tried to do the very best of our ability to express the love of Christ.\" \n \n Figuring out how to walk that line is not easy, said the Rev. Bob Stith, the recently retired pastor of Carroll Baptist Church in Southlake who is now the national strategist for gender issues for the Southern Baptist Convention. His new job is to help churches negotiate conflicts like the one faced by High Point. \n \n The best system is to work out procedures ahead of time, he said. For instance, he tells Baptist churches they should have clear guidelines that they can give to families at the start of funeral planning. But even that can't prevent every possible awkward situation, he said. \n \n \"I know because this is such new ground for a lot of churches and pastors, you get caught off-guard and you get reactive and not proactive,\" he said. \n \n A familiar situation \n \n If so, that kind of reaction is all too familiar to survivors of the AIDS onslaught of the 1980s, said Ed Young, a charter member of the Turtle Creek Chorale. Back then, having churches turn down funerals of gay men was not uncommon, he said. \n \n \"It may be surprising to younger gays, because most gays think that doesn't happen any more,\" he said. \"But it's still there.\" \n \n Was there a way to avoid this conflict? \n \n \"I don't know if there is any way to prevent something like that,\" Mr. Simons said. \"Whenever there is a matter of principle involved, each side thinks that it is right.\" \n", 
   {
    "post_info": {
     "post_title": "Church won't hold funeral for gay man"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1186788120.0
  ], 
  [
   277630, 
   null, 
   "samiinh", 
   "What evil these christers represent.", 
   {}, 
   277624, 
   null, 
   1186790580.0
  ], 
  [
   277636, 
   null, 
   "robbie0517", 
   "You mean it doesn't even stop after your dead?emoticon_xdonno", 
   {}, 
   277630, 
   null, 
   1186791360.0
  ], 
  [
   277642, 
   null, 
   "jyoshu", 
   "I wonder how many of the pro-gay-rights \"liberal\" Unitarian churches would readily hold a funeral for someone from the Christian right, with all the gospel God-and-country sermonizing trappings included, exactly the way the deceased would have wanted? It seems to me that a church shouldn't be expected to do something like that if it goes against some of their basic beliefs. I also think it's telling that they were willing to still go so far as to provide funding for another funeral facility and provide food. (Funeral homes can be rather expensive.)", 
   {}, 
   277636, 
   null, 
   1186794000.0
  ], 
  [
   277647, 
   null, 
   "samiinh", 
   "I wonder how many of the pro-gay-rights \"liberal\" Unitarian churches would readily hold a funeral for someone from the Christian right, with all the gospel God-and-country sermonizing trappings included, exactly the way the deceased would have wanted? It seems to me that a church shouldn't be expected to do something like that if it goes against some of their basic beliefs. I also think it's telling that they were willing to still go so far as to provide funding for another funeral facility and provide food. (Funeral homes can be rather expensive.)\n\n \n That part didn't make sense. Maybe it was made up. I find it hard to believe.", 
   {}, 
   277642, 
   null, 
   1186795380.0
  ], 
  [
   277665, 
   null, 
   "Bassman", 
   "http://www.4forums.com/political/showpost.php?p=277630&postcount=2\n \n Samiinh, \"christers\" is an offensive generalization and against the forum rules. Do it again and we will start deleting posts.", 
   {}, 
   277647, 
   null, 
   1186801140.0
  ], 
  [
   277668, 
   null, 
   "Matthew S", 
   "http://www.4forums.com/political/showpost.php?p=277630&postcount=2\n \n Samiinh, \"christers\" is an offensive generalization and against the forum rules. Do it again and we will start deleting posts.\n\n \n Except that Sam was very clear in his response to who the christers are. In this case christers refers to the officials at High Point Church that refused the mans funeral.", 
   {}, 
   277665, 
   null, 
   1186801920.0
  ], 
  [
   277670, 
   null, 
   "Bassman", 
   "Except that Sam was very clear in his response to who the christers are. In this case christers refers to the officials at High Point Church that refused the mans funeral. Sam use my term cithgap and that is more specific\n \n Cithgap= ChrIstians That Hate Gay People. That is specific.\n\n \n Except that ANY offensive generalization is prohibited. Fair enough?? And that includes namecalling, no matter how much you think it may be true. The idea is to keep things civil, OK? ", 
   {}, 
   277668, 
   null, 
   1186802100.0
  ], 
  [
   277672, 
   null, 
   "Bassman", 
   "Just to remind everyone of the specific rule concerning offensive generalizations:\n \n 2a) No Personal attacks, insults, name calling, offensive generalizations, trolling, or labeling. For example you cannot call someone stupid or ignorant even if it's true.", 
   {
    "unicode_changes_made": true
   }, 
   277670, 
   null, 
   1186802400.0
  ], 
  [
   277680, 
   null, 
   "robbie0517", 
   "I wonder how many of the pro-gay-rights \"liberal\" Unitarian churches would readily hold a funeral for someone from the Christian right, with all the gospel God-and-country sermonizing trappings included, exactly the way the deceased would have wanted? It seems to me that a church shouldn't be expected to do something like that if it goes against some of their basic beliefs. I also think it's telling that they were willing to still go so far as to provide funding for another funeral facility and provide food. (Funeral homes can be rather expensive.)\n\n \n I don't think any Unitarian church would refuse funeral service to someone from the Christian right. Just because they are a liberal church doesn't mean that they also don't preach God-and-country. I don't believe their belief in God is any less than that of the Christian right. \n \n I understand the Unitarian church to be inclusive, not exclusive.", 
   {}, 
   277642, 
   null, 
   1186802940.0
  ], 
  [
   277681, 
   null, 
   "Archangel", 
   "I wonder how many of the pro-gay-rights \"liberal\" Unitarian churches would readily hold a funeral for someone from the Christian right, with all the gospel God-and-country sermonizing trappings included, exactly the way the deceased would have wanted? It seems to me that a church shouldn't be expected to do something like that if it goes against some of their basic beliefs. I also think it's telling that they were willing to still go so far as to provide funding for another funeral facility and provide food. (Funeral homes can be rather expensive.)\n\n \n Good point, but I doubt they will acknowledge the accuracy of your example. This is the crux of the churches stance and has been argued here numerous times by me, believers can't compromise Gods values for mans convenience or acceptance. \n \n \nIt's not clear where the two sides could have found common ground on the central issue. High Point Church opposes homosexuality, and there was no way the church could host a service that appeared to endorse it, Mr. Simons said.\n \n \"Can you hold the event and condone the sin and compromise our principles?\" he said. \"We can't.\"\n \n The issue was not so much that Mr. Sinclair was, from the church's perspective, an unrepentant sinner, he said. It's that it was clear from the photos that his friends and family wanted that part of his life to be a significant part of the service.\n \n The pastor said that he could imagine a similar situation involving a different sin. Perhaps a mother who is a member of the church loses a son who is a thief or murderer, Mr. Simons said. The church would surely volunteer to hold a service, he said.\n \n \"But I don't think the mother would submit photos of her son murdering someone,\" he said. \"That's a red light going off.\"\n", 
   {}, 
   277642, 
   null, 
   1186803000.0
  ], 
  [
   277684, 
   null, 
   "Bassman", 
   "So in simpler language, the church, being a private entity, is exercising its right to exclude this homosexual funeral based on its doctrine of faith.", 
   {}, 
   277681, 
   null, 
   1186803120.0
  ], 
  [
   277686, 
   null, 
   "Matthew S", 
   "Just to remind everyone of the specific rule concerning offensive generalizations:\n \n 2a) No Personal attacks, insults, name calling, offensive generalizations, trolling, or labeling. For example you cannot call someone stupid or ignorant even if it&#8217;s true.\n\n \n The rule applies to posters not the subjects of the posts, in this case the the cithgaps at the High Point Church.\n \n Also I noticed you did that you did not take jyoshu to task for this post.\n http://www.4forums.com/political/showpost.php?p=277642&postcount=4\n \n pro-gay-rights \"liberal\" Unitarian churches \n\n \n Could it be that you are only targeting us liberals and not the conservatives?", 
   {}, 
   277672, 
   null, 
   1186804020.0
  ], 
  [
   277687, 
   null, 
   "Bassman", 
   "[QUOTE=Matthew S;277686]The rule applies to posters not the subjects of the posts, in this case the the cithgaps at the High Point Church.\n \n Also I noticed you did that you did not take jyoshu to task for this post.\n http://www.4forums.com/political/showpost.php?p=277642&postcount=4\n \n pro-gay-rights \"liberal\" Unitarian churches /QUOTE]\n \n Could it be that you are only targeting us liberals and not the conservatives?\n\n \n I'll take another look at it. Thanks.", 
   {}, 
   277686, 
   null, 
   1186804200.0
  ], 
  [
   277688, 
   null, 
   "Bassman", 
   "I wonder how many of the pro-gay-rights \"liberal\" Unitarian churches would readily hold a funeral for someone from the Christian right, with all the gospel God-and-country sermonizing trappings included, exactly the way the deceased would have wanted? It seems to me that a church shouldn't be expected to do something like that if it goes against some of their basic beliefs.  I also think it's telling that they were willing to still go so far as to provide funding for another funeral facility and provide food. (Funeral homes can be rather expensive.)\n\n \n It seems there are no generalizations, offensive or otherwise, present. As a matter of fact, if you'll note the bolded text, the church did, in fact, aid in the funeral expenses, which IMHO, was the right thing to do without compromising their principles.", 
   {}, 
   277642, 
   null, 
   1186804440.0
  ], 
  [
   277689, 
   null, 
   "Matthew S", 
   "It seems there are no generalizations, offensive or otherwise, present. As a matter of fact, if you'll note the bolded text, the church did, in fact, aid in the funeral expenses, which IMHO, was the right thing to do without compromising their principles.\n\n \n It is a matter of prespective because I consider jyoshus use of the word \"liberal\" in quotes to be quite offensive.", 
   {}, 
   277688, 
   null, 
   1186805220.0
  ], 
  [
   277690, 
   null, 
   "Archangel", 
   "So in simpler language, the church, being a private entity, is exercising its right to exclude this homosexual funeral based on its doctrine of faith.\n\n \n Well, I think the church would be even more magnanimous than that if this gentleman had been at all repentant in life and had attended the church himself. His whole connection to that church was through his brothers affiliation with it so the church had neither a personal relationship with him nor any obligation to him personally. Everything they tried to, or intended to do for him was to comfort the family on his behalf.\n \n Had the family been willing to forgo the inclusion of his gay lifestyle in his memorial service the church could have participated without guilt or concern of compromising Gods principles. What people must understand is that THE CHURCH MUST NOT DO ANYTHING TO APPEAR TO ENDORSE OR SUPPORT THAT WHICH COULD BE PERCEIVED AS SIN ACCORDING TO GODS HOLY STANDARDS. \n \n If this man was a swinger and his family wanted to post photos of him with many different women at various sex clubs and nudist colonies, the church would have been just as against participating as in this case. It isn't about the gays once again, it's about the sin.", 
   {}, 
   277684, 
   null, 
   1186805340.0
  ], 
  [
   277691, 
   null, 
   "Bassman", 
   "It is a matter of prespective because I consider jyoshus use of the word \"liberal\" in quotes to be quite offensive.\n\n \n Good point.\n \n Jyoshu, in the future, when specifically referring to Liberal, Conservative,etc. churches, organizations, etc. please don't put it in quotes. In this case the UU church is a Liberal church. Context is important.", 
   {}, 
   277689, 
   null, 
   1186805520.0
  ], 
  [
   277695, 
   null, 
   "jyoshu", 
   "It is a matter of prespective because I consider jyoshus use of the word \"liberal\" in quotes to be quite offensive.\n\n \n It wasn't put in quotes for that reason. I did it because it's the sort of term that there's not a lot of consensus on what it means. My apologies for the confusion. \n \n \nJyoshu, in the future, when specifically referring to Liberal, Conservative,etc. churches, organizations, etc. please don't put it in quotes.\n\n \n Fine, whatever.", 
   {}, 
   277689, 
   null, 
   1186807380.0
  ], 
  [
   277708, 
   null, 
   "robbie0517", 
   "This forum used to be interesting.. can you hear the crickets chirping? I can. Look, were all adults, I feel like were all in detention.", 
   {}, 
   277695, 
   null, 
   1186810260.0
  ], 
  [
   277719, 
   null, 
   "Phyllis", 
   "I don't want to take this off topic, but I think that moderators should grant tremendous deference and use the power sparingly. And I say that as someone who really thinks that the tone of a discussion matters. But when push comes to shove, I would rather try my best to convince someone with my own arguments they are over the top rather than have their post deleted or deflected by mods. I firmly believe that too much moderator interference (i.e., posts in bolded blue font) will result in no discussion much faster than it will result in a better discussion.", 
   {}, 
   277708, 
   null, 
   1186812300.0
  ], 
  [
   277720, 
   null, 
   "Symbiote", 
   "This is ####, god forbid someone use the word christer, or \"liberal\" in inverted commas.", 
   {}, 
   277719, 
   null, 
   1186812540.0
  ], 
  [
   277723, 
   null, 
   "Bassman", 
   "I personally apologize for my heavy-handed approach. This is actually my first time as a mod, so please bear with me as I learn the ropes. But Phyllis is correct in that discourse and discussion are key to good dialogue and debate. So, with that in mind, I will endeavor to use much greater discretion when I administer my moderator duties.\n \n (Thanks Phyllis)", 
   {}, 
   277720, 
   null, 
   1186813440.0
  ], 
  [
   277732, 
   null, 
   "samiinh", 
   "It appears that freedom of speech in a virtual web forum no longer exists. I find that offensive. My definition of a christer is one who uses his christian religion to hurt other people. And there are many christers in this world.", 
   {}, 
   277723, 
   null, 
   1186831140.0
  ], 
  [
   277733, 
   null, 
   "JSDKoeln", 
   "So in simpler language, the church, being a private entity, is exercising its right to exclude this homosexual funeral based on its doctrine of faith.\n\n \n If churches ARE a \"private\" entity, perhaps we should pull their tax-exempt status and hold them accountable, like we do companies, for their business practices.\n \n I don't buy it. \n \n So what if his god-given homosexuality flies in the face of their beliefs. Relgious bunk is flown into the faces of gay people every day. It would be nice if we could sometimes say, as these people at this church did, \"No thank you, Next!\"\n \n What this teaches me is to stand up for my god-given nature. What this teaches me is that their view of God's love is conditional. And it proves what I think of organized religion in the christian relm absolutely right. So what if there were pictures of he and his lover hugging. I doubt his family would have given any lewd pictures for a memorial.\n \n This is about what I expect from this type of christian.", 
   {}, 
   277684, 
   null, 
   1186833300.0
  ], 
  [
   277735, 
   null, 
   "samiinh", 
   "If churches ARE a \"private\" entity, perhaps we should pull their tax-exempt status and hold them accountable, like we do companies, for their business practices.\n \n I don't buy it. \n \n So what if his god-given homosexuality flies in the face of their beliefs. Relgious bunk is flown into the faces of gay people every day. It would be nice if we could sometimes say, as these people at this church did, \"No thank you, Next!\"\n \n What this teaches me is to stand up for my god-given nature. What this teaches me is that their view of God's love is conditional. And it proves what I think of organized religion in the christian relm absolutely right. So what if there were pictures of he and his lover hugging. I doubt his family would have given any lewd pictures for a memorial.\n \n This is about what I expect from this type of christian.\n\n \n For most christers this is true.", 
   {}, 
   277733, 
   null, 
   1186834320.0
  ], 
  [
   277740, 
   null, 
   "lesz", 
   "It's just another example of Christians driving people, especially gay people, from their religion. Still, in the US, a church has a constitutional right to express anti-gay bigotry in its doctrine. No-one has a legally enforceable right to funeral services, or indeed any services, in any church. I'd never advocate abrogating the right to express one's bigotry. \n \n However, just as these Christians claim the right to preach the lie that gay people are intrinsically immoral and sinful, they can have no reasonable expectation that their own lack of charity and compassion shouldn't be pointed out to them. If they choose to criticise others for being who they are, they should expect reciprocity in criticism.", 
   {}, 
   277735, 
   null, 
   1186839780.0
  ], 
  [
   277742, 
   null, 
   "samiinh", 
   "It's just another example of Christians driving people, especially gay people, from their religion. Still, in the US, a church has a constitutional right to express anti-gay bigotry in its doctrine. No-one has a legally enforceable right to funeral services, or indeed any services, in any church. I'd never advocate abrogating the right to express one's bigotry. \n \n However, just as these Christians claim the right to preach the lie that gay people are intrinsically immoral and sinful, they can have no reasonable expectation that their own lack of charity and compassion shouldn't be pointed out to them. If they choose to criticise others for being who they are, they should expect reciprocity in criticism.\n\n \n Hey, Lesz...good to see you. Hope all is well with you. When you were in Atlanta, did you know this gentleman: Elder Chris Glaser of Ormewood Park Presbyterian Church in Atlanta, author of Coming Out as a Sacrament.", 
   {}, 
   277740, 
   null, 
   1186840560.0
  ], 
  [
   277743, 
   null, 
   "Matthew S", 
   "I don't want to take this off topic, but I think that moderators should grant tremendous deference and use the power sparingly. And I say that as someone who really thinks that the tone of a discussion matters. But when push comes to shove, I would rather try my best to convince someone with my own arguments they are over the top rather than have their post deleted or deflected by mods. I firmly believe that too much moderator interference (i.e., posts in bolded blue font) will result in no discussion much faster than it will result in a better discussion.\n\n \n I agree wholeheartedly. When you have to think about every word and if it will offend someone ....well I don't know if I want to go to that much effort. After all how does one know if the word, have, about, or will for example, will offend someone. I think this is an attempt to kill this forum.", 
   {}, 
   277719, 
   null, 
   1186840620.0
  ], 
  [
   277745, 
   null, 
   "lesz", 
   "Hey, Lesz...good to see you. Hope all is well with you. When you were in Atlanta, did you know this gentleman: Elder Chris Glaser of Ormewood Park Presbyterian Church in Atlanta, author of Coming Out as a Sacrament.\n\n \n Hey Sam! No, I didn't have anything to do with churches there, but there were a number of gay-friendly Christian churches of several denominations, as well as specifically gay ones. They were unfortunately heavily outnumbered by gay-hostile Christian churches. I don't have hard statistics, but I get the impression that proportionally speaking, more gay people tend to be unchurched or even atheist, in large part as a result of religious bigotry against them. Clergy frequently preach a rousing sermon, but when trying to walk the Christian path on so many social issues, often fail miserably.\n \n I won't say that Christianity is a dead loss for religious gay people, but it's hard to understand why some gays still try to make it in mainstream churches that simply are incapable of making them feel welcome. As a result, gays vote with their feet, as they do politically.", 
   {}, 
   277742, 
   null, 
   1186841460.0
  ], 
  [
   277746, 
   null, 
   "lesz", 
   "I think the important lesson here from this church is that its members ought to examine their consciences on their anti-gay attitudes. We can't reasonably expect churches to turn on a dime and switch from being gay hostile to gay accepting in an instant, but they should ponder carefully how their behaviour reflects on their professed religion, and how much harm and distress it causes others.", 
   {}, 
   277745, 
   null, 
   1186841940.0
  ], 
  [
   277747, 
   null, 
   "Archangel", 
   "It appears that freedom of speech in a virtual web forum no longer exists. I find that offensive. My definition of a christer is one who uses his christian religion to hurt other people. And there are many christers in this world.\n\n \n \nFor most christers this is true.\n\n \n So it seems the Gay Crusaders can intimidate the mods to allow a truly offensive term to be used in passing while other posters are criticized for just having a passionate debate that offers no insults or personal attacks. If samiinh can refer to me and mine as a christer then I reserve the right to refer to him as a hatemongering religious bigot and an antichrist that he is. Now, to respond to an on topic point.\n \n \nIt's just another example of Christians driving people, especially gay people, from their religion. Still, in the US, a church has a constitutional right to express anti-gay bigotry in its doctrine. No-one has a legally enforceable right to funeral services, or indeed any services, in any church. I'd never advocate abrogating the right to express one's bigotry. \n \n However, just as these Christians claim the right to preach the lie that gay people are intrinsically immoral and sinful, they can have no reasonable expectation that their own lack of charity and compassion shouldn't be pointed out to them. If they choose to criticise others for being who they are, they should expect reciprocity in criticism.\n\n \n This post is a lie and more hateful propaganda based in your anti-christian bigotry lesz, and you know it. This situation didn't happen because the man was gay but because he was in unrepentant sin against the principles of God, the bible and the church in question. As I pointed out in an earlier post, If this man was a swinger and his family wanted to post photos of him with many different women at various sex clubs and nudist colonies, the church would have been just as against participating as in this case. It isn't about the gays once again, it's about the sin. \n \n So why must you always play the poor victim group who is being singled out by the big mean hetero christian bullies for special persecution and abuse ? I'll tell you why, because it's written in your unwritten gay agenda to always play the victim while demonizing the Traditional Community at every turn in order to gain sympathy and allies for your cause for SPECIAL RIGHTS to normalize your unnatural lifestyle.", 
   {}, 
   277743, 
   null, 
   1186842120.0
  ], 
  [
   277749, 
   null, 
   "lesz", 
   "So it seems the Gay Crusaders can intimidate the mods to allow a truly offensive term to be used in passing while other posters are criticized for just having a passionate debate that offers no insults or personal attacks. If samiinh can refer to me and mine as a christer then I reserve the right to refer to him as a hatemongering religious bigot and an antichrist that he is. Now, to respond to an on topic point.\n\n \n Your choice of personal insults is par for the course.\n \n \nThis post is a lie and more hateful propaganda based in your anti-christian bigotry lesz, and you know it.\n\n \n So now you call me a liar for expressing an opinion about the hypocrisy of some Christians. It's no wonder most people feel it's a waste of time having a dialogue with you -- all you ever offer are personal insults.\n \n \nThis situation didn't happen because the man was gay but because he was in unrepentant sin against the principles of God, the bible and the church in question.\n\n \n I.e. that church made a bigotted decision because the man is gay. Any alleged \"sin\" is only the opinion of those Christians who are prejudiced against gays because of lamentable interpretations of their scriptures. \n \n \nAs I pointed out in an earlier post, If this man was a swinger and his family wanted to post photos of him with many different women at various sex clubs and nudist colonies, the church would have been just as against participating as in this case. It isn't about the gays once again, it's about the sin. \n\n \n Sorry, but the comparison is frivolous. Being gay and expressing gay love is not a sin, neither is it the equivalent of frequenting sex clubs.\n \n \nSo why must you always play the poor victim group who is being singled out by the big mean hetero christian bullies for special persecution and abuse ?\n\n \n Golly, could it be because many Christian churches single out gay people for religious persecution?\n \n \nI'll tell you why, because it's written in your unwritten gay agenda to always play the victim while demonizing the Traditional Community at every turn in order to gain sympathy and allies for your cause for SPECIAL RIGHTS to normalize your unnatural lifestyle.\n\n \n I don't need to demonise the right wing religious extremists who have corrupted the Republican party. They condemn themselves out of their own mouths when they preach hatred against gay people and everyone else they've decided to scapegoat. Some traditions are plain evil, and deserve to be overthrown.", 
   {}, 
   277747, 
   null, 
   1186842780.0
  ], 
  [
   277750, 
   null, 
   "Matthew S", 
   "So it seems the Gay Crusaders can intimidate the mods to allow a truly offensive term to be used in passing while other posters are criticized for just having a passionate debate that offers no insults or personal attacks. If samiinh can refer to me and mine as a christer then I reserve the right to refer to him as a hatemongering religious bigot and an antichrist that he is. Now, to respond to an on topic point.\n \n \n \n This post is a lie and more hateful propaganda based in your anti-christian bigotry lesz, and you know it. This situation didn't happen because the man was gay but because he was in unrepentant sin against the principles of God, the bible and the church in question. As I pointed out in an earlier post, If this man was a swinger and his family wanted to post photos of him with many different women at various sex clubs and nudist colonies, the church would have been just as against participating as in this case. It isn't about the gays once again, it's about the sin. \n \n So why must you always play the poor victim group who is being singled out by the big mean hetero christian bullies for special persecution and abuse ? I'll tell you why, because it's written in your unwritten gay agenda to always play the victim while demonizing the Traditional Community at every turn in order to gain sympathy and allies for your cause for SPECIAL RIGHTS to normalize your unnatural lifestyle.\n\n \n Note to mods I object archangels use of the term your unnatural lifestyle as this is offensive.", 
   {}, 
   277747, 
   null, 
   1186843380.0
  ], 
  [
   277751, 
   null, 
   "Ohioprof", 
   "I wonder how many of the pro-gay-rights \"liberal\" Unitarian churches would readily hold a funeral for someone from the Christian right, with all the gospel God-and-country sermonizing trappings included, exactly the way the deceased would have wanted? It seems to me that a church shouldn't be expected to do something like that if it goes against some of their basic beliefs. I also think it's telling that they were willing to still go so far as to provide funding for another funeral facility and provide food. (Funeral homes can be rather expensive.)\n\n \n I am a Unitarian Universalist. Our church would certainly allow people to hold whatever kind of funeral or memorial service they want. If they are not church members, they would have to rent the church building. That is our church use/rental policy. \n \n You should not assume that our churches are unwelcoming to people who are different from us. UUs generally believe in welcoming people of different viewpoints and beliefs.", 
   {}, 
   277642, 
   null, 
   1186844640.0
  ], 
  [
   277752, 
   null, 
   "Archangel", 
   "Your choice of personal insults is par for the course.\n\n \n I'm not insulting anyone, just telling the truth about samiinhs and your sides hate for anything moral or traditional.\n \n \nSo now you call me a liar for expressing an opinion about the hypocrisy of some Christians. It's no wonder most people feel it's a waste of time having a dialogue with you -- all you ever offer are personal insults.\n\n \n No lesz, you are lying about the whole situation by painting the church as motivated by hatred for the gay community when that isn't what is motivating them at all. You are also making a broad generalized sweeping statement that said the American Christian church is committed to persecuting all gays which is a blatant lie as I have pointed out on numerous occasions. But just disagreeing with homosexuality means we are enemies in your very limited and corrupted World view.\n \n \nI.e. that church made a bigotted decision because the man is gay. Any alleged \"sin\" is only the opinion of those Christians who are prejudiced against gays because of lamentable interpretations of their scriptures.\n \n \n No it isn't lesz, it isn't the opinion of the Christians who are prejudiced at all. It is the opinion of our God whom we follow because He is the arbiter of TRUTH on Earth, not your sinful gay community. So forgive us for following our Master/Savior rather than trusting in the Word of those who's lifestyle He condemns as in rebellion to His truths.\n \n \nSorry, but the comparison is frivolous. Being gay and expressing gay love is not a sin, neither is it the equivalent of frequenting sex clubs.\n\n \n The comparison to swingers is perfect because ACCORDING TO OUR BIBLE, EXPRESSING GAY LOVE IS A SIN, and that is what we live by, not your corrupted and twisted view of morality.\n \n \nGolly, could it be because many Christian churches single out gay people for religious persecution?\n\n \n Not at all. Had this members gay brother decided to visit the church in question, do you think he would have been asked to leave, or refused entry ? Not on your life. Not unless he disrupted the service by being loud and abusive to other worshipers he wouldn't be. What bible believing churches wont do is compromise the truth in order to grow their church with members who refuse to submit to GODS AUTHORITY OVER THEIR LIVES, NOT MANS. But being an unbeliever, it's impossible for you to see this spiritual reality so you can only focus on the people rather than the spiritual principles that guide them.\n \n \nI don't need to demonise the right wing religious extremists who have corrupted the Republican party. They condemn themselves out of their own mouths when they preach hatred against gay people and everyone else they've decided to scapegoat. Some traditions are plain evil, and deserve to be overthrown.\n\n \n There you go again blindly lashing out at moral traditionalists for not compromising our values for temporary fleshly lusts as your side so wantonly lives for. That doesn't make us hateful lesz, it makes you a hedonistic narcissist who can't see past what physically satisfies you. I challenge you to point out one hateful remark in the OP article against gays. One thing that condemns them to say they aren't a concern of the church in question. Go ahead, point it out if you can.", 
   {}, 
   277749, 
   null, 
   1186845060.0
  ], 
  [
   277754, 
   null, 
   "Ohioprof", 
   "I don't think any Unitarian church would refuse funeral service to someone from the Christian right. Just because they are a liberal church doesn't mean that they also don't preach God-and-country. I don't believe their belief in God is any less than that of the Christian right. \n \n I understand the Unitarian church to be inclusive, not exclusive.\n\n \n I am a Unitarian Universalist, and I can clarify some of this, or try to. Our churches do not generally \"preach God-and-country.\" Individual UUs believe in God as they choose; there is no church doctrine requiring belief in God. It's up to individuals. There are UU atheists, UU Christians, UU pagans, UU Jews, UU Buddhists, etc.\n \n The UU churches are generally inclusive, not exclusive. Each individual church makes its own policies and rules for use of their facilities; we have congregational polity, and so the Unitarian Univeralist Association does not dictate policy to individual churches. In my particular congregation, we would have no problem renting out our church to someone for whatever kind of funeral or memorial service they want to have. We would not provide the church for free, except to our church members. People can hire our minister if they want to, or they can provide their own minister or no minister for a memorial service, wedding, or other event. \n \n It is true that a church can decide to allow or deny a group to use the church space as they see fit, with some restrictions on allowing political candidates to use the space. (Churches have to be careful not to be partisan, in order to keep their tax-exempt status. A church may host speeches by political candidates, but they must provide the church space equally to all candidates.)", 
   {}, 
   277680, 
   null, 
   1186845420.0
  ], 
  [
   277756, 
   null, 
   "lesz", 
   "I'm not insulting anyone, just telling the truth about samiinhs and your sides hate for anything moral or traditional.\n\n \n Untrue on both counts. What is being criticised here is not Christianity but homophobic bigotry -- traditional or not. Yours is just a typical ad hominem attack.\n \n \nNo lesz, you are lying about the whole situation by painting the church as motivated by hatred for the gay community when that isn't what is motivating them at all. You are also making a broad generalized sweeping statement that said the American Christian church is committed to persecuting all gays which is a blatant lie as I have pointed out on numerous occasions. But just disagreeing with homosexuality means we are enemies in your very limited and corrupted World view.\n\n \n (1) There is no such thing as \"the American Christian church\". Many individual Christian churches and pastors in the US do, however, preach the persecution of gay people. \n \n (2) Doesn't matter whether the bigotry is motivated by hatred or some other crass emotion or homophobic scriptural interpretation. It's still morally repugnant.\n \n (3) The only enemies of gay people are those who would preach against us.\n \n \nNo it isn't lesz, it isn't the opinion of the Christians who are prejudiced at all. It is the opinion of our God whom we follow because He is the arbiter of TRUTH on Earth, not your sinful gay community. So forgive us for following our Master/Savior rather than trusting in the Word of those who's lifestyle He condemns as in rebellion to His truths.\n\n \n That's just your opinion. I cannot take any religion seriously that preaches that sort of hateful nonsense.\n \n \nThe comparison to swingers is perfect because ACCORDING TO OUR BIBLE, EXPRESSING GAY LOVE IS A SIN, and that is what we live by, not your corrupted and twisted view of morality.\n\n \n Another ad hominem attack. What do you know of my morality or lack of it? I really don't care either what your bible says, or what you think it says. Your opinions shouldn't be my problem. I am not alone even among Christians in finding religious homophobia morally repugnant, and you'll just have to live with that judgement.\n \n \nHad this members gay brother decided to visit the church in question, do you think he would have been asked to leave, or refused entry ?\n\n \n They certainly didn't want his dead, gay body on their premises. Why would they have welcomed his live one?\n \n \nThere you go again blindly lashing out at moral traditionalists for not compromising our values for temporary fleshly lusts as your side so wantonly lives for. That doesn't make us hateful lesz, it makes you a hedonistic narcissist who can't see past what physically satisfies you. I challenge you to point out one hateful remark in the OP article against gays. One thing that condemns them to say they aren't a concern of the church in question. Go ahead, point it out if you can.\n\n \n And yet another ad hominem attack -- what do you know of my loves, lusts or morality? Nothing whatever, but you rush into screaming judgement as usual. As I said earlier, churches in the US have a constitutional right to exclude whomever they please, and express whatever asinine, anti-gay bigotry they are pleased to promote. I do not complain about that. They do not, however, have any constitutional right not to be criticised for preaching the hateful stuff they preach.\n \n Deal with it.", 
   {}, 
   277752, 
   null, 
   1186846320.0
  ], 
  [
   277757, 
   null, 
   "Archangel", 
   "I am a Unitarian Universalist, and I can clarify some of this, or try to. Our churches do not generally \"preach God-and-country.\" Individual UUs believe in God as they choose; there is no church doctrine requiring belief in God. It's up to individuals. There are UU atheists, UU Christians, UU pagans, UU Jews, UU Buddhists, etc.\n \n The UU churches are generally inclusive, not exclusive. Each individual church makes its own policies and rules for use of their facilities; we have congregational polity, and so the Unitarian Univeralist Association does not dictate policy to individual churches. In my particular congregation, we would have no problem renting out our church to someone for whatever kind of funeral or memorial service they want to have. We would not provide the church for free, except to our church members. People can hire our minister if they want to, or they can provide their own minister or no minister for a memorial service, wedding, or other event. \n\n \n You're right that the UU church is inclusive not exclusive. They will allow any belief system into their house bar none. Even satanists if they asked to worship with them. So the result is that any cultic, pagan, heathen or man made belief system in existence is allowed and endorsed by them. Do you really think that the living God or any believer who knows the living God would enter such a place for fellowship ?", 
   {}, 
   277754, 
   null, 
   1186846380.0
  ], 
  [
   277758, 
   null, 
   "Foxtuba", 
   "Untrue on both counts. What is being criticised here is not Christianity but homophobic bigotry -- traditional or not. Yours is just a typical ad hominem attack.\n \n \n \n (1) There is no such thing as \"the American Christian church\". Many individual Christian churches and pastors in the US do, however, preach the persecution of gay people. \n \n (2) Doesn't matter whether the bigotry is motivated by hatred or some other crass emotion or homophobic scriptural interpretation. It's still morally repugnant.\n \n (3) The only enemies of gay people are those who would preach against us.\n \n \n \n That's just your opinion. I cannot take any religion seriously that preaches that sort of hateful nonsense.\n \n \n \n Another ad hominem attack. What do you know of my morality or lack of it? I really don't care either what your bible says, or what you think it says. Your opinions shouldn't be my problem. I am not alone even among Christians in finding religious homophobia morally repugnant, and you'll just have to live with that judgement.\n \n \n \n They certainly didn't want his dead, gay body on their premises. Why would they have welcomed his live one?\n \n \n \n And yet another ad hominem attack -- what do you know of my loves, lusts or morality? Nothing whatever, but you rush into screaming judgement as usual. As I said earlier, churches in the US have a constitutional right to exclude whomever they please, and express whatever asinine, anti-gay bigotry they are pleased to promote. I do not complain about that. They do not, however, have any constitutional right not to be criticised for preaching the hateful stuff they preach.\n \n Deal with it.\n\n \n Funny how I come back and there are still ad hominem attacks taking place...and speaking of AA's hypocrisy...did the one who actually claims that he's right and everyone's wrongs call you a narcissist? Woah, such a crass statement on his part, minus ten points from the messiah buried under. Mr. Jesus would just not approve.", 
   {}, 
   277756, 
   null, 
   1186847220.0
  ], 
  [
   277761, 
   null, 
   "Bassman", 
   "OK folks, everyone simmer down for a second while I sort this out. \n \n AA, this is a normal tactic of any debate forum. Suggestion, why not refute the accusation directly??\n \n Jo, How about listing reasons why you think AA's biblical interpretation is loveless, OK?", 
   {}, 
   277752, 
   null, 
   1186847520.0
  ], 
  [
   277762, 
   null, 
   "Jo Bennett", 
   "He's claiming the expression of love is a sin. It doesn't take a genius to work out how that is loveless.", 
   {}, 
   277761, 
   null, 
   1186847880.0
  ], 
  [
   277763, 
   null, 
   "Phyllis", 
   "Note to mods I object archangels use of the term your unnatural lifestyle as this is offensive.\n\n \n This is ridiculous. If you want to tattletale, use the report post feature. Do not bother everyone else with your overtly sensitive feelings.\n \n \nEveryone knows the truth is offensive to you Matt so you needn't point it out every time.\n\n \n Stop responding to/enabling him. There is absolutely no reason to.", 
   {}, 
   277750, 
   null, 
   1186848300.0
  ], 
  [
   277764, 
   null, 
   "Bassman", 
   "He's claiming the expression of love is a sin. It doesn't take a genius to work out how that is loveless.\n\n \n \n I posted earlier that there are three typse of love: Eros, Philos, and Agape\n \n 1. Eros-where we get the word erotic: pure physical passion\n \n 2. Philos-Ever wonder how the City of Philadelphia got its motto: \"The City of Brotherly Love\"?\n \n This is expressing love as siblings or comrades, such as soldiers or firefighters express towards each other\n \n 3. Agape-Unconditional love.\n \n Now, to address AA's contention, it's not so much the expression of love, because there is much more to love than just sex.", 
   {}, 
   277762, 
   null, 
   1186848300.0
  ], 
  [
   277767, 
   null, 
   "robbie0517", 
   "What bible believing churches wont do is compromise the truth in order to grow their church with members who refuse to submit to GODS AUTHORITY OVER THEIR LIVES, NOT MANS.\n\n \n Are you suggesting that churches that accept and embrace homosexuality are NOT Bible believing churches?", 
   {}, 
   277752, 
   null, 
   1186850820.0
  ], 
  [
   277768, 
   null, 
   "Jo Bennett", 
   "Just because Greek has three words for love does not mean that there are 3, or indeed only 3, types of love. I would suggest that the love between two people is not any one of those types of love, but has features of all of them. Additionally kisses and hugs are not sexual.", 
   {}, 
   277764, 
   null, 
   1186851120.0
  ], 
  [
   277769, 
   null, 
   "jitobear", 
   "The church has the right to do what it wants. I don't get it. If someone kicks me in the head I wash my hands of the jerk. I admit this lesson was hard learned but is now one of the mainstays of my existance and I teach my son \"don't sweat the a-holes.\"\n \n I say - hold the funeral elsewhere - without their help - and good riddance.", 
   {}, 
   277768, 
   null, 
   1186852200.0
  ], 
  [
   277770, 
   null, 
   "samiinh", 
   "For the record, ArchAngel, there is no living god. It is part of a great hoax that ignorant people believe in. You prove that point with every post you make.", 
   {}, 
   277769, 
   null, 
   1186852740.0
  ], 
  [
   277771, 
   null, 
   "Archangel", 
   "Are you suggesting that churches that accept and embrace homosexuality are NOT Bible believing churches?\n\n \n That is exactly what i am saying, and it isn't a suggestion but a fact. Those same churches deny the existence of hell even though the bible is clear that it's a real place.", 
   {}, 
   277767, 
   null, 
   1186853160.0
  ], 
  [
   277773, 
   null, 
   "Jo Bennett", 
   "That is exactly what i am saying, and it isn't a suggestion but a fact. \n\n \n It's not a fact, it's your opinion.", 
   {}, 
   277771, 
   null, 
   1186853400.0
  ], 
  [
   277774, 
   null, 
   "Archangel", 
   "For the record, ArchAngel, there is no living god. It is part of a great hoax that ignorant people believe in. You prove that point with every post you make.\n\n \n For the record samiinh, you have no idea what you are talking about. Denying that God exists does nothing to the fact that He is God and the Creator of all that is and ever will be.", 
   {}, 
   277770, 
   null, 
   1186853400.0
  ], 
  [
   277776, 
   null, 
   "samiinh", 
   "Saying that there is a god, doesn't make it true. No matter how many times you say it.", 
   {}, 
   277771, 
   null, 
   1186853580.0
  ], 
  [
   277777, 
   null, 
   "jyoshu", 
   "I am a Unitarian Universalist. Our church would certainly allow people to hold whatever kind of funeral or memorial service they want. If they are not church members, they would have to rent the church building. That is our church use/rental policy. \n \n You should not assume that our churches are unwelcoming to people who are different from us. UUs generally believe in welcoming people of different viewpoints and beliefs.\n\n \n With all due respect, I find that a bit hard to believe. Are you telling me that your church would host a funeral for a fundamentalist, with a fundie-type of service? Or would you (more than likely) look into what the service would entail, and possibly deny it or require changes to the service went against views that you believe are fundamental? Because that's exactly what this church did. Everyone has their make-or-break issues. Maybe for UUs it's tolerance/inclusiveness. So I doubt your church allow an event that would go against that fundamental belief of yours.", 
   {}, 
   277751, 
   null, 
   1186853640.0
  ], 
  [
   277778, 
   null, 
   "samiinh", 
   "With all due respect, I find that a bit hard to believe. Are you telling me that your church would host a funeral for a fundamentalist, with a fundie-type of service? Or would you (more than likely) look into what the service would entail, and possibly deny it or require changes to the service went against views that you believe are fundamental? Because that's exactly what this church did. Everyone has their make-or-break issues. Maybe for UUs it's tolerance/inclusiveness. So I doubt your church allow an event that would go against that fundamental belief of yours.\n\n \n They'd rent you their building and let you bring in your own fundamental pastor to lead the service. You can all roll in the aisles and sing and chant and where ever else you people do.", 
   {}, 
   277777, 
   null, 
   1186854120.0
  ], 
  [
   277779, 
   null, 
   "Bassman", 
   "Saying that there is a god, doesn't make it true. No matter how many times you say it.\n\n \n And saying there is no God doesn't make that true either.", 
   {}, 
   277776, 
   null, 
   1186854120.0
  ], 
  [
   277780, 
   null, 
   "Archangel", 
   "It's not a fact, it's your opinion.\n\n \n It's not my opinion but the biblical perspective that believers trust over the personal opinions of people who's moral values are based on only their personal desires and nothing more. You are defending what you think is right within your own heart and mind. So you are the final arditer of what you accept as right and wrong. \n \n Believers like me trust the Word of God to be our guide and believe that His word is right according to HIS MORAL PRINCIPLES. We don't decide what is morally right according to our personal moral comfort zones as you do. We submit to His authority which is greater than our own opinion of what we would like to live like. We discipline ourselves to trust God for what is right rather than attempt to place God in the box of our limited perspective on lifes choices and the diverse value systems in this World. So nothing I say scripturally or any rules or principles I live by are based on my opinion but on Gods Holy Word and the conviction of His Holy Spirit within me which guides me according to His Will.", 
   {}, 
   277773, 
   null, 
   1186854120.0
  ], 
  [
   277782, 
   null, 
   "Jo Bennett", 
   "It's not my opinion but the biblical perspective that believers trust over the personal opinions of people who's moral values are based on only their personal desires and nothing more. You are defending what you think is right within your own heart and mind. So you are the final arditer of what you accept as right and wrong. \n \n Believers like me trust the Word of God to be our guide and believe that His word is right according to HIS MORAL PRINCIPLES. We don't decide what is morally right according to our personal moral comfort zones as you do. We submit to His authority which is greater than our own opinion of what we would like to live like. We discipline ourselves to trust God for what is right rather than attempt to place God in the box of our limited perspective on lifes choices and the diverse value systems in this World.\n\n \n There is not one \"Biblical perspective\", there are many.\n http://www.whosoever.org/v4i4/millennium.html\n http://www.whosoever.org/v12i1/royal.shtml\n \n Both Biblical literalists and evangelicals, neither believe it's wrong to be gay.", 
   {}, 
   277780, 
   null, 
   1186854720.0
  ], 
  [
   277785, 
   null, 
   "samiinh", 
   "And saying there is no God doesn't make that true either.\n\n \n Where is your evidence?", 
   {}, 
   277779, 
   null, 
   1186855080.0
  ], 
  [
   277786, 
   null, 
   "Bassman", 
   "Where is your evidence?\n:sigh: Do you really want to go there??", 
   {}, 
   277785, 
   null, 
   1186855140.0
  ], 
  [
   277787, 
   null, 
   "Archangel", 
   "He's claiming the expression of love is a sin. It doesn't take a genius to work out how that is loveless.\n\n \n The expression of \"so called\" homosexual love is a sin according to the BIBLE. This isn't my opinion that is founded in any prejudice or bigotry on my part. After all, I didn't write the bible so you can't attribute its authorship to me. Nor can you claim that by quoting it I am giving you my opinion. And neither is it a loveless act to tell the truth from a spiritual perspective. In fact, at the judgement you will learn to your despair that your open acceptance and embrace of the active, rebellious and sinful lifestyles the bible refers to was what condemned them, you and was inevitably the great lie and deception that you represented to those you claimed to care about in life. \n \n You deceive yourself and them while condemning we who tell you the hard but plain spiritual truth that you may not want to hear but will save the hearer who is convicted by the truth and changes their way by turning away from that which separates them from the God who died for their sins.", 
   {}, 
   277762, 
   null, 
   1186855560.0
  ], 
  [
   277788, 
   null, 
   "samiinh", 
   ":sigh: Do you really want to go there??\n\n \n Not really. There is no evidence as we all know. But you can pretend, as we know you will.", 
   {}, 
   277786, 
   null, 
   1186855560.0
  ], 
  [
   277789, 
   null, 
   "samiinh", 
   "The expression of \"so called\" homosexual love is a sin according to the BIBLE. This isn't my opinion that is founded in any prejudice or bigotry on my part. After all, I didn't write the bible so you can't attribute its authorship to me. Nor can you claim that by quoting it I am giving you my opinion. And neither is it a loveless act to tell the truth from a spiritual perspective. In fact, at the judgement you will learn to your despair that your open acceptance and embrace of the active, rebellious and sinful lifestyles the bible refers to was what condemned them, you and was inevitably the great lie and deception that you represented to those you claimed to care about in life. \n \n You deceive yourself and them while condemning we who tell you the hard but plain spiritual truth that you may not want to hear but will save the hearer who is convicted by the truth and changes their way by turning away from that which separates them from the God who died for their sins.\n\n \n There will be no judgment, AA. When you die, you're dead. That's it. No more. Only a memory. YOU WILL NOT EXIST.", 
   {}, 
   277787, 
   null, 
   1186855680.0
  ], 
  [
   277791, 
   null, 
   "Archangel", 
   "There is not one \"Biblical perspective\", there are many.\n http://www.whosoever.org/v4i4/millennium.html\n http://www.whosoever.org/v12i1/royal.shtml\n \n Both Biblical literalists and evangelicals, neither believe it's wrong to be gay.\n\n \n Don't twist my words. It is homosexuality that is condemned in the bible, not homosexuals. The act is what leads to death and separation from God. As I've said repeatedly, Jesus died for all men, gays included. But they must repent and turn away from their sinful activities just as a straight man must turn away from and repent from his sinful predominant sins too. God is not a respecter of men and wont give gays a special pass just as He doesn't give straights the excuse that \"it's who I was Lord\".", 
   {}, 
   277782, 
   null, 
   1186855920.0
  ], 
  [
   277813, 
   null, 
   "lesz", 
   "Don't twist my words. It is homosexuality that is condemned in the bible, not homosexuals. The act is what leads to death and separation from God. As I've said repeatedly, Jesus died for all men, gays included. But they must repent and turn away from their sinful activities just as a straight man must turn away from and repent from his sinful predominant sins too. God is not a respecter of men and wont give gays a special pass just as He doesn't give straights the excuse that \"it's who I was Lord\".\n\n \n Archie, no-one is denying you the right to live your life according to your religious beliefs. It's when your religious beliefs intrude upon the lives of gay citizens that problems arise. This is the issue with militant Christianity right now, which uses gays as a scapegoat to loosen the purse strings of the flock.\n \n It simply isn't acceptable to describe gay love as sinful. Certainly, it isn't acceptable to gay people.", 
   {}, 
   277791, 
   null, 
   1186860960.0
  ], 
  [
   277814, 
   null, 
   "Matthew S", 
   "Don't twist my words. It is homosexuality that is condemned in the bible, not homosexuals. The act is what leads to death and separation from God. As I've said repeatedly, Jesus died for all men, gays included. But they must repent and turn away from their sinful activities just as a straight man must turn away from and repent from his sinful predominant sins too. God is not a respecter of men and wont give gays a special pass just as He doesn't give straights the excuse that \"it's who I was Lord\".\n\n \n And how many times must we repeat that we can not any more seperate ourselves from our homosexuality then hetero can seperate themselves form their heterosexuality. To condem the homosexuality is to condem the homosexual.", 
   {}, 
   277791, 
   null, 
   1186861080.0
  ], 
  [
   277816, 
   null, 
   "samiinh", 
   "And how many times must we repeat that we can not any more seperate ourselves from our homosexuality then hetero can seperate themselves form their heterosexuality. To condem the homosexuality is to condem the homosexual.\n\n \n We should probably just put this troll on ignore. He will never accept gay people for who they are. It is a fruitless waste of time trying to make him understand. It is beyond his understanding quotient.", 
   {}, 
   277814, 
   null, 
   1186861200.0
  ], 
  [
   277817, 
   null, 
   "samiinh", 
   "The gay guy's brother was a custodian at the Arlington, TX megachurch, the reason they wanted the memorial service there. The pastor lied saying that the memorial video that the family put together showed the deceased engaged in kissing and groping another male, whereas the sister says there was only one picture of the couple sitting on a sofa, not touching. What tipped off the church was the obituary in the newspaper which mentioned a \"life-partner\".\n \n According to my local paper, the decorated Navy vet had donated his body to science so it was only a memorial service, his body not even to be in the church. Funerals are for the living anyway.\n \n Grant in Houston | Homepage | 08.11.07 - 1:35 pm | #\n \n Man, there is just no stopping the hatred from all those x-tian big-box churches.\n \n We could certainly use a few more lions...\n GregOutWest | Homepage | 08.11.07 - 1:37 pm | # \n \n From Amerablog.com", 
   {}, 
   277816, 
   null, 
   1186861440.0
  ], 
  [
   277820, 
   null, 
   "jitobear", 
   "That is exactly what i am saying, and it isn't a suggestion but a fact. Those same churches deny the existence of hell even though the bible is clear that it's a real place.\n\n \n Not a Christian and I don't really care - but I have read the Bible and it is NOT clear. And I do know that of the three words translated into \"hell\" only one was a 'place' and thats Gehena - a place where gardbage was burned or human sacrifices occured (I have heard both) - but in any case aligns itself more as a metaphor for destruction than eternal torment. There are some passages where it does seem to imply a place but they are vague.\n \n Its also more than a little hard to swallow that \"God is love\" when he engages in torture That love reminds me a bit of how my abusive ex-husband loved me.\n \n In any case - my point is that its not CLEAR and if it were there would be no debate.\n \n Expand your thinking - - What Archangel thinks/feels/likes/believes/wants is not the clear-cut-obvious answer for everyone. Get over thyself.\n \n \"You speak unskilfully: or, if your knowledge be more, it is much darkened in your malice.\" ~ William Shakespeare", 
   {}, 
   277771, 
   null, 
   1186863300.0
  ], 
  [
   277821, 
   null, 
   "Jo Bennett", 
   "Don't twist my words. It is homosexuality that is condemned in the bible, not homosexuals. The act is what leads to death and separation from God. As I've said repeatedly, Jesus died for all men, gays included. But they must repent and turn away from their sinful activities just as a straight man must turn away from and repent from his sinful predominant sins too. God is not a respecter of men and wont give gays a special pass just as He doesn't give straights the excuse that \"it's who I was Lord\".\n\n \n Are you going to even read the articles I posted from evangelicals who disagree with your interpretation or are you just going to repeat the same baseless assertions you make every time your interpretation of the Bible is challenged? If I wanted a fire and brimstone sermon I would go to a fundie church.", 
   {}, 
   277791, 
   null, 
   1186863300.0
  ], 
  [
   277840, 
   null, 
   "Archangel", 
   "Are you going to even read the articles I posted from evangelicals who disagree with your interpretation or are you just going to repeat the same baseless assertions you make every time your interpretation of the Bible is challenged? If I wanted a fire and brimstone sermon I would go to a fundie church.\n\n \n Those aren't evangelical bible believing sources Jo, they are gay sources calling themselves evangelicals in order to sound credible to schmucks who don't know any better so they will be accepted as objective authorities. The fact remains Jo that if they were interpreting the passages in question objectively they would agree with the Theologians who have concurred with each other for thousands of years now on what the proper interpretation of these words are. So please don't try to pass off gay sources as legitimate and valid as if they are seeking an objective truth, because the sources you posted are selling an idea, not interpreting the bible in search of Gods truth.", 
   {}, 
   277821, 
   null, 
   1186873800.0
  ], 
  [
   277841, 
   null, 
   "Jo Bennett", 
   "One of the writers was straight, one of them was gay. You're simply falling back on the \"no true Scotsman\" fallacy. Is it too hard for you to believe that people will honestly go searching for God's will and come back with a different answer to you? Are you so convinced that you have discerned the will of God correctly that you are not prepared to countenance the possibility that you are wrong? And since when did someone who believes in  sola scriptura  start appealing to the tradition of the church as to what the will of God is. It was the consensus among theologians for 1500 years that the bread and wine are substantially changed into the body and blood of Christ, based on a literal reading of the Gospels where Jesus say \"this is my body, broken for you\", \"this is my blood, shed for you\". Now half of Christianity (including pretty much all protestants) rejects this and claims the passage is figurative. How come your regard for the tradition of the church extends to peripheral issues of sexual morality but not to central elements such as the Eucharist? How about the authority of Peter? The tradition of the church is that Christ refers to Peter as the rock, and appointed him head of the church on earth, based on the passage that says \"You are Peter, and on this rock I will build my church\". Now I apologise if I'm incorrect about what you do and don't believe, but I think my point stands regardless of the specifics.", 
   {}, 
   277840, 
   null, 
   1186874700.0
  ], 
  [
   277850, 
   null, 
   "samiinh", 
   "AA will be in for a big surprise on that special day when he takes his last breath. He will never know that he will become dust. There is no heaven, no hell, no god, no god/man. He will have wasted his life chasing fantasies. How sad.", 
   {}, 
   277841, 
   null, 
   1186882080.0
  ], 
  [
   277854, 
   null, 
   "Phyllis", 
   "AA will be in for a big surprise on that special day when he takes his last breath. He will never know that he will become dust. There is no heaven, no hell, no god, no god/man. He will have wasted his life chasing fantasies. How sad.\n\n \n Since this is so far off topic anyway...\n \n It seems to me that if there is no heaven, no hell, no god, no god/man, then everyone's life is a waste no matter what they choose to chase after. And, given the premises set forth, I do not know how one can begin to say whether that is a sad thing or a happy thing; a good thing or a bad thing.", 
   {}, 
   277850, 
   null, 
   1186882800.0
  ], 
  [
   277856, 
   null, 
   "thelmoose", 
   "AA will be in for a big surprise on that special day when he takes his last breath. He will never know that he will become dust. There is no heaven, no hell, no god, no god/man. He will have wasted his life chasing fantasies. How sad.\n\n \n There are worse things than chasing fantasies, I guess. I just wish he would do it on his own and leave the rest of the world out of it.", 
   {}, 
   277850, 
   null, 
   1186883460.0
  ], 
  [
   277857, 
   null, 
   "samiinh", 
   "Here is a website for AA and his ilk: http://www.godisimaginary.com/", 
   {}, 
   277856, 
   null, 
   1186883880.0
  ], 
  [
   277858, 
   null, 
   "samiinh", 
   "There are worse things than chasing fantasies, I guess. I just wish he would do it on his own and leave the rest of the world out of it.\n\n \n What gets me is his moralizing and sense of superiority that comes from his believing in fantasies. He's welcome to do that, but keep it to himself. His comments are offensive and show that he is truly ignorant and hateful.", 
   {}, 
   277856, 
   null, 
   1186883940.0
  ], 
  [
   277865, 
   null, 
   "jyoshu", 
   "Here is a website for AA and his ilk: http://www.godisimaginary.com/\n\n \n I have no problem with you arguing for gay rights, against AA. But I can't understand for the life of me why you are apparently incapable of going a single thread without basically trying to evangelize your atheism. Do you really think you're going to persuade AA that his beliefs are not real any more than he's going to persuade you that they are? Why do you keep getting off-topic over and over? Such as this ...\n \n \nAA will be in for a big surprise on that special day when he takes his last breath. He will never know that he will become dust. There is no heaven, no hell, no god, no god/man. He will have wasted his life chasing fantasies. How sad.\n\n \n Then no, he won't get any surprise at all. He'll experience nothing, if it's the way you say it is. And it would be no different from you, because you'll have chased desires and dreams only to ultimately die as well. In your view of the afterlife (or rather non-view of it), you'll be no better off than AA. (I'm reminded of Pascal's wager.)", 
   {}, 
   277850, 
   null, 
   1186886700.0
  ], 
  [
   277868, 
   null, 
   "smiley", 
   "(I'm reminded of Pascal's wager.)\n\n \n I bet you a week's wages it's a triangle.emoticon_xclown", 
   {}, 
   277865, 
   null, 
   1186888440.0
  ], 
  [
   277878, 
   null, 
   "GiantOreo", 
   "I don't think the issue here is that the church refused to do the funeral - they have every right to do so.\n \n The problem here is that they AGREED to do the funeral, and, at least according to the family, had known he had been gay, and then, 24 hours before the funeral, they \"CANCELLED\" it, because they saw some pictures of this man with his husband/life partner.\n \n The issue here is how heartless this makes these people look. I certainly hold no respect for this church, and would never set foot in it, and I'm not even gay!", 
   {}, 
   277688, 
   null, 
   1186896720.0
  ], 
  [
   277898, 
   null, 
   "Archangel", 
   "One of the writers was straight, one of them was gay. You're simply falling back on the \"no true Scotsman\" fallacy. Is it too hard for you to believe that people will honestly go searching for God's will and come back with a different answer to you? Are you so convinced that you have discerned the will of God correctly that you are not prepared to countenance the possibility that you are wrong?\n \n \n No Jo, I'm falling back on the truth as laid out in Gods Word. And I refuse to compromise those principles just as the Church that is the focus of this thread refuses to for the same exact reason. You attack my stubbornness as if I'm the only person who believes as I do. I rely on the entire biblical record, the teachings of the Apostles and the Holy Spirit which indwells me to determine what is the true interpretations of the bible. It isn't based on my personal preferences or beliefs in any way, unlike those who insist that homosexuality is ok with God which flies in the face of every scripture that refers to it in the Old and New Testament \n \n \nAnd since when did someone who believes in  sola scriptura  start appealing to the tradition of the church as to what the will of God is. It was the consensus among theologians for 1500 years that the bread and wine are substantially changed into the body and blood of Christ, based on a literal reading of the Gospels where Jesus say \"this is my body, broken for you\", \"this is my blood, shed for you\". Now half of Christianity (including pretty much all protestants) rejects this and claims the passage is figurative. How come your regard for the tradition of the church extends to peripheral issues of sexual morality but not to central elements such as the Eucharist?\n \n \n You are again confusing me with a Catholic or an Anglican who is another good example of those who have corrupted the original teachings of Christ and the bible. I don't seek any church or men to clarify or interpret the Word for me but do agree with the interpretations of some. It isn't the RCC liturgies, legalisms or man made regulations designed to force submission to the church rather than God that I follow.\n \n \nHow about the authority of Peter? The tradition of the church is that Christ refers to Peter as the rock, and appointed him head of the church on earth, based on the passage that says \"You are Peter, and on this rock I will build my church\". Now I apologise if I'm incorrect about what you do and don't believe, but I think my point stands regardless of the specifics.\n\n \n Again, you refer to the RCC interpretation which I have never followed or believed in regarding Peter as the first Pope of the Church. But to answer your question, Jesus was referring to Himself as the Rock upon which the church will be built, not any man at all. See Isaiah foretold of His coming.\n Isa 28:16 Therefore thus says the Lord GOD, \"Behold, I am laying in Zion a stone, a tested stone, A costly cornerstone {for} the foundation, firmly placed. He who believes {in it} will not be disturbed.\n And here from Psalms is the prophecy of His coming, followed by the New Testament proclamation by the Lord that HE is that Cornerstone of our Faith, not Peter whom the RCC has wrongly used as a pawn to elevate a man to the rank of infallibility. \n \n Psa 118:22 The stone which the builders rejected Has become the chief corner {stone.}\n Mat 21:42 Jesus *said to them, \"Did you never read in the Scriptures, 'THE STONE WHICH THE BUILDERS REJECTED, THIS BECAME THE CHIEF CORNER {stone;} THIS CAME ABOUT FROM THE LORD, AND IT IS MARVELOUS IN OUR EYES'?\n Mar 12:10 \"Have you not even read this Scripture: 'THE STONE WHICH THE BUILDERS REJECTED, THIS BECAME THE CHIEF CORNER {stone;}\n Luk 20:17 But Jesus looked at them and said, \"What then is this that is written: 'THE STONE WHICH THE BUILDERS REJECTED, THIS BECAME THE CHIEF CORNER {stone}'?\n Act 4:11 \"He is the STONE WHICH WAS REJECTED by you, THE BUILDERS, {but} WHICH BECAME THE CHIEF CORNER {stone.}\n 1Pe 2:7 This precious value, then, is for you who believe; but for those who disbelieve, \"THE STONE WHICH THE BUILDERS REJECTED, THIS BECAME THE VERY CORNER {stone,}\"", 
   {}, 
   277841, 
   null, 
   1186916760.0
  ], 
  [
   277901, 
   null, 
   "samiinh", 
   "Am I the only one who is tired of the evangelizing of AA and his ilk on this forum? Please give it a break.", 
   {}, 
   277898, 
   null, 
   1186919160.0
  ], 
  [
   277904, 
   null, 
   "JSDKoeln", 
   "Am I the only one who is tired of the evangelizing of AA and his ilk on this forum? Please give it a break.\n\n \n His last post was really scary.", 
   {}, 
   277901, 
   null, 
   1186921200.0
  ], 
  [
   277907, 
   null, 
   "Archangel", 
   "His last post was really scary.\n\n \n Wow, posting biblical passages scares you, but living in rebellion to Gods principles doesn't ? You know there's a word for that. emoticon_rolleyes", 
   {}, 
   277904, 
   null, 
   1186923000.0
  ], 
  [
   277909, 
   null, 
   "JSDKoeln", 
   "Wow, posting biblical passages scares you, but living in rebellion to Gods principles doesn't ? You know there's a word for that. emoticon_rolleyes\n\n \n what's the word archie? Give God a call and ask him for me since it appears you have a direct phone line and know exactly what he wants. :xbanghead You just will never get it.", 
   {}, 
   277907, 
   null, 
   1186923300.0
  ], 
  [
   277914, 
   null, 
   "jitobear", 
   "I have no problem with you arguing for gay rights, against AA. But I can't understand for the life of me why you are apparently incapable of going a single thread without basically trying to evangelize your atheism. Do you really think you're going to persuade AA that his beliefs are not real any more than he's going to persuade you that they are? Why do you keep getting off-topic over and over? Such as this ...\n\n \n I agree that any kind of proselitizing is tedious - but no the atheists are hardly as bad as some of the Christians in here in that regard.", 
   {}, 
   277865, 
   null, 
   1186930440.0
  ], 
  [
   277915, 
   null, 
   "Phyllis", 
   "Am I the only one who is tired of the evangelizing of AA and his ilk on this forum? Please give it a break.\n\n \n Might I suggest that you put him on ignore or simply stop replying to his posts?", 
   {}, 
   277901, 
   null, 
   1186930500.0
  ], 
  [
   277918, 
   null, 
   "Jo Bennett", 
   "You missed my point entirely, AA. I was saying that you reject the traditional view of the church in many areas, despite the scripture in favour of it. You twist the words of Jesus to make him the rock on which the church will be built, when it is quite clear he is referring to Peter. You reject the passages in the Gospels that point to the real presence, and follow your own path. The reason you follow the traditional teaching about homosexuality is not because it's the tradition, or because it makes any sort of sense in the context of Christ's teaching about love, but because it suits your prejudices.", 
   {}, 
   277915, 
   null, 
   1186931820.0
  ], 
  [
   277920, 
   null, 
   "Archangel", 
   "The reason you follow the traditional teaching about homosexuality is not because it's the tradition, or because it makes any sort of sense in the context of Christ's teaching about love, but because it suits your prejudices.\n\n \n That is a huge LIE and an assumption that you have no right to make since you don't even know me personally. I have absolutely no personal animosity against gays at all, never have and have never abused or insulted one person in my whole life for being gay or even effeminate. When i was in school and certain kids were targeted for insults and abuse in such ways, I not only didn't participate in such abuses but defended the underdogs no matter what the reason for abusing them was. You see that has always been my nature. I have always been sensitive, empathetic and sympathetic to the pain and suffering of others, and have never had to abuse others in order to feel better about myself.\n \n My stance against homosexuality in these debates is and has always been based on the biblical condemnation of it as a sexual practice. Those who continue to condemn me as a bigot or prejudice just reinforce their own bigotry against christians, and total ignorance since I have repeatedly insisted that GAY PEOPLE need not be condemned as God sent Jesus to die for their sins just as Jesus died for my sins. \n \n Does Phelps offer salvation to gays or does he insist that all fags will burn and anyone who doesn't condemn them will burn too ? He reflects true prejudice and bigotry yet you attempt to paint me with the same broad brush no matter how many times I show by my words that isn't how I view gay people. But I will never accept the practice of homosexuality as good, normal and morally right in order to compromise Gods Word with spiritually dead people who can't see past their own limited perspective and personal self interests. And you can take that to the bank.", 
   {}, 
   277918, 
   null, 
   1186935420.0
  ], 
  [
   277925, 
   null, 
   "samiinh", 
   "Might I suggest that you put him on ignore or simply stop replying to his posts?\n\n \n Maybe we all should.", 
   {}, 
   277915, 
   null, 
   1186936560.0
  ], 
  [
   277926, 
   null, 
   "samiinh", 
   "That is a huge LIE and an assumption that you have no right to make since you don't even know me personally. I have absolutely no personal animosity against gays at all, never have and have never abused or insulted one person in my whole life for being gay or even effeminate. When i was in school and certain kids were targeted for insults and abuse in such ways, I not only didn't participate in such abuses but defended the underdogs no matter what the reason for abusing them was. You see that has always been my nature. I have always been sensitive, empathetic and sympathetic to the pain and suffering of others, and have never had to abuse others in order to feel better about myself.\n \n My stance against homosexuality in these debates is and has always been based on the biblical condemnation of it as a sexual practice. Those who continue to condemn me as a bigot or prejudice just reinforce their own bigotry against christians, and total ignorance since I have repeatedly insisted that GAY PEOPLE need not be condemned as God sent Jesus to die for their sins just as Jesus died for my sins. \n \n Does Phelps offer salvation to gays or does he insist that all fags will burn and anyone who doesn't condemn them will burn too ? He reflects true prejudice and bigotry yet you attempt to paint me with the same broad brush no matter how many times I show by my words that isn't how I view gay people. But I will never accept the practice of homosexuality as good, normal and morally right in order to compromise Gods Word with spiritually dead people who can't see past their own limited perspective and personal self interests. And you can take that to the bank.\n\n \n Your bible says that gays should be killed, along with girls who are not virgins, young people who speak against their parents, and people who labor on sundays. You better get a huge pile of stones there archie to do all this killing your loving god demands of you.", 
   {}, 
   277920, 
   null, 
   1186936680.0
  ], 
  [
   277928, 
   null, 
   "thelmoose", 
   "\n \n (First part)You missed my point entirely, AA. I was saying that you reject the traditional view of the church in many areas, despite the scripture in favour of it. You twist the words of Jesus to make him the rock on which the church will be built, when it is quite clear he is referring to Peter. You reject the passages in the Gospels that point to the real presence, and follow your own path. \n \n \n \n \n (second part) The reason you follow the traditional teaching about homosexuality is not because it's the tradition, or because it makes any sort of sense in the context of Christ's teaching about love, but because it suits your prejudices.\n\n \n \n I have absolutely no personal animosity against gays at all, never have and have never abused or insulted one person in my whole life for being gay or even ...\n \n blah, blah, woof, woof...\n \n \n ... And you can take that to the bank.\n\n \n arch. You ignored the first part of Jo's response. The part where you are accused of missing the point.\n \n I know you never miss a chance to tell us how you loves them gays, though you words ring extremely hollow in light of your usual vitriol. In any event, I am interested in your response to the first part.", 
   {}, 
   277926, 
   null, 
   1186939680.0
  ], 
  [
   277931, 
   null, 
   "Archangel", 
   "arch. You ignored the first part of Jo's response. The part where you are accused of missing the point.\n \n I know you never miss a chance to tell us how you loves them gays, though you words ring extremely hollow in light of your usual vitriol. In any event, I am interested in your response to the first part.\n\n \n Go back and actually read my response to those points moose. Jo may not have liked my responses but I answered them.", 
   {}, 
   277928, 
   null, 
   1186942080.0
  ], 
  [
   277933, 
   null, 
   "Foxtuba", 
   "Why is AA pretending to be a Christian? He's acting like that he's the one that's being persecuted, and this isn't about him at all...instead, he's craving so much attention, which is sooooo un-Christianlike. \n \n Please try and act your age...or act like a Christian?", 
   {}, 
   277931, 
   null, 
   1186942980.0
  ], 
  [
   277937, 
   null, 
   "Jo Bennett", 
   "Go back and actually read my response to those points moose. Jo may not have liked my responses but I answered them.\n\n \n I don't see how you can have answered them as you thought I was saying the exact opposite of what I was saying.", 
   {}, 
   277931, 
   null, 
   1186943460.0
  ], 
  [
   277939, 
   null, 
   "Zardoz", 
   "Guys, of course the pastor lied. Word of Faithers lie all the time. It's what they do best. Even lie about the very bible they purportedly preach from.\n \n This is a Word of Faith (I'm sick of hearing 'non-denominationalism tossed about to confuse people as to what you really are) church. Olsteen is WofF and his sis wouldn't marry someone who isn't.\n \n In all likelihood, he agreed to host the service because that's what they do. Pretty much accept anything...without thinking. They don't preach on thinking, they preach on going with your heart/ gut instinct.\n \n What more than likely happened is several prominant congregants got wind that it was for a gay man and raised a hissy fit.\n Rather than keep his word and host the service, they cancelled.\n The alternative would be to run the risk of losing a huge chunk of your 'tithes and offerings' paying followers, run the risk of losing your money maker scam and gain the ire of your fellow WolF's. And with WofF's, such mutual support IS vitally important. Gary boy most certainly 'name drops' that he's related to Olsteen and runs with the 'big dogs'. \n It could even have been that Olsteen raised the fit, refusing to make any guest appearances (that REALLY raise huge amounts of money and get an upswing in attendance) if the service were to go through.\n \n Anyone who cares to listen to the easy on the ears sermons from Olsteen would know that this variety of WofF (and there are different styles) doesn't focus on the fire and brimstone but is fairly inclusive.\n This is one of the major attacks 'hard core evangelicals' have against Olsteen.\n \n Geesh guys, there's more of a meta game going on here than 'Christians hateth thy gays'.\n 99 to 1 says it's about pleasing the masses and following the money that they bring in.\n Even if he were to lose a multi-million dollar lawsuit to the gay man's family, he'd MORE than make that back up in support from supporters of his stance.\n \n A cynical Zardoz would even say that this was intentional.\n The man's now in the news...where he's a champion for the cause.\n I dare anyone to call and ask if attendance is up at his church. Oh the mileage they can get out of this. Worth MILLIONS.\n \n I love it when the sheep come to support the wolf...all because the wolf wears sheep's clothing.\n \n \n \n As to the jist of the thread.\n I think any religion should be allowed to set it's standards on what it accept and what it discards.\n If you don't like it, go form your own club.", 
   {}, 
   277933, 
   null, 
   1186944720.0
  ], 
  [
   277941, 
   null, 
   "jitobear", 
   "I have absolutely no personal animosity against gays at all, never have and have never abused or insulted one person in my whole life for being gay or even effeminate.\n\n \n \n I have witnessed otherwise on this board. Just beacuse you justify it with religion does not mean that your are not insulting.", 
   {}, 
   277920, 
   null, 
   1186948800.0
  ], 
  [
   277947, 
   null, 
   "JSDKoeln", 
   "Originally Posted by Archangel \n I have absolutely no personal animosity against gays at all, never have and have never abused or insulted one person in my whole life for being gay or even effeminate.\n \nI have witnessed otherwise on this board. Just beacuse you justify it with religion does not mean that your are not insulting.\n\n \n That was one of the funniest things he's ever said! WOW! Can't believe he actually thinks that!", 
   {}, 
   277941, 
   null, 
   1186950960.0
  ], 
  [
   277951, 
   null, 
   "Archangel", 
   "Why is AA pretending to be a Christian? He's acting like that he's the one that's being persecuted, and this isn't about him at all...instead, he's craving so much attention, which is sooooo un-Christianlike. \n \n Please try and act your age...or act like a Christian?\n\n \n You're TROLLING again tuba, either make an on topic contribution to the debate or stop wasting bandwidth. This isn't about personally attacking me but about the subject raised in the OP. Why can't you and samiinh get that ? emoticon_xdonno :xbanghead", 
   {}, 
   277933, 
   null, 
   1186951380.0
  ], 
  [
   277953, 
   null, 
   "Archangel", 
   "Originally Posted by Archangel \n I have absolutely no personal animosity against gays at all, never have and have never abused or insulted one person in my whole life for being gay or even effeminate.\n \n \n That was one of the funniest things he's ever said! WOW! Can't believe he actually thinks that!\n\n \n You need to learn the difference between living in the real world and defending a position on a debate forum JSD. Of course you would like to think I'm some rabid religionist who is sitting here frothing over my keyboard but we both know that more accurately describes your sides hatred for christians whom you condemn and demonize at every turn.", 
   {}, 
   277947, 
   null, 
   1186951860.0
  ], 
  [
   277955, 
   null, 
   "thelmoose", 
   "Go back and actually read my response to those points moose. Jo may not have liked my responses but I answered them.\n\n \n You did not respond to the first part:\n ... you reject the traditional view of the church in many areas, despite the scripture in favour of it. You twist the words of Jesus to make him the rock on which the church will be built, when it is quite clear he is referring to Peter. You reject the passages in the Gospels that point to the real presence, and follow your own path.", 
   {}, 
   277931, 
   null, 
   1186952400.0
  ], 
  [
   277956, 
   null, 
   "thelmoose", 
   "Geesh guys, there's more of a meta game going on here than 'Christians hateth thy gays'.\n 99 to 1 says it's about pleasing the masses and following the money that they bring in.\n Even if he were to lose a multi-million dollar lawsuit to the gay man's family, he'd MORE than make that back up in support from supporters of his stance.\n \n\n \n Absolutely, \n Gays are merely the enemy du jour. \n And a stereo-typical enemy is an essential for profit mongering. \n And a pretty good target at that. The fat little pastor probably has no problem with gays, but the sheep think they don't know any and they make a great \"other\". They can lump the gays in with the rest of them smarty-pants, citified, artsy, decadent, liberal, atheistic heathens who hate us.", 
   {}, 
   277939, 
   null, 
   1186952820.0
  ], 
  [
   277963, 
   null, 
   "JSDKoeln", 
   "You need to learn the difference between living in the real world and defending a position on a debate forum JSD. Of course you would like to think I'm some rabid religionist who is sitting here frothing over my keyboard but we both know that more accurately describes your sides hatred for christians whom you condemn and demonize at every turn.\n\n \n I live in the real world. I'm married to a man. I know what it is to be a gay man. You don't. I know what prejudice feels like. I know what it's like to have my rights denied. You don't. Jito has a ton of information on the mental issues involving molestation and rape.... YOu just blather your insults to her, to me and everyone else and hide behind a religion where you claim to have a direct line to god. Heck, even in one of your recent posts, you denounced 1 billion catholics and millions of anglicans, saying you know better than them. And I need to live in the real world? I'll take a billion catholics and anglicans over you ANY day! You have insulted almost everyone that has refuted your postions. Even people on the anti-gay marriage side are feeling sympothy to those you attack. They are starting to call you on your nastiness. AA, you're an easy one to get riled up so easy... and yes, you DO sit in front of your keyboard frothing. You and your useless blather are funny and I laugh at you most of the time... However, I think you're very dangerous.....", 
   {}, 
   277953, 
   null, 
   1186953960.0
  ], 
  [
   277967, 
   null, 
   "samiinh", 
   "Poor Arch. How sad. I sure wouldn't want to be him.", 
   {}, 
   277963, 
   null, 
   1186956180.0
  ], 
  [
   277975, 
   null, 
   "GiantOreo", 
   "Guys, of course the pastor lied. Word of Faithers lie all the time. It's what they do best. Even lie about the very bible they purportedly preach from.\n \n This is a Word of Faith (I'm sick of hearing 'non-denominationalism tossed about to confuse people as to what you really are) church. Olsteen is WofF and his sis wouldn't marry someone who isn't.\n \n In all likelihood, he agreed to host the service because that's what they do. Pretty much accept anything...without thinking. They don't preach on thinking, they preach on going with your heart/ gut instinct.\n \n What more than likely happened is several prominant congregants got wind that it was for a gay man and raised a hissy fit.\n Rather than keep his word and host the service, they cancelled.\n The alternative would be to run the risk of losing a huge chunk of your 'tithes and offerings' paying followers, run the risk of losing your money maker scam and gain the ire of your fellow WolF's. And with WofF's, such mutual support IS vitally important. Gary boy most certainly 'name drops' that he's related to Olsteen and runs with the 'big dogs'. \n It could even have been that Olsteen raised the fit, refusing to make any guest appearances (that REALLY raise huge amounts of money and get an upswing in attendance) if the service were to go through.\n \n Anyone who cares to listen to the easy on the ears sermons from Olsteen would know that this variety of WofF (and there are different styles) doesn't focus on the fire and brimstone but is fairly inclusive.\n This is one of the major attacks 'hard core evangelicals' have against Olsteen.\n \n Geesh guys, there's more of a meta game going on here than 'Christians hateth thy gays'.\n 99 to 1 says it's about pleasing the masses and following the money that they bring in.\n Even if he were to lose a multi-million dollar lawsuit to the gay man's family, he'd MORE than make that back up in support from supporters of his stance.\n \n A cynical Zardoz would even say that this was intentional.\n The man's now in the news...where he's a champion for the cause.\n I dare anyone to call and ask if attendance is up at his church. Oh the mileage they can get out of this. Worth MILLIONS.\n \n I love it when the sheep come to support the wolf...all because the wolf wears sheep's clothing.\n \n \n \n As to the jist of the thread.\n I think any religion should be allowed to set it's standards on what it accept and what it discards.\n If you don't like it, go form your own club.\n\n \n Oh, I guess I missed that they were a WofF church. I guess that really explains it all, doesn't it? emoticon_xagree", 
   {}, 
   277939, 
   null, 
   1186961160.0
  ], 
  [
   277982, 
   null, 
   "Archangel", 
   "You did not respond to the first part:\n ... you reject the traditional view of the church in many areas, despite the scripture in favour of it. You twist the words of Jesus to make him the rock on which the church will be built, when it is quite clear he is referring to Peter. You reject the passages in the Gospels that point to the real presence, and follow your own path.\n\n \n Wrong again moose. The Catholic church rejects the traditional view of the Bible as it is written. There is no law that say's anyone must accept what the RCC says is the proper interpretation of the bible as the RCC is also a man made institution and has been most assuredly corrupted. Here's one example regarding how they have elevated Mary to the level of Deity which is blasphemy by any definition of the word.\n Catholic Mariology\n \n \n \n \n \n What is Mariology? Essentially, it's the theology that affords devotion to Mary. Does this mean the Catholics worship Mary? Well, yes and no. Publicly, the Roman Catholic Church does not afford Mary the same status as Jesus. However, their reverence for her goes beyond their admiration for even the saints. The Catholic Encyclopedia details a view of Mary that it admits is not Biblical. Their view of her life and her role originate in Catholic tradition - that is, the writings of the popes and theologians, rather than in the Bible. \n \n Biblically, Mary was betrothed to Joseph. Because of her faith, she was chosen to give birth to the Messiah, Jesus Christ. She was overshadowed by the Holy Spirit, and conceived Jesus. There was no physical union, and therefore Jesus was born of a virgin. While no doubt a faithful and godly woman, Mary was nonetheless just a woman. In fact, apart from Acts 1:14, Mary is not mentioned anywhere outside the Gospels (the books of Matthew, Mark, Luke, and John). Even in the Gospels, her spiritual power and authority are almost non-existent. Neither Jesus, nor Paul, nor any other biblical writer ever gave Mary the place or devotion that the Catholic Church has given her. The New Testament epistles (letters) were written for the spiritual guidance of the Church, and have a great deal to say about doctrine and worship. Her absence from the epistles must then call into doubt the role that Catholics ascribe to her. \n \n In Roman Catholicism, Mary (or as she's also called: Our Blessed Lady, Our Blessed Virgin, etc.) is more than human. Catholic Tradition includes the following teachings:\n \n 1 - Mary's immaculate conception: This doctrine teaches that she was born without original sin, and was therefore sinless throughout her life.\n \n 2 - During her tutelage in the temple as a child, Mary received almost nightly visits by angels. \n \n 3 - Mary's perpetual virginity: This doctrine asserts that she had no children before Jesus (a Biblical teaching) or after Him (unbiblical).\n \n 4 - Mary's physical ascension into heaven: This teaches that because of her sinlessness, Mary never experienced a physical death - the result of sin. Instead, she was raised bodily into the presence of Christ.\n \n 5 - Mary's role as Co-redemptrix and Mediatrix of all graces: This doctrine holds that the obedience and sufferings of Mary were essential to secure the full redemption bought by Christ.\n \n 6 - Mary's right to veneration and/or worship: This teaching holds that because of her unparalleled role in salvation, Mary is worthy of special adoration. \n \n There are three specific terms of worship in Catholicism: latria - adoration that is due God alone, dulia - veneration afforded to the saints, and hyperdulia - special veneration given to Mary. In practice, these become practically indistinguishable. As a matter of point, Catholics pray to Mary and expect that she hears and answers all such prayers. This elevates her to a position of deity. \n \n I have already mentioned that the role that is ascribed to Mary by Catholics is unbiblical. Let me give you more evidence of that. Below, I have included an excerpt from the Catholic Encyclopedia, where the writer acknowledges that their interpretation of a passage in the book of Genesis must be more accurate than the original Hebrew text, as their interpretation ascribes more power to Mary: \n \n The first prophecy referring to Mary is found in the very opening chapters of the Book of Genesis (3:15): \"I will put enmities between thee and the woman, and thy seed and her seed; she shall crush thy head, and thou shalt lie in wait for her heel.\" This rendering appears to differ in two respects from the original Hebrew text:\n \n (2) The second point of difference between the Hebrew text and our version concerns the agent who is to inflict the mortal wound on the servant: our version agrees with the present Vulgate text in reading \"she\" (ipsa) which refers to the woman, while the Hebrew text reads hu' (autos, ipse) which refers to the seed of the woman. According to our version, and the Vulgate reading, the woman herself will win the victory; according to the Hebrew text, she will be victorious through her seed. In this sense does the Bull \"Ineffabilis\" ascribe the victory to Our Blessed Lady. The reading \"she\" (ipsa) is neither an intentional corruption of the original text, nor is it an accidental error; it is rather an explanatory version expressing explicitly the fact of Our Lady's part in the victory over the serpent, which is contained implicitly in the Hebrew original. The strength of the Christian tradition as to Mary's share in this victory may be inferred from the retention of \"she\" in St. Jerome's version in spite of his acquaintance with the original text and with the reading \"he\" (ipse) in the old Latin version. [Highlighting added by Contender Ministries]\n \n For the record, the text of Genesis 3:15 mentioned above is found that way only in the Catholic version of the Bible. Other versions agree with the original Hebrew text in that the seed of the woman (Jesus) will do the crushing. The Catholic Church has changed scripture to fit with their doctrines. This tactic is the only way the Catholic Church can justify many of its teachings that are unbiblical. \n \n In his book, Revelation Unveiled, author Tim LaHaye says this\"\n \n \"One of the dangerous trends during the twentieth century in the Church of Rome is the elevation of Mary to a status just short of deity. News media reports indicate that millions have petitioned the Pope to declare her a member of the Trinity, though the official line is that it is not going to happen - yet. Already she is referred to as 'the mother of God' or 'the queen of Heaven' and in some instances appears to be the dispenser of salvation, which contradicts many Scriptures...To even suggest that anyone, even Mary the human mother of Jesus, participates in dispensing the gift of eternal life is not only heresy, it is blasphemous.\"\n \n As for the Catholic view of Mary as Mediatrix, let me refer you to:\n 1 Timothy 2:5, \"For there is one God and one mediator between God and men, the man Christ Jesus\"\n \n http://www.jesus-is-savior.com/False%20Religions/Roman%20Catholicism/catholic_mariology.htm", 
   {
    "unicode_changes_made": true
   }, 
   277955, 
   null, 
   1186964340.0
  ], 
  [
   277985, 
   null, 
   "samiinh", 
   "It is all a delusion. God is Imaginary. Jesus is Imaginary. Prayer doesn't work. It is all one big hoax. Normal, intelligent, rational people know this. Faith is saying the you believe what you know doesn't exist.", 
   {}, 
   277982, 
   null, 
   1186965060.0
  ], 
  [
   277986, 
   null, 
   "Jo Bennett", 
   "That's right, when you can't address the issue I actually raised, sidestep onto something else entirely.\n \n The allegation of Mary-worship is an old one, and your copy-paste analysis fails to take account of the idea of asking saints to intercede. It's not an idea I personally agree with but the idea of having people more righteous than us intercede on our behalf is found throughout the Old Testament.", 
   {}, 
   277982, 
   null, 
   1186965060.0
  ], 
  [
   277987, 
   null, 
   "Archangel", 
   "I live in the real world. I'm married to a man. I know what it is to be a gay man. You don't. I know what prejudice feels like. I know what it's like to have my rights denied. You don't. Jito has a ton of information on the mental issues involving molestation and rape.... YOu just blather your insults to her, to me and everyone else and hide behind a religion where you claim to have a direct line to god. Heck, even in one of your recent posts, you denounced 1 billion catholics and millions of anglicans, saying you know better than them. And I need to live in the real world? I'll take a billion catholics and anglicans over you ANY day! You have insulted almost everyone that has refuted your postions. Even people on the anti-gay marriage side are feeling sympothy to those you attack. They are starting to call you on your nastiness. AA, you're an easy one to get riled up so easy... and yes, you DO sit in front of your keyboard frothing. You and your useless blather are funny and I laugh at you most of the time... However, I think you're very dangerous.....\n\n \n I'm so dangerous I'm praying for you and your lost cohorts daily JSD. You think I fear what you represent JSD, when my fear is that you believe what you represent. You boast of your gayness and your marriage as if it's an accomplishment to be proud of. And that you know prejudice as if you are unique. And you defend Jito as if you actually know each other, you living in Germany and all. So who is deluding themselves JSD ? Who is claiming to have a handle on life when you have no idea why you even exist. \n \n And you accuse me of denouncing a billion catholics and anglicans when the only people who corrupted the doctrines that mislead the masses are the church fathers who have interpreted the bible to satisfy their shallow agendas. But you must lie about me, distort what I represent and imply that I am taking on those people who have been victimized by the leaders who have lied to them. You claim christians are sheeple yet when you meet one who wont be led around by the nose you attack me for not being a sheeple and for standing against the lies of a large and ancient institution. Make up your mind JSD, which is it anyway ?", 
   {}, 
   277963, 
   null, 
   1186965420.0
  ], 
  [
   277988, 
   null, 
   "Archangel", 
   "That's right, when you can't address the issue I actually raised, sidestep onto something else entirely.\n \n The allegation of Mary-worship is an old one, and your copy-paste analysis fails to take account of the idea of asking saints to intercede. It's not an idea I personally agree with but the idea of having people more righteous than us intercede on our behalf is found throughout the Old Testament.\n\n \n Really Jo ? Show me where in the Old Testament, any prophet or patriach prayed to dead men to intercede for them with God. Show me JUST ONE and I'll concede the point to you. Show me where anyone prayed to Adam, Abraham, Moses, Job, Elijah, Elisha, Daniel or any other dead Prophet ever for intercession to God on behalf of the living.", 
   {}, 
   277986, 
   null, 
   1186965720.0
  ], 
  [
   277989, 
   null, 
   "chemist99a", 
   "Funerals are held to console the living. The dead care not if they are buried or not. The deceased is beyond being harmed by homophobes at this point. He is beyond sexual preference or actions. He is beyond pretty much everything as a matter of fact. In other words it does come to a stop when one is dead. And it shall come to a stop for all of us someday.\n \n That said the church would seem to have the right to exercise their beliefs abhorrent though they might be. Its one of the prices we pay for freedom for our own beliefs.", 
   {}, 
   277688, 
   null, 
   1186965780.0
  ], 
  [
   277990, 
   null, 
   "thelmoose", 
   "Wrong again moose. The Catholic church rejects the traditional view of the Bible as it is written. There is no law that say's anyone must accept what the RCC says is the proper interpretation of the bible as the RCC is also a man made institution and has been most assuredly corrupted. Here's one example regarding how they have elevated Mary to the level of Deity which is blasphemy by any definition of the word.\n \n\n \n Nice change of subject.\n \n Jo specifically referred to the Peter \"and upon this rock I will build my church\" and \"this is MY body\" stuff. Please stop the evasion and address those topics. \n \n No one said anything about Mary. No one said anything about a law. Why must you try to change the topic?\n \n Lastly, how is it the \"man made institition\" of the RCC has a \"most assuredly corrupted\" interpretation of scripture, but you, a man, gets to interpret the same without corruption? \n \n You say your truth is \"objective\". The only truth to be found in that statement is that you don't understand what the word objective means.", 
   {}, 
   277982, 
   null, 
   1186966020.0
  ], 
  [
   277991, 
   null, 
   "Jo Bennett", 
   "Really Jo ? Show me where in the Old Testament, any prophet or patriach prayed to dead men to intercede for them with God. Show me JUST ONE and I'll concede the point to you. Show me where anyone prayed to Adam, Abraham, Moses, Job, Elijah, Elisha, Daniel or any other dead Prophet ever for intercession to God on behalf of the living.\n\n \n That's not what I said. I simply said that in the Old Testament people interceded on behalf of others. Abraham is recorded as interceding on behalf of the people of Sodom, for example. All the Prophets were carrying God's message to the people, they interceded between the people and God. Now will you stop twisting my words into something I didn't say.", 
   {}, 
   277988, 
   null, 
   1186966320.0
  ], 
  [
   277993, 
   null, 
   "samiinh", 
   "Proving that nobody can get into heaven.\n \n http://www.godisimaginary.com/video1.htm", 
   {}, 
   277991, 
   null, 
   1186966500.0
  ], 
  [
   277995, 
   null, 
   "Archangel", 
   "Nice change of subject.\n \n Jo specifically referred to the Peter \"and upon this rock I will build my church\" and \"this is MY body\" stuff. Please stop the evasion and address those topics. \n \n No one said anything about Mary. No one said anything about a law. Why must you try to change the topic?\n \n Lastly, how is it the \"man made institition\" of the RCC has a \"most assuredly corrupted\" interpretation of scripture, but you, a man, gets to interpret the same without corruption? \n \n You say your truth is \"objective\". The only truth to be found in that statement is that you don't understand what the word objective means.\n\n \n What is your major malfunction moose ? How many times must I answer a post to satisfy you ? Here is the post. Now read real slowly and you will see actual bible verses that I posted to support my claim regarding Peter and that jesus Himself referred to the OT Prophecy stating that He Himself was the STONE that the builders (Jews) rejected, became the cornerstone of our Faith. It wasn't Peter. And if you'll look real closely, you'll see that in 1st Peter, Peter himself referred to that OT Promise in regards to Jesus being the fulfillment of it. If that isn't good enough for you then that's just tough.\n \n http://www.4forums.com/political/showpost.php?p=277898&postcount=80", 
   {}, 
   277990, 
   null, 
   1186966980.0
  ], 
  [
   277997, 
   null, 
   "Jo Bennett", 
   "So basically your answer is that you ignore Christ's words because you can find Old Testament references that better suit your earthly theology?", 
   {}, 
   277995, 
   null, 
   1186967100.0
  ], 
  [
   277998, 
   null, 
   "thelmoose", 
   "What is your major malfunction moose ? How many times must I answer a post to satisfy you ? Here is the post. Now read real slowly and you will see actual bible verses that I posted to support my claim regarding Peter and that jesus Himself referred to the OT Prophecy stating that He Himself was the STONE that the builders (Jews) rejected, became the cornerstone of our Faith. It wasn't Peter. And if you'll look real closely, you'll see that in 1st Peter, Peter himself referred to that OT Promise in regards to Jesus being the fulfillment of it. If that isn't good enough for you then that's just tough.\n \n http://www.4forums.com/political/showpost.php?p=277898&postcount=80\n\n \n Those don't explain away\n \n \"And I tell you that you are Peter, and on this rock I will build my church, and the gates of Hades will not overcome it\"\n \n And I looked REALLY, REALLY closely. \n All I see is your vaguely related passages do not gainsay this in any way.", 
   {}, 
   277995, 
   null, 
   1186967520.0
  ], 
  [
   277999, 
   null, 
   "Archangel", 
   "That's right, when you can't address the issue I actually raised, sidestep onto something else entirely.\n \n The allegation of Mary-worship is an old one, and your copy-paste analysis fails to take account of the idea of asking saints to intercede. It's not an idea I personally agree with but the idea of having people more righteous than us intercede on our behalf is found throughout the Old Testament.\n\n \n \nThat's not what I said. I simply said that in the Old Testament people interceded on behalf of others. Abraham is recorded as interceding on behalf of the people of Sodom, for example. All the Prophets were carrying God's message to the people, they interceded between the people and God. Now will you stop twisting my words into something I didn't say.\n\n Again, really ? Note the bolded above, because that's exactly what you implied. You said SAINTS interceding for others. Regarding Abraham interceding for Sodom was not through any man but directly to the Lord. There is no point to be made as your original statement was regarding praying to saints to intercede for the living so your attempt to sidestep and cover the error of your implication doesn't hold water AT ALL.\n So I repeat,\n \n \nReally Jo ? Show me where in the Old Testament, any prophet or patriach prayed to dead men to intercede for them with God. Show me JUST ONE and I'll concede the point to you. Show me where anyone prayed to Adam, Abraham, Moses, Job, Elijah, Elisha, Daniel or any other dead Prophet ever for intercession to God on behalf of the living.\n", 
   {}, 
   277995, 
   null, 
   1186967700.0
  ], 
  [
   278000, 
   null, 
   "Jo Bennett", 
   "It also doesn't explain away Matthew 16:19, where Jesus clearly gives authority to Peter. It's a supremely bizarre interpretation that Jesus starts off talking to Peter, talks about himself with no indication that this is what he is doing, and then switches back to talking about Peter again. Unless you'd like to claim that Christ was giving himself the keys of the kingdom?", 
   {}, 
   277998, 
   null, 
   1186967760.0
  ], 
  [
   278005, 
   null, 
   "Archangel", 
   "Those don't explain away\n \n \"And I tell you that you are Peter, and on this rock I will build my church, and the gates of Hades will not overcome it\"\n \n And I looked REALLY, REALLY closely. \n All I see is your vaguely related passages do not gainsay this in any way.\n\n \n What I posted perfectly answers the question according to the OT promises of His Coming and the NT fulfillment of those promises. But here's more from the passage itself.\n \n Mat 16:13 \n When Jesus came into the region of Caesarea Philippi, He asked His disciples, saying, \"Who do men say that I, the Son of Man, am?\"\n Mat 16:14 \n So they said, \"Some say John the Baptist, some Elijah, and others Jeremiah or one of the prophets.\"\n Mat 16:15 \n He said to them, \"But who do you say that I am?\"\n Mat 16:16 \n Simon Peter answered and said, \"You are the Christ, the Son of the living God.\"\n Mat 16:17 \n Jesus answered and said to him, \"Blessed are you, Simon Bar-Jonah, for flesh and blood has not revealed this to you, but My Father who is in heaven.\n Mat 16:18 \n \"And I also say to you that you are Peter, and on this rock I will build My church, and the gates of Hades shall not prevail against it.\n Mat 16:19 \n \"And I will give you the keys of the kingdom of heaven, and whatever you bind on earth will be bound in heaven, and whatever you loose on earth will be loosed[fn3] in heaven.\"\n Mat 16:20 \n Then He commanded His disciples that they should tell no one that He was Jesus the Christ.\n Mat 16:21 \n From that time Jesus began to show to His disciples that He must go to Jerusalem, and suffer many things from the elders and chief priests and scribes, and be killed, and be raised the third day.\n Mat 16:22 \n Then Peter took Him aside and began to rebuke Him, saying, \"Far be it from You, Lord; this shall not happen to You!\"\n Mat 16:23 \n But He turned and said to Peter, \"Get behind Me, Satan! You are an offense to Me, for you are not mindful of the things of God, but the things of men.\"\n First, read verses 13-16 where Jesus asks the disciples who the people say He is. Note Simon Peters answer. \n \n Mat 16:15 \n He said to them, \"But who do you say that I am?\"\n Mat 16:16 \n Simon Peter answered and said, \"You are the Christ, the Son of the living God.\"\n \n Then jesus responded by saying this to him.\n \n Mat 16:17 \n Jesus answered and said to him, \"Blessed are you, Simon Bar-Jonah, for flesh and blood has not revealed this to you, but My Father who is in heaven.\n  \n Then in the very next sentence Jesus gives Simon Peter a new name, Peter as He proclaims that:\n \n Mat 16:18 \n \"And I also say to you that you are Peter, and on this rock I will build My church, and the gates of Hades shall not prevail against it.\n \n And the ROCK that He will build his Church upon is the revelation that He, Jesus is the Christ, the Son of God. He was celebrating the fact that Simon Peter finally got it, he saw Jesus as Messiah, the son of God. How can he place His Church into the hands of any Man who is flawed and is unable to die for the sins of humanity ? Can you answer that for me ?\n \n Now look at verses 22-23 as Peter argues with His claim that Jesus must be killed for our sins and raised the third day. In response to Peters rebuke He say's to Peter, Get behind me satan. Would He say that to the person He was placing over His church which the gates of hell shall not prevail against ? I think not.", 
   {}, 
   277998, 
   null, 
   1186970160.0
  ], 
  [
   278006, 
   null, 
   "thelmoose", 
   "It also doesn't explain away Matthew 16:19, where Jesus clearly gives authority to Peter. It's a supremely bizarre interpretation that Jesus starts off talking to Peter, talks about himself with no indication that this is what he is doing, and then switches back to talking about Peter again. Unless you'd like to claim that Christ was giving himself the keys of the kingdom?\n\n \n The other thing is that he has taken a convoluted approach using disparate sources to argue (not very convincingly) against what seems rather straightforward to me. I don't know the bible much at all, so this is a surprise, as little seems straightforward to me. My point is he couldn't possibly have figured out that labyrinthine explanation by himself. He was taught this by those who had to fabricate an argument against this passage that is rich ammunition to vouch for the authority of the RCC. This was not Archie's personal interpretation. He had to be carefully taught. \n \n I googled the Matthew verse and it returned oodles of fundamentalist websites all explaining how this does not mean what it really seems rather obviously to mean. \n \n Grant you, I don't care one way or the other. I am just continually amazed at how rigid the thinking is for some of the fundies, that they cannot handle the least bit of ambiguity surrounding their faith. Why is ambiguity so threatening to some people?", 
   {}, 
   278000, 
   null, 
   1186970280.0
  ], 
  [
   278007, 
   null, 
   "thelmoose", 
   "Simon Peter answered and said, \"You are the Christ, the Son of the living God.\" \n Jesus answered and said to him, \"Blessed are you, Simon Bar-Jonah, for flesh and blood has not revealed this to you, but My Father who is in heaven.\n Then in the very next sentence Jesus gives Simon Peter a new name, Peter \n\n \n Sounds like he changed his name to Rock.\n \n \n\"And I also say to you that you are Peter, and on this rock I will build My church, and the gates of Hades shall not prevail against it.\"\n \n And the ROCK that He will build his Church upon is the revelation that He, Jesus is the Christ, the Son of God. \n\n \n Well that's not what the quote says. He didn't mention anything about building a church on a revelation/rock. Is the same sentence that he re-names Simon the rock, he says he is gonna use a rock as a foundation for his church. \n \n \n\n He was celebrating the fact that Simon Peter finally got it, he saw Jesus as Messiah, the son of God. How can he place His Church into the hands of any Man who is flawed and is unable to die for the sins of humanity ? Can you answer that for me ?\n\n \n Yes. It sound like he was trusting Simon Peter precisely because he \"got it\". You have answered your own question.", 
   {}, 
   278005, 
   null, 
   1186970880.0
  ], 
  [
   278064, 
   null, 
   "JSDKoeln", 
   "I'm so dangerous I'm praying for you and your lost cohorts daily JSD. You think I fear what you represent JSD, when my fear is that you believe what you represent. \n\n \n Stop. Don't pray for me. I never asked you to. I don't want you to. You are praying for someone you don't know... don't care to know... don't care to respect... just praying for someone who you deemed (many times) reprobate and many times (as in this post) shallow.... stop your foolishness. Your obvious deity complex is making you pathological. Some people on this board think you're harmless. I personally think you're dangerous. It's just my opinion backed up by, ummmm how many anti-gay posts have you posted on this forum before???? You've posted almost 2000 times, and I bet that at least 90% of your posts have homo-hatred in them somewhere. Truth is in the numbers Arch.\n \n \nYou boast of your gayness and your marriage as if it's an accomplishment to be proud of. And that you know prejudice as if you are unique. And you defend Jito as if you actually know each other, you living in Germany and all. So who is deluding themselves JSD ? Who is claiming to have a handle on life when you have no idea why you even exist. \n\n \n And by your not-so-hidden subtext, you don't acknoweldge or respect my marriage. So what? You don't matter in the real world Arch. And, yes, for a gay man, it is an accomplishment. It will be a novel happening until we're treated equally in this world. It was something that I thought could never happen to me, given the bigoted attitudes towards gays in this world. It's a wonderful happening in my life, Arch. Don't be so shallow and be happy for me!\n \n You also make prejudice and hateful comments to me... and you don't know me, \"living in Germany and all.\" But you still don't hesitate to make them. I respect what Jito has to offer on this forum. She has experience I have learned much from. You just offer a pile of babble and hate the fact that many people have challeneged you and all have debunked every argument you've ever made. Just because Arch says it so, doesn't make it so. You just can't listen to the truth.... and revert to name calling to make yourself feel better.\n \n \nAnd you accuse me of denouncing a billion catholics and anglicans when the only people who corrupted the doctrines that mislead the masses are the church fathers who have interpreted the bible to satisfy their shallow agendas. \n\n \n You said it... I didn't. I may not believe the bible is the word of God, but I respect the people that practice their religion to become better spirits. Just because you study a book and can quote it ad nausium does not a spiritual being who is close to god make.\n \n \nBut you must lie about me, distort what I represent and imply that I am taking on those people who have been victimized by the leaders who have lied to them. You claim christians are sheeple yet when you meet one who wont be led around by the nose you attack me for not being a sheeple and for standing against the lies of a large and ancient institution. \n\n \n But you are the victimizer Arch! You are! Where am I distorting or lying? Just go back to your almost 2000 posts! You really get nasty here. And when we push back, you start name-calling. You are really predictable.\n \n And, I have many christian friends that I respect. But, even though I haven't met you, I can see that you're far far away from their beliefs. By saying that, I'm sure you've already prejudged them. I've never come across anyone so self-righteous and hate-spewing in all my time on these forums. But you just love to call us liars. It's so funny... Oh, right shallow too! Then there's reprobate... oh, the list goes on and on and on and on and on and on... snore....\n \n \nMake up your mind JSD, which is it anyway ?\n\n \n My mind is made up Arch. But, let me ask you..... Do you really think you're getting your point across here? Do you think you have ANY credibility here. I'm sure, like the last forum you were involved with, you'll eventually (and hopefully) get banned. I can respect others if they respect me. You show us no respect. But it is always fun kicking you around a bit.", 
   {}, 
   277987, 
   null, 
   1187012160.0
  ], 
  [
   278088, 
   null, 
   "robbie0517", 
   "http://www.towleroad.com/2007/08/texas-pastor-st.html\n \n \nOn Friday I posted about High Point church and the decision by Reverend Gary Simons to deny a promised funeral to the brother of one of its members, a Navy veteran, once church officials discovered that the deceased was gay and that his sexuality would be mentioned at the service.\n \n Simons defended his decision to renege on the offer to his congregation on Sunday, and reportedly received a hearty round of applause. Said Simons: \"This decision was not based on hate, or discrimination, but upon principle and policy. We cannot glorify homosexuality as a lifestyle.\"\n \n The church had been praying for the deceased, Cecil Sinclair, for six years, and had sent a minister to the family's home shortly after he died.\n \n The Dallas Morning News reports: \"The family says that it should have been obvious to church staff immediately that Mr. Sinclair was gay. They say that Paul Wagner, 38, was introduced to a High Point audio-visual minister, who came to the hospital on Monday night, as the deceased's partner. The fact that the family wanted the Turtle Creek Chorale, an openly gay and internationally famous group that Mr. Sinclair sang with for years, to perform should also have made it obvious, they say.\"\n \n Simons seemed almost to relish the negative publicity his church has been getting since news broke on Friday: \"With all the negative e-mail we are receiving right now, it seems that the homosexual community, God bless them all, are very organized. Before, when you type in 'Gary Simons' and 'High Point Church' in a Google search, you know, you could find us. But now, you really could find us.\"\n \n Sinclair's service was held at a nearby funeral home over the weekend. Said Tim Seelig, the leader of the openly gay Turtle Creek Chorale, at the end of Sinclair's memorial: \"We were supposed to be a couple of blocks away. We are here because the church deemed Cecil unworthy.\"\n", 
   {
    "post_info": {
     "post_title": "Texas Pastor Stands By Decision to Deny Funeral to Gay Navy Vet"
    }
   }, 
   278064, 
   null, 
   1187028120.0
  ], 
  [
   278096, 
   null, 
   "Sigma", 
   "\n A cynical Zardoz would even say that this was intentional.\n The man's now in the news...where he's a champion for the cause.\n I dare anyone to call and ask if attendance is up at his church. Oh the mileage they can get out of this. Worth MILLIONS.\n\n \n I agree that the church really does come off looking better, both in the eyes of moderates (for appearing to be simply making the best of a moral conundrum) and hard-core fundamentalists. Anyone who understands their moral stance can understand how even a truly compassionate person would be in a difficult position. The comments the church offers further reinforce that view.\n \n Whether or not this was intentional is up to debate, imo.\n \n I don't quite understand the rancor here. Certainly they refused to do the service but it's also pretty obvious that the stance of such an institution would be hostile to gay people. The submission of those objectionable pictures seems almost to have been to taunt the church, since his orientation was obviously going to be a big part of the service. If the content only came to light after the initial acceptance then I cannot condemn the church for cancelling (besides the common sense of finding out the content before accepting).\n \n \nI think any religion should be allowed to set it's standards on what it accept and what it discards.\n If you don't like it, go form your own club.\n\n \n Agreed. All of this drama of \"get the church to accept us\" is tiresome.", 
   {}, 
   277939, 
   null, 
   1187031120.0
  ], 
  [
   278098, 
   null, 
   "JSDKoeln", 
   "I agree that the church really does come off looking better, both in the eyes of moderates (for appearing to be simply making the best of a moral conundrum) and hard-core fundamentalists. Anyone who understands their moral stance can understand how even a truly compassionate person would be in a difficult position. The comments the church offers further reinforce that view.\n \n Whether or not this was intentional is up to debate, imo.\n \n I don't quite understand the rancor here. Certainly they refused to do the service but it's also pretty obvious that the stance of such an institution would be hostile to gay people. The submission of those objectionable pictures seems almost to have been to taunt the church, since his orientation was obviously going to be a big part of the service. If the content only came to light after the initial acceptance then I cannot condemn the church for cancelling (besides the common sense of finding out the content before accepting).\n \n Agreed. All of this drama of \"get the church to accept us\" is tiresome.\n\n \n Churches can do whatever they want; however, what constitutes an \"objectional\" picture. I'm sure the parents of the dead man did not submit lewd photos and the church was blowing things out of proportion to justify their stance. IMO this boils down to the simple fact that he was gay. That being said.... so much for \"hating the sin and not the sinner!\" That's what the rancor is about. It's a bit of a hypocritical stance. Rather than taking this as an opportunity to bring the homosexuals closer to their god and welcome them into their home, all they did was push people further away. If this is their \"christian\" love, let 'em have it! This is not love. This is pathetic.", 
   {}, 
   278096, 
   null, 
   1187031660.0
  ], 
  [
   278103, 
   null, 
   "Sigma", 
   "Churches can do whatever they want; however, what constitutes an \"objectional\" picture.\n\n \n Obviously the pictures that were submitted, since they involve a blatent intimate relationship (kissing was mentioned, I believe) with another man.\n \n \nThat being said.... so much for \"hating the sin and not the sinner!\" That's what the rancor is about. It's a bit of a hypocritical stance.\n\n \n Actually, this instance seemed a perfect example of that stance. They could not allow the service to include the \"morally repugnant\" homosexual side of the person, but seemed accepting of the person sans the homosexual part (reflected in the initial acceptance but the cancellation after the content of the service came to light). Since homosexuality was to be an integral part of the service (being that it is an integral part of that person's life) the church would have no choice but to refuse the service. It is defensible, and the church's comments and actions afterward further reinforce the \"love the sinner\" stance.\n \n \nRather than taking this as an opportunity to bring the homosexuals closer to their god and welcome them into their home\n\n \n Is this their goal?\n \n \nIf this is their \"christian\" love, let 'em have it! This is not love. This is pathetic.\n\n \n Then, as Zardoz suggested, \"go form your own group\". Yet gay people in general do not do this. They insist on being accepted by the church. Give it up, would be my advice. Quit the drama.", 
   {}, 
   278098, 
   null, 
   1187032500.0
  ], 
  [
   278104, 
   null, 
   "thelmoose", 
   "The church can do what it wants, of course. It really is bad manners, however, to renege on a promise. I think the quote from the article Robbie just posted is telling:\n \nThe Dallas Morning News reports: \"The family says that it should have been obvious to church staff immediately that Mr. Sinclair was gay. They say that Paul Wagner, 38, was introduced to a High Point audio-visual minister, who came to the hospital on Monday night, as the deceased's partner. The fact that the family wanted the Turtle Creek Chorale, an openly gay and internationally famous group that Mr. Sinclair sang with for years, to perform should also have made it obvious, they say.\"\n \n\n It doesn't occur to many that gay people exist and the assumption is usually one is straight. The above shows how clueless they were. \n \n It was nice that they offered to pay for an outside facility, but after proclaiming the dead guy not worthy of their church, it was too little too late for the family, I suppose. I guess these kinds of problems could be prevented if, when asked if a funeral can be held there, the church should not agree unless certain criteria are fulfilled and present the requestor with the checklist. Gay? Then, no. Non-Catholics are not permitted to have a Catholic Mass said for them. Don't see much of a difference.", 
   {}, 
   278098, 
   null, 
   1187032920.0
  ], 
  [
   278107, 
   null, 
   "robbie0517", 
   "It doesn't occur to many that gay people exist and the assumption is usually one is straight. The above shows how clueless they were.\n\n \n What you say here reminded me of two days ago when I was at the state fair. As I walk by a guy yells to me \"win a bear, the girls love teddy bears\", I say to him \"I don't like girls, I like boys\". (and for AA, that means Men) He says \"Hate when that happens\". I always find it kinda fun to point out that they shouldn't make assumptions.\n \n Anyhow, I really don't care if any church accepts me, I just think in this case they were rude and out for publicity. They knew the guy was gay, this is obvious, I lived in Dallas for 10 years and the Turtle Creek Chorale is very well known as exclusively gay. They probably got some flack, canceled, then saw an opportunity to increase the flow of money.", 
   {}, 
   278104, 
   null, 
   1187033400.0
  ], 
  [
   278114, 
   null, 
   "Sigma", 
   "It doesn't occur to many that gay people exist and the assumption is usually one is straight. The above shows how clueless they were.\n\n \n Certainly they were clueless, but I don't think it was about what you believe it was about.\n \n I think it was likely as well that they knew the man was gay. What they seemed clueless about was that it would be a focal part of his life (and thus the service). From the article, it seems clear that they cancelled after they found out the content of the proposed service. The family (and gay people in general) wants to believe that the church just hates gay people and thus that is what they believe. The actions and comments of the church paint a different picture, though we probably only have a tidbit of what has been going on.\n \n \nI guess these kinds of problems could be prevented if, when asked if a funeral can be held there, the church should not agree unless certain criteria are fulfilled and present the requestor with the checklist. Gay? Then, no. Non-Catholics are not permitted to have a Catholic Mass said for them. Don't see much of a difference.\n\n \n Again, it did not seem to be so much that the man was gay as it would have been blatant during the service. From their comments, it seems they would have been fine with a gay man as long as that fact was \"kept in the closet\" during the service. The sin is what bothered them, not the man himself.", 
   {}, 
   278104, 
   null, 
   1187034180.0
  ], 
  [
   278117, 
   null, 
   "thelmoose", 
   "Certainly they were clueless, but I don't think it was about what you believe it was about.\n \n I think it was likely as well that they knew the man was gay. What they seemed clueless about was that it would be a focal part of his life (and thus the service). From the article, it seems clear that they cancelled after they found out the content of the proposed service. The family (and gay people in general) wants to believe that the church just hates gay people and thus that is what they believe. The actions and comments of the church paint a different picture, though we probably only have a tidbit of what has been going on.\n \n \n \n Again, it did not seem to be so much that the man was gay as it would have been blatant during the service. From their comments, it seems they would have been fine with a gay man as long as that fact was \"kept in the closet\" during the service. The sin is what bothered them, not the man himself.\n\n \n Well, I guess we can never really know the motivation, but they could have just asked the family to remove some of the photos. That could have kept him in the closet. If they knew he was gay from the start, and it was important that no reference be made of that so as to not reveal his \"sin\", they might have mentioned it from the outset. \n \n From the opening post: \n \n \nFamily and friends discovered the church had withdrawn its invitation Wednesday evening, when Lee Sinclair called to tell his mother, she said. ...\n \n Nobody from the church called her or Mr. Sinclair's partner, Paul Wagner, to discuss possible changes to the service, Ms. Bowers said. \n \n \"We could have reached a compromise,\" she said. \"That was never attempted.\" \n \n At least some theological questions could have been worked out, she said. For instance, the family was willing to allow the church to issue an \"altar call\" asking people to accept Jesus at the end of the service. \n \n\n \n I really don't care either way, it is just a little tacky (and more than a little hurtful to the bereaved) to change your mind like that.", 
   {}, 
   278114, 
   null, 
   1187034840.0
  ], 
  [
   278119, 
   null, 
   "Sigma", 
   "Well, I guess we can never really know the motivation, but they could have just asked the family to remove some of the photos. That could have kept him in the closet. If they knew he was gay from the start, and it was important that no reference be made of that so as to not reveal his \"sin\", they might have mentioned it from the outset.\n\n \n Agreed, they should have mentioned that from the outset, but there are defensible reasons for not doing so. The family was bereaved, after all. There are other reasons besides maliciousness for handling it the way they did, but I do agree it was handled rather badly (the family handled the rejection badly, but that is understandable as well). As the church said, it was an awkward situation. It could very well be that it honestly didn't occur to whomever offered the church's services that the man's homosexuality would be an issue during the funeral service. From the comments and actions afterward, it is easy to believe that was so.\n \n \nI really don't care either way, it is just a little tacky (and more than a little hurtful to the bereaved) to change your mind like that.\n\n \n Yes, it was. They were in an awkward position and it appears that they did their best to work their way out of a moral conundrum. It was a sucky situation for the family especially (since the church came out of it looking pretty good), but the rancor displayed in this thread is not warranted, imo.", 
   {}, 
   278117, 
   null, 
   1187035320.0
  ], 
  [
   278143, 
   null, 
   "JSDKoeln", 
   "Obviously the pictures that were submitted, since they involve a blatent intimate relationship (kissing was mentioned, I believe) with another man.\n\n \n I need to find the quote, but I believe it was a kiss on the cheek. Straight men have kissed me on the cheek before... it was not sexual in anyway. If this were two straight men, it would not be a big deal. It's about the man being a heathen-homosexual condemned to hell.. pure and simple. His CHRISTIAN parents submitted the pictures. Do the math.\n \n \nActually, this instance seemed a perfect example of that stance. They could not allow the service to include the \"morally repugnant\" homosexual side of the person, but seemed accepting of the person sans the homosexual part (reflected in the initial acceptance but the cancellation after the content of the service came to light). \n\n \n So, they justified their actions by the \"ick\" factor (better the \"ilk\" factor). If they're really about what christianity is about, then they failed their mission. They're not there to be in a shielded house of self-righteousness. Even Jerry Foulwell had the inclination of opening up a dialogUe with the heathen homosexuals. He realized if, in his dimented way, he wanted to reach us, he better talk to us. This man's friends, as all of my friends, I can assure you, are not all GAY. Some are, but not all.\n \n \nSince homosexuality was to be an integral part of the service (being that it is an integral part of that person's life) the church would have no choice but to refuse the service. \n\n \n Wait wait wait wait a minute.... When a heterosexual dies, is the service purely about his heterosexualness? lol Try again. This argument holds no weight. Where being gay is how I express my love to my husband, I can assure you, it is not only who I am. I don't wear it on my sleeve and don't share it with everyone I meet... Not because I'm ashamed, but because, it's a nonissue! What a limited point-of-view!\n \n \nIt is defensible, and the church's comments and actions afterward further reinforce the \"love the sinner\" stance.\n\n \n Nope, is not, you failed to prove your point. They're all talk no action.... as are most fundie christians are. Proof is in the actions, not in quoting a bunch of garbled, ancient, easily misinterpreted texts.... (except of course if you have a direct phone line to god! :p )\n \n \n \nIs this their goal?\n\n \n It's part of the mission of christians to witness to the poor bums who they deem losers in order to convert them to their holy and righteous ways. So, yes, of course it is their goal to offer \"salvation\" as they deem salvation to be! Look at our own AA.... He's stated his mission to offer us salvation many many many many snore.... times. But he is doing what I know christians to do... although with a bit of overkill.\n \n \nThen, as Zardoz suggested, \"go form your own group\". Yet gay people in general do not do this. They insist on being accepted by the church. Give it up, would be my advice. Quit the drama.\n\n \n Well, there's the real issue Sig. Even if we DID form our own group, like the Church of Dorothy, it would not be recognized by the government. We still would not have the right to marry in the US. We still could not live normal, married lives, because of the religious bigotry being cemented into the constitution coming mostly from the relgious right. Take your own advice and then take mine and look in a mirror. The \"drama\" won't stop, Cig. Not until you and I can meet on the street as equals.... and you can meet my husband and me, recognized by the US as 100% human, and I can hold his hand without the fear of being snickered at or killed. Drama? Wow, nice! Are you Christian?", 
   {}, 
   278103, 
   null, 
   1187040600.0
  ], 
  [
   278154, 
   null, 
   "Sigma", 
   "I need to find the quote, but I believe it was a kiss on the cheek. Straight men have kissed me on the cheek before... it was not sexual in anyway.\n\n \n If it is your gay partner kissing you on the cheek, is it not an intimate gesture? The church opposes this type of behavior, apparently.\n \n \nIf this were two straight men, it would not be a big deal. It's about the man being a heathen-homosexual condemned to hell.. pure and simple. His CHRISTIAN parents submitted the pictures. Do the math.\n\n \n Hrm. I'm afraid it isn't adding up to me as it is for you. What does it matter that his parents were Christian?\n \n If it were two straight men then the kiss would not be revealing an intimate or romantic relationship between them, obviously. The fact that it was an intimate or romantic relationship (read: homosexual) is the problem.\n \n \nSo, they justified their actions by the \"ick\" factor (better the \"ilk\" factor).\n\n \n They were 'justified' (if that is the right word) because their religion dogmatically believes homosexuality is a sin.\n \n \nHe realized if, in his dimented way, he wanted to reach us, he better talk to us. This man's friends, as all of my friends, I can assure you, are not all GAY. Some are, but not all.\n\n \n The man is dead. They weren't trying to reach him at all.\n \n \nWait wait wait wait a minute.... When a heterosexual dies, is the service purely about his heterosexualness? lol Try again. This argument holds no weight. Where being gay is how I express my love to my husband, I can assure you, it is not only who I am. I don't wear it on my sleeve and don't share it with everyone I meet... Not because I'm ashamed, but because, it's a nonissue! What a limited point-of-view!\n\n \n Think about what you said. Is your husband not a focal point of your life? Would he not play a prominent role in any funeral service of yours? This man obviously had a partner (or partners) that played a prominent role in his life (since they are a part of the service). I don't know how prominent but since the man made no secret of his orientation, as you do not, I do not doubt that displays of affection were openly given. \n \n From the article: It's that it was clear from the photos that his friends and family wanted that part of his life to be a significant part of the service.\n \n The church objects to affectionate behavior between members of the same sex. They do not condone it and they do not endorse it. I honestly can see few other reactions open to them besides cancelling the service and they attempted to be nice about it, apparently.\n \n \nNope, is not, you failed to prove your point. They're all talk no action.... as are most fundie christians are. Proof is in the actions, not in quoting a bunch of garbled, ancient, easily misinterpreted texts.... (except of course if you have a direct phone line to god! :p )\n\n \n They proved it in their actions. They offered to pay for services elsewhere, did they not? They also sent over food for the service. These actions show a compassionate effort to support the family.\n \n \nIt's part of the mission of christians to witness to the poor bums who they deem losers in order to convert them to their holy and righteous ways. So, yes, of course it is their goal to offer \"salvation\" as they deem salvation to be!\n\n \n It is part of their mission to forgive sin, but not to either condone or endorse it. They may have forgiven this man, had he repented, but he obviously did not.\n \n \nWell, there's the real issue Sig. Even if we DID form our own group, like the Church of Dorothy, it would not be recognized by the government.\n\n \n You're still complaining that someone isn't accepting you. It's becoming an unscalable wall in your psyche. It's a wall you've created and only you can overcome. Don't live for the sake of being accepted by others, it's unfulfilling. Who cares if the gov't recognizes it? Or is it just money you're after?\n \n \n Take your own advice and then take mine and look in a mirror. The \"drama\" won't stop, Cig. Not until you and I can meet on the street as equals.... and you can meet my husband and me, recognized by the US as 100% human, and I can hold his hand without the fear of being snickered at or killed. Drama? Wow, nice! Are you Christian?\n\n \n No, I'm not Christian. Nor am I Republican.\n \n Stop seeking my approval. Who cares what I think about you? Why should I care what you think about me? I'm all for equal rights, but this \"but it's not called marriage!\" nonsense is just that, nonsense. I care about being bothered, and your drama annoys me.", 
   {}, 
   278143, 
   null, 
   1187042940.0
  ], 
  [
   278170, 
   null, 
   "JSDKoeln", 
   "If it is your gay partner kissing you on the cheek, is it not an intimate gesture? The church opposes this type of behavior, apparently.\n \n\n \n They oppose laying down with another man, not kissing another on the cheek. AFter all, it is in a lot of cultures, and many christians as well as jewish cultures, ok for a man to kiss another man on the cheek. So what if they oppose it. I know they don't oppose touching pig skin because a lot of them watch football every week! Bible has rules about that you know!\n \n \nHrm. I'm afraid it isn't adding up to me as it is for you. What does it matter that his parents were Christian?\n\n \n It does! They are doing what is comfortable for them. They're not going to present their son as a flaming queen no matter how accepting they are. Trust me on this one. I was raised by born-agains.\n \n \nIf it were two straight men then the kiss would not be revealing an intimate or romantic relationship between them, obviously. The fact that it was an intimate or romantic relationship (read: homosexual) is the problem.\n\n \n No, if they had fornicating pictures or revealing photo's of the two in an intimate act, i'd understand. I'm 100% sure that this was not the case.\n \n \nThey were 'justified' (if that is the right word) because their religion dogmatically believes homosexuality is a sin.\n\n \n So what? There are many other sins that the christian bretheren comit on a daily basis. That is my point. It's hypcritical to call one sin worse than another. And let's not forget about the whole christian \"judging\" thing going on here.\n \n \nThe man is dead. They weren't trying to reach him at all.\n\n \n You didn't address the real point of what I said. I won't bother to respond to this dribble.\n \n \nThink about what you said. Is your husband not a focal point of your life? Would he not play a prominent role in any funeral service of yours? This man obviously had a partner (or partners) that played a prominent role in his life (since they are a part of the service). I don't know how prominent but since the man made no secret of his orientation, as you do not, I do not doubt that displays of affection were openly given. \n\n \n first of all, \"partners\"....? very telling of you Siggy. Actually, it's kind of insulting to gay people\n \n The bible doesn't say you can't be affectionate with another man.. just lay down with another man. Don't think there were pics of him laying down.\n \n \nFrom the article: It's that it was clear from the photos that his friends and family wanted that part of his life to be a significant part of the service.\n\n \n The church objects to affectionate behavior between members of the same sex. They do not condone it and they do not endorse it. I honestly can see few other reactions open to them besides cancelling the service and they attempted to be nice about it, apparently.[/QUOTE]\n \n I can't. Therein lies the \"ick\" (\"ilk\") factor. Sorry you can't comprehend it. They can send diamonds and rubies.... but it doesn't make up for their judging.\n \n \nThey proved it in their actions. They offered to pay for services elsewhere, did they not? They also sent over food for the service. These actions show a compassionate effort to support the family.\n\n \n They wanted to brush it under the carpet. They pastor was a coward. There are a bunch of bigots in the congregation and he didn't use it as an opportunity to teach. That's the problem with this church.\n \n \nIt is part of their mission to forgive sin, but not to either condone or endorse it. They may have forgiven this man, had he repented, but he obviously did not.\n\n \n How do you know? Did God tell you? Did the parents tell you? Did the preacher tell you? It's all their \"mission\" to witness. Sorry, I\"m not buying it.\n \n \nYou're still complaining that someone isn't accepting you. It's becoming an unscalable wall in your psyche. It's a wall you've created and only you can overcome. Don't live for the sake of being accepted by others, it's unfulfilling. Who cares if the gov't recognizes it? Or is it just money you're after?\n\n \n ummmmmm, DOMA.... DADT..... Hate crimes.... AA...... No marriage rights in the USA for gays.... What part of that SHOULD I feel accepted about. What planet are you living on? I don't live for the sake of being accepted by others, that is except for the public I sing for... Need their approval to pay my rent! Money? LOL You're stuping low here. Don't want money. Am happy to make money on my own thank you. But equal rights would be grand!\n \n \n \nNo, I'm not Christian. Nor am I Republican.\n \n Stop seeking my approval. Who cares what I think about you? Why should I care what you think about me? I'm all for equal rights, but this \"but it's not called marriage!\" nonsense is just that, nonsense. I care about being bothered, and your drama annoys me.\n\n \n emoticon_xdonno Approval! HA! Me thinks you're projecting a tad too much here sparky! I couldn't care less what you think! I don't think I've ever responded to anything you've said until this thread. Where in the world did you get the hairbrained notion that I need you approval?\n \n I ONLY care about equal rights. Don't care what it's called. I'm just calling a spade a spade here with this \"christian\" organization. My point is that they're acting like a business, not a spiritual entity.\n \n Drama? You have no clue what you're talking about as you have pointed out in this thread. And since we're name calling.... you're flippant and arrogant and that annoys me! emoticon_xbouncer", 
   {}, 
   278154, 
   null, 
   1187052480.0
  ], 
  [
   278173, 
   null, 
   "Sigma", 
   "They oppose laying down with another man, not kissing another on the cheek. AFter all, it is in a lot of cultures, and many christians as well as jewish cultures, ok for a man to kiss another man on the cheek. So what if they oppose it. I know they don't oppose touching pig skin because a lot of them watch football every week! Bible has rules about that you know!\n\n \n The examples you point out are for religious/cultural reasons, not romantic. As far as I know, Christianity considers homosexuality a sin and the kissing/hugging/etc depicted in the pictures would indicate a romantic homosexual relationship. The church did not want to have the appearance of condoning this behavior.\n \n Would you agree with the facts I just laid down?\n \n \nIt does! They are doing what is comfortable for them. They're not going to present their son as a flaming queen no matter how accepting they are. Trust me on this one. I was raised by born-agains.\n\n \n What was comfortable for the parents was not in line with the dogmatic beliefs the church profess. The parents were accepting of their child's homosexuality, while the church is not accepting of that man's homosexuality.\n \n \nNo, if they had fornicating pictures or revealing photo's of the two in an intimate act, i'd understand. I'm 100% sure that this was not the case.\n\n \n I am 100% sure of that as well. The service the parent's proposed, however, included, as a significant portion, depictions of this man in a homosexual relationship (or relationships)\n \n \nSo what? There are many other sins that the christian bretheren comit on a daily basis. That is my point. It's hypcritical to call one sin worse than another. And let's not forget about the whole christian \"judging\" thing going on here.\n\n \n Ok... so? Whether or not they are inconsistent is beside the point. Homosexuality is still considered a sin, so there is little they could do besides cancel the service that depicts homosexual relationships.\n \n \nfirst of all, \"partners\"....? very telling of you Siggy. Actually, it's kind of insulting to gay people\n\n \n \"Partners\" is offensive? It seems pretty neutral.\n \n \nThe bible doesn't say you can't be affectionate with another man.. just lay down with another man. Don't think there were pics of him laying down.\n\n \n Don't ask me, I wouldn't know. I know only what I've heard and what I've seen, and I've heard that Christianity, in general, considers homosexuality a sin.\n \n \nI can't. Therein lies the \"ick\" (\"ilk\") factor. Sorry you can't comprehend it. They can send diamonds and rubies.... but it doesn't make up for their judging.\n\n \n Well, it is the perogative of the parents to accept or reject the church's desire to help. Imo, the parent's attitude leaves something to be desired but they're still grieving so I'm more inclined to understand.\n \n \nThey wanted to brush it under the carpet. They pastor was a coward.\n\n \n Of course they wanted to brush it under the carpet. It's an awkward situation. To my mind they did the best they could in order to satisfy their moral sensibility and also appease the parents. They could have done better but they certainly were not malicious from what I saw.\n \n \nHow do you know? Did God tell you? Did the parents tell you? Did the preacher tell you? It's all their \"mission\" to witness. Sorry, I\"m not buying it.\n\n \n Oh, I was under the impression that the man was unashamed at being homosexual and did not seek forgiveness. It seemed this way from the article.\n \n Do you think, then, that he sought to repent for the sin of being homosexual?\n \n \n Money? LOL You're stuping low here. Don't want money. Am happy to make money on my own thank you. But equal rights would be grand!\n\n \n Then why does it matter whether or not the gov't recognizes your church? Write the Christian church off and hang out with the people you want to. Don't gnash your teeth over the fact that the Christian church will not accept you as a homosexual.\n \n \nemoticon_xdonno Approval! HA! Me thinks you're projecting a tad too much here sparky! I couldn't care less what you think! I don't think I've ever responded to anything you've said until this thread. Where in the world did you get the hairbrained notion that I need you approval?\n [...]\n I ONLY care about equal rights. Don't care what it's called. I'm just calling a spade a spade here with this \"christian\" organization. My point is that they're acting like a business, not a spiritual entity.\n \n\n \n From this thread. You wished to stand before me as an equal. I say you should not care whether I think you equal to me or not.\n \n Many apparently do care what it's called. Quite a bit, actually. If you are one who wants equal rights and don't care if it's \"civil union\" or \"marriage\" then my hat's off to you :) You're actually reasonable.\n \n \nDrama? You have no clue what you're talking about as you have pointed out in this thread. And since we're name calling.... you're flippant and arrogant and that annoys me! emoticon_xbouncer\n\n \n Arrogant? Certainly. Though I prefer the term \"egomaniacal\". Flippant? Not really.\n \n When did I call you names?", 
   {}, 
   278170, 
   null, 
   1187054100.0
  ], 
  [
   278226, 
   null, 
   "lesz", 
   "Then, as Zardoz suggested, \"go form your own group\". Yet gay people in general do not do this. They insist on being accepted by the church. Give it up, would be my advice. Quit the drama.\n\n \n There is no such thing as \"the church\". Gay people have formed their own churches -- for example, the Metropolitan Community Church, which now has 2-300 affiliated churches in over 20 countries. Other Christian churches have made decisions of conscience to welcome gays as members of their community.\n \n Churches that do not do so, that persist in preaching that love between gay people is a sin or at best a disease, are not beyond criticism. They shouldn't be ignored because of the far-reaching impact of religious homophobia, and the harm their doctrine does to gays in communities far beyond their local congregations, let alone gays who have to live within them. It is not \"drama\" to condemn bigotry. It's making a principled point about ethics.\n \n Now this church was acting within its constitutional rights, but a church has more than legal responsibilities, or so it claims: it claims spiritual responsibilities, and in this case it failed to meet them.", 
   {}, 
   278103, 
   null, 
   1187100900.0
  ], 
  [
   278236, 
   null, 
   "jyoshu", 
   "I don't quite understand the rancor here. Certainly they refused to do the service but it's also pretty obvious that the stance of such an institution would be hostile to gay people. The submission of those objectionable pictures seems almost to have been to taunt the church, since his orientation was obviously going to be a big part of the service. If the content only came to light after the initial acceptance then I cannot condemn the church for cancelling (besides the common sense of finding out the content before accepting).\n\n \n I agree. And I thought the same thing on the possible 'taunting' issue. Surely they would have known beforehand they would cause a ruckus with that. And again, they canceled in a pretty darn generous way, considering their willingness to pay for facilities elsewhere and to provide food. If all that is bigotry, I just don't think the church is so awful after all.\n \n \nThey proved it in their actions. They offered to pay for services elsewhere, did they not? They also sent over food for the service. These actions show a compassionate effort to support the family.\n\n \n And really, is not any action of support and compassion over and above what they are obligated to do? They didn't have to volunteer their facilities to begin with, and they didn't have to pay for somewhere else. This whole thing is sort of like condemning someone who donates some significant money to a charity by saying 'he could have given more', when in fact even giving a tiny amount is over and above what anyone should expect. It's like a Salvation Army storefront solicitor chiding someone dropping two quarters into his bucket for not dropping 3. This more-more-more expectation put on the church just doesn't make sense to me, when they, as a church just paid for the funeral facilities of an openly gay man. How many fundie churches can you say would do that??? I say kudos to them for that, and this is one case where I think gay people are barking up the wrong tree.", 
   {}, 
   278096, 
   null, 
   1187104260.0
  ], 
  [
   278241, 
   null, 
   "Archangel", 
   "Originally Posted by Sigma \n I don't quite understand the rancor here. Certainly they refused to do the service but it's also pretty obvious that the stance of such an institution would be hostile to gay people. The submission of those objectionable pictures seems almost to have been to taunt the church, since his orientation was obviously going to be a big part of the service. If the content only came to light after the initial acceptance then I cannot condemn the church for cancelling (besides the common sense of finding out the content before accepting).\n \nI agree. And I thought the same thing on the possible 'taunting' issue. Surely they would have known beforehand they would cause a ruckus with that. And again, they canceled in a pretty darn generous way, considering their willingness to pay for facilities elsewhere and to provide food. If all that is bigotry, I just don't think the church is so awful after all.\n\n \n You are both right that the Church showed no malice towards the gay community and did everything they could to support their private service in a positive way without actually endorsing its content with their name. That is the fine line they were forced to walk because they can't openly endorse the gay lifestyle under any circumstances.\n \n And lesz, I can assure you that not one evangelical church in America has any signs at their doors that say \"Gays not allowed\". Gay people are allowed in all cases and will be welcomed warmly, witnessed to and told the scriptural principles of what it means to submit to the Lords authority, and that God will receive each of us exactly where we are at the time. What they wont be told is that we can remain where we are in our personal sin, as salvation requires us to repent of(turn away from) our predominant sins and trust Him to remake us in His perfect image. That is what being born again means, to be remade in the image of Christ who died for us and now indwells us with His Holy Spirit. Behold, the old creature has died, behold all things are NEW. It's hard to claim one is new if they continue in the old lifestyle they practiced before they knew Him. This applies to gay or straight, Jew or Gentile, Pagan or Heathen, adulterer or fornicator, Alchaholic or Drug Addict. God accepts us all as we are, but desires to make us Holy as He is Holy. And as flawed as I am, I seek to grow in perfection and Grace and to one day be worthy of His love and sacrifice that was made for me.", 
   {}, 
   278236, 
   null, 
   1187105640.0
  ], 
  [
   278242, 
   null, 
   "Symbiote", 
   "Perhaps true in some churches, but certainly not all of them. Here in Australia at least, many churches are filled largely with cranky old women who seem to attend church for the sole purpose of gossiping about who has done what sinful thing afterwards. The idea of them giving anyone a \"warm welcome\" is absurd.", 
   {}, 
   278241, 
   null, 
   1187106480.0
  ], 
  [
   278254, 
   null, 
   "lesz", 
   "There was obviously no welcome in that church for gay people. They may have shown what they might describe as \"charity\" towards the man's brother, but none towards the man himself. Obviously there are some Christian churches for whom a dead gay is no better than a live one.", 
   {}, 
   278242, 
   null, 
   1187108640.0
  ], 
  [
   278259, 
   null, 
   "Sigma", 
   "There is no such thing as \"the church\".\n\n \n Ah. I thought it was more organized like the Catholic church appears to be. \n \n \nGay people have formed their own churches -- for example, the Metropolitan Community Church, which now has 2-300 affiliated churches in over 20 countries. Other Christian churches have made decisions of conscience to welcome gays as members of their community.\n\n \n Well, good :) Let their conscience decide, then. It seems to me that you do more harm than good trying to push yourselves onto people and organizations that do not want you there. Since you have your own groups, the drama about this church and others makes even less sense. It's like you want ever more more more. Not everyone will accept you. That's true of pretty much anyone.\n \n \nChurches that do not do so, that persist in preaching that love between gay people is a sin or at best a disease, are not beyond criticism. They shouldn't be ignored because of the far-reaching impact of religious homophobia, and the harm their doctrine does to gays in communities far beyond their local congregations, let alone gays who have to live within them. It is not \"drama\" to condemn bigotry. It's making a principled point about ethics.\n\n \n This goes beyond condemning \"bigotry\" (which I saw little of in this article), but is instead a craving for acceptance. That is the drama. Yes, of course these groups are not beyond criticism. I will go as far as to say this example of compassion from the church is one I have seen very little of, but it certainly does not deserve the hatred of the parents or of gay people in general. They also stood on principle.\n \n \nNow this church was acting within its constitutional rights, but a church has more than legal responsibilities, or so it claims: it claims spiritual responsibilities, and in this case it failed to meet them.\n\n \n Not so. Their spiritual responsibility included a moral rejection of sin, which they attempted to meet as well as their moral responsibility to the family, which they also met. They broke faith with the family when they backed out of their agreement, certainly, but they managed to find a solution to a moral conundrum that deserves some credit.", 
   {}, 
   278226, 
   null, 
   1187109660.0
  ], 
  [
   278266, 
   null, 
   "Archangel", 
   "There was obviously no welcome in that church for gay people. They may have shown what they might describe as \"charity\" towards the man's brother, but none towards the man himself. Obviously there are some Christian churches for whom a dead gay is no better than a live one.\n\n \n Again you unfairly lie and slander with no evidence to support your claim. Do you know that that man was not or would not have been allowed in that church when he was alive ? Because I know he would have been allowed in. The only catch would have been that the pastor would accept him but not endorse or accept his lifestyle just as he would accept a prostitute but not accept or endorse her continuation in that lifestyle either. Jesus = deliverance from sins that lead to our personal destruction as human beings. He will heal those who turn to him. Anyone who insists on living lives of open rebellion to his Holy Principles would never be satisfied in a church filled with true believers anyway, as they will always feel convicted of their sin rather than satisfied and comfortable as equal partakers and obedient children of god in such a place. It's wrong for blaming the church for your discomfort in fellowshpping with them because of your refusal to submit to Gods authority, not the churches authority. It's about following the Lord, not man.", 
   {}, 
   278254, 
   null, 
   1187110380.0
  ], 
  [
   278268, 
   null, 
   "lesz", 
   "Ah. I thought it was more organized like the Catholic church appears to be.\n \n \n Just one church among many. Last I read, there were something like 30,000 odd Christian denominations, though of course, that's a very crude estimate. Even the larger ones with more than one congregation probably amount to dozens if not hundreds.\n \n \nIt seems to me that you do more harm than good trying to push yourselves onto people and organizations that do not want you there.\n\n \n Personally, I would never set foot in most Christian churches, dead or alive, except perhaps as a tourist there to admire old architecture. I have no use whatever for institutions that promote anti-gay propaganda. that doesn't mean to say I don't feel free to criticise their anti-gay attitudes whenever they are made public.\n \n \nSince you have your own groups, the drama about this church and others makes even less sense. It's like you want ever more more more. Not everyone will accept you. That's true of pretty much anyone.\n\n \n And I won't accept the public expression of homophobia without criticising it. We appear to have reached an impasse. They want the freedom to criticise us, but raise unholy hell when they get criticised in return. Tough noogies.\n \n \nThis goes beyond condemning \"bigotry\" (which I saw little of in this article), but is instead a craving for acceptance. That is the drama.\n\n \n Oh... I see. We should happily accept the position of underdogs and pariahs and be grateful for it. Yes, yes... I can see the logic of that! emoticon_wow \n \n \nYes, of course these groups are not beyond criticism. I will go as far as to say this example of compassion from the church is one I have seen very little of, but it certainly does not deserve the hatred of the parents or of gay people in general. They also stood on principle.\n\n \n It's a free country. They have a right to stand on their principles, but when those principles include putting down gay people they don't have the right to have their poor behaviour pass uncritically. I wouldn't force them to do the decent thing, but I can call them on not doing it in public. \n \n \nTheir spiritual responsibility included a moral rejection of sin, which they attempted to meet as well as their moral responsibility to the family, which they also met. They broke faith with the family when they backed out of their agreement, certainly, but they managed to find a solution to a moral conundrum that deserves some credit.\n\n \n By not allowing the body of this sinner in their church. One wonders if they even know the meaning of Christ! The fact is, their moral position is reprehensible, even sinful, and rather than congratulating them on finding a way of weaseling out of their spiritual and fellowship responsibilities, it's worth pointing out their lack of Christian charity.", 
   {}, 
   278259, 
   null, 
   1187110740.0
  ], 
  [
   278274, 
   null, 
   "Sigma", 
   "\n Personally, I would never set foot in most Christian churches, dead or alive, except perhaps as a tourist there to admire old architecture. I have no use whatever for institutions that promote anti-gay propaganda. that doesn't mean to say I don't feel free to criticise their anti-gay attitudes whenever they are made public.\n\n \n That's the spirit! Perhaps it's just a few bad apples, then, that get most of the publicity. They have no use for you, and you shouldn't waste your time on them.\n \n \nAnd I won't accept the public expression of homophobia without criticising it. We appear to have reached an impasse. They want the freedom to criticise us, but raise unholy hell when they get criticised in return. Tough noogies.\n\n \n This example is unwarranted; to maintain credibility, pick the battles you can actually win or have the moral high ground on. Otherwise people just stop listening to you. In this particular example you have neither. My impression, and myself in particular, is that people are getting tired of the drama.\n \n \nOh... I see. We should happily accept the position of underdogs and pariahs and be grateful for it. Yes, yes... I can see the logic of that! emoticon_wow\n\n \n It is not enough to be oppressed. You must also be in the right. You are not in the right here. Whine often enough and people will oppose you just to spite you.\n \n \nIt's a free country. They have a right to stand on their principles, but when those principles include putting down gay people they don't have the right to have their poor behaviour pass uncritically. I wouldn't force them to do the decent thing, but I can call them on not doing it in public.\n\n \n It is a free country, but we're discussing (or at least I'm discussing) what attitude and behavior is warranted by the actions of this church. The response of the parents and the responses I've seen gay people have in this thread are unwarranted. They stood on moral principle, and did in such a way that it obviously was not an attack and was not directed at gay people (I know you'll disagree with this part) since they offered to pay and did cater the funeral of an openly gay man. They were as compassionate as their dogmatic law allowed them to be. That's commendable. That they broke faith with the family is not, certainly, and they could have done other things to avoid this.\n \n \nBy not allowing the body of this sinner in their church. One wonders if they even know the meaning of Christ! The fact is, their moral position is reprehensible, even sinful, and rather than congratulating them on finding a way of weaseling out of their spiritual and fellowship responsibilities, it's worth pointing out their lack of Christian charity.\n\n \n Whether their moral principle is correct or incorrect is not something you can say, unless you have an objective measure. It merely disagrees with your own. If their \"Christian charity\" (whatever that is) includes showing support to even those they consider sinful then they absolutely possess that. They could very well have dissociated themselves from this gay man entirely, but they did not. Their moral principle did not allow them to endorse or condone the life he unrepentendly led, but as a fellow human being they did show compassion for him and his family who accepted him.", 
   {}, 
   278268, 
   null, 
   1187111700.0
  ], 
  [
   278282, 
   null, 
   "lesz", 
   "This example is unwarranted; to maintain credibility, pick the battles you can actually win or have the moral high ground on. Otherwise people just stop listening to you. In this particular example you have neither. My impression, and myself in particular, is that people are getting tired of the drama.\n\n \n The church isn't occupying high ground. As for drama, all the drama is on the part of a church that refused a burial service on their premises because they considered the deceased a sinner. At that rate, no-one would ever get a church funeral.\n \n \nIt is not enough to be oppressed. You must also be in the right. You are not in the right here. Whine often enough and people will oppose you just to spite you.\n\n \n Why do people whine when gay people stand up for their rights? We are in the moral right here, and that church is in the gutter.\n \n \nIt is a free country, but we're discussing (or at least I'm discussing) what attitude and behavior is warranted by the actions of this church. The response of the parents and the responses I've seen gay people have in this thread are unwarranted. They stood on moral principle, and did in such a way that it obviously was not an attack and was not directed at gay people (I know you'll disagree with this part) since they offered to pay and did cater the funeral of an openly gay man. They were as compassionate as their dogmatic law allowed them to be. That's commendable. That they broke faith with the family is not, certainly, and they could have done other things to avoid this.\n\n \n That's your opinion. Mine is they acted cruelly and unreasonably. More, they acted immorally, as a result of immoral religious doctrines. When religious doctrines hurt people for no good reason, we can rest assured they are wrong.\n \n \nWhether their moral principle is correct or incorrect is not something you can say, unless you have an objective measure. It merely disagrees with your own. If their \"Christian charity\" (whatever that is) includes showing support to even those they consider sinful then they absolutely possess that. They could very well have dissociated themselves from this gay man entirely, but they did not. Their moral principle did not allow them to endorse or condone the life he unrepentendly led, but as a fellow human being they did show compassion for him and his family who accepted him.\n\n \n Of course they dissociated themselves from this gay man. They wouldn't even let his dead body in their church! How much more distanced could they be without actually arranging a dance on his grave? So their moral principles are immoral. Surely they can stand up to bit of preaching on the matter. Hell, they are keen to do it to everyone else.", 
   {}, 
   278274, 
   null, 
   1187113620.0
  ], 
  [
   278287, 
   null, 
   "Sigma", 
   "The church isn't occupying high ground. As for drama, all the drama is on the part of a church that refused a burial service on their premises because they considered the deceased a sinner. At that rate, no-one would ever get a church funeral.\n [...]\n Why do people whine when gay people stand up for their rights? We are in the moral right here, and that church is in the gutter.\n [...]\n That's your opinion. Mine is they acted cruelly and unreasonably. More, they acted immorally, as a result of immoral religious doctrines. When religious doctrines hurt people for no good reason, we can rest assured they are wrong.\n\n \n Then we'll have to agree to disagree. I would wager that most reasonable people would agree that the church behaved decently, but that is only my opinion.\n \n \nOf course they dissociated themselves from this gay man. They wouldn't even let his dead body in their church! How much more distanced could they be without actually arranging a dance on his grave? So their moral principles are immoral. Surely they can stand up to bit of preaching on the matter. Hell, they are keen to do it to everyone else.\n\n \n lesz, the proposed service was what they objected to and the sinful nature of his relationships is what they distanced themselves from. Since the parents wanted the homosexual nature of his relationships to be a significant part of the service (since his relationships, apparently, were a significant part of his life) the church could not, in good conscience, allow that service. From the article it was not the man they objected to; it was more the acceptance and celebration of something they consider abhorrent and immoral. I would think less of them if they compromised their moral principles, even if I disagree with those principles.\n \n Again, they supported and showed compassion for the man himself during his funeral.", 
   {}, 
   278282, 
   null, 
   1187114760.0
  ], 
  [
   278293, 
   null, 
   "jim's trucking", 
   "IMHO, the church acted adversely to the Christian concept of forgiveness.", 
   {}, 
   278287, 
   null, 
   1187118540.0
  ], 
  [
   278294, 
   null, 
   "Jo Bennett", 
   "I'm also wondering if they've ever held a funeral for a divorcee whose second spouse featured in the ceremony, because that is far more contrary to Christian teaching.", 
   {}, 
   278293, 
   null, 
   1187118720.0
  ], 
  [
   278299, 
   null, 
   "Sigma", 
   "IMHO, the church acted adversely to the Christian concept of forgiveness.\n\n \n I thought you had to ask for forgiveness. You know, repent and stuff", 
   {}, 
   278293, 
   null, 
   1187119620.0
  ], 
  [
   278301, 
   null, 
   "Sigma", 
   "I'm also wondering if they've ever held a funeral for a divorcee whose second spouse featured in the ceremony, because that is far more contrary to Christian teaching.\n\n \n Using this same logic they would not do so if the service featured the fact of the divorce in a prominate and positive way", 
   {}, 
   278294, 
   null, 
   1187119740.0
  ], 
  [
   278305, 
   null, 
   "Jo Bennett", 
   "Using this same logic they would not do so if the service featured the fact of the divorce in a prominate and positive way\n\n \n Like by featuring the partner with whom, as far as Christian teaching goes, the deceased has been committing adultery?", 
   {}, 
   278301, 
   null, 
   1187123100.0
  ], 
  [
   278309, 
   null, 
   "Sigma", 
   "Like by featuring the partner with whom, as far as Christian teaching goes, the deceased has been committing adultery?\n\n \n The divorce is the sin, not the relationship with this woman (if I understand the issues involved). Having the current wife featured wouldn't be celebrating the divorce, it would be celebrating his relationship.\n \n I suppose if they were celebrating under a sign that said \"Yay for divorce\" or something it would be a blatent inclusion.", 
   {}, 
   278305, 
   null, 
   1187124180.0
  ], 
  [
   278314, 
   null, 
   "Jo Bennett", 
   "No. Matthew 5:32:\n But I say that a man who divorces his wife, unless she has been unfaithful, causes her to commit adultery. And anyone who marries a divorced woman also commits adultery.\n Matthew 19:9:\n And I tell you this, whoever divorces his wife and marries someone else commits adultery-unless his wife has been unfaithful", 
   {
    "unicode_changes_made": true
   }, 
   278309, 
   null, 
   1187125620.0
  ], 
  [
   278315, 
   null, 
   "Sigma", 
   "No. Matthew 5:32:\n But I say that a man who divorces his wife, unless she has been unfaithful, causes her to commit adultery. And anyone who marries a divorced woman also commits adultery.\n Matthew 19:9:\n And I tell you this, whoever divorces his wife and marries someone else commits adultery-unless his wife has been unfaithful\n\n \n Well, again, unless the fact of his divorce is blatent it wouldn't really follow the same logic. \n \n Keep in mind they most likely knew the man was gay, they just didn't want that featured during the service. If the divorce is not featured in a positive or celebratory light then the adultery is not featured in a positive or celebratory light.", 
   {
    "unicode_changes_made": true
   }, 
   278314, 
   null, 
   1187125860.0
  ], 
  [
   278316, 
   null, 
   "Jo Bennett", 
   "Again, if the fact of a second spouse were featured then that is as indicative of the adultery as two men kissing is of them having sex.", 
   {}, 
   278315, 
   null, 
   1187126040.0
  ], 
  [
   278317, 
   null, 
   "Sigma", 
   "Again, if the fact of a second spouse were featured then that is as indicative of the adultery as two men kissing is of them having sex.\n\n \n The featuring of the second spouse isn't featured as a second spouse unless the divorce is blatently included. If the fact that she is the second spouse is presented in a positive light (as was the sinful relationship between the two men) then the two would be more comparable.", 
   {}, 
   278316, 
   null, 
   1187126280.0
  ], 
  [
   278336, 
   null, 
   "Archangel", 
   " \n The church isn't occupying high ground. As for drama, all the drama is on the part of a church that refused a burial service on their premises because they considered the deceased a sinner.\n\n \n Wrong lesz. They refused a burial service for an unrepentant sinner. There is a huge difference that you refuse to recognize because according to the Gospel of Christ, WE ARE ALL SINNERS.\n \n \n Why do people whine when gay people stand up for their rights? We are in the moral right here, and that church is in the gutter.\n \n \n You are not in the moral right here. You are again attempting to force your Worldly moral perspective on the Church and refuse to see and appreciate that according to the bible and therefore the Church in question, a person who unrepentantly and actively participates in homosexuality are the ones in the SPIRITUAL gutter. So you can't judge them according to your Worldly standards when they are judging the situation according to Spiritual standards.\n \n \nThat's your opinion. Mine is they acted cruelly and unreasonably. More, they acted immorally, as a result of immoral religious doctrines. When religious doctrines hurt people for no good reason, we can rest assured they are wrong.\n\n \n You just refuse to get that God doesn't compromise with Man lesz, and neither will bible believing Christians compromise Gods principles in order to get along with the World. The consequense of compromising ends up being seen as approval to those who practice such sins so compromise is not an option. And someday you will understand this very real fact.", 
   {}, 
   278317, 
   null, 
   1187130240.0
  ], 
  [
   278343, 
   null, 
   "GiantOreo", 
   "I personally think that the church's offer of paying for services was little more than an attempt to soften the PR blow they would take when the entire story came out. Nothing more, nothing less.", 
   {}, 
   278336, 
   null, 
   1187131320.0
  ], 
  [
   278352, 
   null, 
   "Jo Bennett", 
   "Just out of curiosity AA, by what right do they judge? Has God appointed them arbiters?", 
   {}, 
   278343, 
   null, 
   1187132040.0
  ], 
  [
   278354, 
   null, 
   "Sigma", 
   "I personally think that the church's offer of paying for services was little more than an attempt to soften the PR blow they would take when the entire story came out. Nothing more, nothing less.\n\n \n Perhaps. They certainly came out of it looking better because of it, so it wouldn't surprise me.", 
   {}, 
   278343, 
   null, 
   1187132220.0
  ], 
  [
   278469, 
   null, 
   "lesz", 
   "Then we'll have to agree to disagree. I would wager that most reasonable people would agree that the church behaved decently, but that is only my opinion.\n\n \n I'm a pretty reasonable person, and I can't see that this church acted with any decency whatever. Of course, it isn't unique in this way -- the occasional Catholic church has also refused funeral rites for gay Catholics.\n \n \nlesz, the proposed service was what they objected to and the sinful nature of his relationships is what they distanced themselves from. Since the parents wanted the homosexual nature of his relationships to be a significant part of the service (since his relationships, apparently, were a significant part of his life) the church could not, in good conscience, allow that service. From the article it was not the man they objected to; it was more the acceptance and celebration of something they consider abhorrent and immoral. I would think less of them if they compromised their moral principles, even if I disagree with those principles.\n \n Again, they supported and showed compassion for the man himself during his funeral.\n\n \n They essentially spat on the dead man. They were trying to salve their consciences after behaving despicably. I cannot respect any church that treats gay people this way. It's cruel and evil. It needs to be pointed out to them that what they did was far short of Christian love or charity, and it gave no hope to gay Christians.", 
   {}, 
   278287, 
   null, 
   1187199180.0
  ], 
  [
   278471, 
   null, 
   "Zardoz", 
   "Just out of curiosity AA, by what right do they judge? Has God appointed them arbiters?\n\n \n Jo, the bible is riddled with calls to judge your fellow Christian believers.\n \n The common claims some make on 'not to judge' is often taking the call \"Not to judge hypocritically\" out of context.", 
   {}, 
   278352, 
   null, 
   1187200020.0
  ], 
  [
   278475, 
   null, 
   "Jo Bennett", 
   "Jo, the bible is riddled with calls to judge your fellow Christian believers.\n \n The common claims some make on 'not to judge' is often taking the call \"Not to judge hypocritically\" out of context.\n\n \n We are called not to judge because by doing so we call down judgement on our own sins. Only someone who has commited no sin can judge without hypocrisy.", 
   {}, 
   278471, 
   null, 
   1187200560.0
  ], 
  [
   278497, 
   null, 
   "jim's trucking", 
   "I thought you had to ask for forgiveness. You know, repent and stuff\nYou can do that without saying a word to any human. You don't have to tell the preacher. You don't have to tell anyone.\n \n It's not up to the church elders to decide who deserves and who doesn't.\n \n Screw the church elders. Screw the judgemental congregation. Screw the priests, bishops, cardinals and popes.\n \n Ask and ye shall be forgiven.\n \n I would not refuse a decent burial ceremony in a Christian church to ANY CHRISTIAN, be he/she formerly gay, straight, murderer, leper, whore, despot or whatever. That includes blacks being buried in all white cemetaries, too.\n \n Christianity involves forgiveness and there is no list to be made by man of sins for which forgiveness should be denied.", 
   {}, 
   278299, 
   null, 
   1187218320.0
  ], 
  [
   278500, 
   null, 
   "jyoshu", 
   "I would not refuse a decent burial ceremony in a Christian church to ANY CHRISTIAN ... \n\n \n While I would agree, in this case they didn't refuse a decent burial ceremony. They just didn't do it themselves, instead paying for someone else to do it, and as such the person was able to get a ceremony celebrating it the way the family wanted.", 
   {}, 
   278497, 
   null, 
   1187219580.0
  ], 
  [
   278505, 
   null, 
   "Sigma", 
   "You can do that without saying a word to any human. You don't have to tell the preacher. You don't have to tell anyone.\n [...]\n Ask and ye shall be forgiven.\n [...]\n Christianity involves forgiveness and there is no list to be made by man of sins for which forgiveness should be denied\n\n \n I was under the impression the man was unashamed of being gay. It wouldn't make sense, to me at least, for his accepting family to make his homosexual relationship or relationships a significant part of the service if he asked for or wanted forgiveness for this sin.\n \n While I certainly do not know whether this man secretly loathed this aspect of himself, my reading of the article gives no impression that this man would believe he needed to repent, let alone actually had done so.\n \n \nIt's not up to the church elders to decide who deserves and who doesn't.\n\n \n I would assume it is up to the elders to decide whether the celebration of something they consider immoral and abhorrent in their church is appropriate.", 
   {}, 
   278497, 
   null, 
   1187222400.0
  ], 
  [
   278638, 
   null, 
   "jim's trucking", 
   "I was under the impression the man was unashamed of being gay. It wouldn't make sense, to me at least, for his accepting family to make his homosexual relationship or relationships a significant part of the service if he asked for or wanted forgiveness for this sin.\n \n While I certainly do not know whether this man secretly loathed this aspect of himself, my reading of the article gives no impression that this man would believe he needed to repent, let alone actually had done so.\nI don't think I've said that he sinned....and no group of humans can rightly determine that his aledged sins will keep him from spiritual rewards, just as they should not assume that the sinner hasn't already been forgiven for every sin he ever committed. To me, they are being judgemental, pompous, self-righteous. A Christian church should be more than willing to participate in the funeral ceremonies of ALL CHRISTIANS, regardless of the nature of their sins or 'bad' behavior prior to death!...otherwise, they are not acting as their role model would.\n \n \n \n\n I would assume it is up to the elders to decide whether the celebration of something they consider immoral and abhorrent in their church is appropriate.\nPeople who establish, own and manage their own churches certainly have rights to determine what goes on in their buildings. I am merely commenting on the hypocrisy in claiming to be Christian while not being totally forgiving of a dead soul. If I recall correctly, there is one and only one sin that will not be forgiven.\n \n Any church in the USA is free to determine its creed or list of rules. I am free to disagree with their stances on any subject. That's what I like about living in a relatively free country.", 
   {}, 
   278505, 
   null, 
   1187283540.0
  ], 
  [
   278646, 
   null, 
   "Zardoz", 
   "We are called not to judge because by doing so we call down judgement on our own sins. Only someone who has commited no sin can judge without hypocrisy.\n\n \n Jo!\n \n You're comments are NOT backed up by the bible.\n It's LIKE for LIKE.\n An adulterer can not judge a fornicator without cleaning up his own problems 1st.\n The entire plank vs Speck passage deals with this.\n \n As I said, there are MANY passages where Christians ARE CALLED to judge and self police one another. You simply can't do this without judging the others first.\n You calls to avoid judgement simply ties your own hands in dealing with your brethern.\n But, I guess this is a new version of \"Am I my brother's Keeper\" that Cain stated.\n \n The bible says you will be measured by the same stick you judge others with.\n So, if you're living that life of repentence and avoidance of sins, you have nothing to fear for calling fellow christians to do the same.\n \n Seems to seem to think that one keeps their sins...rather than having them washed away with the blood of Christ upon salvation...", 
   {}, 
   278475, 
   null, 
   1187284260.0
  ], 
  [
   278658, 
   null, 
   "Matthew S", 
   " \n You just refuse to get that God doesn't compromise with Man lesz, and neither will bible believing Christians compromise Gods principles in order to get along with the World. The consequense of compromising ends up being seen as approval to those who practice such sins so compromise is not an option. And someday you will understand this very real fact.\n\n \n Well then maybe they need to leave the world. Let me be the first to offer to by the chocolate pudding and koolaid.", 
   {}, 
   278336, 
   null, 
   1187287740.0
  ], 
  [
   278664, 
   null, 
   "Zardoz", 
   "Well then maybe they need to leave the world. Let me be the first to offer to by the chocolate pudding and koolaid.\n\n \n It was actually Flavor Aid brand that was drunk.\n \n This factoid brought to you by my masters at Kool-Aid and the Kool-Aid Man (aka The Big Man),", 
   {}, 
   278658, 
   null, 
   1187288760.0
  ], 
  [
   278681, 
   null, 
   "samiinh", 
   "It was actually Flavor Aid brand that was drunk.\n \n This factoid brought to you by my masters at Kool-Aid and the Kool-Aid Man (aka The Big Man),\n\n \n Whose the Big Man? AA?", 
   {}, 
   278664, 
   null, 
   1187299620.0
  ], 
  [
   278682, 
   null, 
   "Zardoz", 
   "Whose the Big Man? AA?\n\n \n The Man's THE MAN\n \n OH, Yeeeaaahhh!\n \n And remember, you must always obey...your thirst!\n \n And in our modern age of non-alcoholic communal drinks, think of Jebus when you drink deeply from the well-spring of Life!", 
   {}, 
   278681, 
   null, 
   1187300460.0
  ], 
  [
   278694, 
   null, 
   "Sigma", 
   "I don't think I've said that he sinned....and no group of humans can rightly determine that his aledged sins will keep him from spiritual rewards, just as they should not assume that the sinner hasn't already been forgiven for every sin he ever committed.\n\n \n Well, again, my understanding is that one has to ask forgiveness before it even can be granted. Are you proposing he wanted forgiveness in private? So... unashamed homosexual by day, begging God's forgiveness at night? Truly told, I think that analysis is more offensive to this man and homosexuals in general than the actions of the church.\n \n Even that, however, doesn't appear to have been the determining factor in this decision. From the article, they still would have held the service in the church. The proposed service included, as a significant portion, a celebration of that sin, which the leaders certainly can object to, which they did do.\n \n \nAny church in the USA is free to determine its creed or list of rules. I am free to disagree with their stances on any subject. That's what I like about living in a relatively free country.\n\n \n I'm not talking about legal rights, but moral ones. Given their set of beliefs, they have a moral right and obligation to review what was to be presented in their church. Since the material would include, as a significant portion, the celebration of relationships/way of life that is immoral and abhorrent to that set of beliefs they really had no other choice besides to cancel the service or compromise those beliefs.", 
   {}, 
   278638, 
   null, 
   1187306220.0
  ], 
  [
   278700, 
   null, 
   "samiinh", 
   "The Man's THE MAN\n \n OH, Yeeeaaahhh!\n \n And remember, you must always obey...your thirst!\n \n And in our modern age of non-alcoholic communal drinks, think of Jebus when you drink deeply from the well-spring of Life!\n\n \n I will think of Jebus...but I don't drink Koolaid anymore. Too sweet and sicky tasting. Yuck. I'm into the hard stuff now. Tap water over ice.", 
   {}, 
   278682, 
   null, 
   1187309580.0
  ], 
  [
   279338, 
   null, 
   "jim's trucking", 
   "Well, again, my understanding is that one has to ask forgiveness before it even can be granted. Are you proposing he wanted forgiveness in private? So... unashamed homosexual by day, begging God's forgiveness at night? Truly told, I think that analysis is more offensive to this man and homosexuals in general than the actions of the church.\nNot at all. I'm simply saying that nobody alive can tell whether a dead man repented or not because it doesn't have to be done publicly in order for God to get the message.\n \n \n \n\n \n Even that, however, doesn't appear to have been the determining factor in this decision. From the article, they still would have held the service in the church. The proposed service included, as a significant portion, a celebration of that sin, which the leaders certainly can object to, which they did do.\n \n \n \n I'm not talking about legal rights, but moral ones. Given their set of beliefs, they have a moral right and obligation to review what was to be presented in their church. Since the material would include, as a significant portion, the celebration of relationships/way of life that is immoral and abhorrent to that set of beliefs they really had no other choice besides to cancel the service or compromise those beliefs.\nI concede the church should stick to its rules regarding contents at services. It seems they could have compromised on the content of the picture display and carried on with the service.", 
   {}, 
   278694, 
   null, 
   1187561160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Church won't hold funeral for gay man", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10220, 
  "discussion_files": [
   [
    "6543.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-print.html"
   ], 
   [
    "6544.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-12-print.html"
   ], 
   [
    "6545.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-10-print.html"
   ], 
   [
    "6546.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-8-print.html"
   ], 
   [
    "6547.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-6-print.html"
   ], 
   [
    "6548.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-4-print.html"
   ], 
   [
    "6549.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-5-print.html"
   ], 
   [
    "6550.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-7-print.html"
   ], 
   [
    "6551.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-9-print.html"
   ], 
   [
    "6552.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-11-print.html"
   ], 
   [
    "6553.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-3-print.html"
   ], 
   [
    "6554.html", 
    "http://www.4forums.com/political/gay-rights-debates/10220-church-wont-hold-funeral-gay-man-2-print.html"
   ]
  ], 
  "identifier": 10220
 }
]