[
 [
  [
   278387, 
   null, 
   "Matthew S", 
   "Enjoy don't you just love it when they eat each other. This one is for you Sam emoticon_xbouncer emoticon_xagree \n http://www.365gay.com/Newscon07/08/081407pastor.htm", 
   {
    "post_info": {
     "post_title": "When fundies fight"
    }
   }, 
   null, 
   null, 
   1187145180.0
  ], 
  [
   278394, 
   null, 
   "Archangel", 
   "I truly pity you Matt. emoticon_cry", 
   {}, 
   278387, 
   null, 
   1187147340.0
  ], 
  [
   278437, 
   null, 
   "samiinh", 
   "Enjoy don't you just love it when they eat each other. This one is for you Sam emoticon_xbouncer emoticon_xagree \n http://www.365gay.com/Newscon07/08/081407pastor.htm\n\n \n Pretty typical, IMHO. Years ago, my wife and I were seeking some marriage counselling from our minister to only learn a few months latter that he was having an affair with the church secretary, a married woman. Two families were destroyed. I think it has a lot to do with ego and power.", 
   {}, 
   278387, 
   null, 
   1187179020.0
  ], 
  [
   278443, 
   null, 
   "Matthew S", 
   "Pretty typical, IMHO. Years ago, my wife and I were seeking some marriage counselling from our minister to only learn a few months latter that he was having an affair with the church secretary, a married woman. Two families were destroyed. I think it has a lot to do with ego and power.\n\n \n History is filled with people, such as David Koresh and Jim Jones for example, that abuse the trust of people they lead. To Archangel when an organization preaches hate why is it suprising when that hate comes home to roost? I love the devine justice of the whole affair.", 
   {}, 
   278437, 
   null, 
   1187182140.0
  ], 
  [
   278447, 
   null, 
   "samiinh", 
   "History is filled with people, such as David Koresh and Jim Jones for example, that abuse the trust of people they lead. To Archangel when an organization preaches hate why is it surprising when that hate comes home to roost? I love the divine justice of the whole affair.\n\n \n Listening to the morning news from Iraq, it seems insurgents in northern Iraq killed 200 and wounded another 400 with a series of suicide truck bombings yesterday. The target of the attack is a small little known sect (who Muslims believe worship the devil). In the spring, members of this sect stoned to death a young female tribe member for having a relationship with a Sunni Arab. Later, the Sunnis killed some 23 members of the tribe, and now this.\n \n Religion poisons everything.", 
   {}, 
   278443, 
   null, 
   1187186280.0
  ], 
  [
   278621, 
   null, 
   "simone", 
   "Amen. Amen. Amen.", 
   {}, 
   278447, 
   null, 
   1187278500.0
  ], 
  [
   278636, 
   null, 
   "jyoshu", 
   "Religion poisons everything.\n\n \n It's not nice to put down Soulforce members and past civil rights leaders like ML King like that.", 
   {}, 
   278447, 
   null, 
   1187282880.0
  ], 
  [
   278637, 
   null, 
   "Kronus", 
   "It's not nice to put down Soulforce members and past civil rights leaders like ML King like that.\n\n \n Don't confuse religion with religious people.", 
   {}, 
   278636, 
   null, 
   1187283480.0
  ], 
  [
   278639, 
   null, 
   "Archangel", 
   "It's not nice to put down Soulforce members and past civil rights leaders like ML King like that.\n\n \n I'm sure Gene Robinson, the gay bishop wouldn't appreciate it either.emoticon_frazzled \n \n http://www.boston.com/news/local/politics/primarysource/2007/08/nations_first_o.html", 
   {}, 
   278636, 
   null, 
   1187283600.0
  ], 
  [
   278644, 
   null, 
   "samiinh", 
   "Once again, religion poisons everything. All you have to do is open your eyes and take off the blinders to see that.", 
   {}, 
   278639, 
   null, 
   1187284020.0
  ], 
  [
   278652, 
   null, 
   "jyoshu", 
   "Don't confuse religion with religious people.\n\n \n You can't have religious people without religion. If Saminh is going to say something sweeping about religion--that it \"poisons everything\"--then there's a glaring problem with his argument: that religion sometimes motivates people to do good things. He's putting down something that a lot of great social reformers not only found important, but from which they also found motivation and inspiration for their reforms. These people viewed religion as a part of their identity, and therefore he's putting them down by putting down the thing they held the dearest. If Saminh had simply said \"bad religion\", or better yet, \"fundamentalism\", it would be fine. But time and time again he demonstrates disdain for religion in general--ALL religion, and that's a problem.", 
   {}, 
   278637, 
   null, 
   1187286300.0
  ], 
  [
   278672, 
   null, 
   "samiinh", 
   "I am not talking about spirituality. I'm talking about religion...christianity, islam, and all the other religions that preach hate and death based on supernatural beings. God is imaginary. He doesn't exist except in your head.", 
   {}, 
   278652, 
   null, 
   1187294400.0
  ], 
  [
   280084, 
   null, 
   "DrD", 
   "Enjoy don't you just love it when they eat each other. This one is for you Sam emoticon_xbouncer emoticon_xagree \n http://www.365gay.com/Newscon07/08/081407pastor.htm\nThey become targets in the media because they are learned to be hippocrites of what they have been admonishing their flocks NOT to do for years.", 
   {}, 
   278387, 
   null, 
   1187889600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  When fundies fight", 
  "url": "http://www.4forums.com/political/religion-debates/10235-when-fundies-fight.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10235, 
  "discussion_files": [
   [
    "28422.html", 
    "http://www.4forums.com/political/religion-debates/10235-when-fundies-fight-print.html"
   ]
  ], 
  "identifier": 10235
 }
]