[
 [
  [
   279461, 
   null, 
   "supersport", 
   "Question: What's the one piece of evidence that nearly all Darwinists resort to when backed up against a wall about the validity of ToE?\n \n Answer: the vitamin C pseudogene \n \n \n Evolutionists are simply brilliant at deceiving people. For a long time they deceived me too....but after conversing with them day in and day out, I began to learn how their minds work and how to quickly spot their deceptions. Now, with much practice, exposing evolutionists' tricks has become second nature. It is so clear to me now that every piece of \"evidence\" that they have ever presented is the result of deception at one level or another. \n \n One of the greatest examples of deception is the use of the Vitamin C (or gulo gene) as \"evidence\" for common descent. However, I am going to show that this is not evidence in any way, shape or form of common descent. Towards the end of this post, it will become perfectly clear exactly how these people are using a sleight-of-hand to deceive people....it will also become perfectly clear why primates and humans both have this defective gene.\n \n The basic problem here is that evolutionists have ASSUMED that genes (and gene states) occur in different animals because of the result of evolution. In other words since humans and other primates share the same defective gene, then that must mean we are all related to some mysterious ancestor in the past. In their minds there is no way that this defective gene could have appeared independently in humans and other primates without common descent being involved. And the reason for this is they ASSUME that genetic mutations are random. But, there's another side to the story....read on:\n \n I believe that God made each creature with the ability to adapt to different environments. This environmental adaptation has nothing what-so-ever to do with evolving into another kind of creature. Change over time is merely a tool that allows organisms to keep from going extinct. It's this genomic plasticity that helps ensure their survival.\n \n Ok. so instead of looking at this from the evolutionists' standpoint, let's look at this from a different angle. Let's put ourselves in the Garden of Eden. We see Adam and Eve consuming all kinds of fruits and vegetables. In fact, at first that's probably all they ate, since that's what was given to them, (as reported in Genesis.) Going from that point forward, it's pretty easy to imagine that the earth was filled with fruit trees, wild vines with berries, and a human population that was intelligent enough to engage in agriculture.\n \n So with that, it's also pretty easy to imagine that there was no NEED for the human genome to mutate to accommodate a fruitless/vitaminC-less diet. Likewise, we also know that primates also consume a diet high in fruits, leaves and berries, thereby getting plenty of vitamin C. So like humans, primates would have no reason for their genomes to mutate if they ate fruits and leaves high in vitamin C from the beginning.\n \n So at this point we have humans and other primates both consuming diets high in vitamin C, and both containing \"defective\" genomes that are unmutated. This is simply the result of eating fruits from the onset of creation, thus not requiring a mutation to create vitamin C internally.\n \n So what about all the other mammals? Why is it that they are able to create their own vitamin C? Well let's think about it. Look at cows, horses, buffalo, deer, and other grazing animals.....none of them consume fruit...they all consume mainly grasses. Look at bears. They may eat some fruit, but their diet mostly requires a high intake of fats, which means fish and whatever other kinds of animals they can kill. Rodents may also consume some berries, but probably mostly seeds and nuts. Other mammals such as cats and dogs eat mostly meat. No fruits, no berries, little -- if any -- vitamin C.\n \n The point that I'm making here is that there are not too many other mammals whose diets are high in vitamin C. So, what must have happened at some point was that their genomes mutated to accommodate this vitamin C-less diet. I believe every animal was probably initally created to be vegetarians, and at some point after the Fall, any animal populations that did not consume a regular diet high in vitamin C experienced a mutation so that it could be produced internally.\n \n There are actually other animals, though, such as the guinea pig and the fruit bat who, like humans require vitamin C and are unable to produce it internally. In my mind, this simply means that they've always eaten fruits or diets high in vitamin C, thus their genomes have not needed to mutate to accommodate a diet low in Vitamin C! (Is this stuff not just obvious common sense?)\n \n So at the beginning I promised you that I would expose the slight-of-hand evolutionists are using. It's simply this: when they present the argument that the inability to produce vitamin C proves common descent, they are doing so under the guise that this genetic mutation (or lack of it) is a MISTAKE! The reality is, there is no \"mistake.\" It is simply an unmutated gene that remains unmutated because there was no need for a mutation. Since humans and primates consume a diet high in fruits, the genome has no need to change.\n \n And all this would be very easy to test. All evolutionary science would have to do is take some guinea pigs (or fruit bats), isolate them from fruits and other sources of vitamin C for a few generations, let them breed and see if the future generations mutate! There is, of course, no guarantee that a mutation would ensure survival, but it would be interesting to see if a mutation indeed happened. But have there been any such tests? Of course not! Why? Because evolutionary science is not interested in the truth. They could care less about real science and they could care less if mutations are random or nonrandom as long as the population believes we share a common ancestor with a chimp.\n \n As you can see, though, this Vitamin C thing absolutely does not prove common descent. There is a perfectly rational explanation as to why humans and primate genomes have not mutated like other mammals' have.\n \n On the link below you will see that this Gulo gene happens to be in an area in the genome that is more likely to mutate, called a hotspot. Hotspots, being more likely than others to mutate, indicates just what I said earlier: that organisms were set up to be adaptive to different environments.", 
   {
    "post_info": {
     "post_title": "Sleight-of-hand with Vitamin C"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1187645460.0
  ], 
  [
   279462, 
   null, 
   "supersport", 
   "http://www.iscid.org/papers/Borger_SharedMutations_061506.pdf\n \n The extraordinary evidence: the GULO gene\n \n I have always had a fascination for the GULO gene. The GULO gene specifies the protein\n gulono-lactono-oxidase that catalyses the final step in the biosynthesis of ascorbic acid -\n vitamin C. With a few exceptions, all animal species are able to synthesize vitamin C.\n Those who do not produce it require a regular dietary intake, otherwise they will develop\n scurvy. Humans do not synthesize vitamin C. In fact, all the families tested from one\n suborder of primates - the Platyrrhini - also lack the ability to make their own vitamin C,\n whereas those from the other suborder - the Catarrhini - make the vitamin in the liver.\n Humans and the great apes are not the only organisms lacking the ability to synthesize\n 9\n vitamin C, however. All tested species of bats (Chiroptera) are deficient in producing\n vitamin C [Birney et al, 1976]. Another example is the guinea pig, which appears to be\n the only non-producer among the rodents. Degenerative loss of vitamin C biosynthesis\n has evidently occurred quite frequently1. The study of GULO pseudogene sequences may\n be informative to reveal whether mutations are a non-random phenomenon, since - due to\n lack of purifying selection - mutations easily accumulate in pseudogenes.\n In 1999, Japanese scientists at Wakayama Medical University determined the exact DNA\n sequences of the GULO pseudogenes of humans, the great apes and the macaque, and\n compared their data to the active gene found in the rat [Ohta & Nishikimi, 1999]. The\n sequences they reported show that the pseudogenes of the great apes are almost identical,\n but differ on several positions to that of the rat's active gene. As shown in figure 2,\n comparing the sequences of human, chimpanzee, gorilla and orangutan reveals a single\n nucleotide deletion at position 97 in the coding region of exon X in all primates. If the\n genes had been active genes, the deletion would have caused a frame shift and inactivated\n the gene. It is this shared mutation that is often presented as molecular evidence that\n proofs common decent of the Platyrrhini. The mutations in the GULO pseudogene could\n indeed provide such evidence, but then non-random mutations that create the illusion of\n common descent must be excluded.\n In 2003, the same Japanese group published the complete sequence of the guinea pig\n GULO pseudogene and compared it to that of humans [Inai et al, 2003]. They reported a\n 1 An intriguing question is - why would an inactivated GULO pseudogene be fixed in a common ancestor?\n Darwinians must propose the inactivation of the gene provided a selective advantage.\n 10\n large number of shared mutations (substitutions) present in both organisms. Under the\n assumption of an equal chance of substitution throughout the sequence, the probability of\n the same substitutions in both humans and guinea pigs occurring at the observed number\n of positions and more was calculated to be 1.84x10-12. This extreme small probability\n indicates the presence of many mutational hot spots in the sequences [Inai et al, 2003].\n Remarkably, the mutational hot spots found in guinea pigs and humans exactly match the\n mutations that set humans and primates apart from the rat. The GULO sequences\n presented in [Ohta & Nishikimi, 1999] and [Inai et al, 2003] are combined in figure 2. It\n shows that 11 out of 21 positions of exon X are shared and line up as the result of\n mutational hot spots - that is more than 50 percent. Even the single nucleotide deletion at\n position 97 is a non-random position. If non-random mutations make up 50-70 percent of\n the mutations in a DNA sequence they would have dramatic consequences for the\n molecular evidence of common descent; 50 percent is approximately the part of\n mutations shared between humans and chimpanzees sequences that are usually\n interpreted as the result of common descent2.", 
   {
    "unicode_changes_made": true
   }, 
   279461, 
   null, 
   1187645520.0
  ], 
  [
   279464, 
   null, 
   "chemist99a", 
   "Question: What's the one piece of evidence that nearly all Darwinists resort to when backed up against a wall about the validity of ToE?\n \n Answer: the vitamin C pseudogene\n\n \n Nope, thats simply not true. The vitamin C pseudogene was not known to Darwin, or to the scientists who put NDS together. The evidence for common descent was overwhelming long before anyone knew about the phylogenetic distribution of the vitamin C pseudogene. The single best evidence for common descent remains the very near uniformity of the genetic code across all the kingdoms, and of course the similarity of the basic biochemistry of all of life.\n \n But then again there are very good arguments for the same from the areas of comparative anatomy (and as above physiology), and from an number of other lines of evidence. No one historical tracing (which the vitamin C pseudogene is) of a genes history is the keystone holding the conclusion up.", 
   {
    "unicode_changes_made": true
   }, 
   279462, 
   null, 
   1187646660.0
  ], 
  [
   279465, 
   null, 
   "supersport", 
   "Nope, thats simply not true. The vitamin C pseudogene was not known to Darwin, or to the scientists who put NDS together. The evidence for common descent was overwhelming long before anyone knew about the phylogenetic distribution of the vitamin C pseudogene. The single best evidence for common descent remains the very near uniformity of the genetic code across all the kingdoms, and of course the similarity of the basic biochemistry of all of life.\n \n But then again there are very good arguments for the same from the areas of comparative anatomy (and as above physiology), and from an number of other lines of evidence. No one historical tracing (which the vitamin C pseudogene is) of a genes history is the keystone holding the conclusion up.\n\n \n whenever genetic evolution is brought up, the vitamin C thing is often quickly cited.", 
   {}, 
   279464, 
   null, 
   1187646900.0
  ], 
  [
   279467, 
   null, 
   "chemist99a", 
   "By the way SS just who the heck is your author Peter Borger and What is the Institute he apparently works for. And is there a reason that although he is associated with some institute that his e-mail goes through hotmail? And just where was the paper you quoted published? The only Peter Borger I could locate is in Australia (or was) the Institute Borger works for (apparently) seems to be in Germany. Does the guy commute or what?", 
   {}, 
   279465, 
   null, 
   1187647440.0
  ], 
  [
   279468, 
   null, 
   "chemist99a", 
   "whenever genetic evolution is brought up, the vitamin C thing is often quickly cited.\n\n \n Got examples? Never mind I'll look for myself.", 
   {}, 
   279467, 
   null, 
   1187647500.0
  ], 
  [
   279469, 
   null, 
   "supersport", 
   "Got examples? Never mind I'll look for myself.\n\n \n TalkOrigins: 29 evidences for macroevolution to start.", 
   {}, 
   279468, 
   null, 
   1187647920.0
  ], 
  [
   279470, 
   null, 
   "T.Q", 
   "TalkOrigins: 29 evidences for macroevolution to start.\n\n \n Hmm, so we \"darwinists\" always \"fall back\" on the vitamin C bit, but there are 28 other items of evidence listed on one website?", 
   {}, 
   279469, 
   null, 
   1187648160.0
  ], 
  [
   279471, 
   null, 
   "sinjin", 
   "whenever genetic evolution is brought up, the vitamin C thing is often quickly cited.\nYou're the first to bring it up here that I know of.", 
   {}, 
   279465, 
   null, 
   1187648160.0
  ], 
  [
   279475, 
   null, 
   "sinjin", 
   "By the way SS just who the heck is your author Peter Borger and What is the Institute he apparently works for. And is there a reason that although he is associated with some institute that his e-mail goes through hotmail? And just where was the paper you quoted published? The only Peter Borger I could locate is in Australia (or was) the Institute Borger works for (apparently) seems to be in Germany. Does the guy commute or what?\nBorger is an Aussie creationist with a knack for getting banned from message boards. His background is pharmacology not biology.", 
   {}, 
   279467, 
   null, 
   1187648880.0
  ], 
  [
   279476, 
   null, 
   "chemist99a", 
   "OK Talk origins has the following to say. Lets see if its in the context you indicated.\n \n First of all its used as evidence of macro evolution NOT common descent across the board as you implied. Secondly its a vestigial character because the gene is inactivated by a deletion or frameshift thus either stopping expression or resulting in a defective inactive enzyme.\n \n \nPrediction 2.3: Molecular vestigial characters\n \n Vestigial characters should also be found at the molecular level. Humans do not have the capability to synthesize ascorbic acid (otherwise known as Vitamin C), and the unfortunate consequence can be the nutritional deficiency called scurvy. However, the predicted ancestors of humans had this function (as do most other animals except primates and guinea pigs). Therefore, we predict that humans, other primates, and guinea pigs should carry evidence of this lost function as a molecular vestigial character (nota bene: this very prediction was explicitly made by Nishikimi and others and was the impetus for the research detailed below) (Nishikimi et al. 1992; Nishikimi et al. 1994).\n Confirmation:\n \n Recently, the L-gulano-&#947;-lactone oxidase gene, the gene required for Vitamin C synthesis, was found in humans and guinea pigs (Nishikimi et al. 1992; Nishikimi et al. 1994). It exists as a pseudogene, present but incapable of functioning (see prediction 4.4 for more about pseudogenes). In fact, since this was originally written the vitamin C pseudogene has been found in other primates, exactly as predicted by evolutionary theory. We now have the DNA sequences for this broken gene in chimpanzees, orangutans, and macaques (Ohta and Nishikimi 1999). And, as predicted, the malfunctioning human and chimpanzee pseudogenes are the most similar, followed by the human and orangutan genes, followed by the human and macaque genes, precisely as predicted by evolutionary theory. Furthermore, all of these genes have accumulated mutations at the exact rate predicted (the background rate of mutation for neutral DNA regions like pseudogenes) (Ohta and Nishikimi 1999). \n\n \n And you say:\n \n \nThe basic problem here is that evolutionists have ASSUMED that genes (and gene states) occur in different animals because of the result of evolution. In other words since humans and other primates share the same defective gene, then that must mean we are all related to some mysterious ancestor in the past. In their minds there is no way that this defective gene could have appeared independently in humans and other primates without common descent being involved. And the reason for this is they ASSUME that genetic mutations are random. But, there's another side to the story....read on:\n\n \n Its clear you are not familar with the concept of evidence isn't it. ONE rational explanation for finding the same defective gene in a linage is that it was inherited during evolution of that linage! Its NOT proof, but by darn its consistent with the theory that the defect arose once and was inherited from that point foward. Or do you think otherwise - ie that the pattern is INCONSISTENT with a common origin of the now non-functional gene? Of course its always possible that the same mutation DID occurr de-novo in eaxh species in which its found. However this would be inconsistent with known phylogenetics of the primates (from other lines of data). In addition its entirely possible that the gene was lost independently in more than one linage and then propagated to the descendants of that linage. Thus guniea pigs and SOME (but apparently not all) chiropetra lack a functional gene (notably FRUIT BATS lack the functional gene while other spp apparently have a functional version - this is consistent with the diet of FRUIT bats of course).\n \n I don't see how any of what you said supports your claim, nor how PBs \"paper\" would lead to your statements for that matter. Nor does PB apparently exist as a mollecular biologist anywhere!", 
   {}, 
   279469, 
   null, 
   1187648940.0
  ], 
  [
   279477, 
   null, 
   "supersport", 
   "Borger is an Aussie creationist with a knack for getting banned from message boards. His background is pharmacology not biology.\n\n \n I found Borger's paper at brainstorms:\n \n http://www.iscid.org/boards/ubb-forum-f-6.html\n \n \n I have never seen him say a negative word to anyone.", 
   {}, 
   279475, 
   null, 
   1187649060.0
  ], 
  [
   279478, 
   null, 
   "chemist99a", 
   "Borger is an Aussie creationist with a knack for getting banned from message boards. His background is pharmacology not biology.\n\n \n OK so one has to almost assume that the \"Institute\" he works for is his own shell organization which he likely created? I can't find a single reference to it anywhere at all!\n \n So far as I can tell nobody ever cites him and he does not even cite his own work in his \"papers\"", 
   {}, 
   279476, 
   null, 
   1187649120.0
  ], 
  [
   279479, 
   null, 
   "supersport", 
   " \n \n First of all its used as evidence of macro evolution NOT common descent across the board as you implied. \n \n\n \n Oh? So why are some people teaching it as such?\n \n http://www.indiana.edu/~ensiweb/lessons/psb.ball.html\n \n Students compare the DNA sequence data for a portion of the rat GULO gene to the corresponding sequence in the inactive GULO gene (\"pseudogene\") in humans, chimpanzees, orangutans, and crab-eating macaques by identifying the shared sequences in their alignment. They compare the pseudogene sequences and note a shared deletion. In addition, students do an alignment for the first 25 codons of the functional human beta globin gene and its pseduogene in humans, gorillas, and chimpanzees, then compare the pseudogenes and again note a shared deletion, as well as two other shared significant differences from the functional human sequence. Such shared deletions provide strong evidence for shared common ancestry (descent with modification), a natural process of macroevolution", 
   {}, 
   279476, 
   null, 
   1187649240.0
  ], 
  [
   279481, 
   null, 
   "supersport", 
   "any why would Borger title his paper this if evos did not claim the gulo gene pointed to common descent?:\n \n Shared mutations: Common descent or common mechanism?", 
   {}, 
   279479, 
   null, 
   1187649300.0
  ], 
  [
   279482, 
   null, 
   "chemist99a", 
   "I found Borger's paper at brainstorms:\n \n http://www.iscid.org/boards/ubb-forum-f-6.html\n \n \n I have never seen him say a negative word to anyone.\n\n \n But have you ever seen him say a word to ANYONE? And why should I take what he says at anything like face value?", 
   {}, 
   279477, 
   null, 
   1187649420.0
  ], 
  [
   279484, 
   null, 
   "supersport", 
   "But have you ever seen him say a word to ANYONE? And why should I take what he says at anything like face value?\n\n \n yea, quite a bit....He used to debate over at EvC before getting banned for nothing....a phenomenon I'm quite familiar with.", 
   {}, 
   279482, 
   null, 
   1187649780.0
  ], 
  [
   279503, 
   null, 
   "chemist99a", 
   "OK I am free till the wife and I go out to a well deserved (for her) supper. So lets go line by line. Hope I don't bore everyone - I'll try to keep it lively here.\n \n QUOTE=supersport;279461]Question: What's the one piece of evidence that nearly all Darwinists resort to when backed up against a wall about the validity of ToE?\n \n Answer: the vitamin C pseudogene [/Quote]\n \n Simply put this is NOT the case. It would depend on the specific Darwinist. I for example might bring up what I know of the distribution of the mutated codon 83 in CF1. And others would speak from their specific knowledge base. I covered this earlier - you SS are down by 1 point.\n \n \nEvolutionists are simply brilliant at deceiving people.\n \n \n Really? Why for heavens sake would they do such a thing? Whats the motivation? And why resort to attacks if the data are on your side. You know the old admonition to lawyers about when to argue what do you not?\n \n \nFor a long time they deceived me too....but after conversing with them day in and day out, I began to learn how their minds work and how to quickly spot their deceptions. \n\n \n Well bravo for you - they must not be all that good considering. Or did you simply learn to be deceptive yourself and confuse that with deception by others? Who can say?\n \n \nNow, with much practice, exposing evolutionists' tricks has become second nature. It is so clear to me now that every piece of \"evidence\" that they have ever presented is the result of deception at one level or another. \n \n\n \n Good for you are you going to get on with it or are you going to P&M like Behe at Dover?\n \n \nOne of the greatest examples of deception is the use of the Vitamin C (or gulo gene) as \"evidence\" for common descent.\n \n \n We are all ears out here. Get on with it!\n \n \nHowever, I am going to show that this is not evidence in any way, shape or form of common descent. Towards the end of this post, it will become perfectly clear exactly how these people are using a sleight-of-hand to deceive people....it will also become perfectly clear why primates and humans both have this defective gene.\n\n \n So just do what you say you are. And by the way we already know why fruit eating primates and their descendants lack a working copy of GLUO. Its been lost in SOME of the species in which it was not useful, and of course in species where it was useful it could not be lost since any individual carrying a defective gene would DIE and fail to REPRODUCE. Natural selection you understand!\n \n \nThe basic problem here is that evolutionists have ASSUMED that genes (and gene states) occur in different animals because of the result of evolution. \n\n \n Nope thats not a problem, its what one would anticipate, and you have it reveresed in any case. Evolutionists assume that evolution occurrs when gene frequencies change. They do not assume that evolution is the cause they assume its the effect of such changes. But I digress as any old and worn academic is prone to do. Occupational hazard - too many solvent fumes you know.\n \n \nIn other words since humans and other primates share the same defective gene, then that must mean we are all related to some mysterious ancestor in the past. In their minds there is no way that this defective gene could have appeared independently in humans and other primates without common descent being involved. And the reason for this is they ASSUME that genetic mutations are random. But, there's another side to the story....read on:\n\n \n Nope its more like SHOULD humans and primates have a common ancestor its likely that there will be genes (or psuedogenes) that are found in the presumed linage of the group. Indeed evolutionists would predict that this would be the case. The finding of such genes (and there are a lot of them) would be consistent with the theory of common descent among the species in the group. {Note well this is especially the case for a pseudogene - for reasons I will not go into here lest I be accussed of lecturing).\n \n \nI believe that God made each creature with the ability to adapt to different environments. This environmental adaptation has nothing what-so-ever to do with evolving into another kind of creature. Change over time is merely a tool that allows organisms to keep from going extinct. It's this genomic plasticity that helps ensure their survival.\n\n \n Your beliefs are not evidence and they are not relevant to the issue you have raised. Namely whether conclusions drawn from GULO information constitute slight of hand.\n \n \nOk. so instead of looking at this from the evolutionists' standpoint, let's look at this from a different angle. Let's put ourselves in the Garden of Eden. We see Adam and Eve consuming all kinds of fruits and vegetables. In fact, at first that's probably all they ate, since that's what was given to them, (as reported in Genesis.) Going from that point forward, it's pretty easy to imagine that the earth was filled with fruit trees, wild vines with berries, and a human population that was intelligent enough to engage in agriculture.\n\n \n Lets not after all what relevance does a fairy tale you tell have with regard to whether or not evolutionists have been deceptive with regard to GULO? None! We all know that primates (including humans) often eat fruits and vegs which contain substantial vit C.\n \n \nSo with that, it's also pretty easy to imagine that there was no NEED for the human genome to mutate to accommodate a fruitless/vitaminC-less diet. Likewise, we also know that primates also consume a diet high in fruits, leaves and berries, thereby getting plenty of vitamin C. So like humans, primates would have no reason for their genomes to mutate if they ate fruits and leaves high in vitamin C from the beginning.\n\n \n Well yes, but thats not what DEFECTIVE GULO indicates. If one has external sources of vitamin C, GULO can mutate to be inactive without causing a problem, and once inactive the inactive gene can be inherited without causing problems so long as vitamin C intake is high enough. An inactive GULO indicates that the species has external sources of vitamin C which is essential to many metabolic processes.\n \n \nSo at this point we have humans and other primates both consuming diets high in vitamin C, and both containing \"defective\" genomes that are unmutated. This is simply the result of eating fruits from the onset of creation, thus not requiring a mutation to create vitamin C internally.\n\n \n Nope the defective gene is itself a mutation of the active form of the enzyme. And the mutation to the defective gene would occurr at random but would only be inherited in linages which have external sources of C in their diet. It is not necessarily the case that such a mutation would occurr in every species with high vit C intake please note.\n \n \nSo what about all the other mammals? Why is it that they are able to create their own vitamin C? Well let's think about it. Look at cows, horses, buffalo, deer, and other grazing animals.....none of them consume fruit...they all consume mainly grasses. Look at bears. They may eat some fruit, but their diet mostly requires a high intake of fats, which means fish and whatever other kinds of animals they can kill. Rodents may also consume some berries, but probably mostly seeds and nuts. Other mammals such as cats and dogs eat mostly meat. No fruits, no berries, little -- if any -- vitamin C.\n\n \n Yep and if you get say a bear with a defective GULO gene it will die since it cannot survive and reproduce without adequate vit C being made internally. Its diet will usually not provide an adequate source. Carnivores must maintain a working copy of GULO else they will die out.\n \n \nThe point that I'm making here is that there are not too many other mammals whose diets are high in vitamin C. So, what must have happened at some point was that their genomes mutated to accommodate this vitamin C-less diet. \n\n \n Nope it worked the other way round my friend. Somewhere along the line AFTER the hypothetical ancestor switched to a vitamin C rich diet GULO suffered a frame shift and ceased to be an effective enzyme. For species with high C intake this makes no difference with regard to survival or reproduction. The defective gene could only be retained by those linages which continued to consume exogenous C in adequate amounts.\n \n \nI believe every animal was probably initally created to be vegetarians, and at some point after the Fall, any animal populations that did not consume a regular diet high in vitamin C experienced a mutation so that it could be produced internally.\n\n \n You can believe what you want, your beliefs are not relevant to the issue.\n \n \nThere are actually other animals, though, such as the guinea pig and the fruit bat who, like humans require vitamin C and are unable to produce it internally. In my mind, this simply means that they've always eaten fruits or diets high in vitamin C, thus their genomes have not needed to mutate to accommodate a diet low in Vitamin C! (Is this stuff not just obvious common sense?)\n\n \n The bats (which are not in the primate linage) do not appear to make vitamin C. Whether they have the pseudogene or not I have not determined.\n \n S\no at the beginning I promised you that I would expose the slight-of-hand evolutionists are using. It's simply this: when they present the argument that the inability to produce vitamin C proves common descent, they are doing so under the guise that this genetic mutation (or lack of it) is a MISTAKE! The reality is, there is no \"mistake.\" It is simply an unmutated gene that remains unmutated because there was no need for a mutation. Since humans and primates consume a diet high in fruits, the genome has no need to change.\n\n \n Sorry but the gene in humans is not a gene at all. Its an unexpressed pseudogene. A sequece which does not code for anything. And of course since the primate linage is more recent (and provably so) than the other mammals which DO make C you have the chronological relationships reversed. Being backwards seems to be your forte. You assume in effect that all species are co-temporal - a great error.\n \n \nAnd all this would be very easy to test. All evolutionary science would have to do is take some guinea pigs (or fruit bats), isolate them from fruits and other sources of vitamin C for a few generations, let them breed and see if the future generations mutate! There is, of course, no guarantee that a mutation would ensure survival, but it would be interesting to see if a mutation indeed happened. But have there been any such tests? Of course not! Why? Because evolutionary science is not interested in the truth. They could care less about real science and they could care less if mutations are random or nonrandom as long as the population believes we share a common ancestor with a chimp\n.\n \n A non-viable experiment. You would likely wait a million years or more for the mutation to occurr (yes reversion IS possible); however, if you isolate species requiring C from a source of C for even a single generation there will be no offspring by generation 2 at the latest! I suppose you could round up something like 10 billion guinea pigs and see if any survived no C in their diets, but its not practical to do so. I think its a reasonable inference that such difficulties may be why your proposed experiment is likely to be met with some degree of reluctance.\n \n \nAs you can see, though, this Vitamin C thing absolutely does not prove common descent. There is a perfectly rational explanation as to why humans and primate genomes have not mutated like other mammals' have.\n\n \n Science does not PROVE things. Science can (by empirical induction) only falsify things with certainty. Hypotheses not yet falsified are held to be PROVISIONALLY true but not proven. And there is a perfectly rational explanation all right, namely that the working GULO gene mutated to ineffectiveness in animals with a high vitiman C intake and was subsequently passed on, and that because such animals could not make vitmin C they continued to require diets high in C.\n \n O\nn the link below you will see that this Gulo gene happens to be in an area in the genome that is more likely to mutate, called a hotspot. Hotspots, being more likely than others to mutate, indicates just what I said earlier: that organisms were set up to be adaptive to different environments\n\n \n Its in a hot spot, but that does not have the consequences you wish to assert.", 
   {
    "unicode_changes_made": true
   }, 
   279461, 
   null, 
   1187653740.0
  ], 
  [
   279515, 
   null, 
   "supersport", 
   "I simply hate long, drawn-out dialog, but I'm bored too so I guess I'll play along.\n \n \n \n So just do what you say you are. And by the way we already know why fruit eating primates and their descendants lack a working copy of GLUO. Its been lost in SOME of the species in which it was not useful, and of course in species where it was useful it could not be lost since any individual carrying a defective gene would DIE and fail to REPRODUCE. Natural selection you understand! \n\n \n Yeap...that's your mantra. Or, the alternative could be as I explained. Simply saying it's the other way doesn't make it be.\n \n SS: The basic problem here is that evolutionists have ASSUMED that genes (and gene states) occur in different animals because of the result of evolution. \n \n \n \n Nope thats not a problem, its what one would anticipate, and you have it reveresed in any case. Evolutionists assume that evolution occurrs when gene frequencies change. They do not assume that evolution is the cause they assume its the effect of such changes. But I digress as any old and worn academic is prone to do. Occupational hazard - too many solvent fumes you know.\n\n \n Yes, that is the problem, because if you were to admit that changes in biology happened nonrandomly then you would have to admit that this could very well be an environmentally-induced change and have absolutely nothing to do with selection. You are simply repeating your position, which does not negate mine.\n \n SS: In other words since humans and other primates share the same defective gene, then that must mean we are all related to some mysterious ancestor in the past. In their minds there is no way that this defective gene could have appeared independently in humans and other primates without common descent being involved. And the reason for this is they ASSUME that genetic mutations are random. But, there's another side to the story....read on: \n \n \nNope its more like SHOULD humans and primates have a common ancestor its likely that there will be genes (or psuedogenes) that are found in the presumed linage of the group..\n\n \n wrong. You assume common ancestory as a given....then go from there by making all the \"evidence\" fit into that assumption.\n \n \n Indeed evolutionists would predict that this would be the case. The finding of such genes (and there are a lot of them) would be consistent with the theory of common descent among the species in the group. ..\n\n \n fine...but that's different than calling it \"evidence\" for common descent. If the same evidence can fit nicely in a creationist perspective then it's not really evidence for ToE. I just gave you a perfectly plausible explanation.\n \n SS: I believe that God made each creature with the ability to adapt to different environments. This environmental adaptation has nothing what-so-ever to do with evolving into another kind of creature. Change over time is merely a tool that allows organisms to keep from going extinct. It's this genomic plasticity that helps ensure their survival. \n \n \nYour beliefs are not evidence and they are not relevant to the issue you have raised. Namely whether conclusions drawn from GULO information constitute slight of hand...\n\n \n My \"beliefs\" are merely not assuming that we descended from a common ancestor. Thus, I'm looking at the situation from a different angle. The slight of hand I was referring to was about evolutionists calling the inability to produce vitamin C a \"mistake.\"\n \n \n SS: Ok. so instead of looking at this from the evolutionists' standpoint, let's look at this from a different angle. Let's put ourselves in the Garden of Eden. We see Adam and Eve consuming all kinds of fruits and vegetables. In fact, at first that's probably all they ate, since that's what was given to them, (as reported in Genesis.) Going from that point forward, it's pretty easy to imagine that the earth was filled with fruit trees, wild vines with berries, and a human population that was intelligent enough to engage in agriculture. \n \n \nLets not after all what relevance does a fairy tale you tell have with regard to whether or not evolutionists have been deceptive with regard to GULO? None! We all know that primates (including humans) often eat fruits and vegs which contain substantial vit C....\n\n \n I could say the same about common descent. You are assuming common descent -- you believe in it, as do other evos at least in part because of the vitamin C thing. I think you are the one dreaming because the evidence doesn't support it. You can't even give me a single example of a mutation that creates a new beneficial modification to phenotype. How in the world did the cell or the brain or the eye or any other organ evolve?\n \n \n \nAn inactive GULO indicates that the species has external sources of vitamin C which is essential to many metabolic processes.....\n\n \n And? How is that different than what I said? I simply am saying that there's a reason it's active or if it's not....and the reason is diet. If the diet changes in humans, for instance, there may very well be a change in this. Who knows.\n \n SS: So at this point we have humans and other primates both consuming diets high in vitamin C, and both containing \"defective\" genomes that are unmutated. This is simply the result of eating fruits from the onset of creation, thus not requiring a mutation to create vitamin C internally. \n \n \n \n Nope the defective gene is itself a mutation of the active form of the enzyme. And the mutation to the defective gene would occurr at random but would only be inherited in linages which have external sources of C in their diet. It is not necessarily the case that such a mutation would occurr in every species with high vit C intake please note.\n \n Why are you calling this gene \"defective?\" It's not defective. And are you telling me that it's humans and primates who have mutated -- and not animals that don't consume diets of vitamin C?? \n \n \n \nYep and if you get say a bear with a defective GULO gene it will die since it cannot survive and reproduce without adequate vit C being made internally.....\n\n \n unless it reproduces before it dies....mutations usually happen during development.\n \n \n \n \nNope it worked the other way round my friend. Somewhere along the line AFTER the hypothetical ancestor switched to a vitamin C rich diet GULO suffered a frame shift and ceased to be an effective enzyme. .....\n\n \n um...how do you know this? Is there any scientific evidence for it? it could just as easily happened the way I described it. All we know for sure is that primates and humans need vitamin C in the form of diet, while other animals don't. How this came to be is not known, and for you to assume that humans and primates once had this enzyme is an unsubstantiated guess.\n \n \n SS: I believe every animal was probably initally created to be vegetarians, and at some point after the Fall, any animal populations that did not consume a regular diet high in vitamin C experienced a mutation so that it could be produced internally\n \n \n \nYou can believe what you want, your beliefs are not relevant to the issue......\n\n \n lol....my explanation is just as valid as yours. You cannot show me any evidence that it happened your way. It's merely a guess based on your assumption of common descent. Since I do not assume common descent I do not corner myself with a explanation that can never be validated.\n \n \n SS: And all this would be very easy to test. All evolutionary science would have to do is take some guinea pigs (or fruit bats), isolate them from fruits and other sources of vitamin C for a few generations, let them breed and see if the future generations mutate! There is, of course, no guarantee that a mutation would ensure survival, but it would be interesting to see if a mutation indeed happened. But have there been any such tests? Of course not! Why? Because evolutionary science is not interested in the truth. They could care less about real science and they could care less if mutations are random or nonrandom as long as the population believes we share a common ancestor with a chimp \n \n \n \n A non-viable experiment. You would likely wait a million years or more for the mutation to occurr (yes reversion IS possible);\n \n LOL! says who? How would you know unless you tried it?\n \n Science does not PROVE things.\n \n not anything regarding ToE, anyway.\n \n \n  Science can (by empirical induction) only falsify things with certainty.\n \n then why don't they falsify that mutations happen nonrandomly? Oh, that's right, because they can't.\n \n http://www.molevol.org/camel/projects/synthesis/\n \n Its in a hot spot, but that does not have the consequences you wish to assert.  \n \n Hotspots validate my claim that animals were set up to change with changing conditions.", 
   {
    "unicode_changes_made": true
   }, 
   279503, 
   null, 
   1187656020.0
  ], 
  [
   279529, 
   null, 
   "Symbiote", 
   "Wow you're right supersport! Genes mutate when they realise it would be a good idea, like my cousin larry was born in a cold climate, and he has a thick fur coat all over him. But his \"identical twin\" jimmy we adopted out to an island in the pacific, and he mutated a tail, and a hard, hammer like beak he uses to bust open coconuts.\n \n Truly the evolutionists are wrong, creatures aren't \"born\" with these mutations - IDIOCY! My cousins larry and jimmy are identical twins, but they MUTATED useful traits because creatures do that sort of thing! God set them up that way! Just like he set up whales to mutate legs if they ended up beached, so they could carve a swathe of destruction across the land before launching into a new sea, WHERE DO YOU THINK THE GRAND CANYON CAME FROM!", 
   {}, 
   279515, 
   null, 
   1187658480.0
  ], 
  [
   279530, 
   null, 
   "supersport", 
   "Wow you're right supersport! Genes mutate when they realise it would be a good idea, like my cousin larry was born in a cold climate, and he has a thick fur coat all over him. But his \"identical twin\" jimmy we adopted out to an island in the pacific, and he mutated a tail, and a hard, hammer like beak he uses to bust over coconuts.\n \n Truly the evolutionists are wrong, creatures aren't \"born\" with these mutations - IDIOCY! My cousins larry and jimmy are identical twins, but they MUTATED useful traits under the benevolent guidance of vitalism.\n \n It's the same reason I have an enormous penis, my genes just KNEW such a gift would serve me well in contemporary society!\n\n \n you might want to look at page 2 before you embarrass yourself more:\n \n http://discovermagazine.com/2006/nov/cover\n \n please notice the flea that created a new spine for itself in the presence of predators -- and then passed it down to future offspring. Of course there is no mutation involved, but beneficial phenotypic modificatons never do. Mutations seem to be reserved for internal functions. That does not mean they can't be nonrandom.\n \n Anyone is welcome to prove to me that mutations are random.", 
   {}, 
   279529, 
   null, 
   1187658600.0
  ], 
  [
   279533, 
   null, 
   "N.Wells", 
   "If we are going to discuss this we need the data. Hopefully this table will work. I'm going to post it to see if it works, and come back with discussion later.\n \n \n The numbers down the left side are the positions.\n Column 1 = rats, \n Column 2 = guinea pigs,\n Column 3 = macaques \n Column 4 = orang utans\n Column 5 = chimpanzees\n Column 6 = humans\n I'm only listing changes from the rat condition (i.e., dots = same as rats)\n \n Please note \n 1) that the macaque data set is not as complete as the others: blanks = no data, lines = start & end of data, and \n 2) the \"xxx\" in site 97 and site 100 represents deletions\n 3) I don't trust the data for a deletion at site 100 vs site 97 for macaques - it is from a different source. I'll try to confirm it independently if I can.\n \n \n \n\n 1 2 3 4 5 6\n \n 1 G A A A A\n 2 G . A A A\n 3 A . . . .\n 4 G . . . .\n 5 A . . . .\n 6 A . . . .\n \n 7 G . . . .\n 8 A . . . .\n 9 C . . . .\n 10 C . . . .\n 11 A . . . .\n 12 A . C C C\n \n 13 G . . . .\n 14 G . . . .\n 15 A . . . .\n 16 G . . . .\n 17 G . . . .\n 18 C . . . .\n \n 19 C . . . .\n 20 C . . . .\n 21 T . . . .\n 22 A G G G G\n 23 C . . . .\n 24 T . . . .\n \n 25 G . . . .\n 26 G . . . .\n 27 A . . . .\n 28 G . . . .\n 29 C . . . .\n 30 T G G G G\n \n 31 A . . . .\n 32 A . . . .\n 33 A . . . .\n 34 G . . . .\n 35 G A . . .\n 36 C G . . .\n \n 37 A . . . .\n 38 T . . . .\n 39 G . . . .\n 40 C . . . .\n 41 T . . . G\n 42 G . . . .\n \n 43 G . . . .\n 44 G . . . .\n 45 A . . . .\n 46 G A . . .\n 47 G . . . .\n 48 C . . . .\n \n 49 C . . . .\n 50 C . . . .\n 51 A . . . .\n 52 C . . . .\n 53 C . . . .\n 54 C . . . .\n \n 55 C . T . T\n 56 A . G G G\n 57 A . . . .\n 58 A G G G G\n 59 G . . . .\n 60 T . . . .\n \n 61 G . . . .\n 62 G . . . .\n 63 T C . . .\n 64 A . G G G\n 65 G . T T T\n 66 C . . . .\n \n 67 C . . . .\n 68 C . . . .\n 69 A . . . .\n 70 C . ------ . . .\n 71 T . . . . .\n 72 A . . . . .\n \n 73 C . A . . .\n 74 C . . . . .\n 75 C . . . T T\n 76 C T G G G G\n 77 G . . . . .\n 78 T . . . . .\n \n 79 A G G G G G\n 80 G . . . . .\n 81 A G G G G G\n 82 G . . . . .\n 83 G . . . C .\n 84 T . . . . .\n \n 85 G . . . A A\n 86 C . G . . .\n 87 G . . . . .\n 88 C . . . . .\n 89 T . . . . .\n 90 T . . . . .\n \n 91 C . . . . .\n 92 A . . . . .\n 93 C . . . . .\n 94 C . . . . .\n 95 C . . . T T\n 96 G . A A . .\n \n 97 A G A xxx xxx xxx\n 98 G . . . . .\n 99 G . . A A A\n 100 C . xxx . . .\n 101 G . . . . .\n 102 A . . . . .\n \n 103 T C . . . .\n 104 G . . . . .\n 105 A . . . . .\n 106 C . . . . .\n 107 A . . G . .\n 108 T . . . . .\n \n 109 T C C C C C\n 110 C . A . . .\n 111 T . . . . .\n 112 G A A A A\n 113 C . . . . .\n 114 T . . . . .\n \n 115 G . . . . .\n 116 A . . . . .\n 117 G . . . . .\n 118 C . . . . .\n 119 C . . . . .\n 120 C . . . . .\n ------ \n 121 C . . . .\n 122 T . . . .\n 123 G C \n 124 C . . . .\n 125 T . . . .\n 126 T . . . .\n \n 127 C . . . .\n 128 C . . . .\n 129 A . . . .\n 130 G . . . .\n 131 A . C C T\n 132 G . A . .\n \n 133 G . . . .\n 134 G . . . .\n 135 A . . . .\n 136 C . . . .\n 137 A . . . .\n 138 G . . . .\n \n 139 C . . . .\n 140 T . C C C\n 141 G . . . .\n 142 C . . . .\n 143 T . . . .\n 144 A . . . .\n \n 145 C . T . .\n 146 A . C C C\n 147 T . . . .\n 148 G . . . .\n 149 A . . . .\n 150 A . . . .\n \n 151 C . . . .\n 152 A . . . .\n 153 T . . . .\n 154 C . . . .\n 155 A T . . .\n 156 T G A A A\n \n 157 T C C C C\n 158 A . C C C\n 159 T . . . .\n 160 G A . . .\n 161 T . . . .\n 162 A . . . .\n \n 163 C . . . .\n 164 A . . . .\n 165 G . . . .\n \n \n", 
   {}, 
   279481, 
   null, 
   1187658840.0
  ], 
  [
   279541, 
   null, 
   "N.Wells", 
   "Okay, the first thing that is complete and total nonsense is Borger's statement that \nRemarkably, the mutational hot spots found in guinea pigs and humans exactly match the mutations that set humans and primates apart from the rat. \n\n \n He's misinterpreting this. The places where the rats are different from all the others are NOT where magic convergence happened that makes guinea pigs look improperly like apes. They are simply instances where rats have had mutations that the others haven't. \n \n Note that there may well be typos in the table and in the following - if so, I apologize in advance.\n \n If you look down the list you will see the following unique mutations (unique meaning in one species only):\n Humans only: 1 instance, #41\n Chimps only : 1 instance, #83\n Orangs only: 3 instances, #s 107, 132, 145\n Macaques only: 4 instances, #s 73, 86, 100, 110 \n Guineapigs only: 8 instances, #s 35, 36, 46, 63, 103, 123, 155, 160\n Rats only: 8 instances, #s 1, 22, 30, 58, 79, 81, 109, 157\n \n Humans and chimps uniquely shared: 3 instances, #s 75, 85, 95\n \n This is according to evolutionary expectations. \n Humans and chimps separated only a few million years ago, so there hasn't been time for many separate mutations.\n \n Orangs separated from humans and chimps a bit longer ago: they've had 3 mutations, and the line that went off to humans and chimps also had 3 before humans and chimps split, and then one each afterward.\n \n Macaques show 4, reflecting a longer time since separation, but the data is incomplete, so it should be more. \n \n Rats & guinea pigs have each had 8 unique mutations, again nicely balanced and indicating identical mutation rates, since their two lineages separated. (They are rodents, but they are very different rodents that separated several tens of millions of years ago.)\n \n More later.", 
   {}, 
   279533, 
   null, 
   1187660040.0
  ], 
  [
   279546, 
   null, 
   "N.Wells", 
   " The point that I'm making here is that there are not too many other mammals whose diets are high in vitamin C. So, what must have happened at some point was that their genomes mutated to accommodate this vitamin C-less diet. I believe every animal was probably initally created to be vegetarians, and at some point after the Fall, any animal populations that did not consume a regular diet high in vitamin C experienced a mutation so that it could be produced internally.\n \n There are actually other animals, though, such as the guinea pig and the fruit bat who, like humans require vitamin C and are unable to produce it internally. In my mind, this simply means that they've always eaten fruits or diets high in vitamin C, thus their genomes have not needed to mutate to accommodate a diet low in Vitamin C! (Is this stuff not just obvious common sense?)\n \n So at the beginning I promised you that I would expose the slight-of-hand evolutionists are using. It's simply this: when they present the argument that the inability to produce vitamin C proves common descent, they are doing so under the guise that this genetic mutation (or lack of it) is a MISTAKE! The reality is, there is no \"mistake.\" It is simply an unmutated gene that remains unmutated because there was no need for a mutation. Since humans and primates consume a diet high in fruits, the genome has no need to change.\n\n \n This is sillier than your usual nonsense. Vitamin C production is a three step process, usuallly. Our steps 1 and 2 work just fine, but our step 3 is the one that doesn't. Quite clearly, we had a fruit-rich diet so that when the step 3 gene broke, our ancestors were not inconvenienced. Why would we have a useless broke step three? Why did all the other animals, according to you also get a useless gene. and then they all fixed it and then made subsequent changes? That makes no sense. Also, note that the ape vitamin-C gene is broken by a deletion in site 97 (which therefore causes a frame shift that invalidates the gene action), but the guinea pig has some other problem with its gene, suggesting that it came by its problem differently.\n \n \n \n please notice the flea that created a new spine for itself in the presence of predators -- and then passed it down to future offspring. Of course there is no mutation involved, but beneficial phenotypic modificatons never do. Mutations seem to be reserved for internal functions. That does not mean they can't be nonrandom.\n\n This is also silly. The effect is not permanent and involves no changes to the genome - if fades after a few generations, so it is not evolution. Beneficial phenotypic changes that occur during development are a dime a dozen in plants - compare an oak tree in a forest to one of the same species on its own in a field - but most aren't heritable for even one generation. Also, plently of mutations affect external appearance - check out achondroplasia in humans and in daschunds.", 
   {
    "unicode_changes_made": true
   }, 
   279541, 
   null, 
   1187660820.0
  ], 
  [
   279555, 
   null, 
   "chemist99a", 
   "Yes, that is the problem, because if you were to admit that changes in biology happened nonrandomly then you would have to admit that this could very well be an environmentally-induced change and have absolutely nothing to do with selection. You are simply repeating your position, which does not negate mine.\n\n \n So lets see what happens if we have your scheme dGLUO -< GLUO. Do you want to test your hypothesis personally? OK you should be able to eliminate vitamin C from your diet and you will then somehow mutate to make it internally right? Sorry you will not live through the experience and you will produce no offspring should you be postulating that your germ cells only will change. \n \n dGLUO -GLUO will produce either extinction or a severe genetic bottleneck - or else if its induced by the environment you will possibly live through my suggested dietary modification for you. You will not survive however. If you dispute me then do the experiment. Enjoy your defiency!", 
   {}, 
   279546, 
   null, 
   1187661780.0
  ], 
  [
   279560, 
   null, 
   "chemist99a", 
   "Yes, that is the problem, because if you were to admit that changes in biology happened nonrandomly then you would have to admit that this could very well be an environmentally-induced change and have absolutely nothing to do with selection. You are simply repeating your position, which does not negate mine.\n\n \n So lets see what happens if we have your scheme dGLUO -< GLUO. Do you want to test your hypothesis personally? OK you should be able to eliminate vitamin C from your diet and you will then somehow mutate to make it internally right? Sorry you will not live through the experience and you will produce no offspring should you be postulating that your germ cells only will change. \n \n dGLUO -GLUO will produce either extinction or a severe genetic bottleneck - or else if its induced by the environment you will possibly live through my suggested dietary modification for you. You will not survive however. If you dispute me then do the experiment. Enjoy your defiency!", 
   {}, 
   279546, 
   null, 
   1187662740.0
  ], 
  [
   279564, 
   null, 
   "chemist99a", 
   "wrong. You assume common ancestory as a given....then go from there by making all the \"evidence\" fit into that assumption.\n\n \n Wrong I merely stated that the evidence (a common pseudogene in the primate linage) is consistent with origin of that pseudogene in a common ancestor of that linage. If you think that a common ancestral species with the pseudogene COULD NOT account for the gene being in the primate linage then please explain why that is. The data are ALSO consistent with de-novo origin of the dGLUO gene in each of the species in the linage. The data are ALSO consistent with combinations of de-novo origins in parts of the linage and common ancestor heritage in others.", 
   {}, 
   279560, 
   null, 
   1187663340.0
  ], 
  [
   279566, 
   null, 
   "chemist99a", 
   "My \"beliefs\" are merely not assuming that we descended from a common ancestor. Thus, I'm looking at the situation from a different angle. The slight of hand I was referring to was about evolutionists calling the inability to produce vitamin C a \"mistake.\"\n \n\n \n Very well YOU assume that primates did not develop from a common ancestor that each species was created de-novo. Its your right to make that assumption. And its your funeral as to credibility. And the inability to produce vitamin C is due to a pseudogene. Pseudogenes have lost their ability to be expressed or if expressed to produce active enzymes. There is no \"mistake\" involved as the process which leads to the mutation is not directed nor does it have a list of whats correct and incorrect. The inability of primates to produce vit C because of dGLUO is a fact. Its not a mistake, its not deliberate, its not a good move, it just is!", 
   {}, 
   279564, 
   null, 
   1187663700.0
  ], 
  [
   279567, 
   null, 
   "chemist99a", 
   "I\n could say the same about common descent. You are assuming common descent -- you believe in it, as do other evos at least in part because of the vitamin C thing. I think you are the one dreaming because the evidence doesn't support it. You can't even give me a single example of a mutation that creates a new beneficial modification to phenotype. How in the world did the cell or the brain or the eye or any other organ evolve?\n\n \n I have done so several times. Sickle cell trait is beneficial because it provides some degree of resistance to malaria. Its the result of a single point mutation in the hemoglobin gene which alters the way that hemoglobin molecules interact and the ability of the parasite to consume the protein.\n \n And yes given the evidence I do provisionally accept the theory that primates have a common ancestor from which they have radiated.", 
   {}, 
   279566, 
   null, 
   1187663940.0
  ], 
  [
   279568, 
   null, 
   "N.Wells", 
   "There are some interesting complications in the data set. Specifically, multiple alterations are seen at several locations, so it is fair to suggest that there are mutational hotspots, or at least locations where mutations were tolerated while the gene was still functional. These are sites 55, 76, 97, 131, and 156. However, there is nothing wrong with some sites permitting more mutations than others - proteins are functional molecules, and have to meet certain shape requirements for some tasks. \n \n I'm not sure about apes having a deletion at site 97, while macaques have a deletion at site 100. Since apes evolved from old world monkeys, the simplest pattern would be if apes and macaques share a single deletion. However, Borger notes that apes can't make vitamin C, that catarrhines (old world monkeys can), and that platyrrhines (new world monkeys) can't. As macaques are old world monkeys, I'm not sure what the difference means - can anybody else here shed any light on this?\n \n \nHotspots validate my claim that animals were set up to change with changing conditions. \n\n So why are synonymous mutations among the most common?\n \n \n \nI began to learn how their minds work and how to quickly spot their deceptions. Now, with much practice, exposing evolutionists' tricks has become second nature. It is so clear to me now that every piece of \"evidence\" that they have ever presented is the result of deception at one level or another.\n\n Scientists can make mistakes, as we are human, after all. Being human also means that, regrettably, there are occasional episodes of fraud and deception in science. However, these are rare - first, we are trained to go where the data takes us, and secondly the nature of science is that frauds in science that are of any significance will inevitably be discovered. However, charging a whole field with deception seems insane. In contrast, so far, your boastfulness and aspersions are looking pretty hollow.", 
   {
    "unicode_changes_made": true
   }, 
   279564, 
   null, 
   1187664060.0
  ], 
  [
   279570, 
   null, 
   "chemist99a", 
   "Why are you calling this gene \"defective?\" It's not defective. And are you telling me that it's humans and primates who have mutated -- and not animals that don't consume diets of vitamin C??\n\n \n Because it is not functional in the sense of producing a protein or in producing an active enzyme. And yes the logical direction for the mutation is toward the human form which I am calling dGLUO. Its in the molecular biology and the way this particular kind of mutation happens. It can go backwards (see the case of passerine avaians). Let me make it clear the ancestral type prior to mutation is a FUNCTIONAL GENE whose gene product allows for the synthesis to vitamin C by those species which have it {and the remainder of the biosynthetic chain}.", 
   {}, 
   279567, 
   null, 
   1187664300.0
  ], 
  [
   279572, 
   null, 
   "chemist99a", 
   "unless it reproduces before it dies....mutations usually happen during development.\n\n \n If it happens in development then the resultant bear will also die from lack of vitamin C unless of course it simultaneously becomes a fruit eater etc. Unlikely in a carnivore don't ya think?", 
   {}, 
   279560, 
   null, 
   1187664420.0
  ], 
  [
   279573, 
   null, 
   "chemist99a", 
   "http://www.4forums.com/political/member.php?u=6945\n \n I'm new here. Your embedded table is great. Mind telling me how you did by means of a post or private message. I did not realize we had that capability here.", 
   {}, 
   279572, 
   null, 
   1187664660.0
  ], 
  [
   279574, 
   null, 
   "N.Wells", 
   "To be honest, that was more luck than skill. I used {code} {/code} (with square brackets), but that was to just to preserve spacing. All the rest just happened automatically.", 
   {}, 
   279573, 
   null, 
   1187665320.0
  ], 
  [
   279575, 
   null, 
   "chemist99a", 
   "WOW, I will have to try it next time I need a scrolling table. How did you enter the data - directly or from a spreadsheet or whatever?", 
   {}, 
   279574, 
   null, 
   1187665740.0
  ], 
  [
   279585, 
   null, 
   "chemist99a", 
   "Just in case SS is unaware of the effects of a defiency of vit C in us fruit and veggie eaters here is a short summary from WIKI. Now SS do you wish to try putting a human population under zero vit C intake and waiting around for the offspring to have an active GLUO gene and be able to make it themselves. Good luck with your institutional review board!\n \n =====================================\n \n Symptoms\n * Dark purplish spots on skin, especially legs.\n * spongy gums, often leading to tooth loss.\n * bleeding from all mucous membranes.\n * Pallor.\n * Bleeding gums.\n * Sunken eyes\n * Opening of healed scars and separation of knitted bone fractures.\n \n Prognosis\n \n Untreated scurvy is always fatal. However, since all that is required for a full recovery is the resumption of normal vitamin C intake, death from scurvy is rare in modern times.\n \n ==========================================", 
   {}, 
   279575, 
   null, 
   1187668920.0
  ], 
  [
   279591, 
   null, 
   "supersport", 
   "Wells: Why would we have a useless broke step three? \n \n You are assuming that we once had the ability to produce our own vitamin C. Why?\n \n \n Why did all the other animals, according to you also get a useless gene. and then they all fixed it and then made subsequent changes? That makes no sense. \n \n What makes you think the gene was useless?...if it can go either way, then it's certainly not useless, is it?", 
   {}, 
   279568, 
   null, 
   1187670300.0
  ], 
  [
   279592, 
   null, 
   "supersport", 
   "Because it is not functional in the sense of producing a protein or in producing an active enzyme. And yes the logical direction for the mutation is toward the human form which I am calling dGLUO. Its in the molecular biology and the way this particular kind of mutation happens. It can go backwards (see the case of passerine avaians). Let me make it clear the ancestral type prior to mutation is a FUNCTIONAL GENE whose gene product allows for the synthesis to vitamin C by those species which have it {and the remainder of the biosynthetic chain}.\n\n \n But just because it is not active does not necessarily mean \"defective\"....it simply means that don't need it....(as of yet).", 
   {}, 
   279570, 
   null, 
   1187670420.0
  ], 
  [
   279594, 
   null, 
   "supersport", 
   "Just in case SS is unaware of the effects of a defiency of vit C in us fruit and veggie eaters here is a short summary from WIKI. Now SS do you wish to try putting a human population under zero vit C intake and waiting around for the offspring to have an active GLUO gene and be able to make it themselves. Good luck with your institutional review board!\n \n =====================================\n \n Symptoms\n * Dark purplish spots on skin, especially legs.\n * spongy gums, often leading to tooth loss.\n * bleeding from all mucous membranes.\n * Pallor.\n * Bleeding gums.\n * Sunken eyes\n * Opening of healed scars and separation of knitted bone fractures.\n \n Prognosis\n \n Untreated scurvy is always fatal. However, since all that is required for a full recovery is the resumption of normal vitamin C intake, death from scurvy is rare in modern times.\n \n ==========================================\n\n \n No why would I do that? I'd do it to guinea pigs though. My contention is that changes may very well happen during development of the offspring of vitamin C-deficient organisms.", 
   {}, 
   279585, 
   null, 
   1187670480.0
  ], 
  [
   279596, 
   null, 
   "supersport", 
   "SS: please notice the flea that created a new spine for itself in the presence of predators -- and then passed it down to future offspring. Of course there is no mutation involved, but beneficial phenotypic modificatons never do. Mutations seem to be reserved for internal functions. That does not mean they can't be nonrandom. \n \n \n \n Wells: The effect is not permanent and involves no changes to the genome - if fades after a few generations, so it is not evolution. \n \n Amen! Nothing is ever evolution...have you noticed that? I say \"evolution\" is a myth. All kinds of changes (many of which are heritable) go on around us, but none of it is ever evolution: horizontal gene transfer, phenotypic plasticity, epigenetics -- but strangely, no RMNS. Why is that? \n \n \n  Also, plently of mutations affect external appearance - check out achondroplasia in humans and in daschunds.\n \n that's not my claim...what I said is that mutations do not create beneficial, selectable modifications to phenotype. (The offer is still on the table to prove me wrong.)", 
   {}, 
   279568, 
   null, 
   1187670720.0
  ], 
  [
   279598, 
   null, 
   "supersport", 
   "I\n \n I have done so several times. Sickle cell trait is beneficial because it provides some degree of resistance to malaria. Its the result of a single point mutation in the hemoglobin gene which alters the way that hemoglobin molecules interact and the ability of the parasite to consume the protein.\n \n And yes given the evidence I do provisionally accept the theory that primates have a common ancestor from which they have radiated.\n\n \n that doesn't benefically affect the phenotype (outward appearance or physical structure) of the organism.", 
   {}, 
   279567, 
   null, 
   1187671140.0
  ], 
  [
   279601, 
   null, 
   "supersport", 
   "for anyone interested, borger's dialog at Brainstorms about this subject is fascinating:\n \n http://www.iscid.org/boards/ubb-get_topic-f-6-t-000656.html\n \n http://www.iscid.org/boards/ubb-get_topic-f-6-t-000688.html", 
   {}, 
   279598, 
   null, 
   1187671980.0
  ], 
  [
   279602, 
   null, 
   "N.Wells", 
   "So like humans, primates would have no reason for their genomes to mutate if they ate fruits and leaves high in vitamin C from the beginning.\n \n So at this point we have humans and other primates both consuming diets high in vitamin C, and both containing \"defective\" genomes that are unmutated.\n So why would god give humans (and all the other animals) a broken vitamin-C gene in the first place? Since animals were going to need a fixed version eventually, why not just give everyone a fixed version in the first place? Why on earth would he give us working versions of the two genes that make precursors to vitamin C, so our bodies are pumping out the precursors, only for the lack of the third gene those things go to waste and simply undergo proteolytic degradation. \n \n And while Adam and Eve did not need a vitamin-C gene, was god unable to foresee that a lot of innocent sailors in later years would die hideous deaths from scurvy? He could have easily avoided that problem from the get-go, or he could have stuck a verse in Genesis where he instructed Noah to take some limes along, or put something in Deuteronomy that said, \"And if thou goeth more than several months to sea, for My sake includeth oranges amongst thy comestibles.\" But he didn't. So why do you think he wanted boatloads of sailors to die from scurvy? And the people at risk aren't just sailors: historically, victims have included many soldiers (including many crusaders) and people in beseiged cities, and in the modern world refugees who are dependent on international donations of rice, wheat, and corn. Check out why the eastern cedar is called arborvitae, the 'tree of life'.)\n \n And even if he had wanted us to be capable of dying from scurvy, why not simply insert the whole working gene, and simply provide something that turned the gene off or blocked its action. Our genomes are full of genes that do those things. That way turning it back on when needed would be simple, and all the animals wouldn't have had to wait for beneficial mutations to occur, as per your model. \n \n \nI believe every animal was probably initally created to be vegetarians, and at some point after the Fall, any animal populations that did not consume a regular diet high in vitamin C experienced a mutation so that it could be produced internally.\n Won't work. The mutation will first be expressed in the next round of offspring, before which time the prospective parents will have died from scurvy. \n \n \n (SS)Oh? So why are some people teaching it as such? \n\n One website is not across the board, but nonetheless, they are teaching it because it is indeed excellent evidence in support of evolution, Borger's misunderstandings and your nonsense notwithstanding.\n \n \n Borger is an Aussie creationist with a knack for getting banned from message boards. His background is pharmacology not biology. \n\n Over at ISCID, he says he's Dutch, but lived in Australia a while, and then moved to Germany.\n \n For Chemist: typed in Excel, copied as unformatted text into Wordperfect, and just copy-pasted into the comment space here.", 
   {
    "unicode_changes_made": true
   }, 
   279568, 
   null, 
   1187672100.0
  ], 
  [
   279603, 
   null, 
   "chemist99a", 
   "Wells: Why would we have a useless broke step three?\n \n You are assuming that we once had the ability to produce our own vitamin C. Why?\n\n \n Nope we inherited the non-functional gene from a common ancestor. It never was a functional part of human beings.\n \n \nWhy did all the other animals, according to you also get a useless gene. and then they all fixed it and then made subsequent changes? That makes no sense.\n \n What makes you think the gene was useless?...if it can go either way, then it's certainly not useless, is it?\n\n \n But it is non-functional. Effecively useless. And I might add other than possibly in some bird linages there is no evidence for reversion. Its not a symmetrical situation you understand. Unless a species already has a good source of vitamin C at hand its not feasable for the gene to evolve to the pseudogene. Once that evoltuion has taken place a zero vitamin C diet will not result in reversion - there is not enough time - it will result in extinction or else a severe genetic bottleneck. If reversion is to occur it most likely will have to occur while the species still is consuming adequate amounts of vitamin C. Then if the vitamin C source dries up the gene can be useful. This is a form of whats called pre-adaptation and in this case the loss of the vitamin C source cannot logically serve to trigger the mutation. Death will ensue before offsrping are produced.", 
   {}, 
   279602, 
   null, 
   1187673240.0
  ], 
  [
   279604, 
   null, 
   "chemist99a", 
   "No why would I do that? I'd do it to guinea pigs though. My contention is that changes may very well happen during development of the offspring of vitamin C-deficient organisms.\n\n \n Such offspring will die very soon after birth and they will be the offspring of very sick parents. Scurvy affects all the connective tissues, its likely that no offspring will occur at all.", 
   {}, 
   279603, 
   null, 
   1187673420.0
  ], 
  [
   279605, 
   null, 
   "chemist99a", 
   "that doesn't benefically affect the phenotype (outward appearance or physical structure) of the organism\n\n \n Wrong it most definitely DOEs affect the physical structure of the organism. Unless of course you think changing the protein sequence of hemoglobin is NOT a structural change (it is) and is somehow non-physical (it is).", 
   {}, 
   279604, 
   null, 
   1187673600.0
  ], 
  [
   279606, 
   null, 
   "supersport", 
   " So why would god give humans (and all the other animals) a broken vitamin-C gene in the first place? Since animals were going to need a fixed version eventually, why not just give everyone a fixed version in the first place? \n\n \n That's the thing -- it's not \"broken\"...it's not a mistake...it's not defective. It's simply the state we (and I'm guessing other animals) were created in. Only after other animals began eating sources of food that did not include vitamin C did they change. We have not yet changed because we don't need to. [/QUOTE]\n \n \n \nWhy on earth would he give us working versions of the two genes that make precursors to vitamin C, so our bodies are pumping out the precursors, only for the lack of the third gene those things go to waste and simply undergo proteolytic degradation. \n\n \n I would presume to make the change simple.\n \n \n And while Adam and Eve did not need a vitamin-C gene, was god unable to foresee that a lot of innocent sailors in later years would die hideous deaths from scurvy? \n\n \n Well, after the fall, all kinds of bad things happened....one of them being disease. Another being that animals became carnivores. If humans had not sinned (hence staying vegetarian) they woulnd't have had this problem. It's just unfortunate that it took humanity so long to figure it out that fruits (vitamin C) is essential for good health. This is not God's fault though, it's man's fault. And besides, if you read in Genesis, God gave humans all the seed-bearing fruits and vegetables as food. This should have been adheared to.....those sailors weren't paying attention to what they should have been paying attention to. Many people aren't today, as well. Have you had your apple today?", 
   {}, 
   279602, 
   null, 
   1187673960.0
  ], 
  [
   279607, 
   null, 
   "chemist99a", 
   "And SS if you are going to do your guinea pig experiment there are some things below that you need to know.\n \n \n \nAscorbicnd Acid\n \n The ascorbic acid requirement of the guinea pig has been reviewed by Mannering (1949). Navia and Hunt (1976) summarized the major metabolic roles for ascorbic acid in this animal. The daily requirement of ascorbic acid varied from 0.4 to 25 mg/day according to the criterion used to evaluate adequacy. Values reported to support growth were 0.4 to 2 mg/day in 250 to 350 g guinea pigs; reproduction was supported by 2 to 5 mg/day (Mannering, 1949). Scurvy was prevented by 1.3 to 2.5 mg/day; odontoblast growth, wound healing, and bone regeneration were supported by 2 mg/day; and tissue saturation occurred at 25 to 30 mg/day. Approximately 7 mg of ascorbic acid/kg BW was adequate to maintain adrenal size and odontoblast height in male guinea pigs ranging from 110 to 840 g BW (Pfander and Mitchell, 1952). Collins and Elvehjem (1958) found 5 mg/kg BW sufficient for growth of immature guinea pigs.\n \n The liver, kidney, plasma, lens, and aqueous humor concentration of ascorbic acid reflected the amount of ascorbic acid fed (0.8 to 60 mg/animal/day) to both young and old guinea pigs. The half-life of tissue ascorbate was reported to be the same in guinea pigs provided a maintenance dose (0.5 mg/day) or a higher dose (30 mg/100 g BW/day) (Ginter et al., 1982). A concentration of 50 mg/kg diet was marginal for survival. At 200 mg/kg diet, hepatic ascorbic acid accumulated in the liver. Adrenal and splenic concentrations increased with concentrations of 900 mg/kg diet (Degkwitz and Boedeker, 1989). Higher tissue concentrations were achieved by mixing the vitamin in the diet (500 mg/kg) than by daily oral administration (Ginter et al., 1979). An intake of 5 mg/day provides adequate amounts of ascorbic acid for growth and reproduction; normal intake of 200 mg/kg diet (1,135 µmol/kg diet) will fulfill this need.\n \n Ascorbic acid absorption was reported to be sodium dependent and involve a transporter molecule (Siliparandi et al., 1979). Dehydroascorbic acid was readily absorbed and reduced by dehydroascorbic acid reductase to ascorbic acid in the intestinal mucosa. Transport of endogenous ascorbate across the basolateral membrane assures the mucosal cell access to the vitamin in the absence of a dietary supply (Rose et al., 1988).\n \n The stability of ascorbic acid in diets varies with the composition of the diet, storage temperature, and humidity. Approximately one-half of the initial ascorbic acid may be oxidized and lost 90 days after the diet has been mixed. Aqueous solutions may lose vitamin C potency rapidly.\n \n Ascorbic acid at 0.5 mg/kg BW prevented rapid fatal scurvy and 55 percent of guinea pigs survived, but after 16 weeks these animals exhibited a marked increase in serum cholesterol, LDL-cholesterol, VLDL-cholesterol, triglycerides, and total lipids. The LDL:HDL ratio rose from 1.13 to 19.02 with cholesterol added at 3 g/kg diet (Kothari and Sharma, 1988) and stimulated the oxidation of ascorbic acid to carbon dioxide (Ginter and Zloch, 1972). Magnesium L-ascorbic acid phosphate has been shown to cure scurvy in the guinea pig (Machlin et al., 1979), but L-ascorbic acid 2-sulfate did not have antiscorbutic activity (Tsujimura, 1978).\n \n Signs of Ascorbic Acid Deficiency Early signs of vitamin C deficiency in guinea pigs were reduced diet intake and weight loss, followed by anemia and widespread hemorrhages. An impaired clotting mechanism, as indicated by increased prothrombin time, also contributes to hemorrhaging with vitamin C deficiency. Resting body temperatures were higher in scorbutic guinea pigs than normal animals (Green et al., 1980). Deficiency resulted in muscle damage but not neuropathy (Sillevis Smitt et al., 1991). Ascorbic acid-deficient animals were dead within 3 to 4 weeks from the causes noted above or from secondary bacterial infections, to which guinea pigs are susceptible. Ascorbate deficiency has been linked to an impairment in carnitine synthesis, increased urinary carnitine excretion, and prolonged survival time with carnitine supplementation (Jones and Hughes, 1982; Alkonyi et al., 1990).\n \n Vitamin C deficiency resulted in decreased vitamin B12 absorption; increased absorption of alanine and leucine; enhanced activity of brush border sucrase, alkaline phosphatase, and leucine aminopeptidase; and higher concentrations of intestinal membrane sialic acid and total lipids (Dulloo et al., 1982). Deficiency also reduced oxalate ab\n", 
   {}, 
   279605, 
   null, 
   1187674380.0
  ], 
  [
   279609, 
   null, 
   "N.Wells", 
   "Wells: Why would we have a useless broke step three?\n \n You are assuming that we once had the ability to produce our own vitamin C. Why?\n \n \n Why did all the other animals, according to you also get a useless gene. and then they all fixed it and then made subsequent changes? That makes no sense.\n \n What makes you think the gene was useless?...if it can go either way, then it's certainly not useless, is it?\n\n Not us, but some ancestor.\n \n Because we have all the components, which work to no useful effect through the second step, and then don't work because of an obviously defective gene that has suffered a deletion that causes a frame shift that renders it useless. \n \n In your model, each 'kind' of animal has to have a nonfunctional version and then mutates it into a working version. So how come separate kinds that still have the broken forms each have a different form of breakage and different additional mutations that (except for not working) otherwise match the mutations that characterize their ancestry alone? (If either of us can find the sequencing data for fruit bats and the red-vented bulbul, that should shed additional light on this question - I predict additional differences and different forms of breakage.) How come #s of unique mutations per lineage are consistent with the geological lengths of time since lineage splitting, rather than all organisms having the same # of mutations, as a post-Fall model would require? So your 'backwards' model won't work.\n \n \n \nthat doesn't benefically affect the phenotype (outward appearance or physical structure) of the organism.\n \n \nwhat I said is that mutations do not create beneficial, selectable modifications to phenotype. (The offer is still on the table to prove me wrong.)\n\n Asked and answered. You're wrong on this. Also, nobody but you has this definition of 'phenotype', and again you're wrong. \n \n From http://www.brooklyn.cuny.edu/bc/ahp/BioInfo/GP/Definition.html\n \nPhenotype\n This is the \"outward, physical manifestation\" of the organism. These are the physical parts, the sum of the atoms, molecules, macromolecules, cells, structures, metabolism, energy utilization, tissues, organs, reflexes and behaviors; anything that is part of the observable structure, function or behavior of a living organism.\n \n Genotype\n This is the \"internally coded, inheritable information\" carried by all living organisms. This stored information is used as a \"blueprint\" or set of instructions for building and maintaining a living creature. These instructions are found within almost all cells (the \"internal\" part), they are written in a coded language (the genetic code), they are copied at the time of cell division or reproduction and are passed from one generation to the next (\"inheritable\"). These instructions are intimately involved with all aspects of the life of a cell or an organism. They control everything from the formation of protein macromolecules, to the regulation of metabolism and synthesis. \n\n So you are indeed completely uninformed on this point. \n \n In fact, it's worse than that. You've been told this information several times before, on several bulletin boards, and yet you still repeat it. And yet you accuse us of being deceptive! At what point does continued willful mistatement become lying, hmmm?\n \n Also, I was responding to your statement that \"Mutations seem to be reserved for internal functions \", which is nonsense as written. To cite some examples: from Wikipedia, achrondroplasia \"is a result of an autosomal dominant mutation in the fibroblast growth factor receptor gene 3 (FGFR3), which causes an abnormality of cartilage formation. FGFR3 normally has a negative regulatory effect on bone growth. In achondroplasia, the mutated form of the receptor is constitutively active and this leads to severely shortened bones.\" The double muscle aspect of bully whippets is due to the mutation MSTN in the myostatin-producing gene. A comparable mutation can be seen in http://fig.cox.miami.edu/~cmallery/150/neuro/belgian.blue.jpg\n \n And for a similar mutation in humans, see \n http://cnews.canoe.ca/CNEWS/Science/2004/06/24/512617.html\n http://fig.cox.miami.edu/~cmallery/150/neuro/myostatin.htm", 
   {}, 
   279602, 
   null, 
   1187674980.0
  ], 
  [
   279611, 
   null, 
   "supersport", 
   "http://www.websters-online-dictionary.com/definition/english/Ph/Phenotype.html\n \n The phenotype of an individual organism is either its total physical appearance and constitution, or a specific manifestation of a trait, such as size or eye color, that varies between individuals", 
   {}, 
   279609, 
   null, 
   1187675460.0
  ], 
  [
   279613, 
   null, 
   "supersport", 
   "http://www.cite-sciences.fr/lexique/definition1.php?lang=an&id_expo=2&id_habillage=15&iddef=147&idmot=58\n \n The genotype of an individual is the genetic information carried by the person's genes , whether or not the genes are actively expressed as proteins . In comparison, the phenotype denotes all the observable characteristics of an individual, such as physical appearance (eye colour, height, etc.) and internal physiology. It is determined in part by genes and in part by environment and way of life.\n \n You were saying, Wells?\n \n besides, I don't care to debate definitions....what I'm saying is that mutations do not create beneficial modifications to observable characteristics. deal with it.", 
   {
    "unicode_changes_made": true
   }, 
   279611, 
   null, 
   1187675700.0
  ], 
  [
   279614, 
   null, 
   "chemist99a", 
   "http://www.4forums.com/political/member.php?u=4378\n \n Well SS the structure of the hemoglobin an organism has is definitively a characteristic of the organism so my original offering of Sickle cell trait as a beneficial phenotypic change stands. Do you wish to dispute it?", 
   {}, 
   279611, 
   null, 
   1187675700.0
  ], 
  [
   279617, 
   null, 
   "supersport", 
   "http://www.4forums.com/political/member.php?u=4378\n \n Well SS the structure of the hemoglobin an organism has is definitively a characteristic of the organism so my original offering of Sickle cell trait as a beneficial phenotypic change stands. Do you wish to dispute it?\n\n \n sorry, sickle cell trait is not a beneficial trait, thus, how could you possibly want me to believe that any structural change could be beneficial? You are really grasping at straws here, I see.\n \n Do you really want me to believe that any kind of evolution happened when you cannot give me even one example of your mechanism doing a single blasted thing in regards to creating or beneficially modifying physical structure?", 
   {}, 
   279614, 
   null, 
   1187676060.0
  ], 
  [
   279618, 
   null, 
   "N.Wells", 
   "You are not understanding what you are citing - \"the phenotype denotes all the observable characteristics of an individual\". Observable here means, and has always meant, behaviours, internal anatomy, external appearance, physiology, metabolism, etc., etc., etc. Read the dang literature - you are once again setting up a strawman based on your own incompetence and ignorance.\n \n You claim not to want to debate definitions, but you are continually running afoul of your own mistaken assumptions about the definitions. You are making a complete spectacle of yourself.\n \n And look at my links, and remember that \"beneficial\" is situational (context-dependent) and changeable, not absolute and unchangeable. Chemist's mention of sickle cell also answers your requirements of a mutation causing a beneficial change to the phenotype (it can keep at least some of your children from dying of malaria, if you happen to live in a malarial area).", 
   {}, 
   279614, 
   null, 
   1187676360.0
  ], 
  [
   279619, 
   null, 
   "chemist99a", 
   "s\norry, sicle cell trait is not a beneficial trait, thus, how could you possibly want me to believe that any structural change could be beneficial? You are really grasping at straws here, I see.\n\n \n Actually it is. If one has sickle cell trait one is less subject to attack by the malarial parasite. Its a well known effect and highly documented and the specific mechanism is known. Question this fact at your own peril SS. I will bury you if necessary in documentation. Or perhaps you think that NOT dying of malaria is somehow NOT beneficial. Glad to debate that if you wish. Frankly you are up against the wall here my friend. There is no logical or rational way to deny the facts on the ground. Wiggle you may but wrong you are.", 
   {}, 
   279617, 
   null, 
   1187676420.0
  ], 
  [
   279620, 
   null, 
   "supersport", 
   "s\n \n Actually it is. If one has sickle cell trait one is less subject to attack by the malarial parasite. Its a well known effect and highly documented and the specific mechanism is known. Question this fact at your own peril SS. I will bury you if necessary in documentation. Or perhaps you think that NOT dying of malaria is somehow NOT beneficial. Glad to debate that if you wish. Frankly you are up against the wall here my friend. There is no logical or rational way to deny the facts on the ground. Wiggle you may but wrong you are.\n\n \n I'm not getting into this here, but WW correctly showed how sickle cell does not offer any better survivability than malaria does. Besides that, I would not consider hemoglobin a physical structure at all....besides, how could you prove that it changed beneficially? Do you call a gene a physical structure too? If so, then simply by mutating it's changing structure, which invalidates my challenge. This, of course, is ridiculous. Try again.", 
   {}, 
   279619, 
   null, 
   1187676600.0
  ], 
  [
   279621, 
   null, 
   "chemist99a", 
   "Shall I give you a small taste of whats coming if you persist SS?\n \n Please SS read the following little introductory bit before I begin. You can skip if you are willing to concede. Otherwise be prepared for an onslaught.\n \n http://sickle.bwh.harvard.edu/malaria_sickle.html", 
   {}, 
   279619, 
   null, 
   1187677020.0
  ], 
  [
   279622, 
   null, 
   "supersport", 
   "Shall I give you a small taste of whats coming if you persist SS?\n \n Please SS read the following little introductory bit before I begin. You can skip if you are willing to concede. Otherwise be prepared for an onslaught.\n \n http://sickle.bwh.harvard.edu/malaria_sickle.html\n\n \n how about this instead, how about you show me that the sickle cell mutation is not an adaptive response from a developing organism in an attempt to skirt around malaria's effects?", 
   {}, 
   279621, 
   null, 
   1187677140.0
  ], 
  [
   279623, 
   null, 
   "chemist99a", 
   "I'm not getting into this here, but WW correctly showed how sickle cell does not offer any better survivability than malaria does. Besides that, I would not consider hemoglobin a physical structure at all....besides, how could you prove that it changed beneficially? Do you call a gene a physical structure too? If so, then simply by mutating it's changing structure, which invalidates my challenge. This, of course, is ridiculous. Try again.\n\n \n Well of course Malaria does not offer very good survivability does it. And sickle cell trait does reduce mortality to malaria relative to those who do not carry the trait. \n \n Hemoglobin is profoundly a physical structure. It consists of atoms held together by bonds and it has a specific set of conformations and it fills space. Its as purely physical as a building or a gemstone. And of course genes are physical structures what else do you think they could be certainly they are not immaterial or non-physical and they are definitely structured. After all they hand out noble prizes to people who elucidate such structures and of course the human genome project had as its goal to elucidate the structure of the human genome in depth. If you wish to see an image of a gene or stretch of DNA then try this one. Computer model on the left, STM of actual DNA on the right? Are you going to claim that these bits-of-stuff are not a physical structure???? On what silly basis????", 
   {}, 
   279620, 
   null, 
   1187677620.0
  ], 
  [
   279624, 
   null, 
   "chemist99a", 
   "how about this instead, how about you show me that the sickle cell mutation is not an adaptive response from a developing organism in an attempt to skirt around malaria's effects?\n Reply With Quote\n\n \n How about this - we settle the issue regarding your claim that nobody has ever pointed out a mutation to you which had beneficial effects on the phenotype? First things first. Lets deal with the issue at hand here and now rather than letting you dodge it! OK?\n \n Perhaps you remember your original claim:\n \n \nYou can't even give me a single example of a mutation that creates a new beneficial modification to phenotype.\n\n \n Given that at that point I had repeatedly brought up sickle cell trait and explanations of same your statement is a distortion which you need either to retract or defend in depth. Dodging the issue is going to get you nowhere.", 
   {}, 
   279623, 
   null, 
   1187677800.0
  ], 
  [
   279625, 
   null, 
   "supersport", 
   "How about this - we settle the issue regarding your claim that nobody has ever pointed out a mutation to you which had beneficial effects on the phenotype? First things first. Lets deal with the issue at hand here and now rather than letting you dodge it! OK?\n\n \n I'm not dodging it.....I simply do not accept that a gene or a hemoglobin qualifies as the evolution of phenotype. Nor can you prove that these are \"beneficial\" changes. I think you know what I'm talking about when I say phenotype -- the outward characteristics, or even internal organs, of organisms....you know, the parts that we can actually see with our own two eyes. Evolutionists have long looked at nature, observed a population of animals changing (such as finches) and called that \"evolution.\" But I don't think it's evolution at all because new traits (such as new, beneficial beak shapes) are not formed from mutation. They're most certainly adaptive responses from developing embryos -- just like malaria resistance is.", 
   {}, 
   279624, 
   null, 
   1187678160.0
  ], 
  [
   279626, 
   null, 
   "N.Wells", 
   "I simply do not accept that a gene or a hemoglobin qualifies as the evolution of phenotype. Nor can you prove that these are \"beneficial\" changes. I think you know what I'm talking about when I say phenotype -- the outward characteristics, or even internal organs, of organisms.\n\n AND THUS YOU REMAIN WRONG ABOUT THE DEFINITION!\n \n This is simply not your option - the word has a specific technical meaning, and if you are going to use it, you have to follow the definition. What you actually need to do is to stop using the word (which will have the additional advantage of camouflaging your lack of knowledge) and simply argue that you are unsatisfied that the extent of changes demonstrated to result from mutations is capable of causing the sorts of large-scale changes needed to create a new phylum, or for that matter even a new type of limb or organ (or whatever you want to claim). You'll still be wrong, of course, but you'll appear slightly less clueless and we can move on to a more interesting argument.\n \n Here's another set of examples of mutations affecting phenotype (in this case external appearance!), and they also show how the advantageousness of mutations depends on context.\n \n There are many different specific mutations that can result in syndactyly (webbed / fused fingers or toes), because there are many ways to shut down apoptosis during finger formation in the embryo.\n \n You could maybe use one of those to help dig up what's left of your credibility. Ooops, too late.\n \n Here's an instance that happened to a chicken: http://farm1.static.flickr.com/131/375762088_2baf479d59_o.jpg That's not much use to a standard chicken, but to one that's living in a marsh, or needs to swim once in a while, it could be very advantageous.\n \n http://www.childrenshospital.org/az/Site1036/Images/syndactyly.jpg\n http://www.emedicine.com/plastic/images/13501350pla0183-05.jpg\n Not much use to us here and now, but it has happened more than once in evolutionary history:\n http://animaldiversity.ummz.umich.edu/site/resources/anatomical_images/metatherian_traits/syndactyly.jpg/medium.jpg\n It may not have affected tose animals one way or the other, but it could be all kinds of useful if you were an ancestral whale just starting to take up life in the water, at perhaps an otter-like level of activity in the water:\n http://www.edwardtbabinski.us/whales/hind_limb_buds/dolphin_embryo_02_high_res.jpg\n Note how the dolphin fetus has a mitten-like hand, as do we while we start to develop. Shut down finger separation, and you have an instant paddle. Hans Thewissen had a really nice paper about a year ago, showing which genes work when during dolphin limb development, and exactly what differences happen to dolphins relative to what happens in standard mammals.", 
   {}, 
   279624, 
   null, 
   1187678160.0
  ], 
  [
   279627, 
   null, 
   "N.Wells", 
   "(from SS) Nothing is ever evolution...have you noticed that? I say \"evolution\" is a myth. All kinds of changes (many of which are heritable) go on around us, but none of it is ever evolution: horizontal gene transfer, phenotypic plasticity, epigenetics -- but strangely, no RMNS. Why is that?\n\n I forgot to respond to that earlier. \n \n You are wrong again. \n \n HGT - evolutionary change, evolutionary process.\n \n PP - not a permanent change (so not evolutionary unless we are seeing genetically programmed, permanently available options).\n \n Epigenetics - if permanent, then its effectively evolutionary change, but it's not genetic, so it lies outside of standard evolutionary theory, and thus (potentially) provides an exception to it. Evolutionary theory makes the claim that evolutionary change is at least primarily genetic in nature, so if a lot of epigenetic change was found, especially if it was found to be the rule, I think that would count as an overthrow of modern evolutionary theory.\n \n Also, evolutionary processes are not restricted to RM&NS. You have to add in recombination and genetic drift (the latter of wich comes in quite a few varieties).", 
   {}, 
   279624, 
   null, 
   1187679360.0
  ], 
  [
   279628, 
   null, 
   "chemist99a", 
   "Oh yes do not confuse sickle cell disease with sickle cell trait. The disease is seen in homozygotes, the trait in heterozygotes. Those facts are very important in the population genetics of the gene.", 
   {}, 
   279624, 
   null, 
   1187679540.0
  ], 
  [
   279629, 
   null, 
   "supersport", 
   "AND THUS YOU REMAIN WRONG ABOUT THE DEFINITION!. \n\n \n I've presented two defintions to your one -- it depends on which definition you use.\n \n \n There are many different specific mutations that can result in syndactyly (webbed fingers or toes), because there are many ways to shut down apoptosis during finger formation in the embryo \n\n \n and um...what would be the selectability factor here? \n \n \n \n You could maybe use one of those to help dig up what's left of your credibility. Ooops, too late.\n\n \n I wouldn't be questioning my credibility...you're the one who believes in a theory that has no justification.\n \n \n Here's an instance that happened to a chicken: http://farm1.static.flickr.com/131/375762088_2baf479d59_o.jpg That's not much use to a standard chicken, .\n\n \n lol! are you kidding me?\n \n \n http://www.childrenshospital.org/az/Site1036/Images/syndactyly.jpg\n http://www.emedicine.com/plastic/images/13501350pla0183-05.jpg\n Not much use to us here and now, but it has happened more than once in evolutionary history:.\n\n \n Oh, brother.\n \n [QUOTE=N.Wells;279626]\n http://animaldiversity.ummz.umich.edu/site/resources/anatomical_images/metatherian_traits/syndactyly.jpg/medium.jpg\n It may not have affected tose animals one way or the other, but it could be all kinds of useful if you were an ancestral whale just starting to take up life in the water, at perhaps an otter-like level of activity in the water:[QUOTE=N.Wells;279626]\n \n sigh...C'mmon, wells. Those would offer absolutely no benefit.\n \n \n \n\n http://www.edwardtbabinski.us/whales/hind_limb_buds/dolphin_embryo_02_high_res.jpg\n Note how the dolphin fetus has a mitten-like hand, as do we while we start to develop. Shut down finger separation, and you have an instant paddle. Hans Thewissen had a really nice paper about a year ago, showing which genes work when during dolphin limb development, and exactly what differences happen to dolphins relative to what happens in standard mammals.\n\n \n So now you're counting an \"if\" as evidence? \n \n All you've done is show me a series of deformations. Do you seriously want me to believe that humans are deformed bacteria that once floated on the surface of the primordial swamp? Get real. ToE has got to be the stupidest thing I've heard of in my whole life. It's not only stupid, but it's borderlining on the insane. Face it: you've got evidence for exactly jack squat and you have not yet showed me a beneficial modification to phenotype by way of mutation.", 
   {}, 
   279626, 
   null, 
   1187679540.0
  ], 
  [
   279630, 
   null, 
   "chemist99a", 
   "http://www.4forums.com/political/member.php?u=6945\n \n Liked your examples. If SS just realized how many of these there are. One of my favorites is the mutation of a bacterium which used to cause a minor disease on bannas to a more sticky colony type which aided greatly its vectoring by flies in the groves. The result was a vast increase in the bacterial population, a considerable loss of yield of Bannas and United fruit becoming the largest single consumer of copper in the Westen Hemisphere (used in the pesticide for the disease). The bacterium persists to this day in much larger numbers and over a much wider range than it would otherwise have managed. \n \n Its likely that HIV underwent a similar kind of thing (but hey viruses are not alive according to WW/SS so I'll ignore that one).", 
   {}, 
   279628, 
   null, 
   1187680020.0
  ], 
  [
   279631, 
   null, 
   "supersport", 
   "Chemist: HGT - evolutionary change, evolutionary process.\n \n sure, nonrandom process, that is.\n \n \n PP - not a permanent change  \n \n says who? Evidence? (yes I would like the experiments showing traits acquired during the lifetime of animals cannot be inherited.)", 
   {}, 
   279629, 
   null, 
   1187680020.0
  ], 
  [
   279632, 
   null, 
   "chemist99a", 
   "All you've done is show me a series of deformations. \n\n \n That SS will as has been pointed out depend on CONTEXT you do know the word don't you?\n \n Now lets see your defense of the sickle cell trait question. You have yet to defend yourself in a credible way. And don't try to use WWs stuff either, hes less credible than you.\n \n There are some facts you need to affirm or deny.\n \n Sickle cell trait is due to a mutation in the gene for hemoblobin.\n Sickle cell trait results in an alteration of the structure of hemoblobin\n Sickle cell trait offers a modicom of resistance to malaria.\n \n Thus sickle cell trait is a mutation which is beneficial to the phenotype where malaria is commonly found.", 
   {}, 
   279630, 
   null, 
   1187680380.0
  ], 
  [
   279633, 
   null, 
   "chemist99a", 
   "http://www.4forums.com/political/member.php?u=4378\n \n You are addressing Wells there not me.", 
   {}, 
   279632, 
   null, 
   1187680440.0
  ], 
  [
   279634, 
   null, 
   "supersport", 
   "Sickle cell trait is due to a mutation in the gene for hemoblobin.\n \n evidently, but any mutation was most certainly lead up to by changes in the epigenome, \n \n \n \n Sickle cell trait results in an alteration of the structure of hemoblobin\n \n I don't know that any changes were beneficial because the mutation itself is causing harm onto the individual, despite offering a benefit of resistance.\n \n \n Sickle cell trait offers a modicom of resistance to malaria.\n \n I can buy that based on what people say....actually, though, I'd say sickle cell is probably just a negative effect of whatever the body needed to do to provide itself resistance.\n \n Thus sickle cell trait is a mutation which is beneficial to the phenotype where malaria is commonly found. \n \n I don't know how you could prove that statement. There is certainly nothing to \"see\" or to observe as being beneficial.", 
   {}, 
   279632, 
   null, 
   1187680620.0
  ], 
  [
   279635, 
   null, 
   "chemist99a", 
   "All you've done is show me a series of deformations. Do you seriously want me to believe that humans are deformed bacteria that once floated on the surface of the primordial swamp? Get real. ToE has got to be the stupidest thing I've heard of in my whole life. It's not only stupid, but it's borderlining on the insane. Face it: you've got evidence for exactly jack squat and you have not yet showed me a beneficial modification to phenotype by way of mutation.\n\n \n Well no not exactly, but we are all brothers under the skin and the family is very very old even though some of our branches have met with extinction. The tree is complex and our relatives many and extremely diverse! Deformed is a slur and an insult to your own linage - its spitting on your own nature. And I have indeed shown you one example of a phenotypically benefical modification via a mutation. You are simply blinded to the facts of the matter by your ignorance and inability to evaluate the argument dispassionately.", 
   {}, 
   279633, 
   null, 
   1187680740.0
  ], 
  [
   279636, 
   null, 
   "supersport", 
   "That SS will as has been pointed out depend on CONTEXT you do know the word don't you?.\n\n \n what context would favor a deformation? Have we seen the fossil record riddled with deformations that eventually worked themselves out by way of tiny modifications (more deformations)? I don't think so.", 
   {}, 
   279632, 
   null, 
   1187680920.0
  ], 
  [
   279637, 
   null, 
   "N.Wells", 
   "SS, I realize that this is difficult for you, but focus a moment. My definition supports me, I showed that your second definition supports me, and if you'd taken just a moment to think, you'd have realized that your first definition supports me too:\n \nThe phenotype of an individual organism is either its total physical appearance and constitution, or a specific manifestation of a trait, such as size or eye color, that varies between individuals\n\n Total physical appearance and constitution = everything physical that you can observe inside and outside\n Or manifestation of a trait = that covers essentially everything else (ideally, anything that results from genetic control) - metabolism, behavior, physiology, etc., as well as duplicating everything in the first part. 'Trait' has its own specific meaning in biology, in that it refers to any single feature or quantifiable measurement of an organism, as in \"The genetic capacity for intellectual development is one of the biological traits of our species essential for its survival\" (from a statement by the American Association of Physical Anthropologists).\n \n I thought that was too obvious to need belaboring, but apparently not.\n \n Also, the same thing that is a deformation to us is a thing of necessity and joy to a dolphin.", 
   {}, 
   279624, 
   null, 
   1187680980.0
  ], 
  [
   279638, 
   null, 
   "supersport", 
   "http://www.cite-sciences.fr/lexique/...f=147&idmot=58\n \n The genotype of an individual is the genetic information carried by the person's genes , whether or not the genes are actively expressed as proteins . In comparison, the phenotype denotes all the observable characteristics of an individual, such as physical appearance (eye colour, height, etc.) and internal physiology. It is determined in part by genes and in part by environment and way of life.\n \n http://www.britannica.com/eb/article-9059622/phenotype\n \n all the observable characteristics of an organism, such as shape, size, colour, and behaviour, that result from the interaction of its genotype (total genetic inheritance) with the environment. The common type of a group of physically similar organisms is sometimes also known as the phenotype.\n \n \n I've had enough fun for the night. Good night, all.", 
   {
    "unicode_changes_made": true
   }, 
   279636, 
   null, 
   1187681160.0
  ], 
  [
   279639, 
   null, 
   "chemist99a", 
   "evidently, but any mutation was most certainly lead up to by changes in the epigenome, \n \n\n \n But the truth of that does not matter. Its still a mutation - 1 down\n \n Sickle cell trait results in an alteration of the structure of hemoblobin\n \n \nI don't know that any changes were beneficial because the mutation itself is causing harm onto the individual, despite offering a benefit of resistance.\n\n \n The benefit of resistance is real, and a benefit is a benefit regardless of side effects! People with the trait survive longer and have more offspring than they would otherwise. 2 down one to go.\n \n \nI can buy that based on what people say....actually, though, I'd say sickle cell is probably just a negative effect of whatever the body needed to do to provide itself resistance.\n \n\n \n If you buy it you buy it. 2 down is confirmed.\n \n \n \nI don't know how you could prove that statement. There is certainly nothing to \"see\" or to observe as being beneficial.\n \n\n \n Tis not theory its observable fact. Indeed you agreed to the facts in sequence above although you were not enthusiastic about it. Good thats settled. I HAVE given you an example of a mutation which alters the phenotype and which is beneficial. FINIS", 
   {}, 
   279634, 
   null, 
   1187681340.0
  ], 
  [
   279640, 
   null, 
   "N.Wells", 
   "what context would favor a deformation? Have we seen the fossil record riddled with deformations that eventually worked themselves out by way of tiny modifications (more deformations)? I don't think so.\n\n Asked and answered. Spending more time getting food in the water would suffice.\n \n The specific change to a webbed paddle could happen instantaneously - the pictures I linked to showed that. However, the fossil record of early whales actually shows this happening quite slowly and gradually. \n \n There are also many additional changes that can happen to make the hand into an even better paddle. Those happened gradually in whales as well.", 
   {}, 
   279638, 
   null, 
   1187681520.0
  ], 
  [
   279641, 
   null, 
   "N.Wells", 
   "Chemist, that was an impressive job of nailing jello to a wall. \n \n Mind you, you'll get to start all over again when he denies it tomorrow.", 
   {}, 
   279640, 
   null, 
   1187681700.0
  ], 
  [
   279642, 
   null, 
   "chemist99a", 
   "http://www.nytimes.com/2007/08/21/science/21prot.html?ref=science\n \n Thats just to wrap up the general subject of genes through history and their modifications.\n \n \nAugust 21, 2007\n Ancient Protein Tells a Story of Changing Functions\n By KENNETH CHANG\n \n Offering insight into how evolution progresses inside a gene, scientists have pinpointed mutations in an ancient protein that transformed its shape and function more than 400 million years ago.\n \n Scientists at the University of Oregon and the University of North Carolina used modern technologies to conduct an archaeology of genes and help answer a longstanding question about how proteins change over time and develop new roles.\n \n \"We have now seen the mechanisms by which a new function evolves at the atomic level, how evolution sculpted the protein structure to produce a new function,\" said Joseph W. Thornton, a biology professor at Oregon who led the research.\n \n The findings were published last week on the Web site of the journal Science.\n \n A few mutations in a gene, which is a section of DNA that provides the blueprint for a specific protein, can result in a protein that no longer folds properly. That makes the protein useless, because it is the shape of a protein that largely determines which molecules it can bind to, and hence, its function.\n \n The probability that subsequent mutations could reshape the unfolded protein into a form with a new function is essentially zero, and that is an evolutionary cul de sac.\n \n Supporters of intelligent design, who question evolution, have argued that mutations, occurring one by one, could not refold a protein into a new function, because the mutations would first unravel the protein into a useless, unfolded configuration.\n \n The new study refutes that assertion, at least in this instance. Dr. Thornton's research focuses on proteins known as hormone receptors that act as locks in a key-and-lock mechanism. When a hormone fits into a receptor, the receptor sends a signal to another part of the cell.\n \n In work published last year, Dr. Thornton reported how his group reconstructed an ancestral protein of two hormone receptors found in humans. The two, once identical, diverged along different evolutionary paths. One is now part of the stress response system; the other is involved in different biological processes, including kidney function in many animals.\n \n In the new study, the researchers determined the exact positions of more than 2,000 atoms in the ancestral hormone receptor. The receptor existed in animals that lived more than 440 million years ago, before the last common ancestor of people and sharks. Then the researchers examined what occurred during the next 20 million years - before another split of the evolutionary tree that led to bony fish. \"That's the ancestor of you and a salmon,\" Dr. Thornton said.\n \n In that time, one hormone receptor changed so that it bound most strongly to cortisol, a stress hormone. Bony fish and people have this version, called a glucocorticoid receptor. Sharks do not.\n \n Of the glucocorticoid receptors that have been looked at in different species, five specific mutations are always present and distinguish them from the ancestral receptor. When the scientists introduced the five changes into the ancestral protein, they expected that it would be transformed into a glucocorticoid receptor.\n \n Instead, the protein broke, unable to bind to any hormone.\n \n On further investigation, the scientists found that two other mutations, which had negligible effects by themselves, strengthened some of the protein's folds so it could withstand the other five mutations. The researchers were also able to show several sequences in which the seven mutations could have occurred without the protein's functionality ever deteriorating.\n \n Biologists often point out that evolution does not proceed through random chance. Rather, the process of natural selection - survival of the fittest - ruthlessly weeds out mutations detrimental to the survival of a species.\n \n But the findings of Dr. Thornton and his colleagues show that some aspects of evolution do occur solely by chance. The two mutations that reinforced the protein did not directly help the organism. So natural selection did not particularly favor them. It was only by chance that they occurred and persisted to set the groundwork for the other mutations.\n \n Other seemingly innocuous mutations might have led evolution down another path. \"These very exquisitely adapted bodies we have represent a role of the dice,\" Dr. Thornton said. \"And they could have turned out very differently.\"\n", 
   {
    "unicode_changes_made": true
   }, 
   279639, 
   null, 
   1187682420.0
  ], 
  [
   279643, 
   null, 
   "supersport", 
   "too bad, chemist:\n \n http://www.ncbi.nlm.nih.gov/books/bv.fcgi?call=bv.View..ShowSection&rid=gnd.section.98\n \n Sickle cell anemia is the most common inherited blood disorder in the United States, affecting about 72,000 Americans or 1 in 500 African Americans. SCA is characterized by episodes of pain, chronic hemolytic anemia and severe infections, usually beginning in early childhood.\n \n SCA is an autosomal recessive disease caused by a point mutation in the hemoglobin beta gene (HBB) found on chromosome 11p15.5. Carrier frequency of HBB varies significantly around the world, with high rates associated with zones of high malaria incidence, since carriers are somewhat protected against malaria. About 8% of the African American population are carriers\n \n A mutation in HBB results in the production of a structurally abnormal hemoglobin (Hb), called HbS. Hb is an oxygen carrying protein that gives red blood cells (RBC) their characteristic color\n \n try again....", 
   {}, 
   279642, 
   null, 
   1187682540.0
  ], 
  [
   279644, 
   null, 
   "supersport", 
   "I figured you were not telling the whole truth:\n \n http://www.pueblo.gsa.gov/cic_text/health/sicklecell/496_sick.html\n \n The genetic defect that causes sickle cell anemia affects hemoglobin, a component of red blood cells. Hemoglobin's job is to carry oxygen to all the cells and tissues of the body. Red blood cells that contain normal hemoglobin (such as the one pictured top right) are soft and round. Their soft texture enables them to squeeze through the body's small blood vessels.\n \n \n People with sickle cell anemia, however, have a type of abnormal hemoglobin called hemoglobin S. (Normal hemoglobin is called hemoglobin A.) A genetic error makes the hemoglobin molecules stick together in long, rigid rods after they release oxygen. These rods cause the red blood cells to become hard and sickle-shaped, unable to squeeze through tiny blood vessels. The misshapen cells (like the one pictured bottom right) can get stuck in the small blood vessels, causing a blockage that deprives the body's cells and tissues of blood and oxygen. ", 
   {}, 
   279643, 
   null, 
   1187682720.0
  ], 
  [
   279645, 
   null, 
   "chemist99a", 
   "They're most certainly adaptive responses from developing embryos -- just like malaria resistance is.\n\n \n Actually no the mutation arose rather recently so I understand, and its not something that develops in embryos. The adults pass the gene on (survivors you realize). Its not an immune response (immune responses don't do much good against malaria which effectively \"hides\" from the immune system and frequently changes its display of antigens. Like HIV this is one of the reasons that making a Malaria vaccine is proving a heck of a problem.", 
   {}, 
   279639, 
   null, 
   1187682720.0
  ], 
  [
   279647, 
   null, 
   "N.Wells", 
   "That's all correct, and it's very tragic for the homozygous people with sickle cell ANEMIA, and yet when heterozygous the sickle cell TRAIT is nonetheless a net beneficial mutation in a population that is being assaulted by malaria in a pre-medical age, because it allows some of your children to survive as opposed to very few of them.\n \n Nothing about evolution requires that the results be \"nice\", merely that they be no worse than the available alternatives in times of strong selection, and only that they be survivable (by the population over all, rather than by all the individuals) in times of weak selection. And if they fail to be sufficient to meet the challenges of your particular time and place, then you go extinct.", 
   {}, 
   279643, 
   null, 
   1187683080.0
  ], 
  [
   279648, 
   null, 
   "chemist99a", 
   "People with sickle cell anemia, however, have a type of abnormal hemoglobin called hemoglobin S. (Normal hemoglobin is called hemoglobin A.) A genetic error makes the hemoglobin molecules stick together in long, rigid rods after they release oxygen. These rods cause the red blood cells to become hard and sickle-shaped, unable to squeeze through tiny blood vessels. The misshapen cells (like the one pictured bottom right) can get stuck in the small blood vessels, causing a blockage that deprives the body's cells and tissues of blood and oxygen.\n\n \n \n Yep thats sickle cell disease which is found in homozygotes - about 1/2 of the offspring of heterozygotes will have that disease and they will likely die of it in the wild. Even so the survival advantage of the heterozygotes due to malarial resistance is sufficient to overwhelm this downside in the malaria belt. So the phenotype of the heterozygous genotype benefits quite a bit! The non-sickle cell homozygotes (ie normals) take a bigger hit from malaria itself than the burden presented by the loss of the diseased sickle cell homozygotes.\n \n This is one of the neatest classical exercises in population genetics that we have by the way. Its an absolute classic.\n \n Indeed its the only known example of balanced polymorphism according to the link below which also provides a bit ot a tutorial ono population genetics. The formulae for the equilibrium state give the relative fitness values is give in the Balanced Polymorphism section. As you SS can see the situation is a complex one but the heterozygote is still more fit in the malaria belt than either normal or homozygotes are. Follow the math and you shall see how it works out.\n \n http://www.uic.edu/classes/bms/bms655/lesson13.html", 
   {}, 
   279645, 
   null, 
   1187683140.0
  ], 
  [
   279686, 
   null, 
   "supersport", 
   "no, chemist...what I'm saying is the alteration to the hemoglobin is \"abnormal\"...ie, not beneficial. Your example of a beneficial modification to phenotype fails.", 
   {}, 
   279648, 
   null, 
   1187708340.0
  ], 
  [
   279687, 
   null, 
   "Symbiote", 
   "You see Chemist, when SS asked for a \"beneficial\" mutation, what he meant was a \"normal\" mutation, because he chooses to define beneficial as \"not abnormal\".\n \n Please bear in mind these kind of issues when replying to his posts, it is important if we are to be scientific that we give precise meaning to words, as SS does.", 
   {}, 
   279686, 
   null, 
   1187709060.0
  ], 
  [
   279689, 
   null, 
   "N.Wells", 
   "To SS,\n \n Results from new mutations are by definition different from the normal, so your objection makes no sense.\n \n No one is disputing that there are serious negative side effects with the sickle cell trait. However, in terms of the reproductive success of families with sickle cell vs those without, the ones with the trait do better overall than the ones without, in areas severely beset with malaria and in times before medicine, despite the negative effects. The positives outweigh the negatives, so the sickle cell trait is therefore beneficial in terms of natural selection.", 
   {}, 
   279686, 
   null, 
   1187709360.0
  ], 
  [
   279690, 
   null, 
   "supersport", 
   "To SS,\n \n Results from new mutations are by definition different from the normal, so your objection makes no sense.\n \n No one is disputing that there are serious negative side effects with the sickle cell trait. However, in terms of the reproductive success of families with sickle cell vs those without, the ones with the trait do better overall than the ones without, in areas severely beset with malaria and in times before medicine. It is therefore beneficial in terms of natural selection.\n\n \n I'm referring to chemist's assertion that mutations cause a beneficial modification to the morphology of hemoglobin. My two links say the hemoglobin becomes \"abnormal,\" thus his example fails. \n \n And you are assuming that this mutation is random. Why? Cancer mutations are not random...they are lead up to by epigenetic changes. Why not this?\n \n http://www.eurekalert.org/pub_releases/2005-12/jhmi-nvo122105.php", 
   {}, 
   279689, 
   null, 
   1187709540.0
  ], 
  [
   279693, 
   null, 
   "N.Wells", 
   "SS quoted, \n \nhttp://www.cite-sciences.fr/lexique/...f=147&idmot=58\n \n The genotype of an individual is the genetic information carried by the person's genes , whether or not the genes are actively expressed as proteins. In comparison, the phenotype denotes all the observable characteristics of an individual, such as physical appearance (eye colour, height, etc.) and internal physiology. It is determined in part by genes and in part by environment and way of life.\n \n http://www.britannica.com/eb/article-9059622/phenotype\n \n all the observable characteristics of an organism, such as shape, size, colour, and behaviour, that result from the interaction of its genotype (total genetic inheritance) with the environment. The common type of a group of physically similar organisms is sometimes also known as the phenotype.\n\n \n Thanks for proving my point. You'll note that the first definition mentions internal physiology as an example of a phenotypic trait, and the second mentions behavior. Both also say ALL THE OBSERVABLE CHARACTERISTICS, and what follows are given as examples rather than as limitations. So, by your own citations, you have proven yourself wrong. Yet again.", 
   {
    "unicode_changes_made": true
   }, 
   279689, 
   null, 
   1187710200.0
  ], 
  [
   279694, 
   null, 
   "chemist99a", 
   "no, chemist...what I'm saying is the alteration to the hemoglobin is \"abnormal\"...ie, not beneficial. Your example of a beneficial modification to phenotype fails.\n\n \n Well lets see now. Do you think that beneficial and abnormal are mutuall exclusive. For example if you have abnormally high levels of certain hormones your muscular development may be quite impressive. Now that may not be beneficial if you are a pencil pusher {indeed you may have to eat more to feed your bulk} but if you are instead a professional wrestler such abnormal development may be quite beneficial. Sorry SS but you are grasping at straws the two terms are NOT mutually exclusive even if you try to pretend otherwise. Your argument fails.", 
   {}, 
   279686, 
   null, 
   1187710440.0
  ], 
  [
   279696, 
   null, 
   "N.Wells", 
   " I'm referring to chemist's assertion that mutations cause a beneficial modification to the morphology of hemoglobin. My two links say the hemoglobin becomes \"abnormal,\" thus his example fails. \n\n \"Abnormal\" does not inherently mean \"bad\" - IQ's of 140 and 60 are exactly equally abnormal, and an IQ of 160 is vastly more abnormal. However, in this case, the effects of the sickle cell trait are mixed, but the benefit to survival in malarial zones without medicine outweighs the negative aspects of the changes to the hemoglobin. Chemist has been clear and consistent about this all along.", 
   {}, 
   279693, 
   null, 
   1187710680.0
  ], 
  [
   279697, 
   null, 
   "chemist99a", 
   "I'm referring to chemist's assertion that mutations cause a beneficial modification to the morphology of hemoglobin. My two links say the hemoglobin becomes \"abnormal,\" thus his example fails.\n \n And you are assuming that this mutation is random. Why? Cancer mutations are not random...they are lead up to by epigenetic changes. Why not this?\n\n \n Sorry SS but I did not claim that mutations cause a beneficial mod etc. I claimed that a specific mutation which alters the structure of a phenotype does in fact confer a specific benefit to the phenotype. You claimed that no such examples had ever been provided to you. I have repeatedly provided you with this example. You are trying to move to a different issue after failing to admit that you are wrong regarding the SPECIFIC issue at hand. Your manuver is tranparent and in carrying it out you have attributed to me a claim I did not make! And as indicated previously abnormal and beneficial are NOT mutually exclusive terms. You really need to learn logic.\n \n Oh yes the terms \"epigenetic\" and \"random\" are also NOT mutually exclusive so try another tact. You will also find that many oncogenes are not the result of epigenesis. Some but certainly far from ALL.\n \n {edited in} Oh yes I forgot to add that I also made NO claims at all as to whether the mutation to sickle cell trait is random or non-random. You implied otherwise, but that implication is wrong. I simply quoted you a well known and well documented example in which a specific mutation alters the structure (and thus phenotype) of humans and as a result an increased resistance to malaria is obtained which is a relevant benefit in areas where malaria is present. I also provided you with a simple model of balanced polymorphism which describes the equilibirum composiiton of the genome populations under different assumptions of relative fitness for the various genotypes which arise. Whether the mutation is random or not does not enter the picture in case you did not grasp the mathematics involved.", 
   {}, 
   279694, 
   null, 
   1187710980.0
  ], 
  [
   279701, 
   null, 
   "chemist99a", 
   "\"Abnormal\" does not inherently mean \"bad\" - IQ's of 140 and 60 are exactly equally abnormal, and an IQ of 160 is vastly more abnormal. However, in this case, the effects of the sickle cell trait are mixed, but the benefit to survival in malarial zones without medicine outweighs the negative aspects of the changes to the hemoglobin. Chemist has been clear and consistent about this all along.\n\n \n I would however caution that the net benefit is only obtained so long as the number of heterozygotes {for the trait} stays below a certain fraction of the total human population in the area. The population genetics model I posted allows the boundaries of the beneficial effect to be estimated if one can establish relative fitness of the normal, heterozygote, and homozygote genotypes in the presense of a fixed prevalance of malaria infectin.\n \n I suspect the nuances here will escape SS.", 
   {}, 
   279696, 
   null, 
   1187711880.0
  ], 
  [
   279778, 
   null, 
   "supersport", 
   "Sorry SS but I did not claim that mutations cause a beneficial mod etc. I claimed that a specific mutation which alters the structure of a phenotype does in fact confer a specific benefit to the phenotype. \n .\n\n \n my challenge was for evos to show me a mutation that beneficially modifies phenotype. You have not done that. All you're doing is playing with words and definitions. Resistance to malaria is not a phenotypic trait.", 
   {}, 
   279697, 
   null, 
   1187747520.0
  ], 
  [
   279789, 
   null, 
   "chemist99a", 
   "my challenge was for evos to show me a mutation that beneficially modifies phenotype. You have not done that. All you're doing is playing with words and definitions. Resistance to malaria is not a phenotypic trait.\n\n \n Your challenge has been met point by point.\n \n Sickle cell trait is an observable phenotypic trait. All you have to do is look at the red blood cells and notice a few sickled cells. If that does not satisfy you then all you have to do is look at the blood proteins by electrophoresis and find the structurally modified hemoglobin. The phenotype of those carrying the sickle cell trait is different from those who do not. Trait does not imply any specific outcomes due to the trait note well that fact.\n \n As a consequence of this alteration of the phenotype the individual is more resistant to malaria than those not having it. In an environment where malaria is at high prevalance this results in a benefit to the individual.\n \n You are trying to escape your error by confounding the trait itself (a modified hemoglobin molecule) which is observable with the benfit which is conferred! A simple error which I can understand you would make. However it is a mistake none the less.", 
   {}, 
   279778, 
   null, 
   1187752980.0
  ], 
  [
   279790, 
   null, 
   "N.Wells", 
   "Resistance to malaria is not a phenotypic trait.\n\n \n Oh yes it is. The word \"phenotype\" was created to fulfill a specific role in biological discussions, as a counterpart to \"genotype\". You are clueless about this, so you keep making stupid statements such as the above. \"Genotype\" is easy to understand - it's all the information encoded in the organism's DNA. \"Phenotype\" is also easily understood, by everyone but you. The phenotype is the sum total of all the results of that information AS EXPRESSED IN THE ORGANISM. If it is a trait (and resistance certainly is a trait that is expressed in the organism), then it is part of the phenotype. \n \n The reason for distinguishing the two concepts, and thus the justification for the two words, is that there are several disjunctions between the information that the genes contain and the resulting expression as actual traits in the organism. Many traits are the result of multiple genes. Much of an organism's DNA is not genes. Quite a few of the genes that are present are never turned on. Some genes have multiple effects depending on what else is going on. Some of what you see in an organism is not of genetic origin. So, you encounter an organism, you observe a trait (which is by definition part of the organism's phenotype), and you investigate how it relates to the genotype, if at all. (Separately, you investigate how the trait affects fitness.)\n \n As I said earlier, what you actually need to do is to stop using the word phenotype (and stop making insane statements like \"Mutations seem to be reserved for internal functions\") and simply argue that you are unsatisfied that the extent of changes demonstrated to result from mutations is capable of causing the sorts of large-scale changes needed to create a new phylum, or for that matter even a new type of limb or organ (or whatever you want to claim). You'll still be wrong, of course, but you'll appear slightly less clueless and we can move on to a more interesting argument.", 
   {}, 
   279778, 
   null, 
   1187753220.0
  ], 
  [
   279793, 
   null, 
   "supersport", 
   "Defintion of phenotype:\n \n http://www.britannica.com/eb/article-9059622/phenotype\n \n all the observable characteristics of an organism, such as shape, size, colour, and behaviour, that result from the interaction of its genotype (total genetic inheritance) with the environment. The common type of a group of physically similar organisms is sometimes also known as the phenotype.\n \n Can you see red blood cells? Neither can I. Red blood cells do not evolve gradually (as ToE suggests), they are not the objects of selection, they do not qualify as per the definition of \"phenotype\" above. Besides that, the mutation degrades the quality of the cell....this is not a beneficial addition to an existing structure -- it's the destruction of a molecule (hemoglobin). \n \n It is so obvious that you guys are really, really desperate and grasping at straws here. \n \n I want to see a mutation that can create a beneficial modification to the observable interal or external characteristics of an organism:...ie...arms, legs, brain, tongue, skin, eyes, bones, muscles -- you know, the things that supposedly scientists can see evolving over time in the field and in the fossil record. Degenerated/abnormal molecules don't qualify.", 
   {}, 
   279790, 
   null, 
   1187754060.0
  ], 
  [
   279794, 
   null, 
   "N.Wells", 
   "More nonsense. Red blood cells can easily be seen with microscopes, and of course blood cell characteristics are subject to selection.\n And you are once again misusing the term \"abnormal\" and abusing the concept of \"degenerated\".\n \n Re muscle: http://fig.cox.miami.edu/~cmallery/1...lgian.blue.jpg\n \n And for a similar mutation in humans, see\n http://cnews.canoe.ca/CNEWS/Science/...24/512617.html\n http://fig.cox.miami.edu/~cmallery/1.../myostatin.htm\n \n Also, I showed you how hands (and feet) can turn into paddles. Thewissen's paper discusses additional details of how the genotype probably controlled the phenotype in one such transition.\n \n Edited to add: sorry, these links didn't copy. Fixed versions are provided about 8 posts down, at 12:12 AM", 
   {}, 
   279793, 
   null, 
   1187754420.0
  ], 
  [
   279801, 
   null, 
   "chemist99a", 
   "\n all the observable characteristics of an organism, such as shape, size, colour, and behaviour, that result from the interaction of its genotype (total genetic inheritance) with the environment. The common type of a group of physically similar organisms is sometimes also known as the phenotype.\n\n \n Yeah like we said. all the observable characteristics of an organism,\n \n \nCan you see red blood cells? \n \n \n Does the fact that I have seen red blood cells count? I rather think so. If so then yes I can see red blood cells.\n \n \nNeither can I. \n\n \n Thats terribly sad, for $25 bucks or so you can buy a kids microscope, pricking your finger will provide you a specimen. A few minutes later you can see red blood cells.\n \n No limits are placed on how the observations are made you realize. You could use an X-ray, a microscope, a scale, a ruler, a microscope, a telescope, an electrophoretic gel, a STM, a blood type test, a colorimeter, an infrared scanner, an ultrasound machine, or just the old mark I eyeball. Observables go far far beyond unaided sensory inputs.\n \n \n Red blood cells do not evolve gradually (as ToE suggests), they are not the objects of selection, they do not qualify as per the definition of \"phenotype\" above.\n \n \n Actually red blood cells have evolved and have been (and are) subject to evolutionary processes. I'll let you look up the comparative structure of RBCs in different species. Carefully consider the way that they have been gradually pared down to represent the minimum of hardware which will get the job done, even going so far as to lose the nucleus!\n \n \n Besides that, the mutation degrades the quality of the cell....this is not a beneficial addition to an existing structure -- it's the destruction of a molecule (hemoglobin).\n \n \n Well the malarial parasite might consider it to be a bad thing, but the person having the trait might believe otherwise if he/she has a better chance of survival as a result. Benefit is always contingent on context you realize. And the hemoglobin is NOT destroyed its only altered with regard to a single amino acid in the sequence. Its still there and its still considered hemoglobin.\n \n \nIt is so obvious that you guys are really, really desperate and grasping at straws here. \n \n \n Well one of us is certainly getting desparate. I'll let the readers decide who it is for themselves.\n \n \nI want to see a mutation that can create a beneficial modification to the observable interal or external characteristics of an organism:...ie...arms, legs, brain, tongue, skin, eyes, bones, muscles -- you know, the things that supposedly scientists can see evolving over time in the field and in the fossil record. Degenerated/abnormal molecules don't qualify.[\n\n \n Ah degenerated is it, abnormal is it? Nope its perfectly natural, and its more functional in a malaria belt than is the dangerously vulnerable \"normal\" hemoglobin! And of course as indicated above the specific hemoblogins present in RBCs is an observable characteristic of humans. Just as their blood type is an observable characteristic. Tough SS, admit you are wronog and move on lest you begin to look foolish.", 
   {}, 
   279793, 
   null, 
   1187758140.0
  ], 
  [
   279804, 
   null, 
   "supersport", 
   "Ok, chemist...obviously you are getting nowhere on the previous challenge....but I do have a different question for you.\n \n If the mutation that provides resistance to malaria is indeed random, why is it that we do not see people coming down with sickle cell who are not located in malaria-infested areas or related to someone with this defect? Why, living in Texas, do I not see or hear of others who just randomly mutated the sickle cell disease? Why is it that the sickle cell disease only shows up in Africa and other malaria-plagued areas? I think WW successfully showed us that getting sickle cell does not necessarily lead to a longer lifespan or make anyone more likely to breed than someone with malaria...so the idea that selection would prefer malaria over sickle cell doesn't jive......yet lots and lots of people in infected areas seem to confer resistance. Why are you, me, and other Americans (assuming you're American) not randomly conferring resistance as well?\n \n Also, has science ever done any studies to see if anyone offspring has acquired resistance to malaria without a parent being resistant?", 
   {}, 
   279801, 
   null, 
   1187759040.0
  ], 
  [
   279806, 
   null, 
   "N.Wells", 
   " lest you begin to look foolish.\n\n \n Way too late on that one.\n \n But, speaking of which, SS, did you know that the ability to produce Vitamin C is a trait found in most mammals, except for apes (including humans), the guinea pig, fruit bats, and a few others. It turns out that this capability is under genetic control, and the details of how it comes to be absent from the phenotypes of humans and guinea pigs (while being nearly completely present in the respective genotypes) provide excellent evidence for several key aspects of evolutionary theory. You should learn the details sometime.", 
   {}, 
   279801, 
   null, 
   1187760060.0
  ], 
  [
   279808, 
   null, 
   "chemist99a", 
   "Ok, chemist...obviously we are getting nowhere on the previous challenge....but I do have a different question for you.\n\n \n Actually we have answered the challenge and you have been presented with what you asked for. Perhaps rather more than you asked for. I will consider your change of subject to represent concession on the issue on your part.\n \n \nIf the mutation that provides resistance to malaria is indeed random, why is it that we do not see people coming down with sickle cell who are not located in malaria-infested areas or related to someone with this defect? \n \n Why, living in Texas, do I not see or hear of others who just randomly mutated the sickle cell disease? \n \n \n\n \n To put it in quantitative terms lets assume that the rate of mutation is on the order of 1 in say 50 million - just to be generous you understand. How do you propose to detect that rate against the existing prevalance of the gene? Not a chance in hades without mounting a truly massive effort which would accomplish nothing at all practical. And in a small population like texas you are looking at less than a single instance per generation! Pretty slim chance would you not say?\n \n \nWhy is it that the sickle cell disease only shows up in Africa and other malaria-plagued areas?\n \n \n It does not. The disease is found world wide not just in Africa. On the other hand Malaria was not restricted to Africa and indeed is still not restricted to Africa. I gave you links which contain both distribution maps for Malaria and the trait/disease. \n \n \nI think WW successfully showed us that getting sickle cell does not necessarily lead to a longer lifespan or make anyone more likely to breed than someone with malaria...so the idea that selection would prefer malaria over sickle cell doesn't jive......yet lots and lots of people in infected areas seem to confer resistance. Why are you, me, and other Americans (assuming you're American) not randomly conferring resistance as well?\n\n \n Of course not. If you live outside the malaria belts then you gain no advantage. In fact you are at a reproductive disadvantage. But benefit is always contingent on context. And if you wish to argue that the resistance conferred is inadequate to confer a survival and reproduction advantage you will have to do it with data not references to WW (who is not notably into quantitative analysis). You produce the data and I will certainly consider it (as well as other data at my discretion). What you have to do is find relative fitness estimates. I am sure its been done go find it.\n \n \nAlso, has science ever done any studies to see if anyone offspring has acquired resistance to malaria without a parent being resistant?\n\n \n Of course they have, there is a vast literature out there relevant to immune responses to the parasite. Antibodies DO confer some resistance and they are acquired. Unfortunately the parasite has biological tricks up its sleeves which materially reduce the effectiveness of immune responses.", 
   {}, 
   279804, 
   null, 
   1187760240.0
  ], 
  [
   279809, 
   null, 
   "chemist99a", 
   "But, speaking of which, SS, did you know that the ability to produce Vitamin C is a trait found in most mammals, except for apes (including humans), the guinea pig, fruit bats, and a few others. It turns out that this capability is under genetic control, and the details of how it comes to be absent from the phenotypes of humans and guinea pigs (while being nearly completely present in the respective genotypes) provide excellent evidence for several key aspects of evolutionary theory. You should learn the details sometime.\n\n \n That unfair isn't it. That was the original subject of this thread was it not? Is it legitimate to address the subject of the thread? Going by experience I would say not.emoticon_xdonno", 
   {}, 
   279808, 
   null, 
   1187760480.0
  ], 
  [
   279810, 
   null, 
   "T.Q", 
   "\n I want to see a mutation that can create a beneficial modification to the observable interal or external characteristics of an organism:...ie...arms, legs, brain, tongue, skin, eyes, bones, muscles -- you know, the things that supposedly scientists can see evolving over time in the field and in the fossil record. Degenerated/abnormal molecules don't qualify.\n\n \n http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20070530/strong_toddler_070530/20070530\n \n Chemist can correct me if this is not a mutation per se, but I think it meets the qualifications of SS's demands (which the sickle cell trait already does).", 
   {}, 
   279793, 
   null, 
   1187761260.0
  ], 
  [
   279813, 
   null, 
   "N.Wells", 
   "Way, way, way too late.\n \n \n If the mutation that provides resistance to malaria is indeed random, why is it that we do not see people coming down with sickle cell who are not located in malaria-infested areas or related to someone with this defect? Why, living in Texas, do I not see or hear of others who just randomly mutated the sickle cell disease? Why is it that the sickle cell disease only shows up in Africa and other malaria-plagued areas? I think WW successfully showed us that getting sickle cell does not necessarily lead to a longer lifespan or make anyone more likely to breed than someone with malaria...so the idea that selection would prefer malaria over sickle cell doesn't jive......yet lots and lots of people in infected areas seem to confer resistance. Why are you, me, and other Americans (assuming you're American) not randomly conferring resistance as well?\n \n Also, has science ever done any studies to see if anyone offspring has acquired resistance to malaria without a parent being resistant?\n\n \n That is a nearly meaningless garble. You are the only person who has talked about random in this context, and you are wrong. Inheritance is extremely predictable, statistically, and there have been lots of cases of sickle cell in the US, from children being borne to carrier parents. People in malarial areas confer resistance to their offspring because they have the mutation, which they inherited from their parents. Our lineages haven't had the mutation, so we have no resistance to confer.\n \n Are you perhaps trying to ask how come it only evolved once, or why doesn't it keep appearing de novo throughout the world?\n \n Specific mutations are rare, but this one is merely a single base substitution, so it probably does happen de novo once in a while. (From http://www.ornl.gov/sci/techresources/Human_Genome/posters/chromosome/hbb.shtml , it is a substitution of a thymine for an adenine in the &#946;-globin gene, which results in transcription of valine rather than glutamic acid in the sixth amino acid position in the hemoglobin.)\n \n In fact, we think the sickle cell cases we see around the world today stem from four separate de novo occurrences of the mutation. From Wikipedia, \n \nIt is now known, from evaluation of chromosome structures, that there have been at least four independent mutational events, three in Africa and a fourth in either Saudi Arabia or central India. These independent events occurred between 3,000 and 6,000 generations ago, approximately 70,000-150,000 years.\n\n It may well have arisen elsewhere too. However, in areas without malaria the new owners would have experienced only the disadvantages and none of the benefits, so it would have relatively quickly been selected back out of the population. Remember, advantages and disadvantages depend on context, and you are trying to compare two different situations.\n \n A little more information from Wikipedia:\n \nThis is normally a benign mutation, causing no apparent effects on the secondary, tertiary, or quaternary structure of hemoglobin. What it does allow for, under conditions of low oxygen concentration, is the polymerization of the HbS itself. The deoxy form of hemoglobin exposes a hydrophobic patch on the protein between the E and F helices. The hydrophobic residues of the valine at position 6 of the beta chain in hemoglobin are able to bind to the hydrophobic patch, causing hemoglobin S molecules to aggregate and form fibrous precipitates.\n \n The allele responsible for sickle-cell anaemia is autosomal recessive and can be found on the 11th chromosome. A person who receives the defective gene from both father and mother develops the disease; a person who receives one defective and one healthy allele remains healthy, but can pass on the disease and is known as a carrier. If two parents who are carriers have a child, there is a 1-in-4 chance of their child developing the illness and a 1-in-2 chance of their child just being a carrier. Since the gene is incompletely recessive, carriers have a few sickle red blood cells at all times, not enough to cause symptoms, but enough to give resistance to malaria. Because of this, heterozygotes have a higher fitness than either of the homozygotes. This is known as heterozygote advantage.\n \n Due to the evolutionary advantage of the heterozygote, the illness is still prevalent, especially among people with recent ancestry in malaria-stricken areas, such as Africa, the Mediterranean, India and the Middle East.\n", 
   {}, 
   279804, 
   null, 
   1187762700.0
  ], 
  [
   279814, 
   null, 
   "N.Wells", 
   "http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20070530/strong_toddler_070530/20070530\n \n Chemist can correct me if this is not a mutation per se, but I think it meets the qualifications of SS's demands (which the sickle cell trait already does).\n\n \n Yes, it is a mutation. It's an independent recurrence of the same trait that I linked to earlier in cows and in a kid in Germany (and it is also known in mice) -very cool, thanks.\n \n Re muscle: \n in cows: http://fig.cox.miami.edu/~cmallery/150/neuro/belgian.blue.jpg\n in mice: http://www.ast-ss.com/articles/article.asp?AID=85\n \n And for a similar mutation in humans, see\n http://cnews.canoe.ca/CNEWS/Science/2004/06/24/baby1.jpg\n http://fig.cox.miami.edu/~cmallery/150/neuro/myostatin.htm\n \n It does not need to be exactly the same genetic change (the same mutation), however. It results from a failure to block the normal turning off of a gene. That sort of a change could probably be accomplished several ways, which is why all the human cases can be considered a single trait (phenotype) but need not all be the same mutation (genotype).\n \n edited: sorry, the links didn't copy correctly - they should be fixed now.\n Edited again: too bad for the kids that they're both guys, otherwise they could marry and their kids could own the Olympics.", 
   {}, 
   279810, 
   null, 
   1187763120.0
  ], 
  [
   279815, 
   null, 
   "chemist99a", 
   "http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20070530/strong_toddler_070530/20070530\n \n Chemist can correct me if this is not a mutation per se, but I think it meets the qualifications of SS's demands (which the sickle cell trait already does).\n\n \n Well I must admit I had not come across that one. Its of interest to me because I have a fairly rare form of muscular dystrophy (among other things) that is autosomal recessive. The strength factors remind me that Neanderthal had a more robust musculature (and skeleton) then H. sapiens. Perhaps they had reduced levels of myostatin also? Who can say. Anyway one can remember the kids name and watch out for him, don't pick fights with somebody like that. Bet he ends up as a desk jockey in the end though.", 
   {}, 
   279810, 
   null, 
   1187763180.0
  ], 
  [
   279818, 
   null, 
   "chemist99a", 
   "http://www.4forums.com/political/member.php?u=6945\n \n It will all fall on deaf ears I am afraid. But I did learn something from your post. I did not know that L. Pauling discoverd the mutated hemoglobin - Its in Science from 1949. I will try to pull it up.", 
   {}, 
   279814, 
   null, 
   1187763660.0
  ], 
  [
   279821, 
   null, 
   "chemist99a", 
   "To return to the subject of the thread (if anyone still remembers it)\n \n \nQuestion: What's the one piece of evidence that nearly all Darwinists resort to when backed up against a wall about the validity of ToE?\n \n Answer: the vitamin C pseudogene \n\n \n The actual answer is that evolutionists do not turn to any single example to support the validity of NDS. They have hundreds or thousands of them at their disposal. The vitamin C pseudogene is not even one of the major ones, and of course it played no role in the argument at all till very recently.\n \n There that ends THAT issue.", 
   {
    "unicode_changes_made": true
   }, 
   279818, 
   null, 
   1187764680.0
  ], 
  [
   279831, 
   null, 
   "supersport", 
   "Way, way, way too late.\n \n \n \n That is a nearly meaningless garble. You are the only person who has talked about random in this context, and you are wrong. Inheritance is extremely predictable, statistically, and there have been lots of cases of sickle cell in the US, from children being borne to carrier parents. People in malarial areas confer resistance to their offspring because they have the mutation, which they inherited from their parents. Our lineages haven't had the mutation, so we have no resistance to confer.\n \n Are you perhaps trying to ask how come it only evolved once, or why doesn't it keep appearing de novo throughout the world?\n \n Specific mutations are rare, but this one is merely a single base substitution, so it probably does happen de novo once in a while. (From http://www.ornl.gov/sci/techresources/Human_Genome/posters/chromosome/hbb.shtml , it is a substitution of a thymine for an adenine in the &#946;-globin gene, which results in transcription of valine rather than glutamic acid in the sixth amino acid position in the hemoglobin.)\n \n In fact, we think the sickle cell cases we see around the world today stem from four separate de novo occurrences of the mutation. From Wikipedia, \n \n It may well have arisen elsewhere too. However, in areas without malaria the new owners would have experienced only the disadvantages and none of the benefits, so it would have relatively quickly been selected back out of the population. Remember, advantages and disadvantages depend on context, and you are trying to compare two different situations.\n \n A little more information from Wikipedia:\n\n \n Wells, you have no idea how many times this gene has mutated. Does science do DNA tests on and/or check the parents of every person who has resistance? Of course not. Neither do science know that the mutations were de novo....they are merely guessing based on their worldview -- and for you to say otherwise is dishonest. I asked you earlier, maybe you answered (but I didn't see it).......We now know that cancer mutations are preceded by epigenetic changes....why is it so hard to believe that mutations leading to malaria resistance are the same? You don't seem to be able to point me to any studies that disprove nonrandom mutations.", 
   {}, 
   279813, 
   null, 
   1187768760.0
  ], 
  [
   279832, 
   null, 
   "supersport", 
   "http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20070530/strong_toddler_070530/20070530\n \n Chemist can correct me if this is not a mutation per se, but I think it meets the qualifications of SS's demands (which the sickle cell trait already does).\n\n \n although I will concede this, there is no reason to believe that this mutation would ever be selected for in nature. These animals are hardly more fit, and there are many known drawbacks.\n \n http://pharyngula.org/index/science/throwing_a_damp_blanket_over_big_muscles\n \n Unlike in mice, a myostatin null mutation in cattle causes a reduction in sizes of internal organs \n \n For agricultural applications, there are some disadvantages to double-muscled cattle, namely the reduction in female fertility, lower viability of offspring, and delay in sexual maturation.\n \n These are only the known deleterious effects. There may be many more. But not wanting to go through another argument I will admit that this mutation produces a phenotype that could be (under the best of circumstances) beneficial. Try this mutation out on a bird, rabbit, wild dog, or any other animal who had to fly, run, or get away, and you'd certainly have an extremely unfit animal on your hands. How it would be selected for in a cow, mouse or human is unclear as well.", 
   {}, 
   279810, 
   null, 
   1187769540.0
  ], 
  [
   279833, 
   null, 
   "chemist99a", 
   ".We now know that cancer mutations are preceded by epigenetic changes....why is it so hard to believe that mutations leading to malaria resistance are the same? You don't seem to be able to point me to any studies that disprove nonrandom mutations.\n\n \n Matters not whether or not epigenetic changes occurred prior to the mutation is irrelevant to the issue of whether or not it causes a phenotypic change and whether or not that change is beneficial. It does cause a phenotypic change and the change is in the proper context beneficial. End of issue. Why bother with irrelevancies?", 
   {}, 
   279832, 
   null, 
   1187771520.0
  ], 
  [
   279834, 
   null, 
   "supersport", 
   "Matters not whether or not epigenetic changes occurred prior to the mutation is irrelevant to the issue of whether or not it causes a phenotypic change and whether or not that change is beneficial. It does cause a phenotypic change and the change is in the proper context beneficial. End of issue. Why bother with irrelevancies?\n\n \n It doesn't matter if cancer occurs by random mutation or if it is a direct consequence of internal cellular environments? Don't you think that might play a role in how the disease is treated? And if cancer mutations are preceded by epigenetic changes, it makes you wonder if other mutations are the same....which has consequences to ToE because if mutations are nonrandom then the whole theory is shot because then there would be no pool of random genetic variants for selection to choose from.", 
   {}, 
   279833, 
   null, 
   1187771640.0
  ], 
  [
   279835, 
   null, 
   "chemist99a", 
   "Cancer is not the issue you were addressing nor which is under discussion.", 
   {}, 
   279834, 
   null, 
   1187771880.0
  ], 
  [
   279837, 
   null, 
   "chemist99a", 
   "However should you wish to get into a discussion of the fairly complex area of cancer genetics I suggest you might review a simplified summary from WIKI. You realize of course that you are stepping into a great morass of information here and that you will have to narrow your focus to specific example systems and models to begin to make sense of it. And of course much of the genetics here does not involve inheritance across generations or organisms but rather somatic cell lines only. \n \n \nPathophysiology\n Cancers are caused by a series of mutations. Each mutation alters the behavior of the cell somewhat.\n Cancers are caused by a series of mutations. Each mutation alters the behavior of the cell somewhat.\n \n Cancer is fundamentally a disease of regulation of tissue growth. In order for a normal cell to transform into a cancer cell, genes which regulate cell growth and differentiation must be altered. Genetic changes can occur at many levels, from gain or loss of entire chromosomes to a mutation affecting a single DNA nucleotide. There are two broad categories of genes which are affected by these changes. Oncogenes may be normal genes which are expressed at inappropriately high levels, or altered genes which have novel properties. In either case, expression of these genes promotes the malignant phenotype of cancer cells. Tumor suppressor genes are genes which inhibit cell division, survival, or other properties of cancer cells. Tumor suppressor genes are often disabled by cancer-promoting genetic changes. Typically, changes in many genes are required to transform a normal cell into a cancer cell.\n \n There is a diverse classification scheme for the various genomic changes which may contribute to the generation of cancer cells. Most of these changes are mutations, or changes in the nucleotide sequence of genomic DNA. Aneuploidy, the presence of an abnormal number of chromosomes, is one genomic change which is not a mutation, and may involve either gain or loss of one or more chromosomes through errors in mitosis.\n \n Large-scale mutations involve the deletion or gain of a portion of a chromosome. Genomic amplification occurs when a cell gains many copies (often 20 or more) of a small chromosomal locus, usually containing one or more oncogenes and adjacent genetic material. Translocation occurs when two separate chromosomal regions become abnormally fused, often at a characteristic location. A well-known example of this is the Philadelphia chromosome, or translocation of chromosomes 9 and 22, which occurs in chronic myelogenous leukemia, and results in production of the BCR-abl fusion protein, an oncogenic tyrosine kinase.\n \n Small-scale mutations include point mutations, deletions, and insertions, which may occur in the promoter of a gene and affect its expression, or may occur in the gene's coding sequence and alter the function or stability of its protein product. Disruption of a single gene may also result from integration of genomic material from a DNA virus or retrovirus, and such an event may also result in the expression of viral oncogenes in the affected cell and its descendants.\n \n Epigenetic changes are changes which do not affect chromosomal number or DNA sequence, but which can be passed on through generations of cell division, and thus may play a role in cancer. Known mechanisms of epigenetic change include DNA methylation, and methylation or acetylation of histone proteins bound to chromosomal DNA at specific locations.\n", 
   {}, 
   279835, 
   null, 
   1187773140.0
  ], 
  [
   279839, 
   null, 
   "chemist99a", 
   "And if you want a little more about how often hemoglobin mutates then you may wish to subscribe here:\n \n http://patients.uptodate.com/topic.asp?file=red_cell/27283\n \n \n \nIntroduction to hemoglobin mutations\n \n \n Stanley L Schrier, MD\n Stephen A Landaw, MD, PhD\n \n UpToDate performs a continuous review of over 375 journals and other resources. Updates are added as important new information is published. The literature review for version 15.2 is current through May 2007; this topic was last changed on May 8, 2007. The next version of UpToDate (15.3) will be released in October 2007.\n \n INTRODUCTION - Over 800 different mutations of the globin chains of the human hemoglobin molecule have been discovered [1]. They are classified according to the type of mutation (eg, insertion, deletion, base change), the affected globin subunit (eg, alpha chain, beta chain), and by the clinical and hematologic phenotype (show table 1 and show table 2). This topic review will present an introduction to the most common of these mutations. Sickle hemoglobin and the thalassemias are discussed separately.\n \n INCIDENCE - The most important distinction that needs to be made when considering mutant hemoglobins is the frequency with which they are found in human populations. One group of mutant globin genes, including hemoglobins S, C, and E, is found at a frequency varying from 2 to 95 percent in different populations. These mutations are the product of expansion via selective external forces (eg, malaria) because, in the asymptomatic heterozygous form, they protect carriers from dying of malarial infection. (See \"Protection against malaria in the hemoglobinopathies\"). These mutations are ethnic-specific, in that they are present in some human populations and not in others.\n \n Hemoglobin mutants in the second group exist at frequencies below 1 percent, and many times occur as spontaneous mutations in the propositus. These mutations usually have no medical consequences, but a subset can have serious abnormalities when present in the homozygous form. They are not ethnic-specific and examples of the same mutation, originating independently, can be found in any ethnic group.\n \n \n Mutant hemoglobins that have frequencies of approximately 1 to 2 percent may or may not have been expanded by selection (eg, HbDLos Angeles, HbA2 (a delta chain mutation), HbG-Philadelphia, Hb Hasharon). An alternative explanation is that these abnormal hemoglobins have a slightly higher frequency than predicted by mutational pressure alone (ie, no selection due to external forces) because of a \"founder's effect\". This occurs when a population originates from a single \"founder\" or a small group of people that by chance had a high frequency of a particular non-selected hemoglobin mutation.\n \n The majority of hemoglobin mutants are not associated with any clinical manifestations. Many were discovered during the course of large population surveys. The \"classical\" diagnostic tool for the detection of new hemoglobin mutants was zone electrophoresis, which separates proteins differing in electrical charge. However, many mutant hemoglobins have normal electrophoretic mobility, and must be studied by other methods, such as high performance liquid chromatography. A number of more sophisticated techniques have also been applied to the detection of mutant hemoglobins, including mass spectrometry and sequencing of DNA fragments generated by the polymerase chain reaction [2-6]. (See \"Molecular diagnosis of inherited hemoglobin disorders\").\n", 
   {
    "unicode_changes_made": true
   }, 
   279837, 
   null, 
   1187773740.0
  ], 
  [
   279842, 
   null, 
   "chemist99a", 
   "http://www.mhhe.com/biosci/genbio/biolink/j_explorations/ch01expl.htm\n \n And if you want to get a handle on where hemoglobin mutates and so on thats a nice application with graphics which lets you explore the molecules known variants and their impact on the molecule\n \n http://sickle.bwh.harvard.edu/hemoglobinopathy.html\n \n Gives info on various pathologies of hemoglobin.", 
   {}, 
   279839, 
   null, 
   1187774760.0
  ], 
  [
   279871, 
   null, 
   "supersport", 
   "Actually, I think I'm going to retract my admission regarding this double-muscling mutation. Here is my official challenge regarding mutations and their (in)abilities............(taken from Carm)\n \n \n Evolutionary theory is based on random mutations plus selection. Natural selection wades through all the raw material produced by mutations and then judges the fitness of this raw material. So here are my challenges: \n \n 1) I would like someone to show me how a random mutation can create the raw material that natural selection is supposed to be selecting: a physical body part or even a cellular structure. ANYTHING. I want to see evidence that random mutations can build new, complex machinery or a new physical structure such as a limb or organ. \n \n 2) I would like someone to show me an example of a mutation that creates a beneficial modification on an existing body part. Science has shown us in the lab how already-existing parts can be duplicated by way of mutations in regulatory genes....(fly wings, for example). Mutations have also shown to be associated with bacterial resistance. I accept both of these because they have been observed and shown to be scientifically valid. But what I'm asking for is the same scientific validation when it comes to a mutation creating a beneficial modification to an existing body part....(one that makes the animal more fit and more selectable than it was before). \n \n My contention here is that all mutations are either lethal, deterimental to the organism, or have nothing to do with the beneficial alteration of phenotype. Mutations do not create new body parts, nor do they modify existing body parts in a beneficial, selectable way. Without these two things, ToE is dead. The floor is open. \n \n this mutation that doubles the muscles is simply a duplication of already-existing structures by way of mutation, and thus, does not qualify as a legitimate answer to my challenge because what I am looking for is a change in the structure -- not a duplication of the same structure, which I already ackowledged. Duplications of existing structure will get ToE nowhere over the course of history....Darwinists need mutations to create beneficial changes/additions/novelties in structures. So I take it back. :)", 
   {}, 
   279842, 
   null, 
   1187794620.0
  ], 
  [
   279881, 
   null, 
   "N.Wells", 
   "Wells, you have no idea how many times this gene has mutated. \n That's what I said - I only claimed that there is evidence for at least four separate origins. More are possible, but either they didn't take or we haven't found them. Since we only test a small sample of the population, more mutations could well be out there. This does not help your case. \n \n \n Neither do science know that the mutations were de novo....they are merely guessing based on their worldview -- and for you to say otherwise is dishonest. \n I agree that it's an inference from the evidence, but it's suggested by distinct differences between the different versions - according to the experts on this, which I am not, the hundreds of different versions fall into four groups that are very hard to explain other than as four separate origins. Read Chemist's post for abundant relevant information. \n \n \nWe now know that cancer mutations are preceded by epigenetic changes....why is it so hard to believe that mutations leading to malaria resistance are the same? \n Chemist answered this one.\n \n \n \n(On myostatin) These animals are hardly more fit, and there are many known drawbacks.\n\n \n 1) \n Unlike in mice, a myostatin null mutation in cattle causes a reduction in sizes of internal organs\n \n For agricultural applications, there are some disadvantages to double-muscled cattle, namely the reduction in female fertility, lower viability of offspring, and delay in sexual maturation.\n\n \n From your own quote, \"unlike in mice\". Also, doctors were originally worried about the heart etc., of the boy in Germany, because of the known problems in cattle, but so far he has appeared fine in all respects. It's a bit early to tell about the fertility, of course. \n \n 2) I'm not disputing that there are drawbacks, but the key is the balance of the drawbacks and the advantages (which are to be judged solely by the context in which the organism exists). \n \n Every darn last thing in our bodies represents a balance of advantages and disadvantages (I'll do a post on this shortly). However, advantages and disadvantages depend on context, and it is easy to imagine contexts where the reproductive advantages of being a super-Schwarzenegger outweigh a hit taken in the fertility area. A 20% drop in sperm production would be more than offset if it also conferred a 100% increase in mating opportunities, whereas absolutely normal sperm production does you no good at all reproductively if no females will mate with you. Possibly you have personal experience that could apply in this area, assuming that you didn't pick the nickname Supersport in complete ignorance of its biological meaning. \n \n Delay in sexual maturation means very little in human terms, although it would be devastating if you were a cod in an overfished or intensely predated population. \n \n I'll get to your last post in a bit.", 
   {}, 
   279871, 
   null, 
   1187797260.0
  ], 
  [
   279887, 
   null, 
   "N.Wells", 
   "You have made a big to-do over anything negative associated with some changes. You seem to feel that evolutionary theory needs some mutations to be completely 'beneficial', and that any negatives at all make that mutation a degradation. \n \n First, as we keep telling you, mutations that are disadvantageous in one situation can be disadvantageous in others, and vice versa. \n \n Second, pretty much everything in biology results from trade-offs and all changes come with both advantages and disadvantages, often at the same time. \"Normal\" represents not perfection, but adequacy, \"good enough for now\".\n \n Consider people. We've got this great brain, but it came at a huge cost:\n a) Giving birth used to be somewhere around 1-2% lethal in premedical times (and worse, 1 in 16 births, in areas of squalor, disease, and poverty),\n b) we now need significantly more food to fuel it (but it allows us to get even more food, so that's not a problem) (Isler and van Schaik, 2006, Biol. Lett. 2, 557-560, \"Metabolic costs of brain size evolution\"),\n c) babies are born with large brains, so giving birth has become very painful, and enlargement of the birth canal causes females to run funny and walk strangely (although they turned that into a courtship display - if life hands you lemons, make lemonade),\n d) to avoid killing the mother more than 1-2% of the time or so, babies are born comparatively brain-empty, in a condition way less developed than, e.g., all ungulates and most primates. This requires a long dependent infancy, prolonged brain growth outside the womb, and a shift to needing a prolonged education to get all the needed information back into the brain. \n \n How about walking upright? Primarily, this frees our hands and allows us to carry infants, carry food, use weapons, etc., etc., etc., so it's really useful to us. However, it costs fallen arches, shot knees, bad backs (ruptured disks, etc.), hernias, and so forth. However, these happen after the child-bearing years, so evolution couldn't care less about all your aching joints.\n \n Eyesight? Ours isn't that good. Hearing? Ours sucks. Smell? Your dog does better by many orders of magnitude. \n \n Size and strength are important to humans, so how come we haven't all been honed by natural selection to be much larger and stronger - after all, there certainly are very tall and/or very strong people, so it is certainly possible. However, size and strength come at a considerable maintenance cost in calroies, and during famines the big guys can find themselves at a huge, indeed lethal, disadvantage. There are also developmental costs to consider: calories invested in one region of the body are not available for expenditure in other areas.", 
   {
    "unicode_changes_made": true
   }, 
   279881, 
   null, 
   1187800020.0
  ], 
  [
   279893, 
   null, 
   "N.Wells", 
   " Evolutionary theory is based on random mutations plus selection. Natural selection wades through all the raw material produced by mutations and then judges the fitness of this raw material. So here are my challenges: \n \n 1) I would like someone to show me how a random mutation can create the raw material that natural selection is supposed to be selecting: a physical body part or even a cellular structure. ANYTHING. I want to see evidence that random mutations can build new, complex machinery or a new physical structure such as a limb or organ. \n \n 2) I would like someone to show me an example of a mutation that creates a beneficial modification on an existing body part. Science has shown us in the lab how already-existing parts can be duplicated by way of mutations in regulatory genes....(fly wings, for example). Mutations have also shown to be associated with bacterial resistance. I accept both of these because they have been observed and shown to be scientifically valid. But what I'm asking for is the same scientific validation when it comes to a mutation creating a beneficial modification to an existing body part....(one that makes the animal more fit and more selectable than it was before). \n \n My contention here is that all mutations are either lethal, deterimental to the organism, or have nothing to do with the beneficial alteration of phenotype. Mutations do not create new body parts, nor do they modify existing body parts in a beneficial, selectable way. Without these two things, ToE is dead. The floor is open. \n \n this mutation that doubles the muscles is simply a duplication of already-existing structures by way of mutation, and thus, does not qualify as a legitimate answer to my challenge because what I am looking for is a change in the structure -- not a duplication of the same structure, which I already ackowledged. Duplications of existing structure will get ToE nowhere over the course of history....Darwinists need mutations to create beneficial changes/additions/novelties in structures. So I take it back. :)\n\n \n (Evolution is not just M&NS. And you are still misusing \"phenotype\")\n \n 1) No one claims any such results from random mutations. We claim that they come from various combinations of mutations, selection, recombination, and drift. Once selection is involved, the process is no longer 'random', but stepwise alternation of random and non-random.\n \n Also, I gave you some examples back in \n http://www.4forums.com/political/showthread.php?p=277655#post277655\n of how genes work in development to sculpt things like insect wings, whale limbs, and bat wings. These genes are obviously subject to mutations, which can modify the final output. So we have shown you HOW mutations can create major beneficial modifications to existing body parts.\n \n The overall process is slow, so we haven't produced brand new organs in the lab, but we've seen mutations change halteres into wings, produce new eyes, change antennae back into legs, and so forth, so we have shown ACTUAL MAJOR MODIFICATIONS to body parts, albeit not notably beneficial ones.\n \n \n 2) Beneficial mutations.\n You insist on your misunderstanding here. \"Beneficial\" is situational. We've given you several mutations that have clearly been beneficial in specific circumstances and several mutations that clearly could be beneficial under conditions that are easy to imagine.\n \n Duplication of chromosomes turned teosinte into corn, and was part of the process of producing modern wheat. The evolution of wheat (a series of duplications and hybridizations) has been repeated in the lab.\n \n \n 3) Your insistence against duplication is also unwarranted, since we know that duplication underlies numerous beneficial major changes of the sort that you ought to be focussing on.\n \n At our present level of knowledge, your specific demands haven't been met in a single demonstration. (Wheat evolution comes closest.) However, the combination of the sorts of things I gave you in 1 and 2, combined with additional information from genetics and the fossil record do demonstrate major beneficial evolutionary changes. \n \n Also, many of these changes begin with duplication. We know that genes can be duplicated. We know that structures can be duplicated. We know that duplicates of genes and duplicates of structures inevitably undergo subsequent modification. We see that modification of duplicates has led to some of the most fundamental advances in evolutionary history. We can tell that the front-most gill arch support bones in agnathan fish became jaws in gnathostome fish and subsequent vertebrates. We can tell that modification of the anteriormost vertebrae gave rise to good skull articulation via the axis and atlas bones. We can tell that fusion of the sacral vertebrae created the sacrum. We can tell that creation of a second jaw joint in the heads of therapsid reptiles allowed the original jaw joint bones to become specialized in their second function (transmission of sound), thus creating the mammalian inner ear. Two duplications of the homeobox gene set seem to have taken cephalochordates to agnathan 'fish' and on to gnathostome vertebrates. Etc.", 
   {}, 
   279871, 
   null, 
   1187801280.0
  ], 
  [
   279988, 
   null, 
   "supersport", 
   " \n \n Also, many of these changes begin with duplication. We know that genes can be duplicated. We know that structures can be duplicated. We know that duplicates of genes and duplicates of structures inevitably undergo subsequent modification. We see that modification of duplicates has led to some of the most fundamental advances in evolutionary history. We can tell that the front-most gill arch support bones in agnathan fish became jaws in gnathostome fish and subsequent vertebrates. We can tell that modification of the anteriormost vertebrae gave rise to good skull articulation via the axis and atlas bones. We can tell that fusion of the sacral vertebrae created the sacrum. We can tell that creation of a second jaw joint in the heads of therapsid reptiles allowed the original jaw joint bones to become specialized in their second function (transmission of sound), thus creating the mammalian inner ear. Two duplications of the homeobox gene set seem to have taken cephalochordates to agnathan 'fish' and on to gnathostome vertebrates. Etc.\n\n \n Wells, we just have a completely different idea as to how change happens. Obviously I cannot even debate you over it because you are such a Darwinist ideologue that talking to you is like talking to a brick wall. The basic problem is you are looking at evolution from the viewpoint of the gene -- as if that's all that exists....that changes in genes and morphology have no cause, no reason to happen. But this is simply your reductionist mindset. I realize I cannot say anything to change your mind that life is holistic, or that genes do not work in isolation, or that genes are under control of the cell, that the cell is under control of hormones and enzymes, that hormones and enzymes are under the control of the nervous system, that the nervous system has an amazing ability to read and respond to environmental changes, that these changes can be passed down to future generations thereby bypassing the silly premise darwinist have constructed for themselves that random changes in genes (culled by selection) are the cause of evolution -- but maybe you will listen to others that life may not be as reductionist as you think:\n \n http://www.hinduonnet.com/2001/08/06/stories/05062523.htm\n \n THE SEQUENCING of the human genome was completed in February this year. This was a truly historic event. Even more so because its findings were quite different from those anticipated by the large body of scientists working on the project.\n \n Announcing the findings of the HGP, Mr. Craig Venter, President Celera Corporation and one of the two most important scientists in the effort to map the human genome, put it very bluntly: ``In everyday language the talk is of a gene for this and a gene for that. We are now finding that that is rarely so. The number of genes that work in that way can almost be counted on your fingers. The notion that one gene equals one disease, or that one gene produces one key protein, is flying out of the window''. \n \n The new fluid or dynamic genome view confirms what was known but ignored by genocentric biology - that no gene works in isolation. After all, genetic interaction has been part of graduate genetics for over three decades now. The HGP also confirms what has been known for years - that DNA sequences within one gene may be used in coding many proteins. There is also no more doubt, if ever there was any, that the control pathway of gene expression is not closed and linear, but dynamic and circular. Changes in the cellular environment are sensed or measured by regulatory networks of proteins that function inside each cell. These networks interpret such signals so that the cell can make an appropriate response to these changes. Thus, protein networks feed back information from the outside world to the DNA and change patterns of gene expression in a context-dependent manner. \n \n The crucial thing to note here is that these dynamic networks have rules not specified by DNA. And this is an information management system we are only now beginning to follow. Research has started to shift in this direction.\n \n http://www.geneticengineering.org/dna9/default.htm\n \n Recent findings about several \"single gene\" disorders indicate that they are actually caused by different genes or gene patterns resulting in the same diseases. There are actually no simple one to one relationships between genes and traits. In such cases, the attempts at treating \"single gene disorders\" by replacing one gene are not likely to be successful. \n \n The expression of a gene is the result of a very complex interaction with the whole of the organism and is even influenced by external conditions. The stability of a gene is influenced by the condition of the organism. The genes are actually not well delineated entities as believed formerly. They may change character in response to the state of the organism and the same gene may even give rise to different proteins under different conditions. Therefore one cannot expect to be able to \"tailor\" the traits of organisms in a predictable way by insertion of \"desirable\" genes.\n \n The point is your perspective is completely and totally wrong. You are ignoring the cause of change -- and there's always a cause....but just because you don't know what it is does not necessarily make it random. Just like when a lottery ball gets chosen at \"random,\" the laws of physics and gravity say that the selection was not random at all....that if the same machine was rerun in the exact same way with all the balls in their exact same positions, that the same number would get selected again. Nothing random about it -- unpredictable by humans maybe...but not random. It's the same with biology....I would suggest most people who experience a cancer mutation don't do so randomly -- there's probably a darn good reason they have cancer. Likewise there's a good reason the bacteria mutates when put near antibiotics....likewise there's a good reason finches express their beaks in certain ways during development. \n \n So ultimately we just have a clash in how we see life. The difference, however, is I can prove to you that modifications (even heritable ones) do not happen randomly, where as you cannot prove that they happen randomly. It's just a hope and a guess on your part.", 
   {}, 
   279893, 
   null, 
   1187838180.0
  ], 
  [
   279993, 
   null, 
   "chemist99a", 
   "Wells, we just have a completely different idea as to how change happens. \n\n \n Indeed. Wells understands what we know about it, you SS do not. It makes a big difference in your ideas. Wells is backed by data and science you are not.", 
   {}, 
   279988, 
   null, 
   1187840160.0
  ], 
  [
   279994, 
   null, 
   "chemist99a", 
   "But this is simply your reductionist mindset. I realize I cannot say anything to change your mind that life is holistic, or that genes do not work in isolation, or that genes are under control of the cell, that the cell is under control of hormones and enzymes, that hormones and enzymes are under the control of the nervous system, that the nervous system has an amazing ability to read and respond to environmental changes, that these changes can be passed down to future generations thereby bypassing the silly premise darwinist have constructed for themselves that random changes in genes (culled by selection) are the cause of evolution -- but maybe you will listen to others that life may not be as reductionist as you think:\n\n \n \n Pure wishful thinking. For example how does something lacking a nervous system (like a plant!) undergo change if your scheme is correc? No way!", 
   {}, 
   279993, 
   null, 
   1187840340.0
  ], 
  [
   280002, 
   null, 
   "chemist99a", 
   "The point is your perspective is completely and totally wrong. You are ignoring the cause of change -- and there's always a cause....but just because you don't know what it is does not necessarily make it random.\n\n \n Nope. Evolution is the cause of change, the change is adaptive not creative and its not intelligently directed it indirectly binds environmental information into the genes.", 
   {}, 
   279994, 
   null, 
   1187842020.0
  ], 
  [
   280009, 
   null, 
   "supersport", 
   "Pure wishful thinking. For example how does something lacking a nervous system (like a plant!) undergo change if your scheme is correc? No way!\n\n \n how do you know a plant doesn't have a nervous system -- or something that operates as such?\n \n Tell me, do you agree that phenotypic plasticity (a fish changing colors, for example) probably starts with sensations generated by the nervous system in response to a stimuli? Do you also agree that plants experience phenotypic plasticity? If so, how? ....what sensesthe environment?", 
   {}, 
   279994, 
   null, 
   1187843220.0
  ], 
  [
   280011, 
   null, 
   "N.Wells", 
   "\n \n Wells, we just have a completely different idea as to how change happens. Obviously I cannot even debate you over it because you are such a Darwinist ideologue that talking to you is like talking to a brick wall. The basic problem is you are looking at evolution from the viewpoint of the gene -- as if that's all that exists....that changes in genes and morphology have no cause, no reason to happen. But this is simply your reductionist mindset. I realize I cannot say anything to change your mind that life is holistic, or that genes do not work in isolation, or that genes are under control of the cell, that the cell is under control of hormones and enzymes, that hormones and enzymes are under the control of the nervous system, that the nervous system has an amazing ability to read and respond to environmental changes, that these changes can be passed down to future generations thereby bypassing the silly premise darwinist have constructed for themselves that random changes in genes (culled by selection) are the cause of evolution -- but maybe you will listen to others that life may not be as reductionist as you think:\n \n http://www.hinduonnet.com/2001/08/06/stories/05062523.htm\n \n THE SEQUENCING of the human genome was completed in February this year. This was a truly historic event. Even more so because its findings were quite different from those anticipated by the large body of scientists working on the project.\n \n Announcing the findings of the HGP, Mr. Craig Venter, President Celera Corporation and one of the two most important scientists in the effort to map the human genome, put it very bluntly: ``In everyday language the talk is of a gene for this and a gene for that. We are now finding that that is rarely so. The number of genes that work in that way can almost be counted on your fingers. The notion that one gene equals one disease, or that one gene produces one key protein, is flying out of the window''. \n \n The new fluid or dynamic genome view confirms what was known but ignored by genocentric biology - that no gene works in isolation. After all, genetic interaction has been part of graduate genetics for over three decades now. The HGP also confirms what has been known for years - that DNA sequences within one gene may be used in coding many proteins. There is also no more doubt, if ever there was any, that the control pathway of gene expression is not closed and linear, but dynamic and circular. Changes in the cellular environment are sensed or measured by regulatory networks of proteins that function inside each cell. These networks interpret such signals so that the cell can make an appropriate response to these changes. Thus, protein networks feed back information from the outside world to the DNA and change patterns of gene expression in a context-dependent manner. \n \n The crucial thing to note here is that these dynamic networks have rules not specified by DNA. And this is an information management system we are only now beginning to follow. Research has started to shift in this direction.\n \n http://www.geneticengineering.org/dna9/default.htm\n \n Recent findings about several \"single gene\" disorders indicate that they are actually caused by different genes or gene patterns resulting in the same diseases. There are actually no simple one to one relationships between genes and traits. In such cases, the attempts at treating \"single gene disorders\" by replacing one gene are not likely to be successful. \n \n The expression of a gene is the result of a very complex interaction with the whole of the organism and is even influenced by external conditions. The stability of a gene is influenced by the condition of the organism. The genes are actually not well delineated entities as believed formerly. They may change character in response to the state of the organism and the same gene may even give rise to different proteins under different conditions. Therefore one cannot expect to be able to \"tailor\" the traits of organisms in a predictable way by insertion of \"desirable\" genes.\n \n The point is your perspective is completely and totally wrong. You are ignoring the cause of change -- and there's always a cause....but just because you don't know what it is does not necessarily make it random. Just like when a lottery ball gets chosen at \"random,\" the laws of physics and gravity say that the selection was not random at all....that if the same machine was rerun in the exact same way with all the balls in their exact same positions, that the same number would get selected again. Nothing random about -- unpredictable by humans maybe...but not random. It's the same with biology....I would suggest most people who experience a cancer mutation don't do so randomly -- there's probably a darn good reason they have cancer. Likewise there's a good reason the bacteria mutates when put near antibiotics....likewise there's a good reason finches express their beaks in certain ways during development. \n \n So ultimately we just have a clash in how we see life. The difference, however, is I can prove to you that modifications (even heritable ones) do not happen randomly, where as you cannot prove that they happen randomly. It's just a hope and a guess on your part.\n\n \n If I am so stuck in thinking \"one gene, one effect\", then why did I emphasize that \n The reason for distinguishing the two concepts, and thus the justification for the two words, is that there are several disjunctions between the information that the genes contain and the resulting expression as actual traits in the organism. Many traits are the result of multiple genes. Much of an organism's DNA is not genes. Quite a few of the genes that are present are never turned on. Some genes have multiple effects depending on what else is going on. Some of what you see in an organism is not of genetic origin.\n\n What do you think that I think happens when 'some genes don't get turned on'? If I didn't already agree that \"Recent findings about several single gene disorders indicate that they are actually caused by different genes or gene patterns resulting in the same diseases\", why would I have been emphasizing multiple ways to activate the myostatin effect and to create paddles out of hands, and to break the vitamin-C producing gene? Why is Venter qualifying his claims with \"known for years\" and \"There is also no more doubt, if ever there was any\"? - He's not saying that this stuff is newly discovered, but rather he's trying to puff up his results.\n \n I'm not the one with the problem here. You are so full of your own misunderstandings, your own preconceptions, your own wierd definitions, your own wierd religion-driven fantasies of the way things should be that you can't hear what anyone is saying and you can't process the relevant evidence. You keep telling me that I'm saying things about randomness that I'm are not saying. You keep telling me I'm a darwinist, when I'm not. You keep telling us all that evolutionary theory is just RMNS and randomness, when it isn't. You are inventing causes and processes without relevent supporting evidence. You keep making nutty requirements about phenotypes, beneficial mutations, abnormal traits, and so on, because you don't understand what the words mean. You keep citing literature that you think is supporting you when the citations disprove you, because you don't even understand what they are saying. \n \n I am perfectly willing to agree that 50 years from now our understanding of evolution is likely to be deeper and broader and in some ways different, hopefully even very important ways, from our current understanding. I actually look forward to that. However, we don't get from here to there by wishful and baseless re-interpretations of the sort that you and wascallywabbit engage in. To get back to the beginning of the thread, we do not get there by taking vitamin-C genetics data, misunderstanding it the way you and Borger have done, and then stating untruths about it. \n \n Learn the basics, get some proper evidence, try to rebuild your completely shattered credibility, and people may even listen to you.", 
   {}, 
   279988, 
   null, 
   1187843340.0
  ], 
  [
   280033, 
   null, 
   "chemist99a", 
   "how do you know a plant doesn't have a nervous system -- or something that operates as such?\n\n \n How do you know that you do?\n \n Look I trained as a botanist, there is no plant which has a nervous system. You can bank on it. Nothing in plants carries out the same function as neurons. You want to argue the point then I am willing to let you engage in mental self-abuse. Enjoy, but in the privacy of your own mind.", 
   {}, 
   280011, 
   null, 
   1187845680.0
  ], 
  [
   280034, 
   null, 
   "chemist99a", 
   "Learn the basics, get some proper evidence, try to rebuild your completely shattered credibility, and people may even listen to you.\n\n \n First he has to learn to care about the truth rather than his ego. Not likely IMHO.", 
   {}, 
   280033, 
   null, 
   1187845800.0
  ], 
  [
   280039, 
   null, 
   "supersport", 
   "Tell me, Chemist, do you agree that phenotypic plasticity (a fish changing colors, for example) probably starts with sensations generated by the nervous system in response to a stimuli? Do you also agree that plants experience phenotypic plasticity? If so, how? ....what sensesthe environment?", 
   {}, 
   280034, 
   null, 
   1187846280.0
  ], 
  [
   280041, 
   null, 
   "chemist99a", 
   "Tell me, Chemist, do you agree that phenotypic plasticity (a fish changing colors, for example) probably starts with sensations generated by the nervous system in response to a stimuli? Do you also agree that plants experience phenotypic plasticity? If so, how? ....what sensesthe environment?\n\n \n Does your blinking your eyes when something passes near them constitute phenotypic plasticity? How do you sense it? And yes the color changes of animals like squid are due to the nervous system just as their swimming is and your walking is.\n \n Yes plants exhibit phenotypic plasticity - In fact I gave you an example of a sunflower following the sun. But its not due to a nervous system. And yes I know how it works at the biochemical level, but since you don't care I see no reason to explicate it for you. You can look it up.", 
   {}, 
   280039, 
   null, 
   1187847300.0
  ], 
  [
   280059, 
   null, 
   "chemist99a", 
   "http://www.thecephalopodpage.org/cephschool/HowCephalopodsChangeColor.pdf\n \n Squid mechanisms.\n \n \n As to sunflowers:\n \n \nHeliotropism is not to be confused with phototropism. Phototropism is a change in the plant's growth in response to light and is not a reversible condition. Heliotropism is caused by differential turgor pressures.\n \n The peduncle (stem of the inflorescence) and the petiole (leaf's stem) contain an aggregate of specialized cells called a pulvinus. Pulvini are capable of altering the amount of water present and like a balloon can either be rigid or limp.\n \n Cells within the pulvinus reduce their osmotic potential in response to the blue wavelengths present in sunlight. When the osmotic potential decreases, water flows into the cells. The increase in turgor pressure expands the size of the cells. The expansion of the pulvinus reorients the leaf or flower\n", 
   {}, 
   280041, 
   null, 
   1187876400.0
  ], 
  [
   284853, 
   null, 
   "SLP", 
   "This is the same Peter Borger that believes that there are particles 'creatons' that alter morphology, and that researches asthma....", 
   {}, 
   280059, 
   null, 
   1190409900.0
  ], 
  [
   284867, 
   null, 
   "Count Otto", 
   "This is the same Peter Borger that believes that there are particles 'creatons' that alter morphology, and that researches asthma....\n\n \n emoticon_smile He doesn't appear to be banned from EvC either. Seems like he just stopped posting...", 
   {}, 
   284853, 
   null, 
   1190416440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Sleight-of-hand with Vitamin C", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10258-sleight-hand-vitamin-c.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10258, 
  "discussion_files": [
   [
    "19332.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10258-sleight-hand-vitamin-c-print.html"
   ], 
   [
    "19333.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10258-sleight-hand-vitamin-c-9-print.html"
   ], 
   [
    "19334.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10258-sleight-hand-vitamin-c-7-print.html"
   ], 
   [
    "19335.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10258-sleight-hand-vitamin-c-5-print.html"
   ], 
   [
    "19336.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10258-sleight-hand-vitamin-c-4-print.html"
   ], 
   [
    "19337.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10258-sleight-hand-vitamin-c-6-print.html"
   ], 
   [
    "19338.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10258-sleight-hand-vitamin-c-8-print.html"
   ], 
   [
    "19339.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10258-sleight-hand-vitamin-c-3-print.html"
   ], 
   [
    "19340.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10258-sleight-hand-vitamin-c-2-print.html"
   ]
  ], 
  "identifier": 10258
 }
]