[
 [
  [
   279272, 
   null, 
   "samiinh", 
   "Go to Dispatch.com home page\n Anti-gay activists crash worship services\n Minutemen take 'word of God' to 2 congregations\n Friday, August 17, 2007 3:31 AM\n By Gail Martineau\n THE COLUMBUS DISPATCH\n A conservative Christian values group has been interrupting services at two central Ohio churches to protest their support for homosexuality.\n \n Minutemen United vowed to attend services every Sunday.\n \n The group started its crusade when First Baptist Church in Granville hosted \"Love Makes a Family,\" a traveling exhibit by the Family Diversity Project showing photos of lesbian, gay, bisexual and transgender families.\n \n The night the exhibit opened in July, members of Minutemen United stood outside and protested the exhibit and the church's open attitude toward homosexuality, said the Rev. Kathy Hurt, senior pastor at the Granville church.\n \n Since then, the group has been visiting the church every Sunday, she said.\n \n On one of the first Sundays, six people came to the church's 11 a.m. service and addressed the congregation during a time designated for prayer requests and comments.\n \n Hurt said a man, who introduced himself as a minister from the New Beginnings Church in Warsaw, Ohio, started to give a sermon about how the church was acting against God's word by accepting homosexuals.\n \n Members of Minutemen United also visited King Avenue United Methodist Church in Columbus that same morning, said the Rev. John Keeny.\n \n \"They rebuked me as a pastor for preaching that God's love is for everyone,\" Keeny said.\n \n The pastor said he was proud of the way his congregation responded to the interruption, and he asked them to pray that the hearts of the Minutemen would be open.\n \n \"At our church, we welcome all people,\" he said. \"We would welcome them in worship, too, but we expect hospitality and acceptance to be demonstrated by all who come to worship here.\"\n \n Max Erwin Sr., an evangelist with the New Beginnings ministry and a member of Minutemen United, said he attended services at King Avenue and First Baptist churches.\n \n \"What I do is not about hate; it's everything to do with love,\" Erwin said. \"Homosexuality is a sin.\"\n \n He said he plans to concentrate his efforts on First Baptist Church. He will be outside the church building every Sunday, as long as it doesn't rain.\n \n \"There are people there who are truly hungry for the true word of God,\" Erwin said. \"The word of God is the word of God. It is not subject to private interpretation.\"\n \n Dave Daubenmire, the founder of Minutemen United, said the group believes in taking its faith to the streets.\n \n \"People point us out to be haters,\" he said. \"Jesus loves the homosexual, but he doesn't love homosexuality. This is about holding each other accountable.\"\n \n Daubenmire said he wants to protect others by raising the standards of right and wrong.\n \n \"I don't care what anyone does at home, but when they want to bring it out of their homes and into the street, now it becomes a public issue,\" he said. \"I have an obligation as a Christian and father to stand up and say, 'My faith says this is a sin.' \"\n \n The Rev. Tim Ahrens, of the First Congregational Church Downtown, said that when he heard about the situation, he asked his congregation to pray for the Minutemen as well as the church congregations.\n \n \"It's one thing to have your opinions, but it's another thing to take it to the next level by crossing the threshold of a worshipping congregation,\" Ahrens said.", 
   {
    "post_info": {
     "post_title": "Christian"
    }
   }, 
   null, 
   null, 
   1187544000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Christian", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10253-christian.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10253, 
  "discussion_files": [
   [
    "14726.html", 
    "http://www.4forums.com/political/gay-rights-debates/10253-christian-print.html"
   ]
  ], 
  "identifier": 10253
 }
]