[
 [
  [
   279674, 
   null, 
   "richbrmly", 
   "In the year 2000:\n \n There where over 4 million births.\n \n 281 women died in childbirth in the U.S. and .5 million all over the world.\n \n There where 1.3 million abortions.\n \n A little over 2000 partial birth abortions where performed in the U.S..\n \n Only 10 of the partial birth abortions where performed on a fetus that was believed to be able to live without machines.\n \n \n Anyone know why every U.S. medical association was against the ban?", 
   {
    "post_info": {
     "post_title": "Why was every medical association in the U.S. against the partial birth abortion ban?"
    }
   }, 
   null, 
   null, 
   1187705940.0
  ], 
  [
   279675, 
   null, 
   "Steeeeve", 
   "Why do you say every medical association is against the ban?", 
   {}, 
   279674, 
   null, 
   1187706540.0
  ], 
  [
   279700, 
   null, 
   "richbrmly", 
   "Why do you say every medical association is against the ban?\n\n \n Because it was reported that every U.S. medical association was against the ban. My only source was MSNBC.", 
   {}, 
   279675, 
   null, 
   1187711880.0
  ], 
  [
   279702, 
   null, 
   "chemist99a", 
   "Anyone know why every U.S. medical association was against the ban?\n\n \n Surely do. The associations reached the consensus that making such a procedure illegal would compromise their ability to render good medical care to some of their patients. Consider what would happen should the congress take it into its head to ban abdominal surgery for appendicitis! People with appendicitis would not recieve the best standard of care - NOT because physicians did not understand how to treat the problem but rather because congress for political reasons had outlawed it.\n \n The same goes for PBA its a life saving procedure for the woman in some cases - the law may well ban the procedure in such cases and thus impinge on the best treatment for SOME patients. Physicians are being ethical when they oppose the banning of procedures by legislators.", 
   {}, 
   279700, 
   null, 
   1187712420.0
  ], 
  [
   279958, 
   null, 
   "Steeeeve", 
   "Because it was reported that every U.S. medical association was against the ban. My only source was MSNBC.\n\n \n can you post the link...", 
   {}, 
   279700, 
   null, 
   1187818740.0
  ], 
  [
   280073, 
   null, 
   "richbrmly", 
   "A procedure found necessary and proper in certain cases by the American College of Obstetricians and Gynecologists.\"\n \n I have been looking for a source to my comment and have yet to find one. I heard the statement off the cuff from a news caster and it was not for public consumption. So it needs further research.", 
   {}, 
   279958, 
   null, 
   1187886120.0
  ], 
  [
   280704, 
   null, 
   "Shooterandproud", 
   "Ever since the conservatives took over, we have been entering some sort of medical dark age, with more and more Americans dying (or should I say being murdered?) because of botched abortion laws, and a ban on research that could ease much of America's suffering and death. My neighbor, who I knew very well, just recently died of cancer. I wonder if stem cell research could've saved him. I also wonder if the Republican Party killed him.", 
   {}, 
   280073, 
   null, 
   1188150780.0
  ], 
  [
   280825, 
   null, 
   "thelmoose", 
   "ACOG Statement on the US Supreme Court Decision Upholding the\n Partial-Birth Abortion Ban Act of 2003 \n \n \n Washington, DC -- Despite the fact that the safety advantages of intact dilatation and evacuation (intact D&E) procedures are widely recognized-in medical texts, peer-reviewed studies, clinical practice, and in mainstream, medical care in the United States-the US Supreme Court today upheld the Partial-Birth Abortion Ban Act of 2003. \n \n According to the American College of Obstetricians and Gynecologists' (ACOG) amicus brief opposing the Ban, the Act will chill doctors from providing a wide range of procedures used to perform induced abortions or to treat cases of miscarriage and will gravely endanger the health of women in this country. \n \n \"Today's decision to uphold the Partial-Birth Abortion Ban Act of 2003 is shameful and incomprehensible to those of us who have dedicated our lives to caring for women,\" said Douglas W. Laube, MD, MEd, ACOG president. \"It leaves no doubt that women's health in America is perceived as being of little consequence. \n \n \"We have seen a steady erosion of women's reproductive rights in this country. The Supreme Court's action today, though stunning, in many ways isn't surprising given the current culture in which scientific knowledge frequently takes a back seat to subjective opinion,\" he added. \n \n This decision discounts and disregards the medical consensus that intact D&E is safest and offers significant benefits for women suffering from certain conditions that make the potential complications of non-intact D&E especially dangerous. Moreover, it diminishes the doctor-patient relationship by preventing physicians from using their clinical experience and judgment. \n \n \"On behalf of the 51,000 ACOG members who strive to provide the very best possible medical care to the women we serve, I can only hope that in the future, science will again be at the core of decision-making that affects the life and well-being of all of us,\" said Dr. Laube. \n \n http://www.acog.org/from_home/publications/press_releases/nr04-18-07.cfm", 
   {
    "unicode_changes_made": true
   }, 
   280704, 
   null, 
   1188165060.0
  ], 
  [
   280877, 
   null, 
   "Steeeeve", 
   "ACOG Statement on the US Supreme Court Decision Upholding the\n Partial-Birth Abortion Ban Act of 2003 \n \n \n Washington, DC -- Despite the fact that the safety advantages of intact dilatation and evacuation (intact D&E) procedures are widely recognized-in medical texts, peer-reviewed studies, clinical practice, and in mainstream, medical care in the United States-the US Supreme Court today upheld the Partial-Birth Abortion Ban Act of 2003. \n \n According to the American College of Obstetricians and Gynecologists' (ACOG) amicus brief opposing the Ban, the Act will chill doctors from providing a wide range of procedures used to perform induced abortions or to treat cases of miscarriage and will gravely endanger the health of women in this country. \n \n \"Today's decision to uphold the Partial-Birth Abortion Ban Act of 2003 is shameful and incomprehensible to those of us who have dedicated our lives to caring for women,\" said Douglas W. Laube, MD, MEd, ACOG president. \"It leaves no doubt that women's health in America is perceived as being of little consequence. \n \n \"We have seen a steady erosion of women's reproductive rights in this country. The Supreme Court's action today, though stunning, in many ways isn't surprising given the current culture in which scientific knowledge frequently takes a back seat to subjective opinion,\" he added. \n \n This decision discounts and disregards the medical consensus that intact D&E is safest and offers significant benefits for women suffering from certain conditions that make the potential complications of non-intact D&E especially dangerous. Moreover, it diminishes the doctor-patient relationship by preventing physicians from using their clinical experience and judgment. \n \n \"On behalf of the 51,000 ACOG members who strive to provide the very best possible medical care to the women we serve, I can only hope that in the future, science will again be at the core of decision-making that affects the life and well-being of all of us,\" said Dr. Laube. \n \n http://www.acog.org/from_home/publications/press_releases/nr04-18-07.cfm\n\n \n I like how they treat the decision as if it were a law voted on. This just goes to show that people truly do not understand the job of a judge. \n \n A judge doesn't decide if something is a good idea or not. Perhaps the ACOG should stick with what they know and leave the legal stuff to others.", 
   {
    "unicode_changes_made": true
   }, 
   280825, 
   null, 
   1188174840.0
  ], 
  [
   280882, 
   null, 
   "thelmoose", 
   "I like how they treat the decision as if it were a law voted on. This just goes to show that people truly do not understand the job of a judge. \n \n A judge doesn't decide if something is a good idea or not. Perhaps the ACOG should stick with what they know and leave the legal stuff to others.\n\n \n \n Although this was a reaction to a court decision, the same opinion stands for the underlying legislation to which the ruling applies. \n \n Perhaps the government should stick with what they know and leave the medical stuff to doctors. \n \n In any event, you are changing the subject. This post was answering a request from someone, oh, I don't know who, wondering why the opening post asserted that medical associations opposed the ban. This was evidence that the organization that would be principly concerned with this issue indeed has a strong oppostion to it.", 
   {}, 
   280877, 
   null, 
   1188176460.0
  ], 
  [
   280894, 
   null, 
   "Steeeeve", 
   "Although this was a reaction to a court decision, the same opinion stands for the underlying legislation to which the ruling applies. \n I am perfectly fine with someone arguing the actual legislation. In fact, it probably is inappropriate for the federal government getting in on such an issue but that is all irrelevant when talking about a court case. \n \n \nPerhaps the government should stick with what they know and leave the medical stuff to doctors. \nThey did....they made a law representing what the people wanted.\n \n \nIn any event, you are changing the subject. This post was answering a request from someone, oh, I don't know who, wondering why the opening post asserted that medical associations opposed the ban. This was evidence that the organization that would be principly concerned with this issue indeed has a strong oppostion to it.\nI realize that, but I get annoyed when a group comments on a judicial decision as if it were legislation passed. \n \n In the end, I don't really care what medical organizations have to say on the subject (care in the sense that I don't think it has value above other judgments).", 
   {}, 
   280882, 
   null, 
   1188181020.0
  ], 
  [
   280899, 
   null, 
   "thelmoose", 
   "\n In the end, I don't really care what medical organizations have to say on the subject \n\n \n Then why did you ask\n \nWhy do you say every medical association is against the ban?\n", 
   {}, 
   280894, 
   null, 
   1188181560.0
  ], 
  [
   280906, 
   null, 
   "Steeeeve", 
   "Then why did you ask\n\n \n Because he never gave a source.", 
   {}, 
   280899, 
   null, 
   1188183000.0
  ], 
  [
   280913, 
   null, 
   "Phyllis", 
   "We do know that the procedure banned by the statute in question is never medically necessary to save the life of the mother. That is a fact.", 
   {}, 
   280906, 
   null, 
   1188185040.0
  ], 
  [
   280919, 
   null, 
   "chemist99a", 
   "Oddly enough the physicians who make that assessment appear to disagree with you! Are you a physician by any chance? Are you a member of any organization opposing the law? Where did you get the data that NO woman was ever at risk which was reduced by the procedure?", 
   {}, 
   280913, 
   null, 
   1188185580.0
  ], 
  [
   280923, 
   null, 
   "Phyllis", 
   "Oddly enough the physicians who make that assessment appear to disagree with you! Are you a physician by any chance? Are you a member of any organization opposing the law? Where did you get the data that NO woman was ever at risk which was reduced by the procedure?\n\n \n The procedure occurs over a multi-day period of time. That certainly doesn't sound like an emergency! Physicians must be bound to operate within a proper ethical framework. Once they step outside of that framework, laws must be passed to regulate their behavior.\n \n Incidentally, the ban allows for the exception of performing that abortion for the purpose of saving the mother's life.", 
   {}, 
   280919, 
   null, 
   1188186120.0
  ], 
  [
   280935, 
   null, 
   "thelmoose", 
   "We do know that the procedure banned by the statute in question is never medically necessary to save the life of the mother. That is a fact.\n\n \n \nThe procedure occurs over a multi-day period of time. That certainly doesn't sound like an emergency! Physicians must be bound to operate within a proper ethical framework. Once they step outside of that framework, laws must be passed to regulate their behavior.\n \n Incidentally, the ban allows for the exception of performing that abortion for the purpose of saving the mother's life.\n\n \n Under certain condition, usually in the second trimester, it is the safest procedure. The one with the least risk of complications to the mother. No one said anything about it being urgent lest the mother's life is at risk. It is almost never an emergency, why did you bring up that obfuscation? It is the most ethical procedure, unless you consider performing that which is least risky unethical.\n \n You are twisting the facts, putting it in terms of \"medically necessary to save the life of the mother\" or calling it an \"emergency\". That is not relevant to this particular argument.", 
   {}, 
   280923, 
   null, 
   1188191400.0
  ], 
  [
   280938, 
   null, 
   "chemist99a", 
   "The procedure occurs over a multi-day period of time. That certainly doesn't sound like an emergency! Physicians must be bound to operate within a proper ethical framework. Once they step outside of that framework, laws must be passed to regulate their behavior.\n \n Incidentally, the ban allows for the exception of performing that abortion for the purpose of saving the mother's life.\n\n \n So if there is a 50% chance of the mothers death if the procedure is NOT performed and a 25% chance of her death if the procedure is used then you would disallow the procedure as being non-ethical? Is that it? NO?\n \n OK if NO then how about 10% without the proceudre and 3% with it? Yes? No? Don't know?\n \n And what \"ethical framework\" are you proposing. I agree Docs need an ethical framework but is the one you wish to impose the correct one? Is your framework superior to what the profession itself would freely impose? If so then why?", 
   {}, 
   280935, 
   null, 
   1188195300.0
  ], 
  [
   280940, 
   null, 
   "Phyllis", 
   "Under certain condition, usually in the second trimester, it is the safest procedure. The one with the least risk of complications to the mother. No one said anything about it being urgent lest the mother's life is at risk. It is almost never an emergency, why did you bring up that obfuscation? It is the most ethical procedure, unless you consider performing that which is least risky unethical.\n\n If you're going to deliver the fetus partially only so you can kill it more safely, why not go ahead and deliver the fetus completely and not kill it at all?\n \n As to your suggestion that the procedure is the most ethical, I simply think you are wrong. Not only do most people not think that the PBA is the most ethical way to perform an abortion, most people do not even think that PBA is minutely ethical. Most people find it to be abhorrent and immoral.\n \n \nYou are twisting the facts, putting it in terms of \"medically necessary to save the life of the mother\" or calling it an \"emergency\". That is not relevant to this particular argument.\n\n I never twist facts. If, however, you wish to view a thread where facts are consistently twisted (and invented) then you can visit the \"Abortion as Euthanization?\" thread starting with post #291. \n \n It happens that Congress found that the procedure it banned was never medically necessary. That is not my opinion. That is what the factual findings were. And in so finding Congress took testimony from physicians in the field.", 
   {}, 
   280935, 
   null, 
   1188197820.0
  ], 
  [
   280941, 
   null, 
   "Phyllis", 
   "So if there is a 50% chance of the mothers death if the procedure is NOT performed and a 25% chance of her death if the procedure is used then you would disallow the procedure as being non-ethical? Is that it? NO?\n \n OK if NO then how about 10% without the proceudre and 3% with it? Yes? No? Don't know?\n \n\n No, what I would say is that if you are going to induce labor so that you can kill the fetus when it is half-way out of the mother's body, then you should go ahead and birth the baby fully.\n \n \nAnd what \"ethical framework\" are you proposing. I agree Docs need an ethical framework but is the one you wish to impose the correct one?\n\n Yes. Delivering a fetus to the point that it is half-way out of the mother's body just so you can kill it is not an ethical practice. It is a barbaric practice. It is a much more barbaric practice then the electrocuting and strangling of dogs who lose in a dog fighting ring.\n \n \nIs your framework superior to what the profession itself would freely impose? If so then why?\n\n As is true for anyone (except the self-contradicting moral relativists), I believe my ethical framework is true. If the profession will not restrain itself from allowing the procedure in question, then the people (through their elected representatives) must step in and show them the light. And if they can't get this one right, it makes me question whether they have an adequate basis for ethical judgments.", 
   {}, 
   280938, 
   null, 
   1188198540.0
  ], 
  [
   280942, 
   null, 
   "chemist99a", 
   "It happens that Congress found that the procedure it banned was never medically necessary. That is not my opinion. That is what the factual findings were. And in so finding Congress took testimony from physicians in the field.\n\n \n Well of course congress did else they could not justify their action. The problem of course is that in so doing the judgement of people who are mostly lawyers is being substituted for people who are skilled in the medical arts. AND the medically trained experts DO NOT AGREE with congress. Does congress (which is as you may have noticed rather subject to subjective influences) have the necessary expertise to actually reach a well considered and informed conclusion on this issue? If a judge sitting on the bench takes testimony in regard to say space shuttle construction and engineering regarding a highly technical issue will he be able to make a well informed decision if he does not have the necessay background to understand the details? My own experience leads me to say NO.", 
   {}, 
   280941, 
   null, 
   1188201720.0
  ], 
  [
   280943, 
   null, 
   "chemist99a", 
   "Yes. Delivering a fetus to the point that it is half-way out of the mother's body just so you can kill it is not an ethical practice. It is a barbaric practice. It is a much more barbaric practice then the electrocuting and strangling of dogs who lose in a dog fighting ring.\n\n \n And you know this precisely how? Are you sure the fetus was viable? COULD the fetus have been delivered and live? Do you really know? And if the abortion is therapeutic (as almost all PBAs which are rarely done by the way) how do you know that the fetus is at all healthy? Its not my field but I see no reason to think that just because a fetus is half-way out of the body before its 'killed\" that it was necessarily feasable to preserve it as a living organism. Do you know? If not perhaps we should both educate ourselves?", 
   {}, 
   280942, 
   null, 
   1188202080.0
  ], 
  [
   280944, 
   null, 
   "chemist99a", 
   "Circumstances and reasons for this procedure\n \n IDX, along with dilation and evacuation (D&E), early induction of labor, and rare procedures such as saline abortion, are only used in the late stages of pregnancy. Late-term abortions at 21 weeks or later account for 1.4% of all abortions in the USA.[11] Intact D&X procedures are used in approximately 15% of those late-term abortion cases. This calculates to between 2,500 and 3,000 per year, using data from the Alan Guttmacher Institute for the year 2000. They are typically performed between the twentieth and twenty-fourth week of pregnancy.[12]\n \n Women choose to have late-term abortions for a variety of reasons. Once a pregnant woman has made the decision to have a late-term abortion, she or a doctor may choose IDX over other available late-term abortion procedures because:\n \n * Although a woman may experience contractions, she does not have to experience labor.[13]\n * IDX is an outpatient procedure; the woman does not have to be hospitalized.[13]\n * The woman does not have to undergo abdominal surgery.[14]\n * The procedure results in a largely intact body over which the parents may grieve.[15]\n * Instruments are inserted into the uterus fewer times than in a D&E abortion, potentially reducing the risk of uterine tearing.[16]\n * The fetus may have hydrocephalus, where the head may expand to a radius of up to 250% of a normal skull at birth, making it impossible for it to pass through the cervix. If live birth is desired, the physician may drain the excess fluid in utero using a syringe,[17] or a caesarian section may be done as soon as amniocentesis indicates lung maturity.[18] If abortion is desired, D&X may be the simplest procedure.[13]\n \n Reasons a woman or physician may not choose IDX, opting instead for another abortion procedure, include:\n \n * IDX requires a larger dilation of the cervix than D&E.[16]\n * Podalic version (turning the fetus into a breech position) can be dangerous to the woman.[17]\n * The incision in the fetal skull is made blind; the physician may miss and injure the woman's cervix.[17]", 
   {}, 
   280943, 
   null, 
   1188202560.0
  ], 
  [
   280952, 
   null, 
   "thelmoose", 
   "If you're going to deliver the fetus partially only so you can kill it more safely, why not go ahead and deliver the fetus completely and not kill it at all?\n \n As to your suggestion that the procedure is the most ethical, I simply think you are wrong. Not only do most people not think that the PBA is the most ethical way to perform an abortion, most people do not even think that PBA is minutely ethical. Most people find it to be abhorrent and immoral.\n \n \n\n \n That is simply contrary to the facts. You are not a physician, let alone a gynecologist. Those that address this issue, that know something about it, unlike you, feel there are certain indications in which it is the safest procedure. And these are not gut feelings, they are based on studies. \n \n There are reasons not to deliver the baby:[*]Abortion is desired. [*]The fetus would not survive. [*]I do know that extreme hydrocephalus is an absolute indication. This fetus is never viable outside the womb.If you simply think I am wrong, you need to back that up with medical facts. \n Nor is it remotely true that most people think it is abhorrent. By most people you should include those who know something about it. For example, the term partial birth abortion is not a medical term, but a political one created by the anti-abortion crowd. The fact that you even use that term demonstrates bias and a lack of information. It is a sensational term that is meant to reduce the dispassion necessary to discuss issues like this. \n \n The simple fact is this procedure is supported by the vast majority of OB-Gyns as indicated by that position statement. \n \n You can't just spout uninformed opinion on highly technical areas like this. \n \n And as for \"I never twist facts\", your high opinion of yourself is noted. You twisted them here by talking about emergencies and saving the life of the mother, as I pointed out.", 
   {}, 
   280940, 
   null, 
   1188210840.0
  ], 
  [
   280957, 
   null, 
   "thelmoose", 
   "Intact dilatation and extraction has the lowest maternal mortality rate of all second trimester pregnancy termination procedures and comparable morbidity to other second trimester techniques (systemic and intrauterine abortefacients.)\n\n \n Stubblefield, PG. Pregnancy termination. p. 1303. In: Obstetrics: Normal and Problem Pregnancies, 2nd ed, Gabbe, SG, Niebyl, JR, Simpson, JL (eds), Churchill Livingstone, New York 1991.", 
   {}, 
   280952, 
   null, 
   1188212460.0
  ], 
  [
   281030, 
   null, 
   "chemist99a", 
   "Stubblefield, PG. Pregnancy termination. p. 1303. In: Obstetrics: Normal and Problem Pregnancies, 2nd ed, Gabbe, SG, Niebyl, JR, Simpson, JL (eds), Churchill Livingstone, New York 1991.\n\n \n But that does not matter to those who are disconnected from reality and do not have actual knowledge of what they speak and who speak only what they believe or wish rather than what is known to those who DO KNOW. You have to understand that its the same attitude that destroyed New Orleans, and that took us on the fairy tale invasion of Iraq. Reality to such minds is what they say it is. After all a legislature once passed a bill declaring Pi to be 3.0 thinking it would simplify calculations. And the now resigned Gonezales justified torture as being legitimate. There are many other examples. Ignore reality and it makes doing what you wish ever so much easier.", 
   {}, 
   280957, 
   null, 
   1188259440.0
  ], 
  [
   281041, 
   null, 
   "thecap0", 
   "Phyllis,\n \n Not only do most people not think that the PBA is the most ethical way to perform an abortion, most people do not even think that PBA is minutely ethical.\n \n \"Most people\" do not have the right to determine what choice the female members of my family make as to the parasite inside their bodies.\n \n That is and should always be a choice made only by the woman and anyone she chooses to consult.\n \n IOW, sweetie, MYOB!emoticon_smile", 
   {
    "post_info": {
     "post_title": "Life is too short to live it in Texas!"
    }
   }, 
   281030, 
   null, 
   1188260580.0
  ], 
  [
   281048, 
   null, 
   "chemist99a", 
   "IOW, sweetie, MYOB!\n\n \n No, no you cannot say that. It is their business thats what their doctrine and priests, and popes, and GOD tells em to do. You cannot ignore the very voice of GOD you know. Its the duty of every good person to enforce the doctrine on all around them.", 
   {}, 
   281041, 
   null, 
   1188262020.0
  ], 
  [
   281057, 
   null, 
   "Shooterandproud", 
   "I love Phyllys's analogy. Comparing dogfighting to PBA's? Can someone tell me when a dogfight has saved a human life? Anybody?\n \n And also, why should \"the people\", most of whom have very limited medical knowledge, if any, should interfere with medical science and start telling the doctors and scientists how to practice and/or research? Shouldn't the doctor's be responsible for themselves in saying what is right and what is wrong?\n \n May I remind any of you (especially the religious folk) how the dark ages started?", 
   {}, 
   281048, 
   null, 
   1188262800.0
  ], 
  [
   281083, 
   null, 
   "chemist99a", 
   "Can someone tell me when a dogfight has saved a human life? Anybody?\n\n \n Actually Dogs are often used in war and when two of them confront each other its likely that some human lives have been saved. And then there are people dumb enough to bet their lives on things like dog-fights - but I cannot give you a specific example. Probably sometime someplace a dogfight HAS saved a human life. The analogy however remains an utterly stupid and inappropiate one - thats Phyllis for ya though.", 
   {}, 
   281057, 
   null, 
   1188265260.0
  ], 
  [
   281089, 
   null, 
   "Phyllis", 
   "Phyllis,\n \n Not only do most people not think that the PBA is the most ethical way to perform an abortion, most people do not even think that PBA is minutely ethical.\n \n \"Most people\" do not have the right to determine what choice the female members of my family make as to the parasite inside their bodies.\n\n They obviously do with respect to the procedure in question. And since no one on here has ever bothered to explain what they mean by a \"right,\" I'll simply deny that a female has the right to have an abortion.", 
   {}, 
   281041, 
   null, 
   1188266280.0
  ], 
  [
   281091, 
   null, 
   "Phyllis", 
   "I love Phyllys's analogy. Comparing dogfighting to PBA's? Can someone tell me when a dogfight has saved a human life? Anybody?\n\n I already said that the ban doesn't apply to instances where the procedure is needed to save maternal life. So, we are talking about instances where it is not necessary to save maternal life. The procedure is barbaric, and most people agree with that.\n \n \nAnd also, why should \"the people\", most of whom have very limited medical knowledge, if any, should interfere with medical science and start telling the doctors and scientists how to practice and/or research? Shouldn't the doctor's be responsible for themselves in saying what is right and what is wrong?\n\n The fact that \"the people\" have limited medical knowledge is irrelevant. Suppose the people have limited medical knowledge about wildlife or the environment. Does this, then, prevent them from making laws to preserve wildlife or the environment? No.\n \n \nMay I remind any of you (especially the religious folk) how the dark ages started?\n\n Let me guess: by preventing medical doctors from performing partial birth abortions? Or by preventing medical doctors from performing any abortions?", 
   {}, 
   281057, 
   null, 
   1188266640.0
  ], 
  [
   281092, 
   null, 
   "Phyllis", 
   "Actually Dogs are often used in war and when two of them confront each other its likely that some human lives have been saved. And then there are people dumb enough to bet their lives on things like dog-fights - but I cannot give you a specific example. Probably sometime someplace a dogfight HAS saved a human life. The analogy however remains an utterly stupid and inappropiate one - thats Phyllis for ya though.\n\n No, the analogy runs this way: Mike Vick is going to spend some time for his involvement in dog fighting. What he was involved in was cruel. It was, in fact, barbaric.\n \n Involving oneself in the process of delivering a baby half-way outside of the womb in order to kill it is at least as barbaric as electrocuting a dog for losing a dog fight. That is an obvious fact.", 
   {}, 
   281083, 
   null, 
   1188266760.0
  ], 
  [
   281094, 
   null, 
   "thelmoose", 
   "They obviously do with respect to the procedure in question. And since no one on here has ever bothered to explain what they mean by a \"right,\" I'll simply deny that a female has the right to have an abortion.\n\n \n Well isn't that convenient? That's an argument?\n How about if I \"simply\" claim they do have a right?\n \n \nI already said that the ban doesn't apply to instances where the procedure is needed to save maternal life. So, we are talking about instances where it is not necessary to save maternal life. The procedure is barbaric, and most people agree with that.\n \n The fact that \"the people\" have limited medical knowledge is irrelevant. Suppose the people have limited medical knowledge about wildlife or the environment. Does this, then, prevent them from making laws to preserve wildlife or the environment? No.\n \n Let me guess: by preventing medical doctors from performing partial birth abortions? Or by preventing medical doctors from performing any abortions?\n\n \n Again with the irrelevant \"save a maternal life\". Do you simply ignore the facts presented to you? The issue is that this is the safest procedure under certain conditions. That is the issue. Laws have been passed that prevent physicians from doing what's best and safest for their patients. \n \n Having limited knowledge is extremely relevant. You said yourself that experts testified about IDX during the original legislative debates. They happened to be know-nothing anti-science XXXXXX, but apparently expert testimony is important to you. Of course legislators rely on experts for a great many things that they, like you, know little about, including wildlife and the environment. \n \n And the Dark Ages reference was implying that we cannot let ignorance of science occur because of religion. \n \n \nNo, the analogy runs this way: Mike Vick is going to spend some time for his involvement in dog fighting. What he was involved in was cruel. It was, in fact, barbaric.\n \n Involving oneself in the process of delivering a baby half-way outside of the womb in order to kill it is at least as barbaric as electrocuting a dog for losing a dog fight. That is an obvious fact.\n\n \n Just because you want to call something a fact or obvious doesn't make it so. Barbaric is \"obviously\" a subjective term. Have you abandoned facts other than the ones you declare to be so by personal fiat? Abortion, like many medical procedures, many seem unseemly to the layperson who is unaccustomed to such things. \n \n You seem to pride yourself, obviously undeservedly, in being this bastion of logic. Please try to address the facts presented to you and avoid resorting to sensationalism like calling a fetus a baby, using inaccurate and emotional terms like partial birth abortion, or bringing up ridiculous comparisons to dog-fighting.", 
   {}, 
   281092, 
   null, 
   1188268920.0
  ], 
  [
   281095, 
   null, 
   "chemist99a", 
   "I already said that the ban doesn't apply to instances where the procedure is needed to save maternal life. So, we are talking about instances where it is not necessary to save maternal life. The procedure is barbaric, and most people agree with that. \n\n \n So how do you define \"saving\" the maternal life Phyllis - does reducing risk to the woman to something more acceptable than otherwise fit within you concept? Or are you willing to accept higher risks than say 20% or so of mortality. How about risk of damage to her reproductive functions? How about a 20% risk that she will not have children if the procedure is not used? Where do you draw the line Phyllis? As to barbaric - well hows that relevant? Especially when MOST people do not have sufficient knowledge to draw an informed conclusion! MOST people used to believe the earth was flat - so what?\n \n \n\n The fact that \"the people\" have limited medical knowledge is irrelevant. .....\n\n \n OK then next time you need a doctor just stop somebody on the street randomly selected and ask what you should do - and then have them do the surgery or write the perscription for ya! Or else hold a town meeting and take a vote giving the janitor and the marketing guy, and the insurance agent, and the car salesman, and the villigage priest, and the idiot the same weight as your physician.\n \n Hey its your neck. But Phyllis if you mandate this type of approach I will rebel to keep you hands and blade from cutting my throat - you can cut yours but keep away from mine.", 
   {}, 
   281091, 
   null, 
   1188269040.0
  ], 
  [
   281098, 
   null, 
   "thecap0", 
   "Phyl,\n \n I'll simply deny that a female has the right to have an abortion.\n \n Let me explain something to you, sweetie.\n You can deny all you want for the women in your family.\n You may, like Luther, believe that women should have babies till they're dead of it.\n You may practice your absurd belief all you want within the privacy of your own family. No one will ever force any of your family to terminate a pregnancy against their will.\n Just keep your filthy hands off the women in my family!\n They are perfectly capable of making their own choices.\n They are what they were raised to be - proud, strong, reasoning, active women.\n Do I make myself clear?emoticon_xangel", 
   {
    "post_info": {
     "post_title": "Lifde is too short to live it in Texas!"
    }
   }, 
   281095, 
   null, 
   1188271560.0
  ], 
  [
   281104, 
   null, 
   "Steeeeve", 
   "Phyl,\n \n I'll simply deny that a female has the right to have an abortion.\n \n Let me explain something to you, sweetie.\n You can deny all you want for the women in your family.\n You may, like Luther, believe that women should have babies till they're dead of it.\n You may practice your absurd belief all you want within the privacy of your own family. No one will ever force any of your family to terminate a pregnancy against their will.\n Just keep your filthy hands off the women in my family!\n They are perfectly capable of making their own choices.\n They are what they were raised to be - proud, strong, reasoning, active women.\n Do I make myself clear?emoticon_xangel\n\n \n See Another Opinion, this screwed up logic is more common than you think!", 
   {}, 
   281098, 
   null, 
   1188273660.0
  ], 
  [
   281115, 
   null, 
   "Phyllis", 
   "Well isn't that convenient? That's an argument?\n How about if I \"simply\" claim they do have a right?\n\n I am making a very particular point with what I said here. My point is that I rarely see anyone defend the statement, \"Such and such is a right.\" Even explicit inquiry as to that question is continuously ignored. Don't believe me? Check out the following: Why isn't X a right? (Is the Constitution the basis of rights? (So the basis of rights is the Constitution? ([URL=\"http://www.4forums.com/political/280032-post324.html); \n \n Contrast that with my rather explicit and non-evasive answer to the question, \"Where do rights come from?\" [URL=\"http://www.4forums.com/political/showpost.php?p=280108&postcount=344\"]Rights are given by the Creator of men[/URL].\n \n Now, it is common to hear everyone claim that such-and-such is a right. The conversation has devolved to the point where I don't know what someone means when they say that. So go ahead and \"simply claim that X is a right.\" If that is all that is going to be said, then it is a perfectly adequate response to simply say, \"X is not a right.\"\n \n \nAgain with the irrelevant \"save a maternal life\". Do you simply ignore the facts presented to you? The issue is that this is the safest procedure under certain conditions. That is the issue. Laws have been passed that prevent physicians from doing what's best and safest for their patients.\n\n \n I don't suppose the saving of maternal life to be irrelevant. It so happens that people might have reservations about banning a procedure that does not have a life exception. This happens not to be the case in this ban.\n \n And since there is an exception for saving the life of the mother, this ban only can apply to abortions for health (broadly defined) reasons or elective reasons.\n \n Now, there is no reason to think that it is always the case that physicians must always be allowed to do what they believe to be the safest procedure, especially when one considers the presence of another patient. Second trimester is starting to push the ethical limit for many people, not simply pro-life activists. Like me, many people think that if you're going to induce labor to the point that the fetus is half-way out of the mother's body, then one should go ahead and deliver the fetus entirely. In the rare instance where a PBA would need to be done for the purpose of saving the mother's life, the ban does not apply. It matters not if the procedure is the safest procedure as there is no right to obtain the safest procedure.\n \n \nHaving limited knowledge is extremely relevant. You said yourself that experts testified about IDX during the original legislative debates. They happened to be know-nothing anti-science XXXXXX, but apparently expert testimony is important to you. Of course legislators rely on experts for a great many things that they, like you, know little about, including wildlife and the environment.\n\n And the point was, then, that if legislators are permitted to legislate on wildlife issues and environmental issues in spite of the fact that they may know very little about it, then they are likewise permitted to legislate on medical issues in spite of the fact that they know very little about it. Do you see the logical connection there?\n \n \nAnd the Dark Ages reference was implying that we cannot let ignorance of science occur because of religion.\n\n Science, as a discipline, cannot provide any grounds for ethics. It can get us material facts, but it cannot get us metaphysical ethics. I believe in a right and wrong, and thus I believe science should be subject to ethical scrutiny.\n \n \n \nJust because you want to call something a fact or obvious doesn't make it so. Barbaric is \"obviously\" a subjective term. Have you abandoned facts other than the ones you declare to be so by personal fiat? Abortion, like many medical procedures, many seem unseemly to the layperson who is unaccustomed to such things.\n\n And you have subtly changed the scope of my analogy. I did not call abortion generally barbaric; I called Partial Birth Abortion barbaric. Delivering a fetus half-way out of the womb and then suctioning its brains out is barbaric.\n \n \nYou seem to pride yourself, obviously undeservedly, in being this bastion of logic. Please try to address the facts presented to you and avoid resorting to sensationalism like calling a fetus a baby, using inaccurate and emotional terms like partial birth abortion, or bringing up ridiculous comparisons to dog-fighting.\n\n I don't pride myself in anything. I simply write what I think. The fact is that Congress invented a term (Partial Birth Abortion) and defined that word explicitly in its legislation. The abortion procedure banned in that act does not ban intact D&E wholesale. So saying that Congress banned intact D&E is actually wrong. It is not factual. They defined very specifically a procedure and labeled that procedure \"Partial Birth Abortion.\"\n \n As for calling a fetus a baby, I think in this instance it is justified. In the banned procedure the fetus is delivered half-way out of the mother's body before it is killed. For me that is beyond question.\n \n If one finds Mike Vick's dogfighting endeavors outrageous, but does not find Partial Birth Abortion to be equally outrageous, then one has lost their moral compass.", 
   {}, 
   281094, 
   null, 
   1188277080.0
  ], 
  [
   281117, 
   null, 
   "chemist99a", 
   "Now, there is no reason to think that it is always the case that physicians must always be allowed to do what they believe to be the safest procedure, especially when one considers the presence of another patient.\n \n \n But there is not a second patient, there is only a fetus which is the property of the patient. You have a human being and a set of tissues and organs which may be detrimental to the patient. And SHOULD the physician NOT use the procedure which he believes will present the least chance of harming the patient he will in general be violating his own ethical standards {First do no harm - remember that?}\n \n \nSecond trimester is starting to push the ethical limit for many people, not simply pro-life activists. Like me, many people think that if you're going to induce labor to the point that the fetus is half-way out of the mother's body, then one should go ahead and deliver the fetus entirely. In the rare instance where a PBA would need to be done for the purpose of saving the mother's life, the ban does not apply. It matters not if the procedure is the safest procedure as there is no right to obtain the safest procedure.\n\n \n So you are allowed to override your physicans judgement and not have such a procedure. Just keep the fetus after whatever they do to you is over - if of course you live and the fetus becomes a child. BUT the one thing which you are not going to do is to force others to your will on this matter. Have you ever encountered the concept of civil disobedience? Do you realize that medical procedures are covered rather deeply with curtains of privacy? And are you well aware that there is more than one way of skinning a cat?", 
   {}, 
   281115, 
   null, 
   1188277620.0
  ], 
  [
   281118, 
   null, 
   "chemist99a", 
   "Science, as a discipline, cannot provide any grounds for ethics. It can get us material facts, but it cannot get us metaphysical ethics. I believe in a right and wrong, and thus I believe science should be subject to ethical scrutiny.\n\n \n Including apparently scrutiny based on blind ignorance I suppose? You realize that approach is dangerous do you not - consider the scrutiny given to the O-ring problem on the space shuttle before the disaster!", 
   {}, 
   281117, 
   null, 
   1188277800.0
  ], 
  [
   281119, 
   null, 
   "chemist99a", 
   "And you have subtly changed the scope of my analogy. I did not call abortion generally barbaric; I called Partial Birth Abortion barbaric. Delivering a fetus half-way out of the womb and then suctioning its brains out is barbaric.\n\n \n However cutting it to pieces and suctioning it all out is civilized in your humble opinion. How about simply readjusting its position in the uterus then puncturing its skull and suctioning the brain out and then removing the resulting tissues like they do with gallbladders? Is it OK with you as long as no part actually emerges from the womans body while the fetus is relatively intact? Do you consider that barbaric or not?", 
   {}, 
   281118, 
   null, 
   1188277980.0
  ], 
  [
   281120, 
   null, 
   "Phyllis", 
   "So how do you define \"saving\" the maternal life Phyllis - does reducing risk to the woman to something more acceptable than otherwise fit within you concept? Or are you willing to accept higher risks than say 20% or so of mortality. How about risk of damage to her reproductive functions? How about a 20% risk that she will not have children if the procedure is not used? Where do you draw the line Phyllis? As to barbaric - well hows that relevant? Especially when MOST people do not have sufficient knowledge to draw an informed conclusion! MOST people used to believe the earth was flat - so what?\n\n I think we've gone over this in another thread. These situations can only be evaluated on a case by case basis because each situation is going to be unique. The physician's best judgment (unless he has been shown to abuse it) is what we have to go with here. I certainly do not think that all health (broadly defined) reasons constitute life-saving circumstances.\n \n \nOK then next time you need a doctor just stop somebody on the street randomly selected and ask what you should do - and then have them do the surgery or write the perscription for ya! Or else hold a town meeting and take a vote giving the janitor and the marketing guy, and the insurance agent, and the car salesman, and the villigage priest, and the idiot the same weight as your physician.\n \n Hey its your neck. But Phyllis if you mandate this type of approach I will rebel to keep you hands and blade from cutting my throat - you can cut yours but keep away from mine.\n\n I can make anyone say anything using their own words and a few carefully placed ellipses. I think I'll try it out.\n \n \nI will...admit that...I...decapitated...a body. \n\n Fun huh? Let's try another.\n \n \nthe US...eventually...derived...religious edicts...from...the constitution.\n\n Hey, that's surprising.\n \n You deliberately twist and turn my words around, cutting off sentences here and there so that you can respond to an argument that I did not make. That's called a strawman. You do this in all my discussions with you. You twist my words to say something they didn't all the while being extremely careful not to actually answer anyone's inquiries as to your views. It's probably easy to respond to points that no one made. It's easy to build a strawman, and it is easy to set a strawman on fire. But in a debate, erecting and burning a strawman is cowardly.\n \n The response was critiquing a particular logical progression. The suggestion was that \"the people\" should not be legislating issues in the medical field because they are not experts in the field. If that logic is valid as applied to the medical field, then it likewise would be sound as it applies to the wildlife and environmental arena. And many, many others. The logic is not valid.", 
   {}, 
   281095, 
   null, 
   1188278820.0
  ], 
  [
   281121, 
   null, 
   "chemist99a", 
   "I think we've gone over this in another thread. These situations can only be evaluated on a case by case basis because each situation is going to be unique. The physician's best judgment (unless he has been shown to abuse it) is what we have to go with here. I certainly do not think that all health (broadly defined) reasons constitute life-saving circumstances.\n\n \n And thats the rub isn't it? Who decides in the end Phyllis? Does the physician have to call his senator or congressmen or a federal agency to obtain an official assessment, or can he decide on his own professional competence? Or does he have to contact you perhaps? And if he DOES make a judgement which is later disputed by say the husband or an ex or a parent. Then what kind of a pickle does that create for him when he acted honestly?", 
   {}, 
   281120, 
   null, 
   1188279120.0
  ], 
  [
   281122, 
   null, 
   "chemist99a", 
   "I can make anyone say anything using their own words and a few carefully placed ellipses. I think I'll try it out.\n\n \n You can do even better if you take individual letters and reassemble them. But whats the point of doing so. I try to quote you accurately and provide where I feel its appropriate counter arguments.", 
   {}, 
   281121, 
   null, 
   1188279240.0
  ], 
  [
   281123, 
   null, 
   "Phyllis", 
   "But there is not a second patient, there is only a fetus which is the property of the patient. You have a human being and a set of tissues and organs which may be detrimental to the patient. And SHOULD the physician NOT use the procedure which he believes will present the least chance of harming the patient he will in general be violating his own ethical standards {First do no harm - remember that?}\n\n Sure, I remember that principle. And as that principle is credited to Hippocrates, I think it appropriate to recite another one of his ethical principles: \"Nor will I give a woman a pessary to procure abortion.\"\n \n \nSo you are allowed to override your physicans judgement and not have such a procedure. Just keep the fetus after whatever they do to you is over - if of course you live and the fetus becomes a child. BUT the one thing which you are not going to do is to force others to your will on this matter.\n\n Too late. You already lost this one. The procedure has been banned.\n \n \nHave you ever encountered the concept of civil disobedience? Do you realize that medical procedures are covered rather deeply with curtains of privacy? And are you well aware that there is more than one way of skinning a cat?\n\n Yes, which is why I have not stopped my efforts after the Partial Birth Abortion Ban Act of 2003.\n \n \nIncluding apparently scrutiny based on blind ignorance I suppose? You realize that approach is dangerous do you not - consider the scrutiny given to the O-ring problem on the space shuttle before the disaster!\n\n Science must stay within ethical guidelines no matter how much good might potentially come if it did not have such guidelines. Performing destructive scientific experiments on human beings cannot be permitted. Remember the Nazis?\n \n \nHowever cutting it to pieces and suctioning it all out is civilized in your humble opinion. How about simply readjusting its position in the uterus then puncturing its skull and suctioning the brain out and then removing the resulting tissues like they do with gallbladders? Is it OK with you as long as no part actually emerges from the womans body while the fetus is relatively intact? Do you consider that barbaric or not?\n\n Yes, that is barbaric.\n \n \nI try to quote you accurately and provide where I feel its appropriate counter arguments.\n\n You certainly do not painstakingly try to quote me accurately. I spend most of my time correcting the record than I do anything else when discussing with you. Makes me wonder why I even bother discussing with you.", 
   {}, 
   281117, 
   null, 
   1188279420.0
  ], 
  [
   281124, 
   null, 
   "chemist99a", 
   "The response was critiquing a particular logical progression. The suggestion was that \"the people\" should not be legislating issues in the medical field because they are not experts in the field. If that logic is valid as applied to the medical field, then it likewise would be sound as it applies to the wildlife and environmental arena. And many, many others. The logic is not valid.\n\n \n Ah but the logic of ignoring experts is also invalid. For example the experts on WMD said that SH had none that presented any threat. We now have 3500 plus dead and 10 times that number badly wounded as a result. There is no use in trying to defend a process which goes against the best informed opinion and expert assessment which one can obtain. In the case of PBA the professionals have made their collective voice heard - but not in the halls of power it appears. Alas telling truth to power is still an unreliable means of communication.", 
   {}, 
   281122, 
   null, 
   1188279480.0
  ], 
  [
   281126, 
   null, 
   "chemist99a", 
   "http://www.nytimes.com/2007/08/28/science/28biop.html?8dpc\n \n Is the kind of situation Phyllis and friends will eventually create for competent physicians. Who knows if any here will be able to obtain timely medical care in the face of such chilling influences. Or whether any research (like stem cell work) will be possible in such circumstances? Most probably not.", 
   {}, 
   281123, 
   null, 
   1188279960.0
  ], 
  [
   281127, 
   null, 
   "chemist99a", 
   "Science must stay within ethical guidelines no matter how much good might potentially come if it did not have such guidelines. Performing destructive scientific experiments on human beings cannot be permitted. Remember the Nazis?\n\n \n No, but my father did help liberate one of the camps. Bear in mind that the Nazis like yourself thought themselves the ones who should establish and implement the proper ethical guidelines and then enforce them on others rigidly. And what you propose does in fact amount to performing an ill-advised scientific experiment on the patients which you deny access to safer medical procedures. You are quite literally playing GOD in this instance as is Congress. The birds will come home to roost eventually.", 
   {}, 
   281123, 
   null, 
   1188280320.0
  ], 
  [
   281142, 
   null, 
   "chemist99a", 
   "http://www.nytimes.com/2006/09/03/health/03gene.web.html?ex=1188446400&en=c472a495b5a752b6&ei=5070\n \n Small question to the pro-lifers on the board. How many of you would accept this familys approach to their reproductive future - they are eliminating an inherited gene for cancer from their line. Is abortion allowed or not?", 
   {}, 
   281127, 
   null, 
   1188292980.0
  ], 
  [
   281310, 
   null, 
   "Shooterandproud", 
   "I already said that the ban doesn't apply to instances where the procedure is needed to save maternal life. So, we are talking about instances where it is not necessary to save maternal life. The procedure is barbaric, and most people agree with that.\n\n \n Actually, last time I checked, the ban did not allow for medical reasons.\n \n \n \nThe fact that \"the people\" have limited medical knowledge is irrelevant. Suppose the people have limited medical knowledge about wildlife or the environment. Does this, then, prevent them from making laws to preserve wildlife or the environment? No.\n\n \n Both of these things are not nearly as mysterious or complex than the human body.\n \n \n \n \nLet me guess: by preventing medical doctors from performing partial birth abortions? Or by preventing medical doctors from performing any abortions?\n\n \n Is that your best response to my analogy?", 
   {}, 
   281091, 
   null, 
   1188354420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why was every medical association in the U.S. against the partial birth abortion ban?", 
  "url": "http://www.4forums.com/political/abortion-debates/10262-why-every-medical-association-u-s-against-partial-birth-abortion-ban.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 10262, 
  "discussion_files": [
   [
    "21259.html", 
    "http://www.4forums.com/political/abortion-debates/10262-why-every-medical-association-u-s-against-partial-birth-abortion-ban-print.html"
   ], 
   [
    "21260.html", 
    "http://www.4forums.com/political/abortion-debates/10262-why-every-medical-association-u-s-against-partial-birth-abortion-ban-4-print.html"
   ], 
   [
    "21261.html", 
    "http://www.4forums.com/political/abortion-debates/10262-why-every-medical-association-u-s-against-partial-birth-abortion-ban-3-print.html"
   ], 
   [
    "21262.html", 
    "http://www.4forums.com/political/abortion-debates/10262-why-every-medical-association-u-s-against-partial-birth-abortion-ban-2-print.html"
   ]
  ], 
  "identifier": 10262
 }
]