[
 [
  [
   279581, 
   null, 
   "chemist99a", 
   "Mickey Has Two Mommies\n \n By Constance Holden With reporting by Gretchen Vogel.\n ScienceNOW Daily News\n 20 August 2007\n \n Sharks and some reptiles do it, but no mammal has ever been successfully replicated through parthenogenesis: birth from an egg that has not been fertilized by sperm. Now, a Japanese team has figured out how to overcome nature's obstacles and has generated apparently normal mice by combining the genomes of two mouse eggs. The trick is in reprogramming one of the eggs to make it act more like sperm.\n \n Unfertilized mouse eggs can be prompted to divide in the lab, but the resulting embryos can't make a placenta and thus die in the womb well before birth. Scientists say that's because the embryo is missing the male element. Each chromosome contains genes that are imprinted; that is, they are specifically turned off or on depending on whether they were inherited from the mother or the father. Expression of both maternal- and paternal-imprinted genes are necessary for a mammalian fetus to be brought to term.\n \n A team led by Tomohiro Kono at Tokyo University of Agriculture in Japan has now shown that once the imprinting problem is overcome, it is possible for two apparently normal female mice to produce offspring. The researchers found that there are two important regions for paternal imprinting, on chromosomes 7 and 12. So they bred mutant mice in which the imprinting-control regions for these genes were deleted, allowing them to be expressed the way they would be in the male genome. The scientists then took immature eggs from newly born mutant mice and inserted their nuclei into normal mouse eggs.\n \n Once the artificially \"fertilized\" eggs began dividing into the hollow balls of cells known as blastocysts, Kono's team inserted them into female mice. Twenty-seven \"bimaternal\" mice survived to adulthood--a success rate similar to that of in vitro fertilized embryos, the team reports online 19 August in Nature Biotechnology. The adult mice were healthy and fertile.\n \n It's remarkable that one need only modify two small regions of the genome to make an egg genetically behave like a sperm, says developmental geneticist Anne Ferguson-Smith of the University of Cambridge, U.K., a co-author of the paper. So could such a technique potentially enable two women to have a biological baby? Out of the question, says Ferguson-Smith, who points out that one of the women would have to be a mutant to donate the necessary genetically altered oocyte. Still, the technology should give scientists a new tool for better understanding how parental imprinting works and just how sperm contributes to development, she says.\n \n But Davor Solter of the Max Planck Institute of Immunobiology in Freiburg, Germany, warns that the story is still quite complicated. Because the mutant oocytes were immature, he says, it is likely that they retained some of the imprinting from the mutant mouse's father. That would confuse any attempts to pin down exactly which imprinted genes are truly crucial for normal development.", 
   {
    "post_info": {
     "post_title": "Will gay women eventually be all thats left?"
    }
   }, 
   null, 
   null, 
   1187667960.0
  ], 
  [
   279597, 
   null, 
   "Bassman", 
   "Oh joy emoticon_xdonno Genetic engineering at its best...\n \n \n \n ...Not!", 
   {}, 
   279581, 
   null, 
   1187670720.0
  ], 
  [
   279680, 
   null, 
   "jitobear", 
   "Seems like an awful lots of work to replicate something that is hardly in danger of not being done otherwise.", 
   {}, 
   279597, 
   null, 
   1187707200.0
  ], 
  [
   279692, 
   null, 
   "lesz", 
   "Very interesting! If these results are replicated and genomic imprinting were fairly simple to reverse (probably it won't be, but let's speculate), then the usual idiotic homophobic arguments that gays shouldn't be allowed to marry because same sex couples can't procreate with each other would evaporate! Still, I'll refrain from emoticon_xbouncer :) Long way to go here, with many ethical considerations.\n \n The ethical problems aren't with cloning itself, though, or using novel ways of making an embryo. There's nothing intrinsically unethical about that, except to religious old fogey's who think that only the missionary position is natural and contraception is ungodly. Leave it all up to nature, they whine, except the bits they'd rather not be left up to nature. What nature has ordained, let no man heal or improve. Except when it suits the religious believer.", 
   {}, 
   279680, 
   null, 
   1187709840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Will gay women eventually be all thats left?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10260-will-gay-women-eventually-all-thats-left.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10260, 
  "discussion_files": [
   [
    "8892.html", 
    "http://www.4forums.com/political/gay-rights-debates/10260-will-gay-women-eventually-all-thats-left-print.html"
   ]
  ], 
  "identifier": 10260
 }
]