[
 [
  [
   280083, 
   null, 
   "bertvan", 
   "Volition, or free will, is the defining characteristic of life. All living systems appear to have some limited choice about how to respond. They respond in ways that are only statistically predictable. They are capable of surprising us. Some materialists claim free will is an illusion, doesn't actually exist. They insist that what we see as spontaneous responses are merely chemical reactions and deterministic brain interactions. Other materialists acknowledge the reality of free will but claim science cannot deal with such unpredictable phenomena. They insist that science must pretend volition plays no real role in the real world of molecules and atoms. If biology must close its eyes to the defining characteristic of life, such biology is not science. It is a creation myth for materialists.\n \n P.S. For some reason I am unable to reach my other post \"What drive evolution?\" I am always \"timed out\" and my computer is cut off from the wet site. So I'll start over here.", 
   {
    "post_info": {
     "post_title": "Does free will exist?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1187889480.0
  ], 
  [
   280087, 
   null, 
   "sinjin", 
   "The question of \"free will\" hardly applies to non-sentient matter IMO. Volition of atoms? Patently absurd.", 
   {}, 
   280083, 
   null, 
   1187890320.0
  ], 
  [
   280090, 
   null, 
   "N.Wells", 
   " Volition, or free will, is the defining characteristic of life. \n\n That sounds like an admirably simple and straightforward definition. Indeed, if it works, it should be able to resolve a long standing controversy. So are viruses alive or not alive? And how do we tell (what about a virus do we observe to test for the presence of free will)? \n \n Also, can you explain volition as it applies to lichen, oak trees, and mushrooms?\n \n At least this time you said \"some\" in \"Some materialists claim free will is an illusion, doesn't actually exist. They insist that what we see as spontaneous responses are merely chemical reactions and deterministic brain interactions.\"\n \n Scientists may be methodological materialists in their work, but very few extend that all the way to denying that people have free will. I have no idea where free will starts, but I'm happy identifying effective free will in animals like dogs. As an idle observation rather than as a carefully considered conclusion, I offer the following: the other day I was behind a car in which a medium-size dog was contorting itself against the back seat and stretching to stick its head out the sunroof and face forward into the airstream. I suppose the dog could have been giving in to some sort of deep genetic instinct whereby wind in the face triggers the same responses as running which has been genetically predetermined as a desirable result, but it seemed more to me like the dog was just doing optional behavior for fun. (So is the dog's definition of fun genetically predetermined .......? - heck if I know).\n \n At the same time, it is clear that somewhere between some of the things that people do and some of the impulses that arise do indeed reflect deterministic genetic, physiological, and mental patterns. \n \n \n \n With respect to your computer cutting off - it's probably following its predetermined programming. Perhaps open the case and install a better or stronger free-will card.", 
   {
    "unicode_changes_made": true
   }, 
   280087, 
   null, 
   1187893020.0
  ], 
  [
   280100, 
   null, 
   "charlie horse", 
   "Would it be appropriate to define what free will actually is? How would any life form know if/that it was exercising free will unless it was sentient? Surely will relates to a state of consciousness/sentience/awareness, as opposed to instinctive behaviour. And if a fly ducks out of the way of a fly swat, is it survival instinct, or instinct + desire to keep out of the way i.e. will?\n \nThey insist that science must pretend volition plays no real role in the real world of molecules and atoms. If biology must close its eyes to the defining characteristic of life, such biology is not science. It is a creation myth for materialists.\n\n Who promotes that the defining characteristic of life is volition? If it was a defining characteristic of life, where would that leave life forms that weren't sentient or self-aware, or survived by instinct alone?", 
   {}, 
   280090, 
   null, 
   1187896140.0
  ], 
  [
   280101, 
   null, 
   "Kronus", 
   "Volition, or free will, is the defining characteristic of life. All living systems appear to have some limited choice about how to respond. They respond in ways that are only statistically predictable.\n\n All living things? I don't see that at all. Certainly animals with advanced nervous systems have some degree of free will, but plants or bacteria? I don't see how you can say they have volition. We might not be able to predict with 100% accuracy what every living thing will do in any given situation, but that doesn't imply free will. That's just a characteristic of any non-linear system; you can't predict the outcome unless you know all the input variables to a arbitrarily high accuracy.\n \n \n\n They insist that science must pretend volition plays no real role in the real world of molecules and atoms. \n\n That's not pretending, that's reality. Did you miswrite that, or are you actually claiming that atoms think and decide, to some degree or another?\n \n \n\n If biology must close its eyes to the defining characteristic of life, such biology is not science. It is a creation myth for materialists. \n\n Well, it doesn't, so it isn't. Biology is well aware that many things have volition, and there are whole branches of biology dedicated to studying it. Animal behavior they call it. However, biology doesn't not pretend that every living thing has volition.", 
   {}, 
   280083, 
   null, 
   1187896200.0
  ], 
  [
   280110, 
   null, 
   "wascallywabbit", 
   "That sounds like an admirably simple and straightforward definition. Indeed, if it works, it should be able to resolve a long standing controversy. So are viruses alive or not alive? And how do we tell (what about a virus do we observe to test for the presence of free will)? \n \n Also, can you explain volition as it applies to lichen, oaktrees, and mushrooms?\n \n At least this time you said \"some\" in \"Some materialists claim free will is an illusion, doesn't actually exist. They insist that what we see as spontaneous responses are merely chemical reactions and deterministic brain interactions.\"\n \n Scientists may be methodological materialists in their work, but very few extend that all the way to denying that people have free will. I have no idea where free will starts, but I'm happy identifying effective free will in animals like dogs. As an idle observation rather than as a carefully considered conclusion, I offer the following: the other day I was behind a car in which a mediumm-size dog was contorting itself against the back seat and stretching to stick its head out the sunroof and face forward into the airstream. I suppose the dog could have been giving in to some sort of deep genetic instinct whereby wind in the face triggers the same responses as running which has been genetically predetermined as a desirable result, but it seemed more to me like the dog was just doing optional behavior for fun. (So is the dog's definition of fun genetically predetermined .......? - heck if I know).\n \n At the same time, it is clear that somewhere between some of the things that people do and some of the impulses that arise do indeed reflect deterministic genetic, physiological, and mental patterns. \n \n \n \n With respect to your computer cutting off - it's probably following its pretermined programming. Perhaps open the case and install a better or stronger free-will card.\n\n \n **\n Neil, you write a post that admirably reveals the cognitive dissonance you experience thanks to your basic materialist/determinist metaphysic.\n \n Then you have to spoil it by saying something just as childish and snide as anything chemist might have come up with. Why is that? Is it impossible to be a darwinist without being a mook?", 
   {
    "unicode_changes_made": true
   }, 
   280090, 
   null, 
   1187900640.0
  ], 
  [
   280115, 
   null, 
   "wascallywabbit", 
   "Would it be appropriate to define what free will actually is?\n\n \n **\n It certainly aids our understanding when we clearly define our terms.\n \n \n\n How would any life form know if/that it was exercising free will unless it was sentient?\n\n \n **\n Two more terms needing clarification--\"know\" and \"sentient\". Contrary to the anthropomorphic view, 'to know' does not necessarily mean, 'to be actively conscious of'. Simply 'to be unconsciously aware' will suffice. As for 'sentient', it simply means to have sense perceptions, to be aware of external stimuli and dynamically responsive to them. As such, it is not far removed from, 'to know'.\n \n \n\n Surely will relates to a state of consciousness/sentience/awareness, as opposed to instinctive behaviour.\n\n \n **\n Relates to, yes, but at all levels, not just conscious analysis. Instinctive behaviour is not mechanically driven chemical reaction. It is a 'learned' _systemic_ behaviour that has been rendered 'automatic', or 'inherently habitual', but one that that does not arise out of mere chemistry, undirected and purposeless. Autopoietic systems, as live organisms, harness lots of chemical reactions to their purposes, and that takes intelligence, volition, and energy. Habitualizing certain behaviours, from simple internal chemical reactions to complex organismic behaviours, [such as migration, hive building, and whatnot], saves energy and increases systemic productivity. That's why we see so much of it in biology. But being systemically automatic does not render it deterministically mechanical. That which was built by volition, such as 'instinctive behaviour', always retains susceptible to change. Nothing that is mechanically deterministic can ever be altered. Instinctive behaviour is not mechanically determined. Anything that is not random, accidental, and unintentional, and/or is not mechanically determined, is not totally involuntary. Therefore it is at least partially volitional/voluntary.\n \n \n\n And if a fly ducks out of the way of a fly swat, is it survival instinct, or instinct + desire to keep out of the way i.e. will?\n\n \n **\n All of the above. Yours is a false dichotomy.]\n \n \n\n Who promotes that the defining characteristic of life is volition? If it was a defining characteristic of life, where would that leave life forms that weren't sentient or self-aware, or survived by instinct alone?\n\n \n **\n Well, since such imaginary entities never existed, being oxymoronic contradictions in terms, the question is beside the point.", 
   {}, 
   280100, 
   null, 
   1187902440.0
  ], 
  [
   280117, 
   null, 
   "N.Wells", 
   " you write a post that admirably reveals the cognitive dissonance you experience thanks to your basic materialist/determinist metaphysic.\n\n No dissonance - you just can't see past your strawmen. I'm a methodological naturalist, not a strict determinist, and I consider that free-will and volition are gradually emergent properties. \n \n \nThen you have to spoil it by saying something just as childish and snide as anything chemist might have come up with. Why is that? Is it impossible to be a darwinist without being a mook?\nWhat, I can't try to make a joke? And, while I certainly do snide once in a while, how was that snide? I agree that we don't all share your wit (fortunately), but does that mean we can't once in a while try for a little comic relief other than you?", 
   {}, 
   280110, 
   null, 
   1187902860.0
  ], 
  [
   280120, 
   null, 
   "charlie horse", 
   "And if a fly ducks out of the way of a fly swat, is it survival instinct, or instinct + desire to keep out of the way i.e. will?\n\n \n**\n All of the above. Yours is a false dichotomy.\n\n It would be if I was making an argumentative statement in rebuttable. However, I've simply asked a question in response to the OP.\n \n \nWho promotes that the defining characteristic of life is volition? If it was a defining characteristic of life, where would that leave life forms that weren't sentient or self-aware, or survived by instinct alone?\n\n \n**\n Well, since such imaginary entities never existed, being oxymoronic contradictions in terms, the question is beside the point.\n\n Please explain what these imaginary entities are, and why consequently they are oxymoronic contradictions in terms. Will you keep it simple for the man on the Clapham omnibus who doesn't have your in-depth knowledge on this subject, but is simply trying to understand by asking questions of the OP? Many thanks.", 
   {}, 
   280117, 
   null, 
   1187904840.0
  ], 
  [
   280123, 
   null, 
   "prschuster", 
   "It would be nice if someone actually defined \"free will\" so we could argue about the same thing. I personally consider will to be subjective. It's an experience and function of consciousness. It's beyond the scope of empirical science because it can't be tested for. I have free will because I experience it, but no one else could possibly determine whether my actions were mediated by my will or just a function of my neural circuits. Just becuase science cannot address this issue, it doesn't follow that biology is being manipulated by \"Darwinist\" materialist ideologues.", 
   {}, 
   280117, 
   null, 
   1187905260.0
  ], 
  [
   280128, 
   null, 
   "charlie horse", 
   "Perhaps bertvan could assign a meaning to free will in the context of the OP, seeing that it's a defining characteristic of life.", 
   {}, 
   280123, 
   null, 
   1187905680.0
  ], 
  [
   280142, 
   null, 
   "wascallywabbit", 
   "**\n \n I would define volition as an inherent dynamism, characteristic of autopoietic systems, i.e., live organisms.\n \n dynamism--A process or mechanism responsible for the development or motion of a system. answers.com\n \n That system which is intrinsically dynamic [self-controlled and self-serving] possesses volition. That system which which is intrinsically passive [other-controlled and other-serving, or simply ateleological and purposeless], is involuntary and without volition. Particles, non-functional sub-systems, and totally disabled autopoietic systems [i.e., dead organisms], do not possess volition.", 
   {}, 
   280128, 
   null, 
   1187908860.0
  ], 
  [
   280146, 
   null, 
   "wascallywabbit", 
   "\n Quote:\n Originally Posted by charlie... \n And if a fly ducks out of the way of a fly swat, is it survival instinct, or instinct + desire to keep out of the way i.e. will? \n \n Quote:\n Originally Posted by ww \n **\n All of the above. Yours is a false dichotomy. \n \n It would be if I was making an argumentative statement in rebuttable. However, I've simply asked a question in response to the OP.\n\n \n **\n Wrong. A dichotomy is a dichotomy, no matter whether you use the declarative or interrogative mood when expressing it..\n \n \n\n Quote:\n Originally Posted by charlie... \n Who promotes that the defining characteristic of life is volition? If it was a defining characteristic of life, where would that leave life forms that weren't sentient or self-aware, or survived by instinct alone? \n \n Quote:\n Originally Posted by ww \n **\n Well, since such imaginary entities never existed, being oxymoronic contradictions in terms, the question is beside the point. \n \n Please explain what these imaginary entities are, and why consequently they are oxymoronic contradictions in terms.\n.\n \n **\n Since the answer is self-evident, there is no explanation. You cannot explain facts. They simply ARE. And the fact is, that without volition life is impossible, and wherever there is life, there is volition. It is impossible to be alive without it. And it is equally impossible to have it, but not be alive.\n See my definition of 'volition' [or-- 'will', 'intentionality', 'motivation', 'drive', 'ability of an autopoietic system to control and alter its own behaviour', autopoiesis, etc.].\n \n \n \"autopoiesis \n Autopoiesis literally means \"auto (self)-creation\" (from the Greek: auto - &#945;&#965;&#964;&#972; for self- and poiesis - &#960;&#959;&#943;&#951;&#963;&#953;&#962; for creation or production) and expresses a fundamental dialect between structure and function. The term was originally introduced by Chilean biologists Humberto Maturana and Francisco Varela in 1973:\n \n \"An autopoietic machine is a machine organized (defined as a unity) as a network of processes of production (transformation and destruction) of components which: (i) through their interactions and transformations continuously regenerate and realize the network of processes (relations) that produced them; and (ii) constitute it (the machine) as a concrete unity in space in which they (the components) exist by specifying the topological domain of its realization as such a network.\" (Maturana, Varela, 1980, p. 78)\" \"\n \n see wikipedia.\n \n \n\n Will you keep it simple for the man on the Clapham omnibus who doesn't have your in-depth knowledge on this subject, but is simply trying to understand by asking questions of the OP? Many thanks.\n\n \n **\n The above is simple enough for most bus riders, I should expect. Does it work for you?", 
   {}, 
   280142, 
   null, 
   1187910240.0
  ], 
  [
   280147, 
   null, 
   "N.Wells", 
   "Seems that a corpse undergoing decomposition because it is being attacked and digested by its own enzymes constitutes a relatively dynamic system. (In a separate and slightly more macabre vein, there's quite a literature on corpses being surprisingly active due to decomposing and degassing.) In contrast, deep-frozen sperm, eggs, and blastocysts, and hearts on ice awaiting transplants seem relatively non-dynamic, disabled, nonfunctional, and lacking in volition.", 
   {}, 
   280142, 
   null, 
   1187910540.0
  ], 
  [
   280151, 
   null, 
   "wascallywabbit", 
   "Seems that a corpse undergoing decomposition because it is being attacked and digested by its own enzymes constitutes a relatively dynamic system. (In a separate and slightly more macabre vein, there's quite a literature on corpses being surprisingly active due to decomposing and degassing.) In contrast, deep-frozen sperm, eggs, and blastocysts, and hearts on ice awaiting transplants seem relatively non-dynamic, disabled, nonfunctional, and lacking in volition.\n\n \n **\n Next you'll be telling us that a nail rusting is a dynamic system.\n \n As for the rest, that which is apparent, i.e., \"seems\", is not always the actual case. In all of the above, despite temperature, there is still internal cellular autopoiesis.", 
   {}, 
   280147, 
   null, 
   1187911500.0
  ], 
  [
   280153, 
   null, 
   "N.Wells", 
   "Not to make a big point out of it, but it's not static, and it's not at equilibrium, even if it is headed there.\n \n But back to the main point: corpses have a lot more going on in them than does a frozen blastocyst.", 
   {}, 
   280151, 
   null, 
   1187912040.0
  ], 
  [
   280165, 
   null, 
   "chemist99a", 
   "Volition, or free will, is the defining characteristic of life. All living systems appear to have some limited choice about how to respond. They respond in ways that are only statistically predictable. They are capable of surprising us. \n\n \n Nope. Again you make many errors. First of all if you believe plants or viruses have free-will {which is a strictly cognitive effect} then you are up the creek without a paddle. Or else you will have to admit that a thermostat in your home exhibits free will. That is not generally what people seem to mean by the term free-will.\n \n \nSome materialists claim free will is an illusion, doesn't actually exist. They insist that what we see as spontaneous responses are merely chemical reactions and deterministic brain interactions. \n \n \n Well humans if asked will tell you that they make choices among alternatives and this they may attribute to a capability which one can call free-will. Thats all observable. The question always boils down to just what is the underlying cause or mechanism which results in this property. Some free-will advocates will claim that free-will MUST be non-deterministic since if it were not it would not be \"free\" that deterministic processes cannot lead to choice as they EXPERIENCE it. However this implies a depth of knowledge which they do not have - namely a detailed knowledge of the ins and outs of how their brain works. In addition a debatable assumption is made which is in effect that deterministic systems cannot achieve that which is being experienced. This makes the claim that the free-will advocate KNOWS the actual limits of what deterministic systems can and cannot do. Thats an assumption I am not willing to accept since nobody really knows the limits of behavior of deterministic systems. IMHO the experience of free-will is real enough, but the mechanism is materialistic and even deterministic down to its foundations. In other words IMHO deterministic processes are capable of generating the mental experience we describe as free-will.\n \n By the way - what is free-will free of exactly? You do realize that it was originally formulated to get around the problem within theology of how to separate responsibility and accountability for sin from the sinless godhead?\n \n \nOther materialists acknowledge the reality of free will but claim science cannot deal with such unpredictable phenomena. They insist that science must pretend volition plays no real role in the real world of molecules and atoms. If biology must close its eyes to the defining characteristic of life, such biology is not science. It is a creation myth for materialists.\n \n\n \n I only acknowledge the existense of the experience to which we apply the label free-will. I do not acknowledge that the experience arises from non-deterministic, non-material, or vitalist processes. My basic reasons are given above.\n \n \n \nP.S. For some reason I am unable to reach my other post \"What drive evolution?\" I am always \"timed out\" and my computer is cut off from the wet site. So I'll start over here.\n\n \n So there you have an example of a deterministic system acting to suprise you with unpredictable behavior. Consider it an example of deterministic \"free-will\"\n emoticon_xhoho", 
   {
    "unicode_changes_made": true
   }, 
   280083, 
   null, 
   1187915640.0
  ], 
  [
   280238, 
   null, 
   "charlie horse", 
   "... The above is simple enough for most bus riders, I should expect. Does it work for you?\n\n It could do as long as I ignore your obvious sarcasm.\n \n \nSee my definition of 'volition' [or-- 'will', 'intentionality', 'motivation', 'drive', 'ability of an autopoietic system to control and alter its own behaviour', autopoiesis, etc.].\n\n I notice that you say that this is YOUR definition. Can you give me a link to the bolded definition above, as my omnibus doesn't seem to stop at the same places as yours.\n \n This is what I got from various online dictionaries (you know, the sort of places the man on the Clapham omnibus would look:\n \n 1 : an act of making a choice or decision; also : a choice or decision made\n 2 : the power of choosing or determining :\n \n 1. The act or an instance of making a conscious choice or decision.\n 2. A conscious choice or decision.\n 3. The power or faculty of choosing; the will.\n \n volition\n n. act of willing; will. volitional, volitionary, a. volitive, a. pertaining to or derived from the will; Grammar, expressing desire or permission.\n \n vo·li·tion /vo&#650;&#712;l&#618;&#643;&#601;n, v&#601;-/ Pronunciation Key - Show Spelled Pronunciation[voh-lish-uhn, vuh-] Pronunciation Key - Show IPA Pronunciation\n -noun\n 1. the act of willing, choosing, or resolving; exercise of willing: She left of her own volition.\n 2. a choice or decision made by the will.\n 3. the power of willing; will.\n (synonyms being discretion and choice).\n \n In view of the above, I'm still trying to work out how volition pertains to all living things. Certainly the above definitions imply conscious effort and will. How are those faculties demonstrated in an autopoietic system, e.g. a blood cell?", 
   {
    "unicode_changes_made": true
   }, 
   280146, 
   null, 
   1187949660.0
  ], 
  [
   280287, 
   null, 
   "wascallywabbit", 
   "It could do as long as I ignore your obvious sarcasm.\n \n \n I notice that you say that this is YOUR definition. Can you give me a link to the bolded definition above, as my omnibus doesn't seem to stop at the same places as yours.\n \n This is what I got from various online dictionaries (you know, the sort of places the man on the Clapham omnibus would look:\n \n 1 : an act of making a choice or decision; also : a choice or decision made\n 2 : the power of choosing or determining :\n \n 1. The act or an instance of making a conscious choice or decision.\n 2. A conscious choice or decision.\n 3. The power or faculty of choosing; the will.\n \n volition\n n. act of willing; will. volitional, volitionary, a. volitive, a. pertaining to or derived from the will; Grammar, expressing desire or permission.\n \n vo·li·tion /vo&#650;&#712;l&#618;&#643;&#601;n, v&#601;-/ Pronunciation Key - Show Spelled Pronunciation[voh-lish-uhn, vuh-] Pronunciation Key - Show IPA Pronunciation\n -noun\n 1. the act of willing, choosing, or resolving; exercise of willing: She left of her own volition.\n 2. a choice or decision made by the will.\n 3. the power of willing; will.\n (synonyms being discretion and choice).\n \n In view of the above, I'm still trying to work out how volition pertains to all living things. Certainly the above definitions imply conscious effort and will. \n\n \n **\n No, they do not. Out of all of your citations, only these variations mention conscious analytical processes--1. The act or an instance of making a conscious choice or decision.\n 2. A conscious choice or decision.\n \n The fact of the matter is that even in human beings voluntary choices can be made without conscious analytical thought. Take a long drive someday, volitionally keep your car out of any accidents, and try to remember where and when you actually had to turn your conscious attention to the driving\n and accident prevention. You'll find that most of the time, especially on a familiar or featurless bit of road, your volition was in play, but your consciousness was somewhere else.\n \n \n\n How are those faculties demonstrated in an autopoietic system, e.g. a blood cell?\n\n \n **\n Look up 'blood cells' and look up 'autopoiesis' and figure it out for yourself. If you have spe3cific and particular difficulties, then bring them to my attention, but I'm not being paid to teach a course here.", 
   {
    "unicode_changes_made": true
   }, 
   280238, 
   null, 
   1187973600.0
  ], 
  [
   280313, 
   null, 
   "charlie horse", 
   "Look up 'blood cells' and look up 'autopoiesis' and figure it out for yourself. If you have spe3cific and particular difficulties, then bring them to my attention, but I'm not being paid to teach a course here.\n\n Of course not. Why should you should help anybody?\n \n I've found references to cells having cognition - not used in the everyday sense, but which I understood, but no references to cells having volition. In view of the OP, I wondered therefore where volition entered the life of the amoeba.\n \n No need to answer, as you're not being paid to teach a course. Perhaps the OP may address it if they ever get back here.", 
   {}, 
   280287, 
   null, 
   1187980500.0
  ], 
  [
   280328, 
   null, 
   "chemist99a", 
   "No need to answer, as you're not being paid to teach a course.\n\n \n And thats good to know isn't it? TEACHERS should convey something of substance to the students after all - not just disinformation unless perhaps they are working for the KGB.", 
   {}, 
   280313, 
   null, 
   1187991120.0
  ], 
  [
   280329, 
   null, 
   "chemist99a", 
   "I am always \"timed out\" and my computer is cut off from the wet site.\n\n \n Ah a perfect example of a random mutation and a point mutation at that. b -< t transformation. Note well that the \"gene\" still has meaning and translates just fine. A wet site makes logical sense if the site is flooded with posts OR perhaps if its a physical site which is indeed to wet to reach on the roads! New information has been created, it may or may not have utility or be valid but it IS new!!!! emoticon_xhoho\n \n Live and learn !!!!!!!!!!!!!", 
   {}, 
   280151, 
   null, 
   1187991360.0
  ], 
  [
   280399, 
   null, 
   "Peeling", 
   "To the OP: Hello and welcome; we haven't spoken before so I hope we get on :) Anyway, on with the subject at hand:\n \n \nVolition, or free will, is the defining characteristic of life.\n\n \n This is a pretty bold statement. Does a bacterium really need to be able to make choices in order for its chemical processes to proceed? I'm not asking whether you believe bacteria make choices or have volition, I'm asking if you can demonstrate why it's necessary.\n \n Moreover, I'd be very reluctant to call something a 'defining characteristic' when the thing itself is so difficult to define and, indeed, impossible to be sure exists at all.\n \n Well, ok, maybe that's going a bit far. We and other organisms exhibit behaviour that can be vaguely labelled 'free will'. The question is therefore not 'do we have free will' or 'does free will exist' but rather 'what exactly does that label mean?'\n \n Say I touch something hot and pull my hand away - a reflex action. Deterministic? Let's say for the sake of argument it is. Instead, I might choose to hold my hand there and endure the pain. That 'choice' we would probably label an exercise of free will. But is it? If there's a reason I'm holding my hand there - it might be that I'm transporting a plate to the table and don't want to drop my dinner all over the floor - it's possible that we're just looking at determinism again, only with more inputs. If there's no reason, then free will is insane; indistinguishable from plain old non-determinism.\n \n It's perfectly plausible that the reason we perceive free will to exist is simply that we don't have access to all the same information other organisms use to make their decisions. They do something, we don't know why, and if we can't extrapolate or hypothesise a reason, we attribute our failure to the subject's possession of free will.\n \n One intriguing empirical indication that free will might not exist in the accepted sense is the phenomenon jokingly defined in 'The Meaning of Liff': \n \n DEVENTER: (n) A decision that's very hard to make because so little depends on it, such as which way to walk around a park.\n \n I'm sure all of you have experienced this in some form or other. \"Coffee or tea?\" \"Oh, I don't mind. Whatever's easier.\" When experiencing a deventer, you cast about for some fulcrum upon which to swing the decision, some criteria by which one choice could be deemed superior to the other.\n \n \nAll living systems appear to have some limited choice about how to respond. They respond in ways that are only statistically predictable.\n\n \n So do electrons fired through the diffractive equivalent of a double slit. Individual unpredictability does not imply free will.\n \n \nSome materialists claim free will is an illusion, doesn't actually exist. They insist that what we see as spontaneous responses are merely chemical reactions and deterministic brain interactions. Other materialists acknowledge the reality of free will but claim science cannot deal with such unpredictable phenomena.\n\n \n This is pretty slanted reporting, I have to say :) 'insist...merely' and 'acknowledge the reality'?\n \n I don't think you can actually tell me what free will is. You might say it's something you and I both have: the freedom to choose. However, that's not quite right: what we certainly have is the awareness of a choice being made. The awareness of alternatives. That's not the same as freedom of choice. Again, you might say \"I chose A, but I could have chosen B\". To which I would respond, \"Then why didn't you?\" If you can supply a reason, you have undermined your assertion that the choice was freely made. If you can't, then the choice was irrelevant, and free will is worthless.\n \n \nThey insist that science must pretend volition plays no real role in the real world of molecules and atoms. If biology must close its eyes to the defining characteristic of life, such biology is not science. It is a creation myth for materialists.\n\n \n Eloquently put, but it does rather all hinge on your assertion that volition is the defining characteristic of life, which you have not substantiated.", 
   {
    "unicode_changes_made": true
   }, 
   280083, 
   null, 
   1188004920.0
  ], 
  [
   280408, 
   null, 
   "wascallywabbit", 
   "**\n In post #12 I supplied a definition of 'volition'. Aside from neil wells' strawmen, no-one has commented. Are there any serious observations, pro or con, that can be made about my definition?", 
   {}, 
   280399, 
   null, 
   1188007080.0
  ], 
  [
   280410, 
   null, 
   "N.Wells", 
   "My comment was serious: your definition can't carry the load that you want it too, because your words don't rule out the sorts of things that make nonsense of your concepts.", 
   {}, 
   280408, 
   null, 
   1188007200.0
  ], 
  [
   280415, 
   null, 
   "wascallywabbit", 
   "My comment was serious: your definition can't carry the load that you want it too, because your words don't rule out the sorts of things that make nonsense of your concepts.\n\n \n **\n Your nonsensical attempt to link 'volition' to a corpse, where the observed phenomena are none of its doing, i.e., not of its causing, but rather the effects of the causal action/doing of live bacteria or simply chemical mechanically entropic reactions, is so inappropriate and inapplicable as to be truly bizarre! The same sort of irrelevent junk chemist is always coming up with.\n \n As for the internal behaviours of frozen blastocysts, so long as there is any such internally driven, dynamic action, still going on, that is all that is necessary. Do you have hard empirical evidence to the effect that a frozen live blastocyst cannot be in any way differentiated from a frozen dead blastocyst? If you do, then simply present it here, or stop asserting as fact, that which you simply assume.", 
   {}, 
   280410, 
   null, 
   1188008580.0
  ], 
  [
   280417, 
   null, 
   "chemist99a", 
   "**\n In post #12 I supplied a definition of 'volition'. Aside from neil wells' strawmen, no-one has commented. Are there any serious observations, pro or con, that can be made about my definition?\n\n \n Your definition isn't a definition. It cannot be applied reliably.", 
   {}, 
   280408, 
   null, 
   1188009480.0
  ], 
  [
   280418, 
   null, 
   "chemist99a", 
   "Your nonsensical attempt to link 'volition' to a corpse, where the observed phenomena are none of its doing, i.e., not of its causing, but rather the effects of the causal action/doing of live bacteria or simply chemical mechanically entropic reactions, is so inappropriate and inapplicable as to be truly bizarre! The same sort of irrelevent junk chemist is always coming up with.\n\n \n What do you mean by \"none of its doing\". The muscles contract, the gasess egress, etc. And when the thing was alive how do you know what it did was \"of its doing\". Difficult to work with someone so indefinite and vague as yourself.", 
   {}, 
   280417, 
   null, 
   1188009660.0
  ], 
  [
   280420, 
   null, 
   "chemist99a", 
   "As for the internal behaviours of frozen blastocysts, so long as there is any such internally driven, dynamic action, still going on, that is all that is necessary. Do you have hard empirical evidence to the effect that a frozen live blastocyst cannot be in any way differentiated from a frozen dead blastocyst? If you do, then simply present it here, or stop asserting as fact, that which you simply assume.\n\n \n You do realize that frozen here means at liquid nitrogen temps do you not. At such temps the internal reactions become effectively zero rate, there is nothing going on in there in the way of biochemistry. Nobody yet can distinguish whether a frozen blastocyst in the frozen state is alive or dead while it is in that state. There is simply nothing to detect. Certainly no dynamic action except a small amount of residual brownian motion due to the fact its not quite absolute zero.", 
   {}, 
   280418, 
   null, 
   1188009900.0
  ], 
  [
   280424, 
   null, 
   "N.Wells", 
   "**\n Your nonsensical attempt to link 'volition' to a corpse, where the observed phenomena are none of its doing, i.e., not of its causing, but rather the effects of the causal action/doing of live bacteria or simply chemical mechanically entropic reactions, is so inappropriate and inapplicable as to be truly bizarre! The same sort of irrelevent junk chemist is always coming up with.\n \n As for the internal behaviours of frozen blastocysts, so long as there is any such internally driven, dynamic action, still going on, that is all that is necessary. Do you have hard empirical evidence to the effect that a frozen live blastocyst cannot be in any way differentiated from a frozen dead blastocyst? If you do, then simply present it here, or stop asserting as fact, that which you simply assume.\n\n \n My primary objection is to your use, without qualification, of inherent dynamism and motion as ways to distinguish a volitional system fom a non-volitional one. The relative exciting things that a corpse can do relative to a deep-frozen blastocyst seemed a good way to enliven the discussion. \n \n I would add that your definition would seem to identify glaciers and oceans as volitional systems more than nonvolitional ones, given that they also show internally driven, ongoing, dynamic action. At least, I don't see the need for much more shoehorning to get the defintion to cover them as volitional, than you need to do to get the term to apply to a lichen. \n \n \nso long as there is any such internally driven, dynamic action, still going on\n What internally driven dynamic actions are going on in a blastocyst sitting in a dewar flask of liquid nitrogen? As Chemist says, none whatsoever, so you are overreaching on that claim. \n \n Offhand, I can't think of any nondestructive test (absent thawing, of course) that I could apply to a frozen live blastocyst that would allow it to be distinguished in any way from a frozen but otherwise undamaged and unblemished frozen dead blastocyst*, and that's been my whole problem with your delimitation of live vs dead. I don't see a sharp boundary, and I don't place it at the same limits as you do. It instead seems to be a gray zone with cases that could arbitrarily and with equal justification go either way (like viruses) and travel back and forth across wherever the line is (like frozen blastocysts and people with stopped hearts).\n \n Edited to add the exception for tests after thawing.", 
   {}, 
   280415, 
   null, 
   1188011220.0
  ], 
  [
   280436, 
   null, 
   "wascallywabbit", 
   "You do realize that frozen here means at liquid nitrogen temps do you not. At such temps the internal reactions become effectively zero rate, there is nothing going on in there in the way of biochemistry. Nobody yet can distinguish whether a frozen blastocyst in the frozen state is alive or dead while it is in that state. There is simply nothing to detect. Certainly no dynamic action except a small amount of residual brownian motion due to the fact its not quite absolute zero.\n\n \n **\n Where do you get this garbage that you pump out as if it were true?!? Here are a few facts--\n \n \"INTENDED USE\n Blastocyst Freeze Media is intended for use in assisted reproductive\n procedures for cryopreservation of blastocysts.\n PRODUCT DESCRIPTION\n Blastocyst Freeze Medium-F1 is a 5% glycerol solution in mHTF\n supplemented with 12 mg/mL Human Serum Albumin*.\n Blastocyst Freeze Medium-F2 is a 9% glycerol solution in mHTF\n containing 0.2 M Sucrose supplemented with 12 mg/mL Human Serum\n Albumin.*\n Blastocyst Freeze Media contains 10 &#956;g/mL of the antibiotic\n Gentamicin.\n QUALITY ASSURANCE\n Blastocyst Freeze Media are membrane fi ltered and aseptically\n processed according to manufacturing procedures which have been\n validated to meet a sterility assurance level (SAL) of 10-3.\n Each lot of Blastocyst Freeze Medium is tested for:\n Endotoxin by LAL methodology\n Biocompatibility by mouse blastocyst freezing\n Sterility by the Current USP Sterility Test <71<\n Blastocyst Recovery Assay\n All results are reported on a lot specifi c Certifi cate of Analysis.\n DIRECTIONS FOR USE\n freeze blastocysts:\n 1. Immerse blastocysts in Blastocyst Freeze Medium-F1 for 10\n minutes at ambient temperature.\n 2. Transfer blastocysts to Blastocyst Freeze\n Medium-F2 for 10 minutes at ambient temperature.\n 3. Load straws and freeze according to standard\n freezing protocols.\"\n at http://www.irvinesci.com/techinfo/docs/40622-Insert_Booklet-Rev6.pdf\n \n And while I am here, bothering to reply to your junk, here's something for you to chew on. If it were true that there is absolutely no physical/material/mechanical difference between a frozen dead blastocyst and a frozen live blastocyst, then what non-physical, non-material, non-mechanical cause leads some frozen blastocysts to live on when thawed? Vitality? Or are you going to appeal to darwinian magick, spontaneous generation, 'it just happens, that's all', and abandon causation altogether;-- and with it, science?", 
   {}, 
   280420, 
   null, 
   1188014700.0
  ], 
  [
   280438, 
   null, 
   "N.Wells", 
   "You've lost me there WW - what is that supposed to disprove?", 
   {}, 
   280436, 
   null, 
   1188015360.0
  ], 
  [
   280439, 
   null, 
   "chemist99a", 
   "BLASTOCYST CRYOPRESERVATION: Shady Grove RSC Protocol.\n \n FREEZING\n \n 1. Holding Medium: modified HTF + 10% HSA.\n 2. Freeze good expanded / hatched or hatching blastocysts on Day-5/6\n (unless fertilization delayed, e.g., because of FICSI).\n 3. Embryos into modified HTF + HSA @ 37deg.C, then move onto cool bench (22degC), and wash through several droplets for about 1 to 2min.\n 4. Move into 5% glycerol for 8mins.\n 5. 10% glycerol + 0.2M sucrose for 8mins (including loading time). Load straws / cryovials. (SGRSC uses 1.2ml Nunc cryovials containing 0.3ml medium).\n 6. Cool @ -2degC/min to -7.0degC; hold for 15min; \"seed\" after 5min; -0.3degC/min to -38degC, then plunge into liquid nitrogen for storage.\n\n \n It would seem you failed once more to consider the actual procedure for freezing. Consider the quote above and see if you can find the freezing temperature or conditions. Come on its not all that hard.", 
   {
    "unicode_changes_made": true
   }, 
   280436, 
   null, 
   1188015420.0
  ], 
  [
   280440, 
   null, 
   "N.Wells", 
   "From http://www.advancedfertility.com/cryolab1.htm\n \nHere the cane with frozen embryos is being \"plunged\" into the storage tank. The tank contains liquid nitrogen at -196 degrees Centigrade (that's cold!)\n\n \n From http://www.infertilitydoctor.com/lab/lab_freeze.htm\n \n [edited to correct degree C symbols] Embryos can be frozen at different times after fertilization. Most typically, embryos are frozen 1, 3 or 5 days after the sperm and egg were put together. Freezing is a stressful process for an embryo, and only embryos that are growing well in the laboratory will tolerate the freezing procedure.\n \n Step 1. Before an embryo can be frozen, all the water that it contains must be removed. Since water expands in size as it turns to ice, water inside the embryo would burst (kill) the embryo if we simply placed it in the freezer. To prevent the embryo from shriveling as the water is extracted, we replace the water with antifreeze. Antifreeze is a solution that does not expand in size when it freezes. The embryo is cooled to room temperature as the water is replaced with antifreeze.\n \n Step 2. When most of the water has been removed the embryo is inserted into a carefully labeled vial, or more typically a small straw, and placed in the cooling chamber of a controlled rate freezer.\n \n Step 3. The embryo is then cooled very slowly at -0.3 degC per minute. Slow cooling like this allows the embryologist to have precise control over the freezing process, to maximize water extraction from the embryo and to prevent formation of large ice shards that could pierce the embryo.\n \n Step 4. The cooled straw is placed into carefully labeled metal canes and lowered into the tank with other frozen embryos. The entire process takes several hours and the embryo(s) are stored frozen at -196 degC in liquid nitrogen. Liquid nitrogen is a safe and effective coolant, which is easy to work with in the laboratory. \n \n ..........\n \n How are embryos thawed?\n \n The process of embryo freezing has already been explained. Thawing the embryos is simply a reversal of the freezing procedure.\n \n Thawing includes our SurTransferSM protocol. When an embryologist removes embryos from the freezer, a second embryologist is required to witness the act, and verify the identity of the embryos before they can be thawed. Under no circumstances can a lone embryologist remove embryos from the freezer.\n \n The embryos coming out of the freezer (at -196 degC) are warmed to room temperature in 35 seconds. This rapid thaw method minimizes damage to the embryo from ice shards. The embryologist has to remove the antifreeze from the embryo and replace the water that was removed at the time of freezing. This is done by incubating the embryo in decreasing concentrations of the antifreeze, and increasing concentrations of water. Over a period of 30 minutes, the embryo is stepped through 4 different solutions, until finally the antifreeze is gone and all the water has been replaced.\n \n The thawing procedure is performed at room temperature, and once complete, the embryo is warmed up to body temperature (37 degC). It can be ready for transfer in as little as 40 minutes after leaving the freezer. \n\n All its water is removed and it's filled with antifreeze and you want to call it alive? Can we try that on you, then?\n \n (For some reason, they can easily freeze and revive sperm and embryos, but not so much the eggs. Perhaps only the Y chromosome carries enough vitality, volition, and/or autopoiesis - here's your chance to make a few million, WW, bottle up some volition and figure out how to inject it into the eggs.) :)", 
   {
    "unicode_changes_made": true
   }, 
   280439, 
   null, 
   1188016020.0
  ], 
  [
   280445, 
   null, 
   "fjp8000", 
   "Holy mackerel! Have I accidently entered the Twilite Zone? emoticon_ic", 
   {}, 
   280151, 
   null, 
   1188016920.0
  ], 
  [
   280447, 
   null, 
   "chemist99a", 
   "And while I am here, bothering to reply to your junk, here's something for you to chew on. If it were true that there is absolutely no physical/material/mechanical difference between a frozen dead blastocyst and a frozen live blastocyst, then what non-physical, non-material, non-mechanical cause leads some frozen blastocysts to live on when thawed? Vitality? Or are you going to appeal to darwinian magick, spontaneous generation, 'it just happens, that's all', and abandon causation altogether;-- and with it, science?\n Reply With Quote\n\n \n Nope. Some blastocysts survive the freeze thaw cycle some do not. The process is not perfect (and its fairly complex - see above) and in some cases the biochemical organization is sufficiently disrupted in the cycle so as to extinguish life. No big deal with regard to subject under discussion. Seeds do not always germinate either. And bear in mind the protocols are being improved even as we speak. You might as well ask why a soldier lives throguh a war and the two guys next to him do not. Or why somebody at Las Vegas wins at the slot machine and his neighbor loses all his money! Or why if I have 1000 atoms of a radioactive isotope with a 1 hr half-life that 50 of the atoms will remain and the other 50 will on the average decay even though one cannot distinguish them in any way whatsoever at the beginning.\n \n The fact that one cannot assign causes to each event and thus distinguish which blastocyst will live, or which atom will not decay does not imply some higher cause such as \"vitality\" to argue in that direction simply because the cause is not known is madness and resorting to filling in the gaps with pure speculation or the gap argument.", 
   {}, 
   280439, 
   null, 
   1188018000.0
  ], 
  [
   280448, 
   null, 
   "N.Wells", 
   "Some blastocysts survive the freeze thaw cycle some do not. The process is not perfect (and its fairly complex - see above) and in some cases the biochemical organization is sufficiently disrupted in the cycle so as to extinguish life.\n\n Let's all come back in 20,000 years and see if humans have accidentally managed to breed a race of people who produce cryogenic-hardy blastocysts.\n \n \n (Wouldn't that be cool - they'd be preadapted to interstellar colonization by slow 'seed ships'.)", 
   {}, 
   280447, 
   null, 
   1188018900.0
  ], 
  [
   280449, 
   null, 
   "wascallywabbit", 
   "From http://www.advancedfertility.com/cryolab1.htm\n \n \n From http://www.infertilitydoctor.com/lab/lab_freeze.htm\n \n All its water is removed and it's filled with antifreeze and you want to call it alive? Can we try that on you, then?\n\n \n **\n Same point I put to chem. If it is in fact, dead, then what causes it to live again? If it is dead, then it cannot do it itself, but must depend upon some other agent or agency. After all, no effect can be its own cause. This leaves you with the necessity for a non-particulate, non-physical cause distinct from the preserved 'bits of stuff'. So what is it? It would have to be 'Vitality\".\n \n But some organisms can be dessicated without killing them, and even fish can have antifreeze in their cells, so I'm not convinced that we are dealing with death and resurrection here. But if we were, not only would you give my \"vitality\" hypothesis a boost, but you'd have to stop denying the possibility of Jesus' death and resurrection, much to the glee of the creationists.\n \n You are hoist on your own petard.", 
   {}, 
   280440, 
   null, 
   1188019080.0
  ], 
  [
   280450, 
   null, 
   "N.Wells", 
   "Wait, what, Jesus had antifreeze? ......\n \n \n Perhaps there are simply intermediate states that are neither dead nor alive, where your condition is uncertain, where \"not alive\" does not necessarily mean \"dead\", and you can come out of it in either direction. \n \n Suspended animation and dormancy (as in seeds) seem to offer the option that conditions can suspend normal metabolic operation or even that normal metabolic activities can be proactively shut down, pending the return of conditions that permit normal metabolic operations to resume, or pending the triggering of some sort of chemical cascade that is capable of kick-restarting normal operation, equivalent to the way we can jump-start a stopped heart with electricity.\n \n Many animals do a mild version of 'para-death' with hibernation, and seed dormancy can be pretty extreme - there's not necessarily a lot of obvious difference between a viable dormant seed and a nonviable one, if both are kept dry and cool. A few animals (notably the tardigrade) and lichens can match and even exceed seed dormancy. So why should more extreme shutting down and restarting be too much of a surprise? \n \n None of this requires that there be a special magic ingredient called vitality. Can you bottle me some, or measure out two units' worth?\n \n \nnot only would you give my \"vitality\" hypothesis a boost \n Well, if you ever do find some vitality, perhaps you could inject it into your theory, which seems to need all the help it can get.\n \n Bear in mind that the single biggest lesson of organic chemistry is that vitalism, which everyone once thought was so essential to reactions in organic chemistry, turned out not to exist. I'm firmly convinced that you might as well be talking up phlogistons and ether, as you have provided exactly as much supporting evidence as is available for those two concepts.\n \n \n \n \n Also, back up a second - what was your 10:05 post supposed to show?", 
   {}, 
   280449, 
   null, 
   1188019620.0
  ], 
  [
   280451, 
   null, 
   "chemist99a", 
   "But some organisms can be dessicated without killing them, and even fish can have antifreeze in their cells, so I'm not convinced that we are dealing with death and resurrection here. But if we were, not only would you give my \"vitality\" hypothesis a boost, but you'd have to stop denying the possibility of Jesus' death and resurrection, much to the glee of the creationists.\n \n\n \n Neither am I and I do not claim that the embryos are dead, some of them are likely dead, some of them are still alive, but not performing the functions of life. Frozen means just that frozen - at -180 degrees or so. Cold enough so that chemical reactions are essentially slowed to zero rates, and of course absent most of their water so that most biochemical reactions cannot run anyway, certainly not your average enzyme. Some of them are not dead simply because they can be restored to functional operation. Dead critters cannot be so restored. Thats what death is in effect the irreversible cessation of normal biochemical reactions and the loss of organization as a consequence.", 
   {}, 
   280450, 
   null, 
   1188020220.0
  ], 
  [
   280453, 
   null, 
   "chemist99a", 
   "Suspended animation and dormancy (as in seeds) seem to offer the option that conditions can suspend normal metabolic operation or even that normal metabolic activities can be proactively shut down, pending the return of conditions that permit normal metabolic operations to resume, or pending the triggering of some sort of chemical cascade that is capable of kick-restarting normal operation.\n\n \n I had a good friend who was (till his untimely death) a mover and a shaker for the artic seed reserve facility intended to preserve the germ plasm of many essential plants. A description of his work at:\n \n http://en.wikipedia.org/wiki/Bent_Skovmand\n \n He was an excellent friend an avid debater and his wife typed my masters thesis. He is also the only one among my grad school gang to have the prefix Sir.", 
   {}, 
   280451, 
   null, 
   1188020520.0
  ], 
  [
   280458, 
   null, 
   "chemist99a", 
   "Suspended animation and dormancy (as in seeds) seem to offer the option that conditions can suspend normal metabolic operation or even that normal metabolic activities can be proactively shut down, pending the return of conditions that permit normal metabolic operations to resume, or pending the triggering of some sort of chemical cascade that is capable of kick-restarting normal operation.\n\n \n I had a good friend who was (till his untimely death) a mover and a shaker for the artic seed reserve facility intended to preserve the germ plasm of many essential plants. A description of his work at:\n \n http://en.wikipedia.org/wiki/Bent_Skovmand\n \n He was an excellent friend an avid debater and his wife typed my masters thesis. He is also the only one among my grad school gang to have the prefix Sir.", 
   {}, 
   280451, 
   null, 
   1188021600.0
  ], 
  [
   280499, 
   null, 
   "wascallywabbit", 
   "Nope. Some blastocysts survive the freeze thaw cycle some do not. The process is not perfect (and its fairly complex - see above) and in some cases the biochemical organization is sufficiently disrupted in the cycle so as to extinguish life. No big deal with regard to subject under discussion. Seeds do not always germinate either. And bear in mind the protocols are being improved even as we speak. You might as well ask why a soldier lives throguh a war and the two guys next to him do not. Or why somebody at Las Vegas wins at the slot machine and his neighbor loses all his money! Or why if I have 1000 atoms of a radioactive isotope with a 1 hr half-life that 50 of the atoms will remain and the other 50 will on the average decay even though one cannot distinguish them in any way whatsoever at the beginning.\n \n The fact that one cannot assign causes to each event and thus distinguish which blastocyst will live, or which atom will not decay does not imply some higher cause such as \"vitality\" to argue in that direction simply because the cause is not known is madness and resorting to filling in the gaps with pure speculation or the gap argument.\n\n \n **\n IOW, you have opted for the alternative I offered here--\"Or are you going to appeal to darwinian magick, spontaneous generation, 'it just happens, that's all', and abandon causation altogether;-- and with it, science?\" And this exactly what I expected you to do.", 
   {}, 
   280447, 
   null, 
   1188061260.0
  ], 
  [
   280507, 
   null, 
   "chemist99a", 
   "IOW, you have opted for the alternative I offered here--\"Or are you going to appeal to darwinian magick, spontaneous generation, 'it just happens, that's all', and abandon causation altogether;-- and with it, science?\" And this exactly what I expected you to do.\n\n \n Nope its all causal and its all deterministic. But such systems produce unpredictable results unless you have detailed and precise information regarding all the causative factors. Many such systems are so sensitive to initial conditions that one cannot track the causal chains {thats what chaos is all about}. The world of causation is not all smooth functions and easily predicted outcomes you know. Some causal relationships are extremely stiff as that numerical analysis folks wil tell you. For any embryo the difference between being thawed and living and being thawed and dead can be the differnce in the relative coordinate vector of just a few hundred atoms, or the residual water content during freezing of a few 0.01%, or a heck of a lot of uncontrolled factors. No matter how precise the protocols they do not offer the degree of control that one would like to have. Especially true for any disruptions due to nucleation of ice crystals etc. Basically its a dicey thing to freeze and thaw a delicate structure like an embryo. Its rather suprising that it can be done at all and keep any of them in a living state.", 
   {}, 
   280499, 
   null, 
   1188063540.0
  ], 
  [
   280513, 
   null, 
   "chemist99a", 
   "Bear in mind that the single biggest lesson of organic chemistry is that vitalism, which everyone once thought was so essential to reactions in organic chemistry, turned out not to exist. I'm firmly convinced that you might as well be talking up phlogistons and ether, as you have provided exactly as much supporting evidence as is available for those two concepts.\n\n \n And since life is just advanced organic chemistry why should we now reinsert vitalist concepts where they are not needed at all? And yes vitalism was wounded by Wohler and by the early 1900s had pretty much bled out. There are few people like SS who would like to reestablish the idea of elan vital by moving the threshold for its appearance (necessity) up to the level of an organism, but they have not found any credible purchase in the empirical world. These days we are already (as organic chemists) up to the task of making functional viruses and well on the road to being able to build functional minimalist cells. And when that is done we will know in detail how the beast is put together and how it works, and likely how it can evolve. Sic transist the last vestiages of vitalism.", 
   {}, 
   280507, 
   null, 
   1188063960.0
  ], 
  [
   280533, 
   null, 
   "wascallywabbit", 
   "Neither am I and I do not claim that the embryos are dead, some of them are likely dead, some of them are still alive, but not performing the functions of life. Frozen means just that frozen - at -180 degrees or so. Cold enough so that chemical reactions are essentially slowed to zero rates, and of course absent most of their water so that most biochemical reactions cannot run anyway, certainly not your average enzyme. Some of them are not dead simply because they can be restored to functional operation. Dead critters cannot be so restored. Thats what death is in effect the irreversible cessation of normal biochemical reactions and the loss of organization as a consequence.\n\n \n **\n Lies. You and your materialist pals, notably neil wells, have been arguing for pages and pages that there is no qualitative difference between that which is alive and that which is dead. You both have insisted that since, according to you, no empirically observable differences exist, in some cases, between that which is alive, and that which is dead, that there is no 'real' difference between life and death. You have offered examples of such cases in order to prove your point; examples ranging from the simply foolish, such as the phenomena observed in decomposing corpses, to this one, the frozen blastocyst.\n \n Your point here being that a dead frozen blastocyst is chemically/mechanically no different from a live frozen blastocyst, because if it were chemically/mechanically different, those differences would be empirically observable. Since, according to you, no such chemica/mechanical differences are detectable, then it must be a fact that no chemical/mechanical differences actually exist between the live and the dead frozen blastocysts. You then assume that since there is no real difference in this case, then, by extension, there is no real chemical/mechanical difference between life and death in any case. That is, that since, according to materialism, only chemical/mechanical differences are real, [because in materialism only physical/chemical/mechanical 'things' are real], that there is no real distinction/difference between life and death;--the very point that you two, and others, have been trying to make all along, in this thread and others.\n \n So don't go trying to change horses in midstream by now saying, \"Some of them are not dead simply because they can be restored to functional operation. Dead critters cannot be so restored. Thats what death is in effect the irreversible cessation of normal biochemical reactions and the loss of organization as a consequence.\". Why not? Well because this is in fact, MY POINT, the very one you boys have been denying all along, as above. That is, that there is a REAL difference between life and death.\n \n Which leads to three(?) alternative explanations for 'revived' blastocysts--\n \n a/they were never dead, but that which was and remains their sustained 'life', is incorporeal, discarnate, insubstantial, disembodied, immaterial and non-physical/mechanical; that is, present and actual, but empirically inobservable unless and until it can and does cause a discernible effect on something corporeal, such as the molecules in a blastocyst. That which is a life-force, aka, Vitality.\n \n b/they were all apparently dead, but since, in materialism, there is no real difference between life and death, but only apparent, illusory differences, some thawed blastocysts 'appeared' to have revived/resurrected themselves, while some others 'appeared' to remain apparently dead. For no understandable reason. It just happens, that's all.\n \n c/All of the blastocysts were neither dead nor alive when frozen, but rather, like Schrodinger's cats, only became alive or dead thanks to the 'observation' of those thawing them out.\n \n Obviously a/ is my position, and I suppose b/ to be your position, but perhaps you'll opt for c/, who knows? Or perhaps you've got a d/ you can offer?\n \n As for those blastocysts that did not thaw out viably, I assume that something in the thawing process disrupted the molecular bits, severing their connection to the Vitality which would have enabled them to manifest the empirically observable chemical/mechanical effects we associate with live organisms and their live organic parts. In short, they died on the operating table.", 
   {}, 
   280451, 
   null, 
   1188066600.0
  ], 
  [
   280538, 
   null, 
   "N.Wells", 
   "**\n Lies. You and your materialist pals, notably neil wells, have been arguing for pages and pages that there is no qualitative difference between that which is alive and that which is dead. You both have insisted that since, according to you, no empirically observable differences exist, in some cases, between that which is alive, and that which is dead, that there is no 'real' difference between life and death.\n\n No, I'm not claiming that there is no difference between life and death. I've been arguing that your concepts are wrong, and your definitions aren't up to doing the job that you need them to do (discriminating between life and death). I have been providing examples that demonstrate the inadequacy of your definitions and concepts. \n \n \n You have offered examples of such cases in order to prove your point; examples ranging from the simply foolish, such as the phenomena observed in decomposing corpses, to this one, the frozen blastocyst.\n\n If the examples are foolish, why can't your definitions handle them?\n \n \n Your point here being that a dead frozen blastocyst is chemically/mechanically no different from a live frozen blastocyst, because if it were chemically/mechanically different, those differences would be empirically observable. Since, according to you, no such chemica/mechanical differences are detectable, then it must be a fact that no chemical/mechanical differences actually exist between the live and the dead frozen blastocysts. You then assume that since there is no real difference in this case, then, by extension, there is no real chemical/mechanical difference between life and death in any case. \n\n There need not be any observable difference between a frozen revivable blastocyst and a frozen unrevivable one, but this in no way extends to the idea that there is no real chemical/mechanic difference between life and death in any case. A beheaded man represents a clear case of death, as does a decomposed corpse. However, the boundary shifts according to medical technology, and is not appropriately applied in some cases. \n \n \nThat is, that since, according to materialism, only chemical/mechanical differences are real, [because in materialism only physical/chemical/mechanical 'things' are real], that there is no real distinction/difference between life and death;--the very point that you two, and others, have been trying to make all along, in this thread and others.\n\n Again speaking for myself rather than chemist, I see clear differences between life and death, but I don't see that something in suspended animation has to be one or the other. Since your concepts require that you define \"life\" in such a way as to include hearts en route to a transplant and frozen blastocysts, while excluding corpses that are more dynamic and changing, but you aren't able to do that, so you are inventing \"vitality\" as a way out of your problem. \n \n \nSo don't go trying to change horses in midstream by now saying, \"Some of them are not dead simply because they can be restored to functional operation. Dead critters cannot be so restored. Thats what death is in effect the irreversible cessation of normal biochemical reactions and the loss of organization as a consequence.\". Why not? Well because this is in fact, MY POINT, the very one you boys have been denying all along, as above. That is, that there is a REAL difference between life and death.\n \n Which leads to three(?) alternative explanations for 'revived' blastocysts--\n \n a/they were never dead, but that which was and remains their sustained 'life', is incorporeal, discarnate, insubstantial, disembodied, immaterial and non-physical/mechanical; that is, present and actual, but empirically inobservable unless and until it can and does cause a discernible effect on something corporeal, such as the molecules in a blastocyst. That which is a life-force, aka, Vitality.\n \n b/they were all apparently dead, but since, in materialism, there is no real difference between life and death, but only apparent, illusory differences, some thawed blastocysts 'appeared' to have revived/resurrected themselves, while some others 'appeared' to remain apparently dead. For no understandable reason. It just happens, that's all.\n \n c/All of the blastocysts were neither dead nor alive when frozen, but rather, like Schrodinger's cats, only became alive or dead thanks to the 'observation' of those thawing them out.\n \n Obviously a/ is my position, and I suppose b/ to be your position, but perhaps you'll opt for c/, who knows? Or perhaps you've got a d/ you can offer?\n \n As for those blastocysts that did not thaw out viably, I assume that something in the thawing process disrupted the molecular bits, severing their connection to the Vitality which would have enabled them to manifest the empirically observable chemical/mechanical effects we associate with live organisms and their live organic parts. In short, they died on the operating table.\n\n \n It seems to me that you are the one in a conundrum, not me. If \"vitality\" accounts for the sole difference between a live frozen embryo that is completely inactive and a dead frozen embryo that is equally inactive, I would think that application of vitality to the frozen dead embryo ought to revive it, and that injection of twice as much vitality ought to revive a dead embryo with a bit more damage than the last one, and so forth, and that this logic should extend to obvious corpses.\n \n I don't see that you've provided any reasonable evidence for vitality, other than you think it has to be there, because things have to be either alive or dead. I therefore think you are inventing a solution because you are misreading the problem. \n \n Note also that you can't identify vitality other than that which is possessed by living organisms and which makes them alive and your proof for its existence is that frozen revivable embryos must have it while frozen dead embryos can't, you are building yourself into a tautology.\n \n My view is close to the first part of your option C (a previously living and so far undamaged blastocyst is neither dead nor alive while frozen). However, the outcome is deterministic (albeit very hard to predict), depending on the lack of damage done during freezing and thawing, up to the reastablishment of conditions that allow metabolism to restart.\n \n \nAs for those blastocysts that did not thaw out viably, I assume that something in the thawing process disrupted the molecular bits, severing their connection to the Vitality which would have enabled them to manifest the empirically observable chemical/mechanical effects we associate with live organisms and their live organic parts. In short, they died on the operating table.\n I agree in full, except for the bit about \"severing their connection to vitality\". All the explanation that is needed is that \"the mechanical bits were disrupted to the extent that restarting their operation after a return to normal operating conditions was not possible\" - \"vitality\" just falls away as an unnecessary concept.", 
   {}, 
   280533, 
   null, 
   1188070680.0
  ], 
  [
   280555, 
   null, 
   "wascallywabbit", 
   "\n No, I'm not claiming that there is no difference between life and death.\n\n \n **\n That is precisely what, truth be told, you have been insisting, and you have made every effort possible, here and elsewhere, to demonstrate that assertion as fact. If you believed for one moment that a _real_ distinction existed between life and death, then you would be able to describe that distinction that differs the one state from the other. But you have made it very clear, here and elsewhere, that, as a materialist, you do not believe any such thing. You do not believe that any real distinction exists between olife and death.\n \n Instead, as a materialist, you repeatedly assert that everything is simply 'chemistry', and that since that 'chemistry' is the same thing, everywhere and always, in life and in death, it follows that life and death are not qualitatively distinguishable states, but merely different points on one unbroken and indivisible chemical continuum. Thus there is no _real_ and qualitative difference between life and death. This the argument that we have been going over and over and over, despite the fact, as I've already pointed out to you, quantum mechanics shows that indivisible continuums are a materialist fantasy--that all of existence is 'chopped up' into 'quanta'.\n \n \n\n I've been arguing that your concepts are wrong,\n\n \n **\n Not true. You never actually speak to/address/argue my \"concepts\" at all. You merely gainsay, deny, and scoff at them. You try to obfuscate any lines of discussion I open wrt to the issues. One example being your attempt to obscure an inquiry into empirically observable 'signs of life' by pretending that the chemical phenomena found to be acting upon a corpse are indistinguishable from the chemical phenomena found to be acting within a live organism. You ridiculous assumption being that that which is done by something is indistinguishable from that which is done to it.\n \n \n \n\n and your definitions aren't up to doing the job that you need them to do (discriminating between life and death).\n\n \n **\n Sez u, with nothing but denial and obfuscation on your side. Why don't you ever quote my \"definitions\" of life and actually show, logically and empirically, why they fail to 'do the job' of distinguishing life from death, instead of merely gainsaying and blowing smoke up everyone's butt?\n \n \n\n I have been providing examples that demonstrate the inadequacy of your definitions and concepts. \n\n \n **\n You wish!\n \n \n\n Quote:\n You have offered examples of such cases in order to prove your point; examples ranging from the simply foolish, such as the phenomena observed in decomposing corpses, to this one, the frozen blastocyst. \n \n If the examples are foolish, why can't your definitions handle them?\n\n \n **\n Because they are foolish and impertinent. Quote these \"definitions\" you keep referring to, and then demonstrate how your 'examples' are pertinent to those 'definitions' .To my recollection I've only ever given one definition in this thread, [post 12] and that was for 'volition'. But since I asserted that 'volition' is autopoietic dynamism, and that that is the essence of life, you could say that that I defined life as that quality found in a autopoietic, dynamic, self-serving, self-directing, complex and productive systems.\n \n Two posts after that 'definition' you brought in the silly obfuscation that a corpse was a dynamic autopoietic system--\n \"Seems that a corpse undergoing decomposition because it is being attacked and digested by its own enzymes constitutes a relatively dynamic system\",\n -- ridiculous, when obviously your example is not even a system, let alone a complex, dynamic, productive, and autopoietic system.\n \n \"sys·tem (s&#301;s't&#601;m) \n n.\n A group of interacting, interrelated, or interdependent elements forming a complex whole.\n A functionally related group of elements, \" [answers.com]\n \n But enough of that codswallop.\n \n \n\n There need not be any observable difference between a frozen revivable blastocyst and a frozen unrevivable one, but this in no way extends to the idea that there is no real chemical/mechanic difference between life and death in any case.\n\n \n **\n Sorry, neil, but a major principle of materialism is that any proposed phenomenon, if it is not either directly, physically, observable in and of itself, or, is indirectly observable via its observable effects on material substances, is automatically classified as 'supernatural', 'fantastic', and/or 'metaphysical'.\n \n Thus, in materialist terms, any \"real chemical/mechanic difference between life and death\" must be observable, if it actually exists. Therefore any real difference between life and death [and now even you seem to be admitting that there really is a real difference between life and death] is either an observable \"real chemical/mechanic difference\", or it must be what you materialists label, \"an unreal supernatural difference\". Just as you so categorize my \"Vitality\".\n \n \n \n\n Again speaking for myself rather than chemist, I see clear differences between life and death,\n\n \n **\n That's nice to know. Care to spell them out for us?\n \n \n\n but I don't see that something in suspended animation has to be one or the other.\n\n \n **\n So you're adopting alternative \"C/\", the \"Shrodinger's cat\" position?\n \n \n \n\n Since your concepts require that you define \"life\" in such a way as to include hearts en route to a transplant and frozen blastocysts, while excluding corpses that are more dynamic and changing, but you aren't able to do that,\n\n \n **\n Aren't able to do what, for pete's sake?!?! My \"concepts\", [ie, dynamism, autopoiesis] most certainly do \"include hearts en route to a transplant and frozen blastocysts, while excluding corpses\" [and the notion that because a corpse is 'changing', it is by that token, a \"dynamic\" system, [when the only things that are dynamic in this case are the things that are changing the corpse, and not the corpse at all], only shows that you'll just say just about anything, for effect.\n \n \n \n\n so you are inventing \"vitality\" as a way out of your problem.\n\n \n **\n First, I do not have a problem--you do. Your problem, as above, is that you have no chemical/particulate/molecular mechanism you can point to, empirically, as that which is responsible for life,-- or, in its absence, death. That is to say, you have no chemical [materialist] mechanism _for_ autopoiesis,and/or life, but only chemical mechanisms in autopoiesis, and or live organisms.\n \n And I, and others before me, did not 'invent' Vitality, 'life force, 'elan vital', but 'recognised' it-- as the only way out of _your_ dilemma.\n \n Just as Newton invented Gravity in order to get materialists out of their dilemma, i.e., that they had no mechanical explanation for weight and the observed fact that apples fall out of trees without being pushed.", 
   {}, 
   280538, 
   null, 
   1188083220.0
  ], 
  [
   280557, 
   null, 
   "chemist99a", 
   "Lies. You and your materialist pals, notably neil wells, have been arguing for pages and pages that there is no qualitative difference between that which is alive and that which is dead. You both have insisted that since, according to you, no empirically observable differences exist, in some cases, between that which is alive, and that which is dead, that there is no 'real' difference between life and death. You have offered examples of such cases in order to prove your point; examples ranging from the simply foolish, such as the phenomena observed in decomposing corpses, to this one, the frozen blastocyst.\n\n \n No lies just a more complex assessment of reality than you appear to be able to make. There are (so far as I know) any tests which can tell whether or not a frozen embryo is alive or dead beyond empirically testing it by thawing. But it may be the thawing that kills it if it were alive. So you ask for a decision (live/dead) when there is no practical method to determine the issue. That we cannot observe the difference of course does not mean that it does not exist. Absense of evidence is not evidence of absense after all.", 
   {}, 
   280555, 
   null, 
   1188084780.0
  ], 
  [
   280558, 
   null, 
   "chemist99a", 
   "Sorry, neil, but a major principle of materialism is that any proposed phenomenon, if it is not either directly, physically, observable in and of itself, or, is indirectly observable via its observable effects on material substances, is automatically classified as 'supernatural', 'fantastic', and/or 'metaphysical'.\n\n \n Nope thats not a principle of materialism and you cannot show that it is. A materialist will say of things he does not know \"I don't know\". There is never any need to deal with the supernatural at all unless someone insists on inserting that concpet into the explanation - and a materialist will not do so.", 
   {}, 
   280557, 
   null, 
   1188085020.0
  ], 
  [
   280586, 
   null, 
   "N.Wells", 
   "**\n That is precisely what, truth be told, you have been insisting, and you have made every effort possible, here and elsewhere, to demonstrate that assertion as fact. If you believed for one moment that a _real_ distinction existed between life and death, then you would be able to describe that distinction that differs the one state from the other. But you have made it very clear, here and elsewhere, that, as a materialist, you do not believe any such thing. You do not believe that any real distinction exists between olife and death.\n \n \n Instead, as a materialist, you repeatedly assert that everything is simply 'chemistry', and that since that 'chemistry' is the same thing, everywhere and always, in life and in death, it follows that life and death are not qualitatively distinguishable states, but merely different points on one unbroken and indivisible chemical continuum. Thus there is no _real_ and qualitative difference between life and death. This the argument that we have been going over and over and over, despite the fact, as I've already pointed out to you, quantum mechanics shows that indivisible continuums are a materialist fantasy--that all of existence is 'chopped up' into 'quanta'.\n \n \n Not true. You never actually speak to/address/argue my \"concepts\" at all. You merely gainsay, deny, and scoff at them. You try to obfuscate any lines of discussion I open wrt to the issues. One example being your attempt to obscure an inquiry into empirically observable 'signs of life' by pretending that the chemical phenomena found to be acting upon a corpse are indistinguishable from the chemical phenomena found to be acting within a live organism. \n\n \n Mike, I critiqued a specific part of your definition by saying that your specific use, without qualification, of inherent dynamism and motion as ways to distinguish a volitional system fom a non-volitional one aren't good, because dead corpses can be fairly dynamic, and frozen revivable blastocysts are not. They fall on the wrong sides of the definitional fence that you wish to erect between life and death. Post-mortem changes begin with processes that are going on within the living body (but uncontrolled and unbalanced), and as time passes they shift to include new factors and new processes as time goes by, so I haven't disputed that a decomposing body is doing different things from a live one. I said that you can't set the fence simply at the presence vs the absence of \"inherent dynamism and motion\" and get the corpse and the revivable frozen blastocysts on the appropriate sides for your argument, because the corpse is more inherently dynamic and mobile than the blastocyst.\n \n Secondly, I think your insistence that organisms have to be either alive or dead is misguided, because suspended animation / deep freezing are neither the one nor the other, and because you have problems separating \"dead-frozen\" from \"live but frozen\" (without thawing and finding out what happens). \n \n This is not quite your option C / Shroedinger's cat model, as I explained earlier, although it overlaps. \n \n Moreover, saying that you have a flawed conceptual framework and that one can't necessarily look at frozen blastocyst and tell whether or not it is revivable (assuming no further damage during thawing and no obviously lethal damage up to the present) is not equivalent to saying that there are no differences between between life and death. \n \n That being said, yes, life emerges from chemistry and physics and I view life to death as transitional - it can of course be extraordinarily abrupt, but there are stages between the two, and the point of transition has shifted over time with improvements in medical technology (e.g., shocking a heart back into action). However, recognition of a gradation between two end-member conditions does not deny that the end-members are different (black-white, or mixes of any pair of colors being examples). \n \n \n-- ridiculous, when obviously your example is not even a system, let alone a complex, dynamic, productive, and autopoietic system.\nA dead and decomposing body is no less a system than a live one. It is clearly a \"complex whole\", and since it is being digested by its own enzymes, it clearly exhibits interaction of parts. (Glaciers and rivers are also systems.) It is forming decomposition products, so it is productive. The reactions are complex, as it the body (getting less so, however). It changes during decomposition, so it's dynamic, after a fashion. This leaves us with \"autopoietic\", which I haven't so far discussed. \n \n You gave a definition for an autopoietic machine as \"An autopoietic machine is a machine organized (defined as a unity) as a network of processes of production (transformation and destruction) of components which: (i) through their interactions and transformations continuously regenerate and realize the network of processes (relations) that produced them; and (ii) constitute it (the machine) as a concrete unity in space in which they (the components) exist by specifying the topological domain of its realization as such a network.\" (Maturana, Varela, 1980, p. 78)\" \"\n \n I readily agree that (i) doesn't apply to corpses. However, (i) also doesn't seem to apply to frozen but revivable blastocysts, and (ii) seems to be a sufficiently impenetrable statement that it can apply to a corpse as easily to the aforementioned blastocyst. \n \n \n \n \nAnd I, and others before me, did not 'invent' Vitality, 'life force, 'elan vital', but 'recognised' it-- as the only way out of _your_ dilemma.\n \n Just as Newton invented Gravity in order to get materialists out of their dilemma, i.e., that they had no mechanical explanation for weight and the observed fact that apples fall out of trees without being pushed.\n\n Interesting point, because according to Newton, gravity is an actual force, whereas according to Einstein there is no such force, but it is instead merely a label for the effects of the curvature in space-time caused by mass. Vitalism in organic chemistry, ether, and phlogistons were similarly 'recognized' due to the need that was felt for them. You need to be sure that you are recognizing something that actually exists, rather than is just needed by your beliefs.", 
   {}, 
   280555, 
   null, 
   1188093120.0
  ], 
  [
   280947, 
   null, 
   "chemist99a", 
   "Vitalism in organic chemistry, ether, and phlogistons were similarly 'recognized' due to the need that was felt for them. You need to be sure that you are recognizing something that actually exists, rather than is just needed by your beliefs.\n\n \n All those concepts were much like the GOD explantion for things not yet understood in detail. Humans put up signs like \"here there be dragons\" to mark territory as basically unknown. In fact one way to make a rep as a scientist is to work out how to replace one or more of those place holders with scientifically valid explanations. All they (vitalism, ether, phlogistons, GOD etc) mean is that the details are not yet known. Many humans (often religious in their orientation) simply forget that the original placeholders are intended to be temporary and to be replaced by something valid in the future when science gets round to it. In effect SS and WW have made this error (repeatedly I note) in all sorts of contexts. They act as if science should or could know everything and that if it does not then the only POSSIBLE alternate explanation is the word on the place marker.", 
   {}, 
   280586, 
   null, 
   1188206100.0
  ], 
  [
   281003, 
   null, 
   "wascallywabbit", 
   "\n Quote:\n Originally Posted by wascallywabbit \n **\n That is precisely what, truth be told, you have been insisting, and you have made every effort possible, here and elsewhere, to demonstrate that assertion as fact. If you believed for one moment that a _real_ distinction existed between life and death, then you would be able to describe that distinction that differs the one state from the other. But you have made it very clear, here and elsewhere, that, as a materialist, you do not believe any such thing. You do not believe that any real distinction exists between olife and death.\n \n \n Instead, as a materialist, you repeatedly assert that everything is simply 'chemistry', and that since that 'chemistry' is the same thing, everywhere and always, in life and in death, it follows that life and death are not qualitatively distinguishable states, but merely different points on one unbroken and indivisible chemical continuum. Thus there is no _real_ and qualitative difference between life and death. This the argument that we have been going over and over and over, despite the fact, as I've already pointed out to you, quantum mechanics shows that indivisible continuums are a materialist fantasy--that all of existence is 'chopped up' into 'quanta'.\n \n \n Not true. You never actually speak to/address/argue my \"concepts\" at all. You merely gainsay, deny, and scoff at them. You try to obfuscate any lines of discussion I open wrt to the issues. One example being your attempt to obscure an inquiry into empirically observable 'signs of life' by pretending that the chemical phenomena found to be acting upon a corpse are indistinguishable from the chemical phenomena found to be acting within a live organism. \" \n \n wells--\n Mike, I critiqued a specific part of your definition by saying that your specific use, without qualification, of inherent dynamism and motion as ways to distinguish a volitional system fom a non-volitional one aren't good, because dead corpses can be fairly dynamic, and frozen revivable blastocysts are not.\n\n \n **\n Not true, neil. What you really did was try to blow smoke, obfuscate, by falsely conflating that which is done, dynamically, _to_ a dead organism, with that which is done, dynamically, _by_ a live organism. The metaphysical assumption being that since chemistry is only chemistry, it makes no difference where you find it--its orgins and agents are irrelevent. Which is pure hooey, in biology. \n \n \n\n They fall on the wrong sides of the definitional fence that you wish to erect between life and death. Post-mortem changes begin with processes that are going on within the living body (but uncontrolled and unbalanced), and as time passes they shift to include new factors and new processes as time goes by, so I haven't disputed that a decomposing body is doing different things from a live one.\n\n \n **\n No, what you've done is, as above, told the lie that a dead body is \"doing things\", when in fact it is only \"having things done to it\". There is a distinct difference between what a system does, and that which may be done to a system, and you deliberartely tried to blur, obscure, and hide that distinction.\n And you are still implying that same falsehood when you say--\"a decomposing body is doing different things from a live one\".\n \n \n \n\n I said that you can't set the fence simply at the presence vs the absence of \"inherent dynamism and motion\" and get the corpse and the revivable frozen blastocysts on the appropriate sides for your argument, because the corpse is more inherently dynamic and mobile than the blastocyst.\n\n \n **\n Which is totally ridiculous, since the corpse, pe se, is totally passive, not \"inherently dynamic\", and is 'doing' nothing but being operated upon external agents and chemical agencies. Next you'll be telling us that a dead man is \"inherently dynamic and mobile\", just as a living person is--at least for as long as its in the back of a hearse, on it's way to the graveyard.\n \n Why are you clinging to this absurd objection? Do you actually believe it holds merit?\n \n \n\n Secondly, I think your insistence that organisms have to be either alive or dead is misguided, because suspended animation / deep freezing are neither the one nor the other, and because you have problems separating \"dead-frozen\" from \"live but frozen\" (without thawing and finding out what happens).\n\n \n **\n Once again you speak not from empirical observation but from metaphysical presumption. That is, you deny that there is a real and distinct difference beteen 'live' and 'dead'. You say that my insistence [that organisms be either the one or the other], is \"false\", since, in your materialist world of unbroken continuums, there is no point at which the one may be distinguished as distinct from the other. A point of view, as I pointed out on other occasions, that originated with the early greek materialists, and which resulted in their materialist dictum that 'change' is merely an illusion. [see Parmenides, Thales, Zeno, et al]. So that, in your view, the change from 'alive' to 'dead' is also illusory, since, in your materialist view, there exists no point at which the one is distinct from the other. Therefore you assume that a deep-frozen blastocyst may be neither one nor the other, or both at the same time, like Shrodinger's gedanken cat.\n \n \n\n This is not quite your option C / Shroedinger's cat model, as I explained earlier, although it overlaps. \n\n \n **\n What \"explanation\"? All you've said to that effect is to make a non-explanatory assertion that--\n \"My view is close to the first part of your option C (a previously living and so far undamaged blastocyst is neither dead nor alive while frozen). However, the outcome is deterministic (albeit very hard to predict), depending on the lack of damage done during freezing and thawing, up to the reastablishment(sic) of conditions that allow metabolism to restart.\"---\n \n The \"outcome\" of changing the the state \"frozen blastocyst\" to that of \"thawed blastocyst\" is a separate issue from the issue in question, which is, I remind you, the question of whether or not a frozen blastocyst is in a 'live' state, a 'dead' state', 'neither', or 'both'. Which itself arises out of the issue as to whether or not one can empirically discern the 'live' state, which is itself a related issue, without being the same issue; unless you adopt the materialist position that anything that cannot be empirically discerned, directly or indirectly, is by that token, 'supernatural', hence, 'unreal'.\n \n In short, you voiced your opinion, which you are perfectly right to do, but you offered no 'explanation' for it.\n \n \n\n Moreover, saying that you have a flawed conceptual framework and that one can't necessarily look at frozen blastocyst and tell whether or not it is revivable (assuming no further damage during thawing and no obviously lethal damage up to the present) is not equivalent to saying that there are no differences between between life and death.\n\n \n **\n If you believe that, then why did you raise the objection to my assertion, that is, that there are real differences between life and death? Why did you bring up corpses and frozen blastocysts at all, if not to deny that assertion and to obfuscate the issue?\n \n And how does that denial and obfuscation demonstrate that my assertion represents \"a flawed conceptual framework\"? There is no 'flaw' in my 'conceptual framework', i.e., the premise that 'life' and 'death' are distinctly different from each other, and not, as per your own, 'conceptual framework', merely a chemical continuum of one 'state' that merely moves from one 'stage' [life] to another 'stage', [death], so that any difference between life and death is illusory rather than real. You sound more like a creationist every day, you know that?\n \n \n\n That being said, yes, life emerges from chemistry and physics\n\n \n **\n \"Emerges\" is a lovely word, but if you insist that 'life' needs only \"chemistry and physics\" in order to \"emerge\", then you violate \"ex nihilo, ab nihilo, nihil fit\", and superstitiously appeal to the 'magick' of 'spontaneous generation'. Funny how quickly you materialists abandon logic, reason, and science just as soon as you need to do so. Magic words just won't cut it around here. You use a term, you justify it, logically and/or empirically, just as I do with Vitality, or you get justifiably scoffed at, as I do not.\n \n \n \n\n and I view life to death as transitional - it can of course be extraordinarily abrupt, but there are stages between the two, and the point of transition has shifted over time with improvements in medical technology (e.g., shocking a heart back into action).\n\n \n **\n So what? All you are trying to do is obfuscate the point at which there is a definite and distinct rupture between 'live' and 'dead'. If you admit to the existence of that point, then all the rest of this is just an arm-waving waste of time. But if, as you do here, you insist that there are \"non-life, non-death\" 'stages' _between_ actual 'life' and 'death' states, and so no clear distinction between life and death exists, then you'd best find some way to support that materialist metaphysical postulate [see above].\n \n \n\n However, recognition of a gradation between two end-member conditions does not deny that the end-members are different (black-white, or mixes of any pair of colors being examples). \n\n \n **\n There you go again with Zeno's paradoxes, claiming that there is no such thing as black or white, just different stages or 'degrees' of a single state, 'grey', with black and white as its 'end-members'. \n This time you are trying to 'reverse-engineer' life and death into a variatian of the 'sorites paradox', sometimes called the 'heap' or 'pile' paradox. This requires reducing an empirical state to an abstract value judgement, by simple declaration. A 'heap' is not a heap, empirically speaking, but is a 'heap' simply as a value judgement. WRT to 'heaps' and 'piles' and other vague quantifications, where quantities of something can be somewhat 'more' or somewhat 'less' ,without affecting what that something is, this is true.\n But Life is a state of being, not a quantity something measurable, like peas or pigment. Just like pregnancy, where you either are pregnant or you're not, you either are alive or you're not. You cannot try on a sorites paradox in order to pretend that the only distinction between life and death is a semantic one, because life cannot be quantified--it is, or it is not.\n \n You, as a materialist, are trying to turn life into something that can be quantified, and thus measured, because for a materialist if a thing can't be measured, then it can be disregarded; in fact, _must_ be disregarded. If you can't say that 'this' is more [or less] alive than 'that', by a degree or two, then you just don't want to hear about it.\n \n Quote:\n ww-\n \"-- ridiculous, when obviously your example is not even a system, let alone a complex, dynamic, productive, and autopoietic system. \"\n \n A dead and decomposing body is no less a system than a live one.[/quote]\n \n **\n That is quite possibly the dumbest thing you've ever said. Next you'll be telling us that stick of burning stove wood constitutes 'a system'. and that the field that snow drops upon is no less a 'system'!!\n \n \n\n It is clearly a \"complex whole\",\n\n \n **\n How is it a _complex_ whole? Is a hamburger patty, in the pan or not, a 'complex' thing? There is nothing complex about a corpse. It's either a corpse, or it isn't. If you want talk about the dynamic complexities of what is being done _to_ the corpse by things that are not the corpse, flail away, but it's a red herring.\n \n \n\n and since it is being digested by its own enzymes, it clearly exhibits interaction of parts.\n\n \n **\n Since when are simple chemical reactions sufficient to characterize a 'system'?\n Since you apparently have no idea just what the word, 'system' means, here it is again, one more time. Even though if you didn't 'get it' the first hundred times, you won't accept it this time, either--\n \n \"sys·tem (s&#301;s't&#601;m) \n n.\n A group of interacting, interrelated, or interdependent elements forming a complex whole.\n A functionally related group of elements, especially:\n The human body regarded as a functional physiological unit.\n An organism as a whole, especially with regard to its vital processes or functions.\n A group of physiologically or anatomically complementary organs or parts: the nervous system; the skeletal system.\n A group of interacting mechanical or electrical components.\n A network of structures and channels, as for communication, travel, or distribution.\n A network of related computer software, hardware, and data transmission devices.\n An organized set of interrelated ideas or principles.\n A social, economic, or political organizational form.\n A naturally occurring group of objects or phenomena: the solar system.\n A set of objects or phenomena grouped together for classification or analysis.\n A condition of harmonious, orderly interaction.\n An organized and coordinated method; a procedure. See synonyms at method.\n The prevailing social order; the establishment. Used with the: You can't beat the system.\" [answers.com]\n \n Where in any of this do you find the simple chemical act of 'enzymes breaking down proteins' qualifying as a 'system'?\n \n \n \n \n\n (Glaciers and rivers are also systems.)\n\n \n **\n Drainage systems and solar systems qualify as simple systems of interacting elements/parts forming interdependent wholes. Enzymes at work do not. \n Neither is painting a barn door a 'system', nor filling a cup with water a 'system'. Everything you can think of does not necessarily constitute a 'system', even when it is a part of a real system. Why do you keep forcing me to belabour the obvious?\n \n \n\n It is forming decomposition products, so it is productive.\n\n \n **\n Yeah, the enzymes are changing organic materials. So if you want to characterize enzymic action as 'productive', go ahead. But enzymes are not systems, and neither are corpses, and neither are enzymes acting on corpses.\n \n And if you want to define any outcome as a 'product', and so stretch the meaning of the word 'productive' to include any activity that leads to any outcome, that would be perfectly in keeping with the materialist worldview described above. I prefer to limit the meaning of 'productive' as that which leads, teleologically, to a desired outcome;-- at least when talking of complex systems, like live organisms, and not just simple events, like enzymic action or glaciers melting or rain falling or wind blowing the leaves around.\n \n \n\n The reactions are complex, as it the body (getting less so, however). It changes during decomposition, so it's dynamic, after a fashion. This leaves us with \"autopoietic\", which I haven't so far discussed.\n\n \n **\n If you still haven't realized that you are only playing semantic games, allow me to once again point this out to you.\n \n \n\n You gave a definition for an autopoietic machine as \"An autopoietic machine is a machine organized (defined as a unity) as a network of processes of production (transformation and destruction) of components which: (i) through their interactions and transformations continuously regenerate and realize the network of processes (relations) that produced them; and (ii) constitute it (the machine) as a concrete unity in space in which they (the components) exist by specifying the topological domain of its realization as such a network.\" (Maturana, Varela, 1980, p. 78)\" \"\n\n \n **\n That is Maturana and Varela's definition of an autopoietic machine. I cannot speak for them, but I define a live organism as an autopoietic system, and not as an autopoietic \"machine\", at all. Why? Because I define a 'machine' as an artefact, an artificial system, as contrasted to a natural system. I quoted them solely to illustrate the meaning of 'autopoietic', whether applied to artificial machine systems, or natural organismic systems. Personally, I think that they are wrong to apply the term 'autopoietic' to machinery, because by definition a machine is a tool, and by definition, no tool can be autopoietic, because by definition tools serve others, not themselves. As do all artefacts.\n The essence of autopoiesis, IMO, is serving the self as an identified entity. Withjout a sense of identity, nothing can be autopoietic. And before you leap to anthropomorphic conclusions, 'identity' need be nothing more than the unconscious ability to distinguish 'self' from 'not-self'; that is, to simply be aware. \n \n \n\n I readily agree that (i) doesn't apply to corpses. However, (i) also doesn't seem to apply to frozen but revivable blastocysts, and (ii) seems to be a sufficiently impenetrable statement that it can apply to a corpse as easily to the aforementioned blastocyst. \n\n \n **\n Well, rather than defend their definition of an 'autopoietic machine', I will offer a definition of an autopoietic system. I will define an autopoietic system as any natural, complex system whose inherent internal activities serve the purpose of maintaining, enhancing, and if possible, expanding, the existence of that system, both within itself as an independent system, and/or overall, as a contributing internal sub-system within a greater uber-system. The least autopoietic system being a single cell, the greatest autopoietic uber-system being the biosphere.\n \n That's off the top of my head, but it will do for now.\n \n \n \n\n Quote:ww\n \"And I, and others before me, did not 'invent' Vitality, 'life force, 'elan vital', but 'recognised' it-- as the only way out of _your_ dilemma.\n \n Just as Newton invented Gravity in order to get materialists out of their dilemma, i.e., that they had no mechanical explanation for weight and the observed fact that apples fall out of trees without being pushed. \" \n wells--\n Interesting point, because according to Newton, gravity is an actual force, whereas according to Einstein there is no such force, but it is instead merely a label for the effects of the curvature in space-time caused by mass. \n\n \n **\n If that were what Einstein actually said then he would have done nothing more than change the name/label of the causal force from 'gravity' to 'mass'.\n \n \n\n Vitalism in organic chemistry, ether, and phlogistons were similarly 'recognized' due to the need that was felt for them. You need to be sure that you are recognizing something that actually exists, rather than is just needed by your beliefs.\n\n \n **\n Remember that the next time you appeal to \"Natural Selection\", \"Random [but] Adaptive Genetic Mutation\", bottom-up \"emergence\", and on and on and on.", 
   {}, 
   280947, 
   null, 
   1188253320.0
  ], 
  [
   281007, 
   null, 
   "jim's trucking", 
   "This is a well convoluted thread...appears to have started out with some concern of free will, something one would assume to be attributed only to animal beings with living brains..went into the dumpster with delusions concerning cadaver volition.\n \n Maybe I missed where free will was defined for purposes of this thread. I find it illogical to attach free will to anything that is not alive. Get me past that and we can talk about whether plants make choices. So far I have it limited to animals with brains.", 
   {}, 
   281003, 
   null, 
   1188255300.0
  ], 
  [
   281010, 
   null, 
   "chemist99a", 
   "Maybe I missed where free will was defined for purposes of this thread. I find it illogical to attach free will to anything that is not alive. Get me past that and we can talk about whether plants make choices. So far I have it limited to animals with brains.\n\n \n Wabbits do not understand the concepts you have outlined. Logic? you jest! Brains? You jest! Wabbits can only wiggle and squirm going off on stupid and irrelevant tangents making claims left and right never stopping to consider any criticisim or questions about their statements. They always are looking for new carrots.", 
   {}, 
   281007, 
   null, 
   1188256080.0
  ], 
  [
   281043, 
   null, 
   "N.Wells", 
   "Jim's Trucking\n No one here is calling corpses volitional. We got into this mess because WW proposed a bad set of definitions that failed to distinguished corpses and dead frozen blastocysts from living things: he argued that volition = an inherent dynamism = live organisms, where dynamism = development or motion of a system. \n \n \n [From WW] I would define volition as an inherent dynamism, characteristic of autopoietic systems, i.e., live organisms.\n \n dynamism--A process or mechanism responsible for the development or motion of a system. answers.com\n \n That system which is intrinsically dynamic [self-controlled and self-serving] possesses volition. ...... \n\n \n \n WW, with a newer definition of autopoiesis: \nWell, rather than defend their definition of an 'autopoietic machine', I will offer a definition of an autopoietic system. I will define an autopoietic system as any natural, complex system whose inherent internal activities serve the purpose of maintaining, enhancing, and if possible, expanding, the existence of that system, both within itself as an independent system, and/or overall, as a contributing internal sub-system within a greater uber-system. The least autopoietic system being a single cell, the greatest autopoietic uber-system being the biosphere.\n Alright, that's a distinct improvement, and it satisfactorily avoids the corpse problem. However, why not include viruses as alive under this definition? (Everything else seems to be okay except possibly for \"complex\".) Seems a bit arbitrary. Also, I don't think you've resolved your frozen blastocyst problem yet, or at least you are sweeping the problems under the carpet of 'inherent'. \"Enhancing\" is a bit vague, and we'll overlook the minor difficulty that postmortem gas bloat technically constitutes an expansion. \n \n I am not conflating live and dead, not am I denying the difference between white and dark. I am noting that your earlier definitions fail to distinguish live and dead the way that you want them to, I am noting that boundaries are not necessarily sharp, and that the division that you wish to be dichotomous is not. Additionally, your assumptions and foundational beliefs have derailed you off into mysticism.\n \n A corpse is indeed a system, and it is way more structured than hamburger (at least for a while yet, and presuming it didn't become a corpse by falling into a macerator). Oceans and rivers are quite complex systems, as far as systems go: a lot of terabytes would be needed to provide a full representation of either.\n \n \nNext you'll be telling us that a dead man is \"inherently dynamic and mobile\", just as a living person is\n You just can't stop with what I said, but you have to keep on overreaching. Yes, a corpse is inherently dynamic, and farts, belches, and shudders are a form of movement. Unless you freeze it, dynamic change by breakdown is inevitable and inherent and not passive. I have explained that breakdown is going to start by the action of biological agents already in the body, so it's inherent and it is doing stuff to itself, but right from the onset of death the actions are unbalanced and incomplete relative to what happens in a live body, and pretty quickly other, external, factors step in, so I have never claimed that it is 'just like a living person'.\n \n \nThe metaphysical assumption being that since chemistry is only chemistry, it makes no difference where you find it--its orgins and agents are irrelevent. Which is pure hooey, in biology.\n Yes on the first sentence, but the \"hooey\" charge is unsupported and unsupportable. Organic chemistry such as the synthesis of urea works just fine without the addition of vitalism, and you are just trying to reinsert this mysticism at a different level. \n \n \nI remind you, the question of whether or not a frozen blastocyst is in a 'live' state, a 'dead' state', 'neither', or 'both'.\n Agreed. We can't empirically discern the difference without thawing. Your original definition fails to support the distinction that you would like to be made (revivable = alive, nonrevivable = dead). Also, frozen = neither (it's suspended animation), not both (i.e. not exactly a Shroedinger's cat situation). Also, supercooled is quite different from supernatural, thank you.\n \n \nMoreover, saying that you have a flawed conceptual framework and that one can't necessarily look at frozen blastocyst and tell whether or not it is revivable (assuming no further damage during thawing and no obviously lethal damage up to the present) is not equivalent to saying that there are no differences between between life and death.\n I agree. I'm not making the claim that there are no differences - I'm saying that your definition can't serve to make that distinction in all cases. \n \n \nIf you believe that, then why did you raise the objection to my assertion, that is, that there are real differences between life and death? Why did you bring up corpses and frozen blastocysts at all, if not to deny that assertion and to obfuscate the issue?\n Again, to tell you that your definition doesn't properly discriminate all cases, and that your basic assumptions are flawed and are blinding you about the true nature of the differences, which in turn makes you call on the equivalent of phlogistons and pulls you into mysticism.\n \n And how did the stuff that you posted at the top of this page back up your implication that Chemist was lying?", 
   {}, 
   281010, 
   null, 
   1188261180.0
  ], 
  [
   281056, 
   null, 
   "chemist99a", 
   "Quote:WW\n \nWell, rather than defend their definition of an 'autopoietic machine', I will offer a definition of an autopoietic system. I will define an autopoietic system as any natural, complex system whose inherent internal activities serve the purpose of maintaining, enhancing, and if possible, expanding, the existence of that system, both within itself as an independent system, and/or overall, as a contributing internal sub-system within a greater uber-system. The least autopoietic system being a single cell, the greatest autopoietic uber-system being the biosphere.\n\n \n Follow up comment by Wells:\n \nAlright, that's a distinct improvement, and it satisfactorily avoids the corpse problem. However, why not include viruses as alive under this definition? (Everything else seems to be okay except possibly for \"complex\".) Seems a bit arbitrary. Also, I don't think you've resolved your frozen blastocyst problem yet, or at least you are sweeping the problems under the carpet of 'inherent'. \"Enhancing\" is a bit vague, and we'll overlook the minor difficulty that postmortem gas bloat technically constitutes an expansion.\n \n\n \n Well its a truly messy definition with all too much fat and verbage. I offer the following slimmed down version which I hope is less obese with garbage words.\n \n \nAn autopoietic system is one which maintains itself and is capable of reproduction. \n\n \n I do not see within the steaming pile of distracting verbage anything beyond that.\n \n Auto means self.\n Poietic means productive or formative.\n \n Ie self-productive, self-formative.\n \n And there you have it. All he has done is to describe self replicating systems including those which are imperfect. Thats how you crank up life - imperfect self-replicating systems are the core of it.", 
   {}, 
   281043, 
   null, 
   1188262740.0
  ], 
  [
   281062, 
   null, 
   "chemist99a", 
   "And I have to add that a corpse is Neither self-maintaining nor do they reproduce. As to what systems are MORE or LESS self-maintaining or replicating its a meaningless quantitation, the property is strictly a qualia.", 
   {}, 
   281056, 
   null, 
   1188263160.0
  ], 
  [
   281067, 
   null, 
   "N.Wells", 
   "And I have to add that a corpse is neither self-maintaining nor do they reproduce.\n\n \n (You just haven't been watching the right movies.)\n \n \nWell its a truly messy definition.\n Yes but it's better than what went before, and it's about as good as you're going to get out of WW.", 
   {}, 
   281062, 
   null, 
   1188263580.0
  ], 
  [
   281082, 
   null, 
   "chemist99a", 
   "(You just haven't been watching the right movies.)\n \n\n \n Or reading the bible either. But I am not fond of anecdotal evidence. Its like a verbal contract not worth the paper its not written on.", 
   {}, 
   281067, 
   null, 
   1188264900.0
  ], 
  [
   281136, 
   null, 
   "wascallywabbit", 
   "\n #56 Today, 07:33 PM \n N.Wells \n Registered User Join Date: Jul 2007\n Posts: 107 \n \n Jim's Trucking\n No one here is calling corpses volitional. We got into this mess because WW proposed a bad set of definitions that failed to distinguished corpses and dead frozen blastocysts from living things:\n\n \n **\n False. We got into this mess because neil wells rejected my claim that live organisms could be empirically differentiated from dead organisms on the basis of internal dynamics, namely autopoietic activity. Wells dragged in corpses and frozen blastocysts in order to back up his gainsaying. It is his customary deny/obfuscate approach to debate that has produced this mess.\n \n Whether or not the definition of volition I gave in post #12 {?} is perfect, there is certainly nothing there that corpses and frozen blastocysts can take away from it.\n \n \n\n he argued that volition = an inherent dynamism = live organisms, where dynamism = development or motion of a system. \n \n Quote:\n [From WW] I would define volition as an inherent dynamism, characteristic of autopoietic systems, i.e., live organisms.\n \n dynamism--A process or mechanism responsible for the development or motion of a system. answers.com\n \n That system which is intrinsically dynamic [self-controlled and self-serving] possesses volition. ...... \n \n \n\n \n **\n Truthfully, when put together properly, my proposition went thusly--- volition=inherent dynamism=autopoiesis= inherent development and/or productive activity generated endogenously by a complex self-serving system.\n \n \n\n WW, with a newer definition of autopoiesis: \n Quote:\n Well, rather than defend their definition of an 'autopoietic machine', I will offer a definition of an autopoietic system. I will define an autopoietic system as any natural, complex system whose inherent internal activities serve the purpose of maintaining, enhancing, and if possible, expanding, the existence of that system, both within itself as an independent system, and/or overall, as a contributing internal sub-system within a greater uber-system. The least autopoietic system being a single cell, the greatest autopoietic uber-system being the biosphere. \n \n Alright, that's a distinct improvement,\n\n \n **\n Actually, it is only a longer, more detailed way of expressing exactly what I had said in the first place.\n \n \n\n and it satisfactorily avoids the corpse problem.\n\n \n **\n Oh, puhleeze give it up!! There never was a \"corpse problem\", except in your own head.\n \n \n\n However, why not include viruses as alive under this definition? (Everything else seems to be okay except possibly for \"complex\".) Seems a bit arbitrary.\n\n \n **\n True. And I do not have a final answer to the objection, but I would suggest that viruses do not possess the autonomy required of an auotopoietic system, because they are entirely dependent upon the dynamics of another system, a cell, in order to generate for them the sole and only 'product' they can be said to have--more viruses. Further, an autopoietic system is complex and dynamic to the point that it requires internal behaviour, metabolism, in order to maintain itself as it is. To my knowledge, viruses do not take in energy and metabolise it in order to maintain themselves, but passively, chemically, hang together or entropically disintegrate, as external forces dictate. Just like solar systems, for example, which are also non-autopoietic mechanical systems.\n \n \n\n Also, I don't think you've resolved your frozen blastocyst problem yet, or at least you are sweeping the problems under the carpet of 'inherent'.\n\n \n **\n Denial and automatic gainsaying are not counter-argument, neil. When are you going to accept that? \n \n Tell us clearly and cleanly just what \"problem\" you created for me with your \"frozen blastocyst\". Tell us how a frozen blastocyst makes my approach to volition [as autopoiesis] untenable. Try, if it is at all possible for you to do so, to avoid trying for cheap debating points by insinuating that your opponent, myself, is \"sweeping [your denial] under the carpet\", despite the fact that anyone can read the earlier posts and see that I have responded to your gainsaying and semantic gymnastics as reasonably and fully as it is possible to respond to such stuff.\n \n \n\n \"Enhancing\" is a bit vague, and we'll overlook the minor difficulty that postmortem gas bloat technically constitutes an expansion. \n\n \n **\n What difficulty? What does post-mortem gas bloat have to do with anything at all?!?! Are you still trying to find some way of turning decaying corpses into autopoietic systems? You are amazingly obdurate.\n \n \n\n I am not conflating live and dead, not am I denying the difference between white and dark. I am noting that your earlier definitions fail to distinguish live and dead the way that you want them to,\n\n \n **\n Only in your own unsupported opinion. You're entitled to that opinion, and I'm entitled to dismiss it as meritless, since you cannot, and do not, do anything more than repeat it.\n \n Moreover, my \"earlier\" definition is one and the same with my present definition. If you really see any essential change in my position, don't just insinuate that there is one, spell it out.\n \n \n\n I am noting that boundaries are not necessarily sharp, and that the division that you wish to be dichotomous is not.\n\n \n **\n Sez u. Ho hum.\n \n \n\n Additionally, your assumptions and foundational beliefs have derailed you off into mysticism.\n\n \n **\n Sez u. Ho hum.\n \n \n\n A corpse is indeed a system,\n\n \n **\n Haw! You are a laff a minute, neil. A corpse, in se, is not, by itserlf alone, a system. Start including all the bacteria, maggots, worms, gravitational pulls, weathering forces, moulds, yeasts, internal acids and enzymes,and carrion eaters, and you'll get an a corpse that has become part of a small ecosystem; but only a part--not a system. One cog in the machinery. Certainly it will not be in any way autopoietic; not as I have always defined autopoietic,[see above], and that's all that matters.\n \n \n\n and it is way more structured than hamburger (at least for a while yet, and presuming it didn't become a corpse by falling into a macerator). Oceans and rivers are quite complex systems, as far as systems go: a lot of terabytes would be needed to provide a full representation of either.\n\n \n **\n All of which is impertinent obfuscation of the issue. Ho hum.\n \n \n\n Quote:\n Next you'll be telling us that a dead man is \"inherently dynamic and mobile\", just as a living person is \n \n You just can't stop with what I said, but you have to keep on overreaching.\n\n \n **\n What you call, 'overreaching', is called, 'reductio ad absurdum', in logic.\n \n \n\n Yes, a corpse is inherently dynamic, and farts, belches, and shudders are a form of movement.\n\n \n **\n Bloody nonsense. Gasses produced by decay, and the farts, belches and shudders produced by those gasses, are produced by dynamic bacteria, etc., not by the passive dead meat they are devouring and metabolizing. Are you always this obtuse when it comes to determining cause and effect? Or are you deliberately distorting the mechanics of organic decay?\n \n \n \n\n Unless you freeze it, dynamic change by breakdown is inevitable and inherent and not passive.\n \n \n **\n Well, you could also salt it, smoke it, pickle it, or freeze-dry it;-- but never mind.\n The point is that both decay and preservation are thing done to a passive corpse, and not, as you seem to believe, dynamic things it does to itself.\n \n \n\n I have explained that breakdown is going to start by the action of biological agents already in the body, so it's inherent and it is doing stuff to itself, but right from the onset of death the actions are unbalanced and incomplete relative to what happens in a live body, and pretty quickly other, external, factors step in, so I have never claimed that it is 'just like a living person'.\n\n \n **\n You try to confuse the issue by pretending that, since enzymes and other chemicals do the same thing they always do, whether or not they are contained within a live organism or a dead one, that there is therefore no distinction between the dynamic action of an enzyme working for, as a component of, an autopoietic system, and the dynamic action of an enzyme working on a corpse, and so, according to your voodoo logic, a corpse is no different from an autopoietic, self-serving, self-sustaining system. And despite the stupidity of this contention, you simply cannot let it go. \n \n \n\n Quote:\n The metaphysical assumption being that since chemistry is only chemistry, it makes no difference where you find it--its orgins and agents are irrelevent. Which is pure hooey, in biology. \n \n Yes on the first sentence, but the \"hooey\" charge is unsupported and unsupportable. Organic chemistry such as the synthesis of urea works just fine without the addition of vitalism,\n\n \n **\n Non sequitur. And a distortion. I did not say, as you assert, that chemistry is different depending upon where you find it. I said that, contrary to your POV, that it makes a difference to science where you find it. That is, that its orgins and agents and whereabouts--that is, the overall context in which the particular chemistry is examined and assessed-- matters; and matters a lot, in some cases.\n \n \n\n and you are just trying to reinsert this mysticism at a different level. \n\n \n **\n Sez u. Ho hum. But of course, to a materialist such as yourself, anything that you can't reduce to 'stuff bumping into other stuff, pointlessly', has to be labelled, 'mysticism'.\n \n \n\n Quote:\n I remind you, the question of whether or not a frozen blastocyst is in a 'live' state, a 'dead' state', 'neither', or 'both'. \n \n Agreed. We can't empirically discern the difference without thawing.\n\n \n **\n Maybe we can, maybe we can't, --yet. I don't know that we cannot do it it today; I simply have not found material on the subject, What good reason do you have to support a claim that it is, now and forever, simply impossible to empirically discern such a difference? If we truly cannot do it today, I can think of no reason for that failure other than the lack of the proper tools to do the job. You seem to be making a metaphysical assertion that we cannot observe any differences [if that is true], because there are no differences to be observed, and so at certain temperatures there are no differences between the living and the dead, and life and death are become the same thing.\n \n \n\n Your original definition\n\n \n **\n Stop with the oblique references to some \"original definition\"--my one definition is what it has always been. If you think I had an 'original' definition that is in some essential way altered in some 'later' definition, prove it. State these 'definitions' plainly and show where they differ from each other in any non-trivial sense.\n \n \n\n fails to support the distinction that you would like to be made (revivable = alive, nonrevivable = dead).\n\n \n **\n That's not \"the distinction that {I} would like to be made\", but it certainly is a distinction that can be, and is, made. And made everyday, in operating rooms and elsewhere.\n \n \n\n Also, frozen = neither (it's suspended animation),\n\n \n **\n Sez u. A metaphysical assumption on your part.\n \n \n\n not both (i.e. not exactly a Shroedinger's cat situation). \n\n \n **\n As above.\n \n \n\n Also, supercooled is quite different from supernatural, thank you.\n\n \n **\n Not in your books, apparently. In youyr reality, 'supercooled' is a third, supernatural state, distinct from the two natural states, 'alive' and 'dead'.\n \n \n\n I'm not making the claim that there are no differences - I'm saying that your definition can't serve to make that distinction in all cases. \n\n \n **\n Why not?\n \n \n\n Quote:\n If you believe that, then why did you raise the objection to my assertion, that is, that there are real differences between life and death? Why did you bring up corpses and frozen blastocysts at all, if not to deny that assertion and to obfuscate the issue? \n \n Again, to tell you that your definition doesn't properly discriminate all cases, and that your basic assumptions are flawed and are blinding you about the true nature of the differences, which in turn makes you call on the equivalent of phlogistons and pulls you into mysticism.\n\n \n **\n Again, this stuff doesn't \"tell\" anybody anything except that it is your opinion that such is so. At no time did any of this protracted corpse junk, or the 'frozen stiff' stuff, demonstrate that my definition of volition and its relation to life itself is in any way flawed, despite your repeated claim. You have never shown that it does not \"properly discriminate\", you have only asserted that it does not. You claim that my \"basic assumptions are flawed\", but you never prove it. You claim that I am \"blind to the true nature of the differences\", without even attempting to stipulate just what those 'true differences' are. And then, just to play the sophist game, you pretend that that I resort to mysticism', simply because anything you cannot get to fit into your materialist metaphysics you wave off and disparage as 'mysticism'. Wewll, here's a flash for you--the stuff you've been spouting here has a lot more in common with 'mysticism' than my ideas have. \n \n \n\n And how did the stuff that you posted at the top of this page back up your implication that Chemist was lying? \n\n \n **\n Think about it, why don't you?", 
   {}, 
   281082, 
   null, 
   1188285600.0
  ], 
  [
   281137, 
   null, 
   "chemist99a", 
   "Your point here being that a dead frozen blastocyst is chemically/mechanically no different from a live frozen blastocyst, because if it were chemically/mechanically different, those differences would be empirically observable. \n\n \n \n Nope, the difference is simply not detected by the methods and techniques which we currently have at our disposal. Obviously there are differences, but very minor alteratins in structure (and we do not know which) may result in death on thawing. And of course there is the hazard to live and organization posed by the thawing process itself.", 
   {}, 
   281136, 
   null, 
   1188286260.0
  ], 
  [
   281149, 
   null, 
   "lesz", 
   "\"But yer honner, it wuz determinism that made me do it!\"\n \n As for distinguishing between life and death, is a dried out tardigrade dead or alive? What about a spore or seed? If you establish the Krebs cycle in a test tube, is it dead or alive? Are mitochondria and chloroplasts dead or alive?\n \n Life is full of questions with easy and simple answers that are dead wrong. :)", 
   {}, 
   281137, 
   null, 
   1188298740.0
  ], 
  [
   281577, 
   null, 
   "supersport", 
   "I'd like to know....if free will doesn't exist, why is it that materialists (who don't believe in free will) try so hard to convince everyone else that they don't have it? It seems to me if there is no free will then there's no point in trying so hard to make people change their minds....I mean if thoughts and beliefs are genetically based, then what's the point of debate? It seems to me that by materialists trying to change peoples' minds they are trying to accomplish what amounts to a fundamental contradiction to their philosophy of no free-will.", 
   {}, 
   280151, 
   null, 
   1188511260.0
  ], 
  [
   281584, 
   null, 
   "N.Wells", 
   "You seem to be setting up a huge strawman here, if you think you are talking about us EvilDarwinists(TM) on this forum. The world probably contains some strict philosophical materialists of the sort you describe, but there aren't very many. If I am correctly reading the pro-evolution folks here (and they can correct me if I'm wrong) we are methodological naturalists, and we are not strict followers of genetic determinism, despite WW's attempts to paint us that way. \n \n Most scientists are methodological naturalists, which means that we search first for natural / material causes and explanations, which is pragmatically as close to philosophical materialism as you can usually find. I'm perfectly happy with the concept that not everything is determined by genetics, and that thoughts and free will can emerge from complex brains. There clearly are genetically controlled instincts in the animal world, and there are clearly genetic influences, at times strong, on human thoughts, inclinations, personalities, and mental processes, but humans also seem capable of overcoming those sorts of genetic inclinations, and are in any case clearly strongly influenced by culture and education. \n \n I argue against you because you keep spouting demonstrable rubbish, which I dislike.", 
   {}, 
   281577, 
   null, 
   1188514980.0
  ], 
  [
   281603, 
   null, 
   "supersport", 
   "You seem to be setting up a huge strawman here, if you think you are talking about us EvilDarwinists(TM) on this forum. The world probably contains some strict philosophical materialists of the sort you describe, but there aren't very many. If I am correctly reading the pro-evolution folks here (and they can correct me if I'm wrong) we are methodological naturalists, and we are not strict followers of genetic determinism, despite WW's attempts to paint us that way. \n \n \n\n \n \n Oh, but the kicker is that in order for materialism to be true, that lifeforms arose and evolved mechanically with no intelligence, that genetic determinsm would HAVE to be true. It seems to me you are trying to have your cake and eat it too. You're trying to say the world evovled mechanically and naturally without committing yourself to genetic determinsm. See, there's a reason Dawkins and his type call genes selfish -- there's a reason he believes in genetic determinsm...there's a reason he believes in ultra-reductionism --- it's because in order for life to evolve the way he says, these would HAVE to be reality. Yet here you are saying they are not reality yet claiming darwinism to be true. Go figure.", 
   {}, 
   281584, 
   null, 
   1188520140.0
  ], 
  [
   281610, 
   null, 
   "chemist99a", 
   "Oh, but the kicker is that in order for materialism to be true, that lifeforms arose and evolved mechanically with no intelligence, that genetic determinsm would HAVE to be true. It seems to me you are trying to have your cake and eat it too. You're trying to say the world evovled mechanically and naturally without committing yourself to genetic determinsm. See, there's a reason Dawkins and his type call genes selfish -- there's a reason he believes in genetic determinsm...there's a reason he believes in ultra-reductionism --- it's because in order for life to evolve the way he says, these would HAVE to be reality. Yet here you are saying they are not reality yet claiming darwinism to be true. Go figure.\n\n \n Well lets look at genetic determinism. Consider that if you do not have the genes for an eye then you will not have an eye. If you do have genes for eyes then you may have an eye (or two or even 10) but your environment may not allow those genes to be expressed. The causes of you having an eye are multiple and more than one factor will make the determination. Its nature and nurture you know not just one. \n \n And yes life arose and evolved for one heck of a long time period without what is generally referred to as intelligence. Centralized nervous systems came pretty late in the game. Bacteria do not think, plants do not think, and intelligence as its generally used means that thinking takes place. If you want to invoke intelligence as being behind evolution then you are going to have to extend intelligence all the way down to non-living matter and assert that non-living matter one day decided to become living matter. Good luck with that!\n \n Note well that is the way reality would have to be IF your theory is to be workable! Thats a very very weak concept is it not? That a nucleotide can think? That say Adenine has intelligence? Unless of course you are going to invoke an EXTERNAL intelligence (which I think is what you really wish to do) and then of course you are stuck in a self-referencing mess since you have to somehow explain where THAT intelligence originated from. The materialist approach is both credible and simpler than what you are postulating. And it has the advantage of being supported by evidence and observation.", 
   {}, 
   281603, 
   null, 
   1188521460.0
  ], 
  [
   281644, 
   null, 
   "N.Wells", 
   "Oh, but the kicker is that in order for materialism to be true, that lifeforms arose and evolved mechanically with no intelligence, that genetic determinsm would HAVE to be true. It seems to me you are trying to have your cake and eat it too. You're trying to say the world evovled mechanically and naturally without committing yourself to genetic determinsm. \n\n As Chemist just said, even in bacteria and such, life seems to involve trade-offs & interactions between genes and the environment. What that does to making me a genetic determinist or not I don't much care. Free will and volition emerge as life gets more complex, notably as it develops brains. Everything else seems to be fairly simple stimulus-response without choices and decisions being available options. Thus bacteria have no free will, but we do. If intelligence and free will can be an emergent property, then there is no inconsistency.", 
   {}, 
   281610, 
   null, 
   1188533760.0
  ], 
  [
   281645, 
   null, 
   "chemist99a", 
   "Thus bacteria have no free will, but we do. If intelligence and free will can be an emergent property, then there is no inconsistency.\n Nat\n \n Just to be a nit-picking pain in the rear, I will point out that we experience what we label as free-will. However that experience does not rule out that free-will (the experience) is not the product of deterministic processes - a situation which many free-will advocates would claim cannot be the case or else free-will is not free. Since I am trying my best to be a pain I will say that free-will as we experience it is a product of chemistry and physics and is thus effectively deterministic on the physical scale of a neuron.\n \n \nYou're trying to say the world evovled mechanically and naturally without committing yourself to genetic determinsm.\n\n \n Well everything I know or think I know appears to be explicable by materialist causes. That includes effects of environments on organisms and strict genetic determinism would require me to claim that genes determine everything - a stance I do not take. Everything does appear to have a material cause - but that cause need NOT be genes and to think that a materialist reductionist approach requires that genes determine everything is to make a serious logical error. But yes the world did evolve mechanically and naturally with that I agree.", 
   {}, 
   281644, 
   null, 
   1188534060.0
  ], 
  [
   281666, 
   null, 
   "lesz", 
   "If I am correctly reading the pro-evolution folks here (and they can correct me if I'm wrong) we are methodological naturalists, and we are not strict followers of genetic determinism, despite WW's attempts to paint us that way.\n\n \n I'm a philosophical materialist/naturalist myself, though obviously also a methodological one. And no, I'm certainly not a \"follower\" of strict genetic determinism -- organisms are products of the interaction between genes and environment. Only some traits are strictly genetically determined. Materialists do not have to be genetic determinists, even if most are deteminists of some sort.", 
   {}, 
   281584, 
   null, 
   1188558300.0
  ], 
  [
   281667, 
   null, 
   "lesz", 
   "As Chemist just said, even in bacteria and such, life seems to involve trade-offs & interactions between genes and the environment. What that does to making me a genetic determinist or not I don't much care. Free will and volition emerge as life gets more complex, notably as it develops brains. Everything else seems to be fairly simple stimulus-response without choices and decisions being available options. Thus bacteria have no free will, but we do. If intelligence and free will can be an emergent property, then there is no inconsistency.\n\n \n Complexity of response is not good evidence for freedom of will. Volition could well be the inevitable and deterministic outcome of a complex series of neurological events that are in essence unpredictable by either the agent or the observer. It just means that some organisms are more than simple stimulus-response machines, and initiate their own behaviour from internal physical stimuli rather than exclusively external ones. Unpredictability and complex behaviour does not disprove determinism as many strongly deterministic processes in nature and mathematics follow chaotic and unpredictable pathways.", 
   {}, 
   281644, 
   null, 
   1188558660.0
  ], 
  [
   281670, 
   null, 
   "lesz", 
   "And if there were some hitherto undiscovered force or vitalistic field that controlled the organisation, development and evolution of organisms and species, then that would also be no philosophical problem for a materialist. It would just be a new force currently unknown to science. The only issue is that there is no evidence for such a force or field, and no apparent need for one, since molecular explanations for these phenomena seem to be sufficient.", 
   {}, 
   281667, 
   null, 
   1188561240.0
  ], 
  [
   281747, 
   null, 
   "chemist99a", 
   "LES:\n \nComplexity of response is not good evidence for freedom of will. \n\n \n Nope its just evidence of complexity! Again the problem is matching what we experience with the underlying mechanisms. World would be better off if nobody had ever attached the term free to will. Free from what is always the question- originally it meant free from godly compulsion or interference. As an atheist I have to admit we do have will free from that compulsion. Whether will is based deterministic or non-determistic {as some insist} is a different issue. Perhaps just a definitional one.", 
   {}, 
   281670, 
   null, 
   1188612720.0
  ], 
  [
   281754, 
   null, 
   "wascallywabbit", 
   "As Chemist just said, even in bacteria and such, life seems to involve trade-offs & interactions between genes and the environment. What that does to making me a genetic determinist or not I don't much care. Free will and volition emerge as life gets more complex, notably as it develops brains. Everything else seems to be fairly simple stimulus-response without choices and decisions being available options. Thus bacteria have no free will, but we do. If intelligence and free will can be an emergent property, then there is no inconsistency.\n\n \n **\n Oooops, neil, your anthropocentrism is showing.", 
   {}, 
   281644, 
   null, 
   1188625440.0
  ], 
  [
   281755, 
   null, 
   "chemist99a", 
   "Oooops, neil, your anthropocentrism is showing.\n\n \n \n Actually that would be you. After all you project your own intelligence onto bacteria in order to explain ---- your own intelligence. You just cannot get away from intelligent creative processes which is definitely anthropocentric if not theocentric.", 
   {}, 
   281754, 
   null, 
   1188625860.0
  ], 
  [
   282058, 
   null, 
   "supersport", 
   "http://10th-life.livejournal.com/129940.html\n \n OMG-epigenetics--we can turn bits of DNA on and off--for generations!!!\n \n \"Epigenetics is proving we have some responsibility for the integrity of our genome,\" Jirtle says. \"Before, genes predetermined outcomes. Now everything we do-everything we eat or smoke-can affect our gene expression and that of future generations. Epigenetics introduces the concept of free will into our idea of genetics.\"", 
   {
    "unicode_changes_made": true
   }, 
   281755, 
   null, 
   1188861780.0
  ], 
  [
   282060, 
   null, 
   "ShadowPikachu", 
   "http://10th-life.livejournal.com/129940.html\n \n OMG-epigenetics--we can turn bits of DNA on and off--for generations!!!\n \n \"Epigenetics is proving we have some responsibility for the integrity of our genome,\" Jirtle says. \"Before, genes predetermined outcomes. Now everything we do-everything we eat or smoke-can affect our gene expression and that of future generations. Epigenetics introduces the concept of free will into our idea of genetics.\"\n\n \n OMG - Supersport can copy and paste his own posts mindlessly into various forums!\n emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   282058, 
   null, 
   1188862500.0
  ], 
  [
   282149, 
   null, 
   "Peeling", 
   "Epigenetics introduces the concept of free will into our idea of genetics.\"\n\n \n Fascinating stuff, SS. A couple of points do stand out though.\n \n In most of the examples given, the nature of the effect of 'free will' upon the phenotype is unrelated to the behaviour itself. Grandsons developing diabetes because their grandfathers pigged out in their youth is all very interesting, but it's not exactly a sterling example of volition and evolution working hand in glove, is it? And the agouti mice, whose phenotype was 'fixed' by a methyl-rich diet - one might equally well say that they are genetically unsuited to a methyl-sparse diet; one step down the food chain from Pottenger's cats. So sure, the decisions you make about what to eat and how you behave can potentially influence the phenotype of your offspring - but there's no indication that the effect will, in the general case, be responsive (ie, useful and applicable) to the choice you made. Skimp on folic acid during pregnancy and your children don't emerge better at doing without folic acid; they just have a greater chance of Downs Syndrome.\n \n Also, this is hardly 'introducing' free will to genetics. Heck, I myself have described several ways in which free will can indirectly influence the course of evolution: the choice to migrate to new environments, the choice to adopt new behaviour, the choice to prize certain qualities above others when selecting a mate - these volitional acts and more can alter the phenotypic fitness landscape and nudge evolution in new directions.\n \n Evidence of plastic, environmentally sensitive phenotypes is not evidence of the particular kind of environmentally-steered evolution you want to see. Good examples for you are those moths we were talking about, where the plasticity is adaptive and useful at both environmental extremes. But every time you post a link to a phenotypic sensitivity that has a potentially detrimental effect (eg the sickliness of Agouti mice on a methyl-sparse diet, the sickliness of cats on a taurine-deficient diet), you're undermining your own position. You're pointing out situations where phenotypic plasticity is harmful to the organism.", 
   {}, 
   282058, 
   null, 
   1188909360.0
  ], 
  [
   282152, 
   null, 
   "chemist99a", 
   "Epigenetics introduces the concept of free will into our idea of genetics.\"\n \n\n \n Well I have to admit thats a new one on me. But think about it SS. Genetics is hardly a device or process or means limited to intelligent organisms. Free-will on the other hand is restricted by many to man alone or to a very limited number of species. Or if you are a theist of the Christian stripe it has a very restricted meaning. I hardly believe that methylation patterns or the other biochemical mechanisms in epigenetics have anything to do with free-will at all.", 
   {}, 
   282149, 
   null, 
   1188912000.0
  ], 
  [
   282153, 
   null, 
   "lesz", 
   "Free-will on the other hand is restricted by many to man alone or to a very limited number of species.\n\n \n But according to the vitalists here, bacteria choose to mutate or not to mutate according to their own free will! After all, bacteria are faced with choices in their environments. Obviously, they must exercise free will in choosing which pathway to follow! Stands to reason... emoticon_xangel", 
   {}, 
   282152, 
   null, 
   1188912480.0
  ], 
  [
   282155, 
   null, 
   "chemist99a", 
   "Stands to reason...\n\n \n I'll have to check that with my liquid culture of E. coli in about 12 hours, the mass collective should be able to reach a consensus by then. After all 20 trillion E. coli cannot be wrong can they?", 
   {}, 
   282153, 
   null, 
   1188913320.0
  ], 
  [
   282374, 
   null, 
   "bertvan", 
   "But genes themselves need instructions for what to do, and where and when to do it.A human liver cell contains the same DNA as a brain cell, yet somehow it knows to code only those proteins needed for the functioning of the liver. Those instructions are found not in the letters of the DNA itself but on it, in an array of chemical markers and switches, known collectively as the epigenome, that lie along the length of the double helix. These epigenetic switches and markers in turn help switch on or off the expression of particular genes. Think of the epigenome as a complex software code, capable of inducing the DNA hardware to manufacture an impressive variety of proteins, cell types, and individuals\n\n \n Bertvan: The message is not the medium in which it is conveyed. The message itself is immaterial. The message may be conveyed by DNA molecules, but the \"Instructions\" are immaterial. Intelligence as an aspect of reality is a different way of looking at things. Materialists are within their right to hope that someday a mechanical explanation of how the environment might directly interact with the genome (no intelligence involved} to cause epigenetic phenomena, but that is promissory materialism. In the meantime non materialists are also within their right to see intelligent organization, organization that is in purposeful response to the environment as an intrinsic aspect of living systems.\n \n \n The even greater surprise is the recent discovery that epigenetic signals from the environment can be passed on from one generation to the next, sometimes for several generations, without changing a single gene sequence. It\\'s well established, of course, that environmental effects like radiation, which alter the genetic sequences in a sex cell\\'s DNA, can leave a mark on subsequent generations. Likewise, it\\'s known that the environment in a mother\\'s womb can alter the development of a fetus. What\\'s eye-opening is a growing body of evidence suggesting that the epigenetic changes wrought by one\\'s diet, behavior, or surroundings can work their way into the germ line and echo far into the future. Put simply, and as bizarre as it may sound, what you eat or smoke today could affect the health and behavior of your great-grandchildren.\n\n \n Bertvan: Endogenous Adaptive Mutagenesis is the concept that organisms, not their genomes, have limited ability to adapt intelligently and purposefully to environmental change. Such adaptations are inherited epigenetically, and only become encoded into the genome if persistent over generations. Religion has nothing to do with a concept, which is perfectly compatible with either theism or agnosticism. \n \n \nEpigenetics introduces the concept of free will into our idea of genetics.\"\n \n Such results hint at a seemingly anti-Darwinian aspect of heredity.\n", 
   {
    "post_info": {
     "post_title": "Theism is not the only alternative to materialism"
    }
   }, 
   282155, 
   null, 
   1189017300.0
  ], 
  [
   282476, 
   null, 
   "lesz", 
   "Endogenous Adaptive Mutagenesis is the concept that organisms, not their genomes, have limited ability to adapt intelligently and purposefully to environmental change. Such adaptations are inherited epigenetically, and only become encoded into the genome if persistent over generations. Religion has nothing to do with a concept, which is perfectly compatible with either theism or agnosticism.\n\n \n Unfortunately, there is no evidence for this concept. Although many organisms do adapt to their local environments, such adaptability evolved by Darwnian mechanisms. Second, even among those organisms that do adapt to different environments, there is no evidence such adaptability is the result of intelligence.\n \n Finally, there is no such thing as a Darwinian concept of heredity. Darwin had no valid concept of heredity. If some aspects of heredity turn out to be epigenetic as opposed to genetic, that in no way refutes Darwinian theory, which postulates descent with modification.\n \n I have no idea why epigenetic groupies have it in for Darwin so much, but they exaggerate his demise just as much as the loony Creationists.", 
   {}, 
   282374, 
   null, 
   1189079340.0
  ], 
  [
   282491, 
   null, 
   "Darwin of Subur", 
   "No scientists anywhere claim or support the notion that any organism can alter their own DNA. Human\\'s might be able to one day by gene therapy, but that is through use of advanced technology. Epigenetics does not mean anything to do with the genomes themselves. Only the arrangement and storage of DNA as a chemical. There is often confusion with conditions or diseases that aren\\'t genetic but are still hereditary. This is, however, just a misunderstanding.\n \n There is no reason why genetics should arise in a debate about free-will, as free-will and it\\'s existence would be decided by something more fundamental, physics.\n \n Free-will\\'s existance could be argued equally well in both directions by application of physics. As we could, with a powerful enough computer, map the interactions of all the atoms in the universe, we could predict people\\'s future actions, thus removing free will. BUT, we could never measure the movement of atoms to that degree of accuracy due to the uncertainty principle, so free will remains. In my view, as long as there is such a thing as consciousness, then there is free-will to all intents and purposes.", 
   {
    "post_info": {
     "post_title": "Wrong science"
    }
   }, 
   282476, 
   null, 
   1189089540.0
  ], 
  [
   283057, 
   null, 
   "chemist99a", 
   "In my view, as long as there is such a thing as consciousness, then there is free-will to all intents and purposes.\n\n \n \n Well for human consciousness anyway. Free-will being an experience which consciousness generates in most humans. The question of course remains as to whether the experience is deterministic or otherwise. My vote is that its FAPP deterministic meaning determined by the state of the universe immediately prior to making a volitional choice.", 
   {}, 
   282491, 
   null, 
   1189360080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Does free will exist?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10275-does-free-will-exist.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10275, 
  "discussion_files": [
   [
    "16288.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10275-does-free-will-exist-print.html"
   ], 
   [
    "16289.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10275-does-free-will-exist-6-print.html"
   ], 
   [
    "16290.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10275-does-free-will-exist-4-print.html"
   ], 
   [
    "16291.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10275-does-free-will-exist-5-print.html"
   ], 
   [
    "16292.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10275-does-free-will-exist-3-print.html"
   ], 
   [
    "16293.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10275-does-free-will-exist-2-print.html"
   ]
  ], 
  "identifier": 10275
 }
]