[
 [
  [
   280480, 
   null, 
   "Matthew S", 
   "I dicided to move this to another thread \n \nI watched most of this. It was scary and facinating. My German husband watched the christian part for a bit with me and was horrifed at how \"Nazi-ish\" these preachers and their followers are acting. He said they're using the same tactics that Hitler used to attract the youth movement and it's other followers. \n \n After watching this and watching Sicko. He's doesn't want to move to the states. He'll visit... But thinks this fundamentalist movement is incredibly dangerous. I love my country, but I really hate these fundamentalist, cafateria christian wacko's.\n\n \n Jsd he has good reason to fear this is what they are up to now and have been for sometime now.\n http://www.365gay.com/Newscon07/08/082407law.htm\n \n They want lawyers out there so they can spread thier evil message. They want to dominate society and impose upon the rest of us through the law their brand of evil fundamentalism. See to them the rest of us need to be controlled and told how to believe.", 
   {
    "post_info": {
     "post_title": "Christianist lawyers"
    }
   }, 
   null, 
   null, 
   1188049380.0
  ], 
  [
   280489, 
   null, 
   "chemist99a", 
   "Well I have to say that I think law training DELIBERATELY biased toward a Conservative Christian viewpoint does the students a disservice. US law is not biblically based and it hopefully will never be. What little I know of the lawyers coming out of these programs is less than impressive. They are not very compent. That may be because of a self-selection effect. Lawyers first of all need to be analytical, its difficult to find highly analytical people who will accept the premises being peddled by the likes of Falwell and Robetson. After all these gentleman blamed 9/11 on the sinful US culture rather than on the people who did the terrorist acts. And they blamed the destruction of NO by Katrina on the well known easy going life style of NO. Not to mention the attack of the teletubbies. Quality and excellence in education flow from the top of the organization down to the students. I don't think the people coming out of Lib U etx in law will stand much of a chanch against the best and brightest from Harvard and Yale etc.", 
   {}, 
   280480, 
   null, 
   1188055080.0
  ], 
  [
   280494, 
   null, 
   "Matthew S", 
   "Oh brother, yet another Christian bashing thread brought to you by our favorite hyocrite.\n \n Matthew, this truly is getting old!!\n\n \n Why am I a hypocrite exactly? Please explain why you think I am a hypocrite.\n from this site\n http://dictionary.reference.com/browse/hypocrite\n \n \nhyp·o·crite [hip-uh-krit] Pronunciation Key - Show IPA Pronunciation \n &#8211;noun 1. a person who pretends to have virtues, moral or religious beliefs, principles, etc., that he or she does not actually possess, esp. a person whose actions belie stated beliefs. \n 2. a person who feigns some desirable or publicly approved attitude, esp. one whose private life, opinions, or statements belie his or her public statements. \n \n [Origin: 1175&#8211;1225; ME ipocrite < OF < LL hypocrita < Gk hypokrits a stage actor, hence one who pretends to be what he is not, equiv. to hypokr(nesthai) (see hypocrisy) + -tés agent suffix]\n\n \n \nWordNet - Cite This Source hypocrite\n \n noun\n a person who professes beliefs and opinions that he or she does not hold in order to conceal his or her real feelings or motives \n\n \n Care to explain how you think I fit into this deffintion?", 
   {}, 
   280480, 
   null, 
   1188057180.0
  ], 
  [
   280502, 
   null, 
   "samiinh", 
   "There are a number of these christianist educational institutions that are supposedly preparing young believers into taking over the country, like Patrick Henry College, and Pat Robertson's Law School, which btw has shipped something like 150 attorneys who work for the Bush administration. \n \n I agree, Matt, these are evil programs.", 
   {}, 
   280494, 
   null, 
   1188062280.0
  ], 
  [
   280508, 
   null, 
   "Archangel", 
   "Why am I a hypocrite exactly? Please explain why you think I am a hypocrite.\n from this site\n http://dictionary.reference.com/browse/hypocrite\n \n Care to explain how you think I fit into this deffintion?\n\n \n That's easy, because any College, group or organization that promotes the liberal, socialist, pro gay and secular humanist perspective that encourages the \"if it feels good do it\" philosophy, then you praise and support it as liberated and progressive in its agenda. Forget that those same institutions promote an agenda to force their godless and secular humanist/atheistic World view on the rest of the majority of us as if we need a bunch of godless hypocrites to rewrite the traditional moral values that made this Country great in the first place. That is why you are a flaming hypocrite Matthew. Anymore questions I can answer for you ?", 
   {}, 
   280494, 
   null, 
   1188063540.0
  ], 
  [
   280509, 
   null, 
   "samiinh", 
   "That's easy, because any College, group or organization that promotes the liberal, socialist, pro gay and secular humanist perspective that encourages the \"if it feels good do it\" philosophy, then you praise and support it as liberated and progressive in its agenda. Forget that those same institutions promote an agenda to force their godless and secular humanist/atheistic World view on the rest of the majority of us as if we need a bunch of godless hypocrites to rewrite the traditional moral values that made this Country great in the first place. That is why you are a flaming hypocrite Matthew. Anymore questions I can answer for you ?\n\n \n Isn't this an adhomenin argument? An attack on Mathew? Isn't that against the forum rules?", 
   {}, 
   280508, 
   null, 
   1188063660.0
  ], 
  [
   280520, 
   null, 
   "Archangel", 
   "Isn't this an adhomenin argument? An attack on Mathew? Isn't that against the forum rules?\n\n \n Not at all. It's the absolute truth. Obviously something you wouldn't understand if your life depended on it.", 
   {}, 
   280509, 
   null, 
   1188064800.0
  ], 
  [
   280524, 
   null, 
   "chemist99a", 
   "Not at all. It's the absolute truth. Obviously something you wouldn't understand if your life depended on it.\n\n \n Ah yes the hallmark of the fanatic - a claim to know absolute truth! Well all I can say is that you have not been to law school or if you did you learned very little.", 
   {}, 
   280520, 
   null, 
   1188065040.0
  ], 
  [
   280526, 
   null, 
   "JSDKoeln", 
   "Not at all. It's the absolute truth. Obviously something you wouldn't understand if your life depended on it.\n\n \n You wouldn't know truth if it bit you in your ArseAngel! emoticon_xbouncer \n \n It's been nice not having you spread your disease all over the gay rights board all the time. Why are you back here? Nobody likes you, believes you and you have never won a single argument. Why don't you just go play with your own \"ilk?\"", 
   {}, 
   280520, 
   null, 
   1188065220.0
  ], 
  [
   280545, 
   null, 
   "Matthew S", 
   "That's easy, because any College, group or organization that promotes the liberal, socialist, pro gay and secular humanist perspective that encourages the \"if it feels good do it\" philosophy, then you praise and support it as liberated and progressive in its agenda. Forget that those same institutions promote an agenda to force their godless and secular humanist/atheistic World view on the rest of the majority of us as if we need a bunch of godless hypocrites to rewrite the traditional moral values that made this Country great in the first place. That is why you are a flaming hypocrite Matthew. Anymore questions I can answer for you ?\n\n \n That is because with liberals it is as you say if it feels good do it does not tell the fundie they can't do want they want. However the fundie wants to make laws that tell the liberal you can't do what feels good because it is against the funies religious belief.\n \n The fundie wants to control the liberal the liberal has no intrest in cotroll the fundie unless it is to stop the fundie from controlling the liberal. \n \n You want a nation were people only act as your religon tells them too. What you see as hypocrisy we see as self defense.", 
   {}, 
   280508, 
   null, 
   1188077640.0
  ], 
  [
   280546, 
   null, 
   "thelmoose", 
   "A Christian lawyer makes no sense. There is no such thing as Christian law, at least none that has any relevance to jurisprudence. It is another absurd anti-intellectual position of the fundamentalist Christian movement, and I cannot imagine anyone who cares about the law would attend such a ridiculous excuse for an institution of higher learning. One also would be crazy to hire such a person. \n \n Makes about as much sense as Christian psychotherapist.", 
   {}, 
   280545, 
   null, 
   1188079440.0
  ], 
  [
   280547, 
   null, 
   "thelmoose", 
   "That's easy, because any College, group or organization that promotes the liberal, socialist, pro gay and secular humanist perspective that encourages the \"if it feels good do it\" philosophy, then you praise and support it as liberated and progressive in its agenda. Forget that those same institutions promote an agenda to force their godless and secular humanist/atheistic World view on the rest of the majority of us as if we need a bunch of godless hypocrites to rewrite the traditional moral values that made this Country great in the first place. That is why you are a flaming hypocrite Matthew. Anymore questions I can answer for you ?\n\n \n Hey Moderator!! A little attention here!\n \n 1. You have mis-characterized all \"non-christian\" institutions of learning as liberal, socialist, and progay.\n 2. You have falsely and tritely accused secular humanism as encouraging \"the 'if it feels good do it' philosophy.\"\n 3. You have mis-characterized all \"non-christian\" institutions of learning as forcing a \"godless\" agenda on the \"rest of you\" and called them \"godless hypocrites\". \n 4. You have falsely accused same of attempting to rewrite traditional moral values. \n 5. You have called Matthew a \"flaming hypocrite\".\n \n This are false and inflammatory statements that should be censured.", 
   {}, 
   280508, 
   null, 
   1188079860.0
  ], 
  [
   280556, 
   null, 
   "chemist99a", 
   "That's easy, because any College, group or organization that promotes the liberal, socialist, pro gay and secular humanist perspective that encourages the \"if it feels good do it\" philosophy, then you praise and support it as liberated and progressive in its agenda. \n\n \n You could at least have expressed your venom as a complete thought - ie an English sentience. You know the proposed official language of the US?\n \n \nForget that those same institutions promote an agenda to force their godless and secular humanist/atheistic World view on the rest of the majority of us\n \n \n OK as the wise guys would say \"fergetaboutit\".\n \n \n \nas if we need a bunch of godless hypocrites to rewrite the traditional moral values that made this Country great in the first place. That is why you are a flaming hypocrite Matthew. Anymore questions I can answer for you ?\n \n\n \n Well one thing we do not need is a bunch of hypocrites rewriting the historical development of the US as a nation. But as for the values upon which the nation was founded perhaps you need a few history lessons. Perhaps quite a few history lessons in fact. We were NOT founded as a CHRISTIAN nation, we were founded as a secular one and our traditional values are profoundly secular in their origins and application. The hardest thing for the founders to deal with was our diversity (from the beginning mind you) and the result was a compromise allowing various belief systems to live in harmony under a secular constitution. But then perhaps you already knew that and are merely distorting the truth for rhetorical purposes. (Like GB comparing our role in Iraq to our role in Japan).", 
   {}, 
   280526, 
   null, 
   1188083940.0
  ], 
  [
   280561, 
   null, 
   "samiinh", 
   "About 150 of these Christer Lawyers work in the Bush Administration's Justice Department, graduates from Pat Robertson School of Christer Law.", 
   {}, 
   280556, 
   null, 
   1188085680.0
  ], 
  [
   280566, 
   null, 
   "thelmoose", 
   "About 150 of these Christer Lawyers work in the Bush Administration's Justice Department, graduates from Pat Robertson School of Christer Law.\n\n \n \n That is some scary stuff.\n http://www.huffingtonpost.com/max-blumenthal/monica-goodling-one-of-1_b_44588.html\n \n http://www.slate.com/id/2163601/\n \n Apparently John Ashcroft teaches there, now, as well.", 
   {}, 
   280561, 
   null, 
   1188087000.0
  ], 
  [
   280574, 
   null, 
   "chemist99a", 
   "Tis a good thing these Christian lawyers were not around in Christs day - if they had been then it seems likely Jesus may have won at his prelim hearing and we would all be burdened with unforgivable sins while christ would have lived out his days making furniture and going fishing on the sea of galilee without needing a boat! It just would not be the same world would it.", 
   {}, 
   280566, 
   null, 
   1188088440.0
  ], 
  [
   280612, 
   null, 
   "Archangel", 
   "Hey Moderator!! A little attention here!\n \n 1. You have mis-characterized all \"non-christian\" institutions of learning as liberal, socialist, and progay.\n 2. You have falsely and tritely accused secular humanism as encouraging \"the 'if it feels good do it' philosophy.\"\n 3. You have mis-characterized all \"non-christian\" institutions of learning as forcing a \"godless\" agenda on the \"rest of you\" and called them \"godless hypocrites\". \n 4. You have falsely accused same of attempting to rewrite traditional moral values. \n 5. You have called Matthew a \"flaming hypocrite\".\n \n This are false and inflammatory statements that should be censured.\n\n \n Sure, your side can make extreme statements that defame and slander my side and when you do it, your just giving your honest opinion, but when I define your hate speech as what it is, I'm falsely accusing and mischaracterizing you ? Sorry but I stand by everything I said and insist that I hit the nail right on the head in defining Matthew. And I repeat it here for your edification.\n \n \n \n That's easy, because any College, group or organization that promotes the liberal, socialist, pro gay and secular humanist perspective that encourages the \"if it feels good do it\" philosophy, then you praise and support it as liberated and progressive in its agenda. Forget that those same institutions promote an agenda to force their godless and secular humanist/atheistic World view on the rest of the majority of us as if we need a bunch of godless hypocrites to rewrite the traditional moral values that made this Country great in the first place. That is why you are a flaming hypocrite Matthew. Anymore questions I can answer for you ?\n", 
   {}, 
   280547, 
   null, 
   1188099900.0
  ], 
  [
   280648, 
   null, 
   "Matthew S", 
   "Speaking from Experience??\n \n Oh BTW, AA is correct about this. You hem and haw over \"tolerance\" and \"acceptance\" as long as it lines right up with your worldview, but \"Oh no the horror\" when people who disagree with you have the audacity to speak up. I think what your side wants is for Conservatives to just shut up. Now how tolerant and accepting is that, Hmmm?\n\n \n Humm intresting since the left preaches tolerance you believe we need to be tolerant of hate, bigotry, oppression, and peoples religious beliefs that get tranformed into laws that oppress us. Do you also believe that someone getting beat needs to be tolerant of getting the beating that they need to supply that bat also?\n \n No where does any one on the left preach tolerance for hate. What christianists do is preach hate.", 
   {}, 
   280612, 
   null, 
   1188135720.0
  ], 
  [
   280649, 
   null, 
   "Bassman", 
   "Humm intresting since the left preaches tolerance you belive we need to be tolerant of hate, bigotry, oppression, and peoples religious beliefs that get tranformed into laws that oppress us. Do you also believe that someone getting beat needs to be tolerant of getting the beating that they need to suply that bat also?\nWhat I refer to is the double standard routinely exhibited by the Left. Again, they bitch and moan about \"tolerance\" and \"acceptance\" so long as everybody marches in lockstep (or dare I say \"Goosestep\") with them and no dissent.", 
   {}, 
   280648, 
   null, 
   1188135900.0
  ], 
  [
   280651, 
   null, 
   "samiinh", 
   "What I refer to is the double standard routinely exhibited by the Left. Again, they bitch and moan about \"tolerance\" and \"acceptance\" so long as everybody marches in lockstep (or dare I say \"Goosestep\") with them and no dissent.\n\n \n I think you need to look in the mirror, Mr. Bassman. It is the convervative, neocon, chicken-hawk christiaist like yourself who do the goosestepping.", 
   {}, 
   280649, 
   null, 
   1188136860.0
  ], 
  [
   280653, 
   null, 
   "Bassman", 
   "I think you need to look in the mirror, Mr. Bassman. It is the convervative, neocon, chicken-hawk christiaist like yourself who do the goosestepping.\n\n Really??? Who are the ones who always tout themselves as \"progressive\", \"enlightened\", \"reasoned\", \"Intellectuals\"; when in fact they are snobs, elitist, condescending, intolerant, angry at everything and everyone who dares oppose them?? Yep it's the good old lunatic Left", 
   {}, 
   280651, 
   null, 
   1188137760.0
  ], 
  [
   280655, 
   null, 
   "samiinh", 
   "Who are the ones who always tout themselves as \"progressive\", \"enlightened\", \"reasoned\", \"Intellectuals\"; when in fact they are snobs, elitist, condescending, intolerant, angry at everything and everyone who dares oppose them?? Yep it's the good old delusional right.", 
   {}, 
   280653, 
   null, 
   1188139020.0
  ], 
  [
   280657, 
   null, 
   "Matthew S", 
   "What I refer to is the double standard routinely exhibited by the Left. Again, they bitch and moan about \"tolerance\" and \"acceptance\" so long as everybody marches in lockstep (or dare I say \"Goosestep\") with them and no dissent.\n\n \n What you see as intolerance is self defense.\n \n The conservative wants to control the liberal.\n \n Example sodomy laws\n \n The liberal does not favor sodomy laws but the conservative does. The conservative wants stop the liberal from the act of sodomy wereas the liberal wants be free to ingage in sodomy and would never stop the conservative from the act of sodomy. The conservative wants to use his religious beliefs to interfere with the lives of the liberal but the liberal believes in personal freedom to act as one sees fit. \n \n Conservative=box, stay within the lines, do as your told.\n Liberal=freedom to be who you want to be\n \n Conservatives are the enemy of personal liberty and freedom.", 
   {}, 
   280649, 
   null, 
   1188139140.0
  ], 
  [
   280665, 
   null, 
   "Bassman", 
   "Who are the ones who always tout themselves as \"progressive\", \"enlightened\", \"reasoned\", \"Intellectuals\"; when in fact they are snobs, elitist, condescending, intolerant, angry at everything and everyone who dares oppose them?? Yep it's the good old delusional right.\n\n Boy Sam, batting .000 there?", 
   {}, 
   280655, 
   null, 
   1188141420.0
  ], 
  [
   280666, 
   null, 
   "Bassman", 
   "What you see as intolerance is self defense.\n \n The conservative wants to control the liberal.\n \n Example sodomy laws\n \n The liberal does not favor sodomy laws but the conservative does. The conservative wants stop the liberal from the act of sodomy wereas the liberal wants be free to ingage in sodomy and would never stop the conservative from the act of sodomy. The conservative wants to use his religious beliefs to interfere with the lives of the liberal but the liberal believes in personal freedom to act as one sees fit. \n \n Conservative=box, stay within the lines, do as your told.\n Liberal=freedom to be who you want to be\n \n Conservatives are the enemy of personal liberty and freedom.\n\n Well, no that's where you're wrong. Freedom, by definition isn't being able to do whatever you want to. Freedom is having the power and ability to do what you ought to do. IOW, working within the parameters of the law, doing what is correct, right, and proper. And if that steps on the toes of those who favor an \"anything goes\" mentality? Tough! Conservatism doesn't advocate quashing free speech by government or judicial edict. Conservatism doesn't advocate dictating people's lives (re. smoking bans, etc.), And Conservatism absolutely does not advocate redefining the family nor marriage just to appease the whims of a miniscule and vocal minority.", 
   {}, 
   280657, 
   null, 
   1188141720.0
  ], 
  [
   280676, 
   null, 
   "davenport15", 
   " And Conservatism absolutely does not advocate redefining the family nor marriage just to appease the whims of a miniscule and vocal minority.\n\n \n Oh, I get so tired of this misleading \"redefining the family nor marriage\" ####. My husband and I share a house, finances, pets, we take care of each other's family, pay taxes, contribute to the community. What's to redefine? We're married. We're a family. Our straight next door neighbors accept us. We are equal in every sense of the word except this: you enjoy special rights because the government acknowledges your marriage.\n \n What's it to you, Bassman? Why do you even care? How does full government acceptance of our marriage effect you? You're a conservative, I'd think you'd want the government to butt out of our relationship.\n \n Same Sex Marriage is a conservative principle. Accept it.", 
   {}, 
   280666, 
   null, 
   1188145260.0
  ], 
  [
   280680, 
   null, 
   "Bassman", 
   "What's it to me is the confusion that results when this happens. When I was growing up ('70s-80s) there were clear-cut definitions of marriage and family. No confusion. It is only when the militant gay rights activists and their willing allies in the Democrat party and the lamestream media started this who idea of \"acceptance\" of a lifestyle choice (I don't give a tinker's damn what the Liberal \"scientists\" say) that's considered abnormal.", 
   {}, 
   280676, 
   null, 
   1188145500.0
  ], 
  [
   280681, 
   null, 
   "JSDKoeln", 
   "Oh, I get so tired of this misleading \"redefining the family nor marriage\" ####. My husband and I share a house, finances, pets, we take care of each other's family, pay taxes, contribute to the community. What's to redefine? We're married. We're a family. Our straight next door neighbors accept us. We are equal in every sense of the word except this: you enjoy special rights because the government acknowledges your marriage.\n \n What's it to you, Bassman? Why do you even care? How does full government acceptance of our marriage effect you? You're a conservative, I'd think you'd want the government to butt out of our relationship.\n \n Same Sex Marriage is a conservative principle. Accept it.\n\n \n And then we start getting called hypocrites by these conservatives. :xbanghead", 
   {}, 
   280676, 
   null, 
   1188145560.0
  ], 
  [
   280684, 
   null, 
   "Bassman", 
   "And then we start getting called hypocrites by these conservatives. :xbanghead\n\n \n See you forget that I'm also a social Conservative. That's why I'm registered RTL and not Dem nor GOP.", 
   {}, 
   280681, 
   null, 
   1188145680.0
  ], 
  [
   280685, 
   null, 
   "davenport15", 
   "What's it to me is the confusion that results when this happens. When I was growing up ('70s-80s) there were clear-cut definitions of marriage and family. No confusion. It is only when the militant gay rights activists and their willing allies in the Democrat party and the lamestream media started this who idea of \"acceptance\" of a lifestyle choice (I don't give a tinker's damn what the Liberal \"scientists\" say) that's considered abnormal.\n\n \n Oh, come on, Bassman. You're old enough to stop being so confused. Get over it.\n \n Everything you say that was \"clear-cut\" was a lie. If you knew anything about history, you'd understand that the cracks were already showing in the veneer of this clear-cut wonderland you talk about it in the 50s (read the fiction of John Cheever and Richard Yates).\n \n The 70s and 80s were anything but the halcyon days you paint them as. What was emerging was a society that refused to live within the confines of the lies that had been projected. People were finally celebrating the diversity of human relationships. The \"militant gay rights activists\" you talk about are ordinary citizens who expect their government to treat them with dignity, honesty, and fairness.\n \n You want to be confused? Start asking around your parents and aunts and uncles and peers for those hidden stories - the little nasty skeletons that hide in all their closets. They're there. \n \n And can you reach beyond your Bill O'Reillyisms when discussing \"liberal\" scientists? You really show your ignorance there.", 
   {}, 
   280680, 
   null, 
   1188146220.0
  ], 
  [
   280688, 
   null, 
   "samiinh", 
   "See you forget that I'm also a social Conservative. That's why I'm registered RTL and not Dem nor GOP.\n\n \n It's obvious you didn't grow up. Freedom is having the power and ability to do what you ought to do. And who decides \"what you ought to do?\" YOU? NFW.", 
   {}, 
   280684, 
   null, 
   1188147240.0
  ], 
  [
   280708, 
   null, 
   "jyoshu", 
   "What's it to me is the confusion that results when this happens. When I was growing up ('70s-80s) there were clear-cut definitions of marriage and family. No confusion. It is only when the militant gay rights activists and their willing allies in the Democrat party and the lamestream media started this who idea of \"acceptance\" of a lifestyle choice (I don't give a tinker's damn what the Liberal \"scientists\" say) that's considered abnormal.\n\n \n The real conservative position (not neocon) would be to live and let live, and stay out of peoples' business. Why should it matter what people want to do? If the norms of family in general change over time, so what? I used to get all concerned over this kind of thing too, but really, the bottom line is that what people do is their business as long as it's not illegal and doesn't affect you personally. That doesn't mean you can't hold to the belief that it's morally wrong, but you are accountable to yourself or your God; they aren't accountable to you. If you don't believe other family arrangements are ok, then don't have one of those other family arrangements. No one is making you. \n \n I'm of the opinion that there's never going to be a time when it's not normal for men and women to marry each other and have families. In other words, that reality is just not being threatened. Other things may become more the norm than they are, but let's face it--as long as men and women are attracted to each other they're going to still form relationships and have families. Your preferred family structure is not in danger, so why not live and let live when it comes to other forms of families that exist? It's their business.", 
   {}, 
   280680, 
   null, 
   1188153120.0
  ], 
  [
   280709, 
   null, 
   "samiinh", 
   "The real conservative position (not neocon) would be to live and let live, and stay out of peoples' business. Why should it matter what people want to do? If the norms of family in general change over time, so what? I used to get all concerned over this kind of thing too, but really, the bottom line is that what people do is their business as long as it's not illegal and doesn't affect you personally. That doesn't mean you can't hold to the belief that it's morally wrong, but you are accountable to yourself or your God; they aren't accountable to you. If you don't believe other family arrangements are ok, then don't have one of those other family arrangements. No one is making you. \n \n I'm of the opinion that there's never going to be a time when it's not normal for men and women to marry each other and have families. In other words, that reality is just not being threatened. Other things may become more the norm than they are, but let's face it--as long as men and women are attracted to each other they're going to still form relationships and have families. Your preferred family structure is not in danger, so why not live and let live when it comes to other forms of families that exist? It's their business.\n\n \n I am amazed. This is the most support post I've ever seen you write. Thank you.", 
   {}, 
   280708, 
   null, 
   1188153360.0
  ], 
  [
   280714, 
   null, 
   "Matthew S", 
   "I am amazed. This is the most support post I've ever seen you write. Thank you.\n\n \n Don't be jyoshu has always been a gay rights supporter up to and including civil unions. He just has a problem with gay people using the word marriage to discribe our marriages. jyoshu's stumbling block is one word \"marriage\"", 
   {}, 
   280709, 
   null, 
   1188154320.0
  ], 
  [
   280717, 
   null, 
   "jyoshu", 
   "I am amazed. This is the most support post I've ever seen you write. Thank you.\n\n \n Well, make no mistake--I do still believe gay relationships aren't morally ok. But I'm just saying that the bottom line is that what people do with their own life is their business as long as it's not illegal and doesn't personally hurt anyone. It cannot be denied that other family arrangements than the husband/wife/children one exist, and even do well. That's reality, and people might as well accept it. If the family structure that Bassman prefers were truly in danger, it might be one thing. But it just really isn't.", 
   {}, 
   280709, 
   null, 
   1188154620.0
  ], 
  [
   280727, 
   null, 
   "Bassman", 
   "Well, make no mistake--I do still believe gay relationships aren't morally ok. But I'm just saying that the bottom line is that what people do with their own life is their business as long as it's not illegal and doesn't personally hurt anyone. It cannot be denied that other family arrangements than the husband/wife/children one exist, and even do well. That's reality, and people might as well accept it. If the family structure that Bassman prefers were truly in danger, it might be one thing. But it just really isn't.\nIt truly is in danger if the militants get their way. When the lines get so blurred that anything goes, then the foundation of any society, the family, is compromised.", 
   {}, 
   280717, 
   null, 
   1188156720.0
  ], 
  [
   280729, 
   null, 
   "samiinh", 
   "It truly is in danger if the militants get their way. When the lines get so blurred that anything goes, then the foundation of any society, the family, is compromised.\n\n \n So you believe gay relationships will do this? How so? And where is your evidence? This is nonsense.", 
   {}, 
   280727, 
   null, 
   1188157200.0
  ], 
  [
   280735, 
   null, 
   "Bassman", 
   "So you believe gay relationships will do this? How so? And where is your evidence? This is nonsense.\nPlease reread the latter half of my statement. The family is the basic building block of any civilized society. Once the roles of the family become confused, then the foundation becomes eroded. With no thanks to Kinsey and the so-called \"sexual revolution\" that brought us abortion-on-demand (to the tune of 45 million unborn murdered since '73), welfare and the abandonment of fathers, and now, a miniscule and vocal minority (yes I refer to the homosexuals) demanding special rights to blur the line even further, yes, the traditional heterosexual two parent monogamous family structure has been attacked!!", 
   {}, 
   280729, 
   null, 
   1188157740.0
  ], 
  [
   280747, 
   null, 
   "Bassman", 
   "Oh Bull. It exists only in your fantasies, Bassboy. I call you boy because you are definite not a man.\n\n Why? because I do not subscribe to your communist Leftwingnut ideology??", 
   {}, 
   280735, 
   null, 
   1188158700.0
  ], 
  [
   280752, 
   null, 
   "samiinh", 
   "Why? because I do not subscribe to your communist Leftwingnut ideology??\n\n \n Why do I not see you as a man? Because you live in a fantasy world like a child. You are not alone in the fantasy world. Many of you righwing idealogs are just as deluded. I have suggested nothing in these debate forums that would suggest that I support a communist system of government. That is simply another of your many adhomeni attacks that I'm frankly getting tired of.", 
   {}, 
   280747, 
   null, 
   1188159300.0
  ], 
  [
   280753, 
   null, 
   "thelmoose", 
   "It truly is in danger if the militants get their way. When the lines get so blurred that anything goes, then the foundation of any society, the family, is compromised.\n\n \n Have you considered that not all gay relationships are militant? Does emotionally labeling something you disagree with something you need to do to bolster your argument?\n Have you considered that considering gay relationships as legitimate is not even close to the same thing as \"anything goes\".\n Aren't you being melodramatic and silly to say this will lead to compromise of family and the foundation of society.\n Those are alarmist and irrational claims. To the extent that there has been a change in society in the direction you fear, there is no evidence of any progression toward your dire claims. \n If you can name a single objective cause and effect relationship between gay couples and the crumbling of the foundation of society, I would like to hear it.", 
   {}, 
   280727, 
   null, 
   1188159360.0
  ], 
  [
   280768, 
   null, 
   "JSDKoeln", 
   "Please reread the latter half of my statement. The family is the basic building block of any civilized society. Once the roles of the family become confused, then the foundation becomes eroded. With no thanks to Kinsey and the so-called \"sexual revolution\" that brought us abortion-on-demand (to the tune of 45 million unborn murdered since '73), welfare and the abandonment of fathers, and now, a miniscule and vocal minority (yes I refer to the homosexuals) demanding special rights to blur the line even further, yes, the traditional heterosexual two parent monogamous family structure has been attacked!!\n\n \n Southern Bible-Thumper Christers have about a 55% failure rate in their first marriage. Those Hethens in Mass have a considerably less divorce rate. Most children are growing up in broken heterosexual homes... so much for your moralistic \"building blocks.\" You guys aren't doing such a good job at holding the moral fabric of society together, IMO.\n \n So all abortions are Kinsey's fault now. He caused abortions! WOW! BassEinstein!!!! Sheesh.... Do you really think anyone with half a brain is going to even give your perposterous notion a second thought other than to make laugh at you? You Christer's always claim the \"pro-life\" name. I'd like to change it to: \"pro-life until after you are born, then you're on your own kid!\" 45 million died... well, there are more than 45 million in the world, unadopted, without health insurance, living in poverty, living in war zones, growing up in abusive homes... and you want to feed this. YOu're shortsited. One would think that you're now blaming those 'darned gays for abortion!\n \n And, ****Man, 5-7% is NOT miniscule.... perhaps your view of the world and your compassion is. Talk about a facaist, militant view of the world!", 
   {}, 
   280735, 
   null, 
   1188160620.0
  ], 
  [
   280769, 
   null, 
   "JSDKoeln", 
   "Have you considered that not all gay relationships are militant? Does emotionally labeling something you disagree with something you need to do to bolster your argument?\n Have you considered that considering gay relationships as legitimate is not even close to the same thing as \"anything goes\".\n Aren't you being melodramatic and silly to say this will lead to compromise of family and the foundation of society.\n Those are alarmist and irrational claims. To the extent that there has been a change in society in the direction you fear, there is no evidence of any progression toward your dire claims. \n If you can name a single objective cause and effect relationship between gay couples and the crumbling of the foundation of society, I would like to hear it.\n\n \n A \"Militant\" gay relationship? What would that be? Is he referring to these camoflage pants 'dem darned gays keep wearing? Is this a fashion thing? emoticon_xdonno", 
   {}, 
   280753, 
   null, 
   1188160800.0
  ], 
  [
   280783, 
   null, 
   "chemist99a", 
   "The family is the basic building block of any civilized society. Once the roles of the family become confused, then the foundation becomes eroded. \n\n \n I take then that you think that proper roles within a family of the various members are somehow set by something or other as being fixed and immutable and that any deviations from these \"standards\" somehow constitute confusion.\n \n Please for our edification tell us what the proper roles for men and women are in a family. Please tell us what you mean by \"confused\". Do you subscribe to the Southern Bapist Convention rules? Islamic Law? Jewish Law? Should women be allowed to be the bread winners? Should the man provide child care, and domestic homemaking? If a couple is lesbian who should get what role? Must both stay home an be house keepers? If male homsexual partners, must both work? And if such couples adopt children who gets what role in your humble opinion? And just how does the heterosexual family not lead to confusion if the parents take on the \"traditional\" roles?????", 
   {}, 
   280769, 
   null, 
   1188162480.0
  ], 
  [
   280784, 
   null, 
   "Steeeeve", 
   "Who are the ones who always tout themselves as \"progressive\", \"enlightened\", \"reasoned\", \"Intellectuals\"; when in fact they are snobs, elitist, condescending, intolerant, angry at everything and everyone who dares oppose them?? Yep it's the good old delusional right.\n\n \n I guess Hillary Clinton is \"right\" to you??", 
   {}, 
   280655, 
   null, 
   1188162540.0
  ], 
  [
   280789, 
   null, 
   "chemist99a", 
   "With no thanks to Kinsey and the so-called \"sexual revolution\" that brought us abortion-on-demand (to the tune of 45 million unborn murdered since '73), welfare and the abandonment of fathers, and now, a miniscule and vocal minority (yes I refer to the homosexuals) demanding special rights to blur the line even further, yes, the traditional heterosexual two parent monogamous family structure has been attacked!!\n\n \n Its a wonder all those traditional heterosexual relationships cause so many abortions while at the same time homosexual relationships have caused not a single abortion on the record. Its obvious that traditional heterosexual values need some kind of repair.\n \n As to rights I think that homosexual couples would be quite happy simply to achieve equal treatment under the laws of the land with regard to their legal rights attributable to a relationship of a heterosexual couple who unites in official civil marriage. And claiming that the formation of civil unions or legal secular marriages (if you wish to use the term) somehow attack the heterosexual family - how is that? Would the homosexual couples be coercing heterosexuals in some way, would they be taking rights away from them? How does equal treatment under secular law attack the marriages of heterosexuals and their raising of families? I do not understand that charge at all, it simply makes no sense. Given that people do have different sexual preferences are you saying that the emergence of legal homosexual unions would somehow make committed heterosexuals with traditional heterosexual family values throw their values overboard and become homosexuals instead? Really? How do you picture this happening?", 
   {}, 
   280783, 
   null, 
   1188163020.0
  ], 
  [
   280791, 
   null, 
   "GiantOreo", 
   "Have you considered that not all gay relationships are militant? Does emotionally labeling something you disagree with something you need to do to bolster your argument?\n Have you considered that considering gay relationships as legitimate is not even close to the same thing as \"anything goes\".\n Aren't you being melodramatic and silly to say this will lead to compromise of family and the foundation of society.\n Those are alarmist and irrational claims. To the extent that there has been a change in society in the direction you fear, there is no evidence of any progression toward your dire claims. \n If you can name a single objective cause and effect relationship between gay couples and the crumbling of the foundation of society, I would like to hear it.\n\n \n It's not only alarmist and irrational, it is also a fallacy - Slippery Slope to be exact.\n \n I, too, would like to hear him name an objective cause and effect between gay couples and the crumbling od the foundation of society. Preferably in one of the many countries that has established Gay marriage, Domestic partnership, and show us how that country has crumbled.", 
   {}, 
   280753, 
   null, 
   1188163140.0
  ], 
  [
   280793, 
   null, 
   "Bassman", 
   "Its a wonder all those traditional heterosexual relationships cause so many abortions while at the same time homosexual relationships have caused not a single abortion on the record. Its obvious that traditional heterosexual values need some kind of repair.\n \n As to rights I think that homosexual couples would be quite happy simply to achieve equal treatment under the laws of the land with regard to their legal rights attributable to a relationship of a heterosexual couple who unites in official civil marriage. And claiming that the formation of civil unions or legal secular marriages (if you wish to use the term) somehow attack the heterosexual family - how is that? Would the homosexual couples be coercing heterosexuals in some way, would they be taking rights away from them? How does equal treatment under secular law attack the marriages of heterosexuals and their raising of families? I do not understand that charge at all, it simply makes no sense. Given that people do have different sexual preferences are you saying that the emergence of legal homosexual unions would somehow make committed heterosexuals with traditional heterosexual family values throw their values overboard and become homosexuals instead? Really? How do you picture this happening?\n\n \n What has drawn my ire is how this country has degraded from what it once was. Yes I mean it is worse than it was in the 1950's when stable two-parent households were the norm.", 
   {}, 
   280789, 
   null, 
   1188163320.0
  ], 
  [
   280794, 
   null, 
   "chemist99a", 
   "It truly is in danger if the militants get their way. When the lines get so blurred that anything goes, then the foundation of any society, the family, is compromised.\n\n \n So what do you picture? Roving bands of rabid homosexuals running around with guns forcing heterosexual couples to break up and become homosexuals by assigning each heterosexual a homosexual mate and forcing them to live together against their preferences?????? Heterosexual slavery, forced to be sex toys of the much more aggressive and dominant homosexuals? A takeover of society by the village people? The Indian Chief as President? The construction guy as Secretary of Labor? What????", 
   {}, 
   280784, 
   null, 
   1188163320.0
  ], 
  [
   280798, 
   null, 
   "GiantOreo", 
   "It truly is in danger if the militants get their way. When the lines get so blurred that anything goes, then the foundation of any society, the family, is compromised.\n Then that family is pretty weak if two men getting hitched, or two women being married \"compromises it\". If the Family is that fragile that some strangers getting married will cause irreperable damage to it, maybe that Family really didn't deserve to exist in the first place.\n \n \n \nPlease reread the latter half of my statement. The family is the basic building block of any civilized society. Once the roles of the family become confused, then the foundation becomes eroded. With no thanks to Kinsey and the so-called \"sexual revolution\" that brought us abortion-on-demand (to the tune of 45 million unborn murdered since '73), welfare and the abandonment of fathers, and now, a miniscule and vocal minority (yes I refer to the homosexuals) demanding special rights to blur the line even further, yes, the traditional heterosexual two parent monogamous family structure has been attacked!!\n\n Ah, so you'd have us go back to the days when the woman was only good for staying home, around the kitchen, barefoot, and catering to every desire of the Man when he comes home. Cuz we all know that that's the only thing a woman is good for. emoticon_xdonno \n \n \nWhy? because I do not subscribe to your communist Leftwingnut ideology??\n\n \n And here was the man that wanted to be moderator to stop the insults ad such in the Gay Rights forum. emoticon_xdonno", 
   {}, 
   280727, 
   null, 
   1188163560.0
  ], 
  [
   280801, 
   null, 
   "chemist99a", 
   "What has drawn my ire is how this country has degraded from what it once was. Yes I mean it is worse than it was in the 1950's when stable two-parent households were the norm.\n\n \n Were they really? In the 1950s? Ozzie and Harriet when neither parent seemed to actually work? When husband and wife never apparently even had sex or at least were presumed not to? So where did all those darn baby boomers come from? Do you think the 1950s were \"normal\"? Do you want to go back to when families were stable and schools were separate but equal and the black man knew his place {hint at the bottom}. Heck they did not even have McDonalds or Starbucks, did you perhaps NOT live through the 1950s? And you are attributing the social and economic stability (both of which are largely mythical - being promulgated mostly on that new thing called TV and by propaganda to get Rosie the riviter to stay home and let the men have the jobs) to the nuclear family? How do you know it was not due to the fact that the country had just won WWII the largest conflict of the century and had come out of it with little or no damage to its industry or infrastructure and that for a while the US was the only nuclear power (and thats not nuclear faimily). And are you neglectiing to include the cold war in your assessment? The 1950s HA.", 
   {}, 
   280794, 
   null, 
   1188163740.0
  ], 
  [
   280805, 
   null, 
   "chemist99a", 
   "By the way when did the idea of equal treatment under the law become a communist principle? Or for that matter even a liberal idea. Isn't that like an American principle which we used to all endorse as a people? Whats it say over the entrance to the US Supreme Court? And were not the communists darn hard on homosexuals, did they not send em to the gulag whenever possible? I think so. What does the declaration of independence and the constitution have to say about equal treatment? I am sure that Jefferson at least being a Grecophile would understand homosexuality (and homosexual couples) as being an ancient feature of lifestyle quite compatible with democracy as would any student of Roman history for that matter.", 
   {}, 
   280801, 
   null, 
   1188164100.0
  ], 
  [
   280807, 
   null, 
   "Truthsayer", 
   "Ahhh yes...\n \n The good ol' days. Crewcuts, black horn-rimmed glasses. Do-wop.\n \n A man could light up a Lucky Strike in a courtroom if he wanted to. We could burn our garbage in the backyard. It wasn't anybody's business when he had to whip the wife back into shape. Children understood fear. Blacks knew their place.\n \n Apple pie. Yum, yum.\n \n What has America come to? emoticon_rolleyes \n \n Those were the days.....\n \n \n \n \n \n Edith! Bring me my slippers!", 
   {}, 
   280798, 
   null, 
   1188164160.0
  ], 
  [
   280808, 
   null, 
   "Bassman", 
   "Were they really? In the 1950s? Ozzie and Harriet when neither parent seemed to actually work? When husband and wife never apparently even had sex or at least were presumed not to? So where did all those darn baby boomers come from? Do you think the 1950s were \"normal\"? Do you want to go back to when families were stable and schools were separate but equal and the black man knew his place {hint at the bottom}. Heck they did not even have McDonalds or Starbucks, did you perhaps NOT live through the 1950s? And you are attributing the social and economic stability (both of which are largely mythical - being promulgated mostly on that new thing called TV and by propaganda to get Rosie the riviter to stay home and let the men have the jobs) to the nuclear family? How do you know it was not due to the fact that the country had just won WWII the largest conflict of the century and had come out of it with little or no damage to its industry or infrastructure and that for a while the US was the only nuclear power (and thats not nuclear faimily). And are you neglectiing to include the cold war in your assessment? The 1950s HA.\n\n So you'd rather take the \"If it feels good do it\" mentality of the '70s?? or the \"tune in, turn on, drop out\" LSD laden filth of the '60s?? Pathetic.", 
   {}, 
   280801, 
   null, 
   1188164220.0
  ], 
  [
   280812, 
   null, 
   "Bassman", 
   "By the way when did the idea of equal treatment under the law become a communist principle? Or for that matter even a liberal idea. Isn't that like an American principle which we used to all endorse as a people? Whats it say over the entrance to the US Supreme Court? And were not the communists darn hard on homosexuals, did they not send em to the gulag whenever possible? I think so. What does the declaration of independence and the constitution have to say about equal treatment? I am sure that Jefferson at least being a Grecophile would understand homosexuality (and homosexual couples) as being an ancient feature of lifestyle quite compatible with democracy as would any student of Roman history for that matter.\n\n Yet you conveniently forget that this country was founded on Judeo-Christian principles. Not Greek Culture", 
   {}, 
   280805, 
   null, 
   1188164340.0
  ], 
  [
   280819, 
   null, 
   "samiinh", 
   "Ahhh yes...\n \n The good ol' days. Crewcuts, black horn-rimmed glasses. Do-wop.\n \n A man could light up a Lucky Strike in a courtroom if he wanted to. We could burn our garbage in the backyard. It wasn't anybody's business when he had to whip the wife back into shape. Children understood fear. Blacks knew their place.\n \n Apple pie. Yum, yum.\n \n What has America come to? emoticon_rolleyes \n \n Those were the days.....\n \n \n \n \n \n Edith! Bring me my slippers!\n\n \n Yep, the good old days. wasn't around then to know the hypocrisy that was the 1950s and 1960s. I'm afraid that almost every family is dysfunctional is some way or other. I'll just bet Bassboy's is if he were to really be honest about it.", 
   {}, 
   280807, 
   null, 
   1188164880.0
  ], 
  [
   280853, 
   null, 
   "Matthew S", 
   "Ahhh yes...\n \n The good ol' days. Crewcuts, black horn-rimmed glasses. Do-wop.\n \n A man could light up a Lucky Strike in a courtroom if he wanted to. We could burn our garbage in the backyard. It wasn't anybody's business when he had to whip the wife back into shape. Children understood fear. Blacks knew their place.\n \n Apple pie. Yum, yum.\n \n What has America come to? emoticon_rolleyes \n \n Those were the days.....\n \n \n \n \n \n \n \n \n Edith! Bring me my slippers!\n\n \n \n Wow been a long time since you posted :)", 
   {}, 
   280807, 
   null, 
   1188167340.0
  ], 
  [
   280859, 
   null, 
   "chemist99a", 
   "So you'd rather take the \"If it feels good do it\" mentality of the '70s?? or the \"tune in, turn on, drop out\" LSD laden filth of the '60s?? Pathetic.\n\n \n Those were in fact very minor sub-cultures. Did you live through them without being part of them. Most people did you know and most of the youth (ah departed youth) of the day did just fine in their lives. Heck even the people who protested Viet Nam and smoked a little grass, and took a little acid to experiment seemed to mostly survive the experience. Granted the truly stupid ones did not - but you can think of it as natural selection in action.\n \n During both eras I was an academic working very hard on my PhD in an environment where the concerns were mostly whether we could manage to produce enough grain to feed first Mexico and then India. It became known as the Green Revolution. Many of my contemporaries went into electrical engineering (ever notice some improvements in electronics in the last 30 years) or into areospace (ever notice that since 1957 we have managed to put a few things in orbit a bit more complex that sputnick?), some went into defense industries (ever notice those smart weapons in Iraq etc), some died in Vietnam trying to win an old mans war in a hopeless mess (ever notice the lessons we learned there and seem to have forgotten in these more conservative times?).\n \n Yes I know the world is going to hell in a handbasket because youth has corrupted traditional values, but my esteemed ossified brain friend thats what YOUTH is there for! Its always been the case and it always will. Take their courage to heart - its actually the hope of the future! Just as the rebellions against the stifling 1950s in the1960s and 1970s was an essential to makeing the progrss of the 1980s-2000s. Its time now for another shaking off of the status quo - this time at the voting booth because we (and our children) cannot withstand much more incompetence in that big white hose place and in those nifty buildings in Washington (and OUR state houses). \n \n Pat Robertson and J. Falwell have claimed the US is being punished for its sins. Frankly I think that punshiment has come by GOD making Bush president for 8 years.", 
   {}, 
   280480, 
   null, 
   1188168180.0
  ], 
  [
   280862, 
   null, 
   "chemist99a", 
   "Yet you conveniently forget that this country was founded on Judeo-Christian principles. Not Greek Culture\n\n \n Actually the govenment is founded on Roman Traditions to a large extent right down the symbolic bundles of sticks on either side of Podia in the SENATE! Ring a bell there? Even many names carry over! But put that aside and consider that if the US were Judeao-Christian it would have been a Monarchy built upon a specific single state religion - in other words a theocracy with a King. That is most assuredly NOT the United States that I know! Old Europe was built upon the Judeao-Christian foundations and theories of proper government. A king by the divine right of GOD and an enforced theism of a specific type!\n \n Now I realize you wish to go back to that, but fortunately our founders were not men to build on such a repressive foundation. They took the individual rights based ideas arising in England and other parts of Europe - extremely left wing ideas by the way! And advnaced them beyond what had been tried before, they managed to compromise the polycultural society of their day in the US (many backgrounds, religions, subpopulations, economic systems) and make a workable unity and provided the radical capability to rewrite the rules via the will of the people when the need arose. They also cleverly divided the power and the time frames of public offices to make it difficult for any one set of interests to get and keep power indefinitely! A singular achievement. Frankly I think Jefferson and Franklin would be rather proud of the youthful rebellions of the 60s and 70s etc. After all Jefferson (old radical that he was)thought we should have a revolution every 20 years or so just to keep our hand in! I'll go with the Jeffersonian approach as opposed to yours, I do not particulary like stasis as a substitute for progress!", 
   {}, 
   280859, 
   null, 
   1188169020.0
  ], 
  [
   280879, 
   null, 
   "Archangel", 
   "It's not only alarmist and irrational, it is also a fallacy - Slippery Slope to be exact.\n \n I, too, would like to hear him name an objective cause and effect between gay couples and the crumbling od the foundation of society. Preferably in one of the many countries that has established Gay marriage, Domestic partnership, and show us how that country has crumbled.\n\n \n If you look at the reproductive rates in those Countries, the drop in the work force and difficulties in supporting the growing Senior Population, you can attribute these problems that are directly affecting the NATIONAL ECONOMY, CORPORATE STABILITY, AND THE NUCLEAR FAMILY to the reproductive practices of women and the normalization of homosexuality as the cause for those Societies rejecting the traditional moral values that prevented these problems from ever existing before. So no one is saying it is only ONE thing but is a combination of the dumbing down of Societies moral center and the radical gay movement is an integral part of promoting that degradation of the Worlds moral values. Just not the only cause. But that in no way negates the damage they are doing with their narcissistic World view.", 
   {}, 
   280791, 
   null, 
   1188175260.0
  ], 
  [
   280886, 
   null, 
   "thelmoose", 
   "If you look at the reproductive rates in those Countries, the drop in the work force and difficulties in supporting the growing Senior Population, you can attribute these problems that are directly affecting the NATIONAL ECONOMY, CORPORATE STABILITY, AND THE NUCLEAR FAMILY to the reproductive practices of women and the normalization of homosexuality as the cause for those Societies rejecting the traditional moral values that prevented these problems from ever existing before. So no one is saying it is only ONE thing but is a combination of the dumbing down of Societies moral center and the radical gay movement is an integral part of promoting that degradation of the Worlds moral values. Just not the only cause. But that in no way negates the damage they are doing with their narcissistic World view.\n\n \n What countries are you talking about? How are \"national economy, corporate stability and the nuclear family\" and \"reproductive practices of women, the normalization of homosexuality, and the rejection of traditional values\" all quantified for comparison purposes? Have you done a regression analysis to see which component accounts for the greatest effect?\n \n Or do you just make sh!t up?", 
   {}, 
   280879, 
   null, 
   1188178320.0
  ], 
  [
   280898, 
   null, 
   "chemist99a", 
   "Poster with a rational reqest!\n \n \nI, too, would like to hear him name an objective cause and effect between gay couples and the crumbling od the foundation of society. Preferably in one of the many countries that has established Gay marriage, Domestic partnership, and show us how that country has crumbled.\n \n\n \n Good old double A:\n \n \nIf you look at the reproductive rates in those Countries, the drop in the work force and difficulties in supporting the growing Senior Population, you can attribute these problems that are directly affecting the NATIONAL ECONOMY, CORPORATE STABILITY, AND THE NUCLEAR FAMILY to the reproductive practices of women and the normalization of homosexuality  as the cause for those Societies rejecting the traditional moral values that prevented these problems from ever existing before. So no one is saying it is only ONE thing but is a combination of the dumbing down of Societies moral center and the radical gay movement is an integral part of promoting that degradation of the Worlds moral values. Just not the only cause. But that in no way negates the damage they are doing with their narcissistic World view.\n\n \n No names, no details, no analysis, no links, no evidence, no substance, not even any style, and almost no semantic content.\n \n I have underlined some things I will discuss.\n \"Those\" countries - Which darn countries are THOSE name em.\n \n \"Senior Population\" perhaps the senior population most at risk is that in countries in Africa where heterosexual aids has killed off much of an entire generation in its most productive years. Difficult to test your claims without specifics.\n \n \"Reproductive practices of Women\" \"Economics\" - Well I suppose you want to resort to the Romanian solution of forced pregnancy? Is that what you want. And oddly enough the most prosperous parts of the world seem to be those with relatively low birth rates, its where birth rates are high that poverty abounds do you think this a coincidence?\n \n And having listed all those problems and admitting they are not due to one cause you choose two changes in social structure and IMPLY that they are significant (in a statistical sense) contributors to the \"problems\" you see (some of which are illusory on your part). \n \n You do realize that what you have there is the poorest possible case don't ya?", 
   {}, 
   280879, 
   null, 
   1188181500.0
  ], 
  [
   280934, 
   null, 
   "Archangel", 
   "I'm not talking about large families or women having 7 to 10 kids each like in the old days. I'm talking about many Countries in Europe not having enough babies to replace the number of people dying off. They are seriously concerned about Population declines due to more women in the workforce, not having as many babies as just one generation ago, increased numbers of abortions, urban living, not enough people to support growth in Industry, and interestingly enough, the Countries most affected have also adopted gay Unions as one of their enlightened social improvements. Here's a link that clarifies the issue. As I said in my previous post, the problem can't be attributed to any ONE cause but is a the result of a combination of a general moral decline that gay unions are one part of. Just one more cog in the wheel of our combined moral degradation if you will.\n \n http://en.wikipedia.org/wiki/Sub-replacement_fertility\n \n http://www.floria-publications.com/italy/life_and_customs/persistent_drop_in_fertility_res.htm", 
   {}, 
   280898, 
   null, 
   1188191340.0
  ], 
  [
   280937, 
   null, 
   "chemist99a", 
   "Tell ya what AA when you can show that gay unions actually reduce fertility rates give me a call. Look my friend homosexuals only constitute at most 10% of the population of both sexes. IF all of them formed purely homosexual unions or were faithfully homosexual then the fertility rate would only be reduced by 10%. Ever mind you and if you do not allow for homosexual unions what fraction of that 10% do you think will marry the opposite sex and have more than 2.1 children per such couple? They are far more simply to remain unmarried and have homosexual relationships anyway - now I do not know if you are educated in biology but that is also not going to increase the fertility rate. But lets give your position the benefit of the doubt and say that 25% of homosexuals will have children if gay unions are banned. You now get a whopping 2.5% increase in the fertility rate. The caucasian fertility rate in the US is 0.9 notably less than the replacement rate. Even if you add a full 10% to it you get only 0.99 not the 2.1 you need. Conclusion - homosexuality is not likely to be a major issue with regard to shrinking populations. The principal causes have to be somewhere else. Its not abortion either. Maybe birth control? Maybe economic factors. Maybe the desire to have one child for economic reasons - like not enough income to afford to educate two of em? Or maybe its the Republican War on the Middle Class squeezing them so much that they cannot have a home, a car, medical insurance, WHILE supporting two kids! Perhaps the elite is simply harvesting the seeds it sowed?\n \n So unless you have sufficently convincing statistical studies which break out the multiple possible causes into their estimated contributions to fertility rate then quit making claims you have zip support for.", 
   {}, 
   280934, 
   null, 
   1188194040.0
  ], 
  [
   280960, 
   null, 
   "samiinh", 
   "The greater cause, IMHO, is the decline in the patriarchal society where women were kept in the home. Today's women have careers and a life outside of the home. She is more fulfilled as a human being. \n \n The population of the planet needs to decline. The earth can't support the expanding population as it is.\n \n Acceptance of homosexuality has nothing to do with this, except in the little minds of homophobes.", 
   {}, 
   280937, 
   null, 
   1188217440.0
  ], 
  [
   280963, 
   null, 
   "davenport15", 
   "What has drawn my ire is how this country has degraded from what it once was. Yes I mean it is worse than it was in the 1950's when stable two-parent households were the norm.\n\n \n Bassman, you've opened yourself up to a fair amount of attacks, and it's because your posts have disregarded logical thinking and you've resorted to hysterics. \n \n Again, please do some research on the 50s. The world of Leave it to Beaver was a Hollywood construct, an illusion. Beneath the surface, troubles were brewing. \n \n You remind me of a conversation I'd had with a divorced female friend of mine the other day. She believes that the most fearful, terrified individuals in this country are the straight males. They have lost their \"traditional\" roles as patriarchs and are desperate to regain their status. \n \n Now, many heterosexual men (my great friends among them) have embraced the diversity of the world and relationships. Why don't you, Bassman, try to see the world as an amazing place. Try to see this country as the land of the free, a country that is striving to see freedom for all its people. If you can imagine the world as a good place that has the potential to get better for everyone, then maybe you won't be so scared and confused.", 
   {}, 
   280793, 
   null, 
   1188223320.0
  ], 
  [
   280970, 
   null, 
   "jyoshu", 
   "The world of Leave it to Beaver was a Hollywood construct, an illusion. Beneath the surface, troubles were brewing.\n\n \n I would agree that there are other forms of family, but I think we need to be careful here. There indeed are plenty of families where there is a husband and a wife, and which the husband works outside the home and the mother stays home as a home-maker, and both are completely happy doing that. That's the 'model' in Leave it to Beaver, and that model works just fine sometimes. It depends on the people involved and what they want. It's easy to see the changes in society and interpreting them in such a way as to assume that the sort of family situation in 'Leave it to Beaver' (geez, I wish we had a better term for it here--maybe 'wife-as-a-homemaker-family\") is going extinct. But it isn't. But I'm certainly on board with the idea that it's not the only sort of family there is, or that it's not even the predominant sort of family these days.", 
   {}, 
   280963, 
   null, 
   1188227100.0
  ], 
  [
   280980, 
   null, 
   "Foxtuba", 
   " \n \n The population of the planet needs to decline. The earth can't support the expanding population as it is.\n \n\n \n Stop it! Stop it, you can't bring that into the mix....that's just, too....too....how would Bush put it...sciencey?", 
   {}, 
   280960, 
   null, 
   1188233040.0
  ], 
  [
   280982, 
   null, 
   "thelmoose", 
   "I would agree that there are other forms of family, but I think we need to be careful here. There indeed are plenty of families where there is a husband and a wife, and which the husband works outside the home and the mother stays home as a home-maker, and both are completely happy doing that. That's the 'model' in Leave it to Beaver, and that model works just fine sometimes. It depends on the people involved and what they want. It's easy to see the changes in society and interpreting them in such a way as to assume that the sort of family situation in 'Leave it to Beaver' (geez, I wish we had a better term for it here--maybe 'wife-as-a-homemaker-family\") is going extinct. But it isn't. But I'm certainly on board with the idea that it's not the only sort of family there is, or that it's not even the predominant sort of family these days.\n\n \n I think the \"Leave it to Beaver\" reference is speaking to much more than the family structure. When there are kids, one parent working outside the home and one in, is a very useful model and may often be ideal assuming one of the parents is capable of staying at home - and by capable I mean more than financially. \n \n I think davenport is referring to the unrealistic impression that all was goodness and sweetness and light in the 50s and we have been plunging directly toward societal decay ever since. Every generation has it's problems. One thing is clear is that fewer people talked about the seedy underbelly of society in times past. Bass made some silly implication that Kinsey caused problems. Although flawed in many ways, but what I think is important about the Kinsey data is the demonstration that folks were doing stuff they didn't talk about at the strawberry social. \n \n Things are different now than in generations past. I think the point is that the stereotypical generalizations of 50's: good, 60's: drug and sex crazed, 70's: hedonism, etc. are not entirely helpful or accurate constructs. Some things are much better than they were 50 years ago.", 
   {}, 
   280970, 
   null, 
   1188234660.0
  ], 
  [
   280984, 
   null, 
   "MrWriteLA", 
   "Recommended reading:\n \n http://www.amazon.com/Way-We-Never-Were-Nostalgia/dp/0465090974/ref=pd_bbs_sr_2/102-5365673-1655323?ie=UTF8&s=books&qid=1188228763&sr=8-2\n \nThe Way We Never Were: The American Family and the Nostalgia Trap, by Stephanie Coontz\n \n Did you ever wonder about the historical accuracy of those \"traditional family values\" touted in the heated arguments that insist our cultural ills can be remedied by their return? Of course, myth is rooted in fact, and certain phenomena of the 1950s generated the Ozzie and Harriet icon. The decade proved profamily--the birthrate rose dramatically; social problems that nag--gangs, drugs, violence--weren't even on the horizon. Affluence had become almost a right; the middle class was growing. \"In fact,\" writes Coontz, \"the 'traditional' family of the 1950s was a qualitatively new phenomenon. At the end of the 1940s, all the trends characterizing the rest of the twentieth century suddenly reversed themselves.\" This clear-eyed, bracing, and exhaustively researched study of American families and the nostalgia trap proves--beyond the shadow of a doubt--that Leave It to Beaver was not a documentary. \n Gender, too, is always on Coontz's mind. In the third chapter (\"My Mother Was a Saint\"), she offers an analysis of the contradictions and chasms inherent in the \"traditional\" division of labor. She reveals, next, how rarely the family exhibited economic and emotional self-reliance, suggesting that the shift from community to nuclear family was not healthy. Coontz combines a clear prose style with bold assertions, backed up by an astonishing fleet of researched, myth-skewing facts. The 88 pages of endnotes dramatize both her commitment to and deep knowledge of the subject. Brilliant, beautifully organized, iconoclastic, and (relentlessly) informative The Way We Never Were breathes fresh air into a too often suffocatingly \"hot\" and agenda-sullied subject. In the penultimate chapter, for example, a crisp reframing of the myth of black-family collapse leads to a reinterpretation of the \"family crisis\" in general, putting it in the larger context of social, economic, and political ills. \n \n The book began in response to the urgent questions about the family crisis posed her by nonacademic audiences. Attempting neither to defend \"tradition\" in the era of family collapse, nor to liberate society from its constraints, Coontz instead cuts through the kind of sentimental, ahistorical thinking that has created unrealistic expectations of the ideal family. \"I show how these myths distort the diverse experiences of other groups in America,\" Coontz writes, \"and argue that they don't even describe most white, middle-class families accurately.\" The bold truth of history after all is that \"there is no one family form that has ever protected people from poverty or social disruption, and no traditional arrangement that provides a workable model for how we might organize family relations in the modern world.\" \n \n Some of America's most precious myths are not only precarious, but down right perverted, and we would be fools to ignore Stephanie Coontz's clarion call. --Hollis Giammatteo \n \n From Publishers Weekly\n The golden age of the American family never existed, asserts Coontz ( The Social Origns of Private Life ) in a wonderfully perceptive, myth-debunking report. The \"Leave It to Beaver\" ideal of breadwinner father, full-time homemaker mother and dependent children was a fiction of the 1950s, she shows. Real families of that period were rife with conflict, repression and anxiety, frequently poor and much less idyllic than many assume; teen pregnancy rates in the '50s were higher than today. Further, Coontz contends, the nuclear family was elevated to a central source of personal satisfaction only in the late 19th century, thereby weakening people's community ties and sense of civic obligation. Coontz disputes the idea that children can be raised properly only in traditional families. Viewing modern domestic problems as symptoms of a much larger socioeconomic crisis, she demonstrates that no single type of household has ever protected Americans from social disruption or poverty. An important contribution to the current debate on family values. \n Copyright 1992 Reed Business Information, Inc.\n", 
   {}, 
   280982, 
   null, 
   1188236160.0
  ], 
  [
   280985, 
   null, 
   "MrWriteLA", 
   "Oh, and by the way...\n \n In real life, half of the \"Father Knows Best\" cast was severely dysfunctional: Robert Young (Dad) suffered from clinical depression, Billy Gray (Bud) had a major drug problem, and Lauren Chapin (Kitten) eventually descended into prostitution.\n \n Not to mention that Lucy and Ricky were constantly on the verge of divorce and Dad Brady, the second Darren Stevens, Endora, Uncle Arthur, and Mel Cooley were gay, while Rob Petrie was an alcoholic.", 
   {}, 
   280984, 
   null, 
   1188236700.0
  ], 
  [
   280991, 
   null, 
   "samiinh", 
   "Stop it! Stop it, you can't bring that into the mix....that's just, too....too....how would Bush put it...sciencey?\n\n \n A ballooning world population, intensive farming practices and changes in sexual behavior have provided a breeding ground for an unprecedented number of emerging diseases, the U.N. health agency says in a new report.\n \n AIDS and 38 other new pathogens are afflicting mankind that were unknown a generation ago, the World Health Organization said.\n \n http://365gay.com/Newscon07/08/082607hiv.htm", 
   {}, 
   280980, 
   null, 
   1188239220.0
  ], 
  [
   280995, 
   null, 
   "jyoshu", 
   "I think the \"Leave it to Beaver\" reference is speaking to much more than the family structure. When there are kids, one parent working outside the home and one in, is a very useful model and may often be ideal assuming one of the parents is capable of staying at home - and by capable I mean more than financially. I think davenport is referring to the unrealistic impression that all was goodness and sweetness and light in the 50s and we have been plunging directly toward societal decay ever since. \n \n Things are different now than in generations past. I think the point is that the stereotypical generalizations of 50's: good, 60's: drug and sex crazed, 70's: hedonism, etc. are not entirely helpful or accurate constructs. Some things are much better than they were 50 years ago.\n\n \n In that case, I can agree with that.", 
   {}, 
   280982, 
   null, 
   1188245100.0
  ], 
  [
   280996, 
   null, 
   "Zardoz", 
   "A ballooning world population, intensive farming practices and changes in sexual behavior have provided a breeding ground for an unprecedented number of emerging diseases, the U.N. health agency says in a new report.\n \n AIDS and 38 other new pathogens are afflicting mankind that were unknown a generation ago, the World Health Organization said.\n \n http://365gay.com/Newscon07/08/082607hiv.htm\n\n \n How else are we going to find out who the master race is unless conditions are formented to make brutal, blood thursty combat necessary?\n Why would the western (typically caucasian) world handicap themselves with limiting rules that deminish their population numbers?", 
   {}, 
   280991, 
   null, 
   1188246360.0
  ], 
  [
   281001, 
   null, 
   "thelmoose", 
   "I'm not talking about large families or women having 7 to 10 kids each like in the old days. I'm talking about many Countries in Europe not having enough babies to replace the number of people dying off. They are seriously concerned about Population declines due to more women in the workforce, not having as many babies as just one generation ago, increased numbers of abortions, urban living, not enough people to support growth in Industry, and interestingly enough, the Countries most affected have also adopted gay Unions as one of their enlightened social improvements. Here's a link that clarifies the issue. As I said in my previous post, the problem can't be attributed to any ONE cause but is a the result of a combination of a general moral decline that gay unions are one part of. Just one more cog in the wheel of our combined moral degradation if you will.\n \n http://en.wikipedia.org/wiki/Sub-replacement_fertility\n \n http://www.floria-publications.com/italy/life_and_customs/persistent_drop_in_fertility_res.htm\n\n \n Your first reference describes sub-replacement fertility but makes no mention of a problem related to that. The second vaguely suggests there could be a problem, in the opinion of the author, but no actual objective observations.\n \n The only objective criterion you have been able to create is the phenomenon of sub-replacement fertility. You have not demonstrated an actual problem related to that. This was not in your original complaint. You seem to be grasping here.\n \n Much more importantly you have still not shown any evidence for your initial claim, that in certain (unnamed countries) there are dire consequences related to \"national economy, corporate stability and the nuclear family\" that are caused by alleged but unsubstantiated problems with \"reproductive practices of women, the normalization of homosexuality, and the rejection of traditional values\".\n \n Please present some facts (or even reasonable hypotheses) to support your alarmist claims.", 
   {}, 
   280934, 
   null, 
   1188251220.0
  ], 
  [
   281004, 
   null, 
   "robbie0517", 
   "What AA is most likely refering to is a study done by Stanley Kurtz that concluded that the effects of gay marriage has undermined the institution of marriage in Scandinavia and the Netherlands. \n \n Here is the link to a pdf discussing the issue: \n http://www.iglss.org/media/files/briefing.pdf\n \n \nThe argument that same-sex partnerships undermine heterosexual marriage rests on four claims:\n 1. In the European countries that allow same-sex couples to register as partners, marriage and parenthood have become separated, and married parenthood has become a minority occurrence.\n 2. The separation of marriage and parenthood in those countries is disastrous for children because of higher rates of break-up among cohabitors.\n 3. Allowing gay marriage accelerates the separation of parenthood and marriage.\n 4. If the U.S. allows gay couples to marry, heterosexual people in the U.S. will\n adopt European-style family dynamics.\n \n In fact, none of these claims fits the actual evidence of the Scandinavian and Dutch experience and the U.S. context. A closer look at the data reveals a very different picture:\n \u0095 Divorce rates have not risen since the passage of partnership laws, and marriage rates have remained stable or actually increased.\n \u0095 The majority of parents are married. The average Scandinavian child spends\n more than 80% of his or her youth living with both parents-more time than\n the average American child.\n \u0095 Non-marital birth rates have not risen faster in Scandinavia or the Netherlands since the passage of partnership laws. Although there has been a long-term\n trend toward the separation of sex, reproduction, and marriage in the industrialized west, this trend is unrelated to the legal recognition of same-sex couples.\n Non-marital birth rates changed just as much in countries without partnership\n laws as in countries that legally recognize same-sex couples' partnerships.\n", 
   {
    "unicode_changes_made": true
   }, 
   281001, 
   null, 
   1188254400.0
  ], 
  [
   281005, 
   null, 
   "thelmoose", 
   "What AA is most likely refering to is a study done by Stanley Kurtz that concluded that the effects of gay marriage has undermined the institution of marriage in Scandinavia and the Netherlands. \n \n Here is the link to a pdf discussing the issue: \n http://www.iglss.org/media/files/briefing.pdf\n\n \n Thanks. \n First, those marital trends antedated the recognition of same sex marriage.\n Second, how does he explain any possible link between the two unrelated phenomena? They are not involving the same people!", 
   {}, 
   281004, 
   null, 
   1188254880.0
  ], 
  [
   281006, 
   null, 
   "Easyrider", 
   "Homosexual sin - No harm? \n \n A number of reasons. First, \"gay pride\" (two sins). They flaunt it in our faces and try to legitimize it. You don't hear of \"adultery pride\" parades or \"necrophilia pride\" parades do you? But even if there were we'd take an equally stellar stance against those. We don't want to hear about it.\n \n Second, most homosexuals who claim to be Christian try to persuade others it's not a sin, leading many (many) into perdition. We don't want to see even one soul lost. \n \n Third, most homosexuals distort the scriptures in some fashion or another in order to try to justify their sin. The distort who Jesus is (saying he's not God so he never spoke out against gay sex sin); they make lengthly arguments against Leviticus, Romans 1:26-27, I Corinthians 6:9-10, etc. Generally, they attack the Word of God and thus attack God himself. We defend the Word and God.\n \n Fourth: Sin is a reproach to individuals and nations and brings God's disfavor on men and nations. Read Deuteronomy chapter 28 to see the curses of disobedience.\n \n Fifth, many of them attack the Sons and Daughters of God when we stand up for the truth of God's Word. They call us bigots, homophobes, and all manner of names because we disagree with their stance.\n \n Sixth, they push their illicit agenda into every corner of America. Suing the Boy Scouts and anyone else who disagrees with them. They try and sometimes succeed in pushing their gay agenda in elementary schools and elsewhere where it doesn't belong. Eight year old children shouldn't have to hear that Billy's daddy is doing another guy, or that it's ok to do it. We don't need to know which way people perform sex acts. \n \n Seventh: (need I go on?) They (and heterosexual sinners) cost taxpayers untold billions in unnecessary health care costs to treat AIDS and other diseases they give to each other. It costs us all money out of our pockets.\n \n And eighth: They refuse to repent of it, making their own salvation and those who they lead astray a serious question mark.\n \n And there's more but that's for starters.", 
   {}, 
   281004, 
   null, 
   1188255000.0
  ], 
  [
   281017, 
   null, 
   "Jo Bennett", 
   "Homosexual sin - No harm? \n Third, most homosexuals distort the scriptures in some fashion or another in order to try to justify their sin. The distort who Jesus is (saying he's not God so he never spoke out against gay sex sin); they make lengthly arguments against Leviticus, Romans 1:26-27, I Corinthians 6:9-10, etc. Generally, they attack the Word of God and thus attack God himself. We defend the Word and God.\n\n \n You're confusing the Word of God with your twisted interpretation of it. Again. You refuse to look at what the hebrew and greek words actually mean and instead rely on your own prejudices. You distort the scriptures to deny the apostolic succession, and the real presence. I've never encountered any gay Christians who claim that Jesus isn't God, but you seem to equate Jesus being God with Jesus being the Father, which is a pretty serious heresy. the Father is God, the Son is God, the Holy Spirit is God. The Father is not the Son, the Son is not the Spirit, the Spirit is not the Father. You also claim to be able to discern what is ceremonial or ritual law in the Old Testament from what is eternal moral law, without being able to describe a precise distinction.", 
   {}, 
   281006, 
   null, 
   1188257880.0
  ], 
  [
   281025, 
   null, 
   "samiinh", 
   "You're confusing the Word of God with your twisted interpretation of it. Again. You refuse to look at what the hebrew and greek words actually mean and instead rely on your own prejudices. You distort the scriptures to deny the apostolic succession, and the real presence. I've never encountered any gay Christians who claim that Jesus isn't God, but you seem to equate Jesus being God with Jesus being the Father, which is a pretty serious heresy. the Father is God, the Son is God, the Holy Spirit is God. The Father is not the Son, the Son is not the Spirit, the Spirit is not the Father. You also claim to be able to discern what is ceremonial or ritual law in the Old Testament from what is eternal moral law, without being able to describe a precise distinction.\n\n \n Actually, for many of us....none of the above are god. There is no god.", 
   {}, 
   281017, 
   null, 
   1188258900.0
  ], 
  [
   281037, 
   null, 
   "chemist99a", 
   "Acceptance of homosexuality has nothing to do with this, except in the little minds of homophobes.\n\n \n And if they are worried about it then they should go forth and multiply and fill the earth. Most couples do not live up to their true reproductive potential. Just have an extra kid or two and be resposible for them and all shall be well. In times past heterosexual couples would crank out 5 or more children without being exceptional. If they are afraid of 'shrinkage\" they can solve the problem by their own actions! And even better those kids can be raised right and displace all those undesirables given time!", 
   {}, 
   281001, 
   null, 
   1188260340.0
  ], 
  [
   281040, 
   null, 
   "chemist99a", 
   "Stop it! Stop it, you can't bring that into the mix....that's just, too....too....how would Bush put it...sciencey?\n\n \n Yes it much better to resort to truthiness than to truth! Ever so much easier on the mind. What me worry?", 
   {}, 
   280980, 
   null, 
   1188260580.0
  ], 
  [
   281042, 
   null, 
   "chemist99a", 
   "I think davenport is referring to the unrealistic impression that all was goodness and sweetness and light in the 50s and we have been plunging directly toward societal decay ever since. Every generation has it's problems. One thing is clear is that fewer people talked about the seedy underbelly of society in times past. Bass made some silly implication that Kinsey caused problems. Although flawed in many ways, but what I think is important about the Kinsey data is the demonstration that folks were doing stuff they didn't talk about at the strawberry social.\n\n \n We moved beyond the idealized 1950s because it was terminally boring. Boredom was in style after the massive lack of boredom during WWII. Everybody needed about a decade of boredom after a decade of mobilization and combat. The men who served especially so. A decade of R&R and then back to the more typical dynamism of the US society. After all it took a while for people to restructure thier lives, start their families, and get their educations before things could crank up to normal again. Consider the 1950s sort of a recovery from a hangover or a few weeks of working double shifts!", 
   {}, 
   281001, 
   null, 
   1188260940.0
  ], 
  [
   281044, 
   null, 
   "chemist99a", 
   "Do you expect me to think of this as anything but a spoof? Are you actually serious? ROTFLAMO otherwise. Crying my eyes out with pity for you otherwise.\n \n \nHomosexual sin - No harm? \n \n A number of reasons. First, \"gay pride\" (two sins). They flaunt it in our faces and try to legitimize it. You don't hear of \"adultery pride\" parades or \"necrophilia pride\" parades do you? But even if there were we'd take an equally stellar stance against those. We don't want to hear about it.\n \n Second, most homosexuals who claim to be Christian try to persuade others it's not a sin, leading many (many) into perdition. We don't want to see even one soul lost. \n \n Third, most homosexuals distort the scriptures in some fashion or another in order to try to justify their sin. The distort who Jesus is (saying he's not God so he never spoke out against gay sex sin); they make lengthly arguments against Leviticus, Romans 1:26-27, I Corinthians 6:9-10, etc. Generally, they attack the Word of God and thus attack God himself. We defend the Word and God.\n \n Fourth: Sin is a reproach to individuals and nations and brings God's disfavor on men and nations. Read Deuteronomy chapter 28 to see the curses of disobedience.\n \n Fifth, many of them attack the Sons and Daughters of God when we stand up for the truth of God's Word. They call us bigots, homophobes, and all manner of names because we disagree with their stance.\n \n Sixth, they push their illicit agenda into every corner of America. Suing the Boy Scouts and anyone else who disagrees with them. They try and sometimes succeed in pushing their gay agenda in elementary schools and elsewhere where it doesn't belong. Eight year old children shouldn't have to hear that Billy's daddy is doing another guy, or that it's ok to do it. We don't need to know which way people perform sex acts. \n \n Seventh: (need I go on?) They (and heterosexual sinners) cost taxpayers untold billions in unnecessary health care costs to treat AIDS and other diseases they give to each other. It costs us all money out of our pockets.\n \n And eighth: They refuse to repent of it, making their own salvation and those who they lead astray a serious question mark.\n \n And there's more but that's for starters.\n\n \n Truly I cannot take much more. I had my gall bladder taken out recently and I fear I will burst my incisions open - stop I say please stop! emoticon_xbouncer", 
   {}, 
   281006, 
   null, 
   1188261420.0
  ], 
  [
   281047, 
   null, 
   "Easyrider", 
   "You're confusing the Word of God with your twisted interpretation of it. Again. You refuse to look at what the hebrew and greek words actually mean and instead rely on your own prejudices.\n\n \n I think your political correctness has hindered your Biblical objectiveness. Here's some refresher material responding to pro gay theology:\n \n http://www.leaderu.com/jhs/dallas.html\n \n \nYou distort the scriptures to deny the apostolic succession, and the real presence.\n\n \n Nope. \n \n \n\n I've never encountered any gay Christians who claim that Jesus isn't God...\n\n \n Curious, since in 8 years of debate in various fora I've encountered a great number of them. \n \n \n\n but you seem to equate Jesus being God with Jesus being the Father, which is a pretty serious heresy.\n\n \n Nope, that's your spin.\n \n \nYou also claim to be able to discern what is ceremonial or ritual law in the Old Testament from what is eternal moral law, without being able to describe a precise distinction.\n\n \n It's all over the internet, Jo - not my creation. Read up:\n \n Subdividing the Law: Moral, Civil, Ceremonial\n \n http://derek4messiah.wordpress.com/2007/02/12/subdividing-the-law-moral-civil-ceremonial/\n \n The Westminster Confession of Faith (1646) divides the Mosaic laws into three categories: moral, civil, and ceremonial. \n \n http://en.wikipedia.org/wiki/Old_Testament\n \n Catholic Encyclopedia\n \n The Divine Law of the Old Testament, or the Mosaic Law, is commonly divided into civil, ceremonial, and moral precepts.\n \n http://www.newadvent.org/cathen/09071a.htm\n \n You can find many more too.", 
   {}, 
   281017, 
   null, 
   1188261960.0
  ], 
  [
   281049, 
   null, 
   "Easyrider", 
   "Do you expect me to think of this as anything but a spoof? Are you actually serious? ROTFLAMO otherwise. Crying my eyes out with pity for you otherwise.\n \n Truly I cannot take much more. I had my gall bladder taken out recently and I fear I will burst my incisions open - stop I say please stop!\n\n \n \n Gay sex is a sin and needs to be repented of.", 
   {}, 
   281044, 
   null, 
   1188262080.0
  ], 
  [
   281050, 
   null, 
   "thelmoose", 
   "Homosexual sin - No harm? \n \n A number of reasons. First, \"gay pride\" (two sins). They flaunt it in our faces and try to legitimize it. You don't hear of \"adultery pride\" parades or \"necrophilia pride\" parades do you? But even if there were we'd take an equally stellar stance against those. We don't want to hear about it.\n \n Second, most homosexuals who claim to be Christian try to persuade others it's not a sin, leading many (many) into perdition. We don't want to see even one soul lost. \n \n Third, most homosexuals distort the scriptures in some fashion or another in order to try to justify their sin. The distort who Jesus is (saying he's not God so he never spoke out against gay sex sin); they make lengthly arguments against Leviticus, Romans 1:26-27, I Corinthians 6:9-10, etc. Generally, they attack the Word of God and thus attack God himself. We defend the Word and God.\n \n Fourth: Sin is a reproach to individuals and nations and brings God's disfavor on men and nations. Read Deuteronomy chapter 28 to see the curses of disobedience.\n \n Fifth, many of them attack the Sons and Daughters of God when we stand up for the truth of God's Word. They call us bigots, homophobes, and all manner of names because we disagree with their stance.\n \n Sixth, they push their illicit agenda into every corner of America. Suing the Boy Scouts and anyone else who disagrees with them. They try and sometimes succeed in pushing their gay agenda in elementary schools and elsewhere where it doesn't belong. Eight year old children shouldn't have to hear that Billy's daddy is doing another guy, or that it's ok to do it. We don't need to know which way people perform sex acts. \n \n Seventh: (need I go on?) They (and heterosexual sinners) cost taxpayers untold billions in unnecessary health care costs to treat AIDS and other diseases they give to each other. It costs us all money out of our pockets.\n \n And eighth: They refuse to repent of it, making their own salvation and those who they lead astray a serious question mark.\n \n And there's more but that's for starters.\n\n \n No, c'mon now!!\n \n You are going to have to start all over and give a grown-up answer. You know how to use your big boy words, I know you do.", 
   {}, 
   281006, 
   null, 
   1188262200.0
  ], 
  [
   281053, 
   null, 
   "JSDKoeln", 
   "Gay sex is a sin and needs to be repented of.\n\n \n so is your fundamentalist diatribe. It's in a bible that I wrote. So please repent.", 
   {}, 
   281049, 
   null, 
   1188262500.0
  ], 
  [
   281055, 
   null, 
   "Easyrider", 
   "so is your fundamentalist diatribe. It's in a bible that I wrote. So please repent.\n\n \n Right. Make a rock and then I'll believe you.", 
   {}, 
   281053, 
   null, 
   1188262680.0
  ], 
  [
   281060, 
   null, 
   "JSDKoeln", 
   "Right. Make a rock and then I'll believe you.\n\n \n Have an original thought that makes sense, and perhaps I'll believe you.", 
   {}, 
   281055, 
   null, 
   1188262920.0
  ], 
  [
   281064, 
   null, 
   "samiinh", 
   "Right. Make a rock and then I'll believe you.\n\n \n Are you planning to stone someone to death as prescribed in your evil book?", 
   {}, 
   281055, 
   null, 
   1188263280.0
  ], 
  [
   281070, 
   null, 
   "chemist99a", 
   "Goodness gracious - you mean its NOT SATIRE:p \n Too bad you could have made a living at it.\n \n \nGay sex is a sin and needs to be repented of.\n\n \n Well then if you are guilty and a believer then you must repent. But why do you think that everyone else needs to because you happen to believe a specific set of rules laid down for desert tribes in a society and under circumstances which do not even come close to resembling our own? emoticon_xchicken", 
   {}, 
   281060, 
   null, 
   1188263700.0
  ], 
  [
   281072, 
   null, 
   "chemist99a", 
   "I think your political correctness has hindered your Biblical objectiveness.\n\n \n Two oxymorons for the price of one! Are you sure you believe this stuff? I think you are putting us on and really are being satirical.emoticon_xbye", 
   {}, 
   281060, 
   null, 
   1188263820.0
  ], 
  [
   281078, 
   null, 
   "Easyrider", 
   "Two oxymorons for the price of one! Are you sure you believe this stuff? I think you are putting us on and really are being satirical.emoticon_xbye\n\n \n Guess you'll find out at the Great White Throne Judgment! emoticon_xangel", 
   {}, 
   281072, 
   null, 
   1188264240.0
  ], 
  [
   281079, 
   null, 
   "samiinh", 
   "Guess you'll find out at the Great White Throne Judgment! emoticon_xangel\n\n \n Are you Archie in a new suit?", 
   {}, 
   281078, 
   null, 
   1188264300.0
  ], 
  [
   281088, 
   null, 
   "jitobear", 
   "Are you Archie in a new suit?\n\n \n Actually Easyrider pre-dates ArchAngel by years. I was wondering what happened to him actually. And although the two of them hold some views similarly they are not the same creature at all.", 
   {}, 
   281079, 
   null, 
   1188266220.0
  ], 
  [
   281100, 
   null, 
   "chemist99a", 
   "Guess you'll find out at the Great White Throne Judgment!\n\n \n Is that held at a state fair grounds somewhere - a toilet bowl makers convention where they contest for the best product of their hard industry? I'm betting on Standard and Kohler.", 
   {}, 
   281088, 
   null, 
   1188272220.0
  ], 
  [
   281107, 
   null, 
   "Zardoz", 
   "Right. Make a rock and then I'll believe you.\n\n \n \n I've made many!\n \n My malice has led to many suffering from painful gall stones.", 
   {}, 
   281055, 
   null, 
   1188274140.0
  ], 
  [
   281111, 
   null, 
   "GiantOreo", 
   "Gay sex is a sin and needs to be repented of.\n\n \n How 'bout the Christians who DON'T believe it's a sin, and how about everyone who really doesn't give a d@mn about what your little bible says.\n \n Sorry to tell you this, but this ain't a theocracy, and we don't have to follow the antiquated laws or concepts of \"sin\" of a repressed Bronze-age desert people (said \"sin\" is quite ambiguous in any case, enough that many doubt the Bible really says Gay sex is a sin).", 
   {}, 
   281049, 
   null, 
   1188276600.0
  ], 
  [
   281112, 
   null, 
   "GiantOreo", 
   "Are you Archie in a new suit?\n\n \n \n \nActually Easyrider pre-dates ArchAngel by years. I was wondering what happened to him actually. And although the two of them hold some views similarly they are not the same creature at all.\n\n \n EZ has been here much longer than Archie, and, as Jito said, they hold many of the same views. They actualy coexisted for the first month or so that Archie joined, and then Easyrider ran of to http://debatingchristianity.com/forum/index.php. Not sure if he got too devoured there or what and if he stopped posting there, but it seems he's returned to his old roost here (the wonders of lurking - I know so much about things like this emoticon_xagree )\n \n The timing of the leaving made me sort of suspicious as to whether Archie and EZ were one and the same, but I don't think so.", 
   {}, 
   281088, 
   null, 
   1188276900.0
  ], 
  [
   281113, 
   null, 
   "chemist99a", 
   "Actually if you look at the actual attitudes of most Christian sects you will find that sex in general is pretty much a dubious activity. Lots of opportunities to put the burden of guilt upon the pure civilian there. Do anything not prescribed (and you do need a flow chart) during sex and you have to repent! Somebody round here published the flow chart a while ago. Almost impossible to get through a spontaneous act of love without violating one or more of the rules!", 
   {}, 
   281111, 
   null, 
   1188276960.0
  ], 
  [
   281116, 
   null, 
   "Matthew S", 
   "Actually Easyrider pre-dates ArchAngel by years. I was wondering what happened to him actually. And although the two of them hold some views similarly they are not the same creature at all.\n\n \n Not quite EZ makes Archangel look like a gay loving liberal.", 
   {}, 
   281088, 
   null, 
   1188277200.0
  ], 
  [
   281128, 
   null, 
   "chemist99a", 
   "Not quite EZ makes Archangel look like a gay loving liberal.\n\n \n Well if we support bigot-marriage maybe they will find each other and set up housekeeping together. I hope they are not a fertile couple though.", 
   {}, 
   281116, 
   null, 
   1188280440.0
  ], 
  [
   281134, 
   null, 
   "Archangel", 
   "Well if we support bigot-marriage maybe they will find each other and set up housekeeping together. I hope they are not a fertile couple though.\n\n \n Well I am very fertile and I would be proud to have children with EZ. emoticon_xagree Just think of the little Saints we could make. emoticon_xbye", 
   {}, 
   281128, 
   null, 
   1188285060.0
  ], 
  [
   281135, 
   null, 
   "GiantOreo", 
   "Well I am very fertile and I would be proud to have children with EZ. emoticon_xagree Just think of the little Saints we could make. emoticon_xbye\n\n \n Always thought you were just repressing your own homosexulity. emoticon_xbye \n \n \n \n \n However, I must say, the idea of little Archies and EZs running around certainly turns my stomach. Some people should just never be allowed to reproduce.", 
   {}, 
   281134, 
   null, 
   1188285180.0
  ], 
  [
   281145, 
   null, 
   "Jo Bennett", 
   "EZ, how about you actually discuss stuff on this site rather than just posting a tonne of links? I'm not going to go through refuting the idiocy of half the internet for you. Suffice to say that there are different types of law in the Old Testament, what I dispute is your accuracy in discerning which is which.", 
   {}, 
   281135, 
   null, 
   1188296700.0
  ], 
  [
   281153, 
   null, 
   "jitobear", 
   "Not quite EZ makes Archangel look like a gay loving liberal.\n\n \n Oh I don't know about that. I think EZ is more politically motivated than Arch Angel - and although they both can be quite insulting when they speak of gays, Muslims and non-believers - Arch Angel's language is little more poetical. :)", 
   {}, 
   281116, 
   null, 
   1188302880.0
  ], 
  [
   281154, 
   null, 
   "Matthew S", 
   "Oh I don't know about that. I think EZ is more politically motivated than Arch Angel - and although they both can be quite insulting when they speak of gays, Muslims and non-believers - Arch Angel's language is little more poetical. :)\n\n \n Here is what I have seen is the difference. \n \n Archangel believes that being gay is a sin but that gay people still have the right to live their lives as they see fit.\n \n EZ believes that being gay is a sin and being gay should be criminalized.\n \n Don't get me wrong they are still cut from the same cloth but Archangel is liberal when it comes to gay issues when compared to EZ.", 
   {}, 
   281153, 
   null, 
   1188303540.0
  ], 
  [
   281300, 
   null, 
   "Easyrider", 
   "\n \n EZ believes that being gay is a sin.....\n\n \n A lie. Gay sex (the act) is a sin, according to the Bible. \n \n \n \n\n and being gay should be criminalized.\n\n \n Another lie.", 
   {}, 
   281154, 
   null, 
   1188351240.0
  ], 
  [
   281301, 
   null, 
   "Easyrider", 
   "EZ, how about you actually discuss stuff on this site rather than just posting a tonne of links? I'm not going to go through refuting the idiocy of half the internet for you. Suffice to say that there are different types of law in the Old Testament, what I dispute is your accuracy in discerning which is which.\n\n \n I don't really care if you don't believe it.", 
   {}, 
   281145, 
   null, 
   1188351420.0
  ], 
  [
   281303, 
   null, 
   "samiinh", 
   "I don't really care if you don't believe it.\n\n \n Are you always so pleasant?", 
   {}, 
   281301, 
   null, 
   1188351600.0
  ], 
  [
   281309, 
   null, 
   "Matthew S", 
   "A lie. Gay sex (the act) is a sin, according to the Bible. \n \n \n \n \n Another lie.\n\n \n Nonsense you support laws that make sodomy a crime.", 
   {}, 
   281300, 
   null, 
   1188354420.0
  ], 
  [
   281321, 
   null, 
   "Easyrider", 
   "Nonsense you support laws that make sodomy a crime.\n\n \n Changing the goal posts, again, Matthew? \n \n You wrote: \"EZ believes that being gay is a sin.....\"\n \n Which is a lie. Doing the gay sex deed is the sin, not being gay (and celibate). Does the distinction dawn on you now?", 
   {}, 
   281309, 
   null, 
   1188357000.0
  ], 
  [
   281369, 
   null, 
   "Matthew S", 
   "Changing the goal posts, again, Matthew? \n \n You wrote: \"EZ believes that being gay is a sin.....\"\n \n Which is a lie. Doing the gay sex deed is the sin, not being gay (and celibate). Does the distinction dawn on you now?\n\n \n You don't want to crininalize heterosexual sexual behavior.\n Who cares about the bible. It is just a literal as harry potter.\n \n Answer the question. Do you favor recriminalization of gay sex?", 
   {}, 
   281321, 
   null, 
   1188384180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Christianist lawyers", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10282-christianist-lawyers.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10282, 
  "discussion_files": [
   [
    "15591.html", 
    "http://www.4forums.com/political/gay-rights-debates/10282-christianist-lawyers-print.html"
   ], 
   [
    "15592.html", 
    "http://www.4forums.com/political/gay-rights-debates/10282-christianist-lawyers-8-print.html"
   ], 
   [
    "15593.html", 
    "http://www.4forums.com/political/gay-rights-debates/10282-christianist-lawyers-6-print.html"
   ], 
   [
    "15594.html", 
    "http://www.4forums.com/political/gay-rights-debates/10282-christianist-lawyers-4-print.html"
   ], 
   [
    "15595.html", 
    "http://www.4forums.com/political/gay-rights-debates/10282-christianist-lawyers-5-print.html"
   ], 
   [
    "15596.html", 
    "http://www.4forums.com/political/gay-rights-debates/10282-christianist-lawyers-7-print.html"
   ], 
   [
    "15597.html", 
    "http://www.4forums.com/political/gay-rights-debates/10282-christianist-lawyers-3-print.html"
   ], 
   [
    "15598.html", 
    "http://www.4forums.com/political/gay-rights-debates/10282-christianist-lawyers-2-print.html"
   ]
  ], 
  "identifier": 10282
 }
]