[
 [
  [
   281178, 
   null, 
   "Symbiote", 
   "There have of course been many indications that the US government has been paving the way to bomb Iran for some time, from the naval buildup offshore to the regularly scheduled propagandising.\n \n This could equally however be considered the excercise of \"pressure\" on Iran, a show of force.\n \n Now word is a certain \"inner circle\" of administration associates have been informed that strikes will occur. Presumably this includes top ranking democrats too, as Hilary changed her campaign pitch to \"we need to prepare for the next war\" in the last week.\n \n reported @\n http://www.lewrockwell.com/blog/lewrw/archives/014918.html#more\n \n a generally reputable site for this sort of thing.\n \n So\n 1) Do you think they will really go through with it? I do, unless something big gets in their way. Like an impeachment.\n \n If so...\n \n 2) Why, really, why? Has the admin come to believe their own lies about Iran being responsible for the iraqi insurgency? Truly believe that it constitutes a nuclear threat to America? Need something to temporarily boost their chances in the upcoming election, a wave of misguided patriotism and fear? Do they simply love war? Believe they can, with sufficient firepower, reshape the world in accordance with their values? Can they be this stupid, or do they just not care about the consequences?", 
   {
    "post_info": {
     "post_title": "Will the US expand the war to Iran?"
    }
   }, 
   null, 
   null, 
   1188318300.0
  ], 
  [
   281198, 
   null, 
   "Zardoz", 
   "I'd say there's a decent chance, depending on:\n \n 1) As you said, something bigger comes up for the US.\n 2) Whether Bush has the balls to do so prior to leaving office.\n 3) Iran's progress with it's Nuclear program.\n \n If Iran tests a nuclear device prior to Bush leaving, there the odds could raise that action would happen. If it appears that Iran is close to doing so, the odds are higher. (Better to do something before a threshhold is reached than after.)\n \n If God tells Bush to start the show for the 2nd coming, then the attack is assured.\n \n What Iran could do is plod along until they're ready and then either test and thumb their nose at Bush...or wait until he's out of office and then test...what would Dems do if they winn the presidency? Nothing? Sit on their thumbs until I, Zardoz the Great, am elected in 2012?\n emoticon_xbouncer", 
   {}, 
   281178, 
   null, 
   1188325800.0
  ], 
  [
   281288, 
   null, 
   "sinjin", 
   "This would be a disaster. Iran is no Iraq militarily. \n \n http://www.globalfirepower.com/country_detail.asp?country_id=25\n http://www.globalfirepower.com/country_detail.asp?country_id=9", 
   {}, 
   281198, 
   null, 
   1188347940.0
  ], 
  [
   281293, 
   null, 
   "Winston Smith", 
   "This would be a disaster. Iran is no Iraq militarily. \n \n http://www.globalfirepower.com/country_detail.asp?country_id=25\n http://www.globalfirepower.com/country_detail.asp?country_id=9\n\n \n \n Bush wants to destroy Iran nuclear installations to protect Israel but now that he lost the majority in Congress and the support of many of his own party he can not do so.\n His Generals advised him against it for although bombing Iran's nuclear facilities was the easy part the reaction from Iran would have been an attack to Iraq and the USA can not fight Iran on the ground. \n Have you checked the Bush countdown site\n \n http://www.backwardsbush.com/", 
   {
    "unicode_changes_made": true
   }, 
   281288, 
   null, 
   1188348780.0
  ], 
  [
   281378, 
   null, 
   "peteratwar", 
   "Bush wants to destroy Iran nuclear installations to protect Israel but now that he lost the majority in Congress and the support of many of his own party he can not do so.\n His Generals advised him against it for although bombing Iran's nuclear facilities was the easy part the reaction from Iran would have been an attack to Iraq and the USA can not fight Iran on the ground. \n Have you checked the Bush countdown site\n \n http://www.backwardsbush.com/\n\n \n Whilst I agree that Bush should not bomb any of Iran's facilities, I cannot believe that you have said the US cannot fight Iran on the ground ? Other way around surely ?", 
   {
    "unicode_changes_made": true
   }, 
   281293, 
   null, 
   1188388080.0
  ], 
  [
   281388, 
   null, 
   "Winston Smith", 
   "Not at all. The military warned him that he couldn't win a war against Iran just using air power. Why do you think tha NATO forces are in Afghanistan? yes NATO in Afghanistan! unbelievable. NATO is a European force that was supposed to defend Europe from the Soviet Union.\n \n The whole world has seen in Iraq that the USA is a paper tiger. This century is not another American century", 
   {}, 
   281378, 
   null, 
   1188395820.0
  ], 
  [
   281391, 
   null, 
   "peteratwar", 
   "Not at all. The military warned him that he couldn't win a war against Iran just using air power. Why do you think tha NATO forces are in Afghanistan? yes NATO in Afghanistan! unbelievable. NATO is a European force that was supposed to defend Europe from the Soviet Union.\n \n The whole world has seen in Iraq that the USA is a paper tiger. This century is not another American century\n\n \n \n Don't really think you know what you are talking about. Of course air power cannot win a war on its own. No-one (outside some airforce commanders!) has ever thought so.\n \n Conventional american ground forces would go through Iran like a knife thru butter.\n \n However if they get bogged down in guerilla fighting then that would be another matter.\n \n However, a ground force straight attack to a target, demolish it & then withdraw would not be a military problem. Political is another matter.\n \n Paper tiger was a Chinese propaganda ploy. As I said you are lost if you start to believe your propaganda", 
   {}, 
   281388, 
   null, 
   1188397560.0
  ], 
  [
   281419, 
   null, 
   "sinjin", 
   "Conventional american ground forces would go through Iran like a knife thru butter.\nWhy would you think that?\n from previously linked site:\n Iran-\n Available Military Manpower: 18,319,545 \n Total Military Personnel: 11,770,000\n Active Frontline Personnel: 420,000", 
   {}, 
   281391, 
   null, 
   1188413820.0
  ], 
  [
   281457, 
   null, 
   "daewoo", 
   "Don't really think you know what you are talking about. Of course air power cannot win a war on its own. No-one (outside some airforce commanders!) has ever thought so.\n \n Conventional american ground forces would go through Iran like a knife thru butter.\n \n However if they get bogged down in guerilla fighting then that would be another matter.\n \n However, a ground force straight attack to a target, demolish it & then withdraw would not be a military problem. Political is another matter.\n \n Paper tiger was a Chinese propaganda ploy. As I said you are lost if you start to believe your propaganda\n\n \n There are a few problems with this. The first is that the majority of our active combat troops are on the ground in Iraq. Not only are they on the ground in Iraq, they are concentrated in relatively few fortified bases (because we cannot control the country). The Iranains have more than enough convnetional missiles to wipe not only every US base in Iraq off the map, but also every major city in israel. All of them are on mobile launchers, we knwo where very few of them are, and from the time we drop our first bombs, we have 8 minutes to find them all and destroy them, because that is how long it will take them to launch.\n \n We know Iran has standing orders that if an attack is launched against Iran, missile crews are to immediatly deploy and launch. We also know that they have run several blind tests on the system/orders and executed anybody who failed to coply, so we can be pretty sure that immediatly following a bombing in Iran, we will register the launch and flight of thousands of intermediate range missiles targeted at our troops in Iraq.\n \n So, after the first hour is over, and we have seen the loss of the vast majority of our militaries active combat force, where do we go from there?? \n \n Winston is right. Iraq has shown the US to be a paper tiger. Yea...we managed to roll over saddams 30 yr old russian junk that he has not been able to get parts for in a decade like they were not even there. I would expect the military of guatemala to be able to do the same. Then we got our butt kicked for the next several years by guys making bombs in their garages. I'm sorry, but the US military has been kncked off its pedestal.", 
   {}, 
   281391, 
   null, 
   1188434340.0
  ], 
  [
   281466, 
   null, 
   "richbrmly", 
   "There are a multitude of problems having a war with Iran.\n \n The first issue is; we'll lose all the local support in Iraq. All the Shia in Iraq will turn coat and do far more than simply help Iran. We'll open many doors in the battle and having troops where they are is simply a very poor military stand.", 
   {}, 
   281178, 
   null, 
   1188438120.0
  ], 
  [
   281477, 
   null, 
   "Winston Smith", 
   "Australia, one of the US staunchest allies in Iraq and everywhere the US asks for its help, it is reassessing its foreign strategy and opening its arms to embrace China which is steadily challenging US supremacy in all spheres, economics, military and influencing other countries. China is a strong supporter of North Korea and Iran.\n The APEC meeting here in Sydney in a couple of days, is widely regarded as an expensive exercise in futility for China does not support APEC, since it is not its creation.\n The Bush Administration has finally opened its eyes to this new reality. The USA will have to rearrange its foreign policy in accordance with its diminished military status, if it doesn't it will pay a heavy price, just look at the Vietnam in the desert called Iraq.", 
   {
    "unicode_changes_made": true
   }, 
   281466, 
   null, 
   1188443760.0
  ], 
  [
   281495, 
   null, 
   "peteratwar", 
   "There are a few problems with this. The first is that the majority of our active combat troops are on the ground in Iraq. Not only are they on the ground in Iraq, they are concentrated in relatively few fortified bases (because we cannot control the country). The Iranains have more than enough convnetional missiles to wipe not only every US base in Iraq off the map, but also every major city in israel. All of them are on mobile launchers, we knwo where very few of them are, and from the time we drop our first bombs, we have 8 minutes to find them all and destroy them, because that is how long it will take them to launch.\n \n We know Iran has standing orders that if an attack is launched against Iran, missile crews are to immediatly deploy and launch. We also know that they have run several blind tests on the system/orders and executed anybody who failed to coply, so we can be pretty sure that immediatly following a bombing in Iran, we will register the launch and flight of thousands of intermediate range missiles targeted at our troops in Iraq.\n \n So, after the first hour is over, and we have seen the loss of the vast majority of our militaries active combat force, where do we go from there?? \n \n Winston is right. Iraq has shown the US to be a paper tiger. Yea...we managed to roll over saddams 30 yr old russian junk that he has not been able to get parts for in a decade like they were not even there. I would expect the military of guatemala to be able to do the same. Then we got our butt kicked for the next several years by guys making bombs in their garages. I'm sorry, but the US military has been kncked off its pedestal.\n\n \n \n I really think you need to reassess your ideas and thinking on Iran's capability. Thousands of missiles? Certainly not.\n \n Your troops are going to stand still and be shot at and not deploying or having deployed BEFORE your planes attack ? Ridiculous thinking.\n \n Look at the number of missiles/bombs were fired at IUraq in Desert Storm. Note how long it lasted and did it wipe any cities off the map ? Certainly not.\n \n No, I don't think you really know what you are talking about sorry.", 
   {}, 
   281457, 
   null, 
   1188465120.0
  ], 
  [
   281499, 
   null, 
   "daewoo", 
   "Conventional american ground forces would go through Iran like a knife thru butter.\n\n \n I was going to let this one go, but it seems like maybe you need an education.\n \n Iran has man portable solutions for every ground assault vehicle we have up to an including the abrams tank. This is largely thatnks to ronald Regan, who thought it was a good idea to sell the nutjobs advanced anti armour weapons, which they immediatly reverse engineered and have since improved upon. They have them scattered all over the country.\n \n \nHowever if they get bogged down in guerilla fighting then that would be another matter.\n\n \n Gee....you think maybe the Iranians have thought of this? Maybe that is why their war games and battle exercises for the last 15 years have all been focused on squad level, covert attack strategies. \n \n \nHowever, a ground force straight attack to a target, demolish it & then withdraw would not be a military problem. Political is another matter.\n\n \n You need to seriously look at Iran's defensive setup. All of their high value targets are buried in bunkers. Many of their bunkers are not just vaults...they are configured as fighting bases. There will be no straight attacks against high value Iranian targets. There would have to be a siege while we spent several days breaking into the bunker we wanted. All the while the Iranian military, operating as they have been trained, as a guerrilla force, will be taking out our armored vehicles, helicopters, and personnel. \n \n There is a brilliant plan. I am not in the military any more, so I suppose I don't have any skin in that game, but I believe that for the most part US military commanders will object to intentionally putting their men in a cross fire to be shot like fish in a barrel. \n \n This is the problem with attacking Iran. They have been preparing for 25 years now for what they have viewed as an inevitable war of aggression by the US. Their entire system is set up specifically to repel a US attack. Bombing their bunkers is a waste of time because they have specifically built them to withstand attacks from not only our conventional bunker busters, but potential nuclear bunker busters as well. Their primary command and control bunker is literally designed to survive multiple direct hits by full yield nuclear weapons. \n \n You seem to be one of those guys who believes in a military \"easy\" button. Sorry, no such thing exists. Iran has teeth and if we want to tangle with them, we are going to bleed...and probably bleed a lot. All of this is hypothetical of course because odds are good that Iran's first move would be to start sinking ships passing through the strait of Hormuz and the US would be crippled due to the $200+ oil prices that came with that.", 
   {}, 
   281391, 
   null, 
   1188470100.0
  ], 
  [
   281511, 
   null, 
   "Zardoz", 
   "Why would you think that?\n from previously linked site:\n Iran-\n Available Military Manpower: 18,319,545 \n Total Military Personnel: 11,770,000\n Active Frontline Personnel: 420,000\n\n \n Numbers are irrelevant...it's force projection.\n \n I also think some way over estimate Iran's technological prowes.", 
   {}, 
   281419, 
   null, 
   1188480660.0
  ], 
  [
   281515, 
   null, 
   "Zardoz", 
   "I was going to let this one go, but it seems like maybe you need an education.\n \n Iran has man portable solutions for every ground assault vehicle we have up to an including the abrams tank. This is largely thatnks to ronald Regan, who thought it was a good idea to sell the nutjobs advanced anti armour weapons, which they immediatly reverse engineered and have since improved upon. They have them scattered all over the country.\n\n Systems 20 years old...and Iran's ability to 'improve' isn't that great.\n I'm curious where you're getting your info.\n \n \nYou need to seriously look at Iran's defensive setup. All of their high value targets are buried in bunkers. Many of their bunkers are not just vaults...they are configured as fighting bases. There will be no straight attacks against high value Iranian targets. There would have to be a siege while we spent several days breaking into the bunker we wanted. All the while the Iranian military, operating as they have been trained, as a guerrilla force, will be taking out our armored vehicles, helicopters, and personnel.\n\n A guerilla force opperates like a gnat. They are only effective if the opponent spreads out and they are allowed to pick the time and place of attack and bring better force projection. \n \n \nThis is the problem with attacking Iran. They have been preparing for 25 years now for what they have viewed as an inevitable war of aggression by the US. Their entire system is set up specifically to repel a US attack. Bombing their bunkers is a waste of time because they have specifically built them to withstand attacks from not only our conventional bunker busters, but potential nuclear bunker busters as well. Their primary command and control bunker is literally designed to survive multiple direct hits by full yield nuclear weapons.\n \n More likely they have been preparing for the past several years 'post Iraq' as the US military strategies and tactics change. Thus, old preparations would be near useless. Furthermore, you can't prepare for something you have no specifics on. Considering Iran is a non-nuclear power, their knowledge of the effects of such potential attacks is limited. Did they dig their bunkers too deep by over estimating the possible attack or did they dig too shallow due to logistical reasons. It's very doubtful they'd survive direct attacks in any meaningful way to continue with operations once hit...even if the personel survived the bombing.\n Redundancy would help but pose it's own problems too.\n \n \nYou seem to be one of those guys who believes in a military \"easy\" button. Sorry, no such thing exists. Iran has teeth and if we want to tangle with them, we are going to bleed...and probably bleed a lot. All of this is hypothetical of course because odds are good that Iran's first move would be to start sinking ships passing through the strait of Hormuz and the US would be crippled due to the $200+ oil prices that came with that.\n\n \n Military options are least favorable but considering that despite the waste and ineffeciencies, the US has devoted quite a bit of funding to these problems...what we would face is psychological will power issues and post combat problems like in Iraq in dealing with military conflict.\n Technology and force projection and initial strategy would see a cake walk with Iran or any other country.\n It's the political fallout and potential occupations that the US would have problems with.\n I also think you place too much on Iran's control of oil and OPEC.\n Iran's Shia...not many of their Sunni neighbors would like to see them dominate the region nor control an oil market.\n \n Iran also has some of their own internal and local problems. Attacking shipping of other nations in spite would just aid America over them.", 
   {}, 
   281499, 
   null, 
   1188482220.0
  ], 
  [
   281519, 
   null, 
   "peteratwar", 
   "I was going to let this one go, but it seems like maybe you need an education.\n \n Iran has man portable solutions for every ground assault vehicle we have up to an including the abrams tank. This is largely thatnks to ronald Regan, who thought it was a good idea to sell the nutjobs advanced anti armour weapons, which they immediatly reverse engineered and have since improved upon. They have them scattered all over the country.\n \n \n \n Gee....you think maybe the Iranians have thought of this? Maybe that is why their war games and battle exercises for the last 15 years have all been focused on squad level, covert attack strategies. \n \n \n \n You need to seriously look at Iran's defensive setup. All of their high value targets are buried in bunkers. Many of their bunkers are not just vaults...they are configured as fighting bases. There will be no straight attacks against high value Iranian targets. There would have to be a siege while we spent several days breaking into the bunker we wanted. All the while the Iranian military, operating as they have been trained, as a guerrilla force, will be taking out our armored vehicles, helicopters, and personnel. \n \n There is a brilliant plan. I am not in the military any more, so I suppose I don't have any skin in that game, but I believe that for the most part US military commanders will object to intentionally putting their men in a cross fire to be shot like fish in a barrel. \n \n This is the problem with attacking Iran. They have been preparing for 25 years now for what they have viewed as an inevitable war of aggression by the US. Their entire system is set up specifically to repel a US attack. Bombing their bunkers is a waste of time because they have specifically built them to withstand attacks from not only our conventional bunker busters, but potential nuclear bunker busters as well. Their primary command and control bunker is literally designed to survive multiple direct hits by full yield nuclear weapons. \n \n You seem to be one of those guys who believes in a military \"easy\" button. Sorry, no such thing exists. Iran has teeth and if we want to tangle with them, we are going to bleed...and probably bleed a lot. All of this is hypothetical of course because odds are good that Iran's first move would be to start sinking ships passing through the strait of Hormuz and the US would be crippled due to the $200+ oil prices that came with that.\n\n \n Zardoz has replied effectively to most of this.\n \n I would add that it seems strange that US military commanders would let their troops stand around and be shot at without doing anything.\n \n Granted missiles can be reprogrammed. However, they have to be told what the reprograms are and that data has to get thru to the sites in question.\n \n The odd on them having every missile in total readiness are remarkably small. That every missile would be capable if firing is remarkable small.\n \n That US tactical thinking had not considered the scenario is remarkably unlikely.\n \n In short I don't think you have considered all the possibilities and you have ignored the capabilities of your own people.\n \n I wear my veteran's badge with pride.", 
   {}, 
   281499, 
   null, 
   1188483660.0
  ], 
  [
   281564, 
   null, 
   "daewoo", 
   "Systems 20 years old...and Iran's ability to 'improve' isn't that great.\n I'm curious where you're getting your info.\n\n \n The improvements needed are not that great. While the Abrams theroetically has reactive armor, it has never been deployed, so it is just a matter of punching through slightly heavier conventional armor. They don't need to be particularly innovate (though they were the first nation to demonstrate a practical rocket torpedo and the first nation to demonstrate a practical WIG attack boat). The only really difficult part of any missile system is the guidance sytem and they got their guidance systems from the US, China, and russia and then copied them. \n \n I spent years studying Iran because until Bushs idiotic adventure in Iraq, the military assumed that if we were going to have a war in the ME, it would be with Iran. Iraq was disarmed, under crippling sanctions, and could not even keep Saddams personal plane flying. They were neutered, so not considered a viable target. Iran, on the other hand, was running the worlds largest ballistic missile production program, was building bunkers at an amazing rate, and was comissioning new weapons production factories (mostly to copy imported items) at a rate of about 3 per year. \n \n \nA guerilla force opperates like a gnat. They are only effective if the opponent spreads out and they are allowed to pick the time and place of attack and bring better force projection. \n \n \n Or they come in behind your main force and cut their supply lines...leaving the main force to sit in the desert with no food, fuel, or ammo resupply until somebody gets around to wandering out there and killing them. \n \n \nMore likely they have been preparing for the past several years 'post Iraq' as the US military strategies and tactics change. Thus, old preparations would be near useless. Furthermore, you can't prepare for something you have no specifics on. Considering Iran is a non-nuclear power, their knowledge of the effects of such potential attacks is limited. Did they dig their bunkers too deep by over estimating the possible attack or did they dig too shallow due to logistical reasons. It's very doubtful they'd survive direct attacks in any meaningful way to continue with operations once hit...even if the personel survived the bombing.\n Redundancy would help but pose it's own problems too.\n\n \n Us military strategies have not changed that much. Most of the Iranians preperations were based on our gulf I campaign against Iraq which is the exact same strategy that we used in the latest misadventure against Iraq. There are VERY few varioations when it comes to how to invade a desert nation. There just isn't that much room for innovation there. \n \n As far as their bunkers....they seem to be world class. The russians, who are probably better versed when it comes to nuclear survivability than the US (they did a LOT more direct experiments) designed their primary C&C bunkers and gave them the knowledge they needed for other bunkers. Not only are they designed to survive multiple full yield nuclear attacks, but are designed to do so and still serve as fighting bases. \n \n The interesting thing abotu the war in Lebanon was that it gave us a chance to see how our munitions performed against new Iranian bunker designs. Older bunkers were the typical 70's era underground vaults, while the bunkers built in the last 5-8 years were Irans new anti american bunker buster design. Not a single one of the new bunkers was destroyed and there was extremely limited impact to their operational capability despite the fact that the Israelis literally threw every bunker buster they had at them, then got emergency shipments of new bunker busters from the us, and used all of them as well. \n \n \n \nMilitary options are least favorable but considering that despite the waste and ineffeciencies, the US has devoted quite a bit of funding to these problems...what we would face is psychological will power issues and post combat problems like in Iraq in dealing with military conflict.\n Technology and force projection and initial strategy would see a cake walk with Iran or any other country.\n It's the political fallout and potential occupations that the US would have problems with.\n I also think you place too much on Iran's control of oil and OPEC.\n Iran's Shia...not many of their Sunni neighbors would like to see them dominate the region nor control an oil market.\n\n \n And you are putting the typical armchair generals emphasis on technology and gee wizadry. The RPG-7, arguably the least advanced shoulder fired weapon seen on the modern battlefield, is responsible for more kills of armoured vehicles and helicopters than all other shoulder launched weapons combined. It flys in a straight line and makes a big boom. For 90% of military operations, that is all you actually need. If it flys straight, makes a big boom,and you can get somebody close enough to use it, you are golden.\n \n Technological advancements in the US military have mostly just made us feel good and allowed us to use increasingly worthless recruits. We upgraded the hardware and the software which allowed us to significantly downgrade the quality of the wetware (the soldier operating it). We have built a military that does a fine job of taking out armoured divisions, then gets its XXX kicked by 10 guys with pipe bombs. \n \n I think the best example of this is inour defensive preperations in Iraq around our bases. We have state of the art jamming equipment all aroudn the perimieter. Sonic, IR, radar, even optically guided...all shut out by some of the most expensive and advanced jamming system in the world. And it all means dick when some guy decides to toss hand grenades over the fence or launch dumb mortars. \n \n \nIran also has some of their own internal and local problems. Attacking shipping of other nations in spite would just aid America over them.\n\n \n Yep. It would #### off part of the world. BUT, it would allow Iran to win the war, then they could apologize later. Do you really think the iranians are going to choose invasion and death because they don't want to risk angering finland by sinking oil tankers???", 
   {}, 
   281515, 
   null, 
   1188502980.0
  ], 
  [
   281568, 
   null, 
   "daewoo", 
   "I would add that it seems strange that US military commanders would let their troops stand around and be shot at without doing anything.\n\n \n That is the problem with your plan for lightening ground raids against Iranian targets. There can be no lightening raids as they are all hardened, which means at the very least a siege. If you end up in a siege situation, you are not only open to fire from whatever the target of your siege is, you are immobile and your flank is exposed. Likewise your supply lines become static, so they are easily attacked.\n \n The only way to take those hardened Iranian targets would be to take significant portions of the country, secure them, and then go back and try to break those targets. \n \n \nGranted missiles can be reprogrammed. However, they have to be told what the reprograms are and that data has to get thru to the sites in question.\n\n \n Not a problem. We caught the Iraqi government passing strategic informtion to Iran over 2 years ago. Any reason they would stop now?? You ar talkign about moving over 100,000 men and hundreds of thousands of tons of equiment and supplies. If it was a major bug out operation, it could possibly be achievedin a week. It is certainly NOT something that could be done secretly or in a the matter of a few hours or even days. \n \n \nThe odd on them having every missile in total readiness are remarkably small. That every missile would be capable if firing is remarkable small.\n\n \n So knock 10% off the top for possible problems. they only need about 30% of their entire stockpile to wipe out every US base in Iraq.\n \n \nThat US tactical thinking had not considered the scenario is remarkably unlikely.\n\n \n They have. That is why US military leadership has consistently come out and said \"THERE IS NO MILITARY SOLUTION FOR IRAN\".\n \n Sam Gardiner is probably the top expert on the planet when it comes to military simulations. He works at the National War College. \n \n \n\"After all this effort, I am left with two simple sentences for policymakers. You have no military solution for the issues of Iran. And you have to make diplomacy work.\" \n\n \n Even the CIA and DIA are trying to warn us off of doign somethign stupid:\n \n http://www.msnbc.msn.com/id/6039135/site/newsweek/\n \n \nNEWSWEEK has learned that the CIA and DIA have war-gamed the likely consequences of a U.S. pre-emptive strike on Iran's nuclear facilities. No one liked the outcome. As an Air Force source tells it, \"The war games were unsuccessful at preventing the conflict from escalating.\"\n\n \n \n [quote]In short I don't think you have considered all the possibilities and you have ignored the capabilities of your own people.[QUOTE]\n \n I am well aware of our capabilities. I am also aware that we lack the capability to defeat Iran as things presently set, and that their retaliation would be devastating to us. \n \n Every military leader or tactician who has commented to this point has said the same thing....no military solution. Even the Heritage Foundation....an unapologetically militant think tank, has accepted that there is no military solution to be had. It is just the politicians who cannot seem to get it through their heads. It is reminiscent of the lead up to the Iraq war. We repeatedly had military experts telling us that they could win the war, but probably not stabilize the nation following. Those guys were fired, ridiculed, or ignored, and the poltiicans cherry picked who they wanted to hear from.\n \n If this was purely a military decision, there is no way it would possibly happen because no tactician could possibly support it (and commanders typically listen to their tactical commanders). Unfortunately this will not be a military solution. It will be a political one and it will be made by an idiot who apparently does not understand even basic military planning and refuses to listen to anybody who disagrees with his infantile situational assesments...so who knows what will happen????", 
   {
    "unicode_changes_made": true
   }, 
   281519, 
   null, 
   1188504900.0
  ], 
  [
   281621, 
   null, 
   "Winston Smith", 
   "For Bush to invade Iran he needs authorization by Congress, which of course he will not get. The Congress is in this case fool proof. Therefore the above discussion is irrelevant.", 
   {}, 
   281568, 
   null, 
   1188525720.0
  ], 
  [
   281632, 
   null, 
   "daewoo", 
   "For Bush to invade Iran he needs authorization by Congress, which of course he will not get. The Congress is in this case fool proof. Therefore the above discussion is irrelevant.\n\n \n Not necessarily. Bush has not played by the rules so far...what makes you think he will start now?? Bish could, in theory, launch an attack on Iran and either claim it was part of the wartime powers he has alreay been given, or that it was directly related to the war in Iraq (hit iranian \"training base\" for Iraqi insurgents) or he could jsut do it and then say \"screw you\" like he has so many other times. One does not tell caesar what to do. \n \n Bush was all pumped up to be a wartime president and end up being classed with the greats. He sees himself with roosevelt, lincoln, etc... Instead he has turned out to be a pretty crappy wartime president and seems to remind people more of Nixon. \n \n He knows as well as any thinking, reasonably intellignet person that his policies haev been disasterous and the ones that have not yet been a disaster will be in the future. I think the man is desperate.", 
   {}, 
   281621, 
   null, 
   1188528120.0
  ], 
  [
   281783, 
   null, 
   "Winston Smith", 
   "Well, he is neither intelligent nor reasonable. He is personally stubborn and inflexible, He is dangerous criminal who has caused hundreds of thousands of deaths.\n Everyday I watch in The News Hour the photos of the American GIs killed in Iraq. What a terrible waste of human life.\n The paper tiger the US is, has been declawed in Iraq and Afghanistan where the temporary destruction of the Taliban has further destabilised Pakistan.", 
   {}, 
   281632, 
   null, 
   1188659880.0
  ], 
  [
   281878, 
   null, 
   "chemist99a", 
   "That is the problem with your plan for lightening ground raids against Iranian targets. There can be no lightening raids as they are all hardened, which means at the very least a siege. If you end up in a siege situation, you are not only open to fire from whatever the target of your siege is, you are immobile and your flank is exposed. Likewise your supply lines become static, so they are easily attacked.\n\n \n Tactical nukes and or bunker busters would probably do the job nicely.", 
   {}, 
   281783, 
   null, 
   1188719760.0
  ], 
  [
   282032, 
   null, 
   "daewoo", 
   "Tactical nukes and or bunker busters would probably do the job nicely.\n\n \n That is the problem...they won't. That was also the drive toward builidn ga new nuclear bunker buster. Currently we don't have anything that will take out irans newer bunkers and Bush wanted something in our arsenal that would do it and was prepared to ignore all objections and international laws to do it. Unfortunatly the laws of physics were harder to ignore and the program ended up getting scrapped because it was impractical.", 
   {}, 
   281878, 
   null, 
   1188842100.0
  ], 
  [
   282110, 
   null, 
   "richbrmly", 
   "That is the problem...they won't. That was also the drive toward builidn ga new nuclear bunker buster. Currently we don't have anything that will take out irans newer bunkers and Bush wanted something in our arsenal that would do it and was prepared to ignore all objections and international laws to do it. Unfortunatly the laws of physics were harder to ignore and the program ended up getting scrapped because it was impractical.\n\n \n Do you have any link to this data regarding the scrapping of the program?\n \n My hope is your right do to the negative effects the use of an atomic weapon would have.", 
   {}, 
   282032, 
   null, 
   1188881820.0
  ], 
  [
   282112, 
   null, 
   "daewoo", 
   "Do you have any link to this data regarding the scrapping of the program?\n \n My hope is your right do to the negative effects the use of an atomic weapon would have.\n\n \n http://www.msnbc.msn.com/id/9820682/\n \n \nWASHINGTON - The Bush administration has abandoned research into a nuclear \"bunker-buster\" warhead, deciding instead to pursue a similar device using conventional weaponry, a key Republican senator said Tuesday.\n\n \n \nAt a congressional hearing earlier this year, NNSA chief Linton Brooks acknowledged there is no way to avoid significant fallout of radioactive debris from use of a bunker-buster warhead.\n \n He said the administration never intended to suggest \"that it was possible to have a bomb that penetrated far enough to trap all fallout. I don't believe the laws of physics will ever let that be true.\"\n\n \n that is kind of a \"physics light\" version of why it wouldn't ever work. In a nutshell, nuclear devices are precision instruments. In either an implosion type device or a gun type device the slightest misalingment will cause the device to not detonate correctly, which means we have just delivered a weapon sized chunk of weapons grade material to the enemy...not the most brilliant strategic move.\n \n With a nuclear bunker buster, you are talking about dropping a device from an aircraft that develops velocities high enough to penetrate the ground several meters while still maintaining tolerances measured in microns. It simply can't be done.", 
   {
    "unicode_changes_made": true
   }, 
   282110, 
   null, 
   1188882960.0
  ], 
  [
   282119, 
   null, 
   "chemist99a", 
   "With a nuclear bunker buster, you are talking about dropping a device from an aircraft that develops velocities high enough to penetrate the ground several meters while still maintaining tolerances measured in microns. It simply can't be done.\n\n \n I would not be too certain of that if I were you. I had a friend back in the 1970s who worked on the sprint missile system. That was the close in ABM - the last resort. He worked on precision physical systems which had to withstand 50,000 g. and still had to work. Frankly I think speculating on what the national labs have and have not managed to engineer is risky in the extreme. There are many ways to solve problems and they come up with new wrinkels all the time.", 
   {}, 
   282112, 
   null, 
   1188884640.0
  ], 
  [
   282120, 
   null, 
   "chemist99a", 
   "That is the problem...they won't. That was also the drive toward builidn ga new nuclear bunker buster. Currently we don't have anything that will take out irans newer bunkers and Bush wanted something in our arsenal that would do it and was prepared to ignore all objections and international laws to do it. Unfortunatly the laws of physics were harder to ignore and the program ended up getting scrapped because it was impractical.\n\n \n Well then how about a nuclear powered shaped charge which expells a sharp penetrating plasma jet and in which the nuclear portion goes off at or above the surface? Analogous to RPGs which take out M1-A1's", 
   {}, 
   282119, 
   null, 
   1188884760.0
  ], 
  [
   282131, 
   null, 
   "daewoo", 
   "I would not be too certain of that if I were you. I had a friend back in the 1970s who worked on the sprint missile system. That was the close in ABM - the last resort. He worked on precision physical systems which had to withstand 50,000 g. and still had to work. Frankly I think speculating on what the national labs have and have not managed to engineer is risky in the extreme. There are many ways to solve problems and they come up with new wrinkels all the time.\n\n \n The way they established that the nuclear bunker buster was not possible was by dropping a honeycomb cored CMM (titanium/silicon fiber) cylinder from an airplane with a rocket engine attached to the back end. It exceeded mach 4 and not only did it not manage to penetrate the ground deeply enough, it bent like a pretezel. That was estimated to be roughly 9x as rigid as any potential nuclear bunker buster could be. If they didn't survive, there is no way the weapon could.", 
   {}, 
   282119, 
   null, 
   1188887880.0
  ], 
  [
   282135, 
   null, 
   "daewoo", 
   "Well then how about a nuclear powered shaped charge which expells a sharp penetrating plasma jet and in which the nuclear portion goes off at or above the surface? Analogous to RPGs which take out M1-A1's\n\n \n The problem is that you cannot \"shape\" a nuclear detonation. they are always symmetrical and the initial explosion is always a perfect sphere (laws of physics and all that). So what you would have to settle for is a focused explosion. Focused explosions use a reflector of some kind to focus the energy of the explosion in a certain direction.\n \n So, all you really need is to come up with some kind of material that will not be vaporized despite the fact that you would have to place it within inches of a nuclear detonation. Then you have to make it light enough to be carried by airplane. So far there is no material known to man that can do it, but maybe you and JP could whip something up over the weekend and change the laws of physics as we know them (since as we currently understand things, it would be impossible for such a light material to survive). \n \n Looking at projected time lines for various scientific advancements, we will almost certainly develop the the technology to teleport the bombs into the bunkers LONG before we develop the materials and technology to shoot them or drop them there. \n \n When I was in the military there were certain situations that we referred to as MWR situations....Man With Rifle. Those were the situations where no amount of technical gee wizadry, no cruise missile, no matter how accurate, and no number of bombing sorties could solve the problem. Typically it was used in reference to hostage situations or covert infiltrations, but it was also applied to situations like the Iranian bunker situation. There is no technology that is going to solve the problem. No number of Apaches or B-2 bombers is going to solve it. If we want to take those bunkers, we have to get old school....in this case back to the middle ages when siege warfare was the norm. \n \n From what I remember from briefings, the Iranian bunker complex is the most heavily fortified in the world. There are over 300 known entrances (known by us) and probably that many that we do not know about. Over half of the complex is designed to withstand repeated, full yield nuclear detonations. Their tunneling equipment is stored inside the complex in a number of different locations which ensures that they can always create new entrances or clear collapsed sections without outside aid. They carry enough food, fuel, water, and supplies to keep 150,000 combat troops 100% combat effective for 3 years. \n \n Taking those bunkers would be the ultimate game of whack a mole. You set up outside as many entrances as you can, the enemy pops out of one that you did not cover either because you did not have a million troops at your disposal, or because it pops out in ackbars basement and you didn't know about it. They kill a bunch of your troops, then retreat back into the bunker. They pop out somewhere else, kill some more, pop back in. All the while your supply lines are being harassed, your armor is under MAJOR pressure, and your helicopters cannot operate because unlike the 40 yr old shoulder fired AA weapons that were only partly sucessful in Iraq, the Iranians have nice new shoulder fired AA weapons that can take down our helicopters just fine. Also, at the same time, the US economy is tanking because the Iranains are popping silkworms like they are going to expire next week and are sinking anything and everything that floats in the persian gulf. \n \n Not a good scenario.", 
   {}, 
   282120, 
   null, 
   1188889560.0
  ], 
  [
   282136, 
   null, 
   "chemist99a", 
   "] When I was in the military there were certain situations that we referred to as MWR situations....Man With Rifle. Those were the situations where no amount of technical gee wizadry, no cruise missile, no matter how accurate, and no number of bombing sorties could solve the problem. Typically it was used in reference to hostage situations or covert infiltrations, but it was also applied to situations like the Iranian bunker situation. There is no technology that is going to solve the problem. No number of Apaches or B-2 bombers is going to solve it. If we want to take those bunkers, we have to get old school....in this case back to the middle ages when siege warfare was the norm.\n\n \n OK I have it, its not pretty but it will destroy that bunker. A precision guided 100 megaton H bomb set ground burst just above the bunker. I will grant a substantial amount of collatoral damage - but hey the bunker WILL go away. Much smaller H bombs literally vaporized small islands in the pacific during tests. You might want to get all our guys out of Iraq and Afghan efore droppins such a device though.", 
   {}, 
   282135, 
   null, 
   1188890520.0
  ], 
  [
   282137, 
   null, 
   "chemist99a", 
   "As to technical feasability of 100 Megaton H bombs consider that the Russians had one in the 1960s but were afraid to use it at full design yield. \n \n http://nuclearweaponarchive.org/Russia/TsarBomba.html", 
   {}, 
   282136, 
   null, 
   1188891300.0
  ], 
  [
   282138, 
   null, 
   "daewoo", 
   "OK I have it, its not pretty but it will destroy that bunker. A precision guided 100 megaton H bomb set ground burst just above the bunker. I will grant a substantial amount of collatoral damage - but hey the bunker WILL go away. Much smaller H bombs literally vaporized small islands in the pacific during tests. You might want to get all our guys out of Iraq and Afghan efore droppins such a device though.\n\n \n That is probably the most realistic solution I have seen.\n \n My role in sutdying the bunkers had to do with trying to formulate a strategy for a SF infiltration to keep them open so a mass force could make it inside. I was known as somebody with an unconventional background who could think outside the box. On most of the bunkers the best we could really come up with was that we would have to infiltrate in some cases a few hundred soldiers into the heart of the bunker without being detected, plus hold the doors and auxillary door controls until we could get a force of several thousand inside...then it would still be a running underground gun battle where the enemy had most of the advantages. Total mess.\n \n It really is about as ugly a situation for an attacking force as you can possibly imagine. \n \n I believe that Bush started his tough talk without understanding the reality on the ground when it comes to our ability to actually carry through. Now I fear that he may be goaded into action by a public that actually believes the BS he has spewed. In that case I think the best case scenario would be to drop a few bunker busters (after working a deal with the iranians so they don't retaliate) then announce an imaginary victory.", 
   {}, 
   282136, 
   null, 
   1188892200.0
  ], 
  [
   282139, 
   null, 
   "chemist99a", 
   "Sorry just kidding about the 100 megaton bomb. Never be practical and of couser it would be a foreign policy nightmare! On the other hand if you could somehow innoculate the soldiers popping out of those holes with the right disease having good contaigen properties and a suibtable incubation time you might be able to soften them up before our troops (who would of course be innoculated) went in and fought the tunnel war. Or if you could get enough bats with incindeary weapons into the tunnels that might help also. Who knows what human creativity might come up with for a special case attack?", 
   {}, 
   282138, 
   null, 
   1188892800.0
  ], 
  [
   282157, 
   null, 
   "Zardoz", 
   "The problem with 'bunkers' is using them.\n \n Sounds like some here think sorties out from them would pose problems for US forces.\n Unless the entrances are small and usable by man only, they would be easily identified and targeted. If any sizable force tried to sortie out of such a location, they'd be targeted and destroyed.\n Thus, leaving only terrorist options open.\n Any surface based systems (SAMS) would be far more easily targeted and removed with conventional weapon systems.\n \n Let them hide in a hole...\n \n As to the speculation of bunkers that can withstand attack and remain militarily functional, I have sever doubts.\n Cost and ability to actually build them being one of them.", 
   {}, 
   282139, 
   null, 
   1188913920.0
  ], 
  [
   282260, 
   null, 
   "richbrmly", 
   "http://www.msnbc.msn.com/id/9820682/\n \n \n \n \n \n that is kind of a \"physics light\" version of why it wouldn't ever work. In a nutshell, nuclear devices are precision instruments. In either an implosion type device or a gun type device the slightest misalingment will cause the device to not detonate correctly, which means we have just delivered a weapon sized chunk of weapons grade material to the enemy...not the most brilliant strategic move.\n \n With a nuclear bunker buster, you are talking about dropping a device from an aircraft that develops velocities high enough to penetrate the ground several meters while still maintaining tolerances measured in microns. It simply can't be done.\n\n \n So the whole Nuclear Bunker buster thing was a day dream. Its good news and yet very upsetting knowing that the country had been dwelling on this stuff. Does Bush ever talk to scientists, or does he call Pat for scientific advice? \n \n The new book coming out has Bush admitting his line about leaving when the job is done in Iraq was nuclear bunker buster too. Meaning, he never once wanted to even think about withdrawing from Iraq, no mater the outcome. Why Can't there be a Christian law about honestly??", 
   {}, 
   282112, 
   null, 
   1188956760.0
  ], 
  [
   282289, 
   null, 
   "daewoo", 
   "So the whole Nuclear Bunker buster thing was a day dream. Its good news and yet very upsetting knowing that the country had been dwelling on this stuff. Does Bush ever talk to scientists, or does he call Pat for scientific advice? \n\n \n IMO the nuclear bunker buster plan had nothing to do with nuclear bunker busters. The Bush administration just wanted to be able to drop nukes on Iran. Not long before the whoel nuclear bunker buster mess started the hawks in the Bush administration drafted new reulations that allowed for the use of tactical nukes as first strike weapons in a conventional war. \n \n It caused some waves in the public, but caused a minor revolt in the military ranks. Every military commander who made a statement about it said they would refuse such an order as unlawful and many went so far as to say that they would use the troops at their command to ensure that nobody else followed that order as well. It basically boiled down to a threat of an open. armed revolt against the CIC by the us military if he tried to use nukes in such a manner. \n \n So, they dropped that plan and then immediatly started talking nuclear bunker busters. 30 seconds on the phone should have been enough for them to realize that they would not work. I don't think that matters, though. They were trying to pursue their original intention (a go ahead to use nukes in Iran) with new terminology.", 
   {}, 
   282260, 
   null, 
   1188969780.0
  ], 
  [
   282297, 
   null, 
   "Zardoz", 
   "IMO the nuclear bunker buster plan had nothing to do with nuclear bunker busters. The Bush administration just wanted to be able to drop nukes on Iran. Not long before the whoel nuclear bunker buster mess started the hawks in the Bush administration drafted new reulations that allowed for the use of tactical nukes as first strike weapons in a conventional war. \n \n It caused some waves in the public, but caused a minor revolt in the military ranks. Every military commander who made a statement about it said they would refuse such an order as unlawful and many went so far as to say that they would use the troops at their command to ensure that nobody else followed that order as well. It basically boiled down to a threat of an open. armed revolt against the CIC by the us military if he tried to use nukes in such a manner. \n \n So, they dropped that plan and then immediatly started talking nuclear bunker busters. 30 seconds on the phone should have been enough for them to realize that they would not work. I don't think that matters, though. They were trying to pursue their original intention (a go ahead to use nukes in Iran) with new terminology.\n\n \n Anything to support this claim of dissention by CIC?\n \n The issues with the 'bunker buster' idea is to have sub-surface detonations that would produce little to no fallout...much like a contemporary test.\n \n Anything else and you have fallout.\n \n My only problem with the theory is that a failed penetration could still produce fallout...and surface detonations are dirty...", 
   {}, 
   282289, 
   null, 
   1188995760.0
  ], 
  [
   282383, 
   null, 
   "samiinh", 
   "http://www.larouchepub.com/other/2005/3221conplan_8022.html\n \n This explains some of it.", 
   {}, 
   282297, 
   null, 
   1189019040.0
  ], 
  [
   282461, 
   null, 
   "Wei Liu", 
   "No matter America goes to fight in Iran or not, one thing should do is to spread the democratic information to Iranian people, like we go to their forums if they use the net too.", 
   {
    "post_info": {
     "post_title": "Spread the democratic information"
    }
   }, 
   281515, 
   null, 
   1189061580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Will the US expand the war to Iran?", 
  "url": "http://www.4forums.com/political/current-events-debates/10296-will-us-expand-war-iran.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 10296, 
  "discussion_files": [
   [
    "7140.html", 
    "http://www.4forums.com/political/current-events-debates/10296-will-us-expand-war-iran-print.html"
   ], 
   [
    "7141.html", 
    "http://www.4forums.com/political/current-events-debates/10296-will-us-expand-war-iran-3-print.html"
   ], 
   [
    "7142.html", 
    "http://www.4forums.com/political/current-events-debates/10296-will-us-expand-war-iran-2-print.html"
   ]
  ], 
  "identifier": 10296
 }
]