[
 [
  [
   17202, 
   null, 
   "AMD4EVER", 
   "http://www.time.com/time/magazine/article/0,9171,1101030929-488779,00.html?cnn=yes\n \n Trying to depict which countries are our (The United States) allies and what countries our are enemies is not as easy of a task as it would seem to be. Before today I was under the impression that Pakistan was really doing a good job fighting terrorism in their country until I heard some political analysts debating how Pakistan wouldn't give up Bin Laden even if they were able to catch him. They debated that if Pakistan were to turn over Bin Laden to the US their country would fall into revolt. So Pakistan may just be doing as much fighting of terrorism as they have to in order to keep the US off their backs but not doing too much as to avoid their people from revolting against their government. Then I read the Time article and this supports some of these ideas and opens up even more reason to question Pakistan's allegiance with the US.\n \n So who are our friends in this world? Is Pakistan really an ally of ours or an enemy buying their time? How about France? Germany? Russia? China? If the US were in serious danger would any of them come to our aid? Does the US have any true allies?", 
   {
    "post_info": {
     "post_title": "World vs US: Who are our friends?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1064465640.0
  ], 
  [
   17229, 
   null, 
   "montalban", 
   "Australia is a formal ally of the United States.\n \n This formality was formally put into place by the ANZUS treaty (Australia - New Zealand - United States), in order to provided for joint security in the Pacific area.\n \n As part of this, Australia joined with the USA in the Vietnam War, and both Gulf Wars.\n \n The treaty was signed during the Korean War, where we were also on the USA's side, but not bound by treaty.\n \n Also there are several US bases on Australian soil. These are primarily listening-posts, rather than a military camp-style base.", 
   {
    "post_info": {
     "post_title": "I have no joy saying this..."
    }
   }, 
   17202, 
   null, 
   1064488680.0
  ], 
  [
   17233, 
   null, 
   "AMD4EVER", 
   "No joy saying that Australia is an ally of the US? I think that Australia is one of the two countries that the US can actually depend on. I also think that Australia can depend on us helping them if they are ever in trouble. So why do you have no joy in saying that the US and Australia are good allies? Who would you rather be allies with?", 
   {}, 
   17229, 
   null, 
   1064498220.0
  ], 
  [
   17235, 
   null, 
   "montalban", 
   "No joy saying that Australia is an ally of the US? I think that Australia is one of the two countries that the US can actually depend on. I also think that Australia can depend on us helping them if they are ever in trouble. So why do you have no joy in saying that the US and Australia are good allies? Who would you rather be allies with?\n\n \n I assume you believe the other country is Great Britain?\n \n I'd rather we were able to be more independent. But at the moment it seems that when GW Bush says jump John Howard says \"How high?\"\n \n But, alas, we area small country (by population), we have an army that is about 29,000 strong. I think your's is over 1,000,000, and many are worried because we're parked right next to the single biggest Muslim nation on earth; Inodonesia.", 
   {}, 
   17233, 
   null, 
   1064499420.0
  ], 
  [
   17241, 
   null, 
   "AMD4EVER", 
   "I assume you believe the other country is Great Britain?\n\n \n Correct\n \n \nI'd rather we were able to be more independent. But at the moment it seems that when GW Bush says jump John Howard says \"How high?\"\n\n \n I have the same impression for Blair. However I think it just seems that way because the US is in charge of the war on Iraq and is sort of taking the lead on the war on terror. Those are the things the are publicized every day showing how the US is leading forces from other countries in coordinated efforts to take care of both of these wars. Other than the war on terrorism and the war in Iraq, what else is the US asking of Australia that Howard is complying with?\n \n \nBut, alas, we area small country (by population), we have an army that is about 29,000 strong. I think your's is over 1,000,000, and many are worried because we're parked right next to the single biggest Muslim nation on earth; Inodonesia.\n\n \n Is this because Indonesia is a terrorist threat or because the country is very unstable and they are actually a threat to Australia?\n \n I don't think that Australia is just an ally to the US for convenience. They have a small army and a small population and enemies nearby, but I don't think these are the key reasons that Australia is our ally. South Korea is our ally because of these factors and I don't hold them up as too loyal of an ally to us because of it. If they ever did become powerful enough to stand on their own I don't think they would see anymore use for our alliance. Australia I trust because they seem genuinely interested in very similar principles to that of the US. It is also nice that they have a strong alliance with Great Britain just as the US does.", 
   {}, 
   17235, 
   null, 
   1064502600.0
  ], 
  [
   17329, 
   null, 
   "Broker", 
   "Yes, so few nations we can count on these days. Britain, Australia, most of Scandanavia (which is quite surprising). I'd also say that Spain and Italy are good friends. I'd stick South Korea in there too. The Eastern European countries are becoming good friends.\n \n Our allies are changing... I think in ten years we're going to have moved a lot of our bases into Eastern Europe and they'll be our closest allies. They've recently seen tyranny, it's fresh in their minds. Western Europe is becoming too anti-American, and they have now forgotten all that we risked for them.", 
   {}, 
   17241, 
   null, 
   1064535480.0
  ], 
  [
   17361, 
   null, 
   "AMD4EVER", 
   "Yes, so few nations we can count on these days. Britain, Australia, most of Scandanavia (which is quite surprising). I'd also say that Spain and Italy are good friends. I'd stick South Korea in there too. The Eastern European countries are becoming good friends.\n\n \n I haven't heard a whole lot about Scandinavian countries opinion on the US. Have they been helping us in Iraq?\n \n Spain and Italy I think are tagging along with us to get on our good side while the rest of Europe is going against the US. They know there are advantages to helping us now when the rest of Europe turns their back on us. I'm not sure whether they are just our ally for their own personal gain or whether they are sincere.\n \n South Korea I wouldn't call our ally. I think they are obviously our ally because North Korea and China are in the religion. The South Korean people don't seem to like our military forces being in their country and it wasn't long ago that I heard the South Korean government was considering moving our troops out of their country. Only when the North Korean thing came up did they come back around to liking US troops in their country.\n \n \nOur allies are changing... I think in ten years we're going to have moved a lot of our bases into Eastern Europe and they'll be our closest allies. They've recently seen tyranny, it's fresh in their minds. Western Europe is becoming too anti-American, and they have now forgotten all that we risked for them.\n\n \n It is sad to see this too. It seems like most of the EU countries are beginning to think like it is US vs them. I think our strong stance on Israel is one thing that is tearing apart our relationships with them. If that issue is resolved I think a lot of the tension will dissipate and maybe we will start coming back together again.\n \n One thing that will keep the EU countries on our side is the fact that they wouldn't want to see the US, Russia, and China form a strong alliance. If they let the situation degrade too much I could see Russia stepping in and trying to use the US influence to keep countries from joining NATO and the EU. From there if Russia can rebuild relations with China and China opens up trade with the US, which would greatly benefit them, then we could have the makings of a very strong alliance that would have an anti-EU view.", 
   {}, 
   17329, 
   null, 
   1064547300.0
  ], 
  [
   17436, 
   null, 
   "montalban", 
   "Although life is not a popularity contest - why do you think that the USA has so few friends?", 
   {}, 
   17361, 
   null, 
   1064568840.0
  ], 
  [
   17444, 
   null, 
   "letgo", 
   "americans think there on such a high horse these days, i think it rubs off on even our alleys.", 
   {}, 
   17436, 
   null, 
   1064574600.0
  ], 
  [
   17481, 
   null, 
   "AMD4EVER", 
   "Wow, maybe I was actually on to something concerning a US-Russia alliance. Robert McFarland of the New York Times proposed yesterday that the US and Russia come together to fight terrorism and just forget about UN opinion. The Russians can help us in Iraq and the US would help Russia with Chechnya.\n \n If both Russia and the US joined forces the countries of the UN would freak! The two most powerful countries in the world being pushed together because of the UN's inability to solve anything! The UN would have to know that it made a huge mistake and now it isn't in their control anymore. Individual countries would begin making the decision whether they are with the US and Russian alliance or not. I don't think it would take too long for that alliance to strengthen while the UN (France Inc) alliance began to weaken.\n \n The article was written because Putin is talking with Bush in Camp David today and tomorrow. There is some suspicion that Bush may try and get the Russians to send military aid to Iraq. I think this would benefit the US as well as Russia because it would make them a big player again and it would gain them an ally which they really need right now since they are against the EU.", 
   {}, 
   17444, 
   null, 
   1064602680.0
  ], 
  [
   21010, 
   null, 
   "10ite", 
   "It's America-vs-Earth I tell ya, not World vs US.\n \n I think the majority of people have a real problem with what the US is doing globally, basically trying to police the globe, and bombing innocent civilians that stand in their way. The trouble is, is that this is refelecting on Americans as a whole, and not just the current administration.\n \n You will hear people say, \"I hate America\", or \"I hate Americans because they are so arrogant towards the rest of the world\", but this hatred stems from the behaviour of the administration, not the people. I hope that the American people can get rid of Bush and his cronies so that America can be respected again, as a true and fair country, because at the moment, it is behaving no better than the terrorists it seeks to kill.", 
   {}, 
   17481, 
   null, 
   1067644860.0
  ], 
  [
   21019, 
   null, 
   "Broker", 
   "The only reason we aren't liked now is because Bush is in office. If Clinton was elected four years later, you wouldn't see any of this right now. It's just hate.", 
   {}, 
   21010, 
   null, 
   1067660820.0
  ], 
  [
   21033, 
   null, 
   "AMD4EVER", 
   "It's America-vs-Earth I tell ya, not World vs US.\n \n I think the majority of people have a real problem with what the US is doing globally, basically trying to police the globe, and bombing innocent civilians that stand in their way. The trouble is, is that this is refelecting on Americans as a whole, and not just the current administration.\n \n You will hear people say, \"I hate America\", or \"I hate Americans because they are so arrogant towards the rest of the world\", but this hatred stems from the behaviour of the administration, not the people. I hope that the American people can get rid of Bush and his cronies so that America can be respected again, as a true and fair country, because at the moment, it is behaving no better than the terrorists it seeks to kill.\n\n \n Do you believe that the US would be any less hated if it became an isolationist nation? What do you believe the results would be if the US ended all 'police' actions throughout the world? Would you have the elimination of the UN as well or would you have the UN become the unquestioned world police or somewhere inbetween?", 
   {}, 
   21010, 
   null, 
   1067667840.0
  ], 
  [
   21034, 
   null, 
   "AMD4EVER", 
   "The only reason we aren't liked now is because Bush is in office. If Clinton was elected four years later, you wouldn't see any of this right now. It's just hate.\n\n \n Bush probably hasn't done as much to improve the image of the US as he has done to tarnish it. However I don't think we were all that liked during the Clinton years either and nor will we ever be as long as we are on top. I also don't think it is just hate that is causing us not to be liked. Jealousy is also a major reason.", 
   {}, 
   21019, 
   null, 
   1067668020.0
  ], 
  [
   21073, 
   null, 
   "Broker", 
   "We had no real PR problems while Clinton was in office... they liked him and his policies. Of course, we need to bring back the US Information Agency, or whatever, too. Clinton decided to trash that...", 
   {}, 
   21034, 
   null, 
   1067729820.0
  ], 
  [
   21083, 
   null, 
   "AMD4EVER", 
   "We had no real PR problems while Clinton was in office... they liked him and his policies. Of course, we need to bring back the US Information Agency, or whatever, too. Clinton decided to trash that...\n\n \n I think Bush made a mistake in Iraq but before that point he had been doing great things for the US in terms of PR including his strong stance against terrorism. The US was very, very popular around the world for a short period of time and today we are very unpopular. This shift is probably only a short term event as long as Iraq can be brought under control and soon Iraq may turn into good PR for the US. In the here and now the results of Bush probably look more negative than they really are in my opinion. This may prove to be especially true if the US faces another terrorist attack.", 
   {}, 
   21073, 
   null, 
   1067757600.0
  ], 
  [
   21147, 
   null, 
   "10ite", 
   "Do you believe that the US would be any less hated if it became an isolationist nation? What do you believe the results would be if the US ended all 'police' actions throughout the world? Would you have the elimination of the UN as well or would you have the UN become the unquestioned world police or somewhere inbetween?\n\n \n I believe that the US has no right to police the globe, just as Russia has no right to police the globe, or China, Korea, Syria etc.. It's the cause and effect, tit-for-tat politics that is causing the problems. America may not be saying publicly that they have declared a war on Muslims, but their actions are speaking louder, so fundamentalists find it easy to recruit people who will die to attack the US, then they attack the US, so the US can then retaliate, and on and on.\n \n You can't deny that the US will fund terror when it suits them, like when the Russians were in Afghanistan, and in the Iran / Iraq war. I'm not a big fan of the UN, but I do believe that better decisions are made by a majority of leaders from different backgrounds, than individually. Because they can see the bigger picture, and how decisions on going to war will affect all the countries for many years to come.\n \n I honestly don't think a global police force is needed, attack a country in retaliation and go to war with the full backing of your country, but don't cook up some media story, because Iraq has not had the capability to attack the US or the UK for more than ten years now. A pre-emptive strike on a country that had no WMD or the ability to launch them, and killing up to 10,000 people in the process is a cowardly action and extremely shameful in my opinion.\n \n The death toll for 9/11 was recently reduced to around 2750, compare that with a very conservative estimate for the number of civilians killed in Afghanistan and Iraq and then tell me that the media hype is not overtly sympathetic to the American cause. For some reason a human in a tower block deserves much more sympathy and grieving than a human in a mud hut / desert house / foreign market place / etc...\n \n It's OK, 'cos its far away...", 
   {}, 
   21033, 
   null, 
   1067815740.0
  ], 
  [
   21177, 
   null, 
   "theLIBERTARIAN", 
   "Wow, maybe I was actually on to something concerning a US-Russia alliance. Robert McFarland of the New York Times proposed yesterday that the US and Russia come together to fight terrorism and just forget about UN opinion. The Russians can help us in Iraq and the US would help Russia with Chechnya. \n\n \n Interesting. I don't think I want that to happen though.\n \n My opinion: I don't think we really need allies. There are very few countries that would send troops if we were invaded (maybe Australia, GB). I really don't think we need to worry about being invaded. Our biggest problem is dealing with people that are retaliating against us. By choosing sides we create resentment that will cost US lives. \n \n Many fundamentalist Muslims resented us supporting Saddam and arming him. Many others resented our installing the Shah in Iran. Both cases illustrate how allegiances can backfire. Saddam later became our enemy and we lost relations with Iran for more than two decades. South Vietnam and Israel are other examples.\n \n Many fundamentalists view the Pakistan government a puppet regime because of their support for the US (for being our Ally). We may pay the biggest price here. The people of Pakistan feel we are imperialists because of the power we have over their government. If there is a coup and nukes fall into their hands we could be in trouble. \n \n We should have been the \"sleeping giant\". We should have a limited government. Americans should have been free to visit Mecca or Israel or the Pyramids without the fear of retaliation. I expect things to get worse over the next few decades. Having allies is way over-rated.", 
   {
    "unicode_changes_made": true
   }, 
   17481, 
   null, 
   1067827620.0
  ], 
  [
   21197, 
   null, 
   "AMD4EVER", 
   "10ite, It would seem you believe that no world order is necessary to provide peace. So if for instance China was to invade Taiwan, you don't believe this is the US's business just because we are the police of the world. However, the US has a lot of economic interest as well as political interest in Taiwan and Taiwan would wish for the US to provide help in the event of an attack. Is this enough to make it legitimate for the US to help Taiwan?\n \n Now lets focus on terrorism. If terrorism threatens the US does it have the right to protect itself from it? Does the US have the right to protect others from terrorism if they wish?\n \n Basically the world is so interlinked right now that every single country in the world plays the role of police. The US stands out because we have the greatest capabilities and therefore seem like we are really the only country that is playing world police. This is of course inaccurate especially if you consider the UN's role. The UN is a group of nations who are looking to help police the world.\n \n As far as I can tell this policing is part of the influence of capitalism and globalization. As more and more countries begin to depend on each other they will go to greater lengths to help their own interest in other countries as well as helping other countries interests in other parts of the world. It becomes one gigantic police action if that is how you choose to view it as countries reach out to each other to stabilize relations for their sake and the sake of their allies. It is my opinion that if you wish to eliminate these 'police' actions you will also destroy globalization and the free markets of the world. Do you think this would occur and do you agree that free markets are a cause of police actions?", 
   {}, 
   21147, 
   null, 
   1067843100.0
  ], 
  [
   21199, 
   null, 
   "AMD4EVER", 
   "My opinion: I don't think we really need allies. There are very few countries that would send troops if we were invaded (maybe Australia, GB). I really don't think we need to worry about being invaded. Our biggest problem is dealing with people that are retaliating against us. By choosing sides we create resentment that will cost US lives.\n\n \n I would doubt that we will be invaded anytime soon but I wouldn't just assume that France and Germany will be silent enemies with us forever. They really act the same way towards Russia and have done so for some time. A US-Russia alliance would be benefical if things do deteriorate between us and the EU powers.\n \n \nMany fundamentalists view the Pakistan government a puppet regime because of their support for the US (for being our Ally). We may pay the biggest price here. The people of Pakistan feel we are imperialists because of the power we have over their government. If there is a coup and nukes fall into their hands we could be in trouble. \n\n \n Very true. Lets hope it doesn't come to this and to ensure that we would be best suited to support both Pakistan and India in resolving their differences in order to provide stability for both of them.\n \n \nWe should have been the \"sleeping giant\". We should have a limited government. Americans should have been free to visit Mecca or Israel or the Pyramids without the fear of retaliation. I expect things to get worse over the next few decades. Having allies is way over-rated.\n\n \n Most allies are fair weather friends. However I believe that having good allies is a good way to keep the weather fair.", 
   {
    "unicode_changes_made": true
   }, 
   21177, 
   null, 
   1067843640.0
  ], 
  [
   21208, 
   null, 
   "theLIBERTARIAN", 
   " Very true. Lets hope it doesn't come to this and to ensure that we would be best suited to support both Pakistan and India in resolving their differences in order to provide stability for both of them. \n\n \n My point is the more we try to fix things in Pakistan the more the people will hate us. It may be better to keep our noses out of their business. We have a similar problem in Saudi Arabia (except they don't have nukes, but the people in that country hate us).\n \n We have had an interventionist policy throughout the world and that did not prevent 9-11. I think there will be more 9-11's because of this policy.\n \n \n \n Most allies are fair weather friends. However I believe that having good allies is a good way to keep the weather fair.\n\n \n What weather? They attacked us even though we have great allies. This is what I think: They like us because we give them money. They have lobbyists just like any special interest group. Our politicians are bought-off.", 
   {
    "unicode_changes_made": true
   }, 
   21199, 
   null, 
   1067847480.0
  ], 
  [
   21209, 
   null, 
   "theLIBERTARIAN", 
   " The US stands out because we have the greatest capabilities and therefore seem like we are really the only country that is playing world police. \n\n \n We are getting spread a little thin. Some think we need more men in Afghanistan since the Taliban is making new moves against the interim government. Fewer retiring servicemen are opting for reserve duty because they are getting tired of being stationed overseas.", 
   {}, 
   21197, 
   null, 
   1067847720.0
  ], 
  [
   21227, 
   null, 
   "AMD4EVER", 
   "My point is the more we try to fix things in Pakistan the more the people will hate us. It may be better to keep our noses out of their business. We have a similar problem in Saudi Arabia (except they don't have nukes, but the people in that country hate us).\n\n \n A lot of countries have hated us in the past yet here we are, the greatest superpower the world has ever known. If it has worked for us in the past why do you think that the future will be different?\n \n \nWe have had an interventionist policy throughout the world and that did not prevent 9-11. I think there will be more 9-11's because of this policy.\n\n \n Perhaps our interventionist policy has prevented one or more 9-11's. After 9-11 no one really expected that we could make it two years without any terrorist attack against us yet we did. With the fall of two buildings we responded by collapsing two terrorist governments. We showed what we were made of and perhaps that is what has kept us from being attacked again.\n \n \nWhat weather? They attacked us even though we have great allies. This is what I think: They like us because we give them money. They have lobbyists just like any special interest group. Our politicians are bought-off.\n\n \n Uhhh, lets see here. \"They\" was a group of maybe a few hundred people. \"They\" have been turned on by much of the world today and have little organization anymore. Do you think \"They\" are really that important on the grand scale? On the grand scale we haven't had a world war in almost 60 years and much of the world frowns on conquests. We actually are living in a time of relative peace and stability for much of the developed world. \"They\" are just a handful of trouble makers which no policy except mind control and thought police will ever be able to exterminate.", 
   {
    "unicode_changes_made": true
   }, 
   21208, 
   null, 
   1067876280.0
  ], 
  [
   21334, 
   null, 
   "10ite", 
   "10ite, It would seem you believe that no world order is necessary to provide peace. So if for instance China was to invade Taiwan, you don't believe this is the US's business just because we are the police of the world. However, the US has a lot of economic interest as well as political interest in Taiwan and Taiwan would wish for the US to provide help in the event of an attack. Is this enough to make it legitimate for the US to help Taiwan?\n \n Now lets focus on terrorism. If terrorism threatens the US does it have the right to protect itself from it? Does the US have the right to protect others from terrorism if they wish?\n \n Basically the world is so interlinked right now that every single country in the world plays the role of police. The US stands out because we have the greatest capabilities and therefore seem like we are really the only country that is playing world police. This is of course inaccurate especially if you consider the UN's role. The UN is a group of nations who are looking to help police the world.\n \n As far as I can tell this policing is part of the influence of capitalism and globalization. As more and more countries begin to depend on each other they will go to greater lengths to help their own interest in other countries as well as helping other countries interests in other parts of the world. It becomes one gigantic police action if that is how you choose to view it as countries reach out to each other to stabilize relations for their sake and the sake of their allies. It is my opinion that if you wish to eliminate these 'police' actions you will also destroy globalization and the free markets of the world. Do you think this would occur and do you agree that free markets are a cause of police actions?\n\n \n There is a big difference between global policing and having allies in case of war. I believe completely in the system of countries around the world allying themselves with whoever they wish, but pre-emptively striking due to a fear of something that may happen is going too far.\n \n Terrorism threatens the US because the US threatens the world, I hate to sound unsympathetic but you can't just keep referring to 9/11 without rembering the 5,000 killed in Chile (Sept 11th 1973), 30,000 Nicaraguans dead, 3,000 Panamanians etc...\n \n And free markets were a lot free'er before Bush started imposing import tariff's on catfish, steel and other goods that are cheaper than US firms can make them. Surely in a free trade market a customer should be able to choose their own goods, if those goods from the Far East are of a very low quality (and price) then nobody will buy them. Because they will buy them over US goods shows that the quality is not that far below US standards, if at all.\n \n Last year the Catfish Farmers of America ran an ad that read, \"Never trust a catfish with a foreign accent. They've grown up flapping around in Third World rivers and dining on whatever they can get their fins on.\"\n \n Hmmm, probably Agent Orange if the US have been there...", 
   {}, 
   21197, 
   null, 
   1067917080.0
  ], 
  [
   21361, 
   null, 
   "AMD4EVER", 
   "There is a big difference between global policing and having allies in case of war. I believe completely in the system of countries around the world allying themselves with whoever they wish, but pre-emptively striking due to a fear of something that may happen is going too far.\n\n \n So how long do we wait before doing something? Should we have waited for the Iranians to have more time to possibly develop nuclear weapons like the North Koreans have or were the US and UN right to step in to try and prevent this from happening? Do you think that avoiding this type of pre-emptive action could help or hurt us in the future?\n \n \nTerrorism threatens the US because the US threatens the world, I hate to sound unsympathetic but you can't just keep referring to 9/11 without rembering the 5,000 killed in Chile (Sept 11th 1973), 30,000 Nicaraguans dead, 3,000 Panamanians etc...\n\n \n Terrorism threatens nearly every nation on the planet. We have made a bigger deal about it than most other countries because they have learned to deal with it better than we have. Having it finally hit us is probably not just a result of our place in the world, it was simply inevitable. Our strong stance against it seems to have prevented a follow up attack as well and that strong stance did include attacking Afghanistan as well as Iraq. As you can see the results of our tactics can work.\n \n \nAnd free markets were a lot free'er before Bush started imposing import tariff's on catfish, steel and other goods that are cheaper than US firms can make them. Surely in a free trade market a customer should be able to choose their own goods, if those goods from the Far East are of a very low quality (and price) then nobody will buy them. Because they will buy them over US goods shows that the quality is not that far below US standards, if at all.\n\n \n No market can be truely free on a large scale. It would obviously collapse due to corruption and crime. However as you stated we should be able to buy good from the Far East if we wish and of course we can. The tariffs put on them do not prevent us from buying but it does prevent them from succeeding in selling to us in a way that would hurt our economy significantly. This is part of the 'free' market system.", 
   {}, 
   21334, 
   null, 
   1067926260.0
  ], 
  [
   21437, 
   null, 
   "10ite", 
   "So how long do we wait before doing something? Should we have waited for the Iranians to have more time to possibly develop nuclear weapons like the North Koreans have or were the US and UN right to step in to try and prevent this from happening? Do you think that avoiding this type of pre-emptive action could help or hurt us in the future?\n \n\n \n I don't see N. Korea attacking you now? Surely by your reasoning every country in the world should be attacking America, it has the most weapons so therefore poses the biggest threat..?\n \n http://www.stopwar.org.uk/images/nukecap.gif \n \n \n\n Terrorism threatens nearly every nation on the planet. We have made a bigger deal about it than most other countries because they have learned to deal with it better than we have. Having it finally hit us is probably not just a result of our place in the world, it was simply inevitable. Our strong stance against it seems to have prevented a follow up attack as well and that strong stance did include attacking Afghanistan as well as Iraq. As you can see the results of our tactics can work.\n \n\n \n Yes, even the UK, where your government and corporations sponsored it for years by funding the IRA. \"They have learned to deal with it better than we have\", what a load of toss, you've been dishing it out far more than any other country, it's just that now terrorists are better funded and better organised. And you have an extremely arrogant right-wing administration.\n \n \n\n No market can be truely free on a large scale. It would obviously collapse due to corruption and crime. However as you stated we should be able to buy good from the Far East if we wish and of course we can. The tariffs put on them do not prevent us from buying but it does prevent them from succeeding in selling to us in a way that would hurt our economy significantly. This is part of the 'free' market system.\n\n \n Buying the best product at the best price is what supply and demand is all about, and it has hurt your economy, with 20,000 car manufacturing jobs lost because car manufacturers cannot afford overpriced American steel. Just 'cos it has a US flag stamped on the side, doesn't mean it's better for everybody.", 
   {}, 
   21361, 
   null, 
   1067993040.0
  ], 
  [
   21443, 
   null, 
   "Broker", 
   "Russia has about 24,000 nuclear warheads. 16,000 are set to be taken apart, but that has not yet happened... and it probably won't for some time. Tricky tactic.", 
   {}, 
   21437, 
   null, 
   1067994360.0
  ], 
  [
   21461, 
   null, 
   "AMD4EVER", 
   "I don't see N. Korea attacking you now? Surely by your reasoning every country in the world should be attacking America, it has the most weapons so therefore poses the biggest threat..?\n \n http://www.stopwar.org.uk/images/nukecap.gif \n\n \n I don't see N. Korea attacking right now but does that mean we shouldn't consider the possibility that they may do so someday? If we find credibile evidence to suggest that this is likely shouldn't we try to pre-empt such an event?\n \n North Korea has shown itself to be untrustworthy just as Iraq had. It is the reason that they were put on the axis of evil list. We already seen this sort of event coming long before it got here and we did nothing about it. If North Korea has shown us anything it is that we have to act on the types of indications they were giving us hence the current state of relations with Iraq and Iran. However not every country falls on the axis of evil for a reason. Many have shown themselves to be trustworthy and are not trying to pose a threat to us or anyone else.\n \n To respond to your nuke link I would simply debate that if the US has the most powerful weapons on Earth and they were a threat to the world then the US would already be in control of the majority of it. So far the only country we have used our nuclear weapons on is currently one of the most successful nations in the world and are not under our control.\n \n I would also tend to fear the country who has one nuke more than I would Russia or China.\n \n \nYes, even the UK, where your government and corporations sponsored it for years by funding the IRA. \"They have learned to deal with it better than we have\", what a load of toss, you've been dishing it out far more than any other country, it's just that now terrorists are better funded and better organised. And you have an extremely arrogant right-wing administration.\n\n \n What are you talking about? The US has sponsered terrorism in the UK? Are you just going to throw out this statement without any supporting documentation?\n \n And what does our style of government have to do with this debate? I disagree with the socialist governments in the majority of Europe but I don't link them with terrorism because of it.\n \n \nBuying the best product at the best price is what supply and demand is all about, and it has hurt your economy, with 20,000 car manufacturing jobs lost because car manufacturers cannot afford overpriced American steel. Just 'cos it has a US flag stamped on the side, doesn't mean it's better for everybody.\n\n \n We can buy the best product at the best price here. That is what supply and demand is all about and that is what the free market creates. It does hurt our economy when our manufacturers cannot compete with that of other countries but this has been going on for years and years now. Our manufacturing centers are disappearing but this is not collapsing our economy. Our economy has evolved into one that revolves around services instead of manufacturing. This is probably not the last evolution our economy will face as we continue to march technology forward. Change doesn't mean that the free market is bad for our economy as we have seen since the industrial revolution.", 
   {}, 
   21437, 
   null, 
   1068007440.0
  ], 
  [
   21466, 
   null, 
   "Robbie", 
   "You can't deny that the US will fund terror when it suits them, like when the Russians were in Afghanistan, and in the Iran / Iraq war. \n\n \n So you're saying that opposing an invading army is terrorism? I agree that it was underhanded perhaps to fund the Afganis, but it's not funding terrorism.\n \n \n A pre-emptive strike on a country that had no WMD or the ability to launch them, and killing up to 10,000 people in the process is a cowardly action and extremely shameful in my opinion.\n\n \n I thought that the stated rationale was that the country was symathetic towards terrorism, and therefore likely to support terrorists who would attack the US, likley providing WMD's - rather than a direct attack. I think the jury's still out on whether there were WMD's in Iraq. I just think it is quite hard to believe that an insane dictator who had used WMD's before would decide to go clean on his own. What do you think?\n \n \nThe death toll for 9/11 was recently reduced to around 2750, compare that with a very conservative estimate for the number of civilians killed in Afghanistan and Iraq and then tell me that the media hype is not overtly sympathetic to the American cause. For some reason a human in a tower block deserves much more sympathy and grieving than a human in a mud hut / desert house / foreign market place / etc...\n \n It's OK, 'cos its far away...\n\n \n There's a difference between killing civilians on purpose and killing them by accident. In fact, one is called murder, while the other isn't. What about the civilians that the Afghanistan and Iraqi government have murdered? What about the ones they would have murdered? Should we not care about them?", 
   {}, 
   21147, 
   null, 
   1068007740.0
  ], 
  [
   21467, 
   null, 
   "Robbie", 
   "Well, this thread has proven to me that Americans really don't pay much attention to Canada. (or are you taking our support for granted?) If the US were invaded Canada would send troops, I am 100% sure of that! At the very least because if the US was defeated, we would be in trouble too.\n \n I know Canada didn't send troops to Iraq. That's because Chretien is stupid!! Ok, that's just my opinion. Chretien is from Quebec, and his views are very European, and not representative of Canada in general. One thing I have to say is that Western Canada is very supportive of the US, and it is really just Quebec who have gone for the 'hate Americans' drivel. I'm not talking about valid reasons to oppose US policies. I'm talking about the paraniod 'hate America because it's evil' type of drivel.\n \n I think a decent point was made about the tariffs. Did you know that the US slapped on about a 22% tariff on Canadian softwood lumber? That's insane! You can't deny that American governments are protectionist at times.", 
   {}, 
   21466, 
   null, 
   1068007860.0
  ], 
  [
   21731, 
   null, 
   "10ite", 
   "I don't see N. Korea attacking right now but does that mean we shouldn't consider the possibility that they may do so someday? If we find credibile evidence to suggest that this is likely shouldn't we try to pre-empt such an event?\n \n\n \n You're just repeating yourself, no you shouldn't pre-empt anything, especially when the documents presented to the public to support such action are put together by people who personally benefit from it, by millions of dollars. See Richard Perle for an example.\n \n \n\n North Korea has shown itself to be untrustworthy just as Iraq had. It is the reason that they were put on the axis of evil list. We already seen this sort of event coming long before it got here and we did nothing about it. If North Korea has shown us anything it is that we have to act on the types of indications they were giving us hence the current state of relations with Iraq and Iran. However not every country falls on the axis of evil for a reason. Many have shown themselves to be trustworthy and are not trying to pose a threat to us or anyone else.\n \n\n \n That list means nothing, Bush made it up when he was XXXXXX off.\n \n \n\n To respond to your nuke link I would simply debate that if the US has the most powerful weapons on Earth and they were a threat to the world then the US would already be in control of the majority of it. So far the only country we have used our nuclear weapons on is currently one of the most successful nations in the world and are not under our control.\n \n\n \n The US is a threat to the world, stability at least. Of over 7,000 Europeans surveyed recently, the country that is the biggest threat to world peace came out as Israel, by a big margin. US backed and funded to the tune of over $3bn a year.\n \n \n\n What are you talking about? The US has sponsered terrorism in the UK? Are you just going to throw out this statement without any supporting documentation?\n \n\n \n I thought this was common knowledge, just look it up on google, here are a couple of quotes from different articles...\n \n \"Since you brought up the IRA, I just want to state for the record, that IRA terrorists do not target Americans and are extremely unlikely to commit terrorism on American soil. In fact, much of the IRA's funding comes from wealthy Irish-Americans, just as much of the various Islamic terrorist group's funding comes from our \"friend\" Saudi Arabia.\"\n \n \"I think that it the Americans only felt it (terror threat) then and decided to tell everyone else that was the first time they'd felt it. Britain, as you know, has been dealing with Terrorism in the form of the IRA for the past 30years. I've been to Northern Ireland, Belfast, I've seen the young British Soldiers moving from doorway to doorway with such fear in their eyes that they didn't know if there were IRA snipers, or a booby-trap. So I'm not really interesting in anything the USA has to say about dealing with terrorism, Europe has been dealing with terrorism for the past 30years, hell the majority of the IRA's funding came from America, let's not start on their handling of their laughable strikes in Afghanistan. But I'm getting ahead of myself and that's a completely different conversation.\"\n \n http://lists.insecure.org/lists/politech/2003/Jan/0040.html\n \n \n\n We can buy the best product at the best price here. That is what supply and demand is all about and that is what the free market creates. It does hurt our economy when our manufacturers cannot compete with that of other countries but this has been going on for years and years now. Our manufacturing centers are disappearing but this is not collapsing our economy. Our economy has evolved into one that revolves around services instead of manufacturing. This is probably not the last evolution our economy will face as we continue to march technology forward. Change doesn't mean that the free market is bad for our economy as we have seen since the industrial revolution.\n\n \n I didn't say it only hurts your economy, it hurts those of developing nations a lot more.\n \n http://news.bbc.co.uk/nol/shared/spl/hi/pop_ups/03/business_trade_and_poor_countries/img/6.jpg\n \n \n\n Under George W Bush's 2002 Farm Bill, which has now come into effect, American taxpayers' subsidies to their farmers are to be increased by $135 billion over the next two years. It used to be that America was the country that championed subsidy reduction.\n \n America led the calls for freedom. America is now the single worst offender in the world, subsidising her farmers more per head even than the Europeans, and no, my friends, my apathetic friends, there is no global agreement on the critical issue of free trade. \n \n\n \n Full Story:\n http://www.telegraph.co.uk/opinion/main.jhtml?xml=/opinion/2003/09/11/do1102.xml", 
   {}, 
   21461, 
   null, 
   1068173400.0
  ], 
  [
   22521, 
   null, 
   "Robbie", 
   "You're just repeating yourself, no you shouldn't pre-empt anything,\n\n \n That doesn't make sense to me. If you can netralize an unstable country and eliminate a repressive government, why not?\n \n \nThe US is a threat to the world, stability at least. Of over 7,000 Europeans surveyed recently, the country that is the biggest threat to world peace came out as Israel, by a big margin. US backed and funded to the tune of over $3bn a year.\n\n \n I don't see a poll as proof of this. I am pretty pro-American, and I know I'm probably over biased, but I think you're overly biased in the other way. On my part, it makes me sound a bit simple - on your part, you sound a bit paranoid.\n \n Isreal the greatest threat? They've been attacked by their neighbors twice for just existing and have shown singular restraint despite losing so many civilians to terrorists. Why aren't the Arab countries who attacked them considered a threat by these Europeans?", 
   {}, 
   21731, 
   null, 
   1068780420.0
  ], 
  [
   22575, 
   null, 
   "10ite", 
   "Hi Robbie, how's it going?\n \n I think the US administration (and it's supporters) have to realise that just because you can do something doesn't mean you should. You could have chosen a much more repressive country such as N Korea, but seeing as they don't have a large untapped oil field, you didn't.\n \n And if the US government have figured out the major economic impact of the US running out of oil, which I'm sure they have, then they will do everything to push that date as far into the future as possible.\n \n The bizarre thing is that this seems to have passed the majority of Amercians by, just because you can buy an SUV that does 2 miles per gallon, doesn't mean you should..\n \n It's funny 'cos as SUV's get bigger, higher and armour plated, people don't realise that there may be no such thing as cheap flights in 30 years from now, in 40 years all travel by commercial aircraft may have stopped as it becomes prohibitively expensive.\n \n Instead of fighting people for their oil, realise that you have to start using less of it.\n \n An interesting document on forecasts:\n http://www.hubbertpeak.com/laherrere/Petrotech090103.pdf\n \n \n I don't see a poll as proof of anything, but you have to be realistic, you can't ask everyone. And I don't think a military occupation of territory is called restraint, nor shooting civilians and journalists.\n \n And Isreal used it's \"defence only\" American F16's to bomb Iraq's only nuclear reactor, assuming without any evidence that it would be used to create nuclear weapons.\n \n An interesting article on pre-emption.\n http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2002/09/14/wirq214.xml\n \n I think Europeans see the Isreali occupation as as catalyst in the Middle East troubles. The US backed Isreali army are seen as the aggressors, driving tanks and armour plated bulldozers at people throwing stones. And this isn't just biased media attention, as I said before journalists and civilians from the UK have been killed in Israel, whilst waving white flags, and the army have nothing to say about it.\n \n http://news.bbc.co.uk/2/hi/middle_east/3010767.stm", 
   {}, 
   22521, 
   null, 
   1068835740.0
  ], 
  [
   22578, 
   null, 
   "Charchuk", 
   "http://www.time.com/time/magazine/article/0,9171,1101030929-488779,00.html?cnn=yes\n \n Trying to depict which countries are our (The United States) allies and what countries our are enemies is not as easy of a task as it would seem to be. Before today I was under the impression that Pakistan was really doing a good job fighting terrorism in their country until I heard some political analysts debating how Pakistan wouldn't give up Bin Laden even if they were able to catch him. They debated that if Pakistan were to turn over Bin Laden to the US their country would fall into revolt. So Pakistan may just be doing as much fighting of terrorism as they have to in order to keep the US off their backs but not doing too much as to avoid their people from revolting against their government. Then I read the Time article and this supports some of these ideas and opens up even more reason to question Pakistan's allegiance with the US.\n \n So who are our friends in this world? Is Pakistan really an ally of ours or an enemy buying their time? How about France? Germany? Russia? China? If the US were in serious danger would any of them come to our aid? Does the US have any true allies?\n\n \n A true friend will tell you when you are doing something wrong wheither you want to hear it or not. The USA told its real friends to f*** o** and decided instead to accept those in the Coalition of the Billing who the majority (98%) didn't even send any troops to aid the USA in its invasion of Iraq, but expected to be compensated for their support anyways.\n \n When the terrorists attacked on 9/11 we all thought nothing of helping the USA. Canada even took in around 40,000 stranded airline passengers and put them up in hotels and private homes at no cost. And when they discovered who was responsible for the attack we also joined right in and attack Afghanistan to go after Bin Ladin and this group.\n \n But then the USA decided to detor from the just war on terror and invade Iraq and that is when we said no. Saddam was no real threat to the USA, and hardly one to his own people after 12 years of sanctions and no-fly zones. Much of what Dubya was accusing Saddam of later was done over 12 years before.\n \n They didn't show it much, but a news crew had went to one of the largest bases in Iraq and there was nothing there but rusted out junk.", 
   {
    "unicode_changes_made": true
   }, 
   17202, 
   null, 
   1068836340.0
  ], 
  [
   22609, 
   null, 
   "10ite", 
   "Yeah, it wasn't exactly a fight when bombers flew over Baghdad was it. A few SAM launchers and that was about it. More Brits died from crashing into each other and from American \"friendly\" fire than from Iraqi bullets.\n \n Also what's the point of having the most advanced weapons in the world that cost a few million dollars each when the launch control goes like:\n \n Pilot: I see a road.\n Special Forces: Yes\n Pilot: I see an intersection.\n Special Forces: Yes\n Pilot: I see some vehicles.\n Special Forces: That's your target, you're cleared to fire.\n \n A transcript of communication obtained by the British BBC journalist John Simpson whose convoy was hit by friendly fire, killing one of their crew and nine other people.\n \n http://news.bbc.co.uk/1/hi/world/middle_east/2921807.stm", 
   {}, 
   22578, 
   null, 
   1068859500.0
  ], 
  [
   22638, 
   null, 
   "Broker", 
   "I grow so tired of people saying Iraq was for nothing more than oil.Let's consider something... who was stopping the security council from lifting sanctions? We were. So, we're going to invade a country, spend 150 billion dollars on military operations, invest 50 billion dollars in oil infrastrucutre, and probably pay 30 billion dollars for reconstruction... when we could have had access to the oil just by allowing sanctions to be lifted. Is a quater of a trillion dollars worth oil that you could have had with a vote? I think not.\n \n Saddam Hussein had extensive ties to terrorism. Not just al Qaeda, of course. But they're not the only people who want to see everyone of us dead.\n \n Most importantly of all, captured al Qaeda planner Abu Zubaydah incicates that people saying bin Laden and Hussein wouldn't work together on the grounds of the latter being a secular leader are wrong. According to him, bin Laden looked at Hussein as the enemy of my enemy is my friend.\n \n Abdul Rahman Yasin was being harbored in Iraq. Yasin was a suspect in the 1993 WTC bombing. The Saddam regime provided him with monthly payments.\n \n One of the lead hijackers, Mohammed Atta met with an Iraqi Intelligence official in Prague named Ahmed al-Ani. Although attempts to discredit this have been made, Czech officials at the cabinet level have not backed away from the claim.\n \n In October 2001, two Iraqi defectors said that a 707 fuselage was being used to train terrorists in hijacking techniques. The US military has recovered this and a terrorist training camp, along with two other camps.\n \n Iraqi Intelligence Chief Faruk Hijazi met with bin Laden associates on multiple occasions. Hijazi is in US custody, and confirms the meetings.\n \n An Iraqi Intelligence Memo was discovered in 1998 with bin Ladens named whited out. It described a meeting between an al Qaeda representative and regime officials. Days afterward, al Qaeda issued an edict denouncing the US for crimes against Iraq. At about the same time, al Qaeda deputy Ayman Zawahiri was payed $300,000 by Iraq.\n \n 1,993 memos were found detailing the assistance Iraqi Intelligence gave to various terrorist groups.\n \n An Ansar al Islam base was bombed in the early days of the war. The US military estimates 500- 600 Islamic militants were killed.\n \n Iraqi intelligence met with al Qaeda officials in Afghanistan multiple times to help train al Qaeda militants with chemical agents.\n \n \n Now let's go to a WMD. We haven't found any WMD, true. But when you consider that Hussein's entire supply of anthrax, enough to kill hundreds of thousands of people, could fit into four forty pound suitcases. If the Iraqis can bury 30 Mig fighter jets and we miss them for three months operating virtually next to them, imagine how easy it is to hide a suitcase.\n \n The US military recovered 450 unmanned drones and test aircraft being used in the Iraqi WMD disperal programs. None of these were declared to the UN inspections mission.\n \n Coalition forces found new research into several agents, including ricin, being carried out by Iraqi scientists.\n \n I really don't think the programs changed much after 1997. We know that the Iraqis were possibly conducting smallpox research in 1997. UNSCOM inspectors actually found a bioreactor labeled smallpox... they tried to blow the facility up, but the French vetoed the proposal. Inspectors attempted to make the building unusable by blocking the ventilation system with concrete, but such biocontainment facilities are small and easy to setup and take apart. We also know that the Iraqis were practicing weaponizing their anthrax in 1997, working in a level three biocontainment facility using a harmless anthrax-related bacterium.\n \n The threat of biological and chemical weapons is far too big. One day, even if it takes years, we will find the Iraqi WMD. The world must take every step possible to prevent the use of these weapons, especially smallpox. The Russians manufacutured a possibly vaccine-resistant version by the ton, of which the Iraiqs were suspected to have a small piece of.\n \n Even if programs weren't active, we have the seed strains. All you have to do is plop that into a bioreactor and you're on your way to a weapon. That is a threat that cannot be ignored in a time when so much of the world's population is urban, and the threat of terrorism and such warfare runs rampant.\n \n The US invasion of Iraq was not to settle old scores or fight a war that had nothing to do with security. It should be quite obvious. There is one reason why people haven't sent more troops or money. Most of the world is in recession. Eurozone GDP growth for the year is expected at only .4%... Asia still in a hole, along with a lot of other people. Among Europeans, they have a budget deficit limit... it's hard to deploy troops when you're already pushing the Central Bank to fine you. Five years ago under the same circumstances, I submit to you that we would have 50,000 foriegn troops in Iraq and 50- 60 billion dollars in money for military and reconstruction.", 
   {}, 
   22609, 
   null, 
   1068873480.0
  ], 
  [
   22650, 
   null, 
   "Charchuk", 
   "I grow so tired of people saying Iraq was for nothing more than oil.Let's consider something... who was stopping the security council from lifting sanctions? We were. So, we're going to invade a country, spend 150 billion dollars on military operations, invest 50 billion dollars in oil infrastrucutre, and probably pay 30 billion dollars for reconstruction... when we could have had access to the oil just by allowing sanctions to be lifted. Is a quater of a trillion dollars worth oil that you could have had with a vote? I think not.\n\n \n Who said that Dubya was smart? Afterall, he's not the one who is going to pay for all of this, and his Corporate masters go to make a hugh profit as well. Who do you think is going to get most of those billion$?\n \n \nSaddam Hussein had extensive ties to terrorism. Not just al Qaeda, of course. But they're not the only people who want to see everyone of us dead.\n\n \n Please, they wanted Saddam gone just as much as Dubya did. In fact Dubya did them a big favor and opened up Iraq to them.\n \n \nMost importantly of all, captured al Qaeda planner Abu Zubaydah incicates that people saying bin Laden and Hussein wouldn't work together on the grounds of the latter being a secular leader are wrong. According to him, bin Laden looked at Hussein as the enemy of my enemy is my friend.\n\n \n Please, again. He'd say anything he thought would get him easier treatment. Confessions under these conditions are meaningless.\n \n \nAbdul Rahman Yasin was being harbored in Iraq. Yasin was a suspect in the 1993 WTC bombing. The Saddam regime provided him with monthly payments.\n\n \n And the majority of the hijackers from 9/11 were from Saudi Arabia. Plus there is much funding coming from there as well. So, when are you going to invaded SA?\n \n \nOne of the lead hijackers, Mohammed Atta met with an Iraqi Intelligence official in Prague named Ahmed al-Ani. Although attempts to discredit this have been made, Czech officials at the cabinet level have not backed away from the claim.\n\n \n Is that one of the members of the Coalition of the Billing?\n \n \nIn October 2001, two Iraqi defectors said that a 707 fuselage was being used to train terrorists in hijacking techniques. The US military has recovered this and a terrorist training camp, along with two other camps.\n\n \n Again, suspect accounts since they may say anything to get better treatment.\n \n \nIraqi Intelligence Chief Faruk Hijazi met with bin Laden associates on multiple occasions. Hijazi is in US custody, and confirms the meetings.\n\n \n Of course he did. :)\n \n \nAn Iraqi Intelligence Memo was discovered in 1998 with bin Ladens named whited out. It described a meeting between an al Qaeda representative and regime officials. Days afterward, al Qaeda issued an edict denouncing the US for crimes against Iraq. At about the same time, al Qaeda deputy Ayman Zawahiri was payed $300,000 by Iraq.\n\n \n Well, the shredder must have been broken. :)\n \n \n1,993 memos were found detailing the assistance Iraqi Intelligence gave to various terrorist groups.\n\n \n Was the ink dry on them?\n \n \nAn Ansar al Islam base was bombed in the early days of the war. The US military estimates 500- 600 Islamic militants were killed.\n\n \n Knowing the American intelligence on this would make it more likely either no one there or probably a village of innocent Iraqis. It wouldn't be the first time something like that happened.\n \n \nIraqi intelligence met with al Qaeda officials in Afghanistan multiple times to help train al Qaeda militants with chemical agents.\n\n \n You mean the ones they haven't found yet?\n \n \nNow let's go to a WMD. We haven't found any WMD, true. But when you consider that Hussein's entire supply of anthrax, enough to kill hundreds of thousands of people, could fit into four forty pound suitcases. If the Iraqis can bury 30 Mig fighter jets and we miss them for three months operating virtually next to them, imagine how easy it is to hide a suitcase.\n\n \n The imagination here is from you.\n \n \nThe US military recovered 450 unmanned drones and test aircraft being used in the Iraqi WMD disperal programs. None of these were declared to the UN inspections mission.\n\n \n Now, this one is funny. Have you seen these \"drones\"? :)\n \n \nCoalition forces found new research into several agents, including ricin, being carried out by Iraqi scientists.\n\n \n Define new?\n \n \nI really don't think the programs changed much after 1997. We know that the Iraqis were possibly conducting smallpox research in 1997. UNSCOM inspectors actually found a bioreactor labeled smallpox... they tried to blow the facility up, but the French vetoed the proposal. Inspectors attempted to make the building unusable by blocking the ventilation system with concrete, but such biocontainment facilities are small and easy to setup and take apart. We also know that the Iraqis were practicing weaponizing their anthrax in 1997, working in a level three biocontainment facility using a harmless anthrax-related bacterium.\n\n \n Speculation.\n \n \nThe threat of biological and chemical weapons is far too big. One day, even if it takes years, we will find the Iraqi WMD.\n\n \n If you find any no one will believe you because of all of the lies told already about this. It is like the story of the boy who cried wolf...\n \n \nThe world must take every step possible to prevent the use of these weapons, especially smallpox. The Russians manufacutured a possibly vaccine-resistant version by the ton, of which the Iraiqs were suspected to have a small piece of.\n\n \n So, are you going to dismantle ALL of your reserves of these weapons as well as your nuclear stockpile?\n \n \nThe US invasion of Iraq was not to settle old scores or fight a war that had nothing to do with security. It should be quite obvious. There is one reason why people haven't sent more troops or money. Most of the world is in recession. Eurozone GDP growth for the year is expected at only .4%... Asia still in a hole, along with a lot of other people. Among Europeans, they have a budget deficit limit... it's hard to deploy troops when you're already pushing the Central Bank to fine you. Five years ago under the same circumstances, I submit to you that we would have 50,000 foriegn troops in Iraq and 50- 60 billion dollars in money for military and reconstruction.\n\n \n Britian didn't have any trouble sending in any troops. And we all didn't have any trouble helping out with Afghanistan either and still are.", 
   {}, 
   22638, 
   null, 
   1068878340.0
  ], 
  [
   22657, 
   null, 
   "Robbie", 
   "Great post Broker.", 
   {}, 
   22638, 
   null, 
   1068881880.0
  ], 
  [
   22715, 
   null, 
   "Broker", 
   "Thank you. :) I haven't been posting much here because most of the liberals had left... but now it's fun time!\n \n All you have been able to do is try to slide everything I said away. You offer facts and no evidence to back it up. I will only reply to a few things for this reason, because you haven't given anything to argue.\n \n \nWho said that Dubya was smart? Afterall, he's not the one who is going to pay for all of this, and his Corporate masters go to make a hugh profit as well. Who do you think is going to get most of those billion$?\n \n \n Um... Bush's friends are making any extra profits from Gulf War II. The main example cited is a Haliburton subsidiary, but in that case that was a supplemental contract to the one they had been awarded in a routine bid every two years. Also, if you knew anything about the US federal procurement system, you'd realize how utterly absurd what you're saying is. \n \n \nPlease, they wanted Saddam gone just as much as Dubya did. In fact Dubya did them a big favor and opened up Iraq to them.\n\n \n Idle speculation on your part. Saying that just shows you don't know the facts. Hamas even had an office in Baghdad! Hussein sent out checks to terrorist organizations on a rountine basis, the most common example would be to pay families of suicide bombers in Israel. Also consider that he launched SCUD missiles into Israel in Gulf War I. They didn't want him gone. :-\\ You dismiss what the top al Qaeda planner has to say, but you have no evidence to back up what you say, other than \"he wants better treatment.\"\n \n \nThe imagination here is from you.\n \n \n That's a fact. What is there to imagine?\n \n \nNow, this one is funny. Have you seen these \"drones\"? \n \n \n Yes. I saw a picture of five or six of them in some kind of warehouse on TV months ago. Also a modified training jet of some kind. The UN also released a picture of one that they found during inspections. (1 out of 450... what a great inspection mission.)\n \n \nDefine new?\n \n \n Probably post-2000. I'm not quite sure of the dates on it. Personally speculating... I think there could have been a connection to the Iraqi ricin and the ricin that that terror cell was going to use in Britain. But that is just speculation...\n \n \nSpeculation.\n \n \n Go read the reports. Why do you practice weaponizing an anthrax-related bacterium?\n \n \nSo, are you going to dismantle ALL of your reserves of these weapons as well as your nuclear stockpile?\n \n \n Eventually, most of it, I would think. It's not the \"responsible nations\" that I am concerned about. I am opposed to all new research into nuclear weapons (The chemical and biological offensive research was discontinued way back during the Nixon administration, if you didn't know). No one should be conducting any kind of new offensive research into any of those technologies.\n \n \nBritian didn't have any trouble sending in any troops. And we all didn't have any trouble helping out with Afghanistan either and still are.\n \n \n Britain is doing a lot better than the rest of Europe. In any case, I primarily meant the Eurozone.\n \n \n \n And I just saw a report on a memo from the Defense Department to the Congress by the Weekly Standard. It indicates the following:\n \n Iraq may have played a large part in the bombing of the USS Cole\n Iraq supplied al Qaeda with 90 Iraqi and Syrian passports\n Iraq provided chemical and biological training to al Qaeda (as indicated above)\n Iraq provided al Qaeda with funding and arms (also indicated above)\n \n Don't know what any of that is based on... but it was to the intelligence committee, so look to learn more in the days to come on that memo...", 
   {}, 
   22657, 
   null, 
   1068923940.0
  ], 
  [
   22720, 
   null, 
   "Charchuk", 
   "Great post Broker.\n\n \n Of course you would agree since you don't know any better.", 
   {}, 
   22657, 
   null, 
   1068930840.0
  ], 
  [
   22721, 
   null, 
   "Charchuk", 
   "Thank you. :) I haven't been posting much here because most of the liberals had left... but now it's fun time!\n\n \n That very statement says much about your motives. Thus your opinion is irrelevant.", 
   {}, 
   22715, 
   null, 
   1068930960.0
  ], 
  [
   22731, 
   null, 
   "Broker", 
   "Well, I don't see how I could argue much with people who agree with me. :-\\", 
   {}, 
   22721, 
   null, 
   1068936000.0
  ], 
  [
   22737, 
   null, 
   "Robbie", 
   "Of course you would agree since you don't know any better.\n\n \n Thanks. :)", 
   {}, 
   22720, 
   null, 
   1068938160.0
  ], 
  [
   22744, 
   null, 
   "Charchuk", 
   "Thanks. :)\n\n \n You're welcome.", 
   {}, 
   22737, 
   null, 
   1068939600.0
  ], 
  [
   22775, 
   null, 
   "Broker", 
   "I'll assume that you have nothing left to say... you've given such a poor excuse as to why you shouldn't continue this argument.", 
   {}, 
   22744, 
   null, 
   1068953640.0
  ], 
  [
   22797, 
   null, 
   "montalban", 
   "Broker, how long now before they find all those WMDs?", 
   {}, 
   22775, 
   null, 
   1068965460.0
  ], 
  [
   22807, 
   null, 
   "JakeCJB", 
   "A review of thousands of declassified government documents and interviews with former policymakers shows that U.S. intelligence and logistical support played a crucial role in shoring up Iraqi defenses against the \"human wave\" attacks by suicidal Iranian troops. The administrations of Ronald Reagan and George H.W. Bush authorized the sale to Iraq of numerous items that had both military and civilian applications, including poisonous chemicals and deadly biological viruses, such as anthrax and bubonic plague.\n http://www.washingtonpost.com/ac2/wp-dyn?pagename=article&node=&contentId=A52241-2002Dec29&notFound=true\n \n http://www.guardian.co.uk/Iraq/Story/0,2763,866942,00.html\n \n Czech Interior Minister Stanislav Gros pushed the report, though the CIA and FBI consistently stated that it wasn't credible and couldn't be corroborated beyond the account of a single, unreliable informant. In fact, U.S. investigators believed Atta was in Virginia at the time of the alleged meeting.\n \n Still, the administration began promoting the report anew last year as the first anniversary of the terrorist attacks approached. In August, unnamed senior administration officials were quoted in the national press saying evidence of the meeting was strong. In September, Cheney publicly termed the Czech reports \"credible.\" Condoleezza Rice, the national security adviser, said the administration was continuing \"to look at evidence of that meeting.\"\n \n By then, Czech intelligence authorities were informing their European counterparts that there was no credible evidence to support the allegation.\n http://www.chicagotribune.com/news/nationworld/chi-0303200309mar20,1,2700662.story\n \n http://www.intelmessages.org/Messages/National_Security/wwwboard/messages/2155.html\n \n The British have been much quieter when it comes to any alliance between Iraq and Al Qaeda, however. Asked about the matter Wednesday, Foreign Secretary Jack Straw sounded diplomatic.\n \n \"It could well be the case that there were links, active links, between Al Qaeda and the Iraqi regime before Sept. 11,\" Straw said. \"What I'm asked is if I've seen any evidence of that. And the answer is: I haven't.\"\n \n No Prague Meeting\n \n Straw said there is some evidence of such links during the past year but did not elaborate. And on a crucial point, he and his aides made it clear that the allegations of a meeting in Prague between Atta and an Iraqi intelligence agent - Exhibit A for U.S. hawks who accuse Hussein of having a hand in the Sept. 11 plot - have been disproved.\n \n http://www.latimes.com/news/nationworld/nation/la-fg-noqaeda4nov04.story\n \n \n HAMBURG, Germany -- A former Al Qaeda recruit told German authorities last year that Abu Musab al-Zarqawi, portrayed by the Bush administration as the critical link between Osama bin Laden's group and Iraqi leader Saddam Hussein, was actually opposed to Al Qaeda.\n \n In voluminous statements given to German federal police after his April arrest, Shadi Abdallah, a 26-year-old Jordanian who claims to have served briefly as a bin Laden bodyguard, maintained that Zarqawi was allied instead with Iraq's enemy, the fundamentalist Islamic government of Iran.\n http://www.chicagotribune.com/news/nationworld/chi-0302110307feb11,0,3098456.story?coll=chi-news-hed\n \n http://query.nytimes.com/gst/abstract.html?res=F20715F73E5D0C7A8CDDAF0894DB404482\n \n \n http://www.cbc.ca/news/iraq/issues_analysis/realitycheck030410.html\n \n US delays getting rid of its chemical weapons...\n \n http://ktla.trb.com/news/nationworld/nation/la-092901chem,0,6277720.story\n \n That terrorist training camp that was found, I believe was mentioned earlier. It was found in northern Iraq, which Hussein did not control.", 
   {
    "unicode_changes_made": true
   }, 
   22797, 
   null, 
   1068966600.0
  ], 
  [
   22821, 
   null, 
   "JakeCJB", 
   "http://www.washingtonpost.com/ac2/wp-dyn?pagename=article&node=&contentId=A19822-2003Jun21&notFound=true\n \n http://www.cbsnews.com/stories/2003/08/03/world/main566412.shtml\n \n http://www.intelmessages.org/Messages/National_Security/wwwboard/messages_03/5034.html\n \n http://www.sfgate.com/cgi-bin/article.cgi?f=/news/archive/2003/07/27/national1525EDT0539.DTL", 
   {}, 
   22807, 
   null, 
   1068974460.0
  ], 
  [
   22823, 
   null, 
   "mizmaxx", 
   "It's not the \"responsible nations\" that I am concerned about.\n\n \n Then you should be really concerned about the US.\n \n \n \nBush's friends are making any extra profits from Gulf War II. \n\n \n I'm assuming you meant \"aren't\".\n \n \"How will President George W. Bush personally make millions (if not billions) from the War on Terror and Iraq? The old fashioned way. He'll inherit it. \"\n \n http://www.hereinreality.com/carlyle.html", 
   {}, 
   22821, 
   null, 
   1068976320.0
  ], 
  [
   22833, 
   null, 
   "10ite", 
   "I grow so tired of people saying Iraq was for nothing more than oil.Let's consider something... who was stopping the security council from lifting sanctions? We were. So, we're going to invade a country, spend 150 billion dollars on military operations, invest 50 billion dollars in oil infrastrucutre, and probably pay 30 billion dollars for reconstruction... when we could have had access to the oil just by allowing sanctions to be lifted. Is a quater of a trillion dollars worth oil that you could have had with a vote? I think not.\n \n Saddam Hussein had extensive ties to terrorism. Not just al Qaeda, of course. But they're not the only people who want to see everyone of us dead.\n \n Most importantly of all, captured al Qaeda planner Abu Zubaydah incicates that people saying bin Laden and Hussein wouldn't work together on the grounds of the latter being a secular leader are wrong. According to him, bin Laden looked at Hussein as the enemy of my enemy is my friend.\n \n Abdul Rahman Yasin was being harbored in Iraq. Yasin was a suspect in the 1993 WTC bombing. The Saddam regime provided him with monthly payments.\n \n One of the lead hijackers, Mohammed Atta met with an Iraqi Intelligence official in Prague named Ahmed al-Ani. Although attempts to discredit this have been made, Czech officials at the cabinet level have not backed away from the claim. etc\n\n \n If you have a look in the Congressional Library there is clear documented evidence that it was the US that trained and funded Al-Qaeda, the US that sold the majority of chemical weapons to Iraq (although Britain did too) and that Donald Rumsfeld and other senior members of the US government have produced documents stating clearly that if the US did not get control of Iraqi oil, then it would be up XXXX creek.\n \n If you really want to question facts, then go and find out how many of Bush's senior governmental posts are filled by millionaires, then see how many have shares or conflicting interests (in my humble opinion) in weapons /security/defence companies that [I]may have profited from the war.\n \n They don't exactly represent the people when making these decisions do they?\n \n I have no argument with the American people per se, but I wish that their government reflected the views of the majority and that they didn't need to be lied to to change their views.", 
   {}, 
   22775, 
   null, 
   1068989220.0
  ], 
  [
   22837, 
   null, 
   "montalban", 
   "Broker is sick of people belittling the commie-crunching activities of the USA.\n \n You seem to forgive the USA for doing anything.", 
   {}, 
   22833, 
   null, 
   1068991380.0
  ], 
  [
   22891, 
   null, 
   "Broker", 
   "We'll find the weapons. As I said, four forty pound suitcases could hold the entire supply of anthrax, enough to kill hundreds of thousands of people. Remember the fighter jet story... 30 migs buried in the sand almost next to a US outpost. We only found them because of the wind. How hard would it be to find a suitcase?\n \n I'm aware of the sales. I don't think they should have gone through. They were stopped under Bush I in 1988 when he took the presidency.\n \n As I said... attempts have been made to discredit the Prague meetings. Fact remains, cabinet level officials say it happened. Not once, but four times.\n \n The compound in Northern Iraq was the Ansar al Islam camp. Actually, I'm going to try to find where exactly it was... Hussein did control some of Northern Iraq. The three camps I'm referring to were outside of Baghdad, one of which had the 707 jet used to train airline hijackers.\n \n Here's something I wrote on another site about the supposed conflicts of interest and the like.\n \n \"We've heard a lot about Halburton sweet-heart deals and the like, but what the Democrats are telling us isn't exactly true.\n \n As established by Daniel Drezner in Slate, there is no statistically significant correlation between companies that made big campaign contributions and reconstruction contracts.\n \n Steven Kelman, the Director of the Office of Federal Procurement Policy under Bill Clinton, who is in the position to know what he is talking about, says that the allegations of contracts to Bush contributors would be considered absurd or at the least highly improbable to anyone who knows something about the contract process within the government. \n \n THe procurement system is one that is insulated from political pressures. The idea that a Bush administrator member could persuade thousands of civil servants to risk their carrers to give campaign contributors big contracts is nothing but fantasy.\n \n The contract rewarded to Kellog, Brown & Root, a Haliburton subsidiary, is a routine contract rewarded every few years to provide services to overseas troops. Not everything is covered under this normal contract. Like in the Balkans war, the Defense Department issued a temporary no-bid contract in the Iraq war to put out oil fires. The federal bidding process takes 3-5 months to complete, and KBR already had personnel in the area and the experience to complete the task.\n \n There was nothing shady about rewarding KBR with the oil fire contract. It had already won the routine service contract in 2001, which, of course, didn't cover oil fires. Stories are similar for many other allegations of cash for campaign contributors.\n \n (Information source: David Brooks, \"Cynics without a case.\" New York Times November 11th, 2003 edition. Page A19.)\"\n \n The US didn't train and fund al Qaeda. You're referring to the militants who fought the Soviet Union, most of which never joined al Qaeda or the Taliban. al Qaeda was formed in 1990.\n \n I'd like to see these documents from the defense secretary.\n \n The majority of the American people subscibe to the Bush foreign policy. Can you point out some of these lies?", 
   {}, 
   22837, 
   null, 
   1069036200.0
  ], 
  [
   22912, 
   null, 
   "JakeCJB", 
   "Most of the opposition casualties happened Thursday, when U.S. aircraft and ground forces launched a coordinated attack on what U.S. authorities called a terrorist training camp northeast of Baghdad, killing 70 fighters. One American soldier was wounded. \n \n A Pentagon official said most of the dead were non-Iraqis, apparently among the thousands of volunteers from other Arab countries who poured into Iraq before the war and who put up the stiffest resistance to the American thrust on Baghdad. \n \n Pentagon and intelligence officials say the foreign fighters include Saudis, Yemenis, Syrians and Africans motivated primarily by anti-U.S. Islamic extremist ideology rather than support for Hussein. \n \n Among the weapons found in the camp were 70 to 80 surface-to-air missiles, the Central Command said. \n \n McKiernan, speaking over a video link from Baghdad, told reporters in Washington that the attacks against U.S. troops in Iraq did not appear to be coordinated by any central authority. He said the attacks were \"only coordinated locally, not nationally.\"\n \n http://www.dailyherald.com/special/iraq/wwi_paststory.asp?intID=3778667", 
   {}, 
   22891, 
   null, 
   1069049940.0
  ], 
  [
   22914, 
   null, 
   "Charchuk", 
   "I'll assume that you have nothing left to say... you've given such a poor excuse as to why you shouldn't continue this argument.\n\n \n You opened your mouth.\n \n I learned some interesting today. You're side is losing. Read Michael Moore's new book, \"Dude, where's my Country?\" and get a few surprises. :)", 
   {}, 
   22775, 
   null, 
   1069051560.0
  ], 
  [
   22916, 
   null, 
   "Charchuk", 
   "We'll find the weapons. As I said, four forty pound suitcases could hold the entire supply of anthrax, enough to kill hundreds of thousands of people. Remember the fighter jet story... 30 migs buried in the sand almost next to a US outpost. We only found them because of the wind. How hard would it be to find a suitcase?\n\n \n \n I am sure that you will found them, all you have to do is look at your copy of the bill of sale. It turns out that the only WMD that Saddam ever had were either sold or given to him by the American government.\n \n BTW, even if you find them no one will believe you. They'd just think that you planted them there. Remember the old say, \"Fool me once shame on you, fool me twice shame on me.\" You just cried wolf one too many times for your word to mean anything now.", 
   {}, 
   22891, 
   null, 
   1069051920.0
  ], 
  [
   22978, 
   null, 
   "Broker", 
   "I made a comment on Mr. Moore in another thread, and in all honesty and seriousness I mean don't buy what he says. Don't take it as partisan in any way... Moore has a reputation built around distorting facts and just making things up (anyone recall the Lockheed Martin plant that was assembling weapons of mass destruction? Yeah...). \n \n I would recommend other sources to verify any of what he has to say, because you will find most of it false. Try looking a few things up if you like, and you will see what I mean.\n \n That's not true. The Iraqis had other sources for things... let's try Soviet Union. Did you get that one from Mr. Moore too?", 
   {}, 
   22916, 
   null, 
   1069106040.0
  ], 
  [
   22984, 
   null, 
   "Charchuk", 
   "Broker, how long now before they find all those WMDs?\n\n \n As soon as they are manufactured and delivered from American companies?", 
   {}, 
   22797, 
   null, 
   1069111920.0
  ], 
  [
   22985, 
   null, 
   "Charchuk", 
   "I made a comment on Mr. Moore in another thread, and in all honesty and seriousness I mean don't buy what he says. Don't take it as partisan in any way... Moore has a reputation built around distorting facts and just making things up (anyone recall the Lockheed Martin plant that was assembling weapons of mass destruction? Yeah...). \n \n I would recommend other sources to verify any of what he has to say, because you will find most of it false. Try looking a few things up if you like, and you will see what I mean.\n\n \n http://www.michaelmoore.com/words/wackoattacko/\n \n \nThat's not true. The Iraqis had other sources for things... let's try Soviet Union. Did you get that one from Mr. Moore too?\n\n \n \n The Soviet Union has been gone for around 12 years now, you know back when Saddam was actually a real threat. The majority of these weapons are now ineffective since they only have a short shelf life. In other words the warantee has run out, they are long passed their due date....", 
   {}, 
   22978, 
   null, 
   1069112280.0
  ], 
  [
   23007, 
   null, 
   "Broker", 
   "For biological organisms, it's called a bioreactor, and Germany sold quite a few to Iraq in 1995. I'm far more concerned about bioweapons than I am chemical weapons. Chemicals weapons kill in a small area. Biological weapons are impossible to target. A few spores of weaponized anthrax can drift miles and miles in the wind.", 
   {}, 
   22985, 
   null, 
   1069123740.0
  ], 
  [
   23066, 
   null, 
   "Charchuk", 
   "For biological organisms, it's called a bioreactor, and Germany sold quite a few to Iraq in 1995. I'm far more concerned about bioweapons than I am chemical weapons. Chemicals weapons kill in a small area. Biological weapons are impossible to target. A few spores of weaponized anthrax can drift miles and miles in the wind.\n\n \n Have they even found the places where this sort of thing could be even stored? The USA has more of these weapons than most other countries. When are you going to dispose of all of them. How can we trust you? Your word? Dubya has more than trashed that. You were the original seller to Saddam back when he used them. And afterall the USA is the only nation to ever use nuclear weapons against a primarily civilian population.", 
   {}, 
   23007, 
   null, 
   1069167900.0
  ], 
  [
   23107, 
   null, 
   "Broker", 
   "That's the thing... you can store the stuff in plenty of places. You can stick in a freezer, use a portable bioreactor, etc... \n \n Tell me when the US has used WMD recently. There you go. The CDC is in the process of destroying weapons, but court challenges by localities have delayed the process.\n \n That was three administrations ago...\n \n Well... we targeted legitimate things. We weren't really sure of how powerful the bombs were going to be. I don't know if I agree with it... on one hand, it saved a million American lives. On the other...", 
   {}, 
   23066, 
   null, 
   1069192920.0
  ], 
  [
   23109, 
   null, 
   "Charchuk", 
   "That's the thing... you can store the stuff in plenty of places. You can stick in a freezer, use a portable bioreactor, etc... \n\n \n In that case why aren't Iraqis dropping like flies now? Remember they went without electricity for quite a while. And of course there was plenty of looting going on unchecked. Including the hospitals which had much of the equipment neccessry to contain such things.\n \n \nTell me when the US has used WMD recently.\n\n \n Irrelevant. They have more than shown that they are all too willing to use them.\n \n \nThere you go. The CDC is in the process of destroying weapons, but court challenges by localities have delayed the process.\n\n \n How convenient. :)\n \n \nThat was three administrations ago...\n\n \n Irrelevant.\n \n \nWell... we targeted legitimate things. We weren't really sure of how powerful the bombs were going to be. I don't know if I agree with it... on one hand, it saved a million American lives. On the other...\n\n \n That is a lie about saving a million American lives. There were many other valid options, like a blockade, to use instead of the bombs. And there were better military targets as well. It was mainly dropped there to see the effects on human tissue of radiation on a large scale, and of course as a warning to the USSR not to think of taking over the holdings the Japanese had in Asia like they had done in Eastern Europe after the defeat of the Nazis.", 
   {}, 
   23107, 
   null, 
   1069193700.0
  ], 
  [
   23122, 
   null, 
   "Broker", 
   "I seem to remember an Iraqi scientist who's freezer was holding the WMD reference strains...\n \n It's true. It's a NIMBY thing... no one wants them destroyed in their area. The latest suit was by a city in Alabama... they're afraid of health effects even though there won't be any problems. The Army won that case and is in the process of destroying some stock now, but other areas are still in Court.\n \n Considering that it was a test run... I would say that most of what you said is irrelevant. The port facilities were an important strategic target... if Japan kept up you take on bigger targets.", 
   {}, 
   23109, 
   null, 
   1069203480.0
  ], 
  [
   23172, 
   null, 
   "Charchuk", 
   "I seem to remember an Iraqi scientist who's freezer was holding the WMD reference strains...\n\n \n Wasn't that also one of the many accounts which was later proven not to be the case?\n \n \nIt's true. It's a NIMBY thing... no one wants them destroyed in their area. The latest suit was by a city in Alabama... they're afraid of health effects even though there won't be any problems. The Army won that case and is in the process of destroying some stock now, but other areas are still in Court.\n\n \n Most of the time they just don't tell the peopel what they're doing. They are some accounts of the military moving such weapons secretly and it had come out only afterwards.\n \n \nConsidering that it was a test run... I would say that most of what you said is irrelevant. The port facilities were an important strategic target... if Japan kept up you take on bigger targets.\n\n \n The USA only had two bombs at the time so they picked the targets which they thought would send a clear message to all who were concerned. The truth was that Japan was ready to surrender before the bombs were dropped. The USA wanted an unconditional surrender only and the Japanese only condition was to keep their emperior. They got to keep him anyways.", 
   {}, 
   23122, 
   null, 
   1069253940.0
  ], 
  [
   23211, 
   null, 
   "Broker", 
   "No, we found the stuff in his freezer. :-\\ He said he also had anthrax for a few days but didn't think it was safe so returned it to the labs.\n \n I'd like to see these accounts.\n \n I wouldn't say Japan was ready to surrender from all I have read and seen. Hirohito had no intention of giving it up until after we dropped the second bomb. Then he decided that they weren't going to win and that Japan would only sink further.", 
   {}, 
   23172, 
   null, 
   1069282440.0
  ], 
  [
   23274, 
   null, 
   "JakeCJB", 
   "US finds evidence of WMD at last - buried in a field in Maryland \n \n Julian Borger in Washington\n Wednesday May 28, 2003\n The Guardian \n \n The good news for the Pentagon yesterday was that its investigators had finally unearthed evidence of weapons of mass destruction, including 100 vials of anthrax and other dangerous bacteria. \n The bad news was that the stash was found, not in Iraq, but fewer than 50 miles from Washington, near Fort Detrick in the Maryland countryside. http://www.guardian.co.uk/international/story/0,3604,965231,00.html\n \n \n \n Anthrax attack bug \"identical\" to army strain \n \n \n 19:00 09 May 02 \n \n NewScientist.com news service \n \n The DNA sequence of the anthrax sent through the US mail in 2001 has been revealed and confirms suspicions that the bacteria originally came from a US military laboratory.\n \n http://www.newscientist.com/news/news.jsp?id=ns99992265\n \n \n \n (AP) A University of Connecticut student was charged Monday with keeping anthrax in a campus laboratory but authorities said he will not be prosecuted if he completes a pretrial diversion program. http://www.cbsnews.com/stories/2002/07/24/national/main516090.shtml", 
   {}, 
   23211, 
   null, 
   1069331700.0
  ], 
  [
   23281, 
   null, 
   "Charchuk", 
   "No, we found the stuff in his freezer. :-\\ He said he also had anthrax for a few days but didn't think it was safe so returned it to the labs.\n \n I'd like to see these accounts.\n\n \n Me as well.\n \n \nI wouldn't say Japan was ready to surrender from all I have read and seen. Hirohito had no intention of giving it up until after we dropped the second bomb. Then he decided that they weren't going to win and that Japan would only sink further.\n\n \n You mean the official version? Of course he didn't want to surrender unconditionally. He would lose face with that. But the Japanese had offered to surrender conditionally beforehand, though. The Americans said NO. They would settle only for the complete and utter surrender of Japan. This was mainly to do with making Japan pay for daring to attack the USA.", 
   {}, 
   23211, 
   null, 
   1069337820.0
  ], 
  [
   23322, 
   null, 
   "Broker", 
   "So you don't have anything on these accounts? :-\\\n \n That seems to me to be mere speculation.", 
   {}, 
   23281, 
   null, 
   1069364520.0
  ], 
  [
   23328, 
   null, 
   "Charchuk", 
   "So you don't have anything on these accounts? :-\\\n \n That seems to me to be mere speculation.\n\n \n It isn't speculation. The Japanese government had put out \"feelers\" for surrender before the bombs were dropped through intermediates with the one condition that they keep their emperor. The Americans put it off as only a delaying tactic and thus ignored it. They wanted unconditional surrender only.", 
   {}, 
   23322, 
   null, 
   1069366380.0
  ], 
  [
   23347, 
   null, 
   "Broker", 
   "You just started going off about the unofficial version of history... emoticon_rolleyes", 
   {}, 
   23328, 
   null, 
   1069375020.0
  ], 
  [
   23352, 
   null, 
   "Charchuk", 
   "You just started going off about the unofficial version of history... emoticon_rolleyes\n\n \n You mean the official version of history. Pay attention.", 
   {}, 
   23347, 
   null, 
   1069376160.0
  ], 
  [
   23359, 
   null, 
   "Broker", 
   "No, the unofficial version. Last time I checked that was what you were talking about.", 
   {}, 
   23352, 
   null, 
   1069379220.0
  ], 
  [
   23377, 
   null, 
   "montalban", 
   "[QUOTE=Broker]Tell me when the US has used WMD recently. There you go. The CDC is in the process of destroying weapons, but court challenges by localities have delayed the process.\n \n Bush senior used depleted uranium on the Iraqiis. The children of Iraq now have the burden of a higher rate of birth defects than most nations, but\n \n \nThat was three administrations ago...\n\n \n Mmm.... Most governments share responsibility.\n \n When the administration changes, do all government contracts become null and void? Do all government employees have to re-apply for their jobs?\n \n No? That's because of the notion of government accountability.", 
   {}, 
   23107, 
   null, 
   1069389660.0
  ], 
  [
   23378, 
   null, 
   "montalban", 
   "No, we found the stuff in his freezer. :-\\ He said he also had anthrax for a few days but didn't think it was safe so returned it to the labs.\n\n \n If this were the case, then the Bush admin would be pumping it out over the airwaves right now.\n \n But they aren't.\n \n Why do you think it's still an issue that they're looking for WMDs?", 
   {}, 
   23211, 
   null, 
   1069389720.0
  ], 
  [
   23468, 
   null, 
   "Broker", 
   "It's nothing big. Reference strains... wow. We've already said they could produce on demand, no one cares... it's already been established.", 
   {}, 
   23378, 
   null, 
   1069458120.0
  ], 
  [
   23488, 
   null, 
   "Charchuk", 
   "It's nothing big. Reference strains... wow. We've already said they could produce on demand, no one cares... it's already been established.\n\n \n No, it hasn't, if it were than it would be all over the news. That is why they are still looking. As it turns out, Saddam had no means of producing such weapons in any short period of time as was used to justify the invasion. \n \n Face it. You are defending liars and worse. That doesn't reflect too kindly on you.", 
   {}, 
   23468, 
   null, 
   1069463820.0
  ], 
  [
   23515, 
   null, 
   "Broker", 
   "It's not big news. You can't kill people with a reference strain. :-\\ We have the reference strains, there is information about them and the scientists holding them in the interim report by Dr. Kay. \n \n Maybe you should read it and decide for yourself. Just because the press doesn't care doesn't make it untrue. Here's a picture of the vials containing the material.\n \n http://i.cnn.net/cnn/2003/images/10/02/top.vials.jpg\n \n And here's some stuff from the CNN article no longer present on the site (it is now a 404)\n \n \"A clandestine network of laboratories and safe houses within the Iraqi Intelligence Service that contained equipment that was subject to U.N. monitoring and was suitable for continuing chemical and biological weapons research.\n \n A prison laboratory complex that possibly was used to test biological weapons agents on humans. Kay said his investigations have shown that Iraqi officials working to prepare for U.N. inspections were ordered not to declare the facility to the U.N.\n \n Reference strains of biological organisms concealed in the home of an Iraqi scientist. One of the strains can be used to produce biological weapons.\n \n New research on biological weapons-applicable agents, Brucella and Congo Crimean Hemorrhagic Fever (CCHF), and continuing work on ricin and aflatoxin ? none of which were declared to the U.N.\n \n Documents and equipment, hidden in scientists' homes, that would have helped Iraq resume uranium enrichment by centrifuge and electromagnetic isotope separation.\"", 
   {}, 
   23488, 
   null, 
   1069472520.0
  ], 
  [
   23516, 
   null, 
   "Broker", 
   "Note especially the Congo Crimean Hemorrhagic Fever... that, along with the rest of its type, is a terrible disease. I can't even begin to image the horrors of its use as a biological weapon.\n \n In addition... one scientist was hiding 49 reference strains at his home. He was the same guy who had the anthrax in his freezer for a few days.", 
   {}, 
   23515, 
   null, 
   1069472580.0
  ], 
  [
   23551, 
   null, 
   "Charchuk", 
   "It's not big news. You can't kill people with a reference strain. :-\\ We have the reference strains, there is information about them and the scientists holding them in the interim report by Dr. Kay.\n\n \n Reference strains like what they keep at the CDC and in Moscow of Smallpox? \n \n \nMaybe you should read it and decide for yourself. Just because the press doesn't care doesn't make it untrue. Here's a picture of the vials containing the material.\n \n http://i.cnn.net/cnn/2003/images/10/02/top.vials.jpg\n \n And here's some stuff from the CNN article no longer present on the site (it is now a 404)\n\n \n Maybe because it was a deadend.\n \n \n\"A clandestine network of laboratories and safe houses within the Iraqi Intelligence Service that contained equipment that was subject to U.N. monitoring and was suitable for continuing chemical and biological weapons research.\n \n A prison laboratory complex that possibly was used to test biological weapons agents on humans. Kay said his investigations have shown that Iraqi officials working to prepare for U.N. inspections were ordered not to declare the facility to the U.N.\n \n Reference strains of biological organisms concealed in the home of an Iraqi scientist. One of the strains can be used to produce biological weapons.\n \n New research on biological weapons-applicable agents, Brucella and Congo Crimean Hemorrhagic Fever (CCHF), and continuing work on ricin and aflatoxin ? none of which were declared to the U.N.\n \n Documents and equipment, hidden in scientists' homes, that would have helped Iraq resume uranium enrichment by centrifuge and electromagnetic isotope separation.\"\n\n \n This is the same sort of \"information\" as the ones used to \"prove\" that Saddam was buying fissionable materials from Africa. Fool me once shame on you, fool me twice shame on me.", 
   {}, 
   23515, 
   null, 
   1069511520.0
  ], 
  [
   23552, 
   null, 
   "Charchuk", 
   "Note especially the Congo Crimean Hemorrhagic Fever... that, along with the rest of its type, is a terrible disease. I can't even begin to image the horrors of its use as a biological weapon.\n \n In addition... one scientist was hiding 49 reference strains at his home. He was the same guy who had the anthrax in his freezer for a few days.\n\n \n If you want a real horror story check out what the CDC has. And they keep them in level 4 (or is it 5?) contaiment labs where you have to be completely suited up in fully self-contained suits just to enter the lab. The risks are so great and you go on about dead reference samples. :) The American CDC is a far greater threat than anything which may, or may not be in Iraq.\n \n You should face up to the fact that you've been used and lied to.", 
   {}, 
   23516, 
   null, 
   1069511820.0
  ], 
  [
   23577, 
   null, 
   "Broker", 
   "No... they wanted to prove that with British documents that the Italians had given us. But those documents aren't the only basis for the Africa claim either.\n \n The CDC is quite different. And I wouldn't say the bad stuff is mostly at the CDC, I'd say it's at USAMRIID. Of course you have to be in level 4 to work with some of that stuff... it is quite dangerous. But that's in a level 4 biocontainment lab in the center of the complex kept under negative pressure. The difference is that they are conducting research into vaccines and the like, not weaponizing agents and stuffing them into missiles.", 
   {}, 
   23552, 
   null, 
   1069521180.0
  ], 
  [
   23578, 
   null, 
   "Charchuk", 
   "No... they wanted to prove that with British documents that the Italians had given us. But those documents aren't the only basis for the Africa claim either.\n\n \n As it turns out none of them were based on facts either.\n \n \nThe CDC is quite different. And I wouldn't say the bad stuff is mostly at the CDC, I'd say it's at USAMRIID. Of course you have to be in level 4 to work with some of that stuff... it is quite dangerous. But that's in a level 4 biocontainment lab in the center of the complex kept under negative pressure. The difference is that they are conducting research into vaccines and the like, not weaponizing agents and stuffing them into missiles.\n\n \n Irrelevant. They still exist as more of a real danger than anything in Iraq. Besides what is in the CDC can be more easily convert to weapons than what is in Iraq. How do you know that the Iraq scientists weren't doing the same?", 
   {}, 
   23577, 
   null, 
   1069521600.0
  ], 
  [
   23579, 
   null, 
   "Broker", 
   "How are they such a danger?\n \n Anything anywhere can be converted. They have a safe at USAMRIID with all the \"recipies.\"", 
   {}, 
   23578, 
   null, 
   1069521960.0
  ], 
  [
   23583, 
   null, 
   "Charchuk", 
   "How are they such a danger?\n \n Anything anywhere can be converted. They have a safe at USAMRIID with all the \"recipies.\"\n\n \n The USA doesn't have to \"convert\" most of them since they are already pretty deadly. The Iraqis would have to learn the \"recipe\" basically from scratch. 45 minutes is hardly enough time for the Iraqis to do that. :)", 
   {}, 
   23579, 
   null, 
   1069522260.0
  ], 
  [
   23587, 
   null, 
   "Broker", 
   "Yes, but if we wanted to use a weapon we'd weaponize it. Weaponized anthrax particles fly miles in the wind. But the government isn't stupid enough to do that. Anyone who releases a biological weapon will hurt their own people in the end... anthrax drifts. HF and smallpox are contagious... in a week there'd be cases on evry continent from one trasmission point.\n \n Of course... Hussein isn't known for thinking. It's his fault that he lost GF I and GF II... because he was sure that he could take the US on and defeat us. Blair made the 45 minute claim... I don't know that's based on. I won't defend it.", 
   {}, 
   23583, 
   null, 
   1069522980.0
  ], 
  [
   23596, 
   null, 
   "Charchuk", 
   "Yes, but if we wanted to use a weapon we'd weaponize it. Weaponized anthrax particles fly miles in the wind. But the government isn't stupid enough to do that. Anyone who releases a biological weapon will hurt their own people in the end... anthrax drifts. HF and smallpox are contagious... in a week there'd be cases on evry continent from one trasmission point.\n\n \n You give the government too much credit. :)\n \n \nOf course... Hussein isn't known for thinking. It's his fault that he lost GF I and GF II... because he was sure that he could take the US on and defeat us. \n\n \n Lost? Isn't it usual to remove the leader of a country when they lose? You only drove him out of office this time even after he had agreed to the inspections.\n \n \nBlair made the 45 minute claim... I don't know that's based on. I won't defend it.\n\n \n Dubya used them anyways as facts.", 
   {}, 
   23587, 
   null, 
   1069523640.0
  ], 
  [
   23605, 
   null, 
   "Broker", 
   "The point was that Hussein isn't a rational person and sees thiongs as he wants to see them.\n \n I heard him cite it once when he was standing next to Blair.", 
   {}, 
   23596, 
   null, 
   1069525680.0
  ], 
  [
   23608, 
   null, 
   "Charchuk", 
   "The point was that Hussein isn't a rational person and sees thiongs as he wants to see them.\n\n \n Apparent that would describe Dubya as well.\n \n \nI heard him cite it once when he was standing next to Blair.\n\n \n So? He should have been more clear. He had made it sound like they had absolute evidence, which they didn't. You don't go to war on hearsay.", 
   {}, 
   23605, 
   null, 
   1069528620.0
  ], 
  [
   23615, 
   null, 
   "Broker", 
   "emoticon_rolleyes \n \n We didn't go to war on that claim. :-\\", 
   {}, 
   23608, 
   null, 
   1069531380.0
  ], 
  [
   23700, 
   null, 
   "Charchuk", 
   "emoticon_rolleyes \n \n We didn't go to war on that claim. :-\\\n\n \n Yes, you did, but when it was discovered that there were no WMD Dubya quickly shifted it, but it was too late.", 
   {}, 
   23615, 
   null, 
   1069599180.0
  ], 
  [
   23744, 
   null, 
   "Broker", 
   "WMD was never the only case or the only reason, at least not here. Blair played that up in Britain and it was their only case, but not in the US. The biggest issue for most people was terrorism, because that is now our biggest concern. \n \n In any case, they had live weapons reference strains, they had the bioreactors, they had the shells and drone dispersal systems to deliver weapons. They're buried somewhere under the sand. One day we will find them.", 
   {}, 
   23700, 
   null, 
   1069619880.0
  ], 
  [
   23750, 
   null, 
   "Charchuk", 
   "WMD was never the only case or the only reason, at least not here. Blair played that up in Britain and it was their only case, but not in the US. The biggest issue for most people was terrorism, because that is now our biggest concern.\n\n \n Yes, it was. The Saddam wasn't following the UN resolution, even though he was. That Saddam was going to be able to launch these WND on very short notice.\n \n It also turns out that Iraq didn't have anything at all to do with the terrorists. In fact Saudi Arabia had far more to do with it, and still does, than Iraq did. Bin Ladin, and the other terrorists wanted Saddam gone as well. Dubys had done them a big favor by removing Saddam from power. \n \n \nIn any case, they had live weapons reference strains, they had the bioreactors, they had the shells and drone dispersal systems to deliver weapons. They're buried somewhere under the sand. One day we will find them.\n\n \n We've seen all of those things, and guess what, they weren't exactly as claimed. It was another American deception. Another lie exposed.", 
   {}, 
   23744, 
   null, 
   1069621080.0
  ], 
  [
   23760, 
   null, 
   "Broker", 
   "Well, Mr. Canada, I'm so glad you know so much more about US policy. \n \n That's not true. I've posted all the stuff before but you decided that you don't believe any of it. emoticon_rolleyes \n \n How do you mean?", 
   {}, 
   23750, 
   null, 
   1069626900.0
  ], 
  [
   23786, 
   null, 
   "montalban", 
   "WMD was never the only case or the only reason, at least not here. Blair played that up in Britain and it was their only case, but not in the US. The biggest issue for most people was terrorism, because that is now our biggest concern. \n \n In any case, they had live weapons reference strains, they had the bioreactors, they had the shells and drone dispersal systems to deliver weapons. They're buried somewhere under the sand. One day we will find them.\n\n \n In Australia it was terrorism too that lead us to follow you.\n \n \n Your belief in finding the WMDs buried in the sand, is I believe something you and I have already dealt with; notably if the spy-satellites supposedly showed them moving it about, how come they never showed where they actually wound up?", 
   {}, 
   23744, 
   null, 
   1069648020.0
  ], 
  [
   23837, 
   null, 
   "Broker", 
   "Considering that you can't follow a moving object... it was just a lucky shot. If you don't know where something is going you can't catch it.", 
   {}, 
   23786, 
   null, 
   1069679940.0
  ], 
  [
   23865, 
   null, 
   "Charchuk", 
   "Well, Mr. Canada, I'm so glad you know so much more about US policy.\n\n \n Wouldn't you if you had to sleep with an elephant? You know, every unexpected twitch and movement could prove to be fatal.\n \n \nThat's not true. I've posted all the stuff before but you decided that you don't believe any of it. emoticon_rolleyes\n\n \n Of course since it has mainly been proven to be lies. \n \n \nHow do you mean?\n\n \n How do I mean what?", 
   {}, 
   23760, 
   null, 
   1069692840.0
  ], 
  [
   23885, 
   null, 
   "Broker", 
   "You didn't prove anything. You just explained why it could be false or said it didn't matter. emoticon_rolleyes \n \n \"We've seen all of those things, and guess what, they weren't exactly as claimed. It was another American deception. Another lie exposed.\"\n \n How do you mean? I'm not aware of any deceptions thus far.", 
   {}, 
   23865, 
   null, 
   1069710060.0
  ], 
  [
   23905, 
   null, 
   "Charchuk", 
   "You didn't prove anything. You just explained why it could be false or said it didn't matter. emoticon_rolleyes \n \n How do you mean? I'm not aware of any deceptions thus far.\n\n \n Maybe because you're so use to it that you can't tell the difference anymore, or you're just being an apologist and have no concept of what is true and what is false.", 
   {}, 
   23885, 
   null, 
   1069719120.0
  ], 
  [
   23909, 
   null, 
   "Broker", 
   "Why don't you try detailing some of them. :)", 
   {}, 
   23905, 
   null, 
   1069719720.0
  ], 
  [
   23924, 
   null, 
   "10ite", 
   "WMD was never the only case or the only reason, at least not here. Blair played that up in Britain and it was their only case, but not in the US. The biggest issue for most people was terrorism, because that is now our biggest concern. \n \n In any case, they had live weapons reference strains, they had the bioreactors, they had the shells and drone dispersal systems to deliver weapons. They're buried somewhere under the sand. One day we will find them.\n\n \n Bush and Rumsfeld had to retract statements they had made about 9/11, terrorist links and Iraq, because they knew them to be false. But by the time they had (quietly) the media were already in a frenzy about Saddam and terrorism, anyone who disagreed was (and still is) branded as unpatriotic.\n \n http://www.scoop.co.nz/mason/stories/HL0302/S00081.htm\n C Powell\n \"This morning, it was brought home to me once again when I read the transcript of what bin Laden, or who we believe to be bin Laden, will be saying on Al-Jazeera during the course of the day -- and you'll be seeing this as the day unfolds -- where once again he speaks to the people of Iraq and talks about their struggle and how he is in partnership with Iraq. This nexus between terrorists and states that are developing weapons of mass destruction can no longer be looked away from and ignored. As the President has said, 9/11 changed things. (emphasis added)\"\n \n America-vs-Earth\n \"Of course the people don't want war. But after all, it's the leaders of the country who determine the policy, and it's always a simple matter to drag the people along whether it's a democracy, a fascist dictatorship, a parliament, or a communist dictatorship. Voice or no voice, the people can always be brought to the bidding of the leaders. That is easy. All you have to do is tell them they are being attacked, and denounce the pacifists for lack of patriotism and exposing the country to greater danger.\"\n \n F*ck knows why Bliar got involved, he's not even going to get rich from it?", 
   {
    "unicode_changes_made": true
   }, 
   23744, 
   null, 
   1069726320.0
  ], 
  [
   23929, 
   null, 
   "Broker", 
   "They are linked to terrorism. Just not 9/11... but no one in the government ever said they were involved in 9/11.\n \n Further... no one's patriotism has been attacked. That's what gets me... where are these attacks on patriotism? I'm very interested in seeing the quotes... but they don't exist. That's just a line the anti-war crowd likes to use... saying that people are attacking their patriotism when they can't name anyone. emoticon_rolleyes", 
   {}, 
   23924, 
   null, 
   1069729800.0
  ], 
  [
   23944, 
   null, 
   "montalban", 
   "They are linked to terrorism. Just not 9/11... but no one in the government ever said they were involved in 9/11.\n \n Further... no one's patriotism has been attacked. That's what gets me... where are these attacks on patriotism? I'm very interested in seeing the quotes... but they don't exist. That's just a line the anti-war crowd likes to use... saying that people are attacking their patriotism when they can't name anyone. emoticon_rolleyes\n\n \n Your first statement isn't true. Bush gov't said that Iraq was a refuge for terrorists.\n \n In part this is true. There were 'terrorists' in the north of the country that were protected by the US from Sadaam! The no-fly zone meant that the Iraq air force couldn't get at them. So, they were in Iraq, just not in the bit Sadaam controlled.", 
   {}, 
   23929, 
   null, 
   1069735080.0
  ], 
  [
   23973, 
   null, 
   "Broker", 
   "I'll post this again.\n \n Most importantly of all, captured al Qaeda planner Abu Zubaydah incicates that people saying bin Laden and Hussein wouldn't work together on the grounds of the latter being a secular leader are wrong. According to him, bin Laden looked at Hussein as the enemy of my enemy is my friend.\n \n Abdul Rahman Yasin was being harbored in Iraq. Yasin was a suspect in the 1993 WTC bombing. The Saddam regime provided him with monthly payments.\n \n One of the lead hijackers, Mohammed Atta met with an Iraqi Intelligence official in Prague named Ahmed al-Ani. Although attempts to discredit this have been made, Czech officials at the cabinet level have not backed away from the claim.\n \n In October 2001, two Iraqi defectors said that a 707 fuselage was being used to train terrorists in hijacking techniques. The US military has recovered this and a terrorist training camp, along with two other camps.\n \n Iraqi Intelligence Chief Faruk Hijazi met with bin Laden associates on multiple occasions. Hijazi is in US custody, and confirms the meetings.\n \n An Iraqi Intelligence Memo was discovered in 1998 with bin Ladens named whited out. It described a meeting between an al Qaeda representative and regime officials. Days afterward, al Qaeda issued an edict denouncing the US for crimes against Iraq. At about the same time, al Qaeda deputy Ayman Zawahiri was payed $300,000 by Iraq.\n \n 1,993 memos were found detailing the assistance Iraqi Intelligence gave to various terrorist groups.\n \n An Ansar al Islam base was bombed in the early days of the war. The US military estimates 500- 600 Islamic militants were killed.\n \n Iraqi intelligence met with al Qaeda officials in Afghanistan multiple times to help train al Qaeda militants with chemical agents.", 
   {}, 
   23944, 
   null, 
   1069766820.0
  ], 
  [
   23982, 
   null, 
   "Charchuk", 
   "I'll post this again.\n\n \n They'll saying anything to confuse the issue. That is a part of their terrorism. When you have a caputered terrorist leader. You don't take their word on anything. It is no different than the disinformation used by the American military as well.\n \n You must realize that when those on these board agree with this that the Iraqi War is a lie and these same people, on this BBS, are also adversaries in most other things here as well that your position isn't all that good. :)", 
   {}, 
   23973, 
   null, 
   1069772400.0
  ], 
  [
   24026, 
   null, 
   "Broker", 
   "COnsidering that much of the other information has been shown solid, I would say otherwise. That's just the easiest way to discredit something.\n \n More people would agree with me. Slanted sources aren't the best indicators.", 
   {}, 
   23982, 
   null, 
   1069796940.0
  ], 
  [
   24029, 
   null, 
   "Charchuk", 
   "COnsidering that much of the other information has been shown solid, I would say otherwise. That's just the easiest way to discredit something.\n\n \n What other \"information\"?\n \n \nMore people would agree with me. Slanted sources aren't the best indicators.\n\n \n Then why do you use them? :)", 
   {}, 
   24026, 
   null, 
   1069799460.0
  ], 
  [
   24062, 
   null, 
   "Broker", 
   "We've confirmed a lot of what the terrorists that we have captured have said. One reason... if you give information they can prove, you get to go to the better came. False information gets you downgraded.", 
   {}, 
   24029, 
   null, 
   1069809660.0
  ], 
  [
   24124, 
   null, 
   "Charchuk", 
   "We've confirmed a lot of what the terrorists that we have captured have said. One reason... if you give information they can prove, you get to go to the better came. False information gets you downgraded.\n\n \n Give it a rest. You're getting as bad as rapture.", 
   {}, 
   24062, 
   null, 
   1069856340.0
  ], 
  [
   24170, 
   null, 
   "Broker", 
   "What are you talking about? That's how the system in GB works... I'm not on one of his rants.", 
   {}, 
   24124, 
   null, 
   1069895100.0
  ], 
  [
   24190, 
   null, 
   "Charchuk", 
   "What are you talking about? That's how the system in GB works... I'm not on one of his rants.\n\n \n You're doing nothing but rant and on a topic which has been more than proven that the American government lied and is still lying.", 
   {}, 
   24170, 
   null, 
   1069903800.0
  ], 
  [
   24223, 
   null, 
   "AMD4EVER", 
   "What are you talking about? That's how the system in GB works... I'm not on one of his rants.\n\n \n I don't give Bush enough credit to believe that he is the one running the 'system'. I suspect Cheney is really the one pulling the strings.\n \n Anyways through all the corruption and lying I think this administration has done well for the US on a whole. They are no Kennedy administration but they are also not the Nazis.", 
   {}, 
   24170, 
   null, 
   1069919160.0
  ], 
  [
   24274, 
   null, 
   "Broker", 
   "In other word, you're losing. Thank you. :)\n \n \n I don't think that at all. Bush isn't the smartest man in the world, but he's certainly not a dumb one. To say someone else controls his government... don't know where Cheney would find time, hiding in a bunker most of the time. ;)", 
   {}, 
   24223, 
   null, 
   1069965780.0
  ], 
  [
   24522, 
   null, 
   "AMD4EVER", 
   "In other word, you're losing. Thank you. :)\n\n \n I thought we were on the same side here.\n \n \nI don't think that at all. Bush isn't the smartest man in the world, but he's certainly not a dumb one. To say someone else controls his government... don't know where Cheney would find time, hiding in a bunker most of the time. ;)\n\n \n What is Cheney doing in that bunker would you say?", 
   {}, 
   24274, 
   null, 
   1070089320.0
  ], 
  [
   24644, 
   null, 
   "Broker", 
   "Not you, Mr. No Facts.\n \n I'd say he's doing paperwork underneath a desk... lol. He probably spends a lot of time with Bush discussing policy. That or working on a task the President assigns (because Bush is a delegator... that's the same way I run things... not because Cheney does what he wants).", 
   {}, 
   24522, 
   null, 
   1070157480.0
  ], 
  [
   24701, 
   null, 
   "AMD4EVER", 
   "Not you, Mr. No Facts.\n\n \n The fact is that he stood to personally benefit from the Iraqi war and took advantage of that opportunity. Are you really surprised to see Halliburton at work in Iraq?", 
   {}, 
   24644, 
   null, 
   1070177640.0
  ], 
  [
   24719, 
   null, 
   "mizmaxx", 
   "*peeks in* Just wondering, Broker, whether you bothered to read that Micheal Moore link Charchuk graciously provided. If you did, won't you kindly retract your slanderous statements about him and his film?\n \n Here's the link again, in case you just happened to miss it the first time- click here .", 
   {}, 
   24701, 
   null, 
   1070184900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  World vs US: Who are our friends?", 
  "url": "http://www.4forums.com/political/politics-debates/1031-world-vs-us-who-our-friends.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 1031, 
  "discussion_files": [
   [
    "13425.html", 
    "http://www.4forums.com/political/politics-debates/1031-world-vs-us-who-our-friends-print.html"
   ], 
   [
    "13426.html", 
    "http://www.4forums.com/political/politics-debates/1031-world-vs-us-who-our-friends-8-print.html"
   ], 
   [
    "13427.html", 
    "http://www.4forums.com/political/politics-debates/1031-world-vs-us-who-our-friends-6-print.html"
   ], 
   [
    "13428.html", 
    "http://www.4forums.com/political/politics-debates/1031-world-vs-us-who-our-friends-4-print.html"
   ], 
   [
    "13429.html", 
    "http://www.4forums.com/political/politics-debates/1031-world-vs-us-who-our-friends-5-print.html"
   ], 
   [
    "13430.html", 
    "http://www.4forums.com/political/politics-debates/1031-world-vs-us-who-our-friends-7-print.html"
   ], 
   [
    "13431.html", 
    "http://www.4forums.com/political/politics-debates/1031-world-vs-us-who-our-friends-3-print.html"
   ], 
   [
    "13432.html", 
    "http://www.4forums.com/political/politics-debates/1031-world-vs-us-who-our-friends-2-print.html"
   ]
  ], 
  "identifier": 1031
 }
]