[
 [
  [
   282070, 
   null, 
   "robbie0517", 
   "Here we go again. Since there are clearly gay families in New Jersey with the new civil unions law, it only seems natural to include gay families in this video. What is the harm of knowing these families exist? Do the parents want their kids to be ignorant to such family structures? I also wonder on what grounds Garden State Equality would sue as is mentioned at the end of the article. \n \n You can see clips from the video at this website http://www.womedia.org/taf_clips.htm\n \n Article link http://365gay.com/Newscon07/09/090307video.htm\n \n \n(Marlton, New Jersey) A video used to teach junior school students about diverse families will no longer be shown after some parents mounted an aggressive campaign against if for including a depiction of same-sex couples.\n \n The Evesham Township School District, in southern New Jersey, voted 7-1 to discontinue using the video, \"That's A Family,\" because had so divided the community.\n \n The tape was shown last school year to third grade students at J. Howard Van Zant School. It included various types of parents and families - divorced, bilingual, mixed race, parents who have adopted, and step-parents.\n \n But it was the same-sex couple featured that angered parents.\n \n Parents opposed to the video began their campaign in January, shortly after it was first shown. \n \n At a stormy school district meeting earlier this year one parent suggested the Golden Rule - treat others as you would treat yourself - had nothing to do with homosexuality.\n \n \"Treat others as you would want to be treated, you don't have to teach all these horrible concepts to them about the golden rule, do you,\" the parent of one eight-year old screamed at the the school board.\n \n \"When does Evesham Township or any school have a right to show to my grandchildren something I believe to be morally wrong,\" asked another woman.\n \n That opposition continued to grow throughout the summer. This week, as the school district began preparations for the fall term, parents brought the issue to a boil.\n \n More than 200 people attended Thursday night's school district meeting.\n \n \"I look out here and see a community tearing itself apart,\" said board member Joseph Fisicaro Jr. \"It's obvious this video is a lightning rod.\"\n \n Among those in favor of the video were members of the Garden State Equality, New Jersey's largest LGBT civil rights organization.\n \n \"This saga is very far from over,\" said Steven Goldstein, the chair Garden State Equality.\n \n He said the organization is considering filing a lawsuit over the district's decision.\n \n New Jersey recognizes same-sex couples under its civil unions law, designed to give gay and lesbian couples the same rights as married couples.\n", 
   {
    "post_info": {
     "post_title": "School District Bans Diversity Video Because It Includes Gay Couples"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1188868320.0
  ], 
  [
   282083, 
   null, 
   "jyoshu", 
   "Homosexuality-related issues have the status of being broadly moralistically-based (unlike the other 'family types'), and as long as that's the case, some parents are going to object. \n \n As one of the grandparents said ...\n \n \"When does Evesham Township or any school have a right to show to my grandchildren something I believe to be morally wrong?\"\n \n Of course, individual schools should have latitude in this. But it's only natural that they aren't going to include something that so many people feel is morally wrong. While it wouldn't bother me to see gay families in the video, I can certainly understand the school's position.", 
   {}, 
   282070, 
   null, 
   1188872040.0
  ], 
  [
   282085, 
   null, 
   "robbie0517", 
   "Homosexuality-related issues have the status of being broadly moralistically-based (unlike the other 'family types'), and as long as that's the case, some parents are going to object. \n \n As one of the grandparents said ...\n \n \"When does Evesham Township or any school have a right to show to my grandchildren something I believe to be morally wrong?\"\n \n Of course, individual schools should have latitude in this. But it's only natural that they aren't going to include something that so many people feel is morally wrong. While it wouldn't bother me to see gay families in the video, I can certainly understand the school's position.\n\n \n If they felt that interracial families were \"immoral\" should they have the right to have a video showing an interracial family pulled as well?", 
   {}, 
   282083, 
   null, 
   1188872640.0
  ], 
  [
   282146, 
   null, 
   "lesz", 
   "Of course, individual schools should have latitude in this. But it's only natural that they aren't going to include something that so many people feel is morally wrong. While it wouldn't bother me to see gay families in the video, I can certainly understand the school's position.\n\n \n Translation: \"I myself, of course, am enlightened and not bigoted because 'some of my best friends are gay', but it's perfectly understandable that others are, and schools should reflect the narrow-minded, self-righteous prejudices of the majority of the parents and grandparents. I just can't understand why those pesky gay activists get all upset about it when they do.\"", 
   {}, 
   282085, 
   null, 
   1188908040.0
  ], 
  [
   282158, 
   null, 
   "davenport15", 
   "Homosexuality-related issues have the status of being broadly moralistically-based (unlike the other 'family types'), and as long as that's the case, some parents are going to object. \n \n As one of the grandparents said ...\n \n \"When does Evesham Township or any school have a right to show to my grandchildren something I believe to be morally wrong?\"\n \n Of course, individual schools should have latitude in this. But it's only natural that they aren't going to include something that so many people feel is morally wrong. While it wouldn't bother me to see gay families in the video, I can certainly understand the school's position.\n\n \n There is nothing morally right or wrong with a family. It is a family. You may have prejudices against some types of families, but the family is a unit of parents and children - in many configurations.\n \n It's sad that the school acquiesced to the prejudices of a few. I watched the video, and there is nothing offensive about it. At the most it might challenge the prejudices of ignorant viewers. Isn't that, really, the purpose of education? To challenge ignorance?\n \n And what does it say about the children viewing the video who do come from families with gay parents? Are they to be shunned, too?", 
   {}, 
   282083, 
   null, 
   1188914880.0
  ], 
  [
   282160, 
   null, 
   "chemist99a", 
   "\"When does Evesham Township or any school have a right to show to my grandchildren something I believe to be morally wrong?\"\n\n \n Well lets look at that premise. If schools had to eliminate every thing which any individual parent found morally wrong there would be virtually nothing left to teach would there? Some would find evolution morally wrong, some would find the Federal Reserve morally wrong, some might well find long division morally wrong, some would find Dick and Jane morally wrong, some would find education of girls morally wrong. And so it goes endlessly until there is nothing left.", 
   {}, 
   282158, 
   null, 
   1188915420.0
  ], 
  [
   282161, 
   null, 
   "lesz", 
   "And what does it say about the children viewing the video who do come from families with gay parents? Are they to be shunned, too?\n\n \n Of course! It's perfectly reasonable for schools to reflect the prejudice of homophobic parents even if it does hurt gay children, or the children of gay parents, because majorities have the right to inflict pain on minorities, simply because they are majorities. Stands to reason...\n \n Quit your unreasonable beefing!", 
   {}, 
   282158, 
   null, 
   1188915540.0
  ], 
  [
   282163, 
   null, 
   "jitobear", 
   "\"When does Evesham Township or any school have a right to show to my grandchildren something I believe to be morally wrong?\"\n \n Why do the religious folks have the right to build their churches right there in front of my child when religion is something I believe to be morally wrong?\n \n emoticon_rolleyes", 
   {}, 
   282161, 
   null, 
   1188916980.0
  ], 
  [
   282164, 
   null, 
   "jyoshu", 
   "If they felt that interracial families were \"immoral\" should they have the right to have a video showing an interracial family pulled as well?\n\n \n The bottom line is that on that issue they don't, on this one they do.", 
   {}, 
   282085, 
   null, 
   1188917280.0
  ], 
  [
   282181, 
   null, 
   "snakespit", 
   "The bottom line is that on that issue they don't, on this one they do.\n\n \n True, but I fail to see how this should make it acceptable. Ignorance, discrimination, and bigotry are not values that we should be teaching our children. I for one find it offensive that due to the ignorant prejudice of a few, our children have to grow up in an evironment that continues to teach segregation and suppression of those who are different from them or those that they may not agree with. Sticking gays back in the proverbial closet only serves to stigmatize gays and perpetuate the cycle of ignorance.", 
   {}, 
   282164, 
   null, 
   1188927000.0
  ], 
  [
   282185, 
   null, 
   "thelmoose", 
   "If one takes the position that homosexuality is morally wrong, that's fine. Twisted, illogical, archaic, puritanical and stupid, but fine to hold any idiotic position you like. Poison your children with that information if you want. You are doing them a great disservice, but that your prerogative. \n \n But that's where it stops. You still need to teach your children that there are homosexuals out there and they should be treated with respect and when encountering them, keep your Neanderthal opinions to yourself.", 
   {}, 
   282181, 
   null, 
   1188931800.0
  ], 
  [
   282188, 
   null, 
   "jyoshu", 
   "True, but I fail to see how this should make it acceptable. Ignorance, discrimination, and bigotry are not values that we should be teaching our children.\n\n \n Well, that's a statement that begs the question, of course. The parents would say they aren't teaching ignorance, discrimination, and bigotry. Rather they simply don't want something taught in the school that they consider immoral.", 
   {}, 
   282181, 
   null, 
   1188932520.0
  ], 
  [
   282189, 
   null, 
   "jyoshu", 
   "But that's where it stops. You still need to teach your children that there are homosexuals out there and they should be treated with respect and when encountering them, keep your Neanderthal opinions to yourself.\n\n \n So how do you suggest schools determine what issues are going to be off-limits due to moralistic concerns, and what ones aren't?", 
   {}, 
   282185, 
   null, 
   1188932640.0
  ], 
  [
   282192, 
   null, 
   "thelmoose", 
   "So how do you suggest schools determine what issues are going to be off-limits due to moralistic concerns, and what ones aren't?\n\n \n OK ideas:\n The ones that make sense.\n The ones that don't harm children when they are taught.\n The one that aren't SOLELY based on backward rules of some backward religion.", 
   {}, 
   282189, 
   null, 
   1188933540.0
  ], 
  [
   282197, 
   null, 
   "Matthew S", 
   "Homosexuality-related issues have the status of being broadly moralistically-based (unlike the other 'family types'), and as long as that's the case, some parents are going to object. \n \n As one of the grandparents said ...\n \n \"When does Evesham Township or any school have a right to show to my grandchildren something I believe to be morally wrong?\"\n \n Of course, individual schools should have latitude in this. But it's only natural that they aren't going to include something that so many people feel is morally wrong. While it wouldn't bother me to see gay families in the video, I can certainly understand the school's position.\n\n \n Of course the flip side is ture also. What right does the school have to show the children of gay couples heterosexual couples when there are gay parents out there that find heterosexuality, and the dipiction of heterosexuality to be morally offensive.", 
   {}, 
   282083, 
   null, 
   1188934740.0
  ], 
  [
   282198, 
   null, 
   "jyoshu", 
   "OK ideas:\n The ones that make sense.\n The ones that don't harm children when they are taught.\n The one that aren't SOLELY based on backward rules of some backward religion.\n\n \n Gee, nothing open to varying opinions, there! ;) Unless you want a Natl. Morality Committee of some sort forcing schools to fall in line on the moralistic issues being taught (a rather bad idea, IMO), schools will have to continue having some autonomy in this area. This is exactly why a lot of people (me included) prefer to have all religious and moralistic issues (yes, homosexuality included) off-limits to being taught about in schools. And like it or not, what society views as immoral will have to determine what is considered immoral in the classroom. As society changes, that may change too, of course.", 
   {}, 
   282192, 
   null, 
   1188934740.0
  ], 
  [
   282208, 
   null, 
   "jitobear", 
   "Gee, nothing open to varying opinions, there! ;) Unless you want a Natl. Morality Committee of some sort forcing schools to fall in line on the moralistic issues being taught (a rather bad idea, IMO), schools will have to continue having some autonomy in this area. This is exactly why a lot of people (me included) prefer to have all religious and moralistic issues (yes, homosexuality included) off-limits to being taught about in schools. And like it or not, what society views as immoral will have to determine what is considered immoral in the classroom. As society changes, that may change too, of course.\n\n \n Can I kick up a fuss over the depiction of Christian families? How about blonde ones? German ones? How about single moms? Why in the holy hell should Christian white-bred bigots get to say whether my family is OK to be known about? \n \n Gay people are here - they have families - end of story. If that is immoral to you that is your problem and your problem alone. Move to your own me, myself and myland if you can't deal with sharing this country with people, religions and families that don't reflect what you see in the damned mirror.\n \n Jesus Jyoshu the way you pat bigotry on the head. I want you to tell me now how you would tell my son about why his family can't be represented, mentioned, talked about, or known about. Tell me how you would look him in the eye and justify it.", 
   {}, 
   282198, 
   null, 
   1188937920.0
  ], 
  [
   282210, 
   null, 
   "thelmoose", 
   "Gee, nothing open to varying opinions, there! ;) Unless you want a Natl. Morality Committee of some sort forcing schools to fall in line on the moralistic issues being taught (a rather bad idea, IMO), schools will have to continue having some autonomy in this area. This is exactly why a lot of people (me included) prefer to have all religious and moralistic issues (yes, homosexuality included) off-limits to being taught about in schools. And like it or not, what society views as immoral will have to determine what is considered immoral in the classroom. As society changes, that may change too, of course.\n\n \n None of those things I mentioned are moralizing or opinions. They are arguable facts.\n \n I can't tell which position you are taking, whether we should or should not be imparting moral values to students. \n \n YOU asked the question: \nSo how do you suggest schools determine what issues are going to be off-limits due to moralistic concerns, and what ones aren't?\n\n I assumed you thought that such a determination was a good idea.\n \n Then above, you suggest Morality Police is a bad idea, then we should be imposing \"society's\" moral views. \n \n I am just saying there is no rational reason to conclude that homosexuality is immoral. And it is harmful (to gay kids and parents) to claim otherwise. Conversely, taking the position that homosexuality is not immoral harms no one. \n \n Except the unreasonable sensibilities of you pinched-faced, tight-assed puritanical anachronistic Church-Lady types.", 
   {}, 
   282198, 
   null, 
   1188938400.0
  ], 
  [
   282211, 
   null, 
   "snakespit", 
   "Well, that's a statement that begs the question, of course. The parents would say they aren't teaching ignorance, discrimination, and bigotry. Rather they simply don't want something taught in the school that they consider immoral.\n\n \n Well, consider the fact that myself and probably many others find it immoral to cast away a segment of the population based on their sexual orientation. Nobody is saying that schools should be put in the position to teach whether or not homosexuality is right or wrong. But in my book, sheltering children from reality and pretending that gays don't exist is immoral.", 
   {}, 
   282188, 
   null, 
   1188940680.0
  ], 
  [
   282218, 
   null, 
   "jyoshu", 
   "I can't tell which position you are taking, whether we should or should not be imparting moral values to students. \n\n \n We should not. My position is that if an issue is viewed by a large number of people in society as a moralistic one, then it should be avoided. But that would include things like opposing homosexuality too, or, say, prayer in schools and so forth. I think moral-type issues should be left at home, no matter what they are. \n \n \nThen above, you suggest Morality Police is a bad idea, then we should be imposing \"society's\" moral views.\n\n \n Actually my position is that moral views should be avoided altogether. The thing is though, society determines what is and isn't a moral issue. That tends to happen by default, and there is not a better way to do it that I know of, unless we are going to put a few peoples' views about what's moral over everyone else's, and I just don't see doing that.\n \n \nI am just saying there is no rational reason to conclude that homosexuality is immoral.\n\n \n that may be (or not), but either way it's a moralistic issue in many peoples' thinking, and so IMO it should be an issue left to parents to teach, and not schools. To me, this isn't about whether homosexuality is immoral or not. It's about whether schools should spend time teaching issues that large amounts of society view as moralistic.", 
   {}, 
   282210, 
   null, 
   1188946800.0
  ], 
  [
   282221, 
   null, 
   "thelmoose", 
   "We should not. My position is that if an issue is viewed by a large number of people in society as a moralistic one, then it should be avoided. But that would include things like opposing homosexuality too, or, say, prayer in schools and so forth. I think moral-type issues should be left at home, no matter what they are. \n \n \n \n Actually my position is that moral views should be avoided altogether. The thing is though, society determines what is and isn't a moral issue. That tends to happen by default, and there is not a better way to do it that I know of, unless we are going to put a few peoples' views about what's moral over everyone else's, and I just don't see doing that.\n \n \n \n that may be (or not), but either way it's a moralistic issue in many peoples' thinking, and so IMO it should be an issue left to parents to teach, and not schools. To me, this isn't about whether homosexuality is immoral or not. It's about whether schools should spend time teaching issues that large amounts of society view as moralistic.\n\n \n You are missing the point.\n And you continue to vacillate on whether we should impart moral ideas to the kids, despite your claims.\n \n One, discussing the mere existence of homosexual persons and families is not imparting a moral point of view. It is a statement of the reality of our lives today.\n Two, the avoidance of the discussion of the mere existence of homosexual persons and families is indeed imparting a moral point of view. If you wish to be consistent with your stated position, you should be opposed to any restrictions such described in the opening post.", 
   {}, 
   282218, 
   null, 
   1188947340.0
  ], 
  [
   282247, 
   null, 
   "samiinh", 
   "These people need to get a grip and accept the reality that is the world. But so many of them live with superstitions and fantasy beliefs it is not hard to see why they don't. Pure ignorance.", 
   {}, 
   282221, 
   null, 
   1188953760.0
  ], 
  [
   282252, 
   null, 
   "jyoshu", 
   "One, discussing the mere existence of homosexual persons and families is not imparting a moral point of view. It is a statement of the reality of our lives today.\n\n \n That's YOUR opinion. In the opinion of many out there, it IS imparting a moral view. And because many view it as a moral view, then schools are naturally going to approach it that way. \n \n \nTwo, the avoidance of the discussion of the mere existence of homosexual persons and families is indeed imparting a moral point of view.\n\n \n This has got to be one of the more ridiculous arguments I've seen. You're essentially arguing that the absence of a discussion is a moral statement, apparently more a moral statement than the discussion itself. Since there is far more things that aren't taught about in schools than ARE taught about just by the sheer number of possibilities out there, your logic means that anything not taught about in schools is imparting a moral view as a result. That's ludicrous.", 
   {}, 
   282221, 
   null, 
   1188954420.0
  ], 
  [
   282258, 
   null, 
   "thelmoose", 
   "That's YOUR opinion. In the opinion of many out there, it IS imparting a moral view. And because many view it as a moral view, then schools are naturally going to approach it that way. \n\n \n That gay students and families exist is not an opinion. It is a fact. Are you suggesting that conceding the very existence of gay students and families is a moral position? In other words, denial of a fact is the moral high ground. \n \n \nThis has got to be one of the more ridiculous arguments I've seen. You're essentially arguing that the absence of a discussion is a moral statement, apparently more a moral statement than the discussion itself. Since there is far more things that aren't taught about in schools than ARE taught about just by the sheer number of possibilities out there, your logic means that anything not taught about in schools is imparting a moral view as a result. That's ludicrous.\n\n \n Nice try. Not the absence, the censoring of discussion. You advocated suppression of certain information due to moral concerns, not me. If it is a ridiculous assertion, it was yours.", 
   {}, 
   282252, 
   null, 
   1188956340.0
  ], 
  [
   282261, 
   null, 
   "jyoshu", 
   "That gay students and families exist is not an opinion. \n\n \n It is not the existence of the gay people that moralizing families question. Their opposition to them being in the video is not based on that. Their view is that it shouldn't be considered a 'family' in the acceptable sense of the term. Not that they exist. Surely you know this. Now, you and I don't agree with that, but the question here is whether or not the school should teach about issues that moralistic ones in peoples' minds, such as this one. IMO, they shouldn't. There is a broader issue here.\n \n \nNice try. Not the absence, the censoring of discussion. You advocated suppression of certain information due to moral concerns, not me. If it is a ridiculous assertion, it was yours.\n\n \n So you think censoring over the issue being a moralistic one is ridicuous, eh? So you'd have no problem with schools teaching that people should go to church? Or that male kids can have more than one wife at a time when they grow up? Those too are moralistic-based issues to many people.", 
   {}, 
   282258, 
   null, 
   1188957060.0
  ], 
  [
   282269, 
   null, 
   "samiinh", 
   "Maybe they should just home teach their children so they can control what they see and hear, or send them to a church school. There will be children in the public school whose families may have gay parents. They are real people.", 
   {}, 
   282261, 
   null, 
   1188959280.0
  ], 
  [
   282277, 
   null, 
   "thelmoose", 
   "It is not the existence of the gay people that moralizing families question. Their opposition to them being in the video is not based on that. Their view is that it shouldn't be considered a 'family' in the acceptable sense of the term. Not that they exist. Surely you know this. Now, you and I don't agree with that, but the question here is whether or not the school should teach about issues that moralistic ones in peoples' minds, such as this one. IMO, they shouldn't. There is a broader issue here.\n\n \n My family is not a family in the \"acceptable\" sense of the word to you??\n Families with gay parents and siblings exist. It is not a moral statement to say they exist and are a family. It's insulting for you to say that. \n \n \nSo you think censoring over the issue being a moralistic one is ridicuous, eh? So you'd have no problem with schools teaching that people should go to church? Or that male kids can have more than one wife at a time when they grow up? Those too are moralistic-based issues to many people. \n\n \n This obtuse act of yours is childish and tedious. \n \n The act of censoring itself is the moralistic behavior, not the topic. Deciding not to mention a fact because tight asses like you think they are so base that they shouldn't be mentioned in polite company is the moralistic behavior. Encouraging a certain behavior is different and you know it. \n \n \n Teaching that someone SHOULD to go to church is not a fact based comment. \n Teaching that gay families exist is. \n Teaching that a man SHOULD have more than one wife is not a fact. \n That polygamous families exist is a fact. That might be something that would be appropriate to mention in Utah.", 
   {}, 
   282261, 
   null, 
   1188963780.0
  ], 
  [
   282307, 
   null, 
   "lesz", 
   "It is not the existence of the gay people that moralizing families question. Their opposition to them being in the video is not based on that. Their view is that it shouldn't be considered a 'family' in the acceptable sense of the term. Not that they exist. Surely you know this. Now, you and I don't agree with that, but the question here is whether or not the school should teach about issues that moralistic ones in peoples' minds, such as this one. IMO, they shouldn't. There is a broader issue here.\n\n \n So basically, what you are advocating here is that public schools should teach no moral values whatever. They shouldn't teach tolerance, because that offends the intolerant; they shouldn't teach racial equality, because that offends racists; they shouldn't teach religious freedom, because that offends religious bigots.\n \n Maybe they shouldn't teach the immorality of theft and murder because that offends thieves and murderers. \n \n I am truly surprised to hear a right-winger such as your good self advocating that public schools should promote a moral vacuum. But then, I suppose anything is better than teaching acceptance of gay families as just another sort of family among the many that exist today.", 
   {}, 
   282261, 
   null, 
   1189000440.0
  ], 
  [
   282309, 
   null, 
   "jyoshu", 
   "My family is not a family in the \"acceptable\" sense of the word to you??\n\n \n Of course it is. I said, quite clearly, that you and I both know it's true. Again, this is not about whether gay families are families of whether homosexuality is immoral. It's about whether schools should be able to pull material that lots of people (not necessarily you and I) feel is immoral.\n \n \nFamilies with gay parents and siblings exist. It is not a moral statement to say they exist and are a family. It's insulting for you to say that. \n\n \n Existing and whether they are legitimate families are not the same issue. Insulting or not, that's a common view out there. There's no sense sticking your head in the sand over it. Take it up with those who feel that way if that's the battle you want to wage. \n \n \nThe act of censoring itself is the moralistic behavior, not the topic. Deciding not to mention a fact because tight asses like you think they are so base that they shouldn't be mentioned in polite company is the moralistic behavior. Encouraging a certain behavior is different and you know it. \n\n \n Again, you miss the point. It's not the fact they exist, or even that they make up a family (in the sense of a group of people together) that is at issue. It's that to these parents, it moralistically isn't right to call that a family in the correct sense of the term. Again, you and I don't agree and we know better, but that's where they're coming from. You keep talking about this as if the problem is over the factual matters--it isn't. It's over how those facts are approached.\n \n \nThat polygamous families exist is a fact. That might be something that would be appropriate to mention in Utah.\n\n \n Ah, now we're getting somewhere in this discussion! So you would be perfectly fine with just mentioning such arrangements exist (when it comes to gays), with no value judgement of whether it's right or wrong? That's the way you'd approach polygamy families in Utah--right alongside other forms of families? And it's the way you'd approach gay ones, with no attempts to instill values that it's correct? You'd seriously leave it completely at a neutral point?", 
   {}, 
   282277, 
   null, 
   1189002960.0
  ], 
  [
   282310, 
   null, 
   "jyoshu", 
   "So basically, what you are advocating here is that public schools should teach no moral values whatever.\n\n \n Yeah! Give that man a gold star!!! emoticon_xagree \n \n And the reasoning behind it isn't that it might \"offend\" people. It's just that moral issues aren't the place for a govt. institution.\n \n \nMaybe they shouldn't teach the immorality of theft and murder because that offends thieves and murderers.\n\n \n Absolutely not. They should actually have the audacity to focus on reading, math, science, etc. Imagine that!! (GASP!)\n \n \nI am truly surprised to hear a right-winger such as your good self advocating that public schools should promote a moral vacuum.\n\n \n That's because I'm not a \"right-winger\". I'm a conservative--a true conservative (in the vein of Goldwater) hates intrusive govt. intervention, such as a govt. entity raising my kids and instilling their values. That's MY job. Not yours. Just give them the education about fact-based issues, and keep your moral values to yourself whether they are religious OR cultural \"tolerance\" hypocritical garbage.", 
   {}, 
   282307, 
   null, 
   1189003320.0
  ], 
  [
   282316, 
   null, 
   "Matthew S", 
   "Yeah! Give that man a gold star!!! emoticon_xagree \n \n And the reasoning behind it isn't that it might \"offend\" people. It's just that moral issues aren't the place for a govt. institution.\n \n \n \n Absolutely not. They should actually have the audacity to focus on reading, math, science, etc. Imagine that!! (GASP!)\n \n \n \n That's because I'm not a \"right-winger\". I'm a conservative--a true conservative (in the vein of Goldwater) hates intrusive govt. intervention, such as a govt. entity raising my kids and instilling their values. That's MY job. Not yours. Just give them the education about fact-based issues, and keep your moral values to yourself whether they are religious OR cultural \"tolerance\" hypocritical garbage.\n\n \n \n Isn't it ironic that you hate government intervention into your life but wish government intrvention into my life by the government telling me who I can and can not marry.", 
   {}, 
   282310, 
   null, 
   1189004700.0
  ], 
  [
   282317, 
   null, 
   "jyoshu", 
   "Isn't it ironic that you hate government intervention into your life but wish government intrvention into my life by the government telling me who I can and can not marry.\n\n \n You can marry anyone you want, Matthew. I'm not telling you that you can't do that. You just don't get to come along and change the institution of marriage when the rest of society has a say in that too. I'm all for civil unions that would given you the same benefits.\n \n If the will of the people were behind your movement, this would be a whole different story. But I don't like the idea of a small group subverting the will of the people in a govt. that's supposed to be by the people and for the people. The will of the people is the key to American freedom. It even trumps the constitution, because the will of the people can CHANGE the constitution if it so chooses.", 
   {}, 
   282316, 
   null, 
   1189005120.0
  ], 
  [
   282328, 
   null, 
   "lesz", 
   "You can marry anyone you want, Matthew.\n\n \n Except the person you want to marry. That's the exclusive province of heterosexuals! Eat your heart out, Matthew, as a homo, they will never admit you are equal to them.", 
   {}, 
   282317, 
   null, 
   1189006920.0
  ], 
  [
   282350, 
   null, 
   "davenport15", 
   "\n I'm all for civil unions that would given you the same benefits.\n \n\n \n Good to hear this. So, what are you doing to fight for civil unions?", 
   {}, 
   282317, 
   null, 
   1189009200.0
  ], 
  [
   282359, 
   null, 
   "jyoshu", 
   "Good to hear this. So, what are you doing to fight for civil unions?\n\n \n I'm not \"fighting\" for them. But I'm not opposed to them, and agree with you on them (assuming you think they are a good thing). I've no interest right now in standing on a street corner and holding a picket sign for anyone's cause.", 
   {}, 
   282350, 
   null, 
   1189011120.0
  ], 
  [
   282365, 
   null, 
   "Matthew S", 
   "You can marry anyone you want, Matthew. I'm not telling you that you can't do that. You just don't get to come along and change the institution of marriage when the rest of society has a say in that too. I'm all for civil unions that would given you the same benefits.\n \n If the will of the people were behind your movement, this would be a whole different story. But I don't like the idea of a small group subverting the will of the people in a govt. that's supposed to be by the people and for the people. The will of the people is the key to American freedom. It even trumps the constitution, because the will of the people can CHANGE the constitution if it so chooses.\n\n \n So I am not considered part of the american people? Should not the government be responsive to my needs? Gay people are american citizens. If you use the language you have you are telling the world that you do not believe us to be citizens.\n \n When heteros settle for civil unions so will I.", 
   {}, 
   282317, 
   null, 
   1189012560.0
  ], 
  [
   282375, 
   null, 
   "samiinh", 
   "So I am not considered part of the american people? Should not the government be responsive to my needs? Gay people are american citizens. If you use the language you have you are telling the world that you do not believe us to be citizens.\n \n When heteros settle for civil unions so will I.\n\n \n Excellent, Matt.", 
   {}, 
   282365, 
   null, 
   1189017540.0
  ], 
  [
   282376, 
   null, 
   "jitobear", 
   "Existing and whether they are legitimate families are not the same issue. Insulting or not, that's a common view out there.\n\n \n A very common view, held by a sack of low-life, brainless vermin. Honestly, I don't give a rats XXX whether they consider my family legitimate or not. It is not their decision. We are law-abiding American citizens and under absolutely no circumstances should we be expected to take a back-seat like that. No child should have to walk into his school and be told in by words or more subtedly by actions like this school is taking that he doesn't have a legitimate family. If these folks don't want to deal with the reality of gay families - then they need to back their sorry asses out of secular, American society. It is not up to rightful citizens to cow-tow to their exclusive, hateful \"moralistic\" view points. They are, frankly, not my damned problem. And anyone who tells me my family isn't valid is going to get a solid kick to the teeth.", 
   {}, 
   282309, 
   null, 
   1189017600.0
  ], 
  [
   282380, 
   null, 
   "jyoshu", 
   "So I am not considered part of the american people? Should not the government be responsive to my needs? Gay people are american citizens. If you use the language you have you are telling the world that you do not believe us to be citizens.\n\n \n Don't be ridiculous. No one is saying you aren't citizens. But being a citizen doesn't mean you get to change institutions that the rest of society has a say in as well.", 
   {}, 
   282365, 
   null, 
   1189018320.0
  ], 
  [
   282384, 
   null, 
   "davenport15", 
   "Don't be ridiculous. No one is saying you aren't citizens. But being a citizen doesn't mean you get to change institutions that the rest of society has a say in as well.\n\n \n We are not changing institutions. Families take various forms. Look around you and start examining the myth of the 'nucular family' is the only reality. \n \n What if I watched the video and was opposed to the interracial marriages depicted? Would that be a supportable position? Why do you support bigotted behavior?", 
   {}, 
   282380, 
   null, 
   1189019400.0
  ], 
  [
   282385, 
   null, 
   "Matthew S", 
   "Don't be ridiculous. No one is saying you aren't citizens. But being a citizen doesn't mean you get to change institutions that the rest of society has a say in as well.\n\n \n Yes you are\n \n \n\n \n If the will of the people were behind your movement, this would be a whole different story. But I don't like the idea of a small group subverting the will of the people in a govt. that's supposed to be by the people and for the people. The will of the people is the key to American freedom.  It even trumps the constitution, because the will of the people can CHANGE the constitution if it so chooses.\n\n \n \n By saying and believing this you are saying, to me, that I am not one of the american people. You are impling that gay people have no right to be considered citizens. \n \n Because if you considered me an american citizen then you would support my will as one of the american people. My will as part of the people is to marry the one I love same as any hetero. If you disagree with my will then you do not consider me to be part of the american people.\n \n \n If it is supposed to be by the people and for the people then I am not part of the people if the government of the people works against me.", 
   {}, 
   282380, 
   null, 
   1189019460.0
  ], 
  [
   282387, 
   null, 
   "jyoshu", 
   "By saying and believing this you are saying, to me, that I am not one of the american people. You are impling that gay people have no right to be considered citizens. \n\n \n That's like a 25 year old saying they are being told they are not one of the American people because they can't get social security benefits. Being an American citizen doesn't automatically entitle you to anything and everything.", 
   {}, 
   282385, 
   null, 
   1189019640.0
  ], 
  [
   282388, 
   null, 
   "Matthew S", 
   "That's like a 25 year old saying they are being told they are not one of the American people because they can't get social security benefits. Being an American citizen doesn't automatically entitle you to anything and everything.\n\n \n But telling him he will never get them?\n \n You say that the government is by the people for the people. If the government attacks the freedom of the people, is hostle, or openly attacks the people isn't it time for the government to be changed?\n \n My freedoms, something you take for granted, are under attack by the government.\n \n Yet it is my freedoms that are put on the ballot and the excuse is that the people need to vote. This tells me that I am not one of the people since it is my freedom that is on the ballot.", 
   {}, 
   282387, 
   null, 
   1189019940.0
  ], 
  [
   282392, 
   null, 
   "jyoshu", 
   "But telling him he will never get them?\n\n \n There is no guarantee any person will get social security benefits by relying on age; anyone could die before they reach the age to get it.\n \n \nYou say that the government is by the people for the people. If the government attacks the freedom of the people, is hostle, or openly attacks the people isn't it time for the government to be changed?\n\n \n There are many, many freedoms you and I both don't have. Being an American citizen doesn't guarantee you every freedom imaginable. Do you understand what I'm saying? That's why it really doesn't address anything by saying you are effectively being told you aren't an American citizen. No, that's not what you're being told at all.\n \n \nYet it is my freedoms that are put on the ballot and the excuse is that the people need to vote. This tells me that I am not one of the people since it is my freedom that is on the ballot.\n\n \n The problem is that you're begging the question and starting with an unproven premise that you already have the freedom to gay marriage to begin with. There's very little in law to back that up. Certainly nothing on the SCOTUS level. That's why the proper strategy would be to get gay marriage granted BY LAW--via legislature--rather than reinterpreting laws that are, at best, iffy, or taking an anything-goes approach to the 14th amendment. There is one state where you have freedom to call your union a gay \"marriage\", getting benefits as a result, and that is Massachusetts. But not all states are going to adopt that as a freedom.", 
   {}, 
   282388, 
   null, 
   1189021260.0
  ], 
  [
   282399, 
   null, 
   "Matthew S", 
   "There is no guarantee any person will get social security benefits by relying on age; anyone could die before they reach the age to get it.\n \n \n \n There are many, many freedoms you and I both don't have. Being an American citizen doesn't guarantee you every freedom imaginable. Do you understand what I'm saying? That's why it really doesn't address anything by saying you are effectively being told you aren't an American citizen. No, that's not what you're being told at all.\n \n \n \n The problem is that you're begging the question and starting with an unproven premise that you already have the freedom to gay marriage to begin with. There's very little in law to back that up. Certainly nothing on the SCOTUS level. That's why the proper strategy would be to get gay marriage granted BY LAW--via legislature--rather than reinterpreting laws that are, at best, iffy, or taking an anything-goes approach to the 14th amendment. There is one state where you have freedom to call your union a gay \"marriage\", getting benefits as a result, and that is Massachusetts. But not all states are going to adopt that as a freedom.\n\n \n \n \n All I see is you and the rest of the class telling me I can't have cookies because of who I am. Telling me that they believe God told them I can't have a cookie. Or telling me that I can have a cookie but it is the one that has been under the teachers desk for several years and mice have been chewing on it.\n \n Either everyone gets to have a cookie or no one gets cookies.", 
   {}, 
   282392, 
   null, 
   1189027680.0
  ], 
  [
   282407, 
   null, 
   "samiinh", 
   "There is no guarantee any person will get social security benefits by relying on age; anyone could die before they reach the age to get it.\n \n \n \n There are many, many freedoms you and I both don't have. Being an American citizen doesn't guarantee you every freedom imaginable. Do you understand what I'm saying? That's why it really doesn't address anything by saying you are effectively being told you aren't an American citizen. No, that's not what you're being told at all.\n \n \n \n The problem is that you're begging the question and starting with an unproven premise that you already have the freedom to gay marriage to begin with. There's very little in law to back that up. Certainly nothing on the SCOTUS level. That's why the proper strategy would be to get gay marriage granted BY LAW--via legislature--rather than reinterpreting laws that are, at best, iffy, or taking an anything-goes approach to the 14th amendment. There is one state where you have freedom to call your union a gay \"marriage\", getting benefits as a result, and that is Massachusetts. But not all states are going to adopt that as a freedom.\n\n \n I believe the SCOTUS said in Lovey VS VA that marriage was a human right.", 
   {}, 
   282392, 
   null, 
   1189031340.0
  ], 
  [
   282410, 
   null, 
   "jyoshu", 
   "I believe the SCOTUS said in Lovey VS VA that marriage was a human right.\n\n \n That's Loving vs. Va. And the ruling was over a situation of marriage between a man and a woman. It didn't deal with gay marriage, only that interracial marriage was allowed under marriage as the state understood it. (between a man and a woman of course.)", 
   {}, 
   282407, 
   null, 
   1189032060.0
  ], 
  [
   282417, 
   null, 
   "samiinh", 
   "That's Loving vs. Va. And the ruling was over a situation of marriage between a man and a woman. It didn't deal with gay marriage, only that interracial marriage was allowed under marriage as the state understood it. (between a man and a woman of course.)\n\n \n The ruling said that marriage was a human right. It didn't say marriage was a human right only for heterosexuals.", 
   {}, 
   282410, 
   null, 
   1189033800.0
  ], 
  [
   282477, 
   null, 
   "lesz", 
   "That's Loving vs. Va. And the ruling was over a situation of marriage between a man and a woman. It didn't deal with gay marriage, only that interracial marriage was allowed under marriage as the state understood it. (between a man and a woman of course.)\n\n \n Not much difference between a gay marriage and an interracial one. It's a marriage between two people various bigots deemed incapable of contracting one.", 
   {}, 
   282410, 
   null, 
   1189079640.0
  ], 
  [
   282486, 
   null, 
   "davenport15", 
   "That's Loving vs. Va. And the ruling was over a situation of marriage between a man and a woman. It didn't deal with gay marriage, only that interracial marriage was allowed under marriage as the state understood it. (between a man and a woman of course.)\n\n \n And yet - even before the state \"permitted\" this marriage - the couple was, indeed, married. The fact remains that my husband and I are claiming the word \"married\" just as hundreds of thousands of other couples are claiming the word \"marriage.\" And this is how we will change it all. \n \n My husband and I are married, we are each other's next-of-kin, and the Federal Government is now denying us rights that our state (Connecticut) has said are rightfully ours.\n \n The word is already changing. The institution has accepted us and it's a perfect fit.\n \n You know what makes this so great, Jyoshu? You can't stop progress! Whether it's the courts or the polls, the movement has begun.", 
   {}, 
   282410, 
   null, 
   1189086600.0
  ], 
  [
   282496, 
   null, 
   "MrWriteLA", 
   "The word is already changing. \nIndeed. Check out the definition in the various on-line dictionaries. Many of them define it to include same-sex commitments. To mix metaphors, that train has left the station, and there's no putting the genie back in the bottle.", 
   {}, 
   282486, 
   null, 
   1189094760.0
  ], 
  [
   282521, 
   null, 
   "samiinh", 
   "You are more than welcome to use the term marriage to describe whatever is between you and your partner. I don't care what you call it. You already have the right to call your relationship whatever you want. What you don't have the right to do is redefine the institution at the govt. level, which is what you really want to do. \n \n All \"marriage\" is, as far as the state is concerned is criteria for benefits. There's nothing magical about it--I don't get why it's supposedly so much more 'romantic' to have state-sanctioned marriage as opposed to what you claim to have already. I hear about these gay couples who, upon getting their marriage license (even though they've been united in what they call marriage for a long time), act as though it's the greatest day of their lives. Well, if getting piece of paper from the govt. is the greatest thing ever, some peoples' lives must be pretty damn mundane. And if they waited to get married UNTIL the piece of paper was available, then they must not have wanted to tie the knot too bad to begin with. If you want to get married, no one says you have to wait on the state to sanction it. There's nothing magical about that--if your relationships depends on getting those benefits, it ain't much of a relationship to begin with, to be frank. \n \n \n \n Ah, you not only want to change the institution of marriage for all of society, but you want to do it as defiantly as you can too! Well, hate to tell you this, but you're not going to get much sadistic glee from it over me, even if it does eventually happen. Because if society decides it wants it (rather than just a few who's doing it despite society), I'm much more inclined to be fine with it. My beef is with means here, and as long as the will of the people is not subverted, if that's what they decide, so be it. Geez, it ain't THAT big a deal to me.\n\n \n \n Gay marriage isn't a redefinition of the word; it is an expansion of the word to be more inclusive.", 
   {}, 
   282486, 
   null, 
   1189108920.0
  ], 
  [
   282524, 
   null, 
   "JakeCJB", 
   "You are more than welcome to use the term marriage to describe whatever is between you and your partner. I don't care what you call it. You already have the right to call your relationship whatever you want. What you don't have the right to do is redefine the institution at the govt. level, which is what you really want to do.\n\n \n It's a civil institution, and yes if can and is redefined. \n \n \nAll \"marriage\" is, as far as the state is concerned is criteria for benefits. There's nothing magical about it--I don't get why it's supposedly so much more 'romantic' to have state-sanctioned marriage as opposed to what you claim to have already. I hear about these gay couples who, upon getting their marriage license (even though they've been united in what they call marriage for a long time), act as though it's the greatest day of their lives. Well, if getting piece of paper from the govt. is the greatest thing ever, some peoples' lives must be pretty damn mundane. And if they waited to get married UNTIL the piece of paper was available, then they must not have wanted to tie the knot too bad to begin with. If you want to get married, no one says you have to wait on the state to sanction it. There's nothing magical about that--if your relationships depends on getting those benefits, it ain't much of a relationship to begin with, to be frank.\n\n \n Wow, if that's how you really feel about marriage, why do you care who gets it? Your marriage is pretty mundane if it's important to have this mere piece of paper exclude gay couples. It's more than just a piece of paper of course, and straight people do refer to their state and socially sanctioned marriages as the greatest day of their lives, so there is no reason it should be any different for gay people.\n \n You can't imagine what it is like to be a gay person and finally acheive equality and justice in society, when straight people have always taken all these things for granted. Don't presume to tell gay people how it is we should feel, unless you are from this experience.\n \n Marriage isn't only about benefits, it is also about intangibles such as social support and recognition.\n \n \nAh, you not only want to change the institution of marriage for all of society, but you want to do it as defiantly as you can too!\n\n \n Ah yes, there go the uppity gays, wanting equal and just treatment in society, all the things the heterosexuals expect! Imagine.\n \n \nWell, hate to tell you this, but you're not going to get much sadistic glee from it over me, even if it does eventually happen. Because if society decides it wants it (rather than just a few who's doing it despite society), I'm much more inclined to be fine with it. My beef is with means here, and as long as the will of the people is not subverted, if that's what they decide, so be it. Geez, it ain't THAT big a deal to me.\n\n \n How would you determine that? Is it a poll of 50% plus one? The will that is holding back gay equality is prejudice. Sometimes the prejudice is open, sometimes it is hidden behind smoke and mirrors. It's waning, and with it opposition to gay marriage is decreasing.", 
   {}, 
   282486, 
   null, 
   1189109700.0
  ], 
  [
   282529, 
   null, 
   "jyoshu", 
   "Wow, if that's how you really feel about marriage, why do you care who gets it? Your marriage is pretty mundane if it's important to have this mere piece of paper exclude gay couples.\n \n \n \n I'd hate to think I held state-sanctioning is higher esteem that simply committing in marriage to a partner. Regardless, it's not that it's important or not to me; I just don't see why something should be applied to something to which it doesn't fit by society's definition. Honestly, I'm pretty surprised gays would even want to legally piggyback off an institution that applies to something else. It's like a young person wanting to get in on social security benefits--by society's standards, it's given for a different sort of situation. In the case of marriage, that situation is opposite-sex couples, because that's the way marriage is generally understood and mostly always has.\n \n \nIt's more than just a piece of paper of course, and straight people do refer to their state and socially sanctioned marriages as the greatest day of their lives, so there is no reason it should be any different for gay people.\n\n \n You may think the greatest day of life is when the state gives a certificate; but not me. I'd be married with or without the state.\n \n \nMarriage isn't only about benefits, it is also about intangibles such as social support and recognition.\n\n \n Then you terribly misunderstand the situation. And this only confirms my suspicion that some gay marriage proponents here think there's something magical about a having a marriage licensed. Getting a license from the state is NOT an automatic ticket to support and recognition from society. There are marriages that are state sanctioned that society deems ludicrous, and there are cases of marriage that society deems respectable that aren't state sanctioned. The two are NOT one and the same. \n \n \nHow would you determine that? Is it a poll of 50% plus one? The will that is holding back gay equality is prejudice. Sometimes the prejudice is open, sometimes it is hidden behind smoke and mirrors. It's waning, and with it opposition to gay marriage is decreasing.\n\n \n Prejudice or whatever else, it's still will of the people. I know you'd prefer the people not matter in our country, but alas, they do.", 
   {}, 
   282524, 
   null, 
   1189112040.0
  ], 
  [
   282542, 
   null, 
   "Kronus", 
   "Prejudice or whatever else, it's still will of the people. I know you'd prefer the people not matter in our country, but alas, they do.\n\n \n Where did you get that utterly bizarre notion? The law of the land is not public opinion polls, it's the constitution. It's in place to prevent the will of the mob of imposing their prejudices on others, from preventing the many from dictating to the few. That's one of the things that makes this a great country. The opinion of the mob can be swayed by clever words or snappy slogans, that's why it doesn't hold trump. Prejudice is wrong, it always is no matter how many people support it. The fact that you support popular prejudice over both constitutional imperatives and moral decency is very disturbing. I'd thought you'd learned better in recent times.", 
   {}, 
   282529, 
   null, 
   1189115160.0
  ], 
  [
   282545, 
   null, 
   "davenport15", 
   "\n All \"marriage\" is, as far as the state is concerned is criteria for benefits. There's nothing magical about it--I don't get why it's supposedly so much more 'romantic' to have state-sanctioned marriage as opposed to what you claim to have already. I hear about these gay couples who, upon getting their marriage license (even though they've been united in what they call marriage for a long time), act as though it's the greatest day of their lives. Well, if getting piece of paper from the govt. is the greatest thing ever, some peoples' lives must be pretty damn mundane. And if they waited to get married UNTIL the piece of paper was available, then they must not have wanted to tie the knot too bad to begin with. If you want to get married, no one says you have to wait on the state to sanction it. There's nothing magical about that--if your relationships depends on getting those benefits, it ain't much of a relationship to begin with, to be frank. \n\n \n So much hypocrisy in that paragraph, I'm surprised your computer didn't blow up. I don't know how to address it all - but let's just suggest that we take away all your pieces of paper and let you and your family struggle through the obstacles that are created when it's missing, okay? \n \n My marriage to my husband was one of the greatest events in my life. The fact that MY government recognizes it, to the best of the state's ability, I think that's something. Sorry you don't see that. But, frankly, don't really care.\n \n \n \nAh, you not only want to change the institution of marriage for all of society, but you want to do it as defiantly as you can too! Well, hate to tell you this, but you're not going to get much sadistic glee from it over me, even if it does eventually happen. Because if society decides it wants it (rather than just a few who's doing it despite society), I'm much more inclined to be fine with it. My beef is with means here, and as long as the will of the people is not subverted, if that's what they decide, so be it. Geez, it ain't THAT big a deal to me.\n\n \n Odd, as a taxpayer, as a member of OUR SOCIETY, my marriage has already changed the institution for all of society. Sorry you're so attached to your prejudicial views that you can't see that. \n \n The will of the people is the constitution. And the constitution guarantees my rights. I'm happy we have judges who recognize their commitment to that little document, while our current administration continues to shred it!", 
   {}, 
   282486, 
   null, 
   1189116540.0
  ], 
  [
   282546, 
   null, 
   "jyoshu", 
   "Where did you get that utterly bizarre notion? The law of the land is not public opinion polls, it's the constitution.\n\n \n Did I say \"public opinion polls\"? No, I didn't.\n \n The constitution doesn't exist despite the people; it exists by the people. If gays want gay marriage, they should do what other civil rights groups have done in the past and try to get it amended so that it will be allowed. After all, it's only precedent. :) \n \n \nPrejudice is wrong, it always is no matter how many people support it. The fact that you support popular prejudice over both constitutional imperatives and moral decency is very disturbing. I'd thought you'd learned better in recent times.\n\n \n The term \"Prejudice\" is one of those terms that, in many cases, means different things to different people. It's the stuff of rhetorical speeches intending to appeal to the masses, without having to be specific. There's really not a lot you can really do if your opinion is that the will of the people is that of prejudice. You can however, attempt to change public opinion and win people over to your cause, and convince them that YOUR definition of prejudice is the right one. And that would be the appropriate means, rather than working despite the will of the people.", 
   {}, 
   282542, 
   null, 
   1189116660.0
  ], 
  [
   282547, 
   null, 
   "jyoshu", 
   "My marriage to my husband was one of the greatest events in my life. The fact that MY government recognizes it, to the best of the state's ability, I think that's something. Sorry you don't see that. But, frankly, don't really care.\n\n \n Good. But I didn't say it wasn't \"something\". But I'd be married with or without the state.\n \n \nOdd, as a taxpayer, as a member of OUR SOCIETY, my marriage has already changed the institution for all of society. Sorry you're so attached to your prejudicial views that you can't see that.\n\n \n I'm not sure what you're arguing here. As a citizen my tax dollars probably help fund many things that I don't partake in. Possibly even some things you yourself benefit from that I don't. [shrug]\n \n \nThe will of the people is the constitution. And the constitution guarantees my rights.\n \n \n Only if your state allows for it, as far as gay marriage is concerned. Personally, I'm surprised gays aren't out trying to get the U.S. constitution amended to guarantee them marriage. Imagine if blacks had refused to fight for the civil rights amendment under the idea they were covered under the constitution already. They knew better.", 
   {}, 
   282545, 
   null, 
   1189117080.0
  ], 
  [
   282552, 
   null, 
   "Kronus", 
   "Did I say \"public opinion polls\"? No, I didn't..\n\n You really have given up on honest debate again, haven't you? You're determined to nit-pick over words in an attempt to avoid the context of what people say if you don't have a real refutation. You stopped doing this for a while; it's really sad that you feel the need to go back to it now. I was enjoying having actual conversations with you, it's a shame that you've regressed to the point where there's little to do but point out your bogus debating techniques again and again and again.", 
   {}, 
   282546, 
   null, 
   1189119120.0
  ], 
  [
   282554, 
   null, 
   "davenport15", 
   "Personally, I'm surprised gays aren't out trying to get the U.S. constitution amended to guarantee them marriage. Imagine if blacks had refused to fight for the civil rights amendment under the idea they were covered under the constitution already. They knew better.\n\n \n Because the constitution doesn't exclude us from marriage. People like you do. And, since it means nothing to you anyway, you should just accept it.", 
   {}, 
   282547, 
   null, 
   1189119240.0
  ], 
  [
   282556, 
   null, 
   "Kronus", 
   "Because the constitution doesn't exclude us from marriage. People like you do. And, since it means nothing to you anyway, you should just accept it.\n\n \n Oh, but it does mean something to him. He can't/won't say what, but it sure isn't based on homophobia, no siree! It's just really, really important that marriage stay a striaghts only club, for reasons that can't be explained, but there's no bigotry, don't worry on that score. emoticon_rolleyes", 
   {}, 
   282554, 
   null, 
   1189119420.0
  ], 
  [
   282557, 
   null, 
   "jyoshu", 
   "You really have given up on honest debate again, haven't you?\n\n \n Look, in this case it really wasn't about public opinion polls. If I were act as though it were, I'd be acting dishonestly. Public opinion polls are a much different matter than discussing society's general view of things. A poll would have to do with specific percentages, and that's not necessarily relevant here at all. I don't know at what point the threshold is crossed from society changing it's views; from a relevant standpoint the threshold that matters is whatever it would take to get change enacted nationwide, and clearly we aren't there yet.", 
   {}, 
   282552, 
   null, 
   1189119600.0
  ], 
  [
   282558, 
   null, 
   "jyoshu", 
   "Because the constitution doesn't exclude us from marriage.\n\n \n The constitution didn't exclude blacks from using the same restrooms as whites either, or getting the same jobs. They still pushed for an amendment, following precedent.", 
   {}, 
   282554, 
   null, 
   1189119720.0
  ], 
  [
   282569, 
   null, 
   "samiinh", 
   "Oh, but it does mean something to him. He can't/won't say what, but it sure isn't based on homophobia, no siree! It's just really, really important that marriage stay a striaghts only club, for reasons that can't be explained, but there's no bigotry, don't worry on that score. emoticon_rolleyes\n\n \n I believe it is called \"heterosexual privilege\" or \"special rights.\"", 
   {}, 
   282556, 
   null, 
   1189124160.0
  ], 
  [
   282581, 
   null, 
   "MrWriteLA", 
   "Guys,\n When are you going to realize that no matter how he may pretend for a post or two (for whatever reasons) this leopard never changes his spots? (As the former NYT and CNN posters here can aver.)", 
   {}, 
   282569, 
   null, 
   1189125900.0
  ], 
  [
   282583, 
   null, 
   "JakeCJB", 
   "I'd hate to think I held state-sanctioning is higher esteem that simply committing in marriage to a partner. Regardless, it's not that it's important or not to me; I just don't see why something should be applied to something to which it doesn't fit by society's definition. Honestly, I'm pretty surprised gays would even want to legally piggyback off an institution that applies to something else. It's like a young person wanting to get in on social security benefits--by society's standards, it's given for a different sort of situation. In the case of marriage, that situation is opposite-sex couples, because that's the way marriage is generally understood and mostly always has.\n\n \n There are some logical reasons why elderly people would get social security, and not young people. Young people haven't payed into it through taxes over many years, and are more able to work. The reason marriage is exclusive to different sex is what? It has nothing to do with social security. Is it genitals, anti-gay prejudice? Tradition alone doesn't make the exclusion correct or morally right.\n \n \nYou may think the greatest day of life is when the state gives a certificate; but not me. I'd be married with or without the state.\n\n \n Well, clearly most straight married people want that certificate, and think it is indeed a very great day in their lives. Fine, if you don't want yours, and it means nothing to you, let a gay couple have it, and not you yourself as a straight person. \n \n \nThen you terribly misunderstand the situation. And this only confirms my suspicion that some gay marriage proponents here think there's something magical about a having a marriage licensed. Getting a license from the state is NOT an automatic ticket to support and recognition from society.\n\n \n It can be a step along that road, or a statement of that support. To suggest marriage exists in social isolation, just isn't so. People have opposed gay marriage and inter-racial or different faith marriage for social reasons. More people support gay marriage and other types of marriages as society changed its attitudes towards these groups of people.", 
   {}, 
   282529, 
   null, 
   1189126800.0
  ], 
  [
   282586, 
   null, 
   "samiinh", 
   "There are some logical reasons why elderly people would get social security, and not young people. Young people haven't payed into it through taxes over many years, and are more able to work. The reason marriage is exclusive to different sex is what? It has nothing to do with social security. Is it genitals, anti-gay prejudice? Tradition alone doesn't make the exclusion correct or morally right.\n \n \n \n Well, clearly most straight married people want that certificate, and think it is indeed a very great day in their lives. Fine, if you don't want yours, and it means nothing to you, let a gay couple have it, and not you yourself as a straight person. \n \n \n \n It can be a step along that road, or a statement of that support. To suggest marriage exists in social isolation, just isn't so. People have opposed gay marriage and inter-racial or different faith marriage for social reasons. More people support gay marriage and other types of marriages as society changed its attitudes towards these groups of people.\n\n \n \n The real reason why the homophobes are opposed to gay marriage is because marriage will give gay people the same respectability that straight people take for granted, and they can't fathom the thought.", 
   {}, 
   282583, 
   null, 
   1189127340.0
  ], 
  [
   282601, 
   null, 
   "davenport15", 
   "Guys,\n When are you going to realize that no matter how he may pretend for a post or two (for whatever reasons) this leopard never changes his spots? (As the former NYT and CNN posters here can aver.)\n\n \n You're right. I've forgotten myself. What was this guy's name on the NYTimes forums?", 
   {}, 
   282581, 
   null, 
   1189132140.0
  ], 
  [
   282746, 
   null, 
   "MrWriteLA", 
   "You're right. I've forgotten myself. What was this guy's name on the NYTimes forums?\nKahmad and Bob Maddox were what he called himself. Kahboob, Demented XXX-Clown, etc. were what we called him. (Did you know that a certain Southern Baptist university now sponsors an aikido class?)", 
   {}, 
   282601, 
   null, 
   1189188660.0
  ], 
  [
   282783, 
   null, 
   "samiinh", 
   "jyoshu must be taking the day off. Wonder where AA's been? Was he banned?", 
   {}, 
   282746, 
   null, 
   1189202340.0
  ], 
  [
   282846, 
   null, 
   "jyoshu", 
   "The reason marriage is exclusive to different sex is what? It has nothing to do with social security. Is it genitals, anti-gay prejudice? Tradition alone doesn't make the exclusion correct or morally right.\n\n \n Well, I think the issue is couples' benefits. And I don't think that has to be exclusive that way. I don't really care who gets couples' benefits. It's just my opinion that marriage is a term for opposite-sex couple unions. Sort of like the term 'black' is reserved for African-Americans. The word applies to them, even though there may not be any real logical reason to do so (after all, there are many shades of color to peoples' skin). So to answer your question about couples' benefits (which is really the only thing at stake here in terms of what the govt. provides), it DOESN'T have to be exclusive, I don't think.\n \n \nWell, clearly most straight married people want that certificate, and think it is indeed a very great day in their lives.\n\n \n True; and again if the govt. gives you couples' benefits, so be it. It's not my issue. But I still believe it should be done under different terminology. Or just call all of them something else and leave marriage for the cultural \"sector\"--for churches or whatever. Marriage to me isn't about federal benefits anyway.", 
   {}, 
   282583, 
   null, 
   1189213620.0
  ], 
  [
   282925, 
   null, 
   "JakeCJB", 
   "Well, I think the issue is couples' benefits. And I don't think that has to be exclusive that way. I don't really care who gets couples' benefits. It's just my opinion that marriage is a term for opposite-sex couple unions. Sort of like the term 'black' is reserved for African-Americans. The word applies to them, even though there may not be any real logical reason to do so (after all, there are many shades of color to peoples' skin). So to answer your question about couples' benefits (which is really the only thing at stake here in terms of what the govt. provides), it DOESN'T have to be exclusive, I don't think.\n \n \n \n True; and again if the govt. gives you couples' benefits, so be it. It's not my issue. But I still believe it should be done under different terminology. Or just call all of them something else and leave marriage for the cultural \"sector\"--for churches or whatever. Marriage to me isn't about federal benefits anyway.\n\n \n You say this is just about benefits for you, however you make an issue of the term marriage being applied to gay couples. Your issue is not only benefits.\n \n Marriage is an institution in society. It's used to give support and recognition to relationships. Government is a part of it. There is no reason why gays should be excluded from this institution. Not everyone's definition is to a man and a woman, or heterosexuality, the way \"black\" is always applied to African Americans direclty due to skin colour. \"Black\" isn't an institution that does the same thing and is supported by government in itself. \n \n These analogies are quite faulty and really diversions. I believe you are aware of what marriage does in society, and don't want gay couples to have that. You reject gay people having socially recognized and supported love, happiness, and fullfilment in life, because your religious ideology says that gays are to repress sexuality and/or be closeted.\n \n I believe you want to throw the baby out with the bathwater, by getting government out of marriage, rather than have to give the same type of social support to gay couples.\n \n You may still do what you wish in your religion, but you have no right to impose that on the rest of society or the government.", 
   {}, 
   282846, 
   null, 
   1189274460.0
  ], 
  [
   282927, 
   null, 
   "jyoshu", 
   "You say this is just about benefits for you, however you make an issue of the term marriage being applied to gay couples. Your issue is not only benefits.\n\n \n It's not that it's \"just about the benefits\" for ME, it's that it's only about the benefits for the GOVERNMENT. Legally, the benefits ARE the only issue. That's what's at issue here. Otherwise you're just wrangling over a term.\n \n \nMarriage is an institution in society. It's used to give support and recognition to relationships. Government is a part of it.\n\n \n The govt. happens to recognize marriage and use it for criteria to give federal benefits. THAT'S what is going on. This \"support and recognition to relationships\" canard is just cultural wishful thinking. The govt. isn't in the business of promoting relationships from a religious/cultural standpoint. This idea of govt. giving a pat on the back that you have doesn't really mean anything. Such a concept has no substance. If the govt is doing that in some official way other than using marriage for federal benefit criteria, it shouldn't be. Again--and I've had to say this multiple times now--there's nothing magical about the govt. here in terms of cultural marriage. It's role pertains to federal benefits. \n \n \nThere is no reason why gays should be excluded from this institution.\n\n \n I don't have a problem with gays not being excluded from the institution of the govt. giving benefits to couples. I don't care. But I see no reason apply the term marriage to it. It's silly. Like I said, it's like applying the term \"black\" to other things. There's no need in it. Particularly if you get the benefits you need--that's the main thing.\n \n \nNot everyone's definition is to a man and a woman, or heterosexuality, the way \"black\" is always applied to African Americans direclty due to skin colour. \"Black\" isn't an institution that does the same thing and is supported by government in itself. \n\n \n It is no less an institution in terms of the govt. that marriage is. The govt. doesn't ideologically care if you're black or white. But if you're black you are offered some extra protections in the form of affirmative action. So the analogy does fit. Your logic is like someone wanting the term black to apply to them when it doesn't. And then vaguely claiming it's because provides some sort of \"social support\" (whatever that means) as you do later in your post. What is this 'social support' you think the govt. provides, exactly? Be specific please.\n \n \nThese analogies are quite faulty\n\n \n You say they are faulty because you happen to not like them--they point to problems in your logic and arguments. The better reaction to them isn't to just say they \"are faulty\" when they in fact fit, or resort to the old \"you-just-don't-like-gays\" attack (which is not an argument at all), but rather use them for self-reflection in terms of your arguments. \n \n \nI believe you want to throw the baby out with the bathwater, by getting government out of marriage, rather than have to give the same type of social support to gay couples.\n\n \n Again, what 'social support', specifically, other than federal benefits, do you think the govt. does in terms of marriage, Jake?", 
   {}, 
   282925, 
   null, 
   1189276260.0
  ], 
  [
   282928, 
   null, 
   "JSDKoeln", 
   "The govt. happens to recognize marriage and use it for criteria to give federal benefits. THAT'S what is going on. This \"support and recognition to relationships\" canard is just cultural wishful thinking. The govt. isn't in the business of promoting relationships from a religious/cultural standpoint. This idea of govt. giving a pat on the back that you have doesn't really mean anything. Such a concept has no substance. If the govt is doing that in some official way other than using marriage for federal benefit criteria, it shouldn't be. Again--and I've had to say this multiple times now--there's nothing magical about the govt. here in terms of cultural marriage. It's role pertains to federal benefits. \n\n \n I'd like to believe that; however, GB is a proponant for passing a constitutional amendment for marriage being between one man and one woman. Fred Thompson is making overtures to the same. States have already passed laws banning same sex unions. So, in fact, the government is already in this business.\n \n I for one don't care what you call it as long as the rights are exactly equal. Here in Germany, all unions are civil first. The marriage thing happens in the churchs. But still there is a disperity between gays and heterosexuals here. We can't use the \"M\" word. And not all benefits are equal yet. Most. Still dealing with the tax issues. Anyway.... any progress is welcomed.", 
   {}, 
   282927, 
   null, 
   1189276920.0
  ], 
  [
   282931, 
   null, 
   "jyoshu", 
   "I'd like to believe that; however, GB is a proponant for passing a constitutional amendment for marriage being between one man and one woman. Fred Thompson is making overtures to the same. States have already passed laws banning same sex unions. So, in fact, the government is already in this business.\n\n \n I agree on the federal amendment thing. I don't think it's necessary.", 
   {}, 
   282928, 
   null, 
   1189279080.0
  ], 
  [
   282934, 
   null, 
   "samiinh", 
   "I agree on the federal amendment thing. I don't think it's necessary.\n\n \n The marriage amendment is a rightwing ploy to scare the base. It's used to get votes.", 
   {}, 
   282931, 
   null, 
   1189281060.0
  ], 
  [
   282939, 
   null, 
   "JakeCJB", 
   "Jyoshu: You keep insisting the government using the term \"marriage\" carries no meaning, socially, culturally, etc. Yet, why then, do you have an issue with the government using the term to apply to gay couples? \n \n I believe it does carry meaning, it does lend social support and recognition to people's relationships, as I explained.", 
   {}, 
   282931, 
   null, 
   1189281960.0
  ], 
  [
   282940, 
   null, 
   "JakeCJB", 
   "I'd like to believe that; however, GB is a proponant for passing a constitutional amendment for marriage being between one man and one woman. Fred Thompson is making overtures to the same. States have already passed laws banning same sex unions. So, in fact, the government is already in this business.\n\n \n \n \nI agree on the federal amendment thing. I don't think it's necessary.\n\n \n The point is not addressed though. I believe JSD was saying there is a cultural context or meaning behind the word, the evidence is in the push for things like constitutional amendments.", 
   {}, 
   282931, 
   null, 
   1189283160.0
  ], 
  [
   282942, 
   null, 
   "jyoshu", 
   "I believe it does carry meaning, it does lend social support and recognition to people's relationships, as I explained.\n\n \n Again, what is this 'social support' you think the govt. provides, exactly? Be specific please. Simple question.\n \n \nThe point is not addressed though. I believe JSD was saying there is a cultural context or meaning behind the word, the evidence is in the push for things like constitutional amendments.\n\n \n No, the constitutional amendment doesn't address a cultural context. It would keep you from getting the federal benefits--the legal context.", 
   {}, 
   282939, 
   null, 
   1189286580.0
  ], 
  [
   282949, 
   null, 
   "JSDKoeln", 
   "Again, what is this 'social support' you think the govt. provides, exactly? Be specific please. Simple question.\n \n \n \n No, the constitutional amendment doesn't address a cultural context. It would keep you from getting the federal benefits--the legal context.\n\n \n Well, the desire for the marriage amendment for one. The social support is being given is to the religious right. Religion is chosen. Sexuality is not. States have already passed anti-gay amendements. Now they want the federal government to pass a amendment discriminating against 4-7% of amiercans who don't believe as they do. So, since there is a separation between church and state, why is this religious interpretation being given so much social and legal support? I have read comments (of which I'm deeply offended) as to the gay population being \"insignificant.\" (another politically motived word.) 4-7%, in my view, is hardly insignificant. Even if it was only 1%. Humans are not insignificant. As a anti-abortion proponant, I would hope you would agree with that. \n \n So, what more legal or social context do you desire? \n \n As I said, I don't care about marriage. The whole thing is kind of silly actually. But I do care about my relationship being treated equally under the law to yours. I don't want to marry a woman. I will never marry a woman. It's not the way I was born.", 
   {}, 
   282942, 
   null, 
   1189289040.0
  ], 
  [
   282950, 
   null, 
   "JakeCJB", 
   "Again, what is this 'social support' you think the govt. provides, exactly? Be specific please. Simple question.\n\n \n Marriage is social support. The government, in supporting marriage, is giving social support to certain relationships covered by marriage. \n \n You argue marriage should be left up to the culture institutions such as churches, government should only do the paper work. That's an acknowledgment of the current social role of government recognized marriage. You don't want government to provide that social support, suddenly, now that it will include gays.\n \n \nNo, the constitutional amendment doesn't address a cultural context. It would keep you from getting the federal benefits--the legal context.\n\n \n Oh yes, it speaks to the cultural relevence of government-recognized marriage. People would not feel sufficiently compelled to change the constitution over a matter of meaningless government paperwork which has no social relevence.", 
   {}, 
   282942, 
   null, 
   1189289580.0
  ], 
  [
   282957, 
   null, 
   "samiinh", 
   "jyoshu, I was surprised to see that you are the most prolific poster on these forums. Do you have no life?", 
   {}, 
   282950, 
   null, 
   1189291020.0
  ], 
  [
   283447, 
   null, 
   "Shooterandproud", 
   "Homosexuality-related issues have the status of being broadly moralistically-based (unlike the other 'family types'), and as long as that's the case, some parents are going to object. \n \n As one of the grandparents said ...\n \n \"When does Evesham Township or any school have a right to show to my grandchildren something I believe to be morally wrong?\"\n \n Of course, individual schools should have latitude in this. But it's only natural that they aren't going to include something that so many people feel is morally wrong. While it wouldn't bother me to see gay families in the video, I can certainly understand the school's position.\n\n \n Well what if I believe that people believing that gay unions are morally wrong are morally wrong? What are you going to do then?", 
   {}, 
   282083, 
   null, 
   1189577160.0
  ], 
  [
   283480, 
   null, 
   "lesz", 
   "As if we needed it, evidence that liberals use their brains more than conservatives! ;-)\n \n Brains of liberals, conservatives may work differently, study finds\n \n \nIn a study likely to raise the hackles of some conservatives, scientists at New York University and the University of California, Los Angeles, found that a specific region of the brain's cortex is more sensitive in people who consider themselves liberals than in self-declared conservatives.\n \n The brain region in question helps people shift gears when their usual response would be inappropriate, supporting the notion that liberals are more flexible in their thinking.\n\n \n Well, I wouldn't want to make too much of this! He-heh! But it could explain in part why conservatives reflexively oppose every single innovation such as gay marriage. Their brains simply find it more difficult to cope with change.\n \n emoticon_xgood", 
   {}, 
   283447, 
   null, 
   1189608240.0
  ], 
  [
   286591, 
   null, 
   "Sigma", 
   "Marriage is social support. The government, in supporting marriage, is giving social support to certain relationships covered by marriage.\n \n You argue marriage should be left up to the culture institutions such as churches, government should only do the paper work. That's an acknowledgment of the current social role of government recognized marriage. You don't want government to provide that social support, suddenly, now that it will include gays.\n \n\n \n The gov't \"supports marriage\" by giving legal benefits to couples. Like Jyoshu, I cannot see the connection you are making here. Your objection is obviously not aimed at gaining these legal benefits, but is instead aimed at social acceptance. The gov't cannot give you this regardless of what term is used for your relationship.\n \n Perhaps the confusion is over the phrase \"social support\". Exactly what is it you mean by this?", 
   {}, 
   282950, 
   null, 
   1191548220.0
  ], 
  [
   286593, 
   null, 
   "Sigma", 
   "Well what if I believe that people believing that gay unions are morally wrong are morally wrong? What are you going to do then?\n\n \n If there are enough of you to raise a ruckus then you may indeed succeed.", 
   {}, 
   283447, 
   null, 
   1191548460.0
  ], 
  [
   286653, 
   null, 
   "samiinh", 
   "If there are enough of you to raise a ruckus then you may indeed succeed.\n\n \n There are millions of gay people in this country, and most of us are related to you in some way or other.", 
   {}, 
   286593, 
   null, 
   1191590340.0
  ], 
  [
   286682, 
   null, 
   "Sigma", 
   "There are millions of gay people in this country, and most of us are related to you in some way or other.\n\n \n \n Uh... most gay people are related to me? That's a strange statement to make.\n \n My comment was directed at this specific situation at the school. If there are enough people to raise a ruckus over a particular issue then they may indeed succeed. If there are few enough to be ignored then they likely will be.", 
   {}, 
   286653, 
   null, 
   1191605640.0
  ], 
  [
   286693, 
   null, 
   "samiinh", 
   "Uh... most gay people are related to me? That's a strange statement to make.\n \n My comment was directed at this specific situation at the school. If there are enough people to raise a ruckus over a particular issue then they may indeed succeed. If there are few enough to be ignored then they likely will be.\n\n \n I'm sorry that I was unclear. Most gay people are related to the straight members of our society in some way or other. We are not strangers.", 
   {}, 
   286682, 
   null, 
   1191608460.0
  ], 
  [
   286696, 
   null, 
   "Sigma", 
   "I'm sorry that I was unclear. Most gay people are related to the straight members of our society in some way or other. We are not strangers.\n\n \n I know this. One of my in-laws is gay.", 
   {}, 
   286693, 
   null, 
   1191608640.0
  ], 
  [
   287067, 
   null, 
   "davenport15", 
   "One of my in-laws is gay.\n\n \n Sad, then, that you condone the government discriminating against his or her relationship.", 
   {}, 
   286696, 
   null, 
   1191867900.0
  ], 
  [
   287093, 
   null, 
   "samiinh", 
   "I know this. One of my in-laws is gay.\n\n \n Then one would think you'd be supportive of gay rights.", 
   {}, 
   286696, 
   null, 
   1191884700.0
  ], 
  [
   287198, 
   null, 
   "Sigma", 
   "Sad, then, that you condone the government discriminating against his or her relationship.\n\n \n \nThen one would think you'd be supportive of gay rights.\n\n \n I do support gay rights. I don't think the current way of going about it are sustainable/reasonable and I also think it works against the goal of gaining acceptance.\n \n In short, the attitude I see most gay people have is counterproductive.", 
   {}, 
   287093, 
   null, 
   1191951720.0
  ], 
  [
   287203, 
   null, 
   "lesz", 
   "I do support gay rights. I don't think the current way of going about it are sustainable/reasonable and I also think it works against the goal of gaining acceptance.\n \n In short, the attitude I see most gay people have is counterproductive.\n\n \n Oh? Then what is the correct and productive way? Sitting on our collective butts till religious homophobes see the error of their ways through the kindness of their hearts?", 
   {}, 
   287198, 
   null, 
   1191952500.0
  ], 
  [
   287208, 
   null, 
   "Sigma", 
   "Oh? Then what is the correct and productive way? Sitting on our collective butts till religious homophobes see the error of their ways through the kindness of their hearts?\n\n \n I don't know what the solution is for all the ills that gay people both see and experience. \n \n Certainly for the most immediate issue I would say that fighting for equal federal protection and civil unions to use them in is justifiable. Making a stink over being called \"married\" will just brand you as greedy and unreasonable.", 
   {}, 
   287203, 
   null, 
   1191953280.0
  ], 
  [
   287227, 
   null, 
   "JSDKoeln", 
   "I don't know what the solution is for all the ills that gay people both see and experience. \n \n Certainly for the most immediate issue I would say that fighting for equal federal protection and civil unions to use them in is justifiable. Making a stink over being called \"married\" will just brand you as greedy and unreasonable.\n\n \n The same could be said about the religious folk making a stink over being called \"married.\" Greedy and unreasonable. But the fact is that most of the relgious folk do NOT want to give us anything close to marriage. What specific behavior on the part of the homosexual community do you find unacceptable in their pursuit of equal rights?", 
   {}, 
   287208, 
   null, 
   1191961980.0
  ], 
  [
   287235, 
   null, 
   "samiinh", 
   "Heterosexual privilege is what the right wingers want to keep for themselves. They do not want to grant marriage rights to gays, because that will put gays on the same plane with them and they can't deal with that.", 
   {}, 
   287227, 
   null, 
   1191965220.0
  ], 
  [
   287249, 
   null, 
   "Sigma", 
   "The same could be said about the religious folk making a stink over being called \"married.\" Greedy and unreasonable. But the fact is that most of the relgious folk do NOT want to give us anything close to marriage. What specific behavior on the part of the homosexual community do you find unacceptable in their pursuit of equal rights?\n\n \n I just gave you an example. Most of the nation, from the polls I've seen before, would support equal protection of the law under \"civil unions\". I have not seen widespread support for the same under \"marriage\". Perhaps I'm wrong, but that is what I have seen.\n \n Whether or not the \"religious folk\" are greedy and unreasonable is somewhat beside the point. It's the status quo, and you're trying to change it. You're changing what something was into something new. Do it too much and you get a backlash. A backlash would be counterproductive to your goal.\n \n My impression is that this scuffle over the word \"marriage\" is one of many backlashes the cause will suffer.", 
   {}, 
   287227, 
   null, 
   1191968160.0
  ], 
  [
   287270, 
   null, 
   "davenport15", 
   "I just gave you an example. Most of the nation, from the polls I've seen before, would support equal protection of the law under \"civil unions\". I have not seen widespread support for the same under \"marriage\". Perhaps I'm wrong, but that is what I have seen.\n \n Whether or not the \"religious folk\" are greedy and unreasonable is somewhat beside the point. It's the status quo, and you're trying to change it. You're changing what something was into something new. Do it too much and you get a backlash. A backlash would be counterproductive to your goal.\n \n My impression is that this scuffle over the word \"marriage\" is one of many backlashes the cause will suffer.\n\n \n Okay, I'm just using you as an example, since you've dipped your foot so freely in this water. Please don't take this personally.\n \n But I'm frequently amazed by people who say things like \"I am all in favor of equal rights\" or \"I support same sex civil unions\" but then go on to say \"But you're doing it all wrong! You're going to create a backlash.\"\n \n And yet, when pressed, they profess that they have no clue how one should go forward with their attempts. They offer no real assistance, no significant support other than their word, but they can sit back on the sidelines, shake their heads, go \"tsk tsk tsk.\"\n \n There is not one movement here. There are several individuals, some of then connected by groups, others behaving independently, all of them doing whatever they can to promote their cause. Some of us disagree with each other. \n \n But the truth is, we want our relationships to be treated equally under the law. We believe that whether this is marriage, or civil unions, or whatever, we want to be treated equally - as full citizens of this proclaimed land of the free. And if you're offended by some of the rhetoric (or offended for those who might be offended by the rhetoric), that's fine. These rights are conferred on convicted criminals, but not to full tax-paying couples living decent lives. \n \n I'd love to know how you think we should continue our pursuit, since you see so clearly where we're going astray. If this country is to continue to expand, grow, and be the true land of the free, then it has to be free for all of us. So maybe you can help!", 
   {}, 
   287249, 
   null, 
   1191976140.0
  ], 
  [
   287272, 
   null, 
   "Sigma", 
   "\n I'd love to know how you think we should continue our pursuit, since you see so clearly where we're going astray. If this country is to continue to expand, grow, and be the true land of the free, then it has to be free for all of us. So maybe you can help!\n\n \n If I had a vested interest then I would care more. The only reason I care at all is because the attitude I see many gay people have (which is exemplified in the all-or-nothing call it marriage or your a bigot approach) irritates me enough that I would oppose it just out of spite.\n \n If not for that I would simply agree and get on with my life. My advice? Compromise to get equal protection. Acceptance will take time if it ever comes. Settle for what the majority of the nation will support. I'd wager most people support civil unions that give the same federal rights. That's what I've seen in the polls at least (when I saw them last).\n \n I don't know the solution to all the ills you both perceive and experience. It may be there is no solution. The current approach, however, alienates many that would otherwise support your goal, imo.", 
   {}, 
   287270, 
   null, 
   1191977340.0
  ], 
  [
   287318, 
   null, 
   "lesz", 
   "I don't know what the solution is for all the ills that gay people both see and experience. \n \n Certainly for the most immediate issue I would say that fighting for equal federal protection and civil unions to use them in is justifiable. Making a stink over being called \"married\" will just brand you as greedy and unreasonable.\n\n \n Only among the religious bigots who also oppose equal protections and civil unions. They oppose any freedom or equality for gay citizens. Reasonable people don't have fits of existential angst that gays get married the same way straight people do, and there is no reasoning with unreasonable people.", 
   {}, 
   287208, 
   null, 
   1192022100.0
  ], 
  [
   287366, 
   null, 
   "Sigma", 
   "Reasonable people don't have fits of existential angst that gays get married the same way straight people do, and there is no reasoning with unreasonable people.\n\n \n That's the rub. This isn't about existential angst, it is about perceiving gay proponents as greedy and unreasonable. This is something even moderates f can perceive. Push enough and you get pushed back, even from those in the middle whom would normally support you.", 
   {}, 
   287318, 
   null, 
   1192038000.0
  ], 
  [
   287373, 
   null, 
   "Steeeeve", 
   "That's the rub. This isn't about existential angst, it is about perceiving gay proponents as greedy and unreasonable. This is something even moderates f can perceive. Push enough and you get pushed back, even from those in the middle whom would normally support you.\nAnd the proof is in the pudding (as they say) because they are pushing back.", 
   {}, 
   287366, 
   null, 
   1192044480.0
  ], 
  [
   287378, 
   null, 
   "Sigma", 
   "And the proof is in the pudding (as they say) because they are pushing back.\n\n \n There always will be conservative push against changing the status quo. Widespread opposition to using the word \"marriage\" while having support for civil unions (or domestic partnerships) at the same time would seem to show that those who support the goal of equal rights still do not support using \"marriage\" to describe the union.", 
   {}, 
   287373, 
   null, 
   1192046580.0
  ], 
  [
   287481, 
   null, 
   "lesz", 
   "That's the rub. This isn't about existential angst, it is about perceiving gay proponents as greedy and unreasonable. This is something even moderates f can perceive. Push enough and you get pushed back, even from those in the middle whom would normally support you.\n\n \n There is no such thing as pushing too hard for equality. Equality isn't unreasonable, when it can be, and has been, justified as reasonable. Only the bigots push back. Reasonable people admit the justice of the case. No-one in the middle is threatened by gay equality.", 
   {}, 
   287366, 
   null, 
   1192109040.0
  ], 
  [
   287506, 
   null, 
   "samiinh", 
   "There is no such thing as pushing too hard for equality. Equality isn't unreasonable, when it can be, and has been, justified as reasonable. Only the bigots push back. Reasonable people admit the justice of the case. No-one in the middle is threatened by gay equality.\n\n \n You are very right...no one should be threatened by gay equality. We are your brothers and sisters, aunts and uncles, moms and dads, sons and daughters. We are part of you, not some group of aliens from outer space. Time to let go of bigotry and hate of your own family.", 
   {}, 
   287481, 
   null, 
   1192124520.0
  ], 
  [
   287508, 
   null, 
   "Sigma", 
   "There is no such thing as pushing too hard for equality.\n\n \n I suppose it depends on your perception. If you do not care about counterproductive efforts and diminishing returns then I suppose not. If you're more rational, you know how far you can push someone before they turn on you. There is a balance.\n \n \nEquality isn't unreasonable, when it can be, and has been, justified as reasonable. Only the bigots push back. Reasonable people admit the justice of the case. No-one in the middle is threatened by gay equality.\n\n \n The middle makes up a great deal of this country. Currently, they oppose you. They obviously think gay people are unreasonable in some way, since as you say they are not threatened by gay equality.", 
   {}, 
   287481, 
   null, 
   1192124760.0
  ], 
  [
   287550, 
   null, 
   "JakeCJB", 
   "I suppose it depends on your perception. If you do not care about counterproductive efforts and diminishing returns then I suppose not. If you're more rational, you know how far you can push someone before they turn on you. There is a balance.\n \n \n \n The middle makes up a great deal of this country. Currently, they oppose you. They obviously think gay people are unreasonable in some way, since as you say they are not threatened by gay equality.\n\n \n Ask for less, and we receive less. There are no diminishing returns in the overall big social picture, in fact, the contrary is true. It's a rapidly changing society. There used to be a strong majority opposed to gay marriage, now the opposition has decreased in numbers, and the support has increased. Soon, the majority will not be opposed---\n http://www.galluppoll.com/content/?ci=27694", 
   {}, 
   287508, 
   null, 
   1192147740.0
  ], 
  [
   287564, 
   null, 
   "samiinh", 
   "Ask for less, and we receive less. There are no diminishing returns in the overall big social picture, in fact, the contrary is true. It's a rapidly changing society. There used to be a strong majority opposed to gay marriage, now the opposition has decreased in numbers, and the support has increased. Soon, the majority will not be opposed---\n http://www.galluppoll.com/content/?ci=27694\n\n \n Interesting poll. Thanks Jake.", 
   {}, 
   287550, 
   null, 
   1192191480.0
  ], 
  [
   287565, 
   null, 
   "lesz", 
   "I suppose it depends on your perception. If you do not care about counterproductive efforts and diminishing returns then I suppose not. If you're more rational, you know how far you can push someone before they turn on you. There is a balance.\n\n \n And where does this alleged balance lie? I'm not really seeing much difference between this argument as applied to gay people, and as it was applied to those \"uppity nigras\" in the civil rights movement who didn't \"know their place\". The balance lies, so far as I am concerned, in unconditional equality.\n \n \nThe middle makes up a great deal of this country. Currently, they oppose you. They obviously think gay people are unreasonable in some way, since as you say they are not threatened by gay equality.\n\n \n So they not immune to irrational bigotry. Tell us something we don't know. They won't remain unreasonable indefinitely, but they'll never see reason without a push in that direction, either.\n \n As the poll posted by Jake shows, public opinion is swinging in favour of equal rights, and despite the occasional setback, it's been moving that way for the last few decades. That would never have happened, neither would the civil rights gains gay people have made, had it not been for the pushy face of gay activism. There can be no moderation on basic issues of human rights. We either all have them, or none of really do.", 
   {}, 
   287508, 
   null, 
   1192191660.0
  ], 
  [
   287616, 
   null, 
   "Sigma", 
   "Ask for less, and we receive less. There are no diminishing returns in the overall big social picture, in fact, the contrary is true. It's a rapidly changing society. There used to be a strong majority opposed to gay marriage, now the opposition has decreased in numbers, and the support has increased. Soon, the majority will not be opposed---\n http://www.galluppoll.com/content/?ci=27694\n\n \n Hm. Well, sure, if you want to believe polls... Yet, there are polls that show lower acceptance.\n \n USA Today/Gallup Poll. Sept. 7-8, 2007. N=1,028 adults nationwide. MoE &#177; 3.\n \"Do you feel that homosexuality should be considered an acceptable alternative lifestyle or not?\"\n \n 9/7-8/07: 48% said acceptable, 46% said unacceptable and 6% were unsure. \n 5/10-13/07: 57% acceptable, 39% unacceptable and 3% unsure. \n 5/8-11/06: 54%, 41% and 4%. \n 5/2-5/05: 51%, 45% and 4%\n \n CNN/Opinion Research Corporation Poll. May 4-6, 2007. N=1,028 adults nationwide. MoE &#177; 3. \n \"Which of the following arrangements between gay or lesbian couples do you think should be recognized as legally valid: same-sex marriages, civil unions but not same-sex marriages, or neither same-sex marriages nor civil unions?\"\n \n 5/4-6/07: 24% for marriage, 27% for civil unions, 43% said neither and 6% are unsure. \n 10/27-29/06: 24%, 26%, 45% and 5%\n \n Newsweek Poll conducted by Princeton Survey Research Associates International. March 14-15, 2007. N=1,001 adults nationwide. MoE &#177; 3.\n \"There has been much talk recently about whether gays and lesbians should have the legal right to marry someone of the same sex. Which of the following comes closest to your position on this issue? Do you support FULL marriage rights for same-sex couples, support civil unions or partnerships for same-sex couples BUT NOT full marriage rights, or do you oppose ANY legal recognition for same-sex couples?\"\n \n 3/14-15/07: 26% said marriage, 24% said civil unions, 44% said neither and 6% were unsure.\n \n Associated Press/AOL poll conducted by Ipsos Public Affairs. Jan. 16-18, 2007. N=1,005 adults nationwide. MoE &#177; 3.1.\n \"Would you favor or oppose a law that would ban gay marriage, requiring that marriage should be between a man and a woman?\"\n \n 1/16-18/07: 51% said favor, 45% said oppose, 4% were unsure.\n \n Public opinion is not on your side. However, there is a bright side:\n \n Quinnipiac University Poll. Nov. 13-19, 2006. N=1,623 registered voters nationwide. MoE &#177; 2.4. \n \"Would you support or oppose a law that would allow same-sex couples to form civil unions, giving them many of the legal rights of married couples?\"\n \n 11/13-19/06: 45% said support, 52% said oppose, 4% were unsure \n 12/7-12/04: 45%, 51% and 4% \n 7/18-22/04: 40%, 55%, and 6% \n 3/16-22/04: 40%, 53% and 7%", 
   {}, 
   287550, 
   null, 
   1192225260.0
  ], 
  [
   287618, 
   null, 
   "Sigma", 
   "The balance lies, so far as I am concerned, in unconditional equality.\n\n \n An all-or-nothing attitude may leave you with nothing.\n \n \nSo they not immune to irrational bigotry. Tell us something we don't know. They won't remain unreasonable indefinitely, but they'll never see reason without a push in that direction, either.\n\n \n Except you're adding fuel to the fire, as black people do as well :P\n \n \nThat would never have happened, neither would the civil rights gains gay people have made, had it not been for the pushy face of gay activism.\n\n \n Like I said, there is a balance. It works only to a certain point... then it becomes counterproductive. Diminishing returns, and then backlash.", 
   {}, 
   287565, 
   null, 
   1192225620.0
  ], 
  [
   287643, 
   null, 
   "JakeCJB", 
   "Hm. Well, sure, if you want to believe polls... Yet, there are polls that show lower acceptance.\n \n USA Today/Gallup Poll. Sept. 7-8, 2007. N=1,028 adults nationwide. MoE ± 3.\n \"Do you feel that homosexuality should be considered an acceptable alternative lifestyle or not?\"\n \n 9/7-8/07: 48% said acceptable, 46% said unacceptable and 6% were unsure. \n 5/10-13/07: 57% acceptable, 39% unacceptable and 3% unsure. \n 5/8-11/06: 54%, 41% and 4%. \n 5/2-5/05: 51%, 45% and 4%\n \n CNN/Opinion Research Corporation Poll. May 4-6, 2007. N=1,028 adults nationwide. MoE ± 3. \n \"Which of the following arrangements between gay or lesbian couples do you think should be recognized as legally valid: same-sex marriages, civil unions but not same-sex marriages, or neither same-sex marriages nor civil unions?\"\n \n 5/4-6/07: 24% for marriage, 27% for civil unions, 43% said neither and 6% are unsure. \n 10/27-29/06: 24%, 26%, 45% and 5%\n \n Newsweek Poll conducted by Princeton Survey Research Associates International. March 14-15, 2007. N=1,001 adults nationwide. MoE ± 3.\n \"There has been much talk recently about whether gays and lesbians should have the legal right to marry someone of the same sex. Which of the following comes closest to your position on this issue? Do you support FULL marriage rights for same-sex couples, support civil unions or partnerships for same-sex couples BUT NOT full marriage rights, or do you oppose ANY legal recognition for same-sex couples?\"\n \n 3/14-15/07: 26% said marriage, 24% said civil unions, 44% said neither and 6% were unsure.\n \n Associated Press/AOL poll conducted by Ipsos Public Affairs. Jan. 16-18, 2007. N=1,005 adults nationwide. MoE ± 3.1.\n \"Would you favor or oppose a law that would ban gay marriage, requiring that marriage should be between a man and a woman?\"\n \n 1/16-18/07: 51% said favor, 45% said oppose, 4% were unsure.\n \n Public opinion is not on your side. However, there is a bright side:\n \n Quinnipiac University Poll. Nov. 13-19, 2006. N=1,623 registered voters nationwide. MoE ± 2.4. \n \"Would you support or oppose a law that would allow same-sex couples to form civil unions, giving them many of the legal rights of married couples?\"\n \n 11/13-19/06: 45% said support, 52% said oppose, 4% were unsure \n 12/7-12/04: 45%, 51% and 4% \n 7/18-22/04: 40%, 55%, and 6% \n 3/16-22/04: 40%, 53% and 7%\n\n \n The general trend towards acceptance is clear. Keep living under a rock if you wish.", 
   {}, 
   287616, 
   null, 
   1192232160.0
  ], 
  [
   287644, 
   null, 
   "Sigma", 
   "The general trend towards acceptance is clear. Keep living under a rock if you wish.\n\n \n lol wut?\n \n Your \"upward trend\" didn't even reach the high it hit in 2002 and now it's spiked downward again.", 
   {}, 
   287643, 
   null, 
   1192232640.0
  ], 
  [
   287653, 
   null, 
   "JakeCJB", 
   "lol wut?\n \n Your \"upward trend\" didn't even reach the high it hit in 2002 and now it's spiked downward again.\n\n \n No, it hasn't spiked down again. Stay tuned. You are living in a changing world.", 
   {}, 
   287644, 
   null, 
   1192235160.0
  ], 
  [
   287664, 
   null, 
   "Sigma", 
   "No, it hasn't spiked down again. Stay tuned. You are living in a changing world.\n\n \n To the question: Do you feel that homosexuality should be considered an acceptable alternative lifestyle or not\n \n It has gone down in the most recent data.", 
   {}, 
   287653, 
   null, 
   1192237020.0
  ], 
  [
   287768, 
   null, 
   "lesz", 
   "Like I said, there is a balance. It works only to a certain point... then it becomes counterproductive. Diminishing returns, and then backlash.\n\n \n There is no legitimate compromise on civil rights. Backlashes do not last forever, and they are an inevitable part of the process -- two steps forward, one step back. If we go back to a pre-gay rights society today, most people would be very uncomfortable with the consequences, so they aren't going to go there.", 
   {}, 
   287618, 
   null, 
   1192363500.0
  ], 
  [
   287774, 
   null, 
   "samiinh", 
   "There is no legitimate compromise on civil rights. Backlashes do not last forever, and they are an inevitable part of the process -- two steps forward, one step back. If we go back to a pre-gay rights society today, most people would be very uncomfortable with the consequences, so they aren't going to go there.\n\n \n I read yesterday that 195 corporations now have received a 100% from HRC regarding gblt issues. That is up from 3 in 2003. Things are quietly improving.", 
   {}, 
   287768, 
   null, 
   1192370820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  School District Bans Diversity Video Because It Includes Gay Couples", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10316-school-district-bans-diversity-video-because-includes-gay-couples.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10316, 
  "discussion_files": [
   [
    "17581.html", 
    "http://www.4forums.com/political/gay-rights-debates/10316-school-district-bans-diversity-video-because-includes-gay-couples-print.html"
   ], 
   [
    "17582.html", 
    "http://www.4forums.com/political/gay-rights-debates/10316-school-district-bans-diversity-video-because-includes-gay-couples-8-print.html"
   ], 
   [
    "17583.html", 
    "http://www.4forums.com/political/gay-rights-debates/10316-school-district-bans-diversity-video-because-includes-gay-couples-6-print.html"
   ], 
   [
    "17584.html", 
    "http://www.4forums.com/political/gay-rights-debates/10316-school-district-bans-diversity-video-because-includes-gay-couples-4-print.html"
   ], 
   [
    "17585.html", 
    "http://www.4forums.com/political/gay-rights-debates/10316-school-district-bans-diversity-video-because-includes-gay-couples-5-print.html"
   ], 
   [
    "17586.html", 
    "http://www.4forums.com/political/gay-rights-debates/10316-school-district-bans-diversity-video-because-includes-gay-couples-7-print.html"
   ], 
   [
    "17587.html", 
    "http://www.4forums.com/political/gay-rights-debates/10316-school-district-bans-diversity-video-because-includes-gay-couples-3-print.html"
   ], 
   [
    "17588.html", 
    "http://www.4forums.com/political/gay-rights-debates/10316-school-district-bans-diversity-video-because-includes-gay-couples-2-print.html"
   ]
  ], 
  "identifier": 10316
 }
]