[
 [
  [
   17217, 
   null, 
   "TheoMorphic", 
   "At least in the united state... \n \n \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\"\n \n a well regulated militia. Does this still apply today? The United States controls the most powerful military force in the world, probably the most powerful military force to date. \n \n US citizens have been allowed to bear arms, however only limited to handguns, rifles, and some assault weapons (not sure about the last). \n \n The original scope of the second amendment was so that US citizens could overthrow their government in case it got out of hand. That seems a little strange now. how could such a weak untrained \"army\" possibly overthrow the strongest military force the world has ever seen? \n \n Is the second amendment outdated? and if it is, what's the point in keeping it?", 
   {
    "post_info": {
     "post_title": "Outdated"
    }
   }, 
   null, 
   null, 
   1064482320.0
  ], 
  [
   17228, 
   null, 
   "montalban", 
   "Also, despite the fact that it says \"Shall not be infringed\" many people still claim that the 2nd Amendment is an absolute; but they make exceptions. This seems to be a bit of having a way of saying \"I want to carry guns when I want\"... because this right is voluntarily waived by people when they board an aeroplane.\n \n If you say \"Shall not be infringed\" it suggests that there can't be a law made to undermine this law. Yet I believe that there are laws preventing you from carrying a gun onto an aeroplane, or onto school grounds.\n \n When it says \"arms\" surely hand-grenades are better arms, and ipso facto would help further protect your Joe Schmoe from the machinations of the government.\n \n I wonder, how do all the other democracies manage to survive without the protection of a heavily armed citizenry? Does this mean that the found fathers of America realised that they were not to be trusted?\n \n Recently I purchased the Oscar-winning documentary \"Bowling For Columbine\". I would highly recommend it to anyone interested in this topic.", 
   {}, 
   17217, 
   null, 
   1064488380.0
  ], 
  [
   17238, 
   null, 
   "Rev. HellH0und", 
   "At least in the united state... \n \n \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\"\n \n a well regulated militia. Does this still apply today? The United States controls the most powerful military force in the world, probably the most powerful military force to date. \n \n\n \n Yes as the law defines the militia as:\n \n according to sec. 311\n \n \"The militia of the United States consists of all able-bodied\n males at least 17 years of age and, except as provided in section\n 313 of title 32, under 45 years of age who are, or who have made a\n declaration of intention to become, citizens of the United States... \"\n \n It then goes on to describe organized and unorganized. not \"well regulated\" and \"not so well regulated\".\n \n Its unconstantutionalality aside (in regards to women) it clearly defines the people as the militia. \n \n \n \n Well-Regulated:\n \n \"More on the militia and the term \"Well Regulated\"..\n \n From The Oxford English Dictionary during the times of the writing of the 2nd amendment:\n \n 1709: \"If a liberal Education has formed in us well-regulated Appetites and worthy Inclinations.\"\n \n 1714: \"The practice of all well-regulated courts of justice in the world.\"\n \n 1812: \"The equation of time ... is the adjustment of the difference of time as shown by a well-regulated clock and a true sun dial.\"\n \n 1848: \"A remissness for which I am sure every well-regulated person will blame the Mayor.\"\n \n 1862: \"It appeared to her well-regulated mind, like a clandestine proceeding.\"\n \n 1894: \"The newspaper, a never wanting adjunct to every well-regulated American embryo city.\"\n \n The phrase \"well-regulated\" was in common use long before 1789, and remained so for a century thereafter. It referred to the property of something being in proper working order. Something that was well-regulated was calibrated correctly, functioning as expected. Establishing government oversight of the people's arms was not the intent in using the phrase in the 2nd amendment, it was precisely the opposite to render the government powerless to do so.\"\n \n \n \n\n US citizens have been allowed to bear arms, however only limited to handguns, rifles, and some assault weapons (not sure about the last). \n \n\n \n Unconstitutionally limited since 1934...\n \n \n\n The original scope of the second amendment was so that US citizens could overthrow their government in case it got out of hand. That seems a little strange now. how could such a weak untrained \"army\" possibly overthrow the strongest military force the world has ever seen? \n \n Is the second amendment outdated? and if it is, what's the point in keeping it?\n\n \n Your position betrays you... Not advocating the overthrow of any government but how could the \"weak untrained\" militia army prevail at lexington? Are you saying that you submit to servitude? Are you saying that our government is out of hand but too powerful? Because one lacks the training and fortitude to jealously guard and defend liberty at all costs... Does not mean that trait applies to all... remember the phrase \"Our lives, Our fortunes, Our sacred honor\"? \n \n \n Oh jeez that pesky 1st amendment is outdated too should we get rid of that one too? What about that 9th... That one give too much unchecked freedom.... This is sad....\n \n Samuel Adams once said:\n \n \"If ye love wealth greater than liberty, the tranquility of servitude\n greater than the animating contest for freedom, go home from us in peace.\n \n We seek not your counsel, nor your arms. Crouch down and lick the hand\n that feeds you; May your chains set lightly upon you, and may posterity\n forget that ye were our countrymen.\"\n \n \n This is something to think about.", 
   {}, 
   17217, 
   null, 
   1064501400.0
  ], 
  [
   17258, 
   null, 
   "montalban", 
   "Is the second amendment outdated? and if it is, what's the point in keeping it?\n\n \n Quite clearly the answer is yes, it is outdated. Especially when American citizens calim that it is an absolute right, yet have surrendered that right to both government and to private enterprises.\n \n It's a wonder that Americans can feel 'free' at all!", 
   {}, 
   17217, 
   null, 
   1064506680.0
  ], 
  [
   17262, 
   null, 
   "AMD4EVER", 
   "It's a wonder that Americans can feel 'free' at all!\n\n \n You really get stuck on this freedom stuff. Freedom cannot ever be absolute because that would be anarchy. There would be no one having any control over anything. In order to have a society that works you either need 100% of your people to be willing to do their part for that society or you need laws that restrict people from doing things that are bad for the society. Can anyone really feel free unless they have the right to kill whoever they want to kill without fear of consequences? I would say that yes we can feel free without having absolute freedom.", 
   {}, 
   17258, 
   null, 
   1064507280.0
  ], 
  [
   17281, 
   null, 
   "DHard3006", 
   "At least in the united state... \n \n \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\"\n \n a well regulated militia. Does this still apply today? The United States controls the most powerful military force in the world, probably the most powerful military force to date. \n \n US citizens have been allowed to bear arms, however only limited to handguns, rifles, and some assault weapons (not sure about the last). \n \n The original scope of the second amendment was so that US citizens could overthrow their government in case it got out of hand. That seems a little strange now. how could such a weak untrained \"army\" possibly overthrow the strongest military force the world has ever seen? \n \n Is the second amendment outdated? and if it is, what's the point in keeping it?\n\n \n \n Ask the British how an out gunned group of people defeated them!\n \n Ask the US government how an out gunned group of people defeated them!\n \n No right is ever outdated! Of course if a hate groups such as the gun haters want to ban a right they will claim this! \n \n One thing about the gun haters attempts to ban the right to bear arms does not do is deal with the criminals. \n \n Criminals say it is outdated. Why? Simple, which criminals wants to run into an well armed victim? \n \n Gun hater logic is criminals will obey gun bans!", 
   {}, 
   17217, 
   null, 
   1064511720.0
  ], 
  [
   17302, 
   null, 
   "TheoMorphic", 
   "I wonder, how do all the other democracies manage to survive without the protection of a heavily armed citizenry? Does this mean that the found fathers of America realised that they were not to be trusted?\n\n \n YES! the founding fathers realized government was to serve the people it governed. With out a set of rules that limited the government it would run wild (as england did). They made the bill of rights and constitution so that it would limit the government (to keep it from becoming too powerful, and overstepping it's bounds). And the only way the constitution could actually be enforced was for the population to uphold it.\n \n Back in the time of it's writing they probably saw the best way for a population to force a government to not over step it's bounds was to force it... er... by force.\n \n Today in the information age, a much better weapon is our right to vote. Sweeping changes can be implemented with out the use of force using the system. \n \n \nRecently I purchased the Oscar-winning documentary \"Bowling For Columbine\". I would highly recommend it to anyone interested in this topic.\n\n \n that movie was so full of propaganda and spin i'm not sure how anyone could take it seriously. It made some good points, but some of the scenes were just XXXX.", 
   {}, 
   17228, 
   null, 
   1064517480.0
  ], 
  [
   17303, 
   null, 
   "TheoMorphic", 
   "Unconstitutionally limited since 1934...\n\n \n did the founding fathers originally want all citizens to have the right to bear\n ANY type of weapon ever developed? Considering the time frame of when the right was written it's reasonable to conclude that they only meant for the weapons that were available at the time. \n \n \nAre you saying that you submit to servitude? Are you saying that our government is out of hand but too powerful? Because one lacks the training and fortitude to jealously guard and defend liberty at all costs... Does not mean that trait applies to all... remember the phrase \"Our lives, Our fortunes, Our sacred honor\"? \n\n \n I'm saying there are OTHER ways of changing the government. Force is not the best, or only way to do it. Our government is in need of change... I doubt you'll deny that... does that mean you're up in arms about the changes? Or does that mean you make sure that you get to the polls come election day? How many petitions have you signed? How many marches on Washington have to participated in? How many letters to your local congressman, senator, governor, or president have you mailed? How many flags have you burnt? How many peaceful demonstrations have you participated in? Compare all these actions to the number of times you have wielded a weapon against our government.\n Compare all the peaceful actions that OTHER people have participated in with the number of times weapons have been wielded against the government by the people it served.", 
   {
    "unicode_changes_made": true
   }, 
   17238, 
   null, 
   1064518140.0
  ], 
  [
   17305, 
   null, 
   "TheoMorphic", 
   "Ask the British how an out gunned group of people defeated them!\n \n Ask the US government how an out gunned group of people defeated them!\n\n \n are you suggesting individuals in the US can defeat the US military using hand guns, rifles, and possibly assault weapons?\n \n \nOne thing about the gun haters attempts to ban the right to bear arms does not do is deal with the criminals.\n\n \n To deal with criminals was not the original purpose of the second amendment. If it is decided that that is the new reason for the second amendment, why don't we change it? \n \n \"A well armed citizen, being necessary to protect themselves, the right of the people to keep and bear arms, shall not be infringed.\"\n \n \nCriminals say it is outdated. Why? Simple, which criminals wants to run into an well armed victim?\n\n \n are you calling me a criminal?", 
   {}, 
   17281, 
   null, 
   1064518680.0
  ], 
  [
   17308, 
   null, 
   "Rev. HellH0und", 
   "did the founding fathers originally want all citizens to have the right to bear\n ANY type of weapon ever developed? Considering the time frame of when the right was written it's reasonable to conclude that they only meant for the weapons that were available at the time. \n \n\n \n equal to that of potentially tyrannical governments..... yes... This century alone tyranical governments murdered, killed, etc.. over 170 million people as people have done so prior to 1934. \n \n \n \n\n I'm saying there are OTHER ways of changing the government. Force is not the best, or only way to do it. Our government is in need of change... I doubt you'll deny that... does that mean you're up in arms about the changes? Or does that mean you make sure that you get to the polls come election day? How many petitions have you signed? How many marches on Washington have to participated in? How many letters to your local congressman, senator, governor, or president have you mailed? How many flags have you burnt? How many peaceful demonstrations have you participated in? Compare all these actions to the number of times you have wielded a weapon against our government.\n Compare all the peaceful actions that OTHER people have participated in with the number of times weapons have been wielded against the government by the people it served.\n\n \n \n 1. look at my tag line I am involved in the \"Free State Project\" a member of the NRA and GOA I am a member of a universal \"freedom movment\" for \"Liberty in our Lifetime\" that has been taken away from us since the early 1900's big government push.\n \n 2. Not only do I vote I run for various offices locally under the Libertarian party. \n \n 3. I do not put my name on anything I can avoid that the government collects. Petitions included. \n \n 4. I see no point in burning a flag (a UN flag to start my grill maybe).\n \n 5. Do you know what happens to your letter you write that congresscritter? An aide reads it and sends an autoreply. \"they\" are \"much to important\" to personally address your letter. \n \n 6. Marching as in protesting.... like these fools? Protest Warrior video download page No thank you, These mindless drones are tools of the Socialists.\n \n 7. I am not \"up in arms\" if you mean I am sitting in a bunker with a wwII howitzer waiting for TEOTWAWKI? Nope. Do I suggest that constitution minded people exercise thier rights publicly (shooting ranges, letters to editors of LOCAL media, etc) to let the government know that the constitution is not negotiable.. You betcha. \n \n Quite frankly it is rather arrogant that you think 200 some odd years led to societal enlightenment.. After the smoke cleared let me ask you what did the branch dividians actually do? Remember the Sarjevo olympics? If you told a bosnian that their government would try to exterminate them in a few years they would have laughed at you...", 
   {
    "unicode_changes_made": true
   }, 
   17303, 
   null, 
   1064520840.0
  ], 
  [
   17364, 
   null, 
   "kelvin90701", 
   "\n \n Recently I purchased the Oscar-winning documentary \"Bowling For Columbine\". I would highly recommend it to anyone interested in this topic.\n\n \n \"Bowling is fiction. It makes its points by deceiving and by misleading the viewer. Statements are made which are false. Moore leads the reader to draw inferences which he must have known were wrong. Indeed, even speeches shown on screen are heavily edited, so that sentences are assembled in the speaker's voice, but which he never uttered. Bowling uses deliberate deception as its primary tool of persuasion and effect.\" -\n \n http://www.liberalvalues.org.nz/archive/civil_liberties/bowling_for_columbine_fiction.html\n \n When you saw Chuck Heston raise the musket and say, \"From my cold dead hands\", did you think he said that at Denver? Is that the message that B for C was trying to say?\n \n \"Fact: Heston's \"cold dead hands\" speech, which leads off Moore's depiction of the Denver meeting, was not given at Denver after Columbine. It was given a year later in Charlotte, North Carolina\"\n \n So what was Moore trying to say when he spliced Columbine shootings and Chuck Heston's speech together? Would a real documentry do that?", 
   {}, 
   17228, 
   null, 
   1064547720.0
  ], 
  [
   17366, 
   null, 
   "DHard3006", 
   "are you suggesting individuals in the US can defeat the US military using hand guns, rifles, and possibly assault weapons?\n \n \n \n To deal with criminals was not the original purpose of the second amendment. If it is decided that that is the new reason for the second amendment, why don't we change it? \n \n \"A well armed citizen, being necessary to protect themselves, the right of the people to keep and bear arms, shall not be infringed.\"\n \n \n \n are you calling me a criminal?\n\n \n The 2nd amend gives one reason to bear arms, the right of the people to keep and bear arms! The very same words are used in the 1st amend. the right of the people! This is the part of the 2nd amend gun haters have a problem with. \n \n C-note go play your games some where else! \n \n By the way criminals like you say it is out dated!", 
   {}, 
   17305, 
   null, 
   1064548380.0
  ], 
  [
   17368, 
   null, 
   "kelvin90701", 
   "Quite clearly the answer is yes, it is outdated. Especially when American citizens calim that it is an absolute right, yet have surrendered that right to both government and to private enterprises.\n \n It's a wonder that Americans can feel 'free' at all!\n\n \n If you mean court houses: a fair trail can not be possible with guns in a courthouse. The accused has the Constitutional right to a fair trial. The threat to an accused rights is immediate in the courthouse. The accused is at risk for loosing all rights to freedom, life, liberty, and property.\n \n Are you still trying to persuade me that anyone can bring a gun into my private property. The answer is no. My property rights are vioalted by people who are not approved by me to bring arms on to my property. Their rights are not violated, strangers can go somewhere else.\n \n It is obvious you do not understand our Constitution. There are compeating rights between people. On private property, the owner is the final word on your 2nd Amendment rights. In a courthouse the accused has more at risk. I am not making this up, this is how it works.\n \n You argue that just because I am not God and do what ever I please, that I do not have PRIVILEDGE to carry firearms on private property and courthouse, that I do not have them at all? Please explain. Is that what you are saying?", 
   {}, 
   17258, 
   null, 
   1064548560.0
  ], 
  [
   17370, 
   null, 
   "kelvin90701", 
   "BTW. Your overall tone has been WE are superior. Do it our way. Is that your argument? Is that what you are implying? That YOU are better than Americans and gun owners?", 
   {}, 
   17368, 
   null, 
   1064548740.0
  ], 
  [
   17395, 
   null, 
   "montalban", 
   "BTW. Your overall tone has been WE are superior. Do it our way. Is that your argument? Is that what you are implying? That YOU are better than Americans and gun owners?\n\n \n My posts are not meant to project smugness. All I'd like to say is that systems operate, other than your own; It is possible to be a democracy without everyone carrying around a 9mm.\n \n That is why I also give examples of other countries such as Great Britain and New Zealand (both of whom have a general police force that is itself unarmed).\n \n I say this because the was an argument put forward to suggest that without a heavily armed citizenry, the people could be oppressed. So, rather than deal with a hypothetical - what if this happened in the USA, I thought I'd look to where there are actual cases of democracies with unarmed citizens.\n \n There are differing degrees of gun control. Canada has a fair few guns... but I don't believe it's a 'constitutional' issue.\n \n However, the large amount of small arms in the USA must have something to do with the large amount of deaths by small-arms", 
   {}, 
   17370, 
   null, 
   1064552760.0
  ], 
  [
   17400, 
   null, 
   "kelvin90701", 
   "My posts are not meant to project smugness. All I'd like to say is that systems operate, other than your own; It is possible to be a democracy without everyone carrying around a 9mm.\n \n That is why I also give examples of other countries such as Great Britain and New Zealand (both of whom have a general police force that is itself unarmed).\n \n I say this because the was an argument put forward to suggest that without a heavily armed citizenry, the people could be oppressed. So, rather than deal with a hypothetical - what if this happened in the USA, I thought I'd look to where there are actual cases of democracies with unarmed citizens.\n \n There are differing degrees of gun control. Canada has a fair few guns... but I don't believe it's a 'constitutional' issue.\n \n However, the large amount of small arms in the USA must have something to do with the large amount of deaths by small-arms\n\n \n Well were are fine thank you very much. If we did it any other way then we would not be Americans.\n \n The UK police are not unarmed. Just as the government takes civilian guns away. They were giving them to cops:\n \n http://www.guardian.co.uk/Archive/Article/0,4273,4099970,00.html\n \n They are carrying full auto machine guns on patrol. Even US cops on patrol do not carry machine guns.\n \n \"On Monday in Brixton, south London, 28-year old Derek Bennett was shot six times by an officer who thought he was armed.\"\n \n http://www.wsws.org/articles/2001/jul2001/shot-j23.shtml\n \n Don't trust the cops to be in your best interest. Authority is authority. Authority is not in the business of charity, nurture, or progressiveness. Authority is about control. At all levels, from the PIG cop giving tickets for kicks, to tyranical rape and murder; authority is about control. Ask any cop from any country. They will tell you, when they put on a uniform, something \"magical\" happens. It is the semblance and air of AUTHORITY. Do you really think politicians enter politics for \"public good\". They all want the office, they want the bearing of the office, they want PRIVILEDGES of office. If they want to be about charity and public good, they why aren't they working for charities? Why aren't they working in labs to cure cancer? Why aren't they in soup kitchens? Why aren't they clegry? Because none of those idealist efforts offer the priviledges, bearing, and authority of office. Come on, you know they want it. No matter what country your from or what political system, you know they want it.\n \n Firearms are not a necessary requirement for freedom. They are a necessary requirement for fighting oppression. I am quite happy to have my politicians and elected represenatives fear me. They are my servants. When people in power do not fear citizens, then people in power have a writ to try anything. Soviets had a meaningless Constitution. Every oppressed industrial government in modern times had a government that had no fear of represials from citizens.", 
   {}, 
   17395, 
   null, 
   1064555460.0
  ], 
  [
   17433, 
   null, 
   "TheoMorphic", 
   "hey all want the office, they want the bearing of the office, they want PRIVILEDGES of office.\n\n \n while I'm not quite as paranoid as you, I totally agree with you in that the government is our servant. And the only way to keep it in servitude is to force it to follow the rules. I have no desire to arm myself, however I can see where you're coming from. \n \n I'm not actually seeking to repeal the second amendment... I'de prefer to see current legislation enforced before any more laws are passed. My problem is that the main argument for not repealing the second amendment I see is that it's for protection in your own home, or protection from criminals. If that were the only reason to keep the second amendment then it is outdated, and should be changed.", 
   {
    "unicode_changes_made": true
   }, 
   17400, 
   null, 
   1064567220.0
  ], 
  [
   17435, 
   null, 
   "montalban", 
   "while I?m not quite as paranoid as you, I totally agree with you in that the government is our servant. And the only way to keep it in servitude is to force it to follow the rules. I have no desire to arm myself, however I can see where you?re coming from. \n\n \n I'm not sure that most politicians are about taking rights away from people. Those that are corrupt tend to be after your money. It's not a matter of \"Your money or your rights\".\n \n \n \nI?m not actually seeking to repeal the second amendment? I?de prefer to see current legislation enforced before any more laws are passed. My problem is that the main argument for not repealing the second amendment I see is that it?s for protection in your own home, or protection from criminals. If that were the only reason to keep the second amendment then it is outdated, and should be changed.\n\n \n This is the part I don't understand. Another few posters are talking about guns means protection\n a) from other people\n b) from the government\n \n on the first issue, it seems clear by what others have said that a 17 year old can be part of the militia. But, when he/she goest to school he's/she's without the protection of his/her own guns.\n \n So, why do Americans, if this is such a big issue, not want to afford to their kids the same protection that they themselves seem to require. Or is it because\n a) they're not as threatened with violence\n or\n b) parents deem that they are sufficiently protected by the police?\n \n If it's the later then I think that they themselves should be sufficiently protected too!\n \n On another note, if people don't want outsiders talking about this issue, then they should put some kind of access limitation on this board.\n \n Even if I were American, it seems I'd also have to own a gun too, before I'd be allowed to comment.", 
   {}, 
   17433, 
   null, 
   1064568780.0
  ], 
  [
   17455, 
   null, 
   "kelvin90701", 
   "I'm not sure that most politicians are about taking rights away from people. Those that are corrupt tend to be after your money. It's not a matter of \"Your money or your rights\".\n \n \n \n \n This is the part I don't understand. Another few posters are talking about guns means protection\n a) from other people\n b) from the government\n \n on the first issue, it seems clear by what others have said that a 17 year old can be part of the militia. But, when he/she goest to school he's/she's without the protection of his/her own guns.\n \n So, why do Americans, if this is such a big issue, not want to afford to their kids the same protection that they themselves seem to require. Or is it because\n a) they're not as threatened with violence\n or\n b) parents deem that they are sufficiently protected by the police?\n \n If it's the later then I think that they themselves should be sufficiently protected too!\n \n On another note, if people don't want outsiders talking about this issue, then they should put some kind of access limitation on this board.\n \n Even if I were American, it seems I'd also have to own a gun too, before I'd be allowed to comment.\n\n \n ALL governemnts eventaully collaspe. There is no such thing permant government. The United States of America will end someday. When it does it will typically go down as many government do, with chaos and destruction. If were lucky it will happen peacfully. It is not \"if\" the government of the USA will end, it \"when\" will it end. The Second Amendment can never be outdated. It is waiting for day day when the USA ends.", 
   {}, 
   17435, 
   null, 
   1064589000.0
  ], 
  [
   17458, 
   null, 
   "montalban", 
   "ALL governemnts eventaully collaspe. There is no such thing permant government. The United States of America will end someday. When it does it will typically go down as many government do, with chaos and destruction. If were lucky it will happen peacfully. It is not \"if\" the government of the USA will end, it \"when\" will it end. The Second Amendment can never be outdated. It is waiting for day day when the USA ends.\n\n \n That's actually rather insightful, about the US ending. All empires do. The Brits in the 1920s would have believed that they'd be ruling India for a few more hundred years to come.\n \n Who would fill the vacuum? China? Indonesia? India?\n \n We have the mineral resources, but not the population to become super. Even though we're the same size geographically to mid-continental USA, we don't have the arable land area.\n \n Indonesia probably has too many people.\n \n My money would be on India or China.", 
   {}, 
   17455, 
   null, 
   1064590380.0
  ], 
  [
   17508, 
   null, 
   "kelvin90701", 
   "That's actually rather insightful, about the US ending. All empires do. The Brits in the 1920s would have believed that they'd be ruling India for a few more hundred years to come.\n \n Who would fill the vacuum? China? Indonesia? India?\n \n We have the mineral resources, but not the population to become super. Even though we're the same size geographically to mid-continental USA, we don't have the arable land area.\n \n Indonesia probably has too many people.\n \n My money would be on India or China.\n\n \n If your lucky your government fades away like the UK.\n \n If your not lucky you get Bosnia, rape, murder, and castrations. In 1986 the Balklands hosted the Olympics. Did anyone sitting in the bleachers ever think that in 10 years they would be raped, casterated, or ethinic cleansed? Look around the world. If your government goes away peacefully, your are indeed very very lucky. The norm when a government collaspes is rape, murder, and castrations.", 
   {}, 
   17458, 
   null, 
   1064615160.0
  ], 
  [
   17546, 
   null, 
   "kelvin90701", 
   "while I'm not quite as paranoid as you, I totally agree with you in that the government is our servant. And the only way to keep it in servitude is to force it to follow the rules. I have no desire to arm myself, however I can see where you're coming from. \n \n I'm not actually seeking to repeal the second amendment... I'de prefer to see current legislation enforced before any more laws are passed. My problem is that the main argument for not repealing the second amendment I see is that it's for protection in your own home, or protection from criminals. If that were the only reason to keep the second amendment then it is outdated, and should be changed.\n\n \n In the USA we have two ways to make our government our servant:\n \n 1) Vote\n 2) Fear of getting shot.\n \n Take away fear of getting shot. Then is becomes sooooo easy to take away voting.", 
   {
    "unicode_changes_made": true
   }, 
   17433, 
   null, 
   1064624760.0
  ], 
  [
   17548, 
   null, 
   "kelvin90701", 
   "\n \n on the first issue, it seems clear by what others have said that a 17 year old can be part of the militia. But, when he/she goest to school he's/she's without the protection of his/her own guns.\n .\n\n \n Your not part of the militia at 17, it starts at 18. You can not buy a handgun at 17. You can not vote at 17. You can not legally sign contracts at 17. You legally be held responsible for yourself at 17. At 17 your not a full citizen.", 
   {}, 
   17435, 
   null, 
   1064625000.0
  ], 
  [
   17553, 
   null, 
   "kelvin90701", 
   "did the founding fathers originally want all citizens to have the right to bear\n ANY type of weapon ever developed? Considering the time frame of when the right was written it's reasonable to conclude that they only meant for the weapons that were available at the time. \n \n \n .\n\n \n The framers had in mind modern military weapons. \n \n You do not need nukes or F-16s to fight a well organized army. The Iraqi are doing just fine against the 101st Airbourne right now. The Iraqi are doing it with what the can carry in thier pockets and on thier back. If the Iraqi can keep up the fight 2 maybe 3 more years, they will win.", 
   {
    "unicode_changes_made": true
   }, 
   17303, 
   null, 
   1064625720.0
  ], 
  [
   17604, 
   null, 
   "Rev. HellH0und", 
   "That's actually rather insightful, about the US ending. All empires do. The Brits in the 1920s would have believed that they'd be ruling India for a few more hundred years to come.\n \n Who would fill the vacuum? China? Indonesia? India?\n \n We have the mineral resources, but not the population to become super. Even though we're the same size geographically to mid-continental USA, we don't have the arable land area.\n \n Indonesia probably has too many people.\n \n My money would be on India or China.\n\n \n \n Kelvin,\n \n I can't (actually its no suprise) believe he missed this. His Anti-American ways and his Aussie pride are so laughable I wonder what other Aussies would think of this. What this yonder Aussie did not realize in your post is that the difference between the countries he named and ours is the 650 million guns in our country to help transition any tyrannical regieme. A communist country such as china is DOOMED from the start. Indonesia is a bunch of Islands and India while economicly growing is rather stagnant in government world issues. (cept thier own rift with the Paki's) notice too how all his choices of the victors over the \"American Imperialist scum\" (as I am sure thats what he believes) are countries closets to Austrailia yet he does not even have enough faith in his own country that is light years ahead of India, Indonesia, and even China in military tactics, and is probably second only to India in the lowest amount of oppressive socialism raping that country. Or is it that he is so short sighted that he was unwilling to spin the globe to pick the \"probable next world power\"? \n \n \n \n Hey Monty! This is an American story, not an Austrailian story. emoticon_xkill \n \n \n MOLON LABE!", 
   {}, 
   17458, 
   null, 
   1064671860.0
  ], 
  [
   17606, 
   null, 
   "montalban", 
   "Kelvin,\n \n I can't (actually its no suprise) believe he missed this. His Anti-American ways and his Aussie pride are so laughable I wonder what other Aussies would think of this. What this yonder Aussie did not realize in your post is that the difference between the countries he named and ours is the 650 million guns in our country to help transition any tyrannical regieme. A communist country such as china is DOOMED from the start. Indonesia is a bunch of Islands and India while economicly growing is rather stagnant in government world issues. (cept thier own rift with the Paki's) notice too how all his choices of the victors over the \"American Imperialist scum\" (as I am sure thats what he believes) are countries closets to Austrailia yet he does not even have enough faith in his own country that is light years ahead of India, Indonesia, and even China in military tactics, and is probably second only to India in the lowest amount of oppressive socialism raping that country. Or is it that he is so short sighted that he was unwilling to spin the globe to pick the \"probable next world power\"? \n \n \n \n Hey Monty! This is an American story, not an Austrailian story. \n \n\n \n Where does this forum say \"Americans only\"\n \n I was agreeing with Kelvin, and you butt-in. So much for your version of manners... nosey-ness only works one way. (Ni de do ghno e!)\n \n Kelvin suggested that one day America would fall. I agreed. It is inevitable. It is not anti-American. All empires rise, and then they fall.\n \n I was speculating on what might be next global power. It is called an hypothesis. It is not anti-American. \n \n To say that America will go on forever is stupid.\n \n So please come down from your high-horse for a moment, you're frothing at the mouth.\n \n Lastly, you seem quite happy to join in and make comments about China, India, Australia etc. Or is that an American constiutional right too?", 
   {}, 
   17604, 
   null, 
   1064674020.0
  ], 
  [
   17612, 
   null, 
   "kelvin90701", 
   "Where does this forum say \"Americans only\"\n \n I was agreeing with Kelvin, and you butt-in. So much for your version of manners... nosey-ness only works one way. (Ni de do ghno e!)\n \n Kelvin suggested that one day America would fall. I agreed. It is inevitable. It is not anti-American. All empires rise, and then they fall.\n \n I was speculating on what might be next global power. It is called an hypothesis. It is not anti-American. \n \n To say that America will go on forever is stupid.\n \n So please come down from your high-horse for a moment, you're frothing at the mouth.\n \n Lastly, you seem quite happy to join in and make comments about China, India, Australia etc. Or is that an American constiutional right too?\n\n \n So, what guarantee do you have that you will not be castrated 10 years from now? Remember the people of the Balklands were watching the Olympics in the stands together. Did any of them in the stands have the idea that in 10 years they would be raped or castrated?", 
   {}, 
   17606, 
   null, 
   1064678580.0
  ], 
  [
   17613, 
   null, 
   "kelvin90701", 
   "So, what guarantee do you have that you will not be castrated 10 years from now? Remember the people of the Balklands were watching the Olympics in the stands together. Did any of them in the stands have the idea that in 10 years they would be raped or castrated?\n\n \n Oh BTW, men can be raped too.", 
   {}, 
   17612, 
   null, 
   1064678640.0
  ], 
  [
   17620, 
   null, 
   "Rev. HellH0und", 
   "Where does this forum say \"Americans only\"\n \n I was agreeing with Kelvin, and you butt-in. So much for your version of manners... nosey-ness only works one way. (Ni de do ghno e!)\n \n Kelvin suggested that one day America would fall. I agreed. It is inevitable. It is not anti-American. All empires rise, and then they fall.\n \n I was speculating on what might be next global power. It is called an hypothesis. It is not anti-American. \n \n To say that America will go on forever is stupid.\n \n So please come down from your high-horse for a moment, you're frothing at the mouth.\n \n Lastly, you seem quite happy to join in and make comments about China, India, Australia etc. Or is that an American constiutional right too?\n\n \n \n Explain to me how in an open forum it is \"butting in\"? The fact that all \"empires\" fall is fine. Your blatant anti-americanism is not. Your hypothosys was more of a guess form your geo-limited scope... It would be like if you were from Brazil and predicted canada or mexico next. .\n \n I will \"join in\" anytime I see fit. And it would appear that YOU my friend are the one \"frothing at the mouth\" as I stated before forums in my life are a \"trifle\" matter used soley for amusment.\n \n And yes I can make a comment anytime about anything I want. About China, Indonesia, Montana etc. who are you to say it is not my \"American Constitutional right\" (hint it is only the moderators here who have a trump on the constitution as it is thier board.) \n \n So keep up with the sarcasm and the argument from a point of ignorance... Just remember when you suit up in that blue helmet jack-booted uniform that my rifle is sub-MOA.", 
   {}, 
   17606, 
   null, 
   1064698260.0
  ], 
  [
   17621, 
   null, 
   "Rev. HellH0und", 
   "So, what guarantee do you have that you will not be castrated 10 years from now? Remember the people of the Balklands were watching the Olympics in the stands together. Did any of them in the stands have the idea that in 10 years they would be raped or castrated?\n\n \n \n \n Are you kidding me he is already casterated. Suckling on that government sow in his own socialist utopia. All he has left to do is to dismantle the opinions of Americans and the USA. What he does not understand about our constitution is that the rights in it are RECOGNIZED as rights that have always existed! Liberty is a \"foreign\" concept to most.", 
   {}, 
   17612, 
   null, 
   1064698440.0
  ], 
  [
   17668, 
   null, 
   "kelvin90701", 
   " Liberty is a \"foreign\" concept to most.\n\n \n Our concept of liberty if forgein to him. He is 100% Aussie. Typical of liberals in this country, that they know what is good for other people.", 
   {}, 
   17621, 
   null, 
   1064767080.0
  ], 
  [
   17674, 
   null, 
   "Rev. HellH0und", 
   "Our concept of liberty if forgein to him. He is 100% Aussie. Typical of liberals in this country, that they know what is good for other people.\n\n \n \n That is why I say to them:\n \n MOLON LABE!\n \n \n COME AND GET THEM!", 
   {}, 
   17668, 
   null, 
   1064771700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Outdated", 
  "url": "http://www.4forums.com/political/gun-control-debates/1032-outdated.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1032, 
  "discussion_files": [
   [
    "19698.html", 
    "http://www.4forums.com/political/gun-control-debates/1032-outdated-print.html"
   ], 
   [
    "19699.html", 
    "http://www.4forums.com/political/gun-control-debates/1032-outdated-3-print.html"
   ], 
   [
    "19700.html", 
    "http://www.4forums.com/political/gun-control-debates/1032-outdated-2-print.html"
   ]
  ], 
  "identifier": 1032
 }
]