[
 [
  [
   282400, 
   null, 
   "Matthew S", 
   "This month brings all kinds of blessings. It seems boys and girls that another one of our enemies is dead. \n \n http://www.365gay.com/Newscon07/09/090507kennedy.htm\n http://www.washingtonpost.com/wp-dyn/content/article/2007/09/05/AR2007090500789.html\n \n All you munchkins out there, well you know what to do..........\n \n emoticon_xhoho :) emoticon_xbye", 
   {
    "post_info": {
     "post_title": "Another one bites the dust"
    }
   }, 
   null, 
   null, 
   1189028160.0
  ], 
  [
   282403, 
   null, 
   "Steeeeve", 
   "It is posts like this that makes me realize I am not wrong about you or your lifestyle Matthew. \n \n You may praise the death of another but I find that sad and disturbing. I, however, wouldn't praise the death of anyone no matter how much I disliked them.", 
   {}, 
   282400, 
   null, 
   1189030920.0
  ], 
  [
   282404, 
   null, 
   "jyoshu", 
   "You may praise the death of another but I find that sad and disturbing. I, however, wouldn't praise the death of anyone no matter how much I disliked them.\n\n \n Agreed. I didn't agree with everything D. James Kennedy said or his approach either. But I'd never celebrate someone's death like that. Kinda disturbing, really.", 
   {}, 
   282403, 
   null, 
   1189031100.0
  ], 
  [
   282405, 
   null, 
   "Kronus", 
   "It is posts like this that makes me realize I am not wrong about you or your lifestyle Matthew. \n \n\n \n See, that's how we know that you're prejudiced. You can't sperate what Matthew says from the fact that he's gay. Point the finger at him for his hateful attitude all you like, but leave his \"lifestyle\" out of it. He's an individual, just like everybody else, and does not speak for all gays. Just like you don't speak for all straights; I know many who aren't homophobic at all, for example.", 
   {}, 
   282403, 
   null, 
   1189031100.0
  ], 
  [
   282412, 
   null, 
   "Matthew S", 
   "Don't you all understand that another great evil has left the earth? I know steeeeve, and jyoshu that you would both celebrate the death of osama bin laden. Why can you not understand then that to gay people these religious right evil freaks are equlivant to bin laden, especially this evil man, who is one of the promoters of the ex gay movement.", 
   {}, 
   282405, 
   null, 
   1189032480.0
  ], 
  [
   282414, 
   null, 
   "jyoshu", 
   "Don't you all understand that another great evil has left the earth? I know steeeeve, and jyoshu that you would both celebrate the death of osama bin laden. \n\n \n But there's no reasonable comparison between D. James Kennedy and OBL. A more on-track example would be if I celebrated the death of, say, Christopher Hitchens, a clear and unabashed anti-Christian who would prefer Christians not have some of the freedom they do. And no, I would not celebrate his death.", 
   {}, 
   282412, 
   null, 
   1189033200.0
  ], 
  [
   282418, 
   null, 
   "samiinh", 
   "It is posts like this that makes me realize I am not wrong about you or your lifestyle Matthew. \n \n You may praise the death of another but I find that sad and disturbing. I, however, wouldn't praise the death of anyone no matter how much I disliked them.\n\n \n Reminds one of Pat Robertson who wanted the US to assassinate leaders of other countries, and asked his congregation to pray for the deaths of members of the SCOTUS.", 
   {}, 
   282403, 
   null, 
   1189033980.0
  ], 
  [
   282419, 
   null, 
   "samiinh", 
   "But there's no reasonable comparison between D. James Kennedy and OBL. A more on-track example would be if I celebrated the death of, say, Christopher Hitchens, a clear and unabashed anti-Christian who would prefer Christians not have some of the freedom they do. And no, I would not celebrate his death.\n\n \n I wouldn't say I celebrate the death of these evil men, Kennedy and Falwell, but I think America is better off without them.", 
   {}, 
   282414, 
   null, 
   1189034100.0
  ], 
  [
   282423, 
   null, 
   "samiinh", 
   "\"With other dangerous and contagious diseases, all sorts of efforts are made to identify those carrying the disease, and to minimize their contact with the public. And yet, here we have homosexual rights groups working day and night to make sure AIDS victims ARE NOT IDENTIFIED! Until action is taken, AIDS victims are free to infect anyone.\" (Newsletter, 1989)\n \n Another newsletter item featured a photograph of very young children under the headline, \"SEX WITH CHILDREN? HOMOSEXUALS SAY YES!\" The newsletter went on to assert that \"Adult sex with children has been a crucial component of the homosexual movement all along.\"\n \n \"Whatever four members of the Supreme Judicial Court of Massachusetts may say, the intimate coupling of two men or two women is not marriage. It is a pale and misshapen counterfeit that will only serve to empty marriage of its meaning and destroy the institution that is the keystone in the arch of civilization. If homosexuals win the right to 'marry,' expect further similarly argued claims challenging legal barriers to polygamy, bestiality, and child marriage.\" (Center for Reclaiming America for Christ, 10/2003)", 
   {
    "post_info": {
     "post_title": "James Kennedy's Thoughts"
    }
   }, 
   282419, 
   null, 
   1189038660.0
  ], 
  [
   282429, 
   null, 
   "thelmoose", 
   "I don't understand the \"don't speak ill of the dead\" nonsense. The man was a horrible and dangerous creep when alive. His death doesn't improve my opinion of him. How could it? I have had no personal relationship with him and I hated his public behavior so there is no reason I should mourn his passing. While I don't \"celebrate\" his death per se, any circumstance that results in a reduction of his kind of wicked words and deeds, certainly is something I view approvingly. You can't live your life as the bad guy and expect no one to dance on your grave.", 
   {}, 
   282423, 
   null, 
   1189044480.0
  ], 
  [
   282432, 
   null, 
   "Steeeeve", 
   "See, that's how we know that you're prejudiced. You can't sperate what Matthew says from the fact that he's gay. Point the finger at him for his hateful attitude all you like, but leave his \"lifestyle\" out of it. He's an individual, just like everybody else, and does not speak for all gays. Just like you don't speak for all straights; I know many who aren't homophobic at all, for example.\n The only one here prejudice is you. I didn't say anything about him being gay. I said \"lifestyle\" which means the way he lives his life....believe it or not Matthew S is not just a gay person. I find other ways he lives his life to be disturbing such as praising people who died.", 
   {}, 
   282405, 
   null, 
   1189046280.0
  ], 
  [
   282433, 
   null, 
   "Steeeeve", 
   "Don't you all understand that another great evil has left the earth? I know steeeeve, and jyoshu that you would both celebrate the death of osama bin laden. Why can you not understand then that to gay people these religious right evil freaks are equlivant to bin laden, especially this evil man, who is one of the promoters of the ex gay movement.\n\n \n Like I said before I would not celebrate the death of any person...even osama bin laden. There may be evil men out there but to celebrate the death of an evil man is evil as well. It goes along the same lines as doing something evil to achieve good still makes you an evil person.\n \n \nReminds one of Pat Robertson who wanted the US to assassinate leaders of other countries, and asked his congregation to pray for the deaths of members of the SCOTUS.\nExactly, and thats sick.", 
   {}, 
   282412, 
   null, 
   1189046400.0
  ], 
  [
   282434, 
   null, 
   "thelmoose", 
   "But there's no reasonable comparison between D. James Kennedy and OBL. A more on-track example would be if I celebrated the death of, say, Christopher Hitchens, a clear and unabashed anti-Christian who would prefer Christians not have some of the freedom they do. And no, I would not celebrate his death.\n\n \n What freedoms does Christopher Hitchens want to deny Christians? \n \n Also, you characterize his objection to Christianity as \"unabashed\". Why should he be abashed about that? You act like it's a bad thing.", 
   {}, 
   282414, 
   null, 
   1189046580.0
  ], 
  [
   282435, 
   null, 
   "Kronus", 
   "The only one here prejudice is you. I didn't say anything about him being gay. I said \"lifestyle\" which means the way he lives his life....believe it or not Matthew S is not just a gay person. \n\n \n Do you actually expect anyone to buy that line? That his \"lifestyle\" refers to his celebrating someone's death, and not his being gay? You really think anyone is going to believe that's really what you meant? Really?", 
   {}, 
   282432, 
   null, 
   1189046640.0
  ], 
  [
   282436, 
   null, 
   "thelmoose", 
   "Like I said before I would not celebrate the death of any person...even osama bin laden. There may be evil men out there but to celebrate the death of an evil man is evil as well. It goes along the same lines as doing something evil to achieve good still makes you an evil person.\n \n\n \n You would not celebrate Osama being out of the picture? Maybe not throw a party, but a not even a simple \"yippee!\"? \n \n Yeah, right. What a load.", 
   {}, 
   282433, 
   null, 
   1189046760.0
  ], 
  [
   282437, 
   null, 
   "Steeeeve", 
   "Do you actually expect anyone to buy that line? That his \"lifestyle\" refers to his celebrating someone's death, and not his being gay? You really think anyone is going to believe that's really what you meant? Really?\nI honestly don't care what you believe about my comment but the reality is you were prejudice about it while at the same time claiming I was the prejudice one. It honestly makes me laugh because it was that ironic. The simple fact that I rarely/never use the word \"lifestyle\" for \"gay\" would indicate that I meant something different than \"gay\". \n \n Unlike many I use words that I find represent what I try to get across. For those that don't know what the word \"lifestyle\" means I have taken the liberty to post it for you below:\n \n the habits, attitudes, tastes, moral standards, economic level, etc., that together constitute the mode of living of an individual or group.\n http://dictionary.reference.com/browse/lifestyle", 
   {}, 
   282435, 
   null, 
   1189046880.0
  ], 
  [
   282438, 
   null, 
   "thelmoose", 
   "Do you actually expect anyone to buy that line? That his \"lifestyle\" refers to his celebrating someone's death, and not his being gay? You really think anyone is going to believe that's really what you meant? Really?\n\n \n Absolutely. He is backpedaling rather unconvincingly. Who uses the word \"lifestyle\" in that context? In fact, who uses the word lifestyle except homophobes referring to gays?\n \n I really object to the lifestyle of all those death celebrators! What lifestyle could that possibly be?\n \n Pure BS Steve.", 
   {}, 
   282435, 
   null, 
   1189047060.0
  ], 
  [
   282439, 
   null, 
   "Steeeeve", 
   "You would not celebrate Osama being out of the picture? Maybe not throw a party, but a not even a simple \"yippee!\"? \n \n Yeah, right. What a load.\nWould we be better without him in the picture? Probably. Would I be relieved? Sure. Would I be calling his death a \"blessing\" and things of that nature? No. \n \n Keeping this is mind I don't doubt it is natural for people to be happy when an enemy is gone and I am guilty of doing this but I would still say it is wrong to celebrate.\n \n Nevertheless, like I told Kronus I don't really care what you think I would or wouldn't do or what I did or didn't mean.\n \n Edit: For those that prefer a Biblical outlook on this I offer this quote: \"Anyone who claims to be in the light but hates his brother is still in the darkness\"", 
   {}, 
   282436, 
   null, 
   1189047120.0
  ], 
  [
   282442, 
   null, 
   "Matthew S", 
   "\n \n Edit: For those that prefer a Biblical outlook on this I offer this quote: \"Anyone who claims to be in the light but hates his brother is still in the darkness\"\n\n \n \n I never said I hated the man. I hated his actions and words. He was a great evil and a persecutor of gay people. Why should we not celebrate when evil is vanquished? Why should we not celebrate our liberation from evil?", 
   {}, 
   282439, 
   null, 
   1189047900.0
  ], 
  [
   282444, 
   null, 
   "Steeeeve", 
   "I never said I hated the man. I hated his actions and words. He was a great evil and a persecutor of gay people. Why should we not celebrate when evil is vanquished? Why should we not celebrate our liberation from evil?\n\n \n If you call him evil then you hate him.", 
   {}, 
   282442, 
   null, 
   1189047960.0
  ], 
  [
   282445, 
   null, 
   "Kronus", 
   "\n Nevertheless, like I told Kronus I don't really care what you think I would or wouldn't do or what I did or didn't mean.\n \n\n \n Yes, you've gone on at quite some length and detail about how little you care. Odd that. :)", 
   {}, 
   282439, 
   null, 
   1189048140.0
  ], 
  [
   282448, 
   null, 
   "Matthew S", 
   "If you call him evil then you hate him.\n\n \n Touche' emoticon_xagree", 
   {}, 
   282444, 
   null, 
   1189048860.0
  ], 
  [
   282449, 
   null, 
   "Steeeeve", 
   "Touche' emoticon_xagree\nI'm not sure I agree with my statement :) It probably is not just calling a man evil but more like an attitude of joy when others are hurt. Calling a man evil may just be an indicator of hatred towards that person.", 
   {}, 
   282448, 
   null, 
   1189049160.0
  ], 
  [
   282451, 
   null, 
   "Matthew S", 
   "I'm not sure I agree with my statement :) It probably is not just calling a man evil but more like an attitude of joy when others are hurt. Calling a man evil may just be an indicator of hatred towards that person.\n\n \n None the less from my point of view, as a gay man, the man was evil. He practiced and preched evil towards me, my family, and my people. He promoted policies that actively harmed gay people, that is evil. He preached words that hurt gay people, that is evil. He encouraged pactices, such as conversion, that mentally tortured gay people, that is evil. If someone practices harm, preaches hurt, and encourages torture they are evil.\n \n There is nothing morally wrong in being joyful that evil is no more.", 
   {}, 
   282449, 
   null, 
   1189050060.0
  ], 
  [
   282453, 
   null, 
   "Steeeeve", 
   "None the less from my point of view, as a gay man, the man was evil. He practiced and preched evil towards me, my family, and my people. He promoted policies that actively harmed gay people, that is evil. He preached words that hurt gay people, that is evil. He encouraged pactices, such as conversion, that mentally tortured gay people, that is evil. If someone practices harm, preaches hurt, and encourages torture they are evil.\n \n There is nothing morally wrong in being joyful that evil is no more.\n\n \n I disagree. As you know I follow the Bible and it is clear that to hate another or to not love your number is evil. You pretty much are making yourself evil by being joyful for anothers death.", 
   {}, 
   282451, 
   null, 
   1189051080.0
  ], 
  [
   282480, 
   null, 
   "lesz", 
   "Well, these evil folk are like the hydra... cut off one head and two more spring up. There are plenty more James Kennedys where this one came from, alas.\n \n The hope for the future is that the younger generation are not as gay-hating as the older generation, and so the Kennedys of the new generation will not find the fields as fertile for their sowing as James Kennedy did.\n \n As for rejoicing for his death, I rejoice for the death of no man. But i can't mark the death of this one without remarking about his contribution to the hatred of gays in America. It is only a pity he died without repenting his sins against us. Unrepentant and unshriven, there is no redemption for anyone in his death. He learned nothing during life, and passed on nothing worth while to those who survive him.\n \n A sad case.", 
   {}, 
   282453, 
   null, 
   1189081860.0
  ], 
  [
   282483, 
   null, 
   "samiinh", 
   "Actually, it was a blessing that Kennedy died, because his health had deteriorated to the point where life no longer had any quality to it for him.", 
   {}, 
   282480, 
   null, 
   1189084440.0
  ], 
  [
   282498, 
   null, 
   "jyoshu", 
   "I honestly don't care what you believe about my comment but the reality is you were prejudice about it while at the same time claiming I was the prejudice one. It honestly makes me laugh because it was that ironic. The simple fact that I rarely/never use the word \"lifestyle\" for \"gay\" would indicate that I meant something different than \"gay\".\n\n \n Doh, you used the \"L\" word. How dare ye! (tsk, tsk) :p Don't you know? You can't use the term 'lifestyle,' you have to use the description of lifestyle instead. That usually works much better. Gotta know the rules to talk with the gay rights folk here, don't ya know? LOL See, if you use the word, they can't stay on topic and so then your use of the \"L\" word becomes the topic. It's just too damn distracting for 'em.", 
   {}, 
   282437, 
   null, 
   1189095000.0
  ], 
  [
   282512, 
   null, 
   "Kronus", 
   "Doh, you used the \"L\" word. How dare ye! (tsk, tsk) :p Don't you know? You can't use the term 'lifestyle,' you have to use the description of lifestyle instead. That usually works much better. Gotta know the rules to talk with the gay rights folk here, don't ya know? LOL See, if you use the word, they can't stay on topic and so then your use of the \"L\" word becomes the topic. It's just too damn distracting for 'em.\n\n \n Well, what do you want? Bigotry and prejudice are distracting. Someone acts like a bigot and it's kind of hard not to notice, and having noticed how can one not say something about it. You're not suggesting that wrongdoings be ignored now, are you? No, I know you're not. What you're doing is downplaying the wrongdoing, trying to pretend it isn't any sort of a big deal and that anyone who notices it is just silly. Going the old emotional manipulation route rather than the real debate path.\n \n Edit: Oh, and kudos on the misdirect, you had me suckered for a while. The discussion wasn't about how insulting or not the word \"lifestyle\" is, it was about Steve implying that Mathew's hating has to do with his being gay. Nice job on twisting what was said into something you would rather defend against.", 
   {}, 
   282498, 
   null, 
   1189106580.0
  ], 
  [
   282513, 
   null, 
   "thelmoose", 
   "Doh, you used the \"L\" word. How dare ye! (tsk, tsk) :p Don't you know? You can't use the term 'lifestyle,' you have to use the description of lifestyle instead. That usually works much better. Gotta know the rules to talk with the gay rights folk here, don't ya know? LOL See, if you use the word, they can't stay on topic and so then your use of the \"L\" word becomes the topic. It's just too damn distracting for 'em.\n\n \n This is pure BS and you know it. It has nothing to do with whether it's OK to use a word or not. \n \n Recap:\n Matthew was expressing approval that the blithering bible-thumper croaked.\n Steve claimed that this bad behavior confirmed to him what he had thought all along about Matthew's lifestyle.\n \n Anyone with a brain knows he was referring to Matthew being gay.\n Steve lied and said that he meant (obviously) that the lifestyle he was referring to was that lifestyle that gets happy when people die or something (I am not clear on this actually). Clearly a preposterous claim when it was absolutely clear what he was saying: \"See, you gays are really bad after all\". \n \n Why would you even chime in here? What is wrong with you?", 
   {}, 
   282498, 
   null, 
   1189107120.0
  ], 
  [
   282514, 
   null, 
   "Matthew S", 
   "\n Recap:\n Matthew was expressing approval that the blithering bible-thumper croaked.\n Steve claimed that this bad behavior confirmed to him what he had thought all along about Matthew's lifestyle.\n \n \n\n \n It is more like joy rather then approval. The joy is not because the man died but that great evil has departed the earth.", 
   {}, 
   282513, 
   null, 
   1189107480.0
  ], 
  [
   282516, 
   null, 
   "samiinh", 
   "It is more like joy rather then approval. The joy is not because the man died but that great evil has departed the earth.\n\n \n I'd feel the same way if Bush and Cheney were headed to a tribunal on war crimes. Same feeling.", 
   {}, 
   282514, 
   null, 
   1189108500.0
  ], 
  [
   282517, 
   null, 
   "Kronus", 
   "It is more like joy rather then approval. The joy is not because the man died but that great evil has departed the earth.\n\n \n I've said it before and I'll say it again. Being a bit more explicit with that distinction will avoid giving the opponents of gay rights more ammo to use againsts us. They manufacture plently of their own, there's no reason to gift wrap more for them.", 
   {}, 
   282514, 
   null, 
   1189108620.0
  ], 
  [
   282534, 
   null, 
   "jyoshu", 
   "Well, what do you want? Bigotry and prejudice are distracting. Someone acts like a bigot and it's kind of hard not to notice, and having noticed how can one not say something about it. You're not suggesting that wrongdoings be ignored now, are you? No, I know you're not. What you're doing is downplaying the wrongdoing\n\n \n So you think saying the word \"lifestyle\" the way Steeeeve did equates to being a 'bigot'. Call it downplaying if you want, but I think you're 'up-playing' it myself. I think waaaaay too much is made of that word--it wouldn't bother me if someone used the term \"lifestyle\" in context of me being straight. Would it you?\n \n \nThe discussion wasn't about how insulting or not the word \"lifestyle\" is,\n\n \n Exaclty--I have to admit I'm still wondering why you took the thread a different direction with post #4, where you essentially switched topics to Steeeeve being prejudiced. you see, the topic (that you claim) wasn't \"Steve implying that Mathew's hating has to do with his being gay\" [your direction], either.", 
   {}, 
   282512, 
   null, 
   1189112820.0
  ], 
  [
   282535, 
   null, 
   "jyoshu", 
   "This is pure BS and you know it. It has nothing to do with whether it's OK to use a word or not. \n \n Recap:\n Matthew was expressing approval that the blithering bible-thumper croaked.\n Steve claimed that this bad behavior confirmed to him what he had thought all along about Matthew's lifestyle.\n \n Anyone with a brain knows he was referring to Matthew being gay.\n Steve lied and said that he meant (obviously) that the lifestyle he was referring to was that lifestyle that gets happy when people die or something (I am not clear on this actually). Clearly a preposterous claim when it was absolutely clear what he was saying: \"See, you gays are really bad after all\". \n \n Why would you even chime in here? What is wrong with you?\n\n \n Because I see gay rights proponents here all the time making a big issue out of the \"L\" word. Just like you and Kronos have done here by switching topics to him being 'prejudced' over it. I don't use it, but geez, it's not racial epithet or something.", 
   {}, 
   282513, 
   null, 
   1189113180.0
  ], 
  [
   282538, 
   null, 
   "Kronus", 
   "So you think saying the word \"lifestyle\" the way Steeeeve did equates to being a 'bigot'. Call it downplaying if you want, but I think you're 'up-playing' it myself. I think waaaaay too much is made of that word--it wouldn't bother me if someone used the term \"lifestyle\" in context of me being straight. Would it you?.\n\n You know, if you read all of someone's post in one go you might be able to avoid asking questions that were answered in the post you were responding to.\n \n \n\n Exaclty--I have to admit I'm still wondering why you took the thread a different direction with post #4, where you essentially switched topics to Steeeeve being prejudiced. you see, the topic (that you claim) wasn't \"Steve implying that Mathew's hating has to do with his being gay\" [your direction], either.\n\n The difference between you and me here is that I wasn't pretending to be responding to the original issue, while you were. You were inventing something to complain about, creating from whole cloth the idea that gay rights supporters can't stand the word \"lifestyle\". I was addressing homophobia, something which I will do whenever it comes up regardless of the original topic of the thread. If I see homophobia I'll call the person exhibiting it on it, it's that simple.\n \n Oh, and nice use of \"exactly\". Taking a demonstration that you were out and out wrong and trying to twist it into something that shows you were right in some way. It seemed like you had gotten over such inane tricks and games; what happened, why the rather drastic backsliding?", 
   {}, 
   282534, 
   null, 
   1189114320.0
  ], 
  [
   282549, 
   null, 
   "jyoshu", 
   "I was addressing homophobia, something which I will do whenever it comes up regardless of the original topic of the thread. If I see homophobia I'll call the person exhibiting it on it, it's that simple.\n\n \n Well, at least you're being open now to the reality that you took things in a different direction--even a defiant statement that you'll essentially get off a thread's topic ANYTIME you see homophobia exhibited.", 
   {}, 
   282538, 
   null, 
   1189117680.0
  ], 
  [
   282550, 
   null, 
   "Kronus", 
   "Well, at least you're being open now to the reality that you took things in a different direction--even a defiant statement that you'll essentially get off a thread's topic ANYTIME you see homophobia exhibited.\n\n \n Adressing homophobia in the gay rights forum, not a big leap. Now if only you'll admit to trying to hijack the thread by inventing a conflict that wasn't there, then we would have real progress.", 
   {}, 
   282549, 
   null, 
   1189118700.0
  ], 
  [
   282565, 
   null, 
   "samiinh", 
   "When Pat Robertson and James Dobson move \"into the light\" we can also be find reason for rejoicing.", 
   {}, 
   282550, 
   null, 
   1189123560.0
  ], 
  [
   282600, 
   null, 
   "Matthew S", 
   "When Pat Robertson and James Dobson move \"into the light\" we can also be find reason for rejoicing.\n\n \n Yes those are the two biggies I think I will be dancing in the street. Think downtown detroit the Iraqi-americans and Sadams hanging.", 
   {}, 
   282565, 
   null, 
   1189132080.0
  ], 
  [
   282642, 
   null, 
   "Steeeeve", 
   "So you think saying the word \"lifestyle\" the way Steeeeve did equates to being a 'bigot'. Call it downplaying if you want, but I think you're 'up-playing' it myself. I think waaaaay too much is made of that word--it wouldn't bother me if someone used the term \"lifestyle\" in context of me being straight. Would it you?\n \n Exaclty--I have to admit I'm still wondering why you took the thread a different direction with post #4, where you essentially switched topics to Steeeeve being prejudiced. you see, the topic (that you claim) wasn't \"Steve implying that Mathew's hating has to do with his being gay\" [your direction], either.\nDon't further discuss this please...there is no reason to reason with unreasonable people.", 
   {}, 
   282534, 
   null, 
   1189147680.0
  ], 
  [
   282647, 
   null, 
   "Steeeeve", 
   "When Pat Robertson and James Dobson move \"into the light\" we can also be find reason for rejoicing.\n\n \n Yet another example of someone who shows their true colors. In fact I'll use the same quote for you I used for matthew: It is posts like this that makes me realize I am not wrong about you or your lifestyle.", 
   {}, 
   282565, 
   null, 
   1189148220.0
  ], 
  [
   282654, 
   null, 
   "chemist99a", 
   "Don't further discuss this please...there is no reason to reason with unreasonable people.\n\n \n Indeed and thats a perfect characterization of Dobson, Falwell, Robertson, and the host of fundamentalists and creationsts out there. They have no intention of actually discussing the issues rationally, after all they have it on the highest possible authority that they are RIGHT no need to discuss or think for themselves!", 
   {}, 
   282647, 
   null, 
   1189148940.0
  ], 
  [
   282738, 
   null, 
   "thelmoose", 
   "Yet another example of someone who shows their true colors. In fact I'll use the same quote for you I used for matthew: It is posts like this that makes me realize I am not wrong about you or your lifestyle.\n\n \n Again, what lifestyle would that be?", 
   {}, 
   282647, 
   null, 
   1189186140.0
  ], 
  [
   282766, 
   null, 
   "Steeeeve", 
   "Again, what lifestyle would that be?\nWe've been over this but if I had to sum it up in one word: selfishness.", 
   {}, 
   282738, 
   null, 
   1189197000.0
  ], 
  [
   282767, 
   null, 
   "JSDKoeln", 
   "We've been over this but if I had to sum it up in one word: selfishness.\n\n \n They perhaps you should repent your selfish, hateful ways and become more loving and selfless... but that would be to christian for you.", 
   {}, 
   282766, 
   null, 
   1189197420.0
  ], 
  [
   282769, 
   null, 
   "thelmoose", 
   "We've been over this but if I had to sum it up in one word: selfishness.\n\n \n Ah yes, that \"selfishness lifestyle\". A common term. I guess you really didn't need to elaborate after all. But I thought you were referring to the \"happy when religious frauds croak lifestyle\".", 
   {}, 
   282766, 
   null, 
   1189198500.0
  ], 
  [
   282775, 
   null, 
   "Matthew S", 
   "We've been over this but if I had to sum it up in one word: selfishness.\n\n \n Selfishness is saying you can't be a family because of someone elses religion.", 
   {}, 
   282766, 
   null, 
   1189201320.0
  ], 
  [
   282777, 
   null, 
   "samiinh", 
   "The \"selfish lifestyle\" is that of the republican greed politicians and their supposed \"family values\" ########. Let young Americans die so that one day they can control the oil under the sands in Iraq, for example. Let the rest of the working class pay for it. Taxcuts for the rich.", 
   {}, 
   282775, 
   null, 
   1189201860.0
  ], 
  [
   282819, 
   null, 
   "Steeeeve", 
   "Ah yes, that \"selfishness lifestyle\". A common term. I guess you really didn't need to elaborate after all. But I thought you were referring to the \"happy when religious frauds croak lifestyle\".\nIt stems from the same evil in my opinion. I don't even care if its a religious fraud, a homeless guy, or the president...you just shouldn't praise the death of someone.\n \n \nSelfishness is saying you can't be a family because of someone elses religion.\nNot exactly sure how that is selfishness unless you have an odd definition.\n \n \nThe \"selfish lifestyle\" is that of the republican greed politicians and their supposed \"family values\" ########. Let young Americans die so that one day they can control the oil under the sands in Iraq, for example. Let the rest of the working class pay for it. Taxcuts for the rich.\nIf true those would be good examples of selfishness. Perhaps Matthew should learn from your understanding of the word.", 
   {}, 
   282769, 
   null, 
   1189207380.0
  ], 
  [
   282827, 
   null, 
   "samiinh", 
   "If true those would be good examples of selfishness.\n \n \n They are true. But you'd have to pull your head out of sand to realize that and I doubt that your kind could do that.", 
   {}, 
   282819, 
   null, 
   1189209480.0
  ], 
  [
   282828, 
   null, 
   "thelmoose", 
   "It stems from the same evil in my opinion. I don't even care if its a religious fraud, a homeless guy, or the president...you just shouldn't praise the death of someone.\n \n\n \n I hate that \"don't praise the death of someone\" lifestyle, too. I especially don't like the clothes they wear, the hairstyles or those \"putting the fun in funeral\" parties.", 
   {}, 
   282819, 
   null, 
   1189209600.0
  ], 
  [
   282853, 
   null, 
   "Steeeeve", 
   "They are true. But you'd have to pull your head out of sand to realize that and I doubt that your kind could do that.\nFor some it is indeed true which is why I said \"if true\".", 
   {}, 
   282827, 
   null, 
   1189216560.0
  ], 
  [
   282857, 
   null, 
   "Matthew S", 
   "It stems from the same evil in my opinion. I don't even care if its a religious fraud, a homeless guy, or the president...you just shouldn't praise the death of someone.\n \n \n\n \n If the IRS was abolished tomorrow would you rejoice? If you never had to pay anymore taxes for the rest of your life would you rejoice?", 
   {}, 
   282819, 
   null, 
   1189217640.0
  ], 
  [
   282860, 
   null, 
   "Steeeeve", 
   "If the IRS was abolished tomorrow would you rejoice? If you never had to pay anymore taxes for the rest of your life would you rejoice?\nhaha I'm an accountant so perhaps thats a bad example. But assuming their was an agency I didn't like and it was abolished I might rejoice yes. I'm not sure how that relates though.", 
   {}, 
   282857, 
   null, 
   1189218360.0
  ], 
  [
   282870, 
   null, 
   "Matthew S", 
   "haha I'm an accountant so perhaps thats a bad example. But assuming their was an agency I didn't like and it was abolished I might rejoice yes. I'm not sure how that relates though.\n\n \n Well I think of what person represented and what they preached as an agency I don't like. That is what is gone that is why I am rejoicing. Not because the man died but because he will never preach his evil anymore.", 
   {}, 
   282860, 
   null, 
   1189220940.0
  ], 
  [
   282878, 
   null, 
   "robbie0517", 
   "Response from the National Gay and Lesbian Task Force. I think this pretty much sums up the general response from the LGBT community. \n \n \n\"We express our condolences to the family, friends and all those close to the Rev. Dr. D. James Kennedy, a man who claimed to be 'proclaiming truths that transform the world,'\" said Jason Cianciotto, senior fellow at the National Gay and Lesbian Task Force Policy Institute, in a statement. \"Unfortunately, Kennedy's 'truth' included the vilification and demonization of millions of lesbian, gay, bisexual and transgender people for more than 30 years. \n \n \"Through his advocacy of ex-gay ministries, Kennedy called for the 'transformation' of LGBT Americans while ignoring scientific truths about the lack of efficacy and gross mental, physical and spiritual harm caused by so-called 'conversion therapy' programs,\" Cianciotto added. \"He used his media empire of television and radio programs to spread lies and misinformation to support his opposition to marriage equality, hate crimes legislation and employment nondiscrimination legislation. Like so many religious right leaders of his generation, Kennedy's version of religious 'truth' divided rather than united American families.\"\n", 
   {
    "unicode_changes_made": true
   }, 
   282870, 
   null, 
   1189222920.0
  ], 
  [
   282879, 
   null, 
   "Matthew S", 
   "Response from the National Gay and Lesbian Task Force. I think this pretty much sums up the general response from the LGBT community.\n\n \n Didn't they just do the munchkin song with more tact?", 
   {}, 
   282878, 
   null, 
   1189223640.0
  ], 
  [
   282889, 
   null, 
   "Steeeeve", 
   "Well I think of what person represented and what they preached as an agency I don't like. That is what is gone that is why I am rejoicing. Not because the man died but because he will never preach his evil anymore.\nYou rejoice the death of a person...if you didn't this thread wouldn't exist. A person is much more valuable than a state agency.", 
   {}, 
   282870, 
   null, 
   1189239900.0
  ], 
  [
   282891, 
   null, 
   "chemist99a", 
   "You rejoice the death of a person...if you didn't this thread wouldn't exist. A person is much more valuable than a state agency.\n\n \n Wrong concept of agency there. \n \n Falwell was an agent advocating irrationality and at times hatred. Hitler was similar. It has nothing to do with government agencies. That the agency represented by Falwell has ceased to operate may be legitimately and ethically celebrated. That the human being Falwell has died is NOT cause for celebration of his death. Would you for example celebrated the vanishing of Hitler as an agent of evil even though you might not feel joy at his death as a person?", 
   {}, 
   282889, 
   null, 
   1189241580.0
  ], 
  [
   282893, 
   null, 
   "samiinh", 
   "Wrong concept of agency there. \n \n Falwell was an agent advocating irrationality and at times hatred. Hitler was similar. It has nothing to do with government agencies. That the agency represented by Falwell has ceased to operate may be legitimately and ethically celebrated. That the human being Falwell has died is NOT cause for celebration of his death. Would you for example celebrated the vanishing of Hitler as an agent of evil even though you might not feel joy at his death as a person?\n\n \n One could apply the same principle to Osama Bin Laden.", 
   {}, 
   282891, 
   null, 
   1189257360.0
  ], 
  [
   283903, 
   null, 
   "Shooterandproud", 
   "It is posts like this that makes me realize I am not wrong about you or your lifestyle Matthew. \n \n You may praise the death of another but I find that sad and disturbing. I, however, wouldn't praise the death of anyone no matter how much I disliked them.\n\n \n As much as Steeeve an I disagree, I believe he speaks the truth on this matter.", 
   {}, 
   282403, 
   null, 
   1189826280.0
  ], 
  [
   283907, 
   null, 
   "Matthew S", 
   "As much as Steeeve an I disagree, I believe he speaks the truth on this matter.\n\n \n So you would not rejoice if HIV, Smallpox, Malaria, Ebola, or any of the other diseases and evils that plague humans were eradicated?\n \n To me this man was just as much the embodiment of evil as any disease know to man. Why is it that people have so much problem with the concept that it is moral to rejoice the defeat of evil?", 
   {}, 
   283903, 
   null, 
   1189827240.0
  ], 
  [
   283908, 
   null, 
   "chemist99a", 
   "One could apply the same principle to Osama Bin Laden.\n\n \n Most certainly one could do so. Falwell and OBL had a lot in common, namely unwavering personal loyalty to a dogma regardless of the actual consequences for human beings caught in their gears.", 
   {}, 
   283907, 
   null, 
   1189827360.0
  ], 
  [
   283914, 
   null, 
   "Steeeeve", 
   "As much as Steeeve an I disagree, I believe he speaks the truth on this matter.\nDang...you definitely went up on my respect-o-meter", 
   {}, 
   283903, 
   null, 
   1189829100.0
  ], 
  [
   283934, 
   null, 
   "Ohioprof", 
   "I think that as dangerous as Kennedy's opposition to equal treatment under the law for gay people were his efforts to make the United States into a \"Christian nation.\" Kennedy reportedly wanted to make the secular laws of our nation conform to his particular Christian beliefs. \n \n Kennedy was also passionately opposed to the theory of evolution. \n \n I don't rejoice in anyone's death. The loss of any person diminishes all of us. I think that Kennedy will be remembered as one of those voices that stood for just about everything that I oppose.", 
   {}, 
   283914, 
   null, 
   1189833780.0
  ], 
  [
   283938, 
   null, 
   "chemist99a", 
   "Do you imply that you oppose an America run according to Canon Law? To counter our Islamic enemies do we not have to adopt their tactics and counter their ideals. After all they wish to merge church and state at the legal level, how can we not see their bet and raise them. emoticon_xangel", 
   {}, 
   283934, 
   null, 
   1189835040.0
  ], 
  [
   283964, 
   null, 
   "samiinh", 
   "Do you imply that you oppose an America run according to Canon Law? To counter our Islamic enemies do we not have to adopt their tactics and counter their ideals. After all they wish to merge church and state at the legal level, how can we not see their bet and raise them. emoticon_xangel\n\n \n Have you been hitting the kool-aid again?", 
   {}, 
   283938, 
   null, 
   1189863960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Another one bites the dust", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10322-another-one-bites-dust.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10322, 
  "discussion_files": [
   [
    "9147.html", 
    "http://www.4forums.com/political/gay-rights-debates/10322-another-one-bites-dust-print.html"
   ], 
   [
    "9148.html", 
    "http://www.4forums.com/political/gay-rights-debates/10322-another-one-bites-dust-5-print.html"
   ], 
   [
    "9149.html", 
    "http://www.4forums.com/political/gay-rights-debates/10322-another-one-bites-dust-4-print.html"
   ], 
   [
    "9150.html", 
    "http://www.4forums.com/political/gay-rights-debates/10322-another-one-bites-dust-3-print.html"
   ], 
   [
    "9151.html", 
    "http://www.4forums.com/political/gay-rights-debates/10322-another-one-bites-dust-2-print.html"
   ]
  ], 
  "identifier": 10322
 }
]