[
 [
  [
   282563, 
   null, 
   "chloe", 
   "did anyone know that when you deliver a baby it starts crying even before you cut the cord?\n \n Also, has anyone checked out the 4-D ultrasound? It is awesome. You can see babies smiling inside of the womb. I recommend that anyone thinking about getting an abortion first get an ultrasound.", 
   {
    "post_info": {
     "post_title": "life"
    }
   }, 
   null, 
   null, 
   1189123140.0
  ], 
  [
   282567, 
   null, 
   "sinjin", 
   "did anyone know that when you deliver a baby it starts crying even before you cut the cord?\nAnyone who has witnessed a birth knows this. So?\n \n \nAlso, has anyone checked out the 4-D ultrasound? It is awesome. You can see babies smiling inside of the womb.\nIn the last trimester they smile, but not in response to stimuli. That doesn't happen until they're about 2 months old. Btw abortions are restricted in the third trimester.", 
   {}, 
   282563, 
   null, 
   1189123860.0
  ], 
  [
   282570, 
   null, 
   "samiinh", 
   "What will happen if abortion is outlawed, is that wealthy women will be able to still get them, while poor women will be subjected to back alley abortions once again. Sounds like a great plan for the delusional christians.", 
   {}, 
   282567, 
   null, 
   1189124340.0
  ], 
  [
   282576, 
   null, 
   "richbrmly", 
   "I am against abortions past the first trimester (3 months) and that stage there isn't enough brains to even feel pain..Not connections.\n \n Past 20 weeks and I have real issues with the procedure. The time limit to an abortion is 24 weeks, I'd like to see that backed off by 4 weeks.\n \n I am pro-choice, but pushing into that 24th week gets way to human like and gray mater matters. Naturally there are exceptions in my mind regarding health risks and such.", 
   {}, 
   282570, 
   null, 
   1189124820.0
  ], 
  [
   282578, 
   null, 
   "samiinh", 
   "And who makes the decision, Rich? That's the issue, as I see it. I don't believe the government has any business in a woman's body.", 
   {}, 
   282576, 
   null, 
   1189125000.0
  ], 
  [
   282589, 
   null, 
   "chloe", 
   "And who makes the decision, Rich? That's the issue, as I see it. I don't believe the government has any business in a woman's body.\n\n \n So you must be against Medicare and Medicaid. I assume you would also be against nationalized healthcare. \n \n The government, rather the supreme court dictators, became involved in the woman's body in 1973. You must be against roe v. wade.", 
   {}, 
   282578, 
   null, 
   1189128480.0
  ], 
  [
   282590, 
   null, 
   "thecap0", 
   "chloe,\n \n Also, has anyone checked out the 4-D ultrasound? It is awesome. You can see babies smiling inside of the womb. I recommend that anyone thinking about getting an abortion first get an ultrasound.\n \n I recommend that you keep your runny nose out of any decisions that the women in my family, or any other family but your own may choose to make regarding the future of their pregnancies.\n \n There is no more guilt attached to removing a fetus than there is to removing a diseased gall bladder.:)", 
   {
    "post_info": {
     "post_title": "Life is too short to live it in ignorance or in Tejas, but I repeat myself!"
    }
   }, 
   282578, 
   null, 
   1189128660.0
  ], 
  [
   282591, 
   null, 
   "thecap0", 
   "chloe,\n \n A consistant pro-choice view is that a woman would be justified in killing a newborn baby, or \"allowing it to starve\" (to be politically incorrect) if she did not want to offer her bodily resources as nutrition and if there were no other options.\n \n Exactly so!!\n \n If there are \"no other options\" and it is a choice between the life of the mother or of the child, I vote for the mother every time.", 
   {}, 
   282590, 
   null, 
   1189128840.0
  ], 
  [
   282593, 
   null, 
   "samiinh", 
   "So you must be against Medicare and Medicaid. I assume you would also be against nationalized healthcare. \n \n The government, rather the supreme court dictators, became involved in the woman's body in 1973. You must be against roe v. wade.\n\n \n I believe your response here is either to bait, or just showing your ignorance.", 
   {}, 
   282589, 
   null, 
   1189129620.0
  ], 
  [
   282603, 
   null, 
   "chemist99a", 
   "Also, has anyone checked out the 4-D ultrasound? It is awesome. You can see babies smiling inside of the womb. I recommend that anyone thinking about getting an abortion first get an ultrasound.\n\n \n Indeed the improved technology has a broad number of uses. Among them will be to make abortions even safer and more in control of the physician. Who knows maybe it will serve as a replacement for partial birth abortions now that the doc can see what he is doing in near real time! After all if you can see the skull etc maybe it can be \"deflated\" in place without pulling a leg down to assure the position of the fetus. Its a very good technology if thats the case!!!!emoticon_xagree", 
   {}, 
   282593, 
   null, 
   1189132260.0
  ], 
  [
   282606, 
   null, 
   "chemist99a", 
   "Originally Posted by chloe \n \nSo you must be against Medicare and Medicaid. I assume you would also be against nationalized healthcare. The government, rather the supreme court dictators, became involved in the woman's body in 1973. You must be against roe v. wade.\n\n \n Well roe vs wade actually was a case which was undertaken by the plaintiff to get the gov out of womens bodies (metaphorically speaking). And thats what it did - it removed government controls it did not add them. It provided a wider range of options not a narrower range. Indeed a range of options more in accord with reality than before. And by the way a dictator is classically a single individual (see ancient greek history) not a panel of 9 drawing decisions by majority vote. That would I believe be a nonarchy or nonaship not a dictatorship. And of course the court provided relief to the plaintiffs from an existing set of restrictive laws which had been on the books for a long time meaning that the involvement of gov in womens bodies predated RvW by many decades.\n \n And why do you think that Medicare/Medicaid puts the government in womens bodies - those are insurance programs designed to protect the economic welfare and health of the patients who have them. Granted there are restricitions and limits, but frankly the programs are pretty good about covering a whole bunch of medical needs. Disclosure - I am disabled and a participant in SSDI and my medical bills are rather high (like 128K for a pacemaker replacement! which neted my cost to about $250 or less).", 
   {}, 
   282603, 
   null, 
   1189132800.0
  ], 
  [
   282623, 
   null, 
   "richbrmly", 
   "So you must be against Medicare and Medicaid. I assume you would also be against nationalized healthcare. \n \n The government, rather the supreme court dictators, became involved in the woman's body in 1973. You must be against roe v. wade.\n\n \n National health care can get pretty scary...Choice is much better than a doctor telling a woman she must abort because the cost and chance is to great. This can happen. Its why we must make sure national health care never ever has law produced by the Government to over see it..It has to be independent and the state only providing options like a company does now.", 
   {}, 
   282589, 
   null, 
   1189137900.0
  ], 
  [
   282626, 
   null, 
   "chemist99a", 
   "did anyone know that when you deliver a baby it starts crying even before you cut the cord?\n\n \n Yes :telephone :telephone :telephone :telephone", 
   {}, 
   282623, 
   null, 
   1189138620.0
  ], 
  [
   282632, 
   null, 
   "richbrmly", 
   "And who makes the decision, Rich? That's the issue, as I see it. I don't believe the government has any business in a woman's body.\n\n \n I understand the argument, a operational brain does effect my passions. We have law regarding anything beyond 24 weeks...I am suggesting that it be cut back 4 weeks because some fetuses can have a completed brain at that time.", 
   {}, 
   282578, 
   null, 
   1189139820.0
  ], 
  [
   282634, 
   null, 
   "chemist99a", 
   "I understand the argument, a operational brain does effect my passions. We have law regarding anything beyond 24 weeks...I am suggesting that it be cut back 4 weeks because some fetuses can have a completed brain at that time.\n\n \n Its always going to be an arbitrary line drawn by convention rather than hard scientific knowledge. Maybe someday we can read that developing brain and tell when it develops actual thoughts but not yet. And of course backing the line to 20 weeks is not going to resolve the controversy one whit. Nor is it going to substantively alter the number of abortions (very large majority are in trimester 1 !). But you certainly could argue your case - I don't think the courts would touch it though - the case itself would cause major social conflict after all!", 
   {}, 
   282632, 
   null, 
   1189140060.0
  ], 
  [
   282686, 
   null, 
   "samiinh", 
   "Its always going to be an arbitrary line drawn by convention rather than hard scientific knowledge. Maybe someday we can read that developing brain and tell when it develops actual thoughts but not yet. And of course backing the line to 20 weeks is not going to resolve the controversy one whit. Nor is it going to substantively alter the number of abortions (very large majority are in trimester 1 !). But you certainly could argue your case - I don't think the courts would touch it though - the case itself would cause major social conflict after all!\n\n \n I still don't believe that the government has any business in telling a woman what she can and cannot do with her own body when it comes to this subject. This is a decision that she makes with her doctor, one that must be very difficult, but one that is hers to make, not some bureaucrat in Washington.", 
   {}, 
   282634, 
   null, 
   1189170480.0
  ], 
  [
   282699, 
   null, 
   "richbrmly", 
   "Its always going to be an arbitrary line drawn by convention rather than hard scientific knowledge. Maybe someday we can read that developing brain and tell when it develops actual thoughts but not yet. And of course backing the line to 20 weeks is not going to resolve the controversy one whit. Nor is it going to substantively alter the number of abortions (very large majority are in trimester 1 !). But you certainly could argue your case - I don't think the courts would touch it though - the case itself would cause major social conflict after all!\n\n \n This is true, but its almost beyond the possible to find a doctor that will even do an abortion to someone beyond 20 weeks, they are educated and these guys take their oaths very seriously. \n \n Doctors understand the need for abortion knowing that before it was legal women had to have their accidents beyond the 6 month mark to abort. And the death rates where higher than the Vietnam war. Now that abortion is safe and legal, its reasonable to have one before there is an intact mind. \n \n Hard and fast rules cost lifes and I agree the choice must be with the host of the fetus and the doctor, but they are doctors first and formost. Its not easy finding Doctors that will simply remove something viable by request. These guys have spend the better part of 12 years doing nothing but studing how to safe. They are the honored among us. I think 5 months should be plenty of time to determine a choice when things are normal.", 
   {}, 
   282634, 
   null, 
   1189175220.0
  ], 
  [
   282735, 
   null, 
   "samiinh", 
   "This is true, but its almost beyond the possible to find a doctor that will even do an abortion to someone beyond 20 weeks, they are educated and these guys take their oaths very seriously. \n \n Doctors understand the need for abortion knowing that before it was legal women had to have their accidents beyond the 6 month mark to abort. And the death rates where higher than the Vietnam war. Now that abortion is safe and legal, its reasonable to have one before there is an intact mind. \n \n Hard and fast rules cost lifes and I agree the choice must be with the host of the fetus and the doctor, but they are doctors first and formost. Its not easy finding Doctors that will simply remove something viable by request. These guys have spend the better part of 12 years doing nothing but studing how to safe. They are the honored among us. I think 5 months should be plenty of time to determine a choice when things are normal.\n\n \n I would think that would be true that the decision would be made within those first 5 months. At what point can tests determine if the fetus is deformed and abortion becomes a choice?", 
   {}, 
   282699, 
   null, 
   1189185780.0
  ], 
  [
   282741, 
   null, 
   "richbrmly", 
   "I would think that would be true that the decision would be made within those first 5 months. At what point can tests determine if the fetus is deformed and abortion becomes a choice?\n\n \n I am pro-choice because I am unable to make one. There are things worse than death. I am a liberal, so emotional beings are worthy.", 
   {}, 
   282735, 
   null, 
   1189186980.0
  ], 
  [
   282764, 
   null, 
   "chloe", 
   "I still don't believe that the government has any business in telling a woman what she can and cannot do with her own body when it comes to this subject. This is a decision that she makes with her doctor, one that must be very difficult, but one that is hers to make, not some bureaucrat in Washington.\n\n \n So are you against Medicare and Medicaid? Do you want nationalized healthcare?", 
   {}, 
   282686, 
   null, 
   1189196940.0
  ], 
  [
   282776, 
   null, 
   "samiinh", 
   "So are you against Medicare and Medicaid? Do you want nationalized healthcare?\n\n \n What is your problem? Why are you being so obtuse? You know exactly what I mean. You are just trying to bait. Get a life.", 
   {}, 
   282764, 
   null, 
   1189201680.0
  ], 
  [
   282782, 
   null, 
   "chemist99a", 
   "So are you against Medicare and Medicaid? Do you want nationalized healthcare?\n\n \n Do you prefer a functional or a nonfunctional society. Would you (as pro-lifer) support life beyond birth or do your concerns extend only to the rights and requirements of small pieces of tissue which are not human beings?", 
   {}, 
   282776, 
   null, 
   1189202280.0
  ], 
  [
   282785, 
   null, 
   "samiinh", 
   "Do you prefer a functional or a nonfunctional society. Would you (as pro-lifer) support life beyond birth or do your concerns extend only to the rights and requirements of small pieces of tissue which are not human beings?\n\n \n I find the hypocrisy amazing. The pro-lifers are the same ones who would deny the unwanted children the basics of life, liberty and the pursuit of happiness.", 
   {}, 
   282782, 
   null, 
   1189202520.0
  ], 
  [
   282790, 
   null, 
   "chloe", 
   "What is your problem? Why are you being so obtuse? You know exactly what I mean. You are just trying to bait. Get a life.\n\n \n Just wondering.\n I suspect you do, and if that is the case, then you really do support the government being involved in the bodies of women and making medical decisions for them.", 
   {}, 
   282776, 
   null, 
   1189203420.0
  ], 
  [
   282791, 
   null, 
   "chloe", 
   "Do you prefer a functional or a nonfunctional society. Would you (as pro-lifer) support life beyond birth or do your concerns extend only to the rights and requirements of small pieces of tissue which are not human beings?\n\n \n A dysfunctional society is one that kills its babies. You know deep inside i am right. \n \n Of course I support life in all its stages. Human beings have inherent dignity and value at all stages of their lives.", 
   {}, 
   282782, 
   null, 
   1189203480.0
  ], 
  [
   282797, 
   null, 
   "sinjin", 
   "Of course I support life in all its stages. Human beings have inherent dignity and value at all stages of their lives.\nEvidence for this claim, please.", 
   {}, 
   282791, 
   null, 
   1189203960.0
  ], 
  [
   282803, 
   null, 
   "richbrmly", 
   "I find the hypocrisy amazing. The pro-lifers are the same ones who would deny the unwanted children the basics of life, liberty and the pursuit of happiness.\n\n \n well, look at it this way. How many abortions are simply because the woman doesn't have an ounce of insurance and they know they'll owe tens of thousands of dollars. Pretty scary for a woman even at twice the minimum wage.", 
   {}, 
   282785, 
   null, 
   1189204320.0
  ], 
  [
   282809, 
   null, 
   "chemist99a", 
   "A dysfunctional society is one that kills its babies. You know deep inside i am right.\n \n\n \n Not necessarily. Sparta for example was perfectly functional, but it did kill quite a large fraction of its children by exposure.\n \n \n\n Of course I support life in all its stages. Human beings have inherent dignity and value at all stages of their lives.\n\n \n Persons do have the rights which adhere to persons. Non-persons such a a fertilized egg or a first trimester fetus howver do not. Its especially comical to see how a newly fertilized egg could possess anything one might call dignity :)", 
   {}, 
   282803, 
   null, 
   1189204920.0
  ], 
  [
   282816, 
   null, 
   "richbrmly", 
   "Not necessarily. Sparta for example was perfectly functional, but it did kill quite a large fraction of its children by exposure.\n \n \n \n Persons do have the rights which adhere to persons. Non-persons such a a fertilized egg or a first trimester fetus howver do not. Its especially comical to see how a newly fertilized egg could possess anything one might call dignity :)\n\n \n Rome had abortion, lasted 1500 years", 
   {}, 
   282809, 
   null, 
   1189206780.0
  ], 
  [
   282817, 
   null, 
   "samiinh", 
   "What about the abortions that occur naturally? There are millions of them annually. Are you angry with god when these occur?", 
   {}, 
   282809, 
   null, 
   1189206900.0
  ], 
  [
   282884, 
   null, 
   "thecap0", 
   "Chloe,\n \n Of course I support life in all its stages. Human beings have inherent dignity and value at all stages of their lives.\n \n Then you must, of course, oppose the death penalty as fervently as you do abortion.\n Why haven't we seen you hold forth on this topic?\n Just thought I would ask.emoticon_smile", 
   {
    "post_info": {
     "post_title": "Life is too short to live it in Tejas or in ignorance - but I repeat myself!"
    }
   }, 
   282817, 
   null, 
   1189225920.0
  ], 
  [
   282899, 
   null, 
   "samiinh", 
   "Chloe,\n \n Of course I support life in all its stages. Human beings have inherent dignity and value at all stages of their lives.\n \n Then you must, of course, oppose the death penalty as fervently as you do abortion.\n Why haven't we seen you hold forth on this topic?\n Just thought I would ask.emoticon_smile\n\n \n More than likely, Cloe is a Bush Pro-Lifer. They support the death penalty. Just look what he's done in Iraq, and wants to do in Iran.", 
   {}, 
   282884, 
   null, 
   1189263540.0
  ], 
  [
   282999, 
   null, 
   "Winston Smith", 
   "The right wing conservatives the so called pro-lifers among them never see the irony of being pro life of the unborn but not pro-life of the Iraqi people.\n \n Maybe they think that the unborn lives they save cancel out the lives and the suffering of the survivors of the occupation of Iraq.\n \n You have to be as dumb and as bigoted and chauvinistic and Christian fundamentalist as Bush is to support Bush and be pro-life at the same time.", 
   {}, 
   282899, 
   null, 
   1189304400.0
  ], 
  [
   283027, 
   null, 
   "samiinh", 
   "The right wing conservatives the so called pro-lifers among them never see the irony of being pro life of the unborn but not pro-life of the Iraqi people.\n \n Maybe they think that the unborn lives they save cancel out the lives and the suffering of the survivors of the occupation of Iraq.\n \n You have to be as dumb and as bigoted and chauvinistic and Christian fundamentalist as Bush is to support Bush and be pro-life at the same time.\n\n \n I laugh when I hear Bush talk about the \"culture of life\" as he bombs the hell out of Iraq, and vetoes bills that would give children health insurance. Bush executed more people in Texas than any other governor in history. How many of those people were innocent?", 
   {}, 
   282999, 
   null, 
   1189341840.0
  ], 
  [
   283049, 
   null, 
   "chemist99a", 
   "I laugh when I hear Bush talk about the \"culture of life\" as he bombs the hell out of Iraq, and vetoes bills that would give children health insurance. Bush executed more people in Texas than any other governor in history. How many of those people were innocent?\n\n \n Iraq is a different culture - its part of the axis of evil and thus subject to destruction by the forces of good. Texas on the other hand is simply rooting out the evils which have accumulated there - they only execute heathens and bad people (never mind the trials and such). In any case any innocent person who is executed gets upgrades to their living quarters in heaven so whats the beef. It all works out for the best. We are making good progress if we will just stay the course as long as it takes. Failure is not an option. Hard work will make up for incompetence you know. And what oh what would we do if they follow us home - that would be in the Elder Bushes words BAD. It would not be prudent to let that happen. If it did we would have to use all those Austrian troops from OPEC.", 
   {}, 
   283027, 
   null, 
   1189353960.0
  ], 
  [
   283050, 
   null, 
   "simone", 
   "did anyone know that when you deliver a baby it starts crying even before you cut the cord?\n \n Also, has anyone checked out the 4-D ultrasound? It is awesome. You can see babies smiling inside of the womb. I recommend that anyone thinking about getting an abortion first get an ultrasound.\nNot always. Why the Hades do you think they used to occasionally smack a newborn on the butt? It's because they weren't breathing and they (the newborns) had to react to pain and scream in order to start the breathing process.\n \n Get a life and face reality. You need to step out of your make-believe-world.", 
   {}, 
   282563, 
   null, 
   1189356240.0
  ], 
  [
   283052, 
   null, 
   "simone", 
   "A dysfunctional society is one that kills its babies. You know deep inside i am right. \n \n Of course I support life in all its stages. Human beings have inherent dignity and value at all stages of their lives.\nDeep inside I know you are wrong, totally wrong, that you live in a drugged state of unreality.\n \n I feel very sorry for you that you are so unconnected with reality.", 
   {}, 
   282791, 
   null, 
   1189356360.0
  ], 
  [
   283075, 
   null, 
   "VTCruiser", 
   "The right wing conservatives the so called pro-lifers among them never see the irony of being pro life of the unborn but not pro-life of the Iraqi people.\n \n Maybe they think that the unborn lives they save cancel out the lives and the suffering of the survivors of the occupation of Iraq.\n \n You have to be as dumb and as bigoted and chauvinistic and Christian fundamentalist as Bush is to support Bush and be pro-life at the same time.\n\n \n 1) are you really for the life of all Iraqis?? \n \n 2) Were you for the life of the Iraqi's when saddam was killing them himself?? (heck did you even know that was happening?)\n \n 3) Say if a pregnant iraqi women got killed... would that be 2 lives that died??? Would you care about the one in the womb as much as the woman?", 
   {}, 
   282999, 
   null, 
   1189376940.0
  ], 
  [
   283080, 
   null, 
   "VTCruiser", 
   "More than likely, Cloe is a Bush Pro-Lifer. They support the death penalty. Just look what he's done in Iraq, and wants to do in Iran.\n\n \n I dont get how you dont support the death penalty but support abortion against the most innocent among all of us..", 
   {}, 
   282899, 
   null, 
   1189377840.0
  ], 
  [
   283083, 
   null, 
   "thecap0", 
   "vtc,\n \n I dont get how you dont support the death penalty but support abortion against the most innocent among all of us..\n \n And I don't get how YOU can support snuffing out the life of a born human being and still call yourself \"Pro-Life.\n \n When will you guys admit that you should be called \n \"pro SOME Life\".\n \n So far, you have made it clear that you are anti-Iraqi Life and pro Death Penalty.\n \n Can you resolve the blatant contradiction?\n \n Didn't think so.emoticon_confused", 
   {
    "post_info": {
     "post_title": "Life is too short to live it in Tejas or in ignorance, but I repeat myself!"
    }
   }, 
   283080, 
   null, 
   1189379040.0
  ], 
  [
   283090, 
   null, 
   "samiinh", 
   "I dont get how you dont support the death penalty but support abortion against the most innocent among all of us..\n\n \n Personally, I think all you pro-lifers are frustrated dirty old men who want to control a woman's womb and make her subservient to you. Evil people. Sick.", 
   {}, 
   283080, 
   null, 
   1189383600.0
  ], 
  [
   283098, 
   null, 
   "chemist99a", 
   "I dont get how you dont support the death penalty but support abortion against the most innocent among all of us..\n\n \n Well a fetus is not a person so it cannot be morally responsible can it? Its neither innocent nor guilty no more than your gallbladder is. So the issue of taking the life of a person does not arise at all. Opposing the death penalty is indeed being supportive of the dignity of persons. Opposing abortion, particulary early term abortions, is being disrespectful to the rights and dignity of persons.", 
   {}, 
   283090, 
   null, 
   1189385700.0
  ], 
  [
   283121, 
   null, 
   "Winston Smith", 
   "I laugh when I hear Bush talk about the \"culture of life\" as he bombs the hell out of Iraq, and vetoes bills that would give children health insurance. Bush executed more people in Texas than any other governor in history. How many of those people were innocent?\n\n \n Bush is a war criminal and a terrorist. He fulfills the definition of both words.\n When he was Governor he did not execute anybody but he did not pardon anybody either.\n He is a puppet of those who bankrolled his political campaigns", 
   {}, 
   283027, 
   null, 
   1189414260.0
  ], 
  [
   283122, 
   null, 
   "Winston Smith", 
   "Well a fetus is not a person so it cannot be morally responsible can it? Its neither innocent nor guilty no more than your gallbladder is. So the issue of taking the life of a person does not arise at all. Opposing the death penalty is indeed being supportive of the dignity of persons. Opposing abortion, particulary early term abortions, is being disrespectful to the rights and dignity of persons.\n\n \n here we go again: a foetus is the same as a gallbladder. It is not and you know it.", 
   {}, 
   283098, 
   null, 
   1189414380.0
  ], 
  [
   283123, 
   null, 
   "Winston Smith", 
   "Personally, I think all you pro-lifers are frustrated dirty old men who want to control a woman's womb and make her subservient to you. Evil people. Sick.\n\n \n are you a young woman or a dirty young man?\n \n pro-lifers are a necessary evil otherwise the amount of abortions would go thru the roof. as it would become like a visit to dentist; a touch painful but short and so convenient.", 
   {}, 
   283090, 
   null, 
   1189414560.0
  ], 
  [
   283124, 
   null, 
   "Winston Smith", 
   "1) are you really for the life of all Iraqis?? \n \n 2) Were you for the life of the Iraqi's when saddam was killing them himself?? (heck did you even know that was happening?)\n \n 3) Say if a pregnant iraqi women got killed... would that be 2 lives that died??? Would you care about the one in the womb as much as the woman?\n\n \n 1) yes\n \n 2) two wrongs don't make a right. Bush's invasion has caused more deaths than all the killings by Hussein and Hussein did not kill a single American or British\n \n 3) two lives\n yes!", 
   {}, 
   283075, 
   null, 
   1189414740.0
  ], 
  [
   283139, 
   null, 
   "richbrmly", 
   "are you a young woman or a dirty young man?\n \n pro-lifers are a necessary evil otherwise the amount of abortions would go thru the roof. as it would become like a visit to dentist; a touch painful but short and so convenient.\n\n \n Your faith in women just dropped my jaw.\n \n 4 women will die today Winston...Today! now...In child birth. Their choice is going to take their life today. You believe women would just abort like its a hair appointment? Nuts....Totally Nuts.\n \n More are dieing today Winston, because your message of a fetus being a child is working. Its really having an effect. The effect is that more women will die today.", 
   {}, 
   283123, 
   null, 
   1189421880.0
  ], 
  [
   283141, 
   null, 
   "chemist99a", 
   "pro-lifers are a necessary evil otherwise the amount of abortions would go thru the roof. as it would become like a visit to dentist; a touch painful but short and so convenient.\n\n \n Well not exactly the truth is that most women would likely carry their feti to term just as they do now. Pro-choice mothers or pro-life mothers are just that mothers and there are a lot of each type.", 
   {}, 
   283123, 
   null, 
   1189423200.0
  ], 
  [
   283160, 
   null, 
   "Winston Smith", 
   "Your faith in women just dropped my jaw.\n \n 4 women will die today Winston...Today! now...In child birth. Their choice is going to take their life today. You believe women would just abort like its a hair appointment? Nuts....Totally Nuts.\n \n More are dieing today Winston, because your message of a fetus being a child is working. Its really having an effect. The effect is that more women will die today.\n\n \n you did not answer my question: are you a woman?\n \n yes or no?", 
   {}, 
   283139, 
   null, 
   1189428300.0
  ], 
  [
   283161, 
   null, 
   "Winston Smith", 
   "Your faith in women just dropped my jaw.\n \n 4 women will die today Winston...Today! now...In child birth. Their choice is going to take their life today. You believe women would just abort like its a hair appointment? Nuts....Totally Nuts.\n \n More are dieing today Winston, because your message of a fetus being a child is working. Its really having an effect. The effect is that more women will die today.\n\n \n the way I see it you prefer women to have abortions rather to give birth for giving birth is more dangerous than an abortion.\n \n are you a woman afraid of giving birth to a child?\n \n if you are one of the above then what about keeping your legs crossed or using some birth control procedure?\n \n I have faith in women, my mother was a woman. :)", 
   {}, 
   283139, 
   null, 
   1189428840.0
  ], 
  [
   283164, 
   null, 
   "Winston Smith", 
   "Well not exactly the truth is that most women would likely carry their feti to term just as they do now. Pro-choice mothers or pro-life mothers are just that mothers and there are a lot of each type.\n\n \n Quite so! but many abortions are done on middle class women who can afford them and know where to get them no questions asked.", 
   {}, 
   283141, 
   null, 
   1189429560.0
  ], 
  [
   283166, 
   null, 
   "samiinh", 
   "are you a young woman or a dirty young man?\n \n pro-lifers are a necessary evil otherwise the amount of abortions would go thru the roof. as it would become like a visit to dentist; a touch painful but short and so convenient.\n\n \n I don't believe that one iota. And no, I'm not a young woman or a dirty young man. But I do believe the anti-abortion group are part of the dying patriarchal society, and they won't give up easily.", 
   {}, 
   283123, 
   null, 
   1189429800.0
  ], 
  [
   283172, 
   null, 
   "Winston Smith", 
   "so you are a woman! why didn't you say so? \n \n I am not ashamed of being a man.\n \n are you ashamed of being a woman?", 
   {}, 
   283166, 
   null, 
   1189431420.0
  ], 
  [
   283176, 
   null, 
   "Winston Smith", 
   "I don't believe that one iota. And no, I'm not a young woman or a dirty young man. But I do believe the anti-abortion group are part of the dying patriarchal society, and they won't give up easily.\n\n \n not only men want to control women but many sisters want to control the sisterhood also.\n \n female mutilation in African Muslims countries is a barbarism perpetuated by women on women and many anti-abortionists are women.\n \n sorry, sister, but many of your own sex are bent on controlling the rest of you.\n \n Male patriarchs are almost extinct. No, I am not one of them", 
   {}, 
   283166, 
   null, 
   1189431660.0
  ], 
  [
   283179, 
   null, 
   "samiinh", 
   "What makes you think I am a woman? I am a 64 year old recently retired male, fwiw.", 
   {}, 
   283176, 
   null, 
   1189432260.0
  ], 
  [
   283182, 
   null, 
   "chemist99a", 
   "Quite so! but many abortions are done on middle class women who can afford them and know where to get them no questions asked.\n\n \n So what relevance does that have. Many deliveries are done on middle class women who can afford to have children and know where to get quality pre-natal and child care. Again so what?", 
   {}, 
   283179, 
   null, 
   1189433580.0
  ], 
  [
   283196, 
   null, 
   "Another opinion", 
   "pro-lifers are a necessary evil otherwise the amount of abortions would go thru the roof. as it would become like a visit to dentist; a touch painful but short and so convenient.\n\n There are a wide variety of views on abortion. Pro-lifers only constitute one extreme - not allowing abortion at all stages of pregnancy except for very few exceptions (most allowing for risk of mother's death, some allowing for rape, incest and risk to mother's health). This seems to largely be driven by a particular brand of religious belief - such as a belief of a soul entering at conception.\n \n The statistics show some of the range of views on abortion:\n from http://pollingreport.com/abortion.htm , from a CNN/USA Today/Gallup Poll. Jan. 10-12, 2003. N=1,002 adults nationwide. MoE ± 3.:\n \n\"Thinking more generally: Do you think abortion should generally be legal or generally illegal during each of the following stages of pregnancy? How about [see below]?\"\n \n \"In the first three months of pregnancy\" \n 66% Legal, 29% Illegal, 3% Depends, 2% Unsure\n \n \"In the second three months of pregnancy\"\n 25% Legal, 68% Illegal, 4% Depends, 3% Unsure \n \n \"In the last three months of pregnancy\"\n 10% Legal, 84% Illegal, 4% Depends, 2% Unsure\n\n \n So, if politics reflected majority views instead of the views of particularly vocal political interest groups, then first trimester abortions would be legal, second and third trimester would be generally illegal (appart from the usual exceptions). The current distribution of abortions reflect these views as well, where the great majority of abortions (~87%) occur in the first trimester and only 1.4% occur after 20 weeks gestation (and those usually for serious health issues). Note that I did not pick and choose polls that suite my view since I disagree with the majority stance on second trimester abortions, though I agree with the stance on first and third trimester abortions. This is just the only poll of its type that I could find.\n \n Anyway, the statistics reveal that your assumptions are incorrect on this point.", 
   {}, 
   283123, 
   null, 
   1189442940.0
  ], 
  [
   283254, 
   null, 
   "Winston Smith", 
   "What makes you think I am a woman? I am a 64 year old recently retired male, fwiw.\n\n \n oh! you are a dirty old man? a patriarch?", 
   {}, 
   283179, 
   null, 
   1189475880.0
  ], 
  [
   283304, 
   null, 
   "samiinh", 
   "oh! you are a dirty old man? a patriarch?\n\n \n Sorry, neither. What about you?", 
   {}, 
   283254, 
   null, 
   1189518060.0
  ], 
  [
   283573, 
   null, 
   "Winston Smith", 
   "There are a wide variety of views on abortion. Pro-lifers only constitute one extreme - not allowing abortion at all stages of pregnancy except for very few exceptions (most allowing for risk of mother's death, some allowing for rape, incest and risk to mother's health). This seems to largely be driven by a particular brand of religious belief - such as a belief of a soul entering at conception.\n \n The statistics show some of the range of views on abortion:\n from http://pollingreport.com/abortion.htm , from a CNN/USA Today/Gallup Poll. Jan. 10-12, 2003. N=1,002 adults nationwide. MoE ± 3.:\n \n \n So, if politics reflected majority views instead of the views of particularly vocal political interest groups, then first trimester abortions would be legal, second and third trimester would be generally illegal (appart from the usual exceptions). The current distribution of abortions reflect these views as well, where the great majority of abortions (~87%) occur in the first trimester and only 1.4% occur after 20 weeks gestation (and those usually for serious health issues). Note that I did not pick and choose polls that suite my view since I disagree with the majority stance on second trimester abortions, though I agree with the stance on first and third trimester abortions. This is just the only poll of its type that I could find.\n \n Anyway, the statistics reveal that your assumptions are incorrect on this point.\n\n \n I only support abortions that take place in the first trimester.", 
   {}, 
   283196, 
   null, 
   1189653960.0
  ], 
  [
   283574, 
   null, 
   "Winston Smith", 
   "Sorry, neither. What about you?\n\n \n I shower and change my underwear daily. I live in a matriarchal household", 
   {}, 
   283304, 
   null, 
   1189654020.0
  ], 
  [
   283720, 
   null, 
   "Another opinion", 
   "I only support abortions that take place in the first trimester.\n\n Interesting. Does that mean abortions in the first trimester for any reason or do you restrict reasons? If you restrict reasons in the first trimester, what would you allow in the first trimester and not the others?\n \n If you are generally open to abortions in the first trimester, do you consider yourself pro-life then or pro-choice? I have heard people with your view who call themselves pro-life and others who call themselves pro-choice.", 
   {}, 
   283573, 
   null, 
   1189718700.0
  ], 
  [
   283743, 
   null, 
   "samiinh", 
   "I shower and change my underwear daily. I live in a matriarchal household\n\n \n You gotta watch those mothers.", 
   {}, 
   283574, 
   null, 
   1189730220.0
  ], 
  [
   283753, 
   null, 
   "feindslayer", 
   "If you kill a person who is 50 years old, is is murder?\n yes\n \n If you kill a person who is 5 years old, is it murder?\n yes\n \n If you kill a person who is 5 months old, is it murder?\n yes\n \n If you kill a person who is 5 weeks old, is it murder?\n yes\n \n If you kill a person who is 5 days old, is it murder?\n yes\n \n If you kill a person who will be born in 5 days, is it murder?", 
   {
    "post_info": {
     "post_title": "Abortion is against the law"
    }
   }, 
   282563, 
   null, 
   1189741200.0
  ], 
  [
   283758, 
   null, 
   "richbrmly", 
   "If you kill a person who is 50 years old, is is murder?\n yes\n \n If you kill a person who is 5 years old, is it murder?\n yes\n \n If you kill a person who is 5 months old, is it murder?\n yes\n \n If you kill a person who is 5 weeks old, is it murder?\n yes\n \n If you kill a person who is 5 days old, is it murder?\n yes\n \n If you kill a person who will be born in 5 days, is it murder?\n\n \n Abortion happens. Women have been aborting Fetuses before God talked to Moses. Even Hippocrates outlined how to perform an abortion for women. \n \n Back then you would beat them in the stomach.\n \n The old testament outlined the fine for causing an abortion.\n \n Exodus 21[22] If men strive, and hurt a woman with child, so that her fruit depart from her, and yet no mischief follow: he shall be surely punished, according as the woman's husband will lay upon him; and he shall pay as the judges determine.\n \n Meaning you would be fined if the Husband complains... And notice the method..Strive to hurt a woman, thats the method for abortion that was in use at the time.\n \n Abortion will happen and all we can do is truly safe life. And only pro-choice does that. It gives the woman a doctor. Pro_life is only pro-death, abortions will still happen and women will die getting them.", 
   {}, 
   283753, 
   null, 
   1189746240.0
  ], 
  [
   283775, 
   null, 
   "samiinh", 
   "Pro_life is only pro-death, abortions will still happen and women will die getting them.\n \n \n I believe this is exactly what the debate is all about. Thanks for succinctly putting it Rich.", 
   {}, 
   283758, 
   null, 
   1189770180.0
  ], 
  [
   283785, 
   null, 
   "Another opinion", 
   "If you kill a person who is 50 years old, is is murder?\n yes\n \n If you kill a person who is 5 years old, is it murder?\n yes\n \n If you kill a person who is 5 months old, is it murder?\n yes\n \n If you kill a person who is 5 weeks old, is it murder?\n yes\n \n If you kill a person who is 5 days old, is it murder?\n yes\n \n If you kill a person who will be born in 5 days, is it murder?\n\n I am assuming that your next arguements would be:\n \nIf you kill a fetus five days from birth, is it murder?\n [yes]\n \n If you kill an embryo five days after conception, is it murder?\n [yes]\n\n To that I would then ask the question:\n \n If you kill an egg (through contraception) minutes before possible conception, is it murder?\n \n If you follow the same line of thought as you have been taking, then you would have to say yes, and outlaw all contraception. Instead, I say that your line of thought itself is flawed.", 
   {}, 
   283753, 
   null, 
   1189785780.0
  ], 
  [
   283793, 
   null, 
   "thecap0", 
   "fs,\n \n If you kill a person who will be born in 5 days, is it murder?\n \n Strawman alert!\n It's not murder beacuse until it's born it's not a person.", 
   {}, 
   283785, 
   null, 
   1189789800.0
  ], 
  [
   283810, 
   null, 
   "simone", 
   "Five days before birth, a preonate can survive outside the womb. It would be murder unless medically necessary to save the life of the mother or the pregnancy gravely endangered the pregnant woman's life and inducing a normal birth was not an option.\n \n It's not birth, but the ability to survive outside the womb. According to the law.", 
   {}, 
   283793, 
   null, 
   1189800240.0
  ], 
  [
   283852, 
   null, 
   "chloe", 
   "Pro_life is only pro-death, abortions will still happen and women will die getting them.\n \n \n I believe this is exactly what the debate is all about. Thanks for succinctly putting it Rich.\n\n \n Do you support universal health care? Do you support Medicare and Medicaid?", 
   {}, 
   283775, 
   null, 
   1189814580.0
  ], 
  [
   283853, 
   null, 
   "chloe", 
   "fs,\n \n If you kill a person who will be born in 5 days, is it murder?\n \n Strawman alert!\n It's not murder beacuse until it's born it's not a person.\n\n \n One word to you...baloney", 
   {}, 
   283793, 
   null, 
   1189814700.0
  ], 
  [
   283856, 
   null, 
   "samiinh", 
   "One word to you...baloney\n\n \n Back at you: baloney", 
   {}, 
   283853, 
   null, 
   1189817640.0
  ], 
  [
   283877, 
   null, 
   "Winston Smith", 
   "fs,\n \n If you kill a person who will be born in 5 days, is it murder?\n \n Strawman alert!\n It's not murder beacuse until it's born it's not a person.\n\n \n why don't you try it! and test the legality of it personally; but before you do make sure you get Internet access wherever they send you so that we can continue talking on this subject", 
   {}, 
   283793, 
   null, 
   1189820460.0
  ], 
  [
   283879, 
   null, 
   "feindslayer", 
   "I am assuming that your next arguements would be:\n \n To that I would then ask the question:\n \n If you kill an egg (through contraception) minutes before possible conception, is it murder?\n \n If you follow the same line of thought as you have been taking, then you would have to say yes, and outlaw all contraception. Instead, I say that your line of thought itself is flawed.\n\n \n If the cell has not even been fertilized, then it is not even a human life yet. Thereby, it would be pointless to even go back that far in the first place.", 
   {
    "post_info": {
     "post_title": "A little flaw in your post, pal"
    }
   }, 
   283785, 
   null, 
   1189820580.0
  ], 
  [
   283884, 
   null, 
   "samiinh", 
   "If the cell has not even been fertilized, then it is not even a human life yet. Thereby, it would be pointless to even go back that far in the first place.\n\n \n And if a cell has been fertilized, is it a person?", 
   {}, 
   283879, 
   null, 
   1189823040.0
  ], 
  [
   283906, 
   null, 
   "chemist99a", 
   "Worse yet what if the sperm has penetrated the egg and fertilization will clearly take place in short order but one stops the process before the genomes are integrated?????????", 
   {}, 
   283884, 
   null, 
   1189827060.0
  ], 
  [
   283959, 
   null, 
   "Winston Smith", 
   "this thread is getting sillier and sillier emoticon_rolleyes", 
   {}, 
   283906, 
   null, 
   1189863300.0
  ], 
  [
   283960, 
   null, 
   "samiinh", 
   "this thread is getting sillier and sillier emoticon_rolleyes\n\n \n Not to the supposed pro-lifers who support war in iraq and the death penality.", 
   {}, 
   283959, 
   null, 
   1189863420.0
  ], 
  [
   283963, 
   null, 
   "Winston Smith", 
   "pro-lifers supporting war and death penalty? \n \n maybe they only support life after death ? emoticon_xangel", 
   {}, 
   283960, 
   null, 
   1189863840.0
  ], 
  [
   284020, 
   null, 
   "samiinh", 
   "pro-lifers supporting war and death penalty? \n \n maybe they only support life after death ? emoticon_xangel\n\n \n Yes, they do that as well, even though there is no such thing. They are really messed up.", 
   {}, 
   283963, 
   null, 
   1189892280.0
  ], 
  [
   284052, 
   null, 
   "chemist99a", 
   "If the cell has not even been fertilized, then it is not even a human life yet. Thereby, it would be pointless to even go back that far in the first place.\n\n \n So if its not human then what is it? Its as human as any other cell. It has all potential of becoming a person as any cell from a human does. And surely its from a human and its surely alive. After all if its not alive it certainly cannot be fertilized and lead eventually to a child and if its not human but is alive when its fertilized then the result is NOT going to be human is it? Human life is continuous unless it ends in death. You are the child of a human being, as such every generation before you was alive and human and if anywhere along the way if the chain of human life were to terminate before your ancestral chain was established you would not exist. Life begets life. Dead cells do not beget life.", 
   {}, 
   284020, 
   null, 
   1189913580.0
  ], 
  [
   284117, 
   null, 
   "samiinh", 
   "So if its not human then what is it? Its as human as any other cell. It has all potential of becoming a person as any cell from a human does. And surely its from a human and its surely alive. After all if its not alive it certainly cannot be fertilized and lead eventually to a child and if its not human but is alive when its fertilized then the result is NOT going to be human is it? Human life is continuous unless it ends in death. You are the child of a human being, as such every generation before you was alive and human and if anywhere along the way if the chain of human life were to terminate before your ancestral chain was established you would not exist. Life begets life. Dead cells do not beget life.\n\n \n Well, that's a big assumption. He could be an SOB.", 
   {}, 
   284052, 
   null, 
   1189948680.0
  ], 
  [
   284266, 
   null, 
   "Another opinion", 
   "If the cell has not even been fertilized, then it is not even a human life yet. Thereby, it would be pointless to even go back that far in the first place.\n\n It is human life, as all the cells of our body are human. It simply needs the extra step of fertilization in order to start the growth process that will eventually lead to someone like you and me. The only thing that differentiates it from a newly fertilized zygote is:\n 1) A full set of human DNA as opposed to a half set for the egg.\n 2) The growth process has started for a zygote but needs the fertilization step to start growth for the egg.\n \n Which of those criteria are the necessary ones for you to define something as murder? Or is there some other criteria that I have not included, such as a belief on your part that a zygote has a soul?", 
   {}, 
   283879, 
   null, 
   1190045160.0
  ], 
  [
   285323, 
   null, 
   "VTCruiser", 
   "Not to the supposed pro-lifers who support war in iraq and the death penality.\n\n \n there you go again...\n \n you dont support the death penalty which would kill a person who committs a drastic crime...\n \n YET\n \n You support the killing of the most innocent in our country.. the unborn, WHO HAVENT COMMITTED A CRIME!\n \n Sounds like hypocrisy to me....\n \n Question, if a pregnant woman in iraq gets killed by shrapnel... Do you call that 2 deaths or 1? With what i have read on here, you seem to think a fertalized egg isnt a human... so what is your answer to this question??", 
   {}, 
   283960, 
   null, 
   1190835960.0
  ], 
  [
   285324, 
   null, 
   "VTCruiser", 
   "Not to the supposed pro-lifers who support war in iraq\n\n \n by the way, i think any human being hates war. just watch WW2 documentaries and you will see a real war (in comparison to the one you are crying about today) with people STILL ALIVE remembering the ATROCITIES they went through and what their 2 eyes saw..saying they wished they didnt have to go but they knew it was right.\n \n A real war = WW2 = 50 million lives DEAD (which is as many as have died due to abortion in our land i might add. Now adding that up, thats 100 milllion lives lost since 1940.)\n \n War happens.. You cant tell me that it doesnt and wont continue to happen. end of discussion.", 
   {}, 
   283960, 
   null, 
   1190836260.0
  ], 
  [
   285340, 
   null, 
   "jitobear", 
   "War happens.. You cant tell me that it doesnt and wont continue to happen. end of discussion.\n\n \n The same could be said for abortion.", 
   {}, 
   285324, 
   null, 
   1190847240.0
  ], 
  [
   285370, 
   null, 
   "Falsefaith", 
   "Pro-life is just as 'bad' as pro-choice, so don't get all self righteous. \n \n Pro-life cares more about the unborn, while pro-choice cares more about the already established life. When pro-life extremists go and bomb clinics... it's a little hypocritical, when they ban a safe way of getting abortions, it's a little hypocritical... Pro-life may save the \"lives\" of many fetuses whom cannot live outside of the womb... but they can damage/end the life of the female by not considering what situation she may be in (ie. abusive household, rape, poorly educated...etc). \n \n What's the point of making pro-choice people sound like it's a 'walk in the park' to get abortions for them? I don't think any of us want abortions but I believe pro-choice people understand that they do happen and why it is that they happen. \n \n [For myself: Pro early abortions only... when the fetus isn't developed. \n And as long as the person isn't using it as birth control...]", 
   {}, 
   285340, 
   null, 
   1190861880.0
  ], 
  [
   285381, 
   null, 
   "Steeeeve", 
   "What's the point of making pro-choice people sound like it's a 'walk in the park' to get abortions for them? I don't think any of us want abortions but I believe pro-choice people understand that they do happen and why it is that they happen. \nIt would be a walk in the park if there is nothing morally wrong with it. It would be as if you were cutting your toe nail. If one is claiming otherwise I'd question why they think that way and perhaps a sense of guilt is coming in.", 
   {}, 
   285370, 
   null, 
   1190872920.0
  ], 
  [
   285386, 
   null, 
   "chemist99a", 
   "It would be a walk in the park if there is nothing morally wrong with it. It would be as if you were cutting your toe nail. If one is claiming otherwise I'd question why they think that way and perhaps a sense of guilt is coming in.\n \n \n Very well then its a walk in the park. There is nothing morally wrong with abortion in the early phases of fetal development. And NO its not like cutting your toenail - the procedures are not nearly that simple and there is some risk involved.", 
   {}, 
   285381, 
   null, 
   1190879460.0
  ], 
  [
   286996, 
   null, 
   "thecap0", 
   "Very well then its a walk in the park. There is nothing morally wrong with abortion in the early phases of fetal development. And NO its not like cutting your toenail - the procedures are not nearly that simple and there is some risk involved.\n\n \n In any case, the question was, is, and still remains: Who gets to decide?\n \n If the choices are the pregnant woman or some nameless, faceless government bvureaucrat, I will trust the woman's judgment every time.\n \n Any votes for the bureaucrat? emoticon_smile", 
   {
    "post_info": {
     "post_title": "Life is too short to live it in Tejas or in ignorance - but I repeat myself!"
    }
   }, 
   285386, 
   null, 
   1191808260.0
  ], 
  [
   287000, 
   null, 
   "obvious_child", 
   "\n Any votes for the bureaucrat? emoticon_smile\n\n \n As a Conservative, I must protest any increase of federal or state power into the private matters of citizens.", 
   {}, 
   286996, 
   null, 
   1191808800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  life", 
  "url": "http://www.4forums.com/political/abortion-debates/10332-life.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 10332, 
  "discussion_files": [
   [
    "22726.html", 
    "http://www.4forums.com/political/abortion-debates/10332-life-print.html"
   ], 
   [
    "22727.html", 
    "http://www.4forums.com/political/abortion-debates/10332-life-7-print.html"
   ], 
   [
    "22728.html", 
    "http://www.4forums.com/political/abortion-debates/10332-life-5-print.html"
   ], 
   [
    "22729.html", 
    "http://www.4forums.com/political/abortion-debates/10332-life-4-print.html"
   ], 
   [
    "22730.html", 
    "http://www.4forums.com/political/abortion-debates/10332-life-6-print.html"
   ], 
   [
    "22731.html", 
    "http://www.4forums.com/political/abortion-debates/10332-life-3-print.html"
   ], 
   [
    "22732.html", 
    "http://www.4forums.com/political/abortion-debates/10332-life-2-print.html"
   ]
  ], 
  "identifier": 10332
 }
]