[
 [
  [
   282835, 
   null, 
   "thelmoose", 
   "For all you atheists out there, when you were raised by your family, what was the religious environment?", 
   {
    "post_info": {
     "post_title": "Poll for atheists"
    }
   }, 
   null, 
   null, 
   1189210500.0
  ], 
  [
   282837, 
   null, 
   "samiinh", 
   "I grew up in the Methodist Church. My parents were very active in the church. I'm not so sure how much they actually believed, but as kids growing up, religious education was part of what we were given. I think I was the only senior in my high school class that still attended Sunday School. I was active in the youth fellowship as well. I attended summer church camp for many years. I also attended a National Methodist Youth Convocation at Purdue University the summer of 1957.\n \n Then I went to college and I lost it all when challenged by the books we read in Religion 101.", 
   {}, 
   282835, 
   null, 
   1189211280.0
  ], 
  [
   282838, 
   null, 
   "sinjin", 
   "Irish Catholics on one side, French/Spanish Catholics on the other. My Dad has three sisters. All three are nuns.emoticon_wow", 
   {}, 
   282837, 
   null, 
   1189211460.0
  ], 
  [
   282839, 
   null, 
   "thelmoose", 
   "I voted devout. \n \n I was raised Catholic, went to parochial school (altar boy and all). Dad was first gen Italian very religious. Mom believes but goes through the motions. They still persist in asking if I go to church though I stopped 30 years ago. \n 2/4 kids atheist. Another goes to church for his wife. The 4th is nuts and I think she is still Catholic.", 
   {}, 
   282838, 
   null, 
   1189212360.0
  ], 
  [
   282842, 
   null, 
   "GiantOreo", 
   "I voted devout as well.\n \n I was raised Christian (Baptist denomination), and went ot a private school for both grade school and high school. As I started going to college, I began to seriously question the faith, as I have a scientist-oriented mind and need to see evidence to \"believe\" in such things - I could see none for religion. \n \n Over several years of struggle, I eventually successfully rejected the Christian faith totally. I had several atheist friends in college, and they were very valuable in helping me deconvert, and reverse all of the hangups/brainwashing that my childhood indoctrination in Christianity had left me with.", 
   {}, 
   282839, 
   null, 
   1189213080.0
  ], 
  [
   282843, 
   null, 
   "MrWriteLA", 
   "My dad's parents were devout Norwegian Lutherans... picture of Jesus on the wall and alll that... but I saw them rarely after the divorce where I was very young. My mom's family was Presbyterian, sent me occasionally to Sunday school, which I loathed. I thought it was all BS from the start, though I liked the maps in the Bible, and some of the hymns.", 
   {}, 
   282842, 
   null, 
   1189213500.0
  ], 
  [
   282874, 
   null, 
   "Easyrider", 
   " \"As soon as you concern yourself with the 'good' and 'bad' of your fellows, you create an opening in your heart for maliciousness to enter.\" - Morihei Ueshiba, founder of Aikido\n \n\n \n I guess Morihei Ueshiba would have let Hitler and a ton of other mass murderers skate forever, then.\n \n (\"Ohhh, making judgments on behavior is much worse than what the Hitlers do!\")\n \n And that's what's wrong with Ueshiba's mentality!\n \n Here's a more realistic one:\n \n \"The only thing required for evil to triumph is for good men to (say and) do nothing.\"", 
   {
    "unicode_changes_made": true
   }, 
   282843, 
   null, 
   1189221660.0
  ], 
  [
   282882, 
   null, 
   "fjp8000", 
   "BOTH MY PARENTS WERE RELIGIOUS CATHOLICS. MY MOTHER, IN PARTICULAR, WAS VERY DEVOUT.... AS WAS I. I WENT TO CHATHOLIC SCHOOLS AND RAISED MY CHILDREN AS CATHOLICS... WHAT A WASTE. \n \n ----------------------------------------------------------------------\n \n FAITH IS LIKE PLAYING POKER... YOU MAY FEEL YOU ARE GOING TO WIN, BUT THERE IS NO GUARANTEE THAT YOU WILL! YOU WILL HAVE TO WAIT UNTIL ALL THE CARDS ARE PLAYED.  emoticon_smile", 
   {
    "unicode_changes_made": true
   }, 
   282874, 
   null, 
   1189224900.0
  ], 
  [
   283053, 
   null, 
   "simone", 
   "I spent hours in a pew in a Lutheran church and was bored. Also, very disappointed in later life, when I discovered reality and racism and sexism and worldly evils, that the Lutheran ministers never taught me not to be racist, not to be bigoted, that they failed to teach me to respect all humans.", 
   {}, 
   282882, 
   null, 
   1189356720.0
  ], 
  [
   283071, 
   null, 
   "jitobear", 
   "I am actually closer to agnostic than atheist. \n \n I was raised Lutheran by parents who went through the motions until I was about 13. Then when I was a senior in high school I started attending a Congregationalist church on my own and was confirmed. During college and for a while after I explored pagan religions. Then I studied with Jehovahs Witnesses. When I was never able to reconcile what they believed I tried to be a Christian on my own. When a gay man came into and changed the lives of my son and myself, the face Christianity showed me was something I could never embrace. I then came to realize that the main flaw I found in Christianity I found in most religions. The minute people think they know \"the truth\" it seems to give them license to be as much of an XXX-hole as they want to those who believe otherwise. \n \n I am done with religion period. Maybe there is higher power - maybe not. I am perfectly content to admit I have no idea.", 
   {}, 
   283053, 
   null, 
   1189373940.0
  ], 
  [
   283097, 
   null, 
   "samiinh", 
   "My dad's parents were devout Norwegian Lutherans... picture of Jesus on the wall and alll that... but I saw them rarely after the divorce where I was very young. My mom's family was Presbyterian, sent me occasionally to Sunday school, which I loathed. I thought it was all BS from the start, though I liked the maps in the Bible, and some of the hymns.\n\n \n The hymns....I still love the old christer hymns. I also enjoy the music of Christmas. We go into Boston at Christmas to attend the advent service at the Trinity Church on Copleigh Square, mostly for the music (I also like the pomp and pageantry of the English church). The English know how to do ceremony.", 
   {}, 
   282843, 
   null, 
   1189384980.0
  ], 
  [
   283233, 
   null, 
   "Easyrider", 
   "When a gay man came into and changed the lives of my son and myself, the face Christianity showed me was something I could never embrace. I then came to realize that the main flaw I found in Christianity I found in most religions. The minute people think they know \"the truth\" it seems to give them license to be as much of an XXX-hole as they want to those who believe otherwise.\n\n \n Would that include people who \"think they know the truth\" that gay sex is not a sin, when in actuality it really is?", 
   {}, 
   283071, 
   null, 
   1189465080.0
  ], 
  [
   283235, 
   null, 
   "ShadowPikachu", 
   "Would that include people who \"think they know the truth\" that gay sex is not a sin, when in actuality it really is?\n\n \n Jito, we now see the perfect specimen of what you were talking about.", 
   {}, 
   283233, 
   null, 
   1189465440.0
  ], 
  [
   283238, 
   null, 
   "samiinh", 
   "Would that include people who \"think they know the truth\" that gay sex is not a sin, when in actuality it really is?\n\n \n You know, Easy, since you think gay sex is sin, I'd suggest you stop have it.", 
   {}, 
   283233, 
   null, 
   1189466040.0
  ], 
  [
   284255, 
   null, 
   "Ripskar", 
   "None of the above.\n \n My parents class themselves as CofE but haven't been to a church service in my memory. They had me baptised CofE so that they could send me to a Catholic school with a better educational record than the local school.", 
   {}, 
   282835, 
   null, 
   1190041500.0
  ], 
  [
   284274, 
   null, 
   "Waxy", 
   "I voted for half hearted.\n \n I consider myself agnostic rather that atheistic, details...\n \n My fathers side is Scottish Catholic, my mother's side a mix of French and Irish Catholic. My grandparents were quite devout, but my mother's parents lived a long ways away, and my father's parents, while devout, were not regular church goers later in life. \n \n My wife's side is entirely Italian Catholics, so needless to say, they are devout with a capital D. It does cause a little friction now and then between us, but we've pretty much come to an agreement, and I try to be on my best behavious when around them, especially the very outwardly devout ones. I think that's maybe why I come to boards like this, the golden rule of never talking religion or politics at the dinner table is one I don't break around family.\n \n I was raised Catholic, but neither parent was devout by any means. \n My parents dragged me, often literally, to church on Sundays until I was about 12, then they just gave up. The effort involved in dragging 3 boys to church every Sunday kicking and screaming eventually just wasn't worth it. (None of the 3 boys currently attends church or is outwardly religious, I think my younger brothers are still believers, they just are not outward or formal about it.) I think my father gave up for a couple of reasons - firstly, although his faith is strong, he's a rather typical Scotsman, and doesn't have much patience for the rigidity and rules of formal church services. Secondly, I don't think he thought it was right for him to force something onto his children that they clearly were not intersted in. Of course, he likes his NFL too. :p\n \n I never once enjoyed the church \"atmosphere\", the pomp and pretense. I remember having doubts and thinking much of teachings and beliefs I was being fed were nonsense, even as a young child. I went to catholic schools through grade 12, but I had very little use for the religious courses. All my friends were there, and the quality of the education offered was much better than that at the public schools, so looking back, I certainly don't regret it.\n \n There are certain things from my childhood that I still find very appealing. Certain gospel music/religious songs, Christmas, etc... are still strong and pleasant memories and times of the year.\n \n Anyhoo, enough rambling...\n \n Waxy", 
   {}, 
   284255, 
   null, 
   1190047680.0
  ], 
  [
   284362, 
   null, 
   "Phunting", 
   "I too voted half-hearted, though it's not quite true. \n \n Both my parents were atheist, but they were raised Church of England and sent me along to Sunday School as that's what all their friends did with their children.\n \n And of course I had it rammed down my throat by the state school constantly too. Thankfully I rejected it all soon enough.", 
   {}, 
   284274, 
   null, 
   1190079180.0
  ], 
  [
   284389, 
   null, 
   "Winston Smith", 
   "\"When I consider the fact that I have doubts, or that I am a thing that is incomplete and dependent, then there arises in me a clear and distinct idea of a being who is independent and complete, that is, an idea of God. And from the mere fact that there is such an idea within me, or that I who possess this idea exist, I clearly infer that God exists, and that every single moment of my entire existence depends on him ... And now, from this contemplation of the true God, in whom all the treasures of wisdom and the sciences, lie hidden, I think I can see a way forward to the knowledge of other things\" (Descartes)", 
   {
    "post_info": {
     "post_title": "Descartes on God"
    }, 
    "unicode_changes_made": true
   }, 
   284362, 
   null, 
   1190100660.0
  ], 
  [
   284419, 
   null, 
   "samiinh", 
   "\"When I consider the fact that I have doubts, or that I am a thing that is incomplete and dependent, then there arises in me a clear and distinct idea of a being who is independent and complete, that is, an idea of God. And from the mere fact that there is such an idea within me, or that I who possess this idea exist, I clearly infer that God exists, and that every single moment of my entire existence depends on him ... And now, from this contemplation of the true God, in whom all the treasures of wisdom and the sciences, lie hidden, I think I can see a way forward to the knowledge of other things\" (Descartes)\n\n \n I believe DeCartes also said that all one needs to understand about God, is \"I AM, therefore I AM.\"", 
   {
    "unicode_changes_made": true
   }, 
   284389, 
   null, 
   1190121900.0
  ], 
  [
   284528, 
   null, 
   "college_girl", 
   "My parents are both extremely religious, \"American-style\" evangelicals, i.e. they hang on James Dobson's every word, etc. Both sets of grandparents are half-hearted Catholics.\n \n I believe I was about six when I asked my Sunday school teacher how she knew the bible was true, and I never got a satisfactory answer. It took about ten more years to start shifting away from Christianity, and I have considered myself atheist for about five years now. \n \n I still go to church when I visit my parents, and fake being a christian. This cannot go on forever, but I know it will break my mother's heart to think that I am going to hell. Maybe it will become something we just don't discuss.", 
   {}, 
   284255, 
   null, 
   1190181180.0
  ], 
  [
   284634, 
   null, 
   "samiinh", 
   "My parents are both extremely religious, \"American-style\" evangelicals, i.e. they hang on James Dobson's every word, etc. Both sets of grandparents are half-hearted Catholics.\n \n I believe I was about six when I asked my Sunday school teacher how she knew the bible was true, and I never got a satisfactory answer. It took about ten more years to start shifting away from Christianity, and I have considered myself atheist for about five years now. \n \n I still go to church when I visit my parents, and fake being a christian. This cannot go on forever, but I know it will break my mother's heart to think that I am going to hell. Maybe it will become something we just don't discuss.\n\n \n \n I think you'd be surprised how many others are \"faking\" their faith. Just look at Bush...now there's a real fake.", 
   {}, 
   284528, 
   null, 
   1190249400.0
  ], 
  [
   284640, 
   null, 
   "thelmoose", 
   "I think you'd be surprised how many others are \"faking\" their faith. Just look at Bush...now there's a real fake.\n\n \n Bush notwithstanding, lots of folks fake it, not just intermittently to their families, but some are regular churchgoers. Some people have church and the churchies as their entire social life. They (think they) know no non-believers. To admit one's non-belief to others can be devasting to an individual when they know the reaction that will occur from family and friends. More than one person has been ejected from the family for apostasy. Their life would crumble to \"come out\" as atheist. \n \n My parents know I don't go to church but they would snap if I told them I don't believe God. They are too old to change and the information would serve no purpose other then to worry them about the fate of my soul for the rest of their lives. I don't have to fake anything really. It's easy to not talk about it. We are Catholic and the motto is: \"If you ignore it, it will go away\" We ignore all kinds of stuff.", 
   {}, 
   284634, 
   null, 
   1190253240.0
  ], 
  [
   284647, 
   null, 
   "Zardoz", 
   "As I've said in the past, I agree that many fake it or are simply going through the motions. Others really don't even think about it. Saying they're believers but simply don't practice.\n \n I find many in the various churches I go to to be that way.\n \n Simply possessing NO realistic Christian mannerisms or practices.\n Fornicating \"tru-b'lievers\".\n Spousal abusing pontificators.\n Cursing, gambling, alcoholic drunkards who neglect their children, watch porn and can't wait until the sermon is over so they can go fishing.", 
   {}, 
   284640, 
   null, 
   1190257320.0
  ], 
  [
   284655, 
   null, 
   "college_girl", 
   "Bush notwithstanding, lots of folks fake it, not just intermittently to their families, but some are regular churchgoers. Some people have church and the churchies as their entire social life. They (think they) know no non-believers. To admit one's non-belief to others can be devasting to an individual when they know the reaction that will occur from family and friends. More than one person has been ejected from the family for apostasy. Their life would crumble to \"come out\" as atheist. \n .\n\n \n Well here in Vancouver it's not really an issue, as about 40% of the population identifies as non-religious, but I can't imagine the pressure on people in the US, where I believe about 90% (??) of people call themselves christians. And that societal pressure is on top of family pressure. \n \n I think it may be worse to come out as an atheist than to come out as gay to very religious parents.", 
   {}, 
   284640, 
   null, 
   1190261340.0
  ], 
  [
   284673, 
   null, 
   "samiinh", 
   "Well here in Vancouver it's not really an issue, as about 40% of the population identifies as non-religious, but I can't imagine the pressure on people in the US, where I believe about 90% (??) of people call themselves christians. And that societal pressure is on top of family pressure. \n \n I think it may be worse to come out as an atheist than to come out as gay to very religious parents.\n\n \n I think you could be right about that. There is a real stigmatism to being a non-believer.", 
   {}, 
   284655, 
   null, 
   1190286300.0
  ], 
  [
   284709, 
   null, 
   "Waxy", 
   "Bush notwithstanding, lots of folks fake it, not just intermittently to their families, but some are regular churchgoers. Some people have church and the churchies as their entire social life. They (think they) know no non-believers. To admit one's non-belief to others can be devasting to an individual when they know the reaction that will occur from family and friends. More than one person has been ejected from the family for apostasy. Their life would crumble to \"come out\" as atheist. \n \n My parents know I don't go to church but they would snap if I told them I don't believe God. They are too old to change and the information would serve no purpose other then to worry them about the fate of my soul for the rest of their lives. I don't have to fake anything really. It's easy to not talk about it. We are Catholic and the motto is: \"If you ignore it, it will go away\" We ignore all kinds of stuff.\n\n \n Another dead on post Thelmoose.\n \n This is pretty much exactly how I see it too. I don't want to say it's the same thing, because it certainly is not, but I think it is somewhat analagous to being gay and coming out of the closet. \n \n Standing up and the dinner table and declaring yourself an atheist would set off a whole chain of events and reactions that can't be reversed. You're not only declaring your own non-belief, but you're challenging everyone else's beliefs and intellect at the same time. It draws a clear line in the sand between you and them.\n \n I know I've faked it for most of my life, and I will continue to do so around the majority of my friends and family. It's simply easier, as you've said, to ignore it and simply never speak of it more than superficially.\n \n Waxy", 
   {}, 
   284640, 
   null, 
   1190308260.0
  ], 
  [
   284715, 
   null, 
   "jyoshu", 
   "but I can't imagine the pressure on people in the US, where I believe about 90% (??) of people call themselves christians.\n \n \n Oh for goodness' sake, I've never heard of anyone having a serious problem being known as an atheist. emoticon_rolleyes There are plenty enough people around who at least don't hold that strongly to religion that atheists are not going to have trouble finding people to know and enjoy their time with. There are many things \"stigmatized\" in our society; I'm sure there are things about me that some don't care for either. It's all about whether you are going to let things like that bother you. It's not like rabid \"anti-atheism\" is a big problem in our society, any more so than simply disagreement over ideology anyway. (And frankly, if one can't deal with that, I'm not sure how they could function in a pluralistic world.)", 
   {}, 
   284709, 
   null, 
   1190311020.0
  ], 
  [
   284716, 
   null, 
   "jyoshu", 
   "Standing up and the dinner table and declaring yourself an atheist would set off a whole chain of events and reactions that can't be reversed. You're not only declaring your own non-belief, but you're challenging everyone else's beliefs and intellect at the same time. It draws a clear line in the sand between you and them.\n\n \n At the same time, I can just as easily imagine that standing up at the dinner table declaring oneself having become religious to a family of strong-willed atheists would also \"set off a whole chain of events and reactions that can't be reversed\" and draw such a line in the sand. Every situation is different, and if a family is that way, then their problem isn't that they are religious/atheist, but rather that they simply need to be accepting to their family members regardless of ideology (or lack thereof). I know if one my family members stood up and said such a thing I'd love them no less and accept them no less.", 
   {}, 
   284709, 
   null, 
   1190311620.0
  ], 
  [
   284717, 
   null, 
   "Waxy", 
   "At the same time, I can just as easily imagine that standing up at the dinner table declaring oneself having become religious to a family of strong-willed atheists would also \"set off a whole chain of events and reactions that can't be reversed\" and draw such a line in the sand.\n\n \n Likely so, doesn't change anything regarding the issue of the first post. In fact, I'm not sure what significance that has whatsoever regarding the topic, other than to make you feel a little better.\n \n \nEvery situation is different, and if a family is that way, then their problem isn't that they are religious/atheist, but rather that they simply need to be accepting to their family members regardless of ideology (or lack thereof). I know if one my family members stood up and said such a thing I'd love them no less and accept them no less.\n\n \n Yes, of course you would, because you've shown yourself to be so loving and accepting regardless of circumstances... emoticon_rolleyes \n \n Waxy", 
   {}, 
   284716, 
   null, 
   1190313180.0
  ], 
  [
   284720, 
   null, 
   "jyoshu", 
   "Likely so, doesn't change anything regarding the issue of the first post. In fact, I'm not sure what significance that has whatsoever regarding the topic, other than to make you feel a little better.\n\n \n I was responding to your post, not the first post. It has nothing to do with anyone 'feeling better'; I'm not sure what you even mean by that.", 
   {}, 
   284717, 
   null, 
   1190318040.0
  ], 
  [
   284723, 
   null, 
   "jitobear", 
   "Would that include people who \"think they know the truth\" that gay sex is not a sin, when in actuality it really is?\n\n \n Sin is a religious idea. I'm sure it is religious truth for some that it is sin, I'm sure that for others it isn't. In the secular world it is consensual act between adults. I couldn't care less what any religion has to say on the matter.", 
   {}, 
   283233, 
   null, 
   1190320920.0
  ], 
  [
   284732, 
   null, 
   "sinjin", 
   "Sin is a religious idea. I'm sure it is religious truth for some that it is sin, I'm sure that for others it isn't. In the secular world it is consensual act between adults. I couldn't care less what any religion has to say on the matter.\nGotta love faith-based assertions of \"actuality\".", 
   {}, 
   284723, 
   null, 
   1190327700.0
  ], 
  [
   284735, 
   null, 
   "thelmoose", 
   "Oh for goodness' sake, I've never heard of anyone having a serious problem being known as an atheist. There are plenty enough people around who at least don't hold that strongly to religion that atheists are not going to have trouble finding people to know and enjoy their time with.\n \n \n Many people have problems with people being atheists. I can't tell you how many times people have picked up on my lack of religiosity and questioned, eyes bugged, \"You're not an atheist, are you?\" Why is it NO politician could ever admit they are atheist? Statistically speaking, there has to be some. That Univ of Minn study showed that atheists were the least trusted \"segment\" in US society. They held gays in higher regard. \n \n \nThere are many things \"stigmatized\" in our society; I'm sure there are things about me that some don't care for either. \n\n \n Nooooooo.\n \n \n \n \n This is pretty much exactly how I see it too. I don't want to say it's the same thing, because it certainly is not, but I think it is somewhat analagous to being gay and coming out of the closet. \n \n\n \n I think there is a completely apt analogy there. \n \n \n Standing up and the dinner table and declaring yourself an atheist would set off a whole chain of events and reactions that can't be reversed. You're not only declaring your own non-belief, but you're challenging everyone else's beliefs and intellect at the same time. It draws a clear line in the sand between you and them.\n \n I know I've faked it for most of my life, and I will continue to do so around the majority of my friends and family. It's simply easier, as you've said, to ignore it and simply never speak of it more than superficially.\n \n Waxy\n\n \n Agreed. It is something you whisper lest the religious will have a conniption. I have known people to get very upset because I don't believe what they do. \n \n It really is perceived as a challenge to some. Are they defensive?? I don't get it.", 
   {}, 
   284732, 
   null, 
   1190328360.0
  ], 
  [
   284737, 
   null, 
   "sinjin", 
   "Have we forgotten what the Boy Scouts did a few years ago?", 
   {}, 
   284735, 
   null, 
   1190329140.0
  ], 
  [
   284738, 
   null, 
   "Waxy", 
   "Agreed. It is something you whisper lest the religious will have a conniption. I have known people to get very upset because I don't believe what they do. \n \n It really is perceived as a challenge to some. Are they defensive?? I don't get it.\n\n \n \nYou're not only declaring your own non-belief, but you're challenging everyone else's beliefs and intellect at the same time.\n\n \n I think you make an important distinction here that I failed to make in my first post, the challenge to their beliefs is in no way intended or direct, but it is rather, as you've stated, a perceived challenge. Unfortunately, the reaction to that perceived challenge is generally swift and passionate.\n \n Waxy", 
   {}, 
   284735, 
   null, 
   1190330280.0
  ], 
  [
   284739, 
   null, 
   "Waxy", 
   "I was responding to your post, not the first post. It has nothing to do with anyone 'feeling better'; I'm not sure what you even mean by that.\n\n \n Of course you don't, it's such a natural action for you that there's no real thought put into it. \n \n Much the same as a child caught doing wrong would say \"Well Billy did it too!\" to try and deflect attention and lessen their wrongdoings.\n \n Irrelevent to the issue at hand, in my post, or the OP.\n \n Waxy", 
   {}, 
   284720, 
   null, 
   1190330760.0
  ], 
  [
   284744, 
   null, 
   "jyoshu", 
   "Of course you don't, it's such a natural action for you that there's no real thought put into it. \n\n \n Why are you using ad hominem here? There's no need in it. If you think what I'm saying is not correct, all you need to do is just say why. \n \n It's not irrelevant, by the way. It is most relevant. The idea that atheists \"fake it\" because of society looking down upon them means they are afraid of something. And with all due respect, there's just no reason they should be afraid. It's just society disagreeing with them and having a different view.", 
   {}, 
   284739, 
   null, 
   1190331360.0
  ], 
  [
   284747, 
   null, 
   "Zardoz", 
   "And let's not forget that if you mention you lack of belief to the wrong sorts, you can be harrassed by some seeking to convert you or make you see the error of your ways.", 
   {}, 
   284739, 
   null, 
   1190331540.0
  ], 
  [
   284749, 
   null, 
   "sinjin", 
   "Present-day discrimination\n \n United States-\n \n In the 1988 U.S. presidential campaign, Republican presidential candidate George H. W. Bush reportedly said, \"I don't know that atheists should be regarded as citizens, nor should they be regarded as patriotic. This is one nation under God.\" In the United States, there is widespread disapproval of atheists. For example, according to motherjones.com, 52% of Americans claim they would not vote for a well-qualified atheist for president. More recently a 2007 Gallup poll produced nearly identical results. A 2006 study at the University of Minnesota showed atheists to be the most mistrusted minority among Americans...\n http://www.answers.com/topic/discrimination-against-atheists\n \n Gray, Tennessee: Carletta Sims joined a financial firm in June 2001. Shortly afterward, two Baptist coworkers took offense upon learning that Sims was an atheist. Management granted the coworkers' request to be assigned workspaces further from Sims. When Sims complained about a picture of Jesus left on her computer, management discharged her. Sims filed suit, seeking $250,000; U.S. District Judge Thomas Hull ruled that \"religious discrimination (or preferential treatment of Christians) can be inferred.\" In January 2004, the major bank that had since acquired the firm settled with Sims for an undisclosed amount.\n \n Ada, Oklahoma: A Baptist student told a local newspaper she wouldn't take professor William Zellner's classes because he was an atheist, triggering a flurry of abuse. Zellner received harassing notes and telephone calls, some threatening. His car was vandalized, for a time on a daily basis. A local church sold \"I am praying for Dr. Zellner\" buttons. His children experienced shunning and beatings from religious children.\n \n Minneapolis, Minnesota: First-grader Michael Bristor, an atheist, was denied an honor roll certificate when he refused to participate in an unconstitutional \"prayer time\" at a public school. For three years, administrators ignored the family's complaints until a lawsuit was filed.\n \n Caro, Michigan: In December 2001, Anonka-an open atheist who maintains a museum of Christian religious atrocities-appeared before the Tuscola County Board of Commissioners to challenge a nativity scene placed on public land. Commissioners responded angrily, saying she had no right to be present and proceeding to ridicule her. Anonka and her family suffered repeated harassment including annoyance calls, threatening calls and letters, and vandalism. In February 2004, the county settled in U.S. District Court, agreeing to pay an undisclosed sum and to issue a \"public expression of regret.\"\n \n Pocopson, Pennsylvania: My own atheism came to prominence when I became involved in a legal challenge to a Ten Commandments plaque on the wall of the Chester County, Pennsylvania, courthouse. Neighbors organized a shunning campaign, some area merchants refused to do business with me, and I received hundreds of threatening letters and phone calls. (The depth of public animus against me became a subject of local news and magazine coverage.) I was forced to close my interior decorating business because of death threats that compelled me to stop visiting the homes of persons unknown to me.\n \n Calgary, Alberta: An eleven-year-old boy (name withheld) experienced daily physical attacks and threats against his life by schoolmates-notably the sons of three local pastors-after protesting intercom readings of the Lord's Prayer in a public school. He was repeatedly body-checked into hallway walls and attacked in the rest rooms. One pastor's son stalked him with a butcher knife in an empty portable classroom. Despite the seriousness of this incident, no action was taken. The boy's parents transferred him to another school for his own safety.\n http://www.secularhumanism.org/library/fi/downey_24_4.htm\n \n http://www.americanchronicle.com/articles/viewArticle.asp?articleID=25659\n \n www.youtube.com/watch?v=fPHnXrU5JzU", 
   {
    "unicode_changes_made": true
   }, 
   284747, 
   null, 
   1190332080.0
  ], 
  [
   284750, 
   null, 
   "college_girl", 
   "At the same time, I can just as easily imagine that standing up at the dinner table declaring oneself having become religious to a family of strong-willed atheists would also \"set off a whole chain of events and reactions that can't be reversed\" and draw such a line in the sand. Every situation is different, and if a family is that way, then their problem isn't that they are religious/atheist, but rather that they simply need to be accepting to their family members regardless of ideology (or lack thereof). I know if one my family members stood up and said such a thing I'd love them no less and accept them no less.\n\n \n The difference is that an atheistic family may think the religious person is mistaken or brainwashed, but without dire consequences, while a religious family will likely believe the atheist is destined for an eternity of torture in a lake of fire, possibly possessed by demons, influenced by satan, etc etc.\n \n I am accepting of my religious family but I am certain that I would be disowned if they were to find out about my lack of belief.", 
   {}, 
   284716, 
   null, 
   1190333280.0
  ], 
  [
   284751, 
   null, 
   "Waxy", 
   "Why are you using ad hominem here? There's no need in it. If you think what I'm saying is not correct, all you need to do is just say why. \n\n \n I did, and as per usual, it was either not understood or ignored. I apologize for point that out.\n \n \nIt's not irrelevant, by the way. It is most relevant.\n \n \n This point made by you - \n \n \nAt the same time, I can just as easily imagine that standing up at the dinner table declaring oneself having become religious to a family of strong-willed atheists would also \"set off a whole chain of events and reactions that can't be reversed\" and draw such a line in the sand.\n\n \n is completely irrelevent. See the child analogy for the reason that's so.\n \n If that doesn't work for you, then the old \"two wrongs don't make a right\" expression that it's based on should cover it.\n \n \nThe idea that atheists \"fake it\" because of society looking down upon them means they are afraid of something. And with all due respect, there's just no reason they should be afraid. It's just society disagreeing with them and having a different view.\n\n \n Really? Did you read sinjin's post? Thelmoose's? Do you value the thoughts and feelings of your friends and family? Does the idea of distancing yourself from them, especially on such a fundamental issue, not merit some caution in your actions? \n \n Simple disagreement would be fine, but it seldom if ever stops there. Surely you aren't so blind as to not be able to see that.\n \n Waxy", 
   {}, 
   284744, 
   null, 
   1190334900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Poll for atheists", 
  "url": "http://www.4forums.com/political/religion-debates/10339-poll-atheists.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10339, 
  "discussion_files": [
   [
    "32068.html", 
    "http://www.4forums.com/political/religion-debates/10339-poll-atheists-print.html"
   ], 
   [
    "32069.html", 
    "http://www.4forums.com/political/religion-debates/10339-poll-atheists-3-print.html"
   ], 
   [
    "32070.html", 
    "http://www.4forums.com/political/religion-debates/10339-poll-atheists-2-print.html"
   ]
  ], 
  "identifier": 10339
 }
]