[
 [
  [
   282895, 
   null, 
   "richbrmly", 
   "If your born in America, a college degree can cost more than most people can save in a life time. Yet if your Indian or Asian, you can get one very easily and getting a seat in college is hardly an issue.\n \n Our recruitment of skilled labor all over the world hurts everyone reading this. There is no way you can compete with them and now the costs of a degree can not justify getting one. They are keeping the salaries down.", 
   {
    "post_info": {
     "post_title": "Americans enjoy the least opportunities"
    }
   }, 
   null, 
   null, 
   1189258500.0
  ], 
  [
   282980, 
   null, 
   "E Mutz", 
   "Forgive me if I am missing your point, but I am puzzled at your suggestion that college is too expensive and not worth the cost.\n \n I can drive 10 miles down the road to the local State college and get a Bachelor's Degree for $3,800.00 per year, tuition and fees. At $15,200 for a four year degree, that is hardly more than most folks will make in a lifetime. According to cnnmoney.com, The average tuition at four-year public colleges and universities is $5,836 for the 2006-07 school year. \n \n Check the US Census Bureau Stats for the difference between incomes of high school and bachelor's degree holders. Again, hardly beyond attainment.\n \n According to the US Census Bureau persons with doctorates in the United States had an average income of roughly $81,400. ... earnings ranged from $18,900 for high school dropouts to $25,900 for high school graduates, $45,400 for college graduates and $99,300 for workers with professional degrees (M.D., D.O., J.D., D.D.S., or D.V.M.). (Wikipedia) In essence, the college student who invests $20,000 in a four-year degree, will more than recoup that investment as evidenced by the statistics. \n \n Those are the US Census data my good man. So unless ye anticipate making less than $6,000 over the course of your lifetime I don't see your point. I have a wife in college and am actively saving for a daughter while completing my masters degree. We are getting on quite well and not at all intimidated by Asians or Indians. But thank you for your concern.", 
   {
    "unicode_changes_made": true
   }, 
   282895, 
   null, 
   1189298580.0
  ], 
  [
   283044, 
   null, 
   "richbrmly", 
   "Forgive me if I am missing your point, but I am puzzled at your suggestion that college is too expensive and not worth the cost.\n \n I can drive 10 miles down the road to the local State college and get a Bachelor's Degree for $3,800.00 per year, tuition and fees. At $15,200 for a four year degree, that is hardly more than most folks will make in a lifetime. According to cnnmoney.com, The average tuition at four-year public colleges and universities is $5,836 for the 2006-07 school year. \n \n Check the US Census Bureau Stats for the difference between incomes of high school and bachelor's degree holders. Again, hardly beyond attainment.\n \n According to the US Census Bureau persons with doctorates in the United States had an average income of roughly $81,400. ... earnings ranged from $18,900 for high school dropouts to $25,900 for high school graduates, $45,400 for college graduates and $99,300 for workers with professional degrees (M.D., D.O., J.D., D.D.S., or D.V.M.). (Wikipedia) In essence, the college student who invests $20,000 in a four-year degree, will more than recoup that investment as evidenced by the statistics. \n \n Those are the US Census data my good man. So unless ye anticipate making less than $6,000 over the course of your lifetime I don't see your point. I have a wife in college and am actively saving for a daughter while completing my masters degree. We are getting on quite well and not at all intimidated by Asians or Indians. But thank you for your concern.\n\n \n Your welcome.", 
   {
    "unicode_changes_made": true
   }, 
   282980, 
   null, 
   1189351740.0
  ], 
  [
   283045, 
   null, 
   "Symbiote", 
   "Correlation is not causation, the people who attend college are those most likely to succeed already. They come from wealthier backgrounds, have higher IQs, and are more success driven than their non-college-going peers.\n \n So it is unclear how much of the income disparity is attributable to the education itself. Then deduct from this time spent attending college that could have been spent in employment.", 
   {}, 
   283044, 
   null, 
   1189352820.0
  ], 
  [
   283059, 
   null, 
   "daewoo", 
   "Correlation is not causation, the people who attend college are those most likely to succeed already. They come from wealthier backgrounds, have higher IQs, and are more success driven than their non-college-going peers.\n \n So it is unclear how much of the income disparity is attributable to the education itself. Then deduct from this time spent attending college that could have been spent in employment.\n\n \n Agreed.\n \n I have a brother who is a mechanic. He made just over $85,000 last year. I know a lot of people with masters degrees that don't do that well, and likely never will. \n \n In my personal experience most college degrees (outside of hard sciences) are superfluous trash. All a business degree really tells an employer is that the job candidate is PROBABLY able to read, write, and perform math at an 8th grade level. No more, no less. \n \n The degree, IMO, may give you a leg up (depending on what the degree is in) immediately after graduating from college. By the time you have been out of school for 5 years, what you have actually accomplished is what matters, not what kind of paperwork you have. \n \n Personally when I go through resumes I \"round file\" any that claim 10 years or more of experience if they included an \"education\" section. Frankly if after 10 years in the field they have not managed to rack up enough accomlishments and experience to fill a 1 or 2 pg resume without having to add half a page about their outdated degree I am not interested. \n \n The trick there (for those of you out there who did not get a degree) is to switch jobs after you have attained a position for which a degree would be customary. You can typically work yoru way up in a company to a manager level then you kind of hit a glass ceiling because the fact you don't have a degree MAY come into play when they consider you for further promotion, and they know you don't have a degree because they have a file on you from day one, when you filled out the original application or supplied your original resume. \n \n Once you hit that glass ceiling, apply for the same position at another company. For example, if you are a manager, apply for a job as a manager at a similar company. Don't put an \"education\" section on your resume and odds are they will never ask. \n \n Another kind of clever dodge I have seen when it comes to education came from a guy who works for my dad. He is in a directors level position and makes probably around $200,000 per year including bonuses. He included an education section on his resume but instead of listing any traditional education, he listed continuing education courses he had attended (management courses, construction sciences courses, etc....). When dad asked him about it, he told him \"A college degree that is more than 5 or 10 years old is pretty much just worthless window dressing. I have tried to keep my education current so I catch industry advancements as they happen\". The guy had a glowing list of recommendations and an impressive list of accomplishments, so he got the job.\n \n 6 months ago I was at my sisters wedding reception and had had a little (OK...maybe a lot) too much to drink and I was standing around outside smoking cigarettes (which is a pretty reliable indicator that what I had was closer to \"lot\" than \"little\") and talking to that guy and my little brother who jsut headed off to college. I was telling my brother to get the paper, get out, and get some experience, or to try to get as much experiecne as he could while still in school because the paper did not actually mean that much. I am prone to giving unsolicited advice when I am less than perfectly sober.\n \n Dads employee started laughing and I asked him what was so funny. He said \"I never got past the 9th grade\". That is apparently why he did his resume like he did and gave the answers that he did when asked about it. Not only did he not have a degree, he didn't even graduate from high school. \n \n I guess what I am trying to say is that a degree gets your foot in the door. It helps get you a chance to show what you can do. Lack of a degree does not, IMO, limit anybody except for hard sciences (no matter how hard you work, you need an engineering degree to be an engineer, a medical degree to be a doctor, etc...).", 
   {}, 
   283045, 
   null, 
   1189365360.0
  ], 
  [
   283066, 
   null, 
   "Steeeeve", 
   "I'm not sure a degree is always worthless. With my many jobs a masters degree or an undergrad degree is required to even do the job. I know as an accountant you can't get beyond cashier if you don't have a degree and you can't get beyond level 1 auditor if you don't have a CPA which requires a degree to even sit for. \n \n In reality, a undergrad degree is pretty much a high school extension for many professions but for the jobs the require a certification it obviously is a worthy investment.", 
   {}, 
   283059, 
   null, 
   1189368960.0
  ], 
  [
   283070, 
   null, 
   "daewoo", 
   "I'm not sure a degree is always worthless. With my many jobs a masters degree or an undergrad degree is required to even do the job. I know as an accountant you can't get beyond cashier if you don't have a degree and you can't get beyond level 1 auditor if you don't have a CPA which requires a degree to even sit for. \n \n In reality, a undergrad degree is pretty much a high school extension for many professions but for the jobs the require a certification it obviously is a worthy investment.\n\n \n I generally class accounting in with \"hard sciences\" and would certainly agree that you need a degree there. \n \n My biggest pet peave is business degrees. I have known a lot of people now, including family members, who have gotten business degrees. I have even hired people with business degrees. What the hell are they good for and exactly what the hell are they teaching people in business school? As far as I can tell it is certainly not anything practical about business.", 
   {}, 
   283066, 
   null, 
   1189370700.0
  ], 
  [
   283078, 
   null, 
   "Steeeeve", 
   "I generally class accounting in with \"hard sciences\" and would certainly agree that you need a degree there. \n \n My biggest pet peave is business degrees. I have known a lot of people now, including family members, who have gotten business degrees. I have even hired people with business degrees. What the hell are they good for and exactly what the hell are they teaching people in business school? As far as I can tell it is certainly not anything practical about business.\n\n \n I had to take the standard business classes during undergrad and they weren't exactly meaningful. In fact, those were generally the classes I did the worst in since I found them to be pointless so I wouldn't pay attention and then the tests are on specific business \"theories\" that I have a hard time believing actually work. I remember some readings talking about how awesome Dell's business strategy was and how everyone should go to that. Of course now they are talking about how that same strategy is really not that good and too costly to develop. \n \n My good friend got a degree in Management and he fully admits that the one reason he got the degree was to show early employers that he has a degree. He went into doing what he likes which is IT work for a company. My cousin got a degree in Management as well and now works selling insurance and hates it. \n \n My dad who is a psychologist even said that he only learned during his Masters and PhD programs. \n \n In short, it certainly does seem like a lot of majors are a waste of time but you get 4 years of fun and all else being equal the person with a degree is seen as more willing to go the extra mile. \n \n As an aside, it seems that not only is a degree not an indicator of how good of a worker you are but neither is a good resume or a good interview. A student with a 3.9 GPA, Student president, and slick answers on an interview is about as likely to be good as drawing names of applicants from a hat.", 
   {}, 
   283070, 
   null, 
   1189377300.0
  ], 
  [
   283082, 
   null, 
   "thelmoose", 
   "There is another reason to go to college. If all any employer want is a bachelor's degree in anything, why take bogus business classes? There are \"liberal arts\" types courses that, while they may not have any obvious practical advantage in the work place, you do learn something about the human condition. There is history, the arts, social sciences, and the \"hard\" sciences. Knowing a little bit about this and that has some value. You would need to be a serious student as well. Also, learning communication and writing skills is a huge asset. \n \n College isn't for everybody. I understand there are economic realities. Spending 15K to learn about Kierkegaard may seem frivolous. You can do that by going to the library. But knowledge about the human condition CAN help to make you a more well rounded person, which might make you a better citizen. Of course, there is many a student who has frittered 4 years dicking around drinking and taking basket weaving (what do basket weavers make anyway?), but there is something to be gained by obtaining a real meaty college education. Of course it is not the real world, it is often an isolation from the real world, but knowledge has some value. If nothing else, learning how to think is a valuable skill. It does depend upon the student deciding to take it seriously.", 
   {}, 
   283078, 
   null, 
   1189378320.0
  ], 
  [
   283105, 
   null, 
   "richbrmly", 
   "I am bringing up the issue of competition and how we the people are forced to fight for these high paid jobs with people that can nearly get a degree for free.\n \n I can argue numbers, but why do that? Clearly any numbers place americans at a disadvantage.", 
   {}, 
   282895, 
   null, 
   1189388220.0
  ], 
  [
   283106, 
   null, 
   "thelmoose", 
   "I am bringing up the issue of competition and how we the people are forced to fight for these high paid jobs with people that can nearly get a degree for free.\n \n I can argue numbers, but why do that? Clearly any numbers place americans at a disadvantage.\n\n \n The point is well taken.\n It has become more difficult to afford a college education. Somebody did quote some numbers above which aren't astronomical, but they are not peanuts. When I was in undergrad, the prices for state schools was dirt cheap. I lived at home, and with scholarships and grants I left school with no debt. I did have to work all four years (part time in school, full time in summer, but these were for personal expenses mostly) in addition to full time school, but it only took hard work to get a great education.", 
   {}, 
   283105, 
   null, 
   1189388820.0
  ], 
  [
   283114, 
   null, 
   "daewoo", 
   "I had to take the standard business classes during undergrad and they weren't exactly meaningful. In fact, those were generally the classes I did the worst in since I found them to be pointless so I wouldn't pay attention and then the tests are on specific business \"theories\" that I have a hard time believing actually work. I remember some readings talking about how awesome Dell's business strategy was and how everyone should go to that. Of course now they are talking about how that same strategy is really not that good and too costly to develop. \n \n My good friend got a degree in Management and he fully admits that the one reason he got the degree was to show early employers that he has a degree. He went into doing what he likes which is IT work for a company. My cousin got a degree in Management as well and now works selling insurance and hates it. \n \n My dad who is a psychologist even said that he only learned during his Masters and PhD programs. \n \n In short, it certainly does seem like a lot of majors are a waste of time but you get 4 years of fun and all else being equal the person with a degree is seen as more willing to go the extra mile. \n \n As an aside, it seems that not only is a degree not an indicator of how good of a worker you are but neither is a good resume or a good interview. A student with a 3.9 GPA, Student president, and slick answers on an interview is about as likely to be good as drawing names of applicants from a hat.\n\n \n LMAO. I have never managed to find anything that worked as a good indicator of how good an employee will be. The closest I have ever come is table manners. In my experience, people with good table manners tend to be better employees. My theory is that since they are conscientious about something as relatively minor as table manners, they will be conscientious about other things (like work) as well. They have to be comfortable with the manners. If they are forced then the person is just putting on a show. You are just looking for natural, good table manners. \n \n I can't help but wonder if maybe we would not be better off without business degrees. There seem to be an awful lot of stupid ideas that come out of business schools. For quite a while the entire business world was doing credit checks on potential employees because some nitwit somewhere at Duke thought that credit scores would be a reliable indicator of an individuals work performance. Companies did it for YEARS, then they actually did some studies and found that not only did credit scores not reliably predict an perspective employees future performance, but people with poor credit actually performed slightly higher as employees. \n \n The problem with just about every business theory that has ever been tried is that they are situation specific, but they are taught in our business schools as \"one size fits all\". Who could possibly forget the Japanese management craze??? That one belly flopped, but we spent years trying to duplicate Japanese business practices without recognizing that they were based on entirely foreign cultural and economic paradigms. \n \n You mention the dell strategy. The Dell strategy was EXCELLENT. It was PERFECT....for the market, the time, and the company in question. For any other company at any other time, serving any other market, it sucks. The only good business model I have ever seen (and incidentally Warren Buffet and Lee Iacoca agree with me 100%) is to try to stay flaxible, roll with the punches, and try not to do anything too stupid. I could tell people that over the phone, or hand out fliers, and it would be a LOT better education than people seem to be getting at business schools.", 
   {}, 
   283078, 
   null, 
   1189399020.0
  ], 
  [
   283116, 
   null, 
   "Steeeeve", 
   "Lets not forget the marketing majors. In my opinion these are the biggest frauds of all. Not only is there no great way to determine if one ad is better than another but there is no marketing \"strategy\" that makes any sense to me. Perhaps I don't understand since I am not a manager but it seems the only \"marketing\" you need is just getting your name known and explaining what you sell. \n \n Either way, the business school I attended was a joke except the accounting department which is overly difficult thanks to SoX. I took marketing and management classes and the most I got out of it was a good movie recommendation (Shawshank Redemption...very good movie). Finance and statistics were somewhat helpful so I can't crack on them too much.\n \n I got another funny story...I was in a senior level management class at one point and we had a case study of Krispy Kreme (since they just went public) and how they had an awesome strategy and their management team was top notch. Of course as you know the stock went from $40 to $4 after it turns out management was royally cooking the books. As an aside I might look to get some KKD stock since it is so cheap and probably undervalued. They won't ever go out of business since the brand name is so strong and they could be acquired.", 
   {}, 
   283114, 
   null, 
   1189400340.0
  ], 
  [
   283756, 
   null, 
   "E Mutz", 
   "\n \n I can argue numbers, but why do that? Clearly any numbers place americans at a disadvantage.\n\n \n Well for one thing it would elevate your position above the \"because I said so\" level. That would be one useful byproduct of providing data to back up your assertion.\n \n (Not BS'ing, but genuinely curious). In my experience I have not once had to fight for a high paying job against someone with a free foreign education. In what sectors does this occur?", 
   {}, 
   283105, 
   null, 
   1189745880.0
  ], 
  [
   284194, 
   null, 
   "richbrmly", 
   "Well for one thing it would elevate your position above the \"because I said so\" level. That would be one useful byproduct of providing data to back up your assertion.\n \n (Not BS'ing, but genuinely curious). In my experience I have not once had to fight for a high paying job against someone with a free foreign education. In what sectors does this occur?\n\n \n all the scientific levels", 
   {}, 
   283756, 
   null, 
   1189990920.0
  ], 
  [
   284195, 
   null, 
   "richbrmly", 
   "nursing\n Engineering above the masters levels\n Phd..\n \n Not that we don't have the minds. We don't have the time and money.", 
   {}, 
   284194, 
   null, 
   1189991100.0
  ], 
  [
   284199, 
   null, 
   "richbrmly", 
   "The report observes \"a troubling decline in the number of U.S. citizens who are training to become scientists and engineers, whereas the number of jobs requiring science and engineering training continues to grow.\" It shows that the United States now ranks 17th among the nations surveyed in the share of 18-to-24-year olds who earn natural science and engineering degrees.\n \n http://www.chemistry.org/portal/a/c/s/1/feature_pol.html?DOC=policymakers\\pol_nsb_report.html\n \n Its worse than reported. We are importing nurses and medical personel all over as well.\n \n My issue is that the cost for an american to get the same education is far greater.", 
   {
    "unicode_changes_made": true
   }, 
   284195, 
   null, 
   1189993740.0
  ], 
  [
   284371, 
   null, 
   "E Mutz", 
   "The report observes \"a troubling decline in the number of U.S. citizens who are training to become scientists and engineers, whereas the number of jobs requiring science and engineering training continues to grow.\" It shows that the United States now ranks 17th among the nations surveyed in the share of 18-to-24-year olds who earn natural science and engineering degrees.\n \n http://www.chemistry.org/portal/a/c/s/1/feature_pol.html?DOC=policymakers\\pol_nsb_report.html\n \n Its worse than reported. We are importing nurses and medical personel all over as well.\n \n My issue is that the cost for an american to get the same education is far greater.\n\n \n Well now we know what the problem was three years ago. The problem was not that the education was unavailable or unaffordable but that folks were not getting the right degrees. As a senior scientist at a large engineering firm I have some perspective on this field. Yes, we had more openings for engineers than we could fill, but we were not drawing from overseas. Moreover, the salaries we were offering to entry level civil, mechanical, and structural engineers would more than pay off that degree investment. Indeed, the shortage you describe actually INCREASES the wage that a qualified entry level candidate commands. This is good news, not bad. Kids, get your CE degree today!\n \n As to the question of medical education - who would want to chart a course through 6 years of medical school with the knowledge that our nation is contemplating a revamping of the whole medical field? I think that the medical and technical fields should be regarded separately as I believe the uncertainty surrounding medicine has a political component to it. \n \n I would not suggest that we are importing medical personnel as I doubt they arrive en masse in cattle cars. No, these professionals choose to come here for a reason: Opportunity for financial and professional gain. We should celebrate the fact that Doctors from around the world want to practice here, not consider it a problem.\n \n As a side note: Since that report came out my salary has increased 105%. Just thought I would add that little bit o' trivia for those wondering if the degree was worthwhile...", 
   {
    "unicode_changes_made": true
   }, 
   284199, 
   null, 
   1190082060.0
  ], 
  [
   284442, 
   null, 
   "richbrmly", 
   "Well now we know what the problem was three years ago. The problem was not that the education was unavailable or unaffordable but that folks were not getting the right degrees. As a senior scientist at a large engineering firm I have some perspective on this field. Yes, we had more openings for engineers than we could fill, but we were not drawing from overseas. Moreover, the salaries we were offering to entry level civil, mechanical, and structural engineers would more than pay off that degree investment. Indeed, the shortage you describe actually INCREASES the wage that a qualified entry level candidate commands. This is good news, not bad. Kids, get your CE degree today!\n \n As to the question of medical education - who would want to chart a course through 6 years of medical school with the knowledge that our nation is contemplating a revamping of the whole medical field? I think that the medical and technical fields should be regarded separately as I believe the uncertainty surrounding medicine has a political component to it. \n \n I would not suggest that we are importing medical personnel as I doubt they arrive en masse in cattle cars. No, these professionals choose to come here for a reason: Opportunity for financial and professional gain. We should celebrate the fact that Doctors from around the world want to practice here, not consider it a problem.\n \n As a side note: Since that report came out my salary has increased 105%. Just thought I would add that little bit o' trivia for those wondering if the degree was worthwhile...\n\n \n Washington times. 2005\n The problem is not a shortage of scientists and engineers in the United States, but rather how the country is \"importing scientists and doctoral candidates from elsewhere to create an unattractive glut of low-income, low-prospect career paths, which native-born Americans are increasingly avoiding.\n \n As far as medicine, No candidate is arguing a change in the institution. Though they should; Medicine is a science controlled by states and counties; Think about that. A Pilot has a federal license and the person is expected to stay current before he can fly or carry passengers. A Doctor is licensed by a state and his actions are governed by local protocols. In Colorado, a doctor or nurse only has to pay for a yearly license to practice medicine on you. Their Protocols for treating a heart attack is different from Michigan and less effective, but the doctor is bound by local controlling interests which are at times, not even in the medical field, as in Colorado. Without any CEU requirements, a doctor or nurse can wake up from a 5 year comma without any knowledge of medicine and work on you and your family.\n \n A Nurse licensed in Nevada is not a nurse in Florida. \n \n Your argument that people are forgoing medical training because the federal government might have an effect on income is reaching at best. We are importing medical people at an alarming rate here in Nevada; we get them from the Philippines. This is an effective way to control the salaries of nurses who have to pay the highest in medical insurance and pay to keep their license current by yearly education that never ends. \n \n Medical institutions are the ones that have to absorb the population's lack of insurance. Your argument that throwing money at medicine will harm it is incredibly weak. Money means they can get the best devices and increase salaries, not lower them. The company you work for gets paid for its services and you gain some benefit from that. Hospitals have to play a game of cutting everywhere just to keep the doors open for all the free rides they alone have to face. We support oil companies by pushing 10s of billions at them and even give public land to the cause. Yet, suddenly supporting medicine is far too socialistic for the hard right. It's beyond hypocritical to feed one company and starve another. Everyone argues that hospitals must take sick people, but when it comes to sharing in the burden, that's simply to far. The socialized institutions we have seem to do very well. Exxon is clearly in the black. Lets get medicine in the black and cut down on all those operations that could have been avoided by simply having the money for the new scanner.", 
   {
    "unicode_changes_made": true
   }, 
   284371, 
   null, 
   1190130120.0
  ], 
  [
   284719, 
   null, 
   "E Mutz", 
   "Washington times. 2005\n \n ??? Your citation lists a report dated 2004. \n \n The problem is not a shortage of scientists and engineers in the United States, but rather how the country is \"importing scientists and doctoral candidates from elsewhere to create an unattractive glut of low-income, low-prospect career paths, which native-born Americans are increasingly avoiding.\n \n Again, we are not importing human flesh as if it were a commodity. We are the free market that these individuals wish to belong to. We do not go calling, they come to us. Cite one study to indicate how this imported flesh has resulted in decreasing salaries for Doctors or Scientists. All I can find is study after study that shows how salaries are going up in these fields.\n \n As far as medicine, No candidate is arguing a change in the institution. Though they should; Medicine is a science controlled by states and counties; Think about that. A Pilot has a federal license and the person is expected to stay current before he can fly or carry passengers. A Doctor is licensed by a state and his actions are governed by local protocols. In Colorado, a doctor or nurse only has to pay for a yearly license to practice medicine on you. Their Protocols for treating a heart attack is different from Michigan and less effective, but the doctor is bound by local controlling interests which are at times, not even in the medical field, as in Colorado. Without any CEU requirements, a doctor or nurse can wake up from a 5 year comma without any knowledge of medicine and work on you and your family.\n \n A Nurse licensed in Nevada is not a nurse in Florida. \n \n The pilot is licensed federally because it is rather the nature of his business to conduct interstate travel. Medicine is no more controlled by the State than any other licensed profession is controlled by the state. Engineers, Geologists, Teachers, Plumbers, etc are all licensed by the State. This is not new and not sinister. \n \n The State of Colorado has no continuing education credit requirement. In fact, 10 states have no such requirement; however, 40 States do. You may peruse this list at: http://cme.mc.duke.edu/wysiwyg/downloads/licensurerereg-06%5B1%5D.pdf\n \n You will note that your State of Nevada requires 40 hours of continuing ed in \"specialty, ethics, and bioterrorism\". How is this subservient to the \"State's controlling interest?\n \n You will note that several states require as much as 200 credits for relicensure. I am afraid the example you cited is clearly not typical.\n \n \n Your argument that people are forgoing medical training because the federal government might have an effect on income is reaching at best. We are importing medical people at an alarming rate here in Nevada; we get them from the Philippines. This is an effective way to control the salaries of nurses who have to pay the highest in medical insurance and pay to keep their license current by yearly education that never ends. \n \n \n But....you just said that there was no education requirement... Now there is and it is endless...Which is it Senator? But let us assume worst case scenario. Since you seem to regard Filipinos to be the agents of economic apocalypse, let us assume that a Filipino gets a degree in an inexpensive school in the middle of the Jungle. Now suppose that fellow bobs about on a cork raft until he lands on the shores of California. He staggers to the State Licensing board where he meets all the requirements to practice medicine. Pray tell me sir, what is the problem?\n \n \n Medical institutions are the ones that have to absorb the population's lack of insurance. Your argument that throwing money at medicine will harm it is incredibly weak. Money means they can get the best devices and increase salaries, not lower them. The company you work for gets paid for its services and you gain some benefit from that. Hospitals have to play a game of cutting everywhere just to keep the doors open for all the free rides they alone have to face. We support oil companies by pushing 10s of billions at them and even give public land to the cause. Yet, suddenly supporting medicine is far too socialistic for the hard right. It's beyond hypocritical to feed one company and starve another. Everyone argues that hospitals must take sick people, but when it comes to sharing in the burden, that's simply to far. The socialized institutions we have seem to do very well. Exxon is clearly in the black. Lets get medicine in the black and cut down on all those operations that could have been avoided by simply having the money for the new scanner.\n \n I have no idea what this was all about as I never argued \"that throwing money at medicine will harm it.\" If you are going to invent arguments to be opposed to, use some creativity. Say that I advocated shaving birds or claimed that OJ Simpson was responsible for Global Warming. I do like how you irrelevently tied \"Big oil\" into the argument to achieve a talking points bingo. My compliments.", 
   {
    "unicode_changes_made": true
   }, 
   284442, 
   null, 
   1190317500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Americans enjoy the least opportunities", 
  "url": "http://www.4forums.com/political/government-debates/10341-americans-enjoy-least-opportunities.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 10341, 
  "discussion_files": [
   [
    "20877.html", 
    "http://www.4forums.com/political/government-debates/10341-americans-enjoy-least-opportunities-print.html"
   ], 
   [
    "20878.html", 
    "http://www.4forums.com/political/government-debates/10341-americans-enjoy-least-opportunities-2-print.html"
   ]
  ], 
  "identifier": 10341
 }
]