[
 [
  [
   283025, 
   null, 
   "samiinh", 
   "Massachusetts bar exam flunker drops his lawsuit over marriage equality question\n by Pam Spaulding · 9/08/2007 07:49:00 PM ET\n Discuss this post here: Comments (377) · digg it · reddit · FARK · · Link\n \n L-O-S-E-R. Boston resident Stephen Dunne has asked a federal court to dismiss his ridiculous lawsuit that claimed his religious rights were violated when he was presented with a question on same-sex marriage. His 268.866 score on the November 2006 bar just missed the passing score of 270 points.\n \n This is the question that offended Mr. Dunne:\n \n \"Yesterday, Jane got drunk and hit (her spouse) Mary with a baseball bat, breaking Mary's leg, when she learned that Mary was having an affair with Lisa. As a result, Mary decided to end her marriage with Jane in order to live in her house with (children) Philip (and) Charles and Lisa. What are the rights of Mary and Jane?\"\n \n In July I blogged about this suit, after Dunne launched a website, christianlawsuit.com (it only goes to his dismissal document now), he put up a batsh*t insane statement:\n \n My dream is to become a Lawyer, but I cannot defile my Christian faith simply to pass an examination. I will not pay the price that the Defendants are forcing me to pay in order to practice law in Massachusetts. There is no price tag on my faith. It is not for sale.\n \n He also modestly proclaimed:\n \n I am challenging the constitutionality of Homosexual Marriage and Homosexual Parenting in Massachusetts. In 2003, four unelected judges legalized Homosexual Marriage in Goodridge v. Dept. of Public Health, 798 N.E. 2d 941 (Mass. 2003). I sincerely believe that this ruling is profoundly undemocratic and un-American.\n \n I have preemptively fired the first shot that has been heard around the world. \n \n Uh, not really.\n \n A question of this nature was not included in the most recent bar exam, so Dunne tries to claim victory much in the same way the American Family Association's Don Wildmon likes to think Ford is being hurt by his fundie boycott:\n \n In court documents, Dunne said he wanted to drop his suit because the July bar exam didn't include what he called the \"patently offensive and morally repugnant\" gay marriage question. He characterized that as a \"corrective action\" by the board.\n \n In a move to quickly smack down that assertion...\n \n [I]n court documents filed yesterday, the board's attorney said the board has \"not agreed to limit the content\" of any future bar exams. The board's decision not to include the same question on the July exam \"merely reflects their standard practice of not repeating questions on successive bar examinations,\" the court filing said.\n \n ...The board maintains that the question was a legitimate one regarding current Massachusetts law.", 
   {
    "post_info": {
     "post_title": "Lawsuit dismissed."
    }
   }, 
   null, 
   null, 
   1189341360.0
  ], 
  [
   283061, 
   null, 
   "Kronus", 
   "I really don't get it when people claim their religious rights are being infringed merely by being exposed to the fact that gays exist. And I'm very glad that guy flunked his bar exam, he clearly doesn't know enough about either laws or legal ethics to make a good lawyer.", 
   {}, 
   283025, 
   null, 
   1189367460.0
  ], 
  [
   283107, 
   null, 
   "thelmoose", 
   "I am not sure what the lawsuit is about. Did the guy complain about that one question after he got his scores? Did he even try to answer the question? It's an idiotic concept, for sure, but it would appear that he has some integrity if he \"boycotted\" the question and refused to answer it. If he did take a stab at it and then complained after he flunked, he is dishonest in addition to being stupid. \n \n And I cringe every time I hear the phrase \"unelected\" judges. There are rational reasons that some judges are appointed and not elected, hence it is a constitutional provision. This guy wants to be a lawyer?", 
   {}, 
   283061, 
   null, 
   1189389720.0
  ], 
  [
   283109, 
   null, 
   "Kronus", 
   " I am not sure what the lawsuit is about. Did the guy complain about that one question after he got his scores? Did he even try to answer the question? It's an idiotic concept, for sure, but it would appear that he has some integrity if he \"boycotted\" the question and refused to answer it. If he did take a stab at it and then complained after he flunked, he is dishonest in addition to being stupid. \n\n He refused to answer the question on the grounds that he's morally opposed to gays, and so flunked the test. So sure, I'll give him integrity points. Intellignence, ethics, or ability to understand law? No, no points there. But I'll grant him integrity.\n \n \n\n And I cringe every time I hear the phrase \"unelected\" judges. There are rational reasons that some judges are appointed and not elected, hence it is a constitutional provision. This guy wants to be a lawyer? \n\n I'm right there with you on that one!", 
   {}, 
   283107, 
   null, 
   1189393740.0
  ], 
  [
   283112, 
   null, 
   "chemist99a", 
   "My dream is to become a Lawyer, but I cannot defile my Christian faith simply to pass an examination. I will not pay the price that the Defendants are forcing me to pay in order to practice law in Massachusetts. There is no price tag on my faith. It is not for sale.\n\n \n So fail the exam and take the consequences don't be a wimp.", 
   {}, 
   283109, 
   null, 
   1189396620.0
  ], 
  [
   283193, 
   null, 
   "Kronus", 
   "So fail the exam and take the consequences don't be a wimp.\n\n \n Seriously. Freedom of religion means freedom to take the consequences of taking a religious stand. The law of the land in Massachusetts is that gays can get married, that's a simple fact. You can dislike that fact all you like, but as a lawyer you can't insist that you not have to acknowledge that fact. Gays do get married, I don't see how his faith gets \"defiled\" by acknowledging the truth.", 
   {}, 
   283112, 
   null, 
   1189440180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Lawsuit dismissed.", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10347-lawsuit-dismissed.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10347, 
  "discussion_files": [
   [
    "12959.html", 
    "http://www.4forums.com/political/gay-rights-debates/10347-lawsuit-dismissed-print.html"
   ]
  ], 
  "identifier": 10347
 }
]