[
 [
  [
   17239, 
   null, 
   "montalban", 
   "WMDs (Weapons of Mass Destruction) have been used by one state for more than 50 years; the United States of America. \n \n Nuclear, Bilogical, Chemical (the NBC weapons)\n \n nuclear: Only one nation has used these in anger; the United States of America\n In peace-time the United States irradiated various islands in the Pacific (most famous being Bikini Atoll); as well as countless tests on Aemerican huamn guinea-pigs.\n \n As for the Marshall Islanders left with all that fall-out, the US has offered to pay some compensation.\n http://166.122.164.43/archive/2000/February/02-21-04.htm\n \n Depleted uranium weapons were used in Gulf War One, leading to massive increase in birth defects.\n http://www.commondreams.org/headlines02/1112-01.htm\n \n Not to mention the US soldiers poisoned as well \"Gulf War Syndrome\".\n \n chemical: Used in Vietnam\n \"Even today, many Vietnamese babies are born with deformations due to Agent Orange and other American atrocities. \"It is an endless grief. And to think that the war has stopped 25 years ago\", says the vice-president of Vietnam. The country therefore launched an international campaign to help the little victims of this chemical weapon.\"\n http://www.ptb.be/scripts/article.phtml?section=A3AAABBOBC&obid=13587\n \n Used in Columbia\n \"U.S. War on Drugs Aerial Herbicide Spraying Endangers Columbian Amazon Environment and Indigenous People\"\n http://eces.org/articles/static/97461360040756.shtml\n \n biological: Anthrax used on American Postal Workers - suggestion made that the Anthrax was from disgruntled American scientists. Several people were killed, a nation was terrorised. The FBI covered-up.\n http://www.tetrahedron.org/articles/anthrax/anthrax_espionage.html\n \n \n Still, this rogue nation has yet to be called to account.", 
   {
    "post_info": {
     "post_title": "WMDs : US still not called to account"
    }
   }, 
   null, 
   null, 
   1064501460.0
  ], 
  [
   17245, 
   null, 
   "AMD4EVER", 
   "I see this is a double post so I'll just respond to this.\n \n \nWMDs (Weapons of Mass Destruction) have been used by one state for more than 50 years; the United States of America. \n\n \n Ah hem...Iraq v Kurds?", 
   {}, 
   17239, 
   null, 
   1064503440.0
  ], 
  [
   17328, 
   null, 
   "epaphras_faith", 
   "I see this is a double post so I'll just respond to this.\n \n \n \n Ah hem...Iraq v Kurds?\n\n \n might I also add sarin gas in Japenese subway, mustard gas in world war I and II by both sides and many countries, Nazzi gas chambers, I am sure we could extend the list with little trouble emoticon_xdonno", 
   {}, 
   17245, 
   null, 
   1064535240.0
  ], 
  [
   17399, 
   null, 
   "montalban", 
   "might I also add sarin gas in Japenese subway, mustard gas in world war I and II by both sides and many countries, Nazzi gas chambers, I am sure we could extend the list with little trouble\n\n \n I stated: WMDs (Weapons of Mass Destruction) have been used by one state for more than 50 years;\n \n \n The Iraqis haven't been doing it for 50 years! And when they did, they were your ally!\n \n The Nazi's haven't either.\n \n To my knowledge, no side used mustard gas in WWII.\n \n The Sarin nerve gas was not used by the Japanese nation, and the perpetrator has been brought to justice; unlike the American government. I am not trying to demonise a country based on the doings of any small group.\n \n Thus, your government has been 'more consistent' in it's use of WMDs. You sprayed Vietnam with the most poisonous chemical known to man - dioxin; and not just Vietnamese were affected by it; http://www.vvof.org/vvofaopg.htm. You're still spraying defoliants - in Columbia.\n \n But basically, are you trying to argue 'We're doing bad, because everyone else is?'", 
   {}, 
   17328, 
   null, 
   1064553840.0
  ], 
  [
   18828, 
   null, 
   "epaphras_faith", 
   "I stated: WMDs (Weapons of Mass Destruction) have been used by one state for more than 50 years;\n \n \n The Iraqis haven't been doing it for 50 years! And when they did, they were your ally!\n \n The Nazi's haven't either.\n \n To my knowledge, no side used mustard gas in WWII.\n \n The Sarin nerve gas was not used by the Japanese nation, and the perpetrator has been brought to justice; unlike the American government. I am not trying to demonise a country based on the doings of any small group.\n \n Thus, your government has been 'more consistent' in it's use of WMDs. You sprayed Vietnam with the most poisonous chemical known to man - dioxin; and not just Vietnamese were affected by it; http://www.vvof.org/vvofaopg.htm. You're still spraying defoliants - in Columbia.\n \n But basically, are you trying to argue 'We're doing bad, because everyone else is?'\n\n \n mont: please note that the attacks on american postal workers with anthrax hardly qualifies as our government using wmd. The particulars in your source are dubious at best. You should be very careful what sources you use. Not everything on the net is reliable.\n \n Secondly, The US has settled many law suits regarding the illegal use of such items.", 
   {}, 
   17399, 
   null, 
   1065748920.0
  ], 
  [
   18872, 
   null, 
   "mizmaxx", 
   "The particulars in your source are dubious at best. You should be very careful what sources you use. Not everything on the net is reliable.\n \n\n \n You don't need to go on the internet to find documentation of the United States use of WMDs. Try a library. Noam Chomsky is a good academic source.", 
   {}, 
   18828, 
   null, 
   1065775440.0
  ], 
  [
   18922, 
   null, 
   "epaphras_faith", 
   "You don't need to go on the internet to find documentation of the United States use of WMDs. Try a library. Noam Chomsky is a good academic source.\n\n \n Excellent point. I do not deny the use of WMD's but the use of anthrax as reported is what I was speaking to. As far as being held accountable. I stated that we had.", 
   {}, 
   18872, 
   null, 
   1065810360.0
  ], 
  [
   35583, 
   null, 
   "Nallyo", 
   "You know what I really want to see? A multinational United Nations team that goes around to each country and lists violations. Even with this WMD \"evidence,\" I'd wager that we were in the top 10 that had the least violations.", 
   {}, 
   18922, 
   null, 
   1077495780.0
  ], 
  [
   53772, 
   null, 
   "weasel fierce", 
   "keep in mind that WMD's are only bad if its not the west or russia that have them", 
   {}, 
   35583, 
   null, 
   1087164540.0
  ], 
  [
   53949, 
   null, 
   "daewoo", 
   "keep in mind that WMD's are only bad if its not the west or russia that have them\n\n \n Don't forget our allies, like South Korea, israel, and Iraq, up unti they quite being our allies and became our enemies, at which point their WMDs became bad.", 
   {}, 
   53772, 
   null, 
   1087278000.0
  ], 
  [
   54049, 
   null, 
   "Haulingboat", 
   "Who is going to call us to the table? The UN? We are pulling the strings. We are going to call ourselves? \n \n no one has the cahones!", 
   {}, 
   53949, 
   null, 
   1087339320.0
  ], 
  [
   54059, 
   null, 
   "daewoo", 
   "Who is going to call us to the table? The UN? We are pulling the strings. We are going to call ourselves? \n \n no one has the cahones!\n\n \n At one time this may bave been true, but with the EU surpassing us in tnagible good production, and China on the fast track to replace the US as the worlds biggest consumer economy, the position of the US has become much less important in the world than it was in past years. \n \n There was a time that the US would announce trade sanctions against another country and the entire world would hop on board without question. Recently we announced trade sanctions against Syria. That same week the EU signed a trade agreeement with them. \n \n Americas string pulling powers are quickly diminishing. It has become apparent to the rest of the world that we need them mroe than they need us, with the exception of England, which has intertwined their economy so tightly with the economy of the Us that if we go, so do they.\n \n Within ten years we will likely see China surpass the US as the worlds economic powerhouse, since their economy is growing at an incredible rate driven by industrial expansion and wage increases.\n \n The US economy, on the other hand, is in a recession which we are countering with increased reliance on massive public and private debt. \n \n While our military is the best in the world, we cannot maintain it without money.", 
   {}, 
   54049, 
   null, 
   1087344720.0
  ], 
  [
   54060, 
   null, 
   "Big Orn", 
   "At one time this may bave been true...\n\n I think it still is and will be for many years to come.\n \n Aside from our pacifistic war tactics in Iraq, I have confidence in our governmental process.", 
   {}, 
   54059, 
   null, 
   1087345020.0
  ], 
  [
   54062, 
   null, 
   "daewoo", 
   "I think it still is and will be for many years to come.\n \n Aside from our pacifistic war tactics in Iraq, I have confidence in our governmental process.\n\n \n War tactic in Iraq aside, our government \"process\" grinds to a halt without enough money.\n \n have all the faith in that process you like, personally, I have faith in the power of the calculator. Opinions are one thing, math is entirely another, and the numbers just don;t add up well for America.", 
   {}, 
   54060, 
   null, 
   1087346760.0
  ], 
  [
   54134, 
   null, 
   "Big Orn", 
   "War tactic in Iraq aside, our government \"process\" grinds to a halt without enough money.\n \n have all the faith in that process you like, personally, I have faith in the power of the calculator. Opinions are one thing, math is entirely another, and the numbers just don;t add up well for America.\n\n \n With war tactics in Iraq paramount, I agree. But, then again, that&#8217;s why the numbers don&#8217;t add up well right now.\n \n Since the beginning of the Iraqi patty-cake campaign, we have and will continue to be in deep diaper doodle.", 
   {}, 
   54062, 
   null, 
   1087409700.0
  ], 
  [
   54327, 
   null, 
   "sglaine", 
   "Who is going to call us to the table? The UN? We are pulling the strings. We are going to call ourselves? \n \n no one has the cahones!\n You darn right they don't have the cahones because this is a sweep under the carpet society. That is why the country is going to ---- in a handbasket. emoticon_xdonno", 
   {}, 
   54049, 
   null, 
   1087507500.0
  ], 
  [
   54331, 
   null, 
   "Haulingboat", 
   "At one time this may bave been true, but with the EU surpassing us in tnagible good production, and China on the fast track to replace the US as the worlds biggest consumer economy, the position of the US has become much less important in the world than it was in past years. \n \n There was a time that the US would announce trade sanctions against another country and the entire world would hop on board without question. Recently we announced trade sanctions against Syria. That same week the EU signed a trade agreeement with them. \n \n Americas string pulling powers are quickly diminishing. It has become apparent to the rest of the world that we need them mroe than they need us, with the exception of England, which has intertwined their economy so tightly with the economy of the Us that if we go, so do they.\n \n Within ten years we will likely see China surpass the US as the worlds economic powerhouse, since their economy is growing at an incredible rate driven by industrial expansion and wage increases.\n \n The US economy, on the other hand, is in a recession which we are countering with increased reliance on massive public and private debt. \n \n While our military is the best in the world, we cannot maintain it without money.\n\n While China's economy is growing there are already signs of slowing from their 8%-9% pace. They are no more recession proof than we are. In fact, with the current governmental strangle hold on the market I would venture to say that the effects of there government make them more prone to recession than our free market does.\n \n Where you continually have an anti-American outlook, I prefer to see the resiliance in the American people. If Bush, or Kerry, or whom ever is president, brings this country to verge of economic meltdown then I believe the American public will have the fore thought to vote whom ever is pres. out of office and replace them with the appropriate individual to correct the situation. We still harbor some of the greatest companies and economics powerhouses in the world. Led by some of the most economically minded individuals on the planet. Any of these people may have what it takes to continue leading this country to greatness. \n \n The Chinese are stuck with what they have. When things take a turn for the worse their will be no replacements. The leadership of the country is set in stone regardless of popular sentiments. So you may continue on with your doomsday to America posts and your glass half empty rederic, while the rest of us continue down a more progressive road. There were plenty of people just like yourselves back when Reagan was running up debt to defeat the Russians. \" Oh my, the end of America is near. We'll never make it thru the 1990s. Woow is me. Woow is us.\" And yet here we are, having lived thru the 1990s boom that was one of the biggest in history.", 
   {}, 
   54059, 
   null, 
   1087509060.0
  ], 
  [
   54332, 
   null, 
   "daewoo", 
   "With war tactics in Iraq paramount, I agree. But, then again, that&#8217;s why the numbers don&#8217;t add up well right now.\n\n \n The numbers don't add up well right now because regardless of the war in Iraq, we are running roughly a $700,000,000,000 trade deficit. That is money that is going out of our economy and for the most part not coming back. In addition, we seem to have a problem with putting things on the national credit card Even without the war in Iraq, we woud still be hundreds of billions of dollars in debt.\n \n The numbers don't add up because we have lost our manufaturing abse and our politicians have frittered all our money away", 
   {}, 
   54134, 
   null, 
   1087509060.0
  ], 
  [
   54699, 
   null, 
   "CCR1994", 
   "You darn right they don't have the cahones because this is a sweep under the carpet society. That is why the country is going to ---- in a handbasket. emoticon_xdonno\n\n \n I can't wait until the democrats regain power someday so that the other side can scream that the country is going to you know where in a handbasket. As with many people, I get sick of hearing it. You had your chance to elect a Democrat in 2000 and you blew it. And don't give this Florida election scandal business because that argument vanished long ago with the Republican gains in congress in the 2002 midterm elections. But hope is not lost for you. You'll once again have your chance in November and in spite of an absoutely horrible and rediculous campaign by the Kerry camp the Democrats have a fighting chance of winning. Good luck.", 
   {}, 
   54327, 
   null, 
   1087749720.0
  ], 
  [
   54704, 
   null, 
   "georged", 
   "I can't wait until the democrats regain power someday so that the other side can scream that the country is going to you know where in a handbasket. As with many people, I get sick of hearing it. You had your chance to elect a Democrat in 2000 and you blew it. And don't give this Florida election scandal business because that argument vanished long ago with the Republican gains in congress in the 2002 midterm elections. But hope is not lost for you. You'll once again have your chance in November and in spite of an absoutely horrible and rediculous campaign by the Kerry camp the Democrats have a fighting chance of winning. Good luck.\n\n \n It doesn't matter who's in office. Bush has compounded our fiscal problems and gotten us into another unwinnable war, but our industrial base was disappearing long before he took office. To compare Regan's policies from 20 odd years ago to now is apple to orange. The '90s surged due to the dot.com bubble, not positive trade that brings our country new wealth. You could put Homer Simpson in office and it won't change our industrial decline, other countries would just laugh at us more than they do now.", 
   {}, 
   54699, 
   null, 
   1087750740.0
  ], 
  [
   54715, 
   null, 
   "daewoo", 
   "While China's economy is growing there are already signs of slowing from their 8%-9% pace. They are no more recession proof than we are. In fact, with the current governmental strangle hold on the market I would venture to say that the effects of there government make them more prone to recession than our free market does.\n\n \n Their economic growth is expected to decline to roughly 5%. This has been forecast for quite a while, and they realise it. Their governments strangle hold on the economy is proving to be a good thing in this case, as they adopt free market principals and expand their industrial base. In the future, ther markets will have to move from under government control somewhat, but this will be a while. \n \n The situation in China is similar to that of Japan, In Japan, there are really only 6 companies. Everything else is a division of, or wholly owned susidery of one of these six companies. This is not particularly good for your domestic economic situation, but is excellent during periods of expansion becasue it provides a centralised, consolidating force for expansion efforts. \n \n \nWhere you continually have an anti-American outlook, I prefer to see the resiliance in the American people. If Bush, or Kerry, or whom ever is president, brings this country to verge of economic meltdown then I believe the American public will have the fore thought to vote whom ever is pres. out of office and replace them with the appropriate individual to correct the situation. We still harbor some of the greatest companies and economics powerhouses in the world. Led by some of the most economically minded individuals on the planet. Any of these people may have what it takes to continue leading this country to greatness. \n \n \n Resilinace is nice. It assures us that as our current middle class is dumpster diving for dinner, they won't give up before they get that maggoty piece of pizza at the bottom. It is far past the point that it matters who is president. Our industrial infrasturcture and tangible goods production capability is gone and you cannot rebuild that overnight. There is simply too much money going out of the country and not enough coming in. It doesn't take a genius to figure out this is a bad plan. I think you are putting far too much faith in the American publics ability to figure anything out for themselves. \n \n Most people in the US have no idea what the hell is going on or why. They don;t know why the price of oil is up (and it is not because production is too low, nor is it primarily because of terrorist attacks). Our public has reached the point that we elect people based on who can promise the biggest bribe from the public coffers and who can spin the biggest deal out of pathetic non-issues (like bayonette lugs on black rifles).\n \n \nThe Chinese are stuck with what they have. When things take a turn for the worse their will be no replacements. The leadership of the country is set in stone regardless of popular sentiments. So you may continue on with your doomsday to America posts and your glass half empty rederic, while the rest of us continue down a more progressive road. There were plenty of people just like yourselves back when Reagan was running up debt to defeat the Russians. \" Oh my, the end of America is near. We'll never make it thru the 1990s. Woow is me. Woow is us.\" And yet here we are, having lived thru the 1990s boom that was one of the biggest in history.\n\n \n Yes, the chinese are stuck with what they have, a huge labor pool of mostly educated people and a desire to industrialise their economy, not to mention the majority of the natural resources they need right there in country, and arrangements already made for those they lack (oil).\n \n There is absolutly no comparison between the Reagan economy and the current economy in the US. When Reagan was president, we still had our manufacturing base and we were not runnign a massive trade deficit. We could afford to splurge a little and spend a little outside our means. Today, our manufacturing abse is mostly gone, though it has seen a slight increase of late as we bring mothballed steel plants out of retirement to service the growing Chinese economy (those same plants will soon be shut down agains, as china is already building thier own so they don't have to rely on expensive foreign steel).\n \n I don't particulalrly care whether the US manages to pull itself out of this mess or not. I have already provided myself with a nice cushion based on real value, as opposed to inflated equity markets and real estate values. If I loose my job tommorow, it makes little difference. I can live fairly comfortably for the rest of my life on what I have accrued and assuming I don't have more than 2 kids they can live quite comfortably on what is left for a large part of their lives after I die.\n \n I have found that the single most important asset a person can have when conspiring to create wealth is the ability to look at the economy and see exactly which way it is going and where it is likely to end up. If your idea of economic awareness is reading the WSJ, you should probably not plan on doing real well in the financial arena. Most Americans don't even know how to calculate long term inflation, instead relying on snippets on corporate owned news channels for numbers like these. \n \n Those who cannot do these things, who instead prefer to wander down a \"progressive road\" apparently with thier eyes shut, and full confidence in the resiliancy of the American people, as well as confidence that we will elect a president who will save us, though apparently not understandign that the president has little or nothing to do with it, nor is any presidential canidate who has been carefully vetted by their political party to ensure that things will continue business as usual likely to make any meaningful changes. Enjoy the progressive road. Maybe if you close your eyes very tight, the monster won't eat you.\n \n It may help if you look at the US as one big corporation. Last year, we lost in excess of a trillion dollars ($700 billlion trade deficit +deficit spending). The bad news is, a lot of people seem to have let this little fact slip by them. The GOOD news is, loosing over a trillion dollars won't seem like a bad thing at all in a few years, when we will wish for the good old days where we were only loosing a trillion dollars a year. The the down side to this is that this will be because we will be loosing a LOT more than a trillion a year, wealth will largely be consolidated in a relatively small segment of our population, and the rest of the resiliant American public will make nice maids, and butlers, and drivers for those of us who walked down the same road, but with our eyes opened wide and our brians on.", 
   {}, 
   54331, 
   null, 
   1087757400.0
  ], 
  [
   54737, 
   null, 
   "georged", 
   "I have found that the single most important asset a person can have when conspiring to create wealth is the ability to look at the economy and see exactly which way it is going and where it is likely to end up. If your idea of economic awareness is reading the WSJ, you should probably not plan on doing real well in the financial arena. Most Americans don't even know how to calculate long term inflation, instead relying on snippets on corporate owned news channels for numbers like these. \n\n \n Americans love cooked numbers from official government releases, especially GDP and employment, and confirmed by 'independent' brokerage house economists busy churning their 401k funds. Sheep over a cliff.", 
   {}, 
   54715, 
   null, 
   1087776000.0
  ], 
  [
   54756, 
   null, 
   "daewoo", 
   "Americans love cooked numbers from official government releases, especially GDP and employment, and confirmed by 'independent' brokerage house economists busy churning their 401k funds. Sheep over a cliff.\n\n \n Well, at least they are resiliant sheep, being herded down a progressive road. Of course, the road does end in a cliff, but at least they can baah America is RIGHT all the way there. \n \n It is interesting to me how blind so many people are when it comes to such things. Is it really asking that much that folks try to learn the basic principals upon which our eceonomy is based? It seems that this would be something people would be interested in, since it involves wealth, which is something everybody seems to want.\n \n Instead, you start talking about the economy and either everybody looks at you like you are speaking chinese, or you get a response from somebody who jumps up waving the flag (the above response is fairly typical). That response is also typical in that it puts a great deal of faith in a vaugly defined group of wealthy, intelligent people who can be expected to step in and save us all should the president (who realistically has VERY little control over the economy) fail us. \n \n I suppose it never occurs to these folks that these wealthy, intelligent people are already working the system, are already making a killing, and couldn't care less about your average joe. \n \n I have never gone wrong betting on the ignorance of your average American when it comes to economic matters. Your average American puts a geat deal of emphasis on things like the GDP, though most cannot tell you how it is calculated or what bearing it actually has on the economy, the Dow, though again, they are a little hazy on exactly what this is or its relation to the market, and inflation, though they have no idea how this is calculated, and if you say mystical things like \"Consumer Price Index\" they give you the sign of the evil eye and resiliantly go back to their wishful thinking on that progressive road. \n \n The average joe does seem to believe that somewhere behind the curtain there is some wizard looking after all this and pulling the proper levers. I am not sure exactly why this is, though extreme gullibility does come to mind. Arrogance is also pretty high on the list of possibilities. I mean, after all, America is bar none the greatest country in the world, therefore we obviously have the smartest people. They seem to have trouble making the connection that these smart people are laughing their way to the abnk with the gullible fools money.", 
   {}, 
   54737, 
   null, 
   1087806360.0
  ], 
  [
   71586, 
   null, 
   "pickleweaseler", 
   "I thought the original intention of agent orange was herbicide, not homicide.", 
   {
    "post_info": {
     "post_title": "Agent Orange: WMD?"
    }
   }, 
   54756, 
   null, 
   1097779380.0
  ], 
  [
   71724, 
   null, 
   "Dono", 
   "Quote: The GOOD news is, loosing over a trillion dollars won't seem like a bad thing at all in a few years, when we will wish for the good old days where we were only loosing a trillion dollars a year. \n \n George - Daewoo is singing our song, but we are still short of a choir. It took six years for the National Debt to rise from $5 trillion to $6 trillion, only two years to rise to $7 trillion. His statement is right on. Many believe that America is OZ, and some elected wizard is going to work magic and make things warm and fuzzy again. It will be some time before they arrive back in Kansas, but they will arrive.\n Dono", 
   {}, 
   71586, 
   null, 
   1097808660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  WMDs : US still not called to account", 
  "url": "http://www.4forums.com/political/history-debates/1035-wmds-us-still-not-called-account.html", 
  "breadcrumbs": [
   "History"
  ], 
  "id_number": 1035, 
  "discussion_files": [
   [
    "24830.html", 
    "http://www.4forums.com/political/history-debates/1035-wmds-us-still-not-called-account-print.html"
   ], 
   [
    "24831.html", 
    "http://www.4forums.com/political/history-debates/1035-wmds-us-still-not-called-account-2-print.html"
   ]
  ], 
  "identifier": 1035
 }
]