[
 [
  [
   283545, 
   null, 
   "fjp8000", 
   "I AM A BIT CONFUSED so hang in for a minute. I will ramble on now and then. OK? \n \n God has been around for all eternality? Right? OK, if so, then what the heck was he doing for all the billions of years before he decided on making man! Can you imagine all that time alone????? What did he do to keep himself occupied? Watch TV, jog, play solitaire? I personally think all that time alone caused him to get a bit WACKY. \n \n PROOF OF THE PUDDING: Let's consider how he came up with the idea of making man. Remember the scene in Cast Away, starring Tom Hangs, when he started talking to a soccer ball (Or was it a coconut?)? This is how I picture god after spending so much time alone. There he was talking to a soccer ball and decided on having some \"real\" company.... What does he choose???? A man?!?!?. I would have chosen a woman! I just am not sure about this guy! Well anyway... He then decides that Adam needs some sex and comes up with Eve. Here again I am a bit confused??? What made him come up with a woman for Adam? When for billions of years he did just fine without a woman? And, why the penis? Ah, I know. He made man in his own image!!! Wait, wait, wait a minute!!!!! I am a bit confused again?!? What did he do with his penis?!?!... All that time alone! He must be blind!\n \n OK, on with my thoughts on the matter... He made Adam and Eve knowing full well that they were going to do a BAD thing! S##t I am confused again!?!?! Why an apple? I would have said, \"No SEX until you are married or only intercourse..... Nothing freaky.\" Sooo, they ate the apple! Now this is where his wackiness comes in... Punishment for eating the apple: \"Death passed upon (i.e. spread to) all men because of Adam, [in whom] all sinned\". Original sin, the concept that man is born in a condition of sinfulness and must await redemption. We all have to pay for what Adam & Eve did..... S##t, they only ate an apple??? A god damned apple! And, as a result some \"his children\" will go to hell!!!\n \n According to the dictionary the word HELL means, \"In the Bible, the place where the Spirits of the dead are. 2.) The place where fallen angels, devils, etc. reside 3.) To which sinners and unbelievers go after death for torment and eternal judgment;\" Holy s##t! He went just a tad over board on this one... Don't you think???\n \n The guy has to be WAKCY!!! He went from being a nice guy, with good intentions, to a vengeful NUT!... Over an apple!!!! AN APPLE!!!!!????? You know what?! I should have put my kid in an oven at 500 degrees (Only for an hour. Eternity is a bit much) when he ate the ice cream I told him not to eat!!!!!! Then I would have been godlike! emoticon_xangel ... But not exactly hitting the mark. To hit the mark I would have to leave my kid in the over for ETERNITY!!!! emoticon_xbouncer", 
   {
    "post_info": {
     "post_title": "What Was God Thinking??????"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1189643580.0
  ], 
  [
   283548, 
   null, 
   "samiinh", 
   "My goodness.....I thought it all happened in 7 days 6000 years ago. What are you talking about?????????????????", 
   {}, 
   283545, 
   null, 
   1189645200.0
  ], 
  [
   283552, 
   null, 
   "Zardoz", 
   "Ok, follow along...\n \n There is NO TIME where God is concerned.\n The concept of time is part of the conditions of this universe (that he allegedly created) right along side everything else attributed to the material universe.\n \n Prior to the creation of this universe (~6,000+- years ago) there was only God (in some cases, Chaos too) no time...nada.\n \n Pretty much the same will exist once He wipes everything out in the end too.\n \n If you want some understanding of this non-linear existance, I suggest you rent Star Strek Deep Space 9 and try to follow the 'worm hole aliens' who live such an existance. Might help. *shrug*", 
   {}, 
   283548, 
   null, 
   1189646400.0
  ], 
  [
   283557, 
   null, 
   "fjp8000", 
   "Ok, follow along...\n \n There is NO TIME where God is concerned.\n The concept of time is part of the conditions of this universe (that he allegedly created) right along side everything else attributed to the material universe.\n \n Prior to the creation of this universe (~6,000+- years ago) there was only God (in some cases, Chaos too) no time...nada.\n \n Pretty much the same will exist once He wipes everything out in the end too.\n \n If you want some understanding of this non-linear existance, I suggest you rent Star Strek Deep Space 9 and try to follow the 'worm hole aliens' who live such an existance. Might help. *shrug*\n\n \n \n __________________________________________________________\n \n Thanks for sharing your knowledge emoticon_idea with me. How dim-witted I am to think the universe was created billions of years ago. emoticon_emb \n \n PS: To get a better understanding I will rent Star Trek Deep Space 9.. I can hardly wait to see it! Thanks again :p", 
   {}, 
   283552, 
   null, 
   1189649280.0
  ], 
  [
   283559, 
   null, 
   "fjp8000", 
   "My goodness.....I thought it all happened in 7 days 6000 years ago. What are you talking about?????????????????\n\n \n ____________________________________________________________\n \n What can I tell you? I should have consulted with Zardoz first. emoticon_emb", 
   {}, 
   283548, 
   null, 
   1189649460.0
  ], 
  [
   283607, 
   null, 
   "dislexia", 
   "First of all, there is no proof that the fruit was the apple (sufficent evidence, yes proof no)\n Secound not to eat the fruit was one of 2 rules \n (1) Reproduce + multiply, fill the ends of the earth,\n (2) Dont eat the fruit from that tree, however you can eat the fruit of ANY OTHER tree.", 
   {}, 
   283545, 
   null, 
   1189663560.0
  ], 
  [
   283612, 
   null, 
   "chemist99a", 
   "Ok, follow along...\n \n There is NO TIME where God is concerned.\n The concept of time is part of the conditions of this universe (that he allegedly created) right along side everything else attributed to the material universe.\n\n \n So on what day did he create time on. Its not mentioned anywhere in the biblical text which seems to simply assume time.", 
   {}, 
   283607, 
   null, 
   1189664640.0
  ], 
  [
   283615, 
   null, 
   "chemist99a", 
   "According to the dictionary the word HELL means, \"In the Bible, the place where the Spirits of the dead are. 2.) The place where fallen angels, devils, etc. reside 3.) To which sinners and unbelievers go after death for torment and eternal judgment;\" Holy s##t! He went just a tad over board on this one... Don't you think???\n\n \n God felt compelled to use the Earth as the battle ground between good (ie GOD) and evil (an axis of same). If he failed to defeat evil on earth then it would follow him to heaven.", 
   {
    "unicode_changes_made": true
   }, 
   283612, 
   null, 
   1189664760.0
  ], 
  [
   283616, 
   null, 
   "chemist99a", 
   "Well its possible I suppose that GOD created the apple and endowed it with low levels of cyanide for the specific purpose of punishing man should he consume too many. Perhaps at the time the apple being referenced was a special one much like the one in Snow White.\n \n \n \nFruit seeds (Cyanide)\n What are they found in? Apple seeds, cherry stones, and the kernels inside the pits of apricots, nectarines, peaches, and plums.\n \n Why are they poisonous? The American Medical Association (AMA)'s Handbook of Poisonous and Injurious Plants states that eating a large quantity of apple seeds (and other seeds) can be fatal due to the presence of the toxin cyanogenic glycoside, or cyanide. The exact lethal dose is unknown, although swallowing the seeds of a single apple is generally harmless for an adult. Children are more vulnerable: 15 apricot kernels are sufficient to kill them.\n \n What are the symptoms? Excessive sweating, abdominal pain, vomiting, and lethargy. In severe cases, convulsions, incontinence, coma, and even death.\n \n How to avoid them: Avoid eating any fruit seeds or kernels. If you are juicing or baking apples, remove the core first.\n", 
   {}, 
   283615, 
   null, 
   1189665300.0
  ], 
  [
   283651, 
   null, 
   "Zardoz", 
   "Actually, at one time, the Tomato was considered the forbidden fruit...\n \n As to the time/ creation story.\n It's a sumation of traditional Christian beliefs.\n Relatively new liberal Christian beliefs differ.\n \n \nSo on what day did he create time on. Its not mentioned anywhere in the biblical text which seems to simply assume time\n\n \n It's implied in the concept of DAY...a 'unit of time'. Thus, it'd be the 1st day.", 
   {}, 
   283616, 
   null, 
   1189688220.0
  ], 
  [
   283666, 
   null, 
   "fjp8000", 
   "First of all, there is no proof that the fruit was the apple (sufficent evidence, yes proof no)\n Secound not to eat the fruit was one of 2 rules \n (1) Reproduce + multiply, fill the ends of the earth,\n (2) Dont eat the fruit from that tree, however you can eat the fruit of ANY OTHER tree.\n\n \n _____________________________________________________________\n \n 1. What exact evidence are you referring to?\n \n 2. What is the deal (The test) with the apple, tomato or whatever it was???? WHEN HE KNEW WHAT THEY WOULD DO BEFOREHAND? :xbanghead \n \n 3. Reproduce + multiply???????? If, indeed, his goal was for them to fill the earth<<<< WHY ONLY TWO PEOPLE WHEN HE COULD FILL THE EARTH WITH A SNAP OF HIS FINGERS?? And, how long do you think it would take to fill the earth with just two people (unless Adam & Eve were really rabbits!) as the start for mankind...? Not considering the DNA problems associated with inbreeding. emoticon_frazzled \n \n Give us all a break. Can't you see what gobbledygook this thing of Adam & Eve is????", 
   {}, 
   283607, 
   null, 
   1189693980.0
  ], 
  [
   283712, 
   null, 
   "fjp8000", 
   "In the beginning, God made the heaven and the earth; and He said: \"Hey, that's pretty good!\" Then God made man in His own image to rule over all living things; but it was Friday night, and God was drunk, so man - he didn't come out so good. Then, while God still had a hangover, He created woman, which only made things worse. As a consolation, God let Adam and Eve live in the Garden of Eden; but then Eve met this snake guy that told her to eat of the tree of knowledge so she could get her real estate license and sell the place for big bucks; and when God found out, He got real mad and kicked them both out. And, you know, ever since then, almost everything has gone to the Devil.\n\n \n --------------------------------------------------------------------------\n \n Darn it! I thought I had the story right! emoticon_mad \n \n PS: You will note that there are no posts from the people who believe in a god.... You know why? Because the story of Adam & Eve, upon serious deliberation, does not make any sense to them either. :xbanghead This is wobbly ground for them. Otherwise, you would see lots of posts in reply!", 
   {
    "unicode_changes_made": true
   }, 
   283666, 
   null, 
   1189710540.0
  ], 
  [
   283750, 
   null, 
   "Kabukikmono", 
   "\n \n Sooo, they ate the apple! Now this is where his wackiness comes in... Punishment for eating the apple: \"Death passed upon (i.e. spread to) all men because of Adam, [in whom] all sinned\". Original sin, the concept that man is born in a condition of sinfulness and must await redemption. We all have to pay for what Adam & Eve did..... S##t, they only ate an apple??? A god damned apple! And, as a result some \"his children\" will go to hell!!!\n \n\n A God damned apple. That's the thing, isn't it?\n \n And who ever said God sent them to hell for eating the fruit? \"Death passed upon\" doesn't seem as horrible as \"burned in hell for all eternity.\" It could have meant that they would have otherwise never died, or death could have just been a metaphor. I'm not exactly a great Bible historian though.", 
   {
    "unicode_changes_made": true
   }, 
   283545, 
   null, 
   1189739400.0
  ], 
  [
   283754, 
   null, 
   "fjp8000", 
   "A God damned apple. That's the thing, isn't it?\n \n And who ever said God sent them to hell for eating the fruit? \"Death passed upon\" doesn't seem as horrible as \"burned in hell for all eternity.\" It could have meant that they would have otherwise never died, or death could have just been a metaphor. I'm not exactly a great Bible historian though.\n\n \n --------------------------------------------------------------------\n Yep.. I repeat, \"A god damed apple\". \n \n So, now we are not sure???? Is that the way it is going to be when the going gets tough! Can't deal with it...So use the Maybe retort... IE: \"Could have meant\"!", 
   {}, 
   283750, 
   null, 
   1189743240.0
  ], 
  [
   283769, 
   null, 
   "charlie horse", 
   "I asked the same sort of question in another place not long ago. Here's a link I was given:\n \n http://ffrf.org/books/lfif/?t=theologian\n \n Very interesting.", 
   {}, 
   283754, 
   null, 
   1189764060.0
  ], 
  [
   283783, 
   null, 
   "fjp8000", 
   "I asked the same sort of question in another place not long ago. Here's a link I was given:\n \n http://ffrf.org/books/lfif/?t=theologian\n \n Very interesting.\n\n \n ____________________________________________________________\n \n WOW! Thanks for the information!!! I strongly suggest that belivers and non-believers check this site out!!! Lots of questions and answers!  emoticon_xbouncer emoticon_xbouncer emoticon_xbouncer \n \n http://ffrf.org/books/lfif/?t=theologian", 
   {}, 
   283769, 
   null, 
   1189782420.0
  ], 
  [
   283818, 
   null, 
   "simone", 
   "It is a mystery and unknowable.", 
   {}, 
   283545, 
   null, 
   1189801140.0
  ], 
  [
   283874, 
   null, 
   "samiinh", 
   "____________________________________________________________\n \n WOW! Thanks for the information!!! I strongly suggest that belivers and non-believers check this site out!!! Lots of questions and answers!  emoticon_xbouncer emoticon_xbouncer emoticon_xbouncer \n \n http://ffrf.org/books/lfif/?t=theologian\n\n \n I am a member of this organization.", 
   {}, 
   283783, 
   null, 
   1189819860.0
  ], 
  [
   283893, 
   null, 
   "fjp8000", 
   "I am a member of this organization.\n\n \n ___________________________________________________________\n \n Wait a minute!!!!!!!!!! You shelled out some cash to join?!?!?! Think you are back in a church???? :xbanghead \n \n I joined too....emoticon_emb ", 
   {}, 
   283874, 
   null, 
   1189824060.0
  ], 
  [
   283978, 
   null, 
   "samiinh", 
   "___________________________________________________________\n \n Wait a minute!!!!!!!!!! You shelled out some cash to join?!?!?! Think you are back in a church???? :xbanghead \n \n I joined too....emoticon_emb \n\n \n Yep, 40 bucks, but I can't remember if it is tax deductible or not.", 
   {}, 
   283893, 
   null, 
   1189864980.0
  ], 
  [
   283985, 
   null, 
   "fjp8000", 
   "Yep, 40 bucks, but I can't remember if it is tax deductible or not.\n\n \n _______________________________________________________\n \n Yes it is, but it should not be tax deductable!! God would object! ;) ;) ;) ;) ;) ;)", 
   {}, 
   283978, 
   null, 
   1189866600.0
  ], 
  [
   284026, 
   null, 
   "samiinh", 
   "_______________________________________________________\n \n Yes it is, but it should not be tax deductable!! God would object! ;) ;) ;) ;) ;) ;)\n\n \n Oh, good. Maybe I should tithe.", 
   {}, 
   283985, 
   null, 
   1189894320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What Was God Thinking??????", 
  "url": "http://www.4forums.com/political/religion-debates/10369-what-god-thinking.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10369, 
  "discussion_files": [
   [
    "23324.html", 
    "http://www.4forums.com/political/religion-debates/10369-what-god-thinking-print.html"
   ], 
   [
    "23325.html", 
    "http://www.4forums.com/political/religion-debates/10369-what-god-thinking-2-print.html"
   ]
  ], 
  "identifier": 10369
 }
]