[
 [
  [
   284408, 
   null, 
   "samiinh", 
   "WingNutDaily Values Voter Debate\n \n \n What do you intend to do to counteract the homosexual agenda?\n \n \n Alan Keyes: says that he doesn't want the homo agenda to destroy marriage and the natural family. The family ordained by God for procreation must be respected under the law.\n \n Duncan Hunter: We need to support the traditional family...we must fortify the military. [I guess that lame transition from marriage to DADT.]\n \n Ron Paul: It's important have the right to their life if they do no harm. You can't force morals through legislation. A group can't force themselves on any one either, he then goes on to oppose hate crimes legislation of any kind. Boy he dodged the marriage matter all the way.\n \n Sam Brownback: He agrees with Duncan Hunter. He defends Peter Pace's defense of DADT, and making a decision considering his faith. He's proud of standing up for him. DADT is a good policy. He wants to fight against hate crimes law (hmmm. Is he ready to roll the existing hate crimes law, which protects religion?).\n \n John Cox: We don't have to sanction behavior, we don't need more litigation. \"We have this problem with transvestites who want to become school teachers.\" We need to use common sense and talk about the fact that we are looking at opening the floodgates to polygamy and bestiality.\n \n Tom Tancredo: You cannot make a rule as president to change the morality of the country. The problem, he says is the influence of the homosexual agenda in the school curriculum. His solution -- a voucher system to get the kids out of the schools.\n \n Mike Huckabee: He believes the homosexual agenda has become strong because the traditional family has become weak. He's worried about what kind of role models mothers and fathers are presenting to the next generation. He doesn't want to foment hatred toward other groups, however, but wants to strengthen the family.\n \n Oh, it's pathetic. In the \"speed round\" (they vote by pressing a Y/N light) Janet Folger is going on about defunding Planned Parenthood (something they all agree on, apparently), and now Phyllis Schlafly is asking will oppose amnesty for undocumented immigrants. They are getting really uncomfortable.\n \n Sam Brownback is trying to elaborate the difference between a guest worker program (which he supports, with modifications) and \"amnesty.\" John Cox jumps in to say a guest worker program won't work either.", 
   {
    "post_info": {
     "post_title": "GOP Values Voter debate"
    }
   }, 
   null, 
   null, 
   1190120400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  GOP Values Voter debate", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10395-gop-values-voter-debate.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10395, 
  "discussion_files": [
   [
    "25525.html", 
    "http://www.4forums.com/political/gay-rights-debates/10395-gop-values-voter-debate-print.html"
   ]
  ], 
  "identifier": 10395
 }
]