[
 [
  [
   284597, 
   null, 
   "DrD", 
   "I have listened as many friends blast Hillary Clinton as being too \"divisive\" or \"polarizing.\" Many of these same men and women have made rather crude comments as to the reason for her staying with Bill Clinton, in light of his infidelity.\n \n Yet, I hear the news gurus talk about how far we have come as a society, in that a woman is a viable candidate for the presidency.\n \n Equality? I'm not so sure.\n \n Fred Thompson is being hailed by some as the next Ronald Reagan. What if Hillary Clinton had his background? What if, upon becoming a famous actor at age 42, she had immediately divorced her husband of 26 years? What if, after being elected to the Senate, she had a two-year affair with Garth Brooks? What if she was now married to a 35-year-old? Would she have a chance?\n \n What if she had Rudy Giuliani's background? What if she had been married to her second cousin and divorced him after she began an affair with a newscaster six years her junior? What if, after marrying the newscaster, and having another affair while she was mayor of New York City, she announced to the media that she was leaving her husband, and moved her new boyfriend, 10 years her junior, into Gracie Mansion?\n \n What if Chelsea wouldn't even speak to her?\n \n I hope millions of women who have never voted before come out of the woodwork to say they are sick of this double standard.", 
   {
    "post_info": {
     "post_title": "Are there Double Standards?"
    }
   }, 
   null, 
   null, 
   1190225820.0
  ], 
  [
   284604, 
   null, 
   "Steeeeve", 
   "Oddly enough Mike Huckabee is quoted as saying he is proud that Bill and Hillary worked things out. \n \n With regards to Hillary though, you can certainly question her positions and stances..I don't see anything wrong with that. If you are simply saying Hillary is unethical and Thompson or Guliani are so much better than perhaps you are a bit hypocritical or naive.", 
   {}, 
   284597, 
   null, 
   1190227860.0
  ], 
  [
   284611, 
   null, 
   "Zardoz", 
   "I have listened as many friends blast Hillary Clinton as being too \"divisive\" or \"polarizing.\" Many of these same men and women have made rather crude comments as to the reason for her staying with Bill Clinton, in light of his infidelity.\n\n From what I gather (from people who knew her), she made the choice to stay with him LONG ago as it was part of her earlier life goals.\n \n \nI hope millions of women who have never voted before come out of the woodwork to say they are sick of this double standard.\n\n \n As for the rest of your points, valid. There are and will be (for a long time) double standards.\n It's also unlikely that women will unite in any realistic manner to do anything about it or change trends.\n That's why most real achievers either mirror a male's attitudes or become bitterly mercenaryish in their pursuits. \n \n Tentatively I'd say it's biological. Estrogen vs Testosterone and how it affects your outlooks on life and focuses. Big impact on psychology.", 
   {}, 
   284597, 
   null, 
   1190233860.0
  ], 
  [
   284848, 
   null, 
   "DrD", 
   "First of all, allow me to state that I am not a \"women's libber\" kind of guy. I think the younger generation of women have engendered the idea of becoming \"she-males\" which I personally find very unbecoming and not feminine at all. However, that being said. . . . . . .emoticon_xchicken \n \n One of the points of the post is that Hillary made a decision to continue her marriage. The overall point I was trying to make was that there is a standard to which we accept men and another for which we accept women.", 
   {}, 
   284611, 
   null, 
   1190406300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Are there Double Standards?", 
  "url": "http://www.4forums.com/political/politics-debates/10400-there-double-standards.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 10400, 
  "discussion_files": [
   [
    "19928.html", 
    "http://www.4forums.com/political/politics-debates/10400-there-double-standards-print.html"
   ]
  ], 
  "identifier": 10400
 }
]