[
 [
  [
   284707, 
   null, 
   "simone", 
   "Recently a 13-year-old girl died in Egypt after she had been subjected to genital mutilation, which is a cultural requirement of the backward and ignorant patriarchs of that nation. \n \n http://www.nytimes.com/2007/09/20/world/africa/20girls.html\n \n \nThe men in this poor farming community were seething. A 13-year-old girl was brought to a doctor's office to have her clitoris removed, a surgery considered necessary here to preserve chastity and honor.\n \n The girl died, but that was not the source of the outrage. After her death, the government shut down the clinic, and that got everyone stirred up.\n \n \"They will not stop us,\" shouted Saad Yehia, a tea shop owner along the main street. \"We support circumcision!\" he shouted over and over.\n \n \"Even if the state doesn't like it, we will circumcise the girls,\" shouted Fahmy Ezzeddin Shaweesh, an elder in the village. . . .\nWell spoken, cretinous XXXXXX!", 
   {
    "post_info": {
     "post_title": "Mutilating and Murdering Little Girls"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1190307300.0
  ], 
  [
   284711, 
   null, 
   "simone", 
   "Muslims! You have no honor when it comes to the way you treat women!\n \n Mutilation!\n \n Murder!\n \n You should be ashamed!\n \n http://select.nytimes.com/preview/2007/09/23/magazine/1154689927181.html\n \n \n. . . . By now, almost anyone in Syria who follows the news can supply certain basic details about Zahra al-Azzo's life and death: how the girl, then only 15, was kidnapped in the spring of 2006 near her home in northern Syria, taken to Damascus by her abductor and raped; how the police who discovered her feared that her family, as commonly happens in Syria, would blame Zahra for the rape and kill her; how these authorities then placed Zahra in a prison for girls, believing it the only way to protect her from her relatives. And then in December, how a cousin of Zahra's, 27-year-old Fawaz, agreed to marry her in order to secure her release and also, he hoped, restore her reputation in the eyes of her family; how, just a month after her wedding to Fawaz, Zahra's 25-year-old brother, Fayyez, stabbed her as she slept.\n \n Zahra died from her wounds at the hospital the following morning, one of about 300 girls and women who die each year in Syria in so-called honor killings, according to estimates by women's rights advocates there. In Syria and other Arab countries, many men are brought up to believe in an idea of personal honor that regards defending the chastity of their sisters, their daughters and other women in the family as a primary social obligation. Honor crimes tend to occur, activists say, when men feel pressed by their communities to demonstrate that they are sufficiently protective of their female relatives' virtue. Pairs of lovers are sometimes killed together, but most frequently only the women are singled out for punishment. Sometimes women are killed for the mere suspicion of an affair, or on account of a false accusation, or because they were sexually abused, or because, like Zahra, they were raped. . . .\n", 
   {
    "post_info": {
     "post_title": "Savage and Barbaric &quot;Honor&quot; Murders"
    }, 
    "unicode_changes_made": true
   }, 
   284707, 
   null, 
   1190309100.0
  ], 
  [
   284713, 
   null, 
   "simone", 
   "And, peace to Fawaz, who is a man of honor:\n \n \n. . . . At first, Fawaz, a shy, wiry man, politely demurred. He felt sorry for Fayyez, he told me, but he couldn't help recoiling a little at the story, which in his community constitutes an ugly sexual scandal. Besides, he was already engaged to another girl. After Fayyez left, though, Fawaz and his mother talked over Zahra's situation. \"We decided to visit the girl, just to see,\" Umm Fawaz said. And so several days later the two of them took a taxi to the girls' prison. They walked past a heavy steel gate, and a guard led them to an office.\n \n Fawaz smiled as he recalled the moment Zahra was brought in. It would be indelicate for him to comment on Zahra's appearance, so it was Umm Fawaz who talked about Zahra's beauty (\"As lovely as Sibel Can!\" she exclaimed, mentioning a Turkish singer popular in the Arab world).\n \n \"I liked the girl,\" said Fawaz, who seemed embarrassed to have admitted such a personal thing in public, and he quickly corrected himself. \"I mean, here we fall in love with a girl after we marry her. But I decided to leave my fiancée for Zahra. I felt that a normal girl like my fiancée would have other chances. With Zahra I thought, my God, she's such a child to be stuck in this prison.\" . . .\n \nFawaz is a real man who chooses to defy the traditions of weak old men. He is going to prosecute the murderer of Zahra.", 
   {
    "unicode_changes_made": true
   }, 
   284707, 
   null, 
   1190309520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mutilating and Murdering Little Girls", 
  "url": "http://www.4forums.com/political/peace-middle-east/10404-mutilating-murdering-little-girls.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 10404, 
  "discussion_files": [
   [
    "17092.html", 
    "http://www.4forums.com/political/peace-middle-east/10404-mutilating-murdering-little-girls-print.html"
   ]
  ], 
  "identifier": 10404
 }
]