[
 [
  [
   284930, 
   null, 
   "DrD", 
   "Just when you think that there is no one who could possibly attempt to defend the record of George W. Bush, out pops someone with the desperate argument that Bush is less sinful than was President Clinton. Surely in this Republican enclave there is someone who can come up with at least a couple of good things that Bush has done for our country rather than critizing the former president. I would like to think better thoughts of this president, but I keep getting distracted by all the harm that he has done.[*]the lies that he said before his election - saying that as our president he would not do \"nation building\" or that he was a \"uniter, not a divider\";[*]his incompetence to respond to intelligence briefings that warned of an impending attack by Osama bin Laden; \n [*]he \"cherry picking\" of intelligence that he released to convince our nation to support him in attacking Iraq;\n [*]the hundreds of thousands of innocent Iraqis that we have killed or wounded in Iraq and the 4 million who have fled their homes. Bush seems to forget that Iraqi people are human beings also;\n [*]the 30,000 of our brave soldiers who have been killed or maimed in his war;\n [*]the $3 billion a week that we are wasting in Iraq, while our bridges are falling down;. (That's $4,000 a second.)\n [*]his proclivity for staffing our protective agencies with incompetent cronies who do the bidding of the industries that they are so supposed to regulate - thus giving our mothers more mercury in their milk and our children more lead in their toys.Yes - it is true that President Clinton did lie about his sexual peccadillo with Monica Lewinsky - of course, no other elected official has ever done anyting like that. But when he left office he handed Bush budget surpluses \"as far as the eye could see\" and a country that rightly enjoyed the respect of the world. George Bush will hand his successor a mop to clean up the mess that he has made. And yes, that mop could very well be handed back to another President Clinton.", 
   {
    "post_info": {
     "post_title": "Who's biggest sinner? Hint: It's not Clinton"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1190509620.0
  ], 
  [
   285209, 
   null, 
   "DrD", 
   "I'm a bit surprised that so many have visited this thread without one comment. This says something. . . .I'm just not sure what.", 
   {}, 
   284930, 
   null, 
   1190770320.0
  ], 
  [
   285212, 
   null, 
   "samiinh", 
   "I'm a bit surprised that so many have visited this thread without one comment. This says something. . . .I'm just not sure what.\n\n \n What can we say about this the worst president in American History.", 
   {}, 
   285209, 
   null, 
   1190772660.0
  ], 
  [
   285213, 
   null, 
   "DrD", 
   "Well, I guess you're right. emoticon_xbye", 
   {}, 
   285212, 
   null, 
   1190773200.0
  ], 
  [
   285264, 
   null, 
   "Mucusaur", 
   "Cinton helped bring peace to Northern Ireland.\n \n Bush started 2 wars.", 
   {}, 
   285213, 
   null, 
   1190806980.0
  ], 
  [
   285278, 
   null, 
   "samiinh", 
   "Cinton helped bring peace to Northern Ireland.\n \n Bush started 2 wars.\n\n \n And he wants to start another one as well.", 
   {}, 
   285264, 
   null, 
   1190817360.0
  ], 
  [
   286574, 
   null, 
   "obvious_child", 
   "What can we say about this the worst president in American History.\n\n \n Not even close. There are least 2 other presidents far worse then Dubya. \n \n Most historians consider Harding to be the worst president in US history.\n Economically, Hoover was horrible.\n Lincoln basically gutted the Constitution...", 
   {}, 
   285212, 
   null, 
   1191540840.0
  ], 
  [
   286578, 
   null, 
   "samiinh", 
   "Not even close. There are least 2 other presidents far worse then Dubya. \n \n Most historians consider Harding to be the worst president in US history.\n Economically, Hoover was horrible.\n Lincoln basically gutted the Constitution...\n\n \n During Bush's term, the US has borrowed more money than in 7 years, than it has in all of the time the country has existed. Economically, the rich have done well, the rest of us are far behind. And with the secret torture memos, the US is no longer a beckon of hope and freedom. It's become a soviet style thuggery.", 
   {}, 
   286574, 
   null, 
   1191544920.0
  ], 
  [
   286582, 
   null, 
   "DrD", 
   "Not even close. There are least 2 other presidents far worse then Dubya. \n \n Most historians consider Harding to be the worst president in US history.\n Economically, Hoover was horrible.\n Lincoln basically gutted the Constitution...\nWell, you could be right up to those points in history. However, Bush had not held office yet. I think history will show a new low among worst presidents.", 
   {}, 
   286574, 
   null, 
   1191546600.0
  ], 
  [
   286585, 
   null, 
   "samiinh", 
   "Well, you could be right up to those points in history. However, Bush had not held office yet. I think history will show a new low among worst presidents.\n\n \n You have my vote on that.", 
   {}, 
   286582, 
   null, 
   1191547440.0
  ], 
  [
   286588, 
   null, 
   "DrD", 
   "You have my vote on that.\nThanks! I need all the votes I can get!! emoticon_xhoho", 
   {}, 
   286585, 
   null, 
   1191547920.0
  ], 
  [
   286590, 
   null, 
   "obvious_child", 
   "Well, you could be right up to those points in history. However, Bush had not held office yet. I think history will show a new low among worst presidents.\n\n \n I think he's in the bottom half of the presidents (and his father in the top), but he's not as bad as many people think he is. He brought up a large amount of entitlement reform that needed to be talked about. Aside from completely bungling it, he's not that bad.", 
   {}, 
   286582, 
   null, 
   1191548220.0
  ], 
  [
   286649, 
   null, 
   "samiinh", 
   "I think he's in the bottom half of the presidents (and his father in the top), but he's not as bad as many people think he is. He brought up a large amount of entitlement reform that needed to be talked about. Aside from completely bungling it, he's not that bad.\n\n \n Professional historians in general have determined Bush to be the worst president in our 200+ year history.\n \n One who made the comparison with Nixon explicit wrote, \"Indeed, Bush puts Nixon into a more favorable light. He has trashed the image and reputation of the United States throughout the world; he has offended many of our previously close allies; he has burdened future generations with incredible debt; he has created an unnecessary war to further his domestic political objectives; he has suborned the civil rights of our citizens; he has destroyed previous environmental efforts by government in favor of his coterie of exploiters; he has surrounded himself with a cabal ideological adventurers . . . .\"", 
   {
    "unicode_changes_made": true
   }, 
   286590, 
   null, 
   1191589140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Who's biggest sinner? Hint: It's not Clinton", 
  "url": "http://www.4forums.com/political/politics-debates/10412-whos-biggest-sinner-hint-its-not-clinton.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 10412, 
  "discussion_files": [
   [
    "18497.html", 
    "http://www.4forums.com/political/politics-debates/10412-whos-biggest-sinner-hint-its-not-clinton-print.html"
   ]
  ], 
  "identifier": 10412
 }
]