[
 [
  [
   17381, 
   null, 
   "dichotomy?", 
   "I have thought about this quite a bit and still cannot come up with a sufficient answer. I have seen that many scientists and those that have studied Biology or other sciences end up with the opinion that God does not exist. Perhaps I am wrong here, but it seems that many on this forum would agree that this is the case and He does not exist. \n My question, and not to be contrary, but to understand a bit better is this: How does one logically arrive at the conclusion that God does not exist? What ideas of evidence sustain such a belief?\n Here are a few of my thoughts. Perhaps it is because of the fact that science does not need to invoke the existence of God in order to explain natural phenomena, or events. However it puzzles me that this leads them to disbelieve that God can exist. One of two arguments should dissuade the open minded and logical thinker from concluding this. First, simply because God's power, control, hand, (whatever you prefer) is not constantly necessary to keep the planets in thier rotations or the natural systems of this earth functioning, this should not lead one to disbelieve that He may exist. I suppose this is the Deist paradigm. Secondly, and more importantly to me, a rational person must admit the possibliity that science does not yet understand completely how these systems function and so there is no way to rule out the necessity and existence of God. Take for example gravity, we still do not understand it or what causes it fully, now I am not saying that gravity is God's power but it does show that we are not at a point where we can with a surety claim to understand the workings of this universe to such a great degree so as to disprove the existence of God.\n Now I agree that a person need not look far or deep to see that the Bible contains certain things that contradict scientific findings. This is perhaps where scientists find \"evidence\" that God doesn't exist. However the flaw in that reason is so blatently obvious that it need not recieve much thought. The Bible is a book that may be interpreted many ways by as many people. Therefore to say that it is false because someone's interperatation of it is false is to place the falacy in the wrong spot.\n I am not claiming as many would that the Bible in itself is infallable. It has been translated many times and translational errors may have easily been put in. While I do believe that the original authors were inspired i do not hold that they nor the subsequent translators were infallable.\n A long point made short, any errors in the Bible do not disprove the existence of God. And there may be many answers to seemingly impossible stories in the Bible.\n To finish, it must be understood that to find evidence for God requires a different form of experimentation and study than science uses. Although not radically different, there is still study and experimentation involved. However, in addition to this, the same level of faith that we put in the scientific method must be put into the possiblity that God exists and that we can come to know it just as we have come to know many things that pertain to the natural sciences.\n Sorry if it was long winded but I would like some responses from either side of the debate.", 
   {
    "post_info": {
     "post_title": "How does one arrive at a disbelief in God?  And other random musings."
    }
   }, 
   null, 
   null, 
   1064551020.0
  ], 
  [
   17404, 
   null, 
   "TheoMorphic", 
   "At the risk of getting flamed:\n \n well for starters science doesn't disprove god. Any opinions about the existence (or non-existence) of any kind of god come from personal experience, and analysis of current evidence. \n \n While ALL gods can not be shown to exist, it can be pretty conclusively shown that certain gods do not exist. For example, pretend there was a religion that stated every Thursday God would come down from heaven and bless their poker game that they were about to play, and then go back up into heaven. By being at this Thursday poker game it can be shown that no god appears... so that particular god does not exist. \n \n In regards to special stories in various religious documents, it can be pretty conclusively said that most of those stories did not happen (specifically creation) in that way. Granted, there is room for interpretation, however religious folk are reluctant to do that.\n \n And finally in regards to what God is like... certain religions say God has certain characteristics... all loving, all powerful, omniscient... \n Some of these characteristics contradict observations we see today (how can an all loving god allow pain and suffering among the innocent). \n \n Using these three areas it can be shown that some gods do not exist... but like you said that does not necessarily go for every single god that could be out there. What we are left with are gods that have considerably little interaction with the world that we know. \n \n At this point people who are non-theists fall into 2 categories. \"Don't Know\" and \"Don't Care\". The don't knows are more commonly known as agnostics... while it can be shown that some versions of god do not exist, it can never be shown all gods do not exist... a question that asks \"is there a god?\" is answered \"i don't know\". \n \n The don't cares are more commonly known as atheists. All the significant gods (gods that are represented by major religions, or gods that have a direct influence on the world around us) have no supporting evidence, and since these gods should be leaving evidence when they interact with our world... well in this case an absence of evidence is evidence of absence. As for the other gods, well since they don't interact with our world they don't really matter at all. they could just as well not be there, and life as we know it would be the same. a question that asks \"is there a god?\" is answered \"it doesn't matter\". \n \n Both atheists and agnostics will tell you they see no evidence for the existence of any god. Some will continue with \"thus, there is not one\" and other will continue with \"as for the other, i don't know\". The agnostic position is obviously tentative, however even though the atheist does not explicitly state his position is tentative, you will be hard pressed to find an atheist who stats \"there is absolutely, positively, with out a doubt, no god at all\".", 
   {}, 
   17381, 
   null, 
   1064556060.0
  ], 
  [
   17413, 
   null, 
   "dichotomy?", 
   "At the risk of getting flamed:\n \n well for starters science doesn't disprove god. Any opinions about the existence (or non-existence) of any kind of god come from personal experience, and analysis of current evidence.\n\n Granted \n \n\n While ALL gods can not be shown to exist, it can be pretty conclusively shown that certain gods do not exist. For example, pretend there was a religion... \n\n Obviously that is the case. We cannot simply say that a certain God exists and have it be so.\n \n\n In regards to special stories in various religious documents, it can be pretty conclusively said that most of those stories did not happen (specifically creation) in that way. Granted, there is room for interpretation, however religious folk are reluctant to do that.\n\n Yes it can be said form a scientific and lietral view that the creation did not happen in six days. However, you are wrong in your generalization that religious \"people\" are reluctant to do so, this particular religious folk, for example, is not. Take a look at Genesis 1 and look for general trends and ask yourself if you can't see any similarity to the process of evolution. Conditions arise that would support life, autotrophs precede heterotrophs and last on the scene of major organisms is man. The problem of the plants before the stars and sun is mitigated in that there are other translations that change that order.\n \n You must keep in mind that Moses wrote this book well before any advanced science of biology or geology was created, it is pretty close to modern thoery and amazinlgy so if it was just made up.\n \n There are other examples that I might bring up but then I'd really get flamed by those religious folks that you mentioned.\n \n \nAnd finally in regards to what God is like... certain religions say God has certain characteristics... all loving, all powerful, omniscient... \n Some of these characteristics contradict observations we see today (how can an all loving god allow pain and suffering among the innocent).\n\n This argument is not valid, although it is widely used, and even believed as valid by some that use it. I will use one example of why this is a fallacious argument, in my opinion. To say that an all knowing and loving God would prevent any suffering among the innocent is assuming that a lack of suffering is the best situation for us in God's view. Perhaps it is not. Think of a muscle analogy, in order to grow it must be stressed. So too we may need trials and difficulty to grow and develop as an all powerful and loving God would desire.\n \n Furthermore the argument can be made that God allows us to choose for ourselves. (There is debate over this point among the different religions). Thus suffering is not God's doing but a result of our own, or other's poor choices and actions. God can be all powerful and loving and still, innocents will suffer due to the poor choices of others.\n \n This part of the post was not to prove that a certain God exists but that your given reasons for believing that said God doesn't are not completley valid. And perhaps you need to look over them again and see where you may have made invalid assumptions based on your own ideals. \n \n \n \nWhat we are left with are gods that have considerably little interaction with the world that we know.\n \n \n That who knows? Your use of \"we\" does not include many religious folk I assume. I would claim to know of much interaction that God has and has had with the world.\n \n \n \n \n\n The don't cares are more commonly known as atheists. All the significant gods (gods that are represented by major religions, or gods that have a direct influence on the world around us) have no supporting evidence, and since these gods should be leaving evidence when they interact with our world... well in this case an absence of evidence is evidence of absence.\n\n \n There is actually a lot of evidence. Perhaps you meant no evidence that you consider valid. In which case I suppose you can say that there is no evidence, but don't expect it to be taken for granted. The Bible is evidence, maybe flawed but evidence nonetheless. Many even today claim to see evidence of a god's interaction. It is an error to say that there is none simply because you refuse to accept the possibility that the evidences mentioned, be they personal or world-wide, are real.\n \n \nAs for the other gods, well since they don't interact with our world they don't really matter at all. they could just as well not be there, and life as we know it would be the same. a question that asks \"is there a god?\" is answered \"it doesn't matter\". \n\n \n Very true, especially since when someone asks \"is there a God\" they are most likely really asking \"does the God in which I believe exist\"\n \n \nBoth atheists and agnostics will tell you they see no evidence for the existence of any god. Some will continue with \"thus, there is not one\" and other will continue with \"as for the other, i don't know\". The agnostic position is obviously tentative, however even though the atheist does not explicitly state his position is tentative, you will be hard pressed to find an atheist who states \"there is absolutely, positively, with out a doubt, no god at all\".\n\n \n That distinction may be irrelevant since they do say that no god that any religious person believes in exists. And that is what I was getting at originaly. Still I think that the idea that the existence of all religious gods can be ultimately refuted based on the logic you bring up is invalid.", 
   {}, 
   17404, 
   null, 
   1064559480.0
  ], 
  [
   17414, 
   null, 
   "Pikeman85", 
   "I certainly care.\n \n I generally think of an agnostic as a person who doesn't know, and an atheist who doesn't make a decision unless they DID know.\n \n I.e I am an empirical agnostic, and weak atheist (the latter being what a weak atheist is, they simply worship no god)\n \n And remember. We're all atheists (i.e. not believing in a diety, say Thor) I just believe in one less god than Christians/Jews/Muslims/other Monotheists believe in ;) and of course several less than polytheists", 
   {}, 
   17404, 
   null, 
   1064559600.0
  ], 
  [
   17417, 
   null, 
   "dichotomy?", 
   "I disagree that we are all atheists. According to this definition which is the one I am using. \n \n Main Entry: athe·ist \n Pronunciation: 'A-thE-ist\n Function: noun\n Date: 1571\n : one who denies the existence of God\n \n I do not deny the existance of God. Specifically that god which is spelt with a capital G in English. Your splitting of semantic hairs is interesting though.", 
   {}, 
   17414, 
   null, 
   1064560200.0
  ], 
  [
   17420, 
   null, 
   "Crim", 
   "The Webster's definition of atheist certainly carries some bias as Webster was a Christian. Obviously, one wouldn't consider a Hindu to be an atheist, even though they do not believe in -capital g- God.\n \n The dictionary.com one is better:\n \n One who disbelieves or denies the existence of God or gods.", 
   {}, 
   17417, 
   null, 
   1064560440.0
  ], 
  [
   17423, 
   null, 
   "dichotomy?", 
   "The Webster's definition of atheist certainly carries some bias as Webster was a Christian. Obviously, one wouldn't consider a Hindu to be an atheist, even though they do not believe in -capital g- God.\n \n The dictionary.com one is better:\n \n One who disbelieves or denies the existence of God or gods.\n\n \n \n Even By that definition I am still not an atheist, unless you consider the \"or\" to mean if you deny one or the other you are an atheist. I however take it as a clarifacation of what you need to disbelieve in order to be an atheist. For example a person who reads my original defintion might say \"oh I do deny the existence of God but not gods so I must be an atheist anyway\" it was for this case that the clarification was made not to say that if you deny any god you are an atheist. You can't honestly believe that a Christian or Hindu or Muslim is by definition an atheist. If you do Wow.\n \n Just go to the roots and quit playing semantics so that the post gets back on topic. As far as i can tell atheist is from \"a\" \"theist\" Where a regates the root and leads to not theist. Simple.", 
   {}, 
   17420, 
   null, 
   1064561340.0
  ], 
  [
   17424, 
   null, 
   "Crim", 
   "Even By that definition I am still not an atheist\n \n \n I didn't consider you one.\n \n The line Pikeman used is just a variation of a catchphrase usually used when a theist expresses confusion over why they don't believe in god X. \n \n \"For the same reasons you don't believe in god Y. We're all atheists with respect to some gods/we're both atheists, I just go one god farther/etc\"\n \n In the most general words, an atheist is one who does not believe in any gods.", 
   {}, 
   17423, 
   null, 
   1064561880.0
  ], 
  [
   17427, 
   null, 
   "Pikeman85", 
   "I just wanted to point out that he was seeming to suggest that his god was somewhat more special than the plethora of gods out there, and was trying to remind him of the millions (I'm not exaggerating, I've heard Hinduism has about 300 million gods alone) of other gods people worship.", 
   {}, 
   17424, 
   null, 
   1064563080.0
  ], 
  [
   17428, 
   null, 
   "dichotomy?", 
   "I just wanted to point out that he was seeming to suggest that his god was somewhat more special than the plethora of gods out there, and was trying to remind him of the millions (I'm not exaggerating, I've heard Hinduism has about 300 million gods alone) of other gods people worship.\n\n \n \n Well, I think that the god in which I believe would be more special to me than the gods in which others believe. And yes Hinduism has many gods. Don't know why you even bring this up though. Seeing as how this forum seems to be a Christian, Muslim, Jew Creation vs. evolution site, so yes the God referred to most here will be The god of these religions. What was your point really? That the many different gods somehow prove that there is none? Not very logical. Try responding to the actual post subject isntead of bringing up pointless rhetoric.", 
   {}, 
   17427, 
   null, 
   1064564160.0
  ], 
  [
   17429, 
   null, 
   "TheoMorphic", 
   "Wow... these responses are surprisingly mild... I was expecting a lot harsher treatment.\n \n \nConditions arise that would support life, autotrophs precede heterotrophs and last on the scene of major organisms is man. The problem of the plants before the stars and sun is mitigated in that there are other translations that change that order.\n \n You must keep in mind that Moses wrote this book well before any advanced science of biology or geology was created, it is pretty close to modern theory and amazingly so if it was just made up.\n\n \n The only way really religious documents could be supporting evidence for a God is if an event were attributed to God, and that event left no evidence that natural processes caused it. But 1) there hasn't been overwhelming evidence that any major acts of god have actually occurred (as evidence is uncovered it seems interpretations of the bible change). And 2) Events described in the bible as acts of god could be shown to have natural causes... So in the end the physical evidence we have does not support the bible (unless you keep changing the interpretations of the bible to match evidence) and as a more indirect result does not support that view of God. \n \n \nTo say that an all knowing and loving God would prevent any suffering among the innocent is assuming that a lack of suffering is the best situation for us in God's view. \n \n God can be all powerful and loving and still, innocents will suffer due to the poor choices of others.\n\n \n Ok, this does seem like one of the weaker arguments as to why there is no evidence for god... but it's like this... Some people's idea of god is all loving, and all knowing... and well you know. But if that were the case we would expect there to not be things like pain and suffering. Granted, we may not actually be able to know his grand design, and how this pain is actually necessary... but it just goes against my reasoning. I guess I could take their word for it that it's part of God's plan... but since they don't know his plan either that isn't very comforting... and hardly positive evidence. \n \n It also gets me wondering how they don't know how god's design work, however they do know god has certain qualities. (but that's neither here nor there)\n \n \nThat who knows? Your use of \"we\" does not include many religious folk I assume. \n\n \n When I say \"we\" I mean people who are going about reasoning whether there is any evidence for any particular god. Mainly agnostics and atheists. \n \n \nIt is an error to say that there is none simply because you refuse to accept the possibility that the evidences mentioned, be they personal or world-wide, are real.\n\n \n Up above I mentioned how the bible could only really be used in combination with other evidence that suggested the same thing. With the scientific method you have to explain all evidence, not just the pieces you want to explain... I don't see the bible as a piece of evidence that has to be explained... at the very best it could be used to say \"look, this is further proof that a certain conclusion drawn from other evidences is true\".\n \n As far as god's interactions (miracles?) this isn't quite proof for any one god. Maybe some higher being who is just an incredibly nice guy... but like you said, when someone asks me \"is there a god\" they most likely mean \"does my god exist\". For those conversations I'm saying you'll pretty much always get to the conclusions \"that god probably does not exist\".\n \n \nThat distinction may be irrelevant since they do say that no god that any religious person believes in exists. And that is what I was getting at originaly. Still I think that the idea that the existence of all religious gods can be ultimately refuted based on the logic you bring up is invalid.\n\n \n Here's the thing... this is my thought process... and probably the thought process of a lot of other agnostics and atheists. I'm not expecting this to change the minds of any religious individuals out there (not do I even hope). This is simply what has caused me to adopt the position I hold today. \n \n I accept that possibly my logic is horribly flawed (but I don't think it is)... but even if it were at the very worst I would just be as religious and dogmatic as religious folks. It's just that in my mind I prefer to have reasoning and logic behind my beliefs. For me it's better to have reasons and logic for beliefs. Going through this thought process is better for me because of who I am. Maybe some of my reasoning is flawed... but I doubt ALL of it is flawed... and as long as it's not all flawed then I am just that much farther from totally blind faith (which is better for me).", 
   {
    "unicode_changes_made": true
   }, 
   17413, 
   null, 
   1064564880.0
  ], 
  [
   17450, 
   null, 
   "letgo", 
   "becuase science condridicts what the church has told people. \n \n First there was that the earth wasent the center of the universe, that really disturbed the religous institutions of the time. \n \n Then geology and evolution which made it obvious that the worlds been around much longer then what is suggested by the bible, and that it wasnet created in such a short time. \n \n Aswell as the fact that there is disproof for any soul of the body that goes to heaven, as far as our instermentation can read there is nothing there after the body dies, and for it to obey the laws of phisics something must be there.\n \n aswell as the socialogical aspects of how conveniant religion is huh? if your nice and stay orderly youll exist for eternity in heaven (wow that sounds like a pretty sweet deal)\n \n Oh and hinduism doesent have 300 million THAT would be insane huh? a god for each person yeh, no it has about 24000.\n \n and the existance of other gods is a valid argument that must be aswerd by christians and any other religious person.\n \n you must answer why is your god more valid then the hindus or the buddists or the pagens or the hundreds of others beleifs.\n \n so yes the existance of other religions can be seen as disproof for your god, becuas logic dictates that you must ask yourself why your god didint speak to people in asia or south america.\n what makes there visions of otherworldly beings any differnt then that of moses or allah.\n \n wow i think i just put down a good argument, now you may procede to tear it to peices.", 
   {}, 
   17429, 
   null, 
   1064576220.0
  ], 
  [
   17464, 
   null, 
   "montalban", 
   "becuase science condridicts what the church has told people. \n \n First there was that the earth wasent the center of the universe, that really disturbed the religous institutions of the time.\n \n Then geology and evolution which made it obvious that the worlds been around much longer then what is suggested by the bible, and that it wasnet created in such a short time. \n\n \n Let's give credit where credit is due. Science taught that the world was the centre of the universe. The leading scientists convinced churchmen to take allegorical passages of the Bible and re-interpret them as literal. The ancient Greeks, who were esteemed in Europe as the pre-eminent scientists of their day believed this.\n \n They also believed that people were made up of four elements. And taught this.\n \n Scientists backed up racism\n \n \"No rational man (writes Thomas Huxley, a contemporary evolutionist), cognizant of the facts, believes that the average Negro is the equal, still less the superior, of the white man. And if this be true, it is simply incredible that, when all his disabilities are removed, and our prognathous relative has a fair field and no favor, as well as no oppressor, he will be able to compete successfully with his bigger-brained and smaller-jawed rival, in a contest which is to be carried out on by thoughts and not by bites.\" (Thomas H. Huxley, \"Lay Sermans, Addresses and Reviews\" (New York: Appleton, 1871) p. 20. Huxley was arguing that blacks could not compete intellectually with Caucasians, even under equal and fair conditions.)\"\n http://www.goodschools.com/darwin.htm\n \n What then is your point?\n \n \nAswell as the fact that there is disproof for any soul of the body that goes to heaven, as far as our instermentation can read there is nothing there after the body dies, and for it to obey the laws of phisics something must be there.\n\n \n Show me the proof, if you will that there is no soul.\n \n Then you say there is nothing \"after the body dies.\" After the body dies, there's the body. So I don't know why you'd argue that.\n \n \naswell as the socialogical aspects of how conveniant religion is huh? if your nice and stay orderly youll exist for eternity in heaven (wow that sounds like a pretty sweet deal)\n\n \n How has the 'convenience' of a religion disprove the existence of God? What sociological aspects are you referring to? Are these the same forces that make anti-religious feeling more 'convenient today?\n \n \nOh and hinduism doesent have 300 million THAT would be insane huh? a god for each person yeh, no it has about 24000.\n \n and the existance of other gods is a valid argument that must be aswerd by christians and any other religious person.\n\n \n What argument are you making? Are you saying there is no God because there are 2,400 gods?\n \n Most Hindus in reality believe in one god, who manifests him/herself as many different things.\n \n \nyou must answer why is your god more valid then the hindus or the buddists or the pagens or the hundreds of others beleifs.\n\n \n What do you mean that god is more valid? How are you judging God as being valid?\n \n \nso yes the existance of other religions can be seen as disproof for your god, becuas logic dictates that you must ask yourself why your god didint speak to people in asia or south america.\n\n \n There are several scientific explanations for the nature of the earth. Some use 'science' to say that the world is flat. Granted that these beliefs aren't widely accepted, but then not all religions are widely accepted. By your reasoning or 'logic' you must ask yourself about whether you should rely on science when there are many different scientific theories.\n \n The Flat Earth News, at least back then, had a regular column, \"One Hundred Proofs Earth is Not a Globe.\"\n (go to http://www.flat-earth.org/)\n \n Other theories taught as science\n phrenology\n alchemy\n evolution\n eugenics\n neptunism\n \n Theories of the Aether Articles relating to the Emergence of Scientific Theories of the Cosmic Aether\n (http://www.mountainman.com.au/aether.html)\n \n What about 'metascience'?\n http://www.calresco.org/lucas/science.htm\n \n Or, sciences used to support political ends...\n \n What about Marxist Science\n http://www.marxists.org/archive/haldane/works/1930s/philosophy.htm\n or Chaos Theory and Marxism\n http://www.marxist.com/science/chaostheory.html\n \n There's Nazi Science\n http://www.webster.edu/~woolflm/naziscience.html\n \n Nationalist Science\n http://www.ljudmila.org/nettime/zkp4/08.htm\n \n Or social ends...\n Scientific Racism\n http://www.press.uillinois.edu/f02/tucker.html\n \n Mainstream scientists instead of using the word 'heretic' use the word 'pseudo-science' to categorise fringe beliefs.\n \n \nwhat makes there visions of otherworldly beings any differnt then that of moses or allah.\n\n \n What makes them different is that Muslims believe in Allah, and Hindus do not.\n \n \nwow i think i just put down a good argument, now you may procede to tear it to peices.\n\n \n Done.\n \n You might want to look at http://www.dharma-haven.org/science/myth-of-scientific-method.htm", 
   {}, 
   17450, 
   null, 
   1064595360.0
  ], 
  [
   17535, 
   null, 
   "Chobo Char", 
   "Montalban, the difference is when you choose a god you are having to do so mostly based on faith. You will never be able to absoloutley know if you made the right decision. Sciences can be directly compared and disproven based on evidence. Most of the things you listed aren't even real science, while you have thousands of denominations of Christianity, all claiming to be fact, with no real way to tell who is correct.", 
   {}, 
   17464, 
   null, 
   1064621280.0
  ], 
  [
   17550, 
   null, 
   "montalban", 
   "Montalban, the difference is when you choose a god you are having to do so mostly based on faith. You will never be able to absolutely know if you made the right decision. Sciences can be directly compared and disproven based on evidence. Most of the things you listed aren't even real science, while you have thousands of denominations of Christianity, all claiming to be fact, with no real way to tell who is correct.\n\n \n \n You're basis for what is 'real' science is exactly my point. If you were a Nazi, you'd say that Nazi science was real science, and you'd have chances to prove your racist points using experiments etc.\n \n There are hundreds of 'denominations' in science, only a few of which I pointed out.\n \n The point about science is ridiculous when some people have been talking about objective evidence.\n \n Evidence that is 'objective' is meaningless evidence. Something can sit on a table. It is evidence that is objective. What is this thing? As it stands, it could be said to be objective evidence, but it is meaningless unless I know what it is. The moment I start interpreting what it is it becomes subjective evidence. Carried in my interpretations are all my own biases and limitations based on how, when, where and why I observe.\n \n Yes a majority of people agree that Nazi science is bunk, but that's because the majority of us aren't racist. We reject the scientific evidence based on our own understanding of the world.\n \n \n Same with flat-eathers, Marxist scientists etc.\n \n It is wrong to set science up as something beyond human foibles. It is unscientific to do so. These examples that I gave show that!\n \n Thus when we look at 'evidences' of a young earth, there are scientists who believe this evidence. Many more don't, but both of them are using science and both say that the other side is unscientific. Both are genuine in their criticisms - they're not just trying to spoil for the sake of it; and what makes one right?\n \n An a priori understanding.", 
   {}, 
   17535, 
   null, 
   1064625420.0
  ], 
  [
   17552, 
   null, 
   "montalban", 
   "Furthermore many evolutionaries here will point-blank refuse to believe in miracles. I pointed out on another post that the Catholic Church has a commission, including scientists who investigate alleged miracles.\n \n They have found some instances of miracles.\n \n This would be rejected off-hand by atheists because of the wider implications if it were true.\n \n They take to the evidence with their acceptence that there is no God, therefore no super-natural miracles.", 
   {}, 
   17550, 
   null, 
   1064625720.0
  ], 
  [
   17555, 
   null, 
   "Crim", 
   "Miracles are events that cannot be explained. Obviously, such events occur from time to time. However, just because they cannot be explained doesn't mean they were performed by gods, fairys, leprechauns, etc.", 
   {}, 
   17552, 
   null, 
   1064626020.0
  ], 
  [
   17573, 
   null, 
   "letgo", 
   "Montalban\n \n \nLet's give credit where credit is due. Science taught that the world was the centre of the universe. The leading scientists convinced churchmen to take allegorical passages of the Bible and re-interpret them as literal. The ancient Greeks, who were esteemed in Europe as the pre-eminent scientists of their day believed this.\n \n \n Theres a differnce between science of the old world and sciece of the new. If you could even call those people scientists, they did not require much proof to make there therorys compleat.\n \n when galilaio found that the earth was not the center of the universe (if that was him?) and magellen found that the world was round. Those were made by making observations. They had something backing it besides pure speculation. \n \n As i recall the some of the greek scientists thought that the only tool they needed to discover the rules of science was there brain, and that experiments were pointless.\n \n This is not the science of today where to have a therory you have to have a proof that has to have significant evidence. ofcourse it can still be wrong.\n \n \nScientists backed up racism\n \n \n Yeh well for 1 that was not science but propaganda for the south or hitler or just his own sense of suppiority. I doubt his therory was backed by anything implying those statements.\n \n And to have this comming from a religious mans mouth is halliarious\n \n SO now i can say RELIGION backed murder - rape - slavery - and false prosicution. But do people judge Religion on the millions who have died or sufferd due to it. NO\n \n There are some Mad scientists out there, wether there acutally scientists or just propagahnda machines like this guy probably was varys.\n \n But dont ever try to wiegh the crimes of science agains the crimes of religion.\n \n \n \nShow me the proof, if you will that there is no soul.\n \n \n Our conciousness is stored in our brain, we know that cuz we can see ALOT of evidence for that.\n \n Our body and our brain ceases to function after death, therefor our conciousness to continue to exist must go somewhere else.\n \n Our instermentation that we have has not seen anything rise from the body, no visible light no electro magnetic radiation, nothing.\n \n but then our instermentations does kinda suck.\n \n \n \nHow has the 'convenience' of a religion disprove the existence of God? What sociological aspects are you referring to? Are these the same forces that make anti-religious feeling more 'convenient today?\n \n \n \n The convenience of religion is clear.\n \n Isnt it nice to hear that we all go to a nice place when we die, that if we lead good lives we will be rewarded?\n Religion offers eternal life, Paradise if your good, A person to pray too when times get tough, and when your mommy dies a comfort that shes not really dead just with god, probably in a better place.\n \n And what event, or reason do people beleve in god? \n \n Becuase moses came down the mountian with some rocks. When you beleve in god you our putting as much faith in moses as you our god.\n I wonder did any1 check his pocket for a chisel?\n \n So u beleve this 1 guy becuase well i dont know, Throughout history it has become evident that people really do lie alot.\n \n The Atheist beleif is not a soft a fuzzy one, It is a cold hard truth that is not easy to take, but is the logical conclusion of therorys (made by observing the nature of our universe) that Contridict the bible.\n I Will admit that the athiest now days think theres way more proof then there really is, But there is proof that deffenatly does Contridict what we have been told by the bible.\n \n When I go to sleep at night i think about death, without a beleif in god it is hard to take, the fact that i just die, and do not go anywhere afterwards. That i simply turn off, its somewhat frightening, Whats more frightening for me is that my loved ones really do just Turn off when they die, that makes me more afriad then anything that i may lose the people i love for eternity, i dont know why im so afriad of my mom dieing if im going to aswell.\n \n Atheists would love to beleve in god, If god came down from the heavens and spoke to me, i would not doubt him another second, if he showed me something that made me beleve, i would be a devote christians. But so far nothing, and yes even though i am a athiest i still pray every month or so just to see if any1 will answer this time.\n \n oh and ANTI-RELIGIOUS thinking today is more supported becuase there is more disproof and free thinking people to disprove it then ever.\n \n \n \nWhat argument are you making? Are you saying there is no God because there are 2,400 gods?\n \n \n I just needed a Exotic religoin to reference too, something that is so unlike christianity.\n \n Okay say the greeks, no the Hindus\n \n \nWhat do you mean that god is more valid? How are you judging God as being valid?\n \n \n im judging all the relgions on vadility as by what backs them, And in all cases it is a person or a group of people saying the talked to god, saw him, heard about him exct.....\n \n so if all the religions are based on human visions, all of them have the same amount of proof.\n \n therfoor if all of them have the same amount of proof backing it, and only 1 can be right?\n \n then christianinty has a 1 in 1000 chance of being the 1 that is right.\n \n \nWhat makes them different is that Muslims believe in Allah, and Hindus do not.\n \n \n Okay let me restate the question\n \n What makes the visions of the christian god better/more valid to beleve in then the visions of the native american god.\n \n So why should a native american who beleves in ther god for the same reason as you beleve in your god (spoke to him in a vision) Beleve in your god over his own?\n \n If you cannot give a reason then all relegions are created equal in vadility, and if only 1 can be right as many religions state.\n \n then theres 1 in 1000 or more chance of any religion (i suppose that beleve that there the only right way as christianity dose/has depending on your own version of it)\n \n so do u beleve that your religion montalban, i assume thats christianity?is the only right religion, that others who dont beleve will suffer and go to hell?", 
   {}, 
   17555, 
   null, 
   1064637900.0
  ], 
  [
   17591, 
   null, 
   "montalban", 
   "Miracles are events that cannot be explained. Obviously, such events occur from time to time. However, just because they cannot be explained doesn't mean they were performed by gods, fairys, leprechauns, etc.\n\n \n Partly true. Science can't explain them. The church can.\n \n Funny that one just happens to look like Mary (whom we Orthodox refer to as Theotokos; but the Catholics sometimes call co-redemptress)\n http://www.sancta.org/intro.html", 
   {}, 
   17555, 
   null, 
   1064652000.0
  ], 
  [
   17592, 
   null, 
   "Crim", 
   "Partly true. Science can't explain them. The church can.\n \n \n No, it can't. Their explanations are unreasonable and unfounded.", 
   {}, 
   17591, 
   null, 
   1064653320.0
  ], 
  [
   17593, 
   null, 
   "montalban", 
   "Theres a differnce between science of the old world and sciece of the new. If you could even call those people scientists, they did not require much proof to make there therorys compleat.\n \n\n \n Firstly, it was the best of the time. That is what they taught. That is what most people accepted, including the Church.\n \n What observations have lead scientists to conclude that abiogenesis happened?\n \n Science is about hypothesis, and then experimenting to see if that hypothesis stands up, and hence the subjectiveness of it, because many people want to look at the evidence of support.\n \n Montalban: Scientists backed up racism\n \n \n\n Yeh well for 1 that was not science but propaganda for the south or hitler or just his own sense of suppiority. I doubt his therory was backed by anything implying those statements.\n And to have this comming from a religious mans mouth is halliarious\n\n \n I accept that people are biased. You don't. You think that there's science (pure and good) and pseudo-science. Quite clearly you believe your truth. They believe theirs. Therefore you call there's non-science. They call yours non-science.\n \n \nSO now i can say RELIGION backed murder - rape - slavery - and false prosicution. But do people judge Religion on the millions who have died or sufferd due to it. NO\n There are some Mad scientists out there, wether there acutally scientists or just propagahnda machines like this guy probably was varys.\n\n \n Are you talking about all religion? Such a strange generalisation. Let me narrow the focus for a moment to Orthodox Christianity. Where did Christ say it's okay to murder, rape, enslave, bear false witness?\n \n \nBut dont ever try to wiegh the crimes of science agains the crimes of religion.\n\n \n Okay. I wouldn't want to because there's too many killed by scientists. Even today scientist regularly torture animals. Racism has grown with the advent of modern sciences \" The foundation of modern \"scientific\" racism was Gobineau's (1853-5) Essay on the Inequality of Human Races\"\n http://home.austarnet.com.au/stear/cg_science_of_racism.htm\n (also: http://www.geocities.com/CapeCanaveral/Lab/1366/racism.html)\n \n \n I asked \n \"Show me the proof, if you will that there is no soul.\"\n \n \nOur conciousness is stored in our brain, we know that cuz we can see ALOT of evidence for that.\n Our body and our brain ceases to function after death, therefor our conciousness to continue to exist must go somewhere else.\n Our instermentation that we have has not seen anything rise from the body, no visible light no electro magnetic radiation, nothing.\n but then our instermentations does kinda suck.\n\n \n This is not proof, it is an admission your looking for brain wave signs after death, not the soul.\n \n \nThe convenience of religion is clear.\n Isnt it nice to hear that we all go to a nice place when we die, that if we lead good lives we will be rewarded?\n Religion offers eternal life, Paradise if your good, A person to pray too when times get tough, and when your mommy dies a comfort that shes not really dead just with god, probably in a better place.\n\n \n Buddhism is a religion. Buddhism doesn't offer heaven, as far as I'm aware. Your generalisations concerning all religion is flawed. I'm not sure that all pagans believe in heaven either.\n \n \nAnd what event, or reason do people beleve in god?\n\n \n People tend to believe in God, because He exists.\n \n \nBecause moses came down the mountian with some rocks. When you beleve in god you our putting as much faith in moses as you our god. I wonder did any1 check his pocket for a chisel?\n\n \n Yes, I have belief in Moses. What is your point? What would a chisel prove?\n \n [QUOTE=letgo]So u beleve this 1 guy because well i dont know, Throughout history it has become evident that people really do lie alot.\n \n 'Guy'? If you mean God, yes. Yes people do lie a lot. What is your point?\n \n \nThe Atheist beleif is not a soft a fuzzy one, It is a cold hard truth that is not easy to take, but is the logical conclusion of therorys (made by observing the nature of our universe) that Contridict the bible.\n\n \n Not all atheist 'beliefs' contradict the Bible. The statement \"Jesus was born in Bethlehem\" may be acceptable to many atheists. So might the statement of principle \"Love your neighbour\", \"Thou shalt not kill\", etc.\n \n Observations are subjective.\n \n \nI Will admit that the athiest now days think theirs way more proof then there really is, But there is proof that deffenatly does Contridict what we have been told by the bible.\n\n \n (See above)... which bits of the Bible? Do you believe that King David lived? Or that the Romans invaded Judea?\n \n \nWhen I go to sleep at night i think about death, without a beleif in god it is hard to take, the fact that i just die, and do not go anywhere afterwards. That i simply turn off, its somewhat frightening, Whats more frightening for me is that my loved ones really do just Turn off when they die, that makes me more afriad then anything that i may lose the people i love for eternity, i dont know why im so afriad of my mom dieing if im going to aswell.\n\n \n Yes, if it were true it wouldn't be nice, to simply vanish.\n \n \nAtheists would love to beleve in god, If god came down from the heavens and spoke to me, i would not doubt him another second, if he showed me something that made me beleve, i would be a devote christians. But so far nothing, and yes even though i am a athiest i still pray every month or so just to see if any1 will answer this time.\n\n \n What are you praying for? Just for 'proof'?\n \n \noh and ANTI-RELIGIOUS thinking today is more supported because there is more disproof and free thinking people to disprove it then ever.\n\n \n 'Free-thinking people' is a loaded term.\n \n \nim judging all the relgions on vadility as by what backs them, And in all cases it is a person or a group of people saying the talked to god, saw him, heard about him exct.....\n\n \n Many Buddhists don't talk to God, because they don't believe in God. You need to narrow the field of your critique.\n \n \nso if all the religions are based on human visions, all of them have the same amount of proof.\n\n \n This would be true if you mean that the visions stemmed from the humans.\n \n \ntherfoor if all of them have the same amount of proof backing it, and only 1 can be right?\n then christianinty has a 1 in 1000 chance of being the 1 that is right\n\n \n If it's statistics that is making you doubt, think of all the different sciences that exist; Marxist, Nazi, Nationalist, Meta etc. Your hopes in science therefore are based on you guessing which is right.\n \n I acknowledge all religious experiences as being genuine religious experiences. I don't necessarily believe that the Hindu religious experience emanates from God though. Orthodoxy believe that demons exist in order to confuse.\n \n If you want to attempt an 'objective' test... ask yourself which religious vision of the world is the best. For instance you can easily discount \"The Children of God\" if you don't support paedophilia - because they do.\n \n Look to the religious leader, did he practice what he preached? I'm not talking about people who do something which is the opposite of what they are taught.\n \n Muhammad taught some lessons on tolerance, but he personally applauded political assassinations, and the killing of over 900 PoWs. \n He also said both to respect non-believers, and to kill non-believers and to this day it is still a crime to convert from Islam.\n \n Further, in the Haddiths it demonstrates that he married one wife, Aisha, when she was six, and consummated the relationship when she was nine. Further, he limited his followers to four wives, but he himself had nine. Thus, the Ayatollah Khomenni saw no problem marrying a ten year old when he was twenty - because he was following the example of his leader.\n \n Islam has no shame towards promoting slavery. \"In short, it is not only the institution of slavery that causes revulsion in the human heart, it is the attitudes of inhumanity which sustain it.\" http://www.fethullahgulen.org/questions/questions30.html This statement suggests that slavery under Islam is more 'humane' rather than arguing against slavery altogether. And it lists how much worse slaves were under Christian Europe.*\n \n These might be indicators if the religion is 'true' or not.\n \n \n \n *Oddly enough this same site has a page talking about Islamic conquests... \"In no era of history, nor in any region of the world, have Muslims, as Muslims, as individuals, or collectively as government or nation, exploited people, nor have let others do so where Muslim government had jurisdiction. \"\n http://www.fethullahgulen.org/questions/questions29.html\n They justify this because they weren't out to conquest or exploit the lands for economic gain, but to do so in the name of God. So they killed not for personal gain!\n \n If a Christian tried to be proud about such a boast of Crusaders, he'd be howled down and chased out of town.", 
   {}, 
   17573, 
   null, 
   1064654580.0
  ], 
  [
   17597, 
   null, 
   "letgo", 
   "ill answer that tommarow, not enough time at the moment.", 
   {}, 
   17593, 
   null, 
   1064660220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How does one arrive at a disbelief in God?  And other random musings.", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1041-how-does-one-arrive-disbelief-god-other-random-musings.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 1041, 
  "discussion_files": [
   [
    "15552.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1041-how-does-one-arrive-disbelief-god-other-random-musings-print.html"
   ], 
   [
    "15553.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1041-how-does-one-arrive-disbelief-god-other-random-musings-2-print.html"
   ]
  ], 
  "identifier": 1041
 }
]