[
 [
  [
   285622, 
   null, 
   "obvious_child", 
   "The literal creationists like to run around here pretending that only their literal beliefs and evolution exist. They ignore metaphorical creation and the oh, several thousand religions have that existed or exist today that talk about how the world came to be.\n \n What makes literal genesis true opposed to Norse, Hindu or any other religion's creation story?", 
   {
    "post_info": {
     "post_title": "Norse Creation vs Biblical Creation"
    }
   }, 
   null, 
   null, 
   1191027060.0
  ], 
  [
   285632, 
   null, 
   "snakespit", 
   "The literal creationists like to run around here pretending that only their literal beliefs and evolution exist. They ignore metaphorical creation and the oh, several thousand religions have that existed or exist today that talk about how the world came to be.\n \n What makes literal genesis true opposed to Norse, Hindu or any other religion's creation story?\n\n \n Individual belief. But they can't stop at that.", 
   {}, 
   285622, 
   null, 
   1191033540.0
  ], 
  [
   285772, 
   null, 
   "chemist99a", 
   "I always rather preferred the Norse Gods. Jolly good drinking buddies and with a sense of humor in some cases. Just larger than life good old boys out for a good time raping, pillaging, and burning. Good warrior chaps all!", 
   {}, 
   285632, 
   null, 
   1191149460.0
  ], 
  [
   286470, 
   null, 
   "obvious_child", 
   "Anyone surprised that the Literal Genesis folk won't post here? \n \n After all, their false Dichotomies are so false.emoticon_xagree", 
   {}, 
   285772, 
   null, 
   1191473940.0
  ], 
  [
   286524, 
   null, 
   "sinjin", 
   "The literal creationists like to run around here pretending that only their literal beliefs and evolution exist. They ignore metaphorical creation and the oh, several thousand religions have that existed or exist today that talk about how the world came to be.\n \n What makes literal genesis true opposed to Norse, Hindu or any other religion's creation story?\n\"Then was not non-existence nor existence: there was no realm of air, no sky beyond it. What covered in, and where? and what gave shelter? Was water there, unfathomed depth of water? Death was not then, nor was there aught immortal: no sign was there, the day's and night's divider. That One Thing, breathless, breathed by its own nature: apart from it was nothing whatsoever. Darkness there was at first concealed in darkness this. All was indiscriminated chaos. All that existed then was void and form less: by the great power of Warmth was born that Unit. Thereafter rose Desire in the beginning, Desire, the primal seed and germ of Spirit. Sages who searched with their heart's thought discovered the existent's kinship in the non-existent. Transversely was their severing line extended: what was above it then, and what below it? There were begetters, there were mighty forces, free action here and energy up yonder. Who verily knows and who can here declare it, whence it was born and whence comes this creation? The devas are later than this world's production. Who knows then whence it first came into being? He, the first origin of this creation, whether he formed it all or did not form it, Whose eye controls this world in highest heaven, he verily knows it, or perhaps he knows not\".http://en.wikipedia.org/wiki/Hindu_cosmology\n http://www.hinduwisdom.info/Hindu_Cosmology.htm", 
   {}, 
   285622, 
   null, 
   1191518520.0
  ], 
  [
   286532, 
   null, 
   "Iuris", 
   "Supersport, where art thou now...\n \n Bah, who am I kidding. Of course he won't come over here...", 
   {}, 
   286524, 
   null, 
   1191523680.0
  ], 
  [
   286553, 
   null, 
   "obvious_child", 
   "Supersport, where art thou now...\n \n Bah, who am I kidding. Of course he won't come over here...\n\n \n Well he HAS admitted he can't prove his belief. I guess that posting here would admit his false dichotomies that it's either literal genesis or evolution are false and god knows the world will end when that happens. Super admitting he's wrong? \n \n Never going to happen.", 
   {}, 
   286532, 
   null, 
   1191532740.0
  ], 
  [
   286557, 
   null, 
   "ShadowPikachu", 
   "Well he HAS admitted he can't prove his belief. I guess that posting here would admit his false dichotomies that it's either literal genesis or evolution are false and god knows the world will end when that happens. Super admitting he's wrong? \n \n Never going to happen.\n\n \n Supersport isn't even serious about this - he doesn't believe the #### that he spews.\n \n From a PM that he sent to a friend of mine on a different forum:\n \nOh lighten up fuzzy liar...I've been called lots worse on bulletin\n boards, like stupidplurt and snotsport. Its all a game anyway, I just\n like to have fun at work waiting for phone calls. coadie may believe\n this ####, but I don't. \n \n supersport\n\n (coadie is a creationist nut over on CARM forums that makes Supersport - or at lest what supersport plays at being - look like a moderate christian.)\n \n Here's a link to where my friend (fusilier) posted the PM he recieved from supersport: http://www.antievolution.org/cgi-bin/ikonboard/ikonboard.cgi?act=SP;f=14;t=5197;p=76117\n \n So I wouldn't even bother with Sport, as all he's dong is playing around.", 
   {}, 
   286553, 
   null, 
   1191533400.0
  ], 
  [
   286962, 
   null, 
   "obvious_child", 
   "we should turn this entire forum into a mythical/religion vs mythical/religion origin debate. \n \n let's see how well the creationists here do against Hindu, Norse, Egyptian, Zoroastrian, Manichean, Yezidi and the whole host of other religion's beliefs of origin.", 
   {}, 
   286557, 
   null, 
   1191797040.0
  ], 
  [
   286965, 
   null, 
   "electrolyte", 
   "let's see how well the creationists here do against Hindu, Norse, Egyptian, Zoroastrian, Manichean, Yezidi and the whole host of other religion's beliefs of origin.\n\n To the creationist, o_c, those don't exist. It's the unacceptable evolution or their own myth, so that they can have the (false) dichotomy.", 
   {}, 
   286962, 
   null, 
   1191798360.0
  ], 
  [
   286976, 
   null, 
   "obvious_child", 
   "To the creationist, o_c, those don't exist. It's the unacceptable evolution or their own myth, so that they can have the (false) dichotomy.\n\n \n Hence why we need should force them to argue one religion against another. Let's see who comes out on top, Jesus or Uranus.", 
   {}, 
   286965, 
   null, 
   1191801900.0
  ], 
  [
   287001, 
   null, 
   "ShadowPikachu", 
   "Hence why we need should force them to argue one religion against another. Let's see who comes out on top, Jesus or Uranus.\n\n \n Depends on if they end up arse over ears, of course. If they end up sitting down, then of course Uranus would end up on the bottom. :)", 
   {}, 
   286976, 
   null, 
   1191808920.0
  ], 
  [
   287831, 
   null, 
   "obvious_child", 
   "Personally, I'd favor either Egyptian or Norse mythology over Christian creation mythology.", 
   {}, 
   287001, 
   null, 
   1192414260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Norse Creation vs Biblical Creation", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10433-norse-creation-vs-biblical-creation.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10433, 
  "discussion_files": [
   [
    "1697.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10433-norse-creation-vs-biblical-creation-print.html"
   ]
  ], 
  "identifier": 10433
 }
]