[
 [
  [
   286670, 
   null, 
   "DrD", 
   "We tried so hard to make things better for our kids that we made them worse. For my grandchildren, I'd like better.\n \n I'd really like for them to know about hand me down clothes and homemade ice cream and leftover meat loaf sandwiches. I really would.\n \n I hope you learn humility by being humiliated, and that you learn honesty by being cheated.\n \n I hope you learn to make your own bed and mow the lawn and wash the car.\n \n And I really hope nobody gives you a brand new car when you are sixteen.\n \n It will be good if at least one time you can see puppies born and your old dog put to sleep.\n \n I hope you get a black eye fighting for something you believe in.\n \n I hope you have to share a bedroom with your younger brother/sister. And it's all right if you have to draw a line down the middle of the room, but when he wants to crawl under the covers with you because he's scared, I hope you let him.\n \n When you want to see a movie and your little brother/sister wants to tag along, I hope you'll let him/her.\n \n I hope you have to walk uphill to school with your friends and that you live in a town where you can do it safely.\n \n On rainy days when you have to catch a ride, I hope you don't ask your driver to drop you two blocks away so you won't be seen riding with someone as un-cool as your Mom.\n \n If you want a slingshot, I hope your Dad teaches you how to make one instead of buying one.\n \n I hope you learn to dig in the dirt and read books.\n \n When you learn to use computers, I hope you also learn to add and subtract in your head.\n \n I hope you get teased by your friends when you have your first crush on a boy\\girl, and when you talk back to your mother that you learn what ivory soap tastes like.\n \n May you skin your knee climbing a mountain, burn your hand on a stove and stick your tongue on a frozen flagpole.\n \n I don't care if you try a beer once, but I hope you don't like it. And if a friend offers you dope or a joint, I hope you realize he is not your friend.\n \n I sure hope you make time to sit on a porch with your Grandma/Grandpa and go fishing with your Uncle.\n \n May you feel sorrow at a funeral and joy during the holidays I hope your mother punishes you when you throw a baseball through your neighbor's window and that she hugs you and kisses you at Hanukkah/Christmas time when you give her a plaster mold of your hand.\n \n These things I wish for you - tough times and disappointment, hard work and happiness. To me, it's the only way to appreciate life.", 
   {
    "post_info": {
     "post_title": "Paul Harvey Writes:"
    }
   }, 
   null, 
   null, 
   1191600360.0
  ], 
  [
   289186, 
   null, 
   "coberst", 
   "In Eastern Texas when Paul talks everyone gets out their pencil and paper.", 
   {}, 
   286670, 
   null, 
   1193580360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Paul Harvey Writes:", 
  "url": "http://www.4forums.com/political/philosophy-debates/10460-paul-harvey-writes.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 10460, 
  "discussion_files": [
   [
    "26811.html", 
    "http://www.4forums.com/political/philosophy-debates/10460-paul-harvey-writes-print.html"
   ]
  ], 
  "identifier": 10460
 }
]