[
 [
  [
   287081, 
   null, 
   "wascallywabbit", 
   "**\n \n Just for fun, some recent research--\n \n http://www.cbc.ca/health/story/2007/10/08/appendix-use.html", 
   {
    "post_info": {
     "post_title": "As regards the poor old appendix"
    }
   }, 
   null, 
   null, 
   1191876600.0
  ], 
  [
   287083, 
   null, 
   "T.Q", 
   "**\n \n Just for fun, some recent research--\n \n http://www.cbc.ca/health/story/2007/10/08/appendix-use.html\n\n \n and your point is?", 
   {}, 
   287081, 
   null, 
   1191878580.0
  ], 
  [
   287355, 
   null, 
   "wascallywabbit", 
   "and your point is?\n\n \n **\n I wasn't making a 'point', just an observation. But since you want a 'point', nip back over to \"The Swamp\",[that is, 'Internet Infidels (atheists)DB', and ask Oolon Colophid[sp.?] why he thinks the human appendix makes his 'point'.", 
   {}, 
   287083, 
   null, 
   1192035120.0
  ], 
  [
   287359, 
   null, 
   "Count Otto", 
   "Seems like the appendix is vestigial by any measure. Even if it had the function of repopulating gut bacteria*, it's function has now been reduced because populations now share the bacteria between themselves and don't need this method of repopulation.\n \n \n (*It further occurs that all this really means is that the same bacteria live in this sheltered part of the gut as live in the rest of it and they stand a better chance of surviving extinction of the rest of the gut's bacteria and thus repopulating it. Seems a bit of a stretch to equate that with function...)", 
   {}, 
   287355, 
   null, 
   1192036560.0
  ], 
  [
   287361, 
   null, 
   "Peeling", 
   "Maybe it's because the evidence that indicates a use for the appendix, rather than it being an incompletely useless vestige, is itself further evidence of evolution and common descent. I think Oolon's points concern the fact that creationists were so happy to see a troublesome 'vestigial trait' disappear, and so quick to jump on the 'appendix has a function' bandwagon, that they didn't bother to check who was driving it or where it was going.\n \n Also, what Otto said.", 
   {}, 
   287355, 
   null, 
   1192036800.0
  ], 
  [
   287447, 
   null, 
   "electrolyte", 
   "Maybe it's because the evidence that indicates a use for the appendix, rather than it being an incompletely useless vestige, is itself further evidence of evolution and common descent.\n\n Bingo. Relationships between appendices of closely related species still suggest that the appendix used to have a different function, namely digestion of roughage. Linky. (Plus what Otto said, again.)", 
   {}, 
   287361, 
   null, 
   1192067400.0
  ], 
  [
   287448, 
   null, 
   "electrolyte", 
   "... nip back over to \"The Swamp\",[that is, 'Internet Infidels (atheists)DB', and ask Oolon Colophid[sp.?] why he thinks the human appendix makes his 'point'.\n\n Kudos on the arrogant, hateful stereotyping, wabbit. Ask around. Not all of the \"infidels\" on IIDB are atheists. If you can't even get Oolon's name right, you clearly haven't spent enough time there to know. In fact, everyone should just go to Oolon's page of God's Greatest Mistakes and see for themselves.", 
   {}, 
   287355, 
   null, 
   1192067580.0
  ], 
  [
   289216, 
   null, 
   "SLP", 
   "But.... but... WW wrote this! It MUST contain some sort of major insights!\n :p", 
   {}, 
   287448, 
   null, 
   1193609340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  As regards the poor old appendix", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10476-regards-poor-old-appendix.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10476, 
  "discussion_files": [
   [
    "29103.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10476-regards-poor-old-appendix-print.html"
   ]
  ], 
  "identifier": 10476
 }
]