[
 [
  [
   287691, 
   null, 
   "Matthew S", 
   "Here we go again. Republicans and their hypocisy they say that marriage should be defined by the legislature but when the legislature acts, for the second time, a republican stands in the way. http://www.365gay.com/Newscon07/10/101307veto.htm Schwarzenegger's claim is, now as it was when he vetoed this the first time, that the courts should rule. \n \n This only strengthens my claim that Republicans are evil, do not stand for justice and equality, hate gay people, and have declared war upon a segment of american citizens.\n \n It has been a Republican in every case: (Notice I say Republican, singular. I realise, before you attack me, that some republicans do support all the things on the list, some of the things on the list but in every case it was a Republican that introduced them and pushed for them)\n \n 1 Have either supported or created anti gay marriage amendments in every case where they have gone to the ballot.\n \n 2 Created DOMA\n \n 3 Created the federal marriage amendment.\n \n 4 Created laws against gay adoption\n \n 5 Oppose ENDA and other protections.\n \n 6 Oppose anti bullying efforts\n \n 7 Oppose hate crimes legislation against gays but support it against religion.", 
   {
    "post_info": {
     "post_title": "Schwarzenegger Again Vetoes Gay Marriage Bill"
    }
   }, 
   null, 
   null, 
   1192278060.0
  ], 
  [
   287694, 
   null, 
   "samiinh", 
   "You should read John Dean's new book, Broken Government, which is an excellent critique of republicans governing ability. They have none. It is all about ME. The republican philosophy is, I've got mine, screw you.", 
   {}, 
   287691, 
   null, 
   1192284000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Schwarzenegger Again Vetoes Gay Marriage Bill", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10498-schwarzenegger-again-vetoes-gay-marriage-bill.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10498, 
  "discussion_files": [
   [
    "1082.html", 
    "http://www.4forums.com/political/gay-rights-debates/10498-schwarzenegger-again-vetoes-gay-marriage-bill-print.html"
   ]
  ], 
  "identifier": 10498
 }
]