[
 [
  [
   287979, 
   null, 
   "daewoo", 
   "The treasury department today reported the end of the United States. \n \n http://www.treas.gov/press/releases/hp611.htm\n \n TIC data is the flow of money in and out of the country on a long term basis. We need over 60 billion dollars per month to flow into the US in order to finance our current account deficit. It has long been theorized that if we abused our currency enough and were stupid enough, foreigners would stop buying our paper, leaving us unable to fund our lifestyle or our government operations.\n \n August TIC data was bad. Very, very, very bad. Julys data was just very, very bad. In july, we did not get the 60 billion we needed. We only got 20 billion and foreigners were actually net sellers of treasuries. In August, not only did we not get the 60 billion we needed, those damn dirty foreigners actually cashed out 69.3 billion. \n \n Sadly it appears that the rest of the world is sending a message to the US:\n \n \"GET A JOB. Adults don't get an allowance\"\n \n Also shocking is the fact that Americans are abandoning US securities and buying up foreign securities at an unheard of rate (over 35 billion in a single month??? I double checked that to be sure it ws not a typo...its not).", 
   {
    "post_info": {
     "post_title": "Well, folks, it was fun while it lasted"
    }
   }, 
   null, 
   null, 
   1192560660.0
  ], 
  [
   287989, 
   null, 
   "jyoshu", 
   "The treasury department today reported the end of the United States. \n \n http://www.treas.gov/press/releases/hp611.htm\n \n TIC data is the flow of money in and out of the country on a long term basis. We need over 60 billion dollars per month to flow into the US in order to finance our current account deficit. It has long been theorized that if we abused our currency enough and were stupid enough, foreigners would stop buying our paper, leaving us unable to fund our lifestyle or our government operations.\n \n August TIC data was bad. Very, very, very bad. Julys data was just very, very bad. In july, we did not get the 60 billion we needed. We only got 20 billion and foreigners were actually net sellers of treasuries. In August, not only did we not get the 60 billion we needed, those damn dirty foreigners actually cashed out 69.3 billion. \n \n Sadly it appears that the rest of the world is sending a message to the US:\n \n \"GET A JOB. Adults don't get an allowance\"\n \n Also shocking is the fact that Americans are abandoning US securities and buying up foreign securities at an unheard of rate (over 35 billion in a single month??? I double checked that to be sure it ws not a typo...its not).\n\n \n The sad thing is that the current administration will probably try to spin this into good news somehow, and make it sound like our economy is growing. At least that's been the consistent approach so far.\n \n I agree, things are looking very bad.", 
   {}, 
   287979, 
   null, 
   1192571760.0
  ], 
  [
   288009, 
   null, 
   "daewoo", 
   "The sad thing is that the current administration will probably try to spin this into good news somehow, and make it sound like our economy is growing. At least that's been the consistent approach so far.\n \n I agree, things are looking very bad.\n\n \n The talking heads are already spinning this. Apparently the surrent theory we are all supposed to believe is that this due to risk aversion related to the sub prime fallout. Nobody has explained yet why sub prime related risk aversion would lead to dumping of treasury bonds, which are traditionally safe harbor investments. \n \n BAck in reality where the rest of us live, eat and breath, this months decline is actually just an extension that has been ongoing since the beginning of the year. It was likely accelerated due to the rate cut from the fed, which told the rest of the world \"we don't care if the dollar falls off the planet...our policy is growth above all\". \n \n When TICs came out last month, the talking heads assured us that the $40 billion shortfall was an abberation...the result of foreigners shifting from corporate paper to treasuries. Paulson said (paraphrasing here):\n \n \"The data indicates that this is the result of a shift in investment strategy by foreign purchasers who wish to increase holdings of US treasuries. I expect next months data to reflect that. Net treasury sales to foreign interests could be as high as $150 billion\".\n \n What a joke. \n \n I think that right now the powers that be are just counting on people being too stupid to understand what the heck they are talking about. Look at the jobs reports for the last couple of months. We saw a decrease in jobs one month, with a strong revision showing growth, plus new numbers showing growth, the next month. At the same time, unemplyment crept up. \n \n To anybody just glancing at the report, it shows growth. IF you actually READ the report, and have read past reports, you find that the number of jobs reported is not the only thing that has grown. Their margin of error has also grown. Typically margin of error on those has been somewhere around +/- 30,000. Last month it was +/- 129,000. \n \n HUH!?! They only reported 110,000 new jobs. So, we may also have LOST 19,000 jobs??? There have been rumors from the inside about possible \"methodology revisions\".\n \n We know for a fact that during most of the Clinton presidency, they just invnted a number. Every month...100,000 new jobs. People from the labor department have admitted that there was no research done, no data gathered, they just wrote down numbers. In fact, they used the same report for several months and pretty much shifted values between columns. I #### you not. \n \n I am usually pretty good at looking at spun numbers and figuring out what is really going on. I owe much of my financial sucess in life to that ability. I am clueless on that one. I look at it and know it cannot possibly be right, but at the same time there is nothing there at all that provides any indication of what IS right. They are apparently just making things up now.\n \n To be fair, this is a problem that goes back nearly 30 years. Bush and Co have certainly accelerated it, but neither side can point fingers.", 
   {}, 
   287989, 
   null, 
   1192585320.0
  ], 
  [
   288015, 
   null, 
   "marc9000", 
   "Look on the bright side - at least we don't have to worry about global warming anymore.", 
   {}, 
   287979, 
   null, 
   1192587060.0
  ], 
  [
   288018, 
   null, 
   "daewoo", 
   "Look on the bright side - at least we don't have to worry about global warming anymore.\n\n \n \n LOL. Then there is no bright side for me because I was not worried about global warming to begin with. I figured that rather it was real or not, and whether it was man made or not, we were not going to do anything about it, so I may as well ignore it :)", 
   {}, 
   288015, 
   null, 
   1192590000.0
  ], 
  [
   288029, 
   null, 
   "gamehuis", 
   "The treasury department today reported the end of the United States. \n \n http://www.treas.gov/press/releases/hp611.htm\n \n TIC data is the flow of money in and out of the country on a long term basis. We need over 60 billion dollars per month to flow into the US in order to finance our current account deficit. It has long been theorized that if we abused our currency enough and were stupid enough, foreigners would stop buying our paper, leaving us unable to fund our lifestyle or our government operations.\n \n August TIC data was bad. Very, very, very bad. Julys data was just very, very bad. In july, we did not get the 60 billion we needed. We only got 20 billion and foreigners were actually net sellers of treasuries. In August, not only did we not get the 60 billion we needed, those damn dirty foreigners actually cashed out 69.3 billion. \n \n Sadly it appears that the rest of the world is sending a message to the US:\n \n \"GET A JOB. Adults don't get an allowance\"\n \n Also shocking is the fact that Americans are abandoning US securities and buying up foreign securities at an unheard of rate (over 35 billion in a single month??? I double checked that to be sure it ws not a typo...its not).\n\n Wow, I can't believe I missed this one, because this is some seriously bad news for the US and by extension the rest of the world. \n A few more months of this and even the greatest spin doctors won't be able to hide the fact that the US has just maxed out its creditcard.\n \n I guess that the only way the US government can still keep the country running is to start printing the money to cover the shortfall.\n \"Helicopter Ben\" is probably working on that right now as we speak.\n \n The time has come for me to seriously consider buying gold bars and a shotgun.\n \n As for the job reports, the BLS never ceases to amaze me with the amount of BS that they publish. The endless revisions of bad numbers into good ones makes these reports nothing more than a bad joke. For example a while back they revised last months loss of 4.000 jobs into a 89.000 gain.\n Just like you I also noticed how nearly every month they say that another 100.000 jobs were created. It's like clockwork. \n And even if those numbers were true, it's still insufficient because the US needs to add 200.000 jobs each month just to keep up with the population growth.\n \n But I guess that in a society where most people believe anything, ANYTHING, that the government tells them, it's to be expected that government officials pull the most ludricous things out of their asses without fear of being caught.\n \n Now if you'll excuse me, I have to see a man about a gun.", 
   {}, 
   287979, 
   null, 
   1192620000.0
  ], 
  [
   288055, 
   null, 
   "daewoo", 
   "Wow, I can't believe I missed this one, because this is some seriously bad news for the US and by extension the rest of the world. \n A few more months of this and even the greatest spin doctors won't be able to hide the fact that the US has just maxed out its creditcard.\n\n \n The spin machine is already in full motion. We are assured that this is just an abberation, a result of the credit crunch. Nobody has explained why that is supposed to make us feel better, since if that is true it means that foreign investors class US treasury bonds right in there with junk rated corporate paper and sub prime mortgage notes. Does that make you feel any better? It does not make me feel any better. \n \n Total outflows were $163 billion if you include short term paper. The largest outflow EVER (until this) was 21 billion in 1990. \n \n \nThe time has come for me to seriously consider buying gold bars and a shotgun.\n\n \n Since you are in Amsterdam, a shotgun is probably sufficient. Here in the US we have a LOT of middle class types who seem to believe that a high standard of living is their divine right. When they figure out that is not the case, I think a lot of them are going to be ######. Something belt fed is probably more practical here. \n \n \nAs for the job reports, the BLS never ceases to amaze me with the amount of BS that they publish. The endless revisions of bad numbers into good ones makes these reports nothing more than a bad joke. For example a while back they revised last months loss of 4.000 jobs into a 89.000 gain.\n Just like you I also noticed how nearly every month they say that another 100.000 jobs were created. It's like clockwork. \n And even if those numbers were true, it's still insufficient because the US needs to add 200.000 jobs each month just to keep up with the population growth.\n \n But I guess that in a society where most people believe anything, ANYTHING, that the government tells them, it's to be expected that government officials pull the most ludricous things out of their asses without fear of being caught.\n\n \n And even when you disprove the numbers...even when you point out that the agencies producing them say they are false....people continue to believe the numbers and cite them as an example of how well we are doing. The capacity for self delusion there is nothing short of incredible.", 
   {}, 
   288029, 
   null, 
   1192633440.0
  ], 
  [
   288070, 
   null, 
   "jitobear", 
   "Daewoo - \n \n I have nearly no understanding of economics. \n \n I am honestly curious - what are your predictions?\n \n What can middle America expect in wages? Jobs? Stanbdard of living?\n \n Who will be hit hardest?\n \n What can a person like me expect? Small house in the inner city, ten years at a job in the financial services industry (technologies) that I am good at. Own an old used car out-right.\n \n What/how/if will be the correcting - or at least evening out factors for the nation?", 
   {}, 
   288055, 
   null, 
   1192638600.0
  ], 
  [
   288114, 
   null, 
   "Steeeeve", 
   "I had an interview with the GAO today and yet again we got to talking about the way you report numbers to say what you want. For example we really don't have the highest taxes for corporations and the death tax really doesn't help you out if you get rid of it. \n \n The death tax is the greatest example because if you get something from a dead relative...say object X worth $1,000,000 with a basis of $30,000...and you have no \"death tax\" then you have no step up basis for that object. So when you sell object X you really pay taxes on the $970,000 gain. Congrats..you aren't saving as much as you thought. With the death tax you pay the taxes on its worth at that time (minus basis) and then that becomes your new basis for the asset. Of course with the tax you also only pay for portions over a certain dollar amount. \n \n In any event this is unrelated to this thread...I just thought it was interesting to add because its another example of numbers being played with.", 
   {}, 
   288070, 
   null, 
   1192669860.0
  ], 
  [
   288130, 
   null, 
   "obvious_child", 
   "\n The death tax is the greatest example because if you get something from a dead relative...say object X worth $1,000,000 with a basis of $30,000...and you have no \"death tax\" then you have no step up basis for that object. So when you sell object X you really pay taxes on the $970,000 gain. Congrats..you aren't saving as much as you thought. With the death tax you pay the taxes on its worth at that time (minus basis) and then that becomes your new basis for the asset. Of course with the tax you also only pay for portions over a certain dollar amount.\n\n \n Thus people who inherent an amount less then the credit would get screwed. Without the estate tax credit, the entire amount, in this case the 970,000 would get taxed at federal income rates instead of at no rate at all. Wow. Sucks to be lower upper class....\n \n Correct me here, but the rich only want to get rid of the estate tax because it is projected to exceed federal income rates right? If the estate tax was less then the highest income, wouldn't the rich want to keep it around?\n \n Furthermore, don't these people have accountants and planners to ensure they don't get taxed anyways?", 
   {}, 
   288114, 
   null, 
   1192685340.0
  ], 
  [
   288136, 
   null, 
   "Steeeeve", 
   "Thus people who inherent an amount less then the credit would get screwed. Without the estate tax credit, the entire amount, in this case the 970,000 would get taxed at federal income rates instead of at no rate at all. Wow. Sucks to be lower upper class....\n Well it kinda screws over everyone. Section 1014 of the tax code states that currently when you inherit some property you get a basis of the fair market value at the time of death. Now if you sell it in 10yrs the property value probably went up and you pretty much pay the tax on the capital gains for those 10 years. With the estate tax removed in 2010 they do away with step-up basis and you get stuck with the basis the guy who owned the property had. Now when you sell it you get an insane tax bill. \n \n I'm not positive on this but if they don't extend the \"no death tax\" thing then in 2011 it comes back but minus the step-up basis. That would make it even worse.... Chances are they would add it back though. \n \n \nCorrect me here, but the rich only want to get rid of the estate tax because it is projected to exceed federal income rates right? If the estate tax was less then the highest income, wouldn't the rich want to keep it around?\nWell it converts to a capital gains tax most likely thus avoiding the 40-50% tax rate. The rich or newly rich would save a lot. \n \n However, if you have a large estate and want to give it to your loved ones, I suggest you die in 2010....unless you really don't like them...then die in 2011.\n \n \nFurthermore, don't these people have accountants and planners to ensure they don't get taxed anyways?\nNot really. A lot of the people might not even be rich. Some could own a farm with land that is easily worth over 1 million or 2 million.\n \n In some ways the death tax is good but in others it is bad. For the person that just got land (say a farmer) how are they going to pay a tax if they haven't sold it or don't wish to sell it as in the case of a farmer and his son who wishes to farm (farmers do get special treatment actually)? \n \n In any event...they could change it up but they should change up the gift tax too.", 
   {}, 
   288130, 
   null, 
   1192689660.0
  ], 
  [
   288162, 
   null, 
   "obvious_child", 
   "Well capital gains tax has been unusually low. If that increases back to where it use to be or parity with the highest federal income rate, what's the point?\n \n Kick the can in 2010!\n \n But if that farmer got a 2 million piece of land and had to pay taxes on it, and assuming that the person who kicked the can had a huge amount of bequeathing, how would they assign the tax liability to their beneficiaries of the assets? Would it just be proportional based on amount of the total taxable assets?", 
   {}, 
   288136, 
   null, 
   1192731540.0
  ], 
  [
   288171, 
   null, 
   "Steeeeve", 
   "But if that farmer got a 2 million piece of land and had to pay taxes on it, and assuming that the person who kicked the can had a huge amount of bequeathing, how would they assign the tax liability to their beneficiaries of the assets? Would it just be proportional based on amount of the total taxable assets?\nI'm not sure what you are asking here and when. \n \n The problem I have with the estate tax is that you pay taxes on income you have realized yet. Like the farmer who inherits a 2 million piece of land, he has to pay an estate tax (well, assuming we go back to the estate tax prior to 2001) when he might not have the money to do so because the land is not sold. It reminds me of the famous realization tax case back in the early 1900s called Eisner vs. Macomber.", 
   {}, 
   288162, 
   null, 
   1192743180.0
  ], 
  [
   288181, 
   null, 
   "daewoo", 
   "Daewoo - \n \n I have nearly no understanding of economics. \n \n I am honestly curious - what are your predictions?\n \n What can middle America expect in wages? Jobs? Stanbdard of living?\n \n Who will be hit hardest?\n \n What can a person like me expect? Small house in the inner city, ten years at a job in the financial services industry (technologies) that I am good at. Own an old used car out-right.\n \n What/how/if will be the correcting - or at least evening out factors for the nation?\n\n \n Keep in mind that this is just conjecture becuase we are basically moving forward without precedent. No economy this large has ever had fundamentals that were this poor. The status of our currency as a reserve currency, and the fact that oil is traded in dollar, has allowed us to do some pretty stupid things and put the consequences off. In economics it is safe to say that all things eventually return to fundamentals. You can put as much lipstick as you want on a pig, but it is still a pig.\n \n What it boils down to is that this is BAD, VERY, VERY BAD for the middle and lower classes. \n \n Who will be hit hardest depends on criteria. The poor will end up with less...a lot less....but the middle class will loose the most. Already the middle class is shrinking at an incredible rate. In fact, the middle class has been shrinking so fast that they have changed the definition of \"middle class\". Now if you live above the poverty level, you are middle class. they have also started including things like \"imputed rent\" in income calculations.\n \n The middle class has become reliant on debt to stay middle class, and that is starting to have some serious ramifications. As much as I dislike hillary Clinton, her claim that we have a \"trap door\" economy in the US is dead on. More and more people are going to start falling through the trap door. \n \n For the middle class, the future holds increased unemployment, decreased purchasing power, probably lower wages (depending on how high inflation runs), and for many, reduction to poverty. \n \n In your case, assuming you did not leave out some important information like \"And $75,000 in credit card debt\", you may be in pretty good shape, or really bad shape, depending on exactly what your job is, who you work for, and how critical your position is.\n \n The financial sector has shed over 150,000 jobs this year and that is expected to continue. Recently several investment banks put up $100 billion to create a fund with the sole intention of putting a floor under traded securities. It is being billed as a \"subprime superfund\". What does that mean, though?\n \n That means that things are so bad that Americas leading banks have put up a huge amount of capital in order to fund the biggest price fixing scheme in the history of the planet earth. Not only that, things are so bad that the SEC and the treasury department have not only failed to prohibit this massive price fixing scheme, they have helped orchestrate it. The sad thing is that there is no possible way that this can solve the problem.\n \n In your situation, depending on how secure your job is, you probably want to make sure you have some money in the bank...at least enough to get by for a couple of months if you have to find a new job (assuming there are new jobs out there to find).\n \n The sad thing about this mess is that there really is nothing the middle or lower class can to do protect themselves. This correction is going to take most of them by surprise, cut them incredibly deeply, and there is nothing they can do to stop it. Just try to keep some money in the bank. That really is about all you can do.\n \n Things will basically continue to get worse until we return to fundamentals....until we are once again competitive in the world market. The problem there is that we have worked for years to keep wages in other countries low, sold off most of our industrial infrastructure, and basically put ourselves in a situation where in order to compete with china, or india, or Brazil, we have to pay our people like they are chinese, or indian, or brazillian. We import the majority of our manufactured raw materials, so a lower dollar does not help us when it comes to exports. The only thing we have to level the playing field is wages. \n \n This may all be academic because it is possible, and maybe even likely, that we have put ourselves in a situation where we cannot survive as a nation. We have actually been so stupid that we have put ourselves in a position where our government simply cannot function without a massive influx of borrowed money each month, and it would appear that the well there is about dry. \n \n I am assuming that last months TICs numbers will improve. If they don't our government will be insolvent by May. If we assume that Lasts month numbers are more indicitive of the pattern we can expect, then we have until august before we reach the point that the government can no longer pay its employees, honor social commitments (like food stamps, SS payments, etc...) or pay for its goods (no more bombs for Iraq).", 
   {}, 
   288070, 
   null, 
   1192744680.0
  ], 
  [
   288183, 
   null, 
   "Steeeeve", 
   "Daewoo,\n \n I don't think this will be limited to a US type correction as your post implies. Americans go into debt to buy things that could very well be produced in another country. When we don't buy anymore they don't sell them. That gets into more of a global recession. \n \n It seems that the problem is our standard of living is well beyond what is reasonable and a correction that takes place will solve these issues. \n \n It's almost like a wound that is infected....it doesn't bleed anymore but in order to get rid of the infection you have to cut it open and bleed again...and it hurts.", 
   {}, 
   288181, 
   null, 
   1192745640.0
  ], 
  [
   288185, 
   null, 
   "jitobear", 
   "Daewoo - \n \n Thanks. Sounds like it will be a hoot. I guess I can count myself lucky that I don't have or care to have a lot of stuff.\n \n Outside of a mortgage and student loans I have practically no debt and I am working to pay down what I have.\n \n I am good at what I do - but am not so squeamish that I woulddn't do something cruddier if need be. I also feel I could live on half of what I make now (hell I have lived on less) - it just won't be as fun.\n \n I will bear in mind your advice on saving and rely on my resiliency. Doesn't sound like there is much else I can do.\n \n By the way - how will this impact the upper class? I know that less you got the more it hurts to lose but I can't imagine that the wealthy will be completely immune.", 
   {}, 
   288181, 
   null, 
   1192746060.0
  ], 
  [
   288189, 
   null, 
   "jim's trucking", 
   "If y'all think this is bad, just wait 'til our money has Hillary's picture on it.", 
   {}, 
   288183, 
   null, 
   1192746660.0
  ], 
  [
   288191, 
   null, 
   "jitobear", 
   "If y'all think this is bad, just wait 'til our money has Hillary's picture on it.\n\n \n You are really starting to come accross a little bit loony there, Jim. She's just another bloody politician. Its not like any of them are saints.", 
   {}, 
   288189, 
   null, 
   1192747920.0
  ], 
  [
   288193, 
   null, 
   "Steeeeve", 
   "Daewoo - \n \n Thanks. Sounds like it will be a hoot. I guess I can count myself lucky that I don't have or care to have a lot of stuff.\n \n Outside of a mortgage and student loans I have practically no debt and I am working to pay down what I have.\n \n I am good at what I do - but am not so squeamish that I woulddn't do something cruddier if need be. I also feel I could live on half of what I make now (hell I have lived on less) - it just won't be as fun.\n \n I will bear in mind your advice on saving and rely on my resiliency. Doesn't sound like there is much else I can do.\n \n By the way - how will this impact the upper class? I know that less you got the more it hurts to lose but I can't imagine that the wealthy will be completely immune.\n\n You'd be better off if you could pay down the student loan as much as possible and save up some money. \n \n The biggest worry is for those living outside their means...mainly those in McMansions or similar. \n \n So perhaps that 38\" LCD is out of the question for a while :)", 
   {}, 
   288185, 
   null, 
   1192748640.0
  ], 
  [
   288202, 
   null, 
   "daewoo", 
   "Daewoo,\n \n I don't think this will be limited to a US type correction as your post implies. Americans go into debt to buy things that could very well be produced in another country. When we don't buy anymore they don't sell them. That gets into more of a global recession. \n \n It seems that the problem is our standard of living is well beyond what is reasonable and a correction that takes place will solve these issues. \n \n It's almost like a wound that is infected....it doesn't bleed anymore but in order to get rid of the infection you have to cut it open and bleed again...and it hurts.\n\n \n It will certainly be a global problem. We will fall the furthest because we have the furthest to fall. \n \n The chinese will be the only real winners. They have done a good job of positioning themselves as the worlds low cost manufacturer of choice. The worse other nations do financially, the better the chinese do because people in a nation that are having economic problems turn to chinese produced goods (junk) as a cost savings measure. \n \n The trick is going to be stopping the slide, at least as far as the US goes. There are really no fundamentals that would seem to support there being any result that does not end in the US being the worlds largest third world nation. In theory eventually our labor would become cheap enough that we would once again be able to compete, but we lack the industrial base and resource base to do it, and coming up with the investment capital to expand during such a decline is going to be difficult.\n \n We will eventually bottom out and start clawing our way back up, but frankly I probably won't live long enough to see the recovery begin, and my kids probably won't live long enough to see the US regain its position as the top economic power on the planet...and that is assuming the US survives as a cohesive state.", 
   {}, 
   288183, 
   null, 
   1192755060.0
  ], 
  [
   288204, 
   null, 
   "Steeeeve", 
   "I'm a little more confident that we won't be third world. This scenario reminds me a little of the roaring 20's but on a larger scale (since we developed ways to push off the downtimes). We will crash and hopefully rebound naturally...I think we have enough wealth in this country to avoid a complete hell hole.\n \n But as you stated, this is uncharted waters so who knows. :p", 
   {}, 
   288202, 
   null, 
   1192756380.0
  ], 
  [
   288206, 
   null, 
   "daewoo", 
   "Daewoo - \n \n Thanks. Sounds like it will be a hoot. I guess I can count myself lucky that I don't have or care to have a lot of stuff.\n \n Outside of a mortgage and student loans I have practically no debt and I am working to pay down what I have.\n \n I am good at what I do - but am not so squeamish that I woulddn't do something cruddier if need be. I also feel I could live on half of what I make now (hell I have lived on less) - it just won't be as fun.\n \n I will bear in mind your advice on saving and rely on my resiliency. Doesn't sound like there is much else I can do.\n \n By the way - how will this impact the upper class? I know that less you got the more it hurts to lose but I can't imagine that the wealthy will be completely immune.\n\n \n There is not a whole lot anybody int he middle or lower class can do. If you have substantial savings and a good understanding of finance there are steps you can take to protect what you do have from inflation, like buying foreign bonds, opening foreign CDs (or equivalent), or buying foreign stocks. That is kind of dangerous if you don't have a good handle on things, though, so before you do something like that you might want to get with a good broker or financial adviser to help you. I don't recall what part of the country you are in, but if you don't mind sharing that I might know somebody good in your area who could help. Alternatively if your bank offers investment services (most major ones do) they probably have somebody you can talk to for little or no money. Then again, you might be able to just track somebody down at work and say \"How do I.....\"\n \n Make sure you consider tax implications since you can loose quite a bite to taxes. That is why I like canadian banking stocks. Many of them are cross listed (listed on US and Canadian exchanges) and you can get away without paying foreign investment taxes. For that matter, if you want to invest through a bank (CD like) candian banks are a good option because many have US branches where you can withdraw your money...even if it was invested in loonies, and avoid the tax man. On edit.....Don't tell Steeeve.....he would be legally obligated to rat you out.\n \n You might try to pay the student loans down if you can afford to do it and still put some money in savings. \n \n The effect on the upper class depends on who you refer to as upper class. People who just have a few million dollars will still have problems. They will be the new middle class. Typically people with tens of millions, or hundreds of millions, of dollars have a good understanding of economics and know how to not only preserve what they have, but profit from virtually any circumstance. You just don't get that kind of money without picking up the basics along the way. \n \n Look at the depression and WWII. The holdings of the top 10% of Americans shot through the roof, while the holdings of the lower 90% dropped like a rock. Things will be the same this time. The wealthy are seldom caught by surprise (there are very few surprises in economics), though they always act shocked and pretend it is just a coincidence that they happened to be perfectly positioned for the situation. \n \n Usually one or two prominent folks break ranks and try to warn others what is going on. Usually (at least lately) is is Warren Buffett. He is old, and he figures he has enough, so he tries to ruin everybody elses fun. Volker and Soros are other good examples. They have been screaming warnings at the top of their lungs for a couple years now and everybody just ignores them.", 
   {}, 
   288185, 
   null, 
   1192756740.0
  ], 
  [
   288207, 
   null, 
   "daewoo", 
   "I'm a little more confident that we won't be third world. This scenario reminds me a little of the roaring 20's but on a larger scale (since we developed ways to push off the downtimes). We will crash and hopefully rebound naturally...I think we have enough wealth in this country to avoid a complete hell hole.\n \n But as you stated, this is uncharted waters so who knows. :p\n\n \n I am sitting the fence. The problem with \"enough wealth\" in country is that that wealth is pretty much all dollar wealth, and the dollar is swirling down the toilet. Also, a lot of that wealth is tied up in things like real estate and equities, which have a nasty tendancy of dropping like a rock when things go south. \n \n A lot of what happens is going to depend on market psychology both here and abroad and that is a difficult thing to estimate.\n \n I will say it was a REALLY bad time to give the Dali lama a medal and tick off our biggest creditor.", 
   {}, 
   288204, 
   null, 
   1192757100.0
  ], 
  [
   288218, 
   null, 
   "Steeeeve", 
   "I am sitting the fence. The problem with \"enough wealth\" in country is that that wealth is pretty much all dollar wealth, and the dollar is swirling down the toilet. Also, a lot of that wealth is tied up in things like real estate and equities, which have a nasty tendancy of dropping like a rock when things go south. \n \n A lot of what happens is going to depend on market psychology both here and abroad and that is a difficult thing to estimate.\n \n I will say it was a REALLY bad time to give the Dali lama a medal and tick off our biggest creditor.\n\n \n Again, my job security is looking pretty good so I can't worry too much :) I also know international standards of accounting so their is always the EU haha.", 
   {}, 
   288207, 
   null, 
   1192767660.0
  ], 
  [
   288286, 
   null, 
   "Steeeeve", 
   "I think it's important to note that what Daewoo posted isn't the reason we are in trouble but merely a reaction to the real reasons. It only provides evidence that yes, we are in fact in trouble.\n \n the real issue comes back to spending more than you have.", 
   {}, 
   288218, 
   null, 
   1192813560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Well, folks, it was fun while it lasted", 
  "url": "http://www.4forums.com/political/economics-debates/10508-well-folks-fun-while-lasted.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 10508, 
  "discussion_files": [
   [
    "21078.html", 
    "http://www.4forums.com/political/economics-debates/10508-well-folks-fun-while-lasted-print.html"
   ], 
   [
    "21079.html", 
    "http://www.4forums.com/political/economics-debates/10508-well-folks-fun-while-lasted-2-print.html"
   ]
  ], 
  "identifier": 10508
 }
]