[
 [
  [
   288174, 
   null, 
   "spicylemonade", 
   "I mean specifically the practice of companies locating their customer support/phone service departments overseas. I've been thinking about this a lot after seeing the movie Outsourced which, though a romantic comedy and not a documentary, made me think about outsourcing in a specific way, I didn't realize before that that English is the official language of the Indian government, and that the very reason we outsource customer service and order fulfillment jobs there is that there is already a large labor force with decent English speaking skills.", 
   {
    "post_info": {
     "post_title": "How do you feel about outsourcing?"
    }
   }, 
   null, 
   null, 
   1192743480.0
  ], 
  [
   288177, 
   null, 
   "jim's trucking", 
   "I mean specifically the practice of companies locating their customer support/phone service departments overseas. I've been thinking about this a lot after seeing the movie Outsourced which, though a romantic comedy and not a documentary, made me think about outsourcing in a specific way, I didn't realize before that that English is the official language of the Indian government, and that the very reason we outsource customer service and order fulfillment jobs there is that there is already a large labor force with decent English speaking skills.\nIn a free market global society, outsourcing is to be expected. The laws of supply and demand apply to labor also. That's why illegal aliens get jobs in the the US. They'll work for peanuts. Even though that's not exactly outsourcing, the net effect is to take a job away from a citizen and give it to a foreigner who will work for less. Outsourcing is legal. Illegal aliens are not.", 
   {}, 
   288174, 
   null, 
   1192744260.0
  ], 
  [
   288608, 
   null, 
   "RudyRocker", 
   "The empirical studies show time and again, that the net effect is a transfer of wealth from workers to owners, and from the third world to the west. Hooray for the glorious market.", 
   {}, 
   288177, 
   null, 
   1193085300.0
  ], 
  [
   288981, 
   null, 
   "spicylemonade", 
   "I've always wavered on my staunch libertarian idea that outsourcing is perfectly fine when it comes to food - that when there's a biological imperative the demands of the market must bow (I'm a nutrition educator and everything I eat is produced/grown locally). Though.... that brings up a point I've learned more from my Japanese friends living in the US... there are some staples of Japanese cuisine that just aren't produced locally. So, where do we draw the line between nature and culture? Give up the foods and adapt to locally fed diets, losing that aspect of culture? Assimilate? Or compromise, and buy everything locally, but order abroad for the natto? I read in the Hollywood Reporter that they are making a TV show out of Outsourced - I hope they have each episode deal with a cultural issue like this.", 
   {}, 
   288174, 
   null, 
   1193342340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How do you feel about outsourcing?", 
  "url": "http://www.4forums.com/political/economics-debates/10515-how-do-you-feel-about-outsourcing.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 10515, 
  "discussion_files": [
   [
    "21069.html", 
    "http://www.4forums.com/political/economics-debates/10515-how-do-you-feel-about-outsourcing-print.html"
   ]
  ], 
  "identifier": 10515
 }
]