[
 [
  [
   288201, 
   null, 
   "DrD", 
   "I addressed US Senator John McCain's incorrect claim that the United States was founded as a Christian nation. I mentioned that a staggering 55 percent of Americans wrongly believe that the US Constitution establishes the US as a Christian nation. After seeing the orignal survey , I sadly realized it gets much worse! \n \n According to the survey, http://www.firstamendmentcenter.org/news.aspx?id=19031, commissioned by the First Amendment Center, 65 percent of Americans believe that the nation's founders intended the US to be a Christian nation, only 56 percent believe that freedom to worship extends to all religions, 58 percent believe teachers should be allowed to lead prayers in public schools and 50 percent believe the Bible should be taught as a factual text in public schools!\n \n This collective ignorance of American history and the US Constitution goes hand-in-hand with the mass ignorance of Deism. Only a small percentage of people know what Deism is. When we consider that many of America's key founders, such as Jefferson, Paine, Washington, Franklin, etc., were Deists, and yet not many Americans have ever heard of Deism, the results of the survey are not surprising.", 
   {
    "post_info": {
     "post_title": "John McCain Is Not Alone in His Ignorance of American History"
    }
   }, 
   null, 
   null, 
   1192755060.0
  ], 
  [
   288227, 
   null, 
   "Jo Bennett", 
   "Some of the questions there are misleading though. The question about the extent of freedom of religion has the caveat \"no matter how extreme\", which could be read as allowing human sacrifice, for example. Or female circumcision.", 
   {}, 
   288201, 
   null, 
   1192775820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  John McCain Is Not Alone in His Ignorance of American History", 
  "url": "http://www.4forums.com/political/religion-debates/10519-john-mccain-not-alone-his-ignorance-american-history.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10519, 
  "discussion_files": [
   [
    "26378.html", 
    "http://www.4forums.com/political/religion-debates/10519-john-mccain-not-alone-his-ignorance-american-history-print.html"
   ]
  ], 
  "identifier": 10519
 }
]