[
 [
  [
   288151, 
   null, 
   "DrD", 
   "Children need care and guidance over an extended period of time before they can achieve a reasonable degree of maturity and independence. An integral part of this development means guaranteeing them a sound education, a strong emotional support system and good health. Over 100 years ago our nation implemented a public school system that was designed to deliver a standardized education to each child. At the time, it was correctly thought that an educated citizenry was more apt to appreciate and nurture the nation's democratic principles. The emotional support system that our children needed was presumably given by involved parents, grandparents, religious leaders, friends and mentors. The guarantee of universal health care for kids, however, has been more problematic. With health care costs spiraling and often incompletely covered by a confusing mix of sources ranging from employers, employees, the government and insurance companies, it is no surprise that not everyone receives full health care coverage. The result is scandalous for a developed nation that purports to be a model of sophistication and modernity. We now have 15 percent of our population that are uninsured and another 35 percent who remain underinsured. Many of these are children.\n \n George Bush recently vetoed an expansion of the State Children's Health Insurance Program. A popular bipartisan initiative, SCHIP was originally designed as yet another way to plug up health insurance gaps for children who are not wealthy enough to enjoy self-paid health insurance yet too wealthy to qualify for Medicaid. These low- to middle-income kids often fall between the cracks with their families having to pay increasingly higher doctor's bills. This recent initiative would have added four million new children to the eligibility list. The extra costs needed ($35 billion over five years) would be worked into the national budget with some money coming in from increased tobacco taxes.\n \n The veto was a missed opportunity to do the right thing. It could have lent some moral authority (not to mention one positive legacy) to an administration that threatens to find itself soon relegated to the ash heap of history as one of the worst on record. The justification for vetoing the expansion of SCHIP has run the gamut of the same tired reasons. They included the need for fiscal restraint, a fear of \"socialized medicine,\" the reluctance to tax smokers and giving \"health care handouts\" to too many kids above the poverty line. Unmentioned was the fact that insurance and tobacco companies (large contributors to all campaigns) were going to be negatively impacted by the legislation. \n \n The president's claim that this program was too expensive rings hollow in the face of the massive deficit spending resulting from a war in Iraq - now in its fifth year and costing between $6 billion and $9 billion each month to prosecute, according to the Congressional Budget Office. It is profoundly hypocritical to have government employees, who enjoy federally controlled health care, deny the same to their constituents on the grounds that it will lead us down a slippery socialist slope. Finally, claiming that SCHIP's expansion will benefit too many \"wealthy\" kids neglects the fact that many of those kids belong to the long beleaguered middle class whose families find it increasingly difficult to carry on the American dream in light of skyrocketing medical bills through no fault of theirs.\n \n We have a health care crisis in our nation that our leaders are too incompetent, craven or insensitive to resolve. The expansion of the SCHIP program promised to put a dent in the crisis until a permanent solution could be crafted. Instead of being an advocate for our nation's children, President Bush chose to placate his contributors and ideological base.", 
   {
    "post_info": {
     "post_title": "Cost of insuring middle-income children's health pales next to war"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1192718760.0
  ], 
  [
   288195, 
   null, 
   "E Mutz", 
   "The president's claim that this program was too expensive rings hollow in the face of the massive deficit spending resulting from a war in Iraq - now in its fifth year and costing between $6 billion and $9 billion each month to prosecute, according to the Congressional Budget Office. It is profoundly hypocritical to have government employees, who enjoy federally controlled health care, deny the same to their constituents on the grounds that it will lead us down a slippery socialist slope. \n \n Non sequitor. Spending on one program does not justify spending on another. Hopefully you do not elect to max out your credit card because you are already paying thousands to a mortgage company. You could just as easily justify the war spending by pointing to the massive cost of welfare (367 Billion according to the 2007 budget.) Poor logic.\n \n There are actually plenty of reasons to oppose this bill. The first big Duh is that it covers \"children\" up to the age of 25. The second big Duh is that you cannot pay for the program on the backs of tobacco users. Want another Duh? How 'bout the $83,000 income ceiling. Call me particular, but when you invoke poor children to gain support for a bill I sort of expect the bill to cover people who are poor and children. Go figure. \n \n Here's a little background for ye on SCHIP. It was initially enacted by the Republican Congress in 1997. By definition, SCHIP was focused on those children whose parents couldn't afford to purchase insurance individually and whose employers did not provide a family health insurance benefit.\n \n HOWEVER... Instead of re-authorizing SCHIP with a funding increase to include those children eligible under the original criteria, the Democratic majority in Congress proposed a broad expansion of SCHIP to include hundreds of thousands of adults as well as upper-income children already covered under private insurance. The price tag is more than double the current program-$35 billion for the expansion alone. In some states, families earning up to $83,000 a year would be eligible for this \"low-income program.\"\n \n Trent Lott offers the following observations:\n \n \n \n How do Democrats plan to pay for this massive funding increase? By raising your taxes, of course, starting with a 61-cent-a-pack tobacco tax. Some contend that when you increase tobacco taxes, tobacco use drops. Common sense, often missing from Washington debates, says we can't have it both ways. If we tax people out of smoking, then we're taxing children off SCHIP. \n \n According to the non-partisan Congressional Budget Office, a tobacco tax is \"the most regressive\" and will hit the poor and working class harder than most, the very people whose children SCHIP was intended to help. \n \n Then there's the slight of hand: CBO says Democrats hide about $40 billion in unpaid costs in their expansion through budget gimmicks. After five years, Congress will be forced to raise taxes further or drop millions of children off the SCHIP rolls in 2013. \n \n The problems aren't just limited to funding issues. This massive increase voids a sound rule requiring states to enroll 95% of eligible children in SCHIP before allowing adults on the program. \n \n Identification regulations are also relaxed for legal and illegal immigrants to sign up for SCHIP. \n \n SCHIP and Medicaid combined already cover the same number of Americans living at or below 200% of poverty. The problem isn't that SCHIP needs to reach more people. It needs to reach the right people. \n \n The Republican alternative to the SCHIP reauthorization was simple and focused on children who otherwise would have no health insurance. Our alternative was an $8 billion a year, or 33%, increase in the current program. A 33% increase in a program as large as SCHIP is hardly anti-kid. \n \n Our alternative would have prevented \"crowd-out,\" where families drop their pre-existing, private insurance policies to sign up for an entitlement. Every dollar going to cover a middle-income adult is a dollar taken away from the very child SCHIP was intended to help.\n \n To this, Democrats accuse Republicans of refusing to help children. That's the height of political demagogy. ", 
   {
    "unicode_changes_made": true
   }, 
   288151, 
   null, 
   1192750140.0
  ], 
  [
   288197, 
   null, 
   "Matthew S", 
   "I agree the Shrub has lost it once again. He supports wasting almost 1 trillion dollars killing people but opposes spending less then 5% of that money to help save children. What happened to his culture of life? I guess in his culture of life people get bombed and children die of preventable diseases.", 
   {}, 
   288195, 
   null, 
   1192752900.0
  ], 
  [
   288200, 
   null, 
   "DrD", 
   "Spending on one program does not justify spending on another. Hopefully you do not elect to max out your credit card because you are already paying thousands to a mortgage company. You could just as easily justify the war spending by pointing to the massive cost of welfare (367 Billion according to the 2007 budget.) Poor logic.\nI'm not quite clear on the rest of your points so I will address this one. The \"poor logic\" is not mine. Your example does not quite lend itself to the principle I mentioned. It is more logical to assume that if we should choose to spend government money on the people who contributed to it, including those who already receive \"government welfare\", i.e. employees, armed services, et al. it would be reasonable. \n \n Where is the logic or value in literally wasting that kind of OUR money attempting to prosecute a war without end? Where is OBL . . . . the one responsible for 9-11? After this amount of time and money Iraq is a fiscal dump! To continue this war rather than taking care of our own is wasteful, irresponsible and frankly stupid. \".....now in its fifth year and costing between $6 billion and $9 billion each month to prosecute, according to the Congressional Budget Office is beyond reason.\" (First thing you know this could add up to be real money.) $4,000 a second. As Dr. Phil asks, \"What are you thinking?\" \n \n I guess it's all in where you place value on your fellow countrymen. Mine are different from yours.", 
   {}, 
   288195, 
   null, 
   1192754160.0
  ], 
  [
   288219, 
   null, 
   "E Mutz", 
   "I'm not quite clear on the rest of your points so I will address this one. The \"poor logic\" is not mine. Your example does not quite lend itself to the principle I mentioned. It is more logical to assume that if we should choose to spend government money on the people who contributed to it, including those who already receive \"government welfare\", i.e. employees, armed services, et al. it would be reasonable. \n \n Where is the logic or value in literally wasting that kind of OUR money attempting to prosecute a war without end? Where is OBL . . . . the one responsible for 9-11? After this amount of time and money Iraq is a fiscal dump! To continue this war rather than taking care of our own is wasteful, irresponsible and frankly stupid. \".....now in its fifth year and costing between $6 billion and $9 billion each month to prosecute, according to the Congressional Budget Office is beyond reason.\" (First thing you know this could add up to be real money.) $4,000 a second. As Dr. Phil asks, \"What are you thinking?\" \n \n I guess it's all in where you place value on your fellow countrymen. Mine are different from yours.\n\n \n It would appear that your values also include plagiarism because your post is a word for word copy of a column which ran in the Staunton, VA News Leader. \n \n http://www.newsleader.com/apps/pbcs.dll/article?AID=/20071018/OPINION02/710180303/1014/OPINION\n \n I am delighted that our values differ so markedly. I wonder though: You had no comment on the fact that the bill covers families making up to $83,000 dollars, and no problem with the fact that the bill considers 25 year old adults to be children. You were unclear on the questions concerning access by illegal aliens and had no response to the question of funding. All you offered was a non-sequitor concerning the War. So basically, your chief reason for supporting this bill is that since we are already wasting money in Iraq, why not waste some here??? \n \n I really can't make this any clearer. The cost/success/progress of the War is completely and utterly irrelevant to why this bill should or should not be approved. \n \n So lets try this again shall we? Come out from behind your Cost-Of-War-Smokescreen and justify this bill. Explain why 25 year olds should be considered children. Explain how a family making $83,000/year cannot afford health care. Explain how a regressive tobacco tax will be sufficient to pay the insurance costs of these twenty-something toddlers. \n \n I will check tomorrow's News Leader for your response.", 
   {}, 
   288200, 
   null, 
   1192768500.0
  ], 
  [
   288225, 
   null, 
   "DrD", 
   "Well first of all, how do you know the Leader article isn't mine? \n \n My points are clear and there is no reason to continue to discuss this point with you. It is quite clear that you are adamant in support of this conflict and wish to quibble about maximum funds and ages of recpients. It would be advantageous if you would read the bill rather than relying on conservative talking points amplified by the president and misquoted as well. I'm surprised you haven't taken the time to do this since you apparently did an exhaustive search on the originality of my post which clearly demonstrates the thrust of your response.\nI really can't make this any clearer.\n Please don't. This may be difficult for you to believe but I didn't post this particularly for you. If you don't agree, fine. But to define an opinion with adjectives you have chosen to use is not in the interest of debate.\nThe cost/success/progress of the War is completely and utterly irrelevant to why this bill should or should not be approved. \nOkay.\nSo lets try this again shall we?\n No! \nCome out from behind your Cost-Of-War-Smokescreen and justify this bill. Explain why 25 year olds should be considered children. Explain how a family making $83,000/year cannot afford health care. Explain how a regressive tobacco tax will be sufficient to pay the insurance costs of these twenty-something toddlers. \nYou refer to this post as a \"smokescreen\". To me, it's an opinion. Too bad your opinion doesn't happen to be the same as mine. But then, following your terse response, I'm not surprised. Your response appears to be bent on being right rather than considering other perspectives. It's a sad comment when someone is so intolerate of someone else's opinion that they feel a need to attack. But I am aware of how the \"uniter\" has brought us together.\n \nI will check tomorrow's News Leader for your response.\nPlease do. Virginia is a red state if this helps. But the Leader is a blue paper.\n PS\n Just a clue. . . . .It might be good for you to read the title next time. . . .Cost of insuring middle-income children's health pales next to war ", 
   {}, 
   288219, 
   null, 
   1192774920.0
  ], 
  [
   288237, 
   null, 
   "samiinh", 
   "Well first of all, how do you know the Leader article isn't mine? \n \n My points are clear and there is no reason to continue to discuss this point with you. It is quite clear that you are adamant in support of this conflict and wish to quibble about maximum funds and ages of recpients. It would be advantageous if you would read the bill rather than relying on conservative talking points amplified by the president and misquoted as well. I'm surprised you haven't taken the time to do this since you apparently did an exhaustive search on the originality of my post which clearly demonstrates the thrust of your response. Please don't. This may be difficult for you to believe but I didn't post this particularly for you. If you don't agree, fine. But to define an opinion with adjectives you have chosen to use is not in the interest of debate.Okay. No! You refer to this post as a \"smokescreen\". To me, it's an opinion. Too bad your opinion doesn't happen to be the same as mine. But then, following your terse response, I'm not surprised. Your response appears to be bent on being right rather than considering other perspectives. It's a sad comment when someone is so intolerate of someone else's opinion that they feel a need to attack. But I am aware of how the \"uniter\" has brought us together.\n Please do. Virginia is a red state if this helps. But the Leader is a blue paper.\n PS\n Just a clue. . . . .It might be good for you to read the title next time. . . .Cost of insuring middle-income children's health pales next to war \n\n \n \n FWIW, E Mutz treats everyone this way. He appears to have huge chips upon his shoulders which he likes to unload on those who don't support his intolerant, authoritarian, neocon views.", 
   {}, 
   288225, 
   null, 
   1192794420.0
  ], 
  [
   288242, 
   null, 
   "Matthew S", 
   "\n \n So lets try this again shall we? Come out from behind your Cost-Of-War-Smokescreen and justify this bill. Explain why 25 year olds should be considered children. Explain how a family making $83,000/year cannot afford health care. Explain how a regressive tobacco tax will be sufficient to pay the insurance costs of these twenty-something toddlers. \n \n \n\n \n Simple everyone should be covered no matter the age. I support taxes upon all business to suppot the cost of health care. I also support legally forcing all companies based or trading stock with in the United States to do the majority of manufacture of their products within the United States.", 
   {}, 
   288219, 
   null, 
   1192797000.0
  ], 
  [
   288251, 
   null, 
   "samiinh", 
   "Abstinence 1, S-Chip 0\n by Amanda Robb\n \n Democratic leaders are right to contest President Bush's veto of their bill to expand the State Children's Health Insurance program. But sadly, their \"bipartisan compromise\" will leave millions of young Americans vulnerable to sickness and suffering of the most preventable kind.\n \n To entice Republicans to support the bill, the House of Representatives agreed to increase money for abstinence-only sex education by $28 million, to a total of about $200 million a year. Abstinence-only courses, the only form of federally financed sex ed, teach that sexual activity outside of marriage is likely to cause psychological and physical harm.\n \n If that were true, our health care system would be not only broken, but besieged. A 2002 survey found that 93 percent of American adults had had premarital sex by the age of 30.\n \n In addition to provoking shame about a nearly universal activity, abstinence-only sex education is ineffective and dangerous. Last April, a 10-year study found that students who took abstinence-only courses were no more likely to abstain from sex than other students. Previous studies revealed that abstinence-only students avoid using contraception.", 
   {
    "post_info": {
     "post_title": "Waste of Money"
    }, 
    "unicode_changes_made": true
   }, 
   288242, 
   null, 
   1192799520.0
  ], 
  [
   288282, 
   null, 
   "DrD", 
   "FWIW, E Mutz treats everyone this way. He appears to have huge chips upon his shoulders which he likes to unload on those who don't support his intolerant, authoritarian, neocon views.\nIntolerance seems to be everywhere today. I'm not sure of the purpose other than having to be right. How it serves our country is disputable.", 
   {}, 
   288237, 
   null, 
   1192813020.0
  ], 
  [
   288283, 
   null, 
   "DrD", 
   "Abstinence 1, S-Chip 0\n by Amanda Robb\n \n Democratic leaders are right to contest President Bush's veto of their bill to expand the State Children's Health Insurance program. But sadly, their \"bipartisan compromise\" will leave millions of young Americans vulnerable to sickness and suffering of the most preventable kind.\n \n To entice Republicans to support the bill, the House of Representatives agreed to increase money for abstinence-only sex education by $28 million, to a total of about $200 million a year. Abstinence-only courses, the only form of federally financed sex ed, teach that sexual activity outside of marriage is likely to cause psychological and physical harm.\n \n If that were true, our health care system would be not only broken, but besieged. A 2002 survey found that 93 percent of American adults had had premarital sex by the age of 30.\n \n In addition to provoking shame about a nearly universal activity, abstinence-only sex education is ineffective and dangerous. Last April, a 10-year study found that students who took abstinence-only courses were no more likely to abstain from sex than other students. Previous studies revealed that abstinence-only students avoid using contraception.\nThanks for adding facts rather than a \"position\".", 
   {
    "unicode_changes_made": true
   }, 
   288251, 
   null, 
   1192813080.0
  ], 
  [
   288284, 
   null, 
   "Steeeeve", 
   "Not only should he have vetoed this plan but Bush should look at other ways to cut back spending. This country can sustain what is spends now...why increase it more?", 
   {}, 
   288251, 
   null, 
   1192813200.0
  ], 
  [
   288347, 
   null, 
   "samiinh", 
   "Not only should he have vetoed this plan but Bush should look at other ways to cut back spending. This country can sustain what is spends now...why increase it more?\n\n \n Then he should end the war in Iraq.", 
   {}, 
   288284, 
   null, 
   1192840320.0
  ], 
  [
   288377, 
   null, 
   "Bassman", 
   "Simple everyone should be covered no matter the age. I support taxes upon all business to suppot the cost of health care. I also support legally forcing all companies based or trading stock with in the United States to do the majority of manufacture of their products within the United States.\nBased on your stances, what you want is akin to the old Soviet type communism, Matthew. I'll give you a little hint:\n \n \n It doesn't work!", 
   {}, 
   288242, 
   null, 
   1192889940.0
  ], 
  [
   288383, 
   null, 
   "Matthew S", 
   "Based on your stances, what you want is akin to the old Soviet type communism, Matthew. I'll give you a little hint:\n \n \n It doesn't work!\n\n \n No they are still free to manufacture what they want they just need to do it here. They also need to be taxed to pay for the health care of people who work for them and the people who buy their products.\n \n Why is it so hard for you, who claimes to be Christian, to support taking care of the sick, hungry, and the poor. Jesus was not a capitalist he was a socialist.", 
   {}, 
   288377, 
   null, 
   1192890900.0
  ], 
  [
   288385, 
   null, 
   "Bassman", 
   "No they are still free to manufacture what they want they just need to do it here. They also need to be taxed to pay for the health care of people who work for them and the people who buy their products.\nYou do that and you guarantee private sector business failure because the cost of the products will have to rise.\n \n \nWhy is it so hard for you, who claimes to be Christian, to support taking care of the sick, hungry, and the poor. Jesus was not a capitalist he was a socialist.\nThe difference is that I help out of my willingness, not by government edict.", 
   {}, 
   288383, 
   null, 
   1192891560.0
  ], 
  [
   288387, 
   null, 
   "Matthew S", 
   "You do that and you guarantee private sector business failure because the cost of the products will have to rise.\n\n \n nonsense people will still have to buy things and there will still be a need to make things.\n \n \n \n \n \n\n The difference is that I help out of my willingness, not by government edict.\n\n \n That is a selfish unchristian attitude.", 
   {}, 
   288385, 
   null, 
   1192894320.0
  ], 
  [
   288388, 
   null, 
   "Bassman", 
   "nonsense people will still have to buy things and there will still be a need to make things.\n No, Matthew, it's the simple law of profit and loss. When a business gets priced right out of the marketplace, it fails.\n \n \n \n \n \n \n \n a selfish unchristian attitude.\nHow? God didn't say that the government has an exclusive right to my wallet either.", 
   {}, 
   288387, 
   null, 
   1192894440.0
  ], 
  [
   288390, 
   null, 
   "Matthew S", 
   "No, Matthew, it's the simple law of profit and loss. When a business gets priced right out of the marketplace, it fails.\n \n\n And there will be others to take its place. I am so tired of the line of arguement that over taxation will drive business out of business. Nonsense \n \n \n \n \n \n\n How? God didn't say that the government has an exclusive right to my wallet either.\n\n \n So then it is better to have people die on the streets to save your wallet?", 
   {}, 
   288388, 
   null, 
   1192896180.0
  ], 
  [
   288402, 
   null, 
   "Bassman", 
   "And there will be others to take its place. I am so tired of the line of arguement that over taxation will drive business out of business. Nonsense\nReally? Then, according to your line of thinking, states like New York and Michigan, two of the highest taxed and most Liberal states in the country, should be drawing businesses by the boatload. \n \n \n \n \n \n \n \nSo then it is better to have people die on the streets to save your wallet?\n\n Strawman", 
   {}, 
   288390, 
   null, 
   1192901040.0
  ], 
  [
   288410, 
   null, 
   "Steeeeve", 
   "Then he should end the war in Iraq.\nProbably the best argument to end the war is that we can't afford the war but even if we end the war we are still in debt. Only way to solve that problem is to lower benefits and raise taxes...the exact opposite of what anyone would want.", 
   {}, 
   288347, 
   null, 
   1192912140.0
  ], 
  [
   288415, 
   null, 
   "Matthew S", 
   "\n \n \n Strawman\n\n \n You brought up your wallet.", 
   {}, 
   288402, 
   null, 
   1192916940.0
  ], 
  [
   288421, 
   null, 
   "samiinh", 
   "Probably the best argument to end the war is that we can't afford the war but even if we end the war we are still in debt. Only way to solve that problem is to lower benefits and raise taxes...the exact opposite of what anyone would want.\n\n \n That's because we have a group of cowards running the government today.", 
   {}, 
   288410, 
   null, 
   1192920720.0
  ], 
  [
   288436, 
   null, 
   "DrD", 
   "IDEA! emoticon_idea \n Instead of socialized healthcare or national healthcare, lets call it CHRISTIAN HEALTHCARE. WWJD?\n \n I'll help anybody anyway I can. I'll be your friend, I'll give you a ride, I'll work in a soup kitchen, but, don't ever ask me for money. Never, do you hear me NEVER! emoticon_mad", 
   {}, 
   288421, 
   null, 
   1192928940.0
  ], 
  [
   288442, 
   null, 
   "samiinh", 
   "IDEA! emoticon_idea \n Instead of socialized healthcare or national healthcare, lets call it CHRISTIAN HEALTHCARE. WWJD?\n \n I'll help anybody anyway I can. I'll be your friend, I'll give you a ride, I'll work in a soup kitchen, but, don't ever ask me for money. Never, do you hear me NEVER! emoticon_mad\n\n \n \n Asking for money is the America way, Doc.", 
   {}, 
   288436, 
   null, 
   1192933680.0
  ], 
  [
   288462, 
   null, 
   "gamehuis", 
   "I notice that nobody has responded to Herr Mutz's claims that 25-year olds and people that make $ 83.000 are not poor children and therefore the program should not be expanded. I wonder why?\n \n Furthermore, trying to \"win\" the argument by saying that Herr Mutz is a filthy neocon (when he's actually the opposite) is a testament on how weak the oppositions arguments really are. \n And if you really have to go that way, just call him a Nazi and be done with it.\n \n Tricks and treachery are the practice of fools, that don't have brains enough to be honest.\n \n \n And to have the money for the program come out of the pockets of only a specific group of people is just despicable. \n But I guess it's always easy to spend other peoples money.\n \n Here's a newsflash for you guys: The US (both people and government) is BROKE. You have over $70 trillion worth entitlements floating around, no money to pay for them and you've just maxed out all your creditcards. Now is not a good time to add more entitlements to the list, no matter how \"noble\" your intentions are.", 
   {}, 
   288442, 
   null, 
   1192959900.0
  ], 
  [
   288463, 
   null, 
   "Matthew S", 
   "Really? Then, according to your line of thinking, states like New York and Michigan, two of the highest taxed and most Liberal states in the country, should be drawing businesses by the boatload. \n\n \n \n Can you explain these taxes that you say Michigan has that other satates don't? \n \n Michigan is hardly liberal. Not all of michigan is liberal and not all of it is detroit. The west side of the state is a cithgap stronghold. If detroit was removed from Michigan the state would be reder and more conservative then Texas. I live in a small west michigan town of 20000 people there are 50 chruches and two christianist radio stations. The local sherifs race is is being hotly contested by 3 rebublicans and no other party. I go to vote and there are only republicans on the ballot locally. The state just raised taxes to pay for a 1.9 billion dollar budget deficit, there was nothing but the schools, medcade, and prisions left to cut. Those legislators that voted for tax increases are now facing recalls for voting to increase the income tax from 3.9 to 4.3% and extending the sales tax to include services, like palm reading.", 
   {}, 
   288402, 
   null, 
   1192964940.0
  ], 
  [
   288478, 
   null, 
   "E Mutz", 
   "I notice that nobody has responded to Herr Mutz's claims that 25-year olds and people that make $ 83.000 are not poor children and therefore the program should not be expanded. I wonder why?\n \n Furthermore, trying to \"win\" the argument by saying that Herr Mutz is a filthy neocon (when he's actually the opposite) is a testament on how weak the oppositions arguments really are. \n And if you really have to go that way, just call him a Nazi and be done with it.\n \n Tricks and treachery are the practice of fools, that don't have brains enough to be honest.\n \n Out of curousity...what is the opposite of a Dirty Neocon? A Clean Paleolib?\n \n Dirty Neocons would be a good name for a thrash metal band.", 
   {}, 
   288463, 
   null, 
   1192986960.0
  ], 
  [
   288480, 
   null, 
   "E Mutz", 
   "Can you explain these taxes that you say Michigan has that other satates don't? \n \n According to Tax Foundation Data, Michigan ranks 14th in State and Local Tax burden with these taxes encompassing 11.2% of income. If you factor in Federal taxes, the citizens of Michigan fork over 31.9% of their income. This percentage ranks them 21st out of the 50 states and myriad territories. \n \n The only reason Michigan doesn't rank higher on the list of highest taxed states is that the other Blue states are competing for the dubious honor. Of the top 14 taxed states, 12 are blue... What makes this even more extraordinary is that there were only 19 blue states to begin with, the vast proportion of which are the highest taxed in the union.", 
   {
    "post_info": {
     "post_title": "Caution:  Facts in progress"
    }
   }, 
   288478, 
   null, 
   1192987740.0
  ], 
  [
   288483, 
   null, 
   "DrD", 
   "Here's a newsflash for you guys: The US (both people and government) is BROKE. You have over $70 trillion worth entitlements floating around, no money to pay for them and you've just maxed out all your creditcards. Now is not a good time to add more entitlements to the list, no matter how \"noble\" your intentions are.\nAnd yet, we have enough money to stay in a war that's costing us $4,000.00 a second.\n \n One of the reasons no one has responded to \"Herr Mutz's\" comment on the $83,000.00 is because it is factually incorrect as written here. The bill is written differently than offered by the talking heads, a hugh source of political knowledge here.\n \n gamehuis, according to your profile you live outside of the US. How does your insurance coverage work there?", 
   {}, 
   288480, 
   null, 
   1192991580.0
  ], 
  [
   288484, 
   null, 
   "Symbiote", 
   "And just when you thought Bush's economic policies were the worst imaginable, someone comes along with some even more moronic than even he could dream up.", 
   {}, 
   288383, 
   null, 
   1192992600.0
  ], 
  [
   288486, 
   null, 
   "Bassman", 
   "Can you explain these taxes that you say Michigan has that other satates don't? \n \n According to Tax Foundation Data, Michigan ranks 14th in State and Local Tax burden with these taxes encompassing 11.2% of income. If you factor in Federal taxes, the citizens of Michigan fork over 31.9% of their income. This percentage ranks them 21st out of the 50 states and myriad territories. \n \n The only reason Michigan doesn't rank higher on the list of highest taxed states is that the other Blue states are competing for the dubious honor. Of the top 14 taxed states, 12 are blue... What makes this even more extraordinary is that there were only 19 blue states to begin with, the vast proportion of which are the highest taxed in the union.\nUnfortunately, Mutzie, New York, with the Lamborghini of welfare programs, ranks numero uno in terms of overall taxation!", 
   {}, 
   288480, 
   null, 
   1192995120.0
  ], 
  [
   288487, 
   null, 
   "gamehuis", 
   "And yet, we have enough money to stay in a war that's costing us $4,000.00 a second.\n\n Well, spending money on wars is never a good thing, but just because that's bad, doesn't mean that spending it on other programs is good.\n \n \nOne of the reasons no one has responded to \"Herr Mutz's\" comment on the $83,000.00 is because it is factually incorrect as written here. The bill is written differently than offered by the talking heads, a hugh source of political knowledge here.\n\n I'm not knowledgeable enough about this subject to make any kind of judgement call on this one, but in general if someone writes something you think is factually incorrect, it's a good thing to call on them on their alledged BS instead of ignoring them.\n \n \ngamehuis, according to your profile you live outside of the US. How does your insurance coverage work there?\n\n Here in Holland we used to have socialized medicine where our employers held back money from our paychecks. The employers then added a certain amount for each employee and then gave it to the government, who in turn gave it to the insurance companies. Employees were then able to choose from a list of insurance companies that their employers drafted.\n Unemployed people were only required to pay a token amount ($25-$50 per month) and got their insurance through a government insurance company.\n Health insurance was mandatory by law.\n \n These days we have a semi socialized/corporate medicine system. All people are still required by law to have health insurance. The employers no longer hold back any money and the people can buy insurance directly from any number of health insurance companies. The government makes sure that no insurance company raises the prices too much and that all people that apply for insurance get it.\n Insurance companies are not allowed to refuse anyone on medical reasons. That means that even a person that has AIDS, cancer and the birdflu can get insurance for the exact same price as a fit and healthy person.\n \n As a conservative I'm not too happy about any kind of socialized medicine. I think that a true free market can deliver any service better and cheaper than a government controlled market. But all things considered, when you have a system, any system, that makes sure that all the people have health insurance, one can't really complain.", 
   {}, 
   288483, 
   null, 
   1192995540.0
  ], 
  [
   288488, 
   null, 
   "Matthew S", 
   "Can you explain these taxes that you say Michigan has that other satates don't? \n \n According to Tax Foundation Data, Michigan ranks 14th in State and Local Tax burden with these taxes encompassing 11.2% of income. If you factor in Federal taxes, the citizens of Michigan fork over 31.9% of their income. This percentage ranks them 21st out of the 50 states and myriad territories. \n \n The only reason Michigan doesn't rank higher on the list of highest taxed states is that the other Blue states are competing for the dubious honor. Of the top 14 taxed states, 12 are blue... What makes this even more extraordinary is that there were only 19 blue states to begin with, the vast proportion of which are the highest taxed in the union.\n\n \n I only pay 3.56% income tax I don't know where they came up with their data. Could you list these taxes you seem to think I am paying as a citizen of michigan. I pay 32.11% comes out of my gross 11.28% federal, 5.97% ss, 1.4% medicad, 3.56% state,4.9% insurance, 5.0% 401k combined out of my check. So if I just go with taxes it is a total of 22.21%, 18.65% federal and 3.56% state. I don't know what dark hole you are pulling your figures from. \n \n Please post a detailed list these supposed taxes I am paying. Please include a detail list of taxes outside of income that the citizens of Michigan pay that the citizens in other states do not pay.", 
   {}, 
   288480, 
   null, 
   1192995960.0
  ], 
  [
   288490, 
   null, 
   "samiinh", 
   "Unfortunately, Mutzie, New York, with the Lamborghini of welfare programs, ranks numero uno in terms of overall taxation!\n\n \n Not according to CNN. That distinction belongs to Maine.", 
   {}, 
   288486, 
   null, 
   1192996500.0
  ], 
  [
   288492, 
   null, 
   "Matthew S", 
   "Unfortunately, Mutzie, New York, with the Lamborghini of welfare programs, ranks numero uno in terms of overall taxation!\n\n \n I guess the prison system is a welfare program?", 
   {}, 
   288486, 
   null, 
   1192997280.0
  ], 
  [
   288496, 
   null, 
   "Steeeeve", 
   "That's because we have a group of cowards running the government today.\nWhat do you think most of the country would do if they raised taxes and lowered benefits including medicare and social security? They would kick out the president for one and probably a lot of congress. In the end, that is what it takes though.", 
   {}, 
   288421, 
   null, 
   1193002620.0
  ], 
  [
   288507, 
   null, 
   "samiinh", 
   "What do you think most of the country would do if they raised taxes and lowered benefits including medicare and social security? They would kick out the president for one and probably a lot of congress. In the end, that is what it takes though.\n\n \n Isn't that part of the republican platform? Raise taxes on the middle, and reduce benefits?", 
   {}, 
   288496, 
   null, 
   1193007660.0
  ], 
  [
   288508, 
   null, 
   "E Mutz", 
   "I only pay 3.56% income tax I don't know where they came up with their data. Could you list these taxes you seem to think I am paying as a citizen of michigan. I pay 32.11% comes out of my gross 11.28% federal, 5.97% ss, 1.4% medicad, 3.56% state,4.9% insurance, 5.0% 401k combined out of my check. So if I just go with taxes it is a total of 22.21%, 18.65% federal and 3.56% state. I don't know what dark hole you are pulling your figures from. \n \n Please post a detailed list these supposed taxes I am paying. Please include a detail list of taxes outside of income that the citizens of Michigan pay that the citizens in other states do not pay.\n \n Hell, look it up for yourself:\n \n http://www.taxfoundation.org/news/show/335.html\n \n Tax Foundation data is more representative of tha actual tax burden faced by the States because the data provided by the Census Bureau does not incorporate local/property/sales taxes. You can get more data on your state here:\n \n http://www.taxfoundation.org/research/topic/36.html\n \n Yes, you may only pay 3.9% in INCOME tax, but you are quite forgetting property taxes, sales taxes, ad valorem taxes (where applicable). That doesn't even begin to address imbedded taxes (increased costs of products gleefully passed along to you by businesses to offset the cost of their own taxes.) If you rent, you pay an imbedded property tax. You don't think you landlord simply pays the tax without passing the cost on to you do you? \n \n That is the basic problem with your desire to pay for the solution of the world's problems by taxing business. Businesses pay no taxes, CONSUMERS pay taxes. The tax at the heart of the SCHIP debate (increased tobacco tax) is at its heart the most regressive of taxes. \n \n For your particular edification you could review the Michigan Tax burden since 1970:\n \n http://www.taxfoundation.org/research/show/461.html\n \n Remember, the data incorporates the averages of the State and local taxes. Your own particular local may vary. If your own town is below the average, by all means, lobby your town council to rectify the \"problem\". Your own tax burden may also be altered by adjusting investments, purchasing habits, etc. Curious that this is just the sort of thing you have accused the \"evil rich\" of doing.", 
   {
    "unicode_changes_made": true
   }, 
   288496, 
   null, 
   1193007720.0
  ], 
  [
   288520, 
   null, 
   "DrD", 
   "Well, spending money on wars is never a good thing, but just because that's bad, doesn't mean that spending it on other programs is good.\nInteresting. Making value judgements seem not to be a part of your logic. Spending on war or on health care seem to be the same in your opinion here. \n \nI'm not knowledgeable enough about this subject to make any kind of judgement call on this one, but in general if someone writes something you think is factually incorrect, it's a good thing to call on them on their alledged BS instead of ignoring them.\nMaybe you should have read back a littler earlier in the thread. I did!!\n Here in Holland we used to have socialized medicine where our employers held back money from our paychecks. The employers then added a certain amount for each employee and then gave it to the government, who in turn gave it to the insurance companies. Employees were then able to choose from a list of insurance companies that their employers drafted.\n Unemployed people were only required to pay a token amount ($25-$50 per month) and got their insurance through a government insurance company.\n Health insurance was mandatory by law.\n \nAs a conservative I'm not too happy about any kind of socialized medicine. I think that a true free market can deliver any service better and cheaper than a government controlled market. But all things considered, when you have a system, any system, that makes sure that all the people have health insurance, one can't really complain. \nI presume by what you wrote that having a conservative view trumps practicality. My wife and I pay $2,000 a month to Aetna for health care which cannot be bought elsewhere due to health reasons. Every other company will not insure us. Why? type II diabetes and high blood pressure. . .that's it! We still have a large deductible and co-payments for drugs. So, if you like free, truly free market, come on over. If you think private is better than universal, sponsored by the government, the borders are open. ]C'mon over. By the way, we already have some socialized programs including law enforcement, state and government workers, etc. We also have social programs which we can afford i.e. social security, medicare. BTW, only the neo-conservatives here are against all of us having some kind of decent, affordable coverage. Heath care here is a train wreck in many instances. If I didn't have (or could not afford) insurance, had a heart attack requiring surgery, my wife and I would be out on the streets. So, our choice is clear. . . .gamble or pay $2K a month. What would you do?", 
   {}, 
   288487, 
   null, 
   1193014860.0
  ], 
  [
   288528, 
   null, 
   "samiinh", 
   "Interesting. Making value judgements seem not to be a part of your logic. Spending on war or on health care seem to be the same in your opinion here. \n Maybe you should have read back a littler earlier in the thread. I did!!\n Here in Holland we used to have socialized medicine where our employers held back money from our paychecks. The employers then added a certain amount for each employee and then gave it to the government, who in turn gave it to the insurance companies. Employees were then able to choose from a list of insurance companies that their employers drafted.\n Unemployed people were only required to pay a token amount ($25-$50 per month) and got their insurance through a government insurance company.\n Health insurance was mandatory by law.\n I presume by what you wrote that having a conservative view trumps practicality. My wife and I pay $2,000 a month to Aetna for health care which cannot be bought elsewhere due to health reasons. Every other company will not insure us. Why? type II diabetes and high blood pressure. . .that's it! We still have a large deductible and co-payments for drugs. So, if you like free, truly free market, come on over. If you think private is better than universal, sponsored by the government, the borders are open. ]C'mon over. By the way, we already have some socialized programs including law enforcement, state and government workers, etc. We also have social programs which we can afford i.e. social security, medicare. BTW, only the neo-conservatives here are against all of us having some kind of decent, affordable coverage. Heath care here is a train wreck in many instances. If I didn't have (or could not afford) insurance, had a heart attack requiring surgery, my wife and I would be out on the streets. So, our choice is clear. . . .gamble or pay $2K a month. What would you do?\n\n \n I, for one, am 100 percent behind universal health care.", 
   {}, 
   288520, 
   null, 
   1193017080.0
  ], 
  [
   288529, 
   null, 
   "Matthew S", 
   "I only pay 3.56% income tax I don't know where they came up with their data. Could you list these taxes you seem to think I am paying as a citizen of michigan. I pay 32.11% comes out of my gross 11.28% federal, 5.97% ss, 1.4% medicad, 3.56% state,4.9% insurance, 5.0% 401k combined out of my check. So if I just go with taxes it is a total of 22.21%, 18.65% federal and 3.56% state. I don't know what dark hole you are pulling your figures from. \n \n Please post a detailed list these supposed taxes I am paying. Please include a detail list of taxes outside of income that the citizens of Michigan pay that the citizens in other states do not pay.\n \n Hell, look it up for yourself:\n \n http://www.taxfoundation.org/news/show/335.html\n \n Tax Foundation data is more representative of tha actual tax burden faced by the States because the data provided by the Census Bureau does not incorporate local/property/sales taxes. You can get more data on your state here:\n \n http://www.taxfoundation.org/research/topic/36.html\n \n Yes, you may only pay 3.9% in INCOME tax, but you are quite forgetting property taxes, sales taxes, ad valorem taxes (where applicable). That doesn&#8217;t even begin to address imbedded taxes (increased costs of products gleefully passed along to you by businesses to offset the cost of their own taxes.) If you rent, you pay an imbedded property tax. You don&#8217;t think you landlord simply pays the tax without passing the cost on to you do you? \n \n That is the basic problem with your desire to pay for the solution of the world&#8217;s problems by taxing business. Businesses pay no taxes, CONSUMERS pay taxes. The tax at the heart of the SCHIP debate (increased tobacco tax) is at its heart the most regressive of taxes. \n \n For your particular edification you could review the Michigan Tax burden since 1970:\n \n http://www.taxfoundation.org/research/show/461.html\n \n Remember, the data incorporates the averages of the State and local taxes. Your own particular local may vary. If your own town is below the average, by all means, lobby your town council to rectify the &#8220;problem&#8221;. Your own tax burden may also be altered by adjusting investments, purchasing habits, etc. Curious that this is just the sort of thing you have accused the &#8220;evil rich&#8221; of doing.\n\n \n \n Then you do not have a claim that Michigan is one of the highest tax states. I gave you the detail percentages from my paycheck. We have a 6% sales tax and dealing with the p&L's from the business I am in I know that there are no other taxes out there. So your overtaxation claim can not be upheld.", 
   {}, 
   288508, 
   null, 
   1193018280.0
  ], 
  [
   288530, 
   null, 
   "E Mutz", 
   "If you think private is better than universal, sponsored by the government, the borders are open. ]C'mon over. \n \n So you think that the gubment which could not respond to Katrina, could not find WMD, could not protect its citizens from lead-painted Chinese toys, could not guarantee food safety, cannot find Osama, wastes \"$4,000 per second\" on an unwinnable war and can not protect its borders is somehow going to fix healthcare?\n \n By the way, we already have some socialized programs including law enforcement, state and government workers, etc. We also have social programs which we can afford i.e. social security, medicare.\n \n Interesting that you tout Social Security as a gubment success. Have you by any chance compared your social security benefit to the benefit you would have derived from privately investing? If the gubment were to take your SS tax dollars and invest them even conservatively you would have a far higher standard of living. The social security my folks paid into now barely covers their property taxes and grocery costs. I suppose the answer would be to raise their taxes to increase their benefits? \n \n Meanwhile the medicare trust fund will be out o' money by 2020. Think medicare is a success? Ask a physician who must deal with the paperwork and wait for reduced payment or the participant who must wait for services. \n \n From the Social Security Administration's 2007 annual report: http://www.ssa.gov/OACT/TRSUM/trsummary.html\n \n Each year the Trustees of the Social Security and Medicare trust funds report on the current and projected financial status of the two programs. This message summarizes our 2007 Annual Reports. \n The financial condition of the Social Security and Medicare programs remains problematic; we believe their currently projected long run growth rates are not sustainable under current financing arrangements. Social Security's current annual surpluses of tax income over expenditures will soon begin to decline and then turn into rapidly growing deficits as the baby boom generation retires. Medicare's financial status is even worse. Medicare's Hospital Insurance (HI) Trust Fund is already expected to pay out more in hospital benefits this year than it receives in taxes and other dedicated revenues. The growing annual deficits in both programs are projected to exhaust HI reserves in 2019 and Social Security reserves in 2041. In addition, the Medicare Supplementary Medical Insurance (SMI) Trust Fund that pays for physician services and the new prescription drug benefit will continue to require general revenue financing and charges on beneficiaries that grow faster than the economy and beneficiary incomes over time. \n The drawdown of Social Security and HI Trust Fund reserves and the general revenue transfers into SMI will place mounting pressure on the Federal budget. In fact, this pressure is already evident. For the first time, a \"Medicare funding warning\" is being triggered, signaling that non-dedicated sources of revenues-primarily general revenues- will soon account for more than 45 percent of Medicare's outlays. By law, this warning requires that the President propose, and the Congress consider, remedial action. \n \n End quote And that is the Social Security Administration admitting the system is bust!\n \n Your avatar would lead one to believe that ye are a Vietnam veteran. Why no mention of your VA benefits or efforts to secure them? Nevertheless, as a Vietnam era Veteran you should be nearing the age of medicare eligibility. Your medical insurance problems will be resolved on the backs of the younger generation as those baby boomers retire en masse. Fewer than 2.5 workers will be available to provide the tax moneys necessary to sustain the program. The solution: Cut benefits or increase taxes on those remaining tax payers. \n \n BTW, only the neo-conservatives here are against all of us having some kind of decent, affordable coverage\n \n I don't suppose you would suggest that neocons (or anyone else) are opposed to food, but I don't suppose you would suggest that anyone who does not support universal grocery subsidy is an evil neocon. What about shelter? Universal gubment sponsored housing! Only a neocon would question the cost! \n \n Surely food and shelter are more fundamental needs than medical care. The problem is not that folks are opposed to others having these things. The problem is how to pay for these big society ideas without raising taxes to an onerous level. Americans already spend 1/3 of the year at work simply to satisfy their current tax burden. I doubt many of them would be excited to have to work until May or June to satisfy the tax man.", 
   {
    "unicode_changes_made": true
   }, 
   288528, 
   null, 
   1193018520.0
  ], 
  [
   288535, 
   null, 
   "Steeeeve", 
   "Isn't that part of the republican platform? Raise taxes on the middle, and reduce benefits?\nYour post shows why we could never do such a thing. It isn't about republican or democrat....they both are at fault and the solution will benefit no one in the short term and probably hurt the lower and middle class the most. \n \n If the republicans raised taxes and reduced benefits then I'd actually like them.", 
   {}, 
   288507, 
   null, 
   1193019900.0
  ], 
  [
   288540, 
   null, 
   "E Mutz", 
   "Then you do not have a claim that Michigan is one of the highest tax states. I gave you the detail percentages from my paycheck. We have a 6% sales tax and dealing with the p&L's from the business I am in I know that there are no other taxes out there. So your overtaxation claim can not be upheld.\n \n I guess that's my fault for not accepting your personal anecdote over the statistics provided by the Tax Foundation or the US Census Bureau. According to the former, Michiganders pay 11.2% in state and Local taxes, just slightly above the national average but high enough to place them at #14 out of 50 states. That sir is more than 36 other states, ergo Michigan IS one of the highest tax states. \n \n Moreover, the US Census bureau ranks Michigan as #8 in total tax burden. The best data for Michigan appears in the per-capita tax rating in which Michigan is 18th with an average per capita tax burden of $2,324. Eighteenth is still well above the median. (http://www.census.gov) To be fair, Michigan ranks 3rd among states who impose a flat fee individual income tax structure. Yey Michigan! Too bad that is still higher than 36 other States.\n \n So that is one non-partisan research group and one gubment agency against one personal anecdote. \n \n But it's getting worse:\n \n Michigan Raises Income Tax to 4.35%\n \n http://www.freep.com/apps/pbcs.dll/artikkel?Dato=20071001&Kategori=NEWS06&Lopenr=710010329&Ref=AR&imw=Y\n \n (truncated for your attention span)\n \n A potentially chaotic, full government shutdown was averted at around 4 a.m. when the state Senate voted to expand the 6% sales tax to various services, the final major piece of a plan to erase a $1.75-billion deficit and balance a 2007-08 budget.\n \n Three of 21 Republicans voted for the sales tax change, and only one of 17 Democrats opposed it.\n \n The vote came three hours after the House and Senate voted to raise the 3.9% income tax rate to 4.35%, and approved controversial changes in school employee health insurance and pension benefits aimed at reducing state costs.\n \n Late Sunday, the Democrat-controlled House passed a bill to raise the state income tax from 3.9% to 4.35% by a 57-52 vote with just two Republicans - Chris Ward of Brighton and Ed Gaffney of Grosse Pointe Farms - voting for it. Only three Democrats - Lisa Wojno of Warren, Martin Griffin of Jackson and Mike Simpson of Liberty Township near Jackson - voted against it.\n \n The Tax Foundation says ye are over taxed, the Census Bureau says ye are over taxed and now the State Gubment just increased the percentage of the income tax and expanded the sales tax so that now you are paying tax on even MORE items!\n \n Lets recap: One Non-Partisan agency, One Gubment Agency and one Michigan Newspaper vs Matthew's personal observation an observation which notably does not include property taxes (15th Nationally), alcohol or tobacco taxes (4th nationally), ad valorem taxex, etc. Significantly, your tax statement does not represent corporate tax collections (8th nationally) which is a key reflection of how attractive your State is to prospective employers. If you can't attract those evil corporations to your State, you cannot tax them to provide services to your citizens. \n \n Where Michigan really gets hosed is the comparatively corporate friendly tax environment of neighboring Indiana. According to (sigh) statistics (sorry for the lack of personal anecdotes) on the scale of states with the most friendly Corporate Tax rates Michigan ranks 29th while Indiana ranks 12th. \n \n Just damn. \n \n If you have any real data this would be a good time to use it. In the meantime, I'll kick back in my red state and enjoy one of the lowest tax burdens in the Union. \n \n PS: My car was built in Tennessee and I bought it 12 years ago so I haven't been helping much.", 
   {
    "post_info": {
     "post_title": "Michigan:  Great Hockey, Lousy Taxes"
    }, 
    "unicode_changes_made": true
   }, 
   288530, 
   null, 
   1193021160.0
  ], 
  [
   288562, 
   null, 
   "Matthew S", 
   "Then you do not have a claim that Michigan is one of the highest tax states. I gave you the detail percentages from my paycheck. We have a 6% sales tax and dealing with the p&L's from the business I am in I know that there are no other taxes out there. So your overtaxation claim can not be upheld.\n \n I guess that&#8217;s my fault for not accepting your personal anecdote over the statistics provided by the Tax Foundation or the US Census Bureau. According to the former, Michiganders pay 11.2% in state and Local taxes, just slightly above the national average but high enough to place them at #14 out of 50 states. That sir is more than 36 other states, ergo Michigan IS one of the highest tax states. \n \n Moreover, the US Census bureau ranks Michigan as #8 in total tax burden. The best data for Michigan appears in the per-capita tax rating in which Michigan is 18th with an average per capita tax burden of $2,324. Eighteenth is still well above the median. (http://www.census.gov) To be fair, Michigan ranks 3rd among states who impose a flat fee individual income tax structure. Yey Michigan! Too bad that is still higher than 36 other States.\n \n So that is one non-partisan research group and one gubment agency against one personal anecdote. \n \n But it&#8217;s getting worse:\n \n Michigan Raises Income Tax to 4.35%\n \n http://www.freep.com/apps/pbcs.dll/artikkel?Dato=20071001&Kategori=NEWS06&Lopenr=710010329&Ref=AR&imw=Y\n \n (truncated for your attention span)\n \n A potentially chaotic, full government shutdown was averted at around 4 a.m. when the state Senate voted to expand the 6% sales tax to various services, the final major piece of a plan to erase a $1.75-billion deficit and balance a 2007-08 budget.\n \n Three of 21 Republicans voted for the sales tax change, and only one of 17 Democrats opposed it.\n \n The vote came three hours after the House and Senate voted to raise the 3.9% income tax rate to 4.35%, and approved controversial changes in school employee health insurance and pension benefits aimed at reducing state costs.\n \n Late Sunday, the Democrat-controlled House passed a bill to raise the state income tax from 3.9% to 4.35% by a 57-52 vote with just two Republicans &#8212; Chris Ward of Brighton and Ed Gaffney of Grosse Pointe Farms &#8212; voting for it. Only three Democrats &#8212; Lisa Wojno of Warren, Martin Griffin of Jackson and Mike Simpson of Liberty Township near Jackson &#8212; voted against it.\n \n The Tax Foundation says ye are over taxed, the Census Bureau says ye are over taxed and now the State Gubment just increased the percentage of the income tax and expanded the sales tax so that now you are paying tax on even MORE items!\n \n Lets recap: One Non-Partisan agency, One Gubment Agency and one Michigan Newspaper vs Matthew&#8217;s personal observation an observation which notably does not include property taxes (15th Nationally), alcohol or tobacco taxes (4th nationally), ad valorem taxex, etc. Significantly, your tax statement does not represent corporate tax collections (8th nationally) which is a key reflection of how attractive your State is to prospective employers. If you can't attract those evil corporations to your State, you cannot tax them to provide services to your citizens. \n \n Where Michigan really gets hosed is the comparatively corporate friendly tax environment of neighboring Indiana. According to (sigh) statistics (sorry for the lack of personal anecdotes) on the scale of states with the most friendly Corporate Tax rates Michigan ranks 29th while Indiana ranks 12th. \n \n Just damn. \n \n If you have any real data this would be a good time to use it. In the meantime, I'll kick back in my red state and enjoy one of the lowest tax burdens in the Union. \n \n PS: My car was built in Tennessee and I bought it 12 years ago so I haven't been helping much.\n\n \n \n I gave you real data with the percents from my paycheck. Unless you can list some tax that I pay that those in others states don't pay you have no case. Your claim is false, no matter what statistics you are using when put up against the reality or real data. The Michigan income tax is going to 4.35% however that is still lower then the 4.4% that it was in 1995.", 
   {}, 
   288540, 
   null, 
   1193047980.0
  ], 
  [
   288563, 
   null, 
   "gamehuis", 
   "Interesting. Making value judgements seem not to be a part of your logic. Spending on war or on health care seem to be the same in your opinion here. \n\n Not really.\n Let me simplify it for you:\n Spending on war is worse than spending on healthcare, BUT spending on anything is bad when you're BROKE(!). \n \n \nMaybe you should have read back a littler earlier in the thread. I did!!\n\n No you didn't. You just said the equivalent of \"I'm right and you're wrong\" without backing it up with anything like a link to the bill or a direct copy/paste from it.\n Claims without proof are just opinions and we all know the saying about opinions.\n \n \nI presume by what you wrote that having a conservative view trumps practicality. My wife and I pay $2,000 a month to Aetna for health care which cannot be bought elsewhere due to health reasons. Every other company will not insure us. Why? type II diabetes and high blood pressure. . .that's it! We still have a large deductible and co-payments for drugs. So, if you like free, truly free market, come on over. If you think private is better than universal, sponsored by the government, the borders are open. ]C'mon over. By the way, we already have some socialized programs including law enforcement, state and government workers, etc. We also have social programs which we can afford i.e. social security, medicare. BTW, only the neo-conservatives here are against all of us having some kind of decent, affordable coverage. Heath care here is a train wreck in many instances. If I didn't have (or could not afford) insurance, had a heart attack requiring surgery, my wife and I would be out on the streets. So, our choice is clear. . . .gamble or pay $2K a month. What would you do?\n\n I hate to be the one to tell you this, but the markets in the US are anything but free. What you have are government controlled markets.\n Or did you think that all those HMO's and pharmaceutical companies employ armies of lobbyists just for fun and without expecting something in return?\n \n So basically you would trust the same guys (politicians, corporations, lobbyists) that created the current system that forces you to pay $2k a month to come up with a system that's better for you and worse for them?\n \n There is no such thing as a free market anywhere on the planet. Governments everywhere have a say in anything and everything.\n They even go so far as to regulate vitamins so that the people don't have free access to them and are forced to go to the mega corporations for their needs.\n \n Welcome to the wonderful world of corporatism (i.e. fascism).", 
   {}, 
   288520, 
   null, 
   1193050680.0
  ], 
  [
   288576, 
   null, 
   "E Mutz", 
   "I gave you real data with the percents from my paycheck. Unless you can list some tax that I pay that those in others states don't pay you have no case. Your claim is false, no matter what statistics you are using when put up against the reality or real data. The Michigan income tax is going to 4.35% however that is still lower then the 4.4% that it was in 1995.\n\n \n The funny thing about statistics is that they are data. The statistics I have quoted reflect the total tax burden of the average citizen of Michigan. Your pay check does not constitute a sizable data pool and does not reflect all the taxes you pay. Your real data is not complete. Your figures do not include property taxes, sales taxes, gasoline taxes, tobacco taxes, telephone taxes, local taxes and imbedded taxes. It also does not reflect the payroll taxes paid by your EMPLOYER. Your employer does not pay this tax but merely subtracts it from your total compensation. \n \n I have rather patiently provided you with real-world data I have provided citations and statistics from three separate sources which you have countered with a pay stub. Your pay stub does not negate the previously posted statistics which consistently place Michigan in the ranks of the highest taxed states. The US Census ranks Michigan in the top 20% of taxed states. Your paycheck cannot erase that. \n \n If we take you at your word and assume your provided figures are correct (but adjust the income tax to the current flat-rate of 3.9%, your payroll deductions account for a total of 22.55% of your total income. Lets look at some of the taxes ye missed: \n \n Property Taxes\n \n Property Taxes per $1,000 of Personal Income: This measure. from the U.S. Census Bureau, is probably the best measure of the relative burden of taxes. In fiscal year 1990, Michigan ranked 10th among the 50 states with $47.09 in property taxes per $1,000 of personal income. The national (50-state) average was $35.62. Michigan's high burden also placed it second among the 12 Midwestern states. http://www.educationreport.org/article.aspx?ID=5802\n \n The mathematician in ye will inform you that $47.09 out of every $1,000 = 4.79%. Even if you pay rent to a landlord you are absorbing this tax in increased rent.\n \n 22.55%+4.79% = 27.34%.\n \n Sales Tax:\n \n Here it gets a little tricky. The average Michigander (Michigoose?) pays $781 per year in sales tax. Given that the average per capita income in Michigan is $37,538 the average per capita sales tax expenditure equals 2.0% of the average per capita income.\n \n 22.55%+4.79%+2.0% = 29.34%\n \n Gasoline:\n \n Michigan's gasoline tax is a modest $.19875 per gallon. According to the US Department of Energy, the average American consumes 500 gallons of gasoline per year. This means that the average Michigander forks over just about $100 in gas taxes. Add the nearly $100 you pay in federal gasoline taxes and you have another .5% of tax. Factor in the additional costs for 6% sales tax (not factored in the above sales tax calculation) and you reach 0.75%\n \n 22.55% + 4.79% + 2.0% + 0.75% = 30.09%. \n \n Tobacco Tax:\n \n According to the Michigan Tobacco Settlement Filings, as of 2002 there were 2.4 Million smokers in Michigan. Taking the US Department of Health and Human Services data, we can conclude that these smokers consume an average of one pack per day. The Michigan Tobacco Tax (4th highest in the nation) stands at $2.00 per pack. Each day, smokers cough up $4.8 million in tobacco tax or $1,752,000,000 per year. Given the 2006 population of the State of Michigan, we can extrapolate the average per capita cost for the tobacco tax at $175.00. \n \n 22.55% + 4.79% + 2.0% + 0.75% + 0.4%= 30.49%. For a difference of , 7.94% or $2,980 per capita.\n \n Well Matthew, it would appear that I discovered nearly $3,000 worth of taxes you didn't realize you were paying. I'm beginning to understand why you think people should pay more taxes to fund more socialist endeavors. Add in local and municipal taxes, user fees, ad valorem taxes, tolls, utility and telephone taxes, and your percentage will reach those put forth by the US Census Bureau and the Tax Foundation.\n \n If you have real data from a reputable source please put it forward, or at least call me a bigoted neocon. Anything but please do not put your pay check forward as evidence. It makes you look ill-informed and makes this all too easy.", 
   {
    "unicode_changes_made": true
   }, 
   288563, 
   null, 
   1193070180.0
  ], 
  [
   288587, 
   null, 
   "DrD", 
   "Not really.\n Let me simplify it for you:\n Spending on war is worse than spending on healthcare, BUT spending on anything is bad when you're BROKE(!). \nWEll duh. Point is in this country we find money for the things \"we\" believe in, i.e. war.\n \nNo you didn't. You just said the equivalent of \"I'm right and you're wrong\" without backing it up with anything like a link to the bill or a direct copy/paste from it.\nThat's the difference in reading the bill AND reciting what's heard. I've taken the time to read the bill. The figures mentioned are there but in a completely different context as stated here. Anyone else can do the same. \nClaims without proof are just opinions and we all know the saying about opinions.\nMy point exactly.\n \nI hate to be the one to tell you this, but the markets in the US are anything but free. What you have are government controlled markets.\n Or did you think that all those HMO's and pharmaceutical companies employ armies of lobbyists just for fun and without expecting something in return?\nWell, I hate to tell you this but my daughter is employed by a pharmaceutical co. Most of us understand how and why lobbists work So, I don't think most of us \"Americans\" are as naive as you believe.\n \nSo basically you would trust the same guys (politicians, corporations, lobbyists) that created the current system that forces you to pay $2k a month to come up with a system that's better for you and worse for them\nNot the same personalities but the same principles, yes. This problem was originated by Pres. Nixon. by supporting the founding of HMO's. So, it can be changed. Interesting how we Americans look at our country. Love America, hate the government.\n \nThere is no such thing as a free market anywhere on the planet. Governments everywhere have a say in anything and everything.\nIn this country the government is made up by the people but in many instances not FOR the people. Thehrefore change is possible if we can get cronically mentally lazy people off their bones and begin to think and vote. \nThey even go so far as to regulate vitamins so that the people don't have free access to them and are forced to go to the mega corporations for their needs.\nI can go to any natural food store and buy any vitamins or supplements I care to buy. . . .or order on the internet.\n \n Welcome to the wonderful world of corporatism (i.e. fascism).", 
   {}, 
   288563, 
   null, 
   1193075880.0
  ], 
  [
   288596, 
   null, 
   "DrD", 
   "[QUOTE=E Mutz;288530]If you think private is better than universal, sponsored by the government, the borders are open. ]C'mon over. \n \n \nSo you think that the gubment which could not respond to Katrina, could not find WMD, could not protect its citizens from lead-painted Chinese toys, could not guarantee food safety, cannot find Osama, wastes \"$4,000 per second\" on an unwinnable war and can not protect its borders is somehow going to fix healthcare?\nNo, it won't be fixed with this administration. Fortunately our government has been run by far more competent people in the past and I'm sure will be in the future.\n \n By the way, we already have some socialized programs including law enforcement, state and government workers, etc. We also have social programs which we can afford i.e. social security, medicare.\n \n \nInteresting that you tout Social Security as a gubment success. Have you by any chance compared your social security benefit to the benefit you would have derived from privately investing? If the gubment were to take your SS tax dollars and invest them even conservatively you would have a far higher standard of living.\n This sounds as if you want the same incompetent government to manage your money. \nThe social security my folks paid into now barely covers their property taxes and grocery costs. \nI've looked at the same scales and you're right. It is a shame. Pathetic. Couldn't agree more.\n \nI suppose the answer would be to raise their taxes to increase their benefits? Meanwhile the medicare trust fund will be out o' money by 2020. \nI wouldn't suggest a tax increase. The money would be there except Mr. Bush decided to cannibalize the program to support other programs. The money was there when he was elected. $$$$ was there until 2050. \nThink medicare is a success? Ask a physician who must deal with the paperwork and wait for reduced payment or the participant who must wait for services. \nHere in Florida, where \"old\" is originated, no one waits for a doctor. Medicare works pretty well here. No it isn't perfect. Physicians, if they participate with insurance companies agree to accept the \"scale\". You only pay full price when you pay cash. What would you suggest as an alternative? Do your parents already receive a healthcare plan from the government? Medicare? I don't begrudge them at all but it can be enlarged to include the larger population.\n \nYour avatar would lead one to believe that ye are a Vietnam veteran. Why no mention of your VA benefits or efforts to secure them? \n Fortunately I do not have disailities stemming from action in VN. I did use my GI Bill for education. \n Your medical insurance problems will be resolved on the backs of the younger generation as those baby boomers retire en masse. Fewer than 2.5 workers will be available to provide the tax moneys necessary to sustain the program. The solution: Cut benefits or increase taxes on those remaining tax payers. \n I'm not sure what you mean. Are you suggesting it is my fault or my generation's fault for this broken system? Also, what about the more than 25000 injured vets in this war? It appears the man in the white house has disrupted this economy for a long, long time. \n Taxes are a re-occuring theme in your statement. How is the useless \"homeland Security\" financed? How is the war being financed, other than through bonds? Mr. Bush has presumably \"lowered\" taxes when all the while he is digging the tax pit deeper every day for generations to come. So, when a president comes in to attempt to stop the damage, he (she) will be accused of RAISING TAXES. Yet it will be inevitable.\n \n BTW, only the neo-conservatives here are against all of us having some kind of decent, affordable coverage\n \nI don't suppose you would suggest that neocons (or anyone else) are opposed to food, but I don't suppose you would suggest that anyone who does not support universal grocery subsidy is an evil neocon. What about shelter? Universal gubment sponsored housing! Only a neocon would question the cost! \nHuh?\n \n \nSurely food and shelter are more fundamental needs than medical care.\n Yes they are but 47 million Americans are not without food. \nThe problem is not that folks are opposed to others having these things. The problem is how to pay for these big society ideas without raising taxes to an onerous level. \n I wouldn't call health care a \"big society\" idea. I call it a human right. \nAmericans already spend 1/3 of the year at work simply to satisfy their current tax burden. I doubt many of them would be excited to have to work until May or June to satisfy the tax man.\nI agree. But I think we can both agree that there's a few dollars of \"pork\" which could be reduced from the budget before a tax increase to pay for health care would be necessary.", 
   {
    "unicode_changes_made": true
   }, 
   288530, 
   null, 
   1193078700.0
  ], 
  [
   288620, 
   null, 
   "Matthew S", 
   "The funny thing about statistics is that they are data. The statistics I have quoted reflect the total tax burden of the average citizen of Michigan. Your pay check does not constitute a sizable data pool and does not reflect all the taxes you pay. Your real data is not complete. Your figures do not include property taxes, sales taxes, gasoline taxes, tobacco taxes, telephone taxes, local taxes and imbedded taxes. It also does not reflect the payroll taxes paid by your EMPLOYER. Your employer does not pay this tax but merely subtracts it from your total compensation. \n \n I have rather patiently provided you with real-world data I have provided citations and statistics from three separate sources which you have countered with a pay stub. Your pay stub does not negate the previously posted statistics which consistently place Michigan in the ranks of the highest taxed states. The US Census ranks Michigan in the top 20% of taxed states. Your paycheck cannot erase that. \n \n If we take you at your word and assume your provided figures are correct (but adjust the income tax to the current flat-rate of 3.9%, your payroll deductions account for a total of 22.55% of your total income. Lets look at some of the taxes ye missed: \n \n Property Taxes\n \n Property Taxes per $1,000 of Personal Income: This measure. from the U.S. Census Bureau, is probably the best measure of the relative burden of taxes. In fiscal year 1990, Michigan ranked 10th among the 50 states with $47.09 in property taxes per $1,000 of personal income. The national (50-state) average was $35.62. Michigan's high burden also placed it second among the 12 Midwestern states. http://www.educationreport.org/article.aspx?ID=5802\n \n The mathematician in ye will inform you that $47.09 out of every $1,000 = 4.79%. Even if you pay rent to a landlord you are absorbing this tax in increased rent.\n \n 22.55%+4.79% = 27.34%.\n \n Sales Tax:\n \n Here it gets a little tricky. The average Michigander (Michigoose?) pays $781 per year in sales tax. Given that the average per capita income in Michigan is $37,538 the average per capita sales tax expenditure equals 2.0% of the average per capita income.\n \n 22.55%+4.79%+2.0% = 29.34%\n \n Gasoline:\n \n Michigan&#8217;s gasoline tax is a modest $.19875 per gallon. According to the US Department of Energy, the average American consumes 500 gallons of gasoline per year. This means that the average Michigander forks over just about $100 in gas taxes. Add the nearly $100 you pay in federal gasoline taxes and you have another .5% of tax. Factor in the additional costs for 6% sales tax (not factored in the above sales tax calculation) and you reach 0.75%\n \n 22.55% + 4.79% + 2.0% + 0.75% = 30.09%. \n \n Tobacco Tax:\n \n According to the Michigan Tobacco Settlement Filings, as of 2002 there were 2.4 Million smokers in Michigan. Taking the US Department of Health and Human Services data, we can conclude that these smokers consume an average of one pack per day. The Michigan Tobacco Tax (4th highest in the nation) stands at $2.00 per pack. Each day, smokers cough up $4.8 million in tobacco tax or $1,752,000,000 per year. Given the 2006 population of the State of Michigan, we can extrapolate the average per capita cost for the tobacco tax at $175.00. \n \n 22.55% + 4.79% + 2.0% + 0.75% + 0.4%= 30.49%. For a difference of , 7.94% or $2,980 per capita.\n \n Well Matthew, it would appear that I discovered nearly $3,000 worth of taxes you didn&#8217;t realize you were paying. I&#8217;m beginning to understand why you think people should pay more taxes to fund more socialist endeavors. Add in local and municipal taxes, user fees, ad valorem taxes, tolls, utility and telephone taxes, and your percentage will reach those put forth by the US Census Bureau and the Tax Foundation.\n \n If you have real data from a reputable source please put it forward, or at least call me a bigoted neocon. Anything but please do not put your pay check forward as evidence. It makes you look ill-informed and makes this all too easy.\n\n \n \n Are you saying that people in other states don't pay property taxes, sales tax, tabacco tax, or gas taxes?", 
   {}, 
   288576, 
   null, 
   1193094540.0
  ], 
  [
   288624, 
   null, 
   "E Mutz", 
   "Are you saying that people in other states don't pay property taxes, sales tax, tabacco tax, or gas taxes?\n \n No I am saying that they pay less property, sales, tobacco and gas taxes. How could Michigan rank 8th out of 50 if those other states didn't pay those taxes? In the case of property taxes, 40 States pay less. 46 States pay less tobacco tax. The average sales tax is 5% and Michigan's 6% sales tax exceeds that average. Overall, Michiganders pay more than the residents of 42 other states according to the US Census. But next year, the tax burden will rise and Michigan will likely pass up some of those blue states who currently bear a higher tax burden.", 
   {}, 
   288620, 
   null, 
   1193096160.0
  ], 
  [
   289717, 
   null, 
   "jim's trucking", 
   "I, for one, am 100 percent behind universal health care.\nPerhaps you should interview a large group of people from a country that has such already.\n \n You appear to be 100% behind socialism and a big government parent to provide your every need. Let's just put EVERYBODY on welfare.emoticon_rolleyes", 
   {}, 
   288528, 
   null, 
   1194130380.0
  ], 
  [
   289741, 
   null, 
   "Jo Bennett", 
   "Perhaps you should interview a large group of people from a country that has such already.\n \n You appear to be 100% behind socialism and a big government parent to provide your every need. Let's just put EVERYBODY on welfare.emoticon_rolleyes\n\n \n You'd have to look a long way in the UK to find anyone willing to exchange the NHS for the US system. Even the tories are forced to pledge to defend the NHS.", 
   {}, 
   289717, 
   null, 
   1194173940.0
  ], 
  [
   289828, 
   null, 
   "samiinh", 
   "Perhaps you should interview a large group of people from a country that has such already.\n \n You appear to be 100% behind socialism and a big government parent to provide your every need. Let's just put EVERYBODY on welfare.emoticon_rolleyes\n\n \n Makes more sense than the system we have today that just continues to escalate out of sight for many. And if for whatever reason you lose your job, I hope you have lots of money set aside to pay your own way, bud, cause you're going to need it.", 
   {}, 
   289717, 
   null, 
   1194231180.0
  ], 
  [
   289831, 
   null, 
   "E Mutz", 
   "Makes more sense than the system we have today that just continues to escalate out of sight for many. And if for whatever reason you lose your job, I hope you have lots of money set aside to pay your own way, bud, cause you're going to need it.\n\n \n Funny you should mention it. I lost my job in July. I have been paying private insurance since. I pay $231/month for Blue Cross/Blue Shield for a family of three. It is less than the premium I paid when I was working.\n \n Your results may vary...", 
   {}, 
   289828, 
   null, 
   1194232440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Cost of insuring middle-income children's health pales next to war", 
  "url": "http://www.4forums.com/political/politics-debates/10514-cost-insuring-middle-income-childrens-health-pales-next-war.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 10514, 
  "discussion_files": [
   [
    "4733.html", 
    "http://www.4forums.com/political/politics-debates/10514-cost-insuring-middle-income-childrens-health-pales-next-war-print.html"
   ], 
   [
    "4734.html", 
    "http://www.4forums.com/political/politics-debates/10514-cost-insuring-middle-income-childrens-health-pales-next-war-4-print.html"
   ], 
   [
    "4735.html", 
    "http://www.4forums.com/political/politics-debates/10514-cost-insuring-middle-income-childrens-health-pales-next-war-3-print.html"
   ], 
   [
    "4736.html", 
    "http://www.4forums.com/political/politics-debates/10514-cost-insuring-middle-income-childrens-health-pales-next-war-2-print.html"
   ]
  ], 
  "identifier": 10514
 }
]