[
 [
  [
   288706, 
   null, 
   "thedutchdon", 
   "Ok First of all in the constitution it says we have the right to bear arms. It is our right and what if we do outlaw guns? Criminols are gonna have them and could kill us. Statistics show that it is 1 cop for 20,000 people!! it might be just me but i want to be protected at all times and the most effective way!!!!And about the \"accidental Deaths\" by kids not knowing what guns do at a early age.. Schools should have a program [other than dare] that teaches you not to use guns and make up rules if you ever come into contact with one. This gun-control thing is going to far!\n -Student Age: 14 America -", 
   {
    "post_info": {
     "post_title": "Anti-Gun control"
    }
   }, 
   null, 
   null, 
   1193170980.0
  ], 
  [
   288707, 
   null, 
   "forums1234", 
   "you know i think that both have a good outcome. it would be against the 2nd ammendment but then this could happenemoticon_xkill but if u take them then there is less violence", 
   {}, 
   288706, 
   null, 
   1193172060.0
  ], 
  [
   288708, 
   null, 
   "thedutchdon", 
   "yes it is against the second amement yes. But dont u want to be protected at tall times?", 
   {
    "post_info": {
     "post_title": "see"
    }
   }, 
   288707, 
   null, 
   1193172120.0
  ], 
  [
   288709, 
   null, 
   "forums1234", 
   "but yet they wont have guns and neither will you. plus how many times have you used your gun cuz someone was in your house???emoticon_xkill emoticon_cry OUCH!!!", 
   {}, 
   288708, 
   null, 
   1193172240.0
  ], 
  [
   288710, 
   null, 
   "thedutchdon", 
   "Yes i wouldnt have guns but these criminols would cause they do stuff illegaly. And i kno people who have used guns to protect themselves in there homeemoticon_xkill emoticon_xkill emoticon_xkill emoticon_xkill emoticon_xkill emoticon_xkill emoticon_cry", 
   {
    "post_info": {
     "post_title": "dude illegal"
    }
   }, 
   288709, 
   null, 
   1193172300.0
  ], 
  [
   288711, 
   null, 
   "forums1234", 
   "but taking guns away would make the chance shrink of getting broken into:xcensored emoticon_xhoho", 
   {}, 
   288710, 
   null, 
   1193172360.0
  ], 
  [
   288712, 
   null, 
   "jim's trucking", 
   "Gun Control = Holding the gun steady and on target as the trigger is squeezed...\n \n \n Yes I am for good gun control!", 
   {}, 
   288711, 
   null, 
   1193172480.0
  ], 
  [
   288713, 
   null, 
   "thedutchdon", 
   "ok it MIGHT by a few percentage but its been shown that people wo dostuff illegaly kill more. They would use illegal weapons so ur reason is irelivant.emoticon_angry emoticon_xagree", 
   {
    "post_info": {
     "post_title": "umm no?"
    }
   }, 
   288711, 
   null, 
   1193172480.0
  ], 
  [
   288714, 
   null, 
   "forums1234", 
   "it would be easyer to crack down on gangs and so WAY LESS... like down to 8%emoticon_xkill emoticon_cry :telephone dang he just missed the phone", 
   {}, 
   288713, 
   null, 
   1193172660.0
  ], 
  [
   288715, 
   null, 
   "thedutchdon", 
   "Gun Control = Holding the gun steady and on target as the trigger is squeezed...\n \n \n Yes I am for good gun control!\n\n \n Ok dudegun control i ment was takeing guns away", 
   {
    "post_info": {
     "post_title": "quote"
    }
   }, 
   288712, 
   null, 
   1193172720.0
  ], 
  [
   288716, 
   null, 
   "thedutchdon", 
   ":xbanghead :xbanghead :xbanghead :xbanghead \nit would be easyer to crack down on gangs and so WAY LESS... like down to 8%emoticon_xkill emoticon_cry :telephone dang he just missed the phone\n\n \n ok dude gangs wouldnt give their guns up!!! they would keep them because there ILLEGAL", 
   {
    "post_info": {
     "post_title": "!!"
    }
   }, 
   288714, 
   null, 
   1193172780.0
  ], 
  [
   288717, 
   null, 
   "forums1234", 
   "ya like gun control is taking all guns away from private citizens and all guns are controlled by the government and the policeemoticon_xdonno", 
   {}, 
   288715, 
   null, 
   1193172840.0
  ], 
  [
   288719, 
   null, 
   "forums1234", 
   "well barely any gangs go rape someone they would rather have a gang fight...women are more scared of rapists w/ gunsemoticon_xhoho", 
   {}, 
   288717, 
   null, 
   1193172960.0
  ], 
  [
   288720, 
   null, 
   "thedutchdon", 
   "Your missing the point.... Gangs do many things otehr than gang wars...And Women would have a gun so they will protect themselves!!!!emoticon_xkill emoticon_xkill emoticon_love emoticon_cry emoticon_cry emoticon_cry", 
   {
    "post_info": {
     "post_title": "-sigh-"
    }
   }, 
   288719, 
   null, 
   1193173020.0
  ], 
  [
   288721, 
   null, 
   "forums1234", 
   "well i like both for and against because for. i mean taking away guns will make less crime but most gangs wont give up guns both are true but taking away will help", 
   {}, 
   288720, 
   null, 
   1193173200.0
  ], 
  [
   288722, 
   null, 
   "thedutchdon", 
   "AGGHHHHH dude u are contriditiing yourself!!!!!!!!!!! u say they wont take away but takeing away will help !?!?!?!?!?!?!?!?1/!?!!?!?!?!?1?1/ that makes no sense!!!emoticon_angry emoticon_angry emoticon_angry emoticon_angry", 
   {
    "post_info": {
     "post_title": "Contridition"
    }
   }, 
   288721, 
   null, 
   1193173320.0
  ], 
  [
   288723, 
   null, 
   "forums1234", 
   "well true but wats the point in keeping them... how many times do u hear on the news that someone broke in and the person shot them...idk about u but i never hear that. they are normally killedemoticon_xkill emoticon_xkill emoticon_xkill emoticon_xkill emoticon_cry thats wat will happen before u can grab ur gun", 
   {}, 
   288722, 
   null, 
   1193173500.0
  ], 
  [
   288724, 
   null, 
   "thedutchdon", 
   "u kno i have heard that and they had there gun next to there bed..etc so they didnt get kiledemoticon_xkill emoticon_xkill emoticon_xkill emoticon_xkill", 
   {
    "post_info": {
     "post_title": "ok!"
    }
   }, 
   288723, 
   null, 
   1193173500.0
  ], 
  [
   288725, 
   null, 
   "forums1234", 
   "emoticon_xbye wats the point of having one most of the time if they have half a brain they'll be sneaky so u wont wake up so u cant kill them or they'll kill u b4 u wake upemoticon_xkill emoticon_xbye emoticon_cry", 
   {}, 
   288724, 
   null, 
   1193173680.0
  ], 
  [
   288726, 
   null, 
   "Archeron", 
   "DUDE c'mon if the government took guns then eventually we'd be at a technical disadvantage 100 years in the future durin war time!!!emoticon_xkill emoticon_xkill", 
   {}, 
   288724, 
   null, 
   1193173680.0
  ], 
  [
   288727, 
   null, 
   "thedutchdon", 
   "last post for me of the day, Now Gangs arwe stupid they wont be that smart they failed school!!!! this isnt your world GUNS FO LIFE", 
   {
    "post_info": {
     "post_title": "Ok listen"
    }
   }, 
   288726, 
   null, 
   1193173800.0
  ], 
  [
   288728, 
   null, 
   "forums1234", 
   "well of course the military would have guns and they would start recruiting and giving the guns out", 
   {}, 
   288726, 
   null, 
   1193173800.0
  ], 
  [
   288956, 
   null, 
   "thedutchdon", 
   "not exactly..that would suck hunting would be lame cause the guns they \"rent\" out are very lame indeedemoticon_xchicken", 
   {
    "post_info": {
     "post_title": "well..."
    }
   }, 
   288728, 
   null, 
   1193338620.0
  ], 
  [
   288960, 
   null, 
   "Archeron", 
   "besides where would be the Xp for gun use. How would you react if someone just handed you a gun and said,\"kill em all.\"emoticon_xagree", 
   {}, 
   288956, 
   null, 
   1193339160.0
  ], 
  [
   288961, 
   null, 
   "thedutchdon", 
   "i would say \"Who do i kill?\"emoticon_xkill emoticon_xkill emoticon_xkill emoticon_xkill emoticon_xkill", 
   {
    "post_info": {
     "post_title": "ok"
    }
   }, 
   288960, 
   null, 
   1193339220.0
  ], 
  [
   288962, 
   null, 
   "Archeron", 
   "but you wonldnt know how to use a gun. actually firing a gun takes skill and thats what are millitary really needsemoticon_xkill emoticon_xkill = emoticon_xhoho", 
   {}, 
   288961, 
   null, 
   1193339400.0
  ], 
  [
   288963, 
   null, 
   "thedutchdon", 
   "well some people like me have skill with a gun", 
   {
    "post_info": {
     "post_title": "hahaha"
    }
   }, 
   288962, 
   null, 
   1193339400.0
  ], 
  [
   288964, 
   null, 
   "Archeron", 
   "Y are u arguing with me we're on the same side!!!!:xbanghead :xcensored", 
   {}, 
   288963, 
   null, 
   1193339520.0
  ], 
  [
   288965, 
   null, 
   "thedutchdon", 
   "duh i was just saying i can use a gunemoticon_xagree", 
   {
    "post_info": {
     "post_title": "hahaha"
    }
   }, 
   288964, 
   null, 
   1193339580.0
  ], 
  [
   288966, 
   null, 
   "Archeron", 
   "ya ya i know", 
   {}, 
   288965, 
   null, 
   1193339640.0
  ], 
  [
   288967, 
   null, 
   "thedutchdon", 
   "back to the issue at hand. We dont need crappy gun controlemoticon_xkill emoticon_xkill emoticon_xkill emoticon_xkill emoticon_xkill", 
   {
    "post_info": {
     "post_title": "ok well"
    }
   }, 
   288966, 
   null, 
   1193339820.0
  ], 
  [
   288968, 
   null, 
   "Archeron", 
   "AMENemoticon_xangel", 
   {}, 
   288967, 
   null, 
   1193339940.0
  ], 
  [
   288969, 
   null, 
   "thedutchdon", 
   "Anyone Else Wanna Try To Step Up!!!!!!!!", 
   {
    "post_info": {
     "post_title": "ok"
    }
   }, 
   288967, 
   null, 
   1193339940.0
  ], 
  [
   288971, 
   null, 
   "forums1234", 
   "just saying crappy is an opinion you are not supposed to use those in a debate, just facts...anyways how many times have u had to use a gun to defend yourself when someone broke into ur home", 
   {}, 
   288969, 
   null, 
   1193340180.0
  ], 
  [
   288972, 
   null, 
   "Archeron", 
   "none, but knowing my luck right when the gov. takes the ugns a guy breaks into my houseemoticon_emb", 
   {}, 
   288971, 
   null, 
   1193340240.0
  ], 
  [
   288973, 
   null, 
   "thedutchdon", 
   "why in the heck would you thinjk that the government would be able to take guns away from felons?????? the only people that would give away their guns are law-abidding citizens!!!! then crime would go up because the felons would have guns and we would fight them off with bats!!!!!!!!!!!!!!!!!!!!!", 
   {
    "post_info": {
     "post_title": "--jeff--"
    }
   }, 
   288971, 
   null, 
   1193340420.0
  ], 
  [
   288974, 
   null, 
   "Archeron", 
   "somthin like thisemoticon_xkill emoticon_xchicken", 
   {}, 
   288973, 
   null, 
   1193340480.0
  ], 
  [
   288975, 
   null, 
   "forums1234", 
   "law enforcement would be about ten times stronger it would be easier to take em' away...plus felens cant buy guns...:xcensored", 
   {}, 
   288973, 
   null, 
   1193340600.0
  ], 
  [
   288976, 
   null, 
   "thedutchdon", 
   "Ok but they would still have a cashe of weapons hiden somewhere. They would have weapons saved!", 
   {
    "post_info": {
     "post_title": "ok kellen"
    }
   }, 
   288975, 
   null, 
   1193340660.0
  ], 
  [
   288977, 
   null, 
   "Archeron", 
   "How do you think the government would take away the guns????????????????there will always be felons!!!!!emoticon_xagree beet that!", 
   {
    "post_info": {
     "post_title": "-jeff-"
    }
   }, 
   288974, 
   null, 
   1193340720.0
  ], 
  [
   288979, 
   null, 
   "sinjin", 
   "Semiliterate gun enthusiasts scare me.emoticon_xchicken", 
   {}, 
   288977, 
   null, 
   1193341020.0
  ], 
  [
   289091, 
   null, 
   "Aivlis", 
   " Semiliterate gun enthusiasts scare me. \n\n \n Ha!, that should be a bumbersticker!\n \n However, I do not agree with gun control. First of all, it violates the second amendment. Second of all, I wholeheartedly believe in the thinking that guns don't kill people, people kill people. You need to crack down on violence, not guns. Besides, you would just create a black market for guns and it would make the entire situation worse because those who want to lets say rob a liquor store would have a gun and the owner would have a bat...hmm. \n \n I'm not a redneck or a bush-loving republican but violence is the issue not guns!\n \n Vote Ron Paul 2008! (against gun control, against taxes, against North American Union, against abortion unfortunately, for better social security and health care)", 
   {}, 
   288979, 
   null, 
   1193431320.0
  ], 
  [
   289092, 
   null, 
   "jim's trucking", 
   "God help us all!\n emoticon_frazzled", 
   {}, 
   288966, 
   null, 
   1193432580.0
  ], 
  [
   289106, 
   null, 
   "Kabukikmono", 
   "I don't understand how taking away innocent people's only means of protection will help us.", 
   {}, 
   288967, 
   null, 
   1193448000.0
  ], 
  [
   289147, 
   null, 
   "jdgibson", 
   "ya like gun control is taking all guns away from private citizens and all guns are controlled by the government and the policeemoticon_xdonno\n\n \n taking away guns from private citezens would not stop people from keeping them illeagsaemoticon_xkill emoticon_cry emoticon_idea y", 
   {}, 
   288717, 
   null, 
   1193519580.0
  ], 
  [
   289738, 
   null, 
   "Charliegone", 
   "I get into constant arguments with people about this. This is the most common one I get.\n \n \"But I don't feel safe with any one having a gun. Only police officers and security guards should carry and have them.\"\n \n \n First of all, feeling safe is NOT a right...that's a state of mind. It seems people think feeling safe is somehow a right, it's NOT. Self-defense IS a right. That is right granted by the Constitution, specifically the 2nd Amendment. In no where does it say \"only police officers or military, etc\" it says the people! Secondly, citizens with CCW (concealed weapons permits) are just a capable as police officers and security guards. Most if not all CCW holders have to go through some kind of training with firearms. Accidents hardly ever happen. Don't believe me? Look at the stats.", 
   {}, 
   289147, 
   null, 
   1194166740.0
  ], 
  [
   289842, 
   null, 
   "nate895", 
   "Protecting yourself from criminals is only one reason to own a gun (and because they're criminal they don't care about the law so they'll find a gun anyway). An even better reason for the public to be allowed to own weapons is that it protects against government usurpations. It is no coincidence that one of the first things any totalitarian regime does is take away guns. If the government takes your rights and those of others and you don't have a gun, what's the best you can do? Challenge it in court, what if they're in on it? Go and throw rocks at them, they'll just pick you off with 50 calibers. The second amendment and the tenth (as if it is enforced) are the safeguards of your liberty, not the first or any other provision.", 
   {}, 
   289738, 
   null, 
   1194247140.0
  ], 
  [
   289850, 
   null, 
   "JSDKoeln", 
   "I get into constant arguments with people about this. This is the most common one I get.\n \n \"But I don't feel safe with any one having a gun. Only police officers and security guards should carry and have them.\"\n \n \n First of all, feeling safe is NOT a right...that's a state of mind. It seems people think feeling safe is somehow a right, it's NOT. Self-defense IS a right. That is right granted by the Constitution, specifically the 2nd Amendment. In no where does it say \"only police officers or military, etc\" it says the people! Secondly, citizens with CCW (concealed weapons permits) are just a capable as police officers and security guards. Most if not all CCW holders have to go through some kind of training with firearms. Accidents hardly ever happen. Don't believe me? Look at the stats.\n\n \n Ummm \"feeling safe\" is one of the reasons we have so many laws... so, in a sense, feeling safe is a right.\n \n I am neither gun lover nor gun hater. However, a concealed weapon is a concealed weapon. Perhaps a gun owner has some training as to how to fire a gun, but police officers and (hopefully) security guards are trained to protect and uphold a law. Granted no one is perfect, but you cannot compare the training a CCW holder receives with that of the years of academy training a police officer goes through. Millions upon millions of americans go through life without ever firing a gun. Probably the majority of americans. I honestly don't feel it's safe to have someone with a CCW walking around a peaceful neighborhood toting a gun. It's pointless. If a neighborhood is dangerous and the police support is failing, then I can understand. But in anytown USA, I think it's beyond ridiculous.\n \n The constition was written so long ago. I don't think the founders ever imagined a population so big or so many powerful weapons in the circulation. The constitional law was also meant more on the lines of militia. I'm all for hunting and recreational gun useage. But there has to be common sense as to what exactly a real threat is. And, there have been LOTS of accidents... including the bufoonery of our current vice president. There has to be reasonable control. There is no reason to have cop-killing guns in the population. Because of the lack of control laws we let happen, we now have created a larger problem of black market weapons. One has to wonder about the psychological makeup of joe or suzie blo carrying a concealed weapon in anytown USA. I'm sorry, it's more dangerous, not safe.", 
   {}, 
   289738, 
   null, 
   1194264780.0
  ], 
  [
   289916, 
   null, 
   "sinjin", 
   "I know what country I live in and what its Constitution says. My question to gun advocates is why with nearly no guns in many European countries and others, is the crime rate so much lower than ours? Many enjoy most or all the liberties we enjoy with the exception of gun ownership and yet there are simply fewer criminals. If all our guns make us free and safe, how come we're not safe and not any more free? Do we have more outlaws because of our historical relationship with firearms? Is the psychological attachment to the gun the same for both law abiding gun owner and outlaw? Don't both villian and hero intend to prevail by virtue of the gun's power?", 
   {}, 
   289850, 
   null, 
   1194292200.0
  ], 
  [
   289962, 
   null, 
   "nate895", 
   "I know what country I live in and what its Constitution says. My question to gun advocates is why with nearly no guns in many European countries and others, is the crime rate so much lower than ours? Many enjoy most or all the liberties we enjoy with the exception of gun ownership and yet there are simply fewer criminals. If all our guns make us free and safe, how come we're not safe and not any more free? Do we have more outlaws because of our historical relationship with firearms? Is the psychological attachment to the gun the same for both law abiding gun owner and outlaw? Don't both villian and hero intend to prevail by virtue of the gun's power?\n\n \n It's not, and I wouldn't want to live in Europe anyway because by the end of the century Europe will be no more. Besides that they have only slightly lower gun crime, even though they ban guns. I believe in Russia they have banned guns from private possession, yet I know an immigrant from there who says you can find AK's and even an occasional RPG just laying in back alleys ready for any criminal to pick up. I personally hope they're found by revolutionaries who dislike Putin and the Sudo-Soviet government.", 
   {}, 
   289916, 
   null, 
   1194318480.0
  ], 
  [
   289965, 
   null, 
   "smiley", 
   "It's not, and I wouldn't want to live in Europe anyway because by the end of the century Europe will be no more. Besides that they have only slightly lower gun crime, even though they ban guns. I believe in Russia they have banned guns from private possession, yet I know an immigrant from there who says you can find AK's and even an occasional RPG just laying in back alleys ready for any criminal to pick up. I personally hope they're found by revolutionaries who dislike Putin and the Sudo-Soviet government.\n\n \n Wow! This is all news to me.\n \n Europe no more by the end of the century?\n Slightly lower gun crime?\n They've banned guns? (Not everywhere - but even where they haven't gun crime is still a fraction of that in the USemoticon_xkill ).\n \n Okay, I know little about the state of Russian streets, but I would guess that conditions there have something to do with the collapse of the USSR.\n \n Given that the USA seems to be collapsing at the moment, perhaps the same conditions will exist there soon. Then, maybe you will wish you did live in Europe.\n \n Just a thought.\n \n Smiley", 
   {}, 
   289962, 
   null, 
   1194321180.0
  ], 
  [
   289969, 
   null, 
   "Charliegone", 
   "Ummm \"feeling safe\" is one of the reasons we have so many laws... so, in a sense, feeling safe is a right.\n \n I am neither gun lover nor gun hater. However, a concealed weapon is a concealed weapon. Perhaps a gun owner has some training as to how to fire a gun, but police officers and (hopefully) security guards are trained to protect and uphold a law. Granted no one is perfect, but you cannot compare the training a CCW holder receives with that of the years of academy training a police officer goes through. Millions upon millions of americans go through life without ever firing a gun. Probably the majority of americans. I honestly don't feel it's safe to have someone with a CCW walking around a peaceful neighborhood toting a gun. It's pointless. If a neighborhood is dangerous and the police support is failing, then I can understand. But in anytown USA, I think it's beyond ridiculous.\n \n The constition was written so long ago. I don't think the founders ever imagined a population so big or so many powerful weapons in the circulation. The constitional law was also meant more on the lines of militia. I'm all for hunting and recreational gun useage. But there has to be common sense as to what exactly a real threat is. And, there have been LOTS of accidents... including the bufoonery of our current vice president. There has to be reasonable control. There is no reason to have cop-killing guns in the population. Because of the lack of control laws we let happen, we now have created a larger problem of black market weapons. One has to wonder about the psychological makeup of joe or suzie blo carrying a concealed weapon in anytown USA. I'm sorry, it's more dangerous, not safe.\n\n \n So your saying since some things make you afraid we should ban, destroy, etc them? Would you really give up a lot of your rights just to feel safe? \n \n I think you're misunderstanding the concept of CCW. If no one can see it, there is no harm done. I'm sure there are tons of people around where I live with CCW (license) and walking around. It hasn't turned into the OK Corral or anything of that nature. Neither are people freaking out. If you do you're just being paranoid. If you ever take a CCW course you will realize that they take this very seriously. The majority of gun owners are not irresponsible and won't go around toting their guns in front of people because they are ######. \n \n You say police officers are \"better trained?\" That's debatable. I have read lots of stories where police officers were accidentally shot. Although you might not believe it, some police officers tend to forget basic safety protocols, which could result in the death or injury of another person. They are human after all. CCW's holders have to follow the same protocols and probably do so at a higher rate due to public opinion.\n \n Even if it was written long ago, it is still the law of the land. I'm sure the founders never imagined the internet and the MSM..but hey that's legal right? I can understand reasonable controls, but what is reasonable to you might not be reasonable to me and that I guess is the issue. An issue that will be determined by the Supreme Court hopefully this next year (see Washington DC vs Parker.) Also check up on the statistics about gun accidents. Gun accidents are very low compared to drowning, poison and medical procedures. Cop killing guns? What's that?\n \n http://www.optacinternational.com/officersafety/pdfs/WhyAreWeKillingOurselves.pdf", 
   {}, 
   289850, 
   null, 
   1194329760.0
  ], 
  [
   289993, 
   null, 
   "JSDKoeln", 
   "So your saying since some things make you afraid we should ban, destroy, etc them? Would you really give up a lot of your rights just to feel safe? \n \n I think you're misunderstanding the concept of CCW. If no one can see it, there is no harm done. I'm sure there are tons of people around where I live with CCW (license) and walking around. It hasn't turned into the OK Corral or anything of that nature. Neither are people freaking out. If you do you're just being paranoid. If you ever take a CCW course you will realize that they take this very seriously. The majority of gun owners are not irresponsible and won't go around toting their guns in front of people because they are ######. \n \n You say police officers are \"better trained?\" That's debatable. I have read lots of stories where police officers were accidentally shot. Although you might not believe it, some police officers tend to forget basic safety protocols, which could result in the death or injury of another person. They are human after all. CCW's holders have to follow the same protocols and probably do so at a higher rate due to public opinion.\n \n Even if it was written long ago, it is still the law of the land. I'm sure the founders never imagined the internet and the MSM..but hey that's legal right? I can understand reasonable controls, but what is reasonable to you might not be reasonable to me and that I guess is the issue. An issue that will be determined by the Supreme Court hopefully this next year (see Washington DC vs Parker.) Also check up on the statistics about gun accidents. Gun accidents are very low compared to drowning, poison and medical procedures. Cop killing guns? What's that?\n \n http://www.optacinternational.com/officersafety/pdfs/WhyAreWeKillingOurselves.pdf\n\n \n I'm not debating whether or not it's the law of the land. Of course it is and guns certainly will never go away. Even if I thought they should, it would be impossible to find all guns and destroy them. I will never happen.\n \n It's just too easy for anyone to get them. We have to have a license to drive a car, which, in itself, can be a very dangerous weapon. But it's controlled. Guns should be difficult to attain. It's not an infringement on rights. It's common sense. \n \n I have never carried a gun in public and I've lived in some pretty tough neighborhoods that would certainly have warranted it. I just don't see the point. If someone is going to shoot you, that person is going to do it... period. Concealed weapons in suburbia is nonsensical. It's dangerous to everyone around. Despite training you get with the permit, it doesn't take in account the psychological make-up of stressful situations.... or intoxication.... or anything else that might cause someone to pull out a gun. Without proper screening, how can you prevent wacko's from going to the OK Koral... or, rather, high-schools in the US. I would say the rights of the non-gun carrying citizens outweights the rights to carry a concealed weapon. \n \n The right is to be able to carry a gun. However, carrying a gun is a lifestyle choice. It should not put into danger anyone who does not carry a gun. If you're going to carry a gun, you must past a litmus test for psychological stability. \n \n And as an aside, my cousin was and his son is a NYC cop. They served many years on the force, and both were part of the 911 ground zero operations on that horrible day. Their views are similar to mine, and they are both personal gun owners. They understand, more than anybody, the power behind a gun. And yes, the academy training they went through was intense. Accidents are going to happen, but that is what academys are for.... to prevent more accidents from happening. The training provided police officers can't be compared with a night class to get a concealed weapon permit. \n \n There just have to be reasonable limitations and registration and training. Just like anything else in life.", 
   {}, 
   289969, 
   null, 
   1194359580.0
  ], 
  [
   290027, 
   null, 
   "sinjin", 
   "It's not, and I wouldn't want to live in Europe anyway because by the end of the century Europe will be no more. Besides that they have only slightly lower gun crime, even though they ban guns. I believe in Russia they have banned guns from private possession, yet I know an immigrant from there who says you can find AK's and even an occasional RPG just laying in back alleys ready for any criminal to pick up. I personally hope they're found by revolutionaries who dislike Putin and the Sudo-Soviet government.\nI never asked if you personally would want to live in Europe. Have you ever even visited any European countries? \n Russia is going through a hard transition. The rest of Europe is not comparable at present.", 
   {}, 
   289962, 
   null, 
   1194374520.0
  ], 
  [
   290051, 
   null, 
   "nate895", 
   "I never asked if you personally would want to live in Europe. Have you ever even visited any European countries? \n Russia is going through a hard transition. The rest of Europe is not comparable at present.\n\n \n Explain why after a town in Georgia (forgot its name) said every homeowner must have a gun, there crime rate fell by nearly 50%. Still, I want my gun to protect against a totalitarian government more than against criminals.", 
   {}, 
   290027, 
   null, 
   1194392760.0
  ], 
  [
   290056, 
   null, 
   "sinjin", 
   "Explain why after a town in Georgia (forgot its name) said every homeowner must have a gun, there crime rate fell by nearly 50%.\nYou'll have to link the story quoting the 50% crime reduction before I could comment. I will say that where there's no rule of law one might have to arm oneself.\n \nStill, I want my gun to protect against a totalitarian government more than against criminals.\nHow do you propose to take on the government with your light arms?", 
   {}, 
   290051, 
   null, 
   1194397620.0
  ], 
  [
   290070, 
   null, 
   "nate895", 
   "You'll have to link the story quoting the 50% crime reduction before I could comment. I will say that where there's no rule of law one might have to arm oneself.\n How do you propose to take on the government with your light arms?\n\n \n \n This is an older article, but I think it will suffice.\n \n On your other point, how do you think the Colonists did it?", 
   {}, 
   290056, 
   null, 
   1194411780.0
  ], 
  [
   290108, 
   null, 
   "sinjin", 
   "On your other point, how do you think the Colonists did it?\nIn reality not fantasy? Seriously, I don't think you can compare ordinance in 1776 to that which the Nat'l Guard has access to today let alone the regular Army et, al. The Red Coats couldn't vaporize you before you could see the whites of their eyes.", 
   {}, 
   290070, 
   null, 
   1194461340.0
  ], 
  [
   290136, 
   null, 
   "nate895", 
   "In reality not fantasy? Seriously, I don't think you can compare ordinance in 1776 to that which the Nat'l Guard has access to today let alone the regular Army et, al. The Red Coats couldn't vaporize you before you could see the whites of their eyes.\n\n \n If an entire country is plunged into a guerrilla war, modern weapons will be worth nothing. How do you think Afghan Warlords and Iraqi Terrorists hold out? How do you think they would deploy their weapons without destroying everything?", 
   {}, 
   290108, 
   null, 
   1194503700.0
  ], 
  [
   290193, 
   null, 
   "Bryan", 
   "I'm not sure about the futility of resisting modern tyranny with small arms. Now I'm not suggesting that we are imposing tyranny overseas, but here is one point. There are far, far fewer armed terrorists in Iraq than there are armed citizens in America. If the need ever arose for armed resistance, then I don't believe the American resistance fighters would march out into a field, form square like they are about to receive cavalry at Waterloo, and patiently await the B-52 strike.\n \n I know there are people who are ashamed of the RKBA-who want to treat it as the red-headed step-child of the Bill or Rights-who want to keep it locked up in the basement lest it show itself and frighten our more enlightened European neighbors. These same people want to declare that the 2nd. Amendment RKBA constantly hangs in the balance, and they believe they have the moral authority to destroy it the moment they are convinced it is \"no longer needed.\" For those of you who feel that way, here is my answer: \n \n We are a government of laws and not men. I don't have to justify the necessity of having a right to be free from unreasonable search and seizure; a right to free speech, press, and assembly; a right to remain silent, to be free from cruel and unusual punishments; or my right not to be a slave. These rights are recognized by my Constitution, and need no further justification. The 2nd. Amendment is likewise a part of that great charter, and also requires no further justification. I know some of our friends around the world believe we have lost the moral torch of freedom and liberty by our invasion of Iraq. All I can say is we have sunk low indeed when we see persons at home hover over the Constitution with a gleam in their eye and a bottle of white-out in their hand make the self-righteous demand that we are required to justify why they should not go ahead and strike out portions of the document they don't like. \n \n The 2nd. Amendment recognizes an individual RKBA. I challenge anyone to demonstrate otherwise. If you want to prevent your neighbor from owning a gun then be honest about it. Work to amend the RKBA out of the Constitution, and once successful then pass laws denying your fellow man that right. Don't attempt it by deliberately distorting the wording of the amendment to read what you think it should. You only encourage others to rewrite or white-out other portions of the Constitution they don't like. \n \n ---\n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, Lecture II, 1921.", 
   {
    "post_info": {
     "post_title": "The Constitution is all the justification I need"
    }, 
    "unicode_changes_made": true
   }, 
   290136, 
   null, 
   1194561000.0
  ], 
  [
   290209, 
   null, 
   "JSDKoeln", 
   "I'm not sure about the futility of resisting modern tyranny with small arms. Now I'm not suggesting that we are imposing tyranny overseas, but here is one point. There are far, far fewer armed terrorists in Iraq than there are armed citizens in America. If the need ever arose for armed resistance, then I don't believe the American resistance fighters would march out into a field, form square like they are about to receive cavalry at Waterloo, and patiently await the B-52 strike.\n \n I know there are people who are ashamed of the RKBA-who want to treat it as the red-headed step-child of the Bill or Rights-who want to keep it locked up in the basement lest it show itself and frighten our more enlightened European neighbors. These same people want to declare that the 2nd. Amendment RKBA constantly hangs in the balance, and they believe they have the moral authority to destroy it the moment they are convinced it is \"no longer needed.\" For those of you who feel that way, here is my answer: \n \n We are a government of laws and not men. I don't have to justify the necessity of having a right to be free from unreasonable search and seizure; a right to free speech, press, and assembly; a right to remain silent, to be free from cruel and unusual punishments; or my right not to be a slave. These rights are recognized by my Constitution, and need no further justification. The 2nd. Amendment is likewise a part of that great charter, and also requires no further justification. I know some of our friends around the world believe we have lost the moral torch of freedom and liberty by our invasion of Iraq. All I can say is we have sunk low indeed when we see persons at home hover over the Constitution with a gleam in their eye and a bottle of white-out in their hand make the self-righteous demand that we are required to justify why they should not go ahead and strike out portions of the document they don't like. \n \n The 2nd. Amendment recognizes an individual RKBA. I challenge anyone to demonstrate otherwise. If you want to prevent your neighbor from owning a gun then be honest about it. Work to amend the RKBA out of the Constitution, and once successful then pass laws denying your fellow man that right. Don't attempt it by deliberately distorting the wording of the amendment to read what you think it should. You only encourage others to rewrite or white-out other portions of the Constitution they don't like. \n \n ---\n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, Lecture II, 1921.\n\n \n You have obviously used \"white out\" on the word \"militia\" in the second amendment.\n \n Interpret it as you will, but it's run amok. And, also, the original constitution said blacks were ummmm, what was the fraction of a human being? Selective memory?\n \n The second amendment needs amending, like much of the constitution already has had. It's called constitutional evolution. It's called meeting the needs of the current society. It is different now from the 1700s and it will be different in the 2200s. \n \n Guns are here to stay. We might as well figure out how to regulate them, keep them from lunatics, have intense training as to the impact of guns and their useage, and get them out of criminals hands. Having open gun sales events with limited background checks does not acheive this. Why would anyone need a semi-automatic to \"protect their family\". Most Americans do not have guns. Go figure...\n \n Keep your rights.... but like anything else deadly in this country, you need a license to operate. I mean, a real license, not some validation from am uber-lobbyist organization.", 
   {
    "unicode_changes_made": true
   }, 
   290193, 
   null, 
   1194566400.0
  ], 
  [
   290220, 
   null, 
   "nate895", 
   "Even if the second amendment was repealed, under which power would the Federal Government be able to take away our weapons. Article I Section 8 says nothing about weapons regulation, and under what power would that be \"necessary and proper\" and the \"general welfare\" clause refers to spending money. So, if they were willing to pay top dollar for guns I suppose they could do it, but they still couldn't force us to give it to them.", 
   {}, 
   290209, 
   null, 
   1194574260.0
  ], 
  [
   290244, 
   null, 
   "Bryan", 
   "I'm sorry, but I don't see how I have \"obviously\" used white-out on the militia clause. Do you really believe that I have avoided it on this blog site? If so, then tell me and we'll discuss it. \n \n If you are looking for a justification for abolishing constitutional provisions, then I suggest you find a better campaign phrase than \"it's run amok.\" It doesn't even sound as dire as the \"emergency\" Mushariff declared as justification for suspending the constitution of Pakistan. I think you'll need to use language a bit stronger than that to achieve the same effect here.\n \n The fraction you refer to was 3/5, and the injustice of slavery was cured by the 13th. Amendment. Which was my point, in case you missed it-If you don't like the RKBA, amend it. \n \n I'm relieved to see you have decided that I can \"keep my rights.\" I intend to. I disagree with your proposal for \"licensing rights.\" I believe it is a dangerous concept. Do you also think I need a \"real\" license before I am allowed to blog here, buy a book, or choose whether or not to attend a church? Are not all these also rights in the Bill of Rights? But perhaps you don't believe the 2nd. Amendment recognizes an individual RKBA. So let me ask this: What do you think the 2nd. Amendment protects? Are you willing to discuss your view on the amendment with me JSDKoeln?", 
   {
    "post_info": {
     "post_title": "An invitation to JSDKoeln"
    }, 
    "unicode_changes_made": true
   }, 
   290220, 
   null, 
   1194587160.0
  ], 
  [
   290377, 
   null, 
   "thecap0", 
   "JSDK,\n \n You have obviously used \"white out\" on the word \"militia\" in the second amendment.\n \n And YOU have obviously used white out on the words \"well regulated\" in 2A.\n \n If you want and need your extension of your own too-small gun, then your country expects you to turn out one weekend a month and 6 weeks every summer for military training so that you can be part of the \"well-regulated militia\" that 2A calls for.emoticon_xgood", 
   {}, 
   290244, 
   null, 
   1194701220.0
  ], 
  [
   290386, 
   null, 
   "E Mutz", 
   "If you want and need your extension of your own too-small gun, then your country expects you to turn out one weekend a month and 6 weeks every summer for military training so that you can be part of the \"well-regulated militia\" that 2A calls for.\n \n Nonsense. There is no such explicit call. Moreover, the drilling you describe did not even become standard for the Guard until the National Defense Act of 1916. \n \n The Founders did not expect droves of citizens to trek un-armed to Camps of Instruction whereat they would be armed. Rather, the populace ALREADY ARMED, would be in a position to act in matters of civil defense. The \"well regulated militia\" was not armed by the gubment sir, they arrived, firearms in hand, ready to assemble into units.", 
   {}, 
   290377, 
   null, 
   1194715560.0
  ], 
  [
   290391, 
   null, 
   "Bryan", 
   "On that note, see also U.S. v. Miller, which is often wrongly cited as a case against the individual RKBA:\n \n \"The signification attributed to the term Militia appears from the debates in the Convention, the history and legislation of the Colonies and the States, and the writings of approved commentators. These show plainly enough that the militia comprised all males physically capable of acting in concert for the common defense. \"A body of citizens enrolled for military discipline.\" And further, that ordinarily when called for service these men were expected to appear bearing arms supplied by themselves and of a kind in common use at the time.\" United States v. Miller, 307 U.S. 174, 179 (1939).\n \n The goal was to ensure an armed populace, and then draw upon the members of that armed populace for the militia.\n \n ---\n \n \"Little more can reasonably be aimed at with respect to the people at large than to have them properly armed and equipped. . . .This will not only lessen the call for military establishments, but if circumstances should at any time oblige the government to form an army of any magnitude that army can never be formidable to the liberties of the people while there is a large body of citizens, little if any inferior to them in discipline and the use of arms, who stand ready to defend their rights and those of their fellow citizens.\" Alexander Hamilton, The Federalist Papers #29, reprinted at page 185 in The Federalist Papers, Mentor Books, 1969, edited by Clinton Rossiter.\n \n \"The power of the sword, say the minority of Pennsylvania, is in the hands of Congress. My friends and countrymen, it is not so, for the powers of the sword are in the hands of the yeomanry of America from sixteen to sixty. The militia of these free commonwealths, entitled and accustomed to their arms, when compared with any possible army, must be tremendous and irresistible. Who are the militia? Are they not ourselves? Is it feared, then, that we shall turn our arms each man against his own bosom? Congress shall have no power to disarm the militia. Their swords and every other terrible implement of the soldier, are the birth-right of an American ....[T]he unlimited power of the sword is not in the hands of either the federal or the state governments, but where I trust in God it will ever remain, in the hands of the People.\" Tench Coxe, Pennsylvania Gazette, Feb. 20, 1788.", 
   {
    "post_info": {
     "post_title": "U.S. v Miller"
    }, 
    "unicode_changes_made": true
   }, 
   290386, 
   null, 
   1194727380.0
  ], 
  [
   290394, 
   null, 
   "nate895", 
   "JSDK,\n \n You have obviously used \"white out\" on the word \"militia\" in the second amendment.\n \n And YOU have obviously used white out on the words \"well regulated\" in 2A.\n \n If you want and need your extension of your own too-small gun, then your country expects you to turn out one weekend a month and 6 weeks every summer for military training so that you can be part of the \"well-regulated militia\" that 2A calls for.emoticon_xgood\n\n \n All males between the ages of 17 and 45 are a member of the militia in the United States.", 
   {}, 
   290377, 
   null, 
   1194729540.0
  ], 
  [
   290541, 
   null, 
   "conservative", 
   "I have been reading this site for a long time, but havent posted in quite a while, and Bryan is much more articulate on the legality aspects than I could ever be. If laws, etc. can't sway you, than maybe common sense can. Guns have become such a large part of todays society that any attempt to ban them would be fruitless. Think back to the Prohibition... it worked great didnt it emoticon_xdonno !! Also, can we generalize that a criminal does not obey laws? Therefore a ban on guns, created through law, would leave innocent, law-abiding citizens with no way to defend themselves from the criminals that disobeyed the ban... emoticon_xkill emoticon_wow", 
   {}, 
   290394, 
   null, 
   1194910320.0
  ], 
  [
   290688, 
   null, 
   "thedutchdon", 
   "We All can just say we dont want gun control right?", 
   {
    "post_info": {
     "post_title": "So"
    }
   }, 
   290541, 
   null, 
   1195069380.0
  ], 
  [
   291151, 
   null, 
   "Seleare", 
   "ok gun control is ok if we needed it! but we really dont we need guns for self defence and stuff... sooo.. yeah...", 
   {}, 
   290688, 
   null, 
   1195604580.0
  ], 
  [
   293955, 
   null, 
   "conofguncontrol", 
   "Don't need guns for self-defence???????????????\n That makes no sense!!!!!!\n so u want there to be guns against crowbars if our government becomes tyrant?\n --thedutchdon1 talking for a second-- \n Ok Did u kno that over half of austerlias population will be destoryed because their government took their guns away?\n This means that their wide open for attacks on other countrys with nukes and guns..\n So ya dont talk if u dont kno what ur talking about \n I strongly believe that guns dont kill people people kill people so take a look at ur family. and the ones u make angry...Cause most people hate each other... emoticon_xkill emoticon_xkill emoticon_xkill emoticon_xkill emoticon_cry emoticon_cry emoticon_cry \n --Thedutchdon1 ends lecture--:xbanghead :xcensored :xcensored \n I agree with this to some extent.... Assualt weapons are used only for killing people. semi-automatic would be all that is nessasary to give us a fighting chance against an attack where ever it may come", 
   {
    "post_info": {
     "post_title": "No Guns? Are you MAD!?!?"
    }
   }, 
   291151, 
   null, 
   1197703560.0
  ], 
  [
   294028, 
   null, 
   "conofguncontrol", 
   "I don't understand why you think that after giving up are guns how we would be remotely threatening to ANYONE. Sure we might scare others who gave up our guns but what is the point in that? And we wouldn't be safe against felons who(wait for it...) wouldn't give up their guns!! I know right now that Seleare is saying,\" But we'll take them from them!\".\n Great. Who is we'll? Do you honestly think that the government is gonna know what to do? And if the government does have this \"miricle plan\" how can they do it without making a law-abbiding citizen retaliate?\n \n \n Seleare, I'm eager to here your reply... emoticon_smile", 
   {
    "post_info": {
     "post_title": "?"
    }
   }, 
   293955, 
   null, 
   1197790560.0
  ], 
  [
   294880, 
   null, 
   "Sirius", 
   "You'll have to link the story quoting the 50% crime reduction before I could comment.\n \n\n \n The town is Kennesaw, Georgia. The home burglary rate didn't drop by 50% though. It dropped by 89%.\n \n I can't yet post links, but my information came from the Wikipedia article on Kennesaw, Georgia. Google also turned up quite a few results.", 
   {}, 
   290056, 
   null, 
   1198432920.0
  ], 
  [
   303908, 
   null, 
   "kesseltron", 
   "I have yet to hear a solid statistic that would lead to a conclusion that less guns means less crime. In fact the vast majority of it leads to the conclusion that an unarmed populus is more suceptable to being murdered than an armed one. For instance, Nazi Germany, Soviet Russia, China, as well as countless small level murder in every other \"civilized\" country on this Earth. I'm afraid you are going to have to base your argument on baseless logic, rather than on that derived from the facts.", 
   {}, 
   288721, 
   null, 
   1204261920.0
  ], 
  [
   303967, 
   null, 
   "flygirl", 
   " taking away guns will make less crime\n\n Criminals love gun control; it makes their jobs safer.Haven't you ever heard the saying, \"A gun in the hand is better than a cop on the phone.\"?", 
   {}, 
   288721, 
   null, 
   1204308360.0
  ], 
  [
   304913, 
   null, 
   "brettbb", 
   "I might not want to carry a concealed weapon in public, but i don't see any reason why I shouldn't be able to own and keep a gun at home, or carry it in my vehicle when I take a long lonesome trip into the country side.", 
   {}, 
   288706, 
   null, 
   1205050860.0
  ], 
  [
   307327, 
   null, 
   "m-249 SAW", 
   "gun control is stupid everything in the world is a weapon if you take a a screwdrider you can stab a person a pencil is weapon too if you drink beer and drive your suv you can kill people too the gun control is aplicable for civilian only not for criminals because they are outlaws", 
   {}, 
   288721, 
   null, 
   1207195740.0
  ], 
  [
   395303, 
   null, 
   "ps3_assassin", 
   ":xbanghead :xbanghead :xbanghead :xbanghead \n \n ok dude gangs wouldnt give their guns up!!! they would keep them because there ILLEGAL\n\n \n yes i agree with this guy. If the whole point of CRIMINALS is to IGNORE laws then what is the point of making the laws that cripple the safety of those of us who follow the laws? Even if the government, through some paradox way, is able to rid the country of ALL guns, a knife, a car, a No.2 pencil, your hands, or pretty much anything you can do damage with will kill somebody just as easily. If guns are banned what of those who make a living by hunting for their food? Those who supply the stores with venison and rabbit? Those who grow your crops? The hunters and the farmers trade with each other so that they can survive through out the rest of the year. These are few of the VERY MANY flaws of Gun \"Control\" laws. emoticon_xagree", 
   {}, 
   288716, 
   null, 
   1269009960.0
  ], 
  [
   395547, 
   null, 
   "zsu2357", 
   "Ok dudegun control i ment was takeing guns away\n\n I am sooo late on this,but I think he knows that.This is sarcasm at its finest,emoticon_rolleyes\n keep up the good work Jim's Trucking.emoticon_xgoodemoticon_xgood", 
   {}, 
   288715, 
   null, 
   1269237240.0
  ], 
  [
   395549, 
   null, 
   "zsu2357", 
   "Semiliterate gun enthusiasts scare me.emoticon_xchicken\n\n sinj. I must agree with you,and if it doesn't sound like a bunch of kids trying to text message,it is humorous.emoticon_xdonnoemoticon_frazzledSo far as I've read.", 
   {}, 
   288979, 
   null, 
   1269237960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Anti-Gun control", 
  "url": "http://www.4forums.com/political/gun-control-debates/10540-anti-gun-control.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 10540, 
  "discussion_files": [
   [
    "12616.html", 
    "http://www.4forums.com/political/gun-control-debates/10540-anti-gun-control-print.html"
   ], 
   [
    "12617.html", 
    "http://www.4forums.com/political/gun-control-debates/10540-anti-gun-control-6-print.html"
   ], 
   [
    "12618.html", 
    "http://www.4forums.com/political/gun-control-debates/10540-anti-gun-control-4-print.html"
   ], 
   [
    "12619.html", 
    "http://www.4forums.com/political/gun-control-debates/10540-anti-gun-control-5-print.html"
   ], 
   [
    "12620.html", 
    "http://www.4forums.com/political/gun-control-debates/10540-anti-gun-control-3-print.html"
   ], 
   [
    "12621.html", 
    "http://www.4forums.com/political/gun-control-debates/10540-anti-gun-control-2-print.html"
   ]
  ], 
  "identifier": 10540
 }
]