[
 [
  [
   289143, 
   null, 
   "wascallywabbit", 
   "**\n On the \"Experts\" thread the example of the eubacterium that has evolved a novel trait, that is, the ability to create an enzyme/protein complex [called 'nylonase']that breaks down nylon waste products into bits that are at least partially digestible, has become a matter of serious interest. Up to now I have not looked into the the phenomenon because it is, to me, clearly an example of the evolution of a novel trait, and clearly an example of the evolution of that trait by Endogenous Adaptive Mutagenesis. However, since the darwinists are using it to promote their notion that adaptive traits are simply the result of fortuitous molecular changes at the genetic level that map coincidentally to organismic/environmental interactions/adaptations at the cellular/organic level, I guess I'll start this new thread so we can all look at this particular case in some detail.\n \n Now, before we start, let us recall that there is a qualitative difference between 'traits' that are strictly chemical and involve changes in molecules within cells, and the 'traits' that are morphological and behavioural that are expressed in such organs as skin, feathers, bones, necks, hearts, eyes, leaves, roots, and on and on. Darwinist/geneticist/materialists, being what they are, try to avoid organic/systemic traits, and instead focus their 'random mutation, spontaneous generation' arguments upon the most mechanical changes they can find, namely physical rearrangements at the molecular level that result in novel chemical chemical properties. The sort of stuff that can be done in test tubes, and such. Pure physical mechanics from chemical reactions. That way they are in their own house, and their ph.d.'s in chemistry and 'molecular biology' give them a terrific advantage over the ordinary person when it comes to argumentation and the sophist tactic known as, 'blind them with science'.\n Molecular changes producing novel chemical properties that operate inside cells, instead of externally, among organs made up of many cells interacting, are most easily detected in very simple lifeforms, and so darwinists almost invariably go to them for their 'support'. They especially love to go to eubacteria. That is why their two favourite warhorses in all the world are the antique microbiological experiments, Luria and Delbruck 1943, and Lederberg and Lederberg 1951. As in those examples, they usually avoid the scientific method, and resort to the arithmetic of statistical correlations in order to make biological assumptions. Maybe its time to turn their arithmetical arguments back on them, for a change?\n \n Which brings me back to the nylon bug. Since in the 'experts' thread mention was made [in a wiki article I cited] of additional information on the subject to be had at certain websites. The only site mentioned there that did have such info was that of the \"New Mexicans for Science and Reason\", \n [ http://www.nmsr.org/sitemap.htm ], a darwinist/materialist ideology promoting action group. So let's start with what they have--\n \n \"My favorite example of a mutation producing new information involves a Japanese bacterium that suffered a frame shift mutation that just happened to allow it to metabolize nylon waste. The new enzymes are very inefficient (having only 2% of the efficiency of the regular enzymes), but do afford the bacteria a whole new ecological niche. They don't work at all on the bacterium's original food - carbohydrates. And this type of mutation has even happened more than once!\"\n \n As we will see later on, there was more to it than just the 'frame shift' genetic mutation, but we'll get to that eventually. In the meantime some people might say {as elec does in the 'experts' thread, --\n \n \"Quote:\n Originally Posted by wascallywabbit \n [To say nothing of the complexity of 'frameshift mutations', per se.] \n \n Complexity? Are you daft? Any addition or deletion of a number of bases that isn't divisible by three results in a frameshift mutation. This is obvious to anybody who can count to three.\" } (BTW, has anyone else noticed the similarity between elec's 'style' [gag me with a spoon!!] and the writing style of \"SLP\", i.e., Scott Page? They must have attended the same schoolyard together.)\n \n To which handwaving the NMSR darwinist author goes on to say the following, with my emphasis added in places--\n \n \n \"So, what is a frame shift mutation?\n \n It happens when a chunk of genetic code (remember those AGTCTAGATCGTATAGC... DNA sequences from Jurassic Park?) is shifted by one or more nucleotides. In DNA, each triplet of nucleotides codes for one amino acid, and each such triplet is called a codon. So, the amino acid Arginine (symbol Arg) is coded by the DNA nucleotide sequence CGT, and also by codons CGA, CGC,CGG, AGA, AGG. Likewise, the amino acid Glutamic Acid (symbol Glu) is coded by the DNA nucleotide sequence GAA, and also by the sequence GAG. There are four types of nucleic acids, which naturally bond in one of two pairs: Thymine/Adenine, and Cytosine/Guanine (T/A and G/C). A thymine (T) on one strand of DNA will bind to an adenine (A) on the paired strand, and so on. There would be 64 different possible amino acids with a three-nucleotide codon (43=64), but several of these are redundant, as shown in the lists above for amino acids Arginine and Glutamic Acid. In biological organisms, there are just 20 different amino acids. Various DNA triplets code for these amino acids, and strings of amino acids form proteins - molecules (such as enzymes) that really do something specific, such as metabolize sugars.\n \n A Frame Shift is a radical mutation in which a single nucleotide is inserted or deleted, causing a shift in the triplets coded by the DNA strand. It's fairly technical, so I'll present what a Frame Shift is by analogy with a different Digital Code, that being the ASCII code used in computers to convert numbers from 0 to 255 into symbols or characters. For example, the ASCII code for the letter \"A\" is 65, which in binary converts to 64+1, or 26 + 1, written thus: 01000000 + 00000001 = 01000001. For this analogy, we'll just be using the first 128 characters, and so we can use just 7 digits: thus, an \"A\" then has the 7-digit code 1000001. A lower case \"a\" is 32 higher than a capital A (which leaves room for 26 letters and a few extra characters), and is thus written 1100001 in 7-digit binary notation (=64+32+1 = 97 in decimal). A \"b\" is written 1100010 in 7-digit binary notation (=64+32+2 = 98). Likewise, a \"d\" is written 1100100 in 7-digit binary notation (=64+32+4 = 100), and an \"e\" is written 1100101 in 7-digit binary notation (=64+32+4+1 = 101).\n \n What has all this to do with Frame Shifts, you ask? In this analogy, actual biological proteins or enzymes (strings of amino acids) correspond to words or phrases (strings of ASCII characters). Individual amino acids (such as Arginine) are analagous to individual ASCII characters (such as the letter \"A\"). Finally, the DNA nucleotides A, T, C and G correspond to the binary digits 0 and 1.\n \n So, let us string together several letters to make a \"digital\" word. The ASCII digital code for the word \"bed\" is made by stringing together the 7-digit codes for b (1100010), e (1100101), and d (1100100) to make one long code: 110001011001011100100.\n \n The image below shows what happens when we apply a Frame Shift to the digital code for bed. Here, we shift the \"reading frame\" by one digit to the left, which requires that we add one extra digit as a prefix. Here, the prefix I chose was the digit 1.\n \n \n The Frame Shift is not a mild mutation. It is HUGE. We still have a 3-letter string, but each letter is different. Shifting the reading frame one digit gives us three NEW characters: q:(1110001), 2 (0110010), and r (1110010).\n \n This particular Frame Shift scrambles the perfectly fine word \"bed\" into the unintelligible, meaningless word \"q2r.\" In this case, the Frame Shift is not only a drastic mutation, but has completely altered the meaning of the word \"bed.\" In this case, at least, information has been \"lost\"or \"degraded,\" just as creationists say will happen ALL THE TIME - EVERY TIME.\"\n \n [Insert-- I do not know what creationists say, and don't care, but I say that organismic information is lost or degraded whenever a genetic mutation arises spontaneously, by _accident_. When such mutations arise _systematically_, as the teleological result of an organism adapting to its environment, they do indeed enhance and add information to that biosystem.]\n \n continue, NMSR--\n [skip]\n \n \"Certainly, MOST frame shifts will destroy information. BUT NOT ALL - and that is where creationists have it wrong. I have shown three examples where such \"Frame Shifts\" indeed create new information. After all, in the proper context, the words \"spy,\" \"USE,\" and \"dab\" actually mean something.\"\n \n [insert-- The sophist fallacy in use here is the equivocation between the words 'create' and 'change', and 'new' and 'different'. There is a big difference between creating something new, and changing something into something that is simply different from what it was, but is still quite familiar.\n In the 'word' analogy, for instance, no new 'words' are created--certain established words are replaced with other established, 'old' words. No 'new' information is created, merely exchanged for other 'old' information. If we are to speak here of a real evolutionary event in which truly 'new' information is created, as opposed to 'old' information being merely 're-cycled', than this 'word' analogy is false and specious. But very popular among darwinists!!]\n \n NMSR cont.--\n \n \"Since their meanings are totally unrelated to the original meanings, it is obvious that, at least in this case, the Frame Shift mutation process has created new information.\"\n \n [Insert-- Something has created 'new information', that is plain, and the frameshift mutation is involved, somehow, but the analogy to 'words', above, does not explain that act of creativity. Words are disfunctional when simply strung together without context. Context gives them meaning, and meaning, in this case is function. This is a blatant attempt to divorce meaning from context and function, in order to advance the 'random generation of novel information' darwinist argument.]\n \n NMSR cont.--\n \n \"It's important to note that context really means something as regards interpretation of these words. For example, if the word \"luz\" was generated, that would mean nothing in English, but it means \"light\" in Spanish. Without a common language and culture, words won't mean anything! It's different with DNA, because the \"context\" in which DNA strands are interpreted is the world of chemical reactions. The \"meaning\" of novel strands of DNA lies in how these strands are transcribed, what the new proteins look like, and (most importantly!) how the proteins react with other molecules, perhaps even affecting the organism's lifestyle.\"\n \n [insert--\n Exactly. Which destroys the 'word' analogy he just finished promoting!]\n \n NMSR cont.--\n \n \"Now, let's get back to Biology, and the case of the bacterium which has evolved the capability of ingesting nylon waste (see Kinoshita et. al.). This case is most interesting. Nylon didn't exist before 1935, and neither did this organism. Detailed examination of the DNA sequences of the original bacterium and of the nylon-ingesting version show identical versions in the gene for a key metabolic enzyme, with only one difference in over 400 nucleotides. However, this single microevolutionary addition of a single thymine ('T') nucleotide caused the new bacterium's enzyme to be composed of a completely novel sequence of amino acids, via the mechanism of frame shifting. The new enzyme is 50 times less efficient than its precursor, as would be expected for a new structure which has not had time to be polished by natural selection. However, this inefficiency would certainly not be expected in the work of an intelligent designer. The genetic mutation that produced this particular irreducibly-complex enzyme probably occurred countless times in the past, and probably was always lethal, until the environment changed, and nylon was introduced.\"\n \n [insert--What is being spun here is that there was just one 'teeny weeny' little molecular insertion. But that is not the truth of it, as we shall see.]\n \n NMSR cont.--\n \n \"The image below shows just a part of the 400+-long nucleotide string for the key enzyme (see the Susumu Ohno paper). The original (\"old\") enzyme's amino acid sequence appears on top, and the frame-shifted (\"new\") sequence on bottom. The DNA nucleotides appear in the middle for both the old species and the new (one T inserted). Over this small portion of the enzyme, the old DNA coded for the amino acids Arginine, Glutamic Acid, Arginine, Threonine, Phenylalanine, Histidine, Arginine and Proline.\n \n \n But the NEW DNA strand, which includes one extra T nucleotide, is shifted, and the new string of amino acids is completely changed. The addition of the thymine nucleotide produces a new Methionine amino acid, which, like the conductor tapping his baton, indicates the Start of a new Protein. This is followed by other new amino acids because of the frame shift: Asparagine, Alanine, Arginine, Serine, Threonine, Glycine and Glutamine. The new string of amino acids - the new protein - is completely different from the original.\"\n \n [insert--And this bears no analogy with the simplistic 'word' example, above. It is much more analogous to writing a whole new book. Except that you do not write an entirely new book by simply inserting a new word into an old text, at random.]\n \n NM<SR cont.--\n \n \"While most frame shifts of such a key enzyme would destroy the enzyme, resulting in immediate death of the organism, this particular protein happened to react with nylon oligomers. And so it was that a drastic mutation suddenly gave an ordinary sugar-eating bacterium the unusual ability to digest nylon, which just happened to be present in abundance in the little waste pond behind a Japanese factory. The Japanese scientists who discovered strange bacterial mats growing in their scum ponds became very interested in this new ability, and finally found it was all due to a single Frame Shift mutation.\" \n \n [insert--Not true. There is more to it. And donch just love the darwinist explanation of evolution that always reduces to, as above, \"It 'just happened', that's all!\".]\n \n NMSR cont.--\n \n \"The new enzyme is not active on common substrates - the bacteria's old \"food\" - and plenty were checked. Whether or not these bacteria retain enzymes to digest their former food source, the fact is that the former food source became much less important because of the new-found ability to ingest food from a novel source - nylon waste.\n \n The creationist argument that all mutations must destroy information is clearly wrong. In this case, a mutation has clearly produced new information. That is, unless you want to quibble that the detailed three-dimensional structure and composition of a protein that reacts specifically to nylon is not \"information.\"\"\n \n [insert- No, but I, who am not a creationist, will \"quibble\" with the darwinist assumption that its creation was randomly generated.]\n \n Break time.", 
   {
    "post_info": {
     "post_title": "The Nylon Bug"
    }
   }, 
   null, 
   null, 
   1193517960.0
  ], 
  [
   289148, 
   null, 
   "wascallywabbit", 
   "**\n In the 'experts' thread the wiki citation suggested that this mutation took place in the eubacterium's chromosomal dna, instead of, as I had every reason to suspect, in its 'plasmid' dna. Apparently I was right all along, it was strictly 'plasmid', as the NMSR site makes clear, below. This is very important because, you see, 'plasmid dna manipulation' is a systemic anomaly confined, as a biological idiosyncrasy [which is not just some, 'quirky mannerism'!!] that is not found outside of eubacteria and a very few other simple organisms.\n \n The ability to mutate their plasmid dna without affecting their chromosomal dna is very important to bacteria. It enables hypermutation and lateral gene transfer, not to mention the whole 'gene splicing' industry, among other things. Obviously such a 'special case' cannot be honestly extended as support for a 'general case' support for a darwinian notion of evolution's universal mechanism, i.e., 'random molecular transformation', but when did intellectual honesty ever concern an evangelical darwinist?\n \n The main point I'm making is that plasmid dna manipulation is systematic with eubacteria, and therefore plasmid dna mutations, however they are accomplished by the bacterium, are not 'random' or 'spontaneous', but are _systematic_ and purposeful. And since we see below, that this trait is connected to plasmid dna mutations, the fact is that the trait is not randomly, spontaneously, accidentally generated, but teleologically, responsively, intentionally, systematically generated. Just like antibiotic resistance. \n \n \n NMSR, cont.--\n \n \"In fact, the plasmid involved in this case is very well known and characterized. Scientists have studied both the original (pre-mutation) plasmid and the novel (post-mutation) plasmid, in great detail. It turns out that the novel plasmid's mutated DNA for production of nylonase is almost identical to a non-coding repetitive DNA sequence on the original plasmid;[skip]\n Was the plasmid slipped in from another bacterium? NO!! The plasmid in question, pOAD2, is just one of three plasmids that are harbored by the bacterium under investigation here, Flavobacterium Sp. K172. Here are some citations to back this up:\n \n \"Sequence analysis of a cryptic plasmid from Flavobacterium sp. KP1, a psychrophilic bacterium,\" Makoto Ashiuchi, Mia Md. Zakaria, Yuriko Sakaguchi, Toshiharu Yagi, FEMS (Federation of European Microbiological Societies) Microbiology Letters 170 (1999), 243-249.\n \n \"Bacteria of genus Flavobacterium, Gram-negative bacteria, are widely distributed in soil and fresh marine waters. Some of them harbor plasmid(s) involved in metabolism of synthetic organic compounds. Flavobacterium sp. K172 harbors plasmids, pOAD1, pOAD2 and pOAD3; pOAD2 (43.6 kbp) encodes nylon oligomer degradation genes.\"\n \"A New Nylon Oligomer Degradation Gene (nylC) on Plasmid pOAD2 from a Flavobacterium sp.,\" Seiji Negoro, Shinji Kakudo, Itaru Urabe, and Hirosuke Okadam, Journal of Bacteriology, Dec. 1992, p. 7948-7953.\n \n \"The EI-encoding gene (F-nylA) and EII-encoding gene (F-nylB) of Flavobacterium sp. K172 are located on plasmid pOAD2 (44 kb), one of the three plasmids harbored in strain K172.\"\n \"Birth of a unique enzyme from an alternative reading frame of the pre-existed, internally repetitious coding sequence\", Susumu Ohno, Proc. Natl. Acad. Sci. USA, Vol. 81, pp. 2421-2425, April 1984. PDF\"\n [skip]\n \n The Bottom Line: Just because this mutation wasn't confined to a cell's main chromosomes does not mean it didn't happen. (A plasmid is defined as a replicon - a replicating piece of DNA - that is inherited in an extrachromosomal state.) \"\n \n [insert--\n I guess that settles the issue that this concerns plasmid dna mutation and not chromosomal dna mutation.] \n \n Break time.", 
   {}, 
   289143, 
   null, 
   1193519940.0
  ], 
  [
   289152, 
   null, 
   "wascallywabbit", 
   "**\n \n The wiki article on the nylon bug says there were three separate mutations involved. Othersa say there were only two. The NMSR article quoted so far acts as if therecwere only one, the frameshift mutation. The wewll-known scientist, Lee Spetner, picks up on this dishonesty--\n \n NMSR cont.--\n \n \"UPDATE: Lee Spetner, author of \"Not By Chance\" comments on \"TheNylon Bug\" on Arthur S. Lodge's website (November 2002)\n \n From http://members.tripod.com/aslodge/id89.htm\n \n \"It's interesting, first of all, that the URL you pointed to picked the \"nylon bug\" as an example of a random mutation yielding a gain of information. (The short answer is, the mutation does yield an increase of information, but was it random?) . ... Let me point out two important facts that the URL [www.nmsr.org/nylon.htm] ignores. First, there are two altered enzymes, not just one. Both these enzymes are needed to metabolize the 6-aminohexanoic-acid-cyclic-dimer (6-AHA CD) found in the waste water of the nylon factory. Neither of these enzymes alone is effective. Both are needed. The first enzyme, which I shall call enzyme 1, is 6-aminohexanoic-acid-cyclic-dimer hydrolase (6-AHA CDH) and catalyzes the conversion of 6-AHA CD to 6-aminohexanoic-acid-oligomer (6-AHA LO). The second enzyme, which I shall call enzyme 2, is (6-aminohexanoic-acid-oligomer hydrolase (6-AHA LOH) and catalyzes the conversion of 6-AHA LO to 6-amino-hexanoic acid [Kinoshita et al. 1981]. Only enzyme 2 is the product of a frame shift. Enzyme 1, whose DNA sequence I have not seen, is probably the product of only point mutations. [Okada et al. 1983, Ohno 1984] \n Second, enzyme 2 is not just the product of a frame shift, it is also the product of 140 point mutations. Many of these mutations are silent, but many are not. 47 amino acids out of 392 of the enzyme have been changed. \n \n It seems to me that many of these altered amino acids are essential to the catalytic effect of the enzyme. How many, I don't know. In my above cited letter to Jim, I calculated the probability of getting multiple random mutations in the 30 years it took to evolve these enzymes. If the evolution of this enzyme had to rely on random point mutations, it could have never evolved. Thus, if only 6 of these 47 mutations were essential for the evolution, the probability of achieving it in 30 years is about 3 x 10 -35. So, if the evolution could not be random, then it would have to be nonrandom, and as I have suggested in my book, they would be triggered by the environment. That is, the capability is built into the bacterium and the environment triggers the mutations.\n \n I have ignored the evolution of enzyme 1, and the random evolution of that enzyme makes for an even less probable event.\n \n Now, why should there be a built-in capability to metabolize nylon, which did not exist until 1937 or so? The answer is there shouldn't be. But there could have been a built-in capability to metabolize some other substrate. Kinoshita et al. (1981) tested enzyme 2 against 50 possible substrates and found no activity, but that does not mean that it doesn't have activity on some substrate not tested. The activity of enzyme 2 was small, but enabled the bacteria to metabolize the nylon waste. \"\n \n **\n \n Random? If you believe in magic, sure.", 
   {}, 
   289148, 
   null, 
   1193522580.0
  ], 
  [
   289157, 
   null, 
   "wascallywabbit", 
   "**\n \n A bit more on the number of [supposedly] 'random', 'spontaneous' mutations involved in the evolution of the ability to metabolize nylon waste.\n \n \"Some more background, in Flavobacterium there are four nylonase genes, nylA, nylB and nylB' (which are duplicates) and nylC, carried on one plasmid. In Pseudomonas there are two nylonase genes (nyl A and nyl B, homologous to the nylA and nylB genes in Flavobacterium) carried on two different plasmids. \"\n from--http://www.talkorigins.org/origins/postmonth/apr04.html\n \n The link continues with rationalization of the eubacterial heuristic mechanism for molecular adaptation, i.e., its plasmid dna system, as if what that system does is stochastic rather than heuristic, i.e., random rather than systematic.\n The fat-headed pomposity of the ideologue voicing his opinion [Ian Musgrave]is really quite comical.", 
   {}, 
   289152, 
   null, 
   1193530920.0
  ], 
  [
   289221, 
   null, 
   "electrolyte", 
   "You know, I didn't bother reading all of this (it's 3700 words of blah blah blah; wabbit apparently wants people to think he knows what he's talking about, but that requires preventing people from actually reading what he writes), since the vast majority of it is just yanked from the NMSR site. I did read most of wabbit's interjections, though, and there aren't many worth responding to; he doesn't really say much save for stuff like \"I don't believe that this is the case, just because,\" \"See, plasmids are different from chromosomal DNA,\" and \"Darwinists are crazy nutjobs who believe in magic.\" (The last is quite funny for somebody proposing vitality.)\n Except for this one:\n \nNow, before we start, let us recall that there is a qualitative difference between 'traits' that are strictly chemical and involve changes in molecules within cells, and the 'traits' that are morphological and behavioural that are expressed in such organs as skin, feathers, bones, necks, hearts, eyes, leaves, roots, and on and on.\n\n No, there's not. If the latter \"traits\" do not involve differences in molecules within cells, how do these tissues get built and arranged differently? Nevermind, you have your answer to that (magic psychical powers), but not a scientist in the world agrees with you.\n \n Here's what wabbit doesn't know because he doesn't read up like he should. It took one single mutation to produce an enzyme that breaks down nylon -- but very inefficiently. It took other mutations to improve efficiency. No simultaneous mutations are needed. No (dis)analogies of codes and \"words\" are needed to explain this.\n \n I especially like how wabbit presents my statement about frameshift mutations as if it is wrong, then posts a blurb explaining why I'm right. It's a shame he knows nothing about genetics.", 
   {}, 
   289157, 
   null, 
   1193619300.0
  ], 
  [
   289228, 
   null, 
   "electrolyte", 
   "One more thing:\n \nThe wewll-known scientist, Lee Spetner, picks up on this dishonesty--\n\n Of course, when wabbit says \"dishonesty,\" he means \"oversimplification\"; the NMSR webpage is clearly designed for the layperson, not the geneticist. When he says \"scientist,\" he means \"shameless hack.\" Spetner argued that this is not an example of an increase in information until he had it repeatedly and undeniably shown to meet Spetner's own definition of information. Only now has he said, \"Okay, so it's an increase, therefore it's not random.\" Classic moving the goalposts syndrome.\n \n But if wabbit would like to continue leaning on Spetner as a \"reliable source,\" I won't stop him. More fun for me.", 
   {}, 
   289221, 
   null, 
   1193622120.0
  ], 
  [
   289251, 
   null, 
   "martinlb", 
   "question to the darwinists: consider this (from WWspost):\n \n \"It seems to me that many of these altered amino acids are essential to the catalytic effect of the enzyme. How many, I don't know. In my above cited letter to Jim, I calculated the probability of getting multiple random mutations in the 30 years it took to evolve these enzymes. If the evolution of this enzyme had to rely on random point mutations, it could have never evolved. Thus, if only 6 of these 47 mutations were essential for the evolution, the probability of achieving it in 30 years is about 3 x 10 -35. So, if the evolution could not be random, then it would have to be nonrandom, and as I have suggested in my book, they would be triggered by the environment. That is, the capability is built into the bacterium and the environment triggers the mutations.\"\n \n is this right or wrong? And if right doesn't this agree with WWs theory?", 
   {}, 
   289228, 
   null, 
   1193656740.0
  ], 
  [
   289262, 
   null, 
   "electrolyte", 
   "is this right or wrong? And if right doesn't this agree with WWs theory?\n\n Seems I've already answered the first part:\n \nHere's what wabbit doesn't know because he doesn't read up like he should. It took one single mutation to produce an enzyme that breaks down nylon -- but very inefficiently. It took other mutations to improve efficiency. No simultaneous mutations are needed. No (dis)analogies of codes and \"words\" are needed to explain this.\n\n \n As to the second part, it would \"agree\" with wabbit's theory, but that's not saying much. wabbit's theory \"explains\" anything, which means it explains nothing.", 
   {}, 
   289251, 
   null, 
   1193664120.0
  ], 
  [
   289264, 
   null, 
   "Peeling", 
   "The part WW repeatedly avoids explaining satisfactorily is this:\n \n \nI say that organismic information is lost or degraded whenever a genetic mutation arises spontaneously, by _accident_. When such mutations arise _systematically_, as the teleological result of an organism adapting to its environment, they do indeed enhance and add information to that biosystem.]\n\n \n According to WW, precisely the same mutation can lose or degrade 'organismic information', or enhance and add information. How?\n \n When pressed to explain this impossibility, WW invariably contradicts his statement above (read it again: mutations... do indeed enhance and add information to that biosystem) and says instead that the mutation itself is meaningless, a new 'word' which in itself contains no information but only refers to new organismic 'understanding' beyond the genome.\n \n Except that this is clearly and verifiably not the case with the nylonase gene. It simply describes, in the pre-existing protein-synthesis language used by those bacteria for millions of years, the construction of a novel enzyme. There is no reason to believe that it would do anything different regardless of how the gene arose in the first place.\n \n Faced with this logical brick wall across his path, WW recently retreated yet again. He now denies that he ever said an RM-originated gene wouldn't result in the production of the enzyme (he did, several times), and is now hanging everything on the dubious assertion that an organism doesn't truly possess the ability to do something unless it is doing it right now. He would have you believe that a drowning man's inability to breathe air because there isn't any available to him is, in terms of 'traits', on a par with his inability to breathe water.", 
   {}, 
   289251, 
   null, 
   1193664840.0
  ], 
  [
   289300, 
   null, 
   "chemist99a", 
   "question to the darwinists: consider this (from WWspost):\n \n \"It seems to me that many of these altered amino acids are essential to the catalytic effect of the enzyme. How many, I don't know. In my above cited letter to Jim, I calculated the probability of getting multiple random mutations in the 30 years it took to evolve these enzymes. If the evolution of this enzyme had to rely on random point mutations, it could have never evolved. Thus, if only 6 of these 47 mutations were essential for the evolution, the probability of achieving it in 30 years is about 3 x 10 -35. So, if the evolution could not be random, then it would have to be nonrandom, and as I have suggested in my book, they would be triggered by the environment. That is, the capability is built into the bacterium and the environment triggers the mutations.\"\n \n is this right or wrong? And if right doesn't this agree with WWs theory?\n\n \n It may have taken only one or two mutations to achieve some activity against the nylon substrate. IN addition I will bet that your analysis did not consider two confounding features in such probability estimates: \n \n 1) Then number of different paths which might have led to an enzyme with enough activity to provide a selective advantage.\n \n 2) The fact that the mutations need not occurr simultaneously within a single generation.\n \n I also think you may have overlooked the effect of the chemical dump environment on mutational RATES in general (non-directed) and the relative sparseness of the environemnt on the selection ratios for even what would be small advantages in a richer environment.", 
   {}, 
   289251, 
   null, 
   1193701560.0
  ], 
  [
   289331, 
   null, 
   "wascallywabbit", 
   "peeling\n According to WW, precisely the same mutation can lose or degrade 'organismic information', or enhance and add information. How?\n \n When pressed to explain this impossibility, WW invariably contradicts his statement above (read it again: mutations... do indeed enhance and add information to that biosystem) and says instead that the mutation itself is meaningless, a new 'word' which in itself contains no information but only refers to new organismic 'understanding' beyond the genome.\n\n \n \n **\n \" \n From One Gene-One Protein to a More Global Perspective\n \n Only a small percentage of the 3 billion bases in the human genome becomes an expressed gene product. However, of the approximately 1 percent of our genome that is expressed, 40 percent is alternatively spliced to produce multiple proteins from a single gene. Alternative splicing refers to the cutting and pasting of the primary mRNA transcript into various combinations of mature mRNA.[bold mine-ww] Therefore the one gene-one protein theory, originally framed as \"one gene-one enzyme\", does not precisely hold.\"\n \n \"Gene Switching: Turning Genes On and Off\n The estimated number of genes for humans, less than 30,000, is not so different from the 25,300 known genes of Arabidopsis thaliana, commonly called mustard grass. Yet, we appear, at least at first glance, to be a far more complex organism. A person may wonder how this increased complexity is achieved. One answer lies in the regulatory system that turns genes on and off. This system also precisely controls the amount of a gene product that is produced and can further modify the product after it is made. This exquisite control requires multiple regulatory input points. One very efficient point occurs at transcription, such that an mRNA is produced only when a gene product is needed. Cells also regulate gene expression by post-transcriptional modification; by allowing only a subset of the mRNAs to go on to translation; or by restricting translation of specific mRNAs to only when the product is needed. At other levels, cells regulate gene expression through DNA folding, chemical modification of the nucleotide bases, and intricate \"feedback mechanisms\" in which some of the gene's own protein product directs the cell to cease further protein production.\"\n \n \n at-- http://www.ncbi.nlm.nih.gov/About/primer/genetics_genome.html", 
   {
    "unicode_changes_made": true
   }, 
   289300, 
   null, 
   1193753340.0
  ], 
  [
   289336, 
   null, 
   "Peeling", 
   "Only a small percentage of the 3 billion bases in the human genome\n\n \n The nylonase gene is not present in humans, nor is it subject to alternative splicing in the organisms in which it is present. On top of that, if you had read what you quoted more carefully, you would have noticed that even in the case of alternatively spliced genes the codon-<amino acid symbolism remains invariant. The different proteins that are produced via alternative splicing are a bit like those kids books where you can put a different head/body/legs on a person by flipping divided pages.\n \n Block-pasting irrelevant chunks out of online publications doesn't change the salient facts:\n \n 1. You've admitted RM could have been responsible for the origination of the nylonase gene (calling plasmid mutation 'systematic' is misleading: plasmid DNA is every bit as susceptible to RM as chromosomal DNA, so even if bacteria do elevate mutation rates in a plasmid in response to stress, that's only like squeezing an already upturned bottle: same result, just quicker - and while quicker may be better, it's not strictly necessary)\n \n 2. You've apparently admitted (or at least deny that you ever doubted) that an RM nylonase gene would be translated into the nylonase enzyme.\n \n 3. The nylonase enzyme is a chemical catalyst that breaks down nylon waste products and liberates the raw materials therin for the organism to metabolise.\n \n Put these three facts together and you have a de facto agreement on your part that random mutations can originate novel and helpful traits.", 
   {}, 
   289331, 
   null, 
   1193761320.0
  ], 
  [
   289367, 
   null, 
   "electrolyte", 
   "From One Gene-One Protein to a More Global Perspective\n\n Hmm... After being again eviscerated an again unable to even BS a response, we get a post full of nice information that wabbit didn't already know, but (1) the rest of us already did and (2) doesn't help him at all. \n \n Or, to put it succinctly: Oh, look, wabbit's pulled yet another drive-by firing blanks.", 
   {
    "unicode_changes_made": true
   }, 
   289331, 
   null, 
   1193795940.0
  ], 
  [
   289378, 
   null, 
   "wascallywabbit", 
   "[quote]\nThe nylonase gene is not present in humans,\n\n \n **\n Nobody said that it was, so this is a rather weird objection to make. The mention of 'alternative splicing' is made simply to contradict peeling's insistence upon linear, determinist, mechanical, 'one to one' chemical pathways from 'gene' to 'protein', which notion he uses as support for the darwinist assertion that \"random mutations\" in nucleotides can form novel \"genes\"[ a 'gene' defined as _any_ dna biopolymer macromolecule], must lead inevitably to specific novel proteins [such as enzymes] that exhibit specific novel chemical behaviours/reactions with other chemicals. The fact is that there is no such determinist mechanical one-to-one pathway in eukaryotes, and IF there is such an unambiguous pathway in prokaryotes [eg., eubacteria such as the two species that evolved the ability to break down nylon chemicals into digestible components], its existence has yet to be demonstrated, not merely asserted. And most important, IF these bacteria are exceptional, and nylonase is, as peeling insists, the inevitable consequence of the simple appearance of a certain dna molecule, then it is an exceptional case that is not universal across the biosphere, and so the darwinist claim of universal causation of adaptive traits by the mechanical expression of randomly mutated dna molecules is arguing to a universal rule from a special, anomalous, case. And that's a logical no-no.\n \n \n\n nor is it subject to alternative splicing in the organisms in which it is present.\n\n \n **\n See above. Whether or not alternative splicing occurs in prokaryotes, the fact is that it does occur in eukaryotes, and so the darwinist argument to their 'randomly generated, coincidentally adaptive traits' simply does not hold water wrt that segment of the evolving biosphere.Which is not to say that prokaryotes really are the genetic machines that darwinists make them out to be. \n \n \n\n even in the case of alternatively spliced genes the codon-<amino acid symbolism remains invariant. The different proteins that are produced via alternative splicing are a bit like those kids books where you can put a different head/body/legs on a person by flipping divided pages.\n\n \n **\n First, the symbology is not the issue, the product is. Second, \"different head/body/legs\", etc., is 'evolution', and if 'alternative splicing' is truly analogous to \"flipping divided pages\" wrt evolution, then so be it, since those books require intelligent/volitional kids to make them do what they were designed to do.\n \n \n\n Block-pasting irrelevant chunks out of online publications doesn't change the salient facts:\n\n \n **\n Everything posted was pertinent.\n \n \n \n\n 1. You've admitted RM could have been responsible for the origination of the nylonase gene \n\n \n **\n If peeling is trying to say that I have ever been forced to admit that the accidental generation of a randomly assembled dna molecule could, let alone , ever did, lead to a functional protein, [such as the nylonase enzyme ], he is , uhm, incorrect. First, I have never been forced to \"admit\" anything. From the jump I granted that meaningless dna molecules can be randomly generated, and that meaningful dna molecules can be randomly damaged, [i.e., lose meaning]. I have never once so much as implied that an accidentally assembled molecule of dna automatically is meaningful thanks to its mere existence. As a matter of fact, it appears that many, if not most, dna molecules in the genome of whatever organism no longer have any function now, whether or not they ever did. Therefore dna molecules are not essentially, i.e., of their intrinsic nature, meaningful. Meaningless dna molecules can get mutated randomly, but that won't make them meaningful. And wrt codes, meaning is everything.\n \n \n\n (calling plasmid mutation 'systematic' is misleading: plasmid DNA is every bit as susceptible to RM as chromosomal DNA, so even if bacteria do elevate mutation rates in a plasmid in response to stress, that's only like squeezing an already upturned bottle: same result, just quicker - and while quicker may be better, it's not strictly necessary)\n\n \n **\n Anyone who analyses this opinion can see that is senseless. Basically peeling is trying to assert that there is no difference between the make-up and operation of eubacterial plasmid dna and that of their chromosomal dna. At least, no difference that makes a difference, in Bateson's famous phrase. But this all too obviously untrue.\n \n \n\n 2. You've apparently admitted (or at least deny that you ever doubted) that an RM nylonase gene would be translated into the nylonase enzyme.\n\n \n **\n Nope, wrong again. I granted that a certain dna molecule ['gene'] could be translated into a nylonase enzyme. No harm there, since, obviously, that has in fact happened. I have never \"admitted\" that that 'gene' was the product of a random accident. More to the point, I have never \"admitted\" that, given such a molecule, the generation of the nylonase protein would be an inevitable, mechanical consequence of that accident. In fact, I have repeatedly denied so muchas the possibility, and will continue to do so until peelings assertions are become observed facts, instead of metaphysical assumptions.\n \n \n\n 3. The nylonase enzyme is a chemical catalyst that breaks down nylon waste products and liberates the raw materials therin for the organism to metabolise.\n\n \n **\n This much at least, is true.\n \n \n\n Put these three facts together and you have a de facto agreement on your part that random mutations can originate novel and helpful traits.\n\n \n **\n I count one fact and two peelings. Put them together and you get zip.", 
   {}, 
   289336, 
   null, 
   1193800020.0
  ], 
  [
   289387, 
   null, 
   "electrolyte", 
   "The mention of 'alternative splicing' is made simply to contradict peeling's insistence upon linear, determinist, mechanical, 'one to one' chemical pathways from 'gene' to 'protein', which notion he uses as support for the darwinist assertion that \"random mutations\" in nucleotides can form novel \"genes\"[ a 'gene' defined as _any_ dna biopolymer macromolecule], must lead inevitably to specific novel proteins [such as enzymes] that exhibit specific novel chemical behaviours/reactions with other chemicals.\n\n Alternative splicing in no way alters the determining factors of which codon codes for which amino acid. Additionally, you missed many other points, some of which will be addressed below.\n \n \nThe fact is that there is no such determinist mechanical one-to-one pathway in eukaryotes, and IF there is such an unambiguous pathway in prokaryotes [eg., eubacteria such as the two species that evolved the ability to break down nylon chemicals into digestible components], its existence has yet to be demonstrated, not merely asserted.\n\n There is no alternative splicing in prokaryotes, so this does nothing to affect the application of the claims and your statements to this specific example.\n \n \nAnd most important, IF these bacteria are exceptional, and nylonase is, as peeling insists, the inevitable consequence of the simple appearance of a certain dna molecule, then it is an exceptional case that is not universal across the biosphere, and so the darwinist claim of universal causation of adaptive traits by the mechanical expression of randomly mutated dna molecules is arguing to a universal rule from a special, anomalous, case. And that's a logical no-no.\n\n Actually, this is great. You've said, unambiguously (then changed your mind in light of the evidence, then changed your mind back in light of your admission proving your being wrong), that random mutations cannot produce beneficial changes. If this is an example of such, then your assertion is wrong. Simple.\n \n \nWhich is not to say that prokaryotes really are the genetic machines that darwinists make them out to be.\n\n More yucks. First, you go ahead and point out that prokaryotes don't implement alternative splicing. Then, you say that there's no \"one-to-one\" conversion in eukaryotes, which are not prokaryotes. Therefore, we should presume that there isn't really one-to-one conversion in prokaryotes, because there isn't in eukaryotes, even though they're different and prokaryotes don't undergo the process.\n Please tell us more about logic, wabbit.\n \n \nSecond, \"different head/body/legs\", etc., is 'evolution',\n\n Actually, no it's not.\n \n \nEverything posted was pertinent.\n\n Pertinent to the goal of blowing smoke, sure.\n \n \n... I have never once so much as implied that an accidentally assembled molecule of dna automatically is meaningful thanks to its mere existence.\n\n Right, you pretend that a cell won't transcribe and translate DNA just because an amino acid within the coding region of the gene has been changed.\n \n \nTherefore dna molecules are not essentially, i.e., of their intrinsic nature, meaningful. Meaningless dna molecules can get mutated randomly, but that won't make them meaningful.\n\n When they have the correct promotors, then they are meaningful. In the case outlined by NMSR, the promotor region of the gene was unchanged (and therefore intact and functional). You are the only one claiming that the new DNA sequence is meaningless, and you have absolutely no jusification for this claim.\n \n \nAnyone who analyses this opinion can see that is senseless.\n\n Translation: wabbit doesn't understand.\n \n \nBasically peeling is trying to assert that there is no difference between the make-up and operation of eubacterial plasmid dna and that of their chromosomal dna. At least, no difference that makes a difference, in Bateson's famous phrase. But this all too obviously untrue.\n\n If it were \"obviously untrue,\" then it'd be easy to tell us why. But you didn't. Why might that be? Perhaps it's because there's no demonstrable difference in the process of mutation of the two?\n \n \nNope, wrong again. I granted that a certain dna molecule ['gene'] could be translated into a nylonase enzyme.\n\n You dodged what Peeling actually said. In other words, you're still denying that you have no reason for believing that a nylonase gene generated by random mutation -- regardless of whether any such gene was indeed generated by random mutation -- would be transcribed and translated into a nylonase molecule. That is, you're being evasive because Peeling has shown you that when you try to answer questions, you only damage your case.", 
   {}, 
   289378, 
   null, 
   1193810760.0
  ], 
  [
   289395, 
   null, 
   "Peeling", 
   "Nobody said that it was, so this is a rather weird objection to make. The mention of 'alternative splicing' is made simply to contradict peeling's insistence upon linear, determinist, mechanical, 'one to one' chemical pathways from 'gene' to 'protein',\n\n \n That would be 'codon' to 'amino acid', so the point is irrelevant. Unless of course you have evidence that the nylonase gene is being alternatively spliced in order to yield its novel function...?\n \n \nAnd most important, IF these bacteria are exceptional, and nylonase is, as peeling insists, the inevitable consequence of the simple appearance of a certain dna molecule, then it is an exceptional case that is not universal across the biosphere, and so the darwinist claim of universal causation of adaptive traits by the mechanical expression of randomly mutated dna molecules is arguing to a universal rule from a special, anomalous, case. And that's a logical no-no.\n\n \n Again, this is irrelevant. The objective of discussing the nylonase gene is to debunk your claim that RM cannot originate a novel trait, not to prove that all traits were thus originated. You are the one claiming a universal principle here, not me. One exception to your rule is plenty.\n \n \nFrom the jump I granted that meaningless dna molecules can be randomly generated, and that meaningful dna molecules can be randomly damaged, [i.e., lose meaning].\n\n \n In other words, you've admitted the nylonase gene - that specific sequence of nucleotides - could have an RM origin. You just go on to insist that it would be 'meaningless' to the organism parsing it; that it would contain no 'information wrt nylonase'.\n \n In that case, it should be easy for you to show me where information would be missing. Is there information missing from the first codon, which describes (in the language employed by the organism for all its protein synthesis) the first amino acid in nylonase? No? Ok, what about the second? No? Shall we keep going?\n \n \nNope, wrong again. I granted that a certain dna molecule ['gene'] could be translated into a nylonase enzyme. No harm there, since, obviously, that has in fact happened. I have never \"admitted\" that that 'gene' was the product of a random accident.\n\n \n But you have admitted it could have been. An admission of the possibility is perfectly sufficient for my purposes.\n \n \nMore to the point, I have never \"admitted\" that, given such a molecule, the generation of the nylonase protein would be an inevitable, mechanical consequence of that accident.\n\n \n Fair enough - but would you agree that if the organism did translate the molecule in the same way it translates all other molecules during protein synthesis, using the same language of codons symbolising amino acids and start/stop punctuation, it would produce the nylonase enzyme?\n \n Sure, I can't discount the possibility that the organism would make an anomalous, one-off exception to its own rules and translate the DNA differently, but assuming for the moment it didn't, would you agree the nylonase enzyme would be produced?", 
   {}, 
   289378, 
   null, 
   1193830740.0
  ], 
  [
   289403, 
   null, 
   "chemist99a", 
   "In other words, you've admitted the nylonase gene - that specific sequence of nucleotides - could have an RM origin. You just go on to insist that it would be 'meaningless' to the organism parsing it; that it would contain no 'information wrt nylonase'.\n \n In that case, it should be easy for you to show me where information would be missing. Is there information missing from the first codon, which describes (in the language employed by the organism for all its protein synthesis) the first amino acid in nylonase? No? Ok, what about the second? No? Shall we keep going?\n\n \n The meaning has to be found in the relationship to the environment - namely whether or not the gene results in increased fitness. When the relevant nylon related materials are present the mutated gene has meaning. In other circumstances it might not. My point is that \"meaning\" is not something which can be determined independently of context.\n \n It continues to amaze me that creationists attempt to speak of information and meaning in genes as if they could do so in total disregard for the context. Its highly illogical to take the position that genetic information can be evaluated in a context free way.", 
   {}, 
   289395, 
   null, 
   1193836500.0
  ], 
  [
   289433, 
   null, 
   "wascallywabbit", 
   "The meaning has to be found in the relationship to the environment - namely whether or not the gene results in increased fitness. When the relevant nylon related materials are present the mutated gene has meaning. In other circumstances it might not. My point is that \"meaning\" is not something which can be determined independently of context.\n \n It continues to amaze me that creationists attempt to speak of information and meaning in genes as if they could do so in total disregard for the context. Its highly illogical to take the position that genetic information can be evaluated in a context free way.\n\n \n **\n WOW!! I am amazed!! Chemist has supported my argument against that of his fellow darwinist, peeling!! You are right, chemist, context is what counts, not chemicals, when speaking of the evolution of novel adaptive traits. DNA means nothing except in context of the actual morphological or behavioural product, and that product means nothing except in terms of its function, and that function is dependent upon a certain environmental context. ITC, the DNA molecule might be randomly generated, but whether that molecule must necessarily generate a 'nylonase' protein is questionable. Further, what is not questionable is that that protein would NOT breakdown nylon waste where there was no such waste to break down, so that protein, if it existed would be just as meaningless as the dna molecule that generated it. It is ONLY in the context of protein breaking down nylon that the protein becomes an enzyme, and it is only when acting as an enzyme that this protein becomes 'meaningful', because only then does it have a 'relationship' with other chemicals from which information [as opposed to simple data] can be derived. And finally, only when this 'meaningful chemical relationship' becomes a cellular function, that is, when a protein acts as an enzyme 'in order to', teleologically, generatate chemicals than can be metabolized by the cell generating the protein, can we say that that protein, wrt function, serves a purpose, a cellular end or goal. And only when a 'part' [dna, amino acid, protein, cell, organ, whatever] productively serves a purpose, that is, facilitates and furthers the ends and goals of the whole [cell, organism] can we say that it is an adaptive 'trait'[function, capacity, ability, property, whatever], that pertains to that 'whole'.\n \n Peeling recently said that something to the effect that my objection to calling nylonase an adaptive trait before there was any nylon in the world was as if I claimed saying that fish flapping on a beach did not have the trait for breathing underwater because it wasn't underwater. IOW, he likened an organism whose environment has been radically altered to an organism whose traits have been radically altered, which is ridiculous, as there can be no such comparison. Apples and oranges, as they say.\n A much more accurate analogy between any normal fish and 'the nylon bug' would be if, in one generation, a fish in the ocean found that, as a result of randomly mutated dna, it had lost the ability to take oxygen from water by means of gills, and instead had aquired the novel ability to take oxygen from air by means of lungs. And so the mutant fish drowned forthwith, there being no air underwater for it to breathe, and no handy beach for it to crawl up on.\n Breathing air was not an adaptive trait in its case.\n \n \n And while I'm at it, wrt the nylon bug, and contrary to darwinist claims, one simple frameshift DID NOT enable either species of the bacterium involved to metabolize nylon immediately. All it did was diminish the cell's/organism's ability to metabolize normal forage. Without the simultaneous occurence of at least one other mutation [and it seems, from my reading, that in one case at least there may have been as many as 3 others, one of them a duplication] along with the 'frame shift' mutation, the enzymic action, hence the metabolic action, the 'trait', would not have arisen. And we know that it took at least one other besides the 'frameshift'. Even at that, metabolic efficiency is apparently only 2%.\n \n Which is better than the near 0% that would be provided by a 'frameshift' alone. The claim that the frameshift alone, with no other attendant and concomitant mutations, provided sufficient metabolic efficiency to keep the bacterium going until more 'random' mutations came along to increase that metabolic efficiency all the way up to 2% , is patently ridiculous. It's just darwinist/geneticists talking through their hats, claiming that what their philosophy needs to have happened, [because nobody is going to buy the notion of more than one _random_ mutation occuring simultaneously in order to generate one adaptive trait], is what actually did happen. No empirical evidence to that effect necessary, or provided.\n I say that if this were true, some darwinist, somewhere, would have engineered the frameshift mutation without the others, and then observed the fate of his mutant bacteria in the nylon environment, and validated the assertion. I can find no such material, not with my limited resources. If nobody else can, either, then it must be that, for some strange reason, no scientist ever tested the darwinist claim. Or did, but upon testing found that it did not hold up, and so just quietly buried that fact.\n All darwinists are invited to provide material that backs up their claim that their spontaneous frameshift was sufficient to keep the bacterium going until more lucky, accidental, random mutations arrived to help out. No material, no credibility.", 
   {}, 
   289403, 
   null, 
   1193853360.0
  ], 
  [
   289445, 
   null, 
   "wascallywabbit", 
   "\n Quote:\n Originally Posted by wascallywabbit \n Nobody said that it was, so this is a rather weird objection to make. The mention of 'alternative splicing' is made simply to contradict peeling's insistence upon linear, determinist, mechanical, 'one to one' chemical pathways from 'gene' to 'protein', \n \n \n That would be 'codon' to 'amino acid', so the point is irrelevant.\n\n \n **\n Or really?!? How does that change anything pertinent?\n \n \n \n\n Unless of course you have evidence that the nylonase gene is being alternatively spliced in order to yield its novel function...?\n\n \n **\n The assertion of a linear, unequivocal, unambiguous, unambivalent, mechanically determined linear pathway from random nucleotide alteration to adaptive trait is yours to prove, not mine to disprove. You seem to think that the nylon-digesting bacteria strain/s prove this point by reason of their mere existence, but that is just not acceptable. I have cited solid material proving that in eukaryotes such a pathway as you stipulate does not exist. I have no reason to believe that it does exist prokaryotes, specifically eubacteria, particulary the 'nylon bugs'. The mere fact that two different strains of eubacteria arrived at the same adaptive trait [metabolize nylon waste] via distinctly different genetic 'pathways' would seem to support my scepticism in this regard. Also, there is, at least from my layman's understanding, evidence to the effect that prokaryotes, eubacteria, can generate different 'traits' starting from the same dna molecule. If this true for prokaryotes/eubacteria, as it is proven indisputably true for eukaryotes, then your 'molecule-<trait' determinism argument falls to pieces in their case, as well. Including your claim wrt nylonase.\n \n So unless you can demonstrate, somehow, that there is an _inevitable_ chemical pathway between the 'frameshift' mutation and an ability to digest nylon waste sufficient to survival and reproduction, you've got nothing. \n \n \n\n Quote:\n And most important, IF these bacteria are exceptional, and nylonase is, as peeling insists, the inevitable consequence of the simple appearance of a certain dna molecule, then it is an exceptional case that is not universal across the biosphere, and so the darwinist claim of universal causation of adaptive traits by the mechanical expression of randomly mutated dna molecules is arguing to a universal rule from a special, anomalous, case. And that's a logical no-no. \n \n \n Again, this is irrelevant. The objective of discussing the nylonase gene is to debunk your claim that RM cannot originate a novel trait, not to prove that all traits were thus originated. You are the one claiming a universal principle here, not me. One exception to your rule is plenty.\n\n \n **\n True. But you have not yet provided that exception, merely claimed to have found one in the 'nylonase bug'. [BTW, there is no such thing as a 'nylonase gene', for one thing, only a 'nylonase' enzyme.] \n You are claiming that your 'gene', [defined by you as simply a dna macromolecule], IS the protein/enzyme 'nylonase', and that 'nylonase' IS the trait of metabolizing nylon waste. In short, that the molecule is the trait. In which case there is no \"code\" involved, no semiotic \"translation\" anywhere, just a chain of chemical reactions. Which is the materialist position advocated by chemist, among many others.\n \n You cannot have your materialist mechanical genetic determinism and an ambivalent, 'subject to interpretation' genetic 'code' at the same time. But the only way you can have your 'a random genetic mutation can be the random cause of a random organismic effect/trait' 'mechanism' is to prove strict mechanical determinism. Allow any other factor, such as 'interpretation', and the final result/effect/outcome [the trait, in this case the ability to breakdown nylon into digestible bits] is not random/accidental, but systematically induced; even _if_ the molecular transformation of the nucleotide/s involved _might have been_ a random event to start with.\n \n \n\n Quote:\n From the jump I granted that meaningless dna molecules can be randomly generated, and that meaningful dna molecules can be randomly damaged, [i.e., lose meaning]. \n \n \n In other words, you've admitted the nylonase gene - that specific sequence of nucleotides - could have an RM origin.\n\n \n **\n I have always agreed a randomly generated nucleotide, can join with others to form a dna molecule. I haver never agreed that all DNA molecules, simply by the mere fact of their existence, can form 'codons'. Nor that 'codons', by the mere fact of their existence, determine particular and specific proteins. Nor, come to that, that the mere existence of different proteins determines specific and particular organismic traits, not even at the most basic 'molecular', [as opposed to 'organic', 'extra-cellular'], level. So your insinuation voiced here, that being that I agree that a random nucleotide mutation is possible, therefore a random, accidental, adaptive trait is possible, is just more sophist hooey, and the same hooey you've stubbornly repeated for weeks in this forum.\n \n [quote]\n You just go on to insist that it would be 'meaningless' to the organism parsing it; that it would contain no 'information wrt nylonase'.[/quiote]\n \n **\n \"just\"!! Duh!\n \n \n\n In that case, it should be easy for you to show me where information would be missing.\n\n \n **\n I do not have to \"show\" something that is not there, something which is absent. That's illogical. YOU have to show US that what is there is sufficient to justify YOUR claim, and so far your claim has entirely evaded the issue of, 'information', apart from the 'information' we infer from particular chemical reactions, as such. But if that externally inferred 'information' suffices, without any 'internal' cellular interpretation], then there is no 'code', no semiotic information, involved here. Simply molecular, chemical mechanics, no more 'coded' and 'informational' than cracking a nut with a hammer. Which is, in fact, and as pointed out many times, the reductio ad absurdum embraced by materialists wrt organismic evolution.\n \n \n \n\n Is there information missing from the first codon, which describes (in the language employed by the organism for all its protein synthesis) the first amino acid in nylonase? No? Ok, what about the second? No? Shall we keep going?\n\n \n **\n Back to claiming that the amino acid is the protein, and that the protein is the trait, are you? \n \n \n\n Quote:\n Nope, wrong again. I granted that a certain dna molecule ['gene'] could be translated into a nylonase enzyme. No harm there, since, obviously, that has in fact happened. I have never \"admitted\" that that 'gene' was the product of a random accident. \n \n \n But you have admitted it could have been. An admission of the possibility is perfectly sufficient for my purposes.\n\n \n **\n More confusion to blame on your equivocal use of the word, 'gene', whose meaning changes with every different context in which you employ it, therebye confusing me and everyone else. I have never \"admitted\" that a randomly formed dna molecule ['gene'] could be 'translated' into anything \n at all, because I have always insisted that a randomly formed dna molecule is meaningless. You insist that that is not the case, that every dna molecule, random or otherwise, is intrinsically meaningful. But you have absolutely no way to back that up, especially in the face of 'genes' that that do not seem to have any discernible, intrinsic, meaning or function. As far as modern genomics is concerned, 'genes' as dna molecules have no 'meaning' until after the organism/cell bestows one, as a 'function', upon them. \n \n \n\n Quote:\n More to the point, I have never \"admitted\" that, given such a molecule, the generation of the nylonase protein would be an inevitable, mechanical consequence of that accident. \n \n \n Fair enough - but would you agree that if the organism did translate the molecule in the same way it translates all other molecules during protein synthesis, using the same language of codons symbolising amino acids and start/stop punctuation, it would produce the nylonase enzyme?\n\n \n \n **\n What an organism does, it does systematically, not randomly. That alone takes out your 'randomness generates adaptiveness' postulate, which is what this debate is about. Apart from that, no, I have no reason to believe, in light of all the ambiguity discovered in the translation of the genetic code elsewhere, that this bacterial cell would necessarily 'translate' the 'gene' into the same 'trait', even if it does \"translate the molecule in the same way it translates all other molecules during protein synthesis, using the same language of codons symbolising amino acids and start/stop punctuation,...\". IOW, using the same 'language' does not, as I have so often pointed out, mean the same understanding. It is not a linear, unambiguous, unequivocal mechanical process, it is an interpretation of a semiotic sign message. As far as I can tell, so far, there is no mechanical compulsion to even produce the same protein from the same dna molecule, every time and in every context, let alone anything else.\n \n \n\n Sure, I can't discount the possibility that the organism would make an anomalous, one-off exception to its own rules and translate the DNA differently, but assuming for the moment it didn't, would you agree the nylonase enzyme would be produced\n\n \n **\n As above, if it did, the nylonase would no longer be a 'random' product, but an intentional one. But vthe point here is that you are postulating a system of rules that is not at all flexible, one in which 'given dna molecule \"A\", protein \"X\" must be an inevitable, irresistable consequence', and, given the empirical evidence against that premise, I have no reason to believe that that is ever the case, or that it is the case wrt the nylon bugs. You are arguing that a trait can be genetically foreordained, in something like the old calvinist tradition of predestination. I don't believe in predestination, foreordination, mechanical determinism, calvinism, or darwinism, so your assumption cuts no ice with me.", 
   {}, 
   289433, 
   null, 
   1193863200.0
  ], 
  [
   289446, 
   null, 
   "bertvan", 
   "The nylonase enzyme is a chemical catalyst that breaks down nylon waste products and liberates the raw materials therein for the organism to metabolize. \n\n \n Bertvan: Which sounds more believable? A genetic accident which allowed the complex process of breaking down nylon waste products \"just happened\" in the DNA of an organism one day, for no particular reason and, and (surprise!) this accident just happened to occur at a time when nylon waste products were present after billions of years of not even existing? Then \"natural selection\" spread this single accident throughout the population. Or maybe you think this fortuitous accident happened numerous times.\n \n or\n \n Organisms that found themselves around nylon waste products gradually developed an ability to utilize this new waste product as food. Then the organisms reorganized their genome to reflect this new ability?\n \n I assure you science cannot demonstrate which scenario actually happened. The choice is philosophical. If you can't tolerate the concept of intelligent, purposeful response for fear someone might contribute that intelligence to a deity, then you are probably stuck with trying to defend the random accident version. If you can tolerate the possibility that living systems have limited ability to respond purposefully to changes in the environment, and you are indifferent as to whether religious people might see their god participating in the process, you'll probably find the purposeful adaptation version more believable.\n \n http://30415.myauthorsite.com/ (questions about materialism)", 
   {
    "post_info": {
     "post_title": "Which sounds more believable"
    }, 
    "unicode_changes_made": true
   }, 
   289387, 
   null, 
   1193863620.0
  ], 
  [
   289458, 
   null, 
   "chemist99a", 
   "**\n WOW!! I am amazed!! Chemist has supported my argument against that of his fellow darwinist, peeling!! You are right, chemist, context is what counts, not chemicals, when speaking of the evolution of novel adaptive traits. DNA means nothing except in context of the actual morphological or behavioural product, and that product means nothing except in terms of its function, and that function is dependent upon a certain environmental context. ITC, the DNA molecule might be randomly generated, but whether that molecule must necessarily generate a 'nylonase' protein is questionable. Further, what is not questionable is that that protein would NOT breakdown nylon waste where there was no such waste to break down, so that protein, if it existed would be just as meaningless as the dna molecule that generated it. It is ONLY in the context of protein breaking down nylon that the protein becomes an enzyme, and it is only when acting as an enzyme that this protein becomes 'meaningful', because only then does it have a 'relationship' with other chemicals from which information [as opposed to simple data] can be derived. And finally, only when this 'meaningful chemical relationship' becomes a cellular function, that is, when a protein acts as an enzyme 'in order to', teleologically, generatate chemicals than can be metabolized by the cell generating the protein, can we say that that protein, wrt function, serves a purpose, a cellular end or goal. And only when a 'part' [dna, amino acid, protein, cell, organ, whatever] productively serves a purpose, that is, facilitates and furthers the ends and goals of the whole [cell, organism] can we say that it is an adaptive 'trait'[function, capacity, ability, property, whatever], that pertains to that 'whole'.\n \n Peeling recently said that something to the effect that my objection to calling nylonase an adaptive trait before there was any nylon in the world was as if I claimed saying that fish flapping on a beach did not have the trait for breathing underwater because it wasn't underwater. IOW, he likened an organism whose environment has been radically altered to an organism whose traits have been radically altered, which is ridiculous, as there can be no such comparison. Apples and oranges, as they say.\n A much more accurate analogy between any normal fish and 'the nylon bug' would be if, in one generation, a fish in the ocean found that, as a result of randomly mutated dna, it had lost the ability to take oxygen from water by means of gills, and instead had aquired the novel ability to take oxygen from air by means of lungs. And so the mutant fish drowned forthwith, there being no air underwater for it to breathe, and no handy beach for it to crawl up on.\n Breathing air was not an adaptive trait in its case.\n \n \n And while I'm at it, wrt the nylon bug, and contrary to darwinist claims, one simple frameshift DID NOT enable either species of the bacterium involved to metabolize nylon immediately. All it did was diminish the cell's/organism's ability to metabolize normal forage. Without the simultaneous occurence of at least one other mutation [and it seems, from my reading, that in one case at least there may have been as many as 3 others, one of them a duplication] along with the 'frame shift' mutation, the enzymic action, hence the metabolic action, the 'trait', would not have arisen. And we know that it took at least one other besides the 'frameshift'. Even at that, metabolic efficiency is apparently only 2%.\n \n Which is better than the near 0% that would be provided by a 'frameshift' alone. The claim that the frameshift alone, with no other attendant and concomitant mutations, provided sufficient metabolic efficiency to keep the bacterium going until more 'random' mutations came along to increase that metabolic efficiency all the way up to 2% , is patently ridiculous. It's just darwinist/geneticists talking through their hats, claiming that what their philosophy needs to have happened, [because nobody is going to buy the notion of more than one _random_ mutation occuring simultaneously in order to generate one adaptive trait], is what actually did happen. No empirical evidence to that effect necessary, or provided.\n I say that if this were true, some darwinist, somewhere, would have engineered the frameshift mutation without the others, and then observed the fate of his mutant bacteria in the nylon environment, and validated the assertion. I can find no such material, not with my limited resources. If nobody else can, either, then it must be that, for some strange reason, no scientist ever tested the darwinist claim. Or did, but upon testing found that it did not hold up, and so just quietly buried that fact.\n All darwinists are invited to provide material that backs up their claim that their spontaneous frameshift was sufficient to keep the bacterium going until more lucky, accidental, random mutations arrived to help out. No material, no credibility.\n\n \n You miss the point. In spite of emptying your quiver of arrows.", 
   {}, 
   289433, 
   null, 
   1193870700.0
  ], 
  [
   289459, 
   null, 
   "chemist99a", 
   "Bertvan: Which sounds more believable? A genetic accident which allowed the complex process of breaking down nylon waste products \"just happened\" in the DNA of an organism one day, for no particular reason and, and (surprise!) this accident just happened to occur at a time when nylon waste products were present after billions of years of not even existing? Then \"natural selection\" spread this single accident throughout the population. Or maybe you think this fortuitous accident happened numerous times.\n \n or\n \n Organisms that found themselves around nylon waste products gradually developed an ability to utilize this new waste product as food. Then the organisms reorganized their genome to reflect this new ability?\n \n I assure you science cannot demonstrate which scenario actually happened. The choice is philosophical. If you can't tolerate the concept of intelligent, purposeful response for fear someone might contribute that intelligence to a deity, then you are probably stuck with trying to defend the random accident version. If you can tolerate the possibility that living systems have limited ability to respond purposefully to changes in the environment, and you are indifferent as to whether religious people might see their god participating in the process, you'll probably find the purposeful adaptation version more believable.\n \n http://30415.myauthorsite.com/ (questions about materialism)\n\n \n Well you can always make the GOD did it argument. But in this case the evidence supports the mutational theory and fails to support the \"organism learned to metabolize nylon, and then GEed itself in order to do so\" theory. You would never notice the relevant mutation in the absense of the relevant substrate, and probably not even then if the environment was not sparse and demanding. Mutation followed by selection and subsequent expansion of the clone is by far the most believable hypothesis given what we know of biology and of microbiology in particular. And if you wish to believe the alternative hypothesis you probably should have a chat with Lysenko's ghost.emoticon_xchicken emoticon_xchicken", 
   {
    "unicode_changes_made": true
   }, 
   289446, 
   null, 
   1193871120.0
  ], 
  [
   289469, 
   null, 
   "electrolyte", 
   "I assure you science cannot demonstrate which scenario actually happened.\n\n I -- as a scientist and educator -- can assure you that science has plenty to say about which it is. Whether you want to believe the science or cling to the unfalsifiable is philosophical.", 
   {}, 
   289446, 
   null, 
   1193882340.0
  ], 
  [
   289471, 
   null, 
   "electrolyte", 
   "The assertion of a linear, unequivocal, unambiguous, unambivalent, mechanically determined linear pathway from random nucleotide alteration to adaptive trait is yours to prove, not mine to disprove. ... I have no reason to believe that it does exist prokaryotes, specifically eubacteria, particulary the 'nylon bugs'.\n\n Note the backhanded rewording. There is a linear, unequivocal, blah blah blah pathway from nucleotide sequence to protein in prokaryotes regardless of how the sequence arose or whether the protein confers an advantage. Can you at least come out and acknowledge this fact, or are you going to continue being an evasive coward? We'll continue when you can proceed without the equivalent of crossing your fingers behind your back.\n \n But, I'll point this out so you can find this, too, when you go back to looking up the basics in your middle school biology book:\n \n \nYou are claiming that your 'gene', [defined by you as simply a dna macromolecule], IS the protein/enzyme 'nylonase' ...\n\n No, he's not. ... Perchance, are you still in middle school?\n \n \n...and that 'nylonase' IS the trait of metabolizing nylon waste.\n\n Nylonase is the enzyme that performs the reactions. One might consider the \"trait\" to be \"the organism's ability to hydrolyze nylon,\" but you could remove one of your (many) stumbling blocks if you'd just quit trying to explain everything in terms of the \"trait.\"\n \n Why don't you make the rest of us feel a little bit better about your understanding of genetics by briefly telling us what happens to DNA (and resulting molecules) in cells, and why that makes it so important? Again, for somebody who has been squawking loudly for so long without knowing what transcription and translation are to not understand what Peeling has been saying doesn't speak well for your grasp of the material.", 
   {}, 
   289445, 
   null, 
   1193882580.0
  ], 
  [
   289479, 
   null, 
   "wascallywabbit", 
   "**\n Elec bellows--\n \"There is a linear, unequivocal, blah blah blah pathway from nucleotide sequence to protein in prokaryotes regardless of how the sequence arose or whether the protein confers an advantage. Can you at least come out and acknowledge this fact, or are you going to continue being an evasive coward?\". \n \n \n I have no reason to accept as fact that which is nothing but an unproven assertion. If the process is linear, then given a certain nucleotide combined with 2 other particular nucleotides a certain dna molecule must result, and that spe3cific dna molecule _must_ proceed through a translation process which _must_ produce a particular protein, one that possesses specific chemical properties, and that those properties _must_ have a certain function within the biosystem. We already know that this mechanical determinism does not apply to eukaryotes, but elec and the other darwinists are insisting that it does apply to prokaryotes. To date, they have provided no empirical support for their claim.\n \n I have pointed out that if this process is mechanically determinist in prokaryotes then the words 'genetic _code_' do not apply in their case, and only the words, 'mechanically determined chain of chemical reactions' does apply to prokaryotes, [that is, to eubacteria such as the 'nylon bugs'].\n \n Their assertion is that in this case a frameshift mutation that occurred by pure random accident that HAD TO result in a protein whose enzymic action broke down nylon waste so that some of it could be ingested and metabolised by the cell. \n \n If that is true, then what is this respected source talking about?\n \n \"Sequence Analysis is Difficult\"\n \n \"Although it is possibly true in theory that given a protein sequence one can infer its properties, current state of the art in biology falls far short of being able to implement this in practice. Current sequence analysis is a painful compromise between what is desired and what is possible. Some of the many factors which make sequence analysis difficult are discussed in this section.\n [b]As noted above, the difficulty of sequencing proteins means that most protein sequences are determined from the DNA sequences encoding them. Unfortunately, the cellular pathway from DNA to RNA to Protein includes some features that complicates inference of a protein sequence from a DNA sequence.[b] \n \n and\n \n By and large, global, complete solutions are not available for determining an encoded protein sequence from a DNA sequence. \n \n and\n \n Once you have obtained a protein sequence, inferring structure and function represent vastly greater problems. As is noted above, the structure of a protein is produced by the folding of a peptide chain back on itself, and in some cases, the association of multiple peptide chains. This folding can occur as rotation can occur around both bonds within the constituent amino acids as well as the bonds that join the amino acids one to another. Unfortunately (or fortunately, as life depends on this fact), the number of possible folding patterns is effectively infinite. \n \n and\n \n The importance of understanding protein structure comes from two factors working together. The first of these is that the function of the protein is absolutely dependent on its structure. In fact, one of the most common ways for proteins to loose their function is to have their structure disrupted; for example by heat or mechanical stress (e.g. beating an eggwhite); only completely and properly folded proteins \"work\". The second factor is that it is extremely difficult to determine the structure of a protein experimentally[6]. To date, the primary structure of many sequences has been determined (about 30,000). In contrast, the tertiary structure of many fewer (about 500) has been determined. Obviously, then, it would be of great value if tertiary structure could be determined from primary structure. It is not an exaggeration to state that the ability to exactly predict protein structures and, from that, protein function would revolutionize medicine, pharmacology, chemistry and ecology.\n \n and \n \n Finally, even if/when you determine the tertiary structure of a protein, techniques have not yet been developed for inferring the functional properties of this protein from its structure.\"\n \n at-- http://www.biotech.ist.unige.it/bcd/Curric/Introd/ch0.html", 
   {}, 
   289471, 
   null, 
   1193892420.0
  ], 
  [
   289480, 
   null, 
   "electrolyte", 
   "I have no reason to accept as fact that which is nothing but an unproven assertion.\n\n Except, of course, for the fact that one of us has a degree in biochemistry, making that person a credible source, and the other one of us does not. But, ignoring that -- since wabbit ignores those things that he doesn't like -- he's welcome to look it up in any of the sources that he's already acknowledged says that there's no alternative splicing in prokaryotes.\n \n \nWe already know that this mechanical determinism does not apply to eukaryotes, but elec and the other darwinists are insisting that it does apply to prokaryotes. To date, they have provided no empirical support for their claim.\n\n First, when wabbit says that this \"determinism\" doesn't apply to eukaryotes, what he means is that there is not one single possible result. What he won't acknowledge is that there are sometimes a handful of possible results, each one of which will be consistently produced (as opposed to a set of mature exons producing a variation of peptide sequences).\n \n \nI have pointed out that if this process is mechanically determinist in prokaryotes then the words 'genetic _code_' do not apply in their case,\n\n First, you're wrong. The fact that ASCII code mechanistically produces certain characters via sending electrons when entering information in no way renders ASCII not a \"code.\" Again, wabbit is raving about semantics.\n Second, who cares? Address the issue already.\n \n \nTheir assertion is that in this case a frameshift mutation that occurred by pure random accident that HAD TO result in a protein whose enzymic action broke down nylon waste so that some of it could be ingested and metabolised by the cell.\n\n Would you like to complete your thought? This isn't a sentence. Or maybe you shouldn't bother. It's probably just another \"OMG NO EFFIN' WAY, MAN!\"\n \n \nIf that is true, then what is this respected source talking about?\n\n Something that you don't understand.\n There are multiple points being addressed.\n 1. Tertiary structure of a protein cannot be predicted with extreme accuracy from primary structure. Much of your bolded selections refer to this. Too bad it doesn't help you.\n 2. Direct elucidation of a protein's primary structure cannot be done when introns compose parts of the DNA, given our current knowledge. You conveniently excised this part. (Get it, excised? Oh, you probably don't.) However, there are techniques (some of which you again failed to paste) for figuring it out. This doesn't apply to prokaryotes.\n 3. Experimental determination of tertiary structure of proteins is hard to do. (If you'd like to volunteer your time to do it, I know a lab you could look into -- that is, if they find you qualified enough.) How this affects the relationship between DNA and protein is nil.\n 4. Function of a protein cannot be determined from tertiary structure, given our current knowledge. Again, because you don't understand what this is saying, you don't realize that this doesn't help you, either.\n \n So, can we get an explicit acknowledgment or denial that there is a direct relationship between the primary sequence of a protein and its coding DNA sequence in a prokaryote, as any genetics textbook will say? Or are we instead still stuck with your wishy-washy, uninformed inability to make a meaningful statement? At this point, I'll even accept an admission of ignorance of the subject matter.", 
   {}, 
   289479, 
   null, 
   1193898360.0
  ], 
  [
   289481, 
   null, 
   "chemist99a", 
   "\"Sequence Analysis is Difficult\"\n\n \n The author is speaking of computational sequence analysis. We learned to sequence peptides and proteins long before it was possible to sequence nucleic acids. Consider this little machine for example.\n \n http://www.science.ulster.ac.uk/pbrg/images/EDMAN.jpg", 
   {}, 
   289480, 
   null, 
   1193900340.0
  ], 
  [
   289503, 
   null, 
   "Peeling", 
   "Or really?!? How does that change anything pertinent?\n\n It concerns me greatly that you can believe you're making relevant points when statements like this:\n \nI haver never agreed that all DNA molecules, simply by the mere fact of their existence, can form 'codons'. Nor that 'codons', by the mere fact of their existence, determine particular and specific proteins.\n \n and this:\n \nBack to claiming that the amino acid is the protein ... are you?\n\n betray your fundamental lack of basic knowledge about the terminology you're trying to use.\n \n Let's take it from the top.\n \n You know what a nucleotide is, yes? We've likened that to a genetic 'letter', and there are four different letters in the genetic alphabet.\n \n Next, codons. When an organism parses a strand of DNA looking for proteins to synthesise, it reads the nucleotides three at a time. Since there are four letters, there are 4x4x4 = 64 possible thee-letter 'words' it can encounter, which we call 'codons'. However, you must bear in mind that there is no physical delineation between these codons in the DNA strand. DNA is not structured like this:\n \n (GAT)(AGT)(TAG)(TAG)\n \n but like this:\n \n GATAGTTAGTAG\n \n \nI haver never agreed that all DNA molecules, simply by the mere fact of their existence, can form 'codons'.\n\n \n As you can hopefully see, it's foolish to disagree because nucleotides don't have to do anything other than be read by the organism to 'form' codons. Thus an insertion mutation that changes\n \n GATAGTTAGTAG\n \n to\n \n TGATAGTTAGTAG\n \n will result in the organism reading:\n \n TGA TAG TTA GTA\n \n instead of \n \n GAT AGT TAG TAG\n \n Moving on then, what does the organism do with this information? Based on empirical observation, a small number of the 64 possible three-letter words are interpreted as 'start/stop protein construction'. The rest are all interpreted as an instruction to construct one of twenty different amino acids, which are strung together to form a protein.\n \nBack to claiming that the amino acid is the protein ... are you?\n\n As you can see, a protein is a sequence of amino acids determined by the sequence of codons read by the organism during protein synthesis. This is all based on empirical observation.\n \n \nYou are claiming that your 'gene', [defined by you as simply a dna macromolecule], IS the protein/enzyme 'nylonase',\n\n \n For the fifth (sixth? I'm losing count) time, no I'm not. All I'm doing is saying that based on the empirical fact of what the organism does every other time it synthesises a protein, it would synthesise the nylonase enzyme upon reading the RM gene.\n \n \nI have never \"admitted\" that a randomly formed dna molecule ['gene'] could be 'translated' into anything at all, because I have always insisted that a randomly formed dna molecule is meaningless.\n\n \n And every time you say that, I offer to go through the dna molecule one nucleotide at a time so you can point out where information wrt nylonase would be missing if that mutation occurred at random, and every time you bluster and complain and refuse. Surely it should be easy, if the dna molecule is as meaningless as you say. Why won't you do it?\n \n \nApart from that, no, I have no reason to believe, in light of all the ambiguity discovered in the translation of the genetic code elsewhere, that this bacterial cell would necessarily 'translate' the 'gene' into the same 'trait', even if it does \"translate the molecule in the same way it translates all other molecules during protein synthesis, using the same language of codons symbolising amino acids and start/stop punctuation,...\"\n \n But vthe point here is that you are postulating a system of rules that is not at all flexible, one in which 'given dna molecule \"A\", protein \"X\" must be an inevitable, irresistable consequence',\n\n \n WW, look at what the organism is doing. It is translating the molecule the same way it translates all others during protein synthesis, and in doing so it produces the nylonase enzyme. I'm not the one talking in terms of inevitabilities and necessities. You're the one with the universal principle at stake; you're the one saying things are impossible.\n \n Look at the altered molecule - is there anything about it that indicates it couldn't possibly have been a random mutation? No. \n \n Look at the way the organism is translating it - is there anything about that to indicate that the organism has modified the way it translates DNA into proteins in order to produce the nylonase enzyme? No. \n \n So if you can't show the gene wasn't of RM origin, and there's no evidence that the organism is doing anything different in order to produce the enzyme from it, the possibility remains that the production of the enzyme is the deterministic result of a random mutation occurring within that organism.\n \n The 'ambiguity' you've tried to smother this discussion with - none of it is relevant. Several genes equating to the same 'trait' doesn't help you. Not only can several different enzymes degrade nylon waste (thus making a many-to-one gene-<trait mapping inevitable) but the 64 codons-<20 amino acids mapping also makes a many-to-one gene-<protein mapping inevitable. None of this matters - it's all just different ways to skin a cat. The ambiguity you need in order to show that the production of nylonase was not a direct result of the mutation is evidence of one to many gene-<protein mapping. And that you don't got. Without a one to many mapping, you've no evidence of a choice being made. No choice, no cookie for the organism for 'inventing' the trait.", 
   {}, 
   289445, 
   null, 
   1193927340.0
  ], 
  [
   289517, 
   null, 
   "bertvan", 
   "Chemist99a\n if you wish to believe the alternative hypothesis you probably should have a chat with Lysenko's ghost.\n\n \n Bertvan: The alternative hypothesis being that individual living organisms, not their genomes, respond and adapt intelligently and purposefully. Such adaptations are inherited epigenetically as they develop. Used organs develop and unused ones atrophy. Only those adaptations that persist over generations are incorporated into the genome. \n \n Lysenko believed that wheat could be adapted to cold in one generation by treating seeds. Someone else cut the tails off a few generations of mice and announced that acquired characteristics are not heritable. As if anyone thought mutilations might be inherited!! The investigation of the inheritance of acquired characteristics was thus abandoned for over a century, but that is now being remedied with the study of epigenetic inheritance. \n \n ID prediction: The inheritance of acquired characteristics will be confirmed.\n \n http://30145.myauthorsite.com/", 
   {
    "post_info": {
     "post_title": "ID prediction"
    }
   }, 
   289503, 
   null, 
   1193940480.0
  ], 
  [
   289529, 
   null, 
   "Peeling", 
   "Bertvan: The alternative hypothesis being that individual living organisms, not their genomes, respond and adapt intelligently and purposefully.\n\n I don't think anyone's questioning that organisms have - to a greater or lesser extent - the ability to respond and adapt. You're just making the unsupported leap to them being able to intelligently rewrite their own genetic code.\n \nSuch adaptations are inherited epigenetically as they develop. Used organs develop and unused ones atrophy. Only those adaptations that persist over generations are incorporated into the genome. \n\n Sounds so easy and plausible, doesn't it? Except you're rather glossing over the part where an organism somehow reverse-engineers a 'trait' into a 'gene'. Any evidence of the existence of a mechanism for doing that? If you claim it doesn't need one, then how do you explain the evident need for a mechanism to decode DNA?\n \n \nID prediction: The inheritance of acquired characteristics will be confirmed.\n\n \n Your prediction is worthless, because acquired characteristics can be inherited without ID - provided a mechanism already exists to facilitate the acquisition and inheritance of that specific characteristic. Spiny fleas, for instance, have a particular genetic response to predation (they grow a sharp spiny protrusion). The same response is simultaneously triggered within the sex cells they carry, which means their offspring inherit both the triggering system and the trigger. Bingo, inheritance of an acquired characteristic. \n \n However, those fleas don't individually 'decide' to respond to predation in the way they do (if they did, don't you think some of them might try an alternative to the sharp spine? Amazing coincidence, really, that they all try the same trick!). Indeed, it's wrongheaded to think of that sharp spine as an 'acquired characteristic', because the real 'characteristic', the real 'trait' is the predation response of growing the spine. That's what's being inherited. \n \n I'm sure you believe that once upon a time there was a flea that did 'decide' to grow a spiny protrusion, and furthermore 'decided' that it worked so well that its offspring ought to inherit it, and wrote it into its genetic code for all to benefit from. And I'm equally sure you never think critically about how a flea is supposed to know that a spiny thing is a good idea, or how it's supposed to judge whether it has accomplished anything, or how it's supposed to redesign its genetic code.\n \n A bit like the 'snakelike caterpillar' in the 'question for the experts' thread - you believe that a caterpillar can observe (with its atrocious shortsighted vision) and understand (with its all but non-existent insect brain) the snake/bird dynamic, then redesign its phenotype to look like a snake looks to a bird, despite having no clue whatsoever how a bird's vision works. Aye, right ;) \n \n Something else for you to explain: if organisms are intelligently designing phenotypic responses to the environment and then eventually encoding them in the genome, how come these 'encodings' are always small variations on what was already there? That's a staggering coincidence, don't you think? That every phenotypic response an organism has ever 'designed' just happens to correlate to either a minor genetic mutation (never a whole new gene or group of genes) or a recombination of the genes that just happened to be possessed by its parents! Amazing.", 
   {}, 
   289517, 
   null, 
   1193942940.0
  ], 
  [
   289579, 
   null, 
   "chemist99a", 
   "ID prediction: The inheritance of acquired characteristics will be confirmed.\n\n \n ID outcome: Starvation in the old Soviet Union. Imprisonment of dissenters. Loss of a generation or more of productive agricultural research.\n \n I think I will pass on using ID concepts.", 
   {}, 
   289529, 
   null, 
   1193975820.0
  ], 
  [
   289582, 
   null, 
   "wascallywabbit", 
   "**\n \n I stand accused of ignorance in the matter of genetics, biochemistry, molecular biology, microbiology, cellular biology, and on and on. I plead guilty. I do not have a ph.d. in any of those fields. So shoot me.\n \n I have not taken a course in physics, chemistry, or biology since I was in high school in the 1950's, at which time I took one year of each. I have next to no formal education in these subjects, or any other branch of science.\n I have never pretended otherwise.\n For six years, ever since I first joined in the evolution debate at IIDB, I have spoken to the philosophical issues involved in the 'origins' debate. The philosophy is the point; the science is mere support for the philosophy. These forums are not academic forums in which chemists and biologists come to argue arcane points points of chemistry and biology with one another. Anyone who thinks this is in the wrong place. \n \n As a non-scientist arm-chair philosopher, I have researched the internet for science articles that would inform my understanding of 'origins'. I have absolutely no interest in learning any more 'science' than is necessary to an understanding of the issues involved in the 'origins' debate currently taking place between darwinists and the rest of the world.\n \n \n Now, my IQ scores say that I am not a stupid person, and being retired, and not particularly well, I have had a lot of time to debate ideas/opinions and to research various biological papers that bear upon the debate. Not having any formal education in these areas I am limited mostly to those papers written for public consumption, which generally pitched to about a high school level. But that is, or was, all I needed for the philosophical debate, as such.\n \n Of course, many a darwinist has hooted and howled about my lack of formal education in their own specialities, and did so in the most arrogant, pompous, contemptuous, and patronizing terms possible. That's what you do when one of the 'hoi poloi' rips up your opinions and your reasoning. I thank them for their nastiness. They have only themselves to blame that the general public has had enough of their self-superiority, and have begun to despise them for their self-importance, egotism, condescension, and contempt for the rest of us.\n \n Up until recently I have totally avoided genetics for the simple reason that I am here to debate origins, evolution, and not molecular biology. Particularly I did not wish to debate genetics with geneticists, knowing that they would never hesitate to 'blind me with science', and that when they did, I would be in the position of the ant vs the elephant. But recently peeling has drawn me into geneticism, and I find that I must suddenly learn a great deal, starting from scratch, wrt prokaryote genomics and proteomics. Particulary in the case of the 'nylon bugs', i.e., those strains of eubacteria who have originated/evolved new enzymes in order to enable them to metabolize certain bits of nylon waste. This because one philosophical premise I hold to is the axiom, 'nothing can come from nothing, unaided', known as 'ex nihilo, ab nihilo, nihil fit'. Peeling challenged this postulate empirically, claiming that the appearance of the nylon bug is a case of something arising by spontaneous generation, a random genetic mutation which brought about a novel cellular/ organismic function out of nothing, unaided by anything. Creatio ex nihilo, ab nihilo.\n \n His arguments are strictly chemical, mechanical, reductionist and determinist. Typically materialist/darwinist/geneticist. But, they look plausible. So, with great misgivings, I have tried to debate him on his own terms, since he refuses to debate me on mine. Very wise of him, if I may say so.\n \n I started by simply allowing peeling and friends to tell me what genetics were involved. I then went to wiki and other primary educational sources on the web. As I say, I have no reason to suppose myself stupid, but between the web articles and the statements made here by darwinists, particularly peeling, I confess that I am quite confused. But I do not believe that that is my fault. I believe that geneticists just do not seem capable of explaining themselves properly. Why that should be I do not know. I will now attempt to discover where my confusion lies.\n \n Genetics is a branch of Atomism, wherebye the world is reduced, for epistemological reasons, to what are held to be its most elementary , basic, fundamental constituents. [Ironic, innit, that this is 'fundamentalism', as ever was?] Over the past century the elemental 'particles' have been reduced farther and farther, down past the level of 'atoms'. But so far as I can tell, for better or worse, molecular biology/genetics/biochemistry, has not. In fact, even atoms are barely touched upon, the major focus being molecules.\n No matter, we'll start where geneticists do.\n \n Thus we begin with certain atoms forming molecules of sugar which combine with other molecules known as 'bases'. I think these combinations are called nucleosides. I think there are only 4 of them. When a phosphate molecule joins the mix the nucleosides [bases] turn into nucleotides, which are nucleic acids. Which is confusing, at least to me. \n Apparently there are only 4 of these nucleic acids, as well, which makes sense. They are notated as A, C, G, and T. Depending upon how these nucleotides are put together, in 'triplets' of 3 nucleotides apiece, they can take on 64 different combinations, and each combo makes for what is called an amino acid. I do not yet understand how, when, and where this 'combining' happens, as the material is very confusing. Perhaps peeling could clarify this for me. But out of all the many amino acids there could be, mathematically-speaking, only 20 ever actually show up, (and only 12 of those are naturally created by human nucleotides; diet provides the others). Anyway, with 64 combos for just 20 amino acids, there is a lot of redundancy. Very strange chemistry. \n \n So far it's all just 'bits of stuff' forming atomic alliances. No biological 'meaning' or 'significance' to be found to this point. All the same, \n I have probably gone wrong already, so I'll stop here and let peeling correct my misperceptions.", 
   {}, 
   289529, 
   null, 
   1193979840.0
  ], 
  [
   289584, 
   null, 
   "chemist99a", 
   "Thus we begin with certain atoms forming molecules of sugar which combine with other molecules known as 'bases'. I think these combinations are called nucleosides. I think there are only 4 of them. When a phosphate molecule joins the mix the nucleosides [bases] turn into nucleotides, which are nucleic acids. Which is confusing, at least to me.\n Apparently there are only 4 of these nucleic acids, as well, which makes sense. They are notated as A, C, G, and T. Depending upon how these nucleotides are put together, in 'triplets' of 3 nucleotides apiece, they can take on 64 different combinations, and each combo makes for what is called an amino acid. I do not yet understand how, when, and where this 'combining' happens, as the material is very confusing. Perhaps peeling could clarify this for me. But out of all the many amino acids there could be, mathematically-speaking, only 20 ever actually show up, (and only 12 of those are naturally created by human nucleotides; diet provides the others). Anyway, with 64 combos for just 20 amino acids, there is a lot of redundancy. Very strange chemistry.\n\n \n Its not strange when you understand the details. I cannot put those down here. But any textbook descirbine the details of DNA templated protein synthesis mediated by transcribed RNA and the various t-Rnas and Ribosmes to yield specified proteins. Its all standard stuff and not at all weird or strange to biochemists. Nor is it very difficult to understand since its taught at the high school level (and maybe middle school level these days). If you spend a bit of time studying it you will be able to get a much less foggy picture about how all those bits of stuff work on a basic level.\n \n When you get to a more detailed level of course it gets complex in its details as you can see from the chart(s) at:\n \n http://www.genome.ad.jp/dbget-bin/get_pathway?org_name=map&mapno=01021\n \n Suffice it to say materialism is in the details. When you dissect the system down to the molecular level and understand how the machinery works its very clear as to how things get done in living organisms (on earth anyway). These mecahnisms are not much more complicated at their heart than is a clock or an autoengine. Its just that they take place at nanometer scales. You have to bear in mind that people have been working out the process of protein biosynthesis ever since the 1953 Watson and Crick work, Most of the scientists here have ridden along for a lot of the ride and taken the information in as it has been elucidated. Its hard to jump into the current state of knowledge without the chemical background. The chart I referenced will NOT maike sense to you without the necessary background and the reading that entails. I do not intend any offense here, but integrating all of this stuff requires that you build up your knowledge layer by layer. I don't thnk you have even the basic organic chemistry or the zeroth level biochemistry to do it without some help. You have to remember that some here (myself included) are biologists and we have been immersed in this kind of thing for 8 years or so in our formal academics, a few years during postdoctoral work, and after that for much of our professional careers. I too am retired with bad health and time on my hands, but before that I spent some 40 years in the biological science (and chemistry/biochemistry) world of research basic and applied. Such immersion maies this stuff second nature to many of us and we use ideas and concepts that we are not even aware of when discussing the information. Its almost impossibe for most biologists to realize that someone like yourself simply lacks the basis for a common language.\n \n I hope you do not take that personally and its not a comment on your mental capacities, but rather on your life experience and academic studies. If I had not been down the path I have been I do not think I could catch up during my remaining lifetime. Expertise requires a lot of time devoted to gaining it.", 
   {}, 
   289582, 
   null, 
   1193987220.0
  ], 
  [
   289585, 
   null, 
   "electrolyte", 
   "It's late, and I should sleep, but there are several things that need to be pointed out. Whether wabbit finds them harsh is really not my problem.\n \n \nI do not have a ph.d. in any of those fields. So shoot me.\n\n Nor do I. But I do have a degree, and my knowledge of the subject pre-dates my college education because I was not loathe to educate myself about the world. You, on the other hand, have admitted lackluster self-education and an evasion of the topic of genetics. You have demonstrated that evasion time and time again here on 4forums, despite submitting arguments that directly appeal to genetics. This, frankly, is nothing less than absurd.\n Furthermore, despite the fact that 4forums is not described as a haunt for scientists, the fact that people who happen to be scientists and also interested in these topics doesn't disqualify them from posting on these boards. Your apparent appeal to \"philosophy\" in no way erects a screen of protection for your claims. When you paste scientific articles because you think they defend your point of view, you are acknowledging that science is an acceptable method of obtaining knowledge. Yet you reject the science that is shown to contradict your view for no reason other than it contradicts your view. That is -- if you will excuse my use of a non-philosophical term -- a crock.\n \n What is stunning is that you claim that you have read scientific paper after scientific paper regarding these topics, yet you have failed to glean even a rudimentary understanding of genetic processes. Regardless of your personal abhorrence of explaining things on a molecular level, these facts are widely available on the internet, and any honest investigation of related facts would not only bring a researcher to this information but also require that the researcher understand. But -- again, as you've pointed out -- you have consciously avoided educating yourself of this subject. One wonders why somebody with so much time wants to avoid learning about something that is central, instrumental, imperative in the process of organismic development.\n \n The explanation for this, of course, is the typical reason the vast majority of evolution-deniers refuse to admit: they have their answer, and they're trying to find justification for it.\n \n The fact that you dislike the idea of \"materialistic determinism\" in no way, shape, or form reduces the predictive power or descriptive accuracy of chemistry. It is strange that you (presumably, anyway) have no problem with agreeing that water retains the characteristics of a water molecule while in your body -- which is a very-well understood, completely \"materialistic\" property based merely on the physical sciences -- yet you rail against the same causal mechanism (polarity-induced hydrogen bonding) when it happens to occur in genetic material. We never see you arguing that organisms psychically turn water into a nonpolar molecule, but there's exactly as much evidence for that as there is for any of the claims you've been pushing.\n \n \nOf course, many a darwinist has hooted and howled about my lack of formal education in their own specialities, and did so in the most arrogant, pompous, contemptuous, and patronizing terms possible. That's what you do when one of the 'hoi poloi' rips up your opinions and your reasoning. I thank them for their nastiness.\n\n You're quite welcome; you earned every word. You see, we don't point out your lack of formal education, we point out your lack of any reasonable education for somebody who is ranting about the subject. You are by far not qualified to impeach the testimony of a degreed scientist, but the fact that you continue to pretend that you know what you are talking about when you cannot possibly make it any clearer that you haven't the slightest clue. It's nice of you to finally come out and admit it.\n That is to say, you haven't ripped up anything. Perhaps you think you have, but remember, you're the one who has just admitted that you don't know much about genetics. But, I hold a special level of disregard for you, wabbit. It is one thing to be ignorant of a subject, which is to say that one is uneducated about it, whatever the reason for the lack of education. I dislike ignorance and try to eliminate it. But in some cases, the ignorance is willful. No matter what I do, I do not have the power to eliminate willful ignorance. Worse is when there is willful ignorance of a subject despite wanting to discuss said subject. Even worse is willful ignorance of a subject despite wanting to discuss said subject and disagree with experts on said subject. Even worse is willful ignorance of a subject despite wanting to discuss said subject and disagree with experts on said subject and proceeding to question their integrity and intellect with no just cause.\n Until this point, your ignorance of the subject matter has been willful, and you have admitted it. This, of course, is not news to me, which is why I stopped trying to calmly set you straight long ago. My responses to you are merely for my comical enjoyment now. And, let's face it: you have brought it upon yourself.\n \n But, I'll stick my neck out for the mere fact that you seem to perhaps, maybe, just might actually be making an effort. Should this be mere window-dressing for you, I will appear quite the fool for biting. On the other hand, should you pull any of this sort of nonsense again, I'll sleep easy knowing that you got your chance and that the power of willful ignorance overcomes even the most sincere efforts.\n \n \nThus we begin with certain atoms forming molecules of sugar which combine with other molecules known as 'bases'. I think these combinations are called nucleosides. I think there are only 4 of them. When a phosphate molecule joins the mix the nucleosides [bases] turn into nucleotides, which are nucleic acids. Which is confusing, at least to me.\n\n nitrogenous base = \"base\"\n nitrogenous base + sugar = nucleoside\n nitrogenous base + sugar + phosphate = nucleotide\n multiple nucleotides bonded together = nucleic acid\n And while we're at it:\n many amino acids bonded together = protein\n molecule (usually proteins) that aids some reaction = enzyme\n \n \nApparently there are only 4 of these nucleic acids, as well, which makes sense.\n\n Not sure why this \"makes sense.\" I know of no reason that four needs to be the number. It simply happens to be.\n \n \nThey are notated as A, C, G, and T.\n\n There are four bases in DNA, abbreviated A, C, G, and T. In RNA, U exists in lieu of T.\n \n \nDepending upon how these nucleotides are put together, in 'triplets' of 3 nucleotides apiece, they can take on 64 different combinations, and each combo makes for what is called an amino acid.\n\n If you're excuse phrasology like \"to signal\" as words chosen simply to de-emphasize technicalities that are beyond the scope of basic background: Each triplet, called a codon, signals the molecular components to add a certain amino acid to a growing chain of amino acids.\n The \"start\" codon, AUG (which corresponds to ATG in DNA) signals the cellular components to bring in an amino acid called methionine. It is held in place while the next codon signals the machinery to bring in whichever amino acid it calls for. The second amino acid is bonded to the first (methionine), and the components proceed down the string of nucleic acid, reading codons and bonding amino acids to the lengthening strand of amino acids. As this process proceeds, the start end emerges from the construction apparatus and begins contorting itself based on inter- and intra-molecular forces, mainly (*gasp*) polarity and hydrogen bonding. When any one of three \"stop codons\" is read, the construction apparatus brings in the same type of molecule that transfers the amino acid to the growing chain (called transfer RNA or tRNA), but this molecule carries no amino acid. Therefore, no amino acid is added to the chain, and the chain ends. It then completes its folding and -- barring further manipulation, which happens for a few proteins -- the string of amino acids is now a functional protein, many of which are enzymes.\n \n \nI do not yet understand how, when, and where this 'combining' happens, as the material is very confusing. Perhaps peeling could clarify this for me.\n\n A complete description would be technical and somewhat superfluous to the goal of conveying the basics. But, here's a brief description:\n DNA gets \"transcribed,\" creating an RNA molecule that conveys the \"message\" in the DNA. It is therefore called messenger RNA or mRNA. (This is where a sequence of four DNA nucleotides like ATGC would produce an mRNA sequence of AUGC.) Ignoring aspects of alternative splicing -- which is absent in prokaryotes -- a cellular structure called a ribosome encloses the mRNA molecule. The ribosome is actually a combination of smaller RNA molecules, called ribosomal RNA or rRNA. The ribosome helps the tRNA molecules temporarily attach to the mRNA. But here's the thing: tRNA molecules have \"anticodons\" which bond with the codons in the very same way that DNA bases bond to each other (except that it's RNA, so there's U instead of T). For example, if the anticodon of the tRNA molecule is CAU, then it will bond with the codon AUG on the mRNA molecule. (The \"order\" is reversed because the strands run in opposite directions when bonding.) The tRNA molecule that has the anticodon CAU carries methionine; therefore, the codon AUG attracts the (only) tRNA molecule that carries methionine.\n \n \nBut out of all the many amino acids there could be, mathematically-speaking, only 20 ever actually show up.\n\n There could be an infinite number. The fact that only 20 ever show up (save for a very few exceptions) is significant in terms of common descent.\n \n \n(and only 12 of those are naturally created by human nucleotides; diet provides the others).\n\n Amino acids are not \"created by nucleotides.\" They are constructed independently of the above process and get used in building proteins. Their origin as either dietary or metabolic is irrelevent to this specific topic.\n \n \nAnyway, with 64 combos for just 20 amino acids, there is a lot of redundancy. Very strange chemistry.\n\n There's a popular explanation for this called the \"wobble hypothesis.\" It's not that complicated, and you're welcome to look it up, but again, it's beyond the scope of the bare basics, which I'd like to get down before we take too huge a step.\n \n \nSo far it's all just 'bits of stuff' forming atomic alliances. No biological 'meaning' or 'significance' to be found to this point.\n\n I think this depends on how you're defining \"meaning\" and \"significance.\" More importantly, though, I also (still) think that you're hindering your progress by trying to shoehorn this \"meaning\" #### into anything. If you don't understand things, you don't rectify the problem by introducing variables, you rectify them by eliminating variables. You're in need of an Ockham-style shave, or -- at the very least -- some incentive to keep your damn pants on: understand what's going on before you start attributing characteristics to anything.", 
   {}, 
   289582, 
   null, 
   1193993040.0
  ], 
  [
   289590, 
   null, 
   "Peeling", 
   "I stand accused of ignorance in the matter of genetics, biochemistry, molecular biology, microbiology, cellular biology, and on and on. I plead guilty. I do not have a ph.d. in any of those fields. So shoot me.\n\n I don't want to shoot you; who the heck would I talk to all day? :)\n \nOf course, many a darwinist has hooted and howled about my lack of formal education in their own specialities, and did so in the most arrogant, pompous, contemptuous, and patronizing terms possible. That's what you do when one of the 'hoi poloi' rips up your opinions and your reasoning.\n\n You must admit, though, it's also what a less patient person might do when faced with someone making pronouncements about what is and isn't biochemically possible while deliberately avoiding gaining a technical understanding of the subject that might inform them differently. You're putting your own spin on the reactions of others, assuming that you're right and that you being right is getting under their skin.\n \nUp until recently I have totally avoided genetics for the simple reason that I am here to debate origins, evolution, and not molecular biology.\n\n Is that really a reasonable attitude though? Can you really claim to be engaging in debate when you begin by arbitrarily excluding from the remit of 'evolution' everything every geneticist understands to be integral to the process? \n \n For all you've accused me of being a materialist, I've never refused to talk to you on the grounds that your hypothesis's dependence upon Vitality renders it beyond the scope of a discussion of evolution.\n \nBut recently peeling has drawn me into geneticism, and I find that I must suddenly learn a great deal, starting from scratch, wrt prokaryote genomics and proteomics.\n\n You and me both. You'll notice I haven't gone so far as to elucidate the actual chemical reactions involved, as chemist or electrolyte undoubtedly could.\n \nThis because one philosophical premise I hold to is the axiom, 'nothing can come from nothing, unaided', known as 'ex nihilo, ab nihilo, nihil fit'. Peeling challenged this postulate empirically, claiming that the appearance of the nylon bug is a case of something arising by spontaneous generation, a random genetic mutation which brought about a novel cellular/ organismic function out of nothing, unaided by anything. Creatio ex nihilo, ab nihilo.\n\n I'm not challenging the axiom itself, I simply maintain that you are misapplying it.\n \n Initially you took a concept, something akin to the 'fitness' of an organism, and asserted your axiom applied to it. I've long questioned how that could work, when the same physical change - at the organismic level or genetic level equally - could mean 'more' or 'less' efficiency depending upon context.\n \n In response, you tightened the focus of your argument to speak to the origination of traits that contextually improve organismic efficiency. So rather than saying that RM can't improve organismic efficiency, you've said that it can, but only if the 'improved' trait the mutation evokes was first designed and held ready by the organism. You say your axiom applies to 'meaning' and that the RM origination of the nylon-eating 'trait', for example, would violate that axiom.\n \n See, I do listen :)\n \nHis arguments are strictly chemical, mechanical, reductionist and determinist. Typically materialist/darwinist/geneticist. But, they look plausible.\n\n Thanks :) I do try.\n \nSo, with great misgivings, I have tried to debate him on his own terms, since he refuses to debate me on mine. Very wise of him, if I may say so.\n\n You are the one who has always said I need to show something that empirically contradicts your metaphysic. All I'm doing is what you asked of me. Now, we both are hampered by the fact we can't actually observe the events in question, so direct empirical verification is beyond either of us. But what I can, and I think I have done, is satisfy the demand to show how a random mutation could yield a novel and helpful trait.\n \n The example of the nylonase gene/enzyme is a good one because it speaks directly to the very thing you say cannot happen: can a random mutation improve a complex system?\n \n For a mutation to be given 100% of the 'credit' as it were, all other things must remain equal. So what happens if the nylonase gene arises via RM in a bacterium and all other things remain equal? From our knowledge of protein synthesis in that organism, we can firmly predict the organism would synthesise the nylonase enzyme. We can also predict that the enzyme would break down nylon waste products and liberate the raw materials for the bacterium's extant metabolic system to process. Moreover, when we look at what's actually happening, that's exactly what we see.\n \n Does the nylonase enzyme embody new 'meaning'? I don't know, but I do know it doesn't need to be assigned 'meaning' to have the chemical effect it does. It's like that old question about the tree in the forest: if a nylonase enzyme forms, and nobody knows what it's for, will it still break down nylon waste?\n \n I don't know about RM creating 'meaning', but it's clear that RM can have consequences, and when you work your way through those consequences with the nylonase gene, keeping all other things equal, you end up with a bacterium that can live on nylon waste. It may offend your philosophical sensibilities to think that the bacterium might not be on any level aware of or responsible for gaining the ability to survive in that environment, but in terms of events in the physical world no laws would be violated if that were the case. Not liking something is not the same as that something being impossible.\n \n \nDepending upon how these nucleotides are put together, in 'triplets' of 3 nucleotides apiece, they can take on 64 different combinations,\n\n It's not how they're put together, it's how they're taken apart. A DNA strand is an internally undifferentiated string of nucleotides, only the reading frame, which grabs three at a time, groups them into 'codons'.\n \nand each combo makes for what is called an amino acid. I do not yet understand how, when, and where this 'combining' happens, as the material is very confusing.\n\n Like electrolyte said, they don't 'make' an amino acid when combined, they are a 'signal' or 'symbol' to the protein synthesis apparatus that tell it what to do.\n \nSo far it's all just 'bits of stuff' forming atomic alliances. No biological 'meaning' or 'significance' to be found to this point. \n\n Anathema though it may be to you, you really do need to sit down and ask yourself whether nylonase needs biological meaning or significance to do its chemical job.", 
   {}, 
   289582, 
   null, 
   1194011700.0
  ], 
  [
   289602, 
   null, 
   "bertvan", 
   "I wrote: \nID prediction: The inheritance of acquired characteristics will be confirmed. \n\n \n I should have writen that Endogenous Adaptive Mutagenesis predicts that the inheritance of acquired characteristics will be confirmed.\n \n EAM includes intelligent, purposeful, internal organization and EAM is therefore a version of ID. The only alternative to intelligent, purposeful organization so far suggested by materialists is some form of accidental change, somehow turned into intelligently interacting systems by by \"natural selection\".", 
   {
    "post_info": {
     "post_title": "EAM is a version of ID"
    }
   }, 
   289590, 
   null, 
   1194023160.0
  ], 
  [
   289610, 
   null, 
   "Peeling", 
   "EAM includes intelligent, purposeful, internal organization and EAM is therefore a version of ID. The only alternative to intelligent, purposeful organization so far suggested by materialists is some form of accidental change, somehow turned into intelligently interacting systems by by \"natural selection\".\n\n \n Perhaps you'd like to address the points I raised earlier, concerning the extreme implausibility of certain evolved features being 'intelligently designed'...?\n \n I'm with Douglas Adams on this one: he said that Sherlock Holmes was wrong when he said that when we eliminate the impossible whatever remains however implausible must be the truth. After all, the impossible is just something we don't know about yet, whereas the deeply implausible contradicts what we do know.\n \n I know a caterpillar can't understand enough about the world around it to 'decide' that looking like a snake does to a bird is a good idea. I know this because a caterpillar betrays no other evidence of such intellect, and I cannot bring myself to believe that it is playing dumb, engaged in some incomprehensibly machievellian long-game against its avian enemies.\n \n All evolutionary theory requires to explain such a creature is for caterpillars to vary in how much they look like a snake, for that variation to be more or less inheritable, and for extremes of that variation to make a statistical difference to the survival rate of the caterpillar in question. That's all. To attempt to explain the same creature through EAM is to scrape the barrel of absurdity until your fingers bleed.", 
   {}, 
   289602, 
   null, 
   1194026160.0
  ], 
  [
   289617, 
   null, 
   "wascallywabbit", 
   "[quote]\nI don't want to shoot you; who the heck would I talk to all day? :)\n \n You must admit, though, it's also what a less patient person might do when faced with someone making pronouncements about what is and isn't biochemically possible while deliberately avoiding gaining a technical understanding of the subject that might inform them differently. You're putting your own spin on the reactions of others, assuming that you're right and that you being right is getting under their skin.\n \n Is that really a reasonable attitude though? Can you really claim to be engaging in debate when you begin by arbitrarily excluding from the remit of 'evolution' everything every geneticist understands to be integral to the process? \n \n For all you've accused me of being a materialist, I've never refused to talk to you on the grounds that your hypothesis's dependence upon Vitality renders it beyond the scope of a discussion of evolution.\n \n You and me both. You'll notice I haven't gone so far as to elucidate the actual chemical reactions involved, as chemist or electrolyte undoubtedly could.\n \n I'm not challenging the axiom itself, I simply maintain that you are misapplying it.\n \n Initially you took a concept, something akin to the 'fitness' of an organism, and asserted your axiom applied to it. I've long questioned how that could work, when the same physical change - at the organismic level or genetic level equally - could mean 'more' or 'less' efficiency depending upon context.\n \n In response, you tightened the focus of your argument to speak to the origination of traits that contextually improve organismic efficiency. So rather than saying that RM can't improve organismic efficiency, you've said that it can, but only if the 'improved' trait the mutation evokes was first designed and held ready by the organism. You say your axiom applies to 'meaning' and that the RM origination of the nylon-eating 'trait', for example, would violate that axiom.\n \n See, I do listen :)\n \n Thanks :) I do try.\n \n You are the one who has always said I need to show something that empirically contradicts your metaphysic. All I'm doing is what you asked of me. Now, we both are hampered by the fact we can't actually observe the events in question, so direct empirical verification is beyond either of us. But what I can, and I think I have done, is satisfy the demand to show how a random mutation could yield a novel and helpful trait.\n \n The example of the nylonase gene/enzyme is a good one because it speaks directly to the very thing you say cannot happen: can a random mutation improve a complex system?\n \n For a mutation to be given 100% of the 'credit' as it were, all other things must remain equal. So what happens if the nylonase gene arises via RM in a bacterium and all other things remain equal? From our knowledge of protein synthesis in that organism, we can firmly predict the organism would synthesise the nylonase enzyme. We can also predict that the enzyme would break down nylon waste products and liberate the raw materials for the bacterium's extant metabolic system to process. Moreover, when we look at what's actually happening, that's exactly what we see.\n \n Does the nylonase enzyme embody new 'meaning'? I don't know, but I do know it doesn't need to be assigned 'meaning' to have the chemical effect it does. It's like that old question about the tree in the forest: if a nylonase enzyme forms, and nobody knows what it's for, will it still break down nylon waste?\n \n I don't know about RM creating 'meaning', but it's clear that RM can have consequences, and when you work your way through those consequences with the nylonase gene, keeping all other things equal, you end up with a bacterium that can live on nylon waste. It may offend your philosophical sensibilities to think that the bacterium might not be on any level aware of or responsible for gaining the ability to survive in that environment, but in terms of events in the physical world no laws would be violated if that were the case. Not liking something is not the same as that something being impossible.\n \n \n It's not how they're put together, it's how they're taken apart. A DNA strand is an internally undifferentiated string of nucleotides, only the reading frame, which grabs three at a time, groups them into 'codons'.\n \n Like electrolyte said, they don't 'make' an amino acid when combined, they are a 'signal' or 'symbol' to the protein synthesis apparatus that tell it what to do.\n \n Anathema though it may be to you, you really do need to sit down and ask yourself whether nylonase needs biological meaning or significance to do its chemical job.\n\n \n **\n Well, this is all wonderfully unhelpful. NOT!!\n \n The only thing of any note is that you once again assert that the nylon bug is evidence that adaptive traits can arise out of genetic accidents, without showing why I or anyone else should take your word for it. Therefore I still don't.\n \n My ignorance of biochemistry is not support for your assertion. I would like to learn the basics of the 'atom to trait' process, but all I'm getting is vituperation and condescension, along with self-contradictory descriptions of the process from you and the web material, so why should I bother? The onus of proof for your assertion is on you people, not on the rest of us, so why should we take cr-p from you guys when we try to see things from your angle?\n \n I've had it. You have no evidence that a/the frameshift and other genetic mutations experienced by the 'nylon bugs' were random and accidental. That is only your assumption.And I grant that any one of those mutations, in any one of the bacteria strains involved, might have been random and accidental. But I do not accept that the multiple mutations needed, and the fact of different genetic mutations in different bacteria 'species' connected to the same novel trait, are all possible by random accident, 'spontaneous generation'. That beggers belief, and mathematical possibility, no matter how loudly you people shout.\n b/You have no evidence to support your assumption that accidental nucleotide changes could generate 'genes' that 'code for' traits. In order to prove that that assertion is true, you have to show a mechanically determined, linear pathwathway from nucleotide to dna to rna to protein to trait. But if you do do that then there is no 'code' involved, only an extended chemical chain reaction. And since the rest of the world seems to believe that semiosis, i.e., 'code', is involved,[which allows the ambivalence/indeterminacy of cellular translation/interpretation], it becomes your problem to prove the world wrong, and that your supposed mechanical process is the fact of the matter. \n \n Otherwise what happens, i.e., the productive trait itself, is cell-dependent, systematic, not accidental/random, and so is not generated 'ex nihilo, ab nihilo'. Simply stating that it is so, over and over again, without showing, step by chemical step, why it _must_ be mechanical, linear, inevitable, immutable and determined, is just silly;-- and expecting the rest of us to 'go back to school' to supposedly convert ourselves to your opinion is mere arrogance.\n \n It's up to you to demonstrate the chemistry involved, and explain just how that chemistry 'had to happen', without cellular control and direction.\n \n Until you actually do that, instead of simply throwing some arcane terminology together and saying, \"See, there, that's how it's done!\", I remain convinced that you've really got nothing but smoke and mirrors, and that the real reason that you people do not explain your position lucidly and coherently, is that it is a position that cannot be explained lucidly and coherently. It is an argument that boils down to nothing more than a simple assertion that, \"That is how it is, that's all. Take our word for it. We know best. So you kiddies just run along and play, why don't you?\".\n \n As far as I am concerned, it remains clearly apparent that the development of the ability to break down nylon waste into parts that could be metabolized was a systematic autopoietic response by bacteria to the peculiar environmental circumstances in which they found themselves, and not, as you claim, the inevitable outcome of a series of inevitable genetic accidents over which they had no control, and which could have and would have and did 'happen to them', nylon or no nylon.\n \n And until you people start providing a lot more information, and a lot less vituperation, that's all she wrote on that subject, AFAIAC.", 
   {}, 
   289590, 
   null, 
   1194029040.0
  ], 
  [
   289620, 
   null, 
   "chemist99a", 
   "My ignorance of biochemistry is not support for your assertion. I would like to learn the basics of the 'atom to trait' process, but all I'm getting is vituperation and condescension, along with self-contradictory descriptions of the process from you and the web material, so why should I bother? The onus of proof for your assertion is on you people, not on the rest of us, so why should we take cr-p from you guys when we try to see things from your angle?\n\n \n But its not rational for you to expect to learn biochemistry/molecular biology in a few weeks of reading on the net! There is a great deal of foundation laying required and that itself takes a few years of effort, equivalent to an undergrad degree in chemistry at the minimum. Then you would have the background to understand what purines and pyrimidines ARE, you would be able to understand the role of high energy triphosphates, you would know what dexoyribose and ribose ARE, you would be able to see how complementary strands of DNA form the double helix, and just WHY the bases pair as they do. You would be able to learn the ins and outs of enzymology and how protiens serve as catalysts. Then you could move on to understanding protein synthesis and how DNA via RNA and the ancillary equipment of the cell makes enzymes - including enzymes to make DNA etx!\n \n But this is a mere forum not a university which teaches its participants to be budding molecular biologists. And I think trying to understand evolution these days WITHOUT the BASICS of molecular biology under your belt is a futile task indeed.\n \n If you eschew learning a whole potful of chemistry you will be lost in modern biology. And modern evolutionary concepts are dependent on both knowing chemistry AND population genetics.\n \n Look I know its frustrating, I understand that you WANT to know this stuff, I do not fault you for NOT knowing it. But that lack of knowledge does lead you down some roads filled with misconceptions and pitfalls.", 
   {}, 
   289617, 
   null, 
   1194032940.0
  ], 
  [
   289621, 
   null, 
   "chemist99a", 
   "I've had it. You have no evidence that a/the frameshift and other genetic mutations experienced by the 'nylon bugs' were random and accidental. That is only your assumption.And I grant that any one of those mutations, in any one of the bacteria strains involved, might have been random and accidental. \n\n \n That as always depends on what you consider to be random or accidental. For example is the sequence 4, 5, 6 random or not there is absolutely no way for ANYONE to tell! Is the fact that out of trillions of cells and billions of linages of bacteria in the waste pond that at least one carries a frame shift mutation and a few point mutations in a specific gene random or NOT. Certainly unless you assert that bacterial cells are CAPABLE of engaging in purposeful behavior WITHOUT being able to form intent then the changes are NOT directed with intent - ie they are accidental. And they are RANDOM in the sense that human beings cannot discern a pattern in their appearance in a population of trillions of cells. Random in this case does not mean without causation - please realize that fact. It means that the event is VERY rare, and cannot be predicted except in a statistical sense. And even within statistics the specific event is so rare as to not allow any body of data to be accumulated as to the event itslef.\n \n \nBut I do not accept that the multiple mutations needed, and the fact of different genetic mutations in different bacteria 'species' connected to the same novel trait, are all possible by random accident, 'spontaneous generation'. That beggers belief, and mathematical possibility, no matter how loudly you people shout.\n\n \n And I would point out that the mathematical probabilities of each event here are effectively unknown, the events do not occurr independently, and since we are talking of only a few low frequency events which can occurr sequentially rather than simultaneously the basis of probability calculations changes greatly. In additon there are more than one path which would lead to nylonase! A fact often overlooked by many who attempt such calculations.\n \n And nobody is shouting here. Provided that you know both the biochemistry and the molecular biology the data are quite capable of standing alone. You admittedly do not understand the chemistry or physiology involved and thus you have a difficult time getting your mind around what happened. Thats NOT a comment on your mind, just one on your knowledge base. You are trying to grasp this all on the basis of a top down philosophy, those you accuse of shouting understand the system from the both directions. Where you only see a black box, those who \"shout\" know whats inside that box, and whats inside the boxes inside that box etc. The perspectives are very very differnet.\n \n \nYou have no evidence to support your assumption that accidental nucleotide changes could generate 'genes' that 'code for' traits. In order to prove that that assertion is true, you have to show a mechanically determined, linear pathwathway from nucleotide to dna to rna to protein to trait. \n\n \n But for nylonase thats EXACTLY what is demonstrated. The pathway from nucleotide triplets in DNA to messengar RNA is well known for prokaryotes:\n See http://en.wikipedia.org/wiki/Transcription_(genetics) for a brief introduction to that series of reactions.\n \n The pathway from messanger RNA to protein is also well characterized in prokaryotes. You can see the WIKI article on translation for some details.\n \n \n There is also this site which will take you through many of the basics, but again some chemistry background is necessary. Its a fairly good tutorial with some animations along the way - and these may be helpful to you.\n \n http://www.ncc.gmu.edu/dna/index.htm\n \n \n \n \nBut if you do do that then there is no 'code' involved, only an extended chemical chain reaction. And since the rest of the world seems to believe that semiosis, i.e., 'code', is involved,[which allows the ambivalence/indeterminacy of cellular translation/interpretation], it becomes your problem to prove the world wrong, and that your supposed mechanical process is the fact of the matter.\n\n \n There is a \"code\" involved in the sense that specific triplets are by chemical means associated with specific amino acids in the protein produced. If you do not want to call it a code but something else, so be it. The term of art in molecular biology is \"code\" there is no way to change that terminology at this date. Its a correspondence if you choose to think of it that way. A specific set of triplets will result in a specific amino acid in protein at a specific location in the protein chain - in the simplist terms. Again if you can learn a bit about the process of protein biosynthesis you will see how this works also.", 
   {}, 
   289620, 
   null, 
   1194034260.0
  ], 
  [
   289647, 
   null, 
   "electrolyte", 
   "Gee, wabbit, I see that you have completely failed to respond to my post at all. What's the matter? I guess you've looked and looked, trying to find something wrong or something contradictory so you can rant at me, too (again). Well, tough beans, bub. The fact is that you've got nothing to say to my attempt to educate you. No \"thanks, that was helpful,\" no \"I'm still not comprehending\" -- hell, not even an \"elec, you're the worst teacher ever.\" In fact, you pretend that nobody has given you any information. One might gather that you really have no desire whatsoever to learn, but rather a desire only to maintain your ability to shout your belligerence on fora across the internets while still believing that you are correct because you lack the education to understand why you're wrong.\n \n \nb/You have no evidence to support your assumption that accidental nucleotide changes could generate 'genes' that 'code for' traits. In order to prove that that assertion is true, you have to show a mechanically determined, linear pathwathway from nucleotide to dna to rna to protein to trait. But if you do do that then there is no 'code' involved, only an extended chemical chain reaction. And since the rest of the world seems to believe that semiosis, i.e., 'code', is involved,[which allows the ambivalence/indeterminacy of cellular translation/interpretation], it becomes your problem to prove the world wrong, and that your supposed mechanical process is the fact of the matter.\n\n Here you are (again) wrong. I'm picking this single point instead of responding to all of the others just to show how out of touch with reality you are.\n The world agrees with us. The fact that using similes and analogies is often an effective way of communicating concepts -- especially when trying to convey information to somebody who doesn't have the necessary background information to understand the standard terminology -- doesn't mean that there's some \"code\" in whatever the hell sense you happen to use the word. There is a necessary correlation between codon and amino acid. One might choose to call that a code. The process by which the correlation is carried out is mechanical; you seem to think that makes it not a code. I don't give a rat's XXX who calls it what. It is what it is, and you're best off to understand what it is rather than try to label it with obscure, ineffective, and -- ultimately -- utterly meaningless titles.\n If this were coming from anybody else, I'd find it unbelievable. Instead, you have a small handful of very knowledgeable people trying to educate you, and you yet again you run out to the internet and treat the press releases as literal truth. (I can just see wabbit reading an old article I remember that described white blood cells as the Marines of the body, and wabbit picturing miniscule white blobs with fancy uniforms and swords standing guard at various places within the body, then getting combative with disbelief after being told that there are no tiny uniforms because Marines do not serve in the nude.) I have told you countless times that getting hung up on assigning \"meaning\" and appealing to \"code\" is a fool's errand that is completely unnecessary to understanding genetics. But you persist, which shows that you really are not the slightest bit interested in learning. Then you remove all doubt:\n \n \nexpecting the rest of us to 'go back to school' to supposedly convert ourselves to your opinion is mere arrogance.\n\n Actually, expecting the rest of 2007 to go back to your 1950s high school education is a much greater crime against science and education than trying to help somebody catch up on new developments. But we aren't asking you to educate yourselve merely to \"assimilate you into the evil conspiratorial collective.\" We ask you to educate yourself because it's the best thing to do if you're looking for what really happens in cells. If you are suggesting that educating yourself about what really happens in cells will likely convince you that you've been wrong for all this time, then I can't honestly say I disagree... and apparently, neither can you. Hence your willful ignorance.\n \n wabbit strikes me just like the immature, spoiled, little seventh graders I used to teach. \"Why do I have to know how to spell? I can use the spell checker.\" \"I don't need to know my multiplication tables; that's why God invented calculators.\" \"Understand a concept? Then apply it? Do I look like Einstein?\" \"Why can't you just stick the information into my brain so that I don't have to do any work?\"\n But at least they wanted to pass. wabbit just wants to maintain his delusion that he's right.\n \n The farewell that you have genuinely earned is not allowed on this forum, so I'll have to stick to the G-rated version: Get real.", 
   {}, 
   289617, 
   null, 
   1194053880.0
  ], 
  [
   289706, 
   null, 
   "N.Wells", 
   "I wouldn't have bothered to reply to Mike's \"poor little me\" plea, except that Allen MacNeill just posted a thread that sheds some light on Mike's problem.\n \n From Mike: \n I stand accused of ignorance in the matter of genetics, biochemistry, molecular biology, microbiology, cellular biology, and on and on. I plead guilty. I do not have a ph.d. in any of those fields. So shoot me.\n \n I have not taken a course in physics, chemistry, or biology since I was in high school in the 1950's, at which time I took one year of each. I have next to no formal education in these subjects, or any other branch of science.\n I have never pretended otherwise. .................\n \n I have absolutely no interest in learning any more 'science' than is necessary to an understanding of the issues involved in the 'origins' debate currently taking place between darwinists and the rest of the world.\n \n Now, my IQ scores say that I am not a stupid person, and being retired, and not particularly well, I have had a lot of time to debate ideas/opinions and to research various biological papers that bear upon the debate. Not having any formal education in these areas I am limited mostly to those papers written for public consumption, which generally pitched to about a high school level. But that is, or was, all I needed for the philosophical debate, as such.\n \n Of course, many a darwinist has hooted and howled about my lack of formal education in their own specialities, and did so in the most arrogant, pompous, contemptuous, and patronizing terms possible. That's what you do when one of the 'hoi poloi' rips up your opinions and your reasoning. I thank them for their nastiness.\n\n \n Mike, it is the exception, not the rule that you catch grief over your lack of credentials and formal education in evolutionary biology. You catch grief because you keep making ignorant yet aggressive assertions that are just plain wrong. Credentials aren't particularly important, and ignorance is understandable, but making wrong assertions all the time in areas where you are aware of your ignorance is not.\n \n It is not as though we insist that you should believe the rest of us that you are getting things wrong, just because we claim to be experts. Although scientists tend to give other scientists the benefit of the doubt when they assert something, the fall-back operational procedures require skepticism and the need for people to back up claims with evidence. So we urge you to doubt us and to do your own research.\n \n However, you have some problems here. On ARN and 4forums you have habitually posted press releases of new findings as supporting your EAM model, and people keep telling you that you are misinterpreting the results. What's happening is that you are both blinded by your favored hypothesis and hamstrung by insufficient knowledge & understanding. EAM admittedly has a simple and logical internal consistency, but unfortunately for you there is just little evidence that anything works that way, and lots of evidence that it doesn't. Moreover, your love of EAM (and a concomitant distaste for evolutionary biology) gives you a blind spot approximately the size of sun that you can't see past where evolutionary biologists just have to be wrong on everything because they don't see the wonders of EAM. You say appropriate words about our need for hard evidence, but then you zoom off into the farther reaches of the wilds of wishful and evidence-free thinking about vitality and intelligence and creatures reformulating their genomes. \n \n You should perhaps consider a possibility that is pretty obvious to the rest of us: a) you don't know all that you need to about genetics and the theory of evolution, and b) your outlook (and especially your love of EAM and your distaste for pro-ToE science) prevents you from getting a clear view of anything in this topic. \n \n Your whole recent discussion with Peeling is an extended case in point. As another case in point, you and Bertvan have had a long history of dismissing the modern theory of evolution as \"RM&NS\". People keep protesting that the modern ToE is not reducible to RM&NS, but both of you turn right round a post or two later and once again diss \"RM&NS\" and deny natural selection. Allen MacNeill has a nice post up at http://evolutionlist.blogspot.com/2007/10/rm-ns-creationist-and-id-strawman.html about the sources of variation (he lists 47 of them):\n \n As I have alread pointed out in an earlier post, the real creative factor in evolution isn't natural selection per se, it's the source(s) of variation that natural selection \"preserves\" from generation to generation. According to the creationists and IDers, the only source of such variation is \"random mutations\", and so there simply isn't enough variation to provide the raw material for evolutionary change.\n \n In my earlier post on the \"engines of evolution\" I promised a list of the real sources of variation that provide the raw material for evolutionary change. It's taken me a while, but here it is. This list includes \"random mutation,' of course, but also 46 other sources of variation in either the genotypes or phenotypes of living organisms. Note that the list is not necessarily exhaustive, nor are any of the entries in the list necessarily limited to the level of structure or function under which they are listed. On the contrary, this is clearly a list of the minimum sources of variation between individuals in populations. A comprehensive list would almost certainly include hundreds (and possibly thousands) of more detailed processes. Also, the list includes processes that change either genotypes or phenotypes or both, but does not include processes that are combinations of other processes in the list, again implying that a comprehensive listing would be much longer and more detailed. Anyway, here it is, listed according to level of structure and function:\n \n \n Sources of Heritable Variation (both genotypic and phenotypic) Among Individuals in Populations\n \n Gene Structure (in DNA)\n \u0095 single point mutations\n \u0095 deletion and insertion (\"frame shift\") mutations\n \u0095 inversion and translocation mutations\n \n Gene Expression in Prokaryotes\n \u0095 changes in promoter or terminator sequences (increasing or decreasing binding)\n \u0095 changes in repressor binding (in prokaryotes); increasing or decreasing binding to operator sites\n \u0095 changes in repressor binding (in prokaryotes); increasing or decreasing binding to inducers\n \u0095 changes in repressor binding (in prokaryotes); increasing or decreasing binding to corepressors\n \n Gene Expression in Eukaryotes\n \u0095 changes in activation factor function in eukaryotes (increasing or decreasing binding to promoters)\n \u0095 changes in intron length, location, and/or editing by changes in specificity of SNRPs\n \u0095 changes in interference/antisense RNA regulation (increasing or decreasing binding to sense RNAs)\n \n Gene Interactions\n \u0095 changes in substrates or products of biochemical pathways\n \u0095 addition or removal of gene products (especially enzymes) from biochemical pathways\n \u0095 splitting or combining of biochemical pathways\n \u0095 addition or alteration of pleiotropic effects, especially in response to changes in other genes/traits\n \n Eukaryotic Chromosome Structure\n \u0095 gene duplication within chromosomes\n \u0095 gene duplication in multiple chromosomes\n \u0095 inversions involving one or more genes in one chromosome\n \u0095 translocations involving one or more genes between two or more chromosomes\n \u0095 deletion/insertion of one or more genes via transposons\n \u0095 fusion of two or more chromosomes or chromosome fragments\n \u0095 fission of one chromosome into two or more fragments\n \u0095 changes in chromosome number via nondisjunction (aneuploidy)\n \u0095 changes in chromosome number via autopolyploidy (especially in plants)\n \u0095 changes in chromosome number via allopolyploidy (especially in plants)\n \n Eukaryotic Chromosome Function\n \u0095 changes in regulation of multiple genes in a chromosome as a result of the foregoing structural changes\n \u0095 changes in gene expression as result of DNA methylation\n \u0095 changes in gene expression as result of changes in DNA-histone binding\n \n Genetic Recombination\n \u0095 the exchange of non-identical genetic material between two or more individuals (i.e. sex)\n \u0095 lateral gene transfer via plasmids and episomes (especially in prokaryotes)\n \u0095 crossing-over (reciprocal and non-reciprocal) between sister chromatids in meiosis\n \u0095 crossing-over (non-reciprocal) between sister chromatids in mitosis\n \u0095 Mendelian independent assortment during meiosis\n \u0095 hybridization\n \n Genome Structure and Function\n \u0095 genome reorganization and/or reintegration\n \u0095 partial or complete genome duplication\n \u0095 partial or complete genome fusion\n \n Development (among multicellular eukaryotes, especially animals)\n \u0095 changes in tempo and timing of gene regulation, especially in eukaryotes\n \u0095 changes in homeotic gene regulation in eukaryotes\n \u0095 genetic imprinting, especially via hormone-mediated DNA methylation\n \n Symbiosis\n \u0095 partial or complete endosymbiosis\n \u0095 partial or complete incorporation of unrelated organisms as part of developmental pathways (especially larval forms)\n \u0095 changes in presence or absence of mutualists, commensals, and/or parasites\n \n Behavior/Neurobiology\n \u0095 changes in behavioral anatomy, histology, and/or physiology in response to changes in biotic community\n \u0095 changes in behavioral anatomy, histology, and/or physiology in response to changes in abiotic environment\n \u0095 learning (including effects of use and disuse)\n \n Physiological Ecology\n \u0095 changes in anatomy, histology, and/or physiology in response to changes in biotic community\n \u0095 changes in anatomy, histology, and/or physiology in response to changes in abiotic environment\n \n So, next time you hear or read a creationist or IDer cite \"RM & NS\" as the sole explanation for evolutionary change, point out to them and everyone else that there are at least 47 different sources of variation (including \"random mutations\"), and at least three different processes that result from them: natural selection, sexual selection, and random genetic drift. \n\n \n I'm well aware that you consider many of these processes to be under volitional or intelligent control and \"therefore\" evidence for your EAM. Even so, this list makes it clear that the ToE is not reducible to RM&NS. Worse yet, you just said, \n Up until recently I have totally avoided genetics for the simple reason that I am here to debate origins, evolution, and not molecular biology. Particularly I did not wish to debate genetics with geneticists, knowing that they would never hesitate to 'blind me with science', and that when they did, I would be in the position of the ant vs the elephant. But recently peeling has drawn me into geneticism, and I find that I must suddenly learn a great deal, starting from scratch ... \n Given such a distaste for genetics and such a lack of background in it, do you really think you are in a position to evaluate findings in all the areas listed above? Because that's what you are doing when you tell us that the ToE and evolutionary biologists are full of nonsense.\n \n \nI thank them for their nastiness. \n\n You're welcome. However, if you had enough self-awareness, you'd realize that mostly you are reapipng as you sow, so if you don't like it, you mostly have yourself to blame.", 
   {
    "unicode_changes_made": true
   }, 
   289647, 
   null, 
   1194119700.0
  ], 
  [
   289725, 
   null, 
   "wascallywabbit", 
   "neil wells-\n Mike, it is the exception, not the rule that you catch grief over your lack of credentials and formal education in evolutionary biology. You catch grief because you keep making ignorant yet aggressive assertions that are just plain wrong.\n\n \n **\n Definition of \"wrong\" in darwinspeak--anything that runs counter to our opinions.\n \n \n\n Credentials aren't particularly important,\n\n \n **\n Then why do darwinists constantly appeal to 'credentials' when seeking to justify and dignify their own opinions, via the fallacy of 'argument from authority' [the authority is always themselves or some other darwinist], and repeatedly seek to disparage the opinions of others on the basis that they lack formal training in darwinism from darwinist-accredited degree-granting?\n Why do they automatically attack their opponents qualifications instead of their reasoning, and disparage and dismiss our supporting evidence when it comes in the form press releases from these same institutions? \n \n The truth is, neil, you and your fellow darwinists _always_ choose the 'credentials' argument as your PRIMARY 'argument'.\n \n \n\n and ignorance is understandable, but making wrong assertions all the time in areas where you are aware of your ignorance is not.\n\n \n **\n As Josh Billings pointed out long ago, in his own terms, the worst, most egregious, and most dangerous ignorance is not the ignorance of 'not knowing', it is the ignorance of knowing for a fact that which simply is not true. You darwinists can _describe_ a lot of chemistry, (without, so far as I can tell, really understanding much of it), and that makes you feel knowledgeable and oh, so clever and superior. But when you spout your 'prime directive', that novel adaptive organismic traits are the mechanical result of 'accidental genetic mutations', you display that worst kind of ignorance.\n \n My ignorance of genetics in no way diminishes my arguments against your darwinist 'spontaneous generation' ignorance. To do that you would have to demonstrate your. 'origins by spontaneous generation/accidental genetic mutation/creatio ex nihilo, ab nihilo', is not the dogmatised ignorance I say it is, but empirical fact. Peeling believes that he has done that with 'the nylon bug', but clearly, to any non-darwinst, he has done no such thing. \n \n Nor have you or any other darwinist shown why a description [usually a description that is contradicted by some other darwinist's description] of the molecular processes leading from nitrogenous bases to bird's wings somehow proves the validity of your 'spontaneous generation' notion. You can't even describe it coherently for heaven's sake. No wonder you fail so miserably as school teachers!!\n \n \n\n It is not as though we insist that you should believe the rest of us that you are getting things wrong, just because we claim to be experts.\n\n \n **\n I am not \"getting things wrong\". I am simply disagreeing with you wrt the mechanisms of evolution. Only your bloated egoes prompts you to assume that 'disagreement is error'. Apart from that error your sentence makes no sense.\n \n \n\n Although scientists tend to give other scientists the benefit of the doubt when they assert something, the fall-back operational procedures require skepticism and the need for people to back up claims with evidence. So we urge you to doubt us and to do your own research.\n\n \n **\n I do do my own research and present my findings here. Unless you are telling us all that only material we have published ourselves in 'peer-reviewed' [read, 'darwinist'] media is acceptable, and that reference to other people's work, no matter how 'peer-reviewed', is not acceptable. One way to stifle dissent, I'm sure. In any case, far from praising my research and actually engaging the points made by my cited materials, you people disparage it and try to hand-wave it away. \n \n IAC, for 6 years, from my first post at IIDB to my last on this thread, no darwinist has ever urged me to doubt him. In fact, the mere fact that I doubted his/her 'articles of faith' has immediately sent most of them into a nasty,vicious, vituperative, personal attack on me and my 'credentials', using every slimeball schoolyard bully's insult that they could come up with on such short notice.\n \n \n\n However, you have some problems here. On ARN and 4forums you have habitually posted press releases of new findings as supporting your EAM model, and people keep telling you that you are misinterpreting the results. \n\n \n **\n You \"people\" always do that, but you never actually show why my interpretation of the facts, my inferences from the observations, etc., are wrong, in error. You merely make that claim because the facts cited, even though they obviously contradict your darwinist 'spontaneous generation', irrational, pseudo-scientific notion, and/or obviously support EAM's scientific 'organismic response' hypothesis, really tick you off. So why would anyone give a hoot that you say I'm wrong?!?\n \n \n\n What's happening is that you are both blinded by your favored hypothesis and hamstrung by insufficient knowledge & understanding. EAM admittedly has a simple and logical internal consistency, but unfortunately for you there is just little evidence that anything works that way, and lots of evidence that it doesn't.\n\n \n **\n Horse pucky. I've provided a ton of articles demonstrating an EAM mechanism. You people have yet to present a single solid piece of support for your RMNS 'spontaneous generation' notion. That is, in fact, the basis of this thread. The attempt to validate your notion via the case of the nylon bugs, but once again, you just don't seem able to to prove that 'nylonase' is the mechanical, unassisted and inevitable result of a 'random mutation'. You people simply make that assertion and then provide descriptions of molecular processes as if those descriptions explained and proved your assertion. Here's a newsflash for you--they don't!!\n \n \n\n Moreover, your love of EAM (and a concomitant distaste for evolutionary biology)\n\n \n **\n EAM is evolutionary biology. \"Spontaneous Generation\", aka \"RMNS\", is pseudoscience , not evolutionary biology. Biology, like all science, is about the universal law and order that make this universe rational. Not the 'random chance' that does the very opposite.\n \n \n\n gives you a blind spot approximately the size of sun \n\n \n **\n Yawn. Pot/kettle.\n \n \n\n that you can't see past where evolutionary biologists just have to be wrong on everything \n\n \n **\n Uhm, hyperbole. Gross exageration. Very rhetorical. Very untrue. I have no quarrel with evolutionary biologists, only with darwinists posing as evolutionary biologists. Where biologists, even geneticists, biochemists, and molecular biologists stick to the facts, I have perfect faith in them and their work. When they wander off into metaphysics and ideology, as with the \"RMNS\" postulate and its attached assumptions and interpretations, that I point out out their errors.\n \n \n\n because they don't see the wonders of EAM. You say appropriate words about our need for hard evidence, but then you zoom off into the farther reaches of the wilds of wishful and evidence-free thinking about vitality and intelligence and creatures reformulating their genomes.\n\n \n **\n Fact--I do provide supporting empirical evidence. You people have never done so, and are once again failing to do so-- in this thread. \n \n \n\n You should perhaps consider a possibility that is pretty obvious to the rest of us: a) you don't know all that you need to about genetics and the theory of evolution,\n\n \n **\n Actually, it isn't, \"the rest of us\". It's just you darwinists. And obviously, if an intelligent and concerned individual can participate, for 6 years, on a daily basis, in forums stocked with the best people darwinism can offer, and still not \"know all that [s/he] need[s] to [know] about genetics and the theory of evolution[meaning darwinism]\", then that is not their fault, but the fault of those promoting their gene-based RMNS explanation for evolution. Like I said earlier, you guys make for the most incompetent teachers imaginable. Either that, or your subject matter is nothing but silly nonsense dressed up in great big words. But I know, I know. You'd rather believe that we sceptics are just too stupid or lazy to grasp your insights. Like those kids that elec couldn't teach.\n \n \n\n As another case in point, you and Bertvan have had a long history of dismissing the modern theory of evolution as \"RM&NS\". People keep protesting that the modern ToE is not reducible to RM&NS, but both of you turn right round a post or two later and once again diss \"RM&NS\" and deny natural selection. \n\n \n **\n Bertvan and I have have no quarrel with biology, nor with evolution. Our EAM is an hypothesis wrt the mechanism/universal force/cause for evolution. You insist upon conflating evolutionary biology with the darwinist 'spontaneous generation', accidental mutation', 'it just happens, that's all', pseudoscientific\n non-explanation tthat you self-servi8ngly label \"THE\" theory of evolution. EAM is more a scientific theory of evolution then your 'happy accident' notion will ever be.\n \n As far as real evolutionary biology is concerned, the best and most recent material pertains to EAM. The worst, most discredited and 'out of date' material pertains to your \"RMNS\".\n \n \n\n Allen MacNeill has a nice post up at http://evolutionlist.blogspot.com/20...-strawman.html about the sources of variation (he lists 47 of them):\n \n Quote:\n As I have alread pointed out in an earlier post, the real creative factor in evolution isn't natural selection per se, it's the source(s) of variation that natural selection \"preserves\" from generation to generation. According to the creationists and IDers, the only source of such variation is \"random mutations\",\n\n \n **\n This is blatantly untrue. Only darwinists attribute any portion of 'variation' to\n \"random mutations\". Creationists attribute 'variation' to the whims of an anthropomorphic god. IDists attribute 'variation' to the systematic, dynamic behaviour of self-adapting organisms. \n \n But he is correct when he says, [contra the darwinist garbage about 'positive selection'], that \"the real creative factor in evolution isn't natural selection per se\". But then he immediately gets it wrong again. NS is not a 'mechanism/force/causal agency' that ever originated anything. NS is nothing but bad luck or maladaptation to local circumstances. Usually both. \"NS\" is always subtrative, because \"NS\" is anything that kills or disables, and nothing else.\n The only lifeforms \"preserved\" \"from generation to generation\" are those lifeforms that \"NS\" did not act upon, i.e., did not kill or stop from reproducing.\n Whatever it is that \"preserved\" them, be it good luck or organismic ingenuity, it sure as heck wasn't \"NS\".\n \n \n\n and so there simply isn't enough variation to provide the raw material for evolutionary change.\n\n \n **\n Supposing that he means 'inherited' variation, he's back to being partially right.\n skip--\n \n \n\n Sources of Heritable Variation (both genotypic and phenotypic) Among Individuals in Populations\n \n Gene Structure (in DNA)\n \u0095 single point mutations\n \u0095 deletion and insertion (\"frame shift\") mutations\n \u0095 inversion and translocation mutations\n \n Gene Expression in Prokaryotes\n \u0095 changes in promoter or terminator sequences (increasing or decreasing binding)\n \u0095 changes in repressor binding (in prokaryotes); increasing or decreasing binding to operator sites\n \u0095 changes in repressor binding (in prokaryotes); increasing or decreasing binding to inducers\n \u0095 changes in repressor binding (in prokaryotes); increasing or decreasing binding to corepressors\n \n Gene Expression in Eukaryotes\n \u0095 changes in activation factor function in eukaryotes (increasing or decreasing binding to promoters)\n \u0095 changes in intron length, location, and/or editing by changes in specificity of SNRPs\n \u0095 changes in interference/antisense RNA regulation (increasing or decreasing binding to sense RNAs)\n \n Gene Interactions\n \u0095 changes in substrates or products of biochemical pathways\n \u0095 addition or removal of gene products (especially enzymes) from biochemical pathways\n \u0095 splitting or combining of biochemical pathways\n \u0095 addition or alteration of pleiotropic effects, especially in response to changes in other genes/traits\n \n Eukaryotic Chromosome Structure\n \u0095 gene duplication within chromosomes\n \u0095 gene duplication in multiple chromosomes\n \u0095 inversions involving one or more genes in one chromosome\n \u0095 translocations involving one or more genes between two or more chromosomes\n \u0095 deletion/insertion of one or more genes via transposons\n \u0095 fusion of two or more chromosomes or chromosome fragments\n \u0095 fission of one chromosome into two or more fragments\n \u0095 changes in chromosome number via nondisjunction (aneuploidy)\n \u0095 changes in chromosome number via autopolyploidy (especially in plants)\n \u0095 changes in chromosome number via allopolyploidy (especially in plants)\n \n Eukaryotic Chromosome Function\n \u0095 changes in regulation of multiple genes in a chromosome as a result of the foregoing structural changes\n \u0095 changes in gene expression as result of DNA methylation\n \u0095 changes in gene expression as result of changes in DNA-histone binding\n \n Genetic Recombination\n \u0095 the exchange of non-identical genetic material between two or more individuals (i.e. sex)\n \u0095 lateral gene transfer via plasmids and episomes (especially in prokaryotes)\n \u0095 crossing-over (reciprocal and non-reciprocal) between sister chromatids in meiosis\n \u0095 crossing-over (non-reciprocal) between sister chromatids in mitosis\n \u0095 Mendelian independent assortment during meiosis\n \u0095 hybridization\n \n Genome Structure and Function\n \u0095 genome reorganization and/or reintegration\n \u0095 partial or complete genome duplication\n \u0095 partial or complete genome fusion \n\n \n **\n All of the above occur. The issue is that darwinists claim that the above are all 'spontaneous', aka, 'random', aka, 'accidental'. That these genetic/molecular changes constitute their, \"RM\".\n EAM does not quarrel with the fact of genetic mutations. It does not even deny that some of them are random. It confines its principles to the case of adaptive genetic mutations, [i.e., meaningful, organismically productive genetic mutations], stipulating that these mutations, [which include all of the above], are systematically, [not accidentally], generated/constructed.\n \n \n\n Development (among multicellular eukaryotes, especially animals)\n \u0095 changes in tempo and timing of gene regulation, especially in eukaryotes\n \u0095 changes in homeotic gene regulation in eukaryotes\n \u0095 genetic imprinting, especially via hormone-mediated DNA methylation\n \n Symbiosis\n \u0095 partial or complete endosymbiosis\n \u0095 partial or complete incorporation of unrelated organisms as part of developmental pathways (especially larval forms)\n \u0095 changes in presence or absence of mutualists, commensals, and/or parasites\n \n Behavior/Neurobiology\n \u0095 changes in behavioral anatomy, histology, and/or physiology in response to changes in biotic community\n \u0095 changes in behavioral anatomy, histology, and/or physiology in response to changes in abiotic environment\n \u0095 learning (including effects of use and disuse)\n \n Physiological Ecology\n \u0095 changes in anatomy, histology, and/or physiology in response to changes in biotic community\n \u0095 changes in anatomy, histology, and/or physiology in response to changes in abiotic environment\n\n \n **\n All of the above are strictly EAM, and have no connection with your, \"THE theory of evolution\", aka darwinist RMNS. They are about systematic, purposeful, responsive evolution, not darwinism's series of lucky genetic accidents.\n Needless to say, I rejoice in them.\n \n \n\n So, next time you hear or read a creationist or IDer cite \"RM & NS\" as the sole explanation for evolutionary change,\n\n \n **\n Once again, ONLY DARWINISTS, _never_ creationists or \"IDers\", posit \"RM & NS\" as any part at all of the \"explanation for evolutionary change\".\n Unfortunately for darwinists, their \"RM & NS\" is the only evolutionary explanation that fits in with their fisherian geneticism, allowing their fisherian geneticism to fit their a priori materialism, which is in turn necessary to their religious philosophy, atheism. And atheism, my friends, is what darwinism and \"THE theory of evolution\" are really all about. \n \n Why else do you think that every thread in this forum reduces, like this very thread, to the notion of accidental, spontaneous _genetic_ mutations being the actual sources of novel adaptive molecular or organic traits?!? .\n \n \n\n point out to them and everyone else that there are at least 47 different sources of variation (including \"random mutations\"),\n\n \n **\n Oh, yeah, right--without ever stipulating which ones are 'random', and which one's are not, and how you can tell them apart. Last darwinist I talked to assured me that all genetic, [molecular] mutations are spontaneous and random, no matter what happens at the cellular/organismic level.\n \n \n \n\n and at least three different processes that result from them: natural selection, sexual selection, and random genetic drift. \n\n \n **\n Actually, there are three hypotheses here, not three actual processes. Anytime darwinists want to prove that their 3 hypotheticals have any concrete reality, we'll discuss the scope and limitations of that assumption.\n \n \n\n I'm well aware that you consider many of these processes to be under volitional or intelligent control and \"therefore\" evidence for your EAM. Even so, this list makes it clear that the ToE is not reducible to RM&NS.\n\n \n **\n Totally untrue. The list does make it clear that _evolutionary biology_, \"is not reducible to RM&NS\". BUT, your, \"THE theory of evolution\", OTHOH, IS still solely variations on the RM&NS theme, [aka 'spontaneous generation','creatio ex nihilo, ab nihilo'], just as it has been since Fisher et al.\n \n \n \n\n Worse yet, you just said, \n Quote:\n Up until recently I have totally avoided genetics for the simple reason that I am here to debate origins, evolution, and not molecular biology. Particularly I did not wish to debate genetics with geneticists, knowing that they would never hesitate to 'blind me with science', and that when they did, I would be in the position of the ant vs the elephant. But recently peeling has drawn me into geneticism, and I find that I must suddenly learn a great deal, starting from scratch ... \n \n Given such a distaste for genetics and such a lack of background in it, do you really think you are in a position to evaluate findings in all the areas listed above?\n\n \n **\n I do not have to evaluate genetics. I only have to evaluate notions posited by geneticists. The only notion of theirs that matters is the assertion that genetic mutations are all random, and that a random genetic mutation can and ultimately does account for the origins adaptive molecular and organic traits. I do not have to evaluate that notion, I only have to evaluate the empirical evidence presented by darwinists in support of that notion. So far no such empirical evidence has been presented; merely descriptions of chemical processes. Description is not explanation.\n Let the darwinists present explanations of molecular processes that actully show, not simply imply, that even in one or two anomalous cases, [let's say 'the nylon bugs'], a cellular trait, the ability to break down nylon waste into particles, some of which [2%?] can be metabolised, was in fact the final, unassisted result of an accidental genetic mutation. I'll analyse anything in that regard that they are capable of expressing intelligibly. Go for it, neil.", 
   {
    "unicode_changes_made": true
   }, 
   289706, 
   null, 
   1194140100.0
  ], 
  [
   289728, 
   null, 
   "chemist99a", 
   "I do not have to evaluate genetics. I only have to evaluate notions posited by geneticists. \n\n \n But that you cannot do without a knowledge of genetics at or above the \"notions\" which are being posited. If you know nothing of an engine and I tell you that the valves are worn and the piston rings are leaking oil, how can you evaluate it. I could just as well say that the gimcrak was broken and the whizbang needed replacing. It would be all the same to you.", 
   {}, 
   289725, 
   null, 
   1194142260.0
  ], 
  [
   289735, 
   null, 
   "electrolyte", 
   "Like I said earlier, you guys make for the most incompetent teachers imaginable.\n\n Like I said earlier, even the best teachers cannot teach the willfully ignorant such as you.\n For your information, my students learned once they realized what learning entails. You have no interest in learning. Instead, you want to come here spewing accusations of intellectual dishonesty and professional incompetence with no evidence and expect not to get slammed by the people you slander. On most fora I know, such behavior gets a request for a retraction, and refusal to retract results in a ban.\n \n Additionally, I find it absolutely hilarious that you're talking about a mechanism for EAM. Your entire argument is that there is no mechanism. A mechanism means that there's no psychical force and that everything can be described mechanistically, which is what you've been railing against. You understand so little, you don't even understand your own words. How foolish of us to think that you were merely capable of realizing when you need a dictionary.", 
   {}, 
   289725, 
   null, 
   1194163560.0
  ], 
  [
   289736, 
   null, 
   "electrolyte", 
   "It would be all the same to you.\n\n No, he'd just ask the mechanic if he accepts evolution, and upon hearing that the mechanic does, wabbit would call him an incompetent boob and proceed to wax poetic about how he could fix the problem himself with his internet \"research\" prowess. (The fact that he wouldn't know names, locations, functions, or appearances of engine parts -- or anything about an engine, really -- clearly won't slow him down at all.)", 
   {}, 
   289728, 
   null, 
   1194164160.0
  ], 
  [
   289760, 
   null, 
   "N.Wells", 
   "All of the above are strictly EAM, and have no connection with your, \"THE theory of evolution\", aka darwinist RMNS. They are about systematic, purposeful, responsive evolution, not darwinism's series of lucky genetic accidents. Needless to say, I rejoice in them. \n\n \n As I said, \nI'm well aware that you consider many of these processes to be under volitional or intelligent control and \"therefore\" evidence for your EAM.\n I agree that there's nothing in EAM \"theory\" that couldn't accomodate those processes as the results of volitional and intelligent choices by organisms. The problem is whether your EAM ideas ever intersect with reality.\n \n You face two fundamental problems in all your posts that say \"Scientists found X, but X really proves EAM\". First, your blind spot never permits you to see that while you could fit X into EAM, X essentially never requires an EAM explanation, and can be nearly always be fitted equally well and equally consistently into the modern ToE. To prove EAM, you need results that are consistent with EAM but not with the modern ToE (and that needs to be the actual ToE, not your incorrectly understood version of it). \n \n The second problem is even larger: life fundamentally doesn't seem to work the way that you propose. When faced with a major problem beyond the capabilities of their inherent preexisting adaptive capabilities, organisms die, unless one or more of them is lucky enough to possess a mutation that can resolve the problem (or evades the problem by sheer good fortune). If one does happen to possess a useful mutation, its descendants can go on to replace the rest of the population. \n \n As an extension of #2, although organisms do have certain built-in responses to certain classes of regular crises (such as adaptive immune responses), there's no evidence that this sort of thing extends as far as you need it to. What organisms can do doesn't come anywhere near analyzing nylon and determining and effectuating an appropriate genetic tweak in order to be able to break down the new molecule, and EAM has particular difficulties in explaining how organisms can find or learn genetic solutions to once-in-a-lifetime crises, such as:\n # male courtship behavior in the species of praying mantises where the female eats the male, \n # deep-sea angler fish where the male commits to a parasitic existence on the female, \n # how an Ichneumon wasp captures a caterpillar of the right size, paralyzes it, and buries it alive in a burrow, with a single egg that will hatch, eat the caterpillar, and leave the burrow to repeat the process without ever learning anything from its parent, \n # development of egg mimicry and (to a slightly lesser and more complicated degree) song recognition in birds that parasitize other species nests,\n # synchronized hatching in insects, \n # synchronized cone opening in conifers, and synchronized flower opening in flowering plants. \n The ToE can explain all those very easily as being the result of the variations that worked, out of all the variations that got produced, where the variations result from genetic changes. You can claim that the genetic changes were intelligent and volitional and that creatures can learn appropriate responses by trial and error, but once-in-a-lifetime events don't permit learning about consequences, and in any case (as I said earlier), the creatures have no way of understanding and analyzing those sorts of problems and effectuating the appropriate genetic changes.", 
   {}, 
   289736, 
   null, 
   1194192180.0
  ], 
  [
   289793, 
   null, 
   "chemist99a", 
   "The problem with EAM is that its a theory without an advantage over TOE and its a theory without any visible mechanisms to support it as a process. There simply are no relevant studies linking genetic alterations to mental processes at least so far as this old chemist goes. Maybe WW has the studies in hand, but so far none has been presented. Forging that link (mental activity to DNA sequcence) is likely to be very darn difficult IMHO.", 
   {}, 
   289760, 
   null, 
   1194220140.0
  ], 
  [
   289851, 
   null, 
   "Peeling", 
   "The only thing of any note is that you once again assert that the nylon bug is evidence that adaptive traits can arise out of genetic accidents, without showing why I or anyone else should take your word for it. Therefore I still don't.\n\n \n I've shown you repeatedly why there's every reason to believe an RM nylonase gene would lead to the production of the nylonase enzyme. All it would take is for the organism to do what we observe it to do every other time it synthesises a protein. I'm obeying every constraint necessary to show that it's RM that is responsible for the trait: I'm keeping everything except the gene the same (the rest of the organism, the language it uses to synthesise proteins, everything) and extrapolating what would happen based upon countless empirical studies. It's really, really simple: look at what the organism does during protein synthesis, look at an RM nylonase gene, and make a straightforward deduction about what would happen next. I'm not even saying it's inevitable - I don't need to. I'm just saying it's possible.\n \n You're the one making the extraordinary claim here. You're saying that the organism would - without a shadow of a doubt - inevitably process an RM nylonase gene differently from every other gene it ever processes. You never say what it would do differently, and whenever I ask you to break down why, you bluster and complain and avoid the issue. \n \n The plain and obvious fact is that the organism is translating that gene into that protein according to the exact same rules it uses for synthesising every other protein. It's employing no new 'meaning' or 'understanding'; there are no 'words' altered or added to the language it uses for protein synthesis - these are empirical facts. You've agreed the gene can arise via RM, and my hypothesis concerning what would happen if nothing else changed agrees precisely with what we can see happening when nothing else has changed. My prediction of what that organism would do with that gene, all else remaining equal, is borne out in every detail by empirical observation.\n \n I'll make the same offer I've made before: we can sit down together and go through the gene one nucleotide at a time, assuming that neither the organism nor its ancestors had never encountered nylon waste, comparing what we each think the organism would do upon encountering those nucleotides during protein synthesis, and we can see where our opinions diverge and why. Isn't that fair enough?", 
   {}, 
   289617, 
   null, 
   1194265320.0
  ], 
  [
   289936, 
   null, 
   "bertvan", 
   "N.Wells:\nWhen faced with a major problem beyond the capabilities of their inherent preexisting adaptive capabilities, organisms die, unless one or more of them is lucky enough to possess a mutation that can resolve the problem (or evades the problem by sheer good fortune). If one does happen to possess a useful mutation, its descendants can go on to replace the rest of the population. \n\n \n Bertvan: How about<b></b>: When faced with a major problem beyond the capabilities of their inherent preexisting adaptive capabilities, organisms die, unless one or more of them successfully organizes a response that can resolve the problem, and passes that response on to some of its descendants.\n \n N.Wells:\nYou can claim that the genetic changes were intelligent and volitional and that creatures can learn appropriate responses by trial and error, but once-in-a-lifetime events don't permit learning about consequences, and in any case (as I said earlier), the creatures have no way of understanding and analyzing those sorts of problems and effectuating the appropriate genetic changes.\n\n \n Bertvan: The random mutation is the once-in-a-lifetime event. All an intelligently organized system needs is the ability to sense a threat to function, the creativity to explore new solutions, to recognize immediately whether a solution works, and keep searching. There is probably a limit where time runs out and the organism dies. But it sure would beat the once-in-a-lifetime random mutation. All the organism needs is the intelligence not to keep repeating failed solutions.\n \n \n http://30415.myauthorsite.com/ (questions about materialism)", 
   {
    "post_info": {
     "post_title": "Eam"
    }
   }, 
   289851, 
   null, 
   1194299520.0
  ], 
  [
   289948, 
   null, 
   "Peeling", 
   "Bertvan: How about<b></b>: When faced with a major problem beyond the capabilities of their inherent preexisting adaptive capabilities, organisms die, unless one or more of them successfully organizes a response\n\n \n ...thus creating a logical contradiction and the implosion of the universe ;)\n \n In a way, you're highlighting one of the fundamental contradictions inherent in EAM: why do organisms possess adaptive mechanisms if they can adapt without a mechanism?\n \n \nBut it sure would beat the once-in-a-lifetime random mutation. All the organism needs is the intelligence not to keep repeating failed solutions.\n\n \n Actually, if you do the maths it turns out that there is no real advantage to intelligently avoiding the repetition of failed solutions. I know, it sounds implausible, but let me walk you through the numbers:\n \n When observing the rate of occurrence of specific mutations in, say, bacteria, we might see something like 1 in 10^7 to 1 in 10^12 cell divisions. Let's pick a nice round representative example like 1 in ten billion: 1 in 10^10. Fair enough?\n \n Ok, so let's assume you're right, and bacteria remember and avoid repeating failed solutions. The odds of success in each attempt therefore improve slightly: 1 in 10,000,000,000, then 1 in 9,999,999,999, then 1 in 9,999,999,998 and so on. That's compared to the 'dumb luck' of random mutation which stays constant at 1 in 10,000,000,000.\n \n However, there might easily be a billion bacteria in the population, which means there'll be at most 40 generations before we would expect one of them to have hit on the solution (96% chance). And natural selection, once the solution has been found, will displace non-mutants in a relatively small number of generations. Being extremely generous we could allow 200 generations for this to happen.\n \n So at the very outside any one lineage of bacteria has about 300 generations in which to find a solution before it gets swamped by the descendents of a rival that found the solution already. So how much difference does remembering failed solutions make over 300 generations?\n \n The answer is: bugger all. Remembering failed solutions is of limited use when the odds of you picking the same solution twice at random is so very low anyway. \n \n Doing the maths, we find the odds of getting the solution if we remember failed attempts are 0.00000003, whereas if we don't bother and simply rely on the extreme improbability of accidentally picking the same failed solution twice, the odds are 0.000000029999999551500004455099966920888. That's a difference of just 0.000001495%. That's how much real-world statistical difference EAM's intelligence would make to an individual bacterium's survival chances, measured against blind luck. One and a half millionths of a percentage point.\n \n Note that it makes no difference at all to the survival chances of the colony - after 300 generations it's going to be composed almost entirely of mutants one way or another. The only difference it can make is how many of those bacteria found the solution themselves rather than inheriting it. So how much difference? It's hard to calculate exactly, but if we're super generous and give all 1,000,000,000 bacteria 300 generations (clearly over-the-top because of natural selection gradually displacing non-mutants), we find that the mean number of independently successful bacteria is 30 if we rely on blind luck. If we credit the bacteria with the intelligence to avoid repeating failed solutions, we can increase our expected number of successful bacteria by 0.000001495%, to... well, that's basically still 30. For intelligence to increase the expected number of independently successful bacteria by just one, we would need to use a starting population of 100,000,000,000,000,000 (one hundred million billion) bacteria - which is about 66.5 kilograms of raw e-coli.\n \n So here we have something for which there is no evidence at all making no appreciable difference whatsoever...", 
   {}, 
   289936, 
   null, 
   1194308040.0
  ], 
  [
   290192, 
   null, 
   "SLP", 
   "It is interesting to note that the EAM crowd (crowd of 2) has indicated that because volition is involved, organisms can essentially 'choose' at soem level whether or not to adapt, and that is why, for example, all of the bacteria ina colony exposed to antibiotic will not spontaneously adapt via resistence production.\n \n What a clever way of \"explaining\" why EAM is better than RM&NS...", 
   {}, 
   289948, 
   null, 
   1194561000.0
  ], 
  [
   296708, 
   null, 
   "Teleological", 
   "Hi,\n \n Is the nylon gene really the result of a frame-shift mutation? Or did it evolve from the EII' enzyme (a classical carboxylesterase) that had the ability to break down nylon oligomers (through amide hydrolysis) right from the start, albeit a very low capability (here), and gained an increase in activity towards the nylon oligomers through amino acid substitutions in the catalytic cleft containing the \"Ser-X-X-Lys\" motive?\n \n Here is the nucleotide sequence of EII' (original classical carboxylesterase with minimal nylon oligomer degrading potential). \n Here is the nucleotide sequence of EII (more potent nylon oligomer degrading enzyme).\n Here are the amino acid sequences of the two enzymes.\n EII'\n EII\n \n Translate the nucleotide sequences into amino acid sequences with The Virtual Ribosome and you will find the following.\n Sequence of EII'\n ATGAACACGCCCACCACCGGCTCGCACCCCGCCCGATACCCCAGCGCCGC CGCGGGTGAACCGACGCTCGACAGCTGGCAGGAGCCCCCGCACAACCGCT GGGCCTTCGCTCACCTCGGCGAGATGGTG\n CCCTCGGCAGCGGTCTCGCGGCGCCCGGTGAACGCGCCCGGTCATGCCCT CGCGCGGCTCGGCGCGATCG\n CGGCGCAGCTTCCCGACCTCGAACAGCGCCTCGAACAGACCTACACCGAC GCCTTCCTCGTGCTGCGCGG\n AACGGAGGTCGTGGCCGAGTACTACCGCGCCGGCTTCGCGCCCGACGACC GTCACCTGCTGATGAGCGTC\n TCGAAGTCGCTGTGCGGCACGGTCGTCGGAGCACTGGTCGACGAGGGGCG CATCGATCCCGCGCAGCCCG\n TCACCGAGTATGTACCCGAGCTCGCCGGCTCCGTCTACGACGGGCCCTCC GTGCTGCAGGTGCTCGACAT\n GCAGATCTCGATCGACTACAACGAGGACTACGTCGATCCCGCATCCGAGG TGCAGACCCACGGTCGCTCG\n GCCGGCTGGCGCACGCGCGCCACGGGCGACCCGGCCGACACCTACGAGTT CCTCACCACCCTCCGCGGCG\n ACGGCAGCACCGGCGAGTTCCAGTACTGCTCGGCGAACACCGACGTACTC GCCTGGATCGTCGAACGGGT\n CACCGGTCTGCGCTACGTCGAAGCGCTCTCCACGTACCTGTGGGCGAAGC TCGACGCCGACCGCGACGCT\n ACCATCACCGTCGACACGACGGGTTTCGGCTTCGCGCACGGCGGCGTCTC CTGCACGGCGCGGGATCTCG\n CGCGCGTGGGGCGCATGATGCTCGACGGCGGCGTCGCCCCCGGTGGCCGC GTGGTCTCCGAGGACTGGGT\n GCGTCGCGTACTCGCCGGCGGATCGCACGAGGCGATGACCGACAAGGGCT TCACGAACACCTTCCCCGAC\n GGCAGCTACACCCGCCAGTGGTGGTGCACGGGCAACGAGCGCGGCAACGT GAGCGGCATCGGCATCCACG\n GGCAGAATCTGTGGCTCGACCCGCTCACCGACTCGGTGATCGTCAAGCTG TCGTCGTGGCCCGATCCCGA\n CACCGAGCACTGGCACCGGCTGCAGAACGGGATCCTGCTCGACGTCAGCC GCGCGCTCGACGCAGTGTAG\n \n Sequence of EII.\n ATGAACGCACGTTCCACCGGCCAGCACCCCGCCAGGTATCCCGGAGCCGC GGCCGGGGAGCCGACACTCGACAGCTGGCAGGAGGCCCCGCACAACCGCT GGGCCTTCGCCCGCCTGGGCGAGCTGCT\n GCCCACGGCGGCGGTCTCCCGGCGCGACCCGGCGACGCCCGCGGAGCCCG TCGTGCGGCTCGACGCGCTC\n GCGACGCGGCTCCCCGATCTCGAGCAGCGGCTCGAGGAGACCTGCACCGA CGCATTCCTCGTGCTGCGCG\n GCTCCGAGGTCCTCGCCGAGTACTACCGGGCGGGTTTCGCACCCGACGAC CGTCACCTGCTGATGAGCGT\n CTCGAAGTCGCTGTGCGGCACGGTCGTCGGCGCGCTGATCGACGAGGGGC GCATCGATCCCGCGCAGCCC\n GTCACCGAGTATGTACCCGAGCTCGCGGGCTCCGTCTACGACGGGCCCTC CGTGCTGCAGGTGCTCGACA\n TGCAGATCTCGATCGACTACAACGAGGACTACGTCGATCCGGCCTCGGAG GTGCAGACCCACGATCGCTC\n CGCCGGCTGGCGCACGCGGCGAGACGGGGACCCCGCCGACACCTACGAGT TCCTCACCACCCTCCGCGGC\n GACGGCGGCACCGGCGAGTTCCAGTACTGCTCGGCGAACACCGACGTGCT CGCCTGGATCGTCGAGCGGG\n TCACCGGTCTGCGCTACGTCGAAGCGCTCTCCACGTACCTGTGGGCGAAG CTCGACGCCGATCGGGATGC\n GACCATCACGGTCGACCAGACCGGCTTCGGCTTCGCGAACGGGGGCGTCT CCTGCACCGCGCGGGATCTC\n GCACGCGTGGGCCGCATGATGCTCGACGGCGGCGTCGCTCCCGGCGGACG GGTCGTATCGCAGGGCTGGG\n TGGAAAGCGTGCTGGCCGGCGGCTCCCGCGAAGCCATGACCGACGAGGGT TTCACCTCCGCATTCCCCGA\n GGGCAGCTACACGCGCCAGTGGTGGTGCACGGGCAACGAGCGCGGCAACG TGAGCGGCATCGGCATCCAC\n GGCCAGAACCTCTGGCTCGATCCGCGCACCGACTCGGTGATCGTCAAGCT CTCGTCGTGGCCCGATCCCG\n ACACCCGGCACTGGCACGGGCTGCAGAGCGGGATCCTGCTCGACGTCAGC CGTGCCCTCGACGCGGTGTA\n G\n \n Comparing the sequences with any sequence alignment tool (e.g JAligner) notice that certain mutations are far more prevalent than others.\n E.g: (Assuming they happened in the transcribing strand)\n 18.5% of the mutations are C:G&#8594;G:C (C to G) transversions, 17.6% are A:T&#8594;G:C (A to G) transitions and 16.8% are G:C&#8594;C:G (G to C) transversions.\n \n So is it a frame shift mutation resulting in a completely new enzyme or a pre-existing 6-aminohexanoate-dimer hydrolase with low activity (0.5% that of EII (nylB)) towards nylon oligomers that gained an increase in activity towards the the oligomers through amino acid substitutions in the catalytic cleft containing the \"Ser-X-X-Lys\" motive.\n \n After BLASTing the EII' enzyme amino acid sequence, it can be seen that proteins with beta-lactam folds with 6-aminohexanoate-dimer hydrolytic activity (non-specific Ald amide hydrolysis) is spread throughout the bacterial and archaeal kingdoms. The accession code for the the EII' amino acid sequence is CAA26616 (or P07062) and the FASTA sequence can be used to search for similar sequences in other bacterial, archael and eukaryotic genomes at the NCBI BLAST site (with the BlastP program).", 
   {
    "unicode_changes_made": true
   }, 
   290192, 
   null, 
   1199979300.0
  ], 
  [
   296735, 
   null, 
   "Teleological", 
   "Check it out. There are 3 enzymes responsible for breaking the amide bond of different kinds of nylon oligomers.\n EI High homology with amidases present in a lot of strains of bacteria.\n EII (discussed above)\n EIII High homology with L-aminopeptidase/D-esterases present in many other bacteria. Use the peptide sequences of the enzymes and the NCBI BLAST site to verify it.\n \n So the enzymes responsible for nylon oligomer breakdown really is not anything novel. Besides, an enzyme capable of breaking the amide bond was all that was needed, and the chemical mechanism of amide hydrolysis is very similar to ester hydrolysis.", 
   {}, 
   296708, 
   null, 
   1199993580.0
  ], 
  [
   296784, 
   null, 
   "electrolyte", 
   "Is the nylon gene really the result of a frame-shift mutation?\n\n nylB is. Read.", 
   {}, 
   296708, 
   null, 
   1200025200.0
  ], 
  [
   296801, 
   null, 
   "Teleological", 
   "nylB is. Read.\n\n This discussion was in 2004, thank you it was interesting.\n Negoro et al. (2005) proposed that:\n \nHere, we propose that amino acid replacements in the catalytic cleft of a preexisting esterase with the beta-lactamase fold resulted in the evolution of the nylon oligomer hydrolase.\n\n Negoro S, Ohki T, Shibata N, Mizuno N, Wakitani Y et al. X-ray crystallographic analysis of 6-aminohexanoate-dimer hydrolase: molecular basis for the birth of a nylon oligomer-degrading enzyme. J Biol Chem 2005 Nov 25;280(47):39644-52\n \n And Okhi et al. (2006) again emphasizes this.\n \nBased upon the following findings, we propose that the nylon oligomer hydrolase has newly evolved through amino acid substitutions in the catalytic cleft of a pre-existing esterase with the beta-lactamase-fold.\n\n Ohki T, Wakitani Y, Takeo M, Yasuhira K, Shibata N, Higuchi Y, et al. Mutational analysis of 6-aminohexanoate-dimer hydrolase: relationship between nylon oligomer hydrolytic and esterolytic activities. FEBS Lett. 2006 Sep 18;580(21):5054-2058.\n \n Is the pre-existing esterase the result of a frame-shift mutation? Or was the classic esterase with beta-lactamase folds there from the start? Examine the the EII' enzyme with the The Virtual Ribosome  using different reading frames. \n Reading frame 3 produces the classical esterase.\n Reading frame 1, -1 and -3 produces strings with many stop codons.\n Reading frame 2, produces a string with no methionine start codon (although some proteins do not start with it) and no stop codon. No homologous proteins in bacteria could be found at the NCBI BLAST site.\n Reading frame -2, produces a string with no homologous proteins in bacteria at the NCBI BLAST site.\n Repeat the same with the EII gene and look at the results.\n \n The best explanation would be that \n \namino acid replacements in the catalytic cleft of a preexisting esterase with the beta-lactamase fold resulted in the evolution of the nylon oligomer hydrolase.\n\n And the preexisting esterase possessed 6-aminohexanoate-linear dimer hydrolytic activity at a low level.", 
   {}, 
   296784, 
   null, 
   1200043920.0
  ], 
  [
   296803, 
   null, 
   "pandion", 
   "<<shiver<< So your point is that it wasn't the mutation cited by electrolyte but another mutation? I'm not sure what you are driving at. Surely no one can be so ignorant as to claim creation or intelligent design.", 
   {}, 
   296801, 
   null, 
   1200044580.0
  ], 
  [
   296805, 
   null, 
   "Teleological", 
   "<<shiver<< So your point is that it wasn't the mutation cited by electrolyte but another mutation?\n\n The important mutations that increased EII' specificity towards the 6-aminohexanoate linear dimer are G181D, D370Y and H266N, and they are situated within the catalytic centre.\n Reference\n Ohki T, Wakitani Y, Takeo M, Yasuhira K, Shibata N, Higuchi Y, et al. Mutational analysis of 6-aminohexanoate-dimer hydrolase: relationship between nylon oligomer hydrolytic and esterolytic activities. FEBS Lett. 2006 Sep 18;580(21):5054-2058. \n \n \nI'm not sure what you are driving at.\n I'm just saying that the EII' enzyme was not the result of a frame-shift mutation, but\n \namino acid replacements in the catalytic cleft of a preexisting esterase with the beta-lactamase fold resulted in the evolution of the nylon oligomer hydrolase.\n \n\n \nSurely no one can be so ignorant as to claim creation or intelligent design.\n Why do you bring in creation or intelligent design?", 
   {}, 
   296803, 
   null, 
   1200045240.0
  ], 
  [
   296951, 
   null, 
   "electrolyte", 
   "Teleological, the best I can figure from your seemingly contradictory statements is that you don't think that EII' is the result of a frameshift mutation only because you think that EII' is a derivative of some esterase that itself was a result of a frameshift mutation. Is this an accurate representation of your position?", 
   {}, 
   296805, 
   null, 
   1200125520.0
  ], 
  [
   298610, 
   null, 
   "Teleological", 
   "Teleological, the best I can figure from your seemingly contradictory statements is that you don't think that EII' is the result of a frameshift mutation\n Yes\n \n only because you think that EII' is a derivative of some esterase\n Not only me.\n \nthat itself was a result of a frameshift mutation.\n I would be happy and accept it if it can be shown that the classical esterase (high homologous proteins present in many other bacteria and archaea) was indeed formed because of a frameshift mutation. It would be great if you/anyone could provide the accession code of the sequence of the preexisted coding sequence that originally specified a 472-residue-long arginine-rich protein. It would then be possible to search for homologous proteins and determine its original function and look at the frameshift mutation that resulted in the esterase (with that Virtual ribosome etc.).\n \nIs this an accurate representation of your position?\n Pretty much.", 
   {}, 
   296951, 
   null, 
   1201255500.0
  ], 
  [
   298732, 
   null, 
   "electrolyte", 
   "I would be happy and accept it if it can be shown that the classical esterase (high homologous proteins present in many other bacteria and archaea) was indeed formed because of a frameshift mutation.\n\n I'll come back to this after I look back over the data, if necessary.\n \n \nIt would be great if you/anyone could provide the accession code of the sequence of the preexisted coding sequence that originally specified a 472-residue-long arginine-rich protein.\n\n I'm sorry, I use understanding of biochemistry instead of relying entirely upon database searches. Why the hell isn't the huge sequence in the paper I cited sufficient for showing the relationship? Can you show that the alleged precursor esterase exists in the pOAD2 plasmid?\n \n \nPretty much.\n\n So either my way or your way, a functional protein was produced by a frameshift mutation?", 
   {}, 
   298610, 
   null, 
   1201341840.0
  ], 
  [
   298875, 
   null, 
   "Teleological", 
   "Why the hell isn't the huge sequence in the paper I cited sufficient for showing the relationship?\n Because I cannot find the exact PR.C. sequence as cited in the paper in any database. That is why I'm asking for help. Here is the pOAD2 plasmid sequence. Is this the right one?\n \n \nCan you show that the alleged precursor esterase exists in the pOAD2 plasmid?\n Yes, to be more precise, it is a classical carboxylesterase with B-lactamase folds that has high activity towards carboxylesters with short acyl chains and is also able to catalyze the breakdown of the 6-aminohexanoate linear dimer. \n EII'. \n Ohki T, Wakitani Y, Takeo M, Yasuhira K, Shibata N, Higuchi Y, et al. Mutational analysis of 6-aminohexanoate-dimer hydrolase: relationship between nylon oligomer hydrolytic and esterolytic activities. FEBS Lett. 2006 Sep 18;580(21):5054-2058..\n \n \nSo either my way or your way, a functional protein was produced by a frameshift mutation?\n Can you show it? I cannot find the exact sequence as cited by Ohno 1984...", 
   {}, 
   298732, 
   null, 
   1201468980.0
  ], 
  [
   308486, 
   null, 
   "electrolyte", 
   "So either my way or your way, a functional protein was produced by a frameshift mutation?\nCan you show it? I cannot find the exact sequence as cited by Ohno 1984...\n\n Find it here.", 
   {}, 
   298875, 
   null, 
   1208075880.0
  ], 
  [
   312012, 
   null, 
   "Teleological", 
   "Find it here.\n I have read the article, that is why I am looking for the database with the accession code of the sequence of the preexisting coding sequence that originally specified a 472-residue-long arginine-rich protein. None found so far.\n \n Thus, a normal pre-existing esterase.", 
   {}, 
   308486, 
   null, 
   1211922300.0
  ], 
  [
   312031, 
   null, 
   "electrolyte", 
   "I have read the article, that is why I am looking for the database with the accession code of the sequence of the preexisting coding sequence that originally specified a 472-residue-long arginine-rich protein. None found so far.\n \n Thus, a normal pre-existing esterase.\n\n I don't know what the problem is here. That paper has the actual coding sequence for the Arg-rich protein and overlays the shifted reading frame for comparison. Why exactly is this not sufficient?", 
   {}, 
   312012, 
   null, 
   1211943660.0
  ], 
  [
   312699, 
   null, 
   "Teleological", 
   "I don't know what the problem is here. That paper has the actual coding sequence for the Arg-rich protein and overlays the shifted reading frame for comparison. Why exactly is this not sufficient?\n\n Where is the data of the Arg-rich protein (other than the article)? Which database can it be found? If it is not in a database anywhere, why not? Why just in the paper? Surely this kind of data is important to be stored in a database. The sequence has no homology with any known functional protein, and as already been shown by others, EII evolved from a pre-existing esterase that had minimal nylonase activity. \n Do you see why this kind of information (published in an article) needs to be stored in a database? Techniques have improved much since 1984.", 
   {}, 
   312031, 
   null, 
   1212835980.0
  ], 
  [
   312713, 
   null, 
   "Collin", 
   "Where is the data of the Arg-rich protein (other than the article)? Which database can it be found? If it is not in a database anywhere, why not? Why just in the paper? Surely this kind of data is important to be stored in a database. The sequence has no homology with any known functional protein, and as already been shown by others, EII evolved from a pre-existing esterase that had minimal nylonase activity. \n Do you see why this kind of information (published in an article) needs to be stored in a database? Techniques have improved much since 1984.\n\n \n So, what if it's not found in a database? I have a hard time seeing how anything follows from that.", 
   {}, 
   312699, 
   null, 
   1212862200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Nylon Bug", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10555-nylon-bug.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10555, 
  "discussion_files": [
   [
    "15818.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10555-nylon-bug-print.html"
   ], 
   [
    "15819.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10555-nylon-bug-5-print.html"
   ], 
   [
    "15820.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10555-nylon-bug-4-print.html"
   ], 
   [
    "15821.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10555-nylon-bug-3-print.html"
   ], 
   [
    "15822.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10555-nylon-bug-2-print.html"
   ]
  ], 
  "identifier": 10555
 }
]