[
 [
  [
   289511, 
   null, 
   "jyoshu", 
   "\"You would have to have been hitchhiking across Siberia to have missed a striking new phenomenon: The atheists are back. Not just back, mind you, but globally parading in triumph across tv, bookstores, and the Internet. But don't be tongue-tied; an unlikely God Squad (including the flamboyant Al Sharpton) is taking them on.\"\n More at http://www.christianitytoday.com/ct/2007/october/46.110.html", 
   {
    "post_info": {
     "post_title": "A Thoughtful Article on the Current Surge by Atheists"
    }
   }, 
   null, 
   null, 
   1193937360.0
  ], 
  [
   289518, 
   null, 
   "lesz", 
   "Thoughtful? I don't think there was much thought put into that rant, but one has to consider the source -- certainly nothing novel there. However, it may be interesting to consider the actual replies, such as they are, to the atheists by the God Squad. It will be particularly interesting to see whether any of them are able to address the points made by atheists, rather than asserting some version of the Courtier's Reply to the effect that all atheists are blind XXXXXX who can't see the emperor's clothes.", 
   {}, 
   289511, 
   null, 
   1193940540.0
  ], 
  [
   289521, 
   null, 
   "jyoshu", 
   "Thoughtful? I don't think there was much thought put into that rant, but one has to consider the source -- certainly nothing novel there\n\n \n Considering the article viewed evangelical Christianity itself as one of the factors to have brought the rise in atheism on itself as a backlash, I'd hardly call it a \"rant.\"", 
   {}, 
   289518, 
   null, 
   1193941080.0
  ], 
  [
   289526, 
   null, 
   "jitobear", 
   "Its hardly a rant. Its also hardly seems to go anywhere. \n \n yawn", 
   {}, 
   289521, 
   null, 
   1193941980.0
  ], 
  [
   289532, 
   null, 
   "Waxy", 
   "Its hardly a rant. Its also hardly seems to go anywhere. \n \n yawn\n\n \n I'll second that.\n \n I think it was mostly an excuse for the author to plug his book \"currently in preparation\".\n \n Waxy", 
   {}, 
   289526, 
   null, 
   1193943060.0
  ], 
  [
   289544, 
   null, 
   "Zardoz", 
   "In terms of the institution of slavery in the western world,\" Zardoz retorts, \"it was absolutely fueled by a belief in God and a belief in manifest desitny and the supremacy of Christians over pagans. Had not there been this belief that there was a mandated right of dominance over all of Gods creation, the institution of slavery that you referred to would not have existed in the western world. Thus negating any civil rights movement in the first place.\n \n Had it not been for Christianity, Blacks would have been allowed to live their lives in peace and advance at their own pace in their native lands or, migrated to areas that didn't have a socio-religious institution of superior over inferior when it comes to humanity as a whole.\n \n In conclusion, Al Sharpton wouldn't have been forced through a process of conquest and centuries long slavery to have evolved into the race-baiting fake Christian human as he finds himself as today.\n\n \n This is fun!", 
   {}, 
   289532, 
   null, 
   1193954160.0
  ], 
  [
   289569, 
   null, 
   "trebor", 
   "\"You would have to have been hitchhiking across Siberia to have missed a striking new phenomenon: The atheists are back. Not just back, mind you, but globally parading in triumph across tv, bookstores, and the Internet. But don't be tongue-tied; an unlikely God Squad (including the flamboyant Al Sharpton) is taking them on.\"\n More at http://www.christianitytoday.com/ct/2007/october/46.110.html\n\n \n Sharpton doesn't have much credibility with me. I remember the Tawana Brawly case, and his two faced and deceitful behavior even when faced with the certain knowledge she had made up the story.", 
   {}, 
   289511, 
   null, 
   1193973840.0
  ], 
  [
   289612, 
   null, 
   "lesz", 
   "Considering the article viewed evangelical Christianity itself as one of the factors to have brought the rise in atheism on itself as a backlash, I'd hardly call it a \"rant.\"\n\n \n Well, OK, \"rant\" is perhaps a slight exaggeration. But as Jitobear pointed out, it wasn't actually going anywhere in rebuttal, just made some smart-assed remarks about them pesky atheists.\n \n As to whether evangelical Christianity is itself responsible for a non-believer backlash -- and believe me, it's not just restricted to us atheists -- you may very well have a point. There is something about religious excesses that causes people to think twice about religion.\n \n I think the religious political rot began to set in in earnest during the Terri Schiavo fiasco -- that's really when the Christian right over-reached its grasp in a way that hit everyone, believer or non-believer, in the gut, because that was a personal issue everyone could understand. The polls there were dead against them, but they plowed on regardless. But there were signs beforehand when the Intelligent Design Creationism movement began to sputter in its political campaign against science, though that one was much harder for the public to figure out.\n \n Had it not been for the militant Christianist ascendency in right-wing politics, I think you are probably right -- free thought would not have had its day in the sun, at least not in this way. While I don't think free thinking is a particularly strong threat to religion (its involvement in government is a far more serious one!), and an army of Dawkinses isn't going to make much of a dent in the religious fortress, it is helpful on the margins by providing an intellectual counterweight to theism for people in the middle, people who have Doubts about religious faith. There aren't very many of them, but they are probably more influential than their sheer numbers might suggest.", 
   {}, 
   289521, 
   null, 
   1194026220.0
  ], 
  [
   289623, 
   null, 
   "jim's trucking", 
   "I have but two observations regarding this unarguable topic (whether God exists or not).\n \n Al Sharpton will argue with anybody as long as he gets air time.\n \n If the number of books sold means anything at all regarding the authenticity of of the contents therein, all these atheist books put together do not hold a candle to the Bible. I can imagine that the Quran is not beneath them either.\n \n Your article says:\n \n In the past 12 months, atheist authors, according to The Wall Street Journal, have created a publishing sensation, selling more than 1 million books worldwide. These include: 500,000 hardcover copies of Richard Dawkins's The God Delusion (2006); 296,000 in sales for Christopher Hitchens's God Is Not Great: How Religion Poisons Everything (2007); 185,000 copies of Sam Harris's Letter to a Christian Nation (2006); 64,100 copies of Daniel C. Dennett's Breaking the Spell: Religion as a Natural Phenomenon (2006); and 60,000 copies of Victor J. Stenger's God: The Failed Hypothesis: How Science Shows That God Does Not Exist (2007).\n \n \n \n The Bible sales are:\n http://www.soon.org.uk/page19.htm\n \n \n \n ...and if the atheist book sales are meant to imply factual text within, every word in Gone with the Wind is true.\n \n The Top 10 Bestselling Books of All Time (according to IPL):\n \n 1. The Bible\n \"No one really knows how many copies of the Bible have been printed, sold, or \n distributed. The Bible Society's attempt to calculate the number printed \n between 1816 and 1975 produced the figure of 2,458,000,000. A more recent \n survey, for the years up to 1992, put it closer to 6,000,000,000 in more than \n 2,000 languages and dialects. Whatever the precise figure, the Bible is by far \n the bestselling book of all time.\" \n \n 2. Quotations from Chairman Mao Tse-tung (Little Red Book)\n \"Chairman Mao's Little Red Book could scarcely fail to become a bestseller: \n between the years 1966 and 1971 it was compulsory for every Chinese adult to \n own a copy.\" \n \n 3. American Spelling Book by Noah Webster\n \"First published in 1783, this reference book by the American man of letters \n Noah Webster (1758-1843) remained a bestseller in the U.S. throughout the 19th \n century.\" \n \n 4. The Guinness Book of Records\n \"First published in 1955, The Guinness Book of Records stands out as the \n greatest contemporary publishing achievement. There have now been 37 editions \n in the UK alone (it was not published annually until 1964), as well as numerous \n foreign-language editions.\" \n \n 5. The McGuffey Readers by William Holmes McGuffey\n \"Published in numerous editions from 1853, some authorities have put the total \n sales of these educational textbooks, originally compiled by American \n anthologist William Holmes McGuffey (1800-73), as high as 122,000,000. It has \n also been claimed that 60,000,000 copies of the 1879 edition were printed, but -\n since this is some 10,000,000 more than the entire population of the U.S. at \n that time - the publishers must have been extremely optimistic about its \n success.\" \n \n 6. A Message to Garcia by Elbert Hubbard\n \"Now forgotten, Hubbard's polemic on the subject of labor relations was \n published in 1899 and within a few years had achieved these phenomenal sales, \n largely because many American employers purchased bulk supplies to distribute \n to their employees.\" \n \n 7. The Common Sense Book of Baby and Child Care by Dr. Benjamin Spock\n \"Dr. Spock's 1946 manual became the bible of infant care for subsequent \n generations of parents. Most of the sales have been of the paperback edition of \n the book.\" \n \n 8. World Almanac\n \"Having been published annually since 1868 (with a break from 1876 to 1886), \n this wide-ranging reference book has remained a constant bestseller ever \n since.\" \n \n 9. The Valley of the Dolls by Jacqueline Susann\n \"This tale of sex, violence, and drugs by Jacqueline Susann (1921-74), first \n published in 1966, is perhaps surprisingly the world's bestselling novel. \n Margaret Mitchell's Gone With the Wind, which has achieved sales approaching \n 28,000,000, is its closest rival.\" \n \n 10. In His Steps: \"What Would Jesus Do?\" by Rev. Charles Monroe Sheldon\n \"Although virtually unknown today, American clergyman Charles Sheldon (1857-\n 1946) achieved fame and fortune with this 1896 instructive religious treatise \n on moral dilemnas.\"", 
   {}, 
   289612, 
   null, 
   1194034680.0
  ], 
  [
   289629, 
   null, 
   "Kronus", 
   "\n If the number of books sold means anything at all regarding the authenticity of of the contents therein, all these atheist books put together do not hold a candle to the Bible. \n \n\n \n If that were true. Of course, truth is not dependent upon wideness of distribution, so number of books sold does not, in fact, mean the least little bit in terms of authenticity. Sorry.", 
   {}, 
   289623, 
   null, 
   1194040320.0
  ], 
  [
   289630, 
   null, 
   "Waxy", 
   "If that were true. Of course, truth is not dependent upon wideness of distribution, so number of books sold does not, in fact, mean the least little bit in terms of authenticity. Sorry.\n\n \n I think Jim was actually agreeing with you...\n \n Waxy", 
   {}, 
   289629, 
   null, 
   1194040860.0
  ], 
  [
   289631, 
   null, 
   "Kronus", 
   "I think Jim was actually agreeing with you...\n \n Waxy\n\n \n Really? I'm pretty sure he was trying to say that the Bible must be the \"truest\" since it has the widest distribution. I could be wrong, of course. I'm quite certain there was sarcasm mixed in there; and sarcasm, unless used expertly, almost never increases understanding in a setting like this.", 
   {}, 
   289630, 
   null, 
   1194041280.0
  ], 
  [
   289697, 
   null, 
   "lesz", 
   "The Top 10 Bestselling Books of All Time (according to IPL):\n\n \n And only one of them worth squat... Webster's. Says a lot about American readership!", 
   {}, 
   289623, 
   null, 
   1194111720.0
  ], 
  [
   289714, 
   null, 
   "jim's trucking", 
   "I think Jim was actually agreeing with you...\n \n Waxy\nNow, I'm confused. Kronus' first post is after mine. Had I been agreeing with Kronus, Kronus would have to have spoken first. You could have more accurately said, \"I think Jim is in agreement with you.\"\n \n \nReally? I'm pretty sure he was trying to say that the Bible must be the \"truest\" since it has the widest distribution. I could be wrong, of course. \nPrecisely...you are wrong. \n I'm quite certain there was sarcasm mixed in there; and sarcasm, unless used expertly, almost never increases understanding in a setting like this.\nNot quite. The article appeared to correlate authenticity with sales. My statement was that IF this is applied, the Bible still wins hands down...along with many other publications. I personally wouldn't put any value in number of sales even if the article had claimed billions sold.\n \n \nAnd only one of them worth squat... Webster's. Says a lot about American readership!\nYour opinion here says even more about your sense of judgement.", 
   {}, 
   289697, 
   null, 
   1194129000.0
  ], 
  [
   289743, 
   null, 
   "lesz", 
   "Now, I'm confused. Kronus' first post is after mine. Had I been agreeing with Kronus, Kronus would have to have spoken first. You could have more accurately said, \"I think Jim is in agreement with you.\"\n \n Precisely...you are wrong. Not quite. The article appeared to correlate authenticity with sales. My statement was that IF this is applied, the Bible still wins hands down...along with many other publications. I personally wouldn't put any value in number of sales even if the article had claimed billions sold.\n \n Your opinion here says even more about your sense of judgement.\n\n \n I think the article was referring to unprecedentedly high sales of books written from an atheistic perspective. If it was making a point that high sales correlated to veracity, it escaped me. Certainly, the bible would be a contraindication of any such correlation. emoticon_xgood", 
   {}, 
   289714, 
   null, 
   1194176940.0
  ], 
  [
   289755, 
   null, 
   "Kronus", 
   " Not quite. The article appeared to correlate authenticity with sales. My statement was that IF this is applied, the Bible still wins hands down...along with many other publications. I personally wouldn't put any value in number of sales even if the article had claimed billions sold.\n\n \n Ah, I see. No, I think the article was trying to collelate sales with number of books sold. Which is to say, popularity and/or interest. The only conclusion they draw from the number is that they \"have created a publishing sensation\". There was no judgement on the content of the books there, they were just pointing out that alot of people are buying them.", 
   {}, 
   289714, 
   null, 
   1194186660.0
  ], 
  [
   289757, 
   null, 
   "lesz", 
   "Ah, I see. No, I think the article was trying to collelate sales with number of books sold. Which is to say, popularity and/or interest. The only conclusion they draw from the number is that they \"have created a publishing sensation\". There was no judgement on the content of the books there, they were just pointing out that alot of people are buying them.\n\n \n I don't even know whether this surge of interest represents a real backlash against religion, or whether the recent political dominance of the religious right has alerted free thinkers and non-nonbelievers to the fragility of their freedom from religion, so they have been made to scurry for ammo against religious zealots to man the barricades more effectively.\n \n I can't honestly see the spate of books by atheists shifting the opinions of True Believers at all, but they would have appeal to anyone looking for a means of resisting them.", 
   {}, 
   289755, 
   null, 
   1194191100.0
  ], 
  [
   289819, 
   null, 
   "obvious_child", 
   "What? Did that article intend to go anywhere? \n \n It made a few decent points but abruptly ended without providing much of substance. \n \n It reminded me of a 5th grade essay that was in its first draft form or a stream of thought of someone who was high.", 
   {}, 
   289757, 
   null, 
   1194229620.0
  ], 
  [
   289832, 
   null, 
   "samiinh", 
   "FWIW, I have read that the evangelicals are losing the next generation of true believers. They've been turned off by all the extremism.", 
   {}, 
   289819, 
   null, 
   1194232680.0
  ], 
  [
   289858, 
   null, 
   "Zardoz", 
   "FWIW, I have read that the evangelicals are losing the next generation of true believers. They've been turned off by all the extremism.\n\n \n I wish this were true but, from where I stand and what I've seen, the opposite appears to be true.\n While their support of the republican party could be wanning due to popular criticism against it (and most Evangelicals seem to jump on the populist band wagon at times) their numbers are increasing and it would be just a matter of time before they make a resurgence with an 'I told you so!'. Any negative geopolitical event will be used to support their beliefs that 'Tha Lawrd is commin' soon.'", 
   {}, 
   289832, 
   null, 
   1194270480.0
  ], 
  [
   289863, 
   null, 
   "samiinh", 
   "I wish this were true but, from where I stand and what I've seen, the opposite appears to be true.\n While their support of the republican party could be wanning due to popular criticism against it (and most Evangelicals seem to jump on the populist band wagon at times) their numbers are increasing and it would be just a matter of time before they make a resurgence with an 'I told you so!'. Any negative geopolitical event will be used to support their beliefs that 'Tha Lawrd is commin' soon.'\n\n \n What do you know about 2012?", 
   {}, 
   289858, 
   null, 
   1194271800.0
  ], 
  [
   289871, 
   null, 
   "Zardoz", 
   "What do you know about 2012?\n\n \n That I'll have successfully gained control of the US as the president. \n That I'll reinstitute construction of WMD's (including refurbishing the old stock piles that Pres. Bush et al. had dismantled).\n That all will be gainfilly employed in the militart industrial complex.\n That when suffecient weapons have been assembled, I'll destroy the moon.\n \n This is nothing new.\n I've made this statement before.\n \n I don't find it the least bit ironic that I'm asked about this specific year either. It's almost as if the population of the world is aware of my emminent coming...\n \n But, then again, all of humanity has been plagued by the moon for ages.\n Cursed thing that it is...\n \n emoticon_xbouncer \n \n Vote Zardoz in 2012\n Because accepting the lesser evils simply hasn't worked.", 
   {}, 
   289863, 
   null, 
   1194275340.0
  ], 
  [
   289893, 
   null, 
   "Waxy", 
   "Now, I'm confused. Kronus' first post is after mine. Had I been agreeing with Kronus, Kronus would have to have spoken first. You could have more accurately said, \"I think Jim is in agreement with you.\"\n\n \n Well that's the last time I try to help you out you old fuddy dud... :p \n \n Waxy", 
   {}, 
   289714, 
   null, 
   1194285900.0
  ], 
  [
   289928, 
   null, 
   "Jo Bennett", 
   "Vote Zardoz in 2012\n Because accepting the lesser evils simply hasn't worked.\n\n \n Zardoz=Cthulu. I have proof.", 
   {}, 
   289871, 
   null, 
   1194295020.0
  ], 
  [
   289952, 
   null, 
   "Matthew S", 
   "I have but two observations regarding this unarguable topic (whether God exists or not).\n \n Al Sharpton will argue with anybody as long as he gets air time.\n \n If the number of books sold means anything at all regarding the authenticity of of the contents therein, all these atheist books put together do not hold a candle to the Bible. I can imagine that the Quran is not beneath them either.\n \n Your article says:\n \n In the past 12 months, atheist authors, according to The Wall Street Journal, have created a publishing sensation, selling more than 1 million books worldwide. These include: 500,000 hardcover copies of Richard Dawkins's The God Delusion (2006); 296,000 in sales for Christopher Hitchens's God Is Not Great: How Religion Poisons Everything (2007); 185,000 copies of Sam Harris's Letter to a Christian Nation (2006); 64,100 copies of Daniel C. Dennett's Breaking the Spell: Religion as a Natural Phenomenon (2006); and 60,000 copies of Victor J. Stenger's God: The Failed Hypothesis: How Science Shows That God Does Not Exist (2007).\n \n \n \n The Bible sales are:\n http://www.soon.org.uk/page19.htm\n \n \n \n ...and if the atheist book sales are meant to imply factual text within, every word in Gone with the Wind is true.\n \n The Top 10 Bestselling Books of All Time (according to IPL):\n \n 1. The Bible\n \"No one really knows how many copies of the Bible have been printed, sold, or \n distributed. The Bible Society's attempt to calculate the number printed \n between 1816 and 1975 produced the figure of 2,458,000,000. A more recent \n survey, for the years up to 1992, put it closer to 6,000,000,000 in more than \n 2,000 languages and dialects. Whatever the precise figure, the Bible is by far \n the bestselling book of all time.\" \n \n 2. Quotations from Chairman Mao Tse-tung (Little Red Book)\n \"Chairman Mao's Little Red Book could scarcely fail to become a bestseller: \n between the years 1966 and 1971 it was compulsory for every Chinese adult to \n own a copy.\" \n \n 3. American Spelling Book by Noah Webster\n \"First published in 1783, this reference book by the American man of letters \n Noah Webster (1758-1843) remained a bestseller in the U.S. throughout the 19th \n century.\" \n \n 4. The Guinness Book of Records\n \"First published in 1955, The Guinness Book of Records stands out as the \n greatest contemporary publishing achievement. There have now been 37 editions \n in the UK alone (it was not published annually until 1964), as well as numerous \n foreign-language editions.\" \n \n 5. The McGuffey Readers by William Holmes McGuffey\n \"Published in numerous editions from 1853, some authorities have put the total \n sales of these educational textbooks, originally compiled by American \n anthologist William Holmes McGuffey (1800-73), as high as 122,000,000. It has \n also been claimed that 60,000,000 copies of the 1879 edition were printed, but -\n since this is some 10,000,000 more than the entire population of the U.S. at \n that time - the publishers must have been extremely optimistic about its \n success.\" \n \n 6. A Message to Garcia by Elbert Hubbard\n \"Now forgotten, Hubbard's polemic on the subject of labor relations was \n published in 1899 and within a few years had achieved these phenomenal sales, \n largely because many American employers purchased bulk supplies to distribute \n to their employees.\" \n \n 7. The Common Sense Book of Baby and Child Care by Dr. Benjamin Spock\n \"Dr. Spock's 1946 manual became the bible of infant care for subsequent \n generations of parents. Most of the sales have been of the paperback edition of \n the book.\" \n \n 8. World Almanac\n \"Having been published annually since 1868 (with a break from 1876 to 1886), \n this wide-ranging reference book has remained a constant bestseller ever \n since.\" \n \n 9. The Valley of the Dolls by Jacqueline Susann\n \"This tale of sex, violence, and drugs by Jacqueline Susann (1921-74), first \n published in 1966, is perhaps surprisingly the world's bestselling novel. \n Margaret Mitchell's Gone With the Wind, which has achieved sales approaching \n 28,000,000, is its closest rival.\" \n \n 10. In His Steps: \"What Would Jesus Do?\" by Rev. Charles Monroe Sheldon\n \"Although virtually unknown today, American clergyman Charles Sheldon (1857-\n 1946) achieved fame and fortune with this 1896 instructive religious treatise \n on moral dilemnas.\"\n\n \n JUst because a book has sold a lot does not make it true. Look at valley of the dolls for example http://home.comcast.net/~antaylor1/bestsellingbooks.html more then 30 million copies sold. Would you say valley of the dolls was a true story?", 
   {}, 
   289623, 
   null, 
   1194312360.0
  ], 
  [
   289959, 
   null, 
   "Kronus", 
   "JUst because a book has sold a lot does not make it true. Look at valley of the dolls for example http://home.comcast.net/~antaylor1/bestsellingbooks.html more then 30 million copies sold. Would you say valley of the dolls was a true story?\n\n \n I fell for the same mistake. Apparently Jim was not trying to draw that conclusion, but he did think the article was. He was trying to show that book sales don't relate to veracity of the text; although I'm still fuzzy on why he thought the article was saying that.", 
   {}, 
   289952, 
   null, 
   1194313500.0
  ], 
  [
   290013, 
   null, 
   "lesz", 
   "BTW, there's a video of Dawkins' address to the US Atheists Alliance convention here. It talks about the impact of the recent books by atheists, defends himself against his critics, and discusses what atheists should aspire to do now. It's not the best talk I've ever heard, but it has some great moments.", 
   {}, 
   289959, 
   null, 
   1194368580.0
  ], 
  [
   290021, 
   null, 
   "jim's trucking", 
   "JUst because a book has sold a lot does not make it true. Look at valley of the dolls for example http://home.comcast.net/~antaylor1/bestsellingbooks.html more then 30 million copies sold. Would you say valley of the dolls was a true story?\nI believe I have already answered that. Who's on first?\n \n \nI fell for the same mistake. Apparently Jim was not trying to draw that conclusion, but he did think the article was. He was trying to show that book sales don't relate to veracity of the text; although I'm still fuzzy on why he thought the article was saying that.\nConfusing, yes?\n \n It starts with a sub-headline claiming that a fourfold god squad has taken on Dawkins et al...then goes into saying I'd have to have been in Siberia not to notice the deluge of books by atheists. (Quite the contrary, I just have to have not noticed them in the bookstores I frequent.) Then he goes into a list of sales as if to say the sheer volume represents some success relative to the basic arguments presented therein.\n \n It just appeared to me that the author was attaching some imagined validity to the atheist books by virtue of their relatively high sales.", 
   {}, 
   289959, 
   null, 
   1194372840.0
  ], 
  [
   290026, 
   null, 
   "lesz", 
   "I believe I have already answered that. Who's on first?\n \n Confusing, yes?\n \n It starts with a sub-headline claiming that a fourfold god squad has taken on Dawkins et al...then goes into saying I'd have to have been in Siberia not to notice the deluge of books by atheists. (Quite the contrary, I just have to have not noticed them in the bookstores I frequent.) Then he goes into a list of sales as if to say the sheer volume represents some success relative to the basic arguments presented therein.\n \n It just appeared to me that the author was attaching some imagined validity to the atheist books by virtue of their relatively high sales.\n\n \n Yes, yes... I see. That would explain why the title of the piece was \"Puncturing Atheism\", with subheadings such as \"Riposting with God-Haters\"; and why the author made disparaging remarks about atheist authors such as: \"ex-Englishman Hitchens (who once provoked left-wing British mp George Galloway into calling him 'a drink-sodden, former Trotskyist popinjay') supports Bush on Iraq, opposes abortion, but considers being a Christian comparable to citizenship in North Korea.\"\n \n The author went on to comment favorably on pro-Christian books, including a plug for his own, and concluded:\n \"Christians have nothing to fear from the new atheist surge. We evangelicals, in our advocacy for the gospel, also have no need for blunt weaponry.\"\n Well, he's probably right they have nothing to fear. I'm just puzzled why anyone who had read the piece would have concluded that this article, published in Christianity Today, was remotely favourable to atheists? emoticon_confused", 
   {}, 
   290021, 
   null, 
   1194374280.0
  ], 
  [
   290047, 
   null, 
   "obvious_child", 
   "Zardoz=Cthulu. I have proof.\n\n \n Good. Let's finally change our voting patterns and stop voting for the lesser evil.", 
   {}, 
   289928, 
   null, 
   1194391020.0
  ], 
  [
   290052, 
   null, 
   "jim's trucking", 
   "Yes, yes... I see. That would explain why the title of the piece was \"Puncturing Atheism\", with subheadings such as \"Riposting with God-Haters\"; and why the author made disparaging remarks about atheist authors such as: \"ex-Englishman Hitchens (who once provoked left-wing British mp George Galloway into calling him 'a drink-sodden, former Trotskyist popinjay') supports Bush on Iraq, opposes abortion, but considers being a Christian comparable to citizenship in North Korea.\"\n \n The author went on to comment favorably on pro-Christian books, including a plug for his own, and concluded:\n \"Christians have nothing to fear from the new atheist surge. We evangelicals, in our advocacy for the gospel, also have no need for blunt weaponry.\"\n Well, he's probably right they have nothing to fear. I'm just puzzled why anyone who had read the piece would have concluded that this article, published in Christianity Today, was remotely favourable to atheists? emoticon_confused\nI don't think I claimed he was favorable to atheists...just that he attributed some value (or argued that someone may be attributing credibility) to the contents of hot selling books based upon numbers sold. There is no correlation.", 
   {}, 
   290026, 
   null, 
   1194392760.0
  ], 
  [
   290082, 
   null, 
   "lesz", 
   "I don't think I claimed he was favorable to atheists...just that he attributed some value (or argued that someone may be attributing credibility) to the contents of hot selling books based upon numbers sold. There is no correlation.\n\n \n Well, I didn't read that claim into what the religious author of the article wrote, and i don't think anyone else made such a claim here. Maybe some folk have done elsewhere -- for example, I have seen Christians brag that the bible is on the all-time best-seller list as though this were relevant to its credibility. (Can 2 billion people be wrong? Of course they can!) But, no, I don't think any reasonable person would dispute that there is little correlation between the popularity of some work of literature and its credibility, or even the credulity of the readers. Lots of people, for example, have read the Harry Potter series without being deluded that the story is true.\n \n My beef with the article was it was basically a fluff piece that didn't say anything of any interest of its own. I'm not sure why an entire board was devoted to it, unless to discuss the relative merits of theist vs. atheist cases, which would have to go well beyond anything in the article itself.", 
   {}, 
   290052, 
   null, 
   1194445560.0
  ], 
  [
   290086, 
   null, 
   "lesz", 
   "BTW, I do find it interesting that the article author felt it necessary to describe atheists as \"God-Haters\". Now, I haven't read a word of Hitchens, whom the article excoriated, so i can't say for sure whether Hitchens hates god or not, but i have read a lot of Dawkins, and nowhere in his writings have i ever seen any expression of hatred for god.\n \n Methinks the theists over-rate themselves, and delude themselves into thinking that the only reason anyone could criticise them or their reasoning is because that person \"hates god\". It is, of course, hard to hate what one believes doesn't exist. Actually, it's impossible. One might as well hate the Easter Bunny as god -- a pointless exercise. It's really the institution of religion that is being rejected here, and all its evil manifestations. God is almost a separate issue, and exists or not irrespective of anything any religion might say.", 
   {}, 
   290082, 
   null, 
   1194448620.0
  ], 
  [
   290099, 
   null, 
   "MrWriteLA", 
   "BTW, I do find it interesting that the article author felt it necessary to describe atheists as \"God-Haters\".\n It's the same kind of sneering bully mentality that turns war opponents into \"America haters\" or Democrats into \"Bush haters.\" Just another sample of the Coulter/Limbaugh/O'Reilly level of schoolyard hyperbole that public discourse in this country has sunk to over the last few decades.", 
   {}, 
   290086, 
   null, 
   1194455280.0
  ], 
  [
   290109, 
   null, 
   "sinjin", 
   "It's the same kind of sneering bully mentality that turns war opponents into \"America haters\" or Democrats into \"Bush haters.\" Just another sample of the Coulter/Limbaugh/O'Reilly level of schoolyard hyperbole that public discourse in this country has sunk to over the last few decades.\nI believe the tradition goes back considerably further.", 
   {}, 
   290099, 
   null, 
   1194461520.0
  ], 
  [
   290125, 
   null, 
   "samiinh", 
   "BTW, I do find it interesting that the article author felt it necessary to describe atheists as \"God-Haters\". Now, I haven't read a word of Hitchens, whom the article excoriated, so i can't say for sure whether Hitchens hates god or not, but i have read a lot of Dawkins, and nowhere in his writings have i ever seen any expression of hatred for god.\n \n Methinks the theists over-rate themselves, and delude themselves into thinking that the only reason anyone could criticise them or their reasoning is because that person \"hates god\". It is, of course, hard to hate what one believes doesn't exist. Actually, it's impossible. One might as well hate the Easter Bunny as god -- a pointless exercise. It's really the institution of religion that is being rejected here, and all its evil manifestations. God is almost a separate issue, and exists or not irrespective of anything any religion might say.\n\n \n How can you hate something that doesn't exist?", 
   {}, 
   290086, 
   null, 
   1194480120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A Thoughtful Article on the Current Surge by Atheists", 
  "url": "http://www.4forums.com/political/religion-debates/10574-thoughtful-article-current-surge-atheists.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10574, 
  "discussion_files": [
   [
    "31571.html", 
    "http://www.4forums.com/political/religion-debates/10574-thoughtful-article-current-surge-atheists-print.html"
   ], 
   [
    "31572.html", 
    "http://www.4forums.com/political/religion-debates/10574-thoughtful-article-current-surge-atheists-3-print.html"
   ], 
   [
    "31573.html", 
    "http://www.4forums.com/political/religion-debates/10574-thoughtful-article-current-surge-atheists-2-print.html"
   ]
  ], 
  "identifier": 10574
 }
]