[
 [
  [
   289772, 
   null, 
   "bertvan", 
   "There are two ways to view reality. Materialists see the universe as a complex machine, driven by immutable, deterministic forces. Such a universe could only change by accident. (random mutations)\n \n Non-materialists see volition, free will, intelligence and purposeful creativity as intrinsic aspects of reality. As human traits, they appear obvious to most of us, but materialists argue that even in humans they are an illusion. Materialism cannot deal with unpredictable phenomena and their existence must be denied. \n \n The question of whether or not volition, free will, intelligence and purposeful creativity exist as forces of nature cannot be answered scientifically. They do not take up space, and their observable effects can only be predicted statistically. I don't know if non-materialists are a majority, but they certainly comprise a sizeable segment of the population. Neither materialism nor non-materialism should be imposed upon society as \"truth\".\n \n Panpsychism proposes that freewill, subjective choice and purposeful creativity have always been intrinsic ingredients of reality. The \"laws\" of nature are merely entrenched habits of a spontaneous, volitional, creative reality. \"Laws\" concerning inanimate matter are habits so entrenched that deviations cannot be detected by existing measuring methods (except perhaps at the quantum level). Biological systems, on the other hand, all retain some observable ability to respond creatively and purposefully. The universe is an intelligent democracy in the process of designing itself. The \"design\" of inanimate matter may be pretty entrenched by this time, but living organisms are still to some extent a design in process. \n \n Self-sacrifice, a sense that the whole is more important than individuals, is characteristic of many religions. So if the myths and gods invented by religion to explain the apparent purposefulness of nature were naïve, religion may still be closer to the truth than materialism. \n \n http://30145.myauthorsite.com/ (questions about materialism)", 
   {
    "post_info": {
     "post_title": "Materialism"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1194202980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Materialism", 
  "url": "http://www.4forums.com/political/philosophy-debates/10586-materialism.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 10586, 
  "discussion_files": [
   [
    "2720.html", 
    "http://www.4forums.com/political/philosophy-debates/10586-materialism-print.html"
   ]
  ], 
  "identifier": 10586
 }
]