[
 [
  [
   289632, 
   null, 
   "robbie0517", 
   "Help us all if this man get's elected president. \n \n http://www.pinknews.co.uk/news/articles/2005-5944.html\n \n \nA candidate for the Republican party nomination for President of the United States has said that he thinks a child would be better off with a dead parent rather than a gay one. \n \n Mitt Romney, a former Governor of Massachusetts, was speaking at a college in rural Iowa. \n \n Asked what he would say to a gay couple wanting to get married, he pointed out his support for a change to the US Constitution to bar gay and lesbian Americans from marriage. \n \n \"I believe that maintaining the strength of the marriage relationship, the family relationship, is critical to the strength of an entire society,\" he said, according to Rocky Mountain News.\n \n \"And I believe that the development of children is enhanced by having a male and a female as part of their upbringing in their home. \n \n \"Even when there's a divorce, you still have a mom and a dad. \n \n \"And even where one member of the partnership may pass away, the memory and the characteristics of that gender, of that partner influence the development of a child.\n \n \"I'm in favour of promoting, as a society, the marriage of men and women and the development of children in that kind of setting.\"\n \n Mr Romney is attempting to portray himself as more conservative than his Republican opponents on the issue of gay marriage. \n \n The leading candidate, former Mayor of New York Rudy Guiliani, is pro-gay rights. \n \n Massachusetts is the only state in America to have legalised gay marriage. \n \n This was not the work of Mr Romney, a Mormon who once worked as a missionary in France. \n \n The Supreme Court of Massachusetts established the right of gay and lesbian couples to marry.\n \n American liberals are worried about the candidacy of a member of The Church of Jesus Christ of Latter-day Saints.\n \n Mormons believe that homosexuality, and homosexual desire, are sinful. \n \n The church has opposed all efforts in America to legalise same-sex marriage or civil unions.\n \n Mr Romney has experience in state government and in business: he was the CEO of the 2002 Winter Olympics in Salt Lake City.\n \n However, he has no experience in Congress, or international politics. \n \n This may not be a barrier, as four out of the last five Presidents have come to Washington straight from state politics. \n \n Last December it was revealed that Mr Romney once courted the gay community for their support in a 1994 campaign for the US Senate.\n \n In a letter, published by Massachusetts newspaper Bay Windows, he promises to represent his gay and lesbian constituents.\n \n \"I think the gay community needs more support from the Republican Party, and I would be a voice in the Republican Party to foster anti-discrimination efforts,\" he wrote.\n \n The revelation angered conservatives in the US.\n \n The Republican candidate will be announced at the party's convention at the start of September 2008.\n \n The Presidential election will be held on 4th November 2008 and a new President will take office on 20th January 2009.\n", 
   {
    "post_info": {
     "post_title": "Dead parents better than gay ones says Romney"
    }
   }, 
   null, 
   null, 
   1194045240.0
  ], 
  [
   289636, 
   null, 
   "Kronus", 
   "He's really in a jam. Even though accountability is not something conservatives worry about much these days, it's still the fact Massachusetts became the only state in the union to legalize gay marriage while it was his watch. I guess he feels he has to go overboard about how much he really, really, REALLY doesn't support gay marriage to try to overcome that \"taint\".", 
   {}, 
   289632, 
   null, 
   1194046440.0
  ], 
  [
   289699, 
   null, 
   "Phyllis", 
   "He's really in a jam. Even though accountability is not something conservatives worry about much these days, it's still the fact Massachusetts became the only state in the union to legalize gay marriage while it was his watch. I guess he feels he has to go overboard about how much he really, really, REALLY doesn't support gay marriage to try to overcome that \"taint\".\n\n He's going to downplay that development by claiming that it was not \"Massachusetts\" that legalized gay marriage, but rather it was a judiciary run amok. In all reality, there was absolutely nothing he could have done to prevent the legalization of gay marriage through the avenue of the judiciary. So, he will simply keep bringing up the fact that the judiciary made that decision, not the people of Massachusetts. That is a position that plays well to a conservative base.", 
   {}, 
   289636, 
   null, 
   1194112620.0
  ], 
  [
   289700, 
   null, 
   "JSDKoeln", 
   "He's really in a jam. Even though accountability is not something conservatives worry about much these days, it's still the fact Massachusetts became the only state in the union to legalize gay marriage while it was his watch. I guess he feels he has to go overboard about how much he really, really, REALLY doesn't support gay marriage to try to overcome that \"taint\".\n\n \n He's pandering to the super-social conservatives. Quite honestly, if he does get the nomination, any Democratic nominee will have pretty much smooth sailing... even if it's Hillary. And, quite honestly, I'm disappointed in all of the candidates, on both sides. We need a strong 3rd and 4th party to shake things up and get some real change going. What's that old saying: If you do what you've always done, you're gonna get what you've always gotten. \n \n Both parties are just \"same 'ol\".", 
   {}, 
   289636, 
   null, 
   1194113100.0
  ], 
  [
   289701, 
   null, 
   "Kronus", 
   "He's going to downplay that development by claiming that it was not \"Massachusetts\" that legalized gay marriage, but rather it was a judiciary run amok. In all reality, there was absolutely nothing he could have done to prevent the legalization of gay marriage through the avenue of the judiciary. So, he will simply keep bringing up the fact that the judiciary made that decision, not the people of Massachusetts. That is a position that plays well to a conservative base.\n\n \n Except the facts don't seem to be bearing that theory out, are they? I haven't been following his campaign closely, but I haven't caught any mention about the alleged \"runaway judiciary\". It's just alot of, \"Boy, gays sure shouldn't have the same rights as other people, boy howdy!\" If you have been following him and could link to anything that shows him critisizing the judiciary please supply a link, I'd like to see what he's saying.", 
   {}, 
   289699, 
   null, 
   1194113880.0
  ], 
  [
   289702, 
   null, 
   "Phyllis", 
   "Except the facts don't seem to be bearing that theory out, are they? I haven't been following his campaign closely, but I haven't caught any mention about the alleged \"runaway judiciary\". It's just alot of, \"Boy, gays sure shouldn't have the same rights as other people, boy howdy!\" If you have been following him and could link to anything that shows him critisizing the judiciary please supply a link, I'd like to see what he's saying.\n\n I haven't been following the Romney campaign, but I do recall seeing on c-span a speech that he gave about this. I'll see if I can track something down.\n \n UPDATE:\n \n A quick jump over to the Mitt Romney campaign site produced this video clip:\n \n http://mitt-tv.mittromney.com/?showid=64626\n \n I think that might load somewhat slow.\n \n Also, here's an example from an ad that Romney is running:\n \n http://www.youtube.com/watch?v=pGAX8lw-OUo", 
   {}, 
   289701, 
   null, 
   1194116820.0
  ], 
  [
   289708, 
   null, 
   "Kronus", 
   "I haven't been following the Romney campaign, but I do recall seeing on c-span a speech that he gave about this. I'll see if I can track something down.\n \n UPDATE:\n \n A quick jump over to the Mitt Romney campaign site produced this video clip:\n \n http://mitt-tv.mittromney.com/?showid=64626\n \n I think that might load somewhat slow.\n \n Also, here's an example from an ad that Romney is running:\n \n http://www.youtube.com/watch?v=pGAX8lw-OUo\n\n \n Ok then. The you-tube clip even had the phrase \"activist judge\". Thanks for posting that.", 
   {}, 
   289702, 
   null, 
   1194122640.0
  ], 
  [
   289758, 
   null, 
   "lesz", 
   "I just can't see the Christian right voting for Romney. It's bad enough that he's had a very checkered record on abortion and gay rights, being for them before he was against them, but the telling factor is he's a Mormon. I can't imagine they'd ever be able to overlook his paganism!", 
   {}, 
   289708, 
   null, 
   1194191280.0
  ], 
  [
   289759, 
   null, 
   "lesz", 
   "Ok then. The you-tube clip even had the phrase \"activist judge\". Thanks for posting that.\n\n \n Romney's just exploiting the knee jerk right-wing habit of calling every court decision they don't like \"judicial activism\". Just as they call Mrs. Clinton a \"liberal\". These words no longer have any meaning beyond \"I really hate that!\"", 
   {}, 
   289708, 
   null, 
   1194191400.0
  ], 
  [
   289770, 
   null, 
   "Kronus", 
   "Romney's just exploiting the knee jerk right-wing habit of calling every court decision they don't like \"judicial activism\". Just as they call Mrs. Clinton a \"liberal\". These words no longer have any meaning beyond \"I really hate that!\"\n\n \n Sure. I just thought they had outgrown the habit. Clearly not. :)", 
   {}, 
   289759, 
   null, 
   1194202380.0
  ], 
  [
   289775, 
   null, 
   "jyoshu", 
   "\"Dead parents better than gay ones says Romney\"\n\n \n While it's clear that Romney is against gay marriage, where are you getting the idea here that Romney is saying dead parents are better than gay ones? Nowhere does he compare the two and/or make the argument that one is better than the other.", 
   {}, 
   289632, 
   null, 
   1194212760.0
  ], 
  [
   289778, 
   null, 
   "Kronus", 
   "While it's clear that Romney is against gay marriage, where are you getting the idea here that Romney is saying dead parents are better than gay ones? Nowhere does he compare the two and/or make the argument that one is better than the other.\n\n \n Right there in the article.\n \n \"And even where one member of the partnership may pass away, the memory and the characteristics of that gender, of that partner influence the development of a child.\"\n \n Even if your parent dies, you still get the \"benefit\" of two genders. Gay parents? You're out of luck. Better to have had a parent die then to be raised by gays.", 
   {}, 
   289775, 
   null, 
   1194214080.0
  ], 
  [
   289782, 
   null, 
   "JSDKoeln", 
   "Right there in the article.\n \n \"And even where one member of the partnership may pass away, the memory and the characteristics of that gender, of that partner influence the development of a child.\"\n \n Even if your parent dies, you still get the \"benefit\" of two genders. Gay parents? You're out of luck. Better to have had a parent die then to be raised by gays.\n\n \n I was raised by gay parents.... It was a much safer, non-violent, loving and better place than anything my biological parents were able to provide.\n \n When I think about it... I had a friend named Bruce in high school. Wonderful talent with a big booming baritone/tenor voice. Had a lot of potential to take his talent somewhere great. He grew up mormon. He tried dating a girl in high school, but ended up a disaster. The girl figured out Bruce was gay. \n \n Bruce was mormon.\n \n I say \"was\", because, after he was kicked out of his family and excommunicated from the mormon church, he hung himself.\n \n Mormon family values.\n \n Romney is a clueless twit.", 
   {}, 
   289778, 
   null, 
   1194214860.0
  ], 
  [
   289784, 
   null, 
   "jyoshu", 
   "Right there in the article.\n \n \"And even where one member of the partnership may pass away, the memory and the characteristics of that gender, of that partner influence the development of a child.\"\n\n \n Ah, I didn't make that connection on the first read. Thanks; good job.", 
   {}, 
   289778, 
   null, 
   1194215460.0
  ], 
  [
   289797, 
   null, 
   "Charliegone", 
   "Right there in the article.\n \n \"And even where one member of the partnership may pass away, the memory and the characteristics of that gender, of that partner influence the development of a child.\"\n \n Even if your parent dies, you still get the \"benefit\" of two genders. Gay parents? You're out of luck. Better to have had a parent die then to be raised by gays.\n\n \n I still do not understand where you getting this from. This statement alone can be applied either way. Seems to me your knee jerking here..anyways as an ex-Mormon and Libertarian views, I wouldn't vote for this guy ever.", 
   {}, 
   289778, 
   null, 
   1194222120.0
  ], 
  [
   289807, 
   null, 
   "jyoshu", 
   "I still do not understand where you getting this from. This statement alone can be applied either way. Seems to me your knee jerking here..anyways as an ex-Mormon and Libertarian views, I wouldn't vote for this guy ever.\n\n \n I think Kronos and Robbie are right, in this case. Romney is basically saying that both genders are superior to a gay couple parenting even in the case of a deceased parent. While he didn't come out and directly assert that 'dead parents are better than gay ones', there's no way to to NOT infer it from what he said. \n \n It's my understanding that there is no reason to assume, from any studies, that two parents of the same gender would be any less effective in terms of good parenting than opposite-sex ones. The important thing is that kids have loving and nurturing parents.", 
   {}, 
   289797, 
   null, 
   1194226500.0
  ], 
  [
   289824, 
   null, 
   "samiinh", 
   "Romney is an idiot. When asked why his sons weren't in Iraq fighting for democracy, he said they were doing a more important thing...trying to get him elected. What an ego. Fortunately, he is going to go nowhere once the voting starts.", 
   {}, 
   289807, 
   null, 
   1194230280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Dead parents better than gay ones says Romney", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10583-dead-parents-better-than-gay-ones-says-romney.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10583, 
  "discussion_files": [
   [
    "12696.html", 
    "http://www.4forums.com/political/gay-rights-debates/10583-dead-parents-better-than-gay-ones-says-romney-print.html"
   ], 
   [
    "12697.html", 
    "http://www.4forums.com/political/gay-rights-debates/10583-dead-parents-better-than-gay-ones-says-romney-2-print.html"
   ]
  ], 
  "identifier": 10583
 }
]