[
 [
  [
   289852, 
   null, 
   "Symbiote", 
   "Remember, remember the Fifth of November, \n The Gunpowder Treason and Plot, \n I know of no reason \n Why Gunpowder Treason \n Should ever be forgot. \n Guy Fawkes, Guy Fawkes, t'was his intent \n To blow up King and Parliament. \n Three-score barrels of powder below \n To prove old England's overthrow; \n By God's providence he was catch'd \n With a dark lantern and burning match. \n Holloa boys, holloa boys, let the bells ring. \n Holloa boys, holloa boys, God save the King! \n \n \n \n About a month ago, some random Ron Paul supporter created the website http://www.thisnovember5th.com/ encouraging people to donate to the campaign on November 5th, in a tie in with the 1605 attempt of Guy Fawkes' plan to blow up the British parliament with gunpowder and the V for Vendetta movie. Various related blogs and websites distributed the message, and well, November 5th is now here. As of 5am there have been $425,000 donated so far. http://ronpaulgraphs.com/yesterday_vs_today_line.html Anyone want to bet on what it will reach in total? About $2 million would seem reasonable, which is incredible for a single day of fundraising, given that's about what Huckabee has managed to pick up in the last 4 months.\n \n I'm amazed that this kind of effort has been spontaneously organised via the internet with no central direction, just a basic website and a popular theme.\n \n Total donations for the last 1 month 5 days stand at $3.5 million, plus the offline donations posted in the last 10 days; well on the way to reach $10 million + this quarter, right up there with romney, giuliani, fred thompson.", 
   {
    "post_info": {
     "post_title": "Remember, remember the 5th of November.."
    }
   }, 
   null, 
   null, 
   1194266100.0
  ], 
  [
   289880, 
   null, 
   "gamehuis", 
   "I'm following the Ron Paul donation bombing event very closely. Like you, I'm also amazed that such a well coordinated effort can be organized through the Internet. \n Right now the money counter has reached a total of over $4 million.\n At this pace, the amount raised for just this day will be just under $2 million, which utterly obliterates Obama's $1 million in one day.\n \n Hopefully this event will also generate some extra coverage by the media (i.e. free advertising) and save Dr. Paul even more money.\n \n When this day is over, Dr. Paul will probably look something like this: \n \n http://www.newsgroper.com/w/wp-content/uploads/ap070503035936.jpg", 
   {}, 
   289852, 
   null, 
   1194280740.0
  ], 
  [
   289927, 
   null, 
   "Steeeeve", 
   "Ron Paul and Mike Huckabee are good examples that money does not equal votes. Ron Paul has tons of money and 3% while Huckabee has no money and about 13% (nationally).", 
   {}, 
   289880, 
   null, 
   1194294540.0
  ], 
  [
   289931, 
   null, 
   "Symbiote", 
   "Wow.\n \n http://ronpaulgraphs.com/yesterday_vs_today_line.html\n \n $2.7 million by 6pm and it's now coming in at a rate of $200,000 an hour. Probably on track now for close to $4 million for the day.\n \n It'd be more accurate to say that the other metrics (donations, straw poll results, web poll results, text message poll results) don't match up well with outbound landline polling data. It's difficult to tell whether polling data is an accurate measure of real support because most polls do not specify their methodology, and some if not almost all polls survey the 6% of Republicans who voted in the 2004 primaries. I suspect that such polls greatly underestimate the real level of support.", 
   {}, 
   289927, 
   null, 
   1194297240.0
  ], 
  [
   289954, 
   null, 
   "samiinh", 
   "I'm following the Ron Paul donation bombing event very closely. Like you, I'm also amazed that such a well coordinated effort can be organized through the Internet. \n Right now the money counter has reached a total of over $4 million.\n At this pace, the amount raised for just this day will be just under $2 million, which utterly obliterates Obama's $1 million in one day.\n \n Hopefully this event will also generate some extra coverage by the media (i.e. free advertising) and save Dr. Paul even more money.\n \n When this day is over, Dr. Paul will probably look something like this: \n \n http://www.newsgroper.com/w/wp-content/uploads/ap070503035936.jpg\n\n \n However, he has absolutely no chance of being nominated or elected.", 
   {}, 
   289880, 
   null, 
   1194312480.0
  ], 
  [
   289973, 
   null, 
   "Symbiote", 
   "The campaign has announced the final total was $4.2 million in 24 hours, truly amazing.\n \n http://ap.google.com/article/ALeqM5hyQLduiFMFTNmeUdgpf5cMvLi6awD8SNV5Q02", 
   {}, 
   289954, 
   null, 
   1194336600.0
  ], 
  [
   289987, 
   null, 
   "samiinh", 
   "The campaign has announced the final total was $4.2 million in 24 hours, truly amazing.\n \n http://ap.google.com/article/ALeqM5hyQLduiFMFTNmeUdgpf5cMvLi6awD8SNV5Q02\n\n \n Big deal. He has no chance of being elected.", 
   {}, 
   289973, 
   null, 
   1194357180.0
  ], 
  [
   290059, 
   null, 
   "Symbiote", 
   "3 months ago he had no chance of raising $4.2 million in 1 day, and yet, it happened.\n \n I don't think the odds are good, bookmakers rate him about a 7-9% chance to win the nomination, but stranger things have happened, and many past presidents have come from further behind in the polls.", 
   {}, 
   289987, 
   null, 
   1194399480.0
  ], 
  [
   290060, 
   null, 
   "Phunting", 
   "I'm utterly confused: what has this to do with Guy Fawkes aside from a similarity of dates?", 
   {}, 
   289987, 
   null, 
   1194399660.0
  ], 
  [
   290064, 
   null, 
   "Symbiote", 
   "Well there's a number of tie-ins.\n \n With regards to Guy Fawkes, some view him more as hero than villain, and associate the Ron Paul campaign with him as an attempt to \"blow up\" various aspects of the federal government, metaphorically speaking.\n \n Coordinated one day donations are also referred to as \"money bombs\" and there is of course a parallel there.\n \n With regards to the V for Vendetta movie, which it was probably more closely tied to, the campaign tagline is the \"Ron Paul Revolution\", calling for a revolution in both the republican party and the activities of the government in general, similar to the original American revolution in its goal of a constitutional government.\n \n So there's a number of tie-ins, but really it's just a gimmick for people to focus on. There is a similar call now for another money bomb on December 16th commemorating the Boston Tea Party for parallel reasons, I don't know how successful it will be.\n \n The average donation this time was a bit over $100, so there's certainly the possibility of those same people donating again on that date as well as new donors. (November 5 brought in about 20,000 new donors itself)", 
   {}, 
   290060, 
   null, 
   1194401400.0
  ], 
  [
   290509, 
   null, 
   "daewoo", 
   "Well there's a number of tie-ins.\n \n With regards to Guy Fawkes, some view him more as hero than villain, and associate the Ron Paul campaign with him as an attempt to \"blow up\" various aspects of the federal government, metaphorically speaking.\n \n Coordinated one day donations are also referred to as \"money bombs\" and there is of course a parallel there.\n \n With regards to the V for Vendetta movie, which it was probably more closely tied to, the campaign tagline is the \"Ron Paul Revolution\", calling for a revolution in both the republican party and the activities of the government in general, similar to the original American revolution in its goal of a constitutional government.\n \n So there's a number of tie-ins, but really it's just a gimmick for people to focus on. There is a similar call now for another money bomb on December 16th commemorating the Boston Tea Party for parallel reasons, I don't know how successful it will be.\n \n The average donation this time was a bit over $100, so there's certainly the possibility of those same people donating again on that date as well as new donors. (November 5 brought in about 20,000 new donors itself)\n\n \n Just the fact that a day honoring a guy who tried to blow up his ruling body prompted so many donations should be an eye opener for TPTB. I think in the US it brings to mind V for Vendetta more than necessarily Guy Fawkes directly since prior to the movies release I doubt most americans had any clue who guy fawkes was.\n \n As far as Ron Paul goes, the optimistic side of me wants to think he has a chance. The realistic side says \"no way in hell\". In theory if he could get some decent exposure and get to the point that people start viewing him as a real contender, then maybe he could make some progress. The problem is that he is jsut not much of a showman. He certainly has the most \"revolutionary\" ideas of any of the canidate, but he manages to make them sound boring. He is just not a very exciting person. We elect our leaders based on how often we hear their names on television (proven). If RP wants to win, he needs to get caught in a three way, cocain fueled sex act, possibly invoving an animal. Then he would be all over the news and could possibly get elected.", 
   {}, 
   290064, 
   null, 
   1194891720.0
  ], 
  [
   290588, 
   null, 
   "Symbiote", 
   "Check out this hilariously lame copycat attempt at the Barack Obama site for the 16th of November calling for $5 million online in one day.\n \n http://my.barackobama.com/page/event/detail/4vzvl\n \n 142 signups so far, and 7 people have already donated $520 to the project. Only 49,858 more to go in the next 2 days, you can do it Obama-fans!\n \n I just really think they don't get it, you can't manufacture grassroots internet support by sticking a thermometer on your website, particularly with disgusting rhetoric like \"Thanking Our leader for his commitment to social service\". I can hardly believe there are even 142 people reading political sites who would buy into that trite nonsense.", 
   {}, 
   290509, 
   null, 
   1194967440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Remember, remember the 5th of November..", 
  "url": "http://www.4forums.com/political/politics-debates/10591-remember-remember-5th-november.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 10591, 
  "discussion_files": [
   [
    "27925.html", 
    "http://www.4forums.com/political/politics-debates/10591-remember-remember-5th-november-print.html"
   ]
  ], 
  "identifier": 10591
 }
]