[
 [
  [
   290174, 
   null, 
   "Kronus", 
   "\"On Tuesday, November 13, NOVA will be presenting a special two-hour\n documentary \"Judgment Day: Intelligent Design on Trial.\" The film captures\n the turmoil that tore apart the community of Dover, Pennsylvania, in one of\n the latest battles over teaching evolution in public schools. Featuring\n trial reenactments based on court transcripts as well as interviews with\n expert scientists and Dover parents, teachers, and town officials, this\n two-hour special follows the celebrated federal case of Kitzmiller v. Dover\n through to the judge's stunning decision.\"\n \n Could be interesting, I plan on trying to catch it.", 
   {
    "post_info": {
     "post_title": "Psa"
    }
   }, 
   null, 
   null, 
   1194547680.0
  ], 
  [
   290590, 
   null, 
   "Kronus", 
   "Just a reminder that this is on tonight. May provide interesting fodder for debate/commentary.", 
   {}, 
   290174, 
   null, 
   1194967500.0
  ], 
  [
   290657, 
   null, 
   "trebor", 
   "I saw it last night. I didn't learn anything new, but I will say that the religious right can be SCARY.\n \n And they are lying sack of manure too.", 
   {}, 
   290590, 
   null, 
   1195056120.0
  ], 
  [
   290661, 
   null, 
   "lesz", 
   "Your Creation Museum Report\n \n \nYes, finally, ladies and gentlemen, I present you with your Creation Museum report! Thank you for your patience. Our report today has two parts: The first part is a photographic tour, with all the snarktasticness you've been no doubt hoping for. Click on the first picture and cruise on through. It's long - 101 pictures - but, hey, you guys paid top dollar, so I don't want to skimp. The second part, a think piece, if you will, is directly below. It's no less snarky (as you will soon discover), but also somewhat more thoughtful. Enjoy.\n\n \n Creationism is still idiocy, no matter how much it is tarted up, no matter how slick the presentation.", 
   {
    "unicode_changes_made": true
   }, 
   290657, 
   null, 
   1195058520.0
  ], 
  [
   290666, 
   null, 
   "Kronus", 
   "I saw it last night. I didn't learn anything new, but I will say that the religious right can be SCARY.\n \n And they are lying sack of manure too.\n\n \n I tried to watch it with my wife. We got about 5 minutes in, when some woman proclaimed \"and God created the heavens and the earth, that's all I need to know\". People boasting of their willful ignorance was too much for my wife, and we had to change the channel.", 
   {}, 
   290657, 
   null, 
   1195060980.0
  ], 
  [
   290670, 
   null, 
   "Waxy", 
   "I missed the first 50 mins or so, I'll have to track it down on PBS.\n \n It was well done, factual, and pretty straightforward, as a result, it did have an definite \"pro evolution\" tone.\n \n I knew a fair number of the details of the trial, just through trickle down on this site, but I was amazed at just how badly the \"ID\" side got nailed to the wall.\n \n I'm disappointed that none of the ID'ers was willing to be interviewed or defend themselves - somewhat telling I suppose.\n \n LOL Kronus - my wife and I don't sit around the dinner table debating evolution either, she was shocked that people could be so intentionally ingnorant and zealous, supposedly in the name of Christianity.\n \n Waxy", 
   {}, 
   290666, 
   null, 
   1195062240.0
  ], 
  [
   290675, 
   null, 
   "Kronus", 
   "\n LOL Kronus - my wife and I don't sit around the dinner table debating evolution either, she was shocked that people could be so intentionally ingnorant and zealous, supposedly in the name of Christianity.\n \n\n \n Actually, my wife and I discuss evolution all the time. She's an evolutionary biologist. She did feel as if she had some duty to watch the show, just to stay on top of the sorts of things being said. She just has a low tolerance for willful stupidity. Which I totally understand. :)", 
   {}, 
   290670, 
   null, 
   1195064220.0
  ], 
  [
   290677, 
   null, 
   "sinjin", 
   "...she was shocked that people could be so intentionally ingnorant and zealous, supposedly in the name of Christianity.\n\n My local news broadcast this morning included a story featuring the Governor of Georgia leading a large group in a prayer for rain. Don't they know you need an Indian to pull that one off?emoticon_xclown", 
   {}, 
   290675, 
   null, 
   1195065060.0
  ], 
  [
   290682, 
   null, 
   "Waxy", 
   "My local news broadcast this morning included a story featuring the Governor of Georgia leading a large group in a prayer for rain. Don't they know you need an Indian to pull that one off?emoticon_xclown\n\n \n :p :p \n \n Waxy", 
   {}, 
   290677, 
   null, 
   1195067040.0
  ], 
  [
   290686, 
   null, 
   "N.Wells", 
   "I loved the cdesign propentsists story at the time of the trial, and it lost none of its charm in the retelling.\n \n Miller's mousetrap-tieclip came across really well. \n \n Bill Buckingham has clearly learned absolutely nothing from the whole process. The sight of him ranting about the judge at the end of the program was depressing, with regard to the difficulties of ever getting creationists to listen to reason.", 
   {}, 
   290682, 
   null, 
   1195068300.0
  ], 
  [
   290725, 
   null, 
   "Waxy", 
   "Here's the link to PBS -\n \n http://www.pbs.org/wgbh/nova/id/?campaign=pbshomefeatures_3_novabrjudgmentday_2007-11-14\n \n Waxy", 
   {}, 
   290174, 
   null, 
   1195086900.0
  ], 
  [
   290731, 
   null, 
   "chemist99a", 
   "I liked the chromosome fusion explanation, and I got a real kick out of the Behe/Immunology re-enactment. That bit is the dream of every cross-examiner of an opposing expert. You pull out pile after pile of stuff that the witness ignored or claimed does not exist! It really gets the judge and juries attention focused. Best done paper by paper book by book if you can get the court to sit still long enough! The technical term is NAILED TO THE WALL!", 
   {}, 
   290725, 
   null, 
   1195096860.0
  ], 
  [
   290745, 
   null, 
   "trebor", 
   "I liked the chromosome fusion explanation, and I got a real kick out of the Behe/Immunology re-enactment. That bit is the dream of every cross-examiner of an opposing expert. You pull out pile after pile of stuff that the witness ignored or claimed does not exist! It really gets the judge and juries attention focused. Best done paper by paper book by book if you can get the court to sit still long enough! The technical term is NAILED TO THE WALL!\n\n \n \n I liked the fact that the judgment was as long and detailed as it was. (I have the entire thing in PDF format. He really nailed the hypocrites and liars to the wall, not that it stopped them from publicly denying it. However, I really haven't seen any attempt to get I.D. in school since. Evolution denied to be sure.\n They keep on trying though.", 
   {}, 
   290731, 
   null, 
   1195140480.0
  ], 
  [
   290778, 
   null, 
   "billsco", 
   "My local news broadcast this morning included a story featuring the Governor of Georgia leading a large group in a prayer for rain. Don't they know you need an Indian to pull that one off?emoticon_xclown\n\n \n It rained in Georgia yesterday. A total of one inch, which is woefully inadequate; the proverbial drop in the bucket. The same storm system spawned a tornado in Tennessee, injuring nine people and destroying a church. I suspect the people in the Volunteer State are now praying that the people of Georgia cease and desist praying immediately.", 
   {}, 
   290677, 
   null, 
   1195158840.0
  ], 
  [
   290783, 
   null, 
   "ShadowPikachu", 
   "It rained in Georgia yesterday. A total of one inch, which is woefully inadequate; the proverbial drop in the bucket. The same storm system spawned a tornado in Tennessee, injuring nine people and destroying a church. I suspect the people in the Volunteer State are now praying that the people of Georgia cease and desist praying immediately.\n\n \n Sounds like God didn't much like all those people praying and complaining to him about their drought. emoticon_xhoho\n \n On topic, I saw the program (it'll be available on the PBS site tomorrow - the 16th), and thought it was excellent. I, too, like someone here mentioned, loved the \"missing link\" between IDers and creationists: the \"cdesign propentsists\"", 
   {}, 
   290778, 
   null, 
   1195168020.0
  ], 
  [
   290806, 
   null, 
   "chemist99a", 
   "Sounds like God didn't much like all those people praying and complaining to him about their drought. emoticon_xhoho\n \n On topic, I saw the program (it'll be available on the PBS site tomorrow - the 16th), and thought it was excellent. I, too, like someone here mentioned, loved the \"missing link\" between IDers and creationists: the \"cdesign propentsists\"\n\n \n \n Technically thats an insertion of one gene into the midst of another.", 
   {}, 
   290783, 
   null, 
   1195190280.0
  ], 
  [
   290973, 
   null, 
   "lesz", 
   "I finally watched the NOVA documentary on the Kitzmiller trial in Dover online, and a good watch it was, too. If anyone's interested, reactions to it are now available:\n \n PBS publishes the responses to the Nova documentary\n \n Apparently, there are some REALLY fab letters, especially from Creationists: one sample to whet the appetite:\n \n \nIt doesn't take a \"Rocket Scientist\" to figure out that if we, as humans, evolved from monkeys . . . THEN WHY? . . . Are there STILL Monkeys??? We were \"Created\" by God!!! Pull up AOL now and you'll notice the Gov. of Georgia praying for rain, (No Doubt to GOD). When 9/11 happened what did every good neighbor do? PRAY. Not to monkeys . . . To our \"Creator\"!!! It shouldn't take tragic and desperate circumstances for people to realize this fact!!! GOD BLESS AMERICA!!! In GOD We Trust!!!\n\n \n You gotta admire the intellectual calibre of the opposition! emoticon_xbouncer\n \n I think one of the most telling interviews in the documentary was the one with the aging Phillip Johnson, one of the inventors of Intelligent Design creationism and the Wedge Strategy. He said, basically, that he was surprised by the strength and tenacity of the resistance by the scientific community to ID Creationism (why he should be surprised probably says more about his abysmal ignorance of science than anything else), and that getting the Wedge Strategy to succeed would take a lot longer than he had initially envisaged.\n \n Of course, this means that despite Dover, despite underestimating science and what the US public will bear, the Creationists are not giving up. They'll be back for more of their nonsense.", 
   {}, 
   290806, 
   null, 
   1195405140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Psa", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10602-psa.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 10602, 
  "discussion_files": [
   [
    "14395.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10602-psa-print.html"
   ], 
   [
    "14396.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10602-psa-2-print.html"
   ]
  ], 
  "identifier": 10602
 }
]