[
 [
  [
   290402, 
   null, 
   "GodsCowboy", 
   "Click here to view the picture that goes with this message\n \n NOTE #1 ---< Bible references are included at the end of this message.\n \n EDITED UPDATE:In the next paragraph I call something I've been taught a lie. In reality, it's been a misunderstanding. The scripture backs up my thinking (see next paragraph). The scripture I'm referencing is Luke 2:7:\n \nbecause there was no room for them in the inn\n\n The passage says there was no room FOR THEM in the inn. That DOESN'T mean there wasn't any more at all. It just might mean there was NO ROOM for their type.\n END OF EDITED UPDATE:\n \n The bible says Joseph COULDN'T get a room in Bethlehem because ALL the inns were full. For years, I've believed that lie. I know better now. The real reason they COULDN'T get a room was because Mary was 9 months pregnant and NOT married. Remember, NO ONE knew who they were. As far as the Inn keepers knew they were just a young couple living a life of sin. So they DIDN'T want to help them.\n \n That's a lesson for ALL OF US to learn. The person we discriminate against just might be GOD; one of HIS children or HIS messenger. So treat everyone like you want GOD to treat you. HE just might be testing you. Like HE tested those Inn keepers.\n \n The other reason I know the Inn story is wrong is Joseph should have had family in Bethlehem. Remember, Emperor Augustus ordered a census and all of the descendants of David were told to register in birthplace of King David (Bethlehem). So all of Joseph's family was there, yet NONE OF THEM, helped him and his family. You'd think someone from his family would have helped him and his pregnant girlfriend. You'd think one of his family members would have made room for them even if it was only a place on the floor. But that DIDN'T happen. So you GOT TO BELIEVE Joseph's family disowned him. Their religion and prejudices wouldn't let them associate with Joseph and Mary. So they DIDN'T find lodging in Bethlehem NOT because the Inns were full but because everyone was prejudice against UNWED parents and their children.\n \n Even today there are people that look down on couples that have sex outside of marriage. Can you imagine what the people of Christ's day thought about Joseph and Mary? Remember, these are the SAME PEOPLE that questioned Jesus about how they should punish a woman they caught committing adulty (read John 8:1-11 below).\n \n There's NO DOUBT IN MY MIND that the prejudices the HOLY FAMILY experienced because Mary was an UNWED MOTHER were planned lessons from GOD. The story at the Inn was just the beginning of Christ's training for the mission GOD had planned for him (read Luke 2:1-7 below). I'm also sure ONE of the reasons Christ childhood is NOT in the bible is because NO ONE would accept his teachings if he talked about the fact that he was an illegitimate child or if he discussed all the prejudices he endured while he was growing up as an illegitimate child. I also BELIEVE Christ wanted to put those times behind him and move on. He didn't want to remember the bad times. It would have depressed him and made him hateful. He had forgiven them and DIDN'T want to bring up the past.\n \n Now you know one of the reasons why GOD allows us to suffer and experience hard times. It's HIS way of teaching us lessons and maybe preparing us to do HIS work. After all experience is the BEST TEACHER and GOD NEVER does ANYTHING that ISN'T PERFECT. So why would we think HE wouldn't use experiences to teach us?\n \n Bible References\n \n ----------John 8:1-11\n \n ----------1 But Jesus went to the Mount of Olives. 2 At dawn he appeared again in the temple courts, where all the people gathered around him, and he sat down to teach them. 3 The teachers of the law and the Pharisees brought in a woman caught in adultery. They made her stand before the group 4 and said to Jesus, \"Teacher, this woman was caught in the act of adultery. 5 In the Law Moses commanded us to stone such women. Now what do you say?\" 6 They were using this question as a trap, in order to have a basis for accusing him. But Jesus bent down and started to write on the ground with his finger. 7 When they kept on questioning him, he straightened up and said to them, \"If any one of you is without sin, let him be the first to throw a stone at her.\" 8 Again he stooped down and wrote on the ground. 9 At this, those who heard began to go away one at a time, the older ones first, until only Jesus was left, with the woman still standing there. 10 Jesus straightened up and asked her, \"Woman, where are they? Has no one condemned you?\" 11 \"No one, sir,\" she said. \"Then neither do I condemn you,\" Jesus declared. \"Go now and leave your life of sin.\"\n \n \n ----------Luke 2:1-7\n \n ----------1 In those days Caesar Augustus issued a decree that a census should be taken of the entire Roman world. 2 (This was the first census that took place while Quirinius was governor of Syria.) 3 And everyone went to his own town to register. 4 So Joseph also went up from the town of Nazareth in Galilee to Judea, to Bethlehem the town of David, because he belonged to the house and line of David. 5 He went there to register with Mary, who was pledged to be married to him and was expecting a child. 6 While they were there, the time came for the baby to be born, 7 and she gave birth to her firstborn, a son. She wrapped him in cloths and placed him in a manger, because there was no room for them in the inn.", 
   {
    "post_info": {
     "post_title": "Was There REALLY No Room (Post #79 )?"
    }
   }, 
   null, 
   null, 
   1194748320.0
  ], 
  [
   290571, 
   null, 
   "unkerpaulie", 
   "in a religious sense i guess you have a point. interestingly enough, discrimination of every kind originated from religious teachings. in fact, its the very bible that shares the story of mary and joseph that created the discrimination itself.\n \n as for your reasoning behind the conclusion, this actually makes no sense. how would the innkeeper in bethlehem know whether mary and joseph were married or not, seeing that they came all the way from galilee and all the innkeeper had nothing else to go on. to assume that the innkeeper discriminiated against them is a totally baseless assumption. tell me how he could have possibly known they were not married", 
   {}, 
   290402, 
   null, 
   1194933060.0
  ], 
  [
   290578, 
   null, 
   "charlie horse", 
   "Why do the circumstances of Jesus' birth mirror so many other much older mystical accounts?\n \n Bright stars, wise men, virgin mother, stable-type birth, fleeing, miracle-worker, 12 followers, trying, death, resurrection, reappearance? It just confirms the total tripe and worthlessness of the Biblical accounts.", 
   {}, 
   290571, 
   null, 
   1194954360.0
  ], 
  [
   290582, 
   null, 
   "Zardoz", 
   "Yeah...leave it up to a WofF heretic to say their own bible lies.\n \n Look, they got married prior to the birth.\n It's part of the rules they followed to live together...otherwise they wouldn't have traveled as a FAMILY to Nazareth to be counted.\n \n Here's simple wiki entry\n \"There is only an allusion to the first event, namely Joseph's betrothal to Mary that had made her his wife according to the Jewish law. The clarification has been added that they were not yet living together, from which follows that they had not yet conducted the wedding rite known as the \"home taking\", which is the legal ceremony that permits Jewish couples to begin conjugal relations.\n \n The first event related in some detail is Joseph's dream during which he is told by \"an angel of the Lord\" not only to take his wife Mary home - in other words, to conduct the concluding legal wedding rite -, rather than to be afraid for the reason that the child with which she is now pregnant is holy, but also to name him Jesus, hence to assume legal paternity. The first command Joseph carries out, apparently promptly, the second in due time.\n \n The next event is Joseph's journey from Nazareth to Bethlehem to be enrolled as required by the political authorities. He is accompanied by Mary who is heavily pregnant and, whilst they are there, gives birth to Jesus.\"\n \n The lesson here is eisegesis (putting your own ignorant interpretation into scripture) makes you look like the fool you are.\n That's why exegesis (properly understanding in detail and context what really happened) is needed.\n \n \nThe other reason I know the Inn story is wrong is Joseph should have had family in Bethlehem. \n\n That's just a plain ignorant assumption. There's no reason to believe that any of them STILL had living family in Bethlehem.\n \n As unkerpaulie stated, the Innkeeper wouldn't have known their marital status. This was a census, a lot of people were going back to their places of birth...over crowding in many places could be expected.\n As to Joseph's family disowning him...more baseless ignorance.\n Read your OT scripture and learn something about their customs.\n Joseph was now a married man. He's pretty much on his own...no running back to momma and dadda for help at the drop of a hat. You can't assume they lived there (or were even alive) unless it's stated so. \n \n Heck, simply reading the other gospels disproves your baseless assumptions.\n \n Matthew 1:18-25\n The Birth of Jesus Christ \n This is how the birth of Jesus Christ came about<b></b>: His mother Mary was pledged to be married to Joseph, but before they came together, she was found to be with child through the Holy Spirit. Because Joseph her husband was a righteous man and did not want to expose her to public disgrace, he had in mind to divorce her quietly. \n But after he had considered this, an angel of the Lord appeared to him in a dream and said, \"Joseph son of David, do not be afraid to take Mary home as your wife, because what is conceived in her is from the Holy Spirit. She will give birth to a son, and you are to give him the name Jesus, because he will save his people from their sins.\" \n All this took place to fulfill what the Lord had said through the prophet: \"The virgin will be with child and will give birth to a son, and they will call him Immanuel\" which means, \"God with us.\" \n \n When Joseph woke up, he did what the angel of the Lord had commanded him and took Mary home as his wife. But he had no union with her until she gave birth to a son. And he gave him the name Jesus.\n \n \n \n Can't be divorced without being married.\n Can't take her home without being married.\n \n This bible lesson brought to you be a servent of the darkness(tm).", 
   {
    "unicode_changes_made": true
   }, 
   290578, 
   null, 
   1194960960.0
  ], 
  [
   290621, 
   null, 
   "GodsCowboy", 
   "\n ...\n Look, they got married prior to the birth.\n ...\n \n\n \n Well, NOT quite. LUKE 2:5 states: \nMary who was promised in marriage to him\n.\n so they weren't married yet.", 
   {}, 
   290582, 
   null, 
   1194993660.0
  ], 
  [
   290647, 
   null, 
   "Zardoz", 
   "Well, NOT quite. LUKE 2:5 states: .\n so they weren't married yet.\n\n \n Do you understand anchient Jewish wedding rites?\n \n Or chronology of events?\n \n The pledge is NOT what you'd think it to be and is merely part of the process of getting married. Matthew explains these events in a little more detail. \n Mary was visited and impregnanted.\n Then Joseph found out and was upset and planned to divorce her (that you can't do unless you're married).\n Then Joseph was visited by the angel and was told to take her home (as his wife) which completed the marriage rites.\n \n Later, they returned to their place of birth to be counted for the census.\n They were married at this time and living together...even lived together in a manger.\n \n At no time does the bible imply or state ANY of the wild conspiracy theories that you came up with to suggest discrimination. That's you reading into scripture something that isn't there.\n \n 8 days after the birth of 'Jesus' they held his Bris and named him. Must be married for that. In the naming ceremony here, Joseph claims Jesus as his own. Thus, Jesus isn't a bastard child.\n \n The 'taking home' part in marriage is what cemented this deal and finalized the marriage in legal terms...and is something Joseph did before they visited Bethlehem.\n \n And considering your Luke book was compiled decades after the fact...I'd put less reliance on it's explicit accuracy.\n However, if you want to consider this another one of the glaring contradictions in the divinely inspired bible, I'm all game.\n Basically, it seems that you, a believer apparently, don't believe in your own religious text. Most comments you've addressed on these forums would suggest so.\n It does make me curious on how you come about your belief in a god or what forms of religious practice your partaketh in.", 
   {}, 
   290621, 
   null, 
   1195047120.0
  ], 
  [
   290824, 
   null, 
   "GodsCowboy", 
   "\n ...\n Mary was visited and impregnanted.\n Then Joseph found out and was upset and planned to divorce her (that you can't do unless you're married).\n Then Joseph was visited by the angel and was told to take her home (as his wife) which completed the marriage rites.\n ...\n \n\n \n You talk a GOOD GAME and use lot of BIG IMPRESIVE WORDS but where are your BIBLE REFERENCES?\n \n Again HERE'S MINE:\n \n LUKE 2:5 states: \n \n \nMary who was promised in marriage to him \n", 
   {}, 
   290647, 
   null, 
   1195228920.0
  ], 
  [
   290868, 
   null, 
   "Zardoz", 
   "You talk a GOOD GAME and use lot of BIG IMPRESIVE WORDS but where are your BIBLE REFERENCES?\n \n Again HERE'S MINE:\n \n LUKE 2:5 states:\n\n \n Matthew 1:18-25\n The Birth of Jesus Christ \n This is how the birth of Jesus Christ came about<b></b>: His mother Mary was pledged to be married to Joseph, but before they came together, she was found to be with child through the Holy Spirit. Because Joseph her husband was a righteous man and did not want to expose her to public disgrace, he had in mind to divorce her quietly. \n But after he had considered this, an angel of the Lord appeared to him in a dream and said, \"Joseph son of David, do not be afraid to take Mary home as your wife, because what is conceived in her is from the Holy Spirit. She will give birth to a son, and you are to give him the name Jesus, because he will save his people from their sins.\" \n All this took place to fulfill what the Lord had said through the prophet: \"The virgin will be with child and will give birth to a son, and they will call him Immanuel\" which means, \"God with us.\" \n \n \n The Bible is my reference PLUS the cultural history of the Hebrew people of the time and HOW they practived the rite of marriage.\n Once you 'took her home' in Jewish culture in those times, You were considered MARRIED.\n \n Furthermore, in order for Jesus to be named in his Bris and Joseph to be his LEGAL father, they had to be married. The Bris happens 8 days after birth.\n Or, are you calling Jesus a BASTARD?\n \n The fact of the matter GC is you're simply ignorant.\n It's readily apparant that your either approaching bible study in a piecemeal pattern and having personal revelations and going AH-Ha! \n Or, more than likely, sitting in a church under a Word Of Faith style pastor who basically does the same.\n \n Basing biblical study in a vacuum ends up resulting in biblical ignorance.\n While you may read the words...you simply know not what they mean.\n \n Outside this, Luke wrote of these events decades after they happened based on hearsay and his research on them. It's doubtful that he had them done perfectly. Heck, look at the geneology of Jesus for an example of simple contradictions.", 
   {}, 
   290824, 
   null, 
   1195246080.0
  ], 
  [
   290869, 
   null, 
   "unkerpaulie", 
   "luke 2:5\n \n He went there to register with Mary, who was pledged to be married to him and was expecting a child. (NIV)\n \n in order to register along with Mary, who was engaged to him, and was with child. (NASB)\n \n To be taxed with Mary his espoused wife, being great with child. (KJV)\n \n He took with him Mary, his fianc&#233;e, who was now obviously pregnant.(Living Bible)\n \n To be enrolled with Mary, his espoused (married) wife, who was about to become a mother.(Amplified)\n \n to enrol himself with Mary, who was betrothed to him, being great with child. (ASV)\n \n to be registered with Mary, his betrothed wife,[a] who was with child.(NKJV)\n \n \n godscowboy, your one supporting scripture to back up your post does a poor job of supporting. the majority of versions of that very verse translates to mary and joseph already being married. also, its pretty obvious that there is no consensus even among the scholars as to whether they were married yet or not. within a single verse there is a contradiction among bible versions", 
   {}, 
   290868, 
   null, 
   1195246680.0
  ], 
  [
   290875, 
   null, 
   "sinjin", 
   "Maybe the Inn had only suites.emoticon_xangel", 
   {}, 
   290869, 
   null, 
   1195262040.0
  ], 
  [
   291094, 
   null, 
   "GodsCowboy", 
   "luke 2:5\n \n He went there to register with Mary, who was pledged to be married to him and was expecting a child. (NIV)\n \n in order to register along with Mary, who was engaged to him, and was with child. (NASB)\n \n To be taxed with Mary his espoused wife, being great with child. (KJV)\n \n He took with him Mary, his fiancée, who was now obviously pregnant.(Living Bible)\n \n To be enrolled with Mary, his espoused (married) wife, who was about to become a mother.(Amplified)\n \n to enrol himself with Mary, who was betrothed to him, being great with child. (ASV)\n \n to be registered with Mary, his betrothed wife,[a] who was with child.(NKJV)\n \n \n godscowboy, your one supporting scripture to back up your post does a poor job of supporting. the majority of versions of that very verse translates to mary and joseph already being married. also, its pretty obvious that there is no consensus even among the scholars as to whether they were married yet or not. within a single verse there is a contradiction among bible versions\n\n \n I looks like the MAJORITY say they WEREN'T MARRIED (pledged, engaged, fiancée or betrothed). \n \n Even ESPOSED doesn't seem to indicate they were married yet. See the definitions below. For the record, English ISN'T my subject but from what I've looked up ESPOSED seems to somewhere between TO MARRY and MARRY.\n \n espouse (v) adopt, back, advocate, promote, champion, embrace, take up, support Encarta ® World English Dictionary © & (P) 1998-2004 Microsoft Corporation. All rights reserved.\n \n es·pouse (&#301;-spouz') tr.v., -poused, -pous·ing, -pous·es.\n ----To take in marriage; marry.\n ----To give (a woman) in marriage.\n ----To give one's loyalty or support to (a cause, for example); adopt.\n \n The verb espouse has 3 meanings:\n \n Meaning #1: choose and follow; as of theories, ideas, policies, strategies or plans\n Synonyms: adopt, follow\n Meaning #2: take in marriage\n Synonyms: marry, get married, wed, conjoin, hook up with, get hitched with\n Meaning #3: take up the cause, ideology, practice, method, of someone and use it as one's own\n Synonyms: embrace, adopt, sweep up", 
   {}, 
   290869, 
   null, 
   1195527540.0
  ], 
  [
   291095, 
   null, 
   "smiley", 
   "I looks like the MAJORITY say they WEREN'T MARRIED (pledged, engaged, fiancée or betrothed). \n \n Even ESPOSED doesn't seem to indicate they were married yet. See the definitions below. For the record, English ISN'T my subject but from what I've looked up ESPOSED seems to somewhere between TO MARRY and MARRY.\n \n espouse (v) adopt, back, advocate, promote, champion, embrace, take up, support Encarta ® World English Dictionary © & (P) 1998-2004 Microsoft Corporation. All rights reserved.\n \n es·pouse (&#301;-spouz') tr.v., -poused, -pous·ing, -pous·es.\n ----To take in marriage; marry.\n ----To give (a woman) in marriage.\n ----To give one's loyalty or support to (a cause, for example); adopt.\n \n The verb espouse has 3 meanings:\n \n Meaning #1: choose and follow; as of theories, ideas, policies, strategies or plans\n Synonyms: adopt, follow\n Meaning #2: take in marriage\n Synonyms: marry, get married, wed, conjoin, hook up with, get hitched with\n Meaning #3: take up the cause, ideology, practice, method, of someone and use it as one's own\n Synonyms: embrace, adopt, sweep up\n\n \n Is there a grey area between TO MARRY and MARRY? They both suggest marriage to me.\n \n And just to clear up your 3 meanings . . . \n \n Assuming that Mary was indeed a real person, she would not have been a theory or idea (that's #1 out of the way), and she would not have been a cause, ideology or practice (that's #3). So what do we have left? Ooooh, #2 - take in marriage.\n \n Looks like you're going to have to try harder. Your straws are getting a bit greasy for haphazard clutching.\n \n Smiley", 
   {}, 
   291094, 
   null, 
   1195528860.0
  ], 
  [
   291100, 
   null, 
   "Zardoz", 
   "For the record, English ISN'T my subject\n\n \n And apparently neither are ancient Jewish customs and rites.\n Maybe you should look into that 1st before arguing over what the TRANSLATION of the GREEK word based on a Hebrew/ Jewish custom actually means.\n \n It doesn't matter what the ENGLISH word is.\n The ancient Greek word would be closer but still not as accurate as the original Hebrew word descriptions for this event.\n \n As stated, once a man 'took his woman home they were considered married.\n Joseph did that after the angle TOLD HIM TO do so. \n \n So far, all you're doing is clinging to one book of the Gosples. And one widely known to have been writen by a 'historian' well after these events were said to have happened.", 
   {}, 
   291094, 
   null, 
   1195543380.0
  ], 
  [
   291194, 
   null, 
   "unkerpaulie", 
   "so godscowboy, either joseph married mary in the story before that verse, or he adopted her. hmmmm....\n \n by the way, bethroted also means married\n \n its interesting how youre quick to highlight ambiguities in your own bible, regardless of how illogical it is, to support your preconceived belief. anyway, luke 2:5 does not support your argument at all", 
   {}, 
   291100, 
   null, 
   1195653480.0
  ], 
  [
   293386, 
   null, 
   "thelmoose", 
   "One other minor point. The story of the Nativity never happened so it makes this whole moot. The only accounts of it, Luke and Matthew are mutually exclusive and were clearly made up after the fact. \n \n If Jesus existed, and I suspect he did, he certainly had to have been born, but it didn't happen like this. Therefore I don't think Ms. Mary was being preggers-bashed.", 
   {}, 
   291194, 
   null, 
   1197346200.0
  ], 
  [
   294918, 
   null, 
   "AmericanPatriot", 
   "One other minor point. The story of the Nativity never happened so it makes this whole moot. The only accounts of it, Luke and Matthew are mutually exclusive and were clearly made up after the fact. \n \n If Jesus existed, and I suspect he did, he certainly had to have been born, but it didn't happen like this. Therefore I don't think Ms. Mary was being preggers-bashed.\n\n \n What evidence do you use to support the idea that Jesus ever lived? Many of the early cultures had god/man figures born of virgins etc. etc. etc.", 
   {}, 
   293386, 
   null, 
   1198458900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Was There REALLY No Room (Post #79 )?", 
  "url": "http://www.4forums.com/political/bible-doctrine/10606-there-really-no-room-post-79-a.html", 
  "breadcrumbs": [
   "Bible Doctrine"
  ], 
  "id_number": 10606, 
  "discussion_files": [
   [
    "8564.html", 
    "http://www.4forums.com/political/bible-doctrine/10606-there-really-no-room-post-79-a-print.html"
   ], 
   [
    "8565.html", 
    "http://www.4forums.com/political/bible-doctrine/10606-there-really-no-room-post-79-a-2-print.html"
   ]
  ], 
  "identifier": 10606
 }
]