[
 [
  [
   290851, 
   null, 
   "Aivlis", 
   "I was watching the Today Show this morning when Ann did a segment about the mental institutions in Serbia. I was shocked at the conditions and the ways those people are being treated this very moment. I went online to read more about it but all I can find on their website is stuff and relationships and age spots. What a horrible tragedy for these people, to never experience love or kindness. I don't cry very easily but I found myself struggling to keep my composure during this segment. One man who is 21 but looks 10 has been kept in a crib his entire life, his limbs are atrophied and his body is frozen. Children with Down syndrome are being tied to their beds for hours at a time. \n \n Ann spoke with and showed the footage to the prime minister of Serbia I believe. He said that it was appalling and that it would take years to correct. Excuse me? No, get those people out of their today! That is unacceptable. I'm honestly disgusted by the people who work there, how can they eat, sleep and play with their family knowing what is happening in this institution everyday. I'm horrified at how long this has gone on. They call it Serbia's dark secret and obviously nobody has cared enough to expose that secret. These are the kinds of things that the American Government should be involving themselves in, not Iraq. The American government loves to poke its nose in everybody else's business but I bet they don't do anything about this...nothing in it for them. \n \n The Today Show said there would be information on their website and a way to help but I can't find it through all the holiday tips (this is a news program?). If anybody knows an organization or charity that is collecting money to help get these people real care please post it on this thread and I will do the same. I urge everyone to do something about this for it is a travesty.\n \n http://video.msn.com/video.aspx?mkt=en-US&brand=msnbc&vid=d696b0b7-632a-4c7d-9637-7663c73b001c", 
   {
    "post_info": {
     "post_title": "Serbian Mental Institution Scandal"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1195238220.0
  ], 
  [
   290872, 
   null, 
   "Aivlis", 
   "This thread has been viewd 11 times and nobody has anything to say????? emoticon_wow", 
   {}, 
   290851, 
   null, 
   1195255560.0
  ], 
  [
   291036, 
   null, 
   "Aivlis", 
   "I'm very interested in why this thread has been viewed 35 times and nobody has anything to say...I wonder what that means. Doesn't anybody care or am I just being impatient? Maybe you all just have better things to do than worry about some mentally ill people in Serbia.", 
   {}, 
   290872, 
   null, 
   1195496460.0
  ], 
  [
   291103, 
   null, 
   "Iuris", 
   "Can't speak for others, but it's nothing new, globally speaking.\n \n All over the world and history, humanity has most shown its darker sides towards those unable to defend themselves. The mentally disadvantaged suffer the most.\n \n It's now in Serbia. I seem to remember an exposure scandal was started in the US once after a journalist had herself committed. It's not going away.\n \n In the end, it comes to this: we are loath to part with our money and work time on behalf of these people. We are all too eager to simply let someone else take care of them. In my line of work, I've seen several people who take care of their close ones, and the strain always shows, and sometimes even breaks them. Eventually, they run out of energy, and simply have them committed to an institution, so they are no longer a burden.\n \n And in the institution, it's the same as ever. It's hard work, working with these people, and thankless too. All too soon it becomes much easier to simply tie someone up. Who's going to complain?\n \n But before we go all self righteous, we really should ask ourselves: are we really willing to put our money where our mouths are? Are we willing to pay capable people attractive salaries to work with these people so they are motivated? Because that's the solution to these things.", 
   {}, 
   291036, 
   null, 
   1195561020.0
  ], 
  [
   413996, 
   null, 
   "tommy96", 
   "yes i also that ...it was humorous emoticon_xkill", 
   {}, 
   290851, 
   null, 
   1285766880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Serbian Mental Institution Scandal", 
  "url": "http://www.4forums.com/political/civil-rights-debates/10616-serbian-mental-institution-scandal.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 10616, 
  "discussion_files": [
   [
    "13781.html", 
    "http://www.4forums.com/political/civil-rights-debates/10616-serbian-mental-institution-scandal-print.html"
   ]
  ], 
  "identifier": 10616
 }
]