[
 [
  [
   293042, 
   null, 
   "Siegfriedson", 
   "After years of denial, I've concluded that I'm hopelessly anti-Semitic. Why? It's my terrible attitude. Not only do I disdain U.S. militarism in the Middle East, but I've identified its key enabling causes: intellectual dishonesty, democratic corruption and media deception. But it gets worse: I place the primary blame for America's Mideast disasters squarely on organized Jewry.\n \n For those in the know, this makes me not only an anti-Semite, but a \"virulent\" anti-Semite, which is surely worse. Had I blamed everything on G.W. Bush, \"Big Oil\", or unnamed hawks in the Pentagon, then everything would be fine. \n \n Indeed, America's relentless Mideast military engagements consistently support the agenda of one nation only. That nation is Israel. It's undeniable that many savvy political observers agree that Israel tends to make its own rules, which is bad enough. What's worse, is that America tends to follow them.\n \n Take the war our ruling establishment is threatening to wage against Israel's enemy du jour, Iran. Who would have guessed that the prospect of nuclear energy development 5,000 miles from the nearest American city would bring out the Sixth fleet? Funny thing. As it is, however, Iran's proximity is a mere 450 miles from Israel's which, sadly, is the real reason America's on another war footing.\n \n Continued:\n \n http://www.zundelsite.org/zundel_persecuted/sept14-06.html \n \n \n \n .", 
   {
    "post_info": {
     "post_title": "Yeah, I'm An Anti-Semite...So What?"
    }
   }, 
   null, 
   null, 
   1197100980.0
  ], 
  [
   293056, 
   null, 
   "jitobear", 
   "Can you ever come up with something of your own? Knock knock - anything going on in between your ears?", 
   {}, 
   293042, 
   null, 
   1197138480.0
  ], 
  [
   293274, 
   null, 
   "billsco", 
   "I'll be going to the Jewry store later today and buy my wife a ring for Christmas. Are you saying this is bad?", 
   {}, 
   293056, 
   null, 
   1197292500.0
  ], 
  [
   294877, 
   null, 
   "Sirius", 
   "Israel is an ally and de facto protectorate of the US. The same is true of many other nations. It just happens to be the case that Israel is the nation most often under attack.\n \n What also makes this relationship so despicable in the eyes of many is that Israelis don't resent the US for being a stronger nation, as is the case with our more illustrious sniveling protectorates, all of Western Europe. The template is: any nation that doesn't openly rail against American \"imperialism\" is obviously involved in some sort of underhanded dealings(you can still crawl to us for help when things get out of hand, but afterwards you must immediately protest and call for war crimes charges against the US president).", 
   {}, 
   293274, 
   null, 
   1198429140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Yeah, I'm An Anti-Semite...So What?", 
  "url": "http://www.4forums.com/political/peace-middle-east/10679-yeah-im-anti-semite-so-what.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 10679, 
  "discussion_files": [
   [
    "19595.html", 
    "http://www.4forums.com/political/peace-middle-east/10679-yeah-im-anti-semite-so-what-print.html"
   ]
  ], 
  "identifier": 10679
 }
]