[
 [
  [
   17851, 
   null, 
   "kelvin90701", 
   "Pro-gunners please try to stay away from this thread. I would like to hear how anti-gunners take care of themselves.\n \n An anti-gun girlfriend I once ran around with did not like me to take a .45 around town. Tough choice, my response was, \"OK, the you if it ever comes down to it, you better run fast. I am going to run really really fast and you better keep up.\" The look on her face said it all. A combination of disdain, \"you coward\", and don't you love me? But her question was why don't you want to protect me? My response was, \"If I stick around, then there will be two victims. Not one. I' ll be back as soon as possible and bring help.\"\n \n If you carry a cell phone. Take karate lessons. What ever? There is something you do for protection. What do you do?", 
   {
    "post_info": {
     "post_title": "For anti-gunners?  How do you defend yourself?"
    }
   }, 
   null, 
   null, 
   1064891040.0
  ], 
  [
   17854, 
   null, 
   "montalban", 
   "I use the powers of the sun and the moon, which I harness at...\n \n No, just kidding.\n \n \n I rely on the police.", 
   {}, 
   17851, 
   null, 
   1064898720.0
  ], 
  [
   17861, 
   null, 
   "kelvin90701", 
   "I use the powers of the sun and the moon, which I harness at...\n \n No, just kidding.\n \n \n I rely on the police.\n\n \n Thank you for that insight.", 
   {}, 
   17854, 
   null, 
   1064910840.0
  ], 
  [
   17874, 
   null, 
   "Rev. HellH0und", 
   "\n \n \n I rely on the police.\n\n \n \n \n ^ This is the funny part!....\n \n My answer:\n .45acp strapped to your hip... .05 seconds to respond to threat...\n \n Crocidile Dundee's answer:\n Call the police... 1-30 seconds to get to the phone.... 1-3 seconds to dial police (if you have 911) 30 Seconds to 5 minutes to splain yourself..... 5-30-??? time for police to respond..\n \n My analysys:\n Your dead!!!\n \n \n Having the logic bus mow you down:\n PRICELESS!!\n \n \n \n \n (sorry Kelvin... COuld not resist!)", 
   {}, 
   17854, 
   null, 
   1064943240.0
  ], 
  [
   17892, 
   null, 
   "kelvin90701", 
   "\n \n (sorry Kelvin... COuld not resist!)\n\n \n \n I consider his reply very great insight on anti-gun attitude. Joke or not, serious or not. There is some truth in the answer.", 
   {}, 
   17874, 
   null, 
   1064986140.0
  ], 
  [
   17909, 
   null, 
   "Rev. HellH0und", 
   "I consider his reply very great insight on anti-gun attitude. Joke or not, serious or not. There is some truth in the answer.\n\n \n Yeah the truth of battle.... He is dead... his childerend are dead...His wife is raped... And things are stolen..\n \n Cops are there just in time to clean up the mess..\n \n \n Hey Monty! Police are historians not protectors!\n \n \n MOLON LABE!", 
   {}, 
   17892, 
   null, 
   1065016260.0
  ], 
  [
   17914, 
   null, 
   "montalban", 
   "Rev Hellbound\n \n see the first post Quote: \"Pro-gunners please try to stay away from this thread. I would like to hear how anti-gunners take care of themselves.\"\n \n \n Do you recall on another thread you said I should make no comment on things going on in the USA?\n \n Aren't you being a wee bit hypocritical now? (Butting in?)\n \n \n No, of course not, you're opinions are so important, you're good enough to impart them, wherever and whenever they are needed.\n \n This is a great service you are doing.\n \n Go raibh mile maith agat, mo chara!", 
   {}, 
   17909, 
   null, 
   1065017820.0
  ], 
  [
   17919, 
   null, 
   "Rev. HellH0und", 
   "Rev Hellbound\n \n see the first post Quote: \"Pro-gunners please try to stay away from this thread. I would like to hear how anti-gunners take care of themselves.\"\n \n \n Do you recall on another thread you said I should make no comment on things going on in the USA?\n \n Aren't you being a wee bit hypocritical now? (Butting in?)\n \n \n No, of course not, you're opinions are so important, you're good enough to impart them, wherever and whenever they are needed.\n \n This is a great service you are doing.\n \n Go raibh mile maith agat, mo chara!\n\n \n \n Monty Monty Monty...\n \n Tá fáilte romhat!\n \n Let me \"drop some knowledge\"\n \n \n Don't get your panties all in a bunch! An dáiríre atá tú?... You can't be.... I never said that you should make no comment on anything.... I only said this was an American story not an Australian one... Which I see now I have to break this down into a simpler explaination. The fact that you won't consider the foundation of the constitution and the context in which it was written means that you are looking at our domestic issues through skewed australian eyes. The facts are there for you to read but you REFUSE to consider the very foundation that our constitution does not GRANT RIGHTS it RECOGNIZES that the RIGHT HAS ALWAYS EXISTED! That the Connstitution INCLUDING the second Amendment puts RESTRICTIONS ON THE GOVERNMENTS AND NOT THE PEOPLE. Furthermore these INALIENABLE RIGHTS are protected and safeguarded by our second amendment. Until you learn these fundamentals of US CONSTITUTIONAL LAW and consider these matters in that context you have no basis for rational argument on this subject matter whatsoever and subject your standing to a side show at best.\n \n Finally, you are the one making these absurd demands that one not \"but in\" in a PUBLIC forum... If you want PRIVATE communications... then may I suggest you try E-MAIL\n \n \n Until you figure yourself out.... Go n-ithe an cat thú, is go n-ithe an diabhal an cat! my Global Socialist friend....\n \n \n \n BTW... Cò an caora sin còmhla riut a chunnaic mi an-raoir? \n \n \n MOLON LABE!", 
   {}, 
   17914, 
   null, 
   1065026700.0
  ], 
  [
   17950, 
   null, 
   "montalban", 
   "\n You can't be.... I never said that you should make no comment on anything.... I only said this was an American story not an Australian one... \n\n \n Thank you for your apology. There you were implying I had no right to talk about America, I'm glad you've 're-invited' me into this debate.\n \n \nThe fact that you won't consider the foundation of the constitution and the context in which it was written means that you are looking at our domestic issues through skewed Australian eyes. The facts are there for you to read but you REFUSE to consider the very foundation that our constitution does not GRANT RIGHTS it RECOGNIZES that the RIGHT HAS ALWAYS EXISTED! That the Constitution INCLUDING the second Amendment puts RESTRICTIONS ON THE GOVERNMENTS AND NOT THE PEOPLE. Furthermore these INALIENABLE RIGHTS are protected and safeguarded by our second amendment. Until you learn these fundamentals of US CONSTITUTIONAL LAW and consider these matters in that context you have no basis for rational argument on this subject matter whatsoever and subject your standing to a side show at best.\n \n\n \n You say that the Constitution puts restrictions of the government, but not the people.\n \n Tell me if you as a private citizen (with your guns) are allowed\n In State Schools?\n On Federal property - military reserves\n In court buildings?\n On National Parks?\n In public hospitals?\n \n If no to any of these, then your rights have been abridged, and you've no case to quote the Constitution as an absolute, even in regards to governments.\n \n Look at your next go at weaving into your argument absolutes...\n \n \nthat the RIGHT HAS ALWAYS EXISTED\n\n \n So, cavemen had the right to be free from lodging soldiers? (Amendment III)\n \n That cavemen had the right to trial by jury, in cases involving more than $20.(Amendment VII)\n \n How did cavemen vote for President? (Amendment XII)\n \n You say that the constitution is just elaborating on rights that have always existed, then why the need to write them down?\n \n If these rights always existed, then why can some constitutionally be added, then subtracted? (Amendment XVIII - Prohibition, then Amendment XXI - repealing Prohibition).\n \n Obviously these rights are not absolute either, in that they haven't always existed. American rights come about by winning a war against Britain, and entering into a social compact with fellow like-minded citizens. With powers given to a central authority to protect these rights and rules.\n \n And the constitution gives the state the right to defend itself!\n \"The Congress shall have power to declare the punishment of treason, but no attainder of treason shall work corruption of blood, or forfeiture except during the life of the person attainted.\"\n \n Furthermore, if the Constitution does not restrict people, then how do you account for it emplacing limits on the voting age? Or, who can run for US President?\n \n Moreover, if the Constitution does not restrict people, then why are your rights to carry guns less of value than an airliner's right to forbid you to carry your guns onto an aeroplane? Who decided that the airliner had MORE right?\n \n Basically, you're wrong, wrong, wrong, and wrong.", 
   {
    "unicode_changes_made": true
   }, 
   17919, 
   null, 
   1065073800.0
  ], 
  [
   17958, 
   null, 
   "kelvin90701", 
   "\n \n Tell me if you as a private citizen (with your guns) are allowed\n In State Schools?\n On Federal property - military reserves\n In court buildings?\n On National Parks?\n In public hospitals?\n \n .\n\n \n State Schools? That is still in debate. This the only challenge to the law thus far. Looks like we WILL have guns allowed on schools soon.\n http://www.jointogether.org/gv/news/summaries/reader/0,2061,561929,00.html\n \n Reserve bases? They give you one when you walk through the gate. If your not allowed on the base, then and try to enter. Then you are in direct violation of the Constitution. Congress is given authority to raise and train a standing army. Part of that authority is to keep civilians OFF the base armed or not.\n \n In court? That violates the V Amendment. The right to a fair trial. A non verbal message is sent to judge and jurry when armed citizens are in a court. That influences the judge and jurry. So it is not Constitutional to influence a judge and jurry. It is illegal. You can argue it is legal to bring your firearms into an EMPTY courthouse where there is no trial. It is most definately violates the right of accused to have firearms in a courthouse.\n \n On National Parks? Ever hear of hunting?\n \n In public hospitals. I do all the time.", 
   {}, 
   17950, 
   null, 
   1065080400.0
  ], 
  [
   17959, 
   null, 
   "kelvin90701", 
   "\n \n If no to any of these, then your rights have been abridged, and you've no case to quote the Constitution as an absolute, even in regards to governments.\n \n Basically, you're wrong, wrong, wrong, and wrong.\n\n \n Basically you point is based on violating one right to perserve another right. No one has no right to violate anothers rights. Your rights end when they violate another. That is the definition of a criminal. Someone who violates personal, civil, and property rights of another. In a trial, especially for high crimes, the accused has only one right left, a fair trial. The 5th Amendment is all an accused has left.\n \n Your point is based on lawlessness, unethical, and criminal behavior.", 
   {
    "unicode_changes_made": true
   }, 
   17950, 
   null, 
   1065080820.0
  ], 
  [
   17961, 
   null, 
   "kelvin90701", 
   "\n \n Basically, you're wrong, wrong, wrong, and wrong.\n\n \n I am sure a felon who has spent the last 5 years in prison pumping iron and getting more violent all the time is no match for your cell phone.", 
   {
    "unicode_changes_made": true
   }, 
   17950, 
   null, 
   1065081180.0
  ], 
  [
   17962, 
   null, 
   "mizmaxx", 
   "I am sure a felon who has spent the last 5 years in prison pumping iron and getting more violent all the time is no match for your cell phone.\n\n \n What have you done to that felon that he's after you?\n \n I'm not in favour of gun legislation, but unless you're being chased by cops or someone else with a gun on a regular basis, it seems a little paranoid to be carrying one around.\n \n Sidebar- Charlton Heston is racist XXXXX, and he has no tact going places where kids have just been killed to have pro-gun rallies.", 
   {}, 
   17961, 
   null, 
   1065082020.0
  ], 
  [
   17969, 
   null, 
   "montalban", 
   "State Schools? That is still in debate. This the only challenge to the law thus far. Looks like we WILL have guns allowed on schools soon.\n\n \n I only ask about schools because in another thread you mentioned militia as being from 17, and I guess that people are still in school at that age.\n \n \nReserve bases? They give you one when you walk through the gate. If your not allowed on the base, then and try to enter. Then you are in direct violation of the Constitution. Congress is given authority to raise and train a standing army. Part of that authority is to keep civilians OFF the base armed or not.\n\n \n I take this point.\n \n \nIn court? That violates the V Amendment. The right to a fair trial. A non verbal message is sent to judge and jurry when armed citizens are in a court. That influences the judge and jurry. So it is not Constitutional to influence a judge and jurry. It is illegal. You can argue it is legal to bring your firearms into an EMPTY courthouse where there is no trial. It is most definately violates the right of accused to have firearms in a courthouse.\n\n \n Why would it abridge a fair trial? The witness/defendant won't necessarily know you're armed, unless you're carrying a bandolier, and a side-arm in a holster.\n \n \nOn National Parks? Ever hear of hunting?\n\n \n Now this I didn't know! I thought National Parks were there to preserve wildlife! Why don't you call them 'game reserves'? My understand was that you could only shoot the animals that wandered off the National Parks areas.\n \n \nIn public hospitals. I do all the time.\n\n \n Really? What danger are there from doctors and nurses? But seriously, why are you allowed to take guns onto public hospitals? \n \n What about other government buildings? The White House, the Congress, State Capitol Buildings. FBI buildings etc.\n \n What about jails?\n \n What about polling booths? (are these owned/leased by the government).\n \n \nBasically you point is based on violating one right to preserve another right. No one has no right to violate anothers rights. Your rights end when they violate another. That is the definition of a criminal. Someone who violates personal, civil, and property rights of another. In a trial, especially for high crimes, the accused has only one right left, a fair trial. The 5th Amendment is all an accused has left.\n Your point is based on lawlessness, unethical, and criminal behavior.\n\n \n I'm not actually trying to make such a point. I don't support criminal behaviour.\n \n My understanding was that the 2nd Amendment is waved around as an absolute. SHALL NOT BE INFRINGED seems pretty plain.\n \n I was looking at exceptions to the rule.\n \n Rev.Hellbound claims that this right only applies to the government - restricting its actions.\n \n So, I'm trying to investigate if there are still exceptions made in this modified case.\n \n Therefore, if someone such as RevHellbound is trying to make a case, but there are everyday exceptions even to his qualified case, then even he can not use the 2nd Amendment right as he has been doing.\n \n In other words rights are 'violated'.\n \n This is not uncommon. When you are arrested (even if you're innocent), your right to freedom of movement is instantly curbed, even if briefly. You may be able to get recompense, but for a while your rights are violated. And, if you are guilty, then rights are taken away from you in the interest of the nation.\n \n If you have a contagious disease, your rights will be violated for the sake of others.\n \n When a nation is at war, other rights are abridged, in the national interest.\n \n Your right to have all the money you earn is abridged by taxes... in the national interest.\n \n Your rights as a child differ from your rights as an adult.\n \n In the national interest, peace and law and order should be paramount. This does not seem to happen in a society that allows guns to be so prevalent.\n \n I believe in many respects that my rights are still best served when the national interest comes before personal interest.", 
   {}, 
   17962, 
   null, 
   1065098940.0
  ], 
  [
   17979, 
   null, 
   "Rev. HellH0und", 
   "Thank you for your apology. There you were implying I had no right to talk about America, I'm glad you've 're-invited' me into this debate.\n \n\n \n Yes I apologize for your ignorance and your inability to 'get it'.... \n \n \n \n\n You say that the Constitution puts restrictions of the government, but not the people.\n \n Tell me if you as a private citizen (with your guns) are allowed\n In State Schools?\n On Federal property - military reserves\n In court buildings?\n On National Parks?\n In public hospitals?\n \n If no to any of these, then your rights have been abridged, and you've no case to quote the Constitution as an absolute, even in regards to governments.\n \n\n \n \n This is the dumbest thing I ever heard! Yes our rights are being infringed. That does not mean I throw out the constitution or ANY of my rights because of it Or that the constitution is somehow null and void because some treasonous bastards are raping it for thier own political power. \n \n Is your argument actually 'If the fedgov says so I should be a good sheep and abide by it'?\n \n Look at your next go at weaving into your argument absolutes...\n \n \n \n\n So, cavemen had the right to be free from lodging soldiers? (Amendment III)\n \n That cavemen had the right to trial by jury, in cases involving more than $20.(Amendment VII)\n \n How did cavemen vote for President? (Amendment XII)\n \n You say that the constitution is just elaborating on rights that have always existed, then why the need to write them down?\n \n If these rights always existed, then why can some constitutionally be added, then subtracted? (Amendment XVIII - Prohibition, then Amendment XXI - repealing Prohibition).\n \n Obviously these rights are not absolute either, in that they haven't always existed. American rights come about by winning a war against Britain, and entering into a social compact with fellow like-minded citizens. With powers given to a central authority to protect these rights and rules.\n \n\n \n \n ***YAWN*** You just don't get it do you? The rights of a freeman are just that... I should be able to do ANYTHING I WANT as long as I do not infringe on anyone else. (ninth amendmendt)...\n \n The constitution (yet again) does not grant rights. It recognizes rights that have already existed.\n \n \n\n And the constitution gives the state the right to defend itself!\n \"The Congress shall have power to declare the punishment of treason, but no attainder of treason shall work corruption of blood, or forfeiture except during the life of the person attainted.\"\n \n\n \n your point? I am talking about the bill of rights in the constitution as we are sposed to be specific to the second amendment. One of the true 'purposes' of government is the security of the state.\n \n \n \n\n Furthermore, if the Constitution does not restrict people, then how do you account for it emplacing limits on the voting age? Or, who can run for US President?\n \n\n \n Extremist logic. we have a representative republic not an anarchy...\n \n \n\n Moreover, if the Constitution does not restrict people, then why are your rights to carry guns less of value than an airliner's right to forbid you to carry your guns onto an aeroplane? Who decided that the airliner had MORE right?\n \n\n \n You don't follow threads very well do you? I have always said private industries and private businesses HAVE that right to refuse anyone for anything...\n \n \n\n Basically, you're wrong, wrong, wrong, and wrong.\n\n \n \n \n When one lacks the substance of facts and knowledge one tends to drop into this type of hollow statment.\n \n \n If I am so wrong, socialist, then MOLON LABE!", 
   {
    "unicode_changes_made": true
   }, 
   17950, 
   null, 
   1065107520.0
  ], 
  [
   17980, 
   null, 
   "Rev. HellH0und", 
   "\n Sidebar- Charlton Heston is racist XXXXX, and he has no tact going places where kids have just been killed to have pro-gun rallies.\n\n \n \n \n Oh we are calling people names? Your a sheep who absorbs all the media lies and dribble that comes your way. You are only 'free' because you 'are made and kept so by better men than yourself'.\n \n You obviously watched and believe that scumbag liar michelle moore.\n \n You condem Heston but not the killers at Columbine? HYPOCRACY\n \n \n The Moore the Scarier", 
   {}, 
   17962, 
   null, 
   1065107820.0
  ], 
  [
   17982, 
   null, 
   "Crim", 
   "Sidebar- Charlton Heston is racist XXXXX, and he has no tact going places where kids have just been killed to have pro-gun rallies.\n \n \n He has no tact holding a required-by-law meeting in a location that was decided upon long before Columbine ?", 
   {}, 
   17979, 
   null, 
   1065109560.0
  ], 
  [
   18021, 
   null, 
   "kelvin90701", 
   "What have you done to that felon that he's after you?\n \n I'm not in favour of gun legislation, but unless you're being chased by cops or someone else with a gun on a regular basis, it seems a little paranoid to be carrying one around.\n \n .\n\n \n I carry a gun for the same reason I wear a seat belt and have medical insurance, just incase I have a collision or get sick.\n \n I can respect an opinion. I can not respect the attitude that someone will do nothing to prepare for criminal attacks. Assaults happen every day, just like car accidents.", 
   {}, 
   17962, 
   null, 
   1065150000.0
  ], 
  [
   18023, 
   null, 
   "kelvin90701", 
   "\n \n My understanding was that the 2nd Amendment is waved around as an absolute. SHALL NOT BE INFRINGED seems pretty plain.\n .\n\n \n YOU and I have been through this before. You are trying to make your point by violating civil rights. The right to bear arms is absolute. Your rights end when you are inviolation of anothers rights. That goes for all rights. The 2nd Amend right is no exception. \n \n Courthouses? You know very well what non verbal message a gun in a courthouse sends. Violation of 5th Amendment.\n \n Hunting on federal land? I just ate an animal last month that a neighbor took an federal land.\n \n The hospital? Ever get sick at night? Perfect place for a mugging, in a hospital parking lot. Where victims are sick or infirm.\n \n Jail? I will never be in a jail, unless cops have completely taken away my rights. Isn't that the whole point of jail, to take away your rights? Once your in jail your under Due Process. Your in the process of having your rights removed.\n \n Polls? You and I have been through this before already.", 
   {}, 
   17969, 
   null, 
   1065150780.0
  ], 
  [
   18024, 
   null, 
   "kelvin90701", 
   "Do The SNiVeL:\n \n Step 1: \"S\" is for Safe - Assume a safe, fetal position, preferably under a table or other cover. \n \n Step 2: \"N\" & \"V\" are for Non-Violent - Remember, remain non-violent. Moves that could be interpreted as 'self-defense' may only serve to further provoke your assailant. Offer no resistance. \n \n Step 3: \"L\" is for Limp - Remain limp while begging and groveling for your life!!! This is no time for pride or courage, so cry like a girl, you fool!!! This will always serve you better than a firearm, which would only inject more violence into the situation. Finally, stay limp until your assailant has finished beating you like a rented mule. He will eventually tire from pummeling you mercilessly and choose to move on to a more entertaining endeavor, such as beating your spouse and/or children. \n \n \n http://www.guncontrolalliance.org/snivel.htm", 
   {
    "post_info": {
     "post_title": "Self-defense"
    }
   }, 
   17851, 
   null, 
   1065151380.0
  ], 
  [
   18039, 
   null, 
   "montalban", 
   "[QUOTE=Rev. Hellbound]Yes I apologize for your ignorance and your inability to 'get it'.... \n \n You're welcome. I am happy, comrade that I don't 'get' you're argument.\n \n \nThis is the dumbest thing I ever heard! Yes our rights are being infringed. That does not mean I throw out the constitution or ANY of my rights because of it Or that the constitution is somehow null and void because some treasonous bastards are raping it for their own political power. \n \n Is your argument actually 'If the fedgov says so I should be a good sheep and abide by it'?\n \n Look at your next go at weaving into your argument absolutes...\n \n ***YAWN*** You just don't get it do you? The rights of a freeman are just that... I should be able to do ANYTHING I WANT as long as I do not infringe on anyone else. (ninth amendmendt)...\n\n \n But you do infringe on other people, or you would, except that the government keeps you from taking guns to court etc.\n \n If your rights are being infringed by the government, the majority of Americans seem to have accepted it. As it is pretty much a democracy, then it is the right of the people to waive their own rights.\n \n \nThe constitution (yet again) does not grant rights. It recognizes rights that have already existed.\n\n \n If they have always existed, then you're the one who hasn't 'got it' when I used my caveman analogy. What freeman rights did they have? Please explain how the Constitution has protected rights that have ALWAYS existed - they're your words. How long ago did people have the right to a fair trial for matters over $20.00?\n \n Again you're caught out using silly absolutes.\n \n American law stems from English Common Law. Show me (from your extensive historical knowledge) where the right to bear arms was guaranteed by English Common Law - or was this a 'right' that they never wrote down?\n \n \nyour point? I am talking about the bill of rights in the constitution as we are sposed to be specific to the second amendment. One of the true 'purposes' of government is the security of the state.\n\n \n Exactly, and if it's an insecure state because a lot of people are carrying a lot of guns (because they fear the state) then the state has the right to protect itself.\n \n If it's in the best interest of the state to legislate, and you agree to this, then you've got no cause to be angry with them if they want to take guns off people!\n \n \nYou don't follow threads very well do you? I have always said private industries and private businesses HAVE that right to refuse anyone for anything...\n\n \n I did understand this. You don't understand that your statement makes no sense. Why are you prepared to have your rights infringed by big business, but not by the government. It's absurd.\n \n In fact you don't quite understand what you are saying... first it's an absolute right, that you've always had, then it's an absolute right that can be waived by big business, then also by the government (see Government Schools example on other post).\n \n You are in the end, a jingoist. Someone presses a button and you shout \"My God given rights!\"\n \n \nIf I am so wrong, socialist, then MOLON LABE!\n\n \n Hey, look another jingo! Molon Labe!\n \n You are wrong. You are trying to deal with absolutes...\n Such as you've always had certain rights... but this isn't the case\n \n That your right to carry arms is inalienable, but then you're happy for some unexplained reason to waive that in the worship of business.\n \n Repeating XXXXX Lobes all the time doesn't mean anything.", 
   {}, 
   17979, 
   null, 
   1065178080.0
  ], 
  [
   18040, 
   null, 
   "montalban", 
   "YOU and I have been through this before. You are trying to make your point by violating civil rights. The right to bear arms is absolute. Your rights end when you are inviolation of anothers rights. That goes for all rights. The 2nd Amend right is no exception. \n \n Courthouses? You know very well what non verbal message a gun in a courthouse sends. Violation of 5th Amendment.\n \n Hunting on federal land? I just ate an animal last month that a neighbor took an federal land.\n \n The hospital? Ever get sick at night? Perfect place for a mugging, in a hospital parking lot. Where victims are sick or infirm.\n \n Jail? I will never be in a jail, unless cops have completely taken away my rights. Isn't that the whole point of jail, to take away your rights? Once your in jail your under Due Process. Your in the process of having your rights removed.\n \n Polls? You and I have been through this before already.\n\n \n I will change tact somewhat.\n \n If a majority of people in the US want to carry guns, then so be it. However, I do think it is a mistake to try to justify such actions by appealing to a constitution that in fact really does not seem to grant you such absolute rights.\n \n Just try, I think, to keep to 'democracy' arguments rather than constitutional.\n \n Your friend who shot an animal on fed land doesn't mean it was a National Park. There is lots of fed land, courts, post office, air bases, national parks etc.\n \n You may not want to go to jail, but I'm sure the government will take your right to carry a gun away from you there. But you accept that they can take away your rights - hopefully they ARE following due process, but this doesn't seem to happen so much if you're black.\n \n The government has rights too! It can even take you to court", 
   {}, 
   18023, 
   null, 
   1065178440.0
  ], 
  [
   18056, 
   null, 
   "Rev. HellH0und", 
   "But you do infringe on other people, or you would, except that the government keeps you from taking guns to court etc.\n \n\n \n How do I infringe on anyones rights? How are YOU attempting to infringe on anyones rights?\n \n \n\n If your rights are being infringed by the government, the majority of Americans seem to have accepted it. As it is pretty much a democracy, then it is the right of the people to waive their own rights.\n\n \n We are a representative republic. Pure democracy is mob rule. And you are wrong.\n \n \n\n If they have always existed, then you're the one who hasn't 'got it' when I used my caveman analogy. What freeman rights did they have? Please explain how the Constitution has protected rights that have ALWAYS existed - they're your words. How long ago did people have the right to a fair trial for matters over $20.00?\n \n Again you're caught out using silly absolutes.\n \n\n \n \n You sir, are a XXXXX. You have this one line argument that is lacking at best. Either you are too stupid to understand me or your just being an A$$. You are being 'absolute' in the most pitiful attempt to corner me into your dis-logic. The rights in the Constitution recognize SOME of the rights of freemen. \n \n \n I won't try to explain it to you yet again as an explaination is not what you are looking for.\n \n I will let FINDLAW do it for me.... Argue with this:\n \n NINTH AMENDMENT\n \n The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people\n \n \n \"Rights Retained by the People \n \n Aside from contending that a bill of rights was unnecessary, the Federalists responded to those opposing ratification of the Constitution because of the lack of a declaration of fundamental rights by arguing that inasmuch as it would be impossible to list all rights it would be dangerous to list some because there would be those who would seize on the absence of the omitted rights to assert that government was unrestrained as to those. 1 Madison adverted to this argument in presenting his proposed amendments to the House of Representatives. ''It has been objected also against a bill of rights, that, by enumerating particular exceptions to the grant of power, it would disparage those rights which were not placed in that enumeration; and it might follow by implication, that those rights which were not singled out, were intended to be assigned into the hands of the General Government, and were consequently insecure. This is one of the most plausible arguments I have ever heard against the admission of a bill of rights into this system; but, I conceive, that it may be guarded against. I have attempted it, as gentlemen may see by turning to the last clause of the fourth resolution.'' 2 It is clear from its text and from Madison's statement that the Amendment states but a rule of construction, making clear that a Bill of Rights might not by implication be taken to increase the powers of the national government in areas not enumerated, and that it does not contain within itself any guarantee of a right or a proscription of an infringement. 3 Recently, however, the Amendment has been construed to be positive affirmation of the existence of rights which are not enumerated but which are nonetheless protected by other provisions. \n \n \n The Ninth Amendment had been mentioned infrequently in decisions of the Supreme Court 4 until it became the subject of some exegesis by several of the Justices in Griswold v. Connecticut. 5 There a statute prohibiting use of contraceptives was voided as an infringement of the right of marital privacy. Justice Douglas, writing the opinion of the Court, asserted that the ''specific guarantees in the Bill of Rights have penumbras, formed by emanations from those guarantees that help give them life and substance.'' 6 Thus, while privacy is nowhere mentioned, it is one of the values served and protected by the First Amendment, through its protection of associational rights, and by the Third, the Fourth, and the Fifth Amendments as well. The Justice recurred to the text of the Ninth Amendment, apparently to support the thought that these penumbral rights are protected by one Amendment or a complex of Amendments despite the absence of a specific reference. Justice Goldberg, concurring, devoted several pages to the Amendment. \n \n \n ''The language and history of the Ninth Amendment reveal that the Framers of the Constitution believed that there are additional fundamental rights, protected from governmental infringement, which exist alongside those fundamental rights specifically mentioned in the first eight constitutional amendments. . . . To hold that a right so basic and fundamental and so deep-rooted in our society as the right of privacy in marriage may be infringed because that right is not guaranteed in so many words by the first eight amendments to the Constitution is to ignore the Ninth Amendment and to give it no effect whatsoever. Moreover, a judicial construction that this fundamental right is not protected by the Constitution because it is not mentioned in explicit terms by one of the first eight amendments or elsewhere in the Constitution would violate the Ninth Amendment. . . . Nor do I mean to state that the Ninth Amendment constitutes an independent source of right protected from infringement by either the States or the Federal Government. Rather, the Ninth Amendment shows a belief of the Constitution's authors that fundamental rights exist that are not expressly enumerated in the first eight amendments and an intent that the list of rights included there not be deemed exhaustive.'' 7 While, therefore, neither opinion sought to make of the Ninth Amendment a substantive source of constitutional guarantees, both did read it as indicating a function of the courts to interpose a veto with regard to legislative and executive efforts to abridge other fundamental rights. In this case, both opinions seemed to concur that the fundamental right claimed and upheld was derivative of several express rights and in this case, really, the Ninth Amendment added almost nothing to the argument. But if there is a claim of a fundamental right which cannot reasonably be derived from one of the provisions of the Bill of Rights, even with the Ninth Amendment, how is the Court to determine, first, that it is fundamental, and second, that it is protected from abridgment? 8 \"\n \n \n \n Also:\n \n \"(1) The Second Amendment to the U.S. Constitution does not establish the right to keep and bear arms. None of the provisions of the Constitution establish any \"natural\" rights. They recognize such rights, but the repeal of such provisions would not end such rights. Such rights were considered by many of the Framers as obvious or \"self-evident\", but they were immersed in the prevailing republican thought of the day, as expressed in the writings of Locke, Montesquieu, Rousseau, Madison, Hamilton, and others, which discussed \"natural rights\" in some detail. Others argued that at least some of the rights needed to be made explicit in the Bill of Rights to avoid having future generations with less understanding of republican theory weaken in their defense of those rights. That has turned out to have been a good idea\"\n \n Legal Theory of the Right to Keep and Bear Arms\n \n I have done the research for you. \n \n \n\n American law stems from English Common Law. Show me (from your extensive historical knowledge) where the right to bear arms was guaranteed by English Common Law - or was this a 'right' that they never wrote down?\n\n \n Are you that lazy.... FInd it yourself... heres a taste from the above link:\n \n \"(2) The right to keep and bear arms is a natural right of individuals under the theory of democratic government. This was clearly the understanding and intent of the Framers of the U.S. Constitution and was a long-established principle of English common law at the time the Constitution was adopted, which is considered to be a part of constitutional law for purposes of interpreting the written Constitution.\"\n \n \n \n\n Exactly, and if it's an insecure state because a lot of people are carrying a lot of guns (because they fear the state) then the state has the right to protect itself.\n\n \n \n You trust government more than you trust people. I trust the people more than I trust governments. This century alone governments have been responsible for over 170 MILLION deaths. How many have \"the people\" been responsible for...\n \n \n\n If it's in the best interest of the state to legislate, and you agree to this, then you've got no cause to be angry with them if they want to take guns off people!\n\n \n Circular logic not worth commenting on.\n \n \n \n\n I did understand this. You don't understand that your statement makes no sense. Why are you prepared to have your rights infringed by big business, but not by the government. It's absurd.\n\n \n Look you communist. Private businesses are PRIVATE. Just like I would not let you into my house at my discretion I would not let you into my business at my discrestion. Airlines are the same thing, resteraunts are the same thing. How many times does this simple concept need explaining to you? I have a CHOICE as to whether I patronize those businesses. \n \n \n\n In fact you don't quite understand what you are saying... first it's an absolute right, that you've always had, then it's an absolute right that can be waived by big business, then also by the government (see Government Schools example on other post).\n\n \n Its an abolute right that is being infringed by power hungry tyrants and I am involved in the fight to restore those rights. \n \n \n\n You are in the end, a jingoist. Someone presses a button and you shout \"My God given rights!\"\n \n\n \n \n \n hah hah hah! maybe... But you got to consider. I have a purpose, I have the will, I have the support, and I have those pesky unalienable rights on my side... Oh and one more thing I am armed and trained. You are not...", 
   {}, 
   18039, 
   null, 
   1065193440.0
  ], 
  [
   18059, 
   null, 
   "kelvin90701", 
   "\n \n If they have always existed, then you're the one who hasn't 'got it' when I used my caveman analogy. What freeman rights did they have? Please explain how the Constitution has protected rights that have ALWAYS existed - they're your words. How long ago did people have the right to a fair trial for matters over $20.00?\n \n Again you're caught out using silly absolutes.\n .\n\n \n Your sheep. You do not get our Constitution and our freedom. Your applying your notions of freedom on us.\n \n \"I rely on the police.\" Your sheep and do not even know it.", 
   {}, 
   18039, 
   null, 
   1065199260.0
  ], 
  [
   18169, 
   null, 
   "mizmaxx", 
   "He has no tact holding a required-by-law meeting in a location that was decided upon long before Columbine ?\n\n \n Nope. Not for an organization whose sole purpose is to advocate for gun owners, when the kids had been shot. Cancel it. Move it. The guy's got enough cash, he can book another location. When you say \"required by law\" you make it sound like they would get arrested if they didn't do it. I think that's a bit misleading.\n \n If I worked for a dog-breeding convention, and we were booked to have a meeting in an area where children had been massacred by a pack of torture-trained dogs, I would change the plan. Out of simple respect.\n \n \nI carry a gun for the same reason I wear a seat belt and have medical insurance, just incase I have a collision or get sick.\n \n I can respect an opinion. I can not respect the attitude that someone will do nothing to prepare for criminal attacks. Assaults happen every day, just like car accidents.\n\n \n I don't know if a seat belt is a good analogy as far as I'm concerned. More like wearing a helmet and full body protection every time you walk down the street.\n \n I don't think the state should legislate whether you can carry a gun, but I think for most people carrying a gun all the time is over-self-protective.\n \n \nOh we are calling people names? Your a sheep who absorbs all the media lies and dribble that comes your way. You are only 'free' because you 'are made and kept so by better men than yourself'.\n \n You obviously watched and believe that scumbag liar michelle moore.\n \n You condem Heston but not the killers at Columbine? HYPOCRACY\n\n \n I don't need a translator to understand the statement that \"ethnics\" are the cause of violence in the US. I doubt any amount of \"media lies and dribble\" (sic) or \"scumbag liars\" could distort that information.\n \n I didn't talk about the killers at Columbine, so you have no idea how I feel about them.\n \n As for the mysterious people so graciously making and leeping me free, you can tell them to get a real job, because they suck at this one.\n \n On gun control in general-\n \n \"Gun control in the US has always been directed primarily at minorities, especially blacks. Until fairly recently (1950s forward and even then spotty), black-on-black crime wasn't taken seriously at all; so long as no white bodies turned up, racist inner-city cops didn't care. The actual police slang term for violence in the black areas of town circa 1890 to well into the 20th century was \"just another niggertown Saturday night\" which is where the gun-banners get the term \"Saturday night special\" for low-end handguns. NOT an accident, that.\n \n While gun control laws appeared to be written in a race-neutral fashion after the passage of the 14th Amendment of 1868, the reality was different. As Justice Buford of the Florida Supreme Court noted in a 1941 case involving a white guy *freed* despite packing without a carry permit put it: \n \n \"I know something of the history of this legislation. The original Act of 1893 was passed when there was a great influx of negro laborers in this State drawn here for the purpose of working in turpentine and lumber camps. The same condition existed when the Act was amended in 1901 and the Act was passed for the purpose of disarming the negro laborers and to thereby reduce the unlawful homicides that were prevalent in turpentine and saw-mill camps and to give the white citizens in sparsely settled areas a better feeling of security. The statute was never intended to be applied to the white population and in practice has never been so applied.\" Watson v. Stone, 4 So.2d 700, 703 (Fla. 1941) from Clayton Cramer's Racist Roots Of Gun Control: \n \n (Note: Buford partially lied. What happened in 1893 was that a Klan raiding party tried to hit a black township just outside of Gainsville. The \"brothas\" shot the bejeezus out of 'em with leverguns and revolvers (yea!). Guess which guns were specifically targeted for permits in Florida in 1893? Yup. Leverguns and revolvers.)\n \n So here's what's happening today: the cities with the highest black populations also have the heaviest gun control: New York, Boston, Washington DC, Chicago, Los Angeles and similar, and until very recently (2001) Detroit. The cities with the least gun control such as Dallas, Seattle, Portland OR and similar have the lowest minority populations.\"\n \n quoted from Jim Marsh", 
   {}, 
   17982, 
   null, 
   1065266400.0
  ], 
  [
   18185, 
   null, 
   "Rev. HellH0und", 
   "Nope. Not for an organization whose sole purpose is to advocate for gun owners, when the kids had been shot. Cancel it. Move it. The guy's got enough cash, he can book another location. When you say \"required by law\" you make it sound like they would get arrested if they didn't do it. I think that's a bit misleading.\n \n If I worked for a dog-breeding convention, and we were booked to have a meeting in an area where children had been massacred by a pack of torture-trained dogs, I would change the plan. Out of simple respect.\n \n\n \n If you bred poodles you would cancel over something that was committed by the causes of criminals? You got to come out of that 'gun owners are criminals mentality!' If you are a gun owner be proud. repeat after me \"I am not a criminal because I choose to exercise my second amendment rights\". The criminals are criminals and those who wish to violate you rights are treasonous criminals. Had he cancelled it would have been tatamount to admission that 'guns are the cause' This is most important to consider. \n \n \n\n I don't know if a seat belt is a good analogy as far as I'm concerned. More like wearing a helmet and full body protection every time you walk down the street.\n \n I don't think the state should legislate whether you can carry a gun, but I think for most people carrying a gun all the time is over-self-protective.\n \n\n \n I agree but it is THIER RIGHT which is recognized by the second amendment. \n \n \n\n I don't need a translator to understand the statement that \"ethnics\" are the cause of violence in the US. I doubt any amount of \"media lies and dribble\" (sic) or \"scumbag liars\" could distort that information.\n \n I didn't talk about the killers at Columbine, so you have no idea how I feel about them.\n \n As for the mysterious people so graciously making and leeping me free, you can tell them to get a real job, because they suck at this one.\n \n\n \n Perhaps I don't. But the reference which comes from XXXXXX who believe michelle moore the traitor usually spout this nonsense about Heston cancelling that meeting. Perhaps (from your last post as I will address below, I misread you somewhat... Who knows we will see. If so accept my apologies for my harsh words... If not well....)\n \n \n\n On gun control in general-\n \n \"Gun control in the US has always been directed primarily at minorities, especially blacks. Until fairly recently (1950s forward and even then spotty), black-on-black crime wasn't taken seriously at all; so long as no white bodies turned up, racist inner-city cops didn't care. The actual police slang term for violence in the black areas of town circa 1890 to well into the 20th century was \"just another niggertown Saturday night\" which is where the gun-banners get the term \"Saturday night special\" for low-end handguns. NOT an accident, that.\n \n While gun control laws appeared to be written in a race-neutral fashion after the passage of the 14th Amendment of 1868, the reality was different. As Justice Buford of the Florida Supreme Court noted in a 1941 case involving a white guy *freed* despite packing without a carry permit put it: \n \n \"I know something of the history of this legislation. The original Act of 1893 was passed when there was a great influx of negro laborers in this State drawn here for the purpose of working in turpentine and lumber camps. The same condition existed when the Act was amended in 1901 and the Act was passed for the purpose of disarming the negro laborers and to thereby reduce the unlawful homicides that were prevalent in turpentine and saw-mill camps and to give the white citizens in sparsely settled areas a better feeling of security. The statute was never intended to be applied to the white population and in practice has never been so applied.\" Watson v. Stone, 4 So.2d 700, 703 (Fla. 1941) from Clayton Cramer's Racist Roots Of Gun Control: \n \n (Note: Buford partially lied. What happened in 1893 was that a Klan raiding party tried to hit a black township just outside of Gainsville. The \"brothas\" shot the bejeezus out of 'em with leverguns and revolvers (yea!). Guess which guns were specifically targeted for permits in Florida in 1893? Yup. Leverguns and revolvers.)\n \n So here's what's happening today: the cities with the highest black populations also have the heaviest gun control: New York, Boston, Washington DC, Chicago, Los Angeles and similar, and until very recently (2001) Detroit. The cities with the least gun control such as Dallas, Seattle, Portland OR and similar have the lowest minority populations.\"\n \n quoted from Jim Marsh\n\n \n \n \n I seem to HAVE misread you..... Perhaps you see my point too on not accepting that gun owners and criminals who use guns are one in the same. Like that traitor Bloomberg who on 770wabc radio proclaimed that gun manufacturers were no different that drug dealers.\n \n \n The racist origins of gun control laws are well known by those who seek the truth.... The liberals, the media like to ignore that....\n \n \n MOLON LABE!", 
   {}, 
   18169, 
   null, 
   1065287160.0
  ], 
  [
   18195, 
   null, 
   "kelvin90701", 
   "Nope. Not for an organization whose sole purpose is to advocate for gun owners, when the kids had been shot. Cancel it. Move it. The guy's got enough cash, he can book another location. When you say \"required by law\" you make it sound like they would get arrested if they didn't do it. I think that's a bit misleading.\n \n\n \n Then the NRA leadership would be guilty of fraud, embezzlement, and misappropriation of funds if it was completely and totally cancelled.\n \n The NRA did cancel every event that was legally allowed for them to cancel.\n \n Cash is a finite resource.", 
   {}, 
   18169, 
   null, 
   1065289440.0
  ], 
  [
   18247, 
   null, 
   "Tim", 
   "\n The racist origins of gun control laws are well known by those who seek the truth.... The liberals, the media like to ignore that....\n MOLON LABE!\n\n Just a quick comment. US history has a lot of racism in it. The second amendment itself has racist origins. The southern states wanted the second amendment included in the constitution because they had large populations of blacks and they thought that an armed militia was an important protection against the possibility of a slave rebellion. \n \n An 99 page article published in the U.C. Davis Law Review entitled the \"The Hidden History of the Second Amendment\" goes into detail about this. 31 UC Davis Law Review 309 (1998).", 
   {}, 
   18185, 
   null, 
   1065348360.0
  ], 
  [
   18300, 
   null, 
   "montalban", 
   "Effectively your argument is that; the right to carry arms is a natural right, although you've no proof of what is a 'natural right'. Nor have you shown that this right has always existed... just that the founding fathers believed that these rights always existed... but then they would because they were trying to legitimate armed rebellion. Their rationale was they were rebelling against a legitimate authority, by stating that there was some higher authority which the state itself was in conflict with - rather a simple, but novel argument - and therefore they were just rebelling to restore this over-arching authority.\n \n Natural rights don't exist at all. How does a right 'just exist' ie. naturally?\n http://www.spectacle.org/0400/natural.html\n \n However, I don't expect you'll agree to that tract. So let's look at what you said.\n \n Firstly the Ninth Amendment is superfluous to your argument. You are trying to state that some rights have existed 'naturally' and the Constitution only vocalises some of them. But, what of these...? What are these natural rights that are not mentioned? Do the courts enunciate what they are?\n \n You said...\n \n \nThe rights in the Constitution recognize SOME of the rights of freemen.\n\n \n A-hem. Some freemen. It is not an absolute right. It never was. I asked you where do we find this 'natural right' to carry weapons? US laws somewhat stems from British laws; where did this right exist before it was mentioned in the Constitution? Or, did it just exist in man's hearts?\n \n Your web-site further claims \" The right to keep and bear arms is a natural right of individuals under the theory of democratic government. This was clearly the understanding and intent of the Framers of the U.S. Constitution and was a long-established principle of English common law at the time the Constitution was adopted, which is considered to be a part of constitutional law for purposes of interpreting the written Constitution.\"\n http://www.constitution.org/leglrkba.htm\n \n So, it at least is trying to say that this 'right' has existed in long-established principles in English common law! And, then, where might they be expressed? (Or are they just too suggesting it existed in the ether)\n \n What about?\n The U.K. Bill of Rights (1689)\n That the subjects which are Protestants may have arms for their defence suitable to their conditions and as allowed by law. It is not a 'natural' right. It is a legislated right.\n \n So, it's not all freemen, just some. Actually it was also in practice on propertied Protestants too! So much for being a universal, therefore natural right!\n \n Well, if you believe that this is a 'natural right' it only applies to non-Catholics, and is conditional by the law. Hardly a 'natural right'. Further, hardly a long-established principle. One web-site suggests also the Magna Carta of 1215, but as this in principle again only was related to the rights of Churchmen and nobles, it suggests to that you don't have this as a precedent of a 'long-established principle of English law' guaranteeing the rights of all freemen.\n \n You need too to understand that they (the English in 1688) had also ejected a legitimate government out - not over taxes, but because James II Stuart had a Catholic heir. By usurping traditional power they had to appeal to a higher authority.\n \n Either it has and has never been set down before the American revolution, or, it has. If the later, then where is it. If the former, then what proof do you have that this 'natural right' has always existed?\n \n Therefore as far as a 'natural right' existing, the right to bear arms doesn't seem very natural! It never applied to all freemen.\n \n Until you can prove that this right to bear arms is 'natural'... then I must look at how the 'right' has been enacted.\n \n How have Americans viewed this right and law?\n Houston v. Moore 1820\n \"[The immediate issue in this case was federal and state jurisdiction to try non-compliance with militia orders. The context provides much enlightenment on the militia institution. Militia duty was conscript duty. Militiamen were governed by the rules and articles of war. The Militia Acts were the precursors of the selective service acts of the twentieth century. There was NO mention of a \"personal right\" to be armed outside of lawful authority. Houston v. Moore is provided here for further enlightenment to interested parties as Appendix W to US v. Emerson. It was not included in the appendices provided to the Fifth Circuit.] \"\n http://www.potowmack.org/houst1.html\n \n Martin v. Mott, 1827\n \"[The issue in this case was federal and state authority and jurisdiction over the militia. As in Houston v. Moore, the context provides much enlightenment on the militia institution. Militia duty was conscript duty. Militiamen were governed by the rules and articles of war. The Militia Acts were the precursors of the selective service acts of the twentieth century. There was NO mention of a \"personal right\" to be armed outside of lawful authority. Martin v. Mott and Houston v. Moore are provided for further enlightenment to interested parties as Appendices to US v. Emerson. These were not included in the appendices provided to the Fifth Circuit.] \"\n http://www.potowmack.org/martmott.htm\n \n AYMETTE v. THE STATE (1840)\n \"When, therefore, (the British) Parliament says that \"subjects which are Protestants may have arms for their defence, suitable to their condition, as allowed by law,\" it does not mean for private defence, but, being armed, they may as a body rise up to defend their just rights, and compel their rulers to respect the laws. This declaration of right is made in reference to the fact before complained of, that the people had been disarmed, and soldiers had been quartered among them contrary to law. The complaint was against the government. The grievances to which they were thus forced to submit were for the most part of a public character, and could have been redressed only by the people rising up for their common defence, to vindicate their rights.\"\n The section under consideration, in our bill of rights, was adopted in reference to these historical facts, and in this point\n of view its language is most appropriate and expressive. Its words are, \"the free white men of this state have a right to keep and\n bear arms for their common defence.\"\n and\n \"hey need not, for such a purpose, the use of those weapons which are usually employed in private broils, and which are efficient only in the hands of the robber and the assassin. These weapons would be useless in war. \"\n http://www-2.cs.cmu.edu/afs/cs.cmu.edu/user/wbardwel/public/nfalist/aymette_v_state.txt\n \n At best this means you better hand in your glock! Notice the words 'as allowed by law' hardly shows a long standing principle of a natural right - unless you argue that it's always been infringed upon... and why not? We can't have every loony carrying guns around, if we did, gun related homicides would sky-rocket. Ooops, that's what's happening in America isn't it!\n \n This interpretation of a 'natural right' suggests you don't need a gun for your own safety, as you seem to believe.\n \n So, the state has always legislated and defined this right. That's what states are for - a referee or umpire to settle disputes in law. Further for the good of the people, the people have handed power over to the state. You might want to read Hobbes on this.", 
   {}, 
   18056, 
   null, 
   1065428400.0
  ], 
  [
   18309, 
   null, 
   "Rev. HellH0und", 
   "Just a quick comment. US history has a lot of racism in it. The second amendment itself has racist origins. The southern states wanted the second amendment included in the constitution because they had large populations of blacks and they thought that an armed militia was an important protection against the possibility of a slave rebellion. \n \n An 99 page article published in the U.C. Davis Law Review entitled the \"The Hidden History of the Second Amendment\" goes into detail about this. 31 UC Davis Law Review 309 (1998).\n\n \n \n \n Your '1984' tag line is most apropriate. This newspeak article that you did not link to is just another attempt to rewrite history. Where in the second amendment does it say \"white people\", where in the US code does it define \"able bodied men\" as white and ONLY white people can be in the militia? Just because they put \"law review\" at the end of thier name does not give them ANY standing in my book. It fails the logic test:\n \n What is Racist? \"The right of the people\"... Or the fact that the heaviest populations of minorities have the greatest gun control?", 
   {}, 
   18247, 
   null, 
   1065451980.0
  ], 
  [
   18310, 
   null, 
   "Rev. HellH0und", 
   "At best this means you better hand in your glock! Notice the words 'as allowed by law' hardly shows a long standing principle of a natural right - unless you argue that it's always been infringed upon... and why not? We can't have every loony carrying guns around, if we did, gun related homicides would sky-rocket. Ooops, that's what's happening in America isn't it!\n \n This interpretation of a 'natural right' suggests you don't need a gun for your own safety, as you seem to believe.\n \n So, the state has always legislated and defined this right. That's what states are for - a referee or umpire to settle disputes in law. Further for the good of the people, the people have handed power over to the state. You might want to read Hobbes on this.\n\n \n \n I cut out most of your garbage... 1st I do not own a glock... but whatever... MOLON LABE! And homicides are NOT skyrocketing unlike your countries RAPE rates. Rapists are cowards who prefer unarmed victims and your gun confiscation program is opening the door to rapists and other violent criminals who SUPRISE are not following the law!. If you disagree with this assesment you are free to do the research as I am not being paid to educate you. \n \n \n You reference british law. Which is a start in the right direction... However the Americans took that sort of thing and went one step further and said that people are free and the 'GOVERNMENT ONLY GOVERNS AT THE CONSENT OF THE GOVERNED' now this sounds like support for democracy... It is but it isnt... Remember that liberty is a 'well armed lamb contesting the vote' between 2 wolves and a lamb? Freemen are free and if for some reason the majority outlaws shirts in the winter in Montana then I would bet most would ignore it EVEN IF THE MAJORITY SUPPORTED it. That is the beuty of this 'more perfect union'", 
   {}, 
   18300, 
   null, 
   1065452760.0
  ], 
  [
   18411, 
   null, 
   "kelvin90701", 
   "\n \n The government has rights too! It can even take you to court\n\n \n Maybe your government does. \n \n Our government has none. It has only authority.", 
   {}, 
   18040, 
   null, 
   1065496620.0
  ], 
  [
   18412, 
   null, 
   "kelvin90701", 
   "We can't have every loony carrying guns around, if we did, gun related homicides would sky-rocket. Ooops, that's what's happening in America isn't it!\n \n .\n\n \n Who do you define as looney? \n \n I train every week. I put an excess of 3000 rounds down range every year with a handgun alone. Most street cops will only put less than 10% of than down range in a year just to qualify. On a police qualification, I score in the top 10%. By what rationale do you use to take my guns away or call me looney?\n \n I know what you mean by looney. You mean eveyone.", 
   {}, 
   18300, 
   null, 
   1065497100.0
  ], 
  [
   18413, 
   null, 
   "kelvin90701", 
   "\n \n Natural rights don't exist at all. .\n\n \n Can I use that in my signature?\n \n \" I have a \"right\" to kill you if you get in my way, but you have an equal \"right\" to kill me. If I am stronger and I succeed\" - Jonathan Wallace\n \n I do not live by that rule, so do millions of other decent gun owners.\n \n But felons on parole do.", 
   {}, 
   18300, 
   null, 
   1065498000.0
  ], 
  [
   18461, 
   null, 
   "Rev. HellH0und", 
   "Kelvin,\n \n Its:\n \n \n \"They that can give up essential liberty to obtain a little temporary safety deserve neither liberty nor safety.\" -BF", 
   {}, 
   18413, 
   null, 
   1065537600.0
  ], 
  [
   18540, 
   null, 
   "afrsmile", 
   "Well i don't have to worry that much about gun crime as it does't happen that much in the U.K as there are strict rules that means you have to have a gun lisence that is very hard to get hold of and you can't use a gun in self defense. one case in england a farmer shoot a burgular in the leg and was sent to prison. also a guy got shoot when a toy gun was mistaken for a real gun, so the police force r a bit too efficiant", 
   {}, 
   18461, 
   null, 
   1065560820.0
  ], 
  [
   18544, 
   null, 
   "Rev. HellH0und", 
   "Well i don't have to worry that much about gun crime as it does't happen that much in the U.K as there are strict rules that means you have to have a gun lisence that is very hard to get hold of and you can't use a gun in self defense. one case in england a farmer shoot a burgular in the leg and was sent to prison. also a guy got shoot when a toy gun was mistaken for a real gun, so the police force r a bit too efficiant\n\n \n \n yes see the topic on that subject... in UK the canary is dead.... \"burguler rights\", sending a man to prison for protecting his family is tyrannical. you live in scary times dood!\n \n see my view on this at Vision of the Anti-Constitutionalists future! \n \n \n Do you really feel safe?", 
   {}, 
   18540, 
   null, 
   1065561420.0
  ], 
  [
   18590, 
   null, 
   "DHard3006", 
   "What have you done to that felon that he's after you?\n \n I'm not in favour of gun legislation, but unless you're being chased by cops or someone else with a gun on a regular basis, it seems a little paranoid to be carrying one around.\n \n Sidebar- Charlton Heston is racist XXXXX, and he has no tact going places where kids have just been killed to have pro-gun rallies.\n\n \n Is it being paranoid when you purchase home insurance? \n \n Is it being paranoid when you purchase car insurance?\n \n Is it being paranoid when you purchase when you purchase life insurance?\n \n I am pretty sure most of the people have at least one of these insurance plans. Are these people being paranoid? \n \n It is interesting how gun haters consider a person defending themself by exercising the right to bear arms paranoid, while people buying insurance are not considered paranoid.\n \n As for your attack on Heston and the NRA. That event was planned a year in advance! Hey gun hater do they cancel car shows when there is a crime committed with a car killing people in the area as the event? Just curious if gun haters apply their logic to the events they like.\n \n And once again people take notice of this gun hater, like others gun haters this one cannot make a remark about a person that defends the right to bear arms without using insulting words. It appears all gun haters have this characteristic!", 
   {}, 
   17962, 
   null, 
   1065578100.0
  ], 
  [
   18617, 
   null, 
   "munkyman", 
   "I dont walk at night, and I am friends with neighbors that watch out for me.", 
   {
    "post_info": {
     "post_title": "well..."
    }
   }, 
   17851, 
   null, 
   1065586020.0
  ], 
  [
   18639, 
   null, 
   "mizmaxx", 
   "And once again people take notice of this gun hater, like others gun haters this one cannot make a remark about a person that defends the right to bear arms without using insulting words.\n\n \n This is funny. You didn't read my post at all, did you? I clearly stated that I am not in favour of gun control laws. I am never in favour of increased state power, expecially in terms of fire power or police power.\n \n Just because I think some people's reasons for not wanting gun control, as well as their methods for getting their point across, are stupid and racist, doesn't mean I am a \"gun hater\".\n \n Some of my biggest heroes argue/d for armed citizenry. Malcolm X, the Black Panthers, the Zapatistas, I could go on.\n \n Gun control was never intended for white people. Originally it was only applied to people of colour, in particular people of African descent, as court documents and precedant show.\n \n That doesn't make Heston less of a bigoted idiot, not does it make the NRA a good organization. Sorry, nice try, but you can't silence dissent by lumping dissenters into your handy \"them\" category.", 
   {}, 
   18617, 
   null, 
   1065592980.0
  ], 
  [
   18643, 
   null, 
   "kelvin90701", 
   "I dont walk at night, and I am friends with neighbors that watch out for me.\n\n \n Please explain: \"I dont walk at night\"?\n \n Does that mean you never out at night? I really feel sorry for you if you do? There is the opera, theatre, dances, concerts, and so much more away from home at night. Seems a shame to be denied that by people who are criminals.\n \n Or\n \n You go out at night, but don't realize:\n \n 1) walking out between buildings your a target\n 2) walking between the parked cars you can be ambushed\n 3) stopping at a red light your a parked target (which has happened to me)\n \n I am sorry to say, but your friends are USELESS. If your life is in danger, ask yourself, are they really that close to you that they will trade thier life to save yours? Do your neighbors have children? Will that father risk his life so his children will grow up without a father?", 
   {}, 
   18617, 
   null, 
   1065594300.0
  ], 
  [
   18644, 
   null, 
   "kelvin90701", 
   "The very first and must supreme rule for fist responders arriving at a dangerous situation is: \"Never enter a dangerous area so you become a victim yourself.\" How does your neighbor stop a felon just out of prison? Without becomming a victim too?\n \n Personally I will never come to the aid of my neighbors under attack. Unless you know the whole situtation you can not tell who is good and who is bad. For all you know that stranger is the one being attacked by your neighbor. It has happened. Neighbors have come to aid of neighbors only to realize they were really helping the bad guys. Until you really know your neighbors like intimate family, or were witness to the attack from the very beginning, you can not tell the good guys from the bad. That is why I will never help my neighbors under attack. I will call the cops and let them sort it out.", 
   {}, 
   18643, 
   null, 
   1065594780.0
  ], 
  [
   18658, 
   null, 
   "montalban", 
   "yes see the topic on that subject... in UK the canary is dead.... \"burguler rights\", sending a man to prison for protecting his family is tyrannical. you live in scary times dood!\n \n see my view on this at Vision of the Anti-Constitutionalists future! \n \n \n Do you really feel safe?\n\n \n You link your own argument as evidence? Bah hah hah!\n \n Seriously, we've already touched on this before. Kelvin once made some obtuse statments about Australia and then you had a rant about not comparing other nations values to America, or some such rubbish.\n \n Quite frankly other nations get by pefectly well without the need to arm right wing nut cases.\n \n But anyway, why not actually deal with an issue for once....\n \n Why are you so against a non-American giving a critique of America, when at the same instance you feel\n a) free to critique other nations\n b) actually hate your own government - at best you fear them.\n \n What sort of society do you have where you actually need to be armed to defend your rights - do you have the worse politicians in the world?\n \n Britain, New Zealand, Australia must have good politicians, because they're not out stealing out natural rights* even though we don't have guns\n \n In effect you're arguing a case based on defending something that's not even defined, against a government that is trying to steal these undefined rights - but at the same time you also won't let anyone else (non-Americans) criticise this same government.\n \n \n \n \n *natural rights which you've never actually attempted to set out what they are.\n \n \n \n \n \n It would be good to actually develope an argument, instead of repeating a mantra.", 
   {}, 
   18544, 
   null, 
   1065614160.0
  ], 
  [
   18659, 
   null, 
   "montalban", 
   "Is it being paranoid when you purchase home insurance? \n \n Is it being paranoid when you purchase car insurance?\n \n Is it being paranoid when you purchase when you purchase life insurance?\n \n I am pretty sure most of the people have at least one of these insurance plans. Are these people being paranoid? \n \n It is interesting how gun haters consider a person defending themself by exercising the right to bear arms paranoid, while people buying insurance are not considered paranoid.\n\n \n Your 'right' to carry a gun is NOT for your own personal protection from felons!\n \n Your courts and your founders have continually argued that you need to be armed to defend your country!\n \n Hence 'militia'.\n \n Even though this argument itself displays a patent paranoia on behalf of US citizens - who are terribly afraid of their own government.\n \n Name calling of Mizmaxx actually demonstrates that you don't have an argument.\n \n By the way, if you need a gun to feel secure, then wouldn't you feel more secure with grenades and chemical weapons - these are probably even more effective. What about land mines around your house. Now surely that would deter burglars!\n \n \n By the way, I'm going to be pedantic here... you can't buy life insurance. You can only buy life assurance. Anyone who calls it 'life insurance' doesn't know proper English usage because death is assured!", 
   {}, 
   18590, 
   null, 
   1065614580.0
  ], 
  [
   18664, 
   null, 
   "Rev. HellH0und", 
   "I dont walk at night, and I am friends with neighbors that watch out for me.\n\n \n \n Is this Happy from the anehiem board?!?!?", 
   {}, 
   18617, 
   null, 
   1065622500.0
  ], 
  [
   18676, 
   null, 
   "DHard3006", 
   "Your 'right' to carry a gun is NOT for your own personal protection from felons!\n \n Your courts and your founders have continually argued that you need to be armed to defend your country!\n \n Hence 'militia'.\n \n Even though this argument itself displays a patent paranoia on behalf of US citizens - who are terribly afraid of their own government.\n \n Name calling of Mizmaxx actually demonstrates that you don't have an argument.\n \n By the way, if you need a gun to feel secure, then wouldn't you feel more secure with grenades and chemical weapons - these are probably even more effective. What about land mines around your house. Now surely that would deter burglars!\n \n \n By the way, I'm going to be pedantic here... you can't buy life insurance. You can only buy life assurance. Anyone who calls it 'life insurance' doesn't know proper English usage because death is assured!\n\n \n \n There is no requirement in the 2nd amend to be in a militia to bear arms! If you can find one in the 27 words in the 2nd amend please show us. Do not read into the 2nd amend what you want it to say. Just read the 27 words of the 2nd amend and show us where it defends what you claim.\n \n Now of course the gun haters will chant the well regulated militia part of the 2nd amend. Ok it does say that. So if the gun haters are going to use this chant please show us the regulation, law or edit defending the gun haters claim! \n \n By the way gun haters if you are going to use the militia part of the 2nd amend to defend your claim. Gun haters may want to stop and think about this for a minute or two. Why do I say this? Simple if gun haters want people defending the right to bear arms to be in militias, why would you want the militias to have lesser weapons then the enemies they are defending against? \n \n Once again we get the gun hater use of the word \"paranoia\". \n The gun haters are the people demanding that all people be treated as criminals to make America safe. This is paranoia! \n \n Gun haters civilization can be compared to a prison where all movement will be monitored through check points to try and prevent a crime. Once again this is paranoia!\n \n Oh and here is the definition of life insurance:\n Main Entry: life insurance\n Function: noun\n Date: 1809\n : insurance providing for payment of a stipulated sum to a designated beneficiary upon death of the insured \n \n Once again we see an attempt to vilify any person defending their rights! Typical hate group member tactics!", 
   {
    "unicode_changes_made": true
   }, 
   18659, 
   null, 
   1065633540.0
  ], 
  [
   18693, 
   null, 
   "afrsmile", 
   "Rev. HellH0und, you asked me if i felt safe well i do, i live in a small village community where everyone looks out for one another. if theres any one acting strange we take down details and call the police.\n \n i don't really like guns that much and i beleive that fact about your more likely to shoot someone else other then a burgular cos my friends mum was cleaning one of thier guns they use for hunting and accidently shoot her self in the head cos she didn't know it was loaded.", 
   {}, 
   18676, 
   null, 
   1065644340.0
  ], 
  [
   18697, 
   null, 
   "Rev. HellH0und", 
   "Rev. HellH0und, you asked me if i felt safe well i do, i live in a small village community where everyone looks out for one another. if theres any one acting strange we take down details and call the police.\n \n i don't really like guns that much and i beleive that fact about your more likely to shoot someone else other then a burgular cos my friends mum was cleaning one of thier guns they use for hunting and accidently shoot her self in the head cos she didn't know it was loaded.\n\n \n \n Which is statistically inaccurate. Gun Owners of America Has a fact sheet that is well backed up that will demonstrate you are wrong.\n \n \n As for your \"mums\" friend. I will be honest with you. I do not believe you. But for arguments sake why would the idiotic behavior of one individual doom the rest of mankind to tyranny? Rule #1 Treat all guns as loaded. \n \n \n So you agree that Tony Martin should be in prison while his burgular is set free?", 
   {}, 
   18693, 
   null, 
   1065648540.0
  ], 
  [
   18698, 
   null, 
   "afrsmile", 
   "hmm believe what you like i didn't believe at first, so i said stop joking around and my friend burst in to tears. i have never felt so guilty in my life. and i can't be asked to read Gun Owners of America, you told me that it would prove that i'm wrong so i'll take your word for it. if it was anything else that i had a definite stand against or for i'd wouldn't though, so deem ur self lucky\n \n also i'm 14 though i go to a grammar school i still have no idea what tyranny means please tell me.", 
   {}, 
   18697, 
   null, 
   1065649380.0
  ], 
  [
   18728, 
   null, 
   "kelvin90701", 
   "Rev. HellH0und, you asked me if i felt safe well i do, i live in a small village community where everyone looks out for one another. if theres any one acting strange we take down details and call the police.\n \n i don't really like guns that much and i beleive that fact about your more likely to shoot someone else other then a burgular cos my friends mum was cleaning one of thier guns they use for hunting and accidently shoot her self in the head cos she didn't know it was loaded.\n\n \n First off I am really horrified and sad by your tragedy. Witness first hand what a firearm can do to a large animal, I could not imagine doing the same to a human being.\n \n You are right that firearms are extremely dangerous to the owners and owners families, but that decision to keep firearms for protection is a very personal decision.\n \n I have weighed the odds to myself and my family. The risk without them is greater than the risk with them. When men are really free, then they decide their own destiny for good or bad, because it is the free man that will live with the consquences.", 
   {}, 
   18693, 
   null, 
   1065669360.0
  ], 
  [
   18729, 
   null, 
   "kelvin90701", 
   "\n \n also i'm 14 though i go to a grammar school i still have no idea what tyranny means please tell me.\n\n \n Please seach the internet for \"taliban\". Life under the taliban is textbook tyranny carried to an extreme.", 
   {}, 
   18698, 
   null, 
   1065669540.0
  ], 
  [
   18756, 
   null, 
   "voiceofreason", 
   "In general, I don't think I'd be safer if I owned a gun. Just the opposite.\n \n \"After controlling for these characteristics, we found that keeping a gun in the home was strongly and independently associated with an increased risk of homicide (adjusted odds ratio, 2.7; 95 percent confidence interval, 1.6 to 4.4). Virtually all of this risk involved homicide by a family member or intimate acquaintance.... Rather than confer protection, guns kept in the home are associated with an increase in the risk of homicide by a family member or intimate acquaintance.\"\n http://content.nejm.org/cgi/content/short/329/15/1084", 
   {}, 
   18693, 
   null, 
   1065684540.0
  ], 
  [
   18758, 
   null, 
   "kelvin90701", 
   "Why hold the gun for 3 days when:\n \n 1) The check is instant.\n 2) If I pass, then everyone knows I am harmless.\n \n You have nothing to fear from harmless people. If you do and that is how you justify it, then your fear is irrational.", 
   {}, 
   18756, 
   null, 
   1065687540.0
  ], 
  [
   18762, 
   null, 
   "Rev. HellH0und", 
   "In general, I don't think I'd be safer if I owned a gun. Just the opposite.\n \n \"After controlling for these characteristics, we found that keeping a gun in the home was strongly and independently associated with an increased risk of homicide (adjusted odds ratio, 2.7; 95 percent confidence interval, 1.6 to 4.4). Virtually all of this risk involved homicide by a family member or intimate acquaintance.... Rather than confer protection, guns kept in the home are associated with an increase in the risk of homicide by a family member or intimate acquaintance.\"\n http://content.nejm.org/cgi/content/short/329/15/1084\n\n \n \n \n Once Again your Propaganda is wrong.. At least your honest enough to admit your lack of self control and/or dexterity that you feel you are not capable of safley handling a firearm.\n \n \n GOA Fact Sheet\n \n A. Myth #1: If one has a gun in the home, one is three times more likely to be killed than if there is no gun present. \n \n 1. Dr. Edgar Suter has pointed out that studies which make such claims are flawed because they fail to consider the number of lives saved by guns. That is, such claims ignore the vast number of non-lethal defensive uses with firearms.128 \n \n \n 2. Criminologists have found that citizens use firearms as often as 2.5 million times every year in self-defense. In over 90% of these defensive uses, citizens merely brandish their gun or fire a warning shot to scare off the attacker.129 \n \n \n \n * Guns used 2.5 million times a year in self-defense. Law-abiding citizens use guns to defend themselves against criminals as many as 2.5 million times every year -- or about 6,850 times a day.1 This means that each year, firearms are used more than 60 times more often to protect the lives of honest citizens than to take lives.2 \n \n * Anti-gun Clinton researchers find an annual total of 1.5 million self-defense cases. According to the Clinton Justice Department, there are as many as 1.5 million cases of self-defense every year. The National Institute of Justice published this figure in 1997 as part of \"Guns in America\" -- a study which was authored by noted anti-gun criminologists Philip Cook and Jens Ludwig.3 \n \n * Concealed carry laws have dropped murder and crime rates in the states that have enacted them. According to a comprehensive study which studied crime statistics in all of the counties in the United States from 1977 to 1992, states which passed concealed carry laws reduced their murder rate by 8.5%, rapes by 5%, aggravated assaults by 7% and robbery by 3%.4 \n \n * Anti-gun journal pronounces the failure of the Brady law. One of the nation's leading anti-gun medical publications, the Journal of the American Medical Association, found that the Brady registration law has failed to reduce murder rates. In August 2000, JAMA reported that states implementing waiting periods and background checks did \"not [experience] reductions in homicide rates or overall suicide rates.\"5 \n \n * More children are killed playing football in school than they are by guns. That's right. Despite what media coverage might seem to indicate, more children die playing high school football, than they do by firearms at school. The most recent year on record shows that 18 football players died during the school year ending in June, 2000 (from hits to the head, heat stroke, etc.), as compared with 9 students by firearms.6", 
   {}, 
   18756, 
   null, 
   1065707580.0
  ], 
  [
   18763, 
   null, 
   "Rev. HellH0und", 
   "In general, I don't think I'd be safer if I owned a gun. Just the opposite.\n \n \"After controlling for these characteristics, we found that keeping a gun in the home was strongly and independently associated with an increased risk of homicide (adjusted odds ratio, 2.7; 95 percent confidence interval, 1.6 to 4.4). Virtually all of this risk involved homicide by a family member or intimate acquaintance.... Rather than confer protection, guns kept in the home are associated with an increase in the risk of homicide by a family member or intimate acquaintance.\"\n http://content.nejm.org/cgi/content/short/329/15/1084\n\n \n \n \n From propagandist article:\n \n \"Conclusions The use of illicit drugs and a history of physical fights in the home are important risk factors for homicide in the home. Rather than confer protection, guns kept in the home are associated with an increase in the risk of homicide by a family member or intimate acquaintance. \"\n \n \n \n Either these XXXXXX look down thier noses at the \"commoner\" and think its a world of wife beating heroin users or You are applying a study OF wife beating heroin users to the people as a whole.\n \n \n I would agree though that in a home of wife beating HEROIN USERSs a gun COULD more likley be used to commit a homicide. However this study skips a lot of facts... The Lautenberg law: restraining order or a domestic violence charge your weapons are siezed whether you are guilty or innocent. These wife beating heroin users would probably have a history of this and therefore would not be able to have a gun. Most gun owners, MOST PEOPLE are not WIFE BEATING HEROIN USERS!\n \n \n \"Also, case households more commonly contained an illicit-drug user, a person with prior arrests, or someone who had been hit or hurt in a fight in the home. After controlling for these characteristics, we found that keeping a gun in the home was strongly and independently associated with an increased risk of homicide (adjusted odds ratio, 2.7; 95 percent confidence interval, 1.6 to 4.4). Virtually all of this risk involved homicide by a family member or intimate acquaintance. \"\n \n \n \n With the double speak! They \"controlled for illicit-drug user, a person with prior arrests, or someone who had been hit or hurt in a fight in the home.\" then in the VERY SAME SENTENCE THEY CLAIM \"keeping a gun in the home was strongly and independently associated with an increased risk of homicide\"\n \n \n WHAT NONSENSE!", 
   {}, 
   18756, 
   null, 
   1065708120.0
  ], 
  [
   18764, 
   null, 
   "Rev. HellH0und", 
   "hmm believe what you like i didn't believe at first, so i said stop joking around and my friend burst in to tears. i have never felt so guilty in my life. and i can't be asked to read Gun Owners of America, you told me that it would prove that i'm wrong so i'll take your word for it. if it was anything else that i had a definite stand against or for i'd wouldn't though, so deem ur self lucky\n \n also i'm 14 though i go to a grammar school i still have no idea what tyranny means please tell me.\n\n \n \n Yes you can be asked. You should find out the truth. The very fact that you are here means you are searching for answers. My advice, Don't find things that support your views read everything with an open mind... Otherwise you are sheep.", 
   {}, 
   18698, 
   null, 
   1065708240.0
  ], 
  [
   18767, 
   null, 
   "voiceofreason", 
   "\n GOA Fact Sheet\n \n A. Myth #1: If one has a gun in the home, one is three times more likely to be killed than if there is no gun present. \n \n 1. Dr. Edgar Suter has pointed out that studies which make such claims are flawed because they fail to consider the number of lives saved by guns. That is, such claims ignore the vast number of non-lethal defensive uses with firearms.128 \n\n They totally got their studies mixed up. The study that I cited is not concerned with lethal defensive uses of guns. That's another study that Kellerman did which compared the number of criminals shot in self defense to the number of other gun deaths in the home. \n \n \n\n 2. Criminologists have found that citizens use firearms as often as 2.5 million times every year in self-defense. In over 90% of these defensive uses, citizens merely brandish their gun or fire a warning shot to scare off the attacker.129\n \n The best study on defensive guns uses, which surveyed about 50,000 people, concluded that there are less than 100,000 defensive gun uses each year. http://www.ojp.usdoj.gov/bjs/pub/press/hvfsdaft.pr\n Kleck surveyed about 5,000 people to reach his 2.5 million figure.\n \n \n \n\n Concealed carry laws have dropped murder and crime rates in the states that have enacted them. According to a comprehensive study which studied crime statistics in all of the counties in the United States from 1977 to 1992, states which passed concealed carry laws reduced their murder rate by 8.5%, rapes by 5%, aggravated assaults by 7% and robbery by 3%.4\n \n How do you know that the drop in crime was because of concealed carry laws? Areas that don't allow people to carry concealed weapons also have experienced drops in crime. Consider Washington DC for example.\n In 1995 there were 12,173.5 crimes per 100,000 in DC\n (page 65) http://www.fbi.gov/ucr/Cius_97/95CRIME/95crime2.pdf\n In 2001 there were 7,709.6 crimes per 100,000 in DC \n (page 77) http://www.fbi.gov/ucr/cius_01/01crime2.pdf\n That's a 36% drop in crime. \n \n Do you believe everthing you read on that website without reservation? I could easily go to the VPC or the Brady website and post tons of statistics here, but I don't think people would find that very convincing.", 
   {}, 
   18762, 
   null, 
   1065716700.0
  ], 
  [
   18768, 
   null, 
   "voiceofreason", 
   "From propagandist article:\n \n \"Conclusions The use of illicit drugs and a history of physical fights in the home are important risk factors for homicide in the home. Rather than confer protection, guns kept in the home are associated with an increase in the risk of homicide by a family member or intimate acquaintance. \"\n \n \n \n Either these XXXXXX look down thier noses at the \"commoner\" and think its a world of wife beating heroin users or You are applying a study OF wife beating heroin users to the people as a whole.\n\n The article makes it very clear that \"Also, case households more commonly contained an illicit-drug user, a person with prior arrests, or someone who had been hit or hurt in a fight in the home. After controlling for these characteristics, we found that keeping a gun in the home was strongly and independently associated with an increased risk of homicide\"\n This means that in households that do not have a history of physical violence, that do not have people with prior arrests nor drug users a gun is still associated with a higher risk of homicide. These characteristics were controlled for as the article clearly states.\n \n \n \n\n With the double speak! They \"controlled for illicit-drug user, a person with prior arrests, or someone who had been hit or hurt in a fight in the home.\" then in the VERY SAME SENTENCE THEY CLAIM \"keeping a gun in the home was strongly and independently associated with an increased risk of homicide\"\n WHAT NONSENSE!\n\n It's not at all double speak. These variables were controlled for to determine whether there was an independent relationship between gun ownership and a higher risk of homicide. When you control for a certain variable that means you determine whether the relationship would still exist in the absence of that variable.", 
   {}, 
   18763, 
   null, 
   1065718080.0
  ], 
  [
   18776, 
   null, 
   "DHard3006", 
   "They totally got their studies mixed up. The study that I cited is not concerned with lethal defensive uses of guns. That's another study that Kellerman did which compared the number of criminals shot in self defense to the number of other gun deaths in the home. \n \n \n The best study on defensive guns uses, which surveyed about 50,000 people, concluded that there are less than 100,000 defensive gun uses each year. http://www.ojp.usdoj.gov/bjs/pub/press/hvfsdaft.pr\n Kleck surveyed about 5,000 people to reach his 2.5 million figure.\n \n \n \n How do you know that the drop in crime was because of concealed carry laws? Areas that don't allow people to carry concealed weapons also have experienced drops in crime. Consider Washington DC for example.\n In 1995 there were 12,173.5 crimes per 100,000 in DC\n (page 65) http://www.fbi.gov/ucr/Cius_97/95CRIME/95crime2.pdf\n In 2001 there were 7,709.6 crimes per 100,000 in DC \n (page 77) http://www.fbi.gov/ucr/cius_01/01crime2.pdf\n That's a 36% drop in crime. \n \n Do you believe everthing you read on that website without reservation? I could easily go to the VPC or the Brady website and post tons of statistics here, but I don't think people would find that very convincing.\n\n \n \n Gun haters try to use this lie to justify a ban on the right to bear arms! Why is it gun haters never say if you own a car, swimming pool, bike, boat, baseball bat, hammer, kitchen knives, screw drivers, or hand tools your chances of injury or death from these items go up! If you own anything the chances of injury from it raises. This logic is a little to hard for gun haters to comprehend!\n \n Now the gun haters that do not believe the 2.5 million lives a year saved by guns. So the gun haters claim it is only 100,000 lives saved by guns. This is still more then 3 time the number killed by guns!. Whenever it is in favor of the right to bear arms the gun haters will not say if it saves just one life is it not worth it. However the gun haters will chant if banning a right saves one life is it not worth it.", 
   {}, 
   18767, 
   null, 
   1065725580.0
  ], 
  [
   18782, 
   null, 
   "afrsmile", 
   "Yes you can be asked. You should find out the truth. The very fact that you are here means you are searching for answers. My advice, Don't find things that support your views read everything with an open mind... Otherwise you are sheep\n \n sorry i was tried but i'll look at it now and i'm am tring to be open minded as i don't really agree with guns being used as self defence but i don't truely disagree. and you link does work. give me a chance at least give me the right link.\n i don't mind air rifles emoticon_xgood", 
   {}, 
   18776, 
   null, 
   1065726900.0
  ], 
  [
   18846, 
   null, 
   "kelvin90701", 
   "\"To the small number of people who still believe that laws will somehow erode their personal freedom, I want to assure you that that is not the intention nor will it be the result. We all have a responsibility to save lives and to make this nation a safer place for our children and grandchildren. Let's all work together to reduce the violence. And to those who resent a waiting period, I ask you: Isn't sacrificing three days worth saving the lives of your fellow men and women?\"\n -Sarah Brady.\n\n \n Why hold the gun for 3 days when:\n \n 1) The background check is instant.\n 2) Once I pass, the cops know I'm harmless, the vendor knows I'm harmless, Saray Brady knows I'm harless.\n \n Do you some how suspect that within the 3 days a law abiding citizen will go on a rabid crime spree if he/she gets the gun right away?", 
   {}, 
   18768, 
   null, 
   1065759720.0
  ], 
  [
   18866, 
   null, 
   "DHard3006", 
   "[QUOTE=voiceofreason] The best study on defensive guns uses, which surveyed about 50,000 people, concluded that there are less than 100,000 defensive gun uses each year. http://www.ojp.usdoj.gov/bjs/pub/press/hvfsdaft.pr\n Kleck surveyed about 5,000 people to reach his 2.5 million figure.QUOTE]\n \n People defending the right to bear arms claim guns saves 2.5 million lives a year. The gun haters not wanting to believe this study claim guns only save 100,000 lives a year. \n \n Now this is more then 3 times as many lives saved by guns then killed by guns. \n \n The gun haters have a saying \"if it saves just one life isn't it worth it?\" So even using the gun haters statistics if guns save far more lives then they take, why are they not worth having?\n \n By the way gun haters the 2.5 million lives a year saved by guns does not include lives saved by our many police forces and armed services having guns! So if you factor in this how many lives are saved by guns?\n \n Gun haters are blinded by a hatred for a right and will do anything to ban it!", 
   {
    "unicode_changes_made": true
   }, 
   18767, 
   null, 
   1065773880.0
  ], 
  [
   18880, 
   null, 
   "montalban", 
   "There is no requirement in the 2nd amend to be in a militia to bear arms! If you can find one in the 27 words in the 2nd amend please show us. Do not read into the 2nd amend what you want it to say. Just read the 27 words of the 2nd amend and show us where it defends what you claim.\n \n\n \n Obviously you didn't read through earlier posts... because America's legal framework has the power to interpret acts, and the legal profession obviously has consistantly disagreed with you.\n \n But for your benefit I give you again...\n \n How have Americans viewed this right and law?\n Houston v. Moore 1820\n \"[The immediate issue in this case was federal and state jurisdiction to try non-compliance with militia orders. The context provides much enlightenment on the militia institution. Militia duty was conscript duty. Militiamen were governed by the rules and articles of war. The Militia Acts were the precursors of the selective service acts of the twentieth century. There was NO mention of a \"personal right\" to be armed outside of lawful authority. Houston v. Moore is provided here for further enlightenment to interested parties as Appendix W to US v. Emerson. It was not included in the appendices provided to the Fifth Circuit.] \"\n http://www.potowmack.org/houst1.html\n Martin v. Mott, 1827\n \"[The issue in this case was federal and state authority and jurisdiction over the militia. As in Houston v. Moore, the context provides much enlightenment on the militia institution. Militia duty was conscript duty. Militiamen were governed by the rules and articles of war. The Militia Acts were the precursors of the selective service acts of the twentieth century. There was NO mention of a \"personal right\" to be armed outside of lawful authority. Martin v. Mott and Houston v. Moore are provided for further enlightenment to interested parties as Appendices to US v. Emerson. These were not included in the appendices provided to the Fifth Circuit.] \"\n http://www.potowmack.org/martmott.htm\n AYMETTE v. THE STATE (1840)\n \"When, therefore, (the British) Parliament says that \"subjects which are Protestants may have arms for their defence, suitable to their condition, as allowed by law,\" it does not mean for private defence, but, being armed, they may as a body rise up to defend their just rights, and compel their rulers to respect the laws. This declaration of right is made in reference to the fact before complained of, that the people had been disarmed, and soldiers had been quartered among them contrary to law. The complaint was against the government. The grievances to which they were thus forced to submit were for the most part of a public character, and could have been redressed only by the people rising up for their common defence, to vindicate their rights.\"\n The section under consideration, in our bill of rights, was adopted in reference to these historical facts, and in this point\n of view its language is most appropriate and expressive. Its words are, \"the free white men of this state have a right to keep and\n bear arms for their common defence.\"\n and\n \"hey need not, for such a purpose, the use of those weapons which are usually employed in private broils, and which are efficient only in the hands of the robber and the assassin. These weapons would be useless in war. \"\n http://www-2.cs.cmu.edu/afs/cs.cmu....tte_v_state.txt\n At best this means you better hand in your glock! Notice the words 'as allowed by law' hardly shows a long standing principle of a natural right - unless you argue that it's always been infringed upon... and why not? We can't have every loony carrying guns around, if we did, gun related homicides would sky-rocket. Ooops, that's what's happening in America isn't it!\n \n Sorry if you're out on a limb on this one!", 
   {}, 
   18676, 
   null, 
   1065779340.0
  ], 
  [
   18881, 
   null, 
   "montalban", 
   "\n Oh and here is the definition of life insurance:\n Main Entry: life insurance\n Function: noun\n Date: 1809\n : insurance providing for payment of a stipulated sum to a designated beneficiary upon death of the insured \n \n Once again we see an attempt to vilify any person defending their rights! Typical hate group member tactics!\n\n \n We are divided by a common language\n \n life insurance\n / / (say 'luyf inshawruhns) noun insurance providing payment of a specific sum of money to a named beneficiary upon the death of the  assured , or to the assured or to a named beneficiary should the assured reach a specified age. [insurance] Also, life assurance. \n http://www.macquariedictionary.com.au:8008/anonymousFF997610499+2/-/macshowrecord/1/2\n \n You are correct in your interpretation. So am I... because death is an assured thing... that is, it will happen. You can't bet (or insure) against it.\n \n \n However you talk about vilifying people, yet you constantly refer to people as 'gun-haters' In fact you do so in the same line as you use the word vilify. Perhaps a little bit of introspection is called for, hey?", 
   {}, 
   18676, 
   null, 
   1065779700.0
  ], 
  [
   18908, 
   null, 
   "DHard3006", 
   "We are divided by a common language\n \n life insurance\n / / (say 'luyf inshawruhns) noun insurance providing payment of a specific sum of money to a named beneficiary upon the death of the  assured , or to the assured or to a named beneficiary should the assured reach a specified age. [insurance] Also, life assurance. \n http://www.macquariedictionary.com.au:8008/anonymousFF997610499+2/-/macshowrecord/1/2\n \n You are correct in your interpretation. So am I... because death is an assured thing... that is, it will happen. You can't bet (or insure) against it.\n \n \n However you talk about vilifying people, yet you constantly refer to people as 'gun-haters' In fact you do so in the same line as you use the word vilify. Perhaps a little bit of introspection is called for, hey?\n\n \n \n A gun hater is a person that wants to limit or ban the right to bear arms. Now if you want gun control laws that limit or ban the right to bear arms you are a gun haters.\n \n Now gun hater what about your claim about militias? Can you find any law, edit, or regulation to defend you claim. As for you reference to the courts. If it was true the gun hater would have pushed to ban guns years ago! And remember gun hater if you use the militia line that would open up a lot of weapons militia members could now have. Why? Simple you would want your militias to have weapons as good if not better then their possible enemies!\n \n If you do not want to be labeled a gun hater then leave the right to bear arms allow.\n \n Kind of like if you do not want to be labeled a racist do push for racist laws. \n \n Kind of like if you do not want to be labeled sexist, do not push for sex discriminating laws.\n \n Oh and the reference to insurance was to ask the gun haters if a person is paranoid for buying it. You know kind of how gun haters always try to labeled people defending he right to bear arms! But nice try at attempting to take the topic off on another subject.", 
   {}, 
   18881, 
   null, 
   1065802440.0
  ], 
  [
   18909, 
   null, 
   "Rev. HellH0und", 
   "They totally got their studies mixed up. The study that I cited is not concerned with lethal defensive uses of guns. That's another study that Kellerman did which compared the number of criminals shot in self defense to the number of other gun deaths in the home. \n \n\n \n So you dismiss people who sucsessfully defended thier lives with a gun to mold your \"statistics\" into your agenda?\n \n \n\n The best study on defensive guns uses, which surveyed about 50,000 people, concluded that there are less than 100,000 defensive gun uses each year. http://www.ojp.usdoj.gov/bjs/pub/press/hvfsdaft.pr\n Kleck surveyed about 5,000 people to reach his 2.5 million figure.\n\n \n Actually you break this survey down you see that black males under the age of 19 are the biggest commiters of these crimes and I am willing to bet most of them live in very restrictive civil rights violating areas. Also where is the raw data? \n \n Further before you dismiss Kleck read the footnote:\n \n 1 Gary Kleck and Marc Gertz, \"Armed Resistance to Crime: The Prevalence and Nature of Self-Defense With a Gun,\" 86 The Journal of Criminal Law and Criminology, Northwestern University School of Law, 1 (Fall 1995):164. \n Dr. Kleck is a professor in the school of criminology and criminal justice at Florida State University in Tallahassee. He has researched extensively and published several essays on the gun control issue. His book, Point Blank: Guns and Violence in America, has become a widely cited source in the gun control debate. In fact, this book earned Dr. Kleck the prestigious American Society of Criminology Michael J. Hindelang award for 1993. This award is given for the book published in the past two to three years that makes the most outstanding contribution to criminology. \n Even those who don't like the conclusions Dr. Kleck reaches, cannot argue with his impeccable research and methodology. In \"A Tribute to a View I Have Opposed,\" Marvin E. Wolfgang writes that, \"What troubles me is the article by Gary Kleck and Marc Gertz. The reason I am troubled is that they have provided an almost clear-cut case of methodologically sound research in support of something I have theoretically opposed for years, namely, the use of a gun in defense against a criminal perpetrator.... I have to admit my admiration for the care and caution expressed in this article and this research. Can it be true that about two million instances occur each year in which a gun was used as a defensive measure against crime? It is hard to believe. Yet, it is hard to challenge the data collected. We do not have contrary evidence.\" Wolfgang, \"A Tribute to a View I Have Opposed,\" The Journal of Criminal Law and Criminology, at 188. \n \n \n \n \n How do you know that the drop in crime was because of concealed carry laws? Areas that don't allow people to carry concealed weapons also have experienced drops in crime. Consider Washington DC for example.\n In 1995 there were 12,173.5 crimes per 100,000 in DC\n (page 65) http://www.fbi.gov/ucr/Cius_97/95CRIME/95crime2.pdf\n In 2001 there were 7,709.6 crimes per 100,000 in DC \n (page 77) http://www.fbi.gov/ucr/cius_01/01crime2.pdf\n That's a 36% drop in crime. \n \n Do you believe everthing you read on that website without reservation? I could easily go to the VPC or the Brady website and post tons of statistics here, but I don't think people would find that very convincing.\n\n \n \n \n Hmm... lame attempt to marginalize me aside. Sept. 11th had a big impact on crime all over the nation as people became more reflective of the times. Further gun sales SKYROCKETED throuought the country. the 36% is proportionally average countrywide. D.C. still however is still proportionally higher than the nation average.... Also since we are noting charactaristics of each other may I ask Since D.C has a significant African American population can I assume that you feel that African Americans can not be trusted with guns?", 
   {}, 
   18767, 
   null, 
   1065802560.0
  ], 
  [
   18910, 
   null, 
   "Rev. HellH0und", 
   "The article makes it very clear that \"Also, case households more commonly contained an illicit-drug user, a person with prior arrests, or someone who had been hit or hurt in a fight in the home. After controlling for these characteristics, we found that keeping a gun in the home was strongly and independently associated with an increased risk of homicide\"\n This means that in households that do not have a history of physical violence, that do not have people with prior arrests nor drug users a gun is still associated with a higher risk of homicide. These characteristics were controlled for as the article clearly states.\n \n \n \n It's not at all double speak. These variables were controlled for to determine whether there was an independent relationship between gun ownership and a higher risk of homicide. When you control for a certain variable that means you determine whether the relationship would still exist in the absence of that variable.\n\n \n \n Then how the hell do they get to this conclusion: \"\"Conclusions The use of illicit drugs and a history of physical fights in the home are important risk factors for homicide in the home. Rather than confer protection, guns kept in the home are associated with an increase in the risk of homicide by a family member or intimate acquaintance. \"\n \n \n This is 2 unrelated statments that make absolutley no sense... Furthermore once they \"controlled for\" the illicit drug users and etc... HOw many were left? where are the numbers that YOU think so prominantly think important in dismissing a survey. \n \n \n WHat would be interesting would be to count up the total number of gun housholds and then add up the gun homicide rate in homes or \"intimate acquantence\". They could have done this very easily but it would have probably not given them the results they wanted.", 
   {}, 
   18768, 
   null, 
   1065802980.0
  ], 
  [
   18942, 
   null, 
   "montalban", 
   "A gun hater is a person that wants to limit or ban the right to bear arms. Now if you want gun control laws that limit or ban the right to bear arms you are a gun haters.\n \n Now gun hater what about your claim about militias? Can you find any law, edit, or regulation to defend you claim. As for you reference to the courts. If it was true the gun hater would have pushed to ban guns years ago! And remember gun hater if you use the militia line that would open up a lot of weapons militia members could now have. Why? Simple you would want your militias to have weapons as good if not better then their possible enemies!\n \n If you do not want to be labelled a gun hater then leave the right to bear arms allow.\n \n Kind of like if you do not want to be labelled a racist do push for racist laws. .\n\n \n I did ask you for a little introspection you evil red-necked fascist inbred hick. If you don't want to be labelled this, then don't go pushing reactionary red-necked inbred ideals!\n \n It's only fair. You say I'm not allowed to vilify you, but at the same time you say it's okay for you to call me 'gun-hater' and in fact you don't address anyone by name, you just call all of 'us' gun-haters. Therefore I'm now going to call you a evil red-necked fascist inbred hick.\n \n You have no insight if on the one hand you cry about vilification, and in the same breath do exactly what you criticise!\n \n SO, evil red-necked inbred fascist hick, I did present a case and just because it is observed in the breach doesn't mean that it is legal. The courts I quoted have consistently shown that they interpret Amendment 2 differently from you.\n \n If you do not want to be labelled an evil re-necked inbred fascist hick, then stop and think before you respond.", 
   {}, 
   18908, 
   null, 
   1065831960.0
  ], 
  [
   18948, 
   null, 
   "kelvin90701", 
   "In general, I don't think I'd be safer if I owned a gun. Just the opposite.\n \n \"After controlling for these characteristics, we found that keeping a gun in the home was strongly and independently associated with an increased risk of homicide (adjusted odds ratio, 2.7; 95 percent confidence interval, 1.6 to 4.4). Virtually all of this risk involved homicide by a family member or intimate acquaintance.... Rather than confer protection, guns kept in the home are associated with an increase in the risk of homicide by a family member or intimate acquaintance.\"\n http://content.nejm.org/cgi/content/short/329/15/1084\n\n \n That statistic is fine. It is a perfect justification to ORDER what people can and can not do in their own home. If that is what you want to do.\n \n I am quite away of the danger of firearms. I have decided for myself and for all those inside the walls of my home what is best for us. Thank you for your concern. Were still keeping our guns.", 
   {}, 
   18756, 
   null, 
   1065835500.0
  ], 
  [
   18966, 
   null, 
   "Tim", 
   "\n Then how the hell do they get to this conclusion: \"\"Conclusions The use of illicit drugs and a history of physical fights in the home are important risk factors for homicide in the home. Rather than confer protection, guns kept in the home are associated with an increase in the risk of homicide by a family member or intimate acquaintance. \"\n \n\n What's so hard to understand about this? They looked at gun ownership, drug use and a history of physical fights and found that each of these factors is associated with a higher homicide rate in the home. I don't understand any of your objections to this study. Anyway, why are you more than willing to believe any study that supports your agenda, but so eager to find fault with a study that proves you wrong? Question everything you read at www.gunowners.org", 
   {}, 
   18910, 
   null, 
   1065845940.0
  ], 
  [
   18968, 
   null, 
   "kelvin90701", 
   "What's so hard to understand about this? They looked at gun ownership, drug use and a history of physical fights and found that each of these factors is associated with a higher homicide rate in the home. I don't understand any of your objections to this study. Anyway, why are you more than willing to believe any study that supports your agenda, but so eager to find fault with a study that proves you wrong? Question everything you read at www.gunowners.org\n\n \n If you notice the study, it is about inside the HOME. It is great if YOU personally will use this information. It is great is everyone uses this information. Now what? I will use this information.\n \n Is this a justification to COMMAND people how to live? Are you using this as a reason to change and control people inside thier own home? Is this evidence that people must bend to your ideas and your studies and do it your way? Is this a justification to MAKE a decision for people weather they should have a firearm or not?\n \n Please explain what you intend to do with the above study? Please explain what is the next logical step for what people should do inside thier own home? \n \n Thanks for the information. I've have decided that I'll do my best to keep my family away from drugs and violence. I'll do my best to secure my firearms. Also it is in our best interest to keep our guns in our HOME, regardless of the study. Thank you for your concern. Firearm ownership in the HOME is a very personal choice. The government does not belong there.", 
   {}, 
   18966, 
   null, 
   1065846960.0
  ], 
  [
   18969, 
   null, 
   "Tim", 
   "[QUOTE=DHard3006]\n The best study on defensive guns uses, which surveyed about 50,000 people, concluded that there are less than 100,000 defensive gun uses each year. http://www.ojp.usdoj.gov/bjs/pub/press/hvfsdaft.pr\n Kleck surveyed about 5,000 people to reach his 2.5 million figure.QUOTE]\n \n People defending the right to bear arms claim guns saves 2.5 million lives a year. The gun haters not wanting to believe this study claim guns only save 100,000 lives a year. \n \n Now this is more then 3 times as many lives saved by guns then killed by guns. \n \n\n That study does not say that guns prevent 100,000 homicides each year. I read it and it says that guns prevent 62,000 violent crimes each year. What percent of violent crimes are homicides? 1%\n \n \"The FBI's Uniform Crime Reports indicated that 1 percent of\n serious violent crimes reported to police from 1993 to 1997 were\n homicides\"\n http://www.ojp.usdoj.gov/bjs/pub/press/fidc9397.pr\n \n 1% of 62,000 is 620. So 620 homicides are prevented by guns each year. 620 lives are saved by guns. Compare that to the tens of thousands of gun deaths each year.", 
   {}, 
   18866, 
   null, 
   1065847020.0
  ], 
  [
   18971, 
   null, 
   "Tim", 
   "Is this a justification to COMMAND people how to live? Are you using this as a reason to change and control people inside thier own home? Is this evidence that people must bend to your ideas and your studies and do it your way? Is this a justification to MAKE a decision for people weather they should have a firearm or not?\n \n Please explain what you intend to do with the above study? Please explain what is the next logical step for what people should do inside thier own home?\n\n People can use that study to make an informed decision about whether or not to keep guns in their homes. That's the logical next step.", 
   {}, 
   18968, 
   null, 
   1065847320.0
  ], 
  [
   18974, 
   null, 
   "mizmaxx", 
   "hey, afrsmile-\n \n tyranny n.,pl., 1. arbitrary or unrestrained exercise of power. 2. the government of a tyrant. 3. oppressive or unjust government. 4. tyrannical act\n \n tyrant n. 1. a ruler or other person in authority who exercises power oppressively or despotically. 2. an absolute ruler.\n \n I keep my dictionary near the computer because I find people often use obscure words in debates. I have found it very useful, especially as a lot of people don't even know the meanings of the words they are using... ;)", 
   {}, 
   18782, 
   null, 
   1065850080.0
  ], 
  [
   18984, 
   null, 
   "kelvin90701", 
   "People can use that study to make an informed decision about whether or not to keep guns in their homes. That's the logical next step.\n\n \n That is great! You see the difference between letting people decide for themselves and letting the government decide for you. \n \n While some people may view the lessening of controls on firearms as a step closer to anarchy and lawlessness, I do not. Laws are not required to keep law-abiding citizens lawful. Passing more laws that infringe on law-abiding citizens is ineffective and unethical. Such laws gain nothing. Criminals are by definition lawless. A sensible gun control law would directly target the lawless and not the affect the lawful.\n \n Sarah Brady asks, \"I ask you: Isn't sacrificing three days worth saving the lives of your fellow men and women?\" \n \n I reply, \"Yes it is, but the sacrifice your asking is saving no one.\"", 
   {
    "unicode_changes_made": true
   }, 
   18971, 
   null, 
   1065858300.0
  ], 
  [
   19182, 
   null, 
   "Johnnis", 
   "some treasonous bastards are raping it for thier own political power. previously stated by rev. hellbound\n \n They are not limiting our right to carry guns for their own political power. They do it for the sake of their patients and staff (in the hospital case). Why would you need to carry a gun to a hospital if you have no intent of using it.", 
   {}, 
   17979, 
   null, 
   1066071540.0
  ], 
  [
   19188, 
   null, 
   "DHard3006", 
   "some treasonous bastards are raping it for thier own political power. previously stated by rev. hellbound\n \n They are not limiting our right to carry guns for their own political power. They do it for the sake of their patients and staff (in the hospital case). Why would you need to carry a gun to a hospital if you have no intent of using it.\n\n \n Again we get the why do you need line. Why do you need insurance if you do not plan to use it?", 
   {}, 
   19182, 
   null, 
   1066084920.0
  ], 
  [
   20643, 
   null, 
   "Abraxas", 
   "some treasonous bastards are raping it for thier own political power. previously stated by rev. hellbound\n \n They are not limiting our right to carry guns for their own political power. They do it for the sake of their patients and staff (in the hospital case). Why would you need to carry a gun to a hospital if you have no intent of using it.\n\n Why do the police carry guns?", 
   {}, 
   19182, 
   null, 
   1067226060.0
  ], 
  [
   20644, 
   null, 
   "Abraxas", 
   "How do you defend yourself?\n\n I cast \"magic missile.\" :)", 
   {}, 
   18846, 
   null, 
   1067226180.0
  ], 
  [
   20645, 
   null, 
   "kelvin90701", 
   "Why do the police carry guns?\n\n \n The police carry guns because they are in situations were deadly force may be required to save thier own life.\n \n I carry a gun for the same reason. There are times I judge that it is necessary to be armed in public. There are times I judge that I can take the risk of not being armed. But the decision is mine and mine alone. I decide for myself what is good for me and what is acceptable for me. I do not ask the government to make that judgement for me.", 
   {}, 
   20643, 
   null, 
   1067227440.0
  ], 
  [
   20676, 
   null, 
   "Abraxas", 
   "The police carry guns because they are in situations were deadly force may be required to save thier own life.\n \n\n Right, but I was hoping Johnnis would answer the question.", 
   {}, 
   20645, 
   null, 
   1067261760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  For anti-gunners?  How do you defend yourself?", 
  "url": "http://www.4forums.com/political/gun-control-debates/1067-anti-gunners-how-do-you-defend-yourself.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1067, 
  "discussion_files": [
   [
    "26514.html", 
    "http://www.4forums.com/political/gun-control-debates/1067-anti-gunners-how-do-you-defend-yourself-print.html"
   ], 
   [
    "26515.html", 
    "http://www.4forums.com/political/gun-control-debates/1067-anti-gunners-how-do-you-defend-yourself-6-print.html"
   ], 
   [
    "26516.html", 
    "http://www.4forums.com/political/gun-control-debates/1067-anti-gunners-how-do-you-defend-yourself-4-print.html"
   ], 
   [
    "26517.html", 
    "http://www.4forums.com/political/gun-control-debates/1067-anti-gunners-how-do-you-defend-yourself-5-print.html"
   ], 
   [
    "26518.html", 
    "http://www.4forums.com/political/gun-control-debates/1067-anti-gunners-how-do-you-defend-yourself-3-print.html"
   ], 
   [
    "26519.html", 
    "http://www.4forums.com/political/gun-control-debates/1067-anti-gunners-how-do-you-defend-yourself-2-print.html"
   ]
  ], 
  "identifier": 1067
 }
]