[
 [
  [
   292495, 
   null, 
   "SukuWatalu", 
   ":) The website http://www.freerepublic.com/focus/f-news/1933870/posts carried a news report that \"China has dismissed Internet gossip that its first photo of the moon taken from a lunar orbiter might have been plagiarised from NASA\".\n \n Some web users had suggested the photo was strikingly similar to one taken in 2005 by NASA.\n \n Please see the Chinese moon image on http://www.halflifesource.com/news/2007/11/26/article10213.htm and also some moon images by NASA on the website http://photojournal.jpl.nasa.gov/target/Moon\n \n One web user even claimed that the Chinese communists \"got caught stealing photo images from NASA and are now in full denial mode\". Well, it seems that NASA can win some fast bucks from the Chinese space agency by sueing it for patent right infringement!\n \n The Chinese moon image was unveiled by Premier Wen Jiabao last week. Wen is considered one of China's \"Confucian gentlemen\" -- clean, upright, with high moral integrity and free of corruption. Hence, the accusation implies that Wen is a chief collaborator in cheating both the nation and the world with \"a fake photo\". This is not only an insult but also a slander on his personal reputation and integrity.\n \n The Chinese space agency can simply debunk the accusation by releasing more moon images. I hope more photos could be released to the public in the future.\n \n The latest insult by some Internet users on China's space success is a complete difference from the outcry in the West over the stunning news of China's successful destruction of a satellite in space. \n \n An article in the website http://www.spacewar.com/reports/China_Shows_Its_Power_With_Anti_Satellite_Test_999.html says that \"China's apparently successful destruction of a satellite in space shows its determination to be a global power and is set to leave lasting jitters in the United States and Asia\".\n \n In another website http://www.uscc.gov/researchpapers/2007/FINAL_REPORT_1-19-2007_REVISED_BY_MPP.pdf an article says that \"these skeptical observers dismissed that laser incident, but then appeared to be stunned by the reported Chinese destruction of a satellite January 11, 2007\".\n \n Nobody should belittle, discredit, cast doubt and hurl insults at China's ability in taking photos of the moon. After all, the successful shooting down of a satellite from the earth with a missile is certainly far more difficult and spectacular than the shooting of an apple by an arrow in the tale of William Tell or the taking of moon images -- literally the destruction of the satellite in space is a shot in the dark with pinpoint accuracy.\n \n Perhaps those web users have expected to find a sea of blue water on the moon; or when a Chinese journalist takes a photo of the U.S. president, some people would cry foul if it does not look like Mao Zedong's.\n \n China had been a backward country for the past few centuries. Hence it is not surprising that even its own people doubt its ability to accomplish anything that is considered stunning. When China first sent its spaceship into space, one Chinese woman, when interviewed by a journalist, dismissed the feat as insignificant because it did not carry any astronaut on board. Finally, when the first Chinese astronaut was sent into space, one important Japanese official sarcastically wished him \"good luck\" for a safe landing home on earth.\n \n There are two types of treatment towards an individual or a nation. The first type is the exaggerated fear by others over whatever you do. The second type is intentional discrediting or belittling of whatever you do. Both behaviours are uncalled for. If we are forced to choose between the two evils, most will prefer the first.\n \n However, such a serious occasion as unveiling of a successful outcome of a project by the country's Prime Minister can be made a joke or an insult points to something more serious in China. There were many instances where lesser officials in China covered up and denied some scandals which later turned out to be true. This reveals the government's credibility crisis in China -- so much so now the people don't even believe in their own Prime Minister!", 
   {
    "post_info": {
     "post_title": "Chinese Government's Credibility Crisis"
    }
   }, 
   null, 
   null, 
   1196746740.0
  ], 
  [
   292666, 
   null, 
   "SukuWatalu", 
   ":) Finally a scientist, Emily Lakdawalla, has taken the trouble to prove that the Chang'e 1 image is not fake. This was disclosed by Cincinatus on the website http://www.freerepublic.com/focus/f-news/1933870/posts\n \n Cincinatus says: \"Good explanation of the \"extra crater\". HERE http://www.planetary.org/blog/article/00001248/ The picture is NOT faked and they did NOT discover a new crater.\"\n \n There are ample reasons for anybody to believe that the Chinese orbiter's lunar image is not fake, even though he is not a space scientist or an expert from NASA. It is utterly silly and irresponsible to imply and speculate that a reputable Prime Minister of a big power can become a collaborator to hoodwink his own nation and the whole world.\n \n Below are excerpts from Emily Lakdawalla's article:\n \n (Begin excerpts)\n ....The two images cover the same areas, but they are evidently not the same image. The biggest difference arises from a different lighting angle between the two: the Clementine image is lit from the top (north), while the Chang'e image is lit from the northwest. There is also much more detail visible in the Chang'e 1 image. The extra detail arises in part because of the slightly higher resolution of the Chang'e 1 image, but it owes more to the much better camera on Chang'e 1; a decade of technological development will do that for you, and also, Clementine's camera was not really a Rolls Royce among spacecraft imagers. \n \n So the notion that China faked their lunar photo can be put to rest. (What is it about the Moon and conspiracy theories, anyway?) At least it certainly isn't a copy of the Clementine image; and it's certainly not a Lunar Orbiter image, either. I am curious -- but don't have the time to hunt -- to see what SMART-1 saw in the same area. But the Clementine/Chang'e 1 comparison contains something exciting: a spot that may have changed between the two images! Both images contain a right-pointing equilateral triangle formed by three smallish craters. The rightmost crater in the Clementine image stands alone, but in the Chang'e 1 image it has an apparently new feature to its lower left. The chief scientist of the Chinese lunar exploration program, Ouyang Ziyuan, was quoted in the Reuters and Telegraph rebuttals of the fake-image accusation as pointing to this spot as proof that the two pictures weren't the same. Amazing! Is this a new crater on the Moon, the place where nothing ever changes? And how ironic that there should be a new feature in an image that was supposed to be \"identical\" to one taken previously by NASA.....\n \n The Chang'e image isn't a fake as far as I can tell; my personal opinion, based upon the evidence I was able to dig up, is that the Chinese do have an orbiter at the Moon, and that it is producing really beautiful images that are a great improvement over Clementine. But the one released image is a processed product, and was altered slightly (the seams were blended away) to make it pretty. This alteration made it difficult for a scientist to realize that what appeared to be a new feature was in fact an artifact. \n \n Being a scientist type myself, I would love, eventually, to get my hands on the original data. And there's good news on that score. According to a Xinhua news story from Sunday, the Chinese Academy of Sciences is making the data available, in a limited way anyway, to the public. Chinese lunar exploration program chief scientist Ouyang Ziyuan is quoted as saying: \"The money used for the Chang'e project comes from the taxpayers and, therefore, the data should also be made public. Any scientist or astronomy lover can apply to the state in accordance with certain procedures to obtain data he needs.\" I invite any Chinese reader of this blog to attempt to get access to the data to help refute the fakery story, and tell me what happens! (End excerpts)", 
   {}, 
   292495, 
   null, 
   1196868360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Chinese Government's Credibility Crisis", 
  "url": "http://www.4forums.com/political/current-events-debates/10670-chinese-governments-credibility-crisis.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 10670, 
  "discussion_files": [
   [
    "27529.html", 
    "http://www.4forums.com/political/current-events-debates/10670-chinese-governments-credibility-crisis-print.html"
   ]
  ], 
  "identifier": 10670
 }
]