[
 [
  [
   17943, 
   null, 
   "epaphras_faith", 
   "I am speaking of the christian church. No offense to folks of other faiths. I am simply interested in what folks of any faith would say to this. \n \n As a protestant, I would say the purpose of the church is to \"be jesus to the world\". Individuals within the church are to use their God given gifts for the building up of the body to love one another and show the world what love is.\n \n Any other thoughts, (or similar thoughts). Remember we are looking at what ought not what is.", 
   {
    "post_info": {
     "post_title": "What is the purpose of the church intended to be?"
    }
   }, 
   null, 
   null, 
   1065058860.0
  ], 
  [
   17948, 
   null, 
   "montalban", 
   "I am speaking of the christian church. No offense to folks of other faiths. I am simply interested in what folks of any faith would say to this. \n \n As a protestant, I would say the purpose of the church is to \"be jesus to the world\". Individuals within the church are to use their God given gifts for the building up of the body to love one another and show the world what love is.\n \n Any other thoughts, (or similar thoughts). Remember we are looking at what ought not what is.\n\n \n By 'church' ...\n Do you mean the group of people who are Christian (ie. congregation) ?\n The institution of church?\n \n To Orthodox, the Church is a living earthly embodiment of Jesus Christ.\n \n The role of Orthodox is to be like God... by following His example. We are called to return to Him, but we are separated from Him by sin.\n \n We are living icons of God.", 
   {}, 
   17943, 
   null, 
   1065072240.0
  ], 
  [
   17978, 
   null, 
   "AMD4EVER", 
   "Without the church I would think that Christianity would eventually become less and less popular so one purpose of having a church is to continue the strength of the religion. Making people more informed on the ideas and ideals of Christianity is a vital purpose of the church. Another purpose is to raise money for the church and spread the word of God. I would say the real purpose of the church is to inform people of the word of God as written in the Bible. Church is the middle man between the average Christian and the Bible.", 
   {}, 
   17948, 
   null, 
   1065107460.0
  ], 
  [
   17983, 
   null, 
   "epaphras_faith", 
   "Montalban:\n \n By church I refer to the church. The greek word means \"a gathering.\" By Christian Church I mean the people who belong to Jesus Christ.\n \n AMD:\n \n I like your answer. I would alter your idea about \"raising money for the spread of the word of God. I agree that the spread is important and a function of the church. However, I would say that it is a role of the church to give money to support this. I would not say it is a role to raise it. You are probably asking how to do one without the other. I guess my answer would be to look at the church as a collection of individuals. The church is responsible to raise funds. The giving belongs to the individual and should not be coerced by the church. I do believe that the church could make needs known and then individuals respond. \n \n I don't think I am making much sense so I will stop here.", 
   {}, 
   17978, 
   null, 
   1065114840.0
  ], 
  [
   17987, 
   null, 
   "Crim", 
   "Though I'm not Christian, I would say\n \n a) Spread the teachings of Jesus\n b) Interact with other Christians to better understand those teachings", 
   {}, 
   17983, 
   null, 
   1065117840.0
  ], 
  [
   18048, 
   null, 
   "montalban", 
   "Montalban:\n \n By church I refer to the church. The greek word means \"a gathering.\" By Christian Church I mean the people who belong to Jesus Christ.\n \n \n\n \n The role of Christians is to be like God", 
   {}, 
   17983, 
   null, 
   1065186180.0
  ], 
  [
   18353, 
   null, 
   "AMD4EVER", 
   "The role of Christians is to be like God\n\n \n Wow, at least we are not asking too much of them.", 
   {}, 
   18048, 
   null, 
   1065478380.0
  ], 
  [
   18368, 
   null, 
   "epaphras_faith", 
   "Though I'm not Christian, I would say\n \n a) Spread the teachings of Jesus\n b) Interact with other Christians to better understand those teachings\n\n \n Excellent. You have stated the great commission in a nutshell. \"Go therefore into all the world and make disciples of all the nations teaching them to do all I have commanded you.\"", 
   {}, 
   17987, 
   null, 
   1065480960.0
  ], 
  [
   18424, 
   null, 
   "maximus", 
   "Let me add a couple of roles of the Church to what has already been said:\n \n 1)it must minister the sacraments. Jesus commanded the apostles to baptize, forgive or retain sins, and to administer the Eucharist \"in memory of me\" \n \n 2) the Church is the guardian and protector of truth Ephesians 3:10, 1 Timothy 3:15\n \n A simple clarification on what Crim said. He said that we are to interact with Christians to better understand the teachings of Jesus. In fact, we are to interact with anyone and everyone on the planet, Christian or not to better understand these teachings. That is truly the great commission. But I guess he did cover this in his first statement on spreading the teachings.", 
   {}, 
   18368, 
   null, 
   1065501480.0
  ], 
  [
   18451, 
   null, 
   "montalban", 
   "Wow, at least we are not asking too much of them.\n\n \n Certainly it would be too much if it were only up to us.\n \n But eventually, in the next life perhaps we will be re-united with God.\n \n I do think God gives points for trying.\n \n \n \n To those who believe the sole purpose of the Church is to spread the faith, that sounds awfully like 'works' to me!", 
   {}, 
   18353, 
   null, 
   1065520380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is the purpose of the church intended to be?", 
  "url": "http://www.4forums.com/political/religion-debates/1072-what-purpose-church-intended.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1072, 
  "discussion_files": [
   [
    "2890.html", 
    "http://www.4forums.com/political/religion-debates/1072-what-purpose-church-intended-print.html"
   ]
  ], 
  "identifier": 1072
 }
]