[
 [
  [
   295367, 
   null, 
   "robbie0517", 
   "Shocker! However, I do think we will prevail. Why all the fuss? \n \n \n(Portland, Oregon) A federal judge on Friday placed on hold a state domestic partnership law that was set to take effect Jan. 1, pending a February hearing.\n \n The law would give some spousal rights to same-sex couples.\n \n Opponents asked U.S. District Judge Michael W. Mosman to intercede after the Oregon secretary of state's office ruled in October that they had failed to collect enough valid signatures on a referendum to block the law.\n \n The Oregon measure covers benefits related to inheritance rights, child-rearing and custody, joint state tax filings, joint health, auto and homeowners insurance policies, visitation rights at hospitals and others. It does not affect federal benefits for married couples, including Social Security and joint filing of federal tax returns.\n \n After the Legislature approved the domestic partnership law this year, gay rights opponents launched an effort to collect enough signatures to suspend the law and place it on the November 2008 ballot for a statewide vote.\n \n But state elections officials said this fall that the effort fell 116 valid signatures short of the 55,179 needed to suspend the law.\n \n In court Friday, Austin Nimocks, a lawyer for Alliance Defense Fund, which opposes the measure, said the state's review process was flawed, disenfranchising citizens who had signed petitions.\n \n The state's largest gay rights group, Basic Rights Oregon, criticized the judge's decision.\n \n \"It's unfair our families once again are bearing the brunt of this ongoing struggle,\" said Jeana Frazzini, a spokesman for the group.\n \n Eight other states have approved spousal rights in some form for same-sex couples - Connecticut, Vermont, New Hampshire, New Jersey, Maine, California, Washington and Hawaii. Massachusetts is the only state that allows gay couples to marry.\n \n\n \n \n http://365gay.com/Newscon07/12/122807oregon.htm", 
   {
    "post_info": {
     "post_title": "Federal Court Halts Oregon Gay Partner Registry"
    }
   }, 
   null, 
   null, 
   1198911420.0
  ], 
  [
   295716, 
   null, 
   "foundit66", 
   "In court Friday, Austin Nimocks, a lawyer for Alliance Defense Fund, which opposes the measure, said the state's review process was flawed, disenfranchising citizens who had signed petitions.\n What the :xcensored ???\n \n That's like saying \"We had an election where you could vote for Jack or Jill. Jill lost because she had fewer votes. Jill's voters feel *disenfranchised*, therefore we should prevent Jack from taking office...\"\n \n I wonder if we'll hear any commentary from the typical anti-gay pundits about this absurd ruling.... emoticon_confused", 
   {}, 
   295367, 
   null, 
   1199158320.0
  ], 
  [
   295783, 
   null, 
   "E Mutz", 
   "In court Friday, Austin Nimocks, a lawyer for Alliance Defense Fund, which opposes the measure, said the state's review process was flawed, disenfranchising citizens who had signed petitions.\n What the :xcensored ???\n \n That's like saying \"We had an election where you could vote for Jack or Jill. Jill lost because she had fewer votes. Jill's voters feel *disenfranchised*, therefore we should prevent Jack from taking office...\"\n \n I wonder if we'll hear any commentary from the typical anti-gay pundits about this absurd ruling.... emoticon_confused\n\n \n Obfuscation most foul!\n \n I researched this on a source that did not have \"gay\" in the URL. Shcokingly, I found a different story as told by the decidely non-right-of-center Portland Tribune:\n \n \nThe plaintiffs' case hinges on the argument that the way Bradbury's office counted initiative signatures unconstitutionally disenfranchised thousands of people across the state who signed petitions for Referendum 303, the initiative that could have referred the civil-unions law to voters...\n \n According to court records, the plaintiffs believe they presented enough valid signatures in late September to put Initiative 303 on a 2008 ballot. Bradbury said the group, which handed in about 62,000 signatures, fell about 116 signatures short of the required 55,719 valid names.\n\n \n It would appear that this is less like the Jack and Jill scenario our potato protagonist proffered and more a case of just how many votes Jill got in the first place. Indeed, this is not a question of people *feeling* disenfranchised but rather a question of whether 6,281 people WERE disenfranchised.", 
   {
    "unicode_changes_made": true
   }, 
   295716, 
   null, 
   1199238480.0
  ], 
  [
   295784, 
   null, 
   "Symbiote", 
   "Matthew S I expect is opposed to this measure in Oregon, because states should not be allowed to decide issues like this for themselves, the federal government needs to excercise dictatorial control over all gay issues, for or against, because the larger and more powerful a government is, the more moral it becomes.\n \n This is a sad day for gay totalitarians everywhere.", 
   {}, 
   295783, 
   null, 
   1199239740.0
  ], 
  [
   295797, 
   null, 
   "foundit66", 
   "Obfuscation most foul!\n\n I obfuscated nothing.\n \n \n \nI researched this on a source that did not have \"gay\" in the URL. Shcokingly, I found a different story as told by the decidely non-right-of-center Portland Tribune:\n\n Actually, it's not \"different\" at all in that there is nothing in the gay article that is shown wrong or incorrect.\n So much for your \"obfuscation\"...\n \n And predictably, absolutely NO link from you...\n What have you got to hide?\n \n \n \nIt would appear that this is less like the Jack and Jill scenario our potato protagonist proffered and more a case of just how many votes Jill got in the first place. Indeed, this is not a question of people *feeling* disenfranchised but rather a question of whether 6,281 people WERE disenfranchised.\n\n Considering the typical rampant fraud committed when Christians attempt a lot of these \"petitions\" against civil unions, I'm not surprised there were some recognized as invalid.\n \n Here is a video on the techniques that were used in Massachusetts.\n http://www.youtube.com/watch?v=SMGUaCpmEPU&feature=related", 
   {}, 
   295783, 
   null, 
   1199248800.0
  ], 
  [
   295798, 
   null, 
   "foundit66", 
   "More on the Judge in question.\n Without surprise, he's got an anti-gay history...\n Michael Mosman, the U.S. attorney in Portland, is Smith's choice for a vacant district judgeship and is still regarded as a favorite of the Bush White House. But recent revelations of Mosman's views on gay rights, first expressed in 1986, have delayed his selection and what otherwise would likely be easy Senate confirmation.\n \n Now, gay-rights groups are demanding explanations from Mosman, putting Smith's carefully crafted reputation as a friend to the homosexual community on the line. Wyden, meanwhile, could be the only defense against a filibuster by the Senate's increasingly restive Democratic minority if he chooses to support Mosman's nomination.\n \n ....\n Mosman, 46, emerged as the top candidate in January after Ray Baum, a lawyer for Smith's family business, withdrew. But controversy erupted in March, when Basic Rights disclosed Mosman's role in a pivotal 1986 case, Bowers V. Hardwick (read about the case on Wikipedia here).\n \n The group uncovered and presented to Smith two \"bench memos\" that Mosman had written as a clerk to Supreme Court Justice Lewis F. Powell Jr. Mosman urged Powell to uphold Georgia's anti-sodomy law against a claim that police invaded a man's privacy by arresting him in his home.\n http://www.gayrightswatch.com/2007/12/judge-who-made-todays-anti-gay-ruling.html", 
   {}, 
   295797, 
   null, 
   1199249220.0
  ], 
  [
   295804, 
   null, 
   "E Mutz", 
   "I obfuscated nothing.\n \n \n That's like saying \"We had an election where you could vote for Jack or Jill. Jill lost because she had fewer votes. Jill's voters feel *disenfranchised*, therefore we should prevent Jack from taking office...\"\n\n \n HOGAN!!!! I Obfuscated Nozing!!! This is a question of whether these people were disenfranchised, not whether they FELT they were disenfranchised.\n \n \nActually, it's not \"different\" at all in that there is nothing in the gay article that is shown wrong or incorrect.\n So much for your \"obfuscation\"...\n \n And predictably, absolutely NO link from you...\n What have you got to hide?\n\n \n Different in that you hold up the 116 short figure vs the 6,281 in question. \n \n Forgive me for not including the link. I really didn't think it was terribly difficult to locate: http://www.portlandtribune.com/news/story.php?story_id=119881283577717900\n \n \n \nConsidering the typical rampant fraud committed when Christians attempt a lot of these \"petitions\" against civil unions, I'm not surprised there were some recognized as invalid.\n\n \n As long as we are making wide sweeping generalizations, why is it that those on the left oppose voter ID measures then want the strictest enforcement of petition drives?", 
   {}, 
   295798, 
   null, 
   1199253000.0
  ], 
  [
   295811, 
   null, 
   "foundit66", 
   "HOGAN!!!! I Obfuscated Nozing!!! This is a question of whether these people were disenfranchised, not whether they FELT they were disenfranchised. \n\n Such a ridiculously finer hair have I never seen cut.\n And even more pointless.\n \n So the distinction is on what then?\n Whether or not the people WERE disenfranchised, but didn't \"feel\" like it? emoticon_frazzled \n \n Whether you are willing to admit it or not, it's the same page.\n Your quibbling is like kvetching over whether or not somebody's statement is an \"opinion\", just because they didn't label it as such... emoticon_emb \n \n \n \nDifferent in that you hold up the 116 short figure vs the 6,281 in question.\n\n They were 116 short. Period. That's a fact that even YOUR article makes clear...\n \n From your article: \"According to court records, the plaintiffs believe they presented enough valid signatures in late September to put Initiative 303 on a 2008 ballot. Bradbury said the group, which handed in about 62,000 signatures, fell about 116 signatures short of the required 55,719 valid names.\"\n \n The \"6,281\" is an additional figure. More details. More info.\n Not \"obfuscation\".\n \n I repeat:\n Actually, it's not \"different\" at all in that there is nothing in the gay article that is shown wrong or incorrect.\n So much for your \"obfuscation\"... \n \n Can you show ANYTHING that was \"wrong or incorrect\" in the gay linked article???\n \n No?\n \n Then quit trying to make mountains out of mole-hills.\n \n You added more info to the thread.\n You get credit for that.\n Your claim of \"obfuscation\" is false.\n \n \n \nForgive me for not including the link. I really didn't think it was terribly difficult to locate: http://www.portlandtribune.com/news/story.php?story_id=119881283577717900\n\n Evidently, even more difficult for some to include in the first place...\n It's usually the responsibility of the person GIVING the info from a \"credible\" source to provide the link.\n Not the impetus of others to find where he supposedly got it...\n \n \n \nAs long as we are making wide sweeping generalizations, why is it that those on the left oppose voter ID measures then want the strictest enforcement of petition drives?\n\n Bring it up in another thread in a suitable area, and maybe I'll comment. That has no significance on this issue, and furthermore you aren't even trying to show a link between the two...\n I'm not letting you side-track THIS thread too.\n \n There are MULTIPLE examples of Christian groups utilizing fraud in their \"petition\" attempts.\n That you don't even try to deny.\n Hopefully the days to come will shed some light on why the other \"signatures\" were rejected.\n Considering the whole \"chad\" debacle in Florida, I would think that some people could appreciate the importance of a properly filled out \"voter\" documentats...", 
   {}, 
   295804, 
   null, 
   1199256780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Federal Court Halts Oregon Gay Partner Registry", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10755-federal-court-halts-oregon-gay-partner-registry.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10755, 
  "discussion_files": [
   [
    "17521.html", 
    "http://www.4forums.com/political/gay-rights-debates/10755-federal-court-halts-oregon-gay-partner-registry-print.html"
   ]
  ], 
  "identifier": 10755
 }
]