[
 [
  [
   295512, 
   null, 
   "Matthew S", 
   "If someone says they believe the bible is the literal, infallable,and inerrant word of God are they then trapped by that belief?\n \n I bring this up because of something Archangel said in the elections forum.\n \n I posted this \n http://www.4forums.com/political/showpost.php?p=295123&postcount=28\n Showing where in Ephesians women are to be subject to thier husbands in all things. \n \nEphesians Chapter 5\n 5:22. Let women be subject to their husbands, as to the Lord: \n 5:23. Because the husband is the head of the wife, as Christ is the head of the church. He is the saviour of his body. \n 5:24. Therefore as the church is subject to Christ: so also let the wives be to their husbands in all things.\n\n I then back it up with a quote from Jesus\n \nmatthew 19:5 And said, For this cause shall a man leave father and mother, and shall cleave to his wife: and they twain shall be one flesh?\n\n I take these above passages to mean that when a man and woman get married they become one person with the man at the head making all the decisions. I take it to mean that once they are married the women then gives up her free will to her husband.\n My question is this\n If someone believes that the bible is the literal, infallable,and inerrant word of God should we hold them to this belief if the enspouse this belief using the bible to challenge those beliefs?", 
   {
    "post_info": {
     "post_title": "Bible literalist"
    }
   }, 
   null, 
   null, 
   1199028960.0
  ], 
  [
   295515, 
   null, 
   "charlie horse", 
   "... I take these above passages to mean that when a man and woman get married they become one person with the man at the head making all the decisions. I take it to mean that once they are married the women then gives up her free will to her husband...\n\n Nope. Paul further went on to explain WHY women were to be in subjection: because woman (Eve) was thoroughly deceived first.\n \n There's nothing to suggest that joint decisions can't be made in a marriage - it is, after all, a marriage - or that wives can't think independently. It means that where a crucial decision is to be made, and there isn't a consensus, then the husband should take the lead.\n \n That's if you believe it all in the first place.", 
   {}, 
   295512, 
   null, 
   1199029620.0
  ], 
  [
   295524, 
   null, 
   "Archangel", 
   "Which is why I gave this explanation which you obviously didn't like Matthew.\n ARCHANGELYou see Matthew, I'm a bible literalist, not a bible legalist. There is a huge difference you know. You are a legalist so you take the bible in a legalistic interpretation to the extremes to fit a negative belief in what it is saying, when it is convenient that is. When the bible condemns homosexuality, you brush it off as not literal at all but only figurative or just plain wrong. \n \n In my marriage, according to the bible, God will hold me as the head of the household responsible for my families stability and security. That doesn't make me the Lord over my family and give me the right to rule with an iron fist like a dictator. I am to love and serve my family as the Lord loves and serves the Church.\n \n As for my wife, she is my help mate, my equal. My councilor whom I discuss every decision that effects our family with before making a decision. Her opinion, perspective and wisdom is key to US making wise decisions for our family. If there is an issue that we just can't agree on together, she will actually tell me to do what I think is right because she understands that God will ultimately hold me responsible as the head of the household. \n \n It isn't about being in charge or being the boss for me at all. It's about going before my Lord as His child whom He has entrusted other precious children to. Those people being my wife and children. That's why I walked not in front of my daughters as they grew up, leading like some general, but walked by their side guiding them as another child of God and guided them to HIS THRONE OF GRACE because I am finite and may not always be here. But jesus is forever and can always be counted on to be perfect, Holy and Righteous. Not so with me, a flawed human being whom my daughters have seen fall short of perfection on many levels.\n \n But just as I have lovingly nurtured them through their growing pains, so have they loved me through mine. That is what being a christian father and husband is all about Matthew. Not being the biggest bully in the neighborhood and lording my position over my wife and kids as I beat them into submission to my singular will as you so incorrectly see it to be.\n http://www.4forums.com/political/showpost.php?p=295134&postcount=32", 
   {}, 
   295515, 
   null, 
   1199032320.0
  ], 
  [
   295525, 
   null, 
   "smiley", 
   "Nope. Paul further went on to explain WHY women were to be in subjection: because woman (Eve) was thoroughly deceived first.\n \n There's nothing to suggest that joint decisions can't be made in a marriage - it is, after all, a marriage - or that wives can't think independently. It means that where a crucial decision is to be made, and there isn't a consensus, then the husband should take the lead.\n \n That's if you believe it all in the first place.\n\n But this does tend to suggest that, if there is a disagreement, then the husband's choice overrules that of his wife.\n \n This simply doesn't stand up in today's 'equal' society (I'm not saying that today's society really is equal).\n \n Smiley", 
   {}, 
   295515, 
   null, 
   1199032380.0
  ], 
  [
   295529, 
   null, 
   "Archangel", 
   "But this does tend to suggest that, if there is a disagreement, then the husband's choice overrules that of his wife.\n \n This simply doesn't stand up in today's 'equal' society (I'm not saying that today's society really is equal).\n \n Smiley\n\n \n Maybe that helps to explain the ridiculously high divorce rate in todays culture. My point is that according to the bible which Christians live by, the man will be held responsible by God for the family so if there is an issue husband and wife disagree on, the final decision falls to the husband. But a wise man will understand that many times God will guide Him through his wife, so her insights are the most important advice he will receive.", 
   {}, 
   295525, 
   null, 
   1199033880.0
  ], 
  [
   295536, 
   null, 
   "charlie horse", 
   "But this does tend to suggest that, if there is a disagreement, then the husband's choice overrules that of his wife...\n\n Often debated at length in bible study groups.\n \n I think it's down to ships and number of captains! Or who wears the trousers. emoticon_xhoho", 
   {}, 
   295525, 
   null, 
   1199036700.0
  ], 
  [
   295547, 
   null, 
   "electrolyte", 
   "If someone says they believe the bible is the literal, infallable,and inerrant word of God are they then trapped by that belief?\n\n Rationally, they would be. In reality, they don't think so.\n \n The Bible literalist will lie, obfuscate, qualify, and ignore Biblical passages to his or her little heart's content just to come up with what that person already believes is true.\n \n For example, According to the Bible, God said that nobody should work on the sabbath. According to the Bible, Moses found a man picking up sticks on the sabbath. According to the Bible, God Himself declared that a man picking up sticks on the sabbath should be put to death.\n \n Bible literalists will retell this story with any number of explanations. \"It was a different time\" is very common. \"That was because he directly disobeyed God's word\" is one that our friend Archie uses. Whatever the explanation, today's literalists will never push for the stoning of a sabbath-worker, regardless of what the Bible actually says.", 
   {}, 
   295512, 
   null, 
   1199043780.0
  ], 
  [
   295548, 
   null, 
   "Matthew S", 
   "Which is why I gave this explanation which you obviously didn't like Matthew.\n ARCHANGELYou see Matthew, I'm a bible literalist, not a bible legalist. There is a huge difference you know. You are a legalist so you take the bible in a legalistic interpretation to the extremes to fit a negative belief in what it is saying, when it is convenient that is. When the bible condemns homosexuality, you brush it off as not literal at all but only figurative or just plain wrong. \n \n In my marriage, according to the bible, God will hold me as the head of the household responsible for my families stability and security. That doesn't make me the Lord over my family and give me the right to rule with an iron fist like a dictator. I am to love and serve my family as the Lord loves and serves the Church.\n \n As for my wife, she is my help mate, my equal. My councilor whom I discuss every decision that effects our family with before making a decision. Her opinion, perspective and wisdom is key to US making wise decisions for our family. If there is an issue that we just can't agree on together, she will actually tell me to do what I think is right because she understands that God will ultimately hold me responsible as the head of the household. \n \n It isn't about being in charge or being the boss for me at all. It's about going before my Lord as His child whom He has entrusted other precious children to. Those people being my wife and children. That's why I walked not in front of my daughters as they grew up, leading like some general, but walked by their side guiding them as another child of God and guided them to HIS THRONE OF GRACE because I am finite and may not always be here. But jesus is forever and can always be counted on to be perfect, Holy and Righteous. Not so with me, a flawed human being whom my daughters have seen fall short of perfection on many levels.\n \n But just as I have lovingly nurtured them through their growing pains, so have they loved me through mine. That is what being a christian father and husband is all about Matthew. Not being the biggest bully in the neighborhood and lording my position over my wife and kids as I beat them into submission to my singular will as you so incorrectly see it to be.\n http://www.4forums.com/political/showpost.php?p=295134&postcount=32\n\n \n \n Non sense if you call yourself a bible literalist you must do exactly what the bible says. If you want to interpret or say the bible says something other then what the words say then you are not a bible literalist and the whole bible is open to interpratation. For you can not say that one passage is literal and another is not.\n \n So Archangel which is it is the bible the literal word of God or not? If you consider yourself a bible literalist then the bible has to be literal and you have to do exactly what the wods say.", 
   {}, 
   295524, 
   null, 
   1199043900.0
  ], 
  [
   295551, 
   null, 
   "Archangel", 
   "Non sense if you call yourself a bible literalist you must do exactly what the bible says. If you want to interpret or say the bible says something other then what the words say then you are not a bible literalist and the whole bible is open to interpratation. For you can not say that one passage is literal and another is not.\n \n So Archangel which is it is the bible the literal word of God or not? If you consider yourself a bible literalist then the bible has to be literal and you have to do exactly what the wods say.\n\n \n But neither can you take one or two passages out of context from the bible and create a whole doctrine based just on those passages if the bible says much more on that subject. Based on the rights of women in the first Century, Jesus and the new church greatly liberated women and gave them equality to men in many regards such as human and civil rights.\n \n One obvious example is how Jesus treated the adulterous who was caught in the act with a married man. According to Jewish law she should have and would have been stoned to death on the spot had He not reminded the men that they too were sinners in need of salvation. And notice He said they don't condemn you and NEITHER DO I, NOW GO AND SIN NO MORE. Why do you fail to grasp that with forgiveness comes the command to repent, which means to stop the sins you were forgiven for Matthew?\n \n So you must stop cherry picking what parts of the bible you will accept as true and reject any part that convicts you personally. What I said above in red is the scriptural lay out for how a submissive born again husband and father should lead his family. You can reject it as false and not scriptural but that has no effect at all on what is true according to God who is the final arbiter of all truth.", 
   {}, 
   295548, 
   null, 
   1199044980.0
  ], 
  [
   295555, 
   null, 
   "Matthew S", 
   "But neither can you take one or two passages out of context from the bible and create a whole doctrine based just on those passages if the bible says much more on that subject. Based on the rights of women in the first Century, Jesus and the new church greatly liberated women and gave them equality to men in many regards such as human and civil rights.\n \n One obvious example is how Jesus treated the adulterous who was caught in the act with a married man. According to Jewish law she should have and would have been stoned to death on the spot had He not reminded the men that they too were sinners in need of salvation. And notice He said they don't condemn you and NEITHER DO I, NOW GO AND SIN NO MORE. Why do you fail to grasp that with forgiveness comes the command to repent, which means to stop the sins you were forgiven for Matthew?\n \n So you must stop cherry picking what parts of the bible you will accept as true and reject any part that convicts you personally. What I said above in red is the scriptural lay out for how a submissive born again husband and father should lead his family. You can reject it as false and not scriptural but that has no effect at all on what is true according to God who is the final arbiter of all truth.\n\n \n \n Then you can not claim you are a bible literalist or that you believe that the bible is the lierteral word of God. It is a black and white issue either you believe that the bible is the literal word of God or you don't.", 
   {}, 
   295551, 
   null, 
   1199047560.0
  ], 
  [
   295557, 
   null, 
   "Archangel", 
   "Then you can not claim you are a bible literalist or that you believe that the bible is the lierteral word of God. It is a black and white issue either you believe that the bible is the literal word of God or you don't.\n\n \n Of course I take the bible literally Matt. But what is most important is to see it through Gods eyes, so to speak. To interpret it according to how God intended it to be interpreted. And if we believe your interpretation then God wants men to dominate women not with love but to tell them how and what they must think as subjects of their husbands rather than as equal spouses in a loving partnership. How can a man leave his mother and father, join with his wife and the two become one flesh by your warped way of viewing those two passages?\n \n The answer is they couldn't unless your view of the marriage relationship is likened to a man who likes pain and allows people to hurt him as a sado-masochist. Remember that a house divided is a house fallen. So it is with a relationship where the man oppresses his wife and tells her how she must think or vote on personal issues in her own life. Marriage doesn't mean a loss of free will for women Matthew, and to suggest such a thing only confirms how distorted your view of Christianity and by extension, Gods character really is.", 
   {}, 
   295555, 
   null, 
   1199048340.0
  ], 
  [
   295565, 
   null, 
   "Matthew S", 
   "Of course I take the bible literally Matt. But what is most important is to see it through Gods eyes, so to speak. To interpret it according to how God intended it to be interpreted. And if we believe your interpretation then God wants men to dominate women not with love but to tell them how and what they must think as subjects of their husbands rather than as equal spouses in a loving partnership. How can a man leave his mother and father, join with his wife and the two become one flesh by your warped way of viewing those two passages?\n \n The answer is they couldn't unless your view of the marriage relationship is likened to a man who likes pain and allows people to hurt him as a sado-masochist. Remember that a house divided is a house fallen. So it is with a relationship where the man oppresses his wife and tells her how she must think or vote on personal issues in her own life. Marriage doesn't mean a loss of free will for women Matthew, and to suggest such a thing only confirms how distorted your view of Christianity and by extension, Gods character really is.\n\n \n \n Welcome to my world. You know very well that I don't take the bible literally and it is good to know that you do not either. Since you do not believe that Ephesians Chapter 5 can not be taken literally then you will agree that leviticus 18:22 can not be taken literally also. Good to know. Because I interpret levitcus 18:22 not to mean what you think it does. Leviticus 18:22 is amied at heteros that go against their sexual orientation not gays and lesbians acting upon their sexual orientation.", 
   {}, 
   295557, 
   null, 
   1199051640.0
  ], 
  [
   295566, 
   null, 
   "electrolyte", 
   "Of course I take the bible literally Matt. But what is most important is to see it through Gods eyes, so to speak. To interpret it according to how God intended it to be interpreted.\n\n But who determines \"how God intended it to be interpreted\"? Who is regarded as the authority of \"how God intended it to be interpreted\"? God? No, it can't be, because God's meaning is what is in dispute. The interpreters are the ones who determine \"God's meaning.\" Therefore I can have my interpretation, you can have your interpretation, the Pope can have his interpretation, and any random nutjob can have his interpretation, too, and everybody will have -- at least on these grounds -- equal claim to being right. Pretty dumb, huh?\n \n \nAnd if we believe your interpretation then God wants men to dominate women not with love but to tell them how and what they must think as subjects of their husbands rather than as equal spouses in a loving partnership.\n\n So because you don't like a particular interpretation, even if it is the only logical one, you feel that you are correct in rejecting what the Bible actually says and insisting that God meant something else. Why are you any more qualified to make that declaration than anybody else? Considering your practice of making arguments and holding positions that completely lack coherence, logic, reason, and rationality, you've got a long, steep hill to climb.\n \n But, of course, you don't know that because you're ignoring everyone and everything that exposes your complete disconnect from reality.", 
   {}, 
   295557, 
   null, 
   1199052180.0
  ], 
  [
   295568, 
   null, 
   "MrWriteLA", 
   "There is no such thing as a \"Bible literalist.\"\n \n Only Bible cafeterialists.", 
   {}, 
   295566, 
   null, 
   1199053680.0
  ], 
  [
   295574, 
   null, 
   "Archangel", 
   "Welcome to my world. You know very well that I don't take the bible literally and it is good to know that you do not either. Since you do not believe that Ephesians Chapter 5 can not be taken literally then you will agree that leviticus 18:22 can not be taken literally also. Good to know. Because I interpret levitcus 18:22 not to mean what you think it does. Leviticus 18:22 is amied at heteros that go against their sexual orientation not gays and lesbians acting upon their sexual orientation.\n\n \n You can't help but pervert what someone says and misinterpret what they mean can you Matt. Ok I'll tell you what, post the rest of the verses from all parts of the bible that show where God allows and blesses the act of homosexuality and i'll reconsider Lev 18:22. Because that is what I am talking about. Taking all of the passages pertaining to any given subject and then deciding what God means. But not with just 1 or 2 verses as that gives just a partial picture of what is intended.", 
   {}, 
   295565, 
   null, 
   1199058420.0
  ], 
  [
   295575, 
   null, 
   "Matthew S", 
   "You can't help but pervert what someone says and misinterpret what they mean can you Matt. Ok I'll tell you what, post the rest of the verses from all parts of the bible that show where God allows and blesses the act of homosexuality and i'll reconsider Lev 18:22. Because that is what I am talking about. Taking all of the passages pertaining to any given subject and then deciding what God means. But not with just 1 or 2 verses as that gives just a partial picture of what is intended.\n\n \n \n You believe the bible is the literal word of God except for those passages that pertain to your life.\n \n When the bible says women must submit to their husbands then it is open to interpretation but other passages that don't apply to your life they are literal. When I attempt to interpret the bible you need further passages to support my interpretation. \n \n Matthew 19:12 Jesus talks about gay people\n \nMatthew 19:12 (King James Version)\n King James Version (KJV) \n \n 12For there are some eunuchs, which were so born from their mother's womb: and there are some eunuchs, which were made eunuchs of men: and there be eunuchs, which have made themselves eunuchs for the kingdom of heaven's sake. He that is able to receive it, let him receive it.\n\n \n So if you can then interpret ephesians 5 to mean what you say it does then I am free to interpret matthew 19:12 and leviticus 18:22 the way I want.", 
   {}, 
   295574, 
   null, 
   1199058660.0
  ], 
  [
   295576, 
   null, 
   "smiley", 
   "You can't help but pervert what someone says and misinterpret what they mean can you Matt. Ok I'll tell you what, post the rest of the verses from all parts of the bible that show where God allows and blesses the act of homosexuality and i'll reconsider Lev 18:22. Because that is what I am talking about. Taking all of the passages pertaining to any given subject and then deciding what God means. But not with just 1 or 2 verses as that gives just a partial picture of what is intended.\n\n \n I think the only passage you need comes from Mark 7.\n \n \n 14Again Jesus called the crowd to him and said, \"Listen to me, everyone, and understand this. 15Nothing outside a man can make him 'unclean' by going into him. Rather, it is what comes out of a man that makes him 'unclean.' \"[f] \n \n 17After he had left the crowd and entered the house, his disciples asked him about this parable. 18\"Are you so dull?\" he asked. \"Don't you see that nothing that enters a man from the outside can make him 'unclean'? 19For it doesn't go into his heart but into his stomach, and then out of his body.\" (In saying this, Jesus declared all foods \"clean.\") \n \n 20He went on: \"What comes out of a man is what makes him 'unclean.' 21For from within, out of men's hearts, come evil thoughts, sexual immorality, theft, murder, adultery, 22greed, malice, deceit, lewdness, envy, slander, arrogance and folly. 23All these evils come from inside and make a man 'unclean.' \"\n\n \n This passage is viewed as saying that all the 'unclean' foods (shellfish, rare steak etc) would no longer be considered 'unclean'. However it says much more. This passage is saying that it is what is in your heart that matters. Do you love or hate? Homosexual love is still love. I realise that you would say it is the same as sexual immorality, but then that is just your interpretation.\n \n What could be more cut and dried than, \"Don't you see that nothing that enters a man from the outside can make him 'unclean'?\"emoticon_xangel \n \n Smiley", 
   {}, 
   295574, 
   null, 
   1199059380.0
  ], 
  [
   295585, 
   null, 
   "Archangel", 
   "You believe the bible is the literal word of God except for those passages that pertain to your life.\n \n When the bible says women must submit to their husbands then it is open to interpretation but other passages that don't apply to your life they are literal. When I attempt to interpret the bible you need further passages to support my interpretation. \n \n Matthew 19:12 Jesus talks about gay people\n \n \n So if you can then interpret ephesians 5 to mean what you say it does then I am free to interpret matthew 19:12 and leviticus 18:22 the way I want.\n\n \n If you read this passage about eunuchs to justify homosexuality then you are more disturbed than even I thought possible, but you will believe what you want to no matter what Matt and are here only to justify your sin. So go for it. I can't and wont try to stop you. You do understand that eunuchs are men who have been castrated don't you? Now reread your passage with that in mind if you will.", 
   {}, 
   295575, 
   null, 
   1199064000.0
  ], 
  [
   295587, 
   null, 
   "Archangel", 
   "I think the only passage you need comes from Mark 7.\n 14Again Jesus called the crowd to him and said, \"Listen to me, everyone, and understand this. 15Nothing outside a man can make him 'unclean' by going into him. Rather, it is what comes out of a man that makes him 'unclean.' \"[f] \n \n 17After he had left the crowd and entered the house, his disciples asked him about this parable. 18\"Are you so dull?\" he asked. \"Don't you see that nothing that enters a man from the outside can make him 'unclean'? 19For it doesn't go into his heart but into his stomach, and then out of his body.\" (In saying this, Jesus declared all foods \"clean.\") \n \n 20He went on: \"What comes out of a man is what makes him 'unclean.' 21For from within, out of men's hearts, come evil thoughts, sexual immorality, theft, murder, adultery, 22greed, malice, deceit, lewdness, envy, slander, arrogance and folly. 23All these evils come from inside and make a man 'unclean.' \"\n This passage is viewed as saying that all the 'unclean' foods (shellfish, rare steak etc) would no longer be considered 'unclean'. However it says much more. This passage is saying that it is what is in your heart that matters. Do you love or hate? Homosexual love is still love. I realise that you would say it is the same as sexual immorality, but then that is just your interpretation.\n \n \n \n What could be more cut and dried than, \"Don't you see that nothing that enters a man from the outside can make him 'unclean'?\"emoticon_xangel \n \n Smiley\n\n \n You are seriously ignoring the meat of this passage. No pun intended emoticon_xangel . This verse speaks to the types of sins that lead to Mans destruction.\n He went on: \"What comes out of a man is what makes him 'unclean.' 21For from within, out of men's hearts, come evil thoughts, sexual immorality, theft, murder,adultery,22 greed, malice, deceit,lewdness, envy, slander,arrogance and folly. 23All these evils come from inside and make a man 'unclean.' \"\n This passage seems to clearly point out that sexual immorality, adultery, lewdness, fornication, none of these activities are expressions of love to God. They are perversions of it. How you can take a passage that is speaking to FOOD being clean or unclean when you know that pork, shellfish and eating certain foods on the sabbath were issues for the Jews back then and turn it into a justification for homosexuality?", 
   {}, 
   295576, 
   null, 
   1199065140.0
  ], 
  [
   295602, 
   null, 
   "smiley", 
   "You are seriously ignoring the meat of this passage. No pun intended emoticon_xangel . This verse speaks to the types of sins that lead to Mans destruction.\n He went on: \"What comes out of a man is what makes him 'unclean.' 21For from within, out of men's hearts, come evil thoughts, sexual immorality, theft, murder,adultery,22 greed, malice, deceit,lewdness, envy, slander,arrogance and folly. 23All these evils come from inside and make a man 'unclean.' \"\n This passage seems to clearly point out that sexual immorality, adultery, lewdness, fornication, none of these activities are expressions of love to God. They are perversions of it. How you can take a passage that is speaking to FOOD being clean or unclean when you know that pork, shellfish and eating certain foods on the sabbath were issues for the Jews back then and turn it into a justification for homosexuality?\n\n \n As I pointed out in my previous post, this passage is saying far more than, 'you can eat what you want now'. It is saying, 'It is what is in your heart that matters'. You obviously skipped that bit.\n \n As you say, none of the words you high-lighted is an expression of love to god. However, none of them equates to homosexuality, unless you have a warped sense of what love really is.\n \n Smiley\n \n PS Just to be really pedantic, your last sentence was not a question (no question mark needed).", 
   {}, 
   295587, 
   null, 
   1199069160.0
  ], 
  [
   295607, 
   null, 
   "Archangel", 
   "As I pointed out in my previous post, this passage is saying far more than, 'you can eat what you want now'. It is saying, 'It is what is in your heart that matters'. You obviously skipped that bit.\n \n As you say, none of the words you high-lighted is an expression of love to god. However, none of them equates to homosexuality, unless you have a warped sense of what love really is.\n \n Smiley\n \n PS Just to be really pedantic, your last sentence was not a question (no question mark needed).\n\n \n I totally agree that the bolded words are not referring to homosexuality alone, but straights also. But to imply that they refer to straights alone who do those things and not also to gays is wrong also. And you seem to be missing my point that those physical expressions of sexual contact don't represent love of any kind to either straights or gays which is why God tells us not to participate in them at all.", 
   {}, 
   295602, 
   null, 
   1199069520.0
  ], 
  [
   295610, 
   null, 
   "Penfold", 
   "You are seriously ignoring the meat of this passage. No pun intended emoticon_xangel . This verse speaks to the types of sins that lead to Mans destruction.\n He went on: \"What comes out of a man is what makes him 'unclean.' 21For from within, out of men's hearts, come evil thoughts, sexual immorality, theft, murder,adultery,22 greed, malice, deceit,lewdness, envy, slander,arrogance and folly. 23All these evils come from inside and make a man 'unclean.' \"\n This passage seems to clearly point out that sexual immorality, adultery, lewdness, fornication, none of these activities are expressions of love to God. They are perversions of it. How you can take a passage that is speaking to FOOD being clean or unclean when you know that pork, shellfish and eating certain foods on the sabbath were issues for the Jews back then and turn it into a justification for homosexuality?\n\n \n The Bible contains six admonishments to homosexuals and 362 admonishments to heterosexuals. That doesn't mean that God doesn't love heterosexuals. It's just that they need more supervision. ~Lynn Lavner", 
   {}, 
   295587, 
   null, 
   1199069760.0
  ], 
  [
   295616, 
   null, 
   "smiley", 
   "I totally agree that the bolded words are not referring to homosexuality alone, but straights also. But to imply that they refer to straights alone who do those things and not also to gays is wrong also. And you seem to be missing my point that those physical expressions of sexual contact don't represent love of any kind to either straights or gays which is why God tells us not to participate in them at all.\n\n \n I in no way implied that these words applied only to straight people - that is your little twist. I completely agree that it is saying that these are sins, whether committed by straights or gays.\n \n However, you specifically asked for 'parts of the bible that show where God allows and blesses the act of homosexuality'. The passage I quoted is saying that it is what is in your heart that matters. It then goes on to spell out those sins that make a man 'unclean'. Not one of these sins can be equated to homosexuality. Homosexual love is love, pure and simple. If love is what is in your heart, then you are not committing a sin that will make you 'unclean'.\n \n Word of god. Can't disagree with that, can you?\n \n Smiley", 
   {}, 
   295607, 
   null, 
   1199070540.0
  ], 
  [
   295617, 
   null, 
   "Archangel", 
   "I in no way implied that these words applied only to straight people - that is your little twist. I completely agree that it is saying that these are sins, whether committed by straights or gays.\n \n However, you specifically asked for 'parts of the bible that show where God allows and blesses the act of homosexuality'. The passage I quoted is saying that it is what is in your heart that matters. It then goes on to spell out those sins that make a man 'unclean'. Not one of these sins can be equated to homosexuality. Homosexual love is love, pure and simple. If love is what is in your heart, then you are not committing a sin that will make you 'unclean'.\n \n Word of god. Can't disagree with that, can you?\n \n Smiley\n\n \n Oh I see what you're getting at now. And an interesting point but totally out of context to the issue being discussed regarding homosexuality. Jesus was dealing with the attitudes of Jews of His day regarding unclean food ONLY in that passage and by extension He was pointing out that sins of the heart and mind regarding the purity of ones soul is the source of sin. \n \n And to say that not one of those characteristics Jesus mentioned applies to homosexuality is to completely deny the obvious. I feel like threads are overlapping but this passage say's almost the same thing but adds the unnatural acts of gay sex too.\n Rom 1:21 For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened. \n Rom 1:22 Professing to be wise, they became fools, \n Rom 1:23 and exchanged the glory of the incorruptible God for an image in the form of corruptible man and of birds and four-footed animals and crawling creatures. \n Rom 1:24 Therefore God gave them over in the lusts of their hearts to impurity, so that their bodies would be dishonored among them. \n Rom 1:25 For they exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator, who is blessed forever. Amen. \n Rom 1:26 For this reason God gave them over to degrading passions; for their women exchanged the natural function for that which is unnatural, \n Rom 1:27 and in the same way also the men abandoned the natural function of the woman and burned in their desire toward one another, men with men committing indecent acts and receiving in their own persons the due penalty of their error. \n Rom 1:28 And just as they did not see fit to acknowledge God any longer, God gave them over to a depraved mind, to do those things which are not proper, \n Rom 1:29 being filled with all unrighteousness, wickedness, greed, evil; full of envy, murder, strife, deceit, malice; {they are} gossips, \n Rom 1:30 slanderers, haters of God, insolent, arrogant, boastful, inventors of evil, disobedient to parents, \n Rom 1:31 without understanding, untrustworthy, unloving, unmerciful; \n Rom 1:32 and although they know the ordinance of God, that those who practice such things are worthy of death, they not only do the same, but also give hearty approval to those who practice them. \n ", 
   {}, 
   295616, 
   null, 
   1199071140.0
  ], 
  [
   295620, 
   null, 
   "smiley", 
   "Oh I see what you're getting at now. And an interesting point but totally out of context to the issue being discussed regarding homosexuality. Jesus was dealing with the attitudes of Jews of His day regarding unclean food ONLY in that passage and by extension He was pointing out that sins of the heart and mind regarding the purity of ones soul is the source of sin. \n \n And to say that not one of those characteristics Jesus mentioned applies to homosexuality is to completely deny the obvious. I feel like threads are overlapping but this passage say's almost the same thing but adds the unnatural acts of gay sex too.\n Rom 1:21 For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened. \n Rom 1:22 Professing to be wise, they became fools, \n Rom 1:23 and exchanged the glory of the incorruptible God for an image in the form of corruptible man and of birds and four-footed animals and crawling creatures. \n Rom 1:24 Therefore God gave them over in the lusts of their hearts to impurity, so that their bodies would be dishonored among them. \n Rom 1:25 For they exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator, who is blessed forever. Amen. \n Rom 1:26 For this reason God gave them over to degrading passions; for their women exchanged the natural function for that which is unnatural, \n Rom 1:27 and in the same way also the men abandoned the natural function of the woman and burned in their desire toward one another, men with men committing indecent acts and receiving in their own persons the due penalty of their error. \n Rom 1:28 And just as they did not see fit to acknowledge God any longer, God gave them over to a depraved mind, to do those things which are not proper, \n Rom 1:29 being filled with all unrighteousness, wickedness, greed, evil; full of envy, murder, strife, deceit, malice; {they are} gossips, \n Rom 1:30 slanderers, haters of God, insolent, arrogant, boastful, inventors of evil, disobedient to parents, \n Rom 1:31 without understanding, untrustworthy, unloving, unmerciful; \n Rom 1:32 and although they know the ordinance of God, that those who practice such things are worthy of death, they not only do the same, but also give hearty approval to those who practice them. \n \n\n \n Yep, caught that passage in the other thread. It does indeed appear to condemn homosexuality, though it is still open to interpretation. Maybe I'll get back to you on that. But please remember that I hold the bible in the same esteem that I do any other story book.\n \n I don't see how you can say that I am denying the obvious by saying that none of the characterstics Jesus mention equates to homosexuality. You are using the word applies. None of the characterstics Jesus list is equivalent to homosexuality. That is obvious.\n \n Smiley", 
   {}, 
   295617, 
   null, 
   1199073540.0
  ], 
  [
   295621, 
   null, 
   "Penfold", 
   "Archie quotes the Pre-Christian Jewish God. Where does Jesus make any such pronouncements?", 
   {}, 
   295620, 
   null, 
   1199074020.0
  ], 
  [
   295622, 
   null, 
   "Matthew S", 
   "Archie quotes the Pre-Christian Jewish God. Where does Jesus make any such pronouncements?\n\n \n That is because fundamentalists worship a God of fear and not love.", 
   {}, 
   295621, 
   null, 
   1199074920.0
  ], 
  [
   295626, 
   null, 
   "Archangel", 
   "Archie quotes the Pre-Christian Jewish God. Where does Jesus make any such pronouncements?\n\n \n So the book of Romans which was written after Jesus was crucified, resurrected and ascended on High is a pre-Christian book? And speaking of a pre-Christian Jewish God, My Gods name is Yahweh the God of Abraham Isaac and Jacob. Don't you get that what we call Christianity is the same salvation God sent for the Jew, but was offered to us when the Jew rejected His free gift? \n \n It is written, the stone which the builders rejected became the cornerstone of our faith. Your homework assignment is to place that verse in proper context. Do some studying Penfold, you have a lot to learn if you're going to discuss the bible, or Christianity.", 
   {}, 
   295621, 
   null, 
   1199077860.0
  ], 
  [
   295627, 
   null, 
   "Archangel", 
   "That is because fundamentalists worship a God of fear and not love.\n\n \n You are projecting due to your fear of the inevitable judgment that is coming Matthew. But that's only because you don't know God so you fear whom you don't know. But that isn't the case for me so I'm not responding to God out of fear but in love that He first showed to me.", 
   {}, 
   295622, 
   null, 
   1199078160.0
  ], 
  [
   295628, 
   null, 
   "smiley", 
   "You are projecting due to your fear of the inevitable judgment that is coming Matthew. But that's only because you don't know God so you fear whom you don't know. But that isn't the case for me so I'm not responding to God out of fear but in love that He first showed to me.\n\n \n Why would a non-christian be afraid of your god's judgement? You appear to be preaching fear again, Archie.\n \n Smiley", 
   {}, 
   295627, 
   null, 
   1199078220.0
  ], 
  [
   295629, 
   null, 
   "Archangel", 
   "Why would a non-christian be afraid of your god's judgement? You appear to be preaching fear again, Archie.\n \n Smiley\n\n \n Matthew constantly claims to be a christian. Only His Christ is some imaginary pro gay figure who loves anyone, even if they never personally accept Him as their savior. I'm here to tell Him that Jesus doesn't exist. So no, I'm not preaching fear at all, only reality.", 
   {}, 
   295628, 
   null, 
   1199078520.0
  ], 
  [
   295633, 
   null, 
   "Penfold", 
   " ... I'm here to tell Him that Jesus doesn't exist. So no, I'm not preaching fear at all, only reality.\n\n \n That's a Damascene conversion if ever there was one! Archie's seen the light!", 
   {}, 
   295629, 
   null, 
   1199079180.0
  ], 
  [
   295634, 
   null, 
   "electrolyte", 
   "My Gods name is Yahweh the God of Abraham Isaac and Jacob.\n\n So your God is the same God who is the ultimate moral authority, who killed thousands upon thousands of people upon a whim, orders the murder and torture of others, and crushes a penitent Job in a petty bet with an inferior being. Got it.\n \n Will you be stoning Matthew or me anytime soon?\n \n What's that? You won't? Why not? Oh, right, because you pick and choose which rules you want to live by regardless of what the Bible actually says. It's all cleared up now.", 
   {}, 
   295633, 
   null, 
   1199079720.0
  ], 
  [
   295640, 
   null, 
   "Archangel", 
   "That's a Damascene conversion if ever there was one! Archie's seen the light!\n\n \n Would you care to clarify what I said that implies a Damascene Conversion? Because I don't think you know what it means or else you wouldn't have attributed my statement that you quoted above to being one.", 
   {}, 
   295633, 
   null, 
   1199082120.0
  ], 
  [
   295659, 
   null, 
   "Matthew S", 
   "Matthew constantly claims to be a christian. Only His Christ is some imaginary pro gay figure who loves anyone, even if they never personally accept Him as their savior. I'm here to tell Him that Jesus doesn't exist. So no, I'm not preaching fear at all, only reality.\n\n \n You are preaching fear. Your God is one of fear. Your beliefs are fear based. Any time a religion says do this, accept this, be this or God will throw you into hell to burn you forever, well that is fear based.\n \n The good news is that there is no hell and we are all saved, and here is the mind blower, we don't have to do anything, we don't have to accept anything, or be anything. God loves us so much that no matter what we do, who we are, or what we believe, He will bring us home as His beloved children, just as we are.", 
   {}, 
   295629, 
   null, 
   1199109060.0
  ], 
  [
   295660, 
   null, 
   "Penfold", 
   "Would you care to clarify what I said that implies a Damascene Conversion? Because I don't think you know what it means or else you wouldn't have attributed my statement that you quoted above to being one.\n\n \n Following hundreds of turgid regurgitations of dogma, you suddenly claim to preach the reality that \"Jesus doesn't exist\" and see no humour in that? I do. emoticon_rolleyes", 
   {}, 
   295640, 
   null, 
   1199109360.0
  ], 
  [
   295662, 
   null, 
   "Matthew S", 
   "Following hundreds of turgid regurgitations of dogma, you suddenly claim to preach the reality that \"Jesus doesn't exist\" and see no humour in that? I do. emoticon_rolleyes\n\n \n Oh good catch. I think that Archangel had a fuedian slip\n \n \nI'm here to tell Him that Jesus doesn't exist. So no, I'm not preaching fear at all, only reality.\n\n \n I think he ment to say \"I'm here to tell him that, that Jesus doesn't exist\" The way it is written Archangel is denying the existence of Jesus.", 
   {}, 
   295660, 
   null, 
   1199110140.0
  ], 
  [
   295664, 
   null, 
   "Archangel", 
   "Following hundreds of turgid regurgitations of dogma, you suddenly claim to preach the reality that \"Jesus doesn't exist\" and see no humour in that? I do. emoticon_rolleyes\n\n \n I didn't preach that Jesus doesn't exist at all. I preached that Matthew's imaginary version of Jesus doesn't exist. Tell me Penfold, what forum are you reading anyway, because it can't be this one. Here is the post in question...\n Matthew constantly claims to be a christian. Only His Christ is some imaginary pro gay figure who loves anyone, even if they never personally accept Him as their savior. I'm here to tell Him that Jesus doesn't exist. So no, I'm not preaching fear at all, only reality.\n Here is Matthews gospel in his own words. Read the paragraph at the bottom of the page for the gospel of MatthewS. http://www.4forums.com/political/showpost.php?p=295661&postcount=14", 
   {}, 
   295660, 
   null, 
   1199110500.0
  ], 
  [
   295665, 
   null, 
   "smiley", 
   "I didn't preach that Jesus doesn't exist at all. I preached that Matthew's imaginary version of Jesus doesn't exist. Tell me Penfold, what forum are you reading anyway, because it can't be this one. Here is the post in question...\n Matthew constantly claims to be a christian. Only His Christ is some imaginary pro gay figure who loves anyone, even if they never personally accept Him as their savior. I'm here to tell Him that Jesus doesn't exist. So no, I'm not preaching fear at all, only reality.\n\n \n The you should have said. 'I'm here to tell Him that that Jesus doesn't exist'. It would have been less ambiguous.\n \n I laughed.\n \n Smiley", 
   {}, 
   295664, 
   null, 
   1199111100.0
  ], 
  [
   295669, 
   null, 
   "Archangel", 
   "The you should have said. 'I'm here to tell Him that that Jesus doesn't exist'. It would have been less ambiguous.\n \n I laughed.\n \n Smiley\n\n \n I agree it could have been more clear, but anyone who would attempt to imply that I was denying Jesus ever existed, was attempting to promote a fallacious argument and is a dishonest person. EEEENNNNTERRRRR PENFOLD!!! :xbanghead", 
   {}, 
   295665, 
   null, 
   1199113080.0
  ], 
  [
   295670, 
   null, 
   "charlie horse", 
   "... and here is the mind blower, we don't have to do anything, we don't have to accept anything, or be anything. God loves us so much that no matter what we do, who we are, or what we believe, He will bring us home as His beloved children, just as we are.\n\n No point in Christ's sacrifice, then? And why have religion at all? You've just confirmed that the whole lot is barking nonsense.", 
   {}, 
   295659, 
   null, 
   1199114280.0
  ], 
  [
   295683, 
   null, 
   "Archangel", 
   "No point in Christ's sacrifice, then? And why have religion at all? You've just confirmed that the whole lot is barking nonsense.\n\n \n Exactly, God didn't take on the flesh of man and then die for our sins, He just felt like dying on the Cross for the sake of dying. (sarcasm) emoticon_rolleyes \n \n Matthew is unable to see that if personally receiving the gift of salvation through Christs sacrifice isn't necessary then His death is in vain. I know you don't BELIEVE it either charlie, but at least you understand the gospel well enough to get the point of how one claims to get saved.", 
   {}, 
   295670, 
   null, 
   1199124780.0
  ], 
  [
   295689, 
   null, 
   "Penfold", 
   "It's not as if it would hurt him, is it?", 
   {}, 
   295683, 
   null, 
   1199128080.0
  ], 
  [
   295690, 
   null, 
   "Jo Bennett", 
   "Exactly, God didn't take on the flesh of man and then die for our sins, He just felt like dying on the Cross for the sake of dying. (sarcasm) emoticon_rolleyes \n \n Matthew is unable to see that if personally receiving the gift of salvation through Christs sacrifice isn't necessary then His death is in vain. I know you don't BELIEVE it either charlie, but at least you understand the gospel well enough to get the point of how one claims to get saved.\n\n \n I don't see a logical connection between salvation being achieved through Christ's death and resurrection and that salvation being limited to only part of humanity. After all, the Bible says that Christ died once for all.", 
   {}, 
   295683, 
   null, 
   1199129880.0
  ], 
  [
   295694, 
   null, 
   "Archangel", 
   "I don't see a logical connection between salvation being achieved through Christ's death and resurrection and that salvation being limited to only part of humanity. After all, the Bible says that Christ died once for all.\n\n \n Here it is from the bible.\n Rom 6:1 What shall we say then? Are we to continue in sin so that grace may increase?\n Rom 6:2 May it never be! How shall we who died to sin still live in it?\n Rom 6:3 Or do you not know that all of us who have been baptized into Christ Jesus have been baptized into His death?\n Rom 6:4 Therefore we have been buried with Him through baptism into death, so that as Christ was raised from the dead through the glory of the Father, so we too might walk in newness of life.\n Rom 6:5 For if we have become united with {Him} in the likeness of His death, certainly we shall also be {in the likeness} of His resurrection,\n Rom 6:6 knowing this, that our old self was crucified with {Him,} in order that our body of sin might be done away with, so that we would no longer be slaves to sin;\n Rom 6:7 for he who has died is freed from sin.\n Rom 6:8 Now if we have died with Christ, we believe that we shall also live with Him,\n Rom 6:9 knowing that Christ, having been raised from the dead, is never to die again; death no longer is master over Him.\n Rom 6:10 For the death that He died, He died to sin once for all; but the life that He lives, He lives to God.\n Rom 6:11 Even so consider yourselves to be dead to sin, but alive to God in Christ Jesus.\n Rom 6:12 Therefore do not let sin reign in your mortal body so that you obey its lusts,\n Rom 6:13 and do not go on presenting the members of your body to sin {as} instruments of unrighteousness; but present yourselves to God as those alive from the dead, and your members {as} instruments of righteousness to God.\n \n Rom 6:23 For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.\n \n Hbr 9:15 For this reason He is the mediator of a new covenant, so that, since a death has taken place for the redemption of the transgressions that were {committed} under the first covenant, those who have been called may receive the promise of the eternal inheritance.\n Notice in verse 23 it say's free gift. A free gift can be offered, must it not also be accepted to be received? So it is with the free gift of salvation.", 
   {}, 
   295690, 
   null, 
   1199133780.0
  ], 
  [
   295712, 
   null, 
   "Matthew S", 
   "I don't see a logical connection between salvation being achieved through Christ's death and resurrection and that salvation being limited to only part of humanity. After all, the Bible says that Christ died once for all.\n\n \n Exactly! He destroyed hell and though His sacifice all are saved wether they make the choice or not. All will be brought home wether theyu believe or not. No one has to do anything, accept anything it has allready been done. It is a gift freely given to all humanity though the cross.", 
   {}, 
   295690, 
   null, 
   1199157600.0
  ], 
  [
   295720, 
   null, 
   "Bassman", 
   "I don't see a logical connection between salvation being achieved through Christ's death and resurrection and that salvation being limited to only part of humanity. After all, the Bible says that Christ died once for all.\nNo, Jo. The plan of salvation is available to all, but all will not receive. Remember, in Revelations, where you have the vast majority of the population receiving the mark of the beast, they reject christ and are cast into the lake of fire.", 
   {}, 
   295690, 
   null, 
   1199159880.0
  ], 
  [
   295722, 
   null, 
   "Zardoz", 
   "Exactly! He destroyed hell and though His sacifice all are saved wether they make the choice or not. All will be brought home wether theyu believe or not. No one has to do anything, accept anything it has allready been done. It is a gift freely given to all humanity though the cross.\n\n \n That's not what the bible repeatedly states or even implies.\n \n Countless verses from the favorite John 3:16 on (for God so loved the world that all who believe shall not perish but know ever lasting life) oppose your belief system.\n \n You have to believe.\n You have to accept the gift.\n Not all who are called.\n Many who proclaim they are 'Christians' will NOT be known by Jesus.\n Not All have their names writen in the book of life.\n All will also be judged by their ACTIONS after being judged on their acceptance of Christ.\n \n Sorry, Arch is correct here.\n You can strip a lot out of the Christian bible and call yourselves Christians but, that don't mean you are. \n You can even have a belief system more favorable to those of us in the secular world but, all I see is another 'made up' belief system that's not worth my time following. If it brings you comfort, wonderful. But all I see is a crutch of your own design. You'd be much better off IMO not wasting your time with ear ticklers. As it stands, all I can think is that you get a much needed sense of community and outlet for doing charitable deeds that's often hard to find in the atheistic community. I could be wrong though.\n \n But as said, there's no reason for most of us to waste time fellowshipping with you or doing anything that our selfish hearts don't desire since we'll be sitting next to you in your version of heaven.\n \n I'm reminded of the Jehovah's Witness lady who spent 2 years talking to my fundy wife. She pushed the notion that the lake of fire would utterly consume the souls of those of us who were damned. \n I don't know why she was horrified when she found out that I thought that such a belief was 'neato!'\n I mean, seriously, what's to fear about a few moments of possible suffering and then utter oblivion?", 
   {}, 
   295712, 
   null, 
   1199161500.0
  ], 
  [
   295731, 
   null, 
   "Matthew S", 
   "That's not what the bible repeatedly states or even implies.\n \n Countless verses from the favorite John 3:16 on (for God so loved the world that all who believe shall not perish but know ever lasting life) oppose your belief system.\n \n You have to believe.\n You have to accept the gift.\n Not all who are called.\n Many who proclaim they are 'Christians' will NOT be known by Jesus.\n Not All have their names writen in the book of life.\n All will also be judged by their ACTIONS after being judged on their acceptance of Christ.\n \n Sorry, Arch is correct here.\n You can strip a lot out of the Christian bible and call yourselves Christians but, that don't mean you are. \n You can even have a belief system more favorable to those of us in the secular world but, all I see is another 'made up' belief system that's not worth my time following. If it brings you comfort, wonderful. But all I see is a crutch of your own design. You'd be much better off IMO not wasting your time with ear ticklers. As it stands, all I can think is that you get a much needed sense of community and outlet for doing charitable deeds that's often hard to find in the atheistic community. I could be wrong though.\n \n But as said, there's no reason for most of us to waste time fellowshipping with you or doing anything that our selfish hearts don't desire since we'll be sitting next to you in your version of heaven.\n \n I'm reminded of the Jehovah's Witness lady who spent 2 years talking to my fundy wife. She pushed the notion that the lake of fire would utterly consume the souls of those of us who were damned. \n I don't know why she was horrified when she found out that I thought that such a belief was 'neato!'\n I mean, seriously, what's to fear about a few moments of possible suffering and then utter oblivion?\n\n \n The bible is not to be taken literally. The bible only tells Gods story it is nota rule book set in stone. See to me God is a loving father who would not burn or kill His children no matter what they have done, say, believe, or are. It is sad that Archangel lives in fear of a God who has to threaten to kill His children for the littlest infraction.", 
   {}, 
   295722, 
   null, 
   1199174040.0
  ], 
  [
   295732, 
   null, 
   "Archangel", 
   "The bible is not to be taken literally. The bible only tells Gods story it is nota rule book set in stone. See to me God is a loving father who would not burn or kill His children no matter what they have done, say, believe, or are. It is sad that Archangel lives in fear of a God who has to threaten to kill His children for the littlest infraction.\n\n \n You're absolutely right that God doesn't burn or kill His children Matt, and stop lying and saying that is what I believe or promote at all, or that I live in fear of my heavenly father, because I don't. SO GET A LIFE AND STOP LYING ABOUT MINE, YOU HEAR ME? YOU HAVE NO RIGHT TO SPEAK ABOUT WHAT IS GOING ON IN MY HEART AND SOUL!!! \n \n What you fail to grasp infinitum, is that those like you who reject Gods free gift of salvation will be condemning themselves to separation from Him. It isn't God who is rejecting and condemning you Matt, it is you who is rejecting God and condemning yourself. That is the reality of what you will learn if you fail to accept the free gift of salvation that Christ accomplished on the Cross for you specifically with His shed blood and death for your sins.", 
   {}, 
   295731, 
   null, 
   1199175120.0
  ], 
  [
   295736, 
   null, 
   "electrolyte", 
   "You're absolutely right that God doesn't burn or kill His children Matt,\n\n You're both wrong, if the Bible is to be believed. Need I remind everybody of the cleansing flood?\n \n \nSO GET A LIFE AND STOP LYING ABOUT MINE, YOU HEAR ME? YOU HAVE NO RIGHT TO SPEAK ABOUT WHAT IS GOING ON IN MY HEART AND SOUL!!!\n\n But you are justified in telling me that I'm an evil, condemnable, \"sanctimonious putz\" because I make you look so foolish that you have to put me on ignore so that you don't feel like a XXXXX every time you read a thread? What gives you the right to speak about how I must be amoral because I reject your God when Matthew doesn't have the right to speak about what you think and believe?\n \n The answers are no and nothing. You're just a hypocrite. Your willful ignorance is matched only by your denial.", 
   {}, 
   295732, 
   null, 
   1199175900.0
  ], 
  [
   295737, 
   null, 
   "Bradamante", 
   "But this does tend to suggest that, if there is a disagreement, then the husband's choice overrules that of his wife.\n \n This simply doesn't stand up in today's 'equal' society (I'm not saying that today's society really is equal).\n \n Smiley\n\n \n We can always have a household where everyone votes. Children get to vote on what they want for dinner.", 
   {}, 
   295525, 
   null, 
   1199183280.0
  ], 
  [
   295759, 
   null, 
   "Zardoz", 
   "The bible is not to be taken literally. The bible only tells Gods story it is nota rule book set in stone. See to me God is a loving father who would not burn or kill His children no matter what they have done, say, believe, or are. It is sad that Archangel lives in fear of a God who has to threaten to kill His children for the littlest infraction.\n\n \n Seems to me that according to the message pushed by you that the bible is not even to be taken figuratively either. \n \n I could understand your belief system if you used a different framework to base it upon. It'd have some internal consistancy.\n But, to take the already established Christian bible and extrapolate that it means something different that what's stated, clearly and implicitly, doesn't seem rational or even healthy.\n \n It just seems to me that if you have an idea of what God's like, you'd have better documentation to support such a belief. Using the Christian bible as it is doesn't make sense to me.", 
   {}, 
   295731, 
   null, 
   1199218020.0
  ], 
  [
   295762, 
   null, 
   "Matthew S", 
   "\n \n It just seems to me that if you have an idea of what God's like, you'd have better documentation to support such a belief. Using the Christian bible as it is doesn't make sense to me.\n\n \n Isn't that what faith and belief is all about? Faith does not require proof, support, or documentation.", 
   {}, 
   295759, 
   null, 
   1199219100.0
  ], 
  [
   295763, 
   null, 
   "Penfold", 
   "\"Faith is believing what you know ain't so.\" Mark Twain. emoticon_xagree", 
   {}, 
   295762, 
   null, 
   1199219700.0
  ], 
  [
   295766, 
   null, 
   "jyoshu", 
   "We can always have a household where everyone votes. Children get to vote on what they want for dinner.\n\n \n Heh. Considering all the women out there who tend to defer to their husbands by default, apparently not all women see marriage the way critics of the Bible do. Sure, there are a lot of bad husbands out there, and that's just as un-Biblical as anything. But I don't recall ever seeing a marriage that was truly democratic and equal in terms of the husband and wife--someone almost always ends up 'wearing the pants' in the family. (And sometimes it's the wife.) But this observation begs the question that, if such is the case, then what's WRONG with a marriage where the wife defers to the husband?\n \n I think this is something that nobody ever really discusses much because it's become so non-politically correct to do so, but from my observations most marriages do involve the husband having the final say on things. I'm not making a value judgment on that; just noting observation. It seems there are a lot of women out there who prefer it that way. Part of that may be that men tend to marry wives more that aren't dominant in personality, and so that deference to the husband just tends to happen by default as a result of personalities.", 
   {}, 
   295737, 
   null, 
   1199220060.0
  ], 
  [
   295801, 
   null, 
   "Zardoz", 
   "Isn't that what faith and belief is all about? Faith does not require proof, support, or documentation.\n\n \n I'm not attacking your faith or beliefs, I'm questioning the logic of using a known work (the Christian) bible, and then turning around and stating you don't believe in a huge chunk of what it states.\n \n Why not simply write a new book and claim the old one was perverted and lead to wrong conclusions (which is what the Jehovah's Witnesses did). Or, 'find' a new companion work that clarifies what the bible means (like what the Mormons did).\n \n I see your faith akin to someone stating:\n The Roman Empire was the most awsome thing that ever existed.\n Except that they had blood sports, and an emperor, taxes, an army bent on conquest, was based in the underbelly of the wonderful continent of Europe (really, who'd want to live in Italy, it smells there and the weather is foul), their clothing was horrendous and lacked any fashion sense, etc, etc, etc...\n \n To me, it seems like you're simply clinging to some vestige of Christianity as one would 'hide in the closet'. Afraid to find a more compatable faith that would suit you're actual beliefs.\n \n Faith should require some reason for having it.\n \n As I said, the only thing I can think of would be a sense of community, an outlet for charity and the ability to 'hide' in a bigoted Christian culture by claiming to be one too.\n \n My use of documentation may have been misunderstood.\n By it I mean, your 'bible' should be clear on where gays stand...not be riddled with verse on how wrong it is.\n It's like a black person joining the KKK.\n \n Makes nooo sense.", 
   {}, 
   295762, 
   null, 
   1199251860.0
  ], 
  [
   295803, 
   null, 
   "Zardoz", 
   "Heh. Considering all the women out there who tend to defer to their husbands by default, apparently not all women see marriage the way critics of the Bible do. Sure, there are a lot of bad husbands out there, and that's just as un-Biblical as anything. But I don't recall ever seeing a marriage that was truly democratic and equal in terms of the husband and wife--someone almost always ends up 'wearing the pants' in the family. (And sometimes it's the wife.) But this observation begs the question that, if such is the case, then what's WRONG with a marriage where the wife defers to the husband?\n \n I think this is something that nobody ever really discusses much because it's become so non-politically correct to do so, but from my observations most marriages do involve the husband having the final say on things. I'm not making a value judgment on that; just noting observation. It seems there are a lot of women out there who prefer it that way. Part of that may be that men tend to marry wives more that aren't dominant in personality, and so that deference to the husband just tends to happen by default as a result of personalities.\n\n \n I think I'd agree.\n IIRC, most relationship experts state that most marriages are about 49/51 or more out of balance with someone being more dominant that the other. \n Areas of responsibility should be outlined and accepted by both parties hoefully based upon who's best at what subject.", 
   {}, 
   295766, 
   null, 
   1199252340.0
  ], 
  [
   295807, 
   null, 
   "Bradamante", 
   "\"Faith is believing what you know ain't so.\" Mark Twain. emoticon_xagree\n\n \n Ah, the wisdom of fiction writers. Next you'll be quoting the great philosophy of pop musicians!", 
   {}, 
   295763, 
   null, 
   1199253540.0
  ], 
  [
   295930, 
   null, 
   "Penfold", 
   "From the mouths of babes and fools shall man learn wisdom. (Present company excepted)", 
   {}, 
   295807, 
   null, 
   1199371140.0
  ], 
  [
   295932, 
   null, 
   "charlie horse", 
   "The bible is not to be taken literally. The bible only tells Gods story it is nota rule book set in stone. See to me God is a loving father who would not burn or kill His children no matter what they have done, say, believe, or are...\n\n Excuse me, Matt S, but this is clearly religion and faith on your own terms, not your God's.\n \n If the bible is not to be taken literally (and you didn't qualify any part - therefore the whole), then the whole lot is allegory, fable, and every other sort of fiction. From that you deduce a god on which you bend your life. If the bible is not to be taken literally, then Christ never existed other than as a metaphor, and, inter alia, neither does your god exist.\n \n You can't claim to have a religious faith based on the bible, and then interpret the bible to suit your own ends. Your case in point is that your god will accept you no matter what you do or are. In other words, there is no biblical moral standard constraining your actions. That is sheer hypocrisy.\n \n I can only conclude that you didn't really mean to say what you did, i.e. without qualification.", 
   {}, 
   295731, 
   null, 
   1199374200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bible literalist", 
  "url": "http://www.4forums.com/political/religion-debates/10759-bible-literalist.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10759, 
  "discussion_files": [
   [
    "13630.html", 
    "http://www.4forums.com/political/religion-debates/10759-bible-literalist-print.html"
   ], 
   [
    "13631.html", 
    "http://www.4forums.com/political/religion-debates/10759-bible-literalist-5-print.html"
   ], 
   [
    "13632.html", 
    "http://www.4forums.com/political/religion-debates/10759-bible-literalist-4-print.html"
   ], 
   [
    "13633.html", 
    "http://www.4forums.com/political/religion-debates/10759-bible-literalist-3-print.html"
   ], 
   [
    "13634.html", 
    "http://www.4forums.com/political/religion-debates/10759-bible-literalist-2-print.html"
   ]
  ], 
  "identifier": 10759
 }
]