[
 [
  [
   295826, 
   null, 
   "Neanderthal79", 
   "I posted this in another thread as a reply, but I wanted to see what more people thought about it.\n \n I was just thinking about this the other day. We live in a country where a person can not get elected president if they openly doubt the existence of heaven and hell. This is remarkable, given that there is no other body of 'knowledge' that we require our political leaders to master. Even a hairstylist must pass a licensing exam before plying their trade in the U.S., and yet those given the power to make war and national policy, those whose decisions will affect life for generations, are not expected to know anything in particular before setting to work.\n \n They do not have to be political scientists, economists, or even lawyers; they need not have studied international relations, military history, resource management, civil engineering, or any other field of knowledge that one might need in the governance of a modern superpower. They need only be expert fund-raisers, carry themselves well on television, and believe certain myths. \n \n In a U.S. election, an actor who reads his bible would certainly defeat a rocket scientist or a successful civil engineer who does not.", 
   {
    "post_info": {
     "post_title": "Religious Election"
    }
   }, 
   null, 
   null, 
   1199294040.0
  ], 
  [
   295836, 
   null, 
   "jitobear", 
   "You are right. I would love to see the American public consider their president they way the would any other job candidate. In the secualr world - using religious belief as any kind of guideline is illegal. Instead we should be considering their stance on issues and their education and work experience in relevant fields (law, economics, politics, public relations, communications skills, etc.).\n \n Things like religion, marriage status, fidelity, sex-life, how hard they partied in college, etc. should frankly be none of our business.", 
   {}, 
   295826, 
   null, 
   1199297100.0
  ], 
  [
   295842, 
   null, 
   "charlie horse", 
   "What would happen to the American Dream if one had to demonstrate some sort of qualification or expertise to be President? The same could be asked of UK politicians, of course.\n \n It would keep out a lot of numpties, but then usually it's only numpties that are fit for the job.", 
   {}, 
   295836, 
   null, 
   1199298420.0
  ], 
  [
   295851, 
   null, 
   "billsco", 
   "The religious test for presidential candidates is another piece of evidence that strongly supports my contention that the real activism in today's society has come from the religious community.\n \n Several of our early presidents, as well as Lincoln, would never be electable in today's climate due to their failure to pass this obscene test.\n \n Yet what is it we hear day in and day out? How liberal atheist activists have destroyed this country and we need to \"take it back\". Some people need a basic history lesson, after a swift kick in the XXX.", 
   {}, 
   295842, 
   null, 
   1199302020.0
  ], 
  [
   295858, 
   null, 
   "Big_Bear_Scot", 
   "In the UK we recently had Tony Blair give an interview to say that he was afraid to mention that he was a religious man when he was contesting elections. He said this was because the British Electorate would consider him a nutter(or nuts for all you non-UK people out there). :)\n \n http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2007/11/25/nblair125.xml\n \n To me I wouldn't view someone as nuts if they declared that they believed in God, but we are bit more reserved about our religious beliefs. We tend to view it as a very private matter and if we see someone proclaiming their religion from the rooftops we tend to get a bit uncomfortable. \n \n Also the new Leader of the Liberal Democrat Party(3rd Largest in the UK) stated that he doesn't believe in God.\n \n http://news.bbc.co.uk/1/hi/uk_politics/7151346.stm\n \n I am afraid I couldn't see the leader of any of the main parties in the US come out as an Atheist, he would probably never get elected.", 
   {}, 
   295851, 
   null, 
   1199306580.0
  ], 
  [
   295860, 
   null, 
   "Neanderthal79", 
   "What would happen to the American Dream if one had to demonstrate some sort of qualification or expertise to be President? The same could be asked of UK politicians, of course.\n \n It would keep out a lot of numpties, but then usually it's only numpties that are fit for the job.\n\n \n That's right. The old saying in the U.S. is, \"Anyone can be president\". That's the problem. \"Anyone\" couldn't be a surgeon, you need certain skills.", 
   {}, 
   295842, 
   null, 
   1199307780.0
  ], 
  [
   295861, 
   null, 
   "jyoshu", 
   "In the UK we recently had Tony Blair give an interview to say that he was afraid to mention that he was a religious man when he was contesting elections. He said this was because the British Electorate would consider him a nutter(or nuts for all you non-UK people out there). :)\n \n http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2007/11/25/nblair125.xml\n \n To me I wouldn't view someone as nuts if they declared that they believed in God, but we are bit more reserved about our religious beliefs. We tend to view it as a very private matter and if we see someone proclaiming their religion from the rooftops we tend to get a bit uncomfortable.\n\n \n Interesting. To me I think it's sorta sad that someone would feel they couldn't mention they were religious. I think it's a case of two extremes--perhaps the UK is a bit too 'reserved' in terms of religion, and the US isn't 'reserved' enough.\n \n \nI am afraid I couldn't see the leader of any of the main parties in the US come out as an Atheist, he would probably never get elected.\n\n \n Definitely not. It would certainly ensure they would not get elected. Some people seem to think that's a terrible thing, but I don't see it any differently than any case of a candidate being out of touch with the electorate, on any given major issue. Most Americans are religious, so naturally they'd like a president who can identify with that. Religiosity is engrained in the U.S.; it's a large part of the reason the country was even founded in the first place: for religious freedom.", 
   {}, 
   295858, 
   null, 
   1199307900.0
  ], 
  [
   295864, 
   null, 
   "Neanderthal79", 
   "\n Definitely not. It would certainly ensure they would not get elected. Some people seem to think that's a terrible thing, but I don't see it any differently than any case of a candidate being out of touch with the electorate, on any given major issue. Most Americans are religious, so naturally they'd like a president who can identify with that. Religiosity is engrained in the U.S.; it's a large part of the reason the country was even founded in the first place: for religious freedom.\n\n \n Would you be comfortable electing a president who openly worshipped Zeus. No, you would think he's a nutjob. That's how I view our current candidates.\n What about a scientologist?", 
   {}, 
   295861, 
   null, 
   1199309340.0
  ], 
  [
   295870, 
   null, 
   "thelmoose", 
   "Some people seem to think that's a terrible thing, but I don't see it any differently than any case of a candidate being out of touch with the electorate, on any given major issue. Most Americans are religious, so naturally they'd like a president who can identify with that. Religiosity is engrained in the U.S.; it's a large part of the reason the country was even founded in the first place: for religious freedom.\n\n \n \n One does not have to have religion to understand religion. There are already many atheists in government. They must fake their own religiosity. \n \n Moreover, there have been many upper class wealthy politicians who claim to understand the issues of the lower class or working class and we readily believe them, even though we are very aware of their background. GW is a case in point. He is a prep school, frat boy, rich-daddy-bail-me-out New England elitester if there ever was one, yet the \"common man\" rushes to him because he tells them what they want to hear.\n \n We simply place too much importance on religion in this country.", 
   {}, 
   295861, 
   null, 
   1199312820.0
  ], 
  [
   295872, 
   null, 
   "electrolyte", 
   "There are already many atheists in government. They must fake their own religiosity.\n\n Why must they do this? To prevent discrimination by the religious.\n \n This is why all people claiming that Christianity is being subverted in politics need to be smacked upside the head.\n \n \n \nTo me I think it's sorta sad that someone would feel they couldn't mention they were religious.\n\n Does that work the other way around? I am a state employee and am afraid to tell anybody that I'm not religious for fear of being \"replaced.\"", 
   {}, 
   295870, 
   null, 
   1199315220.0
  ], 
  [
   295873, 
   null, 
   "jyoshu", 
   "One does not have to have religion to understand religion. There are already many atheists in government. They must fake their own religiosity.\n \n \n That's not what I mean. It's simply a matter of people voting their conscience--people tend to vote for people they identify with (or at least think they do) and that they think are like-minded in terms of values and things they view as important. Sorry, but you just can't convince me that an atheist is going to view religion as importantly as a religious person.", 
   {}, 
   295870, 
   null, 
   1199315280.0
  ], 
  [
   295874, 
   null, 
   "jyoshu", 
   "Would you be comfortable electing a president who openly worshipped Zeus. No, you would think he's a nutjob. That's how I view our current candidates.\n What about a scientologist?\n\n \n well, if you're entitled to think negatively about openly religious candidates, then why are religious people not equally entitled to think of an atheist candidate as such and therefore not vote for them? Frankly, if you view openly religious people as nutcases, then you're very much out of touch with most people in this country, IMO.", 
   {}, 
   295864, 
   null, 
   1199315400.0
  ], 
  [
   295875, 
   null, 
   "electrolyte", 
   "Sorry, but you just can't convince me that an atheist is going to view religion as importantly as a religious person.\n\n I'm not sure what you're saying here, jyoshu.\n \n As a non-religious person, I recognize the power that religion has on people and their beliefs and desires. As a non-religious person, I know that a person's having the right to worship (or not) should not be restricted. What I don't acknowledge is that religious beliefs have any necessary correlation with good or virtuous ideas.\n \n Is this what you're trying to get at, or did you have something else in mind?", 
   {}, 
   295873, 
   null, 
   1199316180.0
  ], 
  [
   295878, 
   null, 
   "thelmoose", 
   "That's not what I mean. It's simply a matter of people voting their conscience--people tend to vote for people they identify with (or at least think they do) and that they think are like-minded in terms of values and things they view as important. Sorry, but you just can't convince me that an atheist is going to view religion as importantly as a religious person.\n\n \n And that is the problem.\n \n Many religious assume that they hold unique values and that is comes solely from religion. These types assume that others who think differently in their personal lives can't relate to the religious constituent. Perhaps this comes from their own inability to relate to others who think differently than they.\n \n It doesn't matter if an atheist views religion as less important in their personal lives as a religious person. A leader can and must occasionally set aside personal beliefs for the good of the constituency. And again, this is true about many things in addition to religion which you ignored from my previous post. \n \n Again, too much importance is place on religion in this country. One may place one's personal religious beliefs as paramount in one's life. But when there are hundreds of religious paths to follow, you can't expect the next fellow to believe similarly. Likewise, the myth that morality and integrity can only come from religious is pervasive and divisive.", 
   {}, 
   295873, 
   null, 
   1199317080.0
  ], 
  [
   295883, 
   null, 
   "MrWriteLA", 
   "The \"no religious test\" clause of the United States Constitution is found in Article VI, section 3, and states that:\n\" ...no religious test shall ever be required as a qualification to any office or public trust under the United States. \n Of course, in practicality, there are too many religious \"nutters\" in this country to ever vote for someone who doesn't pass their own religious test.", 
   {
    "unicode_changes_made": true
   }, 
   295878, 
   null, 
   1199322240.0
  ], 
  [
   295884, 
   null, 
   "MrWriteLA", 
   "Many religious assume that they hold unique values and that is comes solely from religion. \nUnfortunate but true. Some who post on these very forums apparently believe that if an invisible sky pixie hadn't (allegedly) said \"Killing and thievery are wrong, just because I SAY SO!\" we never would have figured out for ourselves that there was anything bad about them and would be going around murdering and robbing each other blind like psychotic 2-year-olds. Makes one wonder how the species was able to survive all those pre-Judeo-Christian eons, doesn't it?", 
   {}, 
   295878, 
   null, 
   1199322600.0
  ], 
  [
   295891, 
   null, 
   "jyoshu", 
   "Many religious assume that they hold unique values and that is comes solely from religion. These types assume that others who think differently in their personal lives can't relate to the religious constituent. Perhaps this comes from their own inability to relate to others who think differently than they.\n\n \n So how does a person who doesn't believe in God relate to people who believe in God? Can someone who doesn't pray and thinks it's ridiculous seriously relate to things like praying and going to church regularly? I'm sorry, but I don't see how an atheist could reasonably claim to do that.\n \n \nIt doesn't matter if an atheist views religion as less important in their personal lives as a religious person. A leader can and must occasionally set aside personal beliefs for the good of the constituency. And again, this is true about many things in addition to religion which you ignored from my previous post. Again, too much importance is place on religion in this country.\n\n \n My point is simply that people vote what resonates with them. It's the same reason you'd probably more likely vote for a pure atheist rationalist than a preachy evangelical. It's the same reason conservatives tend to vote for the more conservative candidate than the other in a two party race, and liberal voters tend to vote for the more liberal candidate than the other in a two part race. Maybe too much importance IS placed on religion here, but that's probably going to come with the territory in a country that has deep religious roots and was founded in large part because people wanted freedom to be religious. What are you going to do--tell people not to vote their consciences, and pretend they aren't religious people the instant they walk inside a voting booth?", 
   {}, 
   295878, 
   null, 
   1199330340.0
  ], 
  [
   295892, 
   null, 
   "jyoshu", 
   "Is this what you're trying to get at, or did you have something else in mind?\n\n \n I'm just saying that people tend to vote for people they think fit their values and areas of importance. And so people are naturally going to vote for a candidate they think best understands and identifies with their position. Since there are a lot of religious people in this country, religious people are generally going to be favored voting-wise. When a given ideology is by far the most prevalent, you can't reasonably expect a far-LESS prevalent ideology to win in an election.", 
   {}, 
   295875, 
   null, 
   1199331120.0
  ], 
  [
   295899, 
   null, 
   "electrolyte", 
   "I'm just saying that people tend to vote for people they think fit their values and areas of importance. And so people are naturally going to vote for a candidate they think best understands and identifies with their position. Since there are a lot of religious people in this country, religious people are generally going to be favored voting-wise. When a given ideology is by far the most prevalent, you can't reasonably expect a far-LESS prevalent ideology to win in an election.\n\n Your statements are correct, even though that's really not what I thought you were getting at.\n \n Consider this, though: I was raised in a conservative (but not religious) home and share some viewpoints that are traditionally conservative. Not to imply that an inordinate number of conservatives would like my overall stance if I were a politician, but it's not only unfair but also downright inaccurate to assume that atheism defines the majority of my positions. In fact -- in my opinion -- the only areas of importance on which one could automatically assume I differ are those that have no place in public office.\n \n In other words, go by issues, not religion. Making religion an issue is pretty much a shallow appeal to the religious and is really a sidestep of the more important political issues.", 
   {}, 
   295892, 
   null, 
   1199336940.0
  ], 
  [
   295919, 
   null, 
   "lesz", 
   "So how does a person who doesn't believe in God relate to people who believe in God? Can someone who doesn't pray and thinks it's ridiculous seriously relate to things like praying and going to church regularly? I'm sorry, but I don't see how an atheist could reasonably claim to do that.\n\n \n It's probably true that many atheists can't \"relate\" to god-worship. After all, they probably gave it up because it made little sense to them. However, even god-worshippers mostly have lives beyond their church communities. Surely everyone can \"relate\" to common human traits and needs?\n \n \nMy point is simply that people vote what resonates with them. It's the same reason you'd probably more likely vote for a pure atheist rationalist than a preachy evangelical. It's the same reason conservatives tend to vote for the more conservative candidate than the other in a two party race, and liberal voters tend to vote for the more liberal candidate than the other in a two part race. Maybe too much importance IS placed on religion here, but that's probably going to come with the territory in a country that has deep religious roots and was founded in large part because people wanted freedom to be religious. What are you going to do--tell people not to vote their consciences, and pretend they aren't religious people the instant they walk inside a voting booth?\n\n \n Well, we atheists vote our consciences too, but we don't judge candidates solely on their religious beliefs, so long as we have confidence they won't try to legislate their religion.", 
   {}, 
   295891, 
   null, 
   1199361240.0
  ], 
  [
   295922, 
   null, 
   "Big_Bear_Scot", 
   "\n Interesting. To me I think it's sorta sad that someone would feel they couldn't mention they were religious. I think it's a case of two extremes--perhaps the UK is a bit too 'reserved' in terms of religion, and the US isn't 'reserved' enough.\n\n \n I can not speak for all my fellow Scots but I tend to view those who(especially politicians) proclaim their religious devotions from the roof tops with suspicion. I feel it is a case of 'The lady doth protest too much, methinks' and that person does not really follow the faith but uses it to appear in a better light. \n \n I also guess it is a cultural thing I view faith(or lack of it) as a private matter and I would imagine many Scots would feel the same.\n \n \nSo how does a person who doesn't believe in God relate to people who believe in God? Can someone who doesn't pray and thinks it's ridiculous seriously relate to things like praying and going to church regularly? I'm sorry, but I don't see how an atheist could reasonably claim to do that.\n\n \n I can not speak for all Atheists but I could relate to a person who believes in God. After all I was brought by a religious family, I went to Church and Sunday School for 12 years. I believe this would be fairly typical for all Atheists, also I have many friends who are religious and I for one can understand their faith.", 
   {}, 
   295883, 
   null, 
   1199363940.0
  ], 
  [
   295976, 
   null, 
   "Ripskar", 
   "In Wales the factor is, \"how absurdly nationalistic can you sound\" \n eg. Cardiff has decreed that all Welsh medical services will provided in Wales, regardless of whether there is the capacity to meet those needs.\n So we now have people unable to get treatment locally as most resources are concentrated in the south, and a 20 mile trip to Liverpool becomes a 200 mile trip to Swansea.\n As far as religion is concerned in the UK, Ulster obviously has it's own rules, Blair made a huge gaff suggesting that Iraq was the will of God.\n I think the bench mark is people who start attributing things to religious factors, eg. Bishop of Carlsile: \"Floods in Sheffield are due to homosexuality in Brighton\" Various: \"Aids/Crime/Vandalism/Foot & Mouth is due to decline in church-going\"\n Make any of those statements or similar and I would classify you as a nut-job.\n Those that, like the Royals, simply attend church on Sunday and Weddings/Funerals/misc. occaisions wouldn't get that classification.", 
   {}, 
   295922, 
   null, 
   1199391000.0
  ], 
  [
   295979, 
   null, 
   "Jo Bennett", 
   "I'm pretty sure all of those statements are tabloid travesties of what was actually intended. Certainly the Bishop of Carlisle was talking about climate change, not homosexuality, and was pointing out that sinful actions are generally linked to negative consequences in this life.\n \n Blair said God would judge him for Iraq. He never claimed, as Bush has done, that God told him to do it, or it was God's will.", 
   {}, 
   295976, 
   null, 
   1199392020.0
  ], 
  [
   295989, 
   null, 
   "lesz", 
   "I'm pretty sure all of those statements are tabloid travesties of what was actually intended. Certainly the Bishop of Carlisle was talking about climate change, not homosexuality, and was pointing out that sinful actions are generally linked to negative consequences in this life.\n \n Blair said God would judge him for Iraq. He never claimed, as Bush has done, that God told him to do it, or it was God's will.\n\n \n It doesn't get the good bish of the hook. Even the prevarications of the Church Times don't really help him:\n \n \nThe Bishop of Carlisle, the Rt Revd Graham Dow, is quoted in The Sunday Telegraph as saying: \"We are reaping the consequences of our moral degradation, as well as the environmental damage that we have caused.\" It was his apparent linking of moral degradation with homosexuality that drew the most condemnation.\n \n Bishop Dow's spokesman, Canon Dr Richard Pratt, sought to clarify what the Bishop had said, in a statement issued on Sunday. \"The Bishop of Carlisle did not say that God 'sent' the floods. He and the Bishop of Liverpool did point out what environmental campaigners have been saying for years: that the floods are a consequence of global warming, which is a lack of restraint and lack of care for our planet.\"\n \n Canon Pratt said that Bishop Dow had been misquoted. \"What Graham is saying is that our behaviour is all of a whole: it isn't appropriate to separate out different bits. Our lack of respect towards the environment is mirrored in our lack of respect for each other and towards God,\" he said. \"There's a natural way in which one can understand that the floods are a consequence of human behaviour via the release of carbon dioxide and global warming, but when one is interpreting the floods to see what God is saying to us, we might want to remember that all our behaviour needs to change.\"\n \n The Bishop of Liverpool, the Rt Revd James Jones, told The Sunday Telegraph that floods were no longer seen as an \"act of God\". He went on to say: \"However, we are now reaping what we have sown. If we live in a profligate way, there are going to be consequences.\"\n \n But Bishop Jones later took issue with a Daily Mail headline: \"Floods are God's vengeance for our sins, warns bishop\". He said in a statement on Tuesday: \"When people lose their lives, others their homes and livelihoods, it is important pastorally to say that the disaster is not a judgment of God on them.\n \n \"That is why I refused to use the language of judgment. God has created a world of cause and effect. If we change the climate through profligate use of carbon, it is we who bring upon ourselves and others the consequences of reaping what we sow.\"\n\n \n IOW, homosexual behaviour is just as evil as destroying our environment, and therefore is as much at fault for all the ills that beset us.\n \n Maybe the good bish can find common cause with Pope Maledict who now evidently sees a desperate Roman Catholic need for more exorcists. It's possession by the devil that must be causing gay marriage, moral decay and hence global warming.", 
   {
    "unicode_changes_made": true
   }, 
   295979, 
   null, 
   1199398320.0
  ], 
  [
   295990, 
   null, 
   "thelmoose", 
   " So how does a person who doesn't believe in God relate to people who believe in God? Can someone who doesn't pray and thinks it's ridiculous seriously relate to things like praying and going to church regularly? I'm sorry, but I don't see how an atheist could reasonably claim to do that.\n\n \n Yes. An atheist can easily relate to a religious person and all his religious ideas and behaviors. We do it all the time. We have done so our entire lives.\n \n For God sake, if I dismissed all believers as persons I could not take seriously, I would not be able to get along with very many people, now could I?\n \n That is an absurd assertion.\n Where do you get these silly ideas about atheists??\n \n \n \n \n \n My point is simply that people vote what resonates with them. It's the same reason you'd probably more likely vote for a pure atheist rationalist than a preachy evangelical. It's the same reason conservatives tend to vote for the more conservative candidate than the other in a two party race, and liberal voters tend to vote for the more liberal candidate than the other in a two part race. Maybe too much importance IS placed on religion here, but that's probably going to come with the territory in a country that has deep religious roots and was founded in large part because people wanted freedom to be religious. What are you going to do--tell people not to vote their consciences, and pretend they aren't religious people the instant they walk inside a voting booth? \n \n \n I would vote for anyone whom I think will do the job well, regardless of religious convictions or any other personal attributes he might have.\n \n A conservative/liberal votes for someone who has compatible political ideas. \n \n The problem here is again, the idea that morality, integrity or even competence can only come from religion. \n \n Also, the umbrella term of \"religion\" is extremely broad and encompasses a huge spectrum of thought, most of which are similar if not identical with what an atheistic might agree with. \n \n Having the freedom to be religious can and should be fervently supported by an atheistic as well as a believer. Being religious inside or outside the voting booth should have nothing to do with judging who is the best candidate. Using religiosity as a litmus test is foolish and narrow-minded. We also have no idea how religious a person is. \n \n I know persons who think George Bush is a good President SOLELY because he professes to be a religious person. That makes no sense.", 
   {}, 
   295891, 
   null, 
   1199398560.0
  ], 
  [
   295992, 
   null, 
   "Jo Bennett", 
   "It doesn't get the good bish of the hook. Even the prevarications of the Church Times don't really help him:\n \n \n \n IOW, homosexual behaviour is just as evil as destroying our environment, and therefore is as much at fault for all the ills that beset us.\n \n Maybe the good bish can find common cause with Pope Maledict who now evidently sees a desperate Roman Catholic need for more exorcists. It's possession by the devil that must be causing gay marriage, moral decay and hence global warming.\n\n \n I've not read or seen anything that tells me how exactly the Bishop of Carlisle supposedly linked moral degradation to homosexuality. It's quite a leap to make. It's also quite a leap to suggest that the Church Times would be out to help him. The Church Times is not a newsletter of the church of england, it is an independent paper with a religious focus, and is just as capable of misleading and scandal seeking as a regular newspaper.", 
   {}, 
   295989, 
   null, 
   1199399460.0
  ], 
  [
   296037, 
   null, 
   "lesz", 
   "I've not read or seen anything that tells me how exactly the Bishop of Carlisle supposedly linked moral degradation to homosexuality. It's quite a leap to make. It's also quite a leap to suggest that the Church Times would be out to help him. The Church Times is not a newsletter of the church of england, it is an independent paper with a religious focus, and is just as capable of misleading and scandal seeking as a regular newspaper.\n\n \n Frankly, when a bevy of other bishops and flunkies has to \"clarify\" what the first bishop actually meant, without really making it clear, then the situation isn't improved. I am sure the first bish was a reasonably intelligent and articulate man, perfectly capable of saying what he meant in the first place. If he hadn't meant it, he would have said something different. He just wasn't prepared for the negative reaction, which he should have been.", 
   {}, 
   295992, 
   null, 
   1199451120.0
  ], 
  [
   296072, 
   null, 
   "Waxy", 
   "I can not speak for all my fellow Scots but I tend to view those who(especially politicians) proclaim their religious devotions from the roof tops with suspicion. I feel it is a case of 'The lady doth protest too much, methinks' and that person does not really follow the faith but uses it to appear in a better light. \n\n \n My thoughts exactly.\n \n \nI also guess it is a cultural thing I view faith(or lack of it) as a private matter and I would imagine many Scots would feel the same.\n\n \n Not surprisingly I suppose, this tends to be the norm in Canada as well. \n \n The issue surfaced regarding the current Prime Minister's religious views during the last election, as he is conservative Christian. There were attempts to paint him as a tyrannical, out of touch, ultra-literalist religious zealot by some members of the opposition parties, and I don't doubt that some believed it. It was really a non-issue in the end IMHO, as most likely for everyone turned off by his religious beliefs there was at least one that supported his beliefs. He hasn't done anything to date while in office that I would deem religiously motivated, it's a personal matter for him, and he has no interest in legislating his beliefs. (FYI - I voted for him.)\n \n Thankfully, religion really tends to be a non-issue in Canadian politics.\n \n \nI can not speak for all Atheists but I could relate to a person who believes in God. After all I was brought by a religious family, I went to Church and Sunday School for 12 years. I believe this would be fairly typical for all Atheists, also I have many friends who are religious and I for one can understand their faith.\n\n \n The notion that an atheist would not be able to relate to anyone religious is absurd. \n \n I do it every day.\n \n Waxy", 
   {}, 
   295922, 
   null, 
   1199474940.0
  ], 
  [
   296080, 
   null, 
   "jyoshu", 
   "Yes. An atheist can easily relate to a religious person and all his religious ideas and behaviors.\n\n \n Alright then.\n \n \nI would vote for anyone whom I think will do the job well, regardless of religious convictions or any other personal attributes he might have. A conservative/liberal votes for someone who has compatible political ideas.\n\n \n That's a meaningless distinction, IMO. If you have known fascist running for office, you're not going to vote for him because you think his ideology of fascism will keep him from doing the job well. Religious people could say they're doing the same thing by not voting an atheist in if they think an atheist wouldn't do as good a job. (though I'd agree with you that they'd be wrong.) I agree with you in principle here--it's not good that many people seem to have a litmus test out there over atheism to the point where an atheist wouldn't get elected. But I think this is just part of the fact that people tend to vote their consciences. I think you could definitely say they may be wrong about atheists. I think there's definitely a fear out there among some religious people over this. Then again, I sure wouldn't want the likes of Chris Hitchens for president. (And yes, I know not all atheists are like him.)\n \n \nHaving the freedom to be religious can and should be fervently supported by an atheistic as well as a believer. Being religious inside or outside the voting booth should have nothing to do with judging who is the best candidate. Using religiosity as a litmus test is foolish and narrow-minded. We also have no idea how religious a person is.\n\n \n Well, it's the issue most important to some voters. Everyone has one or more litmus tests, regarding something. For others it's whether the candidate is anti-war or not, for others it's natl. security, for other it's their strength in domestic policy. I think religion itself is an issue that resonates with voters just like any of these other issues. Whether that's good or not I don't know, but I think it's reality.", 
   {}, 
   295990, 
   null, 
   1199482620.0
  ], 
  [
   296082, 
   null, 
   "thelmoose", 
   "That's a meaningless distinction, IMO. If you have known fascist running for office, you're not going to vote for him because you think his ideology of fascism will keep him from doing the job well. Religious people could say they're doing the same thing by not voting an atheist in if they think an atheist wouldn't do as good a job. (though I'd agree with you that they'd be wrong.) I agree with you in principle here--it's not good that many people seem to have a litmus test out there over atheism to the point where an atheist wouldn't get elected. But I think this is just part of the fact that people tend to vote their consciences. I think you could definitely say they may be wrong about atheists. I think there's definitely a fear out there among some religious people over this. Then again, I sure wouldn't want the likes of Chris Hitchens for president. (And yes, I know not all atheists are like him.)\n \n\n \n We are sorta kinda agreeing. I know what the reality is out there and I think it is wrongheaded. Facsist, liberal, or conservative stances are directly related to job performance, but one's professed religion or lack thereof is not. \n \n A candidate's integrity, honesty, and discipline is very important, but this cannot be deduced from knowing their religious affiliation or lack of one. The assumption that a person who states they have religion is more likely to be moral or that an atheist is immoral is a false one, albeit a prevalent one. That is exactly the reason politicians claim they have religion. Most certainly there must be some atheist politicians - and given the demographics, the proportion is greater than the general population. \n \n One cannot know a person simply based upon his professed religion, as such a profession is a superficial commodity. The problem here is that the vast majority of the US populace doesn't see it that way and I think they are being naive and narrow-minded. They have been told religion is necessarily good and atheism is always bad and they believe it. \n \n I would hope you would not vote against Christopher Hitchens simply because he is an atheist per se.", 
   {}, 
   296080, 
   null, 
   1199483940.0
  ], 
  [
   296084, 
   null, 
   "Kronus", 
   "So how does a person who doesn't believe in God relate to people who believe in God? Can someone who doesn't pray and thinks it's ridiculous seriously relate to things like praying and going to church regularly? I'm sorry, but I don't see how an atheist could reasonably claim to do that.\n \n\n Why would a politician need to \"relate\" to prayer and church going? Those are parts of people's private lives. Politicians don't need to understand those anymore than they need to understand someone's passion for badmitton, or their fascination for nature documentaries. As long as they don't interfere with people's private religious choices they're doing all their job demands.", 
   {}, 
   295891, 
   null, 
   1199484300.0
  ], 
  [
   296086, 
   null, 
   "Zardoz", 
   "Why would a politician need to \"relate\" to prayer and church going? Those are parts of people's private lives. Politicians don't need to understand those anymore than they need to understand someone's passion for badmitton, or their fascination for nature documentaries. As long as they don't interfere with people's private religious choices they're doing all their job demands.\n\n \n I don't think many understand that in many parts of America, religion isn't private.\n \n Church going is an extremely social activity. Often, the only activity many enjoy other than work and family life.\n It's a reason why you find many hypocrits going to church and parroting their beliefs. Fear of social ostracism, loss of a community.\n Many church groups participate in other community activities.\n \n Saying you're not religious in many areas is akin to going to a sports pub in England and not only stating you dislike the local soccer club but implying you hate it...while wearing a shirt that says all who do like it are f*****s.\n \n In America, it's a way of saying 'I'm wit' you.'\n \n Complying gives you a pheromonal spray to help you blend in with the hive...so they don't bite, sting and eat you.", 
   {}, 
   296084, 
   null, 
   1199485560.0
  ], 
  [
   296107, 
   null, 
   "Kronus", 
   "I don't think many understand that in many parts of America, religion isn't private.\n \n Church going is an extremely social activity. Often, the only activity many enjoy other than work and family life.\n\n \n Your social life is still your private life. \"private\" doesn't mean solitary. In this context it simply refers to what you do in a non-official context. It's not your job, it's not your career, you aren't representing an organizaiton, you're just being you. You can spend all day attending church functions with lots of people, and that's still your private choice as an individual. You see the distinction I'm making?", 
   {}, 
   296086, 
   null, 
   1199501520.0
  ], 
  [
   296124, 
   null, 
   "Zardoz", 
   "Your social life is still your private life. \"private\" doesn't mean solitary. In this context it simply refers to what you do in a non-official context. It's not your job, it's not your career, you aren't representing an organizaiton, you're just being you. You can spend all day attending church functions with lots of people, and that's still your private choice as an individual. You see the distinction I'm making?\n\n \n I see what you're saying. I just think that 'private' is defined differently in some parts of the US (if not most).\n \n Private is more 'intimate' where as 'public' branches out further than that.\n Since religion is a social institution, often done with strangers, it's not to far of a stretch of the imagination to come to the conclusion some Americans have and ask some simple questions about your faith. Esp. in a country with with the stats on believers vs non like we have here, you have it as almost a given.\n Where'd you live?\n Where'd you go to school?\n Where'd you attend church?\n What'd you do for a living?\n \n As you become more intimate with someone, you could elaborate on those questions. Eventually getting to 'how often you pray each day?'\n American politicians seem to want to be your buddy, your bestest friend for life. \n Such behavior almost seems institutionalized in our politics and as we become ever more cosmopolitan, every day 'I'm a WASP, you're a WASP too!' gives way to 'What's a Muslim?' and 'I thought Shakers were like the Amish.' and 'Mormons are all cultistic brainwashers like them door knocking partners the Jehovahs Witnesses.' and the ever popular 'Don't Vegans worship squash or something?' and candidates with different upbringings come forward. And we want to know about their character to see if they'd be a good representative for us. We simply want to knwo who the hell you are. And since we can't read your palms or look at neuro-scans of your personality waves and what-not, we pry.\n So, stupid questions are asked by adults because they weren't asked when they were kids. And stupid untruths are passed on because ones own brainwashing pastor expresses them in bible study sometimes.\n \n So, is Romney a good choice? If so, why? I hear-tell he's a Mormon, what they like? Is he like me? If so, I think I can trust him. But, if he's an 'other', well we's gotsta shun 'em good.\n \n \n Just good ole fashion Us vs Them in action.", 
   {}, 
   296107, 
   null, 
   1199532780.0
  ], 
  [
   296125, 
   null, 
   "lesz", 
   "If you have known fascist running for office, you're not going to vote for him because you think his ideology of fascism will keep him from doing the job well.\n\n \n One could say exactly the same thing about known Christianists. One could not in good conscience vote for a Robertson or a Huckabee on those grounds alone. \n \n \nI sure wouldn't want the likes of Chris Hitchens for president. (And yes, I know not all atheists are like him.)\n\n \n I quite agree. Hitchens, whatever positive qualities he has, is not ideal presidential material. However, one could say the same about several of the incumbents this last 30-40 years, especially the most recent.\n \n It's not Hitchens' atheism or Bush's religiosity that are the important issues, but competence to do a job. In the case of someone like Huckabee, I would definitely fear for the separation of church and state.", 
   {}, 
   296080, 
   null, 
   1199539440.0
  ], 
  [
   296261, 
   null, 
   "HonestAbe", 
   "One could say exactly the same thing about known Christianists. One could not in good conscience vote for a Robertson or a Huckabee on those grounds alone. \n \n \n \n I quite agree. Hitchens, whatever positive qualities he has, is not ideal presidential material. However, one could say the same about several of the incumbents this last 30-40 years, especially the most recent.\n \n It's not Hitchens' atheism or Bush's religiosity that are the important issues, but competence to do a job. In the case of someone like Huckabee, I would definitely fear for the separation of church and state.\n\n \n Huckabee isn't up to the task. We don't need another person taking his marching orders from some supposed diety. Thank you very much.", 
   {}, 
   296125, 
   null, 
   1199673900.0
  ], 
  [
   296288, 
   null, 
   "lesz", 
   "Huckabee isn't up to the task. We don't need another person taking his marching orders from some supposed diety. Thank you very much.\n\n \n Huckabee isn't to be trusted on church-state issues. Some of his closest supporters are Christian Dominionists, and he has stated himself that there's a war between his religious perspective and 'the godless\", presumably everyone else who doesn't share his fundamentalist superstitions, and that one side will dominate the other. There's some commentary on him and his fundie friends here:\n \n http://www.boxturtlebulletin.com/2008/01/06/1249\n \n Not pleasant reading.", 
   {}, 
   296261, 
   null, 
   1199714160.0
  ], 
  [
   296291, 
   null, 
   "HonestAbe", 
   "Huckabee isn't to be trusted on church-state issues. Some of his closest supporters are Christian Dominionists, and he has stated himself that there's a war between his religious perspective and 'the godless\", presumably everyone else who doesn't share his fundamentalist superstitions, and that one side will dominate the other. There's some commentary on him and his fundie friends here:\n \n http://www.boxturtlebulletin.com/2008/01/06/1249\n \n Not pleasant reading.\n\n \n Can you imagine what the courts would look like after a Huckabee administration? Thank goodness he hasn't a prayer of winning.", 
   {}, 
   296288, 
   null, 
   1199717340.0
  ], 
  [
   296310, 
   null, 
   "jitobear", 
   "Huckabee isn't to be trusted on church-state issues. Some of his closest supporters are Christian Dominionists, and he has stated himself that there's a war between his religious perspective and 'the godless\", presumably everyone else who doesn't share his fundamentalist superstitions, and that one side will dominate the other. There's some commentary on him and his fundie friends here:\n \n http://www.boxturtlebulletin.com/2008/01/06/1249\n \n Not pleasant reading.\n\n \n Sounds like Christianity's version of Radical Islam. Gothard belongs in a mental institution. As a former mental health worker I get really really ticked off when idiot laymen (like Gothard here or Tom Cruise) make pronouncements about medical health care - especially mental health. They are in no posotion to do so and it is already damned hard to get so many of the mentally ill - especially those who are hallucinating or dillusional (like pschizophrenics) to admit they need and seek help.", 
   {}, 
   296288, 
   null, 
   1199730660.0
  ], 
  [
   296319, 
   null, 
   "jyoshu", 
   "LOL, let the 2nd-hand muckraking begin!!! Personally, I don't care what Bill Gothard believes; I do care what Mike Huckabee believes. This bill Gothard isn't running for president. Someone needs to pin down Huckabee on what he thinks about this \"christian dominionism\".", 
   {}, 
   296310, 
   null, 
   1199734380.0
  ], 
  [
   296327, 
   null, 
   "lesz", 
   "LOL, let the 2nd-hand muckraking begin!!! Personally, I don't care what Bill Gothard believes; I do care what Mike Huckabee believes. This bill Gothard isn't running for president. Someone needs to pin down Huckabee on what he thinks about this \"christian dominionism\".\n\n \n Good luck pinning down an office-seeker on his opinions! You have to look at his associates and confidantes for an honest answer.", 
   {}, 
   296319, 
   null, 
   1199739540.0
  ], 
  [
   296348, 
   null, 
   "HonestAbe", 
   "Good luck pinning down an office-seeker on his opinions! You have to look at his associates and confidantes for an honest answer.\n\n \n You won't get much of an honest answer from the religious candidates. The nation's experience with George W. Bush has proven that.", 
   {}, 
   296327, 
   null, 
   1199751180.0
  ], 
  [
   296422, 
   null, 
   "jyoshu", 
   "Good luck pinning down an office-seeker on his opinions! You have to look at his associates and confidantes for an honest answer.\n\n \n He's been pretty forthcoming and honest in terms of his views, even knowing there are people out there who will use it against him. He didn't really back down from his statements about gays, for instance.", 
   {}, 
   296327, 
   null, 
   1199811360.0
  ], 
  [
   296426, 
   null, 
   "lesz", 
   "He's been pretty forthcoming and honest in terms of his views, even knowing there are people out there who will use it against him. He didn't really back down from his statements about gays, for instance.\n\n \n Quite. Everything we have come to expect and fear about the GOP.", 
   {}, 
   296422, 
   null, 
   1199813700.0
  ], 
  [
   296439, 
   null, 
   "jyoshu", 
   "Quite. Everything we have come to expect and fear about the GOP.\n\n \n So you DO think we'd get an honest answer then? Make up your mind.", 
   {}, 
   296426, 
   null, 
   1199818320.0
  ], 
  [
   296441, 
   null, 
   "lesz", 
   "So you DO think we'd get an honest answer then? Make up your mind.\n\n \n Actually, I don't think we'd get an honest answer from Huckabee about his support of Christianism, but we can figure out where he'd go from what he's said, and it would be a terrible day for Americans if they ever did elect him president, because he'd support dismantling the constitutional protections for religious freedom. He'd be a really divisive candidate, because he can only ever hope to represent conservative Christians.\n \n Frankly, I think he's probably unelectable except in the GOP base, so it probably won't be an issue even if he gets the nomination. It would be another Goldwater moment for the GOP, which would then have to decide whether it's going to become the party of a right-wing Christian minority, or a more secular organisation with a chance of being elected to office with votes from religious liberals. My bet is they'll step back from the brink by going for McCain -- but I won't be betting too much. \n \n The GOP nomination is far more entertaining them the Dem one, because whichever Dem wins, he or she would be a tolerable candidate (though again, I think the Dems would be wise to choose someone other than Clinton on account of kneejerk hatred of her husband by Republicans -- and I don't really trust her sincerity, either). Both parties should be looking for a candidate that can unite diverse groups in America, not divide them further. I think maybe the Dems have heard that call, but the GOP might not have.", 
   {}, 
   296439, 
   null, 
   1199818980.0
  ], 
  [
   296455, 
   null, 
   "HonestAbe", 
   "Huck has a close relationship with Dominionists. He is an evil man.", 
   {}, 
   296441, 
   null, 
   1199825340.0
  ], 
  [
   296460, 
   null, 
   "jyoshu", 
   "The GOP nomination is far more entertaining them the Dem one, because whichever Dem wins\n\n \n Hah!! I don't know where you get that idea. You'd certainly never know it from watching the press. It's been all about Obama versus Hillary.\n \n \nActually, I don't think we'd get an honest answer from Huckabee about his support of Christianism, but we can figure out where he'd go from what he's said, and it would be a terrible day for Americans if they ever did elect him president, because he'd support dismantling the constitutional protections for religious freedom. He'd be a really divisive candidate, because he can only ever hope to represent conservative Christians.\n\n \n I'm always struck around election time how people tend to automatically think that the person they don't like isn't the mainstream, and the person(s) they do like IS the mainstream. Huckabee's \"conservative Christianity\" (which is really more of a cultural norm than something religious) is pretty mainstream. I think Democrats are banking on the idea that it's not, but it is. I suppose if someone despises \"conservative Christianity\" then naturally they'd find a conservative-friendly candidate divisive. But to represent \"conservative Christians\" basically means representing a great deal of the country in terms of values. I'd even say it's more mainstream than not. If you don't think it's pretty mainstream then ask yourself if you think a candidate who comes out completely favoring gay rights and gay pride and makes it an issue would really be electable. Heck, even more liberal Democrats temper their statements and try to make themselves look more conservative, when it comes to election time. This reminds me of how last election everybody thought Bush was going to lose because he was so NOT mainstream and out of touch with America. Personally, I think it's usually a load of hooey when most people say they want a \"uniter and not a divider\". Usually that just means the candidate they like best.", 
   {}, 
   296441, 
   null, 
   1199828700.0
  ], 
  [
   296544, 
   null, 
   "lesz", 
   "Hah!! I don't know where you get that idea. You'd certainly never know it from watching the press. It's been all about Obama versus Hillary.\n\n \n Yes, well, the mainstream media are so clueless, they even gave GW Bush a pass for most of the last 7 years -- and so did Hillary, another reason I'm not too fond of her. But no, I don't go to the mainstream press for my news entertainment -- what entertains those twits doesn't much amuse me.\n \n You really should watch less Fox \"News\"! :)\n \n \nI'm always struck around election time how people tend to automatically think that the person they don't like isn't the mainstream, and the person(s) they do like IS the mainstream. Huckabee's \"conservative Christianity\" (which is really more of a cultural norm than something religious) is pretty mainstream.\n\n \n Then god help us all. If Huckabee is truly mainstream, you lot are on your way to a theocracy. My betting is he's not. If his brand of Christianity is \"normal\" I shudder to think that most Christians are abnormal.\n \n \nI think Democrats are banking on the idea that it's not, but it is. I suppose if someone despises \"conservative Christianity\" then naturally they'd find a conservative-friendly candidate divisive.\n\n \n I always find it amusing when a reactionary \"Christian\" goes out of his way to accuse liberal Christians of not being true Christians. For my money, the load of you are Christians. \n \n \nBut to represent \"conservative Christians\" basically means representing a great deal of the country in terms of values.\n\n \n If 20% is a \"great deal\". I agree there's a core of religious hardasses out there, but I think they only represent themselves. When they flexed their theocratic muscles on the Terri Schiavo case, for example, the nation gave them a black eye for their pains, and I think that was the turning point when everyone else went against them, resulting in present day GOP malaise. And the GOP Candidate Clown Car.\n \n \nI'd even say it's more mainstream than not. If you don't think it's pretty mainstream then ask yourself if you think a candidate who comes out completely favoring gay rights and gay pride and makes it an issue would really be electable. Heck, even more liberal Democrats temper their statements and try to make themselves look more conservative, when it comes to election time. This reminds me of how last election everybody thought Bush was going to lose because he was so NOT mainstream and out of touch with America. Personally, I think it's usually a load of hooey when most people say they want a \"uniter and not a divider\". Usually that just means the candidate they like best.\n\n \n Actually, last election, no-one thought Bush was going to lose. What surprised me was how close the vote was, and how close Bush came to losing. As for who is the center, it's the liberals, dummy! (If you poll people on issues rather than parties or personalities, they tend to come out closer to Dems than the GOP, on average.) Neither Clinton nor Obama are leftists or extremists. They are both conservative liberals, or liberal conservatives, whichever. Neither would make huge economic or domestic changes, and I doubt Clinton would even change foreign policy much, another reason I don't like her nomination. But unlike Huckabee, they'd stand for constitutional protections from religious extremists.\n \n I don't care for the Democrats much, they are a pack of political opportunists. But I fear the current GOP, and so do many American voters. And I suspect the GOP will get the message, too.", 
   {}, 
   296460, 
   null, 
   1199875140.0
  ], 
  [
   296616, 
   null, 
   "trebor", 
   "Actually, I don't think we'd get an honest answer from Huckabee about his support of Christianism, but we can figure out where he'd go from what he's said, and it would be a terrible day for Americans if they ever did elect him president, because he'd support dismantling the constitutional protections for religious freedom. He'd be a really divisive candidate, because he can only ever hope to represent conservative Christians.\n \n Frankly, I think he's probably unelectable except in the GOP base, so it probably won't be an issue even if he gets the nomination. It would be another Goldwater moment for the GOP, which would then have to decide whether it's going to become the party of a right-wing Christian minority, or a more secular organisation with a chance of being elected to office with votes from religious liberals. My bet is they'll step back from the brink by going for McCain -- but I won't be betting too much. \n \n The GOP nomination is far more entertaining them the Dem one, because whichever Dem wins, he or she would be a tolerable candidate (though again, I think the Dems would be wise to choose someone other than Clinton on account of kneejerk hatred of her husband by Republicans -- and I don't really trust her sincerity, either). Both parties should be looking for a candidate that can unite diverse groups in America, not divide them further. I think maybe the Dems have heard that call, but the GOP might not have.\n\n \n He only has good support among the evangalsitic gop in the bible belt you mean. He will fade outside of it.", 
   {}, 
   296441, 
   null, 
   1199928660.0
  ], 
  [
   296630, 
   null, 
   "HonestAbe", 
   "He only has good support among the evangalsitic gop in the bible belt you mean. He will fade outside of it.\n\n \n Huckabee will fail. He does not have the support of Wall Street or the corporations. He'll do ok in the South, but that's it.", 
   {}, 
   296616, 
   null, 
   1199936040.0
  ], 
  [
   296641, 
   null, 
   "obvious_child", 
   "Huckabee will fail. He does not have the support of Wall Street or the corporations. He'll do ok in the South, but that's it.\n\n \n Agreed. Without the financial support of Wall Street, he's finished. Plus when whackjobs like Michelle Malkin who has no heart whatsoever or a soul or any thing resembling humanity attack Huck, you know his days are numbered. Expect ol' Huck to get swift boated more then Kerry if he picks up more states.", 
   {}, 
   296630, 
   null, 
   1199942160.0
  ], 
  [
   296655, 
   null, 
   "The_Wizard", 
   "I just don't want a Creationist in the WH. I want my science back.", 
   {}, 
   296641, 
   null, 
   1199949060.0
  ], 
  [
   296659, 
   null, 
   "Bassman", 
   "I just don't want a Creationist in the WH. I want my science back.\nWell shucks, how can we forget about Sir Isaac Newton or George Washington Carver?? Two of the greatest scientific minds in history and yet both devout Christians, who I will have the chance to meet for the first time. You seem to think that this plane of existence is it! But I beg to differ.", 
   {}, 
   296655, 
   null, 
   1199951400.0
  ], 
  [
   296661, 
   null, 
   "Jo Bennett", 
   "Well shucks, how can we forget about Sir Isaac Newton or George Washington Carver?? Two of the greatest scientific minds in history and yet both devout Christians, who I will have the chance to meet for the first time. You seem to think that this plane of existence is it! But I beg to differ.\n\n \n Newton wasn't a particularly devout Christian, being anti-trinitarian and dabbling in occultism.", 
   {}, 
   296659, 
   null, 
   1199954340.0
  ], 
  [
   296669, 
   null, 
   "lesz", 
   "He [Huckabee] only has good support among the evangalsitic gop in the bible belt you mean. He will fade outside of it.\n\n \n Well, he certainly got eclipsed in NH. I suspect you are right -- my betting is the GOP will edge away from the stranglehold the religious conservatives have tried to place on them.\n \n We have, paradoxically, much to thank Tom DeLay and Karl Rove for -- together, admittedly with a lot of help from pseuds like Santorum and the other ultra-conservative trash in Congress, they may have set the scene for major reformation of the GOP, simply by being overbearing jerks and bullies, in the name of Christianity.", 
   {}, 
   296616, 
   null, 
   1199962920.0
  ], 
  [
   296671, 
   null, 
   "The_Wizard", 
   "Well shucks, how can we forget about Sir Isaac Newton or George Washington Carver?? Two of the greatest scientific minds in history and yet both devout Christians, who I will have the chance to meet for the first time. You seem to think that this plane of existence is it! But I beg to differ.\n\n \n Newton and Carver were never exposed to Evolution, but knowing Newton he would have immersed himself in the data and made the logical conclusion that all great scientists make. While he was Christian he was not a good one... more of a naturalist. He would have gone Evo.\n \n I do believe in other dimensions, but they may not be heaven. The only ones who know for sure are the dead... and they ain't talkin'.", 
   {}, 
   296659, 
   null, 
   1199968080.0
  ], 
  [
   296676, 
   null, 
   "Archangel", 
   "Newton and Carver were never exposed to Evolution, but knowing Newton he would have immersed himself in the data and made the logical conclusion that all great scientists make. While he was Christian he was not a good one... more of a naturalist. He would have gone Evo.\n\n \n And here we have another huge assumption made by an evolutionist that is based on nothing in reality at all. How comforting to know that even though you so easily make these determinations based on no facts at all, that you are remaining consistent with the depth of reason that allows you to accept evolution in the first place. Just remember evos, when in doubt assume, assume, assume... emoticon_xdonno \n \n And one more thing wizard, when did Bush put out that memo that commanded all people to denounce evo in favor of creationism? You make it sound like an edict has been signed forcing all people to believe only in creationism or face Prison time.", 
   {}, 
   296671, 
   null, 
   1199971320.0
  ], 
  [
   296680, 
   null, 
   "HonestAbe", 
   "Odd how in this day and age, so many people still live in fear of death and therefore grasp superstitions to allay their fears even though there is no evidence what-so-ever for their ridiculous beliefs. We haven't come very far from the bronze age, have we?", 
   {}, 
   296676, 
   null, 
   1199972580.0
  ], 
  [
   296687, 
   null, 
   "Archangel", 
   "Odd how in this day and age, so many people still live in fear of death and therefore grasp superstitions to allay their fears even though there is no evidence what-so-ever for their ridiculous beliefs. We haven't come very far from the bronze age, have we?\n\n \n Again, like samiinh, you assume our faith is based in fear rather than love. And like him you assume we are motivated by superstition rather than a real relationship with a living and personal God. I truly mourn the very real and true abject terror you will know on the day that you realize that you rejected Love incarnate. And on that day you will also learn who it was who believed man made superstitions and who knew the eternal truth of what and who Man is.", 
   {}, 
   296680, 
   null, 
   1199973780.0
  ], 
  [
   296691, 
   null, 
   "HonestAbe", 
   "Again, like samiinh, you assume our faith is based in fear rather than love. And like him you assume we are motivated by superstition rather than a real relationship with a living and personal God. I truly mourn the very real and true abject terror you will know on the day that you realize that you rejected Love incarnate. And on that day you will also learn who it was who believed man made superstitions and who knew the eternal truth of what and who Man is.\n\n \n Sorry, but I don't see much love coming from Christians, and you can't show me your loving, living god. It is typical for cult members to believe as you do, no evidence required.", 
   {}, 
   296687, 
   null, 
   1199974500.0
  ], 
  [
   296770, 
   null, 
   "The_Wizard", 
   "And here we have another huge assumption made by an evolutionist that is based on nothing in reality at all. How comforting to know that even though you so easily make these determinations based on no facts at all, that you are remaining consistent with the depth of reason that allows you to accept evolution in the first place. Just remember evos, when in doubt assume, assume, assume... emoticon_xdonno \n \n And one more thing wizard, when did Bush put out that memo that commanded all people to denounce evo in favor of creationism? You make it sound like an edict has been signed forcing all people to believe only in creationism or face Prison time.\n\n \n Pick up a book other than the Bible. Sir Issac Newton was a \"actual\" man, therefore your statement is incorrect... as usual. Bush tried to kill science, and I don't take kindly to people who tell me how to think. \n \n I've been studying science and the bible for 30 years now and was once a strong Christian. But I pull my head out of my butt and washed the corn out of my ears and did the math. You are part of a dying sect of myth pushers who refuse to see that science has consistantly gone up against dogmatic veiws of the world and crushed them. You deny evolution and yet you support medicine (also a theory) and the sciences are the same. The same studies, techniques and the same conclusions. Forensics takes it's creation from antropology and biology and recovery techniques use in archaeology. Welcome to the cold, hard reality Wormfood. \n \n So I have to ask you... What part of science are you fighting against? The part that proves there is no God or the part that will prove there is no god? Because either way you look at, your only living on borrowed time.", 
   {}, 
   296676, 
   null, 
   1200013740.0
  ], 
  [
   296771, 
   null, 
   "HonestAbe", 
   "Pick up a book other than the Bible. Sir Issac Newton was a \"actual\" man, therefore your statement is incorrect... as usual. Bush tried to kill science, and I don't take kindly to people who tell me how to think. \n \n I've been studying science and the bible for 30 years now and was once a strong Christian. But I pull my head out of my butt and washed the corn out of my ears and did the math. You are part of a dying sect of myth pushers who refuse to see that science has consistantly gone up against dogmatic veiws of the world and crushed them. You deny evolution and yet you support medicine (also a theory) and the sciences are the same. The same studies, techniques and the same conclusions. Forensics takes it's creation from antropology and biology and recovery techniques use in archaeology. Welcome to the cold, hard reality Wormfood. \n \n So I have to ask you... What part of science are you fighting against? The part that proves there is no God or the part that will prove there is no god? Because either way you look at, your only living on borrowed time.\n\n \n It is nice to know that there are more out there who have shared my experience. Well said.", 
   {}, 
   296770, 
   null, 
   1200018060.0
  ], 
  [
   296772, 
   null, 
   "Archangel", 
   "Pick up a book other than the Bible. Sir Issac Newton was a \"actual\" man, therefore your statement is incorrect... as usual.\n\n \n Hey wizard, my prior statement was based totally on what you yourself said regarding Newton. See?\n \n \n \n Newton and Carver were never exposed to Evolution, but knowing Newton he would have immersed himself in the data and made the logical conclusion that all great scientists make.\n\n \n The key words YOU USED being \"NEVER EXPOSED TO EVOLUTION\" and \"HE WOULD HAVE,\" And then the assumptions begin, because if he was never exposed to evo then you have no evidence what so ever what choice he would have made had he actually been exposed to it, and are assuming what he would have done by your own words. So you don't know at all that he wouldn't have rejected purely on principle that it conflicts with what he already believed to be true according to the bible. That is what assumption means wizard, accepting something as true that hasn't been proven yet. And there is no proof at all what Newton would have accepted regarding evo.\n \n \nI've been studying science and the bible for 30 years now and was once a strong Christian. But I pull my head out of my butt and washed the corn out of my ears and did the math. You are part of a dying sect of myth pushers who refuse to see that science has consistantly gone up against dogmatic veiws of the world and crushed them. You deny evolution and yet you support medicine (also a theory) and the sciences are the same. The same studies, techniques and the same conclusions. Forensics takes it's creation from antropology and biology and recovery techniques use in archaeology. Welcome to the cold, hard reality Wormfood. \n \n So I have to ask you... What part of science are you fighting against? The part that proves there is no God or the part that will prove there is no god? Because either way you look at, your only living on borrowed time.\n\n \n Jesus founded the gospel of salvation in His human incarnation 2000 years ago. And ever since the day He was crucified on the Cross people just like you declared Him dead. But wait, here we are two thousand years later and not only are people like me being born again every day who will give our lives for this Savior and Redeemer of mens souls, but Jesus Himself is still alive and well. \n \n So you can declare Him dead, and you can hope for it too; but you can't kill God wizard. Many better men than you have tried and failed through out the last two millennia. But if you take pleasure in deluding yourself, you just go on and delude yourself. As for me, I will praise the Lord. emoticon_xangel", 
   {}, 
   296770, 
   null, 
   1200018120.0
  ], 
  [
   296775, 
   null, 
   "HonestAbe", 
   "Hey wizard, my prior statement was based totally on what you yourself said regarding Newton. See?\n \n \n \n The key words YOU USED being \"NEVER EXPOSED TO EVOLUTION\" and \"HE WOULD HAVE,\" And then the assumptions begin, because if he was never exposed to evo then you have no evidence what so ever what choice he would have made had he actually been exposed to it, and are assuming what he would have done by your own words. So you don't know at all that he wouldn't have rejected purely on principle that it conflicts with what he already believed to be true according to the bible. That is what assumption means wizard, accepting something as true that hasn't been proven yet. And there is no proof at all what Newton would have accepted regarding evo.\n \n \n \n Jesus founded the gospel of salvation in His human incarnation 2000 years ago. And ever since the day He was crucified on the Cross people just like you declared Him dead. But wait, here we are two thousand years later and not only are people like me being born again every day who will give our lives for this Savior and Redeemer of mens souls, but Jesus Himself is still alive and well. \n \n So you can declare Him dead, and you can hope for it too; but you can't kill God wizard. Many better men than you have tried and failed through out the last two millennia. But if you take pleasure in deluding yourself, you just go on and delude yourself. As for me, I will praise the Lord. emoticon_xangel\n\n \n \n Are you one of the remaining members of the flat earth society?", 
   {}, 
   296772, 
   null, 
   1200020460.0
  ], 
  [
   296776, 
   null, 
   "The_Wizard", 
   "And like I said in another forum, millions of men have thought like you about their religions, and many that lasted 4000 years... and all for not. Christianity has brought nothing new to the table. You are not original in your thinking and belief. \n \n Zoroaster preached of a single God and a savior son 1500 years before Abraham would have left Babylon's outer citys. The Enuma Elish (The Babylonian Epic of Creation) was written 2000 years on clay tablets before the bible was put in ink and talked of the creation of men, the Adama, who were formed from clay and blood. The Epic of Gilgamesh (The Babylonian Flood Story) talked of Utnapishtim and how the sky god Enlil wanted to destroy the wicked men with a flood, and the sea god Enki saved them by telling Utnapishtim how to build a boat to escape the storm to come. Again, written 2000 years before the bible.\n \n Put these stories in the bible and they are the word of God. Read them from their clay tablets with different gods and names and they become myth. You don't even know the true origins of the tripe you are spewing. You assume you will be saved because a book tells you so. You assume you will be saved because a bunch of men (who thought bathing was wicked) used fear in order to keep the trogladites in line. Think about it... an immortal being who claims he will die for your salvation, but knows he will be crucified and resurrected... is that much of a sacrifice. If you absolutely knew the lotto numbers for the next drawing but only had one dollar to your name to feed your child, would you consider buying a ticket a sacrifice? Sound like you fell for the ol' Disappearing Cabinet trick. What a classic.", 
   {}, 
   296772, 
   null, 
   1200022200.0
  ], 
  [
   296777, 
   null, 
   "obvious_child", 
   "Again, like samiinh, you assume our faith is based in fear rather than love.\n\n \n Perhaps it is not. But when you regularly resort to threats of eternal damnation for disagreeing with you in your many, many, many defeated arguments it's hard not to come to the conclusion that your faith is fear based. \n \n \nAnd like him you assume we are motivated by superstition rather than a real relationship with a living and personal God.\n\n \n And yet you cannot prove your God is the true God or that Gods even exist. \n \n \nI truly mourn the very real and true abject terror you will know on the day that you realize that you rejected Love incarnate. And on that day you will also learn who it was who believed man made superstitions and who knew the eternal truth of what and who Man is.\n\n \n Love you say? That sounds more like fear.", 
   {}, 
   296687, 
   null, 
   1200022680.0
  ], 
  [
   296778, 
   null, 
   "electrolyte", 
   "Again, like samiinh, you assume our faith is based in fear rather than love.\n\n \"Assume\"? Hardly. Just look at you. Spewing hatred and vile, spreading threats of damnation and punishment. Your posts only turned to this faux graciousness after we ripped you a new one for your lies and hypocrisy about love.\n \n ETA: Hmm, oc beat me to it. Notice that he says the same thing I do...", 
   {}, 
   296776, 
   null, 
   1200023280.0
  ], 
  [
   296779, 
   null, 
   "The_Wizard", 
   "I think they worship out of greed. Like a child wanting from Santa... If I act good I get a prize. I found that Christians in general are too weak to handle there lives alone. They need that crutch to get them over the hump of being gulable.\n \n I may be dumb... But I'm going to heaven!", 
   {}, 
   296778, 
   null, 
   1200023820.0
  ], 
  [
   296788, 
   null, 
   "Archangel", 
   "You guy's are incredible. You can so easily take what I say and accuse me of judging you and condemning you to hell. Well here is my quote. Which was in response to wizard calling Christianity a myth and man made superstitions that is dying.\n \n \nI truly mourn the very real and true abject terror you will know on the day that you realize that you rejected Love incarnate. \n \n And on that day you will also learn who it was who believed man made superstitions and who knew the eternal truth of what and who Man is.\n\n \n Now let me simplify this for you so you can comprehend it.\n \n In the red, I said: Just the opposite of condemning you, i said i mourn the rude awakening that you will surely face when this life ends when you realize you rejected the true love of God that is available to ALL who receive it, as it is freely offered to everyone. \n \n And you will understand clearly that I didn't respond to God out of fear at all, but the reality that you wasted your lives condemning God and rejecting Him, you will finally, clearly and fully understand the eternity that you yourself determined and chose. And that self made reality will surely terrify you as you understand that you are truly and willfully forsaken.\n \n In the blue I said that in the end, when you know all truth in your eternal bodies you will finally understand that the secular humanist lies and the atheistic emptiness that you so fervently embrace today are in fact the lost and shallow superstitious beliefs that led so many from this generation to their own destruction. You will understand that those people whom you called stupid and dumb as they shared such a simple gospel with you were the enlightened ones and you were the saps who believed the lies of the enemy of God and Man, who wanted nothing more than to hold you up before God and boast that he has stolen Gods precious children as satan casts you into the pit of outer darkness for all time where he already knows he is going to be. \n \n Through all of that experience the only person you will condemn is you, because you will clearly understand that you had every opportunity to not end up lost and forsaken for all of eternity but actually chose it for yourself by rejecting the very God who took upon Himself the flesh of Man and died for your personal sins in order to win you back to Himself and redeem you. But you spat on Him, cursed Him, mocked Him and scoffed at everyone who attempted to tell you about His unconditional love for you. And you looked down on them and insulted them. That is why I don't hate you because of your blind ignorance, but I mourn for you. \n \n Hopefully this makes clear for you that I'm not condemning any of you at all. But you are condemning yourselves and I am just warning you of the inevitable and promising you that unless you repent of your ways and accept His free gift that the above is the end result for you. With that said, I wish you all who condemn me, peace, In Jesus Holy Name...", 
   {}, 
   296779, 
   null, 
   1200026640.0
  ], 
  [
   296791, 
   null, 
   "The_Wizard", 
   "I don't know if they allow Love Incarnate in Texas any more. But, back to the thread... I condemn Mike Huckabee to eternal damnation in a glass coffin filled with 100% Oxygen! Oxidize in the name of science!", 
   {}, 
   296788, 
   null, 
   1200027960.0
  ], 
  [
   296804, 
   null, 
   "obvious_child", 
   "You guy's are incredible. You can so easily take what I say and accuse me of judging you and condemning you to hell. Well here is my quote. Which was in response to wizard calling Christianity a myth and man made superstitions that is dying.\n\n \n Obviously you never heard how to read between the lines in grade school. \n \n \nIn the red, I said: Just the opposite of condemning you, i said i mourn the rude awakening that you will surely face when this life ends when you realize you rejected the true love of God that is available to ALL who receive it, as it is freely offered to everyone.\n\n \n That is still a obvious threat of condemnation. You are clearly stating that since we disagree with you, we're screwed since you believe that your God and the afterlife it has so allegedly created (note you cannot prove this) will result in our damnation. You tie your arguments into the rejection of God's love, which is obviously a big fat lie as your arguments are in no way related to God's love and your argument often are contradictory to the nature of Christ. You spew lies, hatred, vile and horrible things that break the TOS over and over. Now I haven't seen any scripture where Jesus said it was okay to lie as you did with the Freaky Link's TV show prop, but maybe there is. Furthermore, I do not recall seeing any scripture where Christ said to call those who disagree with you horrible names. But I do remember from my years in a non-denomination private school that Christ told his followers to make peace, accept people for who they are and love them. Not do what you do. Trying to argue that your beliefs, especially when they are irrelevant to religion are tied to God's love is just dishonest. But you are no Christian: You worship the bible. \n \n \nAnd you will understand clearly that I didn't respond to God out of fear at all, but the reality that you wasted your lives condemning God and rejecting Him, you will finally, clearly and fully understand the eternity that you yourself determined and chose. And that self made reality will surely terrify you as you understand that you are truly and willfully forsaken.\n\n \n Again, another obvious threat of condemnation. If your belief was not fear based, you wouldn't be even arguing anything of the sort. But virtually every time you start to lose, out comes the \"Agree with me or Burn in Hell\" mantra. It was old the first time and it's old the 1,000th time. Furthermore, your argument is flawed for the same reason that Pascal's Wager is flawed. You cannot even hope to ever prove that your God is the true God, much less that any Gods exist. For all statistically purposes, you and everyone you call an atheist is equally screwed as we cannot know if 1) Gods actually exist 2) Which Gods actually exist 3) Which punishments if any they will deliver for not believing in them and 4) If there are any Gods which will reward not believing in a false God. If #4 is correct, Atheists are actually better off then you are, as you will be punished for believing in a false God where atheists did not. On top of that you make another list of fallacious links. You argue that to argue against you is to condemn and reject God's love. ShadowPickachu is a Christian and he regularly calls your frauds out. The keyword here is interpretation, and you have fallaciously assumed that your interpretation is the only valid one. Seeing as how you cannot even prove your God exists, proving YOUR interpretation will be impossible. Just because we reject your view of the Bible (hoaxes and all) does not mean they we reject God. Furthermore, as I stated prior, the Flaw of Pascal's Wager means there is a chance that you in rejecting other Gods have rejected the true God.\n \n \nIn the blue I said that in the end, when you know all truth in your eternal bodies you will finally understand that the secular humanist lies and the atheistic emptiness that you so fervently embrace today are in fact the lost and shallow superstitious beliefs that led so many from this generation to their own destruction.\n\n \n Not only does my signature disprove this garbage before you even posted it, but secular humanism is the rejection of shallow superstitious beliefs. Instead of believing that if you step on a crack you'll break your mother's back, it bases its belief on empirical, tested evidence. Something, you as a creationists will never understand. How can an ideology that is anchored in empirical evidence be beholden to shallow superstitious beliefs as opposed to a belief that is evidence free and is loudly proclaimed on faith, which by definition is a belief without evidence?\n \n \nYou will understand that those people whom you called stupid and dumb\n\n \n Only you and a few others here. Not all Christians are stupid, likewise not all religious people are stupid. In my experience, many Jews are extremely intelligent. Stop trying to fallaciously argue that you represent all religious folk. \n \n \nas they shared such a simple gospel with you were the enlightened ones and you were the saps who believed the lies of the enemy of God and Man, who wanted nothing more than to hold you up before God and boast that he has stolen Gods precious children as satan casts you into the pit of outer darkness for all time where he already knows he is going to be.\n\n \n What the hell does that mean? Sharing your belief is one thing. What you do is entirely different. \n \n \nThrough all of that experience the only person you will condemn is you\n\n \n Not true. Sola Gratia. Learn your own religion for a change. \n \n \nbecause you wil....but I mourn for you.\n\n \n You've already made two, count them TWO eternal condemnation threats in that post alone. And relied on a host of fallacious, outright dishonest arguments to tie your asinine beliefs to Christanity when in fact you are a Biblist. \n \n \nHopefully this makes clear for you that I'm not condemning any of you at all. But you are condemning yourselves and I am just warning you of the inevitable and promising you that unless you repent of your ways and accept His free gift that the above is the end result for you. With that said, I wish you all who condemn me, peace, In Jesus Holy Name...\n\n \n Everyone can see that you respond to religion out of fear and fear alone.", 
   {}, 
   296788, 
   null, 
   1200045000.0
  ], 
  [
   296806, 
   null, 
   "obvious_child", 
   "Which was in response to wizard calling Christianity a myth and man made superstitions that is dying.\n\n \n This alone warrants a post. \n \n Christanity is a myth, all religions are. If it was not a myth, it would be fact, with solid, testable evidence to prove its assertions and that its God exists. Obviously this is not true. However, remember that virtually every myth has its origin in fact but over time gets told over and over with pieces modified, added and removed to the point where no one can prove the myth is indeed true. You cannot prove your God exists. That alone qualifies the religion as a myth. This does not mean there are no good parts of Christanity, only that you cannot take it as absolute fact. As for man-made superstitions, there is no evidence that it is any more valid then religions you call man-made superstitions. Stop being a hypocrite for once in your life. As for dying, well that's depends on what you classify Christanity as. I agree, there are a lot more biblists around then there used to be and self-proclaimed Christians in the US has been on the decline. Dying however is another story if you take the religion on face value and don't discriminate between its sects.", 
   {}, 
   296788, 
   null, 
   1200046380.0
  ], 
  [
   296813, 
   null, 
   "Zardoz", 
   "\n Furthermore, I do not recall seeing any scripture where Christ said to call those who disagree with you horrible names.\n \n Actually, Jesus called people names Himself.\n Wolves, liars, vipers, white-washed-tombs...\n \n Jesus only worked to instill peace with those who'd agree with Him.\n All others were to be cast aside and you were to move on if they didn't listen.\n By such calls in the bible, Arch should have moved on already. But, this being a forum board with potentially new posters, such is debatable. \n \n \n I do agree that Archy ties his arguments in with his interpretations and selective acceptance of the bible. \n \n I also agree with your sumation of Pascals Sucker Bet.\n \n I think the biggest problem with those like Archy is their blind faith approach to their beliefs. That somehow, being blindly loyal makes them better believers. It seems quite common and at times, increasing. One of the pitfalls is who do you blindly follow? Most interpretations don't come from the Holy Spirit but from a man in the pulpit who hands them out and tells you that 'this is the true interpretation' and then reinforces the notion not to question. Forget being a Berean and checking independantly. And if you are to be like them, the pastor twists what it means, instead of reading everything independantly and questioning things in doubt, they'll hand lead you to the selected passages that back up their message and away from anything contradictorary. \n Another pitfall is unconsciously allowing your own desires and predispositions into the interpretations. But, rather than acknowledging that that is what you're doing, such unconscious beliefs are hailed as being a manifestation of the Holy Spirit.\n This can be seen in the Gay Marriage vs Divorce debates. Where is the focus placed? \n \n While Arch thinks he's doing the work of the Evangelical and repeating only what God has said, I don't recall hearing that he was called by God to do so. Nor that he's been trained to do so and given the skills needed to be even remotely successful. Nor that he's been particularly successful in his endeavors. Nor the notion that a impersonal forum board is the proper medium to do so. Nor, that his own personal life (which we can't witness) would be an example for others to see. And, as has been stated several times, Arch gets some of his regurgitations wrong and at the very least, places emphasis on selective parts of the bible that seem more self-serving while overlooking more relevant passages.\n \n Always quick to call on others to follow his beliefs but reluctant to repent of his own errors when they are pointed out.\n But, then again, blind faith allows for no seeing of your own flaws.", 
   {}, 
   296804, 
   null, 
   1200060540.0
  ], 
  [
   296821, 
   null, 
   "HonestAbe", 
   "Great posts everyone. Thanks.\n \n ArchAngel seems to trying to convince himself of the veracity of his beliefs, me thinks. Religion is nothing more than a cult. AA is a cultist.", 
   {}, 
   296813, 
   null, 
   1200065400.0
  ], 
  [
   296833, 
   null, 
   "Archangel", 
   "Obviously you never heard how to read between the lines in grade school. \n\n \n Interesting double standards you live by and practice here oc. When you all twist and misinterpret what I say it is reading between the lines, but when I interpret what you say properly I am lying. Simply put though, I proved I didn't threaten your condemnation but simply promised you are heading toward condemning yourselves.\n \n \n is still a obvious threat of condemnation. You are clearly stating that since we disagree with you, we're screwed since you believe that your God and the afterlife it has so allegedly created (note you cannot prove this) will result in our damnation. You tie your arguments into the rejection of God's love, which is obviously a big fat lie as your arguments are in no way related to God's love and your argument often are contradictory to the nature of Christ. You spew lies, hatred, vile and horrible things that break the TOS over and over. Now I haven't seen any scripture where Jesus said it was okay to lie as you did with the Freaky Link's TV show prop, but maybe there is. Furthermore, I do not recall seeing any scripture where Christ said to call those who disagree with you horrible names. But I do remember from my years in a non-denomination private school that Christ told his followers to make peace, accept people for who they are and love them. Not do what you do. Trying to argue that your beliefs, especially when they are irrelevant to religion are tied to God's love is just dishonest. But you are no Christian: You worship the bible.\n\n \n Uh, NO I'M NOT. Especially not since you are disagreeing with me. Again, slowly now... You are denying the eternal truths of the living God who's image you are made in. For that spiritual denial, blindness and rejection you will condemn yourself. No one but you can condemn you.\n \n \n, another obvious threat of condemnation. If your belief was not fear based, you wouldn't be even arguing anything of the sort. But virtually every time you start to lose, out comes the \"Agree with me or Burn in Hell\" mantra. It was old the first time and it's old the 1,000th time. Furthermore, your argument is flawed for the same reason that Pascal's Wager is flawed. You cannot even hope to ever prove that your God is the true God, much less that any Gods exist. For all statistically purposes, you and everyone you call an atheist is equally screwed as we cannot know if 1) Gods actually exist 2) Which Gods actually exist 3) Which punishments if any they will deliver for not believing in them and 4) If there are any Gods which will reward not believing in a false God. If #4 is correct, Atheists are actually better off then you are, as you will be punished for believing in a false God where atheists did not. On top of that you make another list of fallacious links. You argue that to argue against you is to condemn and reject God's love. ShadowPickachu is a Christian and he regularly calls your frauds out. The keyword here is interpretation, and you have fallaciously assumed that your interpretation is the only valid one. Seeing as how you cannot even prove your God exists, proving YOUR interpretation will be impossible. Just because we reject your view of the Bible (hoaxes and all) does not mean they we reject God. Furthermore, as I stated prior, the Flaw of Pascal's Wager means there is a chance that you in rejecting other Gods have rejected the true God.\n\n \n Again, it isn't a threat but a promise due to your rejection of the spiritual part of each person that you are apparently completely oblivious to. That is what I mourn for you about. Your blindness of that other aspect of what makes you human.\n \n As for holding up SP as an example of what a true christian is, I must thank you on two fronts. One, because it shows that you don't even know the difference between a true believer with a living relationship with God and a cultural christian who wouldn't know the living God if they bumped into Him. And two, for the comedy relief, because even calling SP a christian is the joke of the day. emoticon_smile \n \n \nNot only does my signature disprove this garbage before you even posted it, but secular humanism is the rejection of shallow superstitious beliefs. Instead of believing that if you step on a crack you'll break your mother's back, it bases its belief on empirical, tested evidence. Something, you as a creationists will never understand. How can an ideology that is anchored in empirical evidence be beholden to shallow superstitious beliefs as opposed to a belief that is evidence free and is loudly proclaimed on faith, which by definition is a belief without evidence?\n\n \n Your signature PROVES absolutely nothing child, other than you are shallow and delusional in your perspective on life and the spiritual aspect of who you are. How deluded are you to hold your siggy up as evidence of anything? It's laughable really isn't it? Yet you can actually say it with a straight face.\n \n \n you and a few others here. Not all Christians are stupid, likewise not all religious people are stupid. In my experience, many Jews are extremely intelligent. Stop trying to fallaciously argue that you represent all religious folk.\n\n \n Sure,you mean cultural christians who hold to no real scriptural principles in their lives like sp, huh? but if they are creationists who reject evo, abiogenesis and the perceived age of the Universe and the Earth based on the alleged pseudo science that is promoted today they are stupid XXXXXX right? So what you're saying is anyone who rejects the secular humanist fairy tales and superstitious myths that your side propagates as I reject them is a stupid idiot, right? Thanks for the clarification. \n \n \n the hell does that mean? Sharing your belief is one thing. What you do is entirely different.\n\n \n Here is what you fail to recognize child. I don't share just my beliefs, but more what the bible says. It is that which you reject. So it isn't me condemning anyone here but the Word of God which convicts all of us of its truth. You wrongly blame me as if I'm the author of what convicts and condemns you. \n \n And yet all of your condemnations of me and rejections and mockeries of Jesus Christ and what He did for us comes directly from you, no other source of wisdom or knowledge. It is your heart that is closed and hard and full of hatred for the gospel of Christ. Again, proving why in all of your scoffing I mourn your loss while in all of your hatred you condemn me and my God.\n \n \n true. Sola Gratia. Learn your own religion for a change. \n\n \n You learn the gospel child, and you will learn that you most definitely control your own eternal destiny. But your heart has been hardened to hate the truth and cling to the lie for some reason which is beyond me to understand. Again a reason to mourn your loss rather than hate and condemn you. After all child, why would I want to condemn the already condemned? It makes no sense. \n \n \n already made two, count them TWO eternal condemnation threats in that post alone. And relied on a host of fallacious, outright dishonest arguments to tie your asinine beliefs to Christanity when in fact you are a Biblist.\n\n \n Again you prove very well that you wouldn't recognize the truth if you tripped over it. How sad for you. So I guess if I say to you that the day will come when you will know how utterly and eternally wrong those beliefs are; you will accuse me of condemning you again, right? So just promising that you will eventually be enlightened and know Gods truth is a threat to you, huh?\n \n \n can see that you respond to religion out of fear and fear alone.\n\n \n Oh how I wish you could spend just one minute in my being so you could experience the joy and unconditional love I live with every moment of my life. Just one minute of what I know and you would cry out into the spiritual darkness of this World to the living God of Love in Jesus name. You would immediately recognize the truth and understand that you want to share the most precious gift in life with others who are spiritually dead as you NOW ARE. And like me, you would then be subjected to the hate, rejection and condemnation of people like you are today. And for that very real affliction of spiritual death which resides in you child, I truly mourn for you.", 
   {}, 
   296804, 
   null, 
   1200073200.0
  ], 
  [
   296842, 
   null, 
   "jitobear", 
   "Uh, NO I'M NOT. Especially not since you are disagreeing with me. Again, slowly now... You are denying the eternal truths of the living God who's image you are made in. For that spiritual denial, blindness and rejection you will condemn yourself. No one but you can condemn you.\n\n \n Thats a nice way of couching it it, but they fact remains that whether it comes from you, or your regurtation of what you read in the Bible when you proselytize - it is still a threat. Removing yourself from directly making the threat doesn't change the fact that it is a threat and the motivation behind that is to cause fear.", 
   {}, 
   296833, 
   null, 
   1200075780.0
  ], 
  [
   296845, 
   null, 
   "Archangel", 
   "Thats a nice way of couching it it, but they fact remains that whether it comes from you, or your regurtation of what you read in the Bible when you proselytize - it is still a threat. Removing yourself from directly making the threat doesn't change the fact that it is a threat and the motivation behind that is to cause fear.\n\n \n Get this right Jito, for the last time now, it isn't a threat at all. IT'S A SPIRITUAL PROMISE!!! You can't hide from it or evade it in any way. Nor can I threaten or condemn anyone as I too am a child of God just as you are.", 
   {}, 
   296842, 
   null, 
   1200076980.0
  ], 
  [
   296854, 
   null, 
   "jitobear", 
   "Get this right Jito, for the last time now, it isn't a threat at all. IT'S A SPIRITUAL PROMISE!!! You can't hide from it or evade it in any way. Nor can I threaten or condemn anyone as I too am a child of God just as you are.\n\n \n A promise to do harm is a threat. Threats are terroristic. Use of terror makes you a pig - whether you are a human or a deity. I don't respect anyone who uses such tactics and I certainly won't worship a god that is held to lower standards than I expect from myself or my fellow humans.\n \n You may not be personally making said threat. But you sure revel in it. I have yet to meat someone who speaks of damnation who does not do so with the glee that they believe they will be spared it and all them folks they don't like won't be. Frankly I find the mentality of it sadistic and childish.", 
   {}, 
   296845, 
   null, 
   1200081900.0
  ], 
  [
   296858, 
   null, 
   "Archangel", 
   "A promise to do harm is a threat. Threats are terroristic. Use of terror makes you a pig - whether you are a human or a deity. I don't respect anyone who uses such tactics and I certainly won't worship a god that is held to lower standards than I expect from myself or my fellow humans.\n \n You may not be personally making said threat. But you sure revel in it. I have yet to meat someone who speaks of damnation who does not do so with the glee that they believe they will be spared it and all them folks they don't like won't be. Frankly I find the mentality of it sadistic and childish.\n\n \n So in other words, no matter how many times I say to repent of your mocking ways and plainly tell you how one must be saved, and then warn you of of the consequences of rejecting Gods truths, and make clear that you yourself will realize one day that it was only you who is to blame for rejecting that truth which is freely offered, it is still me making the threat that offends you rather than the reality of the warning itself? And if I revel in going to heaven as you all go to hell the pray tell why am I always being accused of proselytizing by the atheist hate mongers around here? Why would someone who revels in the suffering of others tell them how to avoid it so constantly?\n \n I must maintain Jito that in the final analysis, you will hate only one person for where you end up in eternity. And that will be YOU ALONE whom you will understand willfully rejected the love of a personal God in favor of hatred for Him and His children who told you about what He so freely offers all who seek Him. And again, for the umteenth time, I say that mournfully, not boastfully.", 
   {}, 
   296854, 
   null, 
   1200085500.0
  ], 
  [
   296860, 
   null, 
   "Penfold", 
   "Why would he hate something which has no existence since he lacks belief in it?", 
   {}, 
   296858, 
   null, 
   1200086040.0
  ], 
  [
   296862, 
   null, 
   "thelmoose", 
   "Why should \"rejecting the love of god\" or anything be considered hate?\n Are all atheists \"hate mongers\"?\n \n \n I guess it is comforting for some to neatly divide the world into black and white. Saves the troublesome chore of thinking.", 
   {}, 
   296858, 
   null, 
   1200089100.0
  ], 
  [
   296867, 
   null, 
   "Archangel", 
   "Why should \"rejecting the love of god\" or anything be considered hate?\n Are all atheists \"hate mongers\"?\n \n\n \n When it comes to the atheists on this forum, it seems they are. But I will leave final judgment up to God.", 
   {}, 
   296862, 
   null, 
   1200092700.0
  ], 
  [
   296868, 
   null, 
   "jitobear", 
   "So in other words, no matter how many times I say to repent of your mocking ways and plainly tell you how one must be saved, and then warn you of of the consequences of rejecting Gods truths, and make clear that you yourself will realize one day that it was only you who is to blame for rejecting that truth which is freely offered, it is still me making the threat that offends you rather than the reality of the warning itself? And if I revel in going to heaven as you all go to hell the pray tell why am I always being accused of proselytizing by the atheist hate mongers around here? Why would someone who revels in the suffering of others tell them how to avoid it so constantly?\n \n I must maintain Jito that in the final analysis, you will hate only one person for where you end up in eternity. And that will be YOU ALONE whom you will understand willfully rejected the love of a personal God in favor of hatred for Him and His children who told you about what He so freely offers all who seek Him. And again, for the umteenth time, I say that mournfully, not boastfully.\n\n \n Don't worry - I am not accusing you of making threats. I know the threats come from the Bible. Its the precious deity you believe in that I am accusing. According to your Bible he is my definition of a terroristic pig. And I have been down this \"it's all your own fault that I hurt you\" road before. Heard the same song from my abusive ex-husband. What kind of wussy XXX coward is your god that he tortures those he supposedly loves when they don't do what he wants them to? \n \n Hurting people isn't love. Ever. Period. I learned that lesson well. \n \n All I accuse you of is the rather childish \"your gonna bu-urn for being different than me-e - - neener neener neener\" chant that is all too familiar from fire and brimstone protestants.\n \n Even if you are right and there is some deity out to get me for not worshiping him right - I accept that. Whether its this life or an eternity I have to live with myself and knuckling under some power-hungry, intolerant terrorist would make that rather hard.", 
   {}, 
   296858, 
   null, 
   1200093120.0
  ], 
  [
   296869, 
   null, 
   "Neanderthal79", 
   "Ar. Angel, I don't know what happened in your life to make you follow something so blindly. When that stuff was written, people had no idea what was going on in the world around them. You know that. I know you can't honestly think the bible was written by god. Why would he have made Shakespeare more articulate? You just can't blindly believe things like that man. You can't survive without thinking reasonably. \n \n But here it is, if I told you, a devout Christian, that your wife was cheating on you, or that frozen yogurt can make you invincible, you would require as much evidence as anyone else. If I tell you that the book you keep by your bed was written by an invisible deity who will punish you with fire for eternity if you fail to accept its every incredible claim about the universe, you would require no evidence whatsoever. \n \n Your brain is playing tricks on you. Sit down, relax, and consider this; Do I really believe in magic? Maybe you lost a loved one, and you want to see them again one day. I understand that, but you can't just bail on reason.\n \n And what is this #### you are telling everyone that they are going to hell if they don't repent. You don't really want to be that guy, do you. Do you think god has a special place in heaven for people who spread his word on an online debate forum? At least, at the very least, keep it between you, and your imaginary friend.", 
   {}, 
   296862, 
   null, 
   1200094620.0
  ], 
  [
   296875, 
   null, 
   "HonestAbe", 
   "Ar. Angel, I don't know what happened in your life to make you follow something so blindly. When that stuff was written, people had no idea what was going on in the world around them. You know that. I know you can't honestly think the bible was written by god. Why would he have made Shakespeare more articulate? You just can't blindly believe things like that man. You can't survive without thinking reasonably. \n \n But here it is, if I told you, a devout Christian, that your wife was cheating on you, or that frozen yogurt can make you invincible, you would require as much evidence as anyone else. If I tell you that the book you keep by your bed was written by an invisible deity who will punish you with fire for eternity if you fail to accept its every incredible claim about the universe, you would require no evidence whatsoever. \n \n Your brain is playing tricks on you. Sit down, relax, and consider this; Do I really believe in magic? Maybe you lost a loved one, and you want to see them again one day. I understand that, but you can't just bail on reason.\n \n And what is this #### you are telling everyone that they are going to hell if they don't repent. You don't really want to be that guy, do you. Do you think god has a special place in heaven for people who spread his word on an online debate forum? At least, at the very least, keep it between you, and your imaginary friend.\n\n \n He attacks everyone. He's like the guy who stands on a soapbox on a street corner screaming, \"Repent.\" Generally, that guy gets picked up and placed in a nice white jacket and taken away where he won't hurt himself or anyone else.", 
   {}, 
   296869, 
   null, 
   1200095520.0
  ], 
  [
   296877, 
   null, 
   "obvious_child", 
   "Interesting double standards you live by and practice here oc.\n\n \n You'll have to excuse me. I'm still laughing at the posts towards you. It's so funny how everyone agrees with me and no one agrees with you at all. \n \n \nWhen you all twist and misinterpret what I say it is reading between the lines, but when I interpret what you say properly I am lying.\n\n \n Not at all. As Jito pointed out (how many times has that been?), you are still using threats. And you only use it when you are losing an argument. \n \n \nSimply put though, I proved I didn't threaten your condemnation but simply promised you are heading toward condemning yourselves.\n\n \n Because we disagree with you. That's a obvious threat. Your implicit argument is because we disagree with you, we're going to Hell. Everyone can see it. Most of us are used to seeing it after dealing with religious people who lack good debating skills. \n \n \nUh, NO I'M NOT. Especially not since you are disagreeing with me.\n\n \n Bull****. You never use that on anyone who is not disagreeing with you even if they are an atheist. And you use it on people who do believe in God(s) even other Christians. If you ever wondered why you are looked down on in contempt by theists and atheists here in unison, that is why. A constant fall back on \"agree or burn\" principle is pathetic.\n \n \nAgain, slowly now... You are denying the eternal truths of the living God who's image you are made in.\n\n \n The Flaw of Pascal's wager destroys that argument and makes you guilty of the same thing. You cannot prove your God. Until you can, your comments are worthless as anything other then threats. It is obvious your religion is based on fear. A religion that is not based on fear, such as Deism never uses such threats. You will never see a Deist who's losing a religious argument fall back on what you do for a key reason: that religion is not based on fear at all, where your's obviously is. \n \n \nFor that spiritual denial, blindness and rejection you will condemn yourself. No one but you can condemn you.\n\n \n Wrong again! Sola Gratia! Learn your own religion for a change. And given the flaw of Pascal's wager, you have likely condemned yourself for believing in the wrong God. \n \n \nAgain, it isn't a threat but a promise due to your rejection of the spiritual part of each person that you are apparently completely oblivious to. That is what I mourn for you about. Your blindness of that other aspect of what makes you human.\n\n \n What? It's not a threat but a promise you'll be screwed? How is that not a threat?\n \n It's not a threat that if you keep doing what you're doing, you'll burn in Hell. That's not a threat? Are you seriously?\n \n And since you think that blindness removes my part of humanity, you must think that accepting factless ideas, without any proof, with huge problems in logic is humanity. Being completely irrational and often nonsensical is human. Got it. \n \n \nAs for holding up SP as an example of what a true christian is,\n\n \n WILL YOU STOP LYING?\n \n I never said that SP was a true Christian. I have no idea what a True Christian is. I'm not even sure that a True Christian even exists. My point which you are so twisting is that your interpretation is no more correct then his and neither of you two can ever hope to prove that your interpretation is the correct one. But unlike you, SP doesn't use veiled threats of Hell whenever he's losing an argument. \n \n \nI must thank you on two fronts. One, because it shows that you don't even know the difference between a true believer with a living relationship with God and a cultural christian who wouldn't know the living God if they bumped into Him. And two, for the comedy relief, because even calling SP a christian is the joke of the day. emoticon_smile \n\n \n Amusing how you have no problem spiting on the lessons of Christ when it suits you. Again, you ignored the majority of that paragraph. \n \n So here it is again, so you can't ignore it:\n \n If your belief was not fear based, you wouldn't be even arguing anything of the sort. But virtually every time you start to lose, out comes the \"Agree with me or Burn in Hell\" mantra. It was old the first time and it's old the 1,000th time. Furthermore, your argument is flawed for the same reason that Pascal's Wager is flawed. You cannot even hope to ever prove that your God is the true God, much less that any Gods exist. For all statistically purposes, you and everyone you call an atheist is equally screwed as we cannot know if 1) Gods actually exist 2) Which Gods actually exist 3) Which punishments if any they will deliver for not believing in them and 4) If there are any Gods which will reward not believing in a false God. If #4 is correct, Atheists are actually better off then you are, as you will be punished for believing in a false God where atheists did not. On top of that you make another list of fallacious links. You argue that to argue against you is to condemn and reject God's love. ShadowPickachu is a Christian and he regularly calls your frauds out. The keyword here is interpretation, and you have fallaciously assumed that your interpretation is the only valid one. Seeing as how you cannot even prove your God exists, proving YOUR interpretation will be impossible. Just because we reject your view of the Bible (hoaxes and all) does not mean they we reject God. Furthermore, as I stated prior, the Flaw of Pascal's Wager means there is a chance that you in rejecting other Gods have rejected the true God.\n \n notice I did not say true Christian, you bibilist. \n \n \nYour signature PROVES absolutely nothing child, other than you are shallow and delusional in your perspective on life and the spiritual aspect of who you are.\n\n \n This is hilarious. My perspective is shallow because I recognize there are more religions out there then Christanity and that everyone who disagrees with you does not fit into one category. \n \n Alright, let's examine the opposite, a depthful perspective holds that only Christanity exists in the religious world and everyone who disagrees with you, regardless of actual beliefs can be called and placed into one category which you define. You must accept this or retract your claim. \n \n Since I was in an argument where self proclaimed Communist and an ardent anarchist disagreed with me, you say it is okay to call them both dirty Capitalists. Furthermore, since you disagree with me, I can call you an atheist since I'm an theist. Good job. I will now refer to you from now on as an atheist under your own argument. \n \n I can already here the rest of the forum laughing at you for that. \n \n \nHow deluded are you to hold your siggy up as evidence of anything? It's laughable really isn't it? Yet you can actually say it with a straight face.\n\n \n It's laughable that people think there is more then one religion? So Islam, Buddhism, Judaism, Shinto, Manicheism, Yezidism, Zorasatrinism, Norse Mythology, The Pantheon, The Roman Gods, the Mayan and Aztec religions, animism, Drudism, and the rest of Paganism are not actually religions?\n \n Furthermore, that everyone who disagrees with you despite believing in Gods are atheists? Since you called several Christians in the Evolution threads atheists, you are therefore an atheist. If the God they believe in, which happens to be your God is actually not an God (since that is a requirement to be an atheist), you are therefore an atheist as well. I annihilated Marc9000 when he tried something similar and he made one of his rare admissions of wrongness. I suggest you learn from his mistake. \n \n \nSure,you mean cultural christians who hold to no real scriptural principles in their lives like sp, huh? \n\n \n Like you. You obviously do not practice what Christ taught. But you culturally live it. \n \n \nbut if they are creationists who reject evo, abiogenesis and the perceived age of the Universe and the Earth based on the alleged pseudo science that is promoted today they are stupid XXXXXX right?\n\n \n There is nothing in the Bible that states the earth is 6,000 years old. Furthermore, Genesis when taken literally allows evolution to occur. You are applying your interpretation without evidence. And remember that you used a very large number of known frauds in your argument. Did Christ tell you to LIE YOUR XXX OFF?\n \n \nSo what you're saying is anyone who rejects the secular humanist fairy tales and superstitious myths that your side propagates as I reject them is a stupid idiot, right? Thanks for the clarification.\n\n \n How is something a fairy tales and superstitious myths when it has empirical, testable evidence? How can it be an fairy tales and superstitious myths when it has practical applications? You ran from this argument again and I'm going to make again: Oil corporations such as Exxon use geology to find specific layers that are known to be likely sources of plant matters and swamps, which have a good chance of holding oil or natural gas. The same geology validates parts of evolution. You cannot have one without the other. You ran away from that when it was brought up in the evolution forum like it was the end of the world. \n \n \nHere is what you fail to recognize child. I don't share just my beliefs, but more what the bible says. It is that which you reject.\n\n \n Wrong. you share your interpretation of the Bible. We reject your interpretation of the Bible. You cannot prove your interpretation of the Bible any more true then you can prove your God exists.\n \n \nSo it isn't me condemning anyone here but the Word of God which convicts all of us of its truth. You wrongly blame me as if I'm the author of what convicts and condemns you. \n\n \n Your arrogance is astounding. You tie God's condemnation with a disagreement with your arguments which are made from your interpretation of the Bible. That is simply bull****. Your interpretation like I stated before, cannot be proven to be the correct one. I blame you for tying threats of condemnation to an interpretation that you claim to be absolutely true with no proof of being true. \n \n \nAnd yet all of your condemnations of me and rejections and mockeries of Jesus Christ and what He did for us comes directly from you,\n\n \n Come again? Where have I mocked Christ? I mock you and reject YOUR interpretation of the Bible.\n \n Stop Pretending That Your Interpretation Is Absolutely True\n \n \nno other source of wisdom or knowledge. It is your heart that is closed and hard and full of hatred for the gospel of Christ. Again, proving why in all of your scoffing I mourn your loss while in all of your hatred you condemn me and my God.\n\n \n Read above for why that's complete garbage.\n \n \nYou learn the gospel child, and you will learn that you most definitely control your own eternal destiny. But your heart has been hardened to hate the truth and cling to the lie for some reason which is beyond me to understand. Again a reason to mourn your loss rather than hate and condemn you. After all child, why would I want to condemn the already condemned? It makes no sense.\n\n \n Obviously you haven't learned an thing about your religion. Salvation is achieved through Grace and Grace alone. How can you call yourself a Christian and not know that? \n \n Thanks again for proving Christanity, or at least your belief is entirely fear based.\n \n And if you avoid a discussion on Pascal's wager I will hammer you like no other.", 
   {}, 
   296833, 
   null, 
   1200096720.0
  ], 
  [
   296880, 
   null, 
   "obvious_child", 
   "When it comes to the atheists on this forum, it seems they are. But I will leave final judgment up to God.\n\n \n Just because we disagree with you does not make us atheists. And you should be careful who you call an atheist as it may result in you becoming an atheist as well. And the only reason you think that the atheists are doing what you claim is because your arrogance assumes your interpretation is correct even though you lack any evidence for it. If we assumed SP's interpretation was correct, you are very, very, very far from being a Christian. Note that as I have stated before neither of you can prove your interpretation is correct. Therefore, if you were mature, you'd stop assuming your interpretation was correct and that rejections of your interpretation was a rejection of Christanity.", 
   {}, 
   296867, 
   null, 
   1200097380.0
  ], 
  [
   296881, 
   null, 
   "thelmoose", 
   "When it comes to the atheists on this forum, it seems they are. But I will leave final judgment up to God.\n\n \n It seems that they are ONLY TO YOU.\n \n But you are not leaving it up to God. You have clearly pre-empted God in making those judgements already. It is you, not God, who most vociferously is making all sorts of unwarranted judgements. You hand them out so freely and quickly, it is the definition of prejudice.", 
   {}, 
   296867, 
   null, 
   1200097560.0
  ], 
  [
   296885, 
   null, 
   "obvious_child", 
   "It seems that they are ONLY TO YOU.\n \n But you are not leaving it up to God. You have clearly pre-empted God in making those judgements already. It is you, not God, who most vociferously is making all sorts of unwarranted judgements. You hand them out so freely and quickly, it is the definition of prejudice.\n\n \n Actually Moose, it's worse. As salvation is clearly defined as being Grace and Grace alone, and only God knows who is saved and who is not, Arch is actually superseding the Will of God with his own, disregarding the timeless plan God had from the very beginning with his own, flawed judgments. Someone who reveres and worships such an God would never do such an thing.", 
   {}, 
   296881, 
   null, 
   1200098040.0
  ], 
  [
   296888, 
   null, 
   "Archangel", 
   "I am a lone voice in a wilderness of spiritual depravity. And you boast that you are somehow right because I am outnumbered. It would be laughable if it wasn't so sad that so many are so blind spiritually that they think that because they stand together in denying Gods existence, that God then must not exist. I stand by my statements that all truth will be known for all of us at the end of each of our respective lives, and if that thought offends you all, then i suggest that you do something about it now while you are able to. Otherwise, it wont be me you are cursing on that day, but yourselves for not heeding my words which you will surely understand then, the love behind them.\n \n Every response from every person above except for neanderthals is based in hatred and bitterness. But what i have said to you leads to life and eternal peace. Nothing i am saying is intended to hurt but to save. But none of you seem to appreciate an eternal perspective on life, and resent anyone who speaks from one. \n \n You also show yourself child, to be a liar and a philosophical coward by claiming above that I resort to condemning people to hell when I'm losing a debate. Well, I'm not now, nor was I losing a debate above when this whole self perceived victimization rant of yours began. And yet you make the claim.\n \n You just prove that the truth means nothing to you. That you feed on lies and you perpetuate them at every turn. So go get a hundred to condemn me, just know that even then you wont be right about what I represent.", 
   {}, 
   296885, 
   null, 
   1200100980.0
  ], 
  [
   296890, 
   null, 
   "Penfold", 
   "I see you continue to misrepresent Jefferson too, despite the earlier advice.", 
   {}, 
   296888, 
   null, 
   1200101160.0
  ], 
  [
   296891, 
   null, 
   "jitobear", 
   "I am a lone voice in a wilderness of spiritual depravity. And you boast that you are somehow right because I am outnumbered. It would be laughable if it wasn't so sad that so many are so blind spiritually that they think that because they stand together in denying Gods existence, that God then must not exist. I stand by my statements that all truth will be known for all of us at the end of each of our respective lives, and if that thought offends you all, then i suggest that you do something about it now while you are able to. Otherwise, it wont be me you are cursing on that day, but yourselves for not heeding my words which you will surely understand then, the love behind them.\n \n Every response from every person above except for neanderthals is based in hatred and bitterness. But what i have said to you leads to life and eternal peace. Nothing i am saying is intended to hurt but to save. But none of you seem to appreciate an eternal perspective on life, and resent anyone who speaks from one. \n \n You also show yourself child, to be a liar and a philosophical coward by claiming above that I resort to condemning people to hell when I'm losing a debate. Well, I'm not now, nor was I losing a debate above when this whole self perceived victimization rant of yours began. And yet you make the claim.\n \n You just prove that the truth means nothing to you. That you feed on lies and you perpetuate them at every turn. So go get a hundred to condemn me, just know that even then you wont be right about what I represent.\n\n \n Are you going to actually respond to any of the arguments presented to you or just play victim?", 
   {}, 
   296888, 
   null, 
   1200101580.0
  ], 
  [
   296896, 
   null, 
   "thelmoose", 
   "What does it say about a person who is universally criticized and the only conclusion he comes to is \"They are all wrong. Their opinions have no merit.\"?\n \n It is one thing to have convictions; that is admirable. But to disparage the integrity and morals of ALL who disagree with him (and 100% of the posters disagree with him) is the epitome of narcissism and hubris. No, it is worse, it is diagnostic of a personality disorder. \n \n \nPersonality disorder is a class of mental disorders characterized by rigid and on-going patterns of thought and action. The underlying belief systems informing these patterns are referred to as fixed fantasies. The inflexibility and pervasiveness of these behavioral patterns often cause serious personal and social difficulties, as well as a general impairment of functioning.\n \n Personality disorders are defined by the American Psychiatric Association (APA) as \"an enduring pattern of inner experience and behavior that deviates markedly from the expectations of the culture of the individual who exhibits it\". These patterns, as noted, are inflexible and pervasive across many situations, due in large part to the fact that such behavior is ego-syntonic (i.e., the patterns are consistent with the ego integrity of the individual), and therefore, perceived to be appropriate by that individual. The onset of these patterns of behavior can typically be traced back to the beginning of adulthood, and, in rare instances, early adolescence.\n [Diagnostic and Statistical Manual of Mental Disorders]\n \n\n \n Sound like someone you know?", 
   {}, 
   296891, 
   null, 
   1200104160.0
  ], 
  [
   296897, 
   null, 
   "Archangel", 
   "What does it say about a person who is universally criticized and the only conclusion he comes to is \"They are all wrong. Their opinions have no merit.\"?\n \n It is one thing to have convictions; that is admirable. But to disparage the integrity and morals of ALL who disagree with him (and 100% of the posters disagree with him) is the epitome of narcissism and hubris. No, it is worse, it is diagnostic of a personality disorder. \n \n \nPersonality disorder is a class of mental disorders characterized by rigid and on-going patterns of thought and action. The underlying belief systems informing these patterns are referred to as fixed fantasies. The inflexibility and pervasiveness of these behavioral patterns often cause serious personal and social difficulties, as well as a general impairment of functioning.\n \n Personality disorders are defined by the American Psychiatric Association (APA) as \"an enduring pattern of inner experience and behavior that deviates markedly from the expectations of the culture of the individual who exhibits it\". These patterns, as noted, are inflexible and pervasive across many situations, due in large part to the fact that such behavior is ego-syntonic (i.e., the patterns are consistent with the ego integrity of the individual), and therefore, perceived to be appropriate by that individual. The onset of these patterns of behavior can typically be traced back to the beginning of adulthood, and, in rare instances, early adolescence.\n [Diagnostic and Statistical Manual of Mental Disorders]\n\n \n Sound like someone you know?\n\n \n Yeah, you!!! And I'm reporting you for plagiarism for not posting a link to this psycho babble you stole.", 
   {}, 
   296896, 
   null, 
   1200104520.0
  ], 
  [
   296899, 
   null, 
   "Archangel", 
   "I see you continue to misrepresent Jefferson too, despite the earlier advice.\n\n \n Prove I'm misrepresenting Jefferson Penfold. I dare ya.", 
   {}, 
   296890, 
   null, 
   1200104880.0
  ], 
  [
   296900, 
   null, 
   "obvious_child", 
   "Are you going to actually respond to any of the arguments presented to you or just play victim?\n\n \n What makes you think that Arch is going to act honestly, especially since he's always been extremely dishonest since day one? \n \n Do you find it as I do, to be extremely amusing how Arch falls back on \"I'm a victim\" when he attacks others for using that? \n \n What a hypocrite. \n \n And apparently he believes that if you don't subscribe to his extremely narrow view point on Christanity, you're an atheist.", 
   {}, 
   296891, 
   null, 
   1200105060.0
  ], 
  [
   296903, 
   null, 
   "obvious_child", 
   "I am a lone voice in a wilderness of spiritual depravity.\n\n \n Where Spiritual Depravity is defined by your extremely narrow views on what constitutes Christanity and hold that all other religious and spiritual beliefs are in fact just atheism. Now that we've gotten that out of the way...\n \n \nAnd you boast that you are somehow right because I am outnumbered.\n\n \n No, that's not why we are right. It just happens to be that you're outnumbered by a large number of people who are able to shred your arguments and pinpoint what you truly are. Notice you have failed to address the vast majority of points against you and relied upon threats of Hell and I'm the victim to avoid an honest debate. \n \n \nIt would be laughable if it wasn't so sad that so many are so blind spiritually that they think that because they stand together in denying Gods existence, that God then must not exist.\n\n \n You keep stating that yet you keep avoiding how plenty of your detractors are theists. And you ignore Pascal's sucker's deal. Just because we reject your asinine interpretation of the Bible does not make us atheists.\n \n \nI stand by my statements that all truth will be known for all of us at the end of each of our respective lives, and if that thought offends you all, then i suggest that you do something about it now while you are able to. Otherwise, it wont be me you are cursing on that day, but yourselves for not heeding my words which you will surely understand then, the love behind them.\n\n \n Aside from your threat, I agree. We will find out. And statistically speaking, you and me are equally screwed. You can keep pretending that the flaw of a Pascal's wager doesn't exist, but it doesn't make that Arcturus sized hole in your argument go away. \n \n \nEvery response from every person above except for neanderthals is based in hatred and bitterness.\n\n \n I'd say more like comedy. We reject your interpretation. That is essentially everything that has to be said. It is up to you to prove that your interpretation, opposed to SP's or any other Christians is true. Until then, you are just a mindless talking head and your constantly claims of being right and having God on your side are idiotic. \n \n \nBut what i have said to you leads to life and eternal peace. Nothing i am saying is intended to hurt but to save.\n\n \n And there we have it: Proof that Arch is a Compulsive Liar. \n \n \nYou also show yourself child, to be a liar and a philosophical coward by claiming above that I resort to condemning people to hell when I'm losing a debate.\n\n \n Are you saying you do not do this? \n \n \nWell, I'm not now, nor was I losing a debate above when this whole self perceived victimization rant of yours began. And yet you make the claim.\n\n \n You JUST MADE ANOTHER THREAT! Do you ever stop lying? And you're the one using the victimization ####. Not I.\n \n \nYou just prove that the truth means nothing to you. That you feed on lies and you perpetuate them at every turn. So go get a hundred to condemn me, just know that even then you wont be right about what I represent.\n\n \n AND YOU MAKE ANOTHER! Thanks for proving my point and the fact you don't understand what consistency is, or that you proof read before posting.", 
   {}, 
   296888, 
   null, 
   1200105480.0
  ], 
  [
   296909, 
   null, 
   "Penfold", 
   "Prove I'm misrepresenting Jefferson Penfold. I dare ya.\n\n \n What an adult response.emoticon_rolleyes There is no need, it has already been done in another thread.", 
   {}, 
   296899, 
   null, 
   1200108060.0
  ], 
  [
   296912, 
   null, 
   "Archangel", 
   "What an adult response.emoticon_rolleyes There is no need, it has already been done in another thread.\n\n \n Uh huh, so you looked it up and found I'm not misrepresenting it at all didn't you. So please, it hasn't been done on another thread at all. if you are right then prove it. If not, then be an adult and apologize.", 
   {}, 
   296909, 
   null, 
   1200108900.0
  ], 
  [
   296915, 
   null, 
   "Penfold", 
   "Your edited version of his words probably carry more of his intent than you suspect.", 
   {}, 
   296912, 
   null, 
   1200109200.0
  ], 
  [
   296923, 
   null, 
   "T.Q", 
   "I see Archie's up to his old tricks again (or rather, still). As Penfold stated, Pandion already pointed out to you that your signature is a quote mine. He posted the entirety of the text that you pulled your sig from, showing that you picked and chose words and phrases from an entire paragraph, one which you'd never even read before. You ran away.\n \n I see you're also threatening hellfire and damnation again, saying how much you'll be laughing as you sip on Pina Coladas in heaven. That's a threat, no two ways about it. It doesn't matter if you're the one personally condemning anyone, you get off on the idea of people suffering as you say \"See! Toldja so!\"\n \n I also see that since you can't refute any of OC's arguments, you've resorted to calling him a liar. SOP for you Archie. Do you ever plan on pointing out any examples of our numerous lies? Penfold already pointed out one of yours. \n \n The truth is, you're the hate monger. You're the namecaller. You're the one who is \"a liar and a philosophical coward \". And any one of your threads is ample proof of this. I can back up my allegations, can you back up yours?", 
   {}, 
   296915, 
   null, 
   1200111540.0
  ], 
  [
   296935, 
   null, 
   "Archangel", 
   "I see Archie's up to his old tricks again (or rather, still). As Penfold stated, Pandion already pointed out to you that your signature is a quote mine. He posted the entirety of the text that you pulled your sig from, showing that you picked and chose words and phrases from an entire paragraph, one which you'd never even read before. You ran away.\n \n I see you're also threatening hellfire and damnation again, saying how much you'll be laughing as you sip on Pina Coladas in heaven. That's a threat, no two ways about it. It doesn't matter if you're the one personally condemning anyone, you get off on the idea of people suffering as you say \"See! Toldja so!\"\n \n I also see that since you can't refute any of OC's arguments, you've resorted to calling him a liar. SOP for you Archie. Do you ever plan on pointing out any examples of our numerous lies? Penfold already pointed out one of yours. \n \n The truth is, you're the hate monger. You're the namecaller. You're the one who is \"a liar and a philosophical coward \". And any one of your threads is ample proof of this. I can back up my allegations, can you back up yours?\n\n \n And I see that you have as difficult a time getting a story straight as your buddies do. But I hope things improve for you TQ, and that your mood is better in the future. Be at peace my angry friend. And may God bless you in every way. emoticon_xangel", 
   {}, 
   296923, 
   null, 
   1200118440.0
  ], 
  [
   296936, 
   null, 
   "electrolyte", 
   "He's like the guy who stands on a soapbox on a street corner screaming, \"Repent.\" Generally, that guy gets picked up and placed in a nice white jacket and taken away where he won't hurt himself or anyone else.\n\n Not in my part of the country. \"That guy\" comes out with dozens of friends and lines the streets.\n Of course, that never stops my friends and I from stopping and giving them a hard time. Before \"That guy\" and his friend invited reinforcements, I'd beat them down so badly they'd leave early. After the big parties started, my friends and I would draw the entire crowd of loons and leave them with nothing to say besides the blind, baseless Bible thumping we're seeing on this forum...\n \n \n[selection from DSM]\n Sound like someone you know?\n\n If I said no, I'd be lying. Telling, isn't it?", 
   {}, 
   296923, 
   null, 
   1200118620.0
  ], 
  [
   296941, 
   null, 
   "T.Q", 
   "And I see that you have as difficult a time getting a story straight as your buddies do. But I hope things improve for you TQ, and that your mood is better in the future. Be at peace my angry friend. And may God bless you in every way. emoticon_xangel\n\n \n And I see you still are incapable of responding in a coherent fashion. Yet again I ask you to support any of your many allegations. Again, you are unable to do so. Bye bye Archie", 
   {}, 
   296935, 
   null, 
   1200119580.0
  ], 
  [
   296942, 
   null, 
   "Zardoz", 
   "Anyone know what odds Vegas is giving that Arch will run away from this thread?", 
   {}, 
   296923, 
   null, 
   1200120240.0
  ], 
  [
   296943, 
   null, 
   "T.Q", 
   "Anyone know what odds Vegas is giving that Arch will run away from this thread?\n\n \n No bookie with a brain would take that bet.", 
   {}, 
   296942, 
   null, 
   1200120480.0
  ], 
  [
   296958, 
   null, 
   "obvious_child", 
   "And I see you still are incapable of responding in a coherent fashion. Yet again I ask you to support any of your many allegations. Again, you are unable to do so. Bye bye Archie\n\n \n You know better then to ask AA to support anything he's ever said. I don't even bother asking him to provide evidence. I just assume he will fail just as he has always failed to support his claims and deal with brutal refutations of his lies. AA will , pretend you never made the point, use lies/frauds/hoaxes, call you horrible names, or run away like a worthless coward. It's assumed that one if not all four will occur when he runs into semi-intelligent opposition. \n \n Zardoz has the only real viable plan here: Mock him.", 
   {}, 
   296941, 
   null, 
   1200129360.0
  ], 
  [
   296960, 
   null, 
   "T.Q", 
   "You know better then to ask AA to support anything he's ever said. I don't even bother asking him to provide evidence. I just assume he will fail just as he has always failed to support his claims and deal with brutal refutations of his lies. AA will , pretend you never made the point, use lies/frauds/hoaxes, call you horrible names, or run away like a worthless coward. It's assumed that one if not all four will occur when he runs into semi-intelligent opposition. \n \n Zardoz has the only real viable plan here: Mock him.\n\n \n Oh, I know. It's just fun to poke him and watch him follow his script.", 
   {}, 
   296958, 
   null, 
   1200131880.0
  ], 
  [
   296962, 
   null, 
   "obvious_child", 
   "Oh, I know. It's just fun to poke him and watch him follow his script.\n\n \n I got a great idea. After you write your reply to AA include below it an predicted outline of an response he'll give.", 
   {}, 
   296960, 
   null, 
   1200137040.0
  ], 
  [
   296971, 
   null, 
   "HonestAbe", 
   "Most cultist make things up as they go. Snake oil is an easy sell.", 
   {}, 
   296962, 
   null, 
   1200155700.0
  ], 
  [
   296972, 
   null, 
   "Archangel", 
   "Anyone know what odds Vegas is giving that Arch will run away from this thread?\n\n \n You want me to respond to childish nonsense? Why, so you can again accuse me of calling you guys what you are? That's ok, you all go on and throw your insults and wallow in the mud. I will still be standing and clean when you're finished.", 
   {}, 
   296942, 
   null, 
   1200156000.0
  ], 
  [
   296974, 
   null, 
   "smiley", 
   "You want me to respond to childish nonsense? Why, so you can again accuse me of calling you guys what you are? That's ok, you all go on and throw your insults and wallow in the mud. I will still be standing and clean when you're finished.\n\n \n And probably a very very long way away.", 
   {}, 
   296972, 
   null, 
   1200156180.0
  ], 
  [
   297075, 
   null, 
   "electrolyte", 
   "You want me to respond to childish nonsense? Why, so you can again accuse me of calling you guys what you are? That's ok, you all go on and throw your insults and wallow in the mud. I will still be standing and clean when you're finished.\n\n Falsely accusing us of lying and calling us \"philosophical cowards\" and \"sanctimonious hacks\" leaves you squeaky clean, huh?", 
   {}, 
   296972, 
   null, 
   1200185460.0
  ], 
  [
   297598, 
   null, 
   "lesz", 
   "Yet more reason to fear Huckabee:\n \n Huck: We Need To Amend The Constitution, Bring It In Line With God\n \n \nAt a Michigan campaign event last night, Mike Huckabee gave an interesting reason for why he wants to amend the Constitution to ban both abortion and gay marriage: Otherwise, the Constitution would be in conflict with God.\n \n Huckabee first observed that some of his opponents don't want to amend the Constitution on both of these topics. \"But I believe it's a lot easier to change the Constitution than it would be to change the word of the living God,\" Huckabee said. \"And that's what we need to do, is to amend the Constitution so it's in God's standards rather than try to change God's standards.\"\n\n \n Gimme that old time religion\n Gimme that old time religion\n Gimme that old time religion\n It's good enough for YOU.\n \n Maybe he should just amend the Constitution to declare the Baptist faith the established religion of the United States. After all, no-one else is a \"real\" Christian. emoticon_rolleyes", 
   {}, 
   297075, 
   null, 
   1200498120.0
  ], 
  [
   297668, 
   null, 
   "HonestAbe", 
   "Yet more reason to fear Huckabee:\n \n Huck: We Need To Amend The Constitution, Bring It In Line With God\n \n \n \n Gimme that old time religion\n Gimme that old time religion\n Gimme that old time religion\n It's good enough for YOU.\n \n Maybe he should just amend the Constitution to declare the Baptist faith the established religion of the United States. After all, no-one else is a \"real\" Christian. emoticon_rolleyes\n\n \n Huckabee and Romney both are nut cases.", 
   {}, 
   297598, 
   null, 
   1200524220.0
  ], 
  [
   297683, 
   null, 
   "Zardoz", 
   "Yet more reason to fear Huckabee:\n \n Huck: We Need To Amend The Constitution, Bring It In Line With God\n \n\n \n \n At least I was PAID to listen to that. emoticon_cool \n \n But, yeah...ummm...yeah...\n \n At least he knows how to charm 'em good.\n \n I can see him as a doctor delivering a baby boy.\n \"Ohhh you cute little thing you. Coochy-coo. Ahh that's right, momma's just right over there. That's right, you're a sweet thing you are. All ole uncle Huck needs to do now is cut off your **** and sew your eyes shut. Yes I do. Yes I do. Ahh, your such a good puppy yes you are. Yess you are...\"\n \n I mean, who cares what he says so long as he says it well...", 
   {}, 
   297598, 
   null, 
   1200525900.0
  ], 
  [
   297705, 
   null, 
   "HonestAbe", 
   "At least I was PAID to listen to that. emoticon_cool \n \n But, yeah...ummm...yeah...\n \n At least he knows how to charm 'em good.\n \n I can see him as a doctor delivering a baby boy.\n \"Ohhh you cute little thing you. Coochy-coo. Ahh that's right, momma's just right over there. That's right, you're a sweet thing you are. All ole uncle Huck needs to do now is cut off your **** and sew your eyes shut. Yes I do. Yes I do. Ahh, your such a good puppy yes you are. Yess you are...\"\n \n I mean, who cares what he says so long as he says it well...\n\n \n Ouch. Having your eyes sewn tight hurts like the dickens.", 
   {}, 
   297683, 
   null, 
   1200530400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Religious Election", 
  "url": "http://www.4forums.com/political/religion-debates/10765-religious-election.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10765, 
  "discussion_files": [
   [
    "31119.html", 
    "http://www.4forums.com/political/religion-debates/10765-religious-election-print.html"
   ], 
   [
    "31120.html", 
    "http://www.4forums.com/political/religion-debates/10765-religious-election-8-print.html"
   ], 
   [
    "31121.html", 
    "http://www.4forums.com/political/religion-debates/10765-religious-election-6-print.html"
   ], 
   [
    "31122.html", 
    "http://www.4forums.com/political/religion-debates/10765-religious-election-4-print.html"
   ], 
   [
    "31123.html", 
    "http://www.4forums.com/political/religion-debates/10765-religious-election-5-print.html"
   ], 
   [
    "31124.html", 
    "http://www.4forums.com/political/religion-debates/10765-religious-election-7-print.html"
   ], 
   [
    "31125.html", 
    "http://www.4forums.com/political/religion-debates/10765-religious-election-3-print.html"
   ], 
   [
    "31126.html", 
    "http://www.4forums.com/political/religion-debates/10765-religious-election-2-print.html"
   ]
  ], 
  "identifier": 10765
 }
]