[
 [
  [
   295730, 
   null, 
   "jyoshu", 
   "Any predictions for candidates?\n \n I'm going to go out on a limb here and predict that the race will end up being between Huckabee and Obama.", 
   {
    "post_info": {
     "post_title": "Candidate Predictions"
    }
   }, 
   null, 
   null, 
   1199172540.0
  ], 
  [
   295744, 
   null, 
   "jitobear", 
   "Any predictions for candidates?\n \n I'm going to go out on a limb here and predict that the race will end up being between Huckabee and Obama.\n\n \n I hope the Republicans have the brains to give the ticket to Paul. Huckabee may have some conservative Christians excited but if he does get the Republican ticket I suspect he will flop big-time. There is not enough moderation in him. No democrat will vote for him and he will likely lose moderate, non-Christians values driven Republicans as well. Clinton could likley have a similar effect - but I still think its a toss up between her and Obama. I am also hoping that the Democrats have the brains to back Richardson, but there isn't enough hype around him.", 
   {}, 
   295730, 
   null, 
   1199201460.0
  ], 
  [
   295745, 
   null, 
   "Bassman", 
   "One Major liability with Paul is that he supports ninteenth century-style Isolationism, which in this day and age, and with the threat that America and her allies are facing today, is totally impractical. I think it will be Shrillery vs. Thompson.", 
   {}, 
   295744, 
   null, 
   1199203860.0
  ], 
  [
   295747, 
   null, 
   "Archangel", 
   "I think when all is said and done it will be between Romney and Hillbilly. This is not necessarily what I want to see happen, but what i believe will happen. Once again in American Politics the most money will determine who makes it to the end, and those with the most money is the two mentioned above. Which also probably means they are aligned with the most special interest groups and PACS. Go figure huh?", 
   {}, 
   295745, 
   null, 
   1199204700.0
  ], 
  [
   295748, 
   null, 
   "Symbiote", 
   "One Major liability with Paul is that he supports ninteenth century-style Isolationism\n\n \n Isolationism refers to the doctrine of both\n \n a) military noninterventionism, which Paul supports, unless there is a declaration of war by congress.\n \n and\n \n b) nationalist economic protectionism, which Paul opposes. He would remove barriers to international trade and end sanctions placed on eg. Cuba\n \n to quote wikipedia\n \nIsolationism is a foreign policy which combines a non-interventionist military policy and a political policy of economic nationalism (protectionism). In other words, it asserts both of the following:\n \n Non-interventionism - Political rulers should avoid entangling alliances with other nations and avoid all wars not related to direct territorial self-defense. \n Protectionism - There should be legal barriers to control trade and cultural exchange with people in other states. \n\n \n It is thus inaccurate to call him an \"isolationist\". Noninterventionist sure, isolationist, no. It's like labelling someone a Mormon simply because they believe in Jesus.\n \n As to the thread title: Republicans too early to call, all the candidates suffer from regression to the mean, whenever one gets ahead they get shat on until they're dragged back in line. Fred Thompson for example, only seems to be in the race to talk trash about his competitors, and the exchanges that result only succeed in making them all look like fools. (And yet somehow, this half assed performance is dragging him into line with the rest of them, you get the feeling if there were a box labelled \"none of the above\", it'd be winning the republican primaries by a mile.\n \n Hilary is likely, we should know for sure after Iowa, it's Obama's only real chance to break through.", 
   {}, 
   295745, 
   null, 
   1199204940.0
  ], 
  [
   295752, 
   null, 
   "Jo Bennett", 
   "What do you make of the rumours about Bloomberg running as an independent?", 
   {}, 
   295748, 
   null, 
   1199207880.0
  ], 
  [
   295754, 
   null, 
   "Archangel", 
   "What do you make of the rumours about Bloomberg running as an independent?\n\n \n Bloomberg is a billionaire and could outspend all comers in the general election. Word has it that he spent 200 million of his own money buying the mayoral election and it has been guestimated that if he got into this race his budget would be 1/2 billion dollars to buy the Presidency.\n \n The question remains how he could get the signatures needed to get on the ballots this late in the game for a National election. There are just some things money can't buy. Another problem he has is that he ran for Mayor as a Republican and then became an Independent when public support for Iraq dwindled so he has a reputation as a disloyal plitico who will abandon his Party for personal gain. So I doubt he can count on any Republican support at all this time around, and we all know that no third party candidate can compete today as the two major parties have stacked the proverbial deck against them with election laws and regulations. That's my take on Bloomberg.", 
   {}, 
   295752, 
   null, 
   1199209860.0
  ], 
  [
   295755, 
   null, 
   "Neanderthal79", 
   "I know this is off topic, but I was just thinking about this the other day. We live in a country where a person can not get elected president if they openly doubt the existence of heaven and hell. This is remarkable, give that there is no other body of 'knowledge' that we require our political leaders to master. Even a hairstylist must pass a licensing exam before plying their trade in the U.S., and yet those given the power to make war and national policy, those whose decisions will affect life for generations, are not expected to know anything in particular before setting to work. They do not have to be political scientists, economists, or even lawyers; they need not have studied international relations, military history, resource management, civil engineering, or any other field of knowledge that one might need in the governance of a modern superpower. They need only be expert fund-raisers, carry themselves well on television, and believe certain myths. \n \n In a U.S. election, an actor who reads his bible would certainly defeat a rocket scientist who does not.", 
   {}, 
   295754, 
   null, 
   1199212740.0
  ], 
  [
   295768, 
   null, 
   "jyoshu", 
   "I know this is off topic, but I was just thinking about this the other day. We live in a country where a person can not get elected president if they openly doubt the existence of heaven and hell. This is remarkable, give that there is no other body of 'knowledge' that we require our political leaders to master. Even a hairstylist must pass a licensing exam before plying their trade in the U.S., and yet those given the power to make war and national policy, those whose decisions will affect life for generations, are not expected to know anything in particular before setting to work. They do not have to be political scientists, economists, or even lawyers; they need not have studied international relations, military history, resource management, civil engineering, or any other field of knowledge that one might need in the governance of a modern superpower. They need only be expert fund-raisers, carry themselves well on television, and believe certain myths. \n \n In a U.S. election, an actor who reads his bible would certainly defeat a rocket scientist who does not.\n\n \n That may be, but it goes to show that religion in very important to many Americans. Good or bad, there would probably be a lot of mistrust toward someone who was an atheist. I do think there's something to be said for being able to identify with the people of the country, and that would be difficult for someone who was openly non-religious.\n \n Also, FWIW, I don't think being a rocket scientist qualifies anyone to be president any more or less than someone who reads a Bible.", 
   {}, 
   295755, 
   null, 
   1199220900.0
  ], 
  [
   295773, 
   null, 
   "nate895", 
   "you get the feeling if there were a box labelled \"none of the above\",\n\n \n You can vote \"uncommitted,\" from what I've heard on the news\n \n I say Ron Paul will win the nomination if he can do one of these three things;\n 1) come with 3/5 early state wins (this means the polls are BS, and he was winning anyway)\n 2) stay in the race (since he probably has probably more $ than anyone) until it becomes Giuliani v. Paul (and Giuliani hasn't clinched yet)\n 3) Get Thompson to drop out and endorse him (because they agree on everything but the war)\n \n Go RON PAUL", 
   {}, 
   295768, 
   null, 
   1199223540.0
  ], 
  [
   295779, 
   null, 
   "jitobear", 
   "That may be, but it goes to show that religion in very important to many Americans.\n\n \n Its interesting though - asking this question (what is your religion) or even having it considered in any other job of the secular sphere is illegal. \n \n I also fail to see how simply having faith makes one trust worthy.", 
   {}, 
   295768, 
   null, 
   1199232300.0
  ], 
  [
   295824, 
   null, 
   "jim's trucking", 
   "Obama/Clinton vs. Romney/Huckabee", 
   {}, 
   295779, 
   null, 
   1199293080.0
  ], 
  [
   295857, 
   null, 
   "Zardoz", 
   "The Anti-Christ vs A pretender.", 
   {}, 
   295824, 
   null, 
   1199304240.0
  ], 
  [
   295862, 
   null, 
   "jim's trucking", 
   "The Anti-Christ vs A pretender.\n\n It's not quite time for the anti-Christ!", 
   {}, 
   295857, 
   null, 
   1199308380.0
  ], 
  [
   295897, 
   null, 
   "Symbiote", 
   "Bloomberg's potential entry into the race seems confused pointless and weird, the rhetoric is that there is too much partisanship, and not enough cooperation between republicans and democrats (because you know, the democratic congress hasn't bowed to bush's demands and supported his war ever since it had power).\n \n Bloomberg laments that America's international image has been tarnished, but nevertheless strongly believes the iraq war was an appropriate response to 9/11 and integral to the \"war on terror\".\n \n So I honestly don't know what his game is, his ideals are very much in like with that of the Republicrats already, especially the Republicans, whose votes he would be most likely to take. Maybe he just really, really hates Giuliani and wants to mess with his run if he gets the nomination?\n \n In accordance with this theory I did a little googling, and it doesn't seem like the two get along too well.\n \n http://www.nydailynews.com/news/us_world/2007/06/21/2007-06-21_rudy__mike_in_the_grudge_report-1.html\n \n while way back in 2002 when he first became mayor of NY, he was reported as publically praising Giuliani while privately reversing the decisions he had made\n \n http://query.nytimes.com/gst/fullpage.html?res=9B0DE6D9103CF935A25755C0A9649C8B63\n \n so that's what it seems to me, a bored rich man with some kind of grudge.", 
   {}, 
   295862, 
   null, 
   1199335260.0
  ], 
  [
   295902, 
   null, 
   "Archangel", 
   "Bloomberg's potential entry into the race seems confused pointless and weird, the rhetoric is that there is too much partisanship, and not enough cooperation between republicans and democrats (because you know, the democratic congress hasn't bowed to bush's demands and supported his war ever since it had power).\n \n Bloomberg laments that America's international image has been tarnished, but nevertheless strongly believes the iraq war was an appropriate response to 9/11 and integral to the \"war on terror\".\n \n So I honestly don't know what his game is, his ideals are very much in like with that of the Republicrats already, especially the Republicans, whose votes he would be most likely to take. Maybe he just really, really hates Giuliani and wants to mess with his run if he gets the nomination?\n \n In accordance with this theory I did a little googling, and it doesn't seem like the two get along too well.\n \n http://www.nydailynews.com/news/us_world/2007/06/21/2007-06-21_rudy__mike_in_the_grudge_report-1.html\n \n while way back in 2002 when he first became mayor of NY, he was reported as publically praising Giuliani while privately reversing the decisions he had made\n \n http://query.nytimes.com/gst/fullpage.html?res=9B0DE6D9103CF935A25755C0A9649C8B63\n \n so that's what it seems to me, a bored rich man with some kind of grudge.\n\n \n I completely forgot about the animosity between those two. I forget the details of what caused it but i know it is real. I doubt though that a rivalry would motivate a man to spend a half billion of his own money just to hurt the other guy. That just doesn't make any sense at all. I think if he runs that Bloomberg has a personal agenda that goes way beyond his rivalry or dislike for Rudy.\n \n And I must ask the question again, has a MAYOR of any City in America, major city or not, ever gone on to run for and win the Whitehouse? I can't think of any at all. Governors I can understand, but does running NYC, no matter how good a job he did managing it, and for crime and image alone Rudy did do a great job, but does that qualify him or Bloomberg to run the US of A? That is the question...", 
   {}, 
   295897, 
   null, 
   1199337420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Candidate Predictions", 
  "url": "http://www.4forums.com/political/elections-debates/10762-candidate-predictions.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 10762, 
  "discussion_files": [
   [
    "15860.html", 
    "http://www.4forums.com/political/elections-debates/10762-candidate-predictions-print.html"
   ], 
   [
    "15861.html", 
    "http://www.4forums.com/political/elections-debates/10762-candidate-predictions-2-print.html"
   ]
  ], 
  "identifier": 10762
 }
]