[
 [
  [
   296392, 
   null, 
   "ibelieveyou", 
   "From the chief anglocentric shaman of the \"invisible (white) hand\" Smith, who projected the notorious stinginess / cruelty of his fellow scots onto the world population, to that genius lunatic Friedman, the narcotic of the freemarket has been pushed onto the witless addicted masses for generations.\n \n The Blinding Fraud of Pure Economics or Freemarkets\n According to narcissistic economists solitarily beating their logarithms and algorithms in their lab corners (Chicago School of Economics, Carnegie Institute), the whole world can be 'structurally adjusted' by a calculator: if only the market was free of DISTORTIONS, they feverishly ejaculate! This is the  Golden Mean  of 'scientific' economics.\n \n The cardinal ingredient of the freemarket and the junk science of economics is of course the holy variable of self-interest. This mostly anglo (Smithian) principle is worshiped by all rightwing / pure economists, (all of whom are naturally fat and wanting for nothing except a social consciousness) who fantasize of a world where self-interest is freed from the inhibiting forces of market distortions, e.g. social security, minimum wage, incubators for newborns, subsidized medicines etc. Remove such distortions they claim, and after a little compulsory bloodletting the market will find its equilibrium with the quirky white plump invisible hand revealing itself.\n \n The problem / fraud with this doctrine is of course, any psychotic economist ala Friedman will insist the hated State must retain the appendages of police and army to keep the freemarket free by stomping on the victims of the 'freemarket'! Can you see the hypocrisy, the fraud, the distortion!\n \n If free market forces are to be truly free in the libertarian nirvana, then the freemarket force of resistance by the masses struggling for their own SELF-INTEREST must not be distorted by the boot and baton of the very distorted and manufactured variable of military and police violence.\n \n Can you now see the astronomical lie of Friedman's freemarket forces: stand down your military / police stooges and cast them back among the poor masses, and then introduce the freemarket. It is guaranteed you Chicago School of psychotics, the market will truly be free, and the most left leaning loopy poor panhandler will embrace this freemarket.\n \n And as for Keynes, that bleeding heart bourgeoisie, as with all who squat quivering in between the lines, he was part of the problem.", 
   {
    "post_info": {
     "post_title": "The Fraud Of The Freemarket"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1199798220.0
  ], 
  [
   296397, 
   null, 
   "peteratwar", 
   "Could you tell me what you have been eating/drinking ?\n \n seems to be pretty good", 
   {}, 
   296392, 
   null, 
   1199799240.0
  ], 
  [
   296401, 
   null, 
   "ibelieveyou", 
   "Could you tell me what you have been eating/drinking ?\n \n seems to be pretty good\n\n \n the main course of Adam Smiths, the Wealth of Nations, and of course a buffet of Friedmanite freemarket gibberish, where its ok for the poor and desperate and working for 1 dollar unless you're Friedman of course", 
   {}, 
   296397, 
   null, 
   1199802660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Fraud Of The Freemarket", 
  "url": "http://www.4forums.com/political/european-politics-economics/10779-fraud-freemarket.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 10779, 
  "discussion_files": [
   [
    "22507.html", 
    "http://www.4forums.com/political/european-politics-economics/10779-fraud-freemarket-print.html"
   ]
  ], 
  "identifier": 10779
 }
]