[
 [
  [
   295913, 
   null, 
   "T.Q", 
   "Found this website. It asks you some questions, then shows you where you fall compared to each/every candidate on a variety of issues\n \n Electoral Compass\n \n Apparently I share the same views, more or less, as Barack Obama. Odd, since I'm a libertarian in most ways, I thought I'd be closer to Ron Paul. \n \n Who are you closest to?", 
   {
    "post_info": {
     "post_title": "Which candidate shares your views?"
    }
   }, 
   null, 
   null, 
   1199349180.0
  ], 
  [
   295925, 
   null, 
   "Matthew S", 
   "I am closest to Obama but all the democrats were in my circle.", 
   {}, 
   295913, 
   null, 
   1199367720.0
  ], 
  [
   295935, 
   null, 
   "jitobear", 
   "I had the same results as Matt. Obama's lack of experience concerns me - however if/when Richardson drops out of the race I will likely support him over Hilary (unless she snags a really good VP).", 
   {}, 
   295925, 
   null, 
   1199379300.0
  ], 
  [
   295937, 
   null, 
   "Archangel", 
   "http://www.electoralcompass.com/page/1/uw+positie/\n \n By highliting the #2 on the left side of the results page, you can then copy and paste your complete profile for others to see and analyze. I seem to agree with Huckabee more than any other Republican. Click on the pencil for breakdown of my position.", 
   {}, 
   295925, 
   null, 
   1199379540.0
  ], 
  [
   295940, 
   null, 
   "Archangel", 
   "I had the same results as Matt. Obama's lack of experience concerns me - however if/when Richardson drops out of the race I will likely support him over Hilary (unless she snags a really good VP).\n\n \n If Hillary wins the nomination, I'll bet you a dollar to a dime she picks Ossama, uhh, I mean Obama as her VP.", 
   {}, 
   295935, 
   null, 
   1199380020.0
  ], 
  [
   295942, 
   null, 
   "jim's trucking", 
   "closest to McCain \n farthest from Obama\n given I had to vote Dem, I'd go for Obama..", 
   {}, 
   295935, 
   null, 
   1199380140.0
  ], 
  [
   295944, 
   null, 
   "jitobear", 
   "If Hillary wins the nomination, I'll bet you a dollar to a dime she picks Ossama, uhh, I mean Obama as her VP.\n\n \n Why do you think that Mr. Phelps?", 
   {}, 
   295940, 
   null, 
   1199380500.0
  ], 
  [
   295950, 
   null, 
   "jim's trucking", 
   "If Hillary wins the nomination, I'll bet you a dollar to a dime she picks Ossama, uhh, I mean Obama as her VP.\nNah...by the time the nominations are over, they'll literally hate each other.", 
   {}, 
   295940, 
   null, 
   1199381940.0
  ], 
  [
   295951, 
   null, 
   "Archangel", 
   "Why do you think that Mr. Phelps?\n\n \n Very simply to gain the support of afrophiles like you who will support a candidate based on their race or gender rather than their qualifications. \n \n And thank you for the Mr Phelps reference, I didn't think you knew me that well. emoticon_xlove \n \n http://rds.yahoo.com/_ylt=A0WTefcKAn1H6voAmTyJzbkF;_ylu=X3oDMTBqamdoM3Q5BHBvcwMxMgRzZWMDc3IEdnRpZAM-/SIG=1hd5le2up/EXP=1199461258/**http%3A//images.search.yahoo.com/search/images/view%3Fback=http%253A%252F%252Fimages.search.yahoo.com%252Fsearch%252Fimages%253Fp%253DMr%252BPhelps%252Bfrom%252BMission%252BImpossible%2526fr%253Dyfp-t-501%2526toggle%253D1%2526cop%253Dmss%2526ei%253DUTF-8%26w=178%26h=338%26imgurl=www.lawzone.com%252Fhalf-nor%252Fptrgraves.jpg%26rurl=http%253A%252F%252Fwww.lawzone.com%252Fhalf-nor%252Fgraves.htm%26size=11.6kB%26name=ptrgraves.jpg%26p=Mr%2BPhelps%2Bfrom%2BMission%2BImpossible%26type=jpeg%26no=12%26tt=12%26oid=388c36d90825de44%26ei=UTF-8", 
   {}, 
   295944, 
   null, 
   1199382180.0
  ], 
  [
   295953, 
   null, 
   "Archangel", 
   "Nah...by the time the nominations are over, they'll literally hate each other.\n\n \n Yah, sure, that's true. But since when did that stop Politicians from uniting for a common purpose? Remember the old adage that politics makes strange bed fellows. And remember how in reality the Gores and the Clintons didn't get along at all yet they acted like they did for 8 years.", 
   {}, 
   295950, 
   null, 
   1199382540.0
  ], 
  [
   295955, 
   null, 
   "T.Q", 
   "If Hillary wins the nomination, I'll bet you a dollar to a dime she picks Ossama, uhh, I mean Obama as her VP.\n\n \n You just can't help but be insulting, can you?", 
   {}, 
   295940, 
   null, 
   1199383980.0
  ], 
  [
   295960, 
   null, 
   "Archangel", 
   "You just can't help but be insulting, can you?\n\n \n It's called sarcasm, but you would need a sense of humor to get that. emoticon_xbouncer And since he did go to a Madrases school, we really don't know what is in his heart now do we? Can you guarantee me he isn't more loyal to Islam than the USA ? Have you ever seen him Pledge allegiance to OUR FLAG?\n \n http://nypdrant64609.yuku.com/reply/81089/t/Re-Obama-refuses-to-pledge-allegiance-to-the-Flag-.html\n \n This guy is running for the job as the CEO of the USA and thinks its corny to pledge allegiance to it? Sorry, but I don't trust anyone who is ashamed of our flag, forget electing them to lead my Country.", 
   {}, 
   295955, 
   null, 
   1199384940.0
  ], 
  [
   295969, 
   null, 
   "jitobear", 
   "Very simply to gain the support of afrophiles like you who will support a candidate based on their race or gender rather than their qualifications. \n\n \n First of all - bugger off. You have absolutely no basis for this remark. I currently am backing Bill Richardson precisely because of his history and qualifications. He is currently govener of New Mexico after having spent 14 years in congress where he served on several committes and as the Cheif Deputy Whip. He also went on several diplomatic missions - in some he even negotiated the return of hostages and remains of Americans in hostile territory. He served as US Ambassador for the UN under Clinton, and is a five time Nobel Peace Prize Nominee. \n \n Secondly, the reason I don't support the candidates that you do as because 1) I disagree with them, 2) they are a sack of uber-religions nut-jobs who are, frankly, a threat to my family.\n \n Having a different background, viewpoint, or opinion than you does not mean it is one that is not thought out. Are you seriously that arrogant and lacking in imagination?\n \n Third, you are the last one to judge the reasons anyone may select a candidate since you have made it abundantly clear that your main priority for a candidate is that they match your faith-based morals. \n \n \nAnd thank you for the Mr Phelps reference, I didn't think you knew me that well. emoticon_xlove \n\n \n Quit being deliberately obtuse. How many funerals you picket this month?", 
   {}, 
   295951, 
   null, 
   1199387880.0
  ], 
  [
   295980, 
   null, 
   "nate895", 
   "I was closest to Mitt, but I still am a hardcore Ron Paul man (farthest from Obama). Most of these things stink, It said I disagreed with Ron Paul when I simply wasn't as hardcore on some issues. After doing many of these polls, only one matched me with Paul, so I think they are missing something in the equation.", 
   {}, 
   295969, 
   null, 
   1199392020.0
  ], 
  [
   295982, 
   null, 
   "sinjin", 
   "Obama for me although we disagree on some defense and nat'l security issues.", 
   {}, 
   295980, 
   null, 
   1199393160.0
  ], 
  [
   295984, 
   null, 
   "Archangel", 
   "First of all - bugger off. You have absolutely no basis for this remark. I currently am backing Bill Richardson precisely because of his history and qualifications. He is currently govener of New Mexico after having spent 14 years in congress where he served on several committes and as the Cheif Deputy Whip. He also went on several diplomatic missions - in some he even negotiated the return of hostages and remains of Americans in hostile territory. He served as US Ambassador for the UN under Clinton, and is a five time Nobel Peace Prize Nominee. \n \n Secondly, the reason I don't support the candidates that you do as because 1) I disagree with them, 2) they are a sack of uber-religions nut-jobs who are, frankly, a threat to my family.\n \n Having a different background, viewpoint, or opinion than you does not mean it is one that is not thought out. Are you seriously that arrogant and lacking in imagination?\n \n Third, you are the last one to judge the reasons anyone may select a candidate since you have made it abundantly clear that your main priority for a candidate is that they match your faith-based morals. \n \n \n \n Quit being deliberately obtuse. How many funerals you picket this month?\n\n \n I have a perfect right to my statement jito because we live in a free Country. You don't have to like what i say, but I still have the right to say it. Just as you asking how many funerals I picketed this month shows your complete willful ignorance regarding my character. You know I support the war on Terror and in Iraq so for you to align me with Fred Phelps just reaffirms how committed you are to passing along sleazy lies and slander about someone even when you know full well you are lying about them. You should be so proud of yourself.\n \n And ask yourself this jito, when Richardson loses, and he will; who will you then support if Hillary wins and Obama becomes her running mate? You know as well as I do that you will support the Liberal Socialists which they are.", 
   {}, 
   295969, 
   null, 
   1199395920.0
  ], 
  [
   295994, 
   null, 
   "cap2b", 
   "You know as well as I do that you will support the Liberal Socialists which they are.\n \n The Archiecritter says \"Liberal Socialists\" as though it were a bad thing.:xbanghead \n \n So far, only John Edwards has had the stones to say that he is in favor of redistributing the nation's wealth away from the greedy toward the needy.", 
   {}, 
   295982, 
   null, 
   1199400060.0
  ], 
  [
   295998, 
   null, 
   "jitobear", 
   "I have a perfect right to my statement jito because we live in a free Country. You don't have to like what i say, but I still have the right to say it. \n\n \n Just know that when you say it about me it is a FALSE STATEMENT. Doesn't that Bible you hold in such high regard have a few words to say about that?\n \n \nJust as you asking how many funerals I picketed this month shows your complete willful ignorance regarding my character. You know I support the war on Terror and in Iraq so for you to align me with Fred Phelps just reaffirms how committed you are to passing along sleazy lies and slander about someone even when you know full well you are lying about them. You should be so proud of yourself.\n\n \n YOU HYPOCRITE! Do you not recall the post that started this when you made slanderous and sleazy commentary about how I select candidates to support? Something in the red quote above you defend having done! \n \n In any case you are just trying to create diversion. Quit playing victim. The Phelps/funerals comment was a counter to your assinine Obama/Ossama comment and you know it. Nasty generalizations at the expense of your faith aren't quite as funny as when you are making them about someone else's, huh?\n \n \nAnd ask yourself this jito, when Richardson loses, and he will; who will you then support if Hillary wins and Obama becomes her running mate? You know as well as I do that you will support the Liberal Socialists which they are.\n\n \n It depends on who the Republicans offer. Both Guilani and Paul could possibly get my vote over Hilary or Obama. Depends on how everyone debates on the issues.\n \n However I will support Hillary and/or Obama over Romney, Huckabee or Thompson. None of those stand a snow-ball's chance in hell of getting my vote.\n \n And you - just how willing are you to consider the other side?", 
   {}, 
   295984, 
   null, 
   1199404800.0
  ], 
  [
   296014, 
   null, 
   "Matthew S", 
   "I had the same results as Matt. Obama's lack of experience concerns me - however if/when Richardson drops out of the race I will likely support him over Hilary (unless she snags a really good VP).\n\n \n Jito if Richardson would simply answer the question that was ask of him. I would support him.\n \n He would not answer the question he was asked \"If the New Mexico legislature put a gay marriage bill on your desk would you sign it?\" Richardson refused to answer the question.", 
   {}, 
   295935, 
   null, 
   1199416680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Which candidate shares your views?", 
  "url": "http://www.4forums.com/political/elections-debates/10770-candidate-shares-your-views.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 10770, 
  "discussion_files": [
   [
    "7116.html", 
    "http://www.4forums.com/political/elections-debates/10770-candidate-shares-your-views-print.html"
   ], 
   [
    "7117.html", 
    "http://www.4forums.com/political/elections-debates/10770-candidate-shares-your-views-2-print.html"
   ]
  ], 
  "identifier": 10770
 }
]