[
 [
  [
   296142, 
   null, 
   "GodsCowboy", 
   "http://i38.photobucket.com/albums/e110/GodsCowboy/GODSMessages/BLOGPictures/HeavenTheRewardforChildrenOfGOD.jpg\n \n We have ALL SINNED but some people STOP SINNING. They are called THE CHILDREN OF GOD. So for this year's resolution why not give up sinning and become a CHILD OF GOD.\n \n 1 John 3:9-10 (see below) tells us that CHILDREN OF GOD DON'T SIN. So the next time you think it's okay to sin because GOD will forgive you, ask yourself this question first: Is the sin the devil wants me to commit worth giving up my RIGHT to be a CHILD OF GOD? Then maybe you just might think twice about those little sins and want to become a CHILD OF GOD instead.\n \n So let's make this year's NEW YEAR'S RESOLUTION the INTENT to NEVER sin again. Remember what Christ told the people he forgave. \"GO AND SIN NO MORE.\"\n \n HAPPY NEW YEAR\n Chuck Lentine\n (AKA GOD'S Cowboy)\n \n Referenced bible passages:\n \n ----------1 John 3:9-10\n \n ----------9 No one who is born of God will continue to sin, because God's seed remains in him; he cannot go on sinning, because he has been born of God. 10 This is how we know who the children of God are and who the children of the devil are: Anyone who does not do what is right is not a child of God; nor is anyone who does not love his brother.", 
   {
    "post_info": {
     "post_title": "Not EVERYONE Sins (Post #82)"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1199590560.0
  ], 
  [
   296143, 
   null, 
   "smiley", 
   "http://i38.photobucket.com/albums/e110/GodsCowboy/GODSMessages/BLOGPictures/HeavenTheRewardforChildrenOfGOD.jpg\n \n We have ALL SINNED but some people STOP SINNING. They are called THE CHILDREN OF GOD. So for this year's resolution why not give up sinning and become a CHILD OF GOD.\n \n 1 John 3:9-10 (see below) tells us that CHILDREN OF GOD DON'T SIN. So the next time you think it's okay to sin because GOD will forgive you, ask yourself this question first: Is the sin the devil wants me to commit worth giving up my RIGHT to be a CHILD OF GOD? Then maybe you just might think twice about those little sins and want to become a CHILD OF GOD instead.\n \n So let's make this year's NEW YEAR'S RESOLUTION the INTENT to NEVER sin again. Remember what Christ told the people he forgave. \"GO AND SIN NO MORE.\"\n \n HAPPY NEW YEAR\n Chuck Lentine\n (AKA GOD'S Cowboy)\n \n Referenced bible passages:\n \n ----------1 John 3:9-10\n \n ----------9 No one who is born of God will continue to sin, because God's seed remains in him; he cannot go on sinning, because he has been born of God. 10 This is how we know who the children of God are and who the children of the devil are: Anyone who does not do what is right is not a child of God; nor is anyone who does not love his brother.\n\n \n Nice thought, but will never happen. Everyone sins. You, me, even those who don't admit it.\n \n Happy New Year, BTW.\n \n Smiley", 
   {
    "unicode_changes_made": true
   }, 
   296142, 
   null, 
   1199591040.0
  ], 
  [
   296144, 
   null, 
   "Symbiote", 
   "We have ALL SINNED but some people STOP SINNING. They are called THE LIVING DEAD, DAS VAMPIRES, NOSFERATU", 
   {}, 
   296143, 
   null, 
   1199591460.0
  ], 
  [
   296146, 
   null, 
   "Archangel", 
   "Even Born Again Believers sin GodsCowboy. To say otherwise is to mislead unbelievers and corrupt what the bible say's. As believers we do have complete victory in Christ and are seen as perfect in Christ by God. We are also to strive to be more like Christ through out our lives, but to say we never sin anymore or can be perfect in all of our actions is just not realistic or true according to the bible. Here is how Paul describes the struggle between the spirit and the flesh to do what is right very well.\n \n Rom 7:5 \n For when we were in the flesh, the sinful passions which were aroused by the law were at work in our members to bear fruit to death.\n Rom 7:6 \n But now we have been delivered from the law, having died to what we were held by, so that we should serve in the newness of the Spirit and not in the oldness of the letter.\n Rom 7:7 \n What shall we say then? Is the law sin? Certainly not! On the contrary, I would not have known sin except through the law. For I would not have known covetousness unless the law had said, \"You shall not covet.\"[fn1]\n Rom 7:8 \n But sin, taking opportunity by the commandment, produced in me all manner of evil desire. For apart from the law sin was dead.\n Rom 7:9 \n I was alive once without the law, but when the commandment came, sin revived and I died.\n Rom 7:10 \n And the commandment, which was to bring life, I found to bring death.\n Rom 7:11 \n For sin, taking occasion by the commandment, deceived me, and by it killed me.\n Rom 7:12 \n Therefore the law is holy, and the commandment holy and just and good.\n Rom 7:13 \n Has then what is good become death to me? Certainly not! But sin, that it might appear sin, was producing death in me through what is good, so that sin through the commandment might become exceedingly sinful.\n Rom 7:14 \n For we know that the law is spiritual, but I am carnal, sold under sin.\n Rom 7:15 \n For what I am doing, I do not understand. For what I will to do, that I do not practice; but what I hate, that I do.\n Rom 7:16 \n If, then, I do what I will not to do, I agree with the law that it is good.\n Rom 7:17 \n But now, it is no longer I who do it, but sin that dwells in me.\n Rom 7:18 \n For I know that in me (that is, in my flesh) nothing good dwells; for to will is present with me, but how to perform what is good I do not find.\n Rom 7:19 \n For the good that I will to do, I do not do; but the evil I will not to do, that I practice.\n Rom 7:20 \n Now if I do what I will not to do, it is no longer I who do it, but sin that dwells in me.\n Rom 7:21 \n I find then a law, that evil is present with me, the one who wills to do good.\n Rom 7:22 \n For I delight in the law of God according to the inward man.\n Rom 7:23 \n But I see another law in my members, warring against the law of my mind, and bringing me into captivity to the law of sin which is in my members.\n Rom 7:24 \n O wretched man that I am! Who will deliver me from this body of death?\n Rom 7:25 \n I thank God--through Jesus Christ our Lord! So then, with the mind I myself serve the law of God, but with the flesh the law of sin.", 
   {}, 
   296144, 
   null, 
   1199592420.0
  ], 
  [
   296160, 
   null, 
   "Penfold", 
   "Sin is a curious concept, the idea in some religions that one has to admit to unworthiness and immorality in order to be \"saved\" from those attributes, which were instilled in the individual by their \"creator\" in the first place.", 
   {}, 
   296146, 
   null, 
   1199622060.0
  ], 
  [
   296164, 
   null, 
   "charlie horse", 
   "GC - STOP THE BLOODY CAPITAL BOLD! How many more times are you going to confirm your selfish idiocy in this regard?\n \n \nRomans 3:23 For all have sinned and fall short of the glory of God,...\n\n Notice that and fall short is a continuing verb action, which means sinning will continue as well (linked actions in the same phrase). One can still be declared righteous in one's sin. Sin does not stop, because man is imperfect.\n \n The fact that being born in sin, the cannibalistic notion of propitiatary sacrifice, and seeking forgiveness for something we had no part in, is abhorrent, is another issue.\n \n Either way, GC, you clearly don't understand your own bible.", 
   {}, 
   296160, 
   null, 
   1199626440.0
  ], 
  [
   296165, 
   null, 
   "HonestAbe", 
   "What would life be like if no one sinned?", 
   {}, 
   296164, 
   null, 
   1199631300.0
  ], 
  [
   296171, 
   null, 
   "Archangel", 
   "What would life be like if no one sinned?\n\n \n The World would be a living Paradise with no strife, selfishness or dissension at all. Imagine a World where everyone cared more about everyone else's life and comfort than their own. There would only be good, but no evil at all to contend with. Imagine such a World... I do and I see Heaven.", 
   {}, 
   296165, 
   null, 
   1199634360.0
  ], 
  [
   296173, 
   null, 
   "charlie horse", 
   "... Imagine a World where everyone cared more about everyone else's life and comfort than their own...\n\n I know what you mean, Arch, but in the real world it's called being a nosey parker. ;)", 
   {}, 
   296171, 
   null, 
   1199635920.0
  ], 
  [
   296174, 
   null, 
   "smiley", 
   "The World would be a living Paradise with no strife, selfishness or dissension at all. Imagine a World where everyone cared more about everyone else's life and comfort than their own. There would only be good, but no evil at all to contend with. Imagine such a World... I do and I see Heaven.\n\n \n Unfortunately, good and evil are just two parts of the same linear scale. You need one in order to measure the other. If we did live in a world where everyone cared more about each other than themselves, then it would be a sin if you took more than 10 seconds to inquire about someone's well being, or phoned them up only once every 3 days rather than every other day.\n \n Also, there would be no houses as no-one would claim a piece of land as their own (essentially theft). In fact, most of what we have today, we wouldn't have if sin did not exist (not that that makes it right).\n \n Smiley\n \n PS Wouldn't it get a bit too much if everyone you knew kept asking how you were? You could write a sign on your forehead saying, \"I'm doing fine, thank you. So p*** off!\":p", 
   {}, 
   296171, 
   null, 
   1199636400.0
  ], 
  [
   296175, 
   null, 
   "Jo Bennett", 
   "Actually building a house doesn't require claiming land, as in a sinless world you would be building a house for the use of everyone, and everyone else capable would do the same, and take good care of whatever house they used on behalf of others.", 
   {}, 
   296174, 
   null, 
   1199636880.0
  ], 
  [
   296177, 
   null, 
   "Bassman", 
   "Unfortunately, good and evil are just two parts of the same linear scale. You need one in order to measure the other. \nNo, that's where you're wrong about that. Sin is not the exact opposite of good, it is inferior. And in Revelation, we see that good will triumph over evil.", 
   {}, 
   296174, 
   null, 
   1199637480.0
  ], 
  [
   296179, 
   null, 
   "Archangel", 
   "Unfortunately, good and evil are just two parts of the same linear scale. You need one in order to measure the other. If we did live in a world where everyone cared more about each other than themselves, then it would be a sin if you took more than 10 seconds to inquire about someone's well being, or phoned them up only once every 3 days rather than every other day.\n \n Also, there would be no houses as no-one would claim a piece of land as their own (essentially theft). In fact, most of what we have today, we wouldn't have if sin did not exist (not that that makes it right).\n \n Smiley\n \n PS Wouldn't it get a bit too much if everyone you knew kept asking how you were? You could write a sign on your forehead saying, \"I'm doing fine, thank you. So p*** off!\":p\n\n \n If the World were really sinless by nature then no one would be making such critical judgments about anyone else and condemning them for not phoning at any interval at all. People would not be so small and petty if they were sinless. So many problems or perception would just disappear if sin and selfishness didn't exist on Earth. \n \n I also agree though, and understand what you're saying that in such a paradise the drive to excel, compete and even create new technologies might be seriously hampered or even non-existent in such a World.", 
   {}, 
   296174, 
   null, 
   1199637600.0
  ], 
  [
   296180, 
   null, 
   "Jo Bennett", 
   "I disagree, in a sinless world the desire to help others would inspire the creation of new technology.", 
   {}, 
   296179, 
   null, 
   1199638500.0
  ], 
  [
   296181, 
   null, 
   "Archangel", 
   "GC - STOP THE BLOODY CAPITAL BOLD! How many more times are you going to confirm your selfish idiocy in this regard?\n \n \nRomans 3:23 For all have sinned and fall short of the glory of God,...\n\n \n Notice that and fall short is a continuing verb action, which means sinning will continue as well (linked actions in the same phrase). One can still be declared righteous in one's sin. Sin does not stop, because man is imperfect.\n \n The fact that being born in sin, the cannibalistic notion of propitiatary sacrifice, and seeking forgiveness for something we had no part in, is abhorrent, is another issue.\n \n Either way, GC, you clearly don't understand your own bible.\n\n \n Romans 3:23 is an excellent verse that shows that we are all sinners in need of salvation and will never live up to Gods perfect and Holy Standards while in this flesh.\n \n And Philippians 3:12 perfectly states that though we are saved, we aren't yet perfected in Christ. But we are guaranteed perfection in Christ in the Age to come.\n Phl 3:12 Not that I have already attained, or am already perfected; but I press on, that I may lay hold of that for which Christ Jesus has also laid hold of me.", 
   {}, 
   296164, 
   null, 
   1199638500.0
  ], 
  [
   296183, 
   null, 
   "Archangel", 
   "I disagree, in a sinless world the desire to help others would inspire the creation of new technology.\n\n \n You might be right. I couldn't argue either way as it is impossible to imagine the reality that would exist. I mean, is this a sinless World with or without God? Are we speaking about the Earth before Man fell from Grace or a secular sinless World with no Creator God who made us in love?\n \n If we are speaking about the biblical pre sin World then God was our provider and Man didn't have to toil and work for anything at all. Adam could speak to receive what he wanted. If we're not speaking of that type of World then you are probably right in your assessment and we would be motivated to create for the comfort and improved life of others. \n \n In a World like that I guess a perfect type of communism is feasible and Capitalism would be the worst type of system imaginable as working for profit would motivate all of the worst possible characteristics in humanity.", 
   {}, 
   296180, 
   null, 
   1199639400.0
  ], 
  [
   296187, 
   null, 
   "Jo Bennett", 
   "I'm trying to imagine the world as it would be if everyone followed the commandments to love one another and love God. If these commandments are obeyed then everyone will consider the well being and comfort of others to be just as important as their own, and will dedicate the pursuit of this end to God.", 
   {}, 
   296183, 
   null, 
   1199640600.0
  ], 
  [
   296195, 
   null, 
   "Archangel", 
   "I'm trying to imagine the world as it would be if everyone followed the commandments to love one another and love God. If these commandments are obeyed then everyone will consider the well being and comfort of others to be just as important as their own, and will dedicate the pursuit of this end to God.\n\n \n Agreed, but if you are then imagining a World that never fell from grace or experienced original sin, then Adam and Eve would still be alive. We would all still be living in Paradise and God would be walking among us in the cool of the day. There would be no work or toiling of any kind, nor would suffering, disease, violence or death exist at all. No hunger or poverty either. All would be equal and would equally submit to our God whom we all knew personally and worshiped in perfect love and harmony. \n \n If Man never fell from Grace, that is how I see the World existing now. The lion would be laying with the lamb as promised in the bible.", 
   {}, 
   296187, 
   null, 
   1199644920.0
  ], 
  [
   296234, 
   null, 
   "Zardoz", 
   "Actually building a house doesn't require claiming land, as in a sinless world you would be building a house for the use of everyone, and everyone else capable would do the same, and take good care of whatever house they used on behalf of others.\n\n \n Yes it would be a sin still as others would disagree with where the house should go.\n \n As to Archy's sinless world, it only ever existed when Adam alone was around to fellowship with God.\n As soon as Eve was made, things went down hill fast.\n It was a sin for God to create a 'companion' for Adam when according to Christian beliefs, God is ALL you need.\n \n \n \n As for the OP, the bible IS contradictorary on the subject of sinning once saved. Some passages state that you don't sin any more, others state that you continue to struggle with temptations and sin and need to constantly seek to repent.\n \n \n \n But, if there was never a falling from Grace...Adam and (possibly Eve) would be the ONLY humans to exist.\n And they'd still be existing, having never knowing death.", 
   {}, 
   296175, 
   null, 
   1199657520.0
  ], 
  [
   296249, 
   null, 
   "HonestAbe", 
   "The World would be a living Paradise with no strife, selfishness or dissension at all. Imagine a World where everyone cared more about everyone else's life and comfort than their own. There would only be good, but no evil at all to contend with. Imagine such a World... I do and I see Heaven.\n\n \n What makes you think there is a heaven? Have you seen it? Or do you know someone who has been there and returned to tell the world about it?", 
   {}, 
   296171, 
   null, 
   1199667120.0
  ], 
  [
   296254, 
   null, 
   "Archangel", 
   "Yes it would be a sin still as others would disagree with where the house should go.\n\n \n How do you know that Zardoz? Why do you assume the negative? Could it be your fallen Nature showing again? In a perfect World why wouldn't the others just be above worrying about such things? After all, in a World like that all the land would be prime so what's there to fight about? Jealousy, envy and strife wouldn't exist, so why must you assume any disagreement at all would occur?\n \n \nAs to Archy's sinless world, it only ever existed when Adam alone was around to fellowship with God.\n As soon as Eve was made, things went down hill fast.\n It was a sin for God to create a 'companion' for Adam when according to Christian beliefs, God is ALL you need.\n\n \n Oh really? Prove it! Show me the verse that say's 21 minutes after Eve was created she caused Adam to sin. We don't know how long they lived in paradise before being tempted by the serpent so why do you assume it was an immediate disaster? They could have existed literally millions of years before being tempted and falling from Grace. Wouldn't that end up being a kick in the butt to the evolutionists if they learned that is how the Earth got old. \n \n \nAs for the OP, the bible IS contradictorary on the subject of sinning once saved. Some passages state that you don't sin any more, others state that you continue to struggle with temptations and sin and need to constantly seek to repent.\n\n \n The bible is not contradictory at all. Our human understanding and interpretations are contradictory based on our limited understanding.\n \n \nBut, if there was never a falling from Grace...Adam and (possibly Eve) would be the ONLY humans to exist.\n And they'd still be existing, having never knowing death.\n\n \n First of all, why do you say possible eve? had they never fallen from grace, they both would still be alive. And why do you say they would be the only humans to exist? Everyone who was ever born would exist who didn't die by accident somehow. We would have had no need for a Savior at all and the Garden of Eden would still exist and possibly cover the whole Earth. I can only imagine what would have happened on a World wide scale under those circumstances. But it's nice to imagine the possibilities.", 
   {}, 
   296234, 
   null, 
   1199669280.0
  ], 
  [
   296255, 
   null, 
   "Archangel", 
   "What makes you think there is a heaven? Have you seen it? Or do you know someone who has been there and returned to tell the world about it?\n\n \n I know there is a heaven and an afterlife as assuredly as you know this World is real Abe. What I can't do is make it so you can see what I do. That is your personal journey in life and only you can seek the kingdom of God for yourself. It's one of the Lords great promises to us after all.\n Mat 6:33 But seek first the kingdom of God and His righteousness, and all these things shall be added to you.", 
   {}, 
   296249, 
   null, 
   1199670420.0
  ], 
  [
   296257, 
   null, 
   "Penfold", 
   "[QUOTE=Archangel;296255]I know there is a heaven and an afterlife as assuredly as you know this World is real Abe. . . . \"\n \n Abe has ample evidence from his senses to inform him as to his reality. What evidence do you have?", 
   {}, 
   296255, 
   null, 
   1199673240.0
  ], 
  [
   296259, 
   null, 
   "HonestAbe", 
   "I know there is a heaven and an afterlife as assuredly as you know this World is real Abe. What I can't do is make it so you can see what I do. That is your personal journey in life and only you can seek the kingdom of God for yourself. It's one of the Lords great promises to us after all.\n Mat 6:33 But seek first the kingdom of God and His righteousness, and all these things shall be added to you.\n\n \n To me, these are just superstitions and self-serving wishful thinking. But you are welcome to believe those delusions if you choose.", 
   {}, 
   296255, 
   null, 
   1199673600.0
  ], 
  [
   296260, 
   null, 
   "HonestAbe", 
   "[QUOTE=Penfold;296257]\nI know there is a heaven and an afterlife as assuredly as you know this World is real Abe. . . . \"\n \n Abe has ample evidence from his senses to inform him as to his reality. What evidence do you have?\n\n \n My world is real because I've seen the Monument in my name in Washington.emoticon_xhoho", 
   {}, 
   296257, 
   null, 
   1199673660.0
  ], 
  [
   296264, 
   null, 
   "Archangel", 
   "To me, these are just superstitions and self-serving wishful thinking. But you are welcome to believe those delusions if you choose.\n\n \n Then why did you ask the question below Abe? You knew the answer I would give based on my Avatar and posting profile. So why would you ask a question of someone when you know precisely what the answer will be? I mean, you didn't have to first ask me a question before telling me that you believe having faith in a personal God is nothing more that superstition and wishful thinking. \n \n But since you see it that way, let me assure you that you are wrong and Messiah is as real as you are and is returning to this World someday in the not too distant future. And every knee shall bow and every tongue shall confess that Jesus Christ is Lord. And on that day, you will know how wrong you were in believing as you do today. \n \n \nWhat makes you think there is a heaven? Have you seen it? Or do you know someone who has been there and returned to tell the world about it?\n\n \n And to answer your question directly, YES, I do know someone who has died and returned to tell me of Heaven. His name is Jesus Christ, the unblemished sacrificial lamb of God and the Savior of Humanity. It is by His shed blood that we are saved and His Holy Spirit indwells and guides all believers. And Jesus sent Him to teach us in His absence. By the way, the comforter in these verses is the Holy Spirit so you can put the message in proper context.\n \n Jhn 14:16 and I will ask the Father, and another Comforter He will give to you, that he may remain with you -- to the age;\n \n Jhn 14:26 and the Comforter, the Holy Spirit, whom the Father will send in my name, he will teach you all things, and remind you of all things that I said to you.\n \n Jhn 15:26 `And when the Comforter may come, whom I will send to you from the Father -- the Spirit of truth, who from the Father doth come forth, he will testify of me;\n \n Jhn 16:7 `But I tell you the truth; it is better for you that I go away, for if I may not go away, the Comforter will not come unto you, and if I go on, I will send Him unto you;", 
   {}, 
   296260, 
   null, 
   1199675220.0
  ], 
  [
   296268, 
   null, 
   "GodsCowboy", 
   "We have ALL SINNED but some people STOP SINNING. They are called THE LIVING DEAD, DAS VAMPIRES, NOSFERATU\n\n \n Do YOU REALLY think MOTHER TERESA sinned after she became GOD'S CHILD (say after she became a nun)?\n \n Do YOU think JOHN THE BAPTIST sinned once he started his mission?\n \n I WON'T judge you but I WILL CONTINUE to do EVERYTHING I can NOT to sin any more. I will NOT make a vow with GOD because the bible warns us NOT to do that for fear of being punished for breaking it. \n \n I want to be a CHILD OF GOD. And I'm willing to do MY BEST NOT TO SIN so I can be a CHILD OF GOD (one of Christ's brothers). I guess you think sinning is MORE IMPORTANT than being a CHILD OF GOD. \n \n It's like the song says, \"IT'S NOT HOW GOOD YOU ARE. IT'S HOW BAD DO YOU WANT IT.\" (Song Title --- How Bad Do You Want It? -- off--- And The Crowd Goes Wild CD ---by--- Mark Wills).", 
   {}, 
   296144, 
   null, 
   1199676960.0
  ], 
  [
   296269, 
   null, 
   "Zardoz", 
   "How do you know that Zardoz? Why do you assume the negative? Could it be your fallen Nature showing again? In a perfect World why wouldn't the others just be above worrying about such things? After all, in a World like that all the land would be prime so what's there to fight about? Jealousy, envy and strife wouldn't exist, so why must you assume any disagreement at all would occur?\n\n Because as illustrated in the bible, when multiple humans congregate, disagreement happens.\n This is also illustrated in reality.\n \n \n \n \nOh really? Prove it! Show me the verse that say's 21 minutes after Eve was created she caused Adam to sin. We don't know how long they lived in paradise before being tempted by the serpent so why do you assume it was an immediate disaster? They could have existed literally millions of years before being tempted and falling from Grace. Wouldn't that end up being a kick in the butt to the evolutionists if they learned that is how the Earth got old.\n\n Read your bible.\n Gen. 2 Eve is made...chronicling the event right up to Gen 2:25\n The VERY next chapter...that'd be 3:1 what happens...anyone...anyone...anyone...right, the serpent approaches Eve.\n At no point in time does the bible chronicle ANYTHING that happened between the creation of Eve and her being INSTANTLY lead astray by that whiley serpent.\n Time is IRRELEVENT to the actual story.\n \n This biblical lesson brought to you not by a bible thumper but, by (as always) yours truely...Zardoz!\n \n \nThe bible is not contradictory at all. Our human understanding and interpretations are contradictory based on our limited understanding.\n\n You keep telling yourself that.\n I don't think your reading comprehension levels are up to normal. May I suggest some remedial educations courses...\n \n \nFirst of all, why do you say possible eve? had they never fallen from grace, they both would still be alive. And why do you say they would be the only humans to exist? Everyone who was ever born would exist who didn't die by accident somehow. We would have had no need for a Savior at all and the Garden of Eden would still exist and possibly cover the whole Earth. I can only imagine what would have happened on a World wide scale under those circumstances. But it's nice to imagine the possibilities.\n\n \n Because as I plainy pointed out in the bible, Eve's creation (flawed as it was since God used pristine dirt to make man but used a part of man (imperfect cloning) to make Eve. Why the different types of creation...I think the MAN was showing off His as yet imperfect skills of creation.)) immediatly lead to the Fall.\n It can be assumed that Eve, being created by a different method, led to the fall. At no point did the serpent approach Adam prior to these events.\n \n And, if the bible is correct (Ecc. summation on God being all you need), then the creation of Eve was a foolish event by God...seeing that God was the only friend and companion needed for Adam.\n \n Had there not been a fall, DEATH would NEVER touch man...cf. TREE OF LIFE CONSUMPTION LEADING TO IMMORTALITY. \n \n \n Unless, of course, you use the Gen 1 version of creation...you know, the one that contradicts Gen 2.\n \n But, still the 1st recorded instance of Eve doing anything...is the event that results in the Fall from grace.\n \n I also doubt the Garden of Eden (in your illustration of immortality for ALL humans) would be far larger than the Earth as those who don't die would continue to reproduce and their offspring do so also...and a lack of genetic defects and commands from God to stop, incest would allow for even more breeding.\n \n Imagine all the humans for all of existance never dying but continuing to breed...for thousands of years.\n The physical size of Earth would be too small to contain them all as well as the animals that also didn't die and continued to breed as well as the space needed to for the crops to grow to feed them all.\n \n I'd say, the fall from grace was part of Gods plan (which all things are according to the bible) because God realized that His initial creation of the Garden was too small to contain His creations once they started to multiply.\n \n The Garden however, wasn't on Earth (or no longer is) because it'd be fairly easy to find...just look for the Cherub with the flamming sword.", 
   {}, 
   296254, 
   null, 
   1199678340.0
  ], 
  [
   296270, 
   null, 
   "Archangel", 
   "You confirm for me how people can believe in evolution by making huge unsubstantiated assumptions. What you have said above in response to what the bible actually say's is rationalization at the highest level. To comment on just a couple of points, let me start with this.\n \n \nBecause as illustrated in the bible, when multiple humans congregate, disagreement happens.\n This is also illustrated in reality.\n\n \n How does this assumption apply to the pre-fallen state of created beings? Your opinion applies just fine to fallen man but it doesn't allow at all for perfect humans who knew perfect love and walked with God each day. \n \n \nRead your bible.\n Gen. 2 Eve is made...chronicling the event right up to Gen 2:25\n The VERY next chapter...that'd be 3:1 what happens...anyone...anyone...anyone...right, the serpent approaches Eve.\n At no point in time does the bible chronicle ANYTHING that happened between the creation of Eve and her being INSTANTLY lead astray by that whiley serpent.\n Time is IRRELEVENT to the actual story.\n \n \n What do you mean time is irrelevant to the actual story? It is one of the unanswered questions regarding our Fall from Grace in the bible. But no where does God tell us how soon after Creation the fall occurred. Here's my point Zardoz, I don't know the time between eves creation and the fall, because the bible doesn't tell us. And it may actually be a short amount of time as you imply. Or it may be millions of our years before it actually occurred. \n \n What upsets me is your pompous assumption that you have it pegged when you don't have any more of a clue than me or the most well read theologian on Earth. It is unknowable knowledge Zardoz so why are you so sanctimoniously acting like it is obvious and only a XXXXX wouldn't see it?", 
   {}, 
   296269, 
   null, 
   1199682300.0
  ], 
  [
   296273, 
   null, 
   "Archangel", 
   "Do YOU REALLY think MOTHER TERESA sinned after she became GOD'S CHILD (say after she became a nun)?\n \n Do YOU think JOHN THE BAPTIST sinned once he started his mission?\n \n I WON'T judge you but I WILL CONTINUE to do EVERYTHING I can NOT to sin any more. I will NOT make a vow with GOD because the bible warns us NOT to do that for fear of being punished for breaking it. \n \n I want to be a CHILD OF GOD. And I'm willing to do MY BEST NOT TO SIN so I can be a CHILD OF GOD (one of Christ's brothers). I guess you think sinning is MORE IMPORTANT than being a CHILD OF GOD. \n \n It's like the song says, \"IT'S NOT HOW GOOD YOU ARE. IT'S HOW BAD DO YOU WANT IT.\" (Song Title --- How Bad Do You Want It? -- off--- And The Crowd Goes Wild CD ---by--- Mark Wills).\n\n \n I must tell you GC, you concern me. Or your spiritual outlook does I should say. To answer your question directly, YES I do believe Mother Theresa and even John the Baptist sinned after they were saved by grace. In fact I know they did because although they possessed the Holy Spirit within them, they weren't yet in their immortal bodies.\n \n And calling yourself Christ's brother. What's up with that? Jesus Christ is my Savior, Messiah Redeemer and my Hope, but to claim I am His brother would be to elevate me to a level of deity which makes me very uncomfortable. I admit I am a child of my God as a creation of His, but to imply I'm a sibling of the Savior just seems a little blasphemous to me, to put it lightly. Think about what I'm saying. emoticon_xangel", 
   {}, 
   296268, 
   null, 
   1199685360.0
  ], 
  [
   296278, 
   null, 
   "Jo Bennett", 
   "Describing Jesus as our brother isn't the least bit blasphemous. Let's not forget that Jesus had at least 1 actual brother, James, and nobody considers him to be the equal of Jesus. The description of Jesus as brother is not particularly uncommon, it features in the liturgy of Iona abbey, for example.", 
   {}, 
   296273, 
   null, 
   1199696280.0
  ], 
  [
   296285, 
   null, 
   "Zardoz", 
   "You confirm for me how people can believe in evolution by making huge unsubstantiated assumptions. What you have said above in response to what the bible actually say's is rationalization at the highest level. To comment on just a couple of points, let me start with this.\n \n How does this assumption apply to the pre-fallen state of created beings? Your opinion applies just fine to fallen man but it doesn't allow at all for perfect humans who knew perfect love and walked with God each day. \n\n Prior to the Fall, there existed ONLY ONE man. As soon as a 2nd human was created, the very first act as documented was the defiance that led to the Fall.\n Pre-fallen state existed on ONE man living in peace and fellowship with God.\n Anything beyond that (as manifestly shown) leads to a fallen state.\n \n \nWhat do you mean time is irrelevant to the actual story? It is one of the unanswered questions regarding our Fall from Grace in the bible. But no where does God tell us how soon after Creation the fall occurred. Here's my point Zardoz, I don't know the time between eves creation and the fall, because the bible doesn't tell us. And it may actually be a short amount of time as you imply. Or it may be millions of our years before it actually occurred. \n\n Whether it be the 'pulled out of thin air' 21 minute time frame or days (neither of which times frames are documented in the bible) is irrelevant.\n The VERY NEXT EVENT that happens after Eve's creation is documented quite clearly. The Fall. There is NOTHING that happens between Eve's creation and the Fall. Nothing documented at ALL.\n To say or imply otherwise is to make stuff up.\n Which is something you're quite apt at doing.\n \n Time is Irrelevant precisely because the bible doesn't MAKE IT RELEVANT.\n Nothing of relevance was documented after Eve's creation that happened before the Fall. To think otherwise is heresy and the worst type of presumption.\n \n You should repent.\n \n \nWhat upsets me is your pompous assumption that you have it pegged when you don't have any more of a clue than me or the most well read theologian on Earth. It is unknowable knowledge Zardoz so why are you so sanctimoniously acting like it is obvious and only a XXXXX wouldn't see it?\n\n What pleases me most is the manifest levels of ignorance and presumptiousness Christians have over their faith and religions works.\n The only thing unknowable is the assumptions you make.\n All other things can be extrapulated based on God-granted common sense and rationality.\n \n Unknowable knowledge???\n \n ########.\n \n Anything not listed is meaningless. To think otherwise of the bible states you don't believe the bible contains ALL of what you need and therefore must seek other forms of revelation.\n \n Look Archy, I can put the shoe on the other foot all life-time long and show that you're no diffenerent than the atheist or secularlist who squirms when faced with issues not covered in your bible. I can show that your religious practices are not Christian and that rather then look to the writen Word of God for guidance, you seek your own knowledge and understanding. Interjecting If's and Then's as any doubter would.\n \n The ONLY documented case of peace and a prefallen state existed with God and Adam. Once it is documented that another human is created, the VERY 1st act is the Fall. To speculate that anything else could happen is folly and presumption. We already have a historic precident of a Fall happening when 2 or more humans exist. What more PROOF do you want to state that such wouldn't happen over and over and over again?\n \n And you think the Earth would be big enough to hold all of humanity that ever existed plus the added number of children they'd have had they continued to reproduce for 10-25,000 years (which is how old you say the Earth is) plus the animals and food sources needed to support them and that were also created?\n \n \n \n \n And Arch, if you know your bible, when Jesus was hanging with his homies and his mother and biological family showed looking for him, you'd know how he broke the commandment to 'honor your mother' by dissing her and them stating 'I am with my brothers', refering to those he was associating with.\n Matthew 12:46-50", 
   {}, 
   296270, 
   null, 
   1199712540.0
  ], 
  [
   296293, 
   null, 
   "HonestAbe", 
   "Then why did you ask the question below Abe? You knew the answer I would give based on my Avatar and posting profile. So why would you ask a question of someone when you know precisely what the answer will be? I mean, you didn't have to first ask me a question before telling me that you believe having faith in a personal God is nothing more that superstition and wishful thinking. \n \n But since you see it that way, let me assure you that you are wrong and Messiah is as real as you are and is returning to this World someday in the not too distant future. And every knee shall bow and every tongue shall confess that Jesus Christ is Lord. And on that day, you will know how wrong you were in believing as you do today. \n \n \n \n And to answer your question directly, YES, I do know someone who has died and returned to tell me of Heaven. His name is Jesus Christ, the unblemished sacrificial lamb of God and the Savior of Humanity. It is by His shed blood that we are saved and His Holy Spirit indwells and guides all believers. And Jesus sent Him to teach us in His absence. By the way, the comforter in these verses is the Holy Spirit so you can put the message in proper context.\n \n Jhn 14:16 and I will ask the Father, and another Comforter He will give to you, that he may remain with you -- to the age;\n \n Jhn 14:26 and the Comforter, the Holy Spirit, whom the Father will send in my name, he will teach you all things, and remind you of all things that I said to you.\n \n Jhn 15:26 `And when the Comforter may come, whom I will send to you from the Father -- the Spirit of truth, who from the Father doth come forth, he will testify of me;\n \n Jhn 16:7 `But I tell you the truth; it is better for you that I go away, for if I may not go away, the Comforter will not come unto you, and if I go on, I will send Him unto you;\n\n \n How tiresome, ArchAngel. You believe this nonsense because it makes you feel superior, however, you have absolutely no evidence at all to support any of your beliefs other than the delusions you have taken upon yourself. How sad to spend a life in anticipation of another life. You remind me of the polygamous wives of the FLDS who will do anything asked of them in order to fulfill the hope that they will get into heaven one day. Pretty lousy life, IMHO.", 
   {}, 
   296264, 
   null, 
   1199717700.0
  ], 
  [
   296294, 
   null, 
   "Archangel", 
   "Describing Jesus as our brother isn't the least bit blasphemous. Let's not forget that Jesus had at least 1 actual brother, James, and nobody considers him to be the equal of Jesus. The description of Jesus as brother is not particularly uncommon, it features in the liturgy of Iona abbey, for example.\n\n \n James and Jude were Jesus actual half brothers in life Jo. There is a huge difference there to what GC is doing by referring to Jesus as his brother. Jesus isn't our brother at all, He is GOD IN THE FLESH. Our Savior, Messiah and Lord. Nothing about those positions connotes equality in any way at all. That is the point I'm making and I stand by it. It may be acceptable in Catholicism, but it isn't acceptable scripturally is what I am saying.", 
   {}, 
   296278, 
   null, 
   1199719260.0
  ], 
  [
   296295, 
   null, 
   "Archangel", 
   "Prior to the Fall, there existed ONLY ONE man. As soon as a 2nd human was created, the very first act as documented was the defiance that led to the Fall.\n Pre-fallen state existed on ONE man living in peace and fellowship with God.\n Anything beyond that (as manifestly shown) leads to a fallen state.\n \n \n Whether it be the 'pulled out of thin air' 21 minute time frame or days (neither of which times frames are documented in the bible) is irrelevant.\n The VERY NEXT EVENT that happens after Eve's creation is documented quite clearly. The Fall. There is NOTHING that happens between Eve's creation and the Fall. Nothing documented at ALL.\n To say or imply otherwise is to make stuff up.\n Which is something you're quite apt at doing.\n \n Time is Irrelevant precisely because the bible doesn't MAKE IT RELEVANT.\n Nothing of relevance was documented after Eve's creation that happened before the Fall. To think otherwise is heresy and the worst type of presumption.\n \n You should repent.\n \n \n What pleases me most is the manifest levels of ignorance and presumptiousness Christians have over their faith and religions works.\n The only thing unknowable is the assumptions you make.\n All other things can be extrapulated based on God-granted common sense and rationality.\n \n Unknowable knowledge???\n \n ########.\n \n Anything not listed is meaningless. To think otherwise of the bible states you don't believe the bible contains ALL of what you need and therefore must seek other forms of revelation.\n \n Look Archy, I can put the shoe on the other foot all life-time long and show that you're no diffenerent than the atheist or secularlist who squirms when faced with issues not covered in your bible. I can show that your religious practices are not Christian and that rather then look to the writen Word of God for guidance, you seek your own knowledge and understanding. Interjecting If's and Then's as any doubter would.\n \n The ONLY documented case of peace and a prefallen state existed with God and Adam. Once it is documented that another human is created, the VERY 1st act is the Fall. To speculate that anything else could happen is folly and presumption. We already have a historic precident of a Fall happening when 2 or more humans exist. What more PROOF do you want to state that such wouldn't happen over and over and over again?\n \n And you think the Earth would be big enough to hold all of humanity that ever existed plus the added number of children they'd have had they continued to reproduce for 10-25,000 years (which is how old you say the Earth is) plus the animals and food sources needed to support them and that were also created?\n \n And Arch, if you know your bible, when Jesus was hanging with his homies and his mother and biological family showed looking for him, you'd know how he broke the commandment to 'honor your mother' by dissing her and them stating 'I am with my brothers', refering to those he was associating with.\n Matthew 12:46-50\n\n \n Fine Zardoz, believe what you want to believe. I have promised myself that this year I will attempt to make my beliefs clearly understood but wont argue back and forth who make outlandish claims based on assumptions and unknown knowledge. So believe what you will as I have clearly stated my perspective. It isn't my job to actually convince you of anything, only to tell you the truth as I believe it to be. \n \n If you choose to believe that Eve was deceived and caused the Fall immediately after being created then that is your right. I will continue to believe we have no way of ACTUALLY knowing for certain what the timing was after she was created. But hey, good luck with your unique interpretations. emoticon_xgood", 
   {}, 
   296285, 
   null, 
   1199720160.0
  ], 
  [
   296297, 
   null, 
   "Archangel", 
   "How tiresome, ArchAngel. You believe this nonsense because it makes you feel superior, however, you have absolutely no evidence at all to support any of your beliefs other than the delusions you have taken upon yourself. How sad to spend a life in anticipation of another life. You remind me of the polygamous wives of the FLDS who will do anything asked of them in order to fulfill the hope that they will get into heaven one day. Pretty lousy life, IMHO.\n\n \n First of all Abe, my name is Archangel, so get that right so I at least can believe you can read and comprehend english. Secondly, what is superior about me admitting that I am a sinner who falls short of Gods Glory and is in dire need of forgiveness of my many and diverse personal sins? \n \n The great flaw in the thinking of unbelievers is to imply that believers feel as if we are above others because of our personal relationship with God through Christ when in fact it is we who bows before a perfect and holy God in confession and repentance of our sins and then submission to His perfect will as we trust Him to guide our lives through His Holy Spirit which now indwells us.\n \n You on the other hand are standing there insisting that you are fine just as you are. That you haven't sinned at all, are not in any need for spiritual healing at all, so in reality it is you who has the falsely superior attitude that all is well in HonestAbes little world of spiritual superiority. \n \n Now since Spiritual enlightenment is a personal journey for all of us, I can't produce the evidence, as in a science experiment, of what I have personally experienced through the indwelling of Gods Holy Spirit in my lifetime. That is something each person must seek from God through Christ for themselves in this lifetime if they hope to find out why they exist in this life.\n \n So listen carefully Abe, at no time have I insisted that you believe as I do. And at no time have I approached you regarding this subject. It was you who interjected yourself into this by asking a question of me when you already knew the answer I would give. So just as you don't have to believe as I do, neither do you have the right to insult me by claiming that what I have personally experienced in my life isn't based of solid personal evidence or that my beliefs are based on delusions. You are implying that I am mentally ill without even knowing me personally, and based on being a member of this forum for less than a week.\n \n It could easily be construed that only a mentally deranged person would attempt to diagnose another persons spiritual condition with so little evidence to rely on in making such an important determination. So check yourself Abe as it is you who has baited for a confrontation with me and has responded to my sincere posts with insults and false assertions.\n \n Now do yourself a favor and re-read my last post that you quoted again and you will see that it explains a universal need for salvation and in no way infers that believers are in any way superior to anyone else.", 
   {}, 
   296293, 
   null, 
   1199722680.0
  ], 
  [
   296299, 
   null, 
   "GodsCowboy", 
   "I must tell you GC, you concern me. Or your spiritual outlook does I should say. To answer your question directly, YES I do believe Mother Theresa and even John the Baptist sinned after they were saved by grace. In fact I know they did because although they possessed the Holy Spirit within them, they weren't yet in their immortal bodies.\n \n And calling yourself Christ's brother. What's up with that? Jesus Christ is my Savior, Messiah Redeemer and my Hope, but to claim I am His brother would be to elevate me to a level of deity which makes me very uncomfortable. I admit I am a child of my God as a creation of His, but to imply I'm a sibling of the Savior just seems a little blasphemous to me, to put it lightly. Think about what I'm saying. emoticon_xangel\n\n \n I speak the TRUTH as explained in the bible. You might want to read 1 John 3:9-10 (see below). Are you NOT a CHILD OF GOD? If you sin the BIBLE say you are NOT. As a CHILD OF GOD, I call Christ and ALL GOD'S CHILDREN my brothers and sisters.\n \n I can hardly believe YOU SAID, \"I believe Mother Theresa and even John the Baptist sinned after they were saved by grace.\" I guess you think Christ's words, \"GO AND SIN NO MORE\" mean NOTHING. I BELIEVE they're a WARNING. At some point YOUR SINS will NO LONGER be forgiven because THEY PROVE you DON'T BELIEVE by continuing to sin. They PROVE your faith mean NOTHING to you.\n \n YOUR ACTIONS SPEAK LOUDER THAN YOUR WORDS. GOD knows what's inside you and you CAN'T hide it from HIM. Adam and Eve COULDN'T why do you think you can?\n \n 1 John 3:9-10\n \n 9 No one who is born of God will continue to sin, because God's seed remains in him; he cannot go on sinning, because he has been born of God. 10 This is how we know who the children of God are and who the children of the devil are: Anyone who does not do what is right is not a child of God; nor is anyone who does not love his brother.", 
   {}, 
   296273, 
   null, 
   1199724120.0
  ], 
  [
   296300, 
   null, 
   "Zardoz", 
   "If you choose to believe that Eve was deceived and caused the Fall immediately after being created then that is your right. I will continue to believe we have no way of ACTUALLY knowing for certain what the timing was after she was created. But hey, good luck with your unique interpretations. emoticon_xgood\n\n \n These are not 'interpretations', they are actual statements lain out in the bible.\n \n Look archy, does the bible contain ALL the information you need or do you believe it's incomplete and needs additional revelations?\n \n As stated in the bible, the very first documented event that Eve participates in after her creation is being enticed by the serpent to eat the forbidden fruit. Thus, leading directly to the fall.\n It IS 100% irrelevant when this event occurred. She could have spend days, weeks or years (disobeying God by not being fruitful and multipling as ordered in Gen 1.) doing mundane things like standing around looking dumb. But, it is of note that the 1st thing of any imprortance at all was an act leading to the fall. Thus it is recorded in God's glorious book (the best seller of all time.)\n Any Unknowable Knowns that could have happened are 100% irrelevant or they would have been written about.*\n \n *Unless, of course, you believe additional revelations not contained in the bible are needed. \n \n \n So archy, keep putting useless emphasis on 'timing' of the events. You know full well that I am right about this issue. God makes Eve and the very next recorded of Eve's actions is the fall.\n \n \n Think of this Archy, I lay a dollar before a thief and he takes it.\n What makes you think that, repeating this same event over and over with the exact same circumstances, that anything would be different?\n \n The same would hold true with the scenario of God's creations.\n \n Why?\n \n Because the bible makes it clear that all things are in God's 100% control and all things work in accordance to His divine plans.\n To think anything else would diminish the soverignity of God.", 
   {}, 
   296295, 
   null, 
   1199725320.0
  ], 
  [
   296301, 
   null, 
   "Archangel", 
   "I speak the TRUTH as explained in the bible. You might want to read 1 John 3:9-10 (see below). Are you NOT a CHILD OF GOD? If you sin the BIBLE say you are NOT. As a CHILD OF GOD, I call Christ and ALL GOD'S CHILDREN my brothers and sisters.\n \n I can hardly believe YOU SAID, \"I believe Mother Theresa and even John the Baptist sinned after they were saved by grace.\" I guess you think Christ's words, \"GO AND SIN NO MORE\" mean NOTHING. I BELIEVE they're a WARNING. At some point YOUR SINS will NO LONGER be forgiven because THEY PROVE you DON'T BELIEVE by continuing to sin. They PROVE your faith mean NOTHING to you.\n \n YOUR ACTIONS SPEAK LOUDER THAN YOUR WORDS. GOD knows what's inside you and you CAN'T hide it from HIM. Adam and Eve COULDN'T why do you think you can?\n \n 1 John 3:9-10\n \n 9 No one who is born of God will continue to sin, because God's seed remains in him; he cannot go on sinning, because he has been born of God. 10 This is how we know who the children of God are and who the children of the devil are: Anyone who does not do what is right is not a child of God; nor is anyone who does not love his brother.\n\n \n I believe that Jesus words \"go and sin no more\" apply directly to me also GC, but can I then stand before you and claim that I have never sinned since being born again? I only wish I could, but I would either being lying to you which would be another sin, or I would be delusional which is also bad for my testimony as a Christian. \n \n Regarding 1 John 3:9, it is saying that no one who is born again will continue to sin actively, on purpose and willfully. Not that we are then incapable of sinning anymore. Or are even able to willfully never sin again. Please tell me how you interpret this passage from Romans which I posted earlier as it speaks directly to Paul's frustration as he was at war with personal sins between his flesh and his spirit, and we both know beyond doubt that he was born again at the time of the writing of that letter.\n \n Rom 7:5 \n For when we were in the flesh, the sinful passions which were aroused by the law were at work in our members to bear fruit to death.\n Rom 7:6 \n But now we have been delivered from the law, having died to what we were held by, so that we should serve in the newness of the Spirit and not in the oldness of the letter.\n Rom 7:7 \n What shall we say then? Is the law sin? Certainly not! On the contrary, I would not have known sin except through the law. For I would not have known covetousness unless the law had said, \"You shall not covet.\"[fn1]\n Rom 7:8 \n But sin, taking opportunity by the commandment, produced in me all manner of evil desire. For apart from the law sin was dead.\n Rom 7:9 \n I was alive once without the law, but when the commandment came, sin revived and I died.\n Rom 7:10 \n And the commandment, which was to bring life, I found to bring death.\n Rom 7:11 \n For sin, taking occasion by the commandment, deceived me, and by it killed me.\n Rom 7:12 \n Therefore the law is holy, and the commandment holy and just and good.\n Rom 7:13 \n Has then what is good become death to me? Certainly not! But sin, that it might appear sin, was producing death in me through what is good, so that sin through the commandment might become exceedingly sinful.\n Rom 7:14 \n For we know that the law is spiritual, but I am carnal, sold under sin.\n Rom 7:15 \n For what I am doing, I do not understand. For what I will to do, that I do not practice; but what I hate, that I do.\n Rom 7:16 \n If, then, I do what I will not to do, I agree with the law that it is good.\n Rom 7:17 \n But now, it is no longer I who do it, but sin that dwells in me.\n Rom 7:18 \n For I know that in me (that is, in my flesh) nothing good dwells; for to will is present with me, but how to perform what is good I do not find.\n Rom 7:19 \n For the good that I will to do, I do not do; but the evil I will not to do, that I practice.\n Rom 7:20 \n Now if I do what I will not to do, it is no longer I who do it, but sin that dwells in me.\n Rom 7:21 \n I find then a law, that evil is present with me, the one who wills to do good.\n Rom 7:22 \n For I delight in the law of God according to the inward man.\n Rom 7:23 \n But I see another law in my members, warring against the law of my mind, and bringing me into captivity to the law of sin which is in my members.\n Rom 7:24 \n O wretched man that I am! Who will deliver me from this body of death?\n Rom 7:25 \n I thank God--through Jesus Christ our Lord! So then, with the mind I myself serve the law of God, but with the flesh the law of sin.", 
   {}, 
   296299, 
   null, 
   1199725980.0
  ], 
  [
   296302, 
   null, 
   "Archangel", 
   "These are not 'interpretations', they are actual statements lain out in the bible.\n \n Look archy, does the bible contain ALL the information you need or do you believe it's incomplete and needs additional revelations?\n \n As stated in the bible, the very first documented event that Eve participates in after her creation is being enticed by the serpent to eat the forbidden fruit. Thus, leading directly to the fall.\n It IS 100% irrelevant when this event occurred. She could have spend days, weeks or years (disobeying God by not being fruitful and multipling as ordered in Gen 1.) doing mundane things like standing around looking dumb. But, it is of note that the 1st thing of any imprortance at all was an act leading to the fall. Thus it is recorded in God's glorious book (the best seller of all time.)\n Any Unknowable Knowns that could have happened are 100% irrelevant or they would have been written about.*\n \n *Unless, of course, you believe additional revelations not contained in the bible are needed. \n \n \n So archy, keep putting useless emphasis on 'timing' of the events. You know full well that I am right about this issue. God makes Eve and the very next recorded of Eve's actions is the fall.\n \n \n Think of this Archy, I lay a dollar before a thief and he takes it.\n What makes you think that, repeating this same event over and over with the exact same circumstances, that anything would be different?\n \n The same would hold true with the scenario of God's creations.\n \n Why?\n \n Because the bible makes it clear that all things are in God's 100% control and all things work in accordance to His divine plans.\n To think anything else would diminish the soverignity of God.\n\n \n God has given me all of the information I needed in order to make a decision to know Him personally. Much of it extra natural in that it was from personal revelation that He met me on such a personal level which goes beyond what I know intellectually.\n \n So the bible is complete in what we need to know but it doesn't answer ever question we have regarding our existence. This question being a good example of one such unanswered question. Here is what is important, all of the information needed for salvation has been given us by God. Questions like this which have nothing to do with salvation are interesting to discuss but aren't going to save or condemn a person either way.\n \n That's why I'm not going to argue with you about it. Believe what you want to. I believe you are making huge assumptions by assuming it happened right after she was created but you have every right to believe it because the bible doesn't say otherwise. I'm just trying to stress that since it doesn't say when she was deceived, I have no reason to insist or even believe it happened immediately after she was created. That's my stance and I'm sticking with it.", 
   {}, 
   296300, 
   null, 
   1199726700.0
  ], 
  [
   296317, 
   null, 
   "Jo Bennett", 
   "James and Jude were Jesus actual half brothers in life Jo. There is a huge difference there to what GC is doing by referring to Jesus as his brother. Jesus isn't our brother at all, He is GOD IN THE FLESH. Our Savior, Messiah and Lord. Nothing about those positions connotes equality in any way at all. That is the point I'm making and I stand by it. It may be acceptable in Catholicism, but it isn't acceptable scripturally is what I am saying.\n\n \n Iona abbey isn't Catholic (well, in the literal sense it is, not in the the sense of being Roman Catholic), I'm not Catholic, I don't know why you bring Catholicism into this. Iona is an ecumenical Christian community. My point with referring to James is that even though he was the brother of Jesus, nobody believed him equal to Jesus, so your claim that to call Jesus brother implies equality is a false one, not borne out by scripture. Jesus is human as well as God in any case. Jesus represents the perfection of humanity, as Adam was before the fall, as well as the incarnation of God. This is partly why Jesus is referred to as \"a second Adam\".", 
   {}, 
   296294, 
   null, 
   1199734020.0
  ], 
  [
   296320, 
   null, 
   "Zardoz", 
   "The problem with you Arch is you're the one who put a specific time on Eve's act that led to the Fall.\n When the fact of what the bible states is clear.\n The 1st instance of Eve doing ANYTHING shows her engaging in the act that led to the Fall. There is no recording of her doing anything else at all.\n \n What this argument about is vitally important because it illustrates what a hypocritical heretic you are (in context of Christianity) when you find the need to have additional revelations to support your beliefs. That you must constantly add to the bible (now and forever more) when ever your limited intellect comes to a stumbling block in todays WORLD when you believe the bible doesn't provide an answer for you.\n No better than a Mormon.\n \n Anyone half skilled in biblical study and knowledge will often find that such people who engage is additional revelations will find that they invariably contradict basic tenants and doctrins of the Christian faith. \n \n From my perspective, it's clear you'd adhear to personal revelations and experiences rather than biblical truths. As such, it's easy to see why you follow your tickling ear and selfish desires rather than crucify your flesh and confrom to the Word of your own God.\n \n Time and again, I find that these tangental discussions aren't based on the bible such as pre, post or mid tribulation issues that don't affect salvation (which is what you try to push) but on whether you interject your current beliefs into scipture like a patch for a computer program. \n Wanting something to be true because you feel it to be right even if there is no basis in scripture for it. Even if scripture contradicts it.", 
   {}, 
   296302, 
   null, 
   1199735280.0
  ], 
  [
   296321, 
   null, 
   "Zardoz", 
   "The problem with you Arch is you're the one who put a specific time on Eve's act that led to the Fall.\n When the fact of what the bible states is clear.\n The 1st instance of Eve doing ANYTHING shows her engaging in the act that led to the Fall. There is no recording of her doing anything else at all.\n \n What this argument about is vitally important because it illustrates what a hypocritical heretic you are (in context of Christianity) when you find the need to have additional revelations to support your beliefs. That you must constantly add to the bible (now and forever more) when ever your limited intellect comes to a stumbling block in todays WORLD when you believe the bible doesn't provide an answer for you.\n No better than a Mormon.\n \n Anyone half skilled in biblical study and knowledge will often find that such people who engage is additional revelations will find that they invariably contradict basic tenants and doctrins of the Christian faith. \n \n From my perspective, it's clear you'd adhear to personal revelations and experiences rather than biblical truths. As such, it's easy to see why you follow your tickling ear and selfish desires rather than crucify your flesh and confrom to the Word of your own God.\n \n Time and again, I find that these tangental discussions aren't based on the bible such as pre, post or mid tribulation issues that don't affect salvation (which is what you try to push) but on whether you interject your current beliefs into scipture like a patch for a computer program. \n Wanting something to be true because you feel it to be right even if there is no basis in scripture for it. Even if scripture contradicts it.", 
   {}, 
   296302, 
   null, 
   1199735580.0
  ], 
  [
   296323, 
   null, 
   "Archangel", 
   "Iona abbey isn't Catholic (well, in the literal sense it is, not in the the sense of being Roman Catholic), I'm not Catholic, I don't know why you bring Catholicism into this. Iona is an ecumenical Christian community. My point with referring to James is that even though he was the brother of Jesus, nobody believed him equal to Jesus, so your claim that to call Jesus brother implies equality is a false one, not borne out by scripture. Jesus is human as well as God in any case. Jesus represents the perfection of humanity, as Adam was before the fall, as well as the incarnation of God. This is partly why Jesus is referred to as \"a second Adam\".\n\n \n Your comparing James to Jesus in Jesus glorified state in any way is irrelevant to this discussion because James was actually Jesus half brother while both men lived in the flesh. They both had the same mother so were actually related by blood.So to use use James as a proper example of one who can be called Jesus brother has nothing to do in reality with me or you referring to Jesus as our brother. \n \n Read the book of James and show me where he boasts or places himself on any equal footing with Jesus because they are half brothers, you can't, because He doesn't. Look how James refers to himself in comparison to his half brother Jesus in the greeting at the beginning of his epistle.\n \n \nJam 1:1 \n JAMES, a bondservant of God and of the Lord Jesus Christ,\n \n To the twelve tribes which are scattered abroad:\n \n Greetings.\n\n \n Now if James doesn't claim his brotherly relationship with Jesus in referring to Him when they were actually related by blood, once Jesus was glorified, what right do we have to do it now as children who worship Him as our Lord and Savior? The answer is we don't, or shouldn't. James took a SERVANT status in his comparison to his half brother, the Glorified Christ. \n \n And my statement to GC was that it made me very uncomfortable that a spiritual brother would do it and makes me concerned for him as it feels blasphemous. \n \n Jesus is not my brother to be back slapped as some equal but is my Lord and Savior who as God, took upon Himself the flesh of man, lived among us as an example of how to live a victorious life, then He sacrificed Himself as the perfect lamb of God and died for my sins specifically. That act is one that in all of time and space only Jesus Christ was able to accomplish. \n \n For that reason He is our Lord, not our brother whom I feel comfortable referring to in such a casual way. He is my savior, messiah, redeemer and Lord of Lords and King of Kings. Not my brother. I don't know how else to say it Jo, so I'll leave it at that.", 
   {}, 
   296317, 
   null, 
   1199737500.0
  ], 
  [
   296326, 
   null, 
   "sinjin", 
   "I never want to stop sinning. Sinners have more fun.", 
   {}, 
   296323, 
   null, 
   1199739120.0
  ], 
  [
   296334, 
   null, 
   "Archangel", 
   "The problem with you Arch is you're the one who put a specific time on Eve's act that led to the Fall.\n When the fact of what the bible states is clear.\n The 1st instance of Eve doing ANYTHING shows her engaging in the act that led to the Fall. There is no recording of her doing anything else at all.\n \n What this argument about is vitally important because it illustrates what a hypocritical heretic you are (in context of Christianity) when you find the need to have additional revelations to support your beliefs. That you must constantly add to the bible (now and forever more) when ever your limited intellect comes to a stumbling block in todays WORLD when you believe the bible doesn't provide an answer for you.\n No better than a Mormon.\n \n Anyone half skilled in biblical study and knowledge will often find that such people who engage is additional revelations will find that they invariably contradict basic tenants and doctrins of the Christian faith. \n \n From my perspective, it's clear you'd adhear to personal revelations and experiences rather than biblical truths. As such, it's easy to see why you follow your tickling ear and selfish desires rather than crucify your flesh and confrom to the Word of your own God.\n \n Time and again, I find that these tangental discussions aren't based on the bible such as pre, post or mid tribulation issues that don't affect salvation (which is what you try to push) but on whether you interject your current beliefs into scipture like a patch for a computer program. \n Wanting something to be true because you feel it to be right even if there is no basis in scripture for it. Even if scripture contradicts it.\n\n \n Tell me Zardoz, what is it that I want to be true in this debate? It is I who has repeatedly said that we have no way of knowing the timing between eves creation and the fall from grace. It is you who is so shallow as to believe that just because the next chapter in Genesis after her creation goes to the temptation and the fall, then surely that is the extent of eves life in Paradise, as if the bible is a diary and not Gods story of the high points of our creation.\n \n I even said earlier that I don't know the timing and you might be right, but since the bible doesn't give a time I'm not prepared to make assumptions and presume anything that isn't there. But that isn't good enough for you. You seem to have this need to get me to think as you do, but that isn't going to happen because you are making unsupported assumptions by insisting that the very first thing Eve did after being created is lead Adam to the Fall from Grace. You don't even see fit to give the poor kids a honeymoon. \n \n So as I said earlier, insult my christianity, call me a hypocritical heretic, because I know that the true heretic will be exposed on the final day. Believe what you like Zardoz, as I said earlier, I'm not going to try to convince you of anything so please don't try to convince me of your way of interpreting the bible. Especially since your way leaves too much to the imagination.", 
   {}, 
   296321, 
   null, 
   1199747280.0
  ], 
  [
   296339, 
   null, 
   "HonestAbe", 
   "I never want to stop sinning. Sinners have more fun.\n\n \n Just like blondes. Christian tend to be the least happy group of people and have to sin in order to have any fun. They are oppressed. emoticon_xgood", 
   {}, 
   296326, 
   null, 
   1199747760.0
  ], 
  [
   296341, 
   null, 
   "Archangel", 
   "Just like blondes. Christian tend to be the least happy group of people and have to sin in order to have any fun. They are oppressed. emoticon_xgood\n\n \n On what delusion do you base that opinion Abe? Surely you don't know any believers to say such a thing. But you just assume it based on total ignorance of what it means to be saved. Here's the difference between me and you as described in the bible Abe.\n Gal 5:16 \n I say then: Walk in the Spirit, and you shall not fulfill the lust of the flesh.\n Gal 5:17 \n For the flesh lusts against the Spirit, and the Spirit against the flesh; and these are contrary to one another, so that you do not do the things that you wish.\n Gal 5:18 \n But if you are led by the Spirit, you are not under the law.\n Gal 5:19 \n Now the works of the flesh are evident, which are: adultery,[fn3] fornication, uncleanness, lewdness,\n Gal 5:20 \n idolatry, sorcery, hatred, contentions, jealousies, outbursts of wrath, selfish ambitions, dissensions, heresies,\n Gal 5:21 \n envy, murders,[fn4] drunkenness, revelries, and the like; of which I tell you beforehand, just as I also told you in time past, that those who practice such things will not inherit the kingdom of God.\n Gal 5:22 \n But the fruit of the Spirit is love, joy, peace, longsuffering, kindness, goodness, faithfulness,\n Gal 5:23 \n gentleness, self-control. Against such there is no law.\n Gal 5:24 \n And those who are Christ's have crucified the flesh with its passions and desires.\n Verse 19-21 are the sins the unbeliever enjoys so much. Notice that joy, peace, love and kindness come with the fruits of the Spirit. So once again you speak of that which you have no clue about.", 
   {}, 
   296339, 
   null, 
   1199748420.0
  ], 
  [
   296347, 
   null, 
   "HonestAbe", 
   "On what delusion do you base that opinion Abe? Surely you don't know any believers to say such a thing. But you just assume it based on total ignorance of what it means to be saved. Here's the difference between me and you as described in the bible Abe.\n Gal 5:16 \n I say then: Walk in the Spirit, and you shall not fulfill the lust of the flesh.\n Gal 5:17 \n For the flesh lusts against the Spirit, and the Spirit against the flesh; and these are contrary to one another, so that you do not do the things that you wish.\n Gal 5:18 \n But if you are led by the Spirit, you are not under the law.\n Gal 5:19 \n Now the works of the flesh are evident, which are: adultery,[fn3] fornication, uncleanness, lewdness,\n Gal 5:20 \n idolatry, sorcery, hatred, contentions, jealousies, outbursts of wrath, selfish ambitions, dissensions, heresies,\n Gal 5:21 \n envy, murders,[fn4] drunkenness, revelries, and the like; of which I tell you beforehand, just as I also told you in time past, that those who practice such things will not inherit the kingdom of God.\n Gal 5:22 \n But the fruit of the Spirit is love, joy, peace, longsuffering, kindness, goodness, faithfulness,\n Gal 5:23 \n gentleness, self-control. Against such there is no law.\n Gal 5:24 \n And those who are Christ's have crucified the flesh with its passions and desires.\n Verse 19-21 are the sins the unbeliever enjoys so much. Notice that joy, peace, love and kindness come with the fruits of the Spirit. So once again you speak of that which you have no clue about.\n\n \n Because I don't swallow your superstitions hook, line and sinker, doesn't mean I have no clue about love and kindness. Your ignorance is showing like Romney's special underwear.", 
   {}, 
   296341, 
   null, 
   1199751060.0
  ], 
  [
   296352, 
   null, 
   "Archangel", 
   "Because I don't swallow your superstitions hook, line and sinker, doesn't mean I have no clue about love and kindness. Your ignorance is showing like Romney's special underwear.\n\n \n That's ok Abe, but don't think you're exempt of swallowing superstitions hook, line and sinker, because what do you think evolution and the principles of secular humanism that you are betting your soul on are? emoticon_rolleyes I believe in God while you believe in Man. Good luck with that, really. Cuz you're gonna need it. emoticon_xbye", 
   {}, 
   296347, 
   null, 
   1199754180.0
  ], 
  [
   296356, 
   null, 
   "sinjin", 
   "from wiki:\n \n \"Superstition is a belief or notion, not based on reason or knowledge, in or of the ominous significance of a particular thing, circumstance, occurrence, proceeding, or the like.\"\n \n Nothing in science is theorized in the absence of reason and/or knowledge. Nice try AA.", 
   {}, 
   296352, 
   null, 
   1199755320.0
  ], 
  [
   296358, 
   null, 
   "HonestAbe", 
   "That's ok Abe, but don't think you're exempt of swallowing superstitions hook, line and sinker, because what do you think evolution and the principles of secular humanism that you are betting your soul on are? emoticon_rolleyes I believe in God while you believe in Man. Good luck with that, really. Cuz you're gonna need it. emoticon_xbye\n\n \n I don't need your superstitions, AA. They are nothing more than fairy tales. :p", 
   {}, 
   296352, 
   null, 
   1199757600.0
  ], 
  [
   296359, 
   null, 
   "Archangel", 
   "from wiki:\n \n \"Superstition is a belief or notion, not based on reason or knowledge, in or of the ominous significance of a particular thing, circumstance, occurrence, proceeding, or the like.\"\n \n Nothing in science is theorized in the absence of reason and/or knowledge. Nice try AA.\n\n \n You say that sinjun and I know you believe it too. But to state the age of the Universe is an absolute figure without even being able to define what dark matter is or explain why different parts of the Universe is expanding at different speeds falls perfectly into the realm of superstitious hoo-doo which is based on nothing more than far fetched notions which are just as unprovable in the lab as my God is. But you pass your superstitious hoo-doo off as science and call that credible and reliable information. BALDERDASH I SAY, ABSOLUTE BALDERDASH, AND RUBBISH TOO. :p How's that for an indignant british accent? emoticon_xbye", 
   {}, 
   296356, 
   null, 
   1199757840.0
  ], 
  [
   296362, 
   null, 
   "thelmoose", 
   "\n But to state the age of the Universe is an absolute figure without even being able to define what dark matter is or explain why different parts of the Universe is expanding at different speeds falls perfectly into the realm of superstitious hoo-doo... \n\n \n I am not sure how you combined those three thoughts, but\n \n 1. The age of the Universe (or of anything)will always an \"absolute\" versus a relative number. Perhaps you are suggesting the proposed age is less than approximate?\n \n 2. I don't even know if it is true that we are unable to define dark matter or that we cannot explain differential expansion rates of the Universe (or even if that occurs.) Even if these are true, it only means that science doesn't can't explain everything. Everyone already knows this and fully accepts it. All scientists freely admit there are gaps in the knowledge base, some quite gaping. If there were not, we wouldn't need to conduct scientific research. All scientists are rightly humbled by our relative ignorance. \n \n Admitting a lack of knowledge is not the same as superstition. It is exactly the opposite, as the latter presumes to know an explanation when definite knowledge is lacking. \n \n You failed to demonstrate your point - that science is the same as superstition - so you need to try again.", 
   {}, 
   296359, 
   null, 
   1199759700.0
  ], 
  [
   296381, 
   null, 
   "GodsCowboy", 
   "I believe that Jesus words \"go and sin no more\" apply directly to me also GC, but can I then stand before you and claim that I have never sinned since being born again? I only wish I could, but I would either being lying to you which would be another sin, or I would be delusional which is also bad for my testimony as a Christian. \n \n Regarding 1 John 3:9, it is saying that no one who is born again will continue to sin actively, on purpose and willfully. Not that we are then incapable of sinning anymore. Or are even able to willfully never sin again. Please tell me how you interpret this passage from Romans which I posted earlier as it speaks directly to Paul's frustration as he was at war with personal sins between his flesh and his spirit, and we both know beyond doubt that he was born again at the time of the writing of that letter.\n \n Rom 7:5-7:25 \n \n\n \n First the bible proves there are people that DON'T SIN (Read 2 Samuel 22:21-25 see below). I bet Abraham, Moses and Noah also didn't sin.\n \n Second 1 John 3:9-1 (see below) says more than you understood. It's NOT talking about being BORN AGAIN. It's talking about becoming ONE with the SPIRIT OF GOD. Once you receive that GIFT you'll NEVER SIN AGAIN. The Apoltles didn't get that gift till Christ had left and GOD sent the HELPER (the SPIRIT OF GOD). \n \n Third, the SPIRIT within me hasn't found a WAY to or DOESN'T want to find a way to help me understand Paul. He was TOO EDUCATED for GOD'S WORK. He wrote to IMPRESS NOT to TEACH the outcasts. If and/or when the SPIRIT decides to help me understand Paul's messages then and only then will I worry about them.\n 2 SAMUEL 22L21-25\n \n 21 \"The Lord has dealt with me according to my righteousness; according to the cleanness of my hands he has rewarded me. 22 For I have kept the ways of the Lord; I have not done evil by turning from my God. 23 All his laws are before me; I have not turned away from his decrees. 24 I have been blameless before him and have kept myself from sin. 25 The Lord has rewarded me according to my righteousness, according to my cleanness in his sight. 1 John 3:9-10\n \n 9 No one who is born of God will continue to sin, because God's seed remains in him; he cannot go on sinning, because he has been born of God. 10 This is how we know who the children of God are and who the children of the devil are: Anyone who does not do what is right is not a child of God; nor is anyone who does not love his brother. \n ", 
   {}, 
   296301, 
   null, 
   1199778600.0
  ], 
  [
   296417, 
   null, 
   "Archangel", 
   "First the bible proves there are people that DON'T SIN (Read 2 Samuel 22:21-25 see below). I bet Abraham, Moses and Noah also didn't sin.\n \n Second 1 John 3:9-1 (see below) says more than you understood. It's NOT talking about being BORN AGAIN. It's talking about becoming ONE with the SPIRIT OF GOD. Once you receive that GIFT you'll NEVER SIN AGAIN. The Apoltles didn't get that gift till Christ had left and GOD sent the HELPER (the SPIRIT OF GOD). \n \n Third, the SPIRIT within me hasn't found a WAY to or DOESN'T want to find a way to help me understand Paul. He was TOO EDUCATED for GOD'S WORK. He wrote to IMPRESS NOT to TEACH the outcasts. If and/or when the SPIRIT decides to help me understand Paul's messages then and only then will I worry about them.\n 2 SAMUEL 22L21-25\n \n 21 \"The Lord has dealt with me according to my righteousness; according to the cleanness of my hands he has rewarded me. 22 For I have kept the ways of the Lord; I have not done evil by turning from my God. 23 All his laws are before me; I have not turned away from his decrees. 24 I have been blameless before him and have kept myself from sin. 25 The Lord has rewarded me according to my righteousness, according to my cleanness in his sight. 1 John 3:9-10\n \n 9 No one who is born of God will continue to sin, because God's seed remains in him; he cannot go on sinning, because he has been born of God. 10 This is how we know who the children of God are and who the children of the devil are: Anyone who does not do what is right is not a child of God; nor is anyone who does not love his brother. \n \n\n \n GC, you bet Abraham, Moses and Noah never sinned? Don't you know that betting is a sin according to Gods perfect standards, so you just sinned by wanting to bet me. You see how impossible it is to live up to the standards of a perfectly Holy God? Also, you say Moses never sinned? When? After his Mt Sinai experience maybe? Is that what you mean? Then why wasn't Moses allowed to enter the Promised Land GC. Could it be that when he smashed the commandments God wrote for him that he angered God because he oh, sinned against him just hours after standing in Gods presence?\n \n Either you don't understand what sin is or you don't understand the nature of sin GC because you are just plain wrong to assume any of us can live perfect lives in this flesh. I totally agree that we are to strive to submit perfectly to Gods Holy Spirit which indwells all believers and seek to glorify Him with our lives, but to claim that anyone actually accomplishes that while in this flesh is a self deception. And why didn't you explain this passage from Paul?\n Rom 7:5 \n For when we were in the flesh, the sinful passions which were aroused by the law were at work in our members to bear fruit to death.\n Rom 7:6 \n But now we have been delivered from the law, having died to what we were held by, so that we should serve in the newness of the Spirit and not in the oldness of the letter.\n Rom 7:7 \n What shall we say then? Is the law sin? Certainly not! On the contrary, I would not have known sin except through the law. For I would not have known covetousness unless the law had said, \"You shall not covet.\"[fn1]\n Rom 7:8 \n But sin, taking opportunity by the commandment, produced in me all manner of evil desire. For apart from the law sin was dead.\n Rom 7:9 \n I was alive once without the law, but when the commandment came, sin revived and I died.\n Rom 7:10 \n And the commandment, which was to bring life, I found to bring death.\n Rom 7:11 \n For sin, taking occasion by the commandment, deceived me, and by it killed me.\n Rom 7:12 \n Therefore the law is holy, and the commandment holy and just and good.\n Rom 7:13 \n Has then what is good become death to me? Certainly not! But sin, that it might appear sin, was producing death in me through what is good, so that sin through the commandment might become exceedingly sinful.\n Rom 7:14 \n For we know that the law is spiritual, but I am carnal, sold under sin.\n Rom 7:15 \n For what I am doing, I do not understand. For what I will to do, that I do not practice; but what I hate, that I do.\n Rom 7:16 \n If, then, I do what I will not to do, I agree with the law that it is good.\n Rom 7:17 \n But now, it is no longer I who do it, but sin that dwells in me.\n Rom 7:18 \n For I know that in me (that is, in my flesh) nothing good dwells; for to will is present with me, but how to perform what is good I do not find.\n Rom 7:19 \n For the good that I will to do, I do not do; but the evil I will not to do, that I practice.\n Rom 7:20 \n Now if I do what I will not to do, it is no longer I who do it, but sin that dwells in me.\n Rom 7:21 \n I find then a law, that evil is present with me, the one who wills to do good.\n Rom 7:22 \n For I delight in the law of God according to the inward man.\n Rom 7:23 \n But I see another law in my members, warring against the law of my mind, and bringing me into captivity to the law of sin which is in my members.\n Rom 7:24 \n O wretched man that I am! Who will deliver me from this body of death?\n Rom 7:25 \n I thank God--through Jesus Christ our Lord! So then, with the mind I myself serve the law of God, but with the flesh the law of sin.\n Paul is clearly saying that his inward man seeks to obey God and not sin yet his outward man is always warring against the inward man and he constantly does what he hates to do which is SIN against his Holy God. And then he cries out in frustration,\n \n \nRom 7:24 \n O wretched man that I am! Who will deliver me from this body of death?\n\n \n Now look carefully GC, could Paul be recognizing that as long as we are in these fleshly bodies that still die, proving that corruption is still within them, that where death exists, so does sin? Don't you see that when we die to this body as believers and get our immortal bodies, then will our process of being perfected in Christ be completed. This flesh is corrupte GC and with corruption comes sin. And ask yourself this GC. if after getting saved by grace, if we are then sinless beings, why do we need the continuing grace of God through Christ upon us? Think about that GC.\n \n But please, you explain how you see this passage, I await with baited breath.", 
   {}, 
   296381, 
   null, 
   1199809620.0
  ], 
  [
   296473, 
   null, 
   "HonestAbe", 
   "\n \n But please, you explain how you see this passage, I await with baited breath.\n\n \n Is having baited breath another kind of sin?", 
   {}, 
   296417, 
   null, 
   1199837220.0
  ], 
  [
   296478, 
   null, 
   "Archangel", 
   "Is having baited breath another kind of sin?\n\n \n No, but associating with the likes of you is, so excuse me while I go repent. emoticon_xangel", 
   {}, 
   296473, 
   null, 
   1199839920.0
  ], 
  [
   296488, 
   null, 
   "HonestAbe", 
   "No, but associating with the likes of you is, so excuse me while I go repent. emoticon_xangel\n\n \n Not very friendly, AA. I should report you. BTW, how are you connected to a poster named Raven?", 
   {}, 
   296478, 
   null, 
   1199841420.0
  ], 
  [
   296491, 
   null, 
   "Archangel", 
   "Not very friendly, AA. I should report you. BTW, how are you connected to a poster named Raven?\n\n \n Please do report me. You can get banned for making frivolous reports. And I'm not connected to any poster named Raven. Could you be more specific about who that is?", 
   {}, 
   296488, 
   null, 
   1199841780.0
  ], 
  [
   296493, 
   null, 
   "HonestAbe", 
   "Please do report me. You can get banned for making frivolous reports. And I'm not connected to any poster named Raven. Could you be more specific about who that is?\n\n \n Someone on another forum said that you were scared of a poster named Raven, that's all. You seem terribly angry for a christian. Why is that? Part of your Arab blood?", 
   {}, 
   296491, 
   null, 
   1199842200.0
  ], 
  [
   296497, 
   null, 
   "Archangel", 
   "Someone on another forum said that you were scared of a poster named Raven, that's all. You seem terribly angry for a christian. Why is that? Part of your Arab blood?\n\n \n I'm not angry at all. I just have a low tolerance for, and little patience with ignorance, and you just wreak of it. So you're a troll from the CC huh, well I'm not surprised you're here, ever since I left, that place has died. BTW, Raven followed me here for some challenging debating since that place is a morgue now. She's just too much of a coward to use that handle though. Have fun abe, and welcome to the forum. emoticon_smile", 
   {}, 
   296493, 
   null, 
   1199843220.0
  ], 
  [
   296573, 
   null, 
   "HonestAbe", 
   "I'm not angry at all. I just have a low tolerance for, and little patience with ignorance, and you just wreak of it. So you're a troll from the CC huh, well I'm not surprised you're here, ever since I left, that place has died. BTW, Raven followed me here for some challenging debating since that place is a morgue now. She's just too much of a coward to use that handle though. Have fun abe, and welcome to the forum. emoticon_smile\n\n \n I am neither ignorant nor a troll. I think your ignorance and self-serving belief system prevents you from thinking.", 
   {}, 
   296497, 
   null, 
   1199903820.0
  ], 
  [
   296576, 
   null, 
   "Archangel", 
   "I am neither ignorant nor a troll. I think your ignorance and self-serving belief system prevents you from thinking.\n\n \n Of course you are, and you're in denial too. And those of us on opposite ends of the political and philosophical spectrum here recognize it.\n \n http://www.4forums.com/political/showpost.php?p=296529&postcount=2", 
   {}, 
   296573, 
   null, 
   1199904180.0
  ], 
  [
   296592, 
   null, 
   "HonestAbe", 
   "Of course you are, and you're in denial too. And those of us on opposite ends of the political and philosophical spectrum here recognize it.\n \n http://www.4forums.com/political/showpost.php?p=296529&postcount=2\n\n \n LOL Archie. You are politically an ignoramus and your philosophy is rolled up in ancient superstitions, myths, and stories. Ignorance is your realm, buddy.", 
   {}, 
   296576, 
   null, 
   1199916900.0
  ], 
  [
   297262, 
   null, 
   "GodsCowboy", 
   "http://i38.photobucket.com/albums/e110/GodsCowboy/GODSMessages/BLOGPictures/HeavenTheRewardforChildrenOfGOD.jpg\n \n We have ALL SINNED but some people STOP SINNING. They are called THE CHILDREN OF GOD. So for this year's resolution why not give up sinning and become a CHILD OF GOD.\n \n 1 John 3:9-10 (see below) tells us that CHILDREN OF GOD DON'T SIN. So the next time you think it's okay to sin because GOD will forgive you, ask yourself this question first: Is the sin the devil wants me to commit worth giving up my RIGHT to be a CHILD OF GOD? Then maybe you just might think twice about those little sins and want to become a CHILD OF GOD instead.\n \n So let's make this year's NEW YEAR'S RESOLUTION the INTENT to NEVER sin again. Remember what Christ told the people he forgave. \"GO AND SIN NO MORE.\"\n \n HAPPY NEW YEAR\n Chuck Lentine\n (AKA GOD'S Cowboy)\n \n Referenced bible passages:\n \n ----------1 John 3:9-10\n \n ----------9 No one who is born of God will continue to sin, because God's seed remains in him; he cannot go on sinning, because he has been born of God. 10 This is how we know who the children of God are and who the children of the devil are: Anyone who does not do what is right is not a child of God; nor is anyone who does not love his brother.\n\n \n I've noticed several posts objecting to ME or ANYONE for that matter calling themselves Christ's brother. I want to thank those that stood up for OUR RIGHT to call ourselves Christ's brother.\n \n Today, GOD decided to give us an answer that'll STOP ALL the COMPLAINTS. Christ HIMSELF gave us permission to be HIS BROTHER. You can find HIS WORDS and the PROOF GOD wants EVERYONE to BELIEVE in the BIBLE (see Matthew 12:50; Mark 3:35; & Luke 8:21 below).\n \n Now GOD wants to know WHY some people DON'T want to call Christ THEIR BROTHER? Is it because they DON'T want to do the WILL OF GOD OUR FATHER? OR because they HAVEN'T studied bible enough but they're going to START studying TODAY.\n \n Matthew 12:50\n \n 50 \"... For whoever does the will of my Father in heaven is my brother and sister and mother.\" \n \n Mark 3:35\n \n 35 \"... Whoever does God's will is my brother and sister and mother.\" \n \n Luke 8:21\n \n 21 He replied, \"My mother and brothers are those who hear God's word and put it into practice.\"", 
   {
    "unicode_changes_made": true
   }, 
   296142, 
   null, 
   1200283920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Not EVERYONE Sins (Post #82)", 
  "url": "http://www.4forums.com/political/bible-doctrine/10776-not-everyone-sins-post-82-a.html", 
  "breadcrumbs": [
   "Bible Doctrine"
  ], 
  "id_number": 10776, 
  "discussion_files": [
   [
    "26996.html", 
    "http://www.4forums.com/political/bible-doctrine/10776-not-everyone-sins-post-82-a-print.html"
   ], 
   [
    "26997.html", 
    "http://www.4forums.com/political/bible-doctrine/10776-not-everyone-sins-post-82-a-5-print.html"
   ], 
   [
    "26998.html", 
    "http://www.4forums.com/political/bible-doctrine/10776-not-everyone-sins-post-82-a-4-print.html"
   ], 
   [
    "26999.html", 
    "http://www.4forums.com/political/bible-doctrine/10776-not-everyone-sins-post-82-a-3-print.html"
   ], 
   [
    "27000.html", 
    "http://www.4forums.com/political/bible-doctrine/10776-not-everyone-sins-post-82-a-2-print.html"
   ]
  ], 
  "identifier": 10776
 }
]