[
 [
  [
   296405, 
   null, 
   "ibelieveyou", 
   "Gays everywhere are lobbying for \"their right to adopt\". The \"rights\" that are missing from this discourse are of course the rights of the child, the adoptee!\n \n No child should be enslaved in a homosexual 'family' simply because gays say its their right to adopt a voiceless and defenseless child! \n \n The rights of a child are paramount, period.", 
   {
    "post_info": {
     "post_title": "Why Same Sex Adoption Is Wrong"
    }
   }, 
   null, 
   null, 
   1199803800.0
  ], 
  [
   296407, 
   null, 
   "lesz", 
   "From what I've read, gay families tend to adopt the children of abusive heterosexuals who aren't fit to be parents. Who will protect children from heterosexual child abuse? Not homophobic bigots, that's for sure.", 
   {}, 
   296405, 
   null, 
   1199804100.0
  ], 
  [
   296409, 
   null, 
   "ibelieveyou", 
   "From what I've read, gay families tend to adopt the children of abusive heterosexuals who aren't fit to be parents. Who will protect children from heterosexual child abuse? Not homophobic bigots, that's for sure.\n\n \n beat a child black and blue, but never ever perpetuate the meanest abuse of them all, abandon him to homosexuality! \n \n And, who is to say homosexual couples aren't as physically not to mention sexually abusive against children!", 
   {}, 
   296407, 
   null, 
   1199804580.0
  ], 
  [
   296411, 
   null, 
   "robbie0517", 
   "The title of the thread is \"why same sex adoption is wrong\". Can provide your answer to your own thread? So far nothing.", 
   {}, 
   296409, 
   null, 
   1199805120.0
  ], 
  [
   296412, 
   null, 
   "lesz", 
   "The most anti-family people I've come across are those who beat their breasts, demonise gays, and pretend they are \"for families\". They don't give a damn about children, all they care about is their homophobic religion.", 
   {}, 
   296411, 
   null, 
   1199806440.0
  ], 
  [
   296416, 
   null, 
   "ibelieveyou", 
   "The most anti-family people I've come across are those who beat their breasts, demonise gays, and pretend they are \"for families\". They don't give a damn about children, all they care about is their homophobic religion.\n\n \n along with the OTHERS, the point has been missed, gays whine for the RIGHT to adopt children to the exclusion of the RIGHT of children to be nurtured by heterosexual couples or individuals, adopted children who will otherwise be raised in an overwhelming and natural world of heterosexuality", 
   {}, 
   296412, 
   null, 
   1199809020.0
  ], 
  [
   296418, 
   null, 
   "smiley", 
   "along with the OTHERS, the point has been missed, gays whine for the RIGHT to adopt children to the exclusion of the RIGHT of children to be nurtured by heterosexual couples or individuals, adopted children who will otherwise be raised in an overwhelming and natural world of heterosexuality\n\n \n Would you prefer the children have the right to not have a family?\n \n Oops! Silly me. Of course you would. Your opening posts says it all.\n \n What makes you think the adopted child of a homosexual partnership would be enslaved, any more than that of a heterosexual couple? Rather emotive language from someone who offers no evidence.\n \n I agree that no-one has the right to adopt (gay or straight). However, everyone should have the right to put themselves up as adoptive parents. There are too few loving families out there prepared to adopt a homeless child. To exclude a significant proportion of them because of your prejudice is just plain stupid, and does the adoptee no favours at all.\n \n Smiley", 
   {}, 
   296416, 
   null, 
   1199810100.0
  ], 
  [
   296420, 
   null, 
   "ibelieveyou", 
   "Would you prefer the children have the right to not have a family?\n \n Oops! Silly me. Of course you would. Your opening posts says it all.\n \n What makes you think the adopted child of a homosexual partnership would be enslaved, any more than that of a heterosexual couple? Rather emotive language from someone who offers no evidence.\n \n I agree that no-one has the right to adopt (gay or straight). However, everyone should have the right to put themselves up as adoptive parents. There are too few loving families out there prepared to adopt a homeless child. To exclude a significant proportion of them because of your prejudice is just plain stupid, and does the adoptee no favours at all.\n \n Smiley\n\n \n \n you are confusing \"prejudice\" with biology. Nature, not 'bigots', dictated mixed couples or groups procreate and nurture children. All the political correct whining in the 'world' will NEVER change this biological fact.\n \n Children are not and should never be the experimental playthings of people who choose or who are genetically altered to defy nature.", 
   {}, 
   296418, 
   null, 
   1199811000.0
  ], 
  [
   296423, 
   null, 
   "Kronus", 
   "So let's just assume, for a moment, that you're presenting this argument to someone who isn't a homophobe. Let's pretend that you want to convince someone who doesn't agree with your basic premise that there's something wrong with being gay. Do you have any data or reasoning or anything to back up what you're saying? Do you have the slightest shred of evidence that being raised by gay parents is harmful?", 
   {}, 
   296420, 
   null, 
   1199811600.0
  ], 
  [
   296425, 
   null, 
   "jyoshu", 
   "you are confusing \"prejudice\" with biology. Nature, not 'bigots', dictated mixed couples or groups procreate and nurture children. All the political correct whining in the 'world' will NEVER change this biological fact.\n\n \n So you don't think single people should be looking after children? (After all, they don't fit your idea of what should be nurturing, either.) There are an awful lot of kids living with single moms or dads out there who would out of the street, with your line of thinking.", 
   {}, 
   296420, 
   null, 
   1199812680.0
  ], 
  [
   296427, 
   null, 
   "lesz", 
   "along with the OTHERS, the point has been missed, gays whine for the RIGHT to adopt children to the exclusion of the RIGHT of children to be nurtured by heterosexual couples or individuals, adopted children who will otherwise be raised in an overwhelming and natural world of heterosexuality\n\n \n I don't think bigots should be allowed to adopt kids. If bigots had the interests of children at heart, they'd know a loving home is best, but they can't provide one.", 
   {}, 
   296416, 
   null, 
   1199813820.0
  ], 
  [
   296431, 
   null, 
   "JSDKoeln", 
   "I had gay parents before it was a \"thing\" to be concerned about. They saved my life from my fundie-heterosexual parents. Nope, my Dads never abused me or raped me. Actually have been pretty wonderful through all of my life and helped sort out a really messed up childhood. I look at them as my real parents... definitely not the biologicals.\n \n So, I'm curious... you're saying Brittany and her bimbo little sister make better parents than both my Dads? You really are a XXXXX duck.\n \n I know many same-sex couples raising very healthy children. I've seen these kids grow up to be very functioning adults. And nope, none of these kids were abused or, for that matter, none of them are gay.\n \n You're just a clueless troll making baseless and pointless assumptions. Most gay parents go into parenting because they want it and have truly planned it out. They have the emotional, spiritual and financial means to raise a child in this world. I can't say that for many heterosexuals.", 
   {}, 
   296427, 
   null, 
   1199814600.0
  ], 
  [
   296432, 
   null, 
   "jitobear", 
   "Gays everywhere are lobbying for \"their right to adopt\". The \"rights\" that are missing from this discourse are of course the rights of the child, the adoptee!\n \n No child should be enslaved in a homosexual 'family' simply because gays say its their right to adopt a voiceless and defenseless child! \n \n The rights of a child are paramount, period.\n\n \n I have a son. His biological dad walked out when he was three. We he was five I signed him up for Big Brothers and we spent two years on waiting list for a mentor. That man became a major lart of our lives and totally committed to my son. Nearly two years has passed since he legally adopted my son and became a co-parent with me. It has been closer to five years that my son has called this man \"dad\". My son is now 13. His dad is the most awesome man in the world and he is gay. \n \n I surely would like to know what kind of a perv of parent you would be (or are?) where who you nail is somehow impacting how you parent.\n \n And for the record - stats also show that male heterosexuals are the most likely to molest children. You musn't mistake an act of violence like molestation or rape as any kind of indicator of sexual preference. Rape isn't sex.\n \n My suggestion to you. Before you open your mouth to scream stupidly about how all families should be set up so that your personal prejudices can be appeased A) Look for the facts. (on parenting, sexual abuse, ect.) You will find that every reputable medical and psychological organization (including the American Pediatric Association) will tell you that children raised by homosexuals fare no worse than those raised by heterosexuals. B) Talk to these kids. My son would tell you that you are full of it in a heartbeat.\n \n Another little tidbit for you to scratch your head over There are even gay biological parents. I know one gay man who even has biological grandchildren.\n \n By the way - you really should respond to Kronus' thread. You make an assertion. Back it up.", 
   {}, 
   296405, 
   null, 
   1199815200.0
  ], 
  [
   296440, 
   null, 
   "lesz", 
   "Quite. I'd like to see the evidence that gay parents are always poor parents. It would be a first.", 
   {}, 
   296432, 
   null, 
   1199818320.0
  ], 
  [
   296448, 
   null, 
   "foundit66", 
   "beat a child black and blue, but never ever perpetuate the meanest abuse of them all, abandon him to homosexuality! \n\n I think this post pretty much sums up the depths of your prejudice, and the thoroughness of your ignorance.\n \n A child should endure physical abuse before being allowed to be adopted by a loving gay couple?\n Being abused physically is preferential to being adopted by a loving gay couple?\n emoticon_wow \n \n I always have to chuckle when people are so eager to reveal their prejudices in such a way that demonstrates they are completely non-credible as any type of character witness...\n \n \n \nAnd, who is to say homosexual couples aren't as physically not to mention sexually abusive against children!\n\n A variety of research has been done on the issue, and gays are no more likely to be sexually or physically abusive then straights.\n \n A variety of research has also been done on the issue of comparing parenting of gay parents to straight parents, and gays are proven to be just as good parents as straights.\n But such facts are meaningless to somebody who would rather children be without an adoptive parent rather than be adopted by people who are completely capable of good parenting, but you don't like them...", 
   {}, 
   296409, 
   null, 
   1199822700.0
  ], 
  [
   296452, 
   null, 
   "sinjin", 
   "Methinks someone has fondled the troll.", 
   {}, 
   296448, 
   null, 
   1199824020.0
  ], 
  [
   296467, 
   null, 
   "Ohioprof", 
   "Gays everywhere are lobbying for \"their right to adopt\". The \"rights\" that are missing from this discourse are of course the rights of the child, the adoptee!\n \n No child should be enslaved in a homosexual 'family' simply because gays say its their right to adopt a voiceless and defenseless child! \n \n The rights of a child are paramount, period.\n\n \n I am an adoptive parent. Your post is inaccurate and mean-spirited. \n \n Your claim that gay people argue for the \"right\" to adopt children is simply untrue. I have never heard any adoptive parent, gay or heterosexual, claim that adopting is a right. \n \n Every adoptive parent recognizes that the rights in question belong to the child. There is no right of adults to adopt. The rights belong to the children, and all the gay and heterosexual adoptive parents whom I know recognize this.", 
   {}, 
   296405, 
   null, 
   1199834520.0
  ], 
  [
   296468, 
   null, 
   "Ohioprof", 
   "Folks should be aware that every state in the United States except Florida allows gay people to adopt as single parents. The issue comes in many states when a same-sex spouse tries to adopt as a second parent. Some states permit this and some states do not. \n \n It's weird indeed that all states except one allow single gay people to adopt children, but many do not allow gay couples to be adoptive parents together. It makes no sense to me, since two parents are usually better than one.", 
   {}, 
   296467, 
   null, 
   1199834820.0
  ], 
  [
   296470, 
   null, 
   "sinjin", 
   "Folks should be aware that every state in the United States except Florida allows gay people to adopt as single parents. The issue comes in many states when a same-sex spouse tries to adopt as a second parent. Some states permit this and some states do not. \n \n It's weird indeed that all states except one allow single gay people to adopt children, but many do not allow gay couples to be adoptive parents together. It makes no sense to me, since two parents are usually better than one.\nDoes the sexual orientation of the would-be single parent even come up?", 
   {}, 
   296468, 
   null, 
   1199836380.0
  ], 
  [
   296474, 
   null, 
   "jitobear", 
   "Does the sexual orientation of the would-be single parent even come up?\n\n \n Its not even allowed in Minnesota.", 
   {}, 
   296470, 
   null, 
   1199838480.0
  ], 
  [
   296477, 
   null, 
   "sinjin", 
   "Its not even allowed in Minnesota.\nSo Minnesota is the one state Ohioprof was referring to?", 
   {}, 
   296474, 
   null, 
   1199839920.0
  ], 
  [
   296479, 
   null, 
   "jyoshu", 
   "Does the sexual orientation of the would-be single parent even come up?\n\n \n I was wondering that too. Seems like it would be pretty easy for a single person to just not say they were gay.", 
   {}, 
   296470, 
   null, 
   1199840400.0
  ], 
  [
   296481, 
   null, 
   "foundit66", 
   "I am an adoptive parent. Your post is inaccurate and mean-spirited. \n Your claim that gay people argue for the \"right\" to adopt children is simply untrue. I have never heard any adoptive parent, gay or heterosexual, claim that adopting is a right. \n Every adoptive parent recognizes that the rights in question belong to the child. There is no right of adults to adopt. The rights belong to the children, and all the gay and heterosexual adoptive parents whom I know recognize this.\n\n \n Heading further down that path...\n \n If the \"right\" belongs to the child, then the \"right\" obviously also DOES NOT belong to those opposed to gays.\n More specifically, the \"right\" to WAIVE potential parents as ineligible does not belong to those who are opposed to gays.\n \n The \"right\" would belong to the child to decide who HE/SHE wants, and it would be a bigger usurpment of this right of the child to DENY the child the option of gay parents than it is to present him with the option.", 
   {}, 
   296467, 
   null, 
   1199840700.0
  ], 
  [
   296483, 
   null, 
   "HonestAbe", 
   "Minnesota\n Permits single GLBT adoption. Joint gay adoption unclear. Second-parent adoption allowed in some areas.", 
   {}, 
   296479, 
   null, 
   1199840820.0
  ], 
  [
   296490, 
   null, 
   "ibelieveyou", 
   "Methinks someone has fondled the troll.\n\n \n funny claim from a simian", 
   {}, 
   296452, 
   null, 
   1199841660.0
  ], 
  [
   296495, 
   null, 
   "ibelieveyou", 
   " \n Your claim that gay people argue for the \"right\" to adopt children is simply untrue. I have never heard any adoptive parent, gay or heterosexual, claim that adopting is a right. \n \n\n \n I standby this claim: gays do lobby for a 'right' to adopt children - do a simple google news search. \n \n Gay adoption naturally follows gay marriage, gay marriage is for me a non-issue, however the experimenting with society's most vulnerable, orphaned or abused children is outrageous.\n \n Placing children with gay couples is not much different than placing them in the custody of pedophiles, that is, although a gay couple may mimic the duties of excellent caring parent/s, the morally corrupting and socially destructive influence for the 'guinea pig' (child) of same sex 'parents' is unavoidable. \n \n The subject child would be raised in a REAL heterosexual world by homosexual carers - this does not make for a healthy and happy upbringing. Worse, it is absolutely unnecessary, being that there are many more heterosexual couples qualified to adopt vulnerable children.", 
   {}, 
   296467, 
   null, 
   1199842560.0
  ], 
  [
   296498, 
   null, 
   "foundit66", 
   "I standby this claim: gays do lobby for a 'right' to adopt children - do a simple google news search.\n\n And if I google \"christian loch ness monster\", I'll get some hits too...\n \n None of the gays here are calling it a \"right\".\n You're trying to make hay out of thin air on the issue of what it is \"called\".\n \n The actual \"right\" involved is the right to EQUAL PROTECTION. A constitutional right which mandates that people are free from unwarranted discrimination.\n And preventing gays from adopting is clearly unwarranted.\n \n \n \nGay adoption naturally follows gay marriage, gay marriage is for me a non-issue, however the experimenting with society's most vulnerable, orphaned or abused children is outrageous.\n\n 1) Gay adoption does not \"follow\" gay marriage.\n Gay adoption is legal in the vast majority of states. I believe ONLY Florida outlaws it.\n And even then, Florida allows gay FOSTER parents, which helps demonstrate the stupidity in the system.\n \n 2) It's not \"experimenting\".\n It's proven that gays are just as capable, and there are NO INHERENT PROBLEMS to kids by being raised by gay parents.\n http://www.apa.org/monitor/dec05/kids.html\n \n The only \"experiment\" here is by some who insist that we should take kids adopted by gays away from good parents.\n It would obviously result in many more orphans, and it's downright selfish and foolish of some to put their prejudice above the good of the children.\n \n \n \nPlacing children with gay couples is not much different than placing them in the custody of pedophiles, that is, although a gay couple may mimic the duties of excellent caring parent/s, the morally corrupting and socially destructive influence for the 'guinea pig' (child) of same sex 'parents' is unavoidable.\n\n So claimeth the troll.\n Proven wrong by NUMEROUS research articles.\n http://www.apa.org/pi/l&gref.html\n \n \n \nThe subject child would be raised in a REAL heterosexual world by homosexual carers - this does not make for a healthy and happy upbringing. Worse, it is absolutely unnecessary, being that there are many more heterosexual couples qualified to adopt vulnerable children.\n\n \"absolutely unnecessary\"?\n What world do you live in?\n \n In the real world, there are MORE orphans out there than are being adopted.\n By removing gay parents as potential adoptive parents, you are INCREASING the number of orphans in the U.S. today.\n \n On the flip side, your plan is \"absolutely unnecessary\" as you have not presented ANY REAL reasons for why gays shouldn't be able to adopt.\n You've ignored the mounds of evidence and research which shows that gays are just as good parents as straights.", 
   {}, 
   296495, 
   null, 
   1199843460.0
  ], 
  [
   296500, 
   null, 
   "foundit66", 
   "Families such as the James-Hermanns and the challenges they face are becoming increasingly common in the United States. The 2000 U.S. census estimated that 163,879 households with children were headed by same-sex couples. That number is likely to be much larger today, says Charlotte Patterson, PhD, a psychology professor at the University of Virginia.\n ....\n But while gay- and lesbian-headed families face a slate of challenges that more traditional families avoid-from legal hassles and homophobia to everyday tasks, such as figuring out how to fill out school forms-research shows that the children with gay or lesbian parents do as well as children with heterosexual parents. Having a gay or lesbian parent doesn't affect a child's social adjustment, school success or sexual orientation, say researchers. \n \n \"Sexual orientation has nothing to do with good parenting,\" notes Armand Cerbone, PhD, who reviewed research on gay and lesbian parenting as chair of APA's Working Group on Same-Sex Families and Relationships. \n http://www.apa.org/monitor/dec05/kids.html\n \n \n The American Psychological Association states in its Resolution on Sexual Orientation, Parents, and Children (adopted July 2004):\n \n there is no scientific evidence that parenting effectiveness is related to parental sexual orientation: lesbian and gay parents are as likely as heterosexual parents to provide supportive and healthy environments for their children\"; and \"research has shown that the adjustment, development, and psychological well-being of children is unrelated to parental sexual orientation and that the children of lesbian and gay parents are as likely as those of heterosexual parents to flourish.\"[1]\n \n Similarly, Children's Development of Social Competence Across Family Types, a major report prepared by the Department of Justice (Canada) in July 2006 but not released by the government until forced to do so by a request under the Access to Information Act in May 2007,[3] reaches this conclusion:\n \n The strongest conclusion that can be drawn from the empirical literature is that the vast majority of studies show that children living with two mothers and children living with a mother and father have the same levels of social competence. A few studies suggest that children with two lesbian mothers may have marginally better social competence than children in traditional nuclear families, even fewer studies show the opposite, and most studies fail to find any differences. The very limited body of research on children with two gay fathers supports this same conclusion.[4]\n http://en.wikipedia.org/wiki/LGBT_parenting", 
   {
    "unicode_changes_made": true
   }, 
   296498, 
   null, 
   1199843580.0
  ], 
  [
   296502, 
   null, 
   "ibelieveyou", 
   "\n \n So claimeth the troll.\n Proven wrong by NUMEROUS research articles.\n http://www.apa.org/pi/l&gref.html\n \n\n \n typical strategy of the gay movement when challenged, resort to name calling \"trolls\" bigot etc, - project this form of abusive behavior on the adopted child who rebels against his gay 'carers' once he understands the reality of a heterosexual world. \n \n Placing children with gay couples is unnecessary and harmful - if group homes are the only alternative then it is argued such environments are more healthy and indeed normal than farming kids out to gays", 
   {}, 
   296498, 
   null, 
   1199844300.0
  ], 
  [
   296505, 
   null, 
   "Ohioprof", 
   "Does the sexual orientation of the would-be single parent even come up?\n\n \n It depends on the particular situation. Some adoption agencies ask about it, and some don't. Most social workers who do home studies are aware that they have gay clients doing adoptions. Some adoptive gay parents are out about it, and some keep it quiet. \n \n There are currently some foreign countries that require adoptive single parents to sign an affadavit that says, \"I am not homosexual.\" Those are the rules of some foreign countries, notably China, not the United States or any state.\n \n China has recently placed greater restrictions on prospective adoptive parents. They have sharply limited the opportunities for single people to adopt, and it looks like they may prohibit single-parent adoptions entirely. They have also instituted a weight requirement for all adoptive parents. In the case of a couple, their combined weight has to be below a certain figure or they are not allowed to adopt. No fat people allowed to adopt, which cuts out possibly most Americans.", 
   {}, 
   296470, 
   null, 
   1199845500.0
  ], 
  [
   296506, 
   null, 
   "Ohioprof", 
   "typical strategy of the gay movement when challenged, resort to name calling \"trolls\" bigot etc, - project this form of abusive behavior on the adopted child who rebels against his gay 'carers' once he understands the reality of a heterosexual world. \n \n Placing children with gay couples is unnecessary and harmful - if group homes are the only alternative then it is argued such environments are more healthy and indeed normal than farming kids out to gays\n\n \n Again, there is no evidence whatsoever for your claims.", 
   {}, 
   296502, 
   null, 
   1199845560.0
  ], 
  [
   296507, 
   null, 
   "Ohioprof", 
   "I standby this claim: gays do lobby for a 'right' to adopt children - do a simple google news search. \n \n Gay adoption naturally follows gay marriage, gay marriage is for me a non-issue, however the experimenting with society's most vulnerable, orphaned or abused children is outrageous.\n \n Placing children with gay couples is not much different than placing them in the custody of pedophiles, that is, although a gay couple may mimic the duties of excellent caring parent/s, the morally corrupting and socially destructive influence for the 'guinea pig' (child) of same sex 'parents' is unavoidable. \n \n The subject child would be raised in a REAL heterosexual world by homosexual carers - this does not make for a healthy and happy upbringing. Worse, it is absolutely unnecessary, being that there are many more heterosexual couples qualified to adopt vulnerable children.\n\n \n This is a nasty and completely unsubstantiated post.", 
   {}, 
   296495, 
   null, 
   1199845740.0
  ], 
  [
   296508, 
   null, 
   "Ohioprof", 
   "So Minnesota is the one state Ohioprof was referring to?\n\n \n No. It is Florida that prohibits gay people from adopting.", 
   {}, 
   296477, 
   null, 
   1199845800.0
  ], 
  [
   296510, 
   null, 
   "Ohioprof", 
   "Heading further down that path...\n \n If the \"right\" belongs to the child, then the \"right\" obviously also DOES NOT belong to those opposed to gays.\n More specifically, the \"right\" to WAIVE potential parents as ineligible does not belong to those who are opposed to gays.\n \n The \"right\" would belong to the child to decide who HE/SHE wants, and it would be a bigger usurpment of this right of the child to DENY the child the option of gay parents than it is to present him with the option.\n\n \n Well, this gets rather complicated. A very young child does not get to choose his or her adoptive parents. Who decides on who adopts whom depends on the kind of adoption and the policies of the particular adoption system. In private domestic adoption, the birth mother usually gets to decide on who will adopt her baby. The foster care system is organized differently, and international adoption is different still and depends on the country from which the child is being adopted. So it's pretty much impossible to generalize about adoption policies and practices. They vary greatly.\n \n The point is that the purpose of adoption is to protect the rights of the child.", 
   {}, 
   296481, 
   null, 
   1199846100.0
  ], 
  [
   296511, 
   null, 
   "foundit66", 
   "typical strategy of the gay movement when challenged, resort to name calling \"trolls\" bigot etc,\n\n Typical strategy of those in the anti-gay crowd is to fixate on names like \"bigot\" or \"troll\", COMPLETELY IGNORING the numerous arguments posed to them.\n Furthermore, you denigrate gays REPEATEDLY in your posts, yet complain loudly when you yourself are likewise denigrated???\n Puh-leaze! You are protesting being treated like you treat others!\n \n \n \n - project this form of abusive behavior on the adopted child who rebels against his gay 'carers' once he understands the reality of a heterosexual world.\n\n I would be more than happy to explore the ACTUAL opinions of kids raised by gays, rather than trust you who demonstrate an obvious assumed prejudice against gays.\n \n Oh wait. The ACTUAL opinions and physical / mental health of kids raised by gays has already been explored. In numerous research articles.\n Which you of course ignored...\n \n \n \nPlacing children with gay couples is unnecessary and harmful - if group homes are the only alternative then it is argued such environments are more healthy and indeed normal than farming kids out to gays\n\n It's boring how you simply repeat yourself, ignoring the proof put before you.\n Where is your evidence?\n \n All you offer is your opinion which ignores the articles and research put before you.\n \n It matters not. Each time you ignore the proof, I'll post more.\n It's an easy and time-proven method to handle people with tactics such as yours...\n The American Psychological Association's flagship publication Monitor on Psychology summarises the research on gay parents and finds their children are generally healthy, happy and well adjusted, despite occasional homophobic teasing.\n \n Patterson's and others' findings that good parenting, not a parent's sexual orientation, leads to mentally healthy children may not surprise many psychologists. What may be more surprising is the finding that children of same-sex couples seem to be thriving, though they live in a world that is often unaccepting of their parents. http://www.mindhacks.com/blog/2005/12/do_gay_parents_have_.html", 
   {}, 
   296502, 
   null, 
   1199847780.0
  ], 
  [
   296523, 
   null, 
   "MrWriteLA", 
   "Check out the truth. Sorry, troll. You lose.\n COLAGE\n http://www.colage.org/", 
   {}, 
   296511, 
   null, 
   1199854680.0
  ], 
  [
   296538, 
   null, 
   "ibelieveyou", 
   "s.\n \n The \"right\" would belong to the child to decide who HE/SHE wants, and it would be a bigger usurpment of this right of the child to DENY the child the option of gay parents than it is to present him with the option.\n\n \n How does a child, infant, assert his right to be placed with gays, as opposed to being reared in a heterosexual environment?\n \n the gay lobby are indeed eloquent and persistent, (admirable qualities, imagine if they applied the same fervor to the 'democratic' scourge of homelessness and dispossession) but ironically like their rightwing opponents, beyond the words, they lack substance when examined closely.\n \n No child who cannot give informed consent (16 yrs and over) should be subjected to a homosexual environment for want of a home - this is abuse, this is about the fabricated rights of gays subordinating the inalienable rights of the child to be reared in a normal nurturing environment free from the biological, social and psychological aberration of homosexuality", 
   {}, 
   296481, 
   null, 
   1199867220.0
  ], 
  [
   296546, 
   null, 
   "Matthew S", 
   "How does a child, infant, assert his right to be placed with gays, as opposed to being reared in a heterosexual environment?\n \n \n\n \n How does a child, infant, assert his right to be not placed with fundie christianist hetero parents that will teach him to hate, brainwash him by secluding him in private christianist terrorist training camps..oh I mean schools or home schooling, and denying his right to choose not to believe. Religion that is imposed upon any child under 16 is child abuse.\n \n \nGays everywhere are lobbying for \"their right to adopt\". The \"rights\" that are missing from this discourse are of course the rights of the child, the adoptee!\n \n No child should be enslaved in a homosexual 'family' simply because gays say its their right to adopt a voiceless and defenseless child! \n \n The rights of a child are paramount, period.\n\n \n I could start in about the disgusting attitude and evil mindset of this pov. I won't however. Your answer seems to be that it is better that a child is enslaved to the foster care system then to have two loving parents.\n \n You are forgetting that we need to be able to adopt one anthers children. You seem to forget that as a couple if we decide to have children the non biological partent needs to beable to adopt the child. I look forward to the day when I one of my stem cells is made to produce and egg then is fertilized by my husbands sperm then either he or I will carry the baby ectopically. That be the day to rock the christianist world.", 
   {}, 
   296405, 
   null, 
   1199878980.0
  ], 
  [
   296548, 
   null, 
   "lesz", 
   "We will always have malicious, homophobic bigots among us who have nothing better to do with their ample time than troll. Best to ignore them and let them give their religion a bad name.", 
   {}, 
   296523, 
   null, 
   1199880360.0
  ], 
  [
   296553, 
   null, 
   "ibelieveyou", 
   "We will always have malicious, homophobic bigots among us who have nothing better to do with their ample time than troll. Best to ignore them and let them give their religion a bad name.\n\n \n name calling again, does this mean the gay brigade concede in this debate, because they are unable to demonstrate why civil society should allow children to be raised in a social, psychological and biological aberrant environment.\n \n All so typical, when ever posts go against the political correct curent they are immediately identified as trolling\n \n your violent objections cannot change the biological reality of anti-nature!", 
   {}, 
   296548, 
   null, 
   1199889720.0
  ], 
  [
   296554, 
   null, 
   "robbie0517", 
   "I have read ample proof in this thread that demostrates children being raised by same sex couples fair no better no worse than when raised by heterosexual parents. \n \n You on the other hand have provided no evidence whatsoever to the contrary. \n \n You made the assertion in the OP, are you ever going to present evidence to support your position or do you concede?", 
   {}, 
   296553, 
   null, 
   1199895300.0
  ], 
  [
   296567, 
   null, 
   "foundit66", 
   "How does a child, infant, assert his right to be placed with gays, as opposed to being reared in a heterosexual environment?\n\n The right is ELIGIBILITY of adoption for the child.\n \n And the right is \"asserted\" for him in not removing viable candidates from the adoption process.\n \n \n \nthe gay lobby are indeed eloquent and persistent, (admirable qualities, imagine if they applied the same fervor to the 'democratic' scourge of homelessness and dispossession) but ironically like their rightwing opponents, beyond the words, they lack substance when examined closely.\n\n Funny how I have presented you with numerous studies, and you ignored them.\n You have presented nothing but repeating your opinion ad nausieum, yet I am the one that \"lacks substance\"...\n emoticon_rolleyes \n \n \n \nNo child who cannot give informed consent (16 yrs and over) should be subjected to a homosexual environment for want of a home - this is abuse, this is about the fabricated rights of gays subordinating the inalienable rights of the child to be reared in a normal nurturing environment free from the biological, social and psychological aberration of homosexuality\n\n You complain about the \"right to adopt\" being claimed.\n Where is the \"inalienable\" right you claim?\n It doesn't exist.\n If you complain about invented rights, you shouldn't try to deceitfully invent rights of your own...\n \n Furthermore, as repeatedly evidenced to you, gay homes are just as \"normal\". Just as \"nurturing\".\n Homosexuality has no inherent real problem (beyond prejudice) in the biological, social, or psychological realms. The experts in each of these categories confirm this.\n \n And you posted again, so it's time to link again to the evidence refuting your claims of \"damages\" from being raised by gay parents.\n \n =============================\n \n All of the research to date has reached the same unequivocal conclusion about gay parenting: the children of lesbian and gay parents grow up as successfully as the children of heterosexual parents. In fact, not a single study has found the children of lesbian or gay parents to be disadvantaged because of their parents' sexual orientation. Other key findings include: There is no evidence to suggest that lesbians and gay men are unfit to be parents. \n \n Home environments with lesbian and gay parents are as likely to successfully support a child's development as those with heterosexual parents. \n \n Good parenting is not influenced by sexual orientation. Rather, it is influenced most profoundly by a parent's ability to create a loving and nurturing home -- an ability that does not depend on whether a parent is gay or straight. \n \n There is no evidence to suggest that the children of lesbian and gay parents are less intelligent, suffer from more problems, are less popular, or have lower self-esteem than children of heterosexual parents. \n \n The children of lesbian and gay parents grow up as happy, healthy and well-adjusted as the children of heterosexual parents. http://www.aclu.org/lgbt/parenting/11824res19990406.html\n \n Furthermore, you fail to address the fact that your approach would take THOUSANDS of ALREADY ADOPTED KIDS out of their homes (and prospective homes), and dump them back in the adoption system with THOUSANDS MORE kids who are NOT getting adopted by \"straight\" parents you claim they have a \"right\" to.\n \n From the same resource...\n A Crisis in Adoption and Foster Care \n \n Right now there is a critical shortage of adoptive and foster parents in the United States. As a result, many children have no permanent homes, while others are forced to survive in an endless series of substandard foster homes. It is estimated that there are 500,000 children in foster care nationally, and 100,000 need to be adopted.2 But last year there were qualified adoptive parents available for only 20,000 of these children.3 Many of these children have historically been viewed as \"unadoptable\" because they are not healthy white infants. Instead, they are often minority children and/or adolescents, many with significant health problems.4\n \n Your prejudice is telling in that you fixate on removing kids from capable and loving gay parents, yet you do ABSOLUTELY NOTHING to try and see that they get homes...", 
   {}, 
   296538, 
   null, 
   1199902920.0
  ], 
  [
   296571, 
   null, 
   "sinjin", 
   "All so typical, when ever posts go against the political correct curent they are immediately identified as trolling.\nYou're trolling because you have double digit post here, nearly all of which have been stridently bigotted. Btw it could be construed that adopting is dealing with homelessness.", 
   {}, 
   296553, 
   null, 
   1199903400.0
  ], 
  [
   296577, 
   null, 
   "HonestAbe", 
   "What I've often wondered is why some states like FL will allow homosexuals to be foster parents, but not let them adopt. That doesn't make much sense to me. Just more governmental hypocrisy.", 
   {}, 
   296571, 
   null, 
   1199904300.0
  ], 
  [
   296579, 
   null, 
   "jitobear", 
   "So Minnesota is the one state Ohioprof was referring to?\n\n \n No. I was saying (not very clearly apparently) that in custody and adoption cases in Minnesota, sexual orientation is not allowed before the court as a reason to deny custody. Minneosta does allow co-parent adoption - that is the kind adoption that we had (for my son).\n \n \n \nname calling again, does this mean the gay brigade concede in this debate, because they are unable to demonstrate why civil society should allow children to be raised in a social, psychological and biological aberrant environment.\n \n\n \n Now you are being deliberately dishonest. You have been provided with numerous links to studies and statements by medical, physchological, and pediatric experts. You have been provided a link to a website where the children of gay parents tell their own stories and you have been told of two personal experiences by posters in this forum. You have ignored them all and it is you who has not provided a whit of evidence to back up your assertation. On the other hand you have used several broad, insulting prejudicial statements (see below in blue), all of which are against forum rules. \n \n You can justifiably complain about being insulted when you stop being insulting. You can also stop belly-aching about be called a troll when you stop trolling and actually debate.\n \n \n beat a child black and blue, but never ever perpetuate the meanest abuse of them all, abandon him to homosexuality!\n \n Children are not and should never be the experimental playthings of people who choose or who are genetically altered to defy nature.\n \n Placing children with gay couples is not much different than placing them in the custody of pedophiles, that is, although a gay couple may mimic the duties of excellent caring parent/s, the morally corrupting and socially destructive influence for the 'guinea pig' (child) of same sex 'parents' is unavoidable. ", 
   {}, 
   296477, 
   null, 
   1199904900.0
  ], 
  [
   296639, 
   null, 
   "Matthew S", 
   "name calling again, does this mean the gay brigade concede in this debate, because they are unable to demonstrate why civil society should allow children to be raised in a social, psychological and biological aberrant environment.\n \n All so typical, when ever posts go against the political correct curent they are immediately identified as trolling\n \n your violent objections cannot change the biological reality of anti-nature!\n\n \n Someone seems to have over looked my post. I give you several very good reasons why.", 
   {}, 
   296553, 
   null, 
   1199941740.0
  ], 
  [
   296666, 
   null, 
   "JSDKoeln", 
   "Someone seems to have over looked my post. I give you several very good reasons why.\n\n \n It conveniently overlooked my post too. It can't handle reality!\n \n These people are just here to throw mud. It is obviously angry at gays for some reason and wants to sling hateful words and insults anywhere it can. It needs therapy, not a gay rights forum. Why bother?", 
   {}, 
   296639, 
   null, 
   1199958420.0
  ], 
  [
   296675, 
   null, 
   "HonestAbe", 
   "It conveniently overlooked my post too. It can't handle reality!\n \n These people are just here to throw mud. It is obviously angry at gays for some reason and wants to sling hateful words and insults anywhere it can. It needs therapy, not a gay rights forum. Why bother?\n\n \n Reality is something that rightwing hate groups seem to ignore. They have lost their grasp of reality, if they ever had one.", 
   {}, 
   296666, 
   null, 
   1199971080.0
  ], 
  [
   297736, 
   null, 
   "Scottd", 
   "Gays everywhere are lobbying for \"their right to adopt\". The \"rights\" that are missing from this discourse are of course the rights of the child, the adoptee!\n \n No child should be enslaved in a homosexual 'family' simply because gays say its their right to adopt a voiceless and defenseless child! \n \n The rights of a child are paramount, period.\n\n \n Why you can be called wrong.\n \n Friends of mine raised thier daughter together. THey are gay and have been together 20 years. The one gentlemans wife was christian, however she was abusive to her daughter as well as him. He was very kidn to her and even with her drinking problem and later foudn out drug problem, he still helped her as much as he could.\n \n He later formed a relationship with a man, he fell in love with. THe neglected baby was now raised by to gay men. This young baby girl is now married to a nice man, and has 2 children of her own, and lvoes both her FATHERS equally for providing for her. \n \n So you see, its a good thing, and your statements are based on not being educated in the matter.\n \n Now why can't gay couples adopt. THere seems to be a hudge problem with heterosexual relationships and so many children without homes.\n \n Another tid bit for you. Gay parents don't make gay kids. Especailly those of us not in the gay scene. IF anythign we woudl rather have grand kids more then anything, and ntot want them in lifestyle that is given so much grief by those not educated. Get it now?", 
   {}, 
   296405, 
   null, 
   1200552780.0
  ], 
  [
   298350, 
   null, 
   "ironcourage", 
   "I think each adoption case is different. Studies will only show the risks to children on broad range not individual cases. There are studies that show against gay adoption and studies for gay adoption and to see truth in only one study and not the opposing study is naive I don't doubt that two dads or two moms could be good parents even better than some strait parents. The same goes with a single parent gay or straight it's all risk assessment. Say the couple adopting is overweight, Can they promote healthy eating and exercise for the child? Studies say no. Can a single parent applicant working 9 to 5 give their child enough action? Studies say no. Studies also show that 60% adoptive children in a same sex two parent home will be teased or harassed by their peers for their same sex parents. Gay applicants should take this in to consideration when deciding to adopt whether they choose to agree with the study or not. Are you willing to weigh risks of a Childs mental status to become a parent? Gay applicants may say and believe they will raise their child objectively to sexual preference, but this may not be the case a Childs mind is very simple. Children with racist parents will most likely grow up to be racist not because or she is taught racism but because it is observed in his or her family. So even if you are promoting choice you maybe eliminating choice or unintentionally favoring one side. In almost all heterosexual households they do not promote sexual choice they just assume there child is heterosexual and the likely hood of their child becoming gay or lesbian is relatively low this is due to fact the child has a more objective view. I believe all applicants gay strait or single should be placed under the same microscope. Gay applicants or gay advocates should never use an abusive or neglectful home as a measuring point this is just fighting for the right to adopt and is clearly not a fight for the Childs best interest which is the most important. if you firmly believe that the child has the best chance with you and not another applicant after reviewing the risks you bring to the adoption and remember if the studied you choose to side with shows in favor of your sexual preference i.e. 50/50 chance remember that those statistics are not numbers they are children lives even if the numbers are 80 percent in your favor there still a 20 percent chance it's not going to be in the Childs general welfare. Whether you like it or not gay applicants and single parents bring a different risk assessment to the table on top of what the risks heterosexual couples bring to the table. Every tree has some bad apples some trees have more than others do cut down that tree or do you just pick the good ones.", 
   {
    "unicode_changes_made": true
   }, 
   296505, 
   null, 
   1201050900.0
  ], 
  [
   298352, 
   null, 
   "electrolyte", 
   "I think each adoption case is different. Studies will only show the risks to children on broad range not individual cases. There are studies that show against gay adoption and studies for gay adoption and to see truth in only one study and not the opposing study is naive \n\n I suppose that one can have iron courage if he has decided that he will never be bothered when somebody asks him to support his claims. I doubt even the iron courage, but you've shown nothing but tissue-paper evidence. How about you link us to these studies?", 
   {}, 
   298350, 
   null, 
   1201052160.0
  ], 
  [
   298355, 
   null, 
   "ironcourage", 
   "http://www.freerepublic.com/focus/f-news/1417036/posts\n \n http://www.boston.com/jobs/news/articles/2006/03/26/same_sex_couples_face_unique_adoption_hurdles/\n \n http://www.associatedcontent.com/article/74047/gay_adoption_and_america.html?page=2\n \n http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=49434\n \n http://www.narth.com/docs/rekers.html", 
   {}, 
   298352, 
   null, 
   1201053780.0
  ], 
  [
   298370, 
   null, 
   "electrolyte", 
   "Pretty sad, ironcourage.\n \n Your first link is to a far-rightwing group citing a Spanish group that is -- you guessed it -- extremely religious with an anti-homosexual agenda ... who just happened to make this announcement shortly before an important vote on same-sex marriage, with no actual study to be found anywhere. It doesn't just smell rotten, it's downright putrid.\n \n Your second link doesn't say that having same-sex parents is inherently disadvantageous. In fact, it says,Despite 30 years of studies showing that sexual orientation doesn't affect quality of parenting, close relatives often are skeptical\n\n Your third link is from a nutjob's blog:The best interest of the child may not be putting them in a home where they will learn a homosexual lifestyle.\nI especially like how the \"authority\" he cites makes a big objection to not disproving the null hypothesis. All the studies don't show that \"there's no effect\", they just fail to provide any reason to believe that there is -- which any scientist knows is the best that science can do. (Clearly, these articles are written for the layman who doesn't understand science, who are the target audience for these groups anyway.) Ironically, the very same reasoning applies to your earlier unlinked story says that there's no genetic effect.\n \n WND (another notoriously rightwing nutjob organization), your fourth source, doesn't even address the science. It just makes ad hominem attacks on the researchers.\n \n The NARTH paper is not an article published in a scientific journal but merely a released paper that amounts to an opinion piece. Looking at just the first section -- regarding three justifications for legislation against homosexual adoption and foster care -- the first two attack homosexuals for behavior that would disqualify any couple (that is, the normal screening process eliminates those concerns regardless of the sexual orientation of the potential parents), and the third does nothing but argue for gender roles which are becoming increasingly defunct anyway.\n I'm in no mood to continue to plough through such bunk.\n \n Why can't you show me actual, scientific studies that show that adopted children of homosexual parents are at some inherent disadvantage due to the orientation of the parent(s)?", 
   {}, 
   298355, 
   null, 
   1201061220.0
  ], 
  [
   298382, 
   null, 
   "lesz", 
   "I think each adoption case is different. Studies will only show the risks to children on broad range not individual cases. There are studies that show against gay adoption and studies for gay adoption and to see truth in only one study and not the opposing study is naive\n\n \n I've seen a few studies that suggest that gay parents do no worse than straight parents at raising adopted kids. I've seen no studies that demonstrate they do a worse job. What seems to matter most is the commitment, attention and love shown by the parent to the child, not the sexual orientation.\n \n \nI don't doubt that two dads or two moms could be good parents even better than some strait parents. The same goes with a single parent gay or straight it's all risk assessment. Say the couple adopting is overweight, Can they promote healthy eating and exercise for the child? Studies say no. Can a single parent applicant working 9 to 5 give their child enough action? Studies say no. Studies also show that 60% adoptive children in a same sex two parent home will be teased or harassed by their peers for their same sex parents. Gay applicants should take this in to consideration when deciding to adopt whether they choose to agree with the study or not. Are you willing to weigh risks of a Childs mental status to become a parent?\n\n \n First of all, no-one, gay or straight, has an inalienable right to adopt kids, only a right to be treated equally and appropriately. All potential adoptive parents should be properly evaluated to see whether they are likely to be good parents. What is at issue is the religious claim that gay people are intrinsically morally evil because of their \"gay lifestyle\" -- i.e. daring to love someone of the same sex -- and that they therefore cannot make good parents in principle. If this were supported by any objective studies, then one could make a case against gay adoption. However, no such studies exist. There is no reason in principle to suppose that being gay automatically makes one a worse parent, and there are hundreds of thousands of families being raised by gay parents that show the reverse.\n \n \nGay applicants may say and believe they will raise their child objectively to sexual preference, but this may not be the case a Childs mind is very simple. Children with racist parents will most likely grow up to be racist not because or she is taught racism but because it is observed in his or her family. So even if you are promoting choice you maybe eliminating choice or unintentionally favoring one side. In almost all heterosexual households they do not promote sexual choice they just assume there child is heterosexual and the likely hood of their child becoming gay or lesbian is relatively low this is due to fact the child has a more objective view. I believe all applicants gay strait or single should be placed under the same microscope.\n\n \n There is no evidence that suggests the sexual orientation of parents has the slightest effect on the adult sexual orientation of children, and plenty of evidence to the contrary. If the sexual orientation of parents made children gay, then most gay people would have grown up straight.\n \n \n Gay applicants or gay advocates should never use an abusive or neglectful home as a measuring point this is just fighting for the right to adopt and is clearly not a fight for the Childs best interest which is the most important. if you firmly believe that the child has the best chance with you and not another applicant after reviewing the risks you bring to the adoption and remember if the studied you choose to side with shows in favor of your sexual preference i.e. 50/50 chance remember that those statistics are not numbers they are children lives even if the numbers are 80 percent in your favor there still a 20 percent chance it's not going to be in the Childs general welfare. Whether you like it or not gay applicants and single parents bring a different risk assessment to the table on top of what the risks heterosexual couples bring to the table. Every tree has some bad apples some trees have more than others do cut down that tree or do you just pick the good ones.\n\n \n Every adoption decision should be made with the best interests of the child in mind. Being gay should not be used as an automatic excuse to deny adoption. That isn't fair for children or for prospective adoptive parents, neither is it the best use of community resources.\n \n Why should children be deprived of some of the best homes available simply because the the prospective parents are gay? That is using children to promote a homophobic social agenda, and it is reprehensible of the religious right to put their beliefs first, and the best interests of children a very poor second or third.", 
   {
    "unicode_changes_made": true
   }, 
   298350, 
   null, 
   1201091820.0
  ], 
  [
   298408, 
   null, 
   "jitobear", 
   "Studies also show that 60% adoptive children in a same sex two parent home will be teased or harassed by their peers for their same sex parents. Gay applicants should take this in to consideration when deciding to adopt whether they choose to agree with the study or not. Are you willing to weigh risks of a Childs mental status to become a parent? \n\n \n I agree with everything Elcrolyte and Lesz posted but also wanted to address this. Are you actually claiming that gays should consider not creating families for the sake of little mate-mongering bullies at school? Since when would this become the responsibility or fault of the parents? Since when would we not address the teasing and condemn it and those who participate in it? Do you really believe that these little monsters should have free reighn to terrorize gays kids or kids from gay families? My son was bullied pretty brutally by one kid at his school - THAT KID was reprimanded. The problem lay with the bully, not my son's father - and my son never would have given up his dad to appease the little bastard.", 
   {}, 
   298350, 
   null, 
   1201113840.0
  ], 
  [
   298410, 
   null, 
   "jyoshu", 
   "I agree with everything Elcrolyte and Lesz posted but also wanted to address this. Are you actually claiming that gays should consider not creating families for the sake of little mate-mongering bullies at school? Since when would this become the responsibility or fault of the parents? Since when would we not address the teasing and condemn it and those who participate in it? Do you really believe that these little monsters should have free reighn to terrorize gays kids or kids from gay families? My son was bullied pretty brutally by one kid at his school - THAT KID was reprimanded. The problem lay with the bully, not my son's father - and my son never would have given up his dad to appease the little bastard.\n\n \n I agree with you, but it's no more far-fetched than the problematic idea some have put forth here that others (besides the bullies themselves) who \"contribute to a culture of hate\" are to be blamed for gays being bullied. Bullies are the ones doing the bullying and they should be blamed for it.", 
   {}, 
   298408, 
   null, 
   1201115940.0
  ], 
  [
   298412, 
   null, 
   "lesz", 
   "I agree with you, but it's no more far-fetched than the problematic idea some have put forth here that others (besides the bullies themselves) who \"contribute to a culture of hate\" are to be blamed for gays being bullied. Bullies are the ones doing the bullying and they should be blamed for it.\n\n \n Are you telling us that people who contribute to the culture of hatred -- say the pope and many other Christian pastors -- are totally innocent of all responsibility for the climate that makes bullies pick on kids perceived to be gay, because they are gay?\n \n If so, that's frickin' naive. When churches and politicians condemn gays for being either sick, immoral or both, then it is no surprise that bullies get the message it's OK to beat gays up. Yet once again, you seek to absolve culprits of responsibility. The insincerity just oozes out of you.", 
   {}, 
   298410, 
   null, 
   1201117020.0
  ], 
  [
   298413, 
   null, 
   "jyoshu", 
   "Are you telling us that people who contribute to the culture of hatred -- say the pope and many other Christian pastors -- are totally innocent of all responsibility for the climate that makes bullies pick on kids perceived to be gay, because they are gay?\n\n \n Is that what I said? No. try responding to what's actually said next time, instead of whatever fantasy thread you're usually reading.", 
   {}, 
   298412, 
   null, 
   1201117200.0
  ], 
  [
   298414, 
   null, 
   "foundit66", 
   "I agree with you, but it's no more far-fetched than the problematic idea some have put forth here that others (besides the bullies themselves) who \"contribute to a culture of hate\" are to be blamed for gays being bullied. Bullies are the ones doing the bullying and they should be blamed for it.\n\n \n It's a lot more \"far-fetched\".\n They have some blame on the issue.\n \n Trying to compare the two on the standard of \"far-fetched\" is obvious.\n \n It's like trying to assess the contributable \"blame\" from somebody BEING Jewish, to the \"blame\" for somebody who is a voice in the crowd condemning Jews, but just not escorting them to the gas chambers.\n \n \n \nIs that what I said? No. try responding to what's actually said next time, instead of whatever fantasy thread you're usually reading.\n\n I see how Lesz interpreted what you said. I read it similarly.\n I don't understand the distinction in your reply.\n \n Are you trying to argue over the AMOUNT of blame, and say that the person that \"bullies\" is more culpable, but admitting that the person who contributes still has some culpability?", 
   {}, 
   298410, 
   null, 
   1201120680.0
  ], 
  [
   298418, 
   null, 
   "jyoshu", 
   "I see how Lesz interpreted what you said. I read it similarly.\n I don't understand the distinction in your reply.\n \n Are you trying to argue over the AMOUNT of blame, and say that the person that \"bullies\" is more culpable, but admitting that the person who contributes still has some culpability?\n\n \n I didn't say anything about anyone being \"totally innocent\". If we looked at all facets of society, there are probably many, many factors that contribute to some degree to the problems of non-acceptance in society. But the issue of whether or not someone is 'totally innocent' (Lesz's thing) is not the same thing as saying they should be blamed for something.", 
   {}, 
   298414, 
   null, 
   1201122420.0
  ], 
  [
   298419, 
   null, 
   "Kronus", 
   "Is that what I said? No. try responding to what's actually said next time, instead of whatever fantasy thread you're usually reading.\n\n \n Actually that is exactly what you said; there's no fantasy involved here. You want to place the blame squarely and solely on the shoulders of the bullies, and not at all on those who may have inspired them. To quote: \"Bullies are the ones doing the bullying and they should be blamed for it\". Lesz's response was right on the money, and I think her question is a fine one.", 
   {}, 
   298413, 
   null, 
   1201122840.0
  ], 
  [
   298420, 
   null, 
   "foundit66", 
   "I didn't say anything about anyone being \"totally innocent\". If we looked at all facets of society, there are probably many, many factors that contribute to some degree to the problems of non-acceptance in society. But the issue of whether or not someone is 'totally innocent' (Lesz's thing) is not the same thing as saying they should be blamed for something.\n\n I guess the disjoint is in the interpretation.\n To me, if somebody is \"totally innocent\", they have no blame. They have no culpability.\n But if they are not \"totally innocent\", then they have some culpability and some blame ascribed.\n \n To me, you seem to be saying that somebody can be \"not totally innocent\", yet no blame attached. I disagree.\n \n \n And as far as what \"some\" degree is, I think it would be an interesting experiment for all those who \"just\" disagree with homosexuality to remain silent on the issue for one month, and to measure the impact.\n Don't show any support for politicians who make it an issue. Don't criticize gays for not being in the closet. No claims that homosexuality \"harms\" our civilization or similar nonsense. No contributions to organizations whose express (and often primary) intent is to discriminate against gays.\n Have them all be as \"silent\" and non-visible as many wish gays were...\n \n I think the impact would be profound.\n There ARE a very few like the \"Phelps\" of the world which run on their own steam. They would continue to operate.\n The rest are the result of a visible support, both implicit and explicit, that comes from a variety of sources.", 
   {}, 
   298418, 
   null, 
   1201123020.0
  ], 
  [
   298421, 
   null, 
   "jyoshu", 
   "Actually that is exactly what you said\n\n \n Nope. The issue of whether or not anyone in particular is \"totally innocent\" is not the same as whether or not they should be blamed.", 
   {}, 
   298419, 
   null, 
   1201123020.0
  ], 
  [
   298423, 
   null, 
   "foundit66", 
   "Nope. The issue of whether or not anyone in particular is \"totally innocent\" is not the same as whether or not they should be blamed.\n\n \n Can you explain a situation where somebody is \"not totally innocent\", yet they have no \"blame\" that can be attached to them?", 
   {}, 
   298421, 
   null, 
   1201123800.0
  ], 
  [
   298424, 
   null, 
   "jyoshu", 
   "I guess the disjoint is in the interpretation.\n To me, if somebody is \"totally innocent\", they have no blame. They have no culpability.\n But if they are not \"totally innocent\", then they have some culpability and some blame ascribed.\n \n To me, you seem to be saying that somebody can not be \"totally innocent\", yet no blame attached. I disagree.\n \n And as far as what \"some\" degree is, I think it would be an interesting experiment for all those who \"just\" disagree with homosexuality to remain silent on the issue for one month, and to measure the impact.\n\n \n I too think that would be an interesting experiment. I suspect things would go on pretty much the same. I think aversion to homosexual behavior simply has a lot more to do with the fact that people naturally find the idea of sexual behavior outside their orientation pretty darn unappealing than it does to all this goin'-to-hell preaching that is supposedly being conducted so much. (Though it's quite odd how little I and others who have weighed in on it actually hear such preaching, given the attention it gets here.) That's not to say, of course, that it doesn't happen, or that it has no effect. I'm sure there's SOME effect to some degree, but the real point here is that when all the factors are weighed, there's really not a lot we can do about it and it can't be quantified. We have free-speech in this country as well as freedom of religion, and you just can't force preachers, parents, or whomever to not utter a word about it, even if it WERE such a constant occurance in pulpits. It's a complicated issue that involves where to draw the line as well. I hear some among gay pride proponents that they have no problem with people holding the religious view that gay sex is immoral as long as they keep their hands off laws. Others I hear say that both are wrong, and yet others like Matthew seem to say that both should actually be outlawed somehow. So there doesn't even seem to be a whole lot of consensus on this even among those for whom gay rights is a really important issue, much less anyone else. That's why I think taking a position that we should start blaming people for merely contributing to a culture of hatred, with nary an attempt to deal with degree and substance, is rife with problems. Who decides what constitutes problematic speech? Who decides what should be done? And what a mess this would be in terms of public policy.", 
   {}, 
   298420, 
   null, 
   1201123980.0
  ], 
  [
   298425, 
   null, 
   "jyoshu", 
   "Can you explain a situation where somebody is \"not totally innocent\", yet they have no \"blame\" that can be attached to them?\n\n \n I think the real question is how do you go about assigning blame toward people? That's really what I was getting at. Do you just want to effectively be able to verbally say that some have blame attached to them, and leave it there? In a rhetorical sense? Because if that's all you mean, then fine. However, I think truly blaming people in a real and quantitative sense is pretty darn unrealistic. To do that would mean they are assigned a share of responsibility for it, and legally, that's a non-starter for something as un-quantitative as 'contributing to a culture of hate'. The guy that bullied was the bully. He committed the crime ... he does the time.", 
   {}, 
   298423, 
   null, 
   1201124340.0
  ], 
  [
   298426, 
   null, 
   "Kronus", 
   "Nope. The issue of whether or not anyone in particular is \"totally innocent\" is not the same as whether or not they should be blamed.\n\n \n If your defense is nothing but word games then your attack on Lesz, calling her post a fantasy, is utterly unwarranted. The distinction you're pulling here is subtle, and in truth a cop out. How about addressing what she said, rather than weasling out? What you are implying, but failing to actually state, is that Lesz is right and that Christian groups that promote homophobia shoulder some of the responsibility for the bullying that gays endure. Agree or disagree? Or comedy option C: pick one word in one sentence you don't like and focus on that instead?", 
   {}, 
   298421, 
   null, 
   1201124520.0
  ], 
  [
   298427, 
   null, 
   "Kronus", 
   "I think the real question is how do you go about assigning blame toward people? \n\n \n No, that isn't the question. You attacked Lesz on the basis of the distinction foundit asked about, so how about you justify the attack instead of trying to change the question? To quote: \"Can you explain a situation where somebody is \"not totally innocent\", yet they have no \"blame\" that can be attached to them?\"", 
   {}, 
   298425, 
   null, 
   1201125060.0
  ], 
  [
   298428, 
   null, 
   "jyoshu", 
   "If your defense is nothing but word games then your attack on Lesz, calling her post a fantasy, is utterly unwarranted. The distinction you're pulling here is subtle, and in truth a cop out. How about addressing what she said, rather than weasling out? What you are implying, but failing to actually state, is that Lesz is right and that Christian groups that promote homophobia shoulder some of the responsibility for the bullying that gays endure. Agree or disagree?\n\n \n And when did you stop beating your wife? Why are you determined to try and turn a shades-of-gray issue into a completely black-and-white question here? Option C is no \"comedy\" one at all--nor is it any word game--it's simply taking the view that expecting people to take blame for something on such an un-substantive basis--particularly with no regard to substance or degree--is not only a very unrealistic approach, but a rather foolish one as well. It's the correct option. Prove some actual causality and give some actual specifics, then maybe you'll start to have a case. I'm sure it's certainly easier to stick with vague statements of blame without causal proof, but if you're trying to take anything more than merely an approach of rhetoric, that's not the way our system works, thank goodness. So ya better get cracking.", 
   {}, 
   298426, 
   null, 
   1201125120.0
  ], 
  [
   298429, 
   null, 
   "foundit66", 
   "I too think that would be an interesting experiment. I suspect things would go on pretty much the same.\n\n Many things? Yes.\n But with regards to what homosexuals see and treatment of them?\n No.\n \n You would need to walk a mile in our shoes before you can appreciate that.\n It would mean that the multi-million dollar organizations which exist to criticize gays would be silent.\n Politicians would no longer receive positive reinforcement for pandering to people who \"just oppose\" gays.\n \n \n \nI think aversion to homosexual behavior ... \n\n I have to cut you off right there because THERE is where you make the BIG mistake.\n WHEN in the hell are you ever confronted with \"homosexual behavior\"?\n Do gay guys get naked and do the nasty on your lawn every morning?\n \n Quite frankly, people TALK about \"aversion to homosexual behavior\", but it's a bit like saying you don't like smoking and then going after smokers who aren't even smoking anywhere near you.\n It's not an \"aversion to homosexual behavior\" as much as it is a PHOBIA on the issue, because it's not \"homosexual behavior\" that they are confronted with.\n They are talking to GAYS who might or might not be performing \"homosexual behavior\" in the privacy of their own homes.\n But the MERE THOUGHT that we might be doing that is enough to drive some people to make some of the most absurd statements.\n \n \n \n... simply has a lot more to do with the fact that people naturally find the idea of sexual behavior outside their orientation pretty darn unappealing ...\n\n In which case I just gotta ask you.\n Who is ask you to do something that is \"unappealing\" to you?\n \n I find Wienershnitzel's food \"pretty darn unappealing\", but you don't find me running around demanding that people who work or eat there not be able to marry or adopt or serve in the military.\n You don't find me fixating on the ideal to the extent that it warrants its own message sub-board.\n \n If the ONLY issue were JUST that you find it \"pretty darn unappealing\", we would have no problem.\n The people who JUST find something \"pretty darn unappealing\" are not being blamed.\n \n \n \n(Though it's quite odd how little I and others who have weighed in on it actually hear such preaching, given the attention it gets here.)\n\n Jyoshu. LOOK at the thread titles.\n THOSE are the issues with the focus.\n \"Why same sex adoption is wrong\"\n \"New strain of MRSA...\"\n \"Huckabee on homosexuality\"\n \"Lessons from the past\"\n \"Teen Suicide\"\n \"One-third of city's homeless youth are LGBT\"\n \"Gay marriage is threat to world peace, says pope\".\n \n You're trying to obfuscate the issue by diminishing our ACTUAL issues and trying to shift the focus onto something trivial.\n THOSE are the real issues.\n \n But on the \"preaching\" issue, how many times do you see people \"preaching\" against divorce?\n How many times do you see people \"preaching\" against worshipping another god? Or working on sunday? Or bearing false witness against your neighbor?\n \n Quite frankly, it's not the \"attention it gets here\" that concerns me as much as the \"attention\" that YOUR side of the fence puts on it, disproportionately to other issues which are supposedly \"just as much a sin\".\n \n \n \nThat's not to say, of course, that it doesn't happen, or that it has no effect. I'm sure there's SOME effect to some degree, but the real point here is that when all the factors are weighed, there's really not a lot we can do about it and it can't be quantified.\n\n Like I said.\n ONE month of everybody who is \"against\" gays being quiet.\n \n While we may not be able to do anything \"about it\" because it is free speech to make claims that gays damage civilization, and those comments aren't \"quantified\", the GENERAL ENVIRONMENT you contribute to has an effect.\n Do you really think that these people just wake up in the morning and do these things if they had NO support?\n \n \n \nI hear some among gay pride proponents that they have no problem with people holding the religious view that gay sex is immoral as long as they keep their hands off laws. Others I hear say that both are wrong, and yet others like Matthew seem to say that both should actually be outlawed somehow. So there doesn't even seem to be a whole lot of consensus on this even among those for whom gay rights is a really important issue, much less anyone else.\n\n Wow.\n And so the existence of the \"Fred Phelps\" of the world show that there is no real consensus amongst the Christians about the treatment of gays.\n Evidently, it's just a whole mixture of people who want to kill gays and think we should be stoned, and those who are just \"against\" gays.\n < end sarcasm <\n \n Your obfuscation knows no bounds....\n \n \n \nThat's why I think taking a position that we should start blaming people for merely contributing to a culture of hatred is rife with problems.\n\n What's really ironic in all this is that you are trying to present an argument that BLAMING people is somehow \"rife with problems\".\n \n Yet those that condemn and criticize gays CANNOT be blamed, because their impact is \"unquantifiable\".\n \n Talk about having your cake and eating it too.\n \n Would you mind explaining exactly how \"blaming\" people is \"rife with problems\", but a similar mechanism of condemning gays cannot be blamed?", 
   {}, 
   298424, 
   null, 
   1201125600.0
  ], 
  [
   298430, 
   null, 
   "foundit66", 
   "I think the real question is how do you go about assigning blame toward people?\n\n And thus my question is thoroughly dodged.\n \n You claim there is no link between a status of being \"not completely innocent\" and lacking any blame, yet when pressed for ONE example you cannot even give that.\n \n I used to have a phrase in my signature for situations like this, but it was removed due to a complaint by somebody who didn't like being reminded of their own standard...\n \n \"If you are going to make that accusation, you need to pony up and prove it.\"\n ***Jyoshu\n \"Well since you didn't address my points, I'll assume you're done! A simple \"ok, I concede that ... and moving on back to the issues ...\"\n ***Jyoshu\n \n But to address your question, even though you refuse to address mine, it's about recognizing when somebody ACTUALLY CONTRIBUTES to a situation.\n \n \n \nDo you just want to effectively be able to verbally say that some have blame attached to them, and leave it there? In a rhetorical sense? Because if that's all you mean, then fine.\n\n I have no idea what you're alluding to here.\n If you're thinking I was talking about legally substantiable blame, with possible law-suit ramifications, I was not talking about that.\n \n The word \"blame\" simply talks about responsibility for something of a negative nature.\n I don't see any dispute regarding \"negative nature\" for the issues at hand.\n The only thing of dispute seems to be \"responsibility\".\n And if they are not \"totally innocent\", then that directly indicates they DO HAVE some responsibility.\n \n \n \nHowever, I think truly blaming people in a real and quantitative sense is pretty darn unrealistic.\n\n I don't see why it should be...\n Those against gays think we are responsible for the down-fall of civilization, destruction of marriage, and some even claim we are culpable for what happened on 9/11.\n \n Is your real concern that \"quantifying\" the blame for the negative impact against gays can result IN THE EXACT SAME NEGATIVE CONSEQUENCES that those claims against gays have made our life so difficult???\n \n \n \nThe guy that bullied was the bully. He committed the crime ... he does the time.\n\n Nobody suggested otherwise.\n If somebody did, point it out.\n \n Hopefully we can get off of that non-sequitur then?", 
   {}, 
   298425, 
   null, 
   1201126560.0
  ], 
  [
   298432, 
   null, 
   "foundit66", 
   "And when did you stop beating your wife?\n\n That's really desparate.\n Here, we have an ADMISSION of \"not totally innocent\", but we are instead just discussing what the implications of that means.\n \n It is in NO WAY similar to the \"beating your wife\" thing.\n We are ASKING YOU DIRECTLY the correlation between \"not totally innocent\" and \"some blame / blameless\".\n \n And you are desparately trying to change the subject.\n \n \n \nWhy are you determined to try and turn a shades-of-gray issue into a completely black-and-white question here?\n\n The obfuscation continues.\n We have already talked about SOME blame, so a \"shade of gray\" has already been admitted with regards to the degree of blame. Nobody is saying ALL or NONE.\n \n The distinction is between SOME blame and NO blame, which IS a black and white question.\n \n \n \nOption C is no \"comedy\" one at all--nor is it any word game--it's simply taking the view that expecting people to take blame for something on such an un-substantive basis--particularly with no regard to substance or degree--is not only a very unrealistic approach, but a rather foolish one as well.\n\n Quite frankly, what I \"expect\" is for the people who contribute to the atmosphere that results in a high suicide rate for gays, a high homeless youth rate for gay teens, and a variety of other issues to NOT \"take blame\".\n I don't expect them to \"take blame\" at all.\n \n And as far as \"substance or degree\", I thought you just finished saying that it was \"unquantifiable\".\n And now you want to talk about the DEGREE of blame?\n \n More having cake and eating it too...\n \n \n \nIt's the correct option. Prove some actual causality and give some actual specifics, then maybe you'll start to have a case.\n\n Ahhh yes.\n This ol' chest-nut.\n Avoid the simple questions involved, back-pedal like crazy from the previous statements made, and demand \"proof\".", 
   {}, 
   298428, 
   null, 
   1201127100.0
  ], 
  [
   298434, 
   null, 
   "jyoshu", 
   "I have to cut you off right there because THERE is where you make the BIG mistake.\n WHEN in the hell are you ever confronted with \"homosexual behavior\"?\n Do gay guys get naked and do the nasty on your lawn every morning?\n\n \n Dude, calm down. I just meant sex and/or romance outside what one's orientation would call for. Do you think most people don't find the idea of romance with someone outside their orientation unappealing? I'm just saying I think that's more to blame for these problems than religious preaching. That's just my opinion.\n \n \nIn which case I just gotta ask you.\n Who is ask you to do something that is \"unappealing\" to you? I find Wienershnitzel's food \"pretty darn unappealing\", but you don't find me running around demanding that people who work or eat there not be able to marry or adopt or serve in the military.\n You don't find me fixating on the ideal to the extent that it warrants its own message sub-board.\n\n \n Point taken. But I think aversion of the idea of people engaged in romance outside of one's orientation is probably a heck of a lot stronger than merely distaste for food. Don't interpret this as me defending such aversion as a basis for fueling hatred in society. I'm not. I'm simply saying I think it does.\n \n \nJyoshu. LOOK at the thread titles.\n THOSE are the issues with the focus.\n \"Why same sex adoption is wrong\"\n \"New strain of MRSA...\"\n \"Huckabee on homosexuality\"\n \"Lessons from the past\"\n \"Teen Suicide\"\n \"One-third of city's homeless youth are LGBT\"\n \"Gay marriage is threat to world peace, says pope\".\n \n You're trying to obfuscate the issue by diminishing our ACTUAL issues and trying to shift the focus onto something trivial.\n THOSE are the real issues.\n\n \n But it's not preaching from pulpits. Those are discussion titles on a debate forum dedicated to the very topic. \n \n \nBut on the \"preaching\" issue, how many times do you see people \"preaching\" against divorce?\n How many times do you see people \"preaching\" against worshipping another god? Or working on sunday? Or bearing false witness against your neighbor? Quite frankly, it's not the \"attention it gets here\" that concerns me as much as the \"attention\" that YOUR side of the fence puts on it, disproportionately to other issues which are supposedly \"just as much a sin\".\n\n \n FWIW, I'm pretty sure I've heard divorce talked about in preaching considerably more than homosexual relationships. Idolatry more as well. \n \n \n\n \n Your obfuscation knows no bounds....\n\n \n What, in particular do you find 'obfuscating' about what I pointed out?\n \n \nWhat's really ironic in all this is that you are trying to present an argument that BLAMING people is somehow \"rife with problems\".\n\n \n No, it depends on what you mean, exactly. I already said this, but if by blame you simply mean being able to say--in terms of rhetoric--that so-and-so harbors blame, then sure, you can say that all you want. You can say whatever you want. But if by blame you mean to go any farther than rhetoric into the realm of policy then yes, it's rife with problems. A LOT of specifics would have to worked out to regulate such speech, and there would probably be constitutional challenges as well.\n \n \nWould you mind explaining exactly how \"blaming\" people is \"rife with problems\", but a similar mechanism of condemning gays cannot be blamed?\n\n \n I don't understand your question. Could you elaborate?", 
   {}, 
   298429, 
   null, 
   1201127580.0
  ], 
  [
   298437, 
   null, 
   "jyoshu", 
   "A couple of other points ...\n \n \nI have no idea what you're alluding to here.\n If you're thinking I was talking about legally substantiable blame, with possible law-suit ramifications, I was not talking about that.\n \n The word \"blame\" simply talks about responsibility for something of a negative nature.\n I don't see any dispute regarding \"negative nature\" for the issues at hand.\n The only thing of dispute seems to be \"responsibility\".\n And if they are not \"totally innocent\", then that directly indicates they DO HAVE some responsibility.\n\n \n So basically, you're really just saying you want to be able to tell people \"it's your fault\" with no bearing on policy or laws. All rhetorical. That's fine. You can say what you want.\n \n \nAhhh yes.\n This ol' chest-nut.\n Avoid the simple questions involved, back-pedal like crazy from the previous statements made, and demand \"proof\".\n\n \n Well, I would think you'd WANT to have proof before an accusation of blame, but whatever. [shrug]", 
   {}, 
   298430, 
   null, 
   1201127880.0
  ], 
  [
   298439, 
   null, 
   "foundit66", 
   "Dude, calm down. I just meant sex and/or romance outside what one's orientation would call for. Do you think most people don't find the idea of romance with someone outside their orientation unappealing?\n\n I think I explained this quite succinctly.\n \n I don't like greasy chili-dogs.\n That means I don't go out and eat them.\n That doesn't mean I picket the establishments that sell them, or criticize people who do like greasy chili-dogs.\n \n The point is that while I do realize people find the idea of romance outside their orientation unappealing, NOBODY IS ASKING THEM to do it.\n That's NOT the issue. You're deflecting.\n \n The issue is how some people TAKE their \"unappealing\" position, and EXTERNALIZE it whereby not only do they not do it, but they take action against those who DO do it.\n \n \n \nI'm just saying I think that's more to blame for these problems than religious preaching. That's just my opinion.\n\n And as I made it abundantly clear, you're wrong.\n \n I don't like greasy chili-dogs.\n Will THAT get the Wienerschnitzel shut down?\n No.\n \n But, if I TAKE FURTHER STEPS and actively voice my condemnation, criticizing those that eat them, that WILL have an impact.\n Likewise, if straights who don't find homosexuality \"appealing\" just had the feeling that \"it's unappealing\", it wouldn't be a problem.\n \n The point at hand goes WAYYY beyond just \"not appealing\".\n And predictably, you avoided direct commentary.\n \n \n \nPoint taken. But I think aversion of the idea of people engaged in romance outside of one's orientation is probably a heck of a lot stronger than merely distaste for food. Don't interpret this as me defending such aversion as a basis for fueling hatred in society. I'm not. I'm simply saying I think it does.\n\n And again, deflecting.\n The issue is not \"which is stronger\", but rather which is PUT OUT into the community with stronger enforcement.\n \n We could change the issue from this to \"smoking\" since that is obviously a \"stronger\" issue of \"unappealing\".\n Do you see a difference inbetween me not smoking and finding it \"unappealing\", to openly condemning smokers and claiming that they are going to bring about the fall of civilization and numerous other examples previously observed?\n \n There IS a difference, and you're glossing over it to ignore it.\n \n \n \nFWIW, I'm pretty sure I've heard divorce talked about in preaching considerably more than homosexual relationships. Idolatry more as well.\n\n Really?\n Cause from somebody who doesn't attend church, guess which one I hear about more?\n \n Perhaps it's a difference between casual conversation on \"divorce\", and SCREAMING about homosexuality while encouraging active legislative discrimination against gays.\n Perhaps if I heard about \"homosexuality\" with the same volume as \"divorce\", we wouldn't be having this conversation....\n \n \n \nWhat, in particular do you find 'obfuscating' about what I pointed out?Others I hear say that both are wrong, and yet others like Matthew seem to say that both should actually be outlawed somehow. So there doesn't even seem to be a whole lot of consensus on this even among those for whom gay rights is a really important issue, much less anyone else.\n\n Interesting how you didn't address my counter example. Is that because you found it as valid as your conclusion?\n \n There IS \"consensus\".\n The existence of \"consensus\" is not eliminated by the co-existence of minority extremism.\n \n Fred Phelps talks about Christianity justifying some pretty explicitly hatred.\n So by your standards, since I see both Fred Phelps and the departed Reverend Graham speaking, does that mean there is no consensus as to whether or not Jesus's message was about love or hate?\n \n Don't cut and paste around it this time.\n \n \n \nNo, it depends no what you mean, exactly.\n\n I have just explained that. Explicitly.\n So hopefully we can stop talking about \"depends on what you mean\" and get to a real discussion.\n \n \n \nI already said this, but if by blame you simply mean being able to say--in terms of rhetoric--that so-and-so harbors blame, then sure, you can say that all you want.\n\n Wrong. And more predictable obfuscation.\n The issue isn't over whether an individual HARBORS blame. (And predictably, that's a NEW approach that you are trying to introduce in this post not present in previous posts.)\n The issue is over whether or not an individual DESERVES blame. Whether culpability for a negative situation can be justifiably assigned to a person because of their actions.\n \n And to avoid discussing whether or not a person DESERVES blame, you change the focus.\n Just above, you try to talk about whether or not an individual \"harbors\" blame for somebody, ignoring the issue of the justifiability of that position.\n Before, you tried to change the focus to LEGAL culpability, probably a presumption upon law-suit culpability.\n \n We have been pretty clear about what we are talking about.\n It's bizarre how you can't address it.\n \n \n \nBut if by blame you mean to go any farther than rhetoric into the realm of policy then yes, it's rife with problems.\n\n 1) \"rhetoric\": asked merely for effect with no answer expected\n Funny how we have been asking you to answer, so how the heck you could consider it \"rhetoric\" is beyond me.\n No. It's not \"rhetoric\". We're looking for an honest and open discussion.\n \n 2) \"rife with problems\".\n Again, I am amused as to how you can claim that DISCUSSING BLAME is \"rife with problems\", yet BLAMING GAYS doesn't have any culpability for those that blame gays.\n In trying to CLAIM the existence of problems with such a discussion, you are PROVING OUR POINT with regards to the impact of those who just \"voice\" condemnation against gays.\n \n \n \nA LOT of specifics would have to worked out to regulate such speech, and there would probably be constitutional challenges as well.\n\n Nobody has talked about regulating speech.\n Another obfuscational ploy.\n \n \n \nI don't understand your question. Could you elaborate?\n\n Fine.\n Let's cut it up into two parts.\n Start with: Would you mind explaining exactly how \"blaming\" people is \"rife with problems\"?", 
   {}, 
   298434, 
   null, 
   1201129020.0
  ], 
  [
   298441, 
   null, 
   "foundit66", 
   "So basically, you're really just saying you want to be able to tell people \"it's your fault\" with no bearing on policy or laws. All rhetorical. That's fine. You can say what you want.\n\n With regards to \"policy or laws\", it's still free speech. I have never even hinted at limiting it.\n \n Actually, \"basically\" we're looking for you to GO FURTHER with your earlier claim and explain it.\n Explain how somebody can be \"not totally innocent\" and still have \"no blame\".\n \n I think what it really boils down to is how YOU cannot counter our position with any rational objection.\n And again, as far as \"rhetorical\" I don't think that means what you think it means.\n You have been asked a few EXPLICIT questions, requesting a response.\n \n This is not \"rhetorical\".\n \n I think what you should be saying is \"one-sided statements with no explained objection\", and quite frankly that's YOUR choice as to whether or not you can formulate a rational objection or not.\n \n \n \nWell, I would think you'd WANT to have proof before an accusation of blame, but whatever. [shrug]\n\n It's interesting to watch how some people interchange the ideas of \"proof\" and \"evidence\".\n When they want to ignore the issue they have no counter for, they often demand \"proof\" so they can ignore the EVIDENCE which does exist, and their lack of response to that evidence.\n Instead, they rest their laurels on the fact that they can express incredulity and disbelief, and proclaim the given evidence as insufficient.\n \n People want EVIDENCE before accusations of blame, which we have.\n Whether or not you can counter that evidence, or intelligibly explain your previous statements, is another issue which you have obviously demonstrated no fortitude for...", 
   {}, 
   298437, 
   null, 
   1201129380.0
  ], 
  [
   298443, 
   null, 
   "jim's trucking", 
   "\"Why Same Sex Adoption is Wrong\" has NOT BEEN SHOWN!!\n \n The original homophobic thread starter has backed out of the argument, likely still hiding from the simple fact that he cannot prove anything claimed so far.\n \n The truth is that any home lacking love will harm children. \n \n No less truthful is the FACT that homosexual couples are more likely to live love filled lives than heteros. \n \n There's a bit of a \"frustated male\" syndrome in most of the wife beating families. There's turmoil in heterosexual families that will never appear in homosexual families. In my opinion, an adoptive child would fare better in a homosexual family built on love than in a heterosexual family built on fear of daddy. (Mommy can be mean too, but it's usually the man that screws up the love factor in a home.)\n \n I can imagine a two-mom family being more loving than a two-dad family, but I can't see either as being as damaging to young children as a drunken, wife abusing, mentally impotent male. The need of a father figure being in the house has been diminished by our ability to use the computer and other devices to learn. There's less need of an actual dad and an actual mom to copy. Life's lessons can be learned from anyone who displays compassion and common sense. The sexual attractions of the growing puppies will come naturally whether they are guided by gay or heterosexual parents...and the gay parents are more likely to be consistent in showing love...in my humble opinion, says he. \n \n All the above is merely my humble opinion.\n \n It's really a shame that we can't interfere in a hate-filled family soon enough to get the children out.", 
   {
    "post_info": {
     "post_title": "Why is it wrong?"
    }
   }, 
   298437, 
   null, 
   1201129680.0
  ], 
  [
   298445, 
   null, 
   "Kronus", 
   " \n No less truthful is the FACT that homosexual couples are more likely to live love filled lives than heteros. \n\n \n Do you have anything to back that up? It seems far from obvious to me.\n \n \n There's turmoil in heterosexual families that will never appear in homosexual families. \n\n Again, can you expand? I don't get what you're trying to say here. You almost seem to be saying that straights have dibs on all the drunken abusers; is that it?", 
   {}, 
   298443, 
   null, 
   1201129980.0
  ], 
  [
   298446, 
   null, 
   "Kronus", 
   "And when did you stop beating your wife? Why are you determined to try and turn a shades-of-gray issue into a completely black-and-white question here? Option C is no \"comedy\" one at all--nor is it any word game--it's simply taking the view that expecting people to take blame for something on such an un-substantive basis--particularly with no regard to substance or degree--is not only a very unrealistic approach, but a rather foolish one as well. It's the correct option. Prove some actual causality and give some actual specifics, then maybe you'll start to have a case. I'm sure it's certainly easier to stick with vague statements of blame without causal proof, but if you're trying to take anything more than merely an approach of rhetoric, that's not the way our system works, thank goodness. So ya better get cracking.\n\n \n And so you shift the goal posts as you always do. When asked if you believe a certain view, instead of answering you insist on proof that said view must be true. You realize that's all that's being required of you here, your opinion? You're usually so happy to provide it, why are you going to such lengths to hide it now? Don't play word games, don't attack, don't ask for rediculous proofs. Just answer the really basic question that was asked of you. You know, engage in honest debate. Give it a shot, I dare you. :) \n \n But I'm not holding my breath. If you want a real debate I'm here, if you just want to play your usual games I'm not really that interested. I've shown what I wanted to show; if you can't provide a post with some meat on it than don't expect a response.", 
   {}, 
   298428, 
   null, 
   1201130520.0
  ], 
  [
   298450, 
   null, 
   "jim's trucking", 
   "Do you have anything to back that up? It seems far from obvious to me.\nExcept for my recollection of news articles involving domestic woes, my recollection of the numerous episodes of \"COPS\" and my recollection of personal experiences and hearsay involving friends and family. While that's highly unworthy of proving a general widespread truth, it is sufficient to bolster my humble opinion that per capita beatings by partners is much higher in the hetero world.\n \n \n\n Again, can you expand? I don't get what you're trying to say here. You almost seem to be saying that straights have dibs on all the drunken abusers; is that it?\nNo. Certainly not all of them. Though I have no personal knowledge of a gay couple fighting constantly, I'm relatively sure there's at least one in the world...maybe more....but it seems highly unlikely, based on my personal exposure to such activities, that the homos could hold a candle to the heteros.\n \n Based on that...I figure an adopted child is lucky to get into a homosexual family.", 
   {}, 
   298445, 
   null, 
   1201131240.0
  ], 
  [
   298453, 
   null, 
   "jyoshu", 
   "I think I explained this quite succinctly.\n \n I don't like greasy chili-dogs.\n That means I don't go out and eat them.\n That doesn't mean I picket the establishments that sell them, or criticize people who do like greasy chili-dogs.\n \n But, if I TAKE FURTHER STEPS and actively voice my condemnation, criticizing those that eat them, that WILL have an impact.\n Likewise, if straights who don't find homosexuality \"appealing\" just had the feeling that \"it's unappealing\", it wouldn't be a problem.\n \n\n \n So then as long as people just refrain from picketing or criticising gays, they're above blame? You see, you might still VERBALIZE that you don't like those chili dogs. But by your logic, that would be cause for blame. Unless of course you have no problem with people saying they don't like gays think the idea of gay romance is gross. :) But then that would require consistency on your part in terms of analogy. Of course you could simply be straight up here and just explain what would SUFFICE to amount to someone needing to be blamed. What, specifically, has to be said in order for it to be a \"blamable\" matter. That way your take on this would be settled.\n \n \nWe could change the issue from this to \"smoking\" since that is obviously a \"stronger\" issue of \"unappealing\".\n Do you see a difference inbetween me not smoking and finding it \"unappealing\", to openly condemning smokers and claiming that they are going to bring about the fall of civilization and numerous other examples previously observed?\n\n \n I note that you are mainly using examples that are over-the-top, like people claiming they would \"bring about the fall of civilisation.\" So if someone just says 'smokers are doing bad things' it's ok? Or (let me guess) suddenly your analogy ends there? :) See, until you specify where the line is in what constitutes someone being at fault and someone not, it's anyone's guess.\n \n \nReally?\n Cause from somebody who doesn't attend church, guess which one I hear about more?\n\n \n Well, if you don't attend church, then you're hardly in a position to know what gets preached there.\n \n \nThere IS \"consensus\".\n The existence of \"consensus\" is not eliminated by the co-existence of minority extremism. Fred Phelps talks about Christianity justifying some pretty explicitly hatred. So by your standards, since I see both Fred Phelps and the departed Reverend Graham speaking, does that mean there is no consensus as to whether or not Jesus's message was about love or hate?\n\n \n Again, I've heard some say that the belief doesn't matter as long as a person keeps their hands off the laws. So it looks like the only thing there's really true consensus on in the gay rights movement is that gays need equal rights.\n \n \nWrong. And more predictable obfuscation.\n The issue isn't over whether an individual HARBORS blame. (And predictably, that's a NEW approach that you are trying to introduce in this post not present in previous posts.) The issue is over whether or not an individual DESERVES blame. Whether culpability for a negative situation can be justifiably assigned to a person because of their actions.\n\n \n Fine, call it \"deserve\". It doesn't change the point that you've shown no real causality. Heck, if anything, saying the issue is whether they actually DESERVE blame only makes your burden of proof somewhat harder. But then you don't want to have to prove anything, do you? You just want to be able to say people are at fault without specifying the level of evidence needed, huh?\n \n \nJust above, you try to talk about whether or not an individual \"harbors\" blame for somebody, ignoring the issue of the justifiability of that position.\n\n \n Well I certainly think it needs to be justified before blaming someone for something.\n \n \n1) \"rhetoric\": asked merely for effect with no answer expected\n Funny how we have been asking you to answer, so how the heck you could consider it \"rhetoric\" is beyond me.\n No. It's not \"rhetoric\". We're looking for an honest and open discussion.\n\n \n That's it? An \"honest and open discussion\" is all there is to wanting to blame people for this? THAT'S your reason?\n \n \n2) \"rife with problems\".\n Again, I am amused as to how you can claim that DISCUSSING BLAME is \"rife with problems\", yet BLAMING GAYS doesn't have any culpability for those that blame gays. In trying to CLAIM the existence of problems with such a discussion, you are PROVING OUR POINT with regards to the impact of those who just \"voice\" condemnation against gays.\n\n \n Whoa there. I've made no statement re. those who blame gays for things. Why would you assume I wouldn't think that was just as unreasonable without just cause? You're conflating two different issues here.\n \n \nStart with: Would you mind explaining exactly how \"blaming\" people is \"rife with problems\"?\n\n \n The problems are that you haven't explained what constitutes culpability. What statements are tantamount to blame, and to what degree of statements? Or will you just keep that vague so you can blame without qualifying it?\n \n \nIt's interesting to watch how some people interchange the ideas of \"proof\" and \"evidence\". When they want to ignore the issue they have no counter for, they often demand \"proof\" so they can ignore the EVIDENCE which does exist, and their lack of response to that evidence. Instead, they rest their laurels on the fact that they can express incredulity and disbelief, and proclaim the given evidence as insufficient. People want EVIDENCE before accusations of blame, which we have. Whether or not you can counter that evidence, or intelligibly explain your previous statements, is another issue which you have obviously demonstrated no fortitude for...\n\n \n Yeah, particularly since, with just evidence, you don't have to worry about any point where it needs to suffice. (And let me guess--you've no interest in saying how much evidence is needed to suffice for being able to reasonably blame someone.) With going on merely evidence for assigning blame, you don't have to worry about how much or how little, or to what degree. Convenient!", 
   {}, 
   298439, 
   null, 
   1201132740.0
  ], 
  [
   298455, 
   null, 
   "jyoshu", 
   "And so you shift the goal posts as you always do. When asked if you believe a certain view, instead of answering you insist on proof that said view must be true. You realize that's all that's being required of you here, your opinion? You're usually so happy to provide it, why are you going to such lengths to hide it now? Don't play word games, don't attack, don't ask for rediculous proofs. Just answer the really basic question that was asked of you. You know, engage in honest debate. Give it a shot, I dare you. :) \n\n \n Ok! :) I gave you my opinion. It just didn't fit your over-simplified parameters of \"agree\"/\"disagree\" because it's not that simple of an issue. There you go!", 
   {}, 
   298446, 
   null, 
   1201132860.0
  ], 
  [
   298456, 
   null, 
   "foundit66", 
   "So then as long as people just refrain from picketing or criticising gays, they're above blame? You see, you might still VERBALIZE that you don't like those chili dogs. But by your logic, that would be cause for blame.\n\n If you were to verbalize that you don't like gay sex, that would be one thing.\n To criticize OTHERS who do like gay sex is another thing.\n To say \"it's immoral\" is also another thing.\n \n I have no problem with you not liking gay sex.\n But quite frankly, THAT sentiment is not the limit of what people DO talk about when they criticize gays.\n \n \n \nUnless of course you have no problem with people saying they don't like gays think the idea of gay romance is gross. :) But then that would require consistency on your part in terms of analogy.\n\n Where the heck have I been inconsistent?\n Let me guess. Another question avoided?\n \n \n \nOf course you could simply be straight up here and just explain what would SUFFICE to amount to someone needing to be blamed. What, specifically, has to be said in order for it to be a \"blamable\" matter. That way your take on this would be settled.\n\n And on the flip side, YOUR take would still be un-stated....\n At least beyond the earlier statement that supposedly there is a reality whereby \"not totally innocent\" and \"blameless\" are not mutually exclusive.\n \n But regardless of your refusal to answer simple questions, I will continue to address the points raised.\n \"Blame\" comes in when the issue at hand involves condemnation of gays. Statements that ostracize gays, or foster an environment of gay ostracization.\n To ask for \"specifics\" is inane considering there is a wide variety of potential statements.\n I've given some examples above.\n \n \n \nI note that you are mainly using examples that are over-the-top, like people claiming they would \"bring about the fall of civilisation.\"\n\n I used the \"bring about the fall of civilization\" in an attempt to find some common ground.\n SOME realm where you could finally admit that THAT extreme has \"blame\".\n But I see you are unwilling to do even that. You are unwilling to criticize even those that blatantly lie with absurd statements like \"gays bring about the fall of civilization\".\n Why am I not surprised...\n \n \n \n So if someone just says 'smokers are doing bad things' it's ok? Or (let me guess) suddenly your analogy ends there?\n\n Why would an analogy having a limitation be a refutation of the analogy?\n Your response is trivial and mundane.\n Personally, I do think that people who say \"smokers are doing bad things\" ABOVE AND BEYOND MEDICAL FACTS are demonstrating culpability.\n \n \n \nSee, until you specify where the line is in what constitutes someone being at fault and someone not, it's anyone's guess.\n\n The funny thing is that up until now this conversation has been about finding out YOUR distinctions on \"lines\".\n But of course, you obfuscated your butt off on that, and shifted the focus. Ignoring the justification for the ACCURACY of the assessment, and instead trying to shift the issue to a trivial and endless task of drawing a \"line\".\n \n I have already stated that condemning gays is crossing the line.\n You repeatedly refuse to discuss that. You won't even give an opinion on it.\n Instead, you proceed with endless quibbling and obfuscation...\n \n \n \nWell, if you don't attend church, then you're hardly in a position to know what gets preached there.\n\n That's just plain inaccurate.\n I would be in a poor position to proclaim what is NOT preached there.\n But are you really questioning the legitimacy of my statement that preaching against gays IS taught there?\n And it IS given more volume than the other things you claim are preached there?\n \n No. Of course you aren't.\n You're just throwing out mindless quibbles, avoiding the actual point...\n \n \n \nFine, call it \"deserve\". It doesn't change the point that you've shown no real causality.\n\n Are you for real?\n We have explained the mechanisms involved REPEATEDLY.\n The real \"point\" here is that you've shown NO REFUTATION of causality.\n \n \n \nHeck, if anything, saying the issue is whether they actually DESERVE blame only makes your burden of proof somewhat harder.\n\n Again with a demand for \"proof\", while you ignore the evidence shown.\n \n \n \nBut then you don't want to have to prove anything, do you? You just want to be able to say people are at fault without specifying the level of evidence needed, huh?\n\n You love obfuscation, don't you.\n We HAVE GIVEN the evidence. \n We have REPEATEDLY explained the reasons involved.\n \n And moreover, it's interesting to watch you MOVE THE BAR AGAIN as you refuse to discuss the reasons shown, while instead trying to quibble over \"level of evidence\" that is supposedly \"needed\".\n In reality, US SHOWING evidence is convincing when you compare it to your repeated obfuscational tricks.\n Quite frankly, you REFUSING TO ADDRESS the issue is a complete LACK of any \"level of evidence\", but you refuse to address that...\n \n \n \nThat's it? An \"honest and open discussion\" is all there is to wanting to blame people for this? THAT'S your reason?\n\n The level of obfuscation you throw out here is amazing.\n Truly unprecedented.\n I never said anything even REMOTELY resembling \"An 'honest and open discussion' is all there is to wanting to blame people for this\"\n \n I was saying I WANTED an honest and open discussion on the issue.\n I could challenge you to show where I said anything which demonstrates I think An 'honest and open discussion' is all there is to wanting to blame people for this\", but we both know you can't and won't honestly address that challenge.\n \n \n \nWhoa there. I've made no statement re. those who blame gays for things. Why would you assume I wouldn't think that was just as unreasonable without just cause? You're conflating two different issues here.\n\n Cause quite frankly, YOU have claimed an existence of \"problems\" just for discussing blame.\n Where's your \"proof\" of that jyoshu?\n How DARE you claim problems exist for the existence of people discussing it, when you have no proof?\n < end sarcasm <\n \n \n \nThe problems are that you haven't explained what constitutes culpability.\n\n Get a dictionary and look it up.\n These tricks of yours are boring.\n All I am doing is giving you definitions, and hear you complain that you want other words defined too.\n Meanwhile, you give NO counter definitions...", 
   {}, 
   298453, 
   null, 
   1201135200.0
  ], 
  [
   298457, 
   null, 
   "foundit66", 
   "Ok! :) I gave you my opinion. It just didn't fit your over-simplified parameters of \"agree\"/\"disagree\" because it's not that simple of an issue. There you go!\n\n \n Yeah.\n You \"gave\" an opinion and then you immediately proceeded to refuse to discuss it.\n \n The question of HOW a person can be \"not totally innocent\" and still \"blameless\" still remains, but you refuse to address it.\n \n You demand others show you \"lines\", but quite frankly you have given NONE yourself.\n \n Here's a simple question for you Jyoshu.\n \n WHAT does a hypothetical person have to do in order to get ANY admission of \"blame\" from you, when that hypothetical person contributes (using your standards for deciding *contributes*) to the commission of an anti-gay bullying, but doesn't actually commit the bullying?\n How far does that hypothetical person have to go before Jyoshu says \"I see this hypothetical person as having some blame because he committed action ______\"?\n \n Let me guess.\n Even THAT simple question as to WHAT scenario would give you a stance of assigning blame is something you can't answer?\n Is that because there is no scenario for you whereby you criticize the anti-gay?", 
   {}, 
   298455, 
   null, 
   1201135440.0
  ], 
  [
   298458, 
   null, 
   "Kronus", 
   "Except for my recollection of news articles involving domestic woes, my recollection of the numerous episodes of \"COPS\" and my recollection of personal experiences and hearsay involving friends and family. While that's highly unworthy of proving a general widespread truth, it is sufficient to bolster my humble opinion that per capita beatings by partners is much higher in the hetero world.\n \n No. Certainly not all of them. Though I have no personal knowledge of a gay couple fighting constantly, I'm relatively sure there's at least one in the world...maybe more....but it seems highly unlikely, based on my personal exposure to such activities, that the homos could hold a candle to the heteros.\n \n Based on that...I figure an adopted child is lucky to get into a homosexual family.\n\n \n Well, not that I want to disuade you from the notion that gays would make good parents, but as in most other things gays are just like straights when it comes to anger managment skills. Most do fine, some don't. I think the only reason that you feel that there are alot more het than homo abusers is that there are alot more het than homo couples. Plus the fact that since gays can't get married or accidently have kids, it can be a lot easier for them to split up when they realise a relationship isn't working out. Basically, there's no real reason for a gay man to be less violent than a straight man, so until some data shows otherwise I'm going to assume that they're pretty much the same. I'm afraid \"COPS\" won't cut it as a peer reviewed source. :)", 
   {}, 
   298450, 
   null, 
   1201135440.0
  ], 
  [
   298459, 
   null, 
   "Kronus", 
   " \n WHAT does a person have to do in order to get ANY admission of \"blame\" from you, when that person contributes (using your standards for deciding *contributes*) to the commission of an anti-gay bullying, but doesn't actually commit the bullying?\n \n\n \n Not being a Christian helps a lot! Except for fundamentalists of course, they're fair game.", 
   {}, 
   298457, 
   null, 
   1201135620.0
  ], 
  [
   298461, 
   null, 
   "foundit66", 
   "Realizing that Jyoshu will continue to obfuscate the issue, it's best to move past the \"obstacle\" to continue to drive home the point.\n \"What could account for these vulnerabilities to suicide? It must be remembered that many factors are associated with youth suicidality, of which gay-related stressors may form an important part, especially for males. In the case of male youth exposed to anti-gay abuse, the gay-related stressor is clear, namely an external source of threat and harm that is experienced because one is associated with homosexuality (accurately or not). But this leaves the question as to why gay youth who have not been exposed to anti-gay harassment show a similar suicide attempt incidences. \n \n A possible explanation may lie in findings from my research in which a correlational matrix of gay-related stressors caused two covariance groups to emerge that can be labelled as internal and external stressors (Theuninck 2000). External stressors include events that occur largely independent of a person's perception of them such as physical and verbal violation. Internal stressors included internalised homophobia and the perception of stigma (i.e. perceiving society as discriminating against gay people). These stressors rely on an internalisation of societal norms and threats. Through internalised homophobia the person adopts the beliefs that homosexuality is not legitimate, that it is a sickness, moral weakness, defect, or some such deformation of self. This may lead to intense self-loathing related to having same-sex desires. \n \n Through stigma the person learns that society is hostile to homosexuality and poses a threat to those so identified. Such a stressor creates an overall context of fear in which a person may fear his/her sexuality will be known, or may fear and live in trepidation of the ever present possibility of being attacked or discriminated against in the course of daily life. Such stressors could account for suicidal tendencies in people identified as homosexual or bisexual but have not been exposed to overt external stressors such as anti-gay harassment. \n \n Even in cases where anti-gay harassment is experienced, it could be argued that the more pernicious stressor is the internal stressors, and more specifically internalised homophobia. In my research I examined the regression relationship of minority stressors and traumatic stress symptoms with gay-related suicidality (i.e. thinking about or attempting to commit suicide because one has homosexual desires). The stressors that associated most strongly with gay-related suicidality were internalised homophobia, followed by witnessed gay victimisation and negative fundamental beliefs. By negative fundamental beliefs is meant those beliefs that are essential to maintaining the coherence of self as defined by the works of McCann and Pearlman (1990). \n \n Where homophobia has become internalised, where a person has colluded in victimisation of other gays, by taking part or standing by, in these cases it seems that the stress of the \"gay scourge\" becomes more pernicious. The evil is within the individual. The person's sense of self comes under direct assault by himself. His fundamental beliefs about being good, in control, safe in the world, and trustworthy start to untangle, for he is his worst enemy. His gayness becomes the source of torture, rather than seeing the external world as torturous of his sexuality. Under these circumstances he is more likely to have thoughts about killing himself for having gay urges and also attempt suicide.\" (Theuninck, 2002)http://www.youth-suicide.com/gay-bisexual/construction/7-gay-youth-suicide-harassment.htm\n \n This helps demonstrate that those who do not DIRECTLY bully gays, but instead give support to a GENERAL ATMOSPHERE of condemning and criticizing gays can lead to negative consequences.\n The whole point is that when a person makes a gay person feel that it isn't okay to be gay, and that gay person IS gay and that is who he/she is, this creates a problem.\n \n Quite frankly, in the U.S. I think we have moved to the point where Christians (by and large) accept other religions WITHOUT condemnation, even though they view it as a sin. Christians typically don't have a problem renting to Jews. They don't run around publicly proclaiming that \"Judaism is a sin\". They don't try to start \"family\" groups which proclaim that being Jewish is harmful. You don't see nation-wide camps dedicated to \"reparative therapy\" so that the Jewish person can stop being Jewish.\n A Jewish person can feel comfortable being a Jew.\n \n But those who make a point of urging gays that they are deficient, defective, immoral, < insert popular denigrating comment here < DO contribute to the detriment of gays.", 
   {}, 
   298459, 
   null, 
   1201141500.0
  ], 
  [
   298465, 
   null, 
   "ironcourage", 
   "I did not say I was against gay adoption I simply explained how case workers use risk assessment approving applicants. Just because you answer negatively on one or more assessments does not mean your application will be denied. I used this primarily from firsthand experience. My sister, who had ovarian cancer at 17 both were removed, adopted two siblings a boy and a girl there mother died of an overdose. I was on the application as one of the secondary care givers (baby sitter) and was also a reference I met with the case worker multiple times. My sister and I did allot of research together and I was very much involved in the whole process and I know a good amount of first hand knowledge of how it works. I can tell you that my sister was happily married for three years when she filed her adoption application this reflected negatively as most marriages end within 7 years. She also had cancer 13 years prior although it has never come back and she has regular checkups to make sure this still reflected negatively on that question of the risk assessment. \n \n \n As for the article in Spain the study was proven to be done by known gay rights activist and possibly doctored they ordered the study to be reviewed by a neutral party of social workers, doctors and psychologist not the pope And they fund a greater overall risk to the Childs welfare other than sexual orientation and sexual abuse. Such as opportunity, mental health, drug usage, promiscuity and social life they did not find all gay parents to be unsuitable. They simply found a different risk assessment. While some states choose to eliminate gays from adoption for those reasons other states just add it to their risk assessments.\n \n You simply choose to believe that only gay and gay rights activist are right on gay subjects because that's what you want to hear. Any one not in this group writes or says anything about gays it's automatically religiously or homophobic-ly motivated and untrue.\n \n For instance it a little off topic but it's the best thing I can think of that affects me on a personal level and my race so please bare with me and try not to laugh. British biologist studies show that the average Irish male has a smaller than average penis when compared to men other European countries. Now I'm Irish and the statistic includes all Irish men as a whole not as individuals this is clearly and obviously something I don't want to hear or be associated with.\n \n (1) I could personally discredit the study by saying it was done by the British and there just out to get me and my kind and make his race look better and more attractive.\n \n (2) I could search the internet for a study that says Irishmen have average to above average size penis that is written by a Irish men and choose to believe that one even know he may have doctored the results or prescreened individuals before including them in the study and only did the study to discredit the British study. \n \n (3) I could search the internet for multiple Irishmen that publicly admit they have small penis (which no one does) and use this as proof in my argument because no one would be able to prove me otherwise. \n \n (4) \n I could Refuse any such statistic exist \n \n \n (5) I could choose to except that the British study was performed in a neutral and scientific environment for scientific purposes and not to personally attack me and my race and although I may or may not have a small or below average size penis statistically other people in my race do. After using reason and logic I chose this one\n \n \n To explain it more clearly on an equally controversial risk assessment there is a question on adoption application asking the religion of the applicant while Christians and atheist maybe be neutral on the risk assessment. Muslims will reflect negatively as there women have more restrictions and stricter rules to follow and are generally placed lower in social family order . As opposed to Muslim men are generally taught they are superior to women and other religions this is not true for every Muslim family. An applicant will most likely not be denied for this one reason this is just one example as I'm sure there screening for cults and much more radical religions as well. Different cultures, sex, marital status, religions, sexual orientations all have different risk assessments associated with them and as you said adoption is not a right it's a privilege. Adoption agencies do not have to adhere to civil rights or even the constitution (it clearly states not to be judged by creed) when finding a place for a child that's the only life they need to worry about. So even if your state or country allows gays to adoption risk assessments will still play a vital role. \n \n There are so many different phases to the adoption process there are applications, paperwork, a number of interviews with you and your family extended family and references too, they have you take medical exams do blood work, have you meet with child psychologist, have you take parenting classes, have you meet with possible a adoptable children, each are designed to eliminate bad, unfit, unsuitable and questionable candidates whether there heterosexual or homosexual. They also make the process very long to discourage \"impulse parents\" as these don't normally work out. Risk assessment is just one of the many phases of the process\n \n further more a case worker can be arrested and found criminally liable for knowingly or unknowingly placing a child in a \"bad home\" even if the applicant passes the risk assessment so to ignoring lower scoring risk assessment would not be wise for them or the child although this is usually only the case in a abusive situation but this does happen a case worker told me this. So ultimately it there decisions not your negotiations. If ANYONE chooses to falsify ANY information ASKED such as lying about your sexual orientation or hiding a second parent whether it be same sex or opposite or knowingly falsify ANY other questions asked on your application it will become VOID as NONE of the answers can be creditable on the application nor any future adoption application and any re-adoption efforts you will be arrested, your child will be taken, you will be barred from any child adoption process in the U.S. , face charges of perjury and or child endangerment and may face expensive fines and jail time. no one wins when this happens and it does happen. \n \n I am NOT against discriminating all gay parents from the adoption process!!!", 
   {
    "unicode_changes_made": true
   }, 
   298382, 
   null, 
   1201147500.0
  ], 
  [
   298468, 
   null, 
   "jyoshu", 
   "Realizing that Jyoshu will continue to obfuscate the issue, it's best to move past the \"obstacle\" to continue to drive home the point.\n \"What could account for these vulnerabilities to suicide? It must be remembered that many factors are associated with youth suicidality, of which gay-related stressors may form an important part, especially for males. In the case of male youth exposed to anti-gay abuse, the gay-related stressor is clear, namely an external source of threat and harm that is experienced because one is associated with homosexuality (accurately or not). But this leaves the question as to why gay youth who have not been exposed to anti-gay harassment show a similar suicide attempt incidences. \n \n A possible explanation may lie in findings from my research in which a correlational matrix of gay-related stressors caused two covariance groups to emerge that can be labelled as internal and external stressors (Theuninck 2000). External stressors include events that occur largely independent of a person's perception of them such as physical and verbal violation. Internal stressors included internalised homophobia and the perception of stigma (i.e. perceiving society as discriminating against gay people). These stressors rely on an internalisation of societal norms and threats. Through internalised homophobia the person adopts the beliefs that homosexuality is not legitimate, that it is a sickness, moral weakness, defect, or some such deformation of self. This may lead to intense self-loathing related to having same-sex desires. \n \n Through stigma the person learns that society is hostile to homosexuality and poses a threat to those so identified. Such a stressor creates an overall context of fear in which a person may fear his/her sexuality will be known, or may fear and live in trepidation of the ever present possibility of being attacked or discriminated against in the course of daily life. Such stressors could account for suicidal tendencies in people identified as homosexual or bisexual but have not been exposed to overt external stressors such as anti-gay harassment. \n \n Even in cases where anti-gay harassment is experienced, it could be argued that the more pernicious stressor is the internal stressors, and more specifically internalised homophobia. In my research I examined the regression relationship of minority stressors and traumatic stress symptoms with gay-related suicidality (i.e. thinking about or attempting to commit suicide because one has homosexual desires). The stressors that associated most strongly with gay-related suicidality were internalised homophobia, followed by witnessed gay victimisation and negative fundamental beliefs. By negative fundamental beliefs is meant those beliefs that are essential to maintaining the coherence of self as defined by the works of McCann and Pearlman (1990). \n \n Where homophobia has become internalised, where a person has colluded in victimisation of other gays, by taking part or standing by, in these cases it seems that the stress of the \"gay scourge\" becomes more pernicious. The evil is within the individual. The person's sense of self comes under direct assault by himself. His fundamental beliefs about being good, in control, safe in the world, and trustworthy start to untangle, for he is his worst enemy. His gayness becomes the source of torture, rather than seeing the external world as torturous of his sexuality. Under these circumstances he is more likely to have thoughts about killing himself for having gay urges and also attempt suicide.\" (Theuninck, 2002)http://www.youth-suicide.com/gay-bisexual/construction/7-gay-youth-suicide-harassment.htm\n \n This helps demonstrate that those who do not DIRECTLY bully gays, but instead give support to a GENERAL ATMOSPHERE of condemning and criticizing gays can lead to negative consequences.\n The whole point is that when a person makes a gay person feel that it isn't okay to be gay, and that gay person IS gay and that is who he/she is, this creates a problem.\n\n \n What??? Do my ears (or rather eyes) deceive me??? You're actually making a reseached attempt to qualify your position, and explain how it might bring about causality! Now we're getting somewhere. See, that wasn't so difficult, now what it? emoticon_xgood I'll review the link further.", 
   {}, 
   298461, 
   null, 
   1201151820.0
  ], 
  [
   298469, 
   null, 
   "jyoshu", 
   "Yeah.\n You \"gave\" an opinion and then you immediately proceeded to refuse to discuss it.\n \n The question of HOW a person can be \"not totally innocent\" and still \"blameless\" still remains, but you refuse to address it.\n \n You demand others show you \"lines\", but quite frankly you have given NONE yourself.\n \n Here's a simple question for you Jyoshu.\n \n WHAT does a hypothetical person have to do in order to get ANY admission of \"blame\" from you, when that hypothetical person contributes (using your standards for deciding *contributes*) to the commission of an anti-gay bullying, but doesn't actually commit the bullying?\n How far does that hypothetical person have to go before Jyoshu says \"I see this hypothetical person as having some blame because he committed action ______\"?\n\n \n Tell you what .. you answer mine with specifics (without something vague like \"condemnation of gays\" which could be virtually anything and can be eye-of-the-beholder type stuff) and I'll answer yours. I'll even go first, at the risk of you not answering. Fair enough?WHAT does a hypothetical person have to do in order to get ANY admission of \"blame\" from you, when that hypothetical person contributes (using your standards for deciding *contributes*) to the commission of an anti-gay bullying, but doesn't actually commit the bullying?\n How far does that hypothetical person have to go before Jyoshu says \"I see this hypothetical person as having some blame because he committed action ______\"?\n\n Specific Answer: To get blame from me, he would have to rise above just merely saying he felt gay relations were wrong, to actually condemning gays in a direct way. Things like saying \"gays are evil\" or \"gays are hell-bound\". Saying things like \"I think gay sex is immoral would NOT count for causality and therefore blame, IMO. And even with the things I mentioned that ARE, I'd feel much better if even in those cases causality were actually proven and this guilty-till-proven innocent approach were dropped in terms of blame, for an innocent-till-proven guilty one.\n \n \nThat's just plain inaccurate.\n I would be in a poor position to proclaim what is NOT preached there.\n But are you really questioning the legitimacy of my statement that preaching against gays IS taught there?\n And it IS given more volume than the other things you claim are preached there?\n\n \n I certainly question that it's given MORE volume. Though yes, it is said there from time to time. Ironcially (given this debate today), I was at church tonight and it actually did get brought up--the first time that I can remember in a very long time. But you'd be rather surprised at how it was approached: someone (during discussion) was angry at the Phelps people for how they condemn gays, and the preacher responded by saying that he not only agreed, but that condemnation wasn't a good strategy for the Christian gospel, and just a wrong and un-Christlike approach to begin with. So, take THAT in your peace pipe and smoke it. Not only is my experience that the issue is rarely brought up, but when it IS, it's sometimes even favorable to your needs and cause. It seems us Christians aren't always so evil after all, huh? :)", 
   {}, 
   298457, 
   null, 
   1201152420.0
  ], 
  [
   298483, 
   null, 
   "lesz", 
   "Is that what I said? No. try responding to what's actually said next time, instead of whatever fantasy thread you're usually reading.\n\n \n I did. Just to remind you, since you have an exceptionally short memory, you said:\n \n \n...it's no more far-fetched than the problematic idea some have put forth here that others (besides the bullies themselves) who \"contribute to a culture of hate\" are to be blamed for gays being bullied. Bullies are the ones doing the bullying and they should be blamed for it.\n\n \n To exonerate the Christian churches of blame for the limate of hatred against gays is like the fatuous complaint that guns don't kill people. The churches aren't giving bullies their marching orders, but when bullying and gay bashing happens, they respond with a nod and a wink and observe, more in ersatz sorrow than in glee, that gays bring the violence on themselves because of their \"lifestyle\". And don't try to pretend they don't.", 
   {}, 
   298413, 
   null, 
   1201175220.0
  ], 
  [
   298484, 
   null, 
   "lesz", 
   "Nope. The issue of whether or not anyone in particular is \"totally innocent\" is not the same as whether or not they should be blamed.\n\n \n What on earth can you possibly mean by this doubletalk? If they aren't 'totally innocent\", and they certainly aren't, then of course they carry their burden of the blame. The may not wield the weapons themselves, but they condone the climate in which the weapons are used. Even when they feel that some gay-bashing has been so outrageous they can't afford to benignly ignore it and so they issue some statement that they \"do not condone the violence\", they generally phrase it in such a way as to indicate they understand and sympathise with the motives for the violence. It's always some version of: \"It's wrong, but gays have only themselves to blame.\" And the next day, they return to their gay-hating rhetoric as if nothing had happened.", 
   {}, 
   298421, 
   null, 
   1201175700.0
  ], 
  [
   298491, 
   null, 
   "jyoshu", 
   "To exonerate the Christian churches of blame for the limate of hatred against gays is like the fatuous complaint that guns don't kill people. The churches aren't giving bullies their marching orders, but when bullying and gay bashing happens, they respond with a nod and a wink and observe, more in ersatz sorrow than in glee, that gays bring the violence on themselves because of their \"lifestyle\". And don't try to pretend they don't.\n\n \n So now you're expecting to people prove their innocencein this (exonerating people) rather than needing proof to blame them to begin with! I'm so glad you have no control over our legal system, Lesz. It would no doubt change from innocent-till-proven-guilty to the other way around.\n \n \nWhat on earth can you possibly mean by this doubletalk? If they aren't 'totally innocent\", and they certainly aren't, then of course they carry their burden of the blame. The may not wield the weapons themselves, but they condone the climate in which the weapons are used. Even when they feel that some gay-bashing has been so outrageous they can't afford to benignly ignore it and so they issue some statement that they \"do not condone the violence\", they generally phrase it in such a way as to indicate they understand and sympathise with the motives for the violence. It's always some version of: \"It's wrong, but gays have only themselves to blame.\" And the next day, they return to their gay-hating rhetoric as if nothing had happened.\n\n \n Note I said \"should be blamed\" rather than they \"carry blame\". These subtle changes you're making to what I'm saying aren't going unnoticed. you'll probably pretend it wasn't intentional or make light of it, but I never said people didn't contribute. That's not the same as saying they should be blamed for it. The point is that it's so hard to prove. I think if you're going to start blaming people for it that didn't actually do the crime, you darn well better get some better evidence than your opinion they contributed to a culture of hate. emoticon_rolleyes", 
   {}, 
   298484, 
   null, 
   1201191120.0
  ], 
  [
   298493, 
   null, 
   "Kronus", 
   "So now you're expecting to people prove their innocencein this (exonerating people) rather than needing proof to blame them to begin with! I'm so glad you have no control over our legal system, Lesz. It would no doubt change from innocent-till-proven-guilty to the other way around.\n \n\n \n I see you need to be reminded again, but this is a debate forum! Asking you to actually commit to or comment on a position is not only acceptable, it's the whole point of the excercise! We're not deciding people's fates here, we're talking. Or at least some of us are; you seem to be doing everything in your power to avoid talking about the subject at hand. Seriously, if you don't want to talk about this, why are you posting at all?\n \n \n\n Note I said \"should be blamed\" rather than they \"carry blame\". These subtle changes you're making to what I'm saying aren't going unnoticed. \n\n And here we go with comedy option C again!", 
   {}, 
   298491, 
   null, 
   1201192380.0
  ], 
  [
   298494, 
   null, 
   "jyoshu", 
   "I see you need to be reminded again, but this is a debate forum! Asking you to actually commit to or comment on a position is not only acceptable, it's the whole point of the excercise! We're not deciding people's fates here, we're talking. Or at least some of us are; you seem to be doing everything in your power to avoid talking about the subject at hand. Seriously, if you don't want to talk about this, why are you posting at all?\n\n \n What the heck are you talking about?? I'm posting aren't I? If I didn't want to do so I wouldn't be doing so. The point I was making is that the assumption of blame without proof is a bad approach, and it is. Or even basing it on an arbitrary unstated standard of evidence that's completely undefined. How could you not agree with that? How could you possibly agree that people should be blamed when you can't even prove they're at fault? Or do you just WANT to say \"it's your fault\" with no regard to whether that SHOULD be said or not?", 
   {}, 
   298493, 
   null, 
   1201193280.0
  ], 
  [
   298499, 
   null, 
   "jim's trucking", 
   "Well, not that I want to disuade you from the notion that gays would make good parents, but as in most other things gays are just like straights when it comes to anger managment skills. Most do fine, some don't. I think the only reason that you feel that there are alot more het than homo abusers is that there are alot more het than homo couples. Plus the fact that since gays can't get married or accidently have kids, it can be a lot easier for them to split up when they realise a relationship isn't working out. Basically, there's no real reason for a gay man to be less violent than a straight man, so until some data shows otherwise I'm going to assume that they're pretty much the same. I'm afraid \"COPS\" won't cut it as a peer reviewed source. :)\nAwe, now! \"COPS\" is a perfectly good source when counting incidents by sexual orientation.\n \n I'm betting emotions and tendencies to be emotional are equally spread amongst gays and lesbians. Even puppy love is real to the puppy. \n \n \n I just haven't seen any homosexual, toothless, sweaty, drunk bums in A-line tee shirts being interrogated about who stabbed who with what and who's being thrown out of the house for fighting. It's usually the Jerry Springer type rubes of both genders that have problems with their oppositely sexed mates.\n \n If it really mattered a lot, I'd research it. It's just my gut feeling that homosexual couples involved in abuse are less numerous than heterosexual couples involved in abuse...therefore an adopted child is more likely to be treated properly under homosexual parents.", 
   {}, 
   298458, 
   null, 
   1201194000.0
  ], 
  [
   298500, 
   null, 
   "Kronus", 
   " What the heck are you talking about?? I'm posting aren't I? If I didn't want to do so I wouldn't be doing so.\n\n Of course you're posting, we can all tell you want to post. The question is why don't you want to debate the issue at hand? Merely typing does not mean you're debating. I've pointed this out before, but it clearly bears repeating. If all you want to do is post, then you should be on a blog; this site is for those who want to debate.\n \n \n\n The point I was making is that the assumption of blame without proof is a bad approach, and it is. Or even basing it on an arbitrary unstated standard of evidence that's completely undefined. How could you not agree with that? How could you possibly agree that people should be blamed when you can't even prove they're at fault? Or do you just WANT to say \"it's your fault\" with no regard to whether that SHOULD be said or not? \n\n What people want is for you to take a position so that they can see if there's any point in going on with the topic. You start a debate by finding points of difference, then you discuss them, then you worry about proof. Get that? Find point of difference, discuss, then conclusions. You won't even take the first step required for honest debate.", 
   {}, 
   298494, 
   null, 
   1201194360.0
  ], 
  [
   298501, 
   null, 
   "lesz", 
   "So now you're expecting to people prove their innocencein this (exonerating people) rather than needing proof to blame them to begin with! I'm so glad you have no control over our legal system, Lesz. It would no doubt change from innocent-till-proven-guilty to the other way around.\n\n \n I wish it were possible to charge your churches with criminal damage for the harm they do. But since they preach it in the name of religion, their mischief is constitutionally protected. You won't even hold them responsible for their share of the burden of guilt -- you just pretend it doesn't exist!\n \n \nNote I said \"should be blamed\" rather than they \"carry blame\".\n\n \n What is that supposed to mean? Are you practicing to become a Jesuit in your sophistry? No-one suggests that they and they alone are guilty of this. They carry their share of guilt.\n \n \nThese subtle changes you're making to what I'm saying aren't going unnoticed. you'll probably pretend it wasn't intentional or make light of it, but I never said people didn't contribute. That's not the same as saying they should be blamed for it. The point is that it's so hard to prove. I think if you're going to start blaming people for it that didn't actually do the crime, you darn well better get some better evidence than your opinion they contributed to a culture of hate. emoticon_rolleyes\n\n \n If they knowingly and willingly \"contribute to it\", then yes, my dear fellow, they are guilty for their own part in it, and should be blamed for it. Your byzantine efforts to exculpate them are breathtaking in their disingenuous insouciance, but they aren't remotely credible. You only person you are impressing is you.\n \n When Christian preachers scream from their pulpits that god will punish the wicked, and they say gays are wicked, and then they shrug their shoulders and ask, \"Well, what did they expect?\" when gays are attacked, well, all one can conclude is that they are knowingly and deliberately contributing to a climate of hatred, and refusing to take responsibility for their teachings.\n \n Obviously you are desperate to absolve them of this sin, but I accuse them.", 
   {}, 
   298491, 
   null, 
   1201194480.0
  ], 
  [
   298502, 
   null, 
   "Kronus", 
   " \n If it really mattered a lot, I'd research it. It's just my gut feeling that homosexual couples involved in abuse are less numerous than heterosexual couples involved in abuse...therefore an adopted child is more likely to be treated properly under homosexual parents.\n\n \n I suspect I know more gay couples then you (just a hunch) and for what it's worth a couple were somewhat abusive. Not up to the level of stabbings, but then I don't know any straight couples that have involved stabbings either. \n \n You have piqued my curiosity though. Maybe I'll do said research and see if I can find any hard data.", 
   {}, 
   298499, 
   null, 
   1201194660.0
  ], 
  [
   298503, 
   null, 
   "lesz", 
   "It's just my gut feeling that homosexual couples involved in abuse are less numerous than heterosexual couples involved in abuse...therefore an adopted child is more likely to be treated properly under homosexual parents.\n\n \n Far be it from me to argue that gays make better parents in principle than straights. Still, one thing worth pointing out in general is that every adopted child is a wanted one: prospective adoptive parents jump through far many more hoops to achieve this status than parents in the usual way. And gay couples cannot be natural parents together, except the family they are raising might be the natural children of one or other, or of both through previous relationships. If natural parents had to go through the same grueling evaluation as adoptive parents before being allowed to be parents, it is likely that child abuse would be considerably reduced, and far fewer children would need adoption in the first place.\n \n But this isn't anything to do with gays vs. straights. It's to do with what makes a good parent, and this has nothing to do with sexual orientation. It's just too easy for straights to make babies accidentally, then be unwillingly forced to take care of them. At least gays risk nothing of that sort when they express their love sexually.", 
   {}, 
   298499, 
   null, 
   1201195140.0
  ], 
  [
   298504, 
   null, 
   "jyoshu", 
   "What people want is for you to take a position so that they can see if there's any point in going on with the topic. \n\n \n I have. My position is that people shouldn't be blamed for contributing to this so-called culture of hate with so little proof and arbitrary evidence, and that blame should be focused on those doing the actual bullying. I don't see how you can possibly have missed it, as I've asserted such point more than once now. Whether or not you want to \"go on with the topic\" is up to you--do what you want. And by the way, just to correct you on one other thing, it's YOU who is saying this, no one else. I see nothing to indicate that anyone else here other than you has failed to read the point I'm making. (Though it's certainly possible you're really just choosing to ignore it.) Now then, I've RE-stated my position that you indicate I haven't made. Did you read it? Just making sure, in case you pull the 'ol you-need-to-take-a-position tactic yet again.", 
   {}, 
   298500, 
   null, 
   1201195140.0
  ], 
  [
   298505, 
   null, 
   "jim's trucking", 
   "bolding mine:\n \nI suspect I know more gay couples than you (just a hunch) and for what it's worth a couple were somewhat abusive. Not up to the level of stabbings, but then I don't know any straight couples that have involved stabbings either. \n \n You have piqued my curiosity though. Maybe I'll do said research and see if I can find any hard data.\nI have no doubt that gay couples fight within themselves...just like heteros. I just see less evidence of it...in general.\n \n I don't know any couples that have been involved in stabbings either, but I see a lot of that mentality exhibited on the expo shows like JS, MP, and others when I do take time to watch them.\n \n I'm not sure how this connects to adoptions though because NONE of these specimens would ever be seriously considered by a sane adoption service. It's just useful in arguing that homosexual couples APPEAR to be less inclined to batter, therefore less inclined to misguide an adopted child.\n \n I too have almost worked up the initiative to research this topic. I'm wondering if my gut feelings will be backed by the evidence. I'm wondering where to find some unbiased sources.", 
   {}, 
   298502, 
   null, 
   1201195500.0
  ], 
  [
   298506, 
   null, 
   "Kronus", 
   "Found a good paper:\n \n http://www.eurowrc.org/06.contributions/1.contrib_en/34.contrib.en.htm\n \n It states that domestic violence is a very real problem in the gay community, and goes into why that might be and why it's underreported. It specifically does not examine the lesbian community. But it seems that a gay couple is at least as likely as a het couple to experience domestic violence.", 
   {}, 
   298502, 
   null, 
   1201195500.0
  ], 
  [
   298508, 
   null, 
   "Kronus", 
   "I have. My position is that people shouldn't be blamed for contributing to this so-called culture of hate with so little proof and arbitrary evidence, and that blame should be focused on those doing the actual bullying.\n\n \n So your \"position\" is that you don't want to discuss the topic or examine the issues. And you won't contribute anything meaningful to the discussion until everyone else does all the work. In other words, no debate out of you.", 
   {}, 
   298504, 
   null, 
   1201195860.0
  ], 
  [
   298509, 
   null, 
   "lesz", 
   "I suspect I know more gay couples then you (just a hunch) and for what it's worth a couple were somewhat abusive. Not up to the level of stabbings, but then I don't know any straight couples that have involved stabbings either. \n \n You have piqued my curiosity though. Maybe I'll do said research and see if I can find any hard data.\n\n \n I suspect that there will be little, if any, hard data on the performance of gay vs. straight adoptive families. Most studies I recall, and they've all been limited in scope, found little difference, and one found that children of gay parents had slightly better attitudes than those of straights, but it was probably just either a statistical fluke, or an artefact of what the researchers thought was important. Children of gay parents do seem to be somewhat more tolerant of diversity and difference in others, and perhaps sexually more adventurous, but otherwise, not much difference.\n \n A good place to start looking would probably be COLAGE -- Children of Lesbians and Gays Everywhere. This isn't specifically about adoption, of course, as many gays and lesbians have natural children and are involved in raising them. \n \n My own experience of gay relationships is that they aren't that much different in terms of emotional stability from straight ones. Some gay couples work well together, others are real horrorshows. Some oscillate between extremes, and there's not much difference there between them and the straight world. I'd be surprised if gays were intrinsically superior to straights in child rearing, but it could be that gays tend to self-select into child-rearing and non-child-rearing lifestyles. Those who would be good at raising kids are probably more likely to go for it (e.g. the Ohioprofs of the world); those who aren't have every opportunity to avoid it (e.g. me!) -- provided they are openly gay and integrated into their local gay community. Straights do not always have the same choices here as gays, and may end up with families they didn't really anticipate or want.", 
   {}, 
   298502, 
   null, 
   1201196160.0
  ], 
  [
   298510, 
   null, 
   "jyoshu", 
   "I wish it were possible to charge your churches with criminal damage for the harm they do. But since they preach it in the name of religion, their mischief is constitutionally protected. You won't even hold them responsible for their share of the burden of guilt -- you just pretend it doesn't exist! What is that supposed to mean? Are you practicing to become a Jesuit in your sophistry? No-one suggests that they and they alone are guilty of this. They carry their share of guilt. If they knowingly and willingly \"contribute to it\", then yes, my dear fellow, they are guilty for their own part in it, and should be blamed for it. Your byzantine efforts to exculpate them are breathtaking in their disingenuous insouciance, but they aren't remotely credible. You only person you are impressing is you. When Christian preachers scream from their pulpits that god will punish the wicked, and they say gays are wicked, and then they shrug their shoulders and ask, \"Well, what did they expect?\" when gays are attacked, well, all one can conclude is that they are knowingly and deliberately contributing to a climate of hatred, and refusing to take responsibility for their teachings. Obviously you are desperate to absolve them of this sin, but I accuse them.\n\n \n No, see it's just not that simple. Where is the causality? Show how action A CAUSED action B. Then you have a case. Otherwise, it's speculation. You've now even made it clear you'd criminally charge people on such speculative basis. I have YET to see you show such causality. I think this is a very fundamental problem for a number of reasons. Blame is a powerful and important thing. You shouldn't just throw it around recklessly without qualifying it. All bullying is bad. Surely we agree on that. I think we even agree that culture should work toward educating itself and stop a culture of hate toward any group. but you'd take it a step farther and blame people for the suffering of gays when they really didn't have a hand in it. They're just speaking their religious views; that's part of it. You might as well be arguing religious people shouldn't ever utter a word about divorce because it might indirectly influence people out there to look down on divorcees. Or any number of issues. The responsibility to avoid bullying others lies with the bully. It lies with the person and whether or not they will let something like religious teaching fuel their OWN hatred THAT'S ALREADY THERE. Now .... if a preacher told his congregation to go out and bully gay people, that would be a completely different story. On that I would wholeheartedly agree with you. But that's not what we're talking about. Your position is clearly that you think even ANY religious view about homosexual relationships being against what God wants is tantamount to blame over someone getting bullied. Sorry, I can't go that far. It's ultimately nothing more than lashing out blindly--an unfounded excuse to oppose a religious teaching you hate. Maybe your hate of that teaching is justified, but for goodness' sake, don't connect dots that aren't even necessarily there to do so. If all religious teaching about gays suddenly ceased, I have no doubt there would still be people out there who hate gays. There are people who hate gays who aren't religious at all. I know some people like that, unfortunately. I know someone who hates both gays AND religious people. She despises religion. IMO, you put too much stock and hedge your bet far too much on religion being the problem here. For whatever your personal reasons, you've clearly sworn it your enemy, but if you were to vanquish it as you'd probably like to do, hatred toward gays would still go on. Hatred toward any number of groups would still go on. Hatred exists outside of religion, and it exists among some people IN religion. It's not religion itself. People bully gays and others over the fact they are different because some people have an unfortunate tendency to hate what is different than them. Maybe it's some fear; maybe it's just meanness. But blaming religion and it's preachers who don't call for such bullying at all for the hate of others is a wrong-headed approach. It's an oversimplification.", 
   {}, 
   298501, 
   null, 
   1201196640.0
  ], 
  [
   298511, 
   null, 
   "lesz", 
   "My position is that people shouldn't be blamed for contributing to this so-called culture of hate with so little proof and arbitrary evidence, and that blame should be focused on those doing the actual bullying.\n\n \n Just another version of the \"guns don't kill people\" argument. Unless one can prove that Christian anti-gay rhetoric led directly to each act of bullying and anti-gay violence, we can apparently absolve Christian pastors of all wrong doing. That may be fine for a court of law trying individual cases of mayhem, for which one must find the direct perpetrator, but as sociological science dealing with social attitudes and average behaviour, it sucks. Individuals do not usually act in a social vacuum, though it is not usually practical to structure law in any other way.\n \n The fact remains that Christian anti-gay rhetoric, with which these boards and society in general are sickeningly stuffed, set the scene. That individual actors then act in response to the set they find themselves on is hardly irrelevant when dealing with motivation, and trying to understand why some acts are committed as opposed to others. Hatred is a significant motive, and anything that promotes hatred, such as Christian anti-gay preaching, just adds fuel. But only a determined Christian apologist would try to exonerate Christianity of all blame in the matter.", 
   {}, 
   298504, 
   null, 
   1201196880.0
  ], 
  [
   298512, 
   null, 
   "lesz", 
   "Your position is clearly that you think even ANY religious view about homosexual relationships being against what God wants is tantamount to blame over someone getting bullied.\n\n \n Yep. It's definitely a contributing factor, and for that, it deserves to carry its share of the blame. That doesn't exonerate individual perps, nor is it an argument that all bullying has anti-gay motives, but yes, I accuse Christian churches of fomenting a homophobic environment through their extremist preaching against gay human beings. Not all of them, but a lot of them, starting with the Roman Catholics and fundamentalist Protestants, on down.", 
   {}, 
   298510, 
   null, 
   1201197180.0
  ], 
  [
   298513, 
   null, 
   "lesz", 
   "It's not religion itself. People bully gays and others over the fact they are different because some people have an unfortunate tendency to hate what is different than them. Maybe it's some fear; maybe it's just meanness. But blaming religion and it's preachers who don't call for such bullying at all for the hate of others is a wrong-headed approach. It's an oversimplification.\n\n \n Yes, it is religion. Not all of religion, but a significant part of it. Not all religions or religious believers are flaming homophobes, but few are welcoming and accepting of gays. The rest have to carry their burden of responsibility for a climate that encourages persecution of gay people.\n \n I am not oversimplifying, because I do not think all Christians or Christian denominations are bad in this respect. But huge swathes of Christianity are that bad. The pope, for example, decided to blame the sexual perversions of his priesthood on gays, rather than the intrinsic unhealthiness of the system. That is gay-bashing by the leader of a billion Christians. Not all that billion agree with Herr Ratzinger, of course, but he defines Catholic Christianity, not they.\n \n Of course, Herr Ratzinger is not the only Christian leader at fault. And there are a handful of Christian leaders who aren't at fault. But the main voices of Christianity are homophobic. They help create the climate against which anti-gay violence operates. I can't forgive them till they show responsibility and penance.", 
   {}, 
   298510, 
   null, 
   1201197660.0
  ], 
  [
   298515, 
   null, 
   "jyoshu", 
   "Just another version of the \"guns don't kill people\" argument.\n\n \n There's nothing wrong with that argument, on either issue. In fact, you've left off the more important part--that \"People kill people.\" The difference is one of focus, not a complete shift altogether.", 
   {}, 
   298511, 
   null, 
   1201198260.0
  ], 
  [
   298519, 
   null, 
   "lesz", 
   "There's nothing wrong with that argument, on either issue. In fact, you've left off the more important part--that \"People kill people.\" The difference is one of focus, not a complete shift altogether.\n\n \n You forget to ask why do people kill people so easily. It's because guns are so readily available. Britain, for example, has a vastly lower rate of gun deaths than the US, but a higher incidence of general, lower grade violence. Guns make it easier to kill people, i.e. escalate violence to lethal levels.\n \n It may be something is the same in the climate Christian pastors try to stir up against gays. It doesn't provoke individual attacks directly, but it does make it easier for them to take place, and then it broadly exonerates the perps, to make them feel they have been doing god's will.\n \n Again, not all Christians are responsible for this, but far too many are.", 
   {}, 
   298515, 
   null, 
   1201199460.0
  ], 
  [
   298523, 
   null, 
   "jyoshu", 
   "You forget to ask why do people kill people so easily. It's because guns are so readily available. Britain, for example, has a vastly lower rate of gun deaths than the US, but a higher incidence of general, lower grade violence. Guns make it easier to kill people, i.e. escalate violence to lethal levels.\n\n \n The point though, is that it's the person's fault for letting the gun make them want to kill, in the first place. Not the gun's fault. It's misplaced blame. If the person didn't want to kill in the first place, it wouldn't be an issue. The same applies in the case we're talking about too. There'sa huge disconnect between the teaching that gay relationships are immoral and going out and hurting gay people. People should be capable to hear the first without doing the second. If they aren't then something is seriously wrong with them, and it's their fault for doing so.", 
   {}, 
   298519, 
   null, 
   1201201260.0
  ], 
  [
   298524, 
   null, 
   "Kronus", 
   " I suspect that there will be little, if any, hard data on the performance of gay vs. straight adoptive families. \n\n It's clearly an area that could stand more research. But, just for the record, what Jim and I are talking about here is domestic violence in general, and not specific to adoptive families. Except in that violent families should, of course, not be allowed to adopt.\n \n \n\n I'd be surprised if gays were intrinsically superior to straights in child rearing, but it could be that gays tend to self-select into child-rearing and non-child-rearing lifestyles. Those who would be good at raising kids are probably more likely to go for it (e.g. the Ohioprofs of the world); those who aren't have every opportunity to avoid it (e.g. me!)\n\n Now that is a very interesting point. If you really want an apples to apples comparison one really shouldn't just compate gay to straight parents, it ought to be adoptive gay to adoptive straight. You should be looking at those who really had to work to get their kids, as opposed to those for whom having kids was easy, or perhaps even an accident.", 
   {}, 
   298509, 
   null, 
   1201201380.0
  ], 
  [
   298525, 
   null, 
   "foundit66", 
   "What??? Do my ears (or rather eyes) deceive me??? You're actually making a reseached attempt to qualify your position, and explain how it might bring about causality! Now we're getting somewhere. See, that wasn't so difficult, now what it? emoticon_xgood I'll review the link further.\n\n \n Quite frankly, you have no room to be snide.\n None at all.\n 1) You have avoided too many issues.\n 2) You have avoided too many questions.\n 3) This type of research HAS been posted in the past.\n \n Quite frankly, you talk about \"we're getting somewhere\", but in reality there is a LONG list of things that \"we\" have tried to get YOU to move forward on that you have obfuscated and changed the subject on that you're in a glass house trying to throw stones...", 
   {}, 
   298468, 
   null, 
   1201202280.0
  ], 
  [
   298528, 
   null, 
   "Kronus", 
   "Quite frankly, you have no room to be snide.\n None at all.\n 1) You have avoided too many issues.\n 2) You have avoided too many questions.\n 3) This type of research HAS been posted in the past.\n \n Quite frankly, you talk about \"we're getting somewhere\", but in reality there is a LONG list of things that \"we\" have tried to get YOU to move forward on that you have obfuscated and changed the subject on that you're in a glass house trying to throw stones...\n\n \n Not to mention how often he condemns personal attacks. Apparently only ones directed at him are bad, attacks from him are just fine. :xbanghead", 
   {}, 
   298525, 
   null, 
   1201202820.0
  ], 
  [
   298533, 
   null, 
   "foundit66", 
   "Tell you what .. you answer mine with specifics (without something vague like \"condemnation of gays\" which could be virtually anything and can be eye-of-the-beholder type stuff) and I'll answer yours. I'll even go first, at the risk of you not answering. Fair enough?\n\n The arrogance at pretending that there is a \"risk\" at me not answering, when there is a LONG list of questions that you have repeatedly refused to address.\n You FINALLY get around to answering one, and you want to pretend that it's me that has a risk for avoidance.\n \n No matter.\n Others can see your actions as well, and it just goes to confirm your general \"standing\" on this board...\n \n \n \nSpecific Answer: To get blame from me, he would have to rise above just merely saying he felt gay relations were wrong, to actually condemning gays in a direct way. Things like saying \"gays are evil\" or \"gays are hell-bound\". Saying things like \"I think gay sex is immoral would NOT count for causality and therefore blame, IMO. And even with the things I mentioned that ARE, I'd feel much better if even in those cases causality were actually proven and this guilty-till-proven innocent approach were dropped in terms of blame, for an innocent-till-proven guilty one.\n\n Yeah.\n \"Innocent-till-proven guilty\" just like O.J.\n \n I pointed it out earlier and I'll point it out again. THIS is the approach used by \"some\" when:\n 1) They have no counter evidence, or even a substantiatable counter-argument for that matter.\n 2) They can't really broach the evidence shown against their position.\n 3) Even arguing their position for any length of time will give them problems, so they simply lather, rinse, repeat their way around demanding \"proof\" when the real issue is an issue of which side is more believable.\n \n Note, it's already been established that NONE of this is talking about a LEGAL application of \"blame\", but rather just personal opinion assessments of \"blame\".\n And one has to wonder where these standards of \"innocent-till-proven guilty\" are when somebody starts blaming the gays for ridiculous junk...\n \n But moving on, what is \"morality\" but an establishment of \"right and wrong\".\n You talk about \"gays are evil\" being worthy of \"blame\", but announcements on \"morality\" are not?\n To borrow your tactics, where do you draw the line?\n What level of \"morality\" establishes too much to you?\n \"Immoral\" is okay, but \"evil\" is not?\n \n Quite frankly, if somebody wants to announce in their own church, to people who choose to go to church, that homosexuality is \"immoral\", that's their perogative.\n But when they get on national TV to make their announcement, the effect is dramatically different. When they go to \"gay events\" to broadcast with a bullhorn to gays around that \"homosexuality is immoral\", that is dramatically different.\n Both are clearly going beyond personal opinion, to active condemnation. To an active \"attack\" on gays, to denigrate them and create dissonance within gays.\n \n So why the heck shouldn't they get \"credit\" when they achieve that dissonance?\n \n \n \nI certainly question that it's given MORE volume.\n\n Of course you do...\n I can point to documented multi-million dollar budgets used to fight against gays.\n Can you do the same for divorce? Judaism? Working on Sunday?\n If I were to pick up a paper and see the \"top topics\" for Christians in this election, would any of those even be on the list?\n Would you \"question\" whether or not \"homosexuality\" would be on that list?\n \n You're denying the obvious.\n \n \n \nIroncially (given this debate today), I was at church tonight ...\n\n Quite frankly, talking about ONE churches activity is a bit like trying to pronounce a judgement of \"cleanlineness\" of a pig sty by using a microscope in one spot that is specifically selected...\n I have no problem acknowledging that some churches do not raise the issue disproportionately.\n My point is that the OVERALL RELIGIOUS ACTIVISM CLIMATE shows a heightened focus on gay issues, and not so much on other religions, divorce, working on sundays, ...\n \n \n \nIt seems us Christians aren't always so evil after all, huh? :)\n\n If you can find any quote from me about Christians \"always\" being evil, then show it.\n Otherwise, quit with the strawman responses...", 
   {}, 
   298469, 
   null, 
   1201203600.0
  ], 
  [
   298535, 
   null, 
   "foundit66", 
   "And jyoshu...\n Don't think I didn't notice how you dropped addressing YOUR CLAIM that discussing \"blame\" for harm to gays was \"rife with problems\" (your words), while you insisted that similar words had no \"blame\" for gays.\n Quite frankly, I think you finally realized the double-standard you were creating in trying to allege that a discussion on \"blame\" would be problematic, while refusing to admit how similar discussions against gays should have no blame...\n \n Not to say that's the only thing you dropped, but it was a rather poignant error on your part...", 
   {}, 
   298509, 
   null, 
   1201204200.0
  ], 
  [
   298555, 
   null, 
   "jyoshu", 
   "The arrogance at pretending that there is a \"risk\" at me not answering, when there is a LONG list of questions that you have repeatedly refused to address.\n You FINALLY get around to answering one, and you want to pretend that it's me that has a risk for avoidance.\n\n \n Foundit, reading through your posts, questions are everywhere. I'm sorry, but I just don't have time to compose you a compendium here. Your strategy has always been one of question bombardment, and then criticism for not answering every little question. If you'll narrow all your questions down to a few that are most important to you, I'll answer them as best I can.\n \n \nYeah.\n \"Innocent-till-proven guilty\" just like O.J.\n \n I pointed it out earlier and I'll point it out again. THIS is the approach used by \"some\" when:\n 1) They have no counter evidence, or even a substantiatable counter-argument for that matter.\n 2) They can't really broach the evidence shown against their position.\n 3) Even arguing their position for any length of time will give them problems, so they simply lather, rinse, repeat their way around demanding \"proof\" when the real issue is an issue of which side is more believable.\n \n Note, it's already been established that NONE of this is talking about a LEGAL application of \"blame\", but rather just personal opinion assessments of \"blame\".\n\n \n This is ridiculous. Why should we throw out the concept of innocent-till-proven guilty just because it's not specifically a LEGAL matter we're talking about? I find it odd that you'd suddenly WANT to take a guilty-till-proven innocent approach in terms of assigning blame under ANY circumstances, legal or NOT. The fact it's not a legal issue we're talking about is an awfully poor excuse for such an approach.\n \n \nBut moving on, what is \"morality\" but an establishment of \"right and wrong\".\n You talk about \"gays are evil\" being worthy of \"blame\", but announcements on \"morality\" are not?\n To borrow your tactics, where do you draw the line?\n What level of \"morality\" establishes too much to you?\n \"Immoral\" is okay, but \"evil\" is not?\n\n \n See, there's 4 questions right there. Like I said narrow things down more, and I'll answer what's most important to you.\n \n \nQuite frankly, if somebody wants to announce in their own church, to people who choose to go to church, that homosexuality is \"immoral\", that's their perogative.\n But when they get on national TV to make their announcement, the effect is dramatically different. When they go to \"gay events\" to broadcast with a bullhorn to gays around that \"homosexuality is immoral\", that is dramatically different.\n Both are clearly going beyond personal opinion, to active condemnation. To an active \"attack\" on gays, to denigrate them and create dissonance within gays.\n\n \n So, is television or 'bullhorn' cases the line that determines what makes it a blameable matter, then? \n \n \nCan you do the same for divorce? Judaism? Working on Sunday?\n If I were to pick up a paper and see the \"top topics\" for Christians in this election, would any of those even be on the list?\n Would you \"question\" whether or not \"homosexuality\" would be on that list?\n\n \n 1,2,3,4,5 more questions. More of your bombardment/accuse-of-ignoring strategy I suppose. In this one post alone, you posited 9 or 10 questions, then start on your complaints about not getting questions answered. I think I've seen you take the same strategy with other posters as well. Have you ever considered that maybe the problem is that you need to be just a bit more concise???? emoticon_rolleyes \n \n \nMy point is that the OVERALL RELIGIOUS ACTIVISM CLIMATE shows a heightened focus on gay issues, and not so much on other religions, divorce, working on sundays, ...\n\n \n Alright, I can better agree with 'religious activism'.", 
   {}, 
   298533, 
   null, 
   1201216560.0
  ], 
  [
   298566, 
   null, 
   "foundit66", 
   "Foundit, reading through your posts, questions are everywhere. I'm sorry, but I just don't have time to compose you a compendium here. Your strategy has always been one of question bombardment, and then criticism for not answering every little question.\n\n That's a blatant misrepresentation.\n Post #64. I had ONE sentence, with ONE question.\n You ignored it.\n http://www.4forums.com/political/showpost.php?p=298423&postcount=64\n \n Since then, I have repeatedly stressed that I would like an answer to that ONE question, which you continue to ignore.\n \n The truth of the matter is that you complain about \"question bombardment\" as an excuse to avoid answering virtually ANY question you don't like.\n Furthermore, a LOT of the questions simply revolve around getting you to SUBSTANTIATE your claims.\n Quite frankly, that shouldn't be much of an imposition on you unless you're just pulling things out your nether region.\n \n It's just a furtherment of what I thought was your own philosophy...\n \"If you are going to make that accusation, you need to pony up and prove it.\"\n ***Jyoshu\n \"Well since you didn't address my points, I'll assume you're done! A simple \"ok, I concede that ... and moving on back to the issues ...\"\n ***Jyoshu\n \n \n \nIf you'll narrow all your questions down to a few that are most important to you, I'll answer them as best I can.\n\n How about ONE question in this post.\n Respond to the question in Post #64, linked above.\n \n \n \nThis is ridiculous. Why should we throw out the concept of innocent-till-proven guilty just because it's not specifically a LEGAL matter we're talking about?\n\n Because it's unrealistic OUTSIDE the court room.\n Most people follow a PERSONAL philosophy whereby they are allowed to form an opinion on guilt without a requirement for \"proof\".\n In real life, people work off their own judgment, based on EVIDENCE.\n \n What the REAL issue here is that you want it PROVEN guilty, so you can ignore the EVIDENCE pointing towards guilt.\n Such a standard allows people like you to sit back and pooh-pooh the evidence shown, and argue that it's not sufficient enough to \"prove\" the claim.\n \n When in real life, it comes down to something simple.\n If you're presented with two conflicting ideas, and one has EVIDENCE while the other can't even muster up a decent counter-argument, much less any evidence, then the former is supported.\n \n Coming from a \"religious\" stance, I would have thought you could understand the capability to form an opinion on something without proof.\n Your religion would crumble under the standards by which you want to impose here...\n \n \n \nSee, there's 4 questions right there. Like I said narrow things down more, and I'll answer what's most important to you.\n\n And to prove my point, you answered NONE of them.\n You cried and you whined about \"drawing a line\", but when YOU are asked to elaborate on YOUR line, you completely ignored the issue.\n \n Furthermore, those are all questions on ONE ISSUE. All driving at the SAME singular ideal, with a variety of \"pointed\" questions to achieve that goal. Pointing out different angles on the one issue.\n \n I can simply eliminate your mundane whining by rephrasing the argument posed, and I'm betting you'll still ignore it, won't you...\n \n \"Morality\" is an establishment of \"right and wrong\".\n You talk about \"gays are evil\" being worthy of \"blame\", but announcements on \"morality\" are simply a lesser assessment of \"evil\". A lesser level of \"bad\".\n I would ask you to show how you differentiate, but we both know you won't answer.\n \"Immoral\" is okay, but \"evil\" is not in your opinion. But unfortunately you refuse to admit it's just a lesser shade of the same grey...\n \n \n \nSo, is television or 'bullhorn' cases the line that determines what makes it a blameable matter, then? \n\n It is EXTERNALIZING the issue onto others which makes it an issue of \"blame\".\n If a group of straight christians want to get together and talk about how THEY (within that group) shouldn't be gay, go for it. No blame.\n But when they take that message and TRY TO APPLY IT TO OTHERS, that is when they create the pressure that arrives at the problems already discussed.\n THAT is where the \"blame\" comes in.\n \n \n \n1,2,3,4,5 more questions.\n\n I often talk in \"rhetoricals\" to make my point.\n Evidently, you are relishing the idea of COMPLETELY AVOIDING the point by incessantly whining about the fact that there is a question mark afterwards.\n Somehow, it appears you think that avoiding an argument with a \"question mark\" after it is somehow more noble than avoiding an argument with a \"period\" after it.\n Cause in reality, it's not \"questions\" you're avoiding but rather the ISSUES BEHIND the questions you are avoiding, simply because they are questions...\n \n Again, I'll just reframe the argument you are refusing to broach in the form of sentences.\n You can ignore them if you like, but that will just drive my point home even farther.\n \n I can point to documented multi-million dollar budgets used to fight against gays.\n You can't do the same for divorce.\n You can't do the same for Judaism.\n You can't do the same for a campaign against working on Sundays.\n You can't show any serious poll showing these as \"hot topics\" for Christians in this election. Those other issues aren't even on the list.\n \n \n \nHave you ever considered that maybe the problem is that you need to be just a bit more concise???? emoticon_rolleyes \n\n Quite frankly, if YOU were \"more concise\" I wouldn't have those questions or arguments...\n If YOU were to actually ADDRESS the issues raised in a concise manner instead of belly-aching about \"questions\", we wouldn't have this discussion.\n \n \n \nAlright, I can better agree with 'religious activism'.\n\n And as I pointed out, that's my whole point with regards to \"blame\".\n INTERNALIZING the religious belief, not trying to enforce it, does not cause problems.\n EXTERNALIZING the religious belief and imposing on others to follow is what causes the problem.\n If you (and others) were to keep your religion to yourself as you want homosexuals to keep their homosexuality to themselves, this wouldn't be a problem.\n \n ===========================\n \n As a side-note, it looks like I've got ONE question for Jyoshu in this post.\n I'm tempted to take bets as to whether he will ignore it...", 
   {}, 
   298555, 
   null, 
   1201221720.0
  ], 
  [
   298571, 
   null, 
   "Kronus", 
   "That's a blatant misrepresentation.\n\n \n In case you missed that Jyoshu, he's calling you a liar. emoticon_xbye", 
   {}, 
   298566, 
   null, 
   1201225380.0
  ], 
  [
   298573, 
   null, 
   "jyoshu", 
   "That's a blatant misrepresentation.\n Post #64. I had ONE sentence, with ONE question.\n You ignored it.\n http://www.4forums.com/political/showpost.php?p=298423&postcount=64\n \n Since then, I have repeatedly stressed that I would like an answer to that ONE question, which you continue to ignore.\n \n How about ONE question in this post.\n Respond to the question in Post #64, linked above.\n\n \n Ok ...\n \nCan you explain a situation where somebody is \"not totally innocent\", yet they have no \"blame\" that can be attached to them?\nNo. but I think there's a difference between saying someone \"has blame attached to them\" (basically saying they are 'blameable') and actively blaming them. I'm saying the action of blaming them is not a good approach. That's been my point. So I don't think the question really speaks to my point at all.\n \n \nBecause it's unrealistic OUTSIDE the court room.\n Most people follow a PERSONAL philosophy whereby they are allowed to form an opinion on guilt without a requirement for \"proof\".\n In real life, people work off their own judgment, based on EVIDENCE.\n\n \n Alright, so what amount or degree of evidence does it take to cross the line into you blaming them? And if you are going to say it depends on the specific action rather than degree, then what specific action(s) suffice?\n \n \n\"Morality\" is an establishment of \"right and wrong\".\n You talk about \"gays are evil\" being worthy of \"blame\", but announcements on \"morality\" are simply a lesser assessment of \"evil\". A lesser level of \"bad\".\n I would ask you to show how you differentiate, but we both know you won't answer.\n \"Immoral\" is okay, but \"evil\" is not in your opinion. But unfortunately you refuse to admit it's just a lesser shade of the same grey...\n\n \n I have not said gays are evil at all and would love for you to show me where I have. If I've said they were to be blamed for something, it was probably the context of gay rights activism, not gays in general. At any rate, I understand, of course, what you're saying here. Nevertheless it doesn't change the fact that I think the strategy of blaming people other than bullies for the bullying is problematic. Your point may speak to other issues, but other issues they are.\n \n \nI often talk in \"rhetoricals\" to make my point.\n\n \n Well ... that may be, but it's not like you've exactly pointed out in the course of conversation which questions out of all the ones you ask are (specifically) the ones you're expecting to be answered and which ones are not. Now that you're saying some are rhetorical, that's fine, but you have to understand that what I see are lots and lots of questions--then criticism over not answering questions. Do people who are responding to you need to figure out which ones are the ones you want answered on their own, or will you make that clear?\n \n \nI can point to documented multi-million dollar budgets used to fight against gays.\n You can't do the same for divorce.\n You can't do the same for Judaism.\n You can't do the same for a campaign against working on Sundays.\n You can't show any serious poll showing these as \"hot topics\" for Christians in this election. Those other issues aren't even on the list.\n\n \n That's true, there is more of a movement of ACTIVISM against homosexuality, which is why I said I can better accept that. But in terms of everyday churches and people in the pews, I don't think it's the case.\n \n \nAs a side-note, it looks like I've got ONE question for Jyoshu in this post.\n I'm tempted to take bets as to whether he will ignore it...\n\n \n Well, if you did, you probably lost your bet.", 
   {}, 
   298566, 
   null, 
   1201230060.0
  ], 
  [
   298576, 
   null, 
   "vickycupcake", 
   "God says in the bible that he made man and woman to be together anyways and what is also said is that homosexuals would be stoned to death as well as women and men commiting adultery. what's going on is many people claim gay adoptees assault their adopted kids. i don't know that for a fact but it is said over and over again to me\n emoticon_xbouncer", 
   {
    "post_info": {
     "post_title": "God's message"
    }
   }, 
   298573, 
   null, 
   1201233660.0
  ], 
  [
   298577, 
   null, 
   "smiley", 
   "God says in the bible that he made man and woman to be together anyways and what is also said is that homosexuals would be stoned to death as well as women and men commiting adultery. what's going on is many people claim gay adoptees assault their adopted kids. i don't know that for a fact but it is said over and over again to me\n emoticon_xbouncer\n\n \n It certainly isn't true, at least generally speaking, that gay adoptive parents go on to assault their children. There are plenty of studies (that have been cited throughout this thread) that show that gay parents are no more or less good parents than heterosexual ones.\n \n This claim that children need a mother and a father is ridiculous. If it were so, then we should be taking children away from single parents, whether their 'singleness' has been caused by:\n \n a) choice to remain single.\n b) divorce (being at fault or not).\n c) separation.\n d) death of spouse.\n \n Don't worry, this is also a ridiculous suggestion, but it is a natural conclusion of the above ridiculous claim.\n \n Smiley", 
   {}, 
   298576, 
   null, 
   1201234560.0
  ], 
  [
   298586, 
   null, 
   "electrolyte", 
   "God says ... that homosexuals would be stoned to death\n\n So do you stone any homosexual you run across?", 
   {}, 
   298576, 
   null, 
   1201240800.0
  ], 
  [
   298600, 
   null, 
   "obvious_child", 
   "God says in the bible that he made man and woman to be together anyways\n\n \n And the holy book of the Invisible Pink Unicorn says that gender is largely an artificial construct of mankind which goes against the teachings of her Holy Invisible-ness. Prove your book is more correct then mine.\n \n \nand what is also said is that homosexuals would be stoned to death as well as women and men commiting adultery.\n\n \n So Ronald Reagan should have been stoned to death? Kennedy as well?\n \n \nwhat's going on is many people claim gay adoptees assault their adopted kids. i don't know that for a fact but it is said over and over again to me\n emoticon_xbouncer\n\n \n Doesn't make it true. It is however a fact that you are more likely to be killed by someone you love then by a stranger. Guess we shouldn't get married or have kids!", 
   {}, 
   298576, 
   null, 
   1201243200.0
  ], 
  [
   298613, 
   null, 
   "lesz", 
   "The point though, is that it's the person's fault for letting the gun make them want to kill, in the first place. Not the gun's fault. It's misplaced blame. If the person didn't want to kill in the first place, it wouldn't be an issue. The same applies in the case we're talking about too. There'sa huge disconnect between the teaching that gay relationships are immoral and going out and hurting gay people. People should be capable to hear the first without doing the second. If they aren't then something is seriously wrong with them, and it's their fault for doing so.\n\n \n This isn't about absolving the guy who pulls the trigger or wields the baseball bat of all responsibility. It's an issue of why he finds it reasonable and easy to perform his deeds. People do not live or operate in moral vacuums, they reflect the culture they live in, and in aggregate, they create the culture they live in.\n \n There is emphatically NOT a \"huge disconnect between the teaching that gay relationships are immoral and going out and hurting gay people\". There is, in fact, excellent scientific and historical reason to associate the two. And don't think you can get away with merely intoning the old truism that correlation is not causation: in human behaviour, you have to take feedback effects into account. When positive feedback operates, correlation becomes causation. If you ask yourself which is the chicken and which the egg here, you really fail to understand the dynamics of what is going on. The feedback cycle has to be interrupted at some point.\n \n As for people being responsible for telling the difference between truth and lies that they are fed by pastors, well, that is true, in some ideal sense. But are you seriously arguing that the snake oil salesman has no responsibility for the dangerous consequences of taking his product too seriously?\n \n I really do not think so. No, you really cannot get out of accepting that Christian religion has a -- well, some share of -- responsibility for homophobia. When individuals are bombarded by constant propaganda that Christian pastors have a monopoly on truth, and those pastors then say gays are wicked and deserve punishment, it is not entirely their fault they have been bamboozled into committing crimes against humanity. One has to look to the enablers as well.", 
   {}, 
   298523, 
   null, 
   1201268340.0
  ], 
  [
   298615, 
   null, 
   "lesz", 
   "It's clearly an area that could stand more research. But, just for the record, what Jim and I are talking about here is domestic violence in general, and not specific to adoptive families. Except in that violent families should, of course, not be allowed to adopt.\n\n \n I certainly don't dispute there is an incidence of domestic violence in gay families, and it would be an interesting study to see how those dynamics differed from straight families. Arguably, two men or two women might be expected to form a slightly different kind of relationship from a man and a woman, psychologically speaking, but it isn't really clear what those differences are and how they influence the course of relationships. It may turn out the differences aren't really all that significant, but i wouldn't bet on it.\n \n Still, the leap from the dynamics of gay relationships on average to any specific gay family is a huge one. That's why I feel prospective adoptive families need to be evaluated on their own merits, without any bias arising from anti-gay prejudice.\n \n \nNow that is a very interesting point. If you really want an apples to apples comparison one really shouldn't just compate gay to straight parents, it ought to be adoptive gay to adoptive straight. You should be looking at those who really had to work to get their kids, as opposed to those for whom having kids was easy, or perhaps even an accident.\n\n \n Exactly. Not all people or families, gay or straight, are going to be \"ideal\" parents, whatever an \"ideal\" parent is supposed to be. Openly gay people do get some choice in this, as babies are not a remotely possible consequence of their sexual intimacy; heterosexual couples may find themselves in the family way against their will and planning. And of course, all successfully adopted kids were wanted. That makes a huge difference, I think.", 
   {}, 
   298524, 
   null, 
   1201269780.0
  ], 
  [
   298618, 
   null, 
   "Matthew S", 
   "God says in the bible that he made man and woman to be together anyways and what is also said is that homosexuals would be stoned to death as well as women and men commiting adultery. what's going on is many people claim gay adoptees assault their adopted kids. i don't know that for a fact but it is said over and over again to me\n emoticon_xbouncer\n\n \n Mark 12:31 The second is this, Thou shalt love thy neighbour as thyself. There is none other commandment greater than these.\n \n The above passage means that if you want to stop gay people from adopting you then you want to stop yourself from being able to adopt.\n \n For whenever a christian takes action against gay people the christian is telling the world how the christian wants to be treated. The above passage is a command, it is not a request by Jesus. \n \n So when you see these christian groups fighting to deny the civil rights of gay people one can only conclude that they are telling the world that they want thier civil right to be fought against and denied. After all the christians would not go against the direct commandment from Jesus now would they?", 
   {}, 
   298576, 
   null, 
   1201271640.0
  ], 
  [
   298620, 
   null, 
   "lesz", 
   "My attitude to cupcakes is they are intended for eating, not debating with. ;)", 
   {}, 
   298618, 
   null, 
   1201271940.0
  ], 
  [
   298621, 
   null, 
   "Kronus", 
   " I certainly don't dispute there is an incidence of domestic violence in gay families, and it would be an interesting study to see how those dynamics differed from straight families. Arguably, two men or two women might be expected to form a slightly different kind of relationship from a man and a woman, psychologically speaking, but it isn't really clear what those differences are and how they influence the course of relationships. It may turn out the differences aren't really all that significant, but i wouldn't bet on it. \n\n The paper I linked to before suggests there is a difference. Due to the fact that gay children are more often the victims of abuse, and gay adults can be more isolated and persecuted, there is a higher than expected incidence of domestic violence in gay men. The paper didn't examine lesbian couples. But then, we have your next comment.\n \n \n\n Still, the leap from the dynamics of gay relationships on average to any specific gay family is a huge one. That's why I feel prospective adoptive families need to be evaluated on their own merits, without any bias arising from anti-gay prejudice.\n\n Absolutely, no question there.\n \n \n\n And of course, all successfully adopted kids were wanted. That makes a huge difference, I think. \n\n It certainly can't hurt.", 
   {}, 
   298615, 
   null, 
   1201272180.0
  ], 
  [
   298623, 
   null, 
   "lesz", 
   "The paper I linked to before suggests there is a difference. Due to the fact that gay children are more often the victims of abuse, and gay adults can be more isolated and persecuted, there is a higher than expected incidence of domestic violence in gay men. The paper didn't examine lesbian couples.\n\n \n This sort of correlation wouldn't be surprising. I haven't come across incidences of domestic violence in the gay couples of my acquaintance, but then, that isn't a broad statistical sample. And of course, what we see on the outside is not necessarily what goes on inside.\n \n An additional dynamic in male gay couples is, of course, that both are males, and may therefore both have stereotypically male aggressive characteristics. However, even there, one runs the risk of fatal generalisation. Statistical trends aren't predictors for specific outcomes. Profiling is an unjust business.\n \n Still, a lot of this is speculative. Conclusion X seems reasonable, but there isn't really any good or direct evidence for conclusion X. What I haven't seen is evidence that gay couples are intrinsically more violent and unstable than straight couples. Maybe on average they are, but you couldn't prove it by the literature. So maybe they aren't.\n \n The last thing to be pointed out is that even though many straight couples have been known to abuse children, that has not resulted in a blanket denial of their right to adopt or raise kids. That's because small statistical tendencies are not extrapolated to the population as a whole... where straights are concerned. It is true that X% of straight couples abuse children, but no-one concludes that straight couples are in general unfit to raise children. Yet somehow, this same reasoning isn't applied to gay couples. If some gay couples abuse children, then apparently all gay couples will.\n \n One can only conclude anti-gay bigotry.", 
   {}, 
   298621, 
   null, 
   1201273260.0
  ], 
  [
   298630, 
   null, 
   "jim's trucking", 
   "Found a good paper:\n \n http://www.eurowrc.org/06.contributions/1.contrib_en/34.contrib.en.htm\n \n It states that domestic violence is a very real problem in the gay community, and goes into why that might be and why it's underreported. It specifically does not examine the lesbian community. But it seems that a gay couple is at least as likely as a het couple to experience domestic violence.\n\n \n \nIt's clearly an area that could stand more research. But, just for the record, what Jim and I are talking about here is domestic violence in general, and not specific to adoptive families. Except in that violent families should, of course, not be allowed to adopt.\n \n \n .....\nI found several also. In general, they each shoot down my contention that gays are less violent to each other within couples. It appears that DV is rampant throughout society. I withdraw my stated opinion that adoptive children would likely be better off with gay parents.\n \n I stand by the opinion that a home full of love is best for a child.", 
   {}, 
   298621, 
   null, 
   1201277160.0
  ], 
  [
   298638, 
   null, 
   "Kronus", 
   " \n I stand by the opinion that a home full of love is best for a child.\n\n \n I sincerely hope you get no debate on that. emoticon_xgood", 
   {}, 
   298630, 
   null, 
   1201282260.0
  ], 
  [
   298640, 
   null, 
   "jyoshu", 
   "I stand by the opinion that a home full of love is best for a child.\n\n \n Amen to that! emoticon_xgood", 
   {}, 
   298630, 
   null, 
   1201282560.0
  ], 
  [
   298641, 
   null, 
   "jyoshu", 
   "This isn't about absolving the guy who pulls the trigger or wields the baseball bat of all responsibility. It's an issue of why he finds it reasonable and easy to perform his deeds. People do not live or operate in moral vacuums, they reflect the culture they live in, and in aggregate, they create the culture they live in. \n There is emphatically NOT a \"huge disconnect between the teaching that gay relationships are immoral and going out and hurting gay people\". There is, in fact, excellent scientific and historical reason to associate the two. \n\n \n In my opinion, if he finds it reasonable to hurt people by bullying or physical harm, there's something deeper wrong than just him being religious. I agree people don't operate in moral vacuums, but to go from hearing \"same-sex romance is immoral\" to bullying and harming gays is a leap that requires some factor OUTSIDE the religion (unless the religion specifies they be bullied, but that's not what I'm talking about). The fact that there are probably far, far more people that hear such things who DON'T go around bullying or harming gay people only further demonstrates that, IMO.", 
   {}, 
   298613, 
   null, 
   1201282860.0
  ], 
  [
   298643, 
   null, 
   "Ohioprof", 
   "I think each adoption case is different. Studies will only show the risks to children on broad range not individual cases. There are studies that show against gay adoption and studies for gay adoption and to see truth in only one study and not the opposing study is naive I don't doubt that two dads or two moms could be good parents even better than some strait parents. The same goes with a single parent gay or straight it's all risk assessment. Say the couple adopting is overweight, Can they promote healthy eating and exercise for the child? Studies say no. Can a single parent applicant working 9 to 5 give their child enough action? Studies say no. Studies also show that 60% adoptive children in a same sex two parent home will be teased or harassed by their peers for their same sex parents. Gay applicants should take this in to consideration when deciding to adopt whether they choose to agree with the study or not. Are you willing to weigh risks of a Childs mental status to become a parent? Gay applicants may say and believe they will raise their child objectively to sexual preference, but this may not be the case a Childs mind is very simple. Children with racist parents will most likely grow up to be racist not because or she is taught racism but because it is observed in his or her family. So even if you are promoting choice you maybe eliminating choice or unintentionally favoring one side. In almost all heterosexual households they do not promote sexual choice they just assume there child is heterosexual and the likely hood of their child becoming gay or lesbian is relatively low this is due to fact the child has a more objective view. I believe all applicants gay strait or single should be placed under the same microscope. Gay applicants or gay advocates should never use an abusive or neglectful home as a measuring point this is just fighting for the right to adopt and is clearly not a fight for the Childs best interest which is the most important. if you firmly believe that the child has the best chance with you and not another applicant after reviewing the risks you bring to the adoption and remember if the studied you choose to side with shows in favor of your sexual preference i.e. 50/50 chance remember that those statistics are not numbers they are children lives even if the numbers are 80 percent in your favor there still a 20 percent chance it's not going to be in the Childs general welfare. Whether you like it or not gay applicants and single parents bring a different risk assessment to the table on top of what the risks heterosexual couples bring to the table. Every tree has some bad apples some trees have more than others do cut down that tree or do you just pick the good ones.\n\n \n You mention studies saying this and studies saying that, but you don't cite them. Please cite these studies so we can check and see if what you are saying is accurate. Thanks.", 
   {
    "unicode_changes_made": true
   }, 
   298350, 
   null, 
   1201283520.0
  ], 
  [
   298657, 
   null, 
   "foundit66", 
   "Ok ...\n No. but I think there's a difference between saying someone \"has blame attached to them\" (basically saying they are 'blameable') and actively blaming them.\n\n Talk about semantics.\n What do you see as a difference between the two?\n \n \n \nI'm saying the action of blaming them is not a good approach. That's been my point.\n\n I have no idea where this point could have started.\n I see no sign of it in post #56 which prompted this question.\n \n When you talk about \"a good approach\", one has to wonder what goal is attempting to be \"approached\".\n And to think you had the gall to criticize me about \"conciseness\" when you demonstrate such vague statements.\n \n \n \nAlright, so what amount or degree of evidence does it take to cross the line into you blaming them? And if you are going to say it depends on the specific action rather than degree, then what specific action(s) suffice?\n\n Quite frankly, a LOT of this is JUST PLAIN OBVIOUS.\n As a gay person, I KNOW how comments and statements like we are discussing can affect a person. How they can contribute to the denigration of a gay person who is INHERENTLY gay, but is told by others that he is bad or inferior.\n \n So it's kind of bizarre for you to ask about \"amount or degree of evidence\".\n It's like asking the witness to a crime what \"amount or degree of evidence\" he would require to reach the conclusion that he has already reached based on the evidence that he witnessed.\n \n You have gay men and women TELLING YOU how these things affect them.\n \n \n \nI have not said gays are evil at all and would love for you to show me where I have.\n\n What a coincidence!\n I have not said that you said gays are evil at all and would love for you to show me where I have.\n \n \n \nIf I've said they were to be blamed for something, it was probably the context of gay rights activism, not gays in general.\n\n Well, ain't that a neat trick.\n I was talking about RELIGIOUS activism against gays, and now you have changed the subject yet again to talk about \"gay rights activism\".\n \n \n \nNevertheless it doesn't change the fact that I think the strategy of blaming people other than bullies for the bullying is problematic. Your point may speak to other issues, but other issues they are.\n\n Which brings me back to asking you a question about WHAT problems...\n And of course, you answering questions explaining your vague claims brings about \"too many questions\"...\n \n So instead of repeating my request, I'll just give you a statement instead...\n \"If you are going to make that accusation, you need to pony up and prove it.\"\n ***Jyoshu\n \"Well since you didn't address my points, I'll assume you're done! A simple \"ok, I concede that ... and moving on back to the issues ...\"\n ***Jyoshu\n \n \n \nWell ... that may be, but it's not like you've exactly pointed out in the course of conversation which questions out of all the ones you ask are (specifically) the ones you're expecting to be answered and which ones are not.\n\n Considering you often didn't respond to them as a question, or as an argument, your comment is pointless.\n From experience, you were going to ignore them either way so sign-posting it only adds to more words and less \"conciseness\" (which you can then complain about).\n \n \n \nNow that you're saying some are rhetorical, that's fine, but you have to understand that what I see are lots and lots of questions--then criticism over not answering questions.\n\n As I pointed out, when you fail to explain your own words and many of my questions are JUST asking you to explain your words, it's really pointless.\n And it's not like I'm asking you TONS of trivial questions and you miss one and I jump all over you.\n \n The last post of yours before the one I am replying to is a PERFECT example of what I was talking about.\n You complained about all the questions you were counting, but you COMPLETELY FAILED TO ADDRESS them.\n Your response was to COMPLAIN about them, because you use that as a tool to help deflect from the fact that you're ignoring the issues.\n \n \n \nDo people who are responding to you need to figure out which ones are the ones you want answered on their own, or will you make that clear?\n\n Jyoshu, you are free to ignore what you want.\n I am not going to jump through hoops to give pretense validity to your insistence on obfuscation.\n \n If I ask you to substantiate or explain your statements, you can ignore that at your leasure cause that's your right.\n THAT is what I will \"make clear\", cause that's the REAL thing that needs to be made clear.\n \n And what's even more clear is that all I have to do is take out the question marks from my posts, and that's one less tool you have to complain about to hide behind not addressing the issue...\n \n \n \nThat's true, there is more of a movement of ACTIVISM against homosexuality, which is why I said I can better accept that. But in terms of everyday churches and people in the pews, I don't think it's the case.\n\n Where do you think the \"activism\" is drumming up their support?\n As I pointed out earlier in another thread, we can go to anti-gay group after anti-gay group, and routinely find CHRISTIAN / RELIGIOUS claims in their doctrine.\n And I can point to a variety of polls that show there is a correlation between christianity and anti-gay opinion.\n \n Christianity makes up 75% of this country.\n How do you think the anti-gay activism could survive and thrive if it doesn't have sufficient christian support???", 
   {}, 
   298641, 
   null, 
   1201292820.0
  ], 
  [
   298665, 
   null, 
   "Kronus", 
   "There is emphatically NOT a \"huge disconnect between the teaching that gay relationships are immoral and going out and hurting gay people\". There is, in fact, excellent scientific and historical reason to associate the two. \n\n \n \nIn my opinion,... far more people that hear such things who DON'T go around bullying or harming gay people only further demonstrates that, IMO.\n\n \n So Jyoshu seems to just want to share opinion now. Lesz, you say you have actual fact. Can you share your data with us? The idea that rhetoric can goad people to action seems like common sense to me, but if you've found the science to back that up I'd like to see it.", 
   {}, 
   298641, 
   null, 
   1201294800.0
  ], 
  [
   298668, 
   null, 
   "jyoshu", 
   "Talk about semantics.\n What do you see as a difference between the two?\n \n \n Which brings me back to asking you a question about WHAT problems...\n\n \n I think one is basically proactive in the sense of finger-pointing and trying to say \"this is your fault.\" The other is more a way of simply saying someone's actions may have indirectly led to something, but not intentionally. It may be 'semantics' but sometimes they matter. I think it's an important distinction in that one has the potential to tick people off; the other less so. And so if one option allows for less reaction and resistance, then it's better suited to meet your goals. This also answers your question about what I think are problems with the 'blaming non-bullies for bullying' approach.\n \n \nQuite frankly, a LOT of this is JUST PLAIN OBVIOUS. As a gay person, I KNOW how comments and statements like we are discussing can affect a person. How they can contribute to the denigration of a gay person who is INHERENTLY gay, but is told by others that he is bad or inferior.\n \n So it's kind of bizarre for you to ask about \"amount or degree of evidence\".\n It's like asking the witness to a crime what \"amount or degree of evidence\" he would require to reach the conclusion that he has already reached based on the evidence that he witnessed.\n \n You have gay men and women TELLING YOU how these things affect them.\n\n \n So then are you saying that nothing more than a gay person telling about it is all the evidence needed to blame people? Your example of crime is surprising because you went out of your way to distance yourself from anything legal here. It seems to be the court of public opinion you're talking about, and then you drew a distinction between the way come to conclusions of blame THAT way from the legal system. Then you go and use the legal system as an example! But with that in mind, am I to assume that a 'witness' is all that's needed to assume 'blameability' on people?\n \n \nWhere do you think the \"activism\" is drumming up their support? As I pointed out earlier in another thread, we can go to anti-gay group after anti-gay group, and routinely find CHRISTIAN / RELIGIOUS claims in their doctrine.\n\n \n From christians in churches, but I still don't think they should be blamed for it. Particularly since you're covering something that, in many cases, is very indirect support.", 
   {}, 
   298657, 
   null, 
   1201295760.0
  ], 
  [
   298669, 
   null, 
   "jyoshu", 
   "So Jyoshu seems to just want to share opinion now. Lesz, you say you have actual fact. Can you share your data with us? The idea that rhetoric can goad people to action seems like common sense to me, but if you've found the science to back that up I'd like to see it.\n\n \n For the record, (just to clear up the misinformation you're trying to put forth) it needs to be stated that the two statements you pitted in your quotes there are not juxtaposed. IOW, the facts you ask Lesz for would not refute the statement of my opinion that I made, which is that the fact so many more people probably DON'T act on hearing preaching about gays than do is demonstrative. To refute that, you'd need to ask for different fact than you're requesting. I said nothing in disagreement of the idea that \"rhetoric can goad people to action,\" which I have no disagreement with. Nice try, though. That's not the same as saying I think people should be blamed.", 
   {}, 
   298665, 
   null, 
   1201296240.0
  ], 
  [
   298673, 
   null, 
   "MrWriteLA", 
   "http://www.deepfocusproductions.com/page_html/film_LTK1.html\n \n \nJay Johnson was raised in a strict, religious household; his father was vice-president of enrollment at Bethel College & Seminary and often spoke openly against homosexuality. Johnson had high political aspirations -- he was also gay.\n \n Conflicted about his sexual orientation, Johnson resorted to murder as a means to exorcise desires that the Christian church around him labeled immoral and worthy of death: \"I was disgusted with what I was doing. And quite frankly, I just thought to myself, 'If I shut these places [parks where gay men met each other] down, my temptation to do that would be less.' I would think to myself, 'This is a constructive, moral thing to be doing.' And I certainly didn't just come up with that idea. I watched The 700 Club sometimes with Pat Robertson -- they're constantly talking about gays.\"\n", 
   {}, 
   298669, 
   null, 
   1201299180.0
  ], 
  [
   298674, 
   null, 
   "MrWriteLA", 
   "http://www.religiongonebad.com/sample.php\n \n \nAt his trial, Williams made the connection between the fundamentalist Christian teachers and preachers who had influenced his life to the murder of Gary Matson and Winfield Mowder. \"You obey a government of man until there is a conflict,\" he explained. \"Then you obey a higher law. So many people claim to be Christians,\" Williams added, \"They complain about all these things their religion says are a sin, but they're not willing to do anything about it. They don't have the guts.\"\n", 
   {}, 
   298673, 
   null, 
   1201299360.0
  ], 
  [
   298676, 
   null, 
   "Kronus", 
   "For the record, (just to clear up the misinformation you're trying to put forth) it needs to be stated that the two statements you pitted in your quotes there are not juxtaposed.\n\n In point of fact all I was highlighting is the fact that, now that you've actually gotten to the part of the debate where facts would be nice, you've bracketed your entire post with \"in my opinion\". Whereas in the begining, when asked for an opinion, you insisted that rigorous facts needed to be used. It's pretty funny, when you think about it.", 
   {}, 
   298669, 
   null, 
   1201300200.0
  ], 
  [
   298740, 
   null, 
   "lesz", 
   "In my opinion, if he finds it reasonable to hurt people by bullying or physical harm, there's something deeper wrong than just him being religious.\n\n \n I'll grant you that possibility. However, I'll argue that religion can make a bad situation worse, by sanctioning evil acts because the believer's god approves of them.\n \n \nI agree people don't operate in moral vacuums, but to go from hearing \"same-sex romance is immoral\" to bullying and harming gays is a leap that requires some factor OUTSIDE the religion (unless the religion specifies they be bullied, but that's not what I'm talking about). The fact that there are probably far, far more people that hear such things who DON'T go around bullying or harming gay people only further demonstrates that, IMO.\n\n \n Most religion tells me that gay people deserve punishment for acting on their feelings. Few religions make much distinction between punishment meted out directly by god, or that mediated by god's believers. And even when they do, it's a pretty half-hearted effort, at best.\n \n So no, I don't agree we have factors operating outside religion. I think religion mostly condones anti-gay violence, if only by lukewarm and palpably insincere preaching against it. They spend more time condemning gays than condemning violence against gays. Bullies can do the math.\n \n The fact that most religious believers do not go around gay-bashing proves nothing about religion. It could be they are simply morally resistant to the license religion gives to bash gay people. Witness the rejection by many Christians of the OT commandment to execute gays. That need not owe anything to their religion, merely to their humanity. Most people aren't evil or violent, most people do not want to hurt anyone. But religion makes it a lot easier to hurt others, and have an easy conscience afterwards. That is why, in my view, religion is a bane. It makes viciousness morally acceptable.", 
   {}, 
   298641, 
   null, 
   1201363440.0
  ], 
  [
   298741, 
   null, 
   "lesz", 
   "So Jyoshu seems to just want to share opinion now. Lesz, you say you have actual fact. Can you share your data with us? The idea that rhetoric can goad people to action seems like common sense to me, but if you've found the science to back that up I'd like to see it.\n\n \n Look at the historical correlations. Every group of people that has been subjected to systematic violence has also been subjected to public vilification by whatever powers that be. At the risk of tripping over Godwin's Law, I point to anti-Semitism in Europe over many generations, not merely in Nazi Germany but in Poland and Russia as well. Romany people have been another case in point. Blacks, gays, you name it, vicious rhetoric and lethal violence have always gone hand in hand.\n \n Now, one can argue about whether the rhetoric causes the violence, or the violence spawns the rhetoric to justify it, but I think that is seriously to miss the point. Rhetoric and violence go hand in hand. There is a positive feedback loop where one generates the other. Chicken and egg. One can argue till you are blue in the face whether the chicken spawns the egg or vice versa, but that misses the point entirely. Chicken and egg are part of a single loop. Same with feedback mechanisms.\n \n To argue that one can say gays are evil and deserve punishment on the one hand, and to deny that has any effect on people keen to punish gays, is to deny that sunset follows sunrise. If religions spent much time defending gays against assault, I've yet to see it. If every religion staunchly protected gays, and gay-bashing still happened, I'd be persuaded I'm wrong. But I just don't see it.", 
   {}, 
   298665, 
   null, 
   1201364160.0
  ], 
  [
   298748, 
   null, 
   "jyoshu", 
   "Look at the historical correlations. Every group of people that has been subjected to systematic violence has also been subjected to public vilification by whatever powers that be. At the risk of tripping over Godwin's Law, I point to anti-Semitism in Europe over many generations, not merely in Nazi Germany but in Poland and Russia as well. Romany people have been another case in point. Blacks, gays, you name it, vicious rhetoric and lethal violence have always gone hand in hand.\n \n Now, one can argue about whether the rhetoric causes the violence, or the violence spawns the rhetoric to justify it, but I think that is seriously to miss the point. Rhetoric and violence go hand in hand. There is a positive feedback loop where one generates the other. Chicken and egg. One can argue till you are blue in the face whether the chicken spawns the egg or vice versa, but that misses the point entirely. Chicken and egg are part of a single loop. Same with feedback mechanisms.\n \n To argue that one can say gays are evil and deserve punishment on the one hand, and to deny that has any effect on people keen to punish gays, is to deny that sunset follows sunrise. If religions spent much time defending gays against assault, I've yet to see it. If every religion staunchly protected gays, and gay-bashing still happened, I'd be persuaded I'm wrong. But I just don't see it.\n\n \n Again, the issue to me isn't whether or not 'rhetoric can cause violence.' No doubt, someone somewhere has heard something and gone and hurt someone, and accounts of such cases could be drudged up. No one is saying one can never influence the other. I'm simply saying that I think blaming them for the bullying that someone else did, particularly with little regard to the specifics of the rhetoric, how far it went, with no proof of all these cases owing causality to the rhetoric, and no real knowledge of the situation of those hearing it is a poor strategy. It's not an issue of influence or not, it's an issue of whether blaming them is a good approach. I suspect this is, in large part, just another case of some using something to get a chance to point fingers at some Christians.", 
   {}, 
   298741, 
   null, 
   1201367100.0
  ], 
  [
   298751, 
   null, 
   "lesz", 
   "Again, the issue to me isn't whether or not 'rhetoric can cause violence.' No doubt, someone somewhere has heard something and gone and hurt someone, and accounts of such cases could be drudged up.\n\n \n OK. We agree that violent rhetoric causes violence.\n \n \nNo one is saying one can never influence the other. I'm simply saying that I think blaming them for the bullying that someone else did, particularly with little regard to the specifics of the rhetoric, how far it went, with no proof of all these cases owing causality to the rhetoric, and no real knowledge of the situation of those hearing it is a poor strategy. It's not an issue of influence or not, it's an issue of whether blaming them is a good approach. I suspect this is, in large part, just another case of some using something to get a chance to point fingers at some Christians.\n\n \n It's just that you think that those who espouse violent rhetoric should never be blamed when some take it seriously.\n \n Yes, fingers are pointed at some Christians. That's because they are guilty as hell. Of course we blame them. They deserve blame.", 
   {}, 
   298748, 
   null, 
   1201368660.0
  ], 
  [
   298752, 
   null, 
   "jyoshu", 
   "OK. We agree that violent rhetoric causes violence.\n \n It's just that you think that those who espouse violent rhetoric should never be blamed when some take it seriously.\n\n \n No; the problem is up until now you had not really been making any distinction between non-violent rhetoric and violent rhetoric in terms of religious teaching and preaching on this topic. In fact you'd given no attention to the content of the rhetoric at all, from what I've seen. And that's really much of the problem. Your previous posts gave the indication that you'd blame any and all teaching that would indicate homosexual relationships aren't moral for violence against gays. I am encouraged that you've changed to say \"violent rhetoric\" rather than just rhetoric, because I can certainly agree with THAT--again, as I said, if a preacher tells people to out and beat up gays, then sure, he's at fault. But that's not really what I have been talking about. But someone just saying they believe homosexual relationships aren't in the will of God is not \"violent rhetoric.\" There's no call there to go and beat up people, or bully them. Someone who would make the leap from hearing that message to going and beating people up has something else going on other than just religion.", 
   {}, 
   298751, 
   null, 
   1201369200.0
  ], 
  [
   298757, 
   null, 
   "Penfold", 
   "But their flawed reasoning (such as it is) is enabled by it. Apart from his \"wager\", here's another Pascal quote....\n \n \"Men never do evil so completely and cheerfully as when they do it from religious conviction.\"", 
   {}, 
   298752, 
   null, 
   1201373100.0
  ], 
  [
   298780, 
   null, 
   "lesz", 
   "No; the problem is up until now you had not really been making any distinction between non-violent rhetoric and violent rhetoric in terms of religious teaching and preaching on this topic.\n\n \n When a religion such as yours preaches that gay people are condemned to hell, to everlasting torment, as a result of acting on their love, I'd say that's pretty violent. \n \n \nIn fact you'd given no attention to the content of the rhetoric at all, from what I've seen.\n\n \n Believe me, the content of Christian rhetoric about gays causes me grave concern. I pay a lot of attention to it, which is why I take the attitude towards Christianity you find so troubling. Believe me, you aren't nearly as troubled by homosexuality and atheism as I am about Christianity. I am happy to give Christians lebensraum. I don't think many repay the compliment.\n \n \nAnd that's really much of the problem. Your previous posts gave the indication that you'd blame any and all teaching that would indicate homosexual relationships aren't moral for violence against gays.\n\n \n Of course I do. They are all vile. Anyone who preaches that no gay relationship can be moral is throwing kerosene on the fire. When the fire catches, don't come to me to absolve them from blame. They are guilty as hell.\n \n \nI am encouraged that you've changed to say \"violent rhetoric\" rather than just rhetoric, because I can certainly agree with THAT--again, as I said, if a preacher tells people to out and beat up gays, then sure, he's at fault. But that's not really what I have been talking about. But someone just saying they believe homosexual relationships aren't in the will of God is not \"violent rhetoric.\" There's no call there to go and beat up people, or bully them. Someone who would make the leap from hearing that message to going and beating people up has something else going on other than just religion.\n\n \n Then you will not be happy with my definition of violent rhetoric. If you people condemn me to hell and eternal torment because I dare to love another man, then that's violence. It's not physical violence, but it is spiritual and psychological violence. It isn't an overt call to go beat people up, you guys are far too clever and subtle for that. It's an excuse for others to do it, though. And your blind refusal to admit your culpability in this is extremely troubling.\n \n I realise, my dear fellow, or at least I hope, you have never personally gone out and bashed gay people with a baseball bat. But do not think for a moment your judgemental attitude against us isn't instrumental for the people who do.\n \n When a bishop preaches homophobia from his pulpit, and some bozo from his congregation goes and beats up some innocent gay person, I don't call for the bishop to be strung up or thrown in jail. But I do expect him to realise his contribution to crime. And I am unforgiving of his arrogant and smug refusal to accept his onus of blame.", 
   {}, 
   298752, 
   null, 
   1201382940.0
  ], 
  [
   298789, 
   null, 
   "jyoshu", 
   "Then you will not be happy with my definition of violent rhetoric. If you people condemn me to hell and eternal torment because I dare to love another man, then that's violence. It's not physical violence, but it is spiritual and psychological violence.\n\n \n emoticon_rolleyes This is so over-the-top for most every case. Other than the Phelp's nutcase clan, I don't know of ANY GROUP that would say someone would be condemned to hell for a homosexual relationship. That's the line always given about Christians, but I rarely ever hear it. I'm sure there are groups out there that would say as such that a Google search would dredge up, but again, you haven't limited things to that up 'till now, so why the sudden discrepancy? Are you now saying that people who don't condemn to hell but still disapprove religiously (which, by the way, probably describes MOST of all Christian opposition on this issue) are not to be blamed? How many times are you going to move the goalposts here?\n \n This is exactly WHY blaming other people than the bullies for the bullying IS problematic. One minute the standard is people who condemn to hell, the next it's just anyone, the next it's \"violent rhetoric\" (whatever THAT is). It's stupid, really, and the best approach is just to stop wanting to point fingers and throw blame around to everyone and just work toward ending intolerance. There's no good reason to want to play the blame game other than spite, really, when the same goals of ending intolerance can be achieved regardless through education.", 
   {}, 
   298780, 
   null, 
   1201386300.0
  ], 
  [
   298791, 
   null, 
   "lesz", 
   "emoticon_rolleyes This is so over-the-top for most every case. Other than the Phelp's nutcase clan, I don't know of ANY GROUP that would say someone would be condemned to hell for a homosexual relationship.\n\n \n Dear me. Are you a Christian? Have you ever heard of the Roman Catholic church or the Southern Baptist Convention? Christians condemn gays to hell every day. Maybe not every pulpit gets hysterical about it on a Sunday basis, but they do often enough to cause major damage.\n \n \nThat's the line always given about Christians, but I rarely ever hear it.\n\n \n Oy. So your particular pastor isn't fixated on homosexuals. Many Christian pastors are. Many Christian pastors are self-loathing homosexuals.\n \n \nAre you now saying that people who don't condemn to hell but still disapprove religiously (which, by the way, probably describes MOST of all Christian opposition on this issue) are not to be blamed? How many times are you going to move the goalposts here?\n\n \n Sweetie, I've never moved the goalposts. Disapproval in the Christian religion IS a condemnation to hell. Or aren't you a Christian? When Christians \"disapprove religiously\" they condemn to hell. That's what being Christian is all about.\n \n \nThis is exactly WHY blaming other people than the bullies for the bullying IS problematic.\n\n \n Nope. Christian churches smooth the way for bullies. They love doing it, too.\n \n \nOne minute the standard is people who condemn to hell, the next it's just anyone, the next it's \"violent rhetoric\" (whatever THAT is). It's stupid, really, and the best approach is just to stop wanting to point fingers and throw blame around to everyone and just work toward ending intolerance. There's no good reason to want to play the blame game other than spite, really, when the same goals of ending intolerance can be achieved regardless through education.\n\n \n Christian rhetoric is violent rhetoric. You people are militant and obnoxious. You are to blame, and I blame you. If you were tolerant, your pulpits wouldn't preach anti-homosexual propaganda. Maybe your pulpit finds better things to do, though I've never heard your pastor, but there are plenty of other Christian pulpits that gleefully hurl out fire and brimstone. That is your religion. That is your apologetics.\n \n This is your god speaking, and that's why I can't in reason believe in it. It's insane.", 
   {}, 
   298789, 
   null, 
   1201390260.0
  ], 
  [
   298808, 
   null, 
   "ironcourage", 
   "Dear me. Are you a Christian? Have you ever heard of the Roman Catholic church or the Southern Baptist Convention? Christians condemn gays to hell every day. Maybe not every pulpit gets hysterical about it on a Sunday basis, but they do often enough to cause major damage.\n \n \n \n Oy. So your particular pastor isn't fixated on homosexuals. Many Christian pastors are. Many Christian pastors are self-loathing homosexuals.\n \n \n \n Sweetie, I've never moved the goalposts. Disapproval in the Christian religion IS a condemnation to hell. Or aren't you a Christian? When Christians \"disapprove religiously\" they condemn to hell. That's what being Christian is all about.\n \n \n \n Nope. Christian churches smooth the way for bullies. They love doing it, too.\n \n \n \n Christian rhetoric is violent rhetoric. You people are militant and obnoxious. You are to blame, and I blame you. If you were tolerant, your pulpits wouldn't preach anti-homosexual propaganda. Maybe your pulpit finds better things to do, though I've never heard your pastor, but there are plenty of other Christian pulpits that gleefully hurl out fire and brimstone. That is your religion. That is your apologetics.\n \n This is your god speaking, and that's why I can't in reason believe in it. It's insane.\n\n \n \n please follow this link maybe what you find might surprise you notice all the predominately Christian countries are some shade of green, but look at some of the none Christian countries. hmmmm seems we might not be the the big problem.\n \n http://en.wikipedia.org/wiki/Image:World_homosexuality_laws.svg", 
   {}, 
   298791, 
   null, 
   1201396620.0
  ], 
  [
   298810, 
   null, 
   "lesz", 
   "please follow this link maybe what you find might surprise you notice all the predominately Christian countries are some shade of green, but look at some of the none Christian countries. hmmmm seems we might not be the the big problem.\n\n \n My dear, Christians can be just as evil as Muslims. It's their religion that made them do it. Homophobic bigotry is what religion specialises in.", 
   {}, 
   298808, 
   null, 
   1201396860.0
  ], 
  [
   298813, 
   null, 
   "Archangel", 
   "My dear, Christians can be just as evil as Muslims. It's their religion that made them do it. Homophobic bigotry is what religion specialises in.\n\n \n How sad it is to live in such complete and all encompassing ignorance of what is good and righteous in this World of spiritual darkness lesz. I truly have empathy for you, and sympathy too, but never do I wish you harm nor do I feel any hatred for any gay people. If only you could see that homosexuality is an affliction that brings along with it hatred for anyone who opposes it. That is the source of your anti-christian sentiments. Because I know that Jesus loves you as much as He loves me lesz. We were both made in Gods image.", 
   {}, 
   298810, 
   null, 
   1201400100.0
  ], 
  [
   298817, 
   null, 
   "ironcourage", 
   "My dear, Christians can be just as evil as Muslims. It's their religion that made them do it. Homophobic bigotry is what religion specialises in.\n\n \n now wait i just made a strong point and you brushed it off to continue blaming Christians. now i agree that one person of one faith can be just as evil as another. but while some countries put gays on death row, Christian societies just puts gay people in a lower social order. so who is the real bully? most if not all Christians are taught that being gay is immoral and sinful i will admit that loud and clear but even if you take every god and religion completly out of the picture its still not normal the long established social norm being heterosexual. its unnatural humans have male and female reproductive organs which are to be used on the opposite sex. so homosexuals are being looked down on and excluded by society not just religion.", 
   {}, 
   298810, 
   null, 
   1201401240.0
  ], 
  [
   298819, 
   null, 
   "Penfold", 
   "Do I understand that you are arguing that it is ok to treat them as second-class citizens, because \"other people/religions\" treat them even less well? emoticon_rolleyes", 
   {}, 
   298817, 
   null, 
   1201404240.0
  ], 
  [
   298822, 
   null, 
   "ironcourage", 
   "Do I understand that you are arguing that it is ok to treat them as second-class citizens, because \"other people/religions\" treat them even less well? emoticon_rolleyes\n\n \n \n im not sure you understand anything at all? \n \n please show me where i wrote\n \n \" is ok to treat them as second-class citizens, because \"other people/religions\" treat them even less well\"", 
   {}, 
   298819, 
   null, 
   1201407000.0
  ], 
  [
   298823, 
   null, 
   "Penfold", 
   " ... but while some countries put gays on death row, Christian societies just puts gay people in a lower social order. so who is the real bully? ... \n\n \n Here. Or did you not understand what you wrote?", 
   {}, 
   298817, 
   null, 
   1201407180.0
  ], 
  [
   298824, 
   null, 
   "T.Q", 
   "now wait i just made a strong point and you brushed it off to continue blaming Christians. now i agree that one person of one faith can be just as evil as another. but while some countries put gays on death row, Christian societies just puts gay people in a lower social order. so who is the real bully? most if not all Christians are taught that being gay is immoral and sinful i will admit that loud and clear but even if you take every god and religion completly out of the picture its still not normal the long established social norm being heterosexual. its unnatural humans have male and female reproductive organs which are to be used on the opposite sex. so homosexuals are being looked down on and excluded by society not just religion.\n\n \n You're claiming again that homosexuality is \"unnatural\", despite it being shown that it is quite common in animals. Also, you should read up about sexual practices in different cultures over the centuries. Homosexuality has not always been villified. It was actually quite common in many cultures for many many centuries.\n \n And why will none of these \"christians\" answer me this: What does it matter to you who sleeps with who? How does it affect you? Why are you not this vocal over other \"sins\"? \n \n All this \"it's a sin\" #### is just a convenient cover for your homophobia from what I can see.", 
   {}, 
   298817, 
   null, 
   1201407660.0
  ], 
  [
   298833, 
   null, 
   "ironcourage", 
   "You're claiming again that homosexuality is \"unnatural\", despite it being shown that it is quite common in animals. Also, you should read up about sexual practices in different cultures over the centuries. Homosexuality has not always been villified. It was actually quite common in many cultures for many many century.\n\n \n i maintain its unnatural maybe you skipped human biology/psychology the rectum is filled with the most vile bacteria wich surely cuased the death of many of those people.", 
   {}, 
   298824, 
   null, 
   1201411680.0
  ], 
  [
   298834, 
   null, 
   "ironcourage", 
   "Here. Or did you not understand what you wrote?\n\n \n i assume you read the attached link if not its below. i pointed out that Christian countries are much more merciful compared to other none Christian countries \n \n http://en.wikipedia.org/wiki/Image:World_homosexuality_laws.svg", 
   {}, 
   298823, 
   null, 
   1201412220.0
  ], 
  [
   298835, 
   null, 
   "Penfold", 
   "Be thankful for your rectal bacteria. They do their job, and are not \"vile\", unlike the expressed attitudes of some posters.", 
   {}, 
   298833, 
   null, 
   1201412280.0
  ], 
  [
   298838, 
   null, 
   "T.Q", 
   "i maintain its unnatural maybe you skipped human biology/psychology the rectum is filled with the most vile bacteria wich surely cuased the death of many of those people.\n\n \n \n I can't help but notice you did not in any way address my post. Would you like to try again?", 
   {}, 
   298833, 
   null, 
   1201412820.0
  ], 
  [
   298839, 
   null, 
   "ironcourage", 
   "I can't help but notice you did not in any way address my post. Would you like to try again?\n\n \n i answered the quoted portion of your post i do recall seeing some other questions not relevant to the topic? emoticon_xbye\n \n i suggest if you wish to engage in conversation you use the pm option.", 
   {}, 
   298838, 
   null, 
   1201414320.0
  ], 
  [
   298840, 
   null, 
   "T.Q", 
   "i answered the quoted portion of your post i do recall seeing some other questions not relevant to the topic? emoticon_xbye\n \n i suggest if you wish to engage in conversation you use the pm option.\n\n \n No, you in no way, shape or form responded to my post (btw, the \"quoted portion\" was the entirety of my post).\n \n You realize this is a debate board, correct? As in, you present your POV with supporting evidence, people counter with their POV and supporting evidence. Your POV is that homosexuality is unnatural and is not a social norm. I countered this with the fact that homosexuality is common in many species of animals, not only H. Sapiens. I also pointed out that over the past few thousand years, homosexuality was very common in many cultures, making it much more a social norm than the discrimination currently in vogue. In other words, I \"debated\" the idea that your POV was valid.\n \n To put it more simply, bugger off if you have no intention of actually communicating in an intelligent, mature manner.", 
   {}, 
   298839, 
   null, 
   1201414920.0
  ], 
  [
   298841, 
   null, 
   "electrolyte", 
   "i maintain its unnatural maybe you skipped human biology/psychology the rectum is filled with the most vile bacteria wich surely cuased the death of many of those people.\n\n Just so we're clear: homosexuality isn't what you're railing against, you're railing against just homosexual sex?", 
   {}, 
   298833, 
   null, 
   1201418520.0
  ], 
  [
   298851, 
   null, 
   "lesz", 
   "How sad it is to live in such complete and all encompassing ignorance of what is good and righteous in this World of spiritual darkness lesz. I truly have empathy for you, and sympathy too, but never do I wish you harm nor do I feel any hatred for any gay people. If only you could see that homosexuality is an affliction that brings along with it hatred for anyone who opposes it. That is the source of your anti-christian sentiments. Because I know that Jesus loves you as much as He loves me lesz. We were both made in Gods image.\n\n \n Spiritual darkness is a product of Christianity, and it has taken us centuries to bring in the Enlightenment. Pity you are too blind to see it, or realise your religious belief is a grievous affliction. As for this sordid business of humans being god's image, if that were true, the universe would be in a lot worse shape than my worst fears. Let us hope that god is not the image of humans.", 
   {}, 
   298813, 
   null, 
   1201434960.0
  ], 
  [
   298852, 
   null, 
   "lesz", 
   "now wait i just made a strong point and you brushed it off to continue blaming Christians. now i agree that one person of one faith can be just as evil as another. but while some countries put gays on death row, Christian societies just puts gay people in a lower social order. so who is the real bully? most if not all Christians are taught that being gay is immoral and sinful i will admit that loud and clear but even if you take every god and religion completly out of the picture its still not normal the long established social norm being heterosexual. its unnatural humans have male and female reproductive organs which are to be used on the opposite sex. so homosexuals are being looked down on and excluded by society not just religion.\n\n \n Look, the \"established norm\" is right-handedness, but it takes dogmatic religion or sheer idiocy -- but I repeat myself -- to call left-handers evil or unnatural. Yet this is what you do to gay people. So which is it for you: religion or idiocy? Just because some behaviour by some people is less common than some other behaviour by some other people doesn't make it necessary to be pejorative about it and call it \"unnatural\", unless you have some agenda of hatred such as religion.\n \n Oh, and while I am thinking about your prejudices, I'd recommend less obsession with anal sex. Being gay is not all about anal sex. Lots of straight people have anal sex and lots of gay people don't, but I don't hear you calling straights \"unnatural\". Only gays. You need to take an objective look at your homophobia, and realise the problem is between your ears.\n \n Oh, and another thing. What we do with our sexual organs is not your business. Capisce? Nobody wrote a manual that must be obeyed about what to do with our body parts. You might as well suppose that it's \"unnatural\" every time you masturbate. After all, your hand was not designed to massage your penis. So take your bizarre notions of what is \"natural\" and junk them, because they make no sense. That sort of idiocy one would expect from a Catholic theologian, but not from a rational person.", 
   {}, 
   298817, 
   null, 
   1201435020.0
  ], 
  [
   298862, 
   null, 
   "Penfold", 
   "i assume you read the attached link if not its below. i pointed out that Christian countries are much more merciful compared to other none Christian countries... \n\n \n I read what you wrote too. As above, you seek to excuse one vile behaviour by pointing to a worse one committed by someone else.", 
   {}, 
   298834, 
   null, 
   1201448940.0
  ], 
  [
   298985, 
   null, 
   "foundit66", 
   "I think one is basically proactive in the sense of finger-pointing and trying to say \"this is your fault.\" The other is more a way of simply saying someone's actions may have indirectly led to something, but not intentionally.\n\n I really don't see that distinction at all.\n What it boils down to, based on previous phrasing, is whether or not you \"blame\" somebody and whether or not you STATE that person has \"blame\".\n \n The degree of \"blame\" are all things you are reading into it which are not even hinted at by the actual wording.\n \n \n \nIt may be 'semantics' but sometimes they matter. I think it's an important distinction in that one has the potential to tick people off; the other less so.\n\n Quite frankly, I'm more pragmatic.\n If the truth \"ticks people off\", then so be it.\n If it ticks some people off to realize that some Christians think homosexuality is immoral, so be it. Deal with it and move on.\n \n But by the same token, if some people DO CONTRIBUTE to problems for gays, such as bullying or suicide, because of their active attempts to change gay people, then acknowledging that is something they need to \"deal with\".\n \n Cause if we're going by the \"tick people off\" standard, then obviously the free speech of some Christians \"ticks people off\" as well.\n \n \n \nAnd so if one option allows for less reaction and resistance, then it's better suited to meet your goals. This also answers your question about what I think are problems with the 'blaming non-bullies for bullying' approach.\n\n Whenever I see such a statement, I have to think about the history of the issue and see how things have actually worked over the years.\n Quite frankly, anti-gay people have been saying things against gays for a LONG time. And it would seem fairly obvious that history persisted over time with no real change in the anti-gay approach.\n \n Quite frankly, in this discussion you have fought AGAINST even the acceptance of ANYBODY on the \"anti-gay\" side for contributing to the atmosphere that leads to harm against gays.\n And I don't think I ever pointed a finger and said \"this is your fault\".\n \n \n \nSo then are you saying that nothing more than a gay person telling about it is all the evidence needed to blame people`\n\n Obviously one can look at the evidence involved and determine for themselves if it is credible.\n If Joe Schmoe feels gays are \"icky\", but it's only a private opinion and he only stated it when I pried him for information, the \"blame\" would be fairly ridiculous.\n But when the MECHANISM IS SEEN, and SUBSTANTIATED by mental health experts as I have shown, that is a significantly different situation.\n \n Then it's a situation where not only am I talking about what I have seen, but EXPERTS are agreeing that my perceptions are real.\n \n \n \nIt seems to be the court of public opinion you're talking about, and then you drew a distinction between the way come to conclusions of blame THAT way from the legal system. Then you go and use the legal system as an example!\n\n I'm sorry, but you have no point.\n You are just complaining about my analogy with no real point in hand, other than quibbling over conclusions that you are trying to draw which are STILL farfetched...\n \n \n \nBut with that in mind, am I to assume that a 'witness' is all that's needed to assume 'blameability' on people?\n\n There it is again.\n That subtle shift in wording whereby you try to change what WAS said into something more arguable...\n \n I talked about EVIDENCE.\n And then you turn around and talk about \"assuming\".\n Your question has no relevance to what I ACTUALLY said, or to what I have ACTUALLY presented, so I say a simple \"no\" and move away from the strawman...\n \n \n \nFrom christians in churches, but I still don't think they should be blamed for it. Particularly since you're covering something that, in many cases, is very indirect support.\n\n Which again gets back to realizing that no valid reason as to WHY they shouldn't be blamed has been brought forward.\n If a person has responsibility in bringing about a negative conclusion, then that person has blame for that contribution.\n It's just that simple.\n \n Whether it be \"indirect\" or \"direct\", it's still responsibility. Obviously \"indirect\" or \"direct\" can be discussed and assessed, but that is still a contribution.\n And furthermore, I'm not just talking about \"bullying\", but obviously a lot more as previously discussed in the articles I presented.", 
   {}, 
   298668, 
   null, 
   1201561620.0
  ], 
  [
   300547, 
   null, 
   "jazyjason", 
   "Gays everywhere are lobbying for \"their right to adopt\". The \"rights\" that are missing from this discourse are of course the rights of the child, the adoptee!\n \n No child should be enslaved in a homosexual 'family' simply because gays say its their right to adopt a voiceless and defenseless child! \n \n The rights of a child are paramount, period.\n\n \n \n Your an uninformed nut. Numerous studies have been conducted to see if a child being raised in an environment of two gay parents was in any way, harmful to the child. Answer: No it wasnt! In fact in some cases their skills at parenting were even better more so in some cases. So get off your omg if that kid is raised by free thinking people and not biased closed minded neocon nuts the kid may actually gain his own opinion on life!", 
   {}, 
   296405, 
   null, 
   1202351100.0
  ], 
  [
   301990, 
   null, 
   "stariennight", 
   "\"Why Same Sex Adoption is Wrong\" has NOT BEEN SHOWN!!\n \n The original homophobic thread starter has backed out of the argument, likely still hiding from the simple fact that he cannot prove anything claimed so far.\n \n The truth is that any home lacking love will harm children. \n \n No less truthful is the FACT that homosexual couples are more likely to live love filled lives than heteros. \n \n There's a bit of a \"frustated male\" syndrome in most of the wife beating families. There's turmoil in heterosexual families that will never appear in homosexual families. In my opinion, an adoptive child would fare better in a homosexual family built on love than in a heterosexual family built on fear of daddy. (Mommy can be mean too, but it's usually the man that screws up the love factor in a home.)\n \n I can imagine a two-mom family being more loving than a two-dad family, but I can't see either as being as damaging to young children as a drunken, wife abusing, mentally impotent male. The need of a father figure being in the house has been diminished by our ability to use the computer and other devices to learn. There's less need of an actual dad and an actual mom to copy. Life's lessons can be learned from anyone who displays compassion and common sense. The sexual attractions of the growing puppies will come naturally whether they are guided by gay or heterosexual parents...and the gay parents are more likely to be consistent in showing love...in my humble opinion, says he. \n \n All the above is merely my humble opinion.\n \n It's really a shame that we can't interfere in a hate-filled family soon enough to get the children out.\n\n \n Jim you are so right-on, you said what I'd been thinking while reading this dribble. As a gay woman raised by hetro parents of the Ozzie and Harriet era.\n They had no choise in wether I was gay or not, I was born Gay, not made Gay. I have long held that reproductive capacities should be removed at birth, and only be reinstated when an individual proves the maturity to raise a child. This would remove the OOPS factor in life. At least when Gay folks choose to be parents, by what ever means chosen it is a deliberate choise to be parents, never an OOPS.:xbanghead It has been my experience that children raised by Gay people/couples fare no worse than children of rational hetro couples.", 
   {}, 
   298443, 
   null, 
   1203174120.0
  ], 
  [
   301995, 
   null, 
   "stariennight", 
   "Folks,I guess I can be as off thread as anyone else. We all need to remember that the 3 major religions of this planet\n all started in Jerusilum. Islam, Judism and last Christianity. And ever since have been at war. Over what??:xbanghead I supose in their core all opose homosexuality, But as organized religion is about the control of people, and their assets that would make sense. All have adopted aspects of paganism, the first religion/belief system on this planet, and claim them as there own.\n \n Christians killing Muslims, killing Jews, killing Muslims, killing Christians, killing Jews, and when you all are gone the pagans will live in peace.emoticon_xhoho", 
   {}, 
   301990, 
   null, 
   1203175620.0
  ], 
  [
   302904, 
   null, 
   "gaetano", 
   "[QUOTE=ibelieveyou;296495]I standby this claim: gays do lobby for a 'right' to adopt children - do a simple google news search. \n \n Gay adoption naturally follows gay marriage, gay marriage is for me a non-issue, however the experimenting with society's most vulnerable, orphaned or abused children is outrageous.\n \n Placing children with gay couples is not much different than placing them in the custody of pedophiles, that is, although a gay couple may mimic the duties of excellent caring parent/s, the morally corrupting and socially destructive influence for the 'guinea pig' (child) of same sex 'parents' is unavoidable. \n \n The subject child would be raised in a REAL heterosexual world by homosexual carers - this does not make for a healthy and happy upbringing. Worse, it is absolutely unnecessary, being that there are many more heterosexual couples qualified to adopt vulnerable children\n \n \n \n \n \n \n \n Gaetano:\n I hate to burst your bubble, but a person's sexuality does not determine the type of person one happens to be. It is no different then race, religion, or national origin in reference to the actual person. I'm surprised you are not aware of that. To follow your line of thinking one could blame the condition of this world we live in on heterosexuals. After all it is you people who been in charge since day one. Ignorant assumption tells me that heterosexuality is the reason this world is so troubled. If you choose to see homosexuality as part of this troubled world, then maybe you should avoid heterosexual intercourse, because you run the risk of producing another homosexual.", 
   {}, 
   296495, 
   null, 
   1203615480.0
  ], 
  [
   302908, 
   null, 
   "Ghost Rider", 
   "There's no right to adoption, plain and simple. Neither gay nor straight parents have any right to be a parent to someone else's child.\n \n Gay people are not looking to bring about the downfall of society, anymore than there's a global conspiracy by the Jewish population to rule the world.", 
   {}, 
   302904, 
   null, 
   1203616020.0
  ], 
  [
   303175, 
   null, 
   "HonestAbe", 
   "[QUOTE=gaetano;302904]\nI standby this claim: gays do lobby for a 'right' to adopt children - do a simple google news search. \n \n Gay adoption naturally follows gay marriage, gay marriage is for me a non-issue, however the experimenting with society's most vulnerable, orphaned or abused children is outrageous.\n \n Placing children with gay couples is not much different than placing them in the custody of pedophiles, that is, although a gay couple may mimic the duties of excellent caring parent/s, the morally corrupting and socially destructive influence for the 'guinea pig' (child) of same sex 'parents' is unavoidable. \n \n The subject child would be raised in a REAL heterosexual world by homosexual carers - this does not make for a healthy and happy upbringing. Worse, it is absolutely unnecessary, being that there are many more heterosexual couples qualified to adopt vulnerable children\n \n \n \n \n \n \n \n Gaetano:\n I hate to burst your bubble, but a person's sexuality does not determine the type of person one happens to be. It is no different then race, religion, or national origin in reference to the actual person. I'm surprised you are not aware of that. To follow your line of thinking one could blame the condition of this world we live in on heterosexuals. After all it is you people who been in charge since day one. Ignorant assumption tells me that heterosexuality is the reason this world is so troubled. If you choose to see homosexuality as part of this troubled world, then maybe you should avoid heterosexual intercourse, because you run the risk of producing another homosexual.\n\n \n \n What world do you live in? You condemnation cannot be proved. You madam, are very wrong.emoticon_xkill", 
   {}, 
   302904, 
   null, 
   1203719400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why Same Sex Adoption Is Wrong", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10782, 
  "discussion_files": [
   [
    "21779.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-print.html"
   ], 
   [
    "21780.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-12-print.html"
   ], 
   [
    "21781.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-10-print.html"
   ], 
   [
    "21782.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-8-print.html"
   ], 
   [
    "21783.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-6-print.html"
   ], 
   [
    "21784.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-4-print.html"
   ], 
   [
    "21785.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-5-print.html"
   ], 
   [
    "21786.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-7-print.html"
   ], 
   [
    "21787.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-9-print.html"
   ], 
   [
    "21788.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-11-print.html"
   ], 
   [
    "21789.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-3-print.html"
   ], 
   [
    "21790.html", 
    "http://www.4forums.com/political/gay-rights-debates/10782-why-same-sex-adoption-wrong-2-print.html"
   ]
  ], 
  "identifier": 10782
 }
]