[
 [
  [
   296872, 
   null, 
   "Neanderthal79", 
   "This is an independant study I did for some class a while back.\n \n Here is the top 5 most religious states in the U.S.:\n \n Utah 79.5%\n Louisiana 75.3%\n North Dakota 75.1%\n Alabama 70.7%\n Mississippi 70.5%\n \n Here is where those same states rank by highest test scores:\n \n Utah #49\n Louisiana #42\n North Dakota #39\n Alabama #41\n Mississippi #50\n \n Maybe there's a correlation between the two, maybe not. Whaddya think?", 
   {
    "post_info": {
     "post_title": "Academics vs. Religion"
    }
   }, 
   null, 
   null, 
   1200094980.0
  ], 
  [
   296876, 
   null, 
   "HonestAbe", 
   "This is an independant study I did for some class a while back.\n \n Here is the top 5 most religious states in the U.S.:\n \n Utah 79.5%\n Louisiana 75.3%\n North Dakota 75.1%\n Alabama 70.7%\n Mississippi 70.5%\n \n Here is where those same states rank by highest test scores:\n \n Utah #49\n Louisiana #42\n North Dakota #39\n Alabama #41\n Mississippi #50\n \n Maybe there's a correlation between the two, maybe not. Whaddya think?\n\n \n There has to be a correlation. Other statistics that might interesting is the teen pregnancy rate, meth use rate, suicide rate, and divorce rate.", 
   {}, 
   296872, 
   null, 
   1200095640.0
  ], 
  [
   296905, 
   null, 
   "jyoshu", 
   "This is an independant study I did for some class a while back.\n \n Here is the top 5 most religious states in the U.S.:\n \n Utah 79.5%\n Louisiana 75.3%\n North Dakota 75.1%\n Alabama 70.7%\n Mississippi 70.5%\n \n Here is where those same states rank by highest test scores:\n \n Utah #49\n Louisiana #42\n North Dakota #39\n Alabama #41\n Mississippi #50\n \n Maybe there's a correlation between the two, maybe not. Whaddya think?\n\n \n I bet you're right. After all it only stands to reason that people would turn to religion for help when the education system in those states has obviously failed them so badly. emoticon_xangel", 
   {}, 
   296872, 
   null, 
   1200106260.0
  ], 
  [
   296908, 
   null, 
   "thelmoose", 
   "I bet you're right. After all it only stands to reason that people would turn to religion for help when the education system in those states has obviously failed them so badly. emoticon_xangel\n\n \n \n Turning to religion to help an ailing educational system only shows they need education more than religion.", 
   {}, 
   296905, 
   null, 
   1200107280.0
  ], 
  [
   296910, 
   null, 
   "jyoshu", 
   "Turning to religion to help an ailing educational system only shows they need education more than religion.\n\n \n No, not to help the system, to turn to something because the system failed THEM. :) I was just making a tongue in cheek point to the obvious prejudiced implication of this thread that ignorance/lack-of-education equates to religion. What other reason would there have been to post such a thing? Bottom line is that religion and education are not inversely proportional, no matter how much you may want that to be the case.", 
   {}, 
   296908, 
   null, 
   1200108120.0
  ], 
  [
   296921, 
   null, 
   "T.Q", 
   "No, not to help the system, to turn to something because the system failed THEM. :) I was just making a tongue in cheek point to the obvious prejudiced implication of this thread that ignorance/lack-of-education equates to religion. What other reason would there have been to post such a thing? Bottom line is that religion and education are not inversely proportional, no matter how much you may want that to be the case.\n\n \n As you said, the implication is that ignorance=religion. While I don't think there is enough data to state that, if you look at lack of religion vs academic achievements/education, there is an overall correlation. Japan is one of the least religious countries in the world, and I think we'd all agree that education wise, they rank pretty near the top.", 
   {}, 
   296910, 
   null, 
   1200111000.0
  ], 
  [
   296925, 
   null, 
   "jyoshu", 
   "As you said, the implication is that ignorance=education. While I don't think there is enough data to state that, if you look at lack of religion vs academic achievements/education, there is an overall correlation. Japan is one of the least religious countries in the world, and I think we'd all agree that education wise, they rank pretty near the top.\n\n \n No, not \"ignorance=education\". The implication made is that ignorance=religion. What value is correlation when you can't prove causation, other than a chance to stroke one's own prejudices by getting a chance to basically assert that 'religious people are ignorant'? That's really what you want to say anyway, so why not just come right out and say it? emoticon_rolleyes The data above in no way demonstrates causation.", 
   {}, 
   296921, 
   null, 
   1200111900.0
  ], 
  [
   296927, 
   null, 
   "T.Q", 
   "No, not \"ignorance=education\". The implication made is that ignorance=religion. \n\n Corrected, thanks.\n \n \nWhat value is correlation when you can't prove causation, other than a chance to stroke one's own prejudices by getting a chance to basically assert that 'religious people are ignorant'? That's really what you want to say anyway, so why not just come right out and say it? emoticon_rolleyes The data above in no way demonstrates causation.\n\n \n \n You apparently missed this part of my post:\n \n \n \"While I don't think there is enough data to state that\"", 
   {}, 
   296925, 
   null, 
   1200112200.0
  ], 
  [
   296939, 
   null, 
   "electrolyte", 
   "As you said, the implication is that ignorance=religion. While I don't think there is enough data to state that, if you look at lack of religion vs academic achievements/education, there is an overall correlation.\n\n T.Q is correct. The question is: what is the actual reason for this correlation? I think that some of us know the answer.\n \n The data that I'd like to see are the test scores for the five least religious states. That might either strengthen or debase the argument.", 
   {}, 
   296927, 
   null, 
   1200119100.0
  ], 
  [
   296959, 
   null, 
   "obvious_child", 
   "No, not to help the system, to turn to something because the system failed THEM. :) I was just making a tongue in cheek point to the obvious prejudiced implication of this thread that ignorance/lack-of-education equates to religion. What other reason would there have been to post such a thing? Bottom line is that religion and education are not inversely proportional, no matter how much you may want that to be the case.\n\n \n I agree. However, you cannot ignore the implications of religion impacting the quality of education. Some of the best school districts in the US have virtually no religious people on the boards. Plus the Southern states have always been somewhat backwards, Louisiana can at least blame part of it on the French. But I have a hard time believing that the South and Utah which are extremely religious, haven't hurt their public education systems with many of their religious views. And it is more of which religion rather then religion in general. Japan is heavily Buddhist or Shinto and regularly destroy their American counterparts in testing like it's the end of the world.", 
   {}, 
   296910, 
   null, 
   1200129660.0
  ], 
  [
   296987, 
   null, 
   "jyoshu", 
   "I agree. However, you cannot ignore the implications of religion impacting the quality of education.\n\n \n Or education impacting the quality of religion. See, the correlation could mean something different that you're assuming. We only know they might be related; we don't know in what way.\n \n But I suspect what's really happening here, is that this discrepancy could more likely be explained in terms of rural versus city. Rural areas have less local tax funds for good schools, and therefore are naturally not going to have the resources that large-city schools have. Note that the 5 states listed are all very \"rural\" type states with no major cities (like L.A., Atlanta, Chicago, etc.) There is New Orleans, but the rural areas of Louisiana are among some of the poorest in the country, so it sort of off-sets there. So the education status of these states may not even have anything to do whatsoever with the fact there are very 'religious states'. These stats just don't prove anything.", 
   {}, 
   296959, 
   null, 
   1200159840.0
  ], 
  [
   297009, 
   null, 
   "thelmoose", 
   "Or education impacting the quality of religion. See, the correlation could mean something different that you're assuming. We only know they might be related; we don't know in what way.\n \n But I suspect what's really happening here, is that this discrepancy could more likely be explained in terms of rural versus city. Rural areas have less local tax funds for good schools, and therefore are naturally not going to have the resources that large-city schools have. Note that the 5 states listed are all very \"rural\" type states with no major cities (like L.A., Atlanta, Chicago, etc.) There is New Orleans, but the rural areas of Louisiana are among some of the poorest in the country, so it sort of off-sets there. So the education status of these states may not even have anything to do whatsoever with the fact there are very 'religious states'. These stats just don't prove anything.\n\n \n It is clearly more than geography. There is a correlation between an individual's educational status and reliogiosity as well. You may be right that it is \"education impacting the quality of religion\". The more educational one gets, the more likely one is to dismiss religion. Certainly the home schoolers are worried about that.", 
   {}, 
   296987, 
   null, 
   1200166620.0
  ], 
  [
   297012, 
   null, 
   "jyoshu", 
   "It is clearly more than geography. There is a correlation between an individual's educational status and reliogiosity as well. \n\n \n 1st, I never said it was ONLY geography. Second .... Stats please, regarding your new claim here?\n \n \nYou may be right that it is \"education impacting the quality of religion\". The more educational one gets, the more likely one is to dismiss religion. Certainly the home schoolers are worried about that.\n\n \n So you do think they are inversely proportional. (Can't say I'm surprised, it's a view consistent with anti-religious prejudice.) There are plenty of Christian scientists with PhDs that would, I suspect, disagree with you. And I have no idea what your point is on the homeschooling comment. Homeschoolers often do better academically.", 
   {}, 
   297009, 
   null, 
   1200167760.0
  ], 
  [
   297016, 
   null, 
   "thelmoose", 
   "1st, I never said it was ONLY geography. Second .... Stats please, regarding your new claim here?\n \n \n \n So you do think they are inversely proportional. (Can't say I'm surprised, it's a view consistent with anti-religious prejudice.) There are plenty of Christian scientists with PhDs that would, I suspect, disagree with you. And I have no idea what your point is on the homeschooling comment. Homeschoolers often do better academically.\n\n \n I do not have anti-religious prejudice. \n You need to look up the word prejudice, which means \"an unfavorable opinion or feeling formed beforehand or without knowledge, thought, or reason.\"\n \n I have given it plenty of thought. I criticize religion only after that forethought. When will you stop saying that?\n \n And far from being a \"new claim\", it is common knowledge that religiosity (believe in god, religious affiliation, church attendance, you name it) decreases as educational status increases. Sure there are the occasional Christian PhDs - I know a few - what does that prove?\n \n See this collection of studies. Beckwith did a metaanalysis that is summarized here.\n \n Lastly, home-schoolers are commonly fearful that there is no religious instruction in public education. It is my opinion that this fear leads to concern that the kiddies indoctrination will fade. As for better academic achievement, there is a huge selection bias. Having involved parents alone improves academic achievement.", 
   {}, 
   297012, 
   null, 
   1200168540.0
  ], 
  [
   297024, 
   null, 
   "HonestAbe", 
   "\"I am now convinced that children should not be subjected to the frightfulness of the Christian religion . . . If the concept of a father who plots to have his own son put to death is presented to children as beautiful and as worthy of society's admiration, what types of human behavior can be presented to them as reprehensible?\"\n -- Ruth Hurmence Green, Preface of Born Again Skeptic's Guide to the Bible", 
   {
    "post_info": {
     "post_title": "This says a great deal about religion for me."
    }, 
    "unicode_changes_made": true
   }, 
   297016, 
   null, 
   1200172140.0
  ], 
  [
   297029, 
   null, 
   "jyoshu", 
   "I do not have anti-religious prejudice. \n You need to look up the word prejudice, which means \"an unfavorable opinion or feeling formed beforehand or without knowledge, thought, or reason.\"\n \n I have given it plenty of thought. I criticize religion only after that forethought. When will you stop saying that?\n \n And far from being a \"new claim\", it is common knowledge that religiosity (believe in god, religious affiliation, church attendance, you name it) decreases as educational status increases. Sure there are the occasional Christian PhDs - I know a few - what does that prove?\n \n See this collection of studies. Beckwith did a metaanalysis that is summarized here.\n\n \n Sorry, but this has been covered already, and it's nothing more than the 'ol \"eminient scientists\"/\"leading scientists\" canard raising it's head again--yet another version of the no-true-scotsman fallacy. It claims that \"Leading scientists\" are more atheist. It claims that \"Eminent scientists\" are more atheist. Even the term \"greater scientists\" was used. And of course, as expected, nothing given to tell how they define how a scientist is \"emminent\", \"leading\", or \"greater\", or what differentiates an eminent/leading/greater scientist from just a .... say, regular scientist. Good grief, give me a break. I can't believe you even bother reading websites like that. It clearly exists for the sole purpose of trying to make religion look ignorant, and to be anti-religious, rather than independently-minded. And the article uses studies from 1927 and the 1930s??? Both religion and science have changed in many, many ways since then. \n \n Thelmoose, you try to act as though you aren't prejudiced, but yet you make statements that clearly show you think religion equates to ignorance. And now you link to studies that are based in large part on fallacies. This is a very elitist, prejudiced, and frankly hateful view. You don't realise it or admit it because you like to think you're above that, but your comments and arguments here betray you.\n \n \nLastly, home-schoolers are commonly fearful that there is no religious instruction in public education. It is my opinion that this fear leads to concern that the kiddies indoctrination will fade. As for better academic achievement, there is a huge selection bias. \n\n \n You're speaking in generalisations here. Depends on the home school family. Some of them do home-school because they don't want their kids completely divorced from religious influence in their schooling. 'Fear' isn't necessarily a good way to describe that. Other do it because they think the public education system in their area or in general is cr@p or dangerous (and sometimes that's the case), and can't afford private schools. Others do it simply because they think it is a superior way for children to receive an education. \n \n \n \nHaving involved parents alone improves academic achievement.\n\n \n Well yes, that's rather the point, exactly. That's a reason a lot of families homeschool.", 
   {}, 
   297016, 
   null, 
   1200175500.0
  ], 
  [
   297040, 
   null, 
   "HonestAbe", 
   "Sorry, but this has been covered already, and it's nothing more than the 'ol \"eminient scientists\"/\"leading scientists\" canard raising it's head again--yet another version of the no-true-scotsman fallacy. It claims that \"Leading scientists\" are more atheist. It claims that \"Eminent scientists\" are more atheist. Even the term \"greater scientists\" was used. And of course, as expected, nothing given to tell how they define how a scientist is \"emminent\", \"leading\", or \"greater\", or what differentiates an eminent/leading/greater scientist from just a .... say, regular scientist. Good grief, give me a break. I can't believe you even bother reading websites like that. It clearly exists for the sole purpose of trying to make religion look ignorant, and to be anti-religious, rather than independently-minded. And the article uses studies from 1927 and the 1930s??? Both religion and science have changed in many, many ways since then. \n \n Thelmoose, you try to act as though you aren't prejudiced, but yet you make statements that clearly show you think religion equates to ignorance. And now you link to studies that are based in large part on fallacies. This is a very elitist, prejudiced, and frankly hateful view. You don't realise it or admit it because you like to think you're above that, but your comments and arguments here betray you.\n \n \n \n You're speaking in generalisations here. Depends on the home school family. Some of them do home-school because they don't want their kids completely divorced from religious influence in their schooling. 'Fear' isn't necessarily a good way to describe that. Other do it because they think the public education system in their area or in general is cr@p or dangerous (and sometimes that's the case), and can't afford private schools. Others do it simply because they think it is a superior way for children to receive an education. \n \n \n \n \n Well yes, that's rather the point, exactly. That's a reason a lot of families homeschool.\n\n \n \n Are you home schooling your children? And if so, why?", 
   {}, 
   297029, 
   null, 
   1200178080.0
  ], 
  [
   297045, 
   null, 
   "obvious_child", 
   "Or education impacting the quality of religion. See, the correlation could mean something different that you're assuming. We only know they might be related; we don't know in what way.\n\n \n But I suspect that at least in the south, religion is damaging the quality of education. Science for example.\n \n \nBut I suspect what's really happening here, is that this discrepancy could more likely be explained in terms of rural versus city. Rural areas have less local tax funds for good schools, and therefore are naturally not going to have the resources that large-city schools have.\n\n \n More money does not equate to better education. I have a sister who's a public school teacher and I went to a private college prep highschool. Money does not make the difference most of the time. It's the kids themselves and the parents. You can have the best funded education system but if your kids and your parents don't care, it doesn't matter how well funded you are. I have friend who went to my school (one to the top 20 prep in the country) who then went to community college because they did not put the time and effort into getting an education. It is a big mistake to believe that throwing money at things will always make them better. And I have friends who went to terribly funded public who are very intelligent and very educated because they put the work in.\n \n \nNote that the 5 states listed are all very \"rural\" type states with no major cities (like L.A., Atlanta, Chicago, etc.) There is New Orleans, but the rural areas of Louisiana are among some of the poorest in the country, so it sort of off-sets there. So the education status of these states may not even have anything to do whatsoever with the fact there are very 'religious states'. These stats just don't prove anything.\n\n \n I'm not entirely buying that argument.\n \n http://www.morganquitno.com/edrank.htm\n \n That shows that Hawaii, which is heavily urban with more then 70% of its population located in cities to be poorly scoring. Nevada also follows suit. Vermont, however, last I recalled is very rural and leads the country. Montana's #7!\n \n There's something else.", 
   {}, 
   296987, 
   null, 
   1200178860.0
  ], 
  [
   297056, 
   null, 
   "thelmoose", 
   "Sorry, but this has been covered already, and it's nothing more than the 'ol \"eminient scientists\"/\"leading scientists\" canard raising it's head again--yet another version of the no-true-scotsman fallacy. It claims that \"Leading scientists\" are more atheist. It claims that \"Eminent scientists\" are more atheist. Even the term \"greater scientists\" was used. And of course, as expected, nothing given to tell how they define how a scientist is \"emminent\", \"leading\", or \"greater\", or what differentiates an eminent/leading/greater scientist from just a .... say, regular scientist. Good grief, give me a break. I can't believe you even bother reading websites like that. It clearly exists for the sole purpose of trying to make religion look ignorant, and to be anti-religious, rather than independently-minded. And the article uses studies from 1927 and the 1930s??? Both religion and science have changed in many, many ways since then. \n \n Thelmoose, you try to act as though you aren't prejudiced, but yet you make statements that clearly show you think religion equates to ignorance. And now you link to studies that are based in large part on fallacies. This is a very elitist, prejudiced, and frankly hateful view. You don't realise it or admit it because you like to think you're above that, but your comments and arguments here betray you.\n \n\n \n I never said, nor do I believe that, as you clumsily put, \"religion equates to ignorance.\" I was merely noting the statistical association between amount of education (not intelligence) and religiosity. It has repeatedly been demonstrated to be an inverse relationship. That relationship exists outside of any opinions you or I have. \n \n Do you know what a meta-analysis is? That study attempted to look at EVERY study ever done; that is why there are some that date to the 20's. As the author states, the methodology of many of the studies is flawed or underpowered. That is the point of a meta-analysis. Admittedly, there are limitations to metaanalyses as well. \n \n In any event, there are some fairly straightforward (and recent, and peer-reviewed, they were given) studies that show that religiosity among scientists, at least, is less than the general population. There is a substantial difference. One can only speculate, for now, the reason for that difference. \n \n I drew no conclusions from these findings. You seem to have, as you've got your panties in a knot over them. You got bent out of shape over a single word, \"eminent\". I don't know how it was defined in the study, but I am sure it was operationalized. \n \n These are results of studies. Interpret them how you will. Numbers themselves cannot be \"elitist, prejudiced, and frankly hateful.\" Just because these numbers seem to REALLY bother you, doesn't mean you have to get so bitchy.", 
   {}, 
   297029, 
   null, 
   1200182100.0
  ], 
  [
   297071, 
   null, 
   "jyoshu", 
   "In any event, there are some fairly straightforward (and recent, and peer-reviewed, they were given) studies that show that religiosity among scientists, at least, is less than the general population. There is a substantial difference. One can only speculate, for now, the reason for that difference. \n \n I drew no conclusions from these findings. You seem to have, as you've got your panties in a knot over them. You got bent out of shape over a single word, \"eminent\". I don't know how it was defined in the study, but I am sure it was operationalized.\n\n \n No conclusions, eh? Nah, you already stated what you think, and the die is cast. \"The more educational one gets, the more likely one is to dismiss religion\"--your own claim. Now you're back-pedaling, of course, and saying something that's a little easier to defend.", 
   {}, 
   297056, 
   null, 
   1200184920.0
  ], 
  [
   297085, 
   null, 
   "thelmoose", 
   "No conclusions, eh? Nah, you already stated what you think, and the die is cast. \"The more educational one gets, the more likely one is to dismiss religion\"--your own claim. Now you're back-pedaling, of course, and saying something that's a little easier to defend.\n\n \n Sorry that I used a non-word like \"educational\", but I think that merely is a restatement of the facts. More education is associated with less religion.\n \n In any event, what plausible explanation do you have for this relationship?", 
   {}, 
   297071, 
   null, 
   1200187380.0
  ], 
  [
   297086, 
   null, 
   "Ripskar", 
   "My own view would be that a less educated population would statisticly be \"Easy Marks\" for those that are inclined to take advantage of others, such as we see in these states media.\n Jyoshu makes an intresting Town vs. Country statement, this side of the pond it tends to be children from the Country who do better than those from urban backgrounds with the primary factor being truancy.", 
   {}, 
   297085, 
   null, 
   1200188160.0
  ], 
  [
   297087, 
   null, 
   "Bassman", 
   "Have we forgotten that some of the most secular, Liberal Urban school districts tend to do more poorly?? New York City is such an example.", 
   {}, 
   297086, 
   null, 
   1200189000.0
  ], 
  [
   297091, 
   null, 
   "obvious_child", 
   "Have we forgotten that some of the most secular, Liberal Urban school districts tend to do more poorly?? New York City is such an example.\n\n \n Do you have a site where we can look at scores by district?", 
   {}, 
   297087, 
   null, 
   1200189780.0
  ], 
  [
   297143, 
   null, 
   "electrolyte", 
   "Is there a reason that nobody seems to want to respond to this?", 
   {}, 
   297091, 
   null, 
   1200204780.0
  ], 
  [
   297144, 
   null, 
   "Penfold", 
   "Perhaps it needs explaining more simply......emoticon_rolleyes", 
   {}, 
   297143, 
   null, 
   1200205140.0
  ], 
  [
   298527, 
   null, 
   "jitobear", 
   "I do not believe that the religious are ignorant. The following, however, is an interesting look at what happens when you combine ignorance and religion. Some is disturbing - some is hysterical. \n \n To watch for:[*]Jesus was not a Jew, he was Jewish.[*]The earth is FLAT - the Bible says so.[*]Several arguments that the only real version of the Bible is the KJV - and all Christians should speak English since, apparently, Jesus spoke English.[*]Woman who finds male porn in her 16 year old son's room and the reason she thinks its there.[*]Atheists aren't people.[*]Environmentalism is a mental illness.[*]The earth was originally populated by aliens.[*]Pregnant women pods.\n Also - if you look close, there will be a familiar name.....\n \n http://duggmirror.com/comedy/100_Greatest_Quotes_from_fundamentalist_christian_chat_rooms/", 
   {
    "post_info": {
     "post_title": "100 Greatest Quotes from fundamentalist christian chat rooms"
    }
   }, 
   297144, 
   null, 
   1201202640.0
  ], 
  [
   298531, 
   null, 
   "Archangel", 
   "This is an independant study I did for some class a while back.\n \n Here is the top 5 most religious states in the U.S.:\n \n Utah 79.5%\n Louisiana 75.3%\n North Dakota 75.1%\n Alabama 70.7%\n Mississippi 70.5%\n \n Here is where those same states rank by highest test scores:\n \n Utah #49\n Louisiana #42\n North Dakota #39\n Alabama #41\n Mississippi #50\n \n Maybe there's a correlation between the two, maybe not. Whaddya think?\n\n \n Got a link for the sources of these statistics neanderthal? What you have done here is called plagiarism.", 
   {}, 
   296872, 
   null, 
   1201203480.0
  ], 
  [
   298539, 
   null, 
   "marc9000", 
   "Is there a reason that nobody seems to want to respond to this?\n\n \n Because there is an army of seven atheists there maybe?", 
   {}, 
   297143, 
   null, 
   1201208760.0
  ], 
  [
   298543, 
   null, 
   "jyoshu", 
   "Also - if you look close, there will be a familiar name.....\n \n http://duggmirror.com/comedy/100_Greatest_Quotes_from_fundamentalist_christian_chat_rooms/\n\n \n Wow. A website dedicated to being anti-conservative Christian. Geem who'da thought such a thing existed? emoticon_rolleyes", 
   {}, 
   298527, 
   null, 
   1201210980.0
  ], 
  [
   298545, 
   null, 
   "jitobear", 
   "Wow. A website dedicated to being anti-conservative Christian. Geem who'da thought such a thing existed? emoticon_rolleyes\n\n \n Ya - but did you read the quotes? emoticon_xbouncer\n \n I actually had no idea what kind of site it was. Someone just sent me a link to the quotes. And its not like conservative Christians don't drum up anti-somedamnedthingoranother websites.", 
   {}, 
   298543, 
   null, 
   1201212360.0
  ], 
  [
   298546, 
   null, 
   "Kronus", 
   "Wow. A website dedicated to being anti-conservative Christian. Geem who'da thought such a thing existed? emoticon_rolleyes\n\n \n Wow. Jyoshu engaging in sarcastic diversions. Geem who'da thought such a thing would happen? emoticon_rolleyes\n \n \n Jito, was it supersport you were refering to, or was there someone else that caught your eye?", 
   {}, 
   298543, 
   null, 
   1201212420.0
  ], 
  [
   298547, 
   null, 
   "jitobear", 
   "Jito, was it supersport you were refering to, or was there someone else that caught your eye?\n\n \n It was Supersport.", 
   {}, 
   298546, 
   null, 
   1201212480.0
  ], 
  [
   298561, 
   null, 
   "HonestAbe", 
   "I do not believe that the religious are ignorant. The following, however, is an interesting look at what happens when you combine ignorance and religion. Some is disturbing - some is hysterical. \n \n To watch for:[*]Jesus was not a Jew, he was Jewish.[*]The earth is FLAT - the Bible says so.[*]Several arguments that the only real version of the Bible is the KJV - and all Christians should speak English since, apparently, Jesus spoke English.[*]Woman who finds male porn in her 16 year old son's room and the reason she thinks its there.[*]Atheists aren't people.[*]Environmentalism is a mental illness.[*]The earth was originally populated by aliens.[*]Pregnant women pods.\n Also - if you look close, there will be a familiar name.....\n \n http://duggmirror.com/comedy/100_Greatest_Quotes_from_fundamentalist_christian_chat_rooms/\n\n \n You don't have to be ignorant to be religious, but there are many who are religious that are ignorant. We them here almost daily.", 
   {}, 
   298527, 
   null, 
   1201219320.0
  ], 
  [
   298588, 
   null, 
   "electrolyte", 
   "Because there is an army of seven atheists there maybe?\n\n So? If your position can be backed up logically, then you can brag about kicking the asses of seven people instead of just one.", 
   {}, 
   298561, 
   null, 
   1201241100.0
  ], 
  [
   298596, 
   null, 
   "obvious_child", 
   "Because there is an army of seven atheists there maybe?\n\n \n For someone who attacks liberals, you sure have no problem embracing the victimhood culture.", 
   {}, 
   298539, 
   null, 
   1201241940.0
  ], 
  [
   298660, 
   null, 
   "Archangel", 
   "No, not \"ignorance=education\". The implication made is that ignorance=religion. What value is correlation when you can't prove causation, other than a chance to stroke one's own prejudices by getting a chance to basically assert that 'religious people are ignorant'? That's really what you want to say anyway, so why not just come right out and say it? emoticon_rolleyes The data above in no way demonstrates causation.\n\n \n \nThis is an independant study I did for some class a while back.\n \n Here is the top 5 most religious states in the U.S.:\n \n Utah 79.5%\n Louisiana 75.3%\n North Dakota 75.1%\n Alabama 70.7%\n Mississippi 70.5%\n \n Here is where those same states rank by highest test scores:\n \n Utah #49\n Louisiana #42\n North Dakota #39\n Alabama #41\n Mississippi #50\n \n Maybe there's a correlation between the two, maybe not. Whaddya think?\n\n \n The fact is jyoshu, this whole thread is an unprovable slander that is made up completely by neanderthal. When pressed for a link to his statistics, he claimed that it's an independant study he did himself. So what sources did he use to come up with these numbers. Did he survey an equal, yet representative sample number of people in each State in order to determine which States were most religious? And what size surveys did he do to determine the education levels in these States? And why don't all of these scientific minds want evidence from him that these numbers are valid before just jumping on the band wagon and agreeing with his conclusions which he has produced absolutely zero evidence for?\n \n We are being taken for a ride here based on made up and unprovable assumptions once again by an anti christian bigot.", 
   {
    "unicode_changes_made": true
   }, 
   298596, 
   null, 
   1201293240.0
  ], 
  [
   298720, 
   null, 
   "pandion", 
   "The fact is jyoshu, this whole thread is an unprovable slander that is made up completely by neanderthal.\nActually, I think that he summarized his statistics from several studies that have been done over the years.\n \nWhen pressed for a link to his statistics, he claimed that it's an independant study he did himself.\nSo your assertion is that we should take what you say as truth, without support, but reject the results of his research?\n \nSo what sources did he use to come up with these numbers.\nI suspect that he used several well known polls, including Gallup.\n \nDid he survey an equal, yet representative sample number of people in each State in order to determine which States were most religious?\nI think that it is more likely that he used sources that did so. You see, his study was not of the population, but of various scientific surveys of the population.\n \n For example, Gallup has found that a typical creationist is female (54% of females and only 40% of males), Southern (54% in the south, 47%, 45%, and 40% in the Midwest, West, and East, respectively), and uneducated (64% have less than high school education, 57% of high school graduates, 44% with some college, and 31% of college graduates). The above numbers are combined results from Gallup Polls from 1991, 1993, and 1997. The numbers have been much the same since. Other findings of the Gallup Polls were that creationists were more likely to be manual laborers than blue collar or white collar workers. Creationists also tended to be less affluent, and more rural. Gallup doesn't make any causal connection between his statistics, and, of course, occupation, affluence, and living conditions are probably results of education rather than religious beliefs.\n \n It's not up to us to provide you with a \"link\" for everything you object to. While an intelligent and perceptive person can find vast sources of information on the internet, one must first be perceptive enough to recognize claptrap when one sees it. You don't seem to be educated enough to make the distinction.", 
   {
    "unicode_changes_made": true
   }, 
   298660, 
   null, 
   1201335120.0
  ], 
  [
   298726, 
   null, 
   "Archangel", 
   "Nice try making excuses for him pandion, but he was asked by admin for links to his statistics and HIS direct response, and I quote, was he claimed that it's an independant study he did himself. Which means he doesn't have any studies or polls to refer to. Unless he was lying to admin. Is that what you're suggesting? That neanderthal plagiarized these results and is taking credit for polling thousands of people in 5 States to come up with these stats on religion and education levels when he really didn't do it?\n \n But wait, that doesn't work either, in order to determine that these 5 States had the lowest numbers, he would have had to have polled hundreds of people in each of all 50 States to determine that these 5 were the lowest ranking. So try again pandion, but get your facts right cuz you're not helping neanderthal at all.", 
   {
    "unicode_changes_made": true
   }, 
   298720, 
   null, 
   1201337340.0
  ], 
  [
   298731, 
   null, 
   "electrolyte", 
   "And why don't all of these scientific minds want evidence from him that these numbers are valid before just jumping on the band wagon and agreeing with his conclusions which he has produced absolutely zero evidence for?\n\n Let's take a ride in the not-so-wayback machine:The data that I'd like to see are the test scores for the five least religious states. That might either strengthen or debase the argument.\nI specifically asked for data pertinent for confirming the conclusion. But you won't issue a retraction of your allegation of bandwagoning, will you? Of course not, because that would mean admitting fault, which you never do.\n \n You clearly don't remember (more selective amnesia, most likely) my post that included the link showing the effect that religiosity has on education. Maybe you'd have remembered if you hadn't avoided it like the plague.", 
   {}, 
   298720, 
   null, 
   1201340520.0
  ], 
  [
   298738, 
   null, 
   "Penfold", 
   "What was allegedly \"admitted under pressure from admin\" was no more than the initial statement made in the opening post of the thread. \n \n \"This is an independant study I did for some class a while back.\"", 
   {}, 
   298731, 
   null, 
   1201358700.0
  ], 
  [
   298749, 
   null, 
   "jyoshu", 
   "The fact is jyoshu, this whole thread is an unprovable slander that is made up completely by neanderthal. When pressed for a link to his statistics, he claimed that it's an independant study he did himself. So what sources did he use to come up with these numbers. Did he survey an equal, yet representative sample number of people in each State in order to determine which States were most religious? And what size surveys did he do to determine the education levels in these States? And why don't all of these scientific minds want evidence from him that these numbers are valid before just jumping on the band wagon and agreeing with his conclusions which he has produced absolutely zero evidence for? We are being taken for a ride here based on made up and unprovable assumptions once again by an anti christian bigot.\n \n Nice try making excuses for him pandion, but he was asked by admin for links to his statistics and HIS direct response, and I quote, was he claimed that it's an independant study he did himself. Which means he doesn't have any studies or polls to refer to. Unless he was lying to admin. Is that what you're suggesting? That neanderthal plagiarized these results and is taking credit for polling thousands of people in 5 States to come up with these stats on religion and education levels when he really didn't do it? But wait, that doesn't work either, in order to determine that these 5 States had the lowest numbers, he would have had to have polled hundreds of people in each of all 50 States to determine that these 5 were the lowest ranking. So try again pandion, but get your facts right cuz you're not helping neanderthal at all.\n\n \n Thanks for the info. It did seem to be suspiciously 'convenient' information outta nowhere, tailor-made for people who like to equate religion with ignorance (a very insulting and offensive view). A simple source of where he got his numbers from is all it would take.", 
   {
    "unicode_changes_made": true
   }, 
   298660, 
   null, 
   1201367940.0
  ], 
  [
   298750, 
   null, 
   "trebor", 
   "Thanks for the info. It did seem to be suspiciously 'convenient' information outta nowhere, tailor-made for people who like to equate religion with ignorance (a very insulting and offensive view). A simple source of where he got his numbers from is all it would take.\n\n \n \n It is a correlation he did himself. However, the studies are out there. It does point out that the 5 states that are the lowest rated when it comes to education ARE the most religious. Or, are you saying that the sources he gave\n are lying?", 
   {}, 
   298749, 
   null, 
   1201368660.0
  ], 
  [
   298754, 
   null, 
   "jyoshu", 
   "It is a correlation he did himself. However, the studies are out there. It does point out that the 5 states that are the lowest rated when it comes to education ARE the most religious. Or, are you saying that the sources he gave\n are lying?\n\n \n What 'sources he gave'??? He didn't give any, that's the point. Even after being asked by the Admin, according to Arch. If he was asked where he got the info, and he did the study himself, he should have been able to provide his sources. It's not that unreasonable of a request!", 
   {}, 
   298750, 
   null, 
   1201369320.0
  ], 
  [
   298772, 
   null, 
   "GiantOreo", 
   "Nice try making excuses for him pandion, but he was asked by admin for links to his statistics and HIS direct response, and I quote, was he claimed that it's an independant study he did himself. Which means he doesn't have any studies or polls to refer to. Unless he was lying to admin. Is that what you're suggesting? That neanderthal plagiarized these results and is taking credit for polling thousands of people in 5 States to come up with these stats on religion and education levels when he really didn't do it?\n \n\n \n \n \nWhat 'sources he gave'??? He didn't give any, that's the point. Even after being asked by the Admin, according to Arch. If he was asked where he got the info, and he did the study himself, he should have been able to provide his sources. It's not that unreasonable of a request!\n\n \n What is interesting is that I have searched this entire thread, and in not one place did I see the Admin actually post, let alone ask the Original Poster anything.\n \n Seems kinda interesting that Archie \"knows\" that the Admin asked him anything, let alone what the actual answers word for word were.\n \n Doesn't that seem a little fishy (not to mention hypocritical) to you that Archie made this claim and yet doesn't have a link to back it up (something he is bitching about that Neandertal won't do)?\n \n Or am I the only one that would like to either see this conversation, or at least find out how Archie was privy to a word for word answer from Neandertal that doesn't show up on these fora?", 
   {
    "unicode_changes_made": true
   }, 
   298754, 
   null, 
   1201378560.0
  ], 
  [
   298777, 
   null, 
   "Archangel", 
   "What is interesting is that I have searched this entire thread, and in not one place did I see the Admin actually post, let alone ask the Original Poster anything.\n \n Seems kinda interesting that Archie \"knows\" that the Admin asked him anything, let alone what the actual answers word for word were.\n \n Doesn't that seem a little fishy (not to mention hypocritical) to you that Archie made this claim and yet doesn't have a link to back it up (something he is bitching about that Neandertal won't do)?\n \n Or am I the only one that would like to either see this conversation, or at least find out how Archie was privy to a word for word answer from Neandertal that doesn't show up on these fora?\n\n \n PM admin and ask him if I'm lying or making this up if you want to.", 
   {}, 
   298772, 
   null, 
   1201380000.0
  ], 
  [
   298782, 
   null, 
   "Penfold", 
   "The question is not what Admin or Neanderthal actually said, but your claim to be privy to that private conversation. If you are, then the standards of confidentiality on this site are sadly lacking, and if you are not then you have been exposed as a liar. I am given to understand that no true Christian lies.", 
   {}, 
   298777, 
   null, 
   1201384680.0
  ], 
  [
   298783, 
   null, 
   "admin", 
   "What is interesting is that I have searched this entire thread, and in not one place did I see the Admin actually post, let alone ask the Original Poster anything.\n \n Seems kinda interesting that Archie \"knows\" that the Admin asked him anything, let alone what the actual answers word for word were.\n \n Doesn't that seem a little fishy (not to mention hypocritical) to you that Archie made this claim and yet doesn't have a link to back it up (something he is bitching about that Neandertal won't do)?\n \n Or am I the only one that would like to either see this conversation, or at least find out how Archie was privy to a word for word answer from Neandertal that doesn't show up on these fora?\n\n \n I did not ask the orginal poster anything. Archangel asked me if the post was plagiarism and should have a link. I didn't think it did because it sounded like it was his work. I just quoted the orginal poster saying \"This is an independant study I did for some class a while back.\" \n admin", 
   {}, 
   298772, 
   null, 
   1201384980.0
  ], 
  [
   298785, 
   null, 
   "Penfold", 
   "Thanks for the reassurance.emoticon_xagree", 
   {}, 
   298783, 
   null, 
   1201385280.0
  ], 
  [
   298786, 
   null, 
   "jyoshu", 
   "Regardless of what did or didn't go on with the admin, Neanderthal had to have gotten his numbers from somewhere (assuming he didn't just make 'em up). I still think it would be very good to know where they came from. I Googled for the info and don't see anything that particularly matches those percentages and numbers in terms of religion and rank of state.", 
   {}, 
   298785, 
   null, 
   1201385400.0
  ], 
  [
   298788, 
   null, 
   "admin", 
   "The question is not what Admin or Neanderthal actually said, but your claim to be privy to that private conversation. If you are, then the standards of confidentiality on this site are sadly lacking, and if you are not then you have been exposed as a liar. I am given to understand that no true Christian lies.\n\n \n Below is the question and response I gave him. He could have thought I had asked the poster, but I was just telling him my thoughts on the post.\n \n \n \n Isn't this plagiarism also since he didn't post a link for these statistics?\n \n He says it's an independant study he did himself.\n Admin", 
   {
    "unicode_changes_made": true
   }, 
   298782, 
   null, 
   1201385940.0
  ], 
  [
   298798, 
   null, 
   "obvious_child", 
   "There's some deviation with other studies, placing Rhode Island among the top religious states, and some deviation with the lowest testing states, but through and through it's pretty accurate.\n \n http://www.adherents.com/largecom/com_christian.html", 
   {}, 
   296872, 
   null, 
   1201392780.0
  ], 
  [
   298805, 
   null, 
   "Archangel", 
   "Regardless of what did or didn't go on with the admin, Neanderthal had to have gotten his numbers from somewhere (assuming he didn't just make 'em up). I still think it would be very good to know where they came from. I Googled for the info and don't see anything that particularly matches those percentages and numbers in terms of religion and rank of state.\n\n \n This was my point precisely jyoshu. If his study info was garnered from some other sources then he should supply those sources. If he did the polling himself which I seriously doubt, then he would have that info in support of his results.\n \n \nBelow is the question and response I gave him. He could have thought I had asked the poster, but I was just telling him my thoughts on the post.\n \n \n \n Isn't this plagiarism also since he didn't post a link for these statistics?\n \n He says it's an independant study he did himself.\n Admin\n\n \n Thanks for the clarification as i did misunderstand you. I thought he responded to a query from you.", 
   {
    "unicode_changes_made": true
   }, 
   298798, 
   null, 
   1201395240.0
  ], 
  [
   298815, 
   null, 
   "obvious_child", 
   "Regardless of what did or didn't go on with the admin, Neanderthal had to have gotten his numbers from somewhere (assuming he didn't just make 'em up). I still think it would be very good to know where they came from. I Googled for the info and don't see anything that particularly matches those percentages and numbers in terms of religion and rank of state.\n\n \n Percentages? No. Ranking yes. Like I said before, there is some minor deviation in other sources, but he's more or less on the mark.", 
   {}, 
   298786, 
   null, 
   1201400880.0
  ], 
  [
   298821, 
   null, 
   "jyoshu", 
   "Percentages? No. Ranking yes. Like I said before, there is some minor deviation in other sources, but he's more or less on the mark.\n\n \n Without the test score stat there's nothing proved here in terms of correlation. I know there are some here who really want a certain result here since it could put religion in a bad light, but there just needs to be more solid information here. (and of course even then correlation doesn't equal causation)", 
   {}, 
   298815, 
   null, 
   1201404840.0
  ], 
  [
   298854, 
   null, 
   "HonestAbe", 
   "Without the test score stat there's nothing proved here in terms of correlation. I know there are some here who really want a certain result here since it could put religion in a bad light, but there just needs to be more solid information here. (and of course even then correlation doesn't equal causation)\n\n \n Why do you think that those states with the highest numbers of evangelicals also have the lowest scores on intelligence tests?", 
   {}, 
   298821, 
   null, 
   1201436460.0
  ], 
  [
   298860, 
   null, 
   "Archangel", 
   "Why do you think that those states with the highest numbers of evangelicals also have the lowest scores on intelligence tests?\n\n \n That's the point of the disagreement samiinh, no actual evidence has been documented by neanderthal that any of his statistics are true or correct in any way. This whole thread is based on unproven claims, and isn't it interesting that neanderthal has been missing in action ever since posting this thread and hasn't seen fit to answer these questions.\n \n The only difference I see between believers in Christ and atheists is the awareness of believers of their spiritual inner being. Atheists have no such awareness and are poorer for it in my humble opinion. And the bible say's the wisdom of this World is foolishness to God, so according to Him being an intellectual is shallow and not very fulfilling in actual practice where eternal truths are involved.", 
   {}, 
   298854, 
   null, 
   1201446900.0
  ], 
  [
   298869, 
   null, 
   "electrolyte", 
   "... according to Him being an intellectual is shallow and not very fulfilling in actual practice where eternal truths are involved.\n\n So God gave us a brain and demands that we not use it. God demands that we be a robotic dumbo yes-man. \n \n \"I do not feel obliged to believe that same God who endowed us with sense, reason, and intellect had intended for us to forgo their use.\" --Galileo\n (... who was persecuted by the church for daring to think and reason.)", 
   {}, 
   298860, 
   null, 
   1201460400.0
  ], 
  [
   298871, 
   null, 
   "lesz", 
   "The only difference I see between believers in Christ and atheists is the awareness of believers of their spiritual inner being. Atheists have no such awareness and are poorer for it in my humble opinion. And the bible say's the wisdom of this World is foolishness to God, so according to Him being an intellectual is shallow and not very fulfilling in actual practice where eternal truths are involved.\n\n \n Nope. The difference is one of intelligence. Atheists are spiritual beings too, we just don't throw it away on fairy tales. We find something worthwhile to be spiritual about. You don't.", 
   {}, 
   298860, 
   null, 
   1201461240.0
  ], 
  [
   298872, 
   null, 
   "electrolyte", 
   "That's the point of the disagreement samiinh, no actual evidence has been documented by neanderthal that any of his statistics are true or correct in any way.\n\n But when I posted information based on a Pew study, and I supplied the link so that anybody with the mental capacity to read could see for himself or herself, you ran.", 
   {}, 
   298860, 
   null, 
   1201461240.0
  ], 
  [
   298873, 
   null, 
   "Archangel", 
   "But when I posted information based on a Pew study, and I supplied the link so that anybody with the mental capacity to read could see for himself or herself, you ran.\n\n \n I know that according to your standards of evidence it doesn't really matter to you where it comes from as long as you can come up with numbers that validate what you want to believe, but you see, neanderthal made these claims in the OP that the dumbest States correlate with the most religious States. That is what is being discussed here and your Pew Study does nothing to validate any specific info about how the 50 States break down, so the stats are his. So he must validate them in order for them to make sense as valid and accurate.", 
   {}, 
   298872, 
   null, 
   1201466280.0
  ], 
  [
   298876, 
   null, 
   "electrolyte", 
   "I know that according to your standards of evidence it doesn't really matter to you where it comes from as long as you can come up with numbers that validate what you want to believe,\n\n Swing and a miss. Now we know why baseball commentators call them \"big hacks.\"\n You know so little that saying you know nothing would be too generous. Here's what I posted earlier in this very thread:\nAnd why don't all of these scientific minds want evidence from him that these numbers are valid before just jumping on the band wagon and agreeing with his conclusions which he has produced absolutely zero evidence for?\n\n Let's take a ride in the not-so-wayback machine:The data that I'd like to see are the test scores for the five least religious states. That might either strengthen or debase the argument.\nI specifically asked for data pertinent for confirming the conclusion. But you won't issue a retraction of your allegation of bandwagoning, will you? Of course not, because that would mean admitting fault, which you never do.\n\n \n \nSo he must validate them in order for them to make sense as valid and accurate.\n\n And here's the irony: despite your allegations that we aren't concerned with numbers but only results that (1) I disproved earlier in this thread and (2) you still hold anyway, you've shown (via #2) that you are the one who doesn't give a damn about what the evidence actually says. You post actual evidence so infrequently that it made o_c's list of Archie Hackery Habits\u0099. When we post refutations of your blatherings, you don't care. So nobody is the least bit surprised that I asked for more evidence and you still turned around and accused me of blindly accepting the conclusion due to a lack of honesty that would normally make me question the conclusion.\n \n Archie boy, I shouldn't have to say it again, but because you're being so magnanimous about it, I'll remind you and everyone else of how ignorant you're being:\n \n I asked for corroborating data to support Neanderthal's conclusion, but linked to my post on the Pew study showing at least a positive correlation between lack of education and rejection of evolution.\n Then you painted everyone here as so biased as to swallow the conclusion whole without wanting evidence. That is, you falsely accused me of a lack of academic integrity.\n I called you on your slander and requested a retraction.\n You said nothing, because you really have no interest in addressing the truth or in displaying any of your own academic integrity or honesty. Your only interest here is in attacking the opposite side and not being held responsible when your actions are unjustified.\n \n Are you going to retract your false accusations, or will I just get to continually expose your dishonesty and lack of responsibility and accountability (which is even more ironic considering your accusations of dishonesty and your railing against abortion because it allegedly relieves people of responsibility and accountability)?\n \n Hypocrite is not a strong enough word. It truly falls light-years short. I know of some other words that are closer, but I'm not allowed to use them here because they'd make Archie cry.", 
   {}, 
   298873, 
   null, 
   1201469280.0
  ], 
  [
   298877, 
   null, 
   "Archangel", 
   "So the only way you can debate a current issue is to go back and rehash another thread? Is that the only way you can refute current debates you're unable to answer to? Of course it is. Maybe now you can see why I walk away from so many debates with you. Because you attempt to prove one thread by ripping another thread out context and using it as a weapon in a current thread.", 
   {}, 
   298876, 
   null, 
   1201472220.0
  ], 
  [
   298884, 
   null, 
   "obvious_child", 
   "Without the test score stat there's nothing proved here in terms of correlation. I know there are some here who really want a certain result here since it could put religion in a bad light, but there just needs to be more solid information here. (and of course even then correlation doesn't equal causation)\n\n \n I think we already discussed this and it came down to the problems of averaging rural vs urban school districts. I remember that discussion stopped due to lack of test scores by district.", 
   {}, 
   298821, 
   null, 
   1201481940.0
  ], 
  [
   298898, 
   null, 
   "electrolyte", 
   "So the only way you can debate a current issue is to go back and rehash another thread? Is that the only way you can refute current debates you're unable to answer to? Of course it is. Maybe now you can see why I walk away from so many debates with you.\n\n Because you can't even keep up? Do you know how many times I've had to recap? Or do I have to recap my recaps, too?\n Or maybe it's because I keep showing that you're wrong, over and over and over, in multiple aspects, and you can't see through those tears in your eyes well enough to post?\n \n You falsely accused me of being intellectually dishonest. I nailed you for your dishonesty and slander and gave you the opportunity to apologize and retract. Not only did you fail to either apologize or retract, you didn't even defend your original accusation.\n \n Regarding the veracity of the evidence itself, you took it to admin and lost your argument. I linked you back to the post with the Pew study to show that there really are studies that show a correlation. You're welcome to think that a study showing a negative correlation between education and religious beliefs is irrelevant to a thread about academics and religion because this country gives people the right to be stupidly wrong.", 
   {}, 
   298877, 
   null, 
   1201493760.0
  ], 
  [
   298899, 
   null, 
   "Neanderthal79", 
   " This whole thread is based on unproven claims, and isn't it interesting that neanderthal has been missing in action ever since posting this thread and hasn't seen fit to answer these questions.\n \n .\n\n \n Wow, I had no idea so many has responded to the thread. First off, I'd like to thank god, b/c without him, nothing would be possible.\n \n Sorry Arch, I've been away, haven't checked the site. \n \n The reason I posted this, is because I was going through some books and found a graph that I had made for design class a few years ago, and thought someone might be interested.\n \n I can't site the sources because it was a just a graph. But, jeez, it's not hard to find. All you do is look up where states rank according to test scores, and then look up what states have the highest religious population. \n \n Do it, jyoshu! Then post it.", 
   {}, 
   298860, 
   null, 
   1201494000.0
  ], 
  [
   298900, 
   null, 
   "jyoshu", 
   "I can't site the sources because it was a just a graph. But, jeez, it's not hard to find. All you do is look up where states rank according to test scores, and then look up what states have the highest religious population. \n \n Do it, jyoshu! Then post it.\n\n \n No, sorry Neanderthal. It's really your own responsibility to prove your points here, and state your own case with proof. I did a Google search (though not anything real in-depth) and didn't see much of anything. I'm not saying you're wrong here. I'm just saying we don't know. No conclusions can be ascertained from something we can't even validate. However, I do think it's the sort of post that rings the bell of anyone who wants to see religion painted badly, and there are definitely some people here who all but salivate over things like that. No doubt, there are some here who would LOVE to prove anything negative about religion.\n \n If you got the graph from a book, and it was any decent book or textbook whatsoever, there should have been some sort of indication SOMEWHERE of the source. A footnote, endnote, or anything. If not, then it's worthless anyway to begin with, IMO. And you were pretty specific in the details from the graph, so one can only assume you either HAVE the book (in which case you could reveal the title and author and check for citations) or at least spent a good deal of time with it gleaning information that specific. It seems pretty unlikely you'd remember such specific details from memory (from \"a few years ago\") as the stats you gave. So surely you can understand that something isn't really adding up here.", 
   {}, 
   298899, 
   null, 
   1201496400.0
  ], 
  [
   298934, 
   null, 
   "Penfold", 
   "A simple google for religiosity by state brought up this, which suggests that the richer you are, the less religious.\n That explains televangelists. ;) \n \n http://www.stat.columbia.edu/~cook/movabletype/archives/2007/11/religiosity_and.html", 
   {}, 
   298900, 
   null, 
   1201524720.0
  ], 
  [
   298938, 
   null, 
   "Neanderthal79", 
   "I made the graph. Probably used InDesign. I don't have sources, sorry. But like I said, you can find this information anywhere now.", 
   {}, 
   298934, 
   null, 
   1201536240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Academics vs. Religion", 
  "url": "http://www.4forums.com/political/religion-debates/10790-academics-vs-religion.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10790, 
  "discussion_files": [
   [
    "21839.html", 
    "http://www.4forums.com/political/religion-debates/10790-academics-vs-religion-print.html"
   ], 
   [
    "21840.html", 
    "http://www.4forums.com/political/religion-debates/10790-academics-vs-religion-5-print.html"
   ], 
   [
    "21841.html", 
    "http://www.4forums.com/political/religion-debates/10790-academics-vs-religion-4-print.html"
   ], 
   [
    "21842.html", 
    "http://www.4forums.com/political/religion-debates/10790-academics-vs-religion-3-print.html"
   ], 
   [
    "21843.html", 
    "http://www.4forums.com/political/religion-debates/10790-academics-vs-religion-2-print.html"
   ]
  ], 
  "identifier": 10790
 }
]