[
 [
  [
   297422, 
   null, 
   "GodsCowboy", 
   "Well actually, GOD was PROUD OF YOU long before you ever accomplish anything because HE knew what you were going to do before you do it. \n \n EXAMPLE: When I was little, a single bee bit me on the lip and then bit my younger sister on the eye (weird places to be bit unless it was after water or blessing our body fluids). \n \n At the time the ONLY things that seemed weird was that bees are ONLY suppose to be able to bite one person then they lose their stinger. The other weird thing was this bee bit us even though we didn't bother it and we both didn't move. Plus why DIDN'T it bite the older girl that was with us at the time?\n \n Looking back on that event recently, I decided the bee was GOD'S method for giving me a message that I wouldn't understand until HE wanted me to (now). It was HIS way of letting me know today that HE approves (the KISS from a bee) of the work I'm doing for HIM. I'm NOT sure of my sister's message because I haven't discussed this topic with her yet. But the topic should come up when she gets a copy of this message. I'm looking forward to listening to her thoughts on the subject.\n \n If you HAVEN'T found a message from GOD in your past, you can look for a current message. When HE'S proud of you, things start getting easy for you. By that I mean, you start getting extremely lucky when you do things that should be difficult for you. It almost ALWAYS happens when you help others; design/create things to help others; or see something that GOD would want people to do something about, so you start trying to think of a way to do something about that problem. \n \n I BELIEVE John F. Kennedy might have made GOD proud of him because of what he said in one of his speeches (... Some people see things as they are and say why. Other people see things as they should be and say why not.). \n \n AN EXTREMELY LUCKY EXAMPLE: If you start building something and all the extra pieces turn out to be the exact sizes you need when you should be out of materials, you just might have had some help from GOD. On the other hand, if things aren't working out as easy as you expected, GOD might be trying to make you take a break because you're about to make a mistake or you need something you haven't thought of or you don't know about yet. \n \n It's weird but it's REALLY COOL when you start to figure out what's going on. Unfortunately, learning to understand GOD is a lot more complicated than learning to crawl, walk, run, and talk. That's because GOD is a lot more complicated than man and there is ONLY one way to learn what GOD'S willing to teach you. That's wait for HIM to decide to teach it to you. Remember, GOD is EVERYWHERE and HE controls EVERYTHING except man. Man was given a FREE WILL to decide if he wants to be GOD'S SERVANT or not. So GOD will use everything to teach and help you. You'll learn what HE wants you to know when HE wants it to happen because HE knows what will work and HE knows the future.\n \n The other way GOD lets you know HE'S PROUD of you and what you're doing, is by HIS messages from plants; animals; clouds; nature; wind; ... HE can use anything to give us clues to learn things and to help us help others. \n \n I'm NOT Doctor Doolittle. I CAN'T talk to the animals but once and awhile I understand the message GOD gave them to give to me. Geckoes are always showing me things that trigger thoughts or give me a hint when I think I'm stuck. I guess it's like Christ said, if you have faith you can move a mountain. \n \n I've started to BELIEVE every time I see a gecko GOD'S trying to tell me something. So every time I see one I start searching for that help ( I guess they're my HELPERS) and sure enough I always get a message. Sometimes I DON'T understand the help right away. But later something else will trigger my memory of the earlier gecko event and I'll know what GOD wanted me to know back then. I might not have gotten the help I needed that time but that experience gave me another clue as to how GOD works and what I should look for or at the next time it happens. \n \n It's like learning the meaning to a new word your parents have said over and over again but you aren't smart enough to talk yet. However, you have learned to understand a few noises that your parents make from time to time. Like bottle means you're going to get fed.\n \n I BELIEVE this works for me because I put GOD in charge. I DON'T ask for anything other than ETERNAL REWARDS. I let HIM DECIDE what I NEED and DON'T NEED. I might let HIM know what I'd like to have but I let HIM decide if I need it or not. HE knows what HE wants me to do for HIM and sometimes the things I think I want might make accomplishing the missions HE has for me harder or even impossible. So I tell HIM NOT to give me anything that'll make it harder for me to do HIS WORK or make it easier for the devil to tempt me. In other words HE'S in the BEST position to decide what I need and/or DON'T need. So I let HIM make those decisions.\n \n One last recommendation, remember patients is faith. Don't expect GOD to jump every time you ask for HIS help. In time (could be a long time), you will notice faster and faster responses to your needs, if you ask HIM to help you so you can help others. GOD DOESN'T seem to be as excited about helping you to help yourself. HE wants other people to help you. I guess HE'S trying to teach us to HELP EACH OTHER (PAY IT FORWARD). \n \n Now you know how to find out if GOD is PROUD OF YOU AND WHAT YOUR DOING and your on your way to understand and communicating with HIM.", 
   {
    "post_info": {
     "post_title": "How Do You Know GOD\u0092S Proud Of You? (POST #85)"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1200371460.0
  ], 
  [
   297457, 
   null, 
   "Symbiote", 
   "Yeah once a dog humped my leg, that was god's way of letting me know he wanted me to pursue a career in professional kickboxing.\n \n If you want to watch god's plan in action, forget the televangelists, just switch over to \"when animals attack\", you'll find that snakehandlers are especially blessed.", 
   {}, 
   297422, 
   null, 
   1200400440.0
  ], 
  [
   297460, 
   null, 
   "lesz", 
   "If you want to make sure god is proud of you, use lots of random bold and capitalised text. emoticon_xclown", 
   {}, 
   297457, 
   null, 
   1200406140.0
  ], 
  [
   297467, 
   null, 
   "Penfold", 
   "He's proud of us? If we are the best He could do, what an Underachiever!", 
   {}, 
   297460, 
   null, 
   1200410460.0
  ], 
  [
   297479, 
   null, 
   "Zardoz", 
   "Well actually, :( emoticon_ic emoticon_wow emoticon_love emoticon_xchicken emoticon_hb emoticon_cool emoticon_smile emoticon_ic emoticon_xgood ...\n \n \n You have included 47 images in your message. You are limited to using 10 images so please go back and correct the problem and then continue again. \n\n \n \"I think there should be something in science called the \"reindeer effect.\" I don't know what it would be, but I think it'd be good to hear someone say, \"Gentlemen, what we have here is a terrifying example of the reindeer effect.\"\"\n -Jack Handy\n \n \n Gentlemen, what we have here is a terrifying example of the Reindeer Effect", 
   {
    "unicode_changes_made": true
   }, 
   297422, 
   null, 
   1200416040.0
  ], 
  [
   298953, 
   null, 
   "charlie horse", 
   "Well actually, GOD was PROUD OF YOU long before you ever accomplish anything because HE knew what you were going to do before you do it...\n\n Are you saying that we don't have free will, or that our actions are pre-determined? If we have free will, how does your god know our intended actions? Isn't this a perverse dichotomy? I didn't read ANY of the rest of your eye-sore post.", 
   {}, 
   297422, 
   null, 
   1201544640.0
  ], 
  [
   298956, 
   null, 
   "peteratwar", 
   "He's proud of us? If we are the best He could do, what an Underachiever!\n\n \n You sometimes despair of your children. It is what, in his opinion, they grow into that counts.\n \n His opinion he keep to himself.", 
   {}, 
   297467, 
   null, 
   1201545780.0
  ], 
  [
   299002, 
   null, 
   "GodsCowboy", 
   "Well actually, GOD was PROUD OF YOU long before you ever accomplish anything because HE knew what you were going to do before you do it. \n ...\n \n\n \n \nAre you saying that we don't have free will, or that our actions are pre-determined? If we have free will, how does your god know our intended actions? Isn't this a perverse dichotomy? I didn't read ANY of the rest of your eye-sore post.\n\n \n No I was referring to GOD'S ability to know EVERYTHING. So HE knows what you're going to do before you do it. Just like HE told/tells HIS prophets to predict things. HE lets us live our lives all the time KNOWING exactly what we are going to do long before we do it. Look how many generations it took for HIS prediction that Christ would be born. HE needed that time to teach and prepare all of Christ's relatives so they would bring him up right. HE also had to know which family would be willing to do the right things. The things that would make it happen. The things that would create the knowledge and skills needed to raise and teach Christ for the mission GOD knew he would be willing to do.\n \n I was also assuming everyone that reads these posts is good enough to make GOD PROUD of them. A better position to take than to throw stones.", 
   {}, 
   298953, 
   null, 
   1201578240.0
  ], 
  [
   299003, 
   null, 
   "Penfold", 
   "If a God knew beforehand what we were going to do, then we would have no choice. Even if we thought we had a choice, we wouldn't have. We could only do what God already knew we were going to do. If we have no choice, then we do not have free will.", 
   {}, 
   299002, 
   null, 
   1201579260.0
  ], 
  [
   299019, 
   null, 
   "obvious_child", 
   "If a God knew beforehand what we were going to do, then we would have no choice. Even if we thought we had a choice, we wouldn't have. We could only do what God already knew we were going to do. If we have no choice, then we do not have free will.\n\n \n Penfold, are you actually trying to logically reason with him?\n \n you know full well that his type of people are impervious to logic, reason and critical thinking.", 
   {}, 
   299003, 
   null, 
   1201585260.0
  ], 
  [
   299148, 
   null, 
   "GodsCowboy", 
   "If a God knew beforehand what we were going to do, then we would have no choice. Even if we thought we had a choice, we wouldn't have. We could only do what God already knew we were going to do. If we have no choice, then we do not have free will.\n\n \n You DON'T UNDERSTAND the concept. \n \n The CONCEPT is you have a choice but GOD ALREADY KNOWS what choice you're going to make. \n \n But HE can and sometime does use the things HE CONTROLS (nature wind, animals, plants) and the people that let HIM control them (prophets/HIS SERVANTS) to make us choose the choice HE wants us to make. We STILL have a choice but HE already knows which choice we're going to make. HE ONLY does that when HE NEEDS to be in control to make the RIGHT THINGS happen at the RIGHT TIME. \n \n EXAMPLE: The FLOOD - GOD controlled nature to destroy the world. Noah let GOD control hiim to save all the animals. As a result Noah and his family were rewarded. The animal they saved made it possible for them to live. Those that died had a choice. They could have believed Noah and built an arc themselves but GOD knew they wouldn't. GOD also knew Noah WOULD trust HIM enough to do what HE asked NO MATTER how foolish he looked or how much the population laughed at him. GOD might have liked to have gotten Noah to be something else but if Noah wouldn't let GOD be in control for that event it wouldn't happen. GOD KNOWS just what WILL WORK and what WON'T. GOD knows what you and/or I are WILLING to do for HIM and what you and or I are NOT willing to do for HIM.", 
   {}, 
   299003, 
   null, 
   1201671300.0
  ], 
  [
   299150, 
   null, 
   "Penfold", 
   "If he knows something will happen, then we can only \"choose\" the choice that makes it happen, and not the choice that doesn't.\n \n Separately, an interesting point on the flood myth is that when the Jesuits arrived in China, and spoke of the flood, the Chinese looked up their ancient history books of the time the flood was supposed to have happened, and found no record of it.", 
   {}, 
   299148, 
   null, 
   1201673460.0
  ], 
  [
   299154, 
   null, 
   "smiley", 
   "You DON'T UNDERSTAND the concept. \n \n The CONCEPT is you have a choice but GOD ALREADY KNOWS what choice you're going to make. \n \n But HE can and sometime does use the things HE CONTROLS (nature wind, animals, plants) and the people that let HIM control them (prophets/HIS SERVANTS) to make us choose the choice HE wants us to make. We STILL have a choice but HE already knows which choice we're going to make. HE ONLY does that when HE NEEDS to be in control to make the RIGHT THINGS happen at the RIGHT TIME. \n \n EXAMPLE: The FLOOD - GOD controlled nature to destroy the world. Noah let GOD control hiim to save all the animals. As a result Noah and his family were rewarded. The animal they saved made it possible for them to live. Those that died had a choice. They could have believed Noah and built an arc themselves but GOD knew they wouldn't. GOD also knew Noah WOULD trust HIM enough to do what HE asked NO MATTER how foolish he looked or how much the population laughed at him. GOD might have liked to have gotten Noah to be something else but if Noah wouldn't let GOD be in control for that event it wouldn't happen. GOD KNOWS just what WILL WORK and what WON'T. GOD knows what you and/or I are WILLING to do for HIM and what you and or I are NOT willing to do for HIM.\n\n Evidently, it's you who doesn't understand the concept.\n \n If God can use people/nature to make other people do things, then that is not free will. Also, if God already knows what is going to happen and he needs to use people/nature to make other people do what he already knows is going to happen, then he is himself restricted by what is already preordained. That is not free will. Have you ever heard of determinism?\n \n If your god already knows what is going to happen (stands outside of time, knowing what eternity will bring), that is fair enough (making the very big assumption that he even exists). However, the moment he intervenes to make something happen, that completely wipes the free will aspect.\n \n You cannot argue that you have free will, but only if god allows you to have it.\n \n And as for the great flood, don't even go there. It's complete garbage. Didn't happen. It is, at best, what the people of the time (presumably Noah or his clan - as noone else would have been around to write of it) believed was happening. Perhaps a large local flood, but not a worldwide thing. Unless of course you can produce conclusive evidence to the contrary.\n \n Smiley", 
   {}, 
   299148, 
   null, 
   1201674180.0
  ], 
  [
   299155, 
   null, 
   "electrolyte", 
   "Separately, an interesting point on the flood myth is that when the Jesuits arrived in China, and spoke of the flood, the Chinese looked up their ancient history books of the time the flood was supposed to have happened, and found no record of it.\n\n Penfold, you know that these people never let reality get in the way of their beliefs.", 
   {}, 
   299150, 
   null, 
   1201674480.0
  ], 
  [
   299157, 
   null, 
   "smiley", 
   "If he knows something will happen, then we can only \"choose\" the choice that makes it happen, and not the choice that doesn't.\n \n Separately, an interesting point on the flood myth is that when the Jesuits arrived in China, and spoke of the flood, the Chinese looked up their ancient history books of the time the flood was supposed to have happened, and found no record of it.\n\n Now that is interesting. Indeed, it is strange that there would have even been any Chinese records of the time of the great flood, as there would have been no survivors to record the event.\n \n In fact, how could there possibly be any records of that time that didn't mention this great flood as the only survivors would have to have been on the ark. Hmmmmm, the plot thickens.\n \n Smiley", 
   {}, 
   299150, 
   null, 
   1201674480.0
  ], 
  [
   299172, 
   null, 
   "obvious_child", 
   "You DON'T UNDERSTAND the concept. \n \n The CONCEPT is you have a choice but GOD ALREADY KNOWS what choice you're going to make. \n\n \n Then free will does not exist. If God already knows what your choice is and God exists outside of time, your choice has already been determined for you before you were ever created. This is very simple concept. \n \n If God who exists before time and create already knows what will happen before it creates it, free will cannot exist. \n \n The flood is a lie.\n \n http://www.4forums.com/political/showthread.php?t=8816\n \n You CAN TRY to argue that those don't invalidate it, but you will fail.", 
   {}, 
   299148, 
   null, 
   1201684620.0
  ], 
  [
   299176, 
   null, 
   "snakespit", 
   "EXAMPLE: When I was little, a single bee bit me on the lip and then bit my younger sister on the eye (weird places to be bit unless it was after water or blessing our body fluids).\n\n Bees do not bite, they sting. And I hate to break up your divine memory, but not all bees die after stinging. It depends on what kind of bee it was that \"bit\" you. \n \n \nLooking back on that event recently, I decided the bee was GOD'S method for giving me a message that I wouldn't understand until HE wanted me to (now). It was HIS way of letting me know today that HE approves (the KISS from a bee) of the work I'm doing for HIM. I'm NOT sure of my sister's message because I haven't discussed this topic with her yet. But the topic should come up when she gets a copy of this message. I'm looking forward to listening to her thoughts on the subject.\n\n I think you are bordering on lunacy. Seriously. I'm not trying to be mean, but stop and really think about what you posted. If it actually makes sense to you, seek help. I in no way intend this to be an insult, so please don't take it that way, but this almost borders on delusional thought. \n \n \nI'm NOT Doctor Doolittle. I CAN'T talk to the animals but once and awhile I understand the message GOD gave them to give to me. Geckoes are always showing me things that trigger thoughts or give me a hint when I think I'm stuck. I guess it's like Christ said, if you have faith you can move a mountain. \n \n I've started to BELIEVE every time I see a gecko GOD'S trying to tell me something. So every time I see one I start searching for that help ( I guess they're my HELPERS) and sure enough I always get a message. Sometimes I DON'T understand the help right away. But later something else will trigger my memory of the earlier gecko event and I'll know what GOD wanted me to know back then. I might not have gotten the help I needed that time but that experience gave me another clue as to how GOD works and what I should look for or at the next time it happens.\n\n \n *CGS Eyewitness News flash*\n \n \"Man sent to mental institution after watching series of Geico commercials, film at 11...\"", 
   {
    "unicode_changes_made": true
   }, 
   297422, 
   null, 
   1201689240.0
  ], 
  [
   299192, 
   null, 
   "Zardoz", 
   "\n *CGS Eyewitness News flash*\n \n \"Man sent to mental institution after watching series of Geico commercials, film at 11...\"\n\n \n \n You know, I was going to make a similar comment about that loveable mascot...but thought it might be too obtuse...", 
   {}, 
   299176, 
   null, 
   1201703700.0
  ], 
  [
   299194, 
   null, 
   "MrWriteLA", 
   "Best commercials ever.", 
   {}, 
   299192, 
   null, 
   1201704120.0
  ], 
  [
   299344, 
   null, 
   "GodsCowboy", 
   "Bees do not bite, they sting. And I hate to break up your divine memory, but not all bees die after stinging. It depends on what kind of bee it was that \"bit\" you. \n \n \n I think you are bordering on lunacy. Seriously. I'm not trying to be mean, but stop and really think about what you posted. If it actually makes sense to you, seek help. I in no way intend this to be an insult, so please don't take it that way, but this almost borders on delusional thought. \n \n \n \n *CGS Eyewitness News flash*\n \n \"Man sent to mental institution after watching series of Geico commercials, film at 11...\"\n\n \n Unfortunately, FOOLS have ALWAYS ASSUMED anything THEY DIDN'T already know and believe had to be FALSE or CRAZY.\n \n EXAMPLES: Man will NEVER FLY. Sure man is going to land on the moon!!! This idoit thinks the WORLD IS ROUND. So thanks for the compliment, it puts me in GOOD COMPANY.", 
   {}, 
   299176, 
   null, 
   1201750860.0
  ], 
  [
   299362, 
   null, 
   "smiley", 
   "Unfortunately, FOOLS have ALWAYS ASSUMED anything THEY DIDN'T already know and believe had to be FALSE or CRAZY.\n \n EXAMPLES: Man will NEVER FLY. Sure man is going to land on the moon!!! This idoit thinks the WORLD IS ROUND. So thanks for the compliment, it puts me in GOOD COMPANY.\n\n \n Well, the first sentence discribes you to a T. It's nice that you finally admit it.\n \n As for your examples . . . . er . . . . can anyone else make sense of them? We have a complete mixture here, so I fail to see what they are examples of.\n \n Smiley", 
   {}, 
   299344, 
   null, 
   1201757100.0
  ], 
  [
   299370, 
   null, 
   "obvious_child", 
   "Well, the first sentence discribes you to a T. It's nice that you finally admit it.\n \n As for your examples . . . . er . . . . can anyone else make sense of them? We have a complete mixture here, so I fail to see what they are examples of.\n \n Smiley\n\n \n Do you know of any studies that compare the effects of hallucinogens to religious fevor?", 
   {}, 
   299362, 
   null, 
   1201758960.0
  ], 
  [
   299378, 
   null, 
   "Undeterred", 
   "####, Rubbish, NONSENSE, gibberish, garbage, ####, ####, GARBAGE Christ, God, ####, rubbish, ####.\n\n \n Wow. DEE - LOO - ZHUN - AL.\n \n The perverse thing about this kind of #### rubbish nonsense is it doesn't matter how big the misfortune is. It starts with \"a bee bit me\", but it could just as easily be \"so your wife and daughter were tortured, raped, and killed - that was God's loving way of sending you a message, or teaching you something. You have to see God's purpose in everything. My wife died an agonising death from cervical cancer and that was God showing me... (x, y, and z).\"\n \n Sick. \n \n Hey GodsCowboy. A bee stinging you is a BAD THING... A BAAAAAD THING. Stingy stingy, bitey bitey!", 
   {}, 
   299002, 
   null, 
   1201762560.0
  ], 
  [
   299382, 
   null, 
   "smiley", 
   "Do you know of any studies that compare the effects of hallucinogens to religious fevor?\n\n \n Other than, \"Religion is the opiate of the people\", I'm afraid not.\n \n Smiley", 
   {}, 
   299370, 
   null, 
   1201764840.0
  ], 
  [
   299393, 
   null, 
   "pandion", 
   "Well actually, GOD was PROUD OF YOU long before you ever accomplish anything because HE knew what you were going to do before you do it.\nNice use of meaningless boldface. Can you offer any evidence that you god exists?\n \nEXAMPLE: When I was little, a single bee bit me on the lip and then bit my younger sister on the eye (weird places to be bit unless it was after water or blessing our body fluids).\nThe bodily fluid part reminds me of the nut case Air Force General in the \"Dr. Strangelove\" movie. Your use of the term is as crazy as the movie.\n \nAt the time the ONLY things that seemed weird was that bees are ONLY suppose to be able to bite one person then they lose their stinger.\nAre you sure it was a bee and not a wasp. For example, most people can't tell the difference between a bee and a yellow-jacket. Yellow-jackets are wasps. They don't sting - the bite. They are also quite aggressive and will bite. Of course, you indicate your ignorance by stating the the bees bite (rather than sting) and then lose the stinger.\n \nThe other weird thing was this bee bit us even though we didn't bother it and we both didn't move. Plus why DIDN'T it bite the older girl that was with us at the time?\nAh! A wasp that actually does bite rather than sting. So, why is this other girl meaningful? Is this wasp supposed to look around for victims?\n \nLooking back on that event recently, I decided the bee was GOD'S method for giving me a message that I wouldn't understand until HE wanted me to (now).\nOf course it was. You're delusional.", 
   {
    "unicode_changes_made": true
   }, 
   297422, 
   null, 
   1201768620.0
  ], 
  [
   299397, 
   null, 
   "obvious_child", 
   "Other than, \"Religion is the opiate of the people\", I'm afraid not.\n \n Smiley\n\n \n I bet SOMEONE has compared the brain chemistry of a drug user to the brain chemistry of a religious person caught in fevor.", 
   {}, 
   299382, 
   null, 
   1201773000.0
  ], 
  [
   299410, 
   null, 
   "HonestAbe", 
   "Wow. DEE - LOO - ZHUN - AL.\n \n The perverse thing about this kind of #### rubbish nonsense is it doesn't matter how big the misfortune is. It starts with \"a bee bit me\", but it could just as easily be \"so your wife and daughter were tortured, raped, and killed - that was God's loving way of sending you a message, or teaching you something. You have to see God's purpose in everything. My wife died an agonising death from cervical cancer and that was God showing me... (x, y, and z).\"\n \n Sick. \n \n Hey GodsCowboy. A bee stinging you is a BAD THING... A BAAAAAD THING. Stingy stingy, bitey bitey!\n\n \n Incredible. I image there are those who won't get out of bed unless they get a sign from their magical god. They probably live on welfare too.", 
   {}, 
   299378, 
   null, 
   1201789740.0
  ], 
  [
   299535, 
   null, 
   "snakespit", 
   "So thanks for the compliment, it puts me in GOOD COMPANY.\n\n \n Oh no no...please don't GET THIS WRONG. It was in no way a compliment, nor was it meant to be derogatory. I was actually saying...that I absolutely 100% without equivocation believe that you are MENTALLY ILL.", 
   {}, 
   299344, 
   null, 
   1201821840.0
  ], 
  [
   299551, 
   null, 
   "Zardoz", 
   "Oh no no...please don't GET THIS WRONG. It was in no way a compliment, nor was it meant to be derogatory. I was actually saying...that I absolutely 100% without equivocation believe that you are MENTALLY ILL.\n\n \n Ummm, in some circumstances, that would put him with GOOD COMPANY.\n \n \n \n \n Question.\n Would mocking GC be related to bear baiting?\n I do so love bear baiting.\n Fact: Bears love baiting.\n Bears\n Baiting\n Believing in God.", 
   {}, 
   299535, 
   null, 
   1201823340.0
  ], 
  [
   299557, 
   null, 
   "thelmoose", 
   "Do you know of any studies that compare the effects of hallucinogens to religious fevor?\n\n \n Yes.\n \n J Neuropsychiatry Clin Neurosci 1997; 9:498-510 \n The neural substrates of religious experience\n JL Saver and J Rabin \n UCLA-Reed Neurologic Research Center 90095, USA. \n \n ABSTRACT\n Religious experience is brain-based, like all human experience. Clues to the neural substrates of religious-numinous experience may be gleaned from temporolimbic epilepsy, near-death experiences, and hallucinogen ingestion. These brain disorders and conditions may produce depersonalization, derealization, ecstasy, a sense of timelessness and spacelessness, and other experiences that foster religious-numinous interpretation. Religious delusions are an important subtype of delusional experience in schizophrenia, and mood-congruent religious delusions are a feature of mania and depression. The authors suggest a limbic marker hypothesis for religious-mystical experience. The temporolimbic system tags certain encounters with external or internal stimuli as depersonalized, derealized, crucially important, harmonious, and/or joyous, prompting comprehension of these experiences within a religious framework. \n \n \n You might get a full text if you click  here.", 
   {}, 
   299370, 
   null, 
   1201823940.0
  ], 
  [
   299646, 
   null, 
   "Symbiote", 
   "As a provisionally registered psychologist, I would tend to basically agree with this assessment and would be looking towards something along the lines of autism spectrum disorder.", 
   {}, 
   299557, 
   null, 
   1201878720.0
  ], 
  [
   299662, 
   null, 
   "Ripskar", 
   "Do you know of any studies that compare the effects of hallucinogens to religious fevor?\n\n \n There is a paper that links \"religious experience\" to a marker gene for a degenerative brain condition. Evangelical groups are well known for using neuro-linguistic techniques to induce certain emotional states effectively addicting the audience. Drumming and lighting effects are integral components of their methods to break down normal psychological boundries. etc. Though these are strictly described under propaganda and brain washing in the scientific literature.", 
   {}, 
   299370, 
   null, 
   1201886640.0
  ], 
  [
   299672, 
   null, 
   "charlie horse", 
   "Looking back on that event recently, I decided the bee was GOD'S method for giving me a message...\n\n Have you read Deuteronomy 18:10 recently? It seems to me that not only are you looking for omens, you are actually finding them. Your god would be proud of you for ignoring his counsel.", 
   {
    "unicode_changes_made": true
   }, 
   299662, 
   null, 
   1201892220.0
  ], 
  [
   299687, 
   null, 
   "snakespit", 
   "Then again folks, lot of sane people get messages from animals all the time...perhaps we should not be scoffing at his account.\n \n A great example", 
   {}, 
   299672, 
   null, 
   1201899480.0
  ], 
  [
   299709, 
   null, 
   "Zardoz", 
   "Then again folks, lot of sane people get messages from animals all the time...perhaps we should not be scoffing at his account.\n \n A great example\n\n \n That Son of Sam\n That Son of Sam\n He commands me to kill my fellow man.\n \n Oh Son of Sam\n Oh Son of Sam\n How shall I follow thy command?\n \n Shall I kill them with a bomb\n Shall I kill them with a plum\n Shall I use a shapened knife\n How shall I take their dear old life?\n \n Thou shall kill them with a gun\n You shall do it and have some fun.\n Kill them in the park at night\n Kill them 'cause you know it's right.\n \n Kill all those of the yellow hair\n Not one life shall you dare to spare.\n \n Sorry there...the Son of Seuss was speaking to me through my Great Dane puppy.\n She just won't shut up.\n \n @Charlie, don't bother, GC doesn't listen. He's little better than a bot. If he weren't so entertaining, I'd seek to have him banned as he doesn't 'debate'. \n \n @Ripskar, yep. I'd like to see the several million 'followers' wake up one day and realize that psychological manipulation was use on them.\n But, like most victims of con-men, they'd just resort to denial.\n \n \n CanAH GettAH AmenAH\n \n Ya just ain't preaching unless you gettah the ah at the endah of your wordsah!\n \n Hellyahloosah!", 
   {}, 
   299687, 
   null, 
   1201907280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How Do You Know GOD\u0092S Proud Of You? (POST #85)", 
  "url": "http://www.4forums.com/political/religion-debates/10809-how-do-you-know-god-s-proud-you-post-85-a.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10809, 
  "discussion_files": [
   [
    "23865.html", 
    "http://www.4forums.com/political/religion-debates/10809-how-do-you-know-god-s-proud-you-post-85-a-print.html"
   ], 
   [
    "23866.html", 
    "http://www.4forums.com/political/religion-debates/10809-how-do-you-know-god-s-proud-you-post-85-a-3-print.html"
   ], 
   [
    "23867.html", 
    "http://www.4forums.com/political/religion-debates/10809-how-do-you-know-god-s-proud-you-post-85-a-2-print.html"
   ]
  ], 
  "identifier": 10809
 }
]