[
 [
  [
   297414, 
   null, 
   "GodsCowboy", 
   "Young kids think they can CONVIENCE their parents to see things their way. However, their PARENTS (LIKE GOD) know more about the world, bad people and things that their children haven't learned yet. Still the Children BELIEVE their parents will give in and allow them to break their laws. They BELIEVE their parent will do away with the laws because no one else has to follow those laws. They think those laws are STUPID. But the OLDER and WISER parents continue to ENFORCE the LAWS.\n \n Well, GUESS WHAT. GOD knows more than you or I. If HE gives us a LAW there's a GOOD REASON for it. HE ISN'T going to change the LAW just because some cry babies DON'T like it. HE wants to PROTECT HIS CHILDREN. So HE gives us LAWS to help us stay safe and happy just like parents give their children laws. But just like little kids we AREN'T smart enough to UNDERSTAND GOD and we DON'T have HIS WISDOM so we ASSUME HIS LAWS AREN'T IMPORTANT.\n \n GOD wants to know WHEN are we going to GROW UP (in faith in HIM)? We have to TRUST GOD like a LITTLE CHILD or YOUNG ADULT should TRUST his or her parents. GOD DOESN'T give us LAWS for the FUN of it. They WON'T CHANGE and HE ISN'T going to let you break it just because you DON'T think it's that big a deal.\n \n Some day just like those little kids, you're going to know why GOD gave you those laws. The question is: Will it be when you get PUNISHED by HIS COURT and HIS LAW ENFORCEMENT DEPARTMENT like a young adult that gets punished for DUI. Or will it be when get rewarded because you followed HIS LAWS.\n \n The person that follows GOD'S LAWS gets to see what happens to others that DON'T obey HIS LAWS. Like a young adult that obeyd his or her parents and DIDN'T drink and drive but heard and seen about what happened to his or her friends that did. Now he or she knows why his or her parents wouldn't let him or her go to the bar with their friends last night. He or she is glad they OBEYED their parents' STUPID LAWS.\n \n The question is: Will you be smart enough to OBEY GOD'S LAWS or Will you be one of the ones that HAS to learn the HARD WAY?", 
   {
    "post_info": {
     "post_title": "PARABLE OF THE CRY BABY KIDS (Post #84)"
    }
   }, 
   null, 
   null, 
   1200369360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  PARABLE OF THE CRY BABY KIDS (Post #84)", 
  "url": "http://www.4forums.com/political/religion-debates/10808-parable-cry-baby-kids-post-84-a.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10808, 
  "discussion_files": [
   [
    "17483.html", 
    "http://www.4forums.com/political/religion-debates/10808-parable-cry-baby-kids-post-84-a-print.html"
   ]
  ], 
  "identifier": 10808
 }
]