[
 [
  [
   18251, 
   null, 
   "voiceofreason", 
   "Sarah Brady emphasizes that the laws that she advocates will not rob anybody of their personal freedoms. She also states that it's not her agenda to take away guns from law abiding citizens. She says that she just wants to reduce gun violence in America. Doesn't this sound rational?\n \n \"I do not advocate taking guns away from law abiding citizens or prohibiting law abiding citizens from owning or purchasing guns. But I do want to be sure that fugitives, felons, children, people who are mentally ill and people who have committed misdemeanors or felonies for spousal or child abuse are not able to purchase or get hold of a firearm....The slight inconvenience of a wait for a law abiding citizen cannot match the inconvenience and devastation that the victims and the families of gun violence have to endure....I want to emphasize that my goal and the goal of my organization is to reduce gun violence in this nation. We have no hidden agenda to eliminate a law abiding citizen the right to own or purchase guns. No one would readily hand a weapon to another knowing they were going to commit a murder or rob a bank. Without common sense laws however, that's precisely what our nation did for many years. I feel that by closing loop holes in the instant check system, (which includes a three day waiting period to allow for the most comprehensive background check possible) closing the gun show loop hole (which would mandate that all gun show purchases would be subject to the waiting period and background check) and by extending the background check to all purchases (not just purchases from dealers) we would go a long way in solving our problems. Additionally, a law making adults responsible for keeping guns out of the hands of children is necessary as well as laws regulating the manufacture of guns in the same way any other manufactured item in this nation is held responsible....I hope that all citizens will take the reduction of gun violence as a personal responsibility. A majority of gun owners are responsible with their firearms and have supported our program as well. To the small number of people who still believe that laws will somehow erode their personal freedom, I want to assure you that that is not the intention nor will it be the result. We all have a responsibility to save lives and to make this nation a safer place for our children and grandchildren. Let's all work together to reduce the violence. And to those who resent a waiting period, I ask you: Isn't sacrificing three days worth saving the lives of your fellow men and women?\" \n -Sarah Brady http://abcnews.go.com/sections/us/DailyNews/chat_990226brady.html", 
   {
    "post_info": {
     "post_title": "A reasonable rational plan to reduce gun violence?"
    }
   }, 
   null, 
   null, 
   1065359280.0
  ], 
  [
   18260, 
   null, 
   "kelvin90701", 
   "Sarah Brady emphasizes that the laws that she advocates will not rob anybody of their personal freedoms. She also states that it's not her agenda to take away guns from law abiding citizens. She says that she just wants to reduce gun violence in America. Doesn't this sound rational?\n \n \"I do not advocate taking guns away from law abiding citizens or prohibiting law abiding citizens from owning or purchasing guns. But I do want to be sure that fugitives, felons, children, people who are mentally ill and people who have committed misdemeanors or felonies for spousal or child abuse are not able to purchase or get hold of a firearm....The slight inconvenience of a wait for a law abiding citizen cannot match the inconvenience and devastation that the victims and the families of gun violence have to endure....I want to emphasize that my goal and the goal of my organization is to reduce gun violence in this nation. We have no hidden agenda to eliminate a law abiding citizen the right to own or purchase guns. No one would readily hand a weapon to another knowing they were going to commit a murder or rob a bank. Without common sense laws however, that's precisely what our nation did for many years. I feel that by closing loop holes in the instant check system, (which includes a three day waiting period to allow for the most comprehensive background check possible) closing the gun show loop hole (which would mandate that all gun show purchases would be subject to the waiting period and background check) and by extending the background check to all purchases (not just purchases from dealers) we would go a long way in solving our problems. Additionally, a law making adults responsible for keeping guns out of the hands of children is necessary as well as laws regulating the manufacture of guns in the same way any other manufactured item in this nation is held responsible....I hope that all citizens will take the reduction of gun violence as a personal responsibility. A majority of gun owners are responsible with their firearms and have supported our program as well. To the small number of people who still believe that laws will somehow erode their personal freedom, I want to assure you that that is not the intention nor will it be the result. We all have a responsibility to save lives and to make this nation a safer place for our children and grandchildren. Let's all work together to reduce the violence. And to those who resent a waiting period, I ask you: Isn't sacrificing three days worth saving the lives of your fellow men and women?\" \n -Sarah Brady http://abcnews.go.com/sections/us/DailyNews/chat_990226brady.html\n\n \n Sarah Brady, not wanting to take away my rights? I have magazines that only hold 10 bullets and should be able to hold more if it were not for her. My extra bullets never violated anyones rights.\n \n I have been tried, convicted, and found guilty by Sarah Brady. I will be willing to give up my guns, a slight inconvience, if Sarah Brady agrees to some slight inconvience for herself. It is only fair that we all sacrafice a little bit of our rights, not just gun owners. I propose random fully body searches. We don't know who will have them. The only way to assure the saftey of society from guns is to search everyone. Everyone should be inconvienced equally, not just gun owners. It is a trifle inconvince for the good of society. What is 2-3 minutes for the saftey of the children? It won't happen every day. Isn't that worth it?\n \n I am prohibited from performing a background check right now. I can not use the background check system. It would be great if everyone could. That way before employers they hire someone, they too can also use the background check system. What a great idea. Dual use for the system, if everyone can use the background check system for the purpose of firearm transactions, then I can just check and see if my neighbors are: 1) insane 2) convicted felons 3) or arrested for domestic violence.\n \n The waiting period is worthless. The background check is instant. If the background check comes back in 30 minutes, the dealer knows I'm clean, the government knows I'm clean, and Sarah Brady is satisfied I'm clean, then why deny me the right to get my guns. Nothing is served by the waiting period. That is like getting pulled over by a cop. The cops knows your clean, the state knows your clean, but you need to just take time out on the curb for the good of society. No you can not drive away. You just need to sit there and wait. It is called police harassment. That is what Sarah Brady is doing to me. Purposely harassing people who are known to be not guilty of anything.\n \n Sarah Brady does not believe in the the loop hole. Did she do a background check on her son, when she bought him a deer rifle? Under her laws, that transaction was illegal.", 
   {}, 
   18251, 
   null, 
   1065375000.0
  ], 
  [
   18317, 
   null, 
   "DHard3006", 
   "Sarah Brady emphasizes that the laws that she advocates will not rob anybody of their personal freedoms. She also states that it's not her agenda to take away guns from law abiding citizens. She says that she just wants to reduce gun violence in America. Doesn't this sound rational?\n \n \"I do not advocate taking guns away from law abiding citizens or prohibiting law abiding citizens from owning or purchasing guns. But I do want to be sure that fugitives, felons, children, people who are mentally ill and people who have committed misdemeanors or felonies for spousal or child abuse are not able to purchase or get hold of a firearm.....\n\n \n \n Typical gun hater Sarah Brady lies! \n Who does the assault weapon ban keep guns away from? Criminals? \n No gun hater Sarah Brady claims criminals still use assault weapons!\n \n Gun hater Sarah Brady is posting right now on her web page to ban all handguns right now!\n Who does this affect?\n The law abiding citizens right to bear arms!\n Who does this not affect? The criminals!\n \n Gun hater Sarah Brady is a gun hater who's only goal is to ban the right to bear arms! Sarah Brady does not want one law that would keep dangerous criminals in prison to keep guns away from them. Gun hater Sarah Brady like all gun haters wants to ban the right to bear arms while allowing dangerous criminals to remain on the streets of America! Gun hater Sarah Brady just wants to ban the right to bear arms! \n \n Gun hater Sarah Brady like al gun hater blame the right to bear arms for the crimes committed with guns. Not once will a gun hater blame the criminal for the crimes committed with guns!\n \n Common sense gun control laws the gun haters want will only affect the law abiding citizens, not the criminals. But then again this is the group of Americans the gun haters want to take the right to bear arms away from! How is this common sense?\n \n Ask gun hater Sarah Brady how this applies to the gun control laws gun hater Sarah Brady wants:\n Hey here is the definition of infringement\n \n 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n \n Now ask gun hater Sarah Brady how this will affect the criminals since criminals do not obey gun control laws?", 
   {
    "unicode_changes_made": true
   }, 
   18251, 
   null, 
   1065460260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A reasonable rational plan to reduce gun violence?", 
  "url": "http://www.4forums.com/political/gun-control-debates/1081-reasonable-rational-plan-reduce-gun-violence.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1081, 
  "discussion_files": [
   [
    "13898.html", 
    "http://www.4forums.com/political/gun-control-debates/1081-reasonable-rational-plan-reduce-gun-violence-print.html"
   ]
  ], 
  "identifier": 1081
 }
]