[
 [
  [
   297810, 
   null, 
   "DrD", 
   "7-1/2 years ago, after the selection of Bush, the ramblings were that the economy was on its way down; that Bush had nothing to do with it. . .it's the way Clinton left it.\n \n Now, 2 terms later, the Bushmeister has no one to blame for the economy but his policies, practices. Wonder if the economy would have gone down as far as it has with a liberal democrat in the White House?\n \n All we hear about with the liberals is tax and spend. I think George has done a good job at spending and giving the top 2% a nice tax break.\n \n I would like to know from you. . . . . . .How has the Bushmeister's tax breaks over the past 2 terms helped you personally, specifically?  I've seen no difference, period. And I'll bet the difference in my story and conservatives is very close. In actuality no one got a tax break. It's a montra, a sound bite, that some hold onto for their cause. \n \n If you can come up with a tax break, was it worth the price we paid throughout the world with a sensless, unnecessary war and the hundreds of thousands of lives destroyed by this man? WOW! \n \n Are tax breaks just more hype than substance?", 
   {
    "post_info": {
     "post_title": "Isn't it interesting?"
    }
   }, 
   null, 
   null, 
   1200606420.0
  ], 
  [
   300429, 
   null, 
   "Taxi Rob", 
   "I've enjoyed no benefits of the Bush tax cuts, or his policies in general. \n \n As someone who loathes the attitudes of the aspiring wealthy, and chooses to serve those of the working class, I can tell you that my business has suffered considerably.\n \n I'd put it at about 30% less business, especially since many of those working class were military, and they've all shipped out.\n \n The population of National City, CA (home of many stationed in San Diego,) dropped by 28% as a result of Persian Gulf operations since 2002. That can't be good for anyone left living there.", 
   {}, 
   297810, 
   null, 
   1202284260.0
  ], 
  [
   300458, 
   null, 
   "DrD", 
   "I wondered if it was just me. These tax cuts are more rhetoric than reality. Good talking points, period. No substance.", 
   {}, 
   300429, 
   null, 
   1202316420.0
  ], 
  [
   300475, 
   null, 
   "JL...W", 
   "Tax cuts were real enough for those with capital gains. Wage earners, not so much. \n \n \"Federal Taxation of Earnings versus Investment Income 2004\" http://www.itepnet.org/earnan.pdf\n \n \"The central finding of this study is that, on average, the federal government now taxes earnings at two-and-a-half times the effective tax rate it imposes on personal investment income.\"", 
   {}, 
   300458, 
   null, 
   1202324580.0
  ], 
  [
   300516, 
   null, 
   "HonestAbe", 
   "I saw no tax reduction but my wages went down during the time Bush has been in office. I earned more in 1998 than I did in 2007 doing the same job. It was mostly smoke and mirrors and a tax on the next generations.", 
   {}, 
   300475, 
   null, 
   1202341080.0
  ], 
  [
   301852, 
   null, 
   "DrD", 
   "The tax breaks are a main plank in the republican platform. We hear the pundants, Limbaugh, et.al. go on and on and on about tax breaks. I'm still waiting to see evidence of such here. We certainly have a large enrollment of conservatives here so, let's see it. Is it possible this is just ####?", 
   {}, 
   300516, 
   null, 
   1203095220.0
  ], 
  [
   301858, 
   null, 
   "jyoshu", 
   "7-1/2 years ago, after the selection of Bush, the ramblings were that the economy was on its way down; that Bush had nothing to do with it. . .it's the way Clinton left it.\n \n Now, 2 terms later, the Bushmeister has no one to blame for the economy but his policies, practices. Wonder if the economy would have gone down as far as it has with a liberal democrat in the White House?\n\n \n It's interesting. I know the economy is supposedly not doing so well right now, but in point of fact I'm doing better financially right now than I ever have. (And I'm certainly not rich, so it's not because of any policies that \"favor the rich\" as the rhetoric toward Republicans sometimes goes.) It may not have anything to do with anything Bush has done, but the same could just as well be said of any financial benefit I had during Clinton's presidency too.", 
   {}, 
   300429, 
   null, 
   1203096360.0
  ], 
  [
   302183, 
   null, 
   "DrD", 
   "It's interesting. I know the economy is supposedly not doing so well right now, but in point of fact I'm doing better financially right now than I ever have. (And I'm certainly not rich, so it's not because of any policies that \"favor the rich\" as the rhetoric toward Republicans sometimes goes.) It may not have anything to do with anything Bush has done, but the same could just as well be said of any financial benefit I had during Clinton's presidency too.\nThere you go.", 
   {}, 
   301858, 
   null, 
   1203275100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Isn't it interesting?", 
  "url": "http://www.4forums.com/political/politics-debates/10820-isnt-interesting.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 10820, 
  "discussion_files": [
   [
    "5888.html", 
    "http://www.4forums.com/political/politics-debates/10820-isnt-interesting-print.html"
   ]
  ], 
  "identifier": 10820
 }
]