[
 [
  [
   298145, 
   null, 
   "Archangel", 
   "TIPS ON PUMPING GAS (Good information)\n \n \n I don't know what you guys are paying for gasoline.... but here in California we are also paying higher, up to $3.50 per gallon. But my line of work is in petroleum for about 31 years now, so here are some tricks to get more of your money's worth for every gallon..\n \n Here at the Kinder Morgan Pipeline where I work in San Jose , CA we deliver about 4 million gallons in a 24-hour period thru the pipeline. One day is diesel the next day is jet fuel, and gasoline, regular and premium grades. We have 34-storage tanks here with a total capacity of 16,800,000 gallons.\n \n Only buy or fill up your car or truck in the early morning when the ground temperature is still cold. Remember that all service stations have their storage tanks buried below ground. The colder the ground the more dense the gasoline, when it gets warmer gasoline expands, so buying in the afternoon or in the evening....your gallon is not exactly a gallon. In the petroleum business, the specific gravity and the temperature of the gasoline, diesel and jet fuel, ethanol and other petroleum products plays an important role. A 1-degree rise in temperature is a big deal for this business. But the service stations do not have temperature compensation at the pumps.\n \n When you're filling up do not squeeze the trigger of the nozzle to a fast mode. If you look you will see that the trigger has three (3) stages: low, middle, and high. In slow mode you should be pumping on low speed, thereby minimizing the vapors that are created while you are pumping. All hoses at the pump have a vapor return. If you are pumping on the fast rate, some of the liquid that goes to your tank becomes vapor. Those vapors are being sucked up and back into the underground storage tank so you're getting less worth for your money.\n \n One of the most important tips is to fill up when your gas tank is HALF FULL. The reason for this is, the more gas you have in your tank the less air occupying its empty space. Gasoline evaporates faster than you can imagine. Gasoline storage tanks have an internal floating roof. This roof serves as zero clearance between the gas and the atmosphere, so it minimizes the evaporation. Unlike service stations, here where I work, every truck that we load is temperature compensated so that every gallon is actually the exact amount.\n \n Another reminder, if there is a gasoline truck pumping into the storage tanks when you stop to buy gas, DO NOT fill up--most likely the gasoline is being stirred up as the gas is being delivered, and you might pick up some of the dirt that normally settles on the bottom.\n \n Hope this will help you get the most value for your money.\n \n DO SHARE THESE TIPS WITH OTHERS!\n DISCLAIMER: This is an e-mail I received and I'm passing it on as a public service. If any aspect of this information is not accurate, I am not lying or attempting to deceive anyone, but am simply passing it on as a courtesy and a human interest story.", 
   {
    "post_info": {
     "post_title": "TIPS ON PUMPING GAS: (Good information)"
    }
   }, 
   null, 
   null, 
   1200904320.0
  ], 
  [
   298154, 
   null, 
   "electrolyte", 
   "TIPS ON PUMPING GAS\n\n (Any use of the word \"gas\" below refers to the state/phase of matter. \"Gasoline\" refers to fuel.)\n \n Gasoline will vaporize less rapidly at lower temperatures, so it is true that pumping colder gasoline will minimize evaporation.\n \n Vapor will come off of the gasoline at any flow rate. The only reason I can imagine that less vapor would be produced when gasoline is moving at a slow speed is Bernoulli's principle, which would be negated within the hose. Only during the descent down the neck and into the reservoir would this have an effect. But...\n \n The \"airspace\" above the liquid level in the tank will reach some partial pressure of gasoline vapor based on temperature (and any gaseous impurities in the gasoline). Once this level is reached, there will be no net vaporization of gasoline unless some vapor is removed. If the \"vapor return\" pulls a vacuum, this would destroy this equilibrium, allowing the vapor return to stay connected in order to remove vapor for a longer period of time (due to slow gasoline pumping) would likely result in more gasoline evaporating (and subsequently being siphoned off). However, if the vapor return serves only as a non-vacuuming vent, then it is the most efficient way of allowing the tank to fill without pressurizing the tank (which you certainly don't want to do).", 
   {}, 
   298145, 
   null, 
   1200907620.0
  ], 
  [
   298162, 
   null, 
   "Iuris", 
   "And now, just check the actual difference as a percentage of the total bill...", 
   {}, 
   298154, 
   null, 
   1200916080.0
  ], 
  [
   298166, 
   null, 
   "Symbiote", 
   "On a similar note, always take a scale to the supermarket with you, that way you can buy the box of Froot Loopz with up to 1% more in them - remember, products are not precisely uniform!!\n \n Also, industrial dumpsters out the back of groceries are often a cheap source of rotting fruit.", 
   {}, 
   298162, 
   null, 
   1200922860.0
  ], 
  [
   298169, 
   null, 
   "Zardoz", 
   "And remember that these 'penny pinching' tactics aren't really cost-effecient.\n For all your time and effort used to save .25 cents, you may have wasted .33 hours of your finite life. \n A finite life that, when on your death-bed, you'll wish you'd have spent wiser rather than have wasted standing in line, sucking that last 1oz of gas out of a nozzle, jiggling that cereal box.\n \n Sorry guys, I did the math...I won't even waste 10 mins of my life standing in line if I have even something slightly more enjoyable or productive to do with my time. \n \n Oh, I do check prices all the time and inspect the food I'm buying for quality and quantity...\n \n \n Now, if you get enjoyment out of your activities, then it probably is worth it on a subjective level.", 
   {}, 
   298166, 
   null, 
   1200924120.0
  ], 
  [
   298417, 
   null, 
   "Steeeeve", 
   "The buying gas in the morning is a common myth that is probably not true. \n \n http://www.autoeducation.com/blog/item/52/\n \n \nGasoline is stored in underground tanks, which remain at a fairly constant temperature.\n\n \n You hear some people go off on it every now and then", 
   {}, 
   298169, 
   null, 
   1201121700.0
  ], 
  [
   298422, 
   null, 
   "jim's trucking", 
   "The buying gas in the morning is a common myth that is probably not true. \n \n http://www.autoeducation.com/blog/item/52/\n \n \n \n You hear some people go off on it every now and then\nI always buy gasoline in the winter.", 
   {}, 
   298417, 
   null, 
   1201123080.0
  ], 
  [
   298436, 
   null, 
   "thelmoose", 
   "The buying gas in the morning is a common myth that is probably not true. \n \n http://www.autoeducation.com/blog/item/52/\n \n \n \n You hear some people go off on it every now and then\n\n \n Archie is big on jumping on myths as though they were true without checking them out first.", 
   {}, 
   298417, 
   null, 
   1201127640.0
  ], 
  [
   298442, 
   null, 
   "Zardoz", 
   "I've worked at a gas station before.\n \n It's funny watching people go through all sorts of antics to save a penny.\n \n Best time to buy gas is usually the middle of the week.\n Gas prices are jacked up on weekends and holidays ('demand' is up emoticon_rolleyes )\n The morning or noon won't matter nearly as much as whether the gallon is actually a gallon (standards and measurements is important here...and yes, they're checked fairly often for accuracy).\n \n If you're an hourly worker, clock in 1 minute earlier each day. Voila you've just made more money doing that for the whole year that you did by squeezing that last drop of gas out of a hose.\n And saved yourself 4 hours of your life.\n \n If you're salaried...leave early...", 
   {}, 
   298436, 
   null, 
   1201129560.0
  ], 
  [
   298444, 
   null, 
   "Archangel", 
   "Archie is big on jumping on myths as though they were true without checking them out first.\n\n \n Please notice the disclaimer from the OP. \n \n \nDISCLAIMER: This is an e-mail I received and I'm passing it on as a public service. If any aspect of this information is not accurate, I am not lying or attempting to deceive anyone, but am simply passing it on as a courtesy and a human interest story.\n \n", 
   {}, 
   298436, 
   null, 
   1201129920.0
  ], 
  [
   298447, 
   null, 
   "thelmoose", 
   "Please notice the disclaimer from the OP.\n\n \n No, but it is your style. To latch onto ideas and accept them without thinking them through or corroborating them, such as your unfounded assumptions in the MRSA thread that you haven't responded to. \n here and here", 
   {}, 
   298444, 
   null, 
   1201131000.0
  ], 
  [
   298452, 
   null, 
   "Archangel", 
   "No, but it is your style. To latch onto ideas and accept them without thinking them through or corroborating them, such as your unfounded assumptions in the MRSA thread that you haven't responded to. \n here and here\n\n \n The very disclaimer that i posted with the OP is proof that I didn't latch onto anything at all here. I posted it because it came from an Oil Industry Employee who was sharing perceived tips on pumping gas (good information) according to the title. And my disclaimer made clear that i placed no personal investment into the accuracy of the info posted as I have learned that anything I post will be scrutinized, judged and condemned at every possible opportunity by those who hate me. And sure enough, you came through and had to make this personal by insulting me anyway. Thanks for being so consistent.\n \n As to responding to those two posts on the MRSA thread, why bother? I gave my opinion and see no reason to reiterate it or further defend it against your attacks. In other words, I made my point and you refuted it in typical fashion. I'm happy to let your dismissal of my perspective stand.", 
   {}, 
   298447, 
   null, 
   1201132680.0
  ], 
  [
   298454, 
   null, 
   "thelmoose", 
   "\n As to responding to those two posts on the MRSA thread, why bother? I gave my opinion and see no reason to reiterate it or further defend it against your attacks. In other words, I made my point and you refuted it in typical fashion. I'm happy to let your dismissal of my perspective stand.\n\n \n Good, you admit, those statements are\n 1. Merely your opinion\n 2. I refuted them", 
   {}, 
   298452, 
   null, 
   1201132800.0
  ], 
  [
   298473, 
   null, 
   "Archangel", 
   "Good, you admit, those statements are\n 1. Merely your opinion\n 2. I refuted them\n\n \n Yes moose, I admit they are my opinion from the christian perspective, and that you refuted them with your opinion which represents the gay perspective.", 
   {}, 
   298454, 
   null, 
   1201156320.0
  ], 
  [
   298478, 
   null, 
   "JPSartre12", 
   "No, but it is your style. To latch onto ideas and accept them without thinking them through or corroborating them, such as your unfounded assumptions in the MRSA thread that you haven't responded to. \n here and here\n\n \n Trolling now, are we? emoticon_rolleyes", 
   {}, 
   298447, 
   null, 
   1201165740.0
  ], 
  [
   298492, 
   null, 
   "jim's trucking", 
   "No wonder sane people are leaving this site. It seems that every gahdamned thread started eventually turns into a Christian vs. gay urination contest.", 
   {}, 
   298478, 
   null, 
   1201191420.0
  ], 
  [
   298498, 
   null, 
   "thelmoose", 
   "No wonder sane people are leaving this site. It seems that every gahdamned thread started eventually turns into a Christian vs. gay urination contest.\n\n \n Wait a minute.\n I disagreed with Archie. \n He framed it as a christian vs. gay argument.\n The issues at hand were gasoline volatility and skin infections.", 
   {}, 
   298492, 
   null, 
   1201194000.0
  ], 
  [
   298514, 
   null, 
   "Archangel", 
   "Wait a minute.\n I disagreed with Archie. \n He framed it as a christian vs. gay argument.\n The issues at hand were gasoline volatility and skin infections.\n\n \n Again you attempt to obfuscate moose. It was you who referred to 2 posts on another thread in an attempt to accuse me of posting unfounded info and running from a debate. I simply defined what was happening on that other thread accurately, which is that I was speaking from the Christian perspective and you were speaking from the gay perspective. You were even trying to accuse me of posting false info and not fact checking in spite of the disclaimer I posted. Here is the post I'm referring to that mentions the other thread posts.\n \n http://www.4forums.com/political/showpost.php?p=298447&postcount=11", 
   {}, 
   298498, 
   null, 
   1201197960.0
  ], 
  [
   298517, 
   null, 
   "thelmoose", 
   "Again you attempt to obfuscate moose. It was you who referred to 2 posts on another thread in an attempt to accuse me of posting unfounded info and running from a debate. I simply defined what was happening on that other thread accurately, which is that I was speaking from the Christian perspective and you were speaking from the gay perspective. You were even trying to accuse me of posting false info and not fact checking in spite of the disclaimer I posted. Here is the post I'm referring to that mentions the other thread posts.\n \n http://www.4forums.com/political/showpost.php?p=298447&postcount=11\n\n \n I was not posting \"from a gay perspective\". I was rebutting your assertions, in which you stated the issue in that perspective, not I. My entire position on the MRSA thread was medical. I even criticized the behavior of the early gay activists. (You need to look up the word refute, by the way.) And you did run from the argument.\n \n You are proving my point actually. I don't understand how you can talk about a medical issue from a Christian perspective. It is like talking about geology from a tango perspective.", 
   {}, 
   298514, 
   null, 
   1201198680.0
  ], 
  [
   298520, 
   null, 
   "Archangel", 
   "I was not posting \"from a gay perspective\". I was rebutting your assertions, in which you stated the issue in that perspective, not I. My entire position on the MRSA thread was medical. I even criticized the behavior of the early gay activists. (You need to look up the word refute, by the way.) And you did run from the argument.\n \n You are proving my point actually. I don't understand how you can talk about a medical issue from a Christian perspective. It is like talking about geology from a tango perspective.\n\n \n Every issue you discuss is from your life perspective moose, just as mine is. Whatever your opinion is, your World view plays a part in determining how you see any issue you discuss. Examples can be given to prove this if necessary. \n \n NOW, do you have any comment on this threads OP or are you here to just troll as JP suggests and derail this thread?", 
   {}, 
   298517, 
   null, 
   1201199940.0
  ], 
  [
   298526, 
   null, 
   "thelmoose", 
   "Every issue you discuss is from your life perspective moose, just as mine is. Whatever your opinion is, your World view plays a part in determining how you see any issue you discuss. Examples can be given to prove this if necessary. \n \n NOW, do you have any comment on this threads OP or are you here to just troll as JP suggests and derail this thread?\n\n \n I have no further comment on this thread's OP.", 
   {}, 
   298520, 
   null, 
   1201202400.0
  ], 
  [
   298684, 
   null, 
   "JPSartre12", 
   "No wonder sane people are leaving this site. It seems that every gahdamned thread started eventually turns into a Christian vs. gay urination contest.\n\n \n That's why I don't spend much time here any more. It's become Homo Heaven, IMO. emoticon_rolleyes", 
   {}, 
   298492, 
   null, 
   1201304700.0
  ], 
  [
   298687, 
   null, 
   "Archangel", 
   "That's why I don't spend much time here any more. It's become Homo Heaven, IMO. emoticon_rolleyes\n\n \n Remember that old adage JP, the way for evil to prosper is for good men to do nothing. You're presence is missed by everybody here except those who hate the truth.", 
   {}, 
   298684, 
   null, 
   1201305480.0
  ], 
  [
   298690, 
   null, 
   "T.Q", 
   "You two are sickening. Exactly what prompts this level of hatred for a group of people who in no way, shape or form affect you and yours? Why the need to use derogatory slurs in such an offhand manner?\n \n You know what, never mind. I don't even care. From you two it would just be more whining and equivocation.", 
   {}, 
   298687, 
   null, 
   1201308540.0
  ], 
  [
   298753, 
   null, 
   "JPSartre12", 
   "You two are sickening. Exactly what prompts this level of hatred for a group of people who in no way, shape or form affect you and yours? Why the need to use derogatory slurs in such an offhand manner?\n \n You know what, never mind. I don't even care. From you two it would just be more whining and equivocation.\n\n \n They do affect me and I'm sick of rehashing old debates, so I go elsewhere for topics other than gay rights and religion, which have become the mainstay here.\n It's called freedom of choice; you should try it some time. emoticon_rolleyes", 
   {}, 
   298690, 
   null, 
   1201369260.0
  ], 
  [
   298826, 
   null, 
   "T.Q", 
   "They do affect me and I'm sick of rehashing old debates, so I go elsewhere for topics other than gay rights and religion, which have become the mainstay here.\n It's called freedom of choice; you should try it some time. emoticon_rolleyes\n\n \n Your response in no way even attempts to address what I wrote. What the hell does freedom of choice have to do with what I posted?", 
   {}, 
   298753, 
   null, 
   1201408440.0
  ], 
  [
   298827, 
   null, 
   "JPSartre12", 
   "Your response in no way even attempts to address what I wrote. What the hell does freedom of choice have to do with what I posted?\n\n \n I joined this forum 4 years ago. At that time, it was composed primarily of people interested in debating politics. I've watched the gays and atheists take over the site and dominate all topics as a result, hence the aliteration, Homo Heaven comment. My choice was to vacate the forum.\n Now that I've answered your question, what is so equivocal about anything that I've posted? I call a spade a spade and a homo a homo. emoticon_confused", 
   {}, 
   298826, 
   null, 
   1201409340.0
  ], 
  [
   298830, 
   null, 
   "T.Q", 
   "I joined this forum 4 years ago. At that time, it was composed primarily of people interested in debating politics. I've watched the gays and atheists take over the site and dominate all topics as a result, hence the aliteration, Homo Heaven comment. My choice was to vacate the forum.\n Now that I've answered your question, what is so equivocal about anything that I've posted? I call a spade a spade and a homo a homo. emoticon_confused\n\n \n So you left because you didn't like that too many people didn't share your views, and just decided to stop by to slur a group of people? OK, just making sure.", 
   {}, 
   298827, 
   null, 
   1201410600.0
  ], 
  [
   298832, 
   null, 
   "JPSartre12", 
   "So you left because you didn't like that too many people didn't share your views, and just decided to stop by to slur a group of people? OK, just making sure.\n\n \n No, I stopped posting here because EVERY friggin thread became a homo thread. This thread was supposed to be about gasoline for Chrissake!emoticon_angry", 
   {}, 
   298830, 
   null, 
   1201411380.0
  ], 
  [
   298836, 
   null, 
   "T.Q", 
   "No, I stopped posting here because EVERY friggin thread became a homo thread. This thread was supposed to be about gasoline for Chrissake!emoticon_angry\n\n \n Archie brought up homosexuality. Then you and Archie decided to start on the gay bashing after thelmoose pointed out how, once again, Archie posted something with no basis in fact, without fact checking, and without supporting his point.\n \n And why do you insist on using a derogatory term like \"homo\"?", 
   {}, 
   298832, 
   null, 
   1201412520.0
  ], 
  [
   298889, 
   null, 
   "Archangel", 
   "Archie brought up homosexuality. Then you and Archie decided to start on the gay bashing after thelmoose pointed out how, once again, Archie posted something with no basis in fact, without fact checking, and without supporting his point.\n \n And why do you insist on using a derogatory term like \"homo\"?\n\n \n Wrong yet again TQ. moose derailed this thread at post #8 by attacking me completely unprovoked. I can't even post a non confrontational thread with a disclaimer without some one attacking me for no reason. if you care to check.", 
   {}, 
   298836, 
   null, 
   1201489620.0
  ], 
  [
   298907, 
   null, 
   "T.Q", 
   "Wrong yet again TQ. moose derailed this thread at post #8 by attacking me completely unprovoked. I can't even post a non confrontational thread with a disclaimer without some one attacking me for no reason. if you care to check.\n\n \n Well gee, here's a thought: Stop running away from threads. Then your opponents won't have to go track you down in another thread to point out how you've failed to fact check yet again.", 
   {}, 
   298889, 
   null, 
   1201501980.0
  ], 
  [
   298909, 
   null, 
   "Archangel", 
   "Well gee, here's a thought: Stop running away from threads. Then your opponents won't have to go track you down in another thread to point out how you've failed to fact check yet again.\n\n \n I don't run away from threads. I just choose not to allow others to reinterpret my posts forcing me to re-explain what I have already said to them. I walk away from disingenuous and dishonest debaters. So if I have walked away from debates with you, I guess that tells you something about what I think of your debating style, huh?", 
   {}, 
   298907, 
   null, 
   1201502700.0
  ], 
  [
   298917, 
   null, 
   "T.Q", 
   "I don't run away from threads. I just choose not to allow others to reinterpret my posts forcing me to re-explain what I have already said to them. I walk away from disingenuous and dishonest debaters. So if I have walked away from debates with you, I guess that tells you something about what I think of your debating style, huh?\n\n \n Again you accuse me of dishonesty. Put up or shut up already. Where's the example? In the terrorists/torture thread, you said I misrepresented you. I asked you to say how I misrepresented you, as I used your exact words, merely breaking a complex sentence into 3 seperate points to respond to. You never told me. You ran away. Let me repeat: I asked where I misrepresented you, as I quoted your exact words. You never told me. You ran away.\n \n Everytime you're called on your weaselly ways, you have the same whiny story \"it's not me, it's you!\". Guess what bub, it really is you. It's you who lies. It's you who runs. It's you who consistently does what you say I do. Want to prove me wrong-find an example of where I intentionally lied, deceived, or otherwise did any of the things you continue to accuse me of. If you can't, I'll expect an apology.", 
   {}, 
   298909, 
   null, 
   1201504680.0
  ], 
  [
   298929, 
   null, 
   "Matthew S", 
   "This is what I am urging people to do.\n \n The way we can bring gas prices down is if we do not buy anything in the convenience store. Do not buy pop, cigarettes, candy, lotto, ect... just buy gas. The stations profit is in the store not the gasoline they sell. So let's hurt them where it hurts, their profits. The way this works is that you go in and pay for the gas and let the clerk know that you will not buy anything in the store until the price is under $1.80 per gallon, or less. Make calls to the franchise owners, to the oil companies, to the gas suppliers. Once the oil companies see that their retailers are hurting they will find the supply. The more people we get involved, the more phone calls we make the more impact we will have. Let them know \"We may have to buy gas but we don't have to buy soda!\"", 
   {}, 
   298478, 
   null, 
   1201515660.0
  ], 
  [
   299127, 
   null, 
   "marc9000", 
   "Again you accuse me of dishonesty. Put up or shut up already. Where's the example? In the terrorists/torture thread, you said I misrepresented you. I asked you to say how I misrepresented you, as I used your exact words, merely breaking a complex sentence into 3 seperate points to respond to. You never told me. You ran away. Let me repeat: I asked where I misrepresented you, as I quoted your exact words. You never told me. You ran away.\n\n \n Recent taunts of \"running away\" (to Archangel) seems to be in the vocabulary of two posters. emoticon_wow \n \n \nyou ran.\n\n \n \n Everytime you're called on your weaselly ways, you have the same whiny story \"it's not me, it's you!\". Guess what bub, it really is you. It's you who lies. It's you who runs. It's you who consistently does what you say I do. Want to prove me wrong-find an example of where I intentionally lied, deceived, or otherwise did any of the things you continue to accuse me of. If you can't, I'll expect an apology.\n\n \n \n Guess what bub, it really is you.\n\n \n \nLook bub, if you want to use......\n\n \n \n.....I'll expect an apology\n\n \n \n retract his accusation to that effect and apologize for his slanderous lie.\n\n \n Then there's this one, that kinda jumped off the page at me a few weeks ago;\n \n \n Wha? Are you nuts?\n\n \n because I remembered this one;\n \n \nWha...?\n\n \n It's the same poster, AA, as I have suspected for a long time. I wonder what ever happened to \"collin\"? emoticon_confused :p", 
   {}, 
   298917, 
   null, 
   1201664280.0
  ], 
  [
   299132, 
   null, 
   "Archangel", 
   "Huh, I knew they were both disingenuous twits with the same dishonest debating style, but I didn't realize they were the same disingenuous twit. emoticon_confused But that explains a lot. Thanks for pointing that out marc. May admin take notice and act accordingly.", 
   {}, 
   299127, 
   null, 
   1201665840.0
  ], 
  [
   299147, 
   null, 
   "Penfold", 
   "Wha Bub, not running yet? emoticon_rolleyes", 
   {}, 
   299132, 
   null, 
   1201670700.0
  ], 
  [
   299149, 
   null, 
   "electrolyte", 
   "Recent taunts of \"running away\" (to Archangel) seems to be in the vocabulary of two posters. emoticon_wow \n \n Then there's this one, that kinda jumped off the page at me a few weeks ago;\n \n because I remembered this one;\n \n It's the same poster, AA, as I have suspected for a long time. I wonder what ever happened to \"collin\"? emoticon_confused :p\n\n \nHuh, I knew they were both disingenuous twits with the same dishonest debating style, but I didn't realize they were the same disingenuous twit. emoticon_confused But that explains a lot. Thanks for pointing that out marc. May admin take notice and act accordingly.\n\n Hi guys,\n \n I've sent admin a PM telling him to go right ahead and look into it. Expect to hear from him soon, and you can report back when he tells you that there is absolutely no evidence that T.Q and I are the same person.\n \n It doesn't take a genius to make observations of Archangel's behavior. The fact that I'm not the only one who realizes that he keeps running away, and lying, and calling names, and using fallacious logic, and pretending that fallacious logic is not fallacious, etc., just shows that I'm not delusional.\n Speaking of which: marc, do you deny that Archangel has failed to meet the challenges that have been made to him? Do you deny that he has been dishonest (say, with even something as trivial as a signature)? Do you deny that I have been honest in my statements to Archangel, despite his repeated accusations of lying?\n \n Archie, if you're going to call me dishonest, then you'd better SHOW WHERE I'VE BEEN DISHONEST. If you can't do that, then I'm not the dishonest one, am I? Why can't you show the alleged repeated incidents of lying, Archie? Why? I've asked you time and time and time and time and time again Why the hell can't you do it, boy?\n \n No one suspects the quantum mechanics.\n \n P.S.: I don't know what happened to collin, because he's not me. You might find him on iidb under collinentwickle (or maybe entwicklecollin), but there's been turmoil there recently and I haven't visited much. But you feel free to have admin check his IP, too.\n \n P.P.S.: Frankly, I think I'm a hell of a lot harder on Archie than T.Q is. But maybe I'm biased (partly because I'm not T.Q). Besides, I'm not going to spread the credit for my merciless roasting of idiocy between myself and a figment of my own imagination. I quite enjoy walloping people with the Truth Stick of No Mercy\u0099 and I'll take all the ribbing or recognition from it that comes.", 
   {}, 
   299147, 
   null, 
   1201673100.0
  ], 
  [
   299178, 
   null, 
   "Iuris", 
   "I find Archangel somwehat annoying for his hit and run tactics and similar, but this is getting ridiculous! Come on, lay off the guy, and maybe adress what he's saying in the topic at hand, not a topic from weeks ago. We're getting nowhere this way...", 
   {}, 
   299149, 
   null, 
   1201691700.0
  ], 
  [
   299183, 
   null, 
   "Zardoz", 
   "This is what I am urging people to do.\n \n The way we can bring gas prices down is if we do not buy anything in the convenience store. Do not buy pop, cigarettes, candy, lotto, ect... just buy gas. The stations profit is in the store not the gasoline they sell. So let's hurt them where it hurts, their profits. The way this works is that you go in and pay for the gas and let the clerk know that you will not buy anything in the store until the price is under $1.80 per gallon, or less. Make calls to the franchise owners, to the oil companies, to the gas suppliers. Once the oil companies see that their retailers are hurting they will find the supply. The more people we get involved, the more phone calls we make the more impact we will have. Let them know \"We may have to buy gas but we don't have to buy soda!\"\n\n \n Wouldn't a campaign of terrorism be more effective and eventually produce actual results?\n You know, random bombings and death squad attacks on the owners and operators of such capitalistic pig industries...\n \n All evidence to date shows that terrorism works.\n \n Unless...the gas companies somehow have Nelson Mandella imprisoned somewhere...", 
   {}, 
   298929, 
   null, 
   1201699500.0
  ], 
  [
   299186, 
   null, 
   "admin", 
   "Huh, I knew they were both disingenuous twits with the same dishonest debating style, but I didn't realize they were the same disingenuous twit. emoticon_confused But that explains a lot. Thanks for pointing that out marc. May admin take notice and act accordingly.\n\n \n They do not appear to be the same person.\n admin", 
   {}, 
   299132, 
   null, 
   1201700040.0
  ], 
  [
   299198, 
   null, 
   "marc9000", 
   "Hi guys,\n \n I've sent admin a PM telling him to go right ahead and look into it. Expect to hear from him soon, and you can report back when he tells you that there is absolutely no evidence that T.Q and I are the same person. \n\n \n Of course there isn't clear evidence - you have that covered. I'm no computer expert, but I suspect there would be no IP address evidence if an apartment dweller was visiting friends in adjoining apartments, sitting down at their computer at will, and being registered here with multiple names. Maybe there's no technical evidence, but I showed some common sense evidence above, didn't I? Or is our educational system so far gone that it's programing evolutionist students to smart off and taunt other people in exactly the same ways, using the exact same words?\n \n \nIt doesn't take a genius to make observations of Archangel's behavior. The fact that I'm not the only one who realizes that he keeps running away, and lying, and calling names, \n\n \n Do you really think that you have room to police others for calling names? Do you really think that? Would you like to make a list of AA's name calling, while I make a list of your name calling? Which one do you think would be longer, hmmm? Would you like to concede a point for the first time in your life? \n \n \n \n \nand using fallacious logic, and pretending that fallacious logic is not fallacious, etc., just shows that I'm not delusional.\n Speaking of which: marc, do you deny that Archangel has failed to meet the challenges that have been made to him? Do you deny that he has been dishonest (say, with even something as trivial as a signature)? Do you deny that I have been honest in my statements to Archangel, despite his repeated accusations of lying? \n\n \n I don't closely monitor your exchanges with AA. You haven't been honest with me. emoticon_idea Isochron dating REALLY DOES require assumptions. Patrick Henry REALLY WAS a founder of the U.S. You're short on credentials to police liars, too. \n \n From another thread;(in reply to me)\n \nSo? If your position can be backed up logically, then you can brag about kicking the asses of seven people instead of just one. \n\n \n I'm not here to brag like you. I'm not here to \"kick asses\" like you. I'm here to discuss, like an adult. It's a thing called free speech. The US exists, progresses, was founded, ON DISCUSSION, not bragging and kicking asses. Dictatorships and totalitarianism are founded that way. emoticon_idea \n \n From another thread;(in reply to another atheist)\n \nI notice you haven't gotten many replies yet. I think we've chased most of the creationists out of here in recent days, and the editorial in Nature is like a mathematician coming out with a paper saying \"2+2=4\" to the rest of us. \n\n \n That's the idea, isn't it? Chase them out! As little discussion, as little free speech as possible, right?", 
   {}, 
   299149, 
   null, 
   1201707360.0
  ], 
  [
   299199, 
   null, 
   "marc9000", 
   "They do not appear to be the same person.\n admin\n\n \n I don't expect you to take any action without hard evidence. But I've talked to a computer scientist who told me that there are multiple user name games etc that can be done on message boards in an undetectable way. It's just sad that decent forums can be clouded and disrupted by this type of behavior. \n \n I think it's fair that when there is common sense evidence like I showed above, that I should be permitted to call it out like I did, without harping on it more than necessary. If you don't agree, then let me know and I'll knock it off. emoticon_xangel", 
   {}, 
   299186, 
   null, 
   1201707960.0
  ], 
  [
   299200, 
   null, 
   "Penfold", 
   "Such Archified posts needs investigation. Or is Archie merely a sock puppet who says what Marc dare not? The evidence is there for all to see....emoticon_rolleyes", 
   {}, 
   299199, 
   null, 
   1201709040.0
  ], 
  [
   299281, 
   null, 
   "T.Q", 
   "I don't expect you to take any action without hard evidence. But I've talked to a computer scientist who told me that there are multiple user name games etc that can be done on message boards in an undetectable way. It's just sad that decent forums can be clouded and disrupted by this type of behavior. \n \n I think it's fair that when there is common sense evidence like I showed above, that I should be permitted to call it out like I did, without harping on it more than necessary. If you don't agree, then let me know and I'll knock it off. emoticon_xangel\n\n \n Marc, you're a XXXXX. First off, if you have a computer scientist buddy, ask him how my isp could be SaskTel, a small, regional, CANADIAN telecom, while Electrolytes is some US based isp.\n \n This is just another example of your conspiracy theory paranoia. The idea that there could be multiple people who find your arguments completely without merit just doesn't bear thinking about. Therefore, there is only one person who disagrees with you, he just does it under multiple user names!", 
   {}, 
   299199, 
   null, 
   1201733220.0
  ], 
  [
   299345, 
   null, 
   "electrolyte", 
   "Marc, you're a XXXXX.\n\n I don't go that far, because saying that will just get my post deleted.\n \n \nFirst off, if you have a computer scientist buddy, ask him how my isp could be SaskTel, a small, regional, CANADIAN telecom, while Electrolytes is some US based isp.\n\n T.Q: apparently, marc thinks I'm a master at computer hacking.\n \n marc: The timestamp on T.Q's post is 2:57pm CST. If you can explain why T.Q is posting before 3pm CST -- while I'm at work and unable to be on 4forums -- you go right ahead. Hell, even if I high-tailed it out of school right at the 3:00 bell... Too bad I was working until 6:30 today.", 
   {}, 
   299281, 
   null, 
   1201753440.0
  ], 
  [
   299348, 
   null, 
   "electrolyte", 
   "... I suspect there would be no IP address evidence if an apartment dweller was visiting friends in adjoining apartments, sitting down at their computer at will, and being registered here with multiple names.\n\n Yep, every night I just pick up from my late night at work in the U.S. South, take a leisurely drive to Canada, post from a friend's computer, and drive back down. Or maybe you think I have the money to fly both ways each night and still make it back for work every day? Turn off the damn persecution complex already.\n \n \nMaybe there's no technical evidence, but I showed some common sense evidence above, didn't I?\n\n There is nothing either common or sensible about your \"common sense.\"\n \n \nOr is our educational system so far gone that it's programing evolutionist students to smart off and taunt other people in exactly the same ways, using the exact same words?\n\n Maybe he likes my style? Maybe we tell it like it is? Maybe there are only so many ways to describe the same pathetic Archie tactics that never change? \n \n \nDo you really think that you have room to police others for calling names? Do you really think that? Would you like to make a list of AA's name calling, while I make a list of your name calling? Which one do you think would be longer, hmmm? Would you like to concede a point for the first time in your life?\n\n I said to hit me with constructive criticism. You don't have to ask again, so why are you posturing instead of putting up?\n \n \nI don't closely monitor your exchanges with AA.\n\n Then how the hell could you \"know\" that I'm a more egregious namecaller than he is?\n \n \nYou haven't been honest with me. emoticon_idea Isochron dating REALLY DOES require assumptions.\n\n Name them.\n \n \nPatrick Henry REALLY WAS a founder of the U.S.\n\n He was part of the Constitutional Convention? He wrote Amendments? No? So by merely being there and being outspoken, he's considered a founder? He was an antifederalist.\n \n \nYou're short on credentials to police liars, too.\n\n Still waiting for evidence. \n \n \nI'm not here to brag like you. I'm not here to \"kick asses\" like you. I'm here to discuss, like an adult. It's a thing called free speech. The US exists, progresses, was founded, ON DISCUSSION, not bragging and kicking asses.\n\n I'd love to discuss everything with people who act like adults, but I don't get that pleasure. We get people like Archie. Whether I choose to use my free speech to deliver swift kicks to the XXX of people who severely need them is my choice and my right. In no way does my doing so inhibit or infringe upon your rights or the rights of anybody else. What violates rights is for one to slander, like Archie does to me repeatedly and never acknowledges culpability.\n \n \nDictatorships and totalitarianism are founded that way.\n\n No, they're founded with violations of rights. I haven't gagged you or just murdered you, have I? Making people own up to their scientific illiteracy is in no way dictatorial or totalitarian.\n \n \nFrom another thread;(in reply to another atheist)\n [marc posts a quote from T.Q]\n \n That's the idea, isn't it? Chase them out! As little discussion, as little free speech as possible, right?\n\n As I've said multiple times, I greatly enjoy exposing the scientific illiteracy of the unwisely outspoken. I don't restrict anybody's right to free speech, I just hold them accountable for their speech. That's not just legal, that's not just ethical, that's intellectually responsible. If you want to avoid having your XXX kicked on a forum like this, stop making statements that don't coincide with reality.", 
   {}, 
   299198, 
   null, 
   1201754880.0
  ], 
  [
   299379, 
   null, 
   "obvious_child", 
   "I don't expect you to take any action without hard evidence. But I've talked to a computer scientist who told me that there are multiple user name games etc that can be done on message boards in an undetectable way. It's just sad that decent forums can be clouded and disrupted by this type of behavior.\n\n \n Paranoia is an mental disease in the DSM-IV.\n \n But what you claim is unrealistic. For someone to have multiple names and to bypass an IP check even with constantly changing their IPs would require numerous use of proxies. This is pretty obvious to see from the person who's running the forum software and especially if they something like Google analytics running as well. Proxies are not the hardest thing to figure out, and when an user is constantly changing proxies that's an dead giveaway. Furthermore, using one proxy isn't going to fool an decent administration. Proxies are meant to hide someone from being located, but if one handle is tagged with using numerous proxies and especially if numerous handles are all using similar or the same proxies, the game is up. And if someone is using that many proxies, their connection is going to slow down and deteriorate even on broadband. Having to route from one place to another, usually across country or countries considerably slows an connection down. I get an 2.9~4 meg download speed from close servers but an paltry 1 meg ~ 80K download from across the country and across the pond(s) which is essentially what someone needs to foil serious tracking. You can check this yourself at speedtest.com What kind of person would willingly degrade their overall connection like that? \n \n \nI think it's fair that when there is common sense evidence like I showed above, that I should be permitted to call it out like I did, without harping on it more than necessary. If you don't agree, then let me know and I'll knock it off. emoticon_xangel\n\n \n Not if you actually understand what it would take. The only people who use proxies to that matter are those who are trying to get out from an government censorship policy such as China's.", 
   {}, 
   299199, 
   null, 
   1201763220.0
  ], 
  [
   299381, 
   null, 
   "obvious_child", 
   "Of course there isn't clear evidence - you have that covered. I'm no computer expert, but I suspect there would be no IP address evidence if an apartment dweller was visiting friends in adjoining apartments, sitting down at their computer at will, and being registered here with multiple names. Maybe there's no technical evidence, but I showed some common sense evidence above, didn't I? Or is our educational system so far gone that it's programing evolutionist students to smart off and taunt other people in exactly the same ways, using the exact same words?\n\n \n ....\n \n *sigh*\n \n There is no way you can get on the net without an IP. How can an server met an request if they have no point of origin to return the request for? How could an website send back information on how to display an webpage when they have no address to send that information back? \n \n As soon as you log on to an network, you are automatically provided an IP address. The reason the internet is soon changing the IP format is because so many things connect to the net, from fridges, to computer to crackberries. Everything that connects has an IP, whether its static or temporary. And given today's software, not logging IPs seems extremely out of the norm especially when it doesn't take up more then a few hundred bits.\n \n If someone sat down in an adjoining room in an apartment, as soon as they logged on they'd be provided with an IP address from that network. Universities are assigned thousands of them as they have thousands of machines using them. Similarly, routers and switches have some of their own, not many for smaller computers OR the router/switch has their own IP and then splits the data for which computer requested it. \n \n Simply put, there is no possible way you could connect and do something on the net without an IP. \n \n Your paranoia is rooted in your ignorance of how the internet works.", 
   {}, 
   299198, 
   null, 
   1201763880.0
  ], 
  [
   299458, 
   null, 
   "T.Q", 
   "I don't go that far, because saying that will just get my post deleted.\n\n \n Yeah. I apologize to admin, but it's extremely insulting to be accused of this level of dishonesty. The sheer gall of being called a liar consistently by the two biggest liars on the board eventually wears a little thin.", 
   {}, 
   299345, 
   null, 
   1201805100.0
  ], 
  [
   299606, 
   null, 
   "marc9000", 
   "....\n \n *sigh*\n \n There is no way you can get on the net without an IP. \n\n \n I never said there was. Neighbors in adjoining apartments all have separate IP addresses, right? I have no one that I know with a computer for miles, but a few weeks ago at a friends house about 15 miles away I used my username and password and logged right in here just like I was at home. T.Q. has been here longer than electrolyte. I've long suspected that that was electrolytes first user name from his parents house. Then, when he moved out, he has a new IP address and he registers under a new name. Then all he has to do is remember the original username and password, walk 20 steps to his neighbors apartment, and become T.Q. It appears to take him about 10 minutes to scamper from one computer to another. \n \n Are you saying this is impossible? I suspect these things because THERE HAS TO BE A REASON that these forums are so liberal, so atheistic, so out of touch with the politics and worldviews of the western world. I don't for one second consider \"Dane\" a newbie either. It's just not natural to register at a message board and immediately join a gang and start hammering on one long time poster before you even get to 10 posts. \n \n \nMarc, you're a XXXXX. First off, if you have a computer scientist buddy, ask him how my isp could be SaskTel, a small, regional, CANADIAN telecom, while Electrolytes is some US based isp. \n\n \n SO IT'S IMPOSSIBLE?? I think we have a 4forums breakthrough. \n \n Lets see now - the earth has gone around the sun billions of times without veering off course in the slightest. Tiikalik rosae crawled up on shore millions of years ago and began gulping for air, and has since sprouted into millions of different species, including man. There's still some fish though, there's man, and cats and dogs and bugs and elephants and horses and goats and bears and......and..... they all took millions of years to evolve and yet they're all here in the same little blip of time, when compared to millions of years. The eye evolved all by itself with no guidance - no problem. The entire human body just fell together all by itself. That a southern US resident and someone deep in the heart of Canada who use exactly the same slang, use the exact same unusual words, could find the same message board at the same time, demand apologies from the same person - it's a miricle!!! \n \n But for a US resident to be able to route an IP address through Canada????? NO WAY - there are just some things that aren't possible!!!!! COME ON - evolutionists have to draw the line somewhere right? In a matter of seconds I can log into any Austrialian site I want, BUT THAT'S DIFFERENT!!!!!!! The mathmatical odds of any one person to be able to route through an ADJOINING countrys system is simply out of the mathematical realm of evolutionists comprension!!!!!! Electrolyte is wiser than a tree full of owls, and even he can't comprehend being able to do that!!!!!!!\n \n So we have one thing on earth that IS NOT POSSIBLE, even for evolutionists? Are there more? How about a list? A list of things that are out of the question for any type of consideration by evolutionists??\n \n I love this place hahahahahahaha", 
   {}, 
   299381, 
   null, 
   1201837080.0
  ], 
  [
   299617, 
   null, 
   "electrolyte", 
   "T.Q. has been here longer than electrolyte. I've long suspected that that was electrolytes first user name from his parents house. Then, when he moved out, he has a new IP address and he registers under a new name.\n\n You have the right to your suspicions, but your suspicion is wrong.\n \n \nThen all he has to do is remember the original username and password, walk 20 steps to his neighbors apartment, and become T.Q. It appears to take him about 10 minutes to scamper from one computer to another.\n\n Ah, so I walk from the U.S. South to Canada in ten minutes. Either I'm a master hacker, or I've invented the teleporter.\n \n \nAre you saying this is impossible? I suspect these things because THERE HAS TO BE A REASON that these forums are so liberal, so atheistic, so out of touch with the politics and worldviews of the western world.\n\n Right, the handful of liberals I know and I went out last election and voted hundreds of thousands of times for Democratic candidates in polls all across the country. It's more of that teleportation trick.\n \n \nI don't for one second consider \"Dane\" a newbie either. It's just not natural to register at a message board and immediately join a gang and start hammering on one long time poster before you even get to 10 posts.\n\n When I got here, I jumped in pretty quickly and started letting people like you have it. But I do have to say that Dane's appearance was incredibly timed. I don't know if he's a clone, but I know he's not a clone of me (unless I have undiagnosed MPD).\n \n \nBut for a US resident to be able to route an IP address through Canada????? NO WAY - there are just some things that aren't possible!!!!! COME ON - evolutionists have to draw the line somewhere right? In a matter of seconds I can log into any Austrialian site I want, BUT THAT'S DIFFERENT!!!!!!! The mathmatical odds of any one person to be able to route through an ADJOINING countrys system is simply out of the mathematical realm of evolutionists comprension!!!!!! Electrolyte is wiser than a tree full of owls, and even he can't comprehend being able to do that!!!!!!!\n\n Oh, I comprehend. What I can't quite figure out is how \"I\" am posting when I'm in front of my class at school teaching them the science that you apparently missed.", 
   {}, 
   299606, 
   null, 
   1201841460.0
  ], 
  [
   299629, 
   null, 
   "obvious_child", 
   "I never said there was.\n\n \n But you claimed there would be no IP evidence. That is simply false. \n \n \nNeighbors in adjoining apartments all have separate IP addresses, right?\n\n \n Not necessarily. I already addressed how routers and switches often have one IP and then split the data to specific computers who made the request. To the outside world, it looks like one computer when there may be many.\n \n \nI have no one that I know with a computer for miles, but a few weeks ago at a friends house about 15 miles away I used my username and password and logged right in here just like I was at home.\n\n \n So? I virtually guarantee that you had an different IP address. There is virtually no way you got the same IP address using two different connections. These aren't cell phone numbers. There has been the rare and I stress rare occasion where someone was banned from an website because they got the temporary IP from someone who was banned, but instances of these are extremely rare. You're more likely to be killed by aliens.\n \n \nT.Q. has been here longer than electrolyte. I've long suspected that that was electrolytes first user name from his parents house.\n\n \n .....Paranoia does not mean you can ignore how the internet works.\n \n \nThen, when he moved out, he has a new IP address and he registers under a new name. Then all he has to do is remember the original username and password, walk 20 steps to his neighbors apartment, and become T.Q.\n\n \n Not necessarily. The IP would show up from the same city. I'm pretty sure that's not the case. \n \n \nIt appears to take him about 10 minutes to scamper from one computer to another.\n\n \n That's an sign of clinical paranoia.\n \n \nAre you saying this is impossible?\n\n \n No, but extremely unlikely. Your argument is from a position of ignorance and paranoia. \n \n \nI suspect these things because THERE HAS TO BE A REASON that these forums are so liberal, so atheistic, so out of touch with the politics and worldviews of the western world.\n\n \n Oddly we say much of that about you. \n \n First of all, not everyone who disagrees with you is liberal or an atheist. You are again obviously defining the terms to mean whomever disagrees with you without actual evidence that they are indeed liberal or atheistic. Furthermore, most people who use the terms liberal and conservative have no idea what they mean, you included. \n \n Let's look at this thread. You are obviously not informed about how the internet works, or how proxies work or what an IP search does. Yet you are calling US out of touch. Look in the mirror for an change. \n \n \nI don't for one second consider \"Dane\" a newbie either. It's just not natural to register at a message board and immediately join a gang and start hammering on one long time poster before you even get to 10 posts.\n\n \n And you base this on what? EvC forum has this happening all of the time and few people are banned there. \n \n \nBut for a US resident to be able to route an IP address through Canada????? NO WAY - there are just some things that aren't possible!!!!!\n\n \n I already addressed this. Using proxies seriously degrades and slows an connection. Using multiple proxies can render an T1 connection to dial up relatively quickly. Furthermore, if one user constantly is on an masking proxy it's a dead give away. You have completely ignored my post detailing this.\n \n \nCOME ON - evolutionists have to draw the line somewhere right? In a matter of seconds I can log into any Austrialian site I want, BUT THAT'S DIFFERENT!\n\n \n Actually it is. For one, the server is merely sending you the information. It's an direct line. An proxy would require sending requests through the proxy and then having the proxy send to the site, then the site back to the proxy and then from the proxy to the requester. This takes time and the more proxies the slower it gets. Again, your position is from ignorance of how the internet works.\n \n \nThe mathmatical odds of any one person to be able to route through an ADJOINING countrys system is simply out of the mathematical realm of evolutionists comprension!!!!!! Electrolyte is wiser than a tree full of owls, and even he can't comprehend being able to do that!\n\n \n No, but most of us have been through dial up and don't want to go back to that, thus anti-proxies. Furthermore the admin could easily look up anyone who's using an proxy. And if the admin is half competent could get past the first proxy. \n \n \nI love this place hahahahahahaha\n\n \n Your ignorance is appalling.", 
   {}, 
   299606, 
   null, 
   1201852320.0
  ], 
  [
   299637, 
   null, 
   "T.Q", 
   "I'm getting reeeeaaaaalllly tired of being called a liar by these two...", 
   {}, 
   299629, 
   null, 
   1201862940.0
  ], 
  [
   300263, 
   null, 
   "CUNxTime", 
   "I have a question. Why would anyone be banned in the first place? I mean, you can say just about anything you what and through a computer all you CAN do is say things? Why would anyone not be allowed on a site? I'm sorry if I sound uninformed, but these internet sites are a new hobby for me...", 
   {}, 
   299637, 
   null, 
   1202177100.0
  ], 
  [
   300286, 
   null, 
   "electrolyte", 
   "I have a question. Why would anyone be banned in the first place? I mean, you can say just about anything you what and through a computer all you CAN do is say things? Why would anyone not be allowed on a site? I'm sorry if I sound uninformed, but these internet sites are a new hobby for me...\n\n Board administrators can institute any rules they choose. One here is that posts must be \"friendly and informative,\" where \"informative\" includes careless misinformation and purposeful disinformation, blatant lies, and willful ignorance of fact.", 
   {}, 
   300263, 
   null, 
   1202195280.0
  ], 
  [
   300325, 
   null, 
   "Waxy", 
   "This is what I am urging people to do.\n \n The way we can bring gas prices down is if we do not buy anything in the convenience store. Do not buy pop, cigarettes, candy, lotto, ect... just buy gas. The stations profit is in the store not the gasoline they sell. So let's hurt them where it hurts, their profits. The way this works is that you go in and pay for the gas and let the clerk know that you will not buy anything in the store until the price is under $1.80 per gallon, or less. Make calls to the franchise owners, to the oil companies, to the gas suppliers. Once the oil companies see that their retailers are hurting they will find the supply. The more people we get involved, the more phone calls we make the more impact we will have. Let them know \"We may have to buy gas but we don't have to buy soda!\"\n\n \n emoticon_rolleyes emoticon_rolleyes \n \n Ahhhh to be so wonderfully naive. \n \n Waxy", 
   {}, 
   298929, 
   null, 
   1202235900.0
  ], 
  [
   300328, 
   null, 
   "CUNxTime", 
   "MY GOD, did he really say that? The stations make almost no profit at all on gas (as you, Matt, pointed out) what do you expect them to do--Subsidize your gas? The Govt. is the only entity that makes out like a bandit on Gas. Even the Oil Co. only make 5 cents or so per gallon. \n \n BTW: Don't go to CITGO!!! Which is owned by HUGO C.!!!", 
   {}, 
   300325, 
   null, 
   1202236740.0
  ], 
  [
   300329, 
   null, 
   "Waxy", 
   "This whole page is amazing to me.\n \n My question is this, why doesn't Admin just put an end to this? He has stated that there's no evidence that T.Q. and Electrolyte are one and the same, (which I firmly believe they are not). Based on that, what Marc is doing is slanderous and offensive, and should be ended.\n \n I already know the answer I guess, Admin could swear on a stack of Bibles that they aren't one and the same and Marc wouldn't believe it anyway, so why bother. More likely, Admin would be accused of being one and the same as T.Q. and Electrolyte. :p \n \n Waxy", 
   {}, 
   300325, 
   null, 
   1202237400.0
  ], 
  [
   300332, 
   null, 
   "CUNxTime", 
   "I kinda new to all this..Why does it matter if they are the same person and why would anyone try to be two different people anyway???", 
   {}, 
   300329, 
   null, 
   1202238000.0
  ], 
  [
   300333, 
   null, 
   "CUNxTime", 
   "Unless its to make it look like there's more than one person arguing the same type of point (truth in numbers etc...) Yes?", 
   {}, 
   300332, 
   null, 
   1202238180.0
  ], 
  [
   300379, 
   null, 
   "Zardoz", 
   "\n BTW: Don't go to CITGO!!! Which is owned by HUGO C.!!!\n\n \n Citgo?\n \n I go to Pisspoo.\n \n It's right next door.\n \n I have to bring my own syphon...", 
   {}, 
   300328, 
   null, 
   1202258520.0
  ], 
  [
   300388, 
   null, 
   "CUNxTime", 
   "I use nothing but Greenish Brown cars, pedal powered by illegal leg pumping...", 
   {}, 
   300379, 
   null, 
   1202264700.0
  ], 
  [
   300420, 
   null, 
   "electrolyte", 
   "My question is this, why doesn't Admin just put an end to this? He has stated that there's no evidence that T.Q. and Electrolyte are one and the same, (which I firmly believe they are not). Based on that, what Marc is doing is slanderous and offensive, and should be ended.\n\n What admin does doesn't necessarily have to make sense. The fact that someone can be banned for having a clone while marc and Archie flail their lies and slander left and right with no penalty seems pretty silly.\n \n \nUnless its to make it look like there's more than one person arguing the same type of point (truth in numbers etc...) Yes?\n\n But there is no such thing as \"truth in numbers,\" technically. marc refuses to defend his points because there are \"seven rabid atheists\" that disagree with him, but if his points were any good, he could kick the asses of seven people instead of just one.\n \n Let me say this again: I'm proud of the vast majority of my posts and would like to have all the credit for them instead of wasting my time with a clone to type everything over again with different wording.", 
   {}, 
   300333, 
   null, 
   1202280300.0
  ], 
  [
   300426, 
   null, 
   "Archangel", 
   "Here's one attempt to get this thread back on track. If that doesn't work, I'll just delete it.\n \n TIPS ON PUMPING GAS (Good information)\n \n \n I don't know what you guys are paying for gasoline.... but here in California we are also paying higher, up to $3.50 per gallon. But my line of work is in petroleum for about 31 years now, so here are some tricks to get more of your money's worth for every gallon..\n \n Here at the Kinder Morgan Pipeline where I work in San Jose , CA we deliver about 4 million gallons in a 24-hour period thru the pipeline. One day is diesel the next day is jet fuel, and gasoline, regular and premium grades. We have 34-storage tanks here with a total capacity of 16,800,000 gallons.\n \n Only buy or fill up your car or truck in the early morning when the ground temperature is still cold. Remember that all service stations have their storage tanks buried below ground. The colder the ground the more dense the gasoline, when it gets warmer gasoline expands, so buying in the afternoon or in the evening....your gallon is not exactly a gallon. In the petroleum business, the specific gravity and the temperature of the gasoline, diesel and jet fuel, ethanol and other petroleum products plays an important role. A 1-degree rise in temperature is a big deal for this business. But the service stations do not have temperature compensation at the pumps.\n \n When you're filling up do not squeeze the trigger of the nozzle to a fast mode. If you look you will see that the trigger has three (3) stages: low, middle, and high. In slow mode you should be pumping on low speed, thereby minimizing the vapors that are created while you are pumping. All hoses at the pump have a vapor return. If you are pumping on the fast rate, some of the liquid that goes to your tank becomes vapor. Those vapors are being sucked up and back into the underground storage tank so you're getting less worth for your money.\n \n One of the most important tips is to fill up when your gas tank is HALF FULL. The reason for this is, the more gas you have in your tank the less air occupying its empty space. Gasoline evaporates faster than you can imagine. Gasoline storage tanks have an internal floating roof. This roof serves as zero clearance between the gas and the atmosphere, so it minimizes the evaporation. Unlike service stations, here where I work, every truck that we load is temperature compensated so that every gallon is actually the exact amount.\n \n Another reminder, if there is a gasoline truck pumping into the storage tanks when you stop to buy gas, DO NOT fill up--most likely the gasoline is being stirred up as the gas is being delivered, and you might pick up some of the dirt that normally settles on the bottom.\n \n Hope this will help you get the most value for your money.\n \n DO SHARE THESE TIPS WITH OTHERS!\n DISCLAIMER: This is an e-mail I received and I'm passing it on as a public service. If any aspect of this information is not accurate, I am not lying or attempting to deceive anyone, but am simply passing it on as a courtesy and a human interest story.", 
   {}, 
   298145, 
   null, 
   1202282460.0
  ], 
  [
   300437, 
   null, 
   "Penfold", 
   "Is it Groundhog day again?", 
   {}, 
   300426, 
   null, 
   1202294760.0
  ], 
  [
   300699, 
   null, 
   "jim's trucking", 
   "Here's one attempt to get this thread back on track. If that doesn't work, I'll just delete it.\n \nThere's no need to delete it.\n \n If you want a thread to stay on track, start it in the Formal Open Debate forum...that's the rule there. These others have a tendency to jump track...often.", 
   {}, 
   300426, 
   null, 
   1202427600.0
  ], 
  [
   300727, 
   null, 
   "CUNxTime", 
   "I'd heard about that. I SC since it's so F'N hot here all the time we actually under pump in the Hundreds of Millions of dollars, or some ungodly #, per year. Good call about pumping in the morning.", 
   {}, 
   300699, 
   null, 
   1202437080.0
  ], 
  [
   300735, 
   null, 
   "thelmoose", 
   "Is it Groundhog day again?\n\n \n Maybe he thinks it will be less dopey the second time.\n Keep saying something over and over and over until you believe it!", 
   {}, 
   300437, 
   null, 
   1202441100.0
  ], 
  [
   300746, 
   null, 
   "CUNxTime", 
   "I don't get it. What about Groundhog day...", 
   {}, 
   300735, 
   null, 
   1202447040.0
  ], 
  [
   319036, 
   null, 
   "applemacin", 
   "Appreciate the tips, but still, Gas us $3 per gallon, that is too much.", 
   {}, 
   298145, 
   null, 
   1217888880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  TIPS ON PUMPING GAS: (Good information)", 
  "url": "http://www.4forums.com/political/environmental-debates/10836-tips-pumping-gas-good-information.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 10836, 
  "discussion_files": [
   [
    "23222.html", 
    "http://www.4forums.com/political/environmental-debates/10836-tips-pumping-gas-good-information-print.html"
   ], 
   [
    "23223.html", 
    "http://www.4forums.com/political/environmental-debates/10836-tips-pumping-gas-good-information-5-print.html"
   ], 
   [
    "23224.html", 
    "http://www.4forums.com/political/environmental-debates/10836-tips-pumping-gas-good-information-4-print.html"
   ], 
   [
    "23225.html", 
    "http://www.4forums.com/political/environmental-debates/10836-tips-pumping-gas-good-information-3-print.html"
   ], 
   [
    "23226.html", 
    "http://www.4forums.com/political/environmental-debates/10836-tips-pumping-gas-good-information-2-print.html"
   ]
  ], 
  "identifier": 10836
 }
]