[
 [
  [
   298115, 
   null, 
   "daewoo", 
   "YES. It is true..he did. I had to get online to figure it out. I happened to catch fox news and noticed that according to them, Romney won,, McCain was third, and the huckabee.\n \n YES. There is a number missing between \"first\" and \"third\", and that is where paul came in.", 
   {
    "post_info": {
     "post_title": "Paul comes in second in neveda"
    }
   }, 
   null, 
   null, 
   1200886320.0
  ], 
  [
   298122, 
   null, 
   "obvious_child", 
   "YES. It is true..he did. I had to get online to figure it out. I happened to catch fox news and noticed that according to them, Romney won,, McCain was third, and the huckabee.\n \n YES. There is a number missing between \"first\" and \"third\", and that is where paul came in.\n\n \n Completely Un-breaking, Obvious News:\n \n Fox and The GOP hate Conservatives and will try to do anything to stop them!", 
   {}, 
   298115, 
   null, 
   1200892620.0
  ], 
  [
   298129, 
   null, 
   "daewoo", 
   "this is true. I am just surprised that they have moved to such blatant tactics. it is one thing to ignore massive grassroots support. it is entirely another to not report the second place winner in a primary.\n \n another thing....to all you voters out there in states where the primary is early enough to count...note that so far independants will not touch mccain or romney with a stick and you CANNOT POSSIBLY put a canidate in the whitehouse without support from registered independants.\n \n I would suggest that youv neocons and militant liiberals out there who THINK or PRETEND that you are conseratives take another look at paul and see if you can find some common ground because the way this has shaped up if we do not put paul out there to run then the democratic primaries ARE the presidential election. there is simply nobody else on the republican ticket that can pick up the support needed from independants and moderates.\n \n the only options at this point are president paul or president clinton and frankly the rinos will only have themselves to blame", 
   {}, 
   298122, 
   null, 
   1200894900.0
  ], 
  [
   298133, 
   null, 
   "obvious_child", 
   "Remember that Michigan's GOP leadership tried to ban Paul from their debates and I wouldn't be surprised if other states tried the same.\n \n And I agree, the GOP race sucks. Terribly", 
   {}, 
   298129, 
   null, 
   1200897240.0
  ], 
  [
   298175, 
   null, 
   "zachvac", 
   "YES. It is true..he did. I had to get online to figure it out. I happened to catch fox news and noticed that according to them, Romney won,, McCain was third, and the huckabee.\n \n YES. There is a number missing between \"first\" and \"third\", and that is where paul came in.\n\n \n Wow, seen and heard of them slanting everything, but outright ignoring news that they're covering? I wouldn't expect them to cover the money he raised and such, but to ignore the 2nd place finisher when reporting the primary results? That's seriously bullsh**, I fail to see how you can call an organization that does #### like that \"news\".", 
   {}, 
   298115, 
   null, 
   1200931680.0
  ], 
  [
   298200, 
   null, 
   "Steeeeve", 
   "YES. It is true..he did. I had to get online to figure it out. I happened to catch fox news and noticed that according to them, Romney won,, McCain was third, and the huckabee.\n \n YES. There is a number missing between \"first\" and \"third\", and that is where paul came in.\n\n \n of course it was 51% for Romney and 13% for Paul...that is not exactly a strong 2nd.", 
   {}, 
   298115, 
   null, 
   1200951060.0
  ], 
  [
   298224, 
   null, 
   "obvious_child", 
   "of course it was 51% for Romney and 13% for Paul...that is not exactly a strong 2nd.\n\n \n Not the issue here. \n \n Fox stated who was #1, #3 and #4. \n \n #3 and #4 had terrible results, yet they were mentioned. All this shows is that FOX and the GOP hate Conservatives.", 
   {}, 
   298200, 
   null, 
   1200959940.0
  ], 
  [
   298229, 
   null, 
   "daewoo", 
   "of course it was 51% for Romney and 13% for Paul...that is not exactly a strong 2nd.\n\n \n This is true. Romneys 51% was the result of the mormon vote.\n \n On the up side, we can quite wondering whether mormonism is a cult or not. With 95% of mormons voting for Romney (and being by far the larges voting block) we are well into the realm of ant hill like organization there.", 
   {}, 
   298200, 
   null, 
   1200960540.0
  ], 
  [
   298230, 
   null, 
   "electrolyte", 
   "Wow, seen and heard of them slanting everything, but outright ignoring news that they're covering? I wouldn't expect them to cover the money he raised and such, but to ignore the 2nd place finisher when reporting the primary results? That's seriously bullsh**, I fail to see how you can call an organization that does #### like that \"news\".\n\n When Mark Foley was busted for sexual misconduct with minors, FAUX News put on the graphic \"Foley, D-FL.\" When they got busted on it, the segment re-aired not with a correction, but with no graphic at all.\n \n When Libby was convicted of all but one count for the Plame incident, FAUX News opted to make that one the only newsworthy charge.\n \n FAUX News is probably single-handedly the cause of the vast majority of disinformation in this country. And Murdoch wants it that way...", 
   {}, 
   298175, 
   null, 
   1200960960.0
  ], 
  [
   298391, 
   null, 
   "Steeeeve", 
   "Not the issue here. \n \n Fox stated who was #1, #3 and #4. \n \n #3 and #4 had terrible results, yet they were mentioned. All this shows is that FOX and the GOP hate Conservatives.\nAside from the fact that Nevada was barely mentioned anyway, I don't see any FoxNews article that did this. In fact, from this thread it appears that you just took Daewoo's word for it.\n \n Granted the news cast probably didn't mention Paul coming in second at least once but big deal...he isn't exactly a main candidate. If your main support are college kids you are doomed from the start.", 
   {}, 
   298224, 
   null, 
   1201103940.0
  ], 
  [
   298392, 
   null, 
   "Steeeeve", 
   "This is true. Romneys 51% was the result of the mormon vote.\n \n On the up side, we can quite wondering whether mormonism is a cult or not. With 95% of mormons voting for Romney (and being by far the larges voting block) we are well into the realm of ant hill like organization there.\nMormonism has lost its title for most cultish organization. Scientology has taken the crown and it would be hard to believe (but I've been wrong before) they will lose it.", 
   {}, 
   298229, 
   null, 
   1201104060.0
  ], 
  [
   298395, 
   null, 
   "jyoshu", 
   "this is true. I am just surprised that they have moved to such blatant tactics. it is one thing to ignore massive grassroots support. it is entirely another to not report the second place winner in a primary.\n \n another thing....to all you voters out there in states where the primary is early enough to count...note that so far independants will not touch mccain or romney with a stick and you CANNOT POSSIBLY put a canidate in the whitehouse without support from registered independants.\n \n I would suggest that youv neocons and militant liiberals out there who THINK or PRETEND that you are conseratives take another look at paul and see if you can find some common ground because the way this has shaped up if we do not put paul out there to run then the democratic primaries ARE the presidential election. there is simply nobody else on the republican ticket that can pick up the support needed from independants and moderates.\n \n the only options at this point are president paul or president clinton and frankly the rinos will only have themselves to blame\n\n \n I'd love to see Paul get it, but I just don't see it happ'nin. And I'd rather McCain get it than Hillary (and really even Obama). Among Republicans, with McCain at least we somewhat know what we're getting because he's been in govt. long enough to get a sense of where he is on things. No one really knows that much about Romney (partly because the issue of his religion has been over-emphasized at the expense of much more important issues.)", 
   {}, 
   298129, 
   null, 
   1201105500.0
  ], 
  [
   298448, 
   null, 
   "obvious_child", 
   "Aside from the fact that Nevada was barely mentioned anyway, I don't see any FoxNews article that did this. In fact, from this thread it appears that you just took Daewoo's word for it.\n\n \n I have yet to see Daewoo fail. Furthermore, Fox is notorious for this #### and has repeatively tried to muscle Paul out. On the debates, Paul clearly won as the votes went, but their hacks tried to make it seem as if he lost. Furthermore, state GOP parties have tried to ban Paul from their debates. This isn't a one time thing. \n \n \nGranted the news cast probably didn't mention Paul coming in second at least once but big deal...he isn't exactly a main candidate. If your main support are college kids you are doomed from the start.\n\n \n Again, not the point. \n \n Fox stated who was #1, #3 and #4.\n \n #3 and #4 had terrible results, yet they were mentioned. All this shows is that FOX and the GOP hate Conservatives.\n \n It doesn't MATTER if he's not a main candidate. Paul is the most Conservative and the GOP and Fox fear that. He's already gone a fair way in showing that FOX and the GOP are bunch of liberals who have no idea what Conservatism actually is.", 
   {}, 
   298391, 
   null, 
   1201131180.0
  ], 
  [
   298497, 
   null, 
   "Steeeeve", 
   "I have yet to see Daewoo fail. Furthermore, Fox is notorious for this #### and has repeatively tried to muscle Paul out. On the debates, Paul clearly won as the votes went, but their hacks tried to make it seem as if he lost. Furthermore, state GOP parties have tried to ban Paul from their debates. This isn't a one time thing. \nI don't doubt this is what Daewoo heard...I just doubt it is abnormal. You never heard much about duncan hunter either but big deal. And as for the debate \"voting\", there is no question that online votes are flawed and Ron Paul fans spam them. \n \n \n \n\n Again, not the point. \n \n Fox stated who was #1, #3 and #4.\n \n #3 and #4 had terrible results, yet they were mentioned. All this shows is that FOX and the GOP hate Conservatives.\nA weak argument at best considering you can't even come up with where this was said. In fact, the Foxnews.com articles all state Paul came in second.\n \n \nIt doesn't MATTER if he's not a main candidate. Paul is the most Conservative and the GOP and Fox fear that. He's already gone a fair way in showing that FOX and the GOP are bunch of liberals who have no idea what Conservatism actually is.\nHe shows what a libertarian is...plus he is rather extreme.", 
   {}, 
   298448, 
   null, 
   1201193820.0
  ], 
  [
   298532, 
   null, 
   "obvious_child", 
   "I don't doubt this is what Daewoo heard...I just doubt it is abnormal. You never heard much about duncan hunter either but big deal. And as for the debate \"voting\", there is no question that online votes are flawed and Ron Paul fans spam them.\n\n \n But the thing is that Hunter and Tancredo were essentially few issue hacks with no money. Paul has a full fledged ideology with record amounts of cash being raised per day. Perhaps the online votes are flawed, but he also has won non-online based straw polls and has the record in money. \n \n \nA weak argument at best considering you can't even come up with where this was said. In fact, the Foxnews.com articles all state Paul came in second.\n\n \n But coupled with their history and the state GOP societies on Paul, it's rather disgusting. When state sects of the party try to BAN someone from their debates, when the network tries to pass him off as nuts when he wins strawpolls and debates, and essentially ignore him after record fund raising days, it's hard to argue the GOP and FOX don't like him.\n \n \nHe shows what a libertarian is...plus he is rather extreme.\n\n \n But it's hard to argue the GOP is more conservative then he is.\n \n The LAST time a Conservative tried to run for the Presidency is when FOX and the rest of the GOP deliberately scuttled his campaign and instead voted for a reckless liberal. This isn't a one time thing Steve.", 
   {}, 
   298497, 
   null, 
   1201203540.0
  ], 
  [
   298540, 
   null, 
   "Penfold", 
   "Like the rest of Newscorp, Fox's editorial content is set by Rupert Murdoch, that famous Australian .....Sorry, American, who sets his own agenda worldwide, manipulating politicians at his whim.", 
   {}, 
   298532, 
   null, 
   1201209720.0
  ], 
  [
   299044, 
   null, 
   "Steeeeve", 
   "But the thing is that Hunter and Tancredo were essentially few issue hacks with no money. Paul has a full fledged ideology with record amounts of cash being raised per day. Perhaps the online votes are flawed, but he also has won non-online based straw polls and has the record in money. \n So what? Hasn't translated to anything better than Hunter and Tancredo. All three have won nothing.\n \n\n But coupled with their history and the state GOP societies on Paul, it's rather disgusting. When state sects of the party try to BAN someone from their debates, when the network tries to pass him off as nuts when he wins strawpolls and debates, and essentially ignore him after record fund raising days, it's hard to argue the GOP and FOX don't like him.\nIt isn't hard because Fox News has given them the same coverage as CNN and MSNBC. I'll never understand why it wasn't ok to complain about CNN being liberal when it was only CNN but it is ok to complain about Fox News. I watch all three and all three are catered to entertainment and not news so if you wish to be critical at least be fair about it. Fox doesn't cover Ron Paul, MSNBC doesn't cover Ron Paul, and CNN doesn't cover Ron Paul. When you get low poll numbers, no one wants to watch you and that's how it ends up. \n \n I'm not saying this is right but it is consistent. And as for the GOP not liking him, I don't know if that is likely other than he is not going to be the nomination so they don't want him there. \n \n\n But it's hard to argue the GOP is more conservative then he is.\nProbably, but the GOP hasn't been conservative in a long time. So why would that matter to them?\n \n \nThe LAST time a Conservative tried to run for the Presidency is when FOX and the rest of the GOP deliberately scuttled his campaign and instead voted for a reckless liberal. This isn't a one time thing Steve.\nemoticon_rolleyes I really don't like Fox News either but the bashing is annoying when the same could be said about the other news networks.", 
   {}, 
   298532, 
   null, 
   1201621140.0
  ], 
  [
   299113, 
   null, 
   "obvious_child", 
   "So what? Hasn't translated to anything better than Hunter and Tancredo. All three have won nothing.\n\n \n Won nothing? How about record money raising? 2nd place? That's nothing? Tancredo and Hunter haven't even placed. \n \n \nIt isn't hard because Fox News has given them the same coverage as CNN and MSNBC. I'll never understand why it wasn't ok to complain about CNN being liberal when it was only CNN but it is ok to complain about Fox News.\n\n \n For a key reason. Fox News pretends to be pro-Conservative. Everyone knows CNN and MSNBC are liberal, they don't hide their agenda. But when Fox News who pretends to be Conservative shuts out the most conservative candidate, that's bull****. Furthermore, there is virtually a campaign to ban Paul from Gop debates and the media as a whole. That's ridiculous.\n \n \nI'm not saying this is right but it is consistent. And as for the GOP not liking him, I don't know if that is likely other than he is not going to be the nomination so they don't want him there. \n Probably, but the GOP hasn't been conservative in a long time. So why would that matter to them?\n\n \n Because Paul shows them to be a liberals and they don't like that and anti-Ron Republicans who argue against him tend to show their incompetency an idiocy. I've seen an die hard republican claim that small government was liberal and thus Paul was a liberal. These people are XXXXXX and having Paul around shows the public that the support of the GOP is mainly in the hands of those who are intellectually incompetent. \n \n \nI really don't like Fox News either but the bashing is annoying when the same could be said about the other news networks.\n\n \n This comes down to honesty. you can't claim to be Conservative when you have a virtual stated plan to media censor the most Conservative candidate out there.", 
   {}, 
   299044, 
   null, 
   1201660380.0
  ], 
  [
   299240, 
   null, 
   "Jo Bennett", 
   "Small government is liberal, in the literal sense of the word liberal. It's just that in the US words take on an Alice in Wonderland quality to suit the needs of the rhetoric of the two main parties.", 
   {}, 
   299113, 
   null, 
   1201719360.0
  ], 
  [
   299270, 
   null, 
   "Steeeeve", 
   "Won nothing? How about record money raising? 2nd place? That's nothing? Tancredo and Hunter haven't even placed.\n yes, that is nothing. A distant 2nd in a state that didn't matter is nothing. There also is no prize for raising a lot of money. \n \n \nFor a key reason. Fox News pretends to be pro-Conservative. Everyone knows CNN and MSNBC are liberal, they don't hide their agenda. But when Fox News who pretends to be Conservative shuts out the most conservative candidate, that's bull****. Furthermore, there is virtually a campaign to ban Paul from Gop debates and the media as a whole. That's ridiculous.\nYou seem a little extreme on that. I don't even think Fox News tries to be Pro-Conservative. They seem to try to be pro-money...whatever sells advertising.\n \n \nBecause Paul shows them to be a liberals and they don't like that and anti-Ron Republicans who argue against him tend to show their incompetency an idiocy.\nNot a good way to make friends. Of course you won't get a nomination from a party if you #### the party off.\n \n\n I've seen an die hard republican claim that small government was liberal and thus Paul was a liberal. These people are XXXXXX and having Paul around shows the public that the support of the GOP is mainly in the hands of those who are intellectually incompetent. \nWell what does that have to do with him seeking the GOP nomination? I personally don't think the GOP cares about Paul because he isn't polling well and no one is gonna listen to you if you don't poll well. Fox News doesn't show any news coverage on him because no one wants to watch him...he doesn't poll well. If showing Ron Paul made Fox News, CNN, and MSNBC money then they'd have him on every hour. \n \n \nThis comes down to honesty. you can't claim to be Conservative when you have a virtual stated plan to media censor the most Conservative candidate out there.\nYou can claim it if you just change the definition of Conservative. That's what the GOP did awhile ago.\n \n \nSmall government is liberal, in the literal sense of the word liberal.\nNo it isn't. The literal sense of the word is for open change basically. That is neither small government nor big government.", 
   {}, 
   299113, 
   null, 
   1201729200.0
  ], 
  [
   299291, 
   null, 
   "obvious_child", 
   "yes, that is nothing. A distant 2nd in a state that didn't matter is nothing. There also is no prize for raising a lot of money.\n\n \n No prize? Dude, he broke an entire record on fund raising! That's notable. \n \n \nYou seem a little extreme on that. I don't even think Fox News tries to be Pro-Conservative. They seem to try to be pro-money...whatever sells advertising.\n\n \n Somewhat, but the pro-republican slant is ridiculous on it as noted in the Foley incident, their bashing of democrats for the same thing republicans do, their refusal to criticize Bush...the list goes on and on.\n \n \nNot a good way to make friends. Of course you won't get a nomination from a party if you #### the party off.\n\n \n Hence the problem with American politics. People don't get nominations based on merit, intelligence and competence. Bush and Kerry are examples of that recently.\n \n \nWell what does that have to do with him seeking the GOP nomination? I personally don't think the GOP cares about Paul because he isn't polling well and no one is gonna listen to you if you don't poll well. Fox News doesn't show any news coverage on him because no one wants to watch him...he doesn't poll well. If showing Ron Paul made Fox News, CNN, and MSNBC money then they'd have him on every hour. \n\n \n Because it shows that the diehard GOP supporters are XXXXXX. Would you like it to be known that your party's foundation is made of mentally challenged XXXXXX who have no education? That brands you as the party of fools. And the key problem with Paul is that many of his supporters are not of voting age. That doesn't mean people don't want to watch him. \n \n \nYou can claim it if you just change the definition of Conservative. That's what the GOP did awhile ago.\n\n \n And most people have no idea what it means.\n \n IMO if you consider the GOP to be Conservative, you are automatically an idiot.", 
   {}, 
   299270, 
   null, 
   1201735560.0
  ], 
  [
   299299, 
   null, 
   "Steeeeve", 
   "No prize? Dude, he broke an entire record on fund raising! That's notable. \nAnd it was noted. You still get no prize for it.\n \n \nSomewhat, but the pro-republican slant is ridiculous on it as noted in the Foley incident, their bashing of democrats for the same thing republicans do, their refusal to criticize Bush...the list goes on and on.\nWithout a doubt a pro-republican slant. But I think this exists more because of the money than because they feel like that is ok. As an aside, while republicans complained when it was just CNN, at least they got a station to report how they liked...the democrats seem to complain even more and then act like babies when asked to debate on Fox News. The republicans never refused CNN or MSNBC dispute their overwhelmingly bias. One of the very few bright spots about the GOP...they don't whine as much as democrats (granted they all whine). \n \n \nHence the problem with American politics. People don't get nominations based on merit, intelligence and competence. Bush and Kerry are examples of that recently.\nPolitics in general is like this...I wouldn't be so quick to narrow it to American politics. \n \n \nBecause it shows that the diehard GOP supporters are XXXXXX. Would you like it to be known that your party's foundation is made of mentally challenged XXXXXX who have no education? That brands you as the party of fools. And the key problem with Paul is that many of his supporters are not of voting age. That doesn't mean people don't want to watch him. \nOf course it would be hard to claim your party is a bunch of fools when the very people support you are the most foolish of all. If you are too young to vote the chances are great you are even more foolish than the average GOP. You simply lack the life experience to understand real issues. This goes double for college kids who can vote. \n \n \nAnd most people have no idea what it means.\n \n IMO if you consider the GOP to be Conservative, you are automatically an idiot.\nI think conservative doesn't have a party. You have to look at individuals now and determine this..and each issue for that matter. Is raising taxes conservative or liberal? Well, that could depend on your situation. If you are raising taxes to pay for a new entitlement program than probably liberal but if you are doing it to balance your budget it is more conservative. Is Ron Paul a conservative? For the most part, yes, but his ideas are unrealistic. Is Mike Huckabee a conservative? Well, on some issues yes and others no. Is John McCain a conservative? Well, I haven't seen it yet.", 
   {}, 
   299291, 
   null, 
   1201737180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Paul comes in second in neveda", 
  "url": "http://www.4forums.com/political/current-events-debates/10833-paul-comes-second-neveda.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 10833, 
  "discussion_files": [
   [
    "4724.html", 
    "http://www.4forums.com/political/current-events-debates/10833-paul-comes-second-neveda-print.html"
   ], 
   [
    "4725.html", 
    "http://www.4forums.com/political/current-events-debates/10833-paul-comes-second-neveda-2-print.html"
   ]
  ], 
  "identifier": 10833
 }
]