[
 [
  [
   298358, 
   null, 
   "JPSartre12", 
   "As if the bastard hasn't screwed up enough, Here's his latest attempt to BE a liberal.\n \n \n\n The Second Amendment a second class right?\n By Charles Bloomer\n web posted January 21, 2008\n \n The Solicitor General has issued a truly bizarre amicus brief to the Supreme Court in the case of Heller vs. District of Columbia, the case that is challenging the District's ban on handguns.\n \n The Solicitor General's Office represents the administration in cases before the Supreme Court and, as in this case, presents the administration's position. Needless to say, the Solicitor General's Office has considerable influence before the court.\n \n The brief presented by the Solicitor General makes some valid points upon which Second Amendment supporters can agree. The brief states the administration's opinion that the right to keep and bear arms is an individual right, and that laws restricting that right should be subject to \"strict scrutiny\" - meaning that legislators must weigh the proposed benefit of the law carefully before infringing on a Constitutionally guaranteed right. Additionally, the brief expresses the opinion that the District of Columbia's strict gun ban should be overturned. So far, so good.\n \n The Solicitor General's brief also takes a bizarre turn. While the Solicitor General calls for \"strict scrutiny\" for gun laws in general, he calls on the Supreme Court to apply only \"intermediate scrutiny\" as it determines Heller vs. DC. The Solicitor General also argues that the Second Amendment is not a \"fundamental\" right.\n \n So what the Solicitor General seems to be saying is that, well, sure, the Second Amendment calls for individual rights, and those rights should be afforded \"strict scrutiny\" most of the time, but the administration does not believe that gun rights are \"fundamental\" rights, and so, therefore, Your Honor, you don't need to be too strict in your decision-making process in this case. In fact, we don't think you should really decide this case, but you should send it back down to the Circuit Court for more study, and while they are at it, tell them they only need to use \"intermediate scrutiny\".\n \n In essence, the Solicitor General is saying that our Second Amendment rights are second-class rights that don't rise to the level of \"fundamental\" rights as do really important rights such as the First Amendment, or the Fourth and Fifth Amendments. Truly bizarre.\n http://www.enterstageright.com/archive/articles/0108/0108secamd.htm\n \n \n", 
   {
    "post_info": {
     "post_title": "Bush's Attempt to Screw Gun Owners- 2nd Amendment=second class"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1201055520.0
  ], 
  [
   298570, 
   null, 
   "daewoo", 
   "I got a copy of this in my inbox (a opy of the brief that was filed) and it really is bizzare. The brief literally makes an individualist, strict scrutiny argument (which means it is a fundamental right since only fundamental rights are subject to the strict scrutiny doctrine) then immediatly turns around and basically says \"Except in cases where the government wants to do somethign, then we apply intermediate scrutiny and it is not fundamental\".\n \n Bizzare.\n \n \n Good to see you back, JP. I jsut saw a post from George. Are we all getting a little bored????", 
   {}, 
   298358, 
   null, 
   1201225320.0
  ], 
  [
   298681, 
   null, 
   "JPSartre12", 
   "I got a copy of this in my inbox (a opy of the brief that was filed) and it really is bizzare. The brief literally makes an individualist, strict scrutiny argument (which means it is a fundamental right since only fundamental rights are subject to the strict scrutiny doctrine) then immediatly turns around and basically says \"Except in cases where the government wants to do somethign, then we apply intermediate scrutiny and it is not fundamental\".\n \n Bizzare.\n \n \n Good to see you back, JP. I jsut saw a post from George. Are we all getting a little bored????\n\n \n Actually, I've been posting more than ever...just not here. This place has become gay central and it bored me. I posted the above because I knew it was a topic near and dear to both of our hearts. emoticon_xkill emoticon_xgood", 
   {}, 
   298570, 
   null, 
   1201303980.0
  ], 
  [
   299624, 
   null, 
   "Bryan", 
   "\"Intermediate scrutiny\" is a middle ground test between \"rationally related\" and \"strict scrutiny.\" It is typically used in equal protection cases like, for example, challenges to sex or race based public college admission policies. The test is generally defined as requiring proof of an \"important governmental interest\" which is being further by a law which is \"substantially related\" to the \"important interest.\" Like many tests SCOTUS uses, the burden placed upon the government to justify a challenged law or policy shifts depending on how favorably the justices look on what the government has tried to do. For example, in U.S. v. Virginia, 518 U.S. 515 (1996), the court looked unfavorably upon a sex based classification scheme and declared that the government must in that case show an \"exceedingly persuasive justification\" for the classification. This language places the test nearly on par with strict scrutiny, but not all cases have followed this test exception.\n \n It does not surprise me that the Solicitor General, as the government's chief advocate, would argue that the government's law should be upheld. When Bush took over from Clinton the government continued to argue that the challenged law in the then-pending Emerson case was constitutional. It does surprise me that intermediate scrutiny is the test sought to be applied. I find the argument for using that test unpersuasive. \n \n This is where I see the real SCOTUS fight lies. I firmly believe we will see an individual right decision. The issue will be how SCOTUS defines the right and what test it uses to protect it. \n \n ---\n \n \"The issue, however, is not whether court rules are \"mutable\"; they assuredly are. It is not whether, in the light of \"various circumstances,\" they can be \"modifi[ed]\"; they assuredly can. The issue is whether, as mutated and modified, they must make sense. The requirement that they do so is the only thing that prevents this Court from being some sort of nine-headed Caesar, giving thumbs-up or thumbs-down to whatever outcome, case by case, suits or offends its collective fancy.\"\n Dickerson v. United States, 530 U.S. 428, 455 (2000) (J. Scalia, dissenting)", 
   {
    "post_info": {
     "post_title": "The test used will be the key to this case"
    }, 
    "unicode_changes_made": true
   }, 
   298681, 
   null, 
   1201848120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush's Attempt to Screw Gun Owners- 2nd Amendment=second class", 
  "url": "http://www.4forums.com/political/gun-control-debates/10843-bushs-attempt-screw-gun-owners-2nd-amendment-second-class.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 10843, 
  "discussion_files": [
   [
    "17350.html", 
    "http://www.4forums.com/political/gun-control-debates/10843-bushs-attempt-screw-gun-owners-2nd-amendment-second-class-print.html"
   ]
  ], 
  "identifier": 10843
 }
]