[
 [
  [
   299139, 
   null, 
   "antonia", 
   "National Organization For Women, which has endorsed Senator Hillary Clinton, comments briefly on Ted Kennedy endorsement:\n \n http://www.commondreams.org/news2008/0128-19.htm\n \n 3 of Bobby Kennedy's children have endorsed Senator Clinton. They include Kathleen Kennedy Townsend, former Attorney General of Maryland; Mary Kerry Kennedy, Human Rights Activist and author of \"Speak Truth to Power\"; Robert Kennedy Jr., environmental attorney and co-host of Ring of Fire on the Air America Radio network. Kathleen Kennedy Townsend released a statement, which included:\n \n \"I respect Caroline and Teddy's decision but I have made a different choice. While I admire Senator Obama greatly, I have known Hillary Clinton for over 25 years and have seen first hand how she gets results. As a woman, leader, and person of deep convictions, I believe Hillary Clinton would make the best possible choice for president. She shares so many of the concerns of my father. Hillary has spent a lifetime speaking out on behalf of the powerless and working to alleviate poverty, in our country and around the world. I have seen her work up close and know she will be a great President. At this moment when so much is at stake at home and overseas, I urge our fellow Americans to support Hillary Clinton. That is why my brother Bobby, my sister Kerry, and I are supporting Hillary Clinton.\"\n \n http://www.observer.com/2008/todays-kennedy-endorsements-obama-2-clinton-1\n \n Although the length of the following clip diverges a bit, in reading about this issue, I discovered that Mary Kerry Kennedy has quite a record on issues, in her own right. Just to show, in a positive light, what the individuals endorsing Senator Clinton are about (besides their circumstance of birth as Kennedys):\n \n Kennedy is on the board of directors for the Robert F. Kennedy Memorial and founded the Robert F. Kennedy Memorial Center for Human Rights (CHR). She led a delegation from the CHR to Liberia in July of 2004. She is also on the advisory board of The International Center for Ethics, Justice and Public Life at Brandeis University.\n Ms. Kennedy started working in the field of human rights in 1981 when she investigated abuses committed by U.S. immigration officials against refugees from El Salvador. Since then, her life has been devoted to the vindication of equal justice, to the promotion and protection of basic rights, and to the preservation of the rule of law. She established the Robert F. Kennedy Memorial Center for Human Rights in 1988 and she has worked on diverse human rights issues such as children's rights, child labor, disappearances, indigenous land rights, judicial independence, and freedom of expression, ethnic violence, impunity, and the environment. She has concentrated specifically on women's rights, exposing injustices and educating audiences about women's issues, particularly honor killings, sexual slavery, domestic violence, workplace discrimination, sexual assault, abuse of prisoners, and more. She has led over 40 human rights delegations to over 30 countries. At a time of diminished idealism and growing cynicism about public service, her life and lectures are testaments to the commitment to the basic values of human rights.\n Kennedy is the author of Speak Truth to Power : Human Rights Defenders Who Are Changing Our World, which features interviews with human rights activists ranging from the famous - Helen Prejean, Marian Wright Edelman, His Holiness the Dalai Lama, Archbishop Desmond Tutu, Elie Wiesel, and Oscar Arias to name a few - to lesser known stories of courage. Speak Truth, a global education initiative to aid the fight for international human rights, grew from her book exploring the quality of courage through the words of leading human rights defenders around the world to the moving and inspiring play by esteemed Chilean poet and Broadway playwright Ariel Dorfman, the stirring photographic exhibition by Pulitzer Prize-winner Eddie Adams, a PBS documentary film, an education packet, five public service announcements on national television, an award-winning website, www.speaktruthtopower.org and federal legislation which increased federal funding for the protection of human rights. The book has been translated into Greek, Spanish and Italian.\n Kennedy produced the premiere of the play at The Kennedy Center in Washington, D.C. where Jackson Browne and Hugh Masekela performed for host President William Clinton, and actors included Alec Baldwin, Kevin Kline John Malkovich, and Sigorney Weaver. She has since produced the play to acclaim 25 times in 9 countries and 5 languages, including Athens, Barcelona, Doha, Geneva, Helsinki, London, Madrid, and Rome and Sydney. The website has attracted over four million viewers, and kept them there for an average 9.6 minutes per viewer (a notably high number), reading, learning, taking action.\n Kennedy served a Executive Director and is now on the Board of Directors of the Robert F. Kennedy Memorial, a non-profit organization that addresses the problems of social justice. She ran three programs: The National Juvenile Justice Project, which helped municipalities create more effective and less costly programs for dealing with young offenders; The RFK Journalism and RFK Book Awards, known as the \"poor people's Pulitzers\", which recognize those authors who prod our conscience and expose the problems of the dispossessed; and the RFK Center for Human Rights, which she founded in 1988.\n Kennedy established the RFK Center for Human Rights to ensure the protection of rights codified under the U.N. Declaration of Human Rights. The Center provides an on going base of support to leading human rights defenders around the world. The Center uncovers and publicizes abuses such as torture, disappearances, repression of free speech and child labor; urges Congress and the U.S. administration to highlight human rights in foreign policy, supplies activists with the resources they need to advance their work and creates other programs to advance respect for human rights.\n Kennedy has appeared numerous times on ABC, NBC, CBS, CNN and PBS as well as on networks in countries around the world, and her commentaries and articles have been published in The Boston Globe, The Chicago Sun-Times, L'Unita, The Los Angeles Times, Marie Claire, The New York Times, Pagina12, TV Guide and the Yale Journal of International Law. As a special correspondent for the environmental magazine television program, \"Network Earth\", she reported on human rights and the environment. She interviewed human rights leaders for Voice of America.\n Kerry Kennedy is the chairman of the Amnesty International Leadership Council, and is a judge for the Reebok Human Rights Award. She serves on the boards of directors of the International Center for Ethics, Justice and Public Life at Brandeis University, Human Rights First, Inter- Press Service ( Rome, Italy) the Bloody Sunday Trust ( Northern Ireland), The Alliance for the New Humanity and The China Information Network. She serves on the Gleitzman Foundation's Special Board of Advisors for the Sakharov Award, and the Editorial Board of Advisors of the Buffalo Human Rights Law Review. She is on the Advisory Committee for the International Campaign for Tibet, the Committee on the Administration of Justice of Northern Ireland, the Global Youth Action Network, Studies without Borders and several other organizations. She serves on the leadership council of the Amnesty International Campaign to stop violence against women and on the Advisory Board of the Albert Schweitzer Institute.\n \n http://en.wikipedia.org/wiki/Mary_Kerry_Kennedy", 
   {
    "post_info": {
     "post_title": "N.O.W. comments on Kennedy endorsement"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1201668060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  N.O.W. comments on Kennedy endorsement", 
  "url": "http://www.4forums.com/political/elections-debates/10864-n-o-w-comments-kennedy-endorsement.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 10864, 
  "discussion_files": [
   [
    "2957.html", 
    "http://www.4forums.com/political/elections-debates/10864-n-o-w-comments-kennedy-endorsement-print.html"
   ]
  ], 
  "identifier": 10864
 }
]