[
 [
  [
   299101, 
   null, 
   "HonestAbe", 
   "McCain is now gay-baiting\n by John Aravosis (DC) · 1/29/2008 11:33:00 AM ET · Link\n Discuss this post here: Comments (88) · reddit · FARK ·· Digg It!\n \n That didn't take long. So much for our maverick. When the going gets tough, John McCain goes XXXXX bashing. Note his adoption of the religious right buzz-phrase \"special rights.\" Considering McCain helped shoot down a constitutional amendment banning gay marriage, I'm just curious how he defines \"special rights.\" McCain has always surrounding himself with gay men. Ever since I worked on the Hill in the late 80s, early 90s, McCain always had gay men on staff in senior positions. Openly gay men. Gay men who had no problem helping the gay rights movement. Gay men who people like McCain would call \"gay activists.\" McCain had zero problem helping powerful openly-gay men advance in Washington, DC. He currently has no problem employing them at the highest reaches of his campaign - the highest reaches - helping them work their \"special rights\" agenda in his campaign and beyond. But now we're to believe that McCain suddenly has a problem with the gays and their \"special rights.\"\n \n Mitt Romney isn't the only GOP candidate playing games with their position on gays. McCain has been trying to have it both ways on gay issues for two decades now. Privately helping gay activists while publicly condemning them. There's a reason that conservatives don't trust McCain. He's just a more refined version of Mitt Romney. Say one thing, do another.\n \n americablog.com", 
   {
    "post_info": {
     "post_title": "Gay-baiting by McCain"
    }
   }, 
   null, 
   null, 
   1201655100.0
  ], 
  [
   299104, 
   null, 
   "Kronus", 
   "Don't just cut and paste other people's work. Aside from being against the rules, you lost all the links, so we have no idea what this is supposed to be refering to.", 
   {}, 
   299101, 
   null, 
   1201656480.0
  ], 
  [
   299108, 
   null, 
   "foundit66", 
   "The call, and audio file of which was shared by a Brevard County Republican and confirmed by McCain's campaign as their own, is portrayed as a social conservative expressing concern about Romney.\n \n \"Mitt Romney thinks he can fool us,\" says the voice. \"He supported abortion on demand, even allowed a law mandating taxpayer-funding for abortion. He says he changed his mind, but he still hasn't changed the law. He told gay organizers in Massachusetts he would be a stronger advocate for special rights than even Ted Kennedy. Now, it's something different.\"\n \n Romney, the caller continues, \"has treated social issues voters as fools, thinking we won't catch on.\"\n \n \"Sorry, Mitt, we know you aren't trustworthy on the most important issue -- and you aren't a conservative.\"\n \n McCain spokeswoman Jill Hazelbaker said they launched the automated calls as a response to the calls Romney sent out against them over the weekend.http://www.politico.com/blogs/jonathanmartin/0108/McCain_sends_out_harsh_robocall_hitting_Mitt_from_Right.html\n \n Sounds like McCain is trying to go for Romney's votes, including on the issue of alleged promises to gays.\n Note the phrasing \"special rights\", which is a neo-conservative anti-gay buzz-word to denigrate equality under the pretense that preventing discrimination is somehow a \"special right\"...", 
   {
    "unicode_changes_made": true
   }, 
   299104, 
   null, 
   1201659060.0
  ], 
  [
   299109, 
   null, 
   "HonestAbe", 
   "Don't just cut and paste other people's work. Aside from being against the rules, you lost all the links, so we have no idea what this is supposed to be refering to.\n\n \n Can't you read?", 
   {}, 
   299104, 
   null, 
   1201659240.0
  ], 
  [
   299125, 
   null, 
   "Kronus", 
   "Can't you read?\n\n \n What are you trying to say here? You did just cut and paste, and you did lose the relevant link. Foundit kindly supplied the relevant quote that provides the context needed for your post to be useful. So where are you saying my reading skills failed me?", 
   {}, 
   299109, 
   null, 
   1201663860.0
  ], 
  [
   299327, 
   null, 
   "HonestAbe", 
   "What are you trying to say here? You did just cut and paste, and you did lose the relevant link. Foundit kindly supplied the relevant quote that provides the context needed for your post to be useful. So where are you saying my reading skills failed me?\n\n \n I'm sorry, Kronus, but at the end of my post I wrote \"americablog.com\" which is where the quote came from. I thought you'd understand that was the source of the quote.", 
   {}, 
   299125, 
   null, 
   1201744800.0
  ], 
  [
   299401, 
   null, 
   "lesz", 
   "I'm sorry, Kronus, but at the end of my post I wrote \"americablog.com\" which is where the quote came from. I thought you'd understand that was the source of the quote.\n\n \n I'm nitpicking, but it's just more helpful and specific to link to the actual post, rather than merely identifying the blog it came from. Americablog moves so fast that it's not always easy to find particular posts if they aren't linked. In cases like this it's not a biggie for me, anyway, but sometimes one does want to go back to the source and see what else was there or look for related info.", 
   {}, 
   299327, 
   null, 
   1201784640.0
  ], 
  [
   299402, 
   null, 
   "lesz", 
   "As far as McCain is concerned, he's desperate to make the WH. He's ancient and this is positively his last chance -- even if elected, it isn't certain he'd serve a full term -- he's old, tired, and god knows what else is wrong with him physically. So it's hardly surprising he'd throw gays to the wolves for his own special interests.\n \n Frankly, I think the GOP has given up on this election. Potentially good candidates -- not that they have many of those -- are sitting it out because they think that after Bush, there'll be a Democratic landslide no matter who the Dems select. Whether that reasoning is right or wrong I don't pretend to know, but the GOP does have a clown car of candidates. There isn't one among them who could pick up the pieces after the Bush disaster, or who doesn't make a person cringe to think of in the WH.", 
   {}, 
   299401, 
   null, 
   1201784940.0
  ], 
  [
   299406, 
   null, 
   "Ohioprof", 
   "As far as McCain is concerned, he's desperate to make the WH. He's ancient and this is positively his last chance -- even if elected, it isn't certain he'd serve a full term -- he's old, tired, and god knows what else is wrong with him physically. So it's hardly surprising he'd throw gays to the wolves for his own special interests.\n \n Frankly, I think the GOP has given up on this election. Potentially good candidates -- not that they have many of those -- are sitting it out because they think that after Bush, there'll be a Democratic landslide no matter who the Dems select. Whether that reasoning is right or wrong I don't pretend to know, but the GOP does have a clown car of candidates. There isn't one among them who could pick up the pieces after the Bush disaster, or who doesn't make a person cringe to think of in the WH.\n\n \n McCain has been all over the place when it comes to equal rights for gay people. He opposed the federal amendment to restrict marriage in the constitution and exclude gay people, but he supported the proposed amendment in Arizona to exclude gay people from marriage. He has not had anything resembling a consistent position on this. \n \n I do not think that the Republicans have given up on the election. Indeed, I am not certain that American voters will choose either a woman or a black man for President. They usually won't say this out loud, of course. But I can foresee McCain being elected. I think racism and sexism are still very strong in our country, even though people are less likely to speak how they really feel out loud. But people vote in private. We may end up with President McCain. \n \n I also think that McCain's rise demonstrates the limit of the power of the Christian right. Bush was able to bring together the religious right, with which he identified, and the business leadership of the Republican Party, with which he also identified. He embodied this unlikely coalition in himself. Now the coalition has split apart. This is a great hope, I think, for those of us who want to see a Democrat in the White House. McCain, the mostly Republican nominee now, is in no way of the religious right, and many on the religious right will not support him. He also makes the leaders of the Republican Party uncomfortable, but they will support him. The coalition that brought the Republicans to power has come apart, and Democrats can capitalize on this. But will most voters elect a woman or a black man? I hope so. We will see.\n \n Whatever happens, even if McCain gets elected in November, our government won't be as horrible for gay people and for the country as a whole as it was under Bush. We will most likely have a Democratic Congress, whoever is elected President. And for all his flip-flopping on gay rights, McCain has never been a darling of the Christian right, and they can't pressure him into pushing anti-gay laws on the nation. I think McCain prefers simply to avoid the issue of gay people as much as possible. (Bush actually expressed the same thoughts; he had to be pressured by the religious right to come out in favor of the anti-marriage amendment. But he was able to be pressured, because the Christian right helped elect Bush. McCain would not be in the same position.)", 
   {}, 
   299402, 
   null, 
   1201786860.0
  ], 
  [
   299407, 
   null, 
   "lesz", 
   "McCain has been all over the place when it comes to equal rights for gay people. He opposed the federal amendment to restrict marriage in the constitution and exclude gay people, but he supported the proposed amendment in Arizona to exclude gay people from marriage. He has not had anything resembling a consistent position on this. \n \n I do not think that the Republicans have given up on the election. Indeed, I am not certain that American voters will choose either a woman or a black man for President. They usually won't say this out loud, of course. But I can foresee McCain being elected. I think racism and sexism are still very strong in our country, even though people are less likely to speak how they really feel out loud. But people vote in private. We may end up with President McCain. \n \n I also think that McCain's rise demonstrates the limit of the power of the Christian right. Bush was able to bring together the religious right, with which he identified, and the business leadership of the Republican Party, with which he also identified. He embodied this unlikely coalition in himself. Now the coalition has split apart. This is a great hope, I think, for those of us who want to see a Democrat in the White House. McCain, the mostly Republican nominee now, is in no way of the religious right, and many on the religious right will not support him. He also makes the leaders of the Republican Party uncomfortable, but they will support him. The coalition that brought the Republicans to power has come apart, and Democrats can capitalize on this. But will most voters elect a woman or a black man? I hope so. We will see.\n \n Whatever happens, even if McCain gets elected in November, our government won't be as horrible for gay people and for the country as a whole as it was under Bush. We will most likely have a Democratic Congress, whoever is elected President. And for all his flip-flopping on gay rights, McCain has never been a darling of the Christian right, and they can't pressure him into pushing anti-gay laws on the nation. I think McCain prefers simply to avoid the issue of gay people as much as possible. (Bush actually expressed the same thoughts; he had to be pressured by the religious right to come out in favor of the anti-marriage amendment. But he was able to be pressured, because the Christian right helped elect Bush. McCain would not be in the same position.)\n\n \n Well, McCain is even further to the right than Bush, and he's demonstrated that he has no moral scruples in doing whatever it takes to get what he wants. He may not be a patsy for the religious cuckoos, but he'll do whatever it takes to get their support if he thinks it's essential. I do not trust him an inch. He will do whatever it takes, integrity be damned. He's that desperate. He hugged Bush.\n \n With respect to your comments on Americans voters not voting for a black or a woman, I think you have a point. Many will say one thing in polls to avoid being seen as bigots, and do entirely another in the voting booth in secret. That's what happened in Virginia, if I recall. However, that die is cast. It will be either a black or a woman, and the Democratic margin in the polls will have to be major if they expect to win in the ballot by a whisker. The advantage either have over McCain (besides policy) is youth. McCain is virtually gaga, and a vigorous campaign is going to show up the weaknesses of age.\n \n If we have President McCain, do not expect any improvements over Bush. America will remain an international pariah.", 
   {}, 
   299406, 
   null, 
   1201788720.0
  ], 
  [
   299411, 
   null, 
   "lesz", 
   "It's a sad commentary these days that America's natural allies are Saudi Arabia and Pakistan. In most of Europe except the crime-ridden, corrupt east, America is seen as dangerous. I've experienced a lot of anti-American hostility here in Britain. While governments try to take a longer view than populist fashions, they aren't independent of them. Within a year, America will be alone in Iraq, and Europe isn't going to care -- that is Bush's adventure.\n \n It's a pity. While I abhor and revile the Bush maladministration, I have a great fondness for Americans, and the freedoms they represent as individuals -- but I no longer have any trust in their institutions. Americans didn't deserve Bush, for all that they voted for the jerk the second time round. They are a better people, and they deserve better leadership. They won't get it with any Republican candidate. Barring a miracle. With Bush, they made a mistake. Twice. If they make another mistake, no-one will forgive them at all. Then, they will have to accept responsibility for their decisions.", 
   {}, 
   299407, 
   null, 
   1201789860.0
  ], 
  [
   299412, 
   null, 
   "Bassman", 
   "Spoken like a true Eurosocialist! Who gives a tinker's damn what the world thinks of the US?? I sure don't.", 
   {}, 
   299411, 
   null, 
   1201790820.0
  ], 
  [
   299417, 
   null, 
   "lesz", 
   "Spoken like a true Eurosocialist! Who gives a tinker's damn what the world thinks of the US?? I sure don't.\n\n \n Which is why you and the USA are going to hell in a handbasket, while the rest of the world smilingly applauds. Don't forget, sweetie, it's the Chinese who hold the largest part of your debt. :) And they aren't altruists.\n \n I'm one of the few outside the US who mourns the demise of America's greatness, but your nation no longer stands for the ideals that once made it great. Ultimately, that's your problem, and you'll just make it worse by voting GOP.", 
   {}, 
   299412, 
   null, 
   1201794720.0
  ], 
  [
   299422, 
   null, 
   "Ohioprof", 
   "Spoken like a true Eurosocialist! Who gives a tinker's damn what the world thinks of the US?? I sure don't.\n\n \n I do. I think we turn a deaf ear to the rest of the world at our peril.", 
   {}, 
   299412, 
   null, 
   1201796400.0
  ], 
  [
   299430, 
   null, 
   "jyoshu", 
   "Spoken like a true Eurosocialist! Who gives a tinker's damn what the world thinks of the US?? I sure don't.\n\n \n I think everyone cares to SOME degree, and if pressed, you probably would too in some ways. But if you're a true bona-fide isolationist to THAT extent, you're a rare breed indeed. I DO care, but the U.S. can't determine all it's decisions based on what other countries think. We have to do what is in our country's best interest, and sometimes that involves making allies; sometimes it involves decisions that might tick off other countries.", 
   {}, 
   299412, 
   null, 
   1201798020.0
  ], 
  [
   299432, 
   null, 
   "lesz", 
   "I think everyone cares to SOME degree, and if pressed, you probably would too in some ways. But if you're a true bona-fide isolationist to THAT extent, you're a rare breed indeed. I DO care, but the U.S. can't determine all it's decisions based on what other countries think. We have to do what is in our country's best interest, and sometimes that involves making allies; sometimes it involves decisions that might tick off other countries.\n\n \n Like the entire rest of the world. *rolls eyes* My dear, unlike most of the rest of the world, I do have sympathy for what the US represents, or at least, used to represent. You can't determine all your decisions irrespective of what the rest of the world thinks. The rest of the world holds your debt. What are you going to do? Nuke us?", 
   {}, 
   299430, 
   null, 
   1201798260.0
  ], 
  [
   299453, 
   null, 
   "Ohioprof", 
   "Getting back to the question of how conservative McCain is, here is a link to a piece by a conservative on this question. Randall Hoven argues that, in his view, McCain is not very conservative. He examines McCain's ratings by the American Conservative Union. Of course, if you compare him to both Hillary Clinton and Barack Obama, McCain appears to be very conservative. He apparently is not conservative enough for the author, Randall Hoven. Here is the link:\n \n http://www.americanthinker.com/2008/01/mccains_acu_ratings.html", 
   {}, 
   299432, 
   null, 
   1201804740.0
  ], 
  [
   299467, 
   null, 
   "jyoshu", 
   "Like the entire rest of the world. *rolls eyes* My dear, unlike most of the rest of the world, I do have sympathy for what the US represents, or at least, used to represent. You can't determine all your decisions irrespective of what the rest of the world thinks. The rest of the world holds your debt. What are you going to do? Nuke us?\n\n \n What \"the rest of the world thinks\" should always be a factor in decision making--one of many. But it can't be the sole one, and countries (whether the U.S., the UK, or whoever) have to make decisions based on what in their country's interests.", 
   {}, 
   299432, 
   null, 
   1201806900.0
  ], 
  [
   299469, 
   null, 
   "foundit66", 
   "Which is why you and the USA are going to hell in a handbasket, while the rest of the world smilingly applauds. Don't forget, sweetie, it's the Chinese who hold the largest part of your debt. :) And they aren't altruists.\n\n I don't understand why that doesn't bother more people.\n We are MASSIVELY indebted to communist power-house.\n \n Could you imagine what the reaction would have been if we had tried to borrow massive amounts of money from Russia during the \"Cold War\" with all the \"communists are gonna get you\" hype?\n While I don't see the world in that simple of terms, it's amusing to see how quickly our mentality changed on that.\n \n \n \nI'm one of the few outside the US who mourns the demise of America's greatness, but your nation no longer stands for the ideals that once made it great. Ultimately, that's your problem, and you'll just make it worse by voting GOP.\n\n And what's sadder is that when people talk about how America can and should improve, and what we're doing wrong, there are often simple-minded and meaningless replies like \"you're a blame America first type person\" or \"you're a Bush hater\".\n Blatantly ad hominem / attack the messenger but ignore the messsage mentality.\n \n Quite frankly, where the heck did FINANCIAL RESPONSIBILITY go? (Or did we ever have it?)\n If any business ever ran itself like America 'does business', that company would quickly be bankrupt.", 
   {}, 
   299417, 
   null, 
   1201806960.0
  ], 
  [
   299474, 
   null, 
   "foundit66", 
   "I do not think that the Republicans have given up on the election. Indeed, I am not certain that American voters will choose either a woman or a black man for President. They usually won't say this out loud, of course. But I can foresee McCain being elected. I think racism and sexism are still very strong in our country, even though people are less likely to speak how they really feel out loud. But people vote in private. We may end up with President McCain.\n\n I was watching the news last night and they discussed polling numbers that were done running McCain against Hillary, and another poll with McCain against Obama.\n At the time the poll was taken, McCain came out ahead with a comfortable margin for both.\n \n There was even talk of a possible Republican consideration of picking McCain just because he is expected to have a better chance against Hillary.\n \n Of course, the one thing that was not mentioned in the discussion of the polls is what you talk about above, which I feel DOES still exist in America.", 
   {}, 
   299406, 
   null, 
   1201808580.0
  ], 
  [
   299490, 
   null, 
   "HonestAbe", 
   "Fiscal responsibility went out the window with Reagan. Paying for a war on our grandchildren's credit card is truly immoral.", 
   {}, 
   299474, 
   null, 
   1201811400.0
  ], 
  [
   299622, 
   null, 
   "jyoshu", 
   "Getting back to the question of how conservative McCain is, here is a link to a piece by a conservative on this question. Randall Hoven argues that, in his view, McCain is not very conservative. He examines McCain's ratings by the American Conservative Union. Of course, if you compare him to both Hillary Clinton and Barack Obama, McCain appears to be very conservative. He apparently is not conservative enough for the author, Randall Hoven. \n\n \n I think the main difference is that he's not in the pocket of the religious right. This is a good change for the Republican party, and I think people (in the party) have known for some time that the influence of the RR would eventually wane, in part because nothing like that lasts forever. It's been waning for some time now. However, that doesn't necessarily translate to wins on the part of Democrats. The Republican party has operated outside the influence of the RR before, and they can do it again if need be. Reagan sort of began that reliance on the RR, but for him it was still nominal as compared to today, and McCain would probably be a return to that sort of level of reliance. If you reject the idea that RR conservatism is true conservatism (in the Goldwater bent), one could argue he's MORE conservative than Bush, depending on the way you view conservatism. Bush and McCain embody different types of conservatism, IMO. And let's face it, McCain has certainly demonstrated a willingness to work with people across the aisle.\n \n I do agree that there could very well be people out there who are uncomfortable with a woman as president. I think it could be more so that way than with a black president. But I fear that if either or both of them lose in the end, then the automatic excuse given by their supporters will be because of prejudice, and that will not be giving the American people enough credit if that happens.\n \n I think the greater danger for democrats, more so than racism or misoginism, is simply that McCain could turn out to be a candidate that is more appealing in terms of issues like national security (which Dems ALWAYS seem to underestimate as a public concern, as evidenced yet again in the DNC debate tonight). I am pretty surprised at how little the DNC candidates are discussing it, given how much Democrats have taken a beating over it in recent years. They seem to be hedging their bet on a recession (which may indeed happen)--trying to shift the economy as a pet issue. I think the best chance they have is to shore up their weakness of national security.", 
   {}, 
   299453, 
   null, 
   1201845960.0
  ], 
  [
   299642, 
   null, 
   "lesz", 
   "Getting back to the question of how conservative McCain is, here is a link to a piece by a conservative on this question. Randall Hoven argues that, in his view, McCain is not very conservative. He examines McCain's ratings by the American Conservative Union. Of course, if you compare him to both Hillary Clinton and Barack Obama, McCain appears to be very conservative. He apparently is not conservative enough for the author, Randall Hoven. Here is the link:\n \n http://www.americanthinker.com/2008/01/mccains_acu_ratings.html\n\n \n I suppose if one were to take the view that you can't be called a conservative unless you are to the right of Attila, then few people except the out-and-out crazies could be described as conservatives. I've seen XXXXXX describe Bush as a \"liberal\" because Bush is the leading borrow-and-spend Republican, but no-one in their right minds would agree with that classification. \n \n I do not know what McCain's social policies about gays would be in practice or whether he would be happy to follow his current rhetoric, but I do not trust the man at all. He seems to be OK with admitted homosexuals on a personal basis, but so is Bush and many other Republicans. It's taking a principled public policy stance in favour of equal rights that sends the entire gaggle of them, including homosexual fellow travellers, running for the hills. McCain could no more be relied on to defend the rights of gay Americans than Huckabee, not out of any personal conviction, but because he's happy to pander to Christianist special interest groups.", 
   {}, 
   299453, 
   null, 
   1201867020.0
  ], 
  [
   299643, 
   null, 
   "lesz", 
   "And what's sadder is that when people talk about how America can and should improve, and what we're doing wrong, there are often simple-minded and meaningless replies like \"you're a blame America first type person\" or \"you're a Bush hater\".\n Blatantly ad hominem / attack the messenger but ignore the messsage mentality.\n\n \n Yes, that is sad. There are still those of us who want the US to do well, to provide leadership and be one of the respected nations of the world, but the sad reality is that at present, we are a dwindling minority outside the US. I still don't think it's Americans as such that are unpopular, it's the Bush maladministration, but not everyone is able to separate nations from their temporary leaderships, and Bush has moved mountains to shred America's international reputation.\n \n When those of us who do think America can be great again are attacked as anti-American, the attackers are really shooting themselves in the foot. When friends offer advice, one may not agree with it, but it is foolish to call them enemies.", 
   {}, 
   299469, 
   null, 
   1201867440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gay-baiting by McCain", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10862-gay-baiting-mccain.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10862, 
  "discussion_files": [
   [
    "2944.html", 
    "http://www.4forums.com/political/gay-rights-debates/10862-gay-baiting-mccain-print.html"
   ], 
   [
    "2945.html", 
    "http://www.4forums.com/political/gay-rights-debates/10862-gay-baiting-mccain-2-print.html"
   ]
  ], 
  "identifier": 10862
 }
]