[
 [
  [
   299259, 
   null, 
   "Ghost Rider", 
   "Just what makes you think that outlawing guns will do any good? Why do you think that making guns illegal would make it harder for criminals to get them, or might encourage them to stop using them?", 
   {
    "post_info": {
     "post_title": "A question for supporters of gun control"
    }
   }, 
   null, 
   null, 
   1201723740.0
  ], 
  [
   299260, 
   null, 
   "sinjin", 
   "Do you have any idea how many handguns are stolen from the registered owner annually in the United States? Something like 200,000 I believe.", 
   {}, 
   299259, 
   null, 
   1201726020.0
  ], 
  [
   299262, 
   null, 
   "Ghost Rider", 
   "Do you have any idea how many handguns are stolen from the registered owner annually in the United States? Something like 200,000 I believe.\n\n \n Look you baboon, I don't want nonsense I want answers. What makes those here in favor of gun control and gun bans believe that by outlawing guns they'll make things better for everyone?", 
   {}, 
   299260, 
   null, 
   1201727040.0
  ], 
  [
   299268, 
   null, 
   "smiley", 
   "Look you baboon, I don't want nonsense I want answers. What makes those here in favor of gun control and gun bans believe that by outlawing guns they'll make things better for everyone?\n\n Well that was a good start. Are you planning on insulting everyone who replies to your post?\n \n Of course it would be more difficult for criminals to get hold of guns if there were fewer of them around. It would also make it more difficult for children to get hold of them, or feuding neighbours who, on the spur of the moment, think that waving a gun around might bring about a solution to their problems.\n \n If you don't think you're going to like the answers to your question, then don't ask the question.\n \n Smiley", 
   {}, 
   299262, 
   null, 
   1201728780.0
  ], 
  [
   299269, 
   null, 
   "Ghost Rider", 
   "Well that was a good start. Are you planning on insulting everyone who replies to your post?\n\n \n He has a baboon picture for his avatar.\n \n \nOf course it would be more difficult for criminals to get hold of guns if there were fewer of them around. \n\n \n We're not talking about there being less guns around, we're talking about them being made illegal to own.\n \n Cocaine is already illegal to own. Crystal meth is already illegal to own. Marijuana is already illegal to own. But guess what, criminals STILL have these drugs and use them regularly!\n \n \nIt would also make it more difficult for children to get hold of them,\n\n \n Tell that to people in D.C. who still have their children die from being shot.\n \n \nor feuding neighbours who, on the spur of the moment, think that waving a gun around might bring about a solution to their problems.\n\n \n Tell that to the people in D.C. who need gun shot sensors.\n \n \nIf you don't think you're going to like the answers to your question, then don't ask the question.\n\n \n Is that why you anti-gunners never ask questions, just spout nonsense?\n \n \nSmiley\n\n \n Prozac.", 
   {}, 
   299268, 
   null, 
   1201729080.0
  ], 
  [
   299272, 
   null, 
   "Archangel", 
   "Do you have any idea how many handguns are stolen from the registered owner annually in the United States? Something like 200,000 I believe.\n\n \n First off, I would like to see a statistic for this 200,000 number, and if true, then I would like to see why that isn't more of a reason to stay armed so as to defend oneself from all of those newly armed criminals who now possess stolen weapons? \n \n And welcome to the forum Ghost Rider, just remain calm, make your points and all will be well with you.", 
   {}, 
   299260, 
   null, 
   1201730640.0
  ], 
  [
   299273, 
   null, 
   "jim's trucking", 
   "Look you baboon, I don't want nonsense I want answers. What makes those here in favor of gun control and gun bans believe that by outlawing guns they'll make things better for everyone?\n\n Firstly, sinjin is not a baboon. His avatar is colorful, but not indicative of his mental capacities. Be nice, or you'll get banned.\n \n I think he is alluding to the obvious fact that if people had not been allowed to purchase and register their guns, some 200,000 guns/year would NOT have been stolen, thus some 200,000 guns/year would be removed from the cache of guns available to criminals.\n \n However, the falacy of that thought is that guns are in demand by criminals...they will be procured by criminals whether they steal them from law abiding citizens or purchase them on the black market from other criminals.\n \n Outlawing guns will only remove them from law abiding citizens. The criminals will be unaffected.", 
   {}, 
   299262, 
   null, 
   1201731480.0
  ], 
  [
   299275, 
   null, 
   "Archangel", 
   "Firstly, sinjin is not a baboon. His avatar is colorful, but not indicative of his mental capacities. Be nice, or you'll get banned.\n \n I think he is alluding to the obvious fact that if people had not been allowed to purchase and register their guns, some 200,000 guns/year would NOT have been stolen, thus some 200,000 guns/year would be removed from the cache of guns available to criminals.\n \n However, the falacy of that thought is that guns are in demand by criminals...they will be procured by criminals whether they steal them from law abiding citizens or purchase them on the black market from other criminals.\n \n Outlawing guns will only remove them from law abiding citizens. The criminals will be unaffected.\n\n \n Precisely Jim, if criminals cared about the law then they wouldn't be stealing guns to begin with.", 
   {}, 
   299273, 
   null, 
   1201731840.0
  ], 
  [
   299280, 
   null, 
   "jim's trucking", 
   "He has a baboon picture for his avatar.\n...and you have a flaming skull for yours...does that mean your brains have been burned out?\n \n \n \n\n We're not talking about there being less guns around, we're talking about them being made illegal to own.\nThat would be fewer guns, not less guns. Where did you go to school? What part of \"these 200,000 guns would not be available to criminals\" did you not understand? His point is that SOME, albeit small...impact would be made on the criminal's ability to procure weapons by removing the registered weapons that are about to be stolen and passed out through the black market.\n \n \n \n\n Cocaine is already illegal to own. Crystal meth is already illegal to own. Marijuana is already illegal to own. But guess what, criminals STILL have these drugs and use them regularly!\nSupply and demand at work.\n \n \n \n\n Tell that to people in D.C. who still have their children die from being shot.\n \n \n \n Tell that to the people in D.C. who need gun shot sensors.\n \n \n \n Is that why you anti-gunners never ask questions, just spout nonsense?\nThere you go again...claiming nonsensical statements have been made when there is a valid point made.\n \n Removing guns from law abiding homes would certainly decrease the incidences wherein a child finds daddy's gun and shoots a friend, a sibling or himself. The gun-control advocates make a few points now and then, but they overlook the most obvious fact in the argument. Outlawing guns will not decrease the availability of guns to criminals.", 
   {}, 
   299269, 
   null, 
   1201732500.0
  ], 
  [
   299284, 
   null, 
   "sinjin", 
   "First off, I would like to see a statistic for this 200,000 number... \n\"From 1985 to 1994, the FBI received an annual average of over 274,000 reports of stolen guns.\"\n http://www.ncjrs.gov/txtfiles/165476.txt\n I'm guessing this continues.", 
   {}, 
   299272, 
   null, 
   1201734420.0
  ], 
  [
   299285, 
   null, 
   "sinjin", 
   "Firstly, sinjin is not a baboon. His avatar is colorful, but not indicative of his mental capacities.\nThank you JT. For the record I support the gun enthusiast's interpretation of the 2nd Amendment.\n \n \nI think he is alluding to the obvious fact that if people had not been allowed to purchase and register their guns, some 200,000 guns/year would NOT have been stolen, thus some 200,000 guns/year would be removed from the cache of guns available to criminals.\nPrecisely so.\n \n \nHowever, the fallacy of that thought is that guns are in demand by criminals...they will be procured by criminals whether they steal them from law abiding citizens or purchase them on the black market from other criminals.\nThe \"black market\" doesn't deal in homemade weapons. They're stolen for the most part too.", 
   {}, 
   299273, 
   null, 
   1201734840.0
  ], 
  [
   299302, 
   null, 
   "Ghost Rider", 
   "That would be fewer guns, not less guns. Where did you go to school? What part of \"these 200,000 guns would not be available to criminals\" did you not understand? \n \n \n The part I don't understand is how outlawing guns would actually keep them out of the hands of criminals. Would outlawing guns magically make them vanish from existance? No. Will outlawing guns convince criminals to turn theirs in? No. Will outlawing guns make the hundreds of thousands currently stolen firearms that're circulating the underground market networks inaccessible to criminals? No. Will it make it easier for the police to take guns out of the hands of criminals? No. Will it help locate the tens of millions of illegal guns circulating in this country? No.\n \n So obviously outlawing guns will have no positive benefits.\n \n \nHis point is that SOME, albeit small...impact would be made on the criminal's ability to procure weapons by removing the registered weapons that are about to be stolen and passed out through the black market.\n\n \n Why would anybody register weapons if they were just going to illegally sell them to somebody on the black market?\n \n \nSupply and demand at work.\n\n \n And criminals demand guns, so somebody will always be supplying them.\n \n \nThere you go again...claiming nonsensical statements have been made when there is a valid point made.\n\n \n Valid point? I see NO valid point anywhere. Outlawing guns will not make them inaccessible to criminals.\n \n \nRemoving guns from law abiding homes would certainly decrease the incidences wherein a child finds daddy's gun and shoots a friend, a sibling or himself.\n \n \n So would parents educating their children early and often of the dangers of playing with guns. That way maybe they won't find a stranger's gun hidden in the park and think it's a toy.", 
   {}, 
   299280, 
   null, 
   1201738440.0
  ], 
  [
   299303, 
   null, 
   "Ghost Rider", 
   "The \"black market\" doesn't deal in homemade weapons. They're stolen for the most part too.\n\n \n And if they're stolen that means that they're illegally possessed by a currently illegal supplier. And since they're illegally possessed by an illegal supplier, that means that they're obviously not bothered by the current laws cocnerning firearms possession by criminals, meaning that banning gun ownership won't even make them blink.", 
   {}, 
   299285, 
   null, 
   1201738560.0
  ], 
  [
   299312, 
   null, 
   "sinjin", 
   "And if they're stolen that means that they're illegally possessed by a currently illegal supplier. And since they're illegally possessed by an illegal supplier, that means that they're obviously not bothered by the current laws cocnerning firearms possession by criminals, meaning that banning gun ownership won't even make them blink.\nWho do you think they stole them from? Hint: They didn't have to go far. I needn't worry about you stealing my apples if I have no apple tree. If the supply of weapons is reduced demand is unchanged, granted. The ability to satisfy that demand is though. We can't do anything immediate about the guns already out there in the hands of criminals. NSS! We can over time make it harder and harder to get one. \n \n How would you feel about steep fines for losing a registered weapon regardless of how?", 
   {}, 
   299303, 
   null, 
   1201740660.0
  ], 
  [
   299316, 
   null, 
   "Ghost Rider", 
   "Who do you think they stole them from? Hint: They didn't have to go far.\n\n \n Fact of the matter: They're already circulating criminal networks. The criminals already have plenty of guns, that means that ending gun ownership will play no real part in ending gun possession by criminals.\n \n Face the facts! There is absolutely no legal access to any narcotics like pot or cocaine, yet criminals are still getting it and dealing in it.\n \n \nI needn't worry about you stealing my apples if I have no apple tree.\n\n \n You also needn't worry about being victimized if you have nothing of value.\n \n \nIf the supply of weapons is reduced demand is unchanged, granted. The ability to satisfy that demand is though.\n\n \n The supply of weapons will never be reduced through crackdowns on legal gun ownership. Criminals have access to tens of millions of illegal guns already, they're not going to run short anytime soon.\n \n \nWe can't do anything immediate about the guns already out there in the hands of criminals.\n\n \n Then what is the justification for trying to make me into a criminal and take my rights away from me?\n \n \nWe can over time make it harder and harder to get one.\n\n \n By infringing on my rights?\n \n You're actually telling me that ending my private right to legally own a gun will somehow prevent a criminal being being able to gain access to a gun through illegal channels? Because if that's what you're saying that you're several different kinds of stupid all wrapped together.\n \n Look at Washington D.C. By far the absolute strictest laws in the entire nation, they STILL need gun shot sensors because people are STILL being shot and killed on a regular basis!\n \n \nHow would you feel about steep fines for losing a registered weapon regardless of how?\n\n \n Probably the same way you'd feel about steap fines if your car was stolen regardless of the fact that you kept the doors locked and the keys inside the house.", 
   {}, 
   299312, 
   null, 
   1201741800.0
  ], 
  [
   299319, 
   null, 
   "sinjin", 
   "Then what is the justification for trying to make me into a criminal and take my rights away from me?\nYou asked a question, I answered. I see now you're just looking for a fight.\n \n \nYou're actually telling me that ending my private right to legally own a gun will somehow prevent a criminal being being able to gain access to a gun through illegal channels? Because if that's what you're saying that you're several different kinds of stupid all wrapped together.\nWatch your mouth or your time here will shortly come to an end.", 
   {}, 
   299316, 
   null, 
   1201743720.0
  ], 
  [
   299321, 
   null, 
   "Ghost Rider", 
   "Did Prohibition of alcohol do any good? Nope, just made the criminals all the more powerful. Did Prohibition of drugs do any good? Nope, just made the criminal all the more powerful. Will Prohibition of legal firearms do any good? Not a chance in hell.\n \n Banning legal ownership has never, ever, EVER done anything toward ending the illegal use of something. Never has, never will. It's absolutely impossible and just shows far for withdrawn people are from the real world in their thinking.", 
   {}, 
   299319, 
   null, 
   1201744200.0
  ], 
  [
   299463, 
   null, 
   "sinjin", 
   "Did Prohibition of alcohol do any good? Nope, just made the criminals all the more powerful. Did Prohibition of drugs do any good? Nope, just made the criminal all the more powerful. Will Prohibition of legal firearms do any good? Not a chance in hell. \n \n Banning legal ownership has never, ever, EVER done anything toward ending the illegal use of something. Never has, never will. It's absolutely impossible and just shows far for withdrawn people are from the real world in their thinking. \nI tend to agree with most of your logic here although I think you overstate a bit. Banning legal ownership of human beings seems to have been mildly effective in this country. Additionally, I think there's a considerable difference between drugs and alcohol, which are rather easy to produce, and the manufacture of a quality sidearm. Countries which have chosen to ban the production and sale of handguns to the public have been successful in reducing gun violence as a consequence. There's no denying it.\n \n Where I completely agree with you is that no amount of restriction on supply will of itself quelch demand. That would require a cultural shift in our country. We must choose not to embrace the traditon that teaches the virtues of being armed. Only then will the aberrations spawned by that tradition be diminished. Fat chance.", 
   {}, 
   299321, 
   null, 
   1201806060.0
  ], 
  [
   299465, 
   null, 
   "Ghost Rider", 
   "Countries which have chosen to ban the production and sale of handguns to the public have been successful in reducing gun violence as a consequence. There's no denying it.\n\n \n Well America isn't other countries. What worked for them won't work for us. Their background is one that places no value on rights, while we do; that's why so many people still come here. We're bordered by Canada and Mexico, we can't even stop illegal aliens from getting into this country, what's to stop illegal guns from crossing the border if demand gets high enough?\n \n Then there's the fact that guns are stolen from the police, both officers and evidence storage rooms.\n \n There's also the fact that even if only the police and military were allowed to have access to firearms, then there would still need to be manufacturing plants to crank out enough supply, and that supply would need to be stored somewhere. And any central storage location can become a target and broken into.\n \n \nWe must choose not to embrace the traditon that teaches the virtues of being armed.\n\n \n What in the hell does that mean? That would should no longer follow the concept that being armed allows us to better protect ourselves against violent attacks by the irrational percentage of the American population? Sounds an awful lot like a fancy \"be a victim\" speech to me.", 
   {}, 
   299463, 
   null, 
   1201806420.0
  ], 
  [
   299481, 
   null, 
   "sinjin", 
   "...being armed allows us to better protect ourselves against violent attacks by the irrational percentage of the American population?\nMy turn to ask what the hell?", 
   {}, 
   299465, 
   null, 
   1201809900.0
  ], 
  [
   299486, 
   null, 
   "Penfold", 
   "Well American isn't other countries. What worked for them won't work for us. Their background is one that places no value on rights, while we do; ... \n\n \n \n ALL of them?emoticon_rolleyes", 
   {}, 
   299465, 
   null, 
   1201810560.0
  ], 
  [
   299489, 
   null, 
   "Ghost Rider", 
   "My turn to ask what the hell?\n\n \n You explain the meaning of your statement, I'll explain the meaning of mine.", 
   {}, 
   299481, 
   null, 
   1201811280.0
  ], 
  [
   299497, 
   null, 
   "sinjin", 
   "You explain the meaning of your statement, I'll explain the meaning of mine.\nOur collective minds have to be disabused of the fantasy of the John Wayne/Clint Eastwood/Charles Bronson hero types. I don't see that happening anytime soon.", 
   {}, 
   299489, 
   null, 
   1201812180.0
  ], 
  [
   299499, 
   null, 
   "Ghost Rider", 
   "Our collective minds have to be disabused of the fantasy of the John Wayne/Clint Eastwood/Charles Bronson hero types. I don't see that happening anytime soon.\n\n \n You statement makes even less sense now than the previous one did.\n \n You think Americans want guns because we've got the mistaken belief that it's fun? You couldn't be further from the truth! For some people, being able to own a gun literally makes the difference between life and death! We don't carry a gun because it's a fun idea, we do it because the world is a dangerous and deadly place! The police aren't there to help you, it's not in their job description. You have to take care of yourself and look out for your own hyde, nobody else is going to be looking out for your own personal wellbeing.\n \n You wanna get rid of the notion that Americans need guns? Start by getting rid of all violent criminals; the primary reason why we carry guns. Eliminate them from the equation, make them something that used to exist but no longer does.", 
   {}, 
   299497, 
   null, 
   1201812600.0
  ], 
  [
   299500, 
   null, 
   "Penfold", 
   "It appears to me that the primary motivation of the pro-gun lobby is fear. From fearing their government, and their neighbours, to fear of criminals (who they presume are all armed}, to fearing other \"less normal\" gun owners. No amount of Lynx is going to cover that up!", 
   {}, 
   299499, 
   null, 
   1201813440.0
  ], 
  [
   299504, 
   null, 
   "Ghost Rider", 
   "It appears to me that the primary motivation of the pro-gun lobby is fear.\n\n \n And the anti-gun lobby saying \"this weapon (the .50 caliber) can be used to shoot a plane out of the sky and is being bought by terrorists\" isn't the use of fear as a form of motivation?\n \n \nFrom fearing their government, and their neighbours, to fear of criminals (who they presume are all armed}, to fearing other \"less normal\" gun owners. No amount of Lynx is going to cover that up!\n\n \n And no amount of statement is going to change the basic facts: the police aren\\'t there to protect you, the courts have ruled it\\'s not their job, they\\'re ruled you can\\'t sue them, so you\\'re responsible for protecting your own XXX! And if you choose to be defensless then it\\'s nobody\\'s fault except your own if you get killed as a result.", 
   {}, 
   299500, 
   null, 
   1201813740.0
  ], 
  [
   299507, 
   null, 
   "sinjin", 
   "You wanna get rid of the notion that Americans need guns? Start by getting rid of all violent criminals; the primary reason why we carry guns. Eliminate them from the equation, make them something that used to exist but no longer does.\nThe criminals love their guns for the same reason you do. They feel powerful with them. Countries with few guns still have criminals. What they don\\'t have is the numbers of people killed every year with guns.", 
   {}, 
   299499, 
   null, 
   1201814160.0
  ], 
  [
   299511, 
   null, 
   "Penfold", 
   "Not having a gun equating with being defenceless is a false dichotomy which only applies if you allow yourself to believe it to be so.", 
   {}, 
   299507, 
   null, 
   1201814700.0
  ], 
  [
   299515, 
   null, 
   "Ghost Rider", 
   "The criminals love their guns for the same reason you do.\n\n \n My reason is that I\\'m confident enough to not feel helpless. I highly doubt criminals suffer from feelings of helplessness and that\\'s why they choose to be armed. If anything it\\'s to discourage anyone from trying to be a hero.\n \n \nCountries with few guns still have criminals. What they don\\'t have is the numbers of people killed every year with guns.\n\n \n That doesn\\'t necessarily make it a good thing.", 
   {}, 
   299507, 
   null, 
   1201815540.0
  ], 
  [
   299516, 
   null, 
   "Ghost Rider", 
   "Not having a gun equating with being defenceless is a false dichotomy which only applies if you allow yourself to believe it to be so.\n\n \n Oh really? I\\'d like to test out that theory. You find me somebody who believes that they\\'re not defensless even when unarmed, and I\\'ll confront them with my chain and we\\'ll see who does better. If it\\'s all a matter of how you think on it then whoever you bring to the table should have no problem standing up to somebody armed with 25 feet of heavy flexing steel that knows how to use it.", 
   {}, 
   299511, 
   null, 
   1201815660.0
  ], 
  [
   299525, 
   null, 
   "Penfold", 
   "Oh really? I'd like to test out that theory. You find me somebody who believes that they're not defensless even when unarmed, and I'll confront them with my chain and we'll see who does better. If it's all a matter of how you think on it then whoever you bring to the table should have no problem standing up to somebody armed with 25 feet of heavy flexing steel that knows how to use it.\n\n \n You have a twenty-five foot flexing gun? ;) \n \n ..Or just trouble understanding plain english?", 
   {}, 
   299516, 
   null, 
   1201820340.0
  ], 
  [
   299527, 
   null, 
   "sinjin", 
   "My reason is that I'm confident enough to not feel helpless.\nThis makes no sense to me. Choosing not to carry a weapon is fulfilling a desire to feel helpless? That's just silly. I would submit you have issues of alienation and problems with a lack of empathy which manifest as a form of paranoia that is assuaged by fondling a device that can kill. Even you think you're psycho. \n \n \nThat doesn't necessarily make it a good thing. \nAre you saying that lots of shootings can be a good thing?", 
   {}, 
   299515, 
   null, 
   1201820580.0
  ], 
  [
   299532, 
   null, 
   "Ghost Rider", 
   "You have a twenty-five foot flexing gun? ;) \n \n ..Or just trouble understanding plain english?\n\n \n The way I understood it, you said that not being armed and equating it to being defenseless was a false statement that only applies if one chooses to do so. So I suggested we test that out. You find somebody thinks they're not helpless when unarmed, and I'll bring my chain to the fight and we'll see how that person fares against an armed assailant.", 
   {}, 
   299525, 
   null, 
   1201821420.0
  ], 
  [
   299537, 
   null, 
   "emclean", 
   "Not having a gun equating with being defenceless is a false dichotomy which only applies if you allow yourself to believe it to be so.\n\n not beign armed with a gun dose not mean that you are defenceless, but a gun is one of the best tools avalabul to defend yourself. \n \n think about it for a moment, \n with any other tool it matters the relitice strenth of the atacker and the victome.\n the enviroment you are attacked in matters more. \n safe and proper use, as well as retencion, can be tought in weeks, not in years (for martial arts).\n it can be used at a longer distance, to prevent voilance.\n and yes all of these strengths are also why the criminals want them. but that is not a good reason to throw the baby out with the bathwater. \n \n i wish i could find a transcript of the history channel's Tales of the Gun opening credits. it sights the gun as a tool used by hero, and vilen alike, and that it is used for both good and evil.", 
   {}, 
   299527, 
   null, 
   1201822080.0
  ], 
  [
   299538, 
   null, 
   "Ghost Rider", 
   "This makes no sense to me. Choosing not to carry a weapon is fulfilling a desire to feel helpless? That's just silly.\n \n \n Criminals carry a gun because they wish to control people and discourage heroic attempts against themselves. Citizens carry guns to protect themselves against criminals and for reassurance that they can take care of themselves, on their own.\n \n Don't paint us all with the same stroke of the brush. Criminals and the law-abiding have guns for entirely different reasons.\n \n \nI would submit you have issues of alienation and problems with a lack of empathy which manifest as a form of paranoia that is assuaged by fondling a device that can kill. Even you think you're psycho. \n\n \n I would submit that you can talk a big game, but know little of which you speak of.\n \n \nAre you saying that lots of shootings can be a good thing?\n\n \n Saying that there are less shooting deaths in areas with less guns is like saying there's less drunk driving in counties that observe Prohibition of alcohol; it's stating a simple fact, but taken completely out of context.\n \n Less shootings doesn't amount to less deaths and murder. In Kenya many people are currently being brutally butchered by men armed with nothing but machetes. Does the fact that there are less guns than machetes involved in this genocidal movement make it a good thing?", 
   {}, 
   299527, 
   null, 
   1201822260.0
  ], 
  [
   299567, 
   null, 
   "Penfold", 
   "The way I understood it, you said that not being armed and equating it to being defenseless was a false statement that only applies if one chooses to do so. So I suggested we test that out. You find somebody thinks they're not helpless when unarmed, and I'll bring my chain to the fight and we'll see how that person fares against an armed assailant.\n\n \n I said that not having a gun did not equate wih being defenceless. The misinterpretation that not having a gun is being helpless and unarmed happened in your head.", 
   {}, 
   299532, 
   null, 
   1201828980.0
  ], 
  [
   303836, 
   null, 
   "kesseltron", 
   "Samuri swords are cumbersome and inconvienient to carry day to day.", 
   {}, 
   299567, 
   null, 
   1204234560.0
  ], 
  [
   303846, 
   null, 
   "Ghost Rider", 
   "I said that not having a gun did not equate wih being defenceless. The misinterpretation that not having a gun is being helpless and unarmed happened in your head.\n\n \n Well regardless of what you meant, the facts are plain and simple: if you don't have a gun then you have no defense against armed predators and violent individuals.", 
   {}, 
   299567, 
   null, 
   1204237740.0
  ], 
  [
   303931, 
   null, 
   "buckeyeinok", 
   "I think many of you are missing the point.\n \n Sinjin, if you think that a total gun ban magically stops crime, read this.\n \n these are statistics from Australia after their oh so benevelent removal of all weapons.\n \n \"One year after gun-owners were forced to surrender 640,381 personal firearms to be destroyed, including semi-automatic .22 rifles and shotguns, a program costing the government over 500 million dollars, the results are in... \"\n \n OBSERVABLE FACT, AFTER 12 MONTHS OF DATA: \n \n Australia-wide, homicides are up 3.2% \n Australia-wide, assaults are up 8.6% \n Australia-wide, armed-robberies are up 44% (yes, FORTY-FOUR PERCENT) \n In the state of Victoria, homicides-with-firearms are up 300% \n Figures over the previous 25 years show a steady decrease in homicides-with-firearms (changed dramatically in the past 12 months) \n Figures over the previous 25 years show a steady decrease in armed-robbery-with-firearms (changed dramatically in the past 12 months) \n There has been a dramatic increase in breakins-and-assaults-of- the-elderly \n At the time of the ban, the Prime Minister said \"self-defense is not a reason for owning a firearm\" \n From 1910 to present, homicides in Australia had averaged about 1.8-per-100,000 or lower, a safe society by any standard. \n The ban has destroyed Australia's standings in some international sport shooting competitions \n The membership of the Australian Sports Shooting Association has risen to 112,000, a 200% increase, in response to the ban and as an attempt to organize against further controls, which are expected. \n Australian politicians are on the spot and at a loss to explain how no improvement in \"safety\" has been observed after such monumental effort and expense was successfully expended in \"ridding society of guns\". Their response has been to \"wait longer\". \n \n Also look at headlines from Britain.\n \n Contrary to popular belief, gun bans DO NOT deter crime at all.", 
   {}, 
   303846, 
   null, 
   1204271880.0
  ], 
  [
   303975, 
   null, 
   "Galileo", 
   "I think many of you are missing the point.\n \n Sinjin, if you think that a total gun ban magically stops crime, read this.\n \n these are statistics from Australia after their oh so benevelent removal of all weapons.\n \n \"One year after gun-owners were forced to surrender 640,381 personal firearms to be destroyed, including semi-automatic .22 rifles and shotguns, a program costing the government over 500 million dollars, the results are in... \"\n \n OBSERVABLE FACT, AFTER 12 MONTHS OF DATA: \n \n Australia-wide, homicides are up 3.2% \n Australia-wide, assaults are up 8.6% \n Australia-wide, armed-robberies are up 44% (yes, FORTY-FOUR PERCENT) \n In the state of Victoria, homicides-with-firearms are up 300% \n Figures over the previous 25 years show a steady decrease in homicides-with-firearms (changed dramatically in the past 12 months) \n Figures over the previous 25 years show a steady decrease in armed-robbery-with-firearms (changed dramatically in the past 12 months) \n There has been a dramatic increase in breakins-and-assaults-of- the-elderly \n At the time of the ban, the Prime Minister said \"self-defense is not a reason for owning a firearm\" \n From 1910 to present, homicides in Australia had averaged about 1.8-per-100,000 or lower, a safe society by any standard. \n The ban has destroyed Australia's standings in some international sport shooting competitions \n The membership of the Australian Sports Shooting Association has risen to 112,000, a 200% increase, in response to the ban and as an attempt to organize against further controls, which are expected. \n Australian politicians are on the spot and at a loss to explain how no improvement in \"safety\" has been observed after such monumental effort and expense was successfully expended in \"ridding society of guns\". Their response has been to \"wait longer\". \n \n Also look at headlines from Britain.\n \n Contrary to popular belief, gun bans DO NOT deter crime at all.\n\n I went to this link and it looks like for the most part homicide has been decreasing in Australia- \n http://www.aic.gov.au/stats/crime/homicide.html\n \n Firearms deaths have also decreased. \n \"In 1991, there were 629 firearm related deaths compared to 333 deaths in 2001. This represents a 47 per cent decrease in firearm related deaths over the period 1991 to 2001.\"\n http://www.aic.gov.au/publications/cfi/cfi066.html", 
   {}, 
   303931, 
   null, 
   1204313520.0
  ], 
  [
   303986, 
   null, 
   "Ghost Rider", 
   "I went to this link and it looks like for the most part homicide has been decreasing in Australia- \n http://www.aic.gov.au/stats/crime/homicide.html\n \n Firearms deaths have also decreased. \n \"In 1991, there were 629 firearm related deaths compared to 333 deaths in 2001. This represents a 47 per cent decrease in firearm related deaths over the period 1991 to 2001.\"\n http://www.aic.gov.au/publications/cfi/cfi066.html\n\n \n Do you have hard evidence that proves beyond reasonble or a shadow of a doubt, that gun control is the sole reason for this supposed drop in death rates, or that Australia isn't massaging its statistics to make themselves look safer than they really are?\n \n I want links to every last single bill ever passed by Australia between now and 1996. Supply every last bill, especially the ones related to crime. I want proof that simply banning guns made all the difference in the nation of Australia, and that no other laws played any difference whatsoever. If you don't have that then you have nothing.", 
   {}, 
   303975, 
   null, 
   1204315620.0
  ], 
  [
   304986, 
   null, 
   "Seekerrr", 
   "I stumbled upon this site by following a link posted on a gun forum that I frequent, which should give a hint as to which side of this debate I'll be speaking up for.\n \n First, since this is my first post here and I've only been perusing this site for an hour or so, I need to know if the \"anti-gunners\" that are posting in this thread are Americans or not. It seems to me that the site is frequented by a rather diverse, international group of people, and if I'm right about that, then I think I know the problem with convincing them of the incorrect way they are evaluating private gun ownership in America. \n \n Even if every single one of the antis posting here is American, the problem is the same; it's an abject lack of understanding of what our Constitution does and from whom our rights derive. Our government was not put together with the notion that those who hold powerful positions are the givers or guarantors of our rights, they are the protectors of them, nothing more, nothing less. God is who, according to our Founding Fathers, our rights derive from, and those of us who agree with that premise get a little testy when mere mortals try to use the protectors of our rights (our government) to contravene the authority of the giver and guarantor of them (God). \n \n Now, I'm not trying to take this discussion in an off-topic direction and make it about religion. The premise that I describe above is not dependent upon anyone evaluating the existence, or lack thereof, of God in order to accept it as fact. It simply is a hard, cold, wholly provable fact that our Founders believed deeply in the accuracy of that premise, and that they wrote The Constitution with the conviction that they were writing what they perceived God wanted them to write as the cornerstone of its foundation. So if one asks what Madison or Jefferson had in their minds as it relates to the 2nd Amendment, if you take some of their more salient quotes on the subject and combine that with the knowledge that everything they put to writing in our founding documents were directives from God, then there can be no more valid debate about gun control in America without first talking about repealing The Constitution, thus rejecting the permanently-held view of historians and legal scholars since our country's inception that God controls our destiny, not man and/or man's laws. Like it or not, accept the premise or not, believe in God or not, that is precisely what anti-gunners are up against if they want to effectively repeal the 2nd Amendment's original meaning and intent through legislative fiat. And I can back that up.....\n \n \n\"Whereas civil-rulers, not having their duty to the people duly before them, may attempt to tyrannize, and as military forces, which must be occasionally raised to defend our country, might pervert their power to the injury of their fellow citizens, the people are confirmed by the article in their right to keep and bear their private arms.\"\n -- Tench Coxe, in Remarks on the First Part of the Amendments to the Federal Constitution \n\n \n \n\"The best we can hope for concerning the people at large is that they be properly armed.\" \n -- Alexander Hamilton, The Federalist Papers at 184-188 \n\n \n \n\"If the representatives of the people betray their constituents, there is then no recourse left but in the exertion of that *original right of self-defense which is paramount to all positive forms of government, and which against the usurpations of the national rulers may be exerted with infinitely better prospect of success than against those of the rulers of an individual State. In a single State, if the persons entrusted with supreme power become usurpers, the different parcels, subdivisions, or districts of which it consists, having no distinct government in each, can take no regular measures for defense. The citizens must rush tumultuously to arms, without concert, without system, without resource; except in their courage and despair.\"\n -- Alexander Hamilton, Federalist No. 29\n\n *My note: All \"original rights\" come from God, and that is the perspective from which Hamilton uttered these words.\n \n \n\"That the said Constitution *shall never be construed to authorize Congress to infringe the just liberty of the press or the rights of conscience; or to prevent the people of the United States who are peaceable citizens from keeping their own arms ... \" \n -- Samuel Adams, Debates and Proceedings in the Convention of the Commonwealth of Massachusetts, at 86-87 (Pierce & Hale, eds., Boston, 1850) \n*My note: \"Shall never be construed\" means exactly that; the right was granted to man by God and cannot be overridden by man or man's laws for perpetuity. That's a long time! No matter how you slice it, 230 years doesn't even scratch the surface of how long this right was supposed to be protected by our government!\n \n \n\"Before a standing army can rule, the people must be disarmed; as they are in almost every kingdom in Europe. The supreme power in America cannot enforce unjust laws by the sword; because the whole body of the people are armed, and constitute a force superior to any band of regular troops that can be, on any pretense, raised in the United States. A military force, at the command of Congress, can execute no laws, but such as the people perceive to be just and constitutional; for they will possess the power, and jealousy will instantly inspire the inclination, to resist the execution of a law which appears to them unjust and oppressive.\"\n --Noah Webster, An Examination of the Leading Principles of the Federal Constitution (Philadelphia 1787). \n\n \n Maybe it is the case that both Americans and non-Americans alike have never been made aware of just how conclusive the righteousness of the 2nd Amendment, as well as all the others, was thought to be by our Founding Fathers. Maybe they don't realize that, to a man, every single one of them can be quoted describing the 2A as protecting an individual right, no different in its' importance to the governance of the citizenry, in a well-ordered society, than the 1st through 10th Amendments were/are. If present-day government is allowed to damage the strength and unalienable nature of the 2nd Amendment through tyrannical legislation which subverts the supreme authority of the document that grants them their power in the first place, what's to stop them from doing the same to any of the other amendments or precepts of the greatest document ever devised by man? \n \n You anti-gunners are perfectly within your rights to be anti-gunners. You are not, however, within your rights to demand of your government, or *our* government as the case may be, that they treat one amendment to The Constitution as less important, less fundamental, less unalienable than any other. If you want to be treated with respect for expressing views which our form of government guarantees is your God-given, fundamental, unalienable right to do, no matter who or how strongly someone may disagree with you, then you have to extend to us the same respect for exercising those rights which are guaranteed to us as gun owners with equal power and force of law. Instead of saying, \"There should be gun bans in America,\" say, \"I have banned guns in my home and have decided not to expose my children to them because I feel they cause more trouble than they're worth.\" The former says you want our government to break the very set of laws that grants its' power, and the latter says that you have chosen to accept the law for what it is and made a personal decision, that steps on no gun-owner's or The Constitution's toes in any way, to take action that is within your legal power to effectuate in your own life and home. Make sense?\n \n Seekerrr", 
   {}, 
   303986, 
   null, 
   1205116920.0
  ], 
  [
   304989, 
   null, 
   "bhbcu64", 
   "seekerrr,\n \n Having read through your interminable rant, I would like to pose just one question to you.\n \n If you argue the dubious point that rights come from somewhere outside men's rational mind, do you believe that God gave people the right to view kiddie porn?\n \n After all, the Framers began 1A with the stirring words, \"Congress shall make NOLAW...\"\n \n Some of the gun nuts on this forum have been saying that I have trouble reading, but do you think the words NO LAW can be construed in any other way than to say NONE WHATSOEVER or NOT A SINGLE ONE?emoticon_smile", 
   {}, 
   304986, 
   null, 
   1205119140.0
  ], 
  [
   304990, 
   null, 
   "Ghost Rider", 
   "Having read through your interminable rant, I would like to pose just one question to you.\n\n \n Interminable? That's a big word for you isn't it? Do you know what it means or are you just using it to look smarter than you really are?\n \n \nIf you argue the dubious point that rights come from somewhere outside men's rational mind, do you believe that God gave people the right to view kiddie porn?\n\n \n Why, are you friends with that Brady guy that believes it's a violation of a sex offenders to make them register and forbid them to live within a 1,000 feet of a school or park or anywhere kids might gather to play? Are you friends with that sick freak? Are you!? What exactly are you two doing over there anyway, what do you look at together?!\n \n \nAfter all, the Framers began 1A with the stirring words, \"Congress shall make NOLAW...\"\n\n \n Yeah that's been an awful big success now hasn't it.\n \n \nSome of the gun nuts on this forum have been saying that I have trouble reading,\n\n \n Reading involves more than being able to tell what a word says. To truly read you have to tell what the words actually mean.\n \n \nbut do you think the words NO LAW can be construed in any other way than to say NONE WHATSOEVER or NOT A SINGLE ONE?emoticon_smile\n\n \n Of course they can.\n \n The First Amendment says a lot more than simply \"Congress shall make no law\", so you can't go just by that alone. If you could then I could freely argue that the Second Amendment really means what the second half says and nothing else at all, being \"the right of the people to keep and bear arms shall not be infringed\". But neither of these amendment say this exclusively, so they obviously mean much more than what can be taken at face value.", 
   {}, 
   304989, 
   null, 
   1205120280.0
  ], 
  [
   304992, 
   null, 
   "bhbcu64", 
   "grideer,\n \n The First Amendment says a lot more than simply \"Congress shall make no law\", so you can't go just by that alone. \n \n OK. It says \"Congress shall make NO LAW respecting an establishment of religion or prohibiting the free exercise thereof of abridging freedom of speech or of the press, or of the right of the people peaceably to assemble and to petition the government for a redress of grievances.\"\n \n Now, what part of NO LAW can be interpreted in a manner other than NONE without destroying the original intent of the framers?:xbanghead", 
   {}, 
   304990, 
   null, 
   1205122080.0
  ], 
  [
   304993, 
   null, 
   "Ghost Rider", 
   "Now, what part of NO LAW can be interpreted in a manner other than NONE without destroying the original intent of the framers?:xbanghead\n\n \n I'm curios as to just what part of the First Amendment has to do with your precious kiddie porn that you so desperately want.", 
   {}, 
   304992, 
   null, 
   1205123220.0
  ], 
  [
   305018, 
   null, 
   "Seekerrr", 
   "seekerrr,\n \n Having read through your interminable rant, I would like to pose just one question to you.\n \n If you argue the dubious point that rights come from somewhere outside men's rational mind, do you believe that God gave people the right to view kiddie porn?\n \n After all, the Framers began 1A with the stirring words, \"Congress shall make NOLAW...\"\n \n Some of the gun nuts on this forum have been saying that I have trouble reading, but do you think the words NO LAW can be construed in any other way than to say NONE WHATSOEVER or NOT A SINGLE ONE?emoticon_smile\n\n \n I honestly can't imagine what part of my post came across as a rant, interminable or otherwise. \n \n Upon my first look at this site it struck me that there were many good debaters here, and that people were generally reasonable and knowledgeable about the things they were discussing. It's a shame that the first response to my first well thought-out, politely-worded, completely and provably accurate post was anything but reasonable or knowledgeable. I'll wait for one that is before being diverted by blithering idiocy.\n \n Seekerrr", 
   {}, 
   304989, 
   null, 
   1205151840.0
  ], 
  [
   305019, 
   null, 
   "bhbcu64", 
   "grider,\n \n I'm curios as to just what part of the First Amendment has to do with your precious kiddie porn that you so desperately want.\n \n Trust me, Jack, I don't want it at all. I find even thinking about its being disseminated vile and disgusting.\n \n BTW, don't project your desires on me.\n \n All I want to know is how in the name of the First Amendment it can be banned.\n \n Care to enlighten us? After all, you're the one who kept harping on the literal meaning of the second clause of 2A.\n \n Pray tell us how you can be in favor of a literal reading of one Amendment and then decline to take the same approach to another Amendment.", 
   {}, 
   305018, 
   null, 
   1205157180.0
  ], 
  [
   305030, 
   null, 
   "Ghost Rider", 
   "Trust me, Jack, I don't want it at all. I find even thinking about its being disseminated vile and disgusting.\n\n \n Then why in the hell did you even bring up the subject for discussion if it disgusts you so greatly?", 
   {}, 
   305019, 
   null, 
   1205165040.0
  ], 
  [
   305032, 
   null, 
   "bhbcu64", 
   "grider,\n \n Then why in the hell did you even bring up the subject for discussion if it disgusts you so greatly?\n \n \n Because you and the other gun nuts bleat constantly about the individual right to bear arms as stated, you constantly proclaimed, in the plain meaning of the words of 2A.\n \n We just want to see what limits you are willing to put on the plain meaning of the words of 1A when you are so adamant that 2A be given its literal meaning.\n \n It seems to us that you and your ilk want the Consitution's words to be given their plain meaning when it suits your interests, but you want to twist them out of all their literal meaning when they don't.\n \n You are all victims of the dread disease known as Doublestandarditis.", 
   {}, 
   305030, 
   null, 
   1205165460.0
  ], 
  [
   305042, 
   null, 
   "kesseltron", 
   "The problem with kiddie porn is it's creation, not it's broadcast. Bottom line, kiddie porn is rape, and will not be tolerated. Broadcasting it is shameful, but not by it's self a sin.\n \n There are laws against it's broadcast, just the same as there are laws against owning weapons. Neither are correct by the constitutional standard.", 
   {}, 
   305032, 
   null, 
   1205172480.0
  ], 
  [
   305043, 
   null, 
   "Bryan", 
   "bhbcu64, I think you argument is confusing the issue by blending together two separate issues regarding the RKBA-the nature of the right (individual/collective) and the scope of the right (absolute/limited). They are independent and must be dealt with in turn.\n \n Let me first address the nature of the right. I agree with your assertion that the founders were \"wordsmiths.\" The nature of the right could not be more plainly stated by them: \"the right of the people.\" This is clearly an expression of an individual right. When these men drafted constitutions, they did not write that states have \"rights.\" They always couched these abilities in terms of \"power\" and \"authority.\" Only individual citizens have rights. \n \n Look also at the 10th. A. These wordsmiths knew how to write out a reservation of power to the states when they wanted to confer power or authority to them. They didn't do so in the 2nd. A. \n \n The phrase \"the right of the people\" was used in the 1st., 2nd., and 4th. Amendments. Your collective right argument takes this tack:\n \n The phrase recognizes an individual right in the 1st. A, is mutated into a collective state's \"right\" in the 2nd. A, only to mutate back into an individual right in the 4th. A. \n \n This argument is incompatible with the assertion our founders were 'wordsmiths.\" You cannot argue-when confronted with the same phrase being used each time-that the nature of the rights is anything but individual in all three Amendments absent the judicious use of some form of Orwellian \"doublespeak.\" \n \n Now let's talk about the scope of the right. When you speak of \"Congress shall make no law\" you turn away from the individual nature of the right and begin to take on the second issue: what is the scope of the protected right.\n \n I have never argued that any of our rights is absolute in scope. The absolute literal interpretation of the scope of the RKBA has been a favorite sham argument of gun control advocates for years. See:\n \n http://www.4forums.com/political/showthread.php?p=155170#post155170 \n \n Oh, and I went back and re-addressed your question of the \"well regulated\" militia: \n \n http://www.4forums.com/political/showthread.php?p=304997#post304997 \n \n I welcome you to read it as well and give me your thoughts.\n \n ---\n \n The issue, however, is not whether court rules are \"mutable\"; they assuredly are. It is not whether, in the light of \"various circumstances,\" they can be \"modifi[ed]\"; they assuredly can. The issue is whether, as mutated and modified, they must make sense. The requirement that they do so is the only thing that prevents this Court from being some sort of nine-headed Caesar, giving thumbs-up or thumbs-down to whatever outcome, case by case, suits or offends its collective fancy. Dickerson v. United States, 530 U.S. 428, 455 (2000) (Scalia, dissenting).", 
   {
    "post_info": {
     "post_title": "Confusing the nature of our rights with their scope"
    }, 
    "unicode_changes_made": true
   }, 
   305042, 
   null, 
   1205172900.0
  ], 
  [
   305050, 
   null, 
   "bhbcu64", 
   "keseltron,\n \n [B]The problem with kiddie porn is it's creation, not it's broadcast. Bottom line, kiddie porn is rape, and will not be tolerated.[B]\n \n Agreed absolutely, which is why I want those who produce the stuff prosecuted, and, if convicted in a fair trial, punished as severely as the law allows, but that's not the issue. \n \n Broadcasting it is shameful, but not by it's self a sin.\n \n Which I why I limited my hypothetical to private ownership.\n \n There are laws against it's broadcast, just the same as there are laws against owning weapons. Neither are correct by the constitutional standard.\n \n \n True, but again not the issue. The issue is more aabout the stream of commerce. As this related to 2A, the lesson of Miller is that firearms having no military use cannot be placed in the stream of commerce.\n \n The plain language of 1A makes the reverse appear to be true. \"Press\" requires distribution to be press, with, of course, the concomitant right of people to not read it.", 
   {}, 
   305043, 
   null, 
   1205175900.0
  ], 
  [
   305051, 
   null, 
   "bhbcu64", 
   "Bryan,\n \n I have never argued that any of our rights is absolute in scope. \n \n That may well be your particular belief.\n \n However, the wordsmiths clearly did intend, by their inclusion of the words NO LAW in 1A for the right to be absolute.\n \n What other meaning can these 2 little words be given that are true to their original intent?", 
   {}, 
   305050, 
   null, 
   1205176140.0
  ], 
  [
   305056, 
   null, 
   "Ghost Rider", 
   "That may well be your particular belief.\n \n However, the wordsmiths clearly did intend, by their inclusion of the words NO LAW in 1A for the right to be absolute.\n \n What other meaning can these 2 little words be given that are true to their original intent?\n\n \n That's bulls**t and you know it! \n \n If the First Amendment was meant to be absolute then the Supreme Court would've never said that \"fighting words\" weren't protected.\n \n No right is ever absolute in its scope or design, everything has limitations on it. If there were no limitations it would be total anarchy.", 
   {}, 
   305051, 
   null, 
   1205178180.0
  ], 
  [
   305060, 
   null, 
   "E Mutz", 
   "No right is ever absolute in its scope or design, everything has limitations on it. If there were no limitations it would be total anarchy.\n\n \n Now if I were bhbcu64, I would naturally ask at this point; \n \n \"If no right is absolute and everything has limitations, how can you argue against limitations imposed on 2a rights?\"\n \n A troubling concession. Well played BHB.", 
   {}, 
   305056, 
   null, 
   1205180760.0
  ], 
  [
   305063, 
   null, 
   "Ghost Rider", 
   "Now if I were bhbcu64, I would naturally ask at this point; \n \n \"If no right is absolute and everything has limitations, how can you argue against limitations imposed on 2a rights?\"\n \n A troubling concession. Well played BHB.\n\n \n Because some limitations, such as preventing someone from yelling fire in a crowded theater when there is no fire, or owning a fully armed nuclear warhead aimed right at the government, are within reason and sensible. But declaring that people have to keep all of their firearms locked up and stored away so children can't find them ot use them, that's unacceptable and unreasonable.\n \n Is it reasonable to expect the First Amendment to protect a non-permitted gathering of people to call for the execution of all blacks and mexicans in this country? No. Is it unreasonable to ban political ads within so many days of an election? Yes.\n \n There's a large difference between meaningful limitations for the protection and continued existance and safety of the people, and limitations that exist simply for the sake of existance and have been proven useless.\n \n Get the picture?", 
   {}, 
   305060, 
   null, 
   1205181480.0
  ], 
  [
   305082, 
   null, 
   "bhbcu64", 
   "mutz,\n \n \"If no right is absolute and everything has limitations, how can you argue against limitations imposed on 2a rights?\"\n \n A troubling concession. Well played BHB.\n \n \n Exactly. Go to the head of the class.", 
   {}, 
   305063, 
   null, 
   1205186280.0
  ], 
  [
   305083, 
   null, 
   "bhbcu64", 
   "grider,\n \n There's a large difference between meaningful limitations for the protection and continued existance and safety of the people, and limitations that exist simply for the sake of existance and have been proven useless.\n \n \n Please tell us just exactly what the difference is, especially in light of those who think the limitations on 1A are as \"useless\" as you think the ones on 2A are.", 
   {}, 
   305082, 
   null, 
   1205186400.0
  ], 
  [
   305087, 
   null, 
   "Ghost Rider", 
   "Please tell us just exactly what the difference is, especially in light of those who think the limitations on 1A are as \"useless\" as you think the ones on 2A are.\n\n \n You wanna know the difference involved? Fine.\n \n Meaningful restrictions would include the prohibition of allowing for someone to publicly call for the murder of a group of individuals in an attempt to incite a riot and anger the people listening, which could lead to people getting hurt or killed. Meaningful restrictions are about prohibiting stupid extremists behavior and acts. \n \n Stupid restrictions seek to address problems that don't exist and often times hurt people rather than helping anyone, such as requiring gun owners to report the loss or theft of their firearm 72 hours after they knew or \"should have known\" of the disappearance.\n \n Meaningful restrictions exist because of genuine problems that demanded their creation.\n \n Stupid restrictions exist because some damn politician didn't like how things were normally run and thought there was room for improvement with more red tape.", 
   {}, 
   305083, 
   null, 
   1205187540.0
  ], 
  [
   305089, 
   null, 
   "thelmoose", 
   "You wanna know the difference involved? Fine.\n \n Meaningful restrictions would include the prohibition of allowing for someone to publicly call for the murder of a group of individuals in an attempt to incite a riot and anger the people listening, which could lead to people getting hurt or killed. Meaningful restrictions are about prohibiting stupid extremists behavior and acts. \n \n Stupid restrictions seek to address problems that don't exist and often times hurt people rather than helping anyone, such as requiring gun owners to report the loss or theft of their firearm 72 hours after they knew or \"should have known\" of the disappearance.\n \n Meaningful restrictions exist because of genuine problems that demanded their creation.\n \n Stupid restrictions exist because some damn politician didn't like how things were normally run and thought there was room for improvement with more red tape.\n\n \n I hear you saying that we should draw the line somewhere between \"meaningful\" and \"stupid\" restrictions.", 
   {}, 
   305087, 
   null, 
   1205187960.0
  ], 
  [
   305092, 
   null, 
   "bhbcu64", 
   "grider,\n \n Meaningful restrictions are about prohibiting stupid extremists behavior and acts. \n \n \n And your definition of \"stupid extremists\" is...?\n \n Please word your definition in such a way that ALL Americans, not simply those who support your POV, agree.", 
   {}, 
   305087, 
   null, 
   1205189040.0
  ], 
  [
   305097, 
   null, 
   "Ghost Rider", 
   "And your definition of \"stupid extremists\" is...?\n\n \n One good example of extremists behavior that should be limited would be the forming of a lynch mob with the intent of going into a jail, grabbing a suspect in a heinous crime, dragging them outside and hanging them from a tree, before a trial ever came about. You could say that this is protected by the First Amendment, but it sure as hell isn't something that would qualify for constitutional protection.\n \n \nPlease word your definition in such a way that ALL Americans, not simply those who support your POV, agree.\n\n \n I'm not gonna dumb down my statements so people with the lowest common intelligence level can understand what I'm saying. Catering to stupid people is one reason why we've got so many educational problems. Stupid people used to be left behind, now they're leading the pack and screwing everything up.\n \n If you're stupid and can't keep up then you should be left behind on the side of the road so the smart people can advance, and you get to repeat the course and hopefully pass that time. Maybe the same of being older and in a younger course will convince you to work harder and stop being a dumbass.", 
   {}, 
   305092, 
   null, 
   1205189460.0
  ], 
  [
   305098, 
   null, 
   "sinjin", 
   "Stupid restrictions seek to address problems that don't exist and often times hurt people rather than helping anyone, such as requiring gun owners to report the loss or theft of their firearm 72 hours after they knew or \"should have known\" of the disappearance.\nYou don't see a problem with some 200,000 guns being stolen annually? IIRC the second largest source of weapons falling into the hands of criminals.", 
   {}, 
   305087, 
   null, 
   1205189460.0
  ], 
  [
   305112, 
   null, 
   "Ghost Rider", 
   "You don't see a problem with some 200,000 guns being stolen annually? IIRC the second largest source of weapons falling into the hands of criminals.\n\n \n 200,000 stolen annually. That means that annually 200,000 concerned people are reporting them being stolen when it occurs. So where's the justification for a law that mandates they do this? They're already doing the responsible thing of their own free will, why should they be required to by law? Where's the sensibility in it all?\n \n I've got $7,000 invested in guns and ammo, do you think that for even one minute I'm gonna hesitate to report the theft once I discover it happening? That's my stuff and I want it back!\n \n And what the hell does \"know or should have known\" mean anyway? How do you come to the determination of \"should have known\"?", 
   {}, 
   305098, 
   null, 
   1205197800.0
  ], 
  [
   305115, 
   null, 
   "Seekerrr", 
   "You don't see a problem with some 200,000 guns being stolen annually? IIRC the second largest source of weapons falling into the hands of criminals.\n\n \n Whether or not us 2nd Amendment advocates see a problem with thievery (which seems as though the answer should be obvious), the fact remains that we're talking about law, not individual preferences or sense of the rightness or wrongness of the law. The Framers gave us a way to change The Constitution. If that process is not followed, but changes are made through activist courts or by legislation which glaringly disregards the laws that give them their powers, that is breaking the law. The fact that those of us who understand this distinction don't have the power necessary to enforce the law as it stands in no way mitigates the reality or accuracy of the assertion. You are asking of our government the abdication of their solemn oaths to uphold and protect The Constitution. You're asking them to break the law and their word as honorable men and women. Well....some of them anyway, but that's what you're asking of them whether they can legitimately be described as honorable or not.\n \n Now, if we could agree on that basic premise, then the prudence of the law in question could be discussed from the perspective of whether or not its shortcomings justify the intentionally long and arduous process of changing The Constitution. But if the gun-grabbers want to argue the intent of the law as being something other than what literally thousands of available quotes from the authors of it say it was intended to be, and argue that it should be effectively deemed repealed by 9 unelected men and women in black robes who would be violating their constitutional powers in so doing, you'll get nowhere with us. You're arguing in favor of anarchy in that case. We're arguing in favor of the rule of law. It really boils down to just that.\n \n Seekerrr", 
   {}, 
   305098, 
   null, 
   1205198340.0
  ], 
  [
   305123, 
   null, 
   "bhbcu64", 
   "seeker,\n \n If that process is not followed, but changes are made through activist courts or by legislation which glaringly disregards the laws that give them their powers, that is breaking the law.\n \n You mean like the activist court which, while looking at a magazine, decided that it was not speech or press simply because it contained \"obscenity\" and therefore not covered by 1A?\n \n Now that's activism; that is breaking the law.\n \n Why am I certain that's not what you were posting about?;)", 
   {}, 
   305115, 
   null, 
   1205201880.0
  ], 
  [
   305128, 
   null, 
   "Ghost Rider", 
   "Why am I certain that's not what you were posting about?;)\n\n \n Why am I certain that you're just looking for a fight and don't care about how you go about getting it?", 
   {}, 
   305123, 
   null, 
   1205204700.0
  ], 
  [
   305132, 
   null, 
   "bhbcu64", 
   "grider,\n \n If it WAS what you were talking about, welcome to the group of us who believe that 1A means exactly what it says.", 
   {}, 
   305128, 
   null, 
   1205205480.0
  ], 
  [
   305134, 
   null, 
   "kesseltron", 
   "keseltron,\n \n [B]The problem with kiddie porn is it's creation, not it's broadcast. Bottom line, kiddie porn is rape, and will not be tolerated.[B]\n \n Agreed absolutely, which is why I want those who produce the stuff prosecuted, and, if convicted in a fair trial, punished as severely as the law allows, but that's not the issue. \n \n Broadcasting it is shameful, but not by it's self a sin.\n \n Which I why I limited my hypothetical to private ownership.\n \n There are laws against it's broadcast, just the same as there are laws against owning weapons. Neither are correct by the constitutional standard.\n \n \n True, but again not the issue. The issue is more aabout the stream of commerce. As this related to 2A, the lesson of Miller is that firearms having no military use cannot be placed in the stream of commerce.\n \n The plain language of 1A makes the reverse appear to be true. \"Press\" requires distribution to be press, with, of course, the concomitant right of people to not read it.\n\n \n The Miller decision declared that \"Certainly it is not within judicial notice that this weapon is any part of the ordinary military equipment, or that its use could contribute to the common defense.\" Meaning that because it was not a weapon that would have any useful purpose in a militia, it is not protected by the second ammendment. It does not mean that because it is not currently being used in military it is not protected. The reason that it is useless and, say, handguns are is because a sawed off double barrel shotgun is too cumbersome to be carried as a sidearm, yet not effective enough to be used as a main weapon. Also, the defendant skipped town before the trial. \n \n Miller is an interesting decision. You should give it a gander some time.", 
   {}, 
   305050, 
   null, 
   1205205600.0
  ], 
  [
   305163, 
   null, 
   "Bryan", 
   "Bryan,\n \n I have never argued that any of our rights is absolute in scope. \n \n That may well be your particular belief.\n \n However, the wordsmiths clearly did intend, by their inclusion of the words NO LAW in 1A for the right to be absolute.\n \n What other meaning can these 2 little words be given that are true to their original intent?\n\n \n \n Bhbcu64, I only ask that you do not confuse the nature of our rights with the scope of their protection. It is, as you concede, my opinion that none of our rights are absolute-and here again we find ourselves in disagreement.\n \n Here are some questions for your absolutist completely-unlimited-in-any-way-interpretation to ponder: \n \n Do you suggest that our founders intended to abolish the laws prohibiting libel, slander, and conspiracy to commit a crime when they wrote \"Congress shall make no law\"? \n \n If we accept your absolute unlimited scope argument, then could I not sacrifice an innocent virgin child at sunrise on the winter solstice to appease the sun god to ensure the return of spring? \n \n Could I avoid a charge of murder, or is your argument over the absolute interpretation different when the language is \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof\"? \n \n Have we found a ceiling for your interpretation yet, or does your NO LAW = NO POSSIBLE RESTRICTIONS argument become the truth that sets me free?\n \n Can you find a single SCOTUS case (or one from any of the circuit courts of appeals for that matter) which deals with your logic?\n \n I have. It is the 1st. Amendment case of Konigsberg v. States Bar, 366 U.S. 36, 56 (1961). I cited you to this earlier because I thought it would enlighten you to see how SCOTUS dealt with the argument you are making now, and I thought it relevant to this blog site because it mentions the 2nd. Amendment and Miller [In particular, look at footnote 10]:\n \n \"At the outset we reject the view that freedom of speech and association ( N. A. A. C. P. v. Alabama, 357 U.S. 449, 460 ), as protected by the First and Fourteenth Amendments, are \"absolutes,\" not only in the undoubted sense that where the constitutional protection exists it must prevail, but also in the sense that the scope of that protection must be gathered solely from a literal reading of the First Amendment. [FOOTNOTE 10] Throughout its history this Court has consistently recognized at least two ways in which constitutionally protected freedom of speech is narrower than an unlimited license to talk. On the one hand, certain forms of speech, or speech in certain contexts, has been considered outside the scope of constitutional protection. [FOOTNOTE 11] See, e. g., Schenck v. United States, 249 U.S. 47; Chaplinsky v. New Hampshire, 315 U.S. 568; Dennis v. United States, 341 U.S. 494; Beauharnais v. Illinois, 343 U.S. 250; Yates v. United States, 354 U.S. 298; Roth v. United States, 354 U.S. 476.\"\n \n Here are the footnotes:\n \n [FOOTNOTE 10] \"That view, which of course cannot be reconciled with the law relating to libel, slander, misrepresentation, obscenity, perjury, false advertising, solicitation of crime, complicity by encouragement, conspiracy, and the like, is said to be compelled by the fact that the commands of the First Amendment are stated in unqualified terms: \"Congress shall make no law . . . abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble . . . .\" But as Mr. Justice Holmes once said: \"[T]he provisions of the Constitution are not mathematical formulas having their essence in their form; they are organic living institutions transplanted from English soil. Their significance is vital not formal; it is to be gathered not simply by taking the words and a dictionary, but by considering their origin and the line of their growth.\" Gompers v. United States, 233 U.S. 604, 610. In this connection also compare the equally unqualified command of the Second Amendment: \"the right of the people to keep and bear arms shall not be infringed.\" And see United States v. Miller, 307 U.S. 174.\n \n [FOOTNOTE 11] \"That the First Amendment immunity for speech, press and assembly has to be reconciled with valid but conflicting governmental interests was clear to Holmes, J. (\"I do not doubt for a moment that by the same reasoning that would justify punishing persuasion to murder, the United States constitutionally may punish speech that produces or is intended to produce a clear and imminent danger that it will bring about forthwith certain substantive evils that the United States constitutionally may seek to prevent.\" Abrams v. United States, 250 U.S. 616, 627); to Brandeis, J. (\"But, although the rights of free speech and assembly are fundamental, they are not in their nature absolute.\" Whitney v. California, 274 U.S. 357, 373); and to Hughes, C. J. (\"[T]he protection [of free speech] even as to previous restraint is not absolutely unlimited.\" Near v. Minnesota, 283 U.S. 697, 716.)\"\n \n You may disagree, but SCOTUS has always ruled against you on this issue. If you ever want to change either mine or the Court's mind on this point, then you must come up with an argument that goes beyond \"because that's what I think.\" Is there anything, anywhere, from any time in our nation's history which supports your absolute unlimited scope interpretation argument? I am genuinely curious to know if you have something which has yet to be revealed.\n \n ---\n \n \"The issue, however, is not whether court rules are \"mutable\"; they assuredly are. It is not whether, in the light of \"various circumstances,\" they can be \"modifi[ed]\"; they assuredly can. The issue is whether, as mutated and modified, they must make sense. The requirement that they do so is the only thing that prevents this Court from being some sort of nine-headed Caesar, giving thumbs-up or thumbs-down to whatever outcome, case by case, suits or offends its collective fancy.\" Dickerson v. United States, 530 U.S. 428, 455 (2000) (Scalia, dissenting).", 
   {
    "post_info": {
     "post_title": "None of our rights are absolute, bhbcu64"
    }, 
    "unicode_changes_made": true
   }, 
   305051, 
   null, 
   1205215440.0
  ], 
  [
   305179, 
   null, 
   "bhbcu64", 
   "Bryan,\n \n Do you suggest that our founders intended to abolish the laws prohibiting libel, slander, and conspiracy to commit a crime when they wrote \"Congress shall make no law\"? \n \n I don't know, and I'm sure that YOU don't, either, although the SCOTUS nearly abolished the law of libel as it applies to people in the public eye in NY Times v. Sullivan.\n \n That's exactly my point.\n \n It seems hypocritical at best for the gun nuts to insist that the words \"NO LAW\" in 1A must be interpreted until all the meaning of those two little words is stripped bare and yet insist that the words of 2A must be given their literal meaning.", 
   {
    "unicode_changes_made": true
   }, 
   305163, 
   null, 
   1205240280.0
  ], 
  [
   305214, 
   null, 
   "Bryan", 
   "I'm going to offer you some advice, bhbcu64: You should really read cases before you argue they support your position. And when you get the holding wrong because you don't bother to read them, you should at least get them wrong enough to help your position. \n \n Do you realize that your own interpretation of this case cuts against your absolutist argument? \n \n When you incorrectly say that SCOTUS \"nearly abolished,\" aren't you agreeing the interpretation should be \"Congress shall make nearly no law\"? Is this what you mean by \"[t]hat's exactly my point\"? \n \n I have read Sullivan before. It does not say what you want it to say. It was a libel suit brought by a public official in Alabama who became upset over a paid political advertisement that was run in the Times:\n \n \"The advertisement included statements, some of which were false, about police action allegedly directed against students who participated in a civil rights demonstration and against a leader of the civil rights movement; respondent claimed the statements referred to him because his duties included supervision of the police department.\" New York Times Co. v. Sullivan, 376 U.S. 254, 254 (1964)\n \n Sullivan claimed the false statements libeled him. The case was tried under Alabama's \"libelous per se\" law, which only required proof that the statements were false and did not require a showing that the publisher of the statement acted with actual malice. The Times appealed to SCOTUS and asked SCOTUS to use the 14th. Amendment to declare the Alabama law violated the 1st. Amendment.\n \n Read your case, bhbcu64. SCOTUS merely held that in a libel action a public official cannot rely upon a \"libelous per se\" state law, and the 1st. Amendment required proof that the statement was not only false but was made with malice:\n \n \"The constitutional guarantees require, we think, a federal rule that prohibits a public official from recovering damages for a defamatory falsehood relating to his official conduct unless he proves that the statement was made [page 280] with 'actual malice' - that is, with knowledge that it was false or with reckless disregard of whether it was false or not.\" Id. at 279-280.\n \n SCOTUS did not \"nearly abolish\" the law of libel. All it did was establish what proof must be met before an official can win a libel suit. This case cuts against your position.\n \n That's exactly my point. \n \n I tell you what: If I were ever reckless enough to ask you to defend me on a charge of murder by human sacrifice, then by all means please make the absolute \"Congress shall make no law\" argument. Just don't cite Sullivan to the judge....\n \n ---\n \n \"Reason means truth and those who are not governed by it take the chance that someday the sunken fact will rip the bottom out of their boat.\" Oliver Wendell Holmes, Jr.", 
   {
    "post_info": {
     "post_title": "Read the cases...."
    }, 
    "unicode_changes_made": true
   }, 
   305179, 
   null, 
   1205259840.0
  ], 
  [
   305224, 
   null, 
   "bhbcu64", 
   "Bryan,\n \n SCOTUS did not &#8220;nearly abolish&#8221; the law of libel. All it did was establish what proof must be met before an official can win a libel suit. This case cuts against your position.\n \n \n Silly you, not getting that the SCOTUS set the bar so high in a libel suit as to de facto eliminate libel as it relates to a publlic official.\n \n Where is the mind reader with sufficient ability to discern when and where a newspaper is acting with \"actual malice\"?\n \n If the bar is so high as to be out of reach, the net effect is to abolish the cause of action entirely.", 
   {}, 
   305214, 
   null, 
   1205266440.0
  ], 
  [
   305226, 
   null, 
   "Ghost Rider", 
   "Silly you, not getting that the SCOTUS set the bar so high in a libel suit as to de facto eliminate libel as it relates to a publlic official.\n \n Where is the mind reader with sufficient ability to discern when and where a newspaper is acting with \"actual malice\"?\n \n If the bar is so high as to be out of reach, the net effect is to abolish the cause of action entirely.\n\n \n Dude, you were proven wrong with your own citation, and you still claim to be right? Talk about arrogance.\n \n The bar really isn't set that high, you just have to supply proof that the statement was false and made by someone who knew that it was false.\n \n This reminds me of the Miller case when it was determining the place of a sawed-off double barreled shotgun. They didn't say that it didn't have a place in the militia, they just said they had no evidence available to support the statement that it did. Of course when the defendant isn't there and can't argue the case it's awful hard to make any real determination.", 
   {}, 
   305224, 
   null, 
   1205266920.0
  ], 
  [
   305268, 
   null, 
   "bhbcu64", 
   "grider,\n \n The bar really isn't set that high, you just have to supply proof that the statement was false and made by someone who knew that it was false.\n \n Sorry, that's not ALL Sullivan stands for.\n \n Do you know what actual malice means in the law?\n \n I suggest you might start with Black's Law Dictionary.", 
   {}, 
   305226, 
   null, 
   1205276280.0
  ], 
  [
   305285, 
   null, 
   "Ghost Rider", 
   "Sorry, that's not ALL Sullivan stands for.\n \n Do you know what actual malice means in the law?\n \n I suggest you might start with Black's Law Dictionary.\n\n \n Malice. The intent, without just cause or reason, to commit a wrongful act that will result in harm to another.\n \n http://www.answers.com/topic/new-york-times-co-v-sullivan?cat=biz-fin", 
   {}, 
   305268, 
   null, 
   1205284260.0
  ], 
  [
   305298, 
   null, 
   "Seekerrr", 
   "seeker,\n \n If that process is not followed, but changes are made through activist courts or by legislation which glaringly disregards the laws that give them their powers, that is breaking the law.\n \n You mean like the activist court which, while looking at a magazine, decided that it was not speech or press simply because it contained \"obscenity\" and therefore not covered by 1A?\n \n Now that's activism; that is breaking the law.\n\n \n Prove it. Prove that the Founders meant to preclude any interpretation of the 1st which outlawed obscenity. You know, show us the quotes that say that their collective intent was to create an \"absolutely-anything-goes\" society as regards eliminating any regulation whatsoever when the speech or press example in question injures others, either financially or physically. You do realize don't you, that your rights end where mine begin? In other words, your rights are the last thing considered by law if your actions infringe on someone else's rights. Surely you're not going to argue that a full-grown man forcing some kind of sex on a child is not injurious to that child. You can't seriously believe that the Founders intended for the 1st Amendment to protect someone profiting from depictions of such a sick act. If you do believe such, then give us just one quote from one framer of The Constitution that supports such an....ahem...obscenely vacuous assertion. Good luck.\n \n Now, I will have no problem whatsoever supplying a hundred quotes from the vast majority of framers that say unequivocally that their intent for the 2nd Amendment was to protect the individual right of Americans to keep and bear arms, and that that right shall not be infringed. In other words, I can prove that my interpretation of the 2nd Amendment is wholly consistent and compatible with what the framers intended it to mean.\n \n Quit trying to obfuscate the question at hand. If you're not happy with an interpretation by the SCOTUS regarding obscenity and the 1st Amendment, then bring a case and show how you, society or the sanctity of The Constitution has been injured by said interpretation. That's what we, as gun-owners and 2nd Amendment advocates have done, and after taking more than 70 years, we have a case that will decide once and for all what the 2nd Amendment means, or at least the individual vs. collective right aspect of it. I think it's going to be heard this month as a matter of fact. The last I heard, it would be in the Spring in any case. \n \n Your problem(s) with how the SCOTUS has interpreted the 1st Amendment as it relates to obscenity has nothing whatsoever to do with their virtual abdication of their responsibilities to make some kind of definitive interpretation of the 2nd. Your argument belongs in another issue-thread for debate, not in the gun control thread. You have yet to even discuss the 2nd without confusing and obfuscating the issue with your criticisms of how the 1st has been interpreted as regards kiddie porn and obscenity in general. So let's see if you can answer one salient question; do you believe the 2nd Amendment protects the individual right to keep and bear arms?\n \n \nWhy am I certain that's not what you were posting about?;)\n\n \n Umm....because you're the only one talking about the 1st Amendment in a 2nd Amendment thread perhaps?\n \n Seekerrr", 
   {}, 
   305123, 
   null, 
   1205288340.0
  ], 
  [
   305302, 
   null, 
   "bhbcu64", 
   "seekerr,\n \n Umm....because you're the only one talking about the 1st Amendment in a 2nd Amendment thread perhaps?\n \n I just hope that you remember that the same SCOTUS which can read things into one Amendment that are not there can read things out of another one that you seem to think are there.\n \n As the great Chief Justice John Marshall declared, \"The Constitution is most definitely what the judges say it is.\"", 
   {}, 
   305298, 
   null, 
   1205289540.0
  ], 
  [
   305319, 
   null, 
   "Ghost Rider", 
   "I just hope that you remember that the same SCOTUS which can read things into one Amendment that are not there can read things out of another one that you seem to think are there.\n \n As the great Chief Justice John Marshall declared, \"The Constitution is most definitely what the judges say it is.\"\n\n \n Interesting how you chose to completely sidestep the question asked by Seeker.", 
   {}, 
   305302, 
   null, 
   1205296740.0
  ], 
  [
   305324, 
   null, 
   "Bryan", 
   "Bhbcu64, I don&#8217;t want to keep hitting you here over a 1st. Amendment issue. It&#8217;s just that your misinterpretation of the 1st. affects the credibility of your interpretation of the 2nd. \n \n Please read the Sullivan case before you post on it again. SCOTUS is not using the Black&#8217;s definition of &#8220;malice.&#8221; If you had read both, then you would have realized that Black&#8217;s definition of malice is a different, criminal context definition. This is what SCOTUS said: &#8220;'actual malice' &#8212; that is, with knowledge that it was false or with reckless disregard of whether it was false or not.&#8221; (which, when you think about it, is also a fair description of your arguments). In later cases this standard came to be known by the name &#8220;New York Times malice.&#8221; You would not so easily confuse it with the Black&#8217;s definition of &#8220;malice&#8221; if you would read your case. \n \n Now to answer your mocking &#8220;where are the mind readers&#8221; question: Sullivan tells you this if you would bother to read your case. Justice Brennan, writing for the majority, decided to play the mind reader, starting with this paragraph:\n \n &#8220;Since respondent may seek a new trial, we deem that considerations of effective judicial administration require us to review the evidence in the present record to determine [Page 285] whether it could constitutionally support a judgment for respondent. This Court's duty is not limited to the elaboration of constitutional principles; we must also in proper cases review the evidence to make certain that those principles have been constitutionally applied. This is such a case, particularly since the question is one of alleged trespass across &#8216;the line between speech unconditionally guaranteed and speech which may legitimately be regulated.&#8217;&#8221; New York Times Co. v. Sullivan, 376 U.S. 254, 284-285 (1964) (bold emphasis added).\n \n Now here is another question for you: How do you continue to have faith in your NO LAW = NO POSSIBLE RESTRICTIONS argument when the case you cite for this position agrees that a line exists &#8220;between speech unconditionally guaranteed and speech which may legitimately be regulated&#8221;?\n \n Again, you really should bother to read your case before you allow me to use it against you. The first rule of debating is to make sure your arguments are internally consistent. Your posts raise a new and novel question touching on this rule: Are your arguments really inconsistent when you don&#8217;t realize that they are? \n \n Now I am also curious to know if you did any research before you made this statement:\n \n If the bar is so high as to be out of reach, the net effect is to abolish the cause of action entirely.\n \n Do you want me to cite you cases which made it over the bar?\n \n I am enjoying our discussion, Bhbcu64, but I&#8217;ve got to tell you: If you won&#8217;t bother to research what you are saying then you&#8217;re acting like a blind man, in a dark room, trying to catch a black cat that isn&#8217;t there. I&#8217;m offering to turn on the light for you, but I can&#8217;t make you open your eyes. \n \n Now I have answered all your questions again. If you are still wedded to your No LAW = NO POSSIBLE RESTRICTION argument, then go ahead and answer my &#8220;human sacrifice example&#8221; question. It does not appear you could do any worse with that one.", 
   {
    "post_info": {
     "post_title": "Blind man's bluff"
    }
   }, 
   305319, 
   null, 
   1205300280.0
  ], 
  [
   305339, 
   null, 
   "bhbcu64", 
   "Bryan,\n \n How do you continue to have faith in your NO LAW = NO POSSIBLE RESTRICTIONS argument when the case you cite for this position agrees that a line exists &#8220;between speech unconditionally guaranteed and speech which may legitimately be regulated&#8221;?\n \n \n You STILL don't get it, do you?\n \n Brennan's opinion ought to make you gun nuts shake in your tidy whities.\n \n What he is saying is that the SCOTUS claims the right to interpret \"NO LAW\" from 1A out of all existence.\n \n If the SCOTUS can claim that some speech, despite the absolute terms of 1A, can \"legitimately be regulated\" what is to stop the SCOTUS from saying that some provisions of of 2A may also \"legitimately be regulated\"?\n \n All it will take is for President Obama to replace 3 or 4 Justices, which seems more and more likely, to bring about that happy outcome.\n \n Doesn't the phrase \"legitimately be regulated\" strike fear into you and your ilk?\n \n If I were in your position, I would be afraid, very afraid.", 
   {}, 
   305324, 
   null, 
   1205313360.0
  ], 
  [
   305348, 
   null, 
   "Seekerrr", 
   "Bryan,\n \n How do you continue to have faith in your NO LAW = NO POSSIBLE RESTRICTIONS argument when the case you cite for this position agrees that a line exists \"between speech unconditionally guaranteed and speech which may legitimately be regulated\"?\n \n \n You STILL don't get it, do you?\n \n Brennan's opinion ought to make you gun nuts shake in your tidy whities.\n \n What he is saying is that the SCOTUS claims the right to interpret \"NO LAW\" from 1A out of all existence.\n \n If the SCOTUS can claim that some speech, despite the absolute terms of 1A, can \"legitimately be regulated\" what is to stop the SCOTUS from saying that some provisions of of 2A may also \"legitimately be regulated\"?\n \n All it will take is for President Obama to replace 3 or 4 Justices, which seems more and more likely, to bring about that happy outcome.\n \n Doesn't the phrase \"legitimately be regulated\" strike fear into you and your ilk?\n \n If I were in your position, I would be afraid, very afraid.\n\n \n Well, actually, if this is really all you're trying to get across, then I don't disagree. I am very concerned that the renegades on the SCOTUS will seize power that is not granted them in The Constitution and ignore both the intent and letter of the law, thus imposing their own individual mores on us. If that is your argument, you sure have a lousy way of putting it forth, but I do agree that it is a legitimate concern.\n \n So, is the intent of the 2nd Amendment to protect an individual right to keep and bear arms or not as far as you're concerned?\n \n Seekerrr", 
   {
    "unicode_changes_made": true
   }, 
   305339, 
   null, 
   1205324460.0
  ], 
  [
   305353, 
   null, 
   "bhbcu64", 
   "Seeker,\n \n So, is the intent of the 2nd Amendment to protect an individual right to keep and bear arms or not as far as you're concerned?\n \n It is my fond hope that the SCOTUS will rule that way.\n \n I favor the Canadian rules on gun ownership.\n \n The thought that, when I walk down the street, I do not know who is or is not armed fills me with dread.", 
   {}, 
   305348, 
   null, 
   1205330220.0
  ], 
  [
   305362, 
   null, 
   "Ghost Rider", 
   "You STILL don't get it, do you?\n\n \n No, apparently YOU don't get it!\n \n \nBrennan's opinion ought to make you gun nuts shake in your tidy whities.\n\n \n Why, because it establishes what we've believed in for so long, that NO right is absolute in its scope and magnitude? Why should we be afraid anyway, because we come off as being reasonable?\n \n \nWhat he is saying is that the SCOTUS claims the right to interpret \"NO LAW\" from 1A out of all existence.\n\n \n Prove it.\n \n \nIf the SCOTUS can claim that some speech, despite the absolute terms of 1A, can \"legitimately be regulated\" what is to stop the SCOTUS from saying that some provisions of of 2A may also \"legitimately be regulated\"?\n\n \n You mean like the flawed concept of the Second Amendment making it legal for all citizens to own nuclear warheads, surface-to-air missiles and death rays? Grow up already!\n \n \nAll it will take is for President Obama to replace 3 or 4 Justices, which seems more and more likely, to bring about that happy outcome.\n\n \n He won't get to be president until 2009, therefore he won't be able to elect new justices until after Heller has been decided and by then it'll be too late to do anything.\n \n \nDoesn't the phrase \"legitimately be regulated\" strike fear into you and your ilk?\n\n \n Why should it? You said yourself that one Supreme Court case can be overturned by another. So if they screw up on Heller we'll just construct a new case to make it to the Supreme Court, with circumstances crafted in such a way that the only way they can possibly rule is that the right truly is individual.\n \n \nIf I were in your position, I would be afraid, very afraid.\n\n \n You should be very afraid as it is. The Supreme Court will most likely tell you and everyone else that the Militia Clause isn't valid and that the Second Amendment is purely about nothing more than protecting the individual's right to keep and bear arms, plain and simple.", 
   {}, 
   305339, 
   null, 
   1205335860.0
  ], 
  [
   305364, 
   null, 
   "Ghost Rider", 
   "The thought that, when I walk down the street, I do not know who is or is not armed fills me with dread.\n\n \n Why's that? Are you a mugger? A rapist? A carjacker? What the hell are you, boy, that causes the thought of legal gun owners being able to protect themselves, to fill you with dread and fear?\n \n Only criminals have any reason at all to be afraid of people being armed, so what's that say for you?", 
   {}, 
   305353, 
   null, 
   1205335980.0
  ], 
  [
   305368, 
   null, 
   "bhbcu64", 
   "Grider,\n \n Only criminals have any reason at all to be afraid of people being armed, so what's that say for you?\n \n \n Care to tell that to the families of those murdered at Virginia Tech, Auburn, UNC, etc., all of whom were killed by people carrying firearms that were legally obtained?\n \n Nope, because you don't have the stones to do so. \n \n What crimes did those innocents commit that should have made them afraid of weapons-toting crazies?\n \n All sizzle - no fajita.\n \n Now you really turn my stomach with your absurdities.", 
   {}, 
   305364, 
   null, 
   1205338440.0
  ], 
  [
   305371, 
   null, 
   "Ghost Rider", 
   "Care to tell that to the families of those murdered at Virginia Tech, Auburn, UNC, etc., all of whom were killed by people carrying firearms that were legally obtained?\n\n \n And how many of these killers were legally armed at their place of killing? Not single a damn one of them. They all broke the law when they walked onto their killing grounds, because laws forbid guns at those locations. Therefore not a single one of them qualified as a \"legal gun owner\" or a \"law abiding gun owner\", therefore your entire argument is moot.\n \n Let me ask you again. What is it that you do, that makes you afraid of law-abiding citizens who are legally carrying guns to protect themselves? Are you a rapist? A mugger? A murderer? A carjacker? A pothead?", 
   {}, 
   305368, 
   null, 
   1205339640.0
  ], 
  [
   305392, 
   null, 
   "bhbcu64", 
   "grider,\n \n Let me ask you again. What is it that you do, that makes you afraid of law-abiding citizens who are legally carrying guns to protect themselves? Are you a rapist? A mugger? A murderer? A carjacker? A pothead?\n \n \n \"None of the above\" fits quite well, thank you.\n \n BTW, the UNC and Auburn gun victims were off campus.\n \n BTW #2, if the state can ban guns at schools, they have the power to ban them everywhere.\n \n Be very afraid!", 
   {}, 
   305371, 
   null, 
   1205344440.0
  ], 
  [
   305395, 
   null, 
   "Ghost Rider", 
   "\"None of the above\" fits quite well, thank you.\n\n \n Then for what reason are you afraid?\n \n \nBTW, the UNC and Auburn gun victims were off campus.\n\n \n Were they killed on their way to or from school?\n \n \nBTW #2, if the state can ban guns at schools, they have the power to ban them everywhere.\n\n \n States nothing. Guns are banned on school property by the Federal law known as the Gun Free School Zones Act. The Supreme Court determined this law to be unconstitutional, but the government reenacted it despite this fact.", 
   {}, 
   305392, 
   null, 
   1205345880.0
  ], 
  [
   305404, 
   null, 
   "Bryan", 
   "Angels and ministers of grace defend us! Bhbcu64 has finally agreed with something I have said. \n \n Today you tell me that Sullivan would support the view that none of our rights, including the RKBA, is absolute-and that SCOTUS feels it has the power to define their limits (And you say I should be afraid). Today you complain: You STILL don't get it, do you?\n \n Oh, what a tangled web you weave, bhbcu64! It appears a brief history lessen is now in order: \n \n I'm the one that gave you this argument to begin with. I started in this thread with you by giving that very same \"no right is absolute\" explanation. Back then you disagreed with the very position you take today. Surely you remember my original position and your response? You quoted mine back to me when you disagreed with me then (and your own self now):\n \n Bryan,\n I have never argued that any of our rights is absolute in scope. \n That may well be your particular belief.\n However, the wordsmiths clearly did intend, by their inclusion of the words NO LAW in 1A for the right to be absolute.\n What other meaning can these 2 little words be given that are true to their original intent?\n \n That was only three days ago, my friend. Can't you remember now that we started with my arguing that no right is absolute and you went off on an absolute NO LAW = NO POSSIBLE RESTRICTION 1st. amendment argument?\n \n Do you remember I then called you out by citing authority which contradicts your view, and more importantly I challenged you to give me a single case which supports your view?\n \n You applied you powers of research, and do you remember your response? You cited Sullivan and claimed it supported your view. In particular, you claimed it: \"nearly abolished the law of libel as it applies to people in the public eye.\" \n \n Do you remember how I then said \"no it didn't\"? Do you remember how I quoted you the language from the case to prove this. More importantly, don't you remember that I asked this follow up: When you incorrectly say that SCOTUS \"nearly abolished,\" aren't you agreeing the interpretation should be \"Congress shall make nearly no law\"?\n \n You remembered it then, because you immediately jumped to correct this obvious contradiction with your argument by spinning it this way: \n \n SCOTUS set the bar so high in a libel suit as to de facto eliminate libel as it relates to a public official. If the bar is so high as to be out of reach, the net effect is to abolish the cause of action entirely.  You went on to claim libel was abolished because no one could make the factual determination set forth in Sullivan. Your mocking question asked \"where were the mind readers?\". \n \n Don't you remember that I then re-cited you to the case you still have not read to prove you wrong about it again? Do you remember how I showed you how you were also applying the wrong definition of malice? Do you remember how I answered your \"mind readers\" question? I pointed out where in the case the SCOTUS justices described how they felt they could be your mind readers. I directly cited a quote from the case which destroys your \"Sullivan stands for NO LAW = NO RESTRICTIONS argument.\" I'm sure you noticed that I threatened to throw subsequent cases at you which found libel in spite of your claimed \"de facto\" ban. Have you so soon forgotten how I chided you again for not reading and understanding your case?\n \n Now, today, you try today to take all that history back and pretend this was not the real reason you cited the case. Today you tell me the real reason you cited it is because you believe Sullivan stands for the position that SCOTUS believes no right is absolute. \n \n How quickly you have forgotten that this was the very position I had adopted when we started! How very quickly you have forgotten that your original argument was not only directly contradictory to what you say now, but that you actually claimed that Sullivan stood for your absolutist position! \n \n Thank you for at last agreeing that I was right when I first started this discussion with you, even if you want to pretend to have forgotten that was my position all along. Here it is, cited to you again:\n \n http://www.4forums.com/political/showthread.php?p=155170#post155170\n \n Oh, and not that I want you to fanaticize any further about my underwear, but for your information I prefer boxer briefs-they are so much more comfortable.\n \n Now before I go let me throw a shout out to some of the other bloggers here:\n \n Hey Dr. No and Ghost Rider! One of you guys need to call the police and report the theft of portable goalposts! You know, the ones bhbcu64 tried to leave at both your front doors-and which he repossessed in the darkness of this early morning. \n \n ---\n \n I also note that you ae engaged in goalpost shifting. (bhbcu64 response to Dr. No in U.S. v. Miller thread, posted 3/3/08)\n \n Wow! Those goalpossts sure are portable in your hands, old chap. (bhbcu64 response to Ghost Rider in U.S. v. Miller thread, posted 3/4/08)", 
   {
    "post_info": {
     "post_title": "Witnesses reported today the theft of portable goalposts\u0085."
    }, 
    "unicode_changes_made": true
   }, 
   305395, 
   null, 
   1205349360.0
  ], 
  [
   305456, 
   null, 
   "bhbcu64", 
   "Bryan,\n \n How quickly you have forgotten that this was the very position I had adopted when we started! How very quickly you have forgotten that your original argument was not only directly contradictory to what you say now, but that you actually claimed that Sullivan stood for your absolutist position!\n \n You're exactly 180 degrees out of phase here, old chap.\n \n It is the gun crowd which claims an absolutist position under 2A without a single word in the Constitution to support that POV.\n \n What I have been saying all along is that, even in the face of the absolutist terms of 1A (NO LAW), the SCOTUS has interpreted that out of all rational meaning.\n \n What you need to be very afraid of is that the SCOTUS will reject YOUR absolutist position on 2A, which has far less underpinning it in its text than 1A does and rule in a way you will truly dislike.\n \n Now, please try to read this as slowly as I have typed it. Maybe you'll get it.emoticon_love", 
   {}, 
   305404, 
   null, 
   1205364420.0
  ], 
  [
   305486, 
   null, 
   "Ghost Rider", 
   "It is the gun crowd which claims an absolutist position under 2A without a single word in the Constitution to support that POV.\n\n \n Sorry, you're mistaken, please try again :) \n \n Unlike you, we're not the people making such outrageous statements, calling for the repealment of every last gun law on the entire planet. We're not on TV raising hell, screaming at the top of our lungs for the right to buy and own modern nuclear warheads so we can aim them right at the Pentagon should they so much as cast a dirty look in our direction. We're not raising all kinds of hell over the fact that we can't buy RPGs and surface-to-air missiles and 140mm cannons.\n \n You see, unlike YOU we're actually reasonable people, and we're fully willing to accept restrictions so long as they're perfectly reasonable. What we won't tolerate, however, are blatant attacks against us for no justifiable reason.\n \n Kindly don't get the likes of us, confused with you. It's highly offensive to gun owners to be painted as the same extremist type as you.\n \n \nWhat I have been saying all along is that, even in the face of the absolutist terms of 1A (NO LAW), the SCOTUS has interpreted that out of all rational meaning.\n\n \n Sorry but once again you've missed the boat and fallen into the ocean.\n \n The Founding Fathers never intended to set up an environment where no law of any sort could ever be passed for any reason whatsoever. If that truly had been their intent then the founding document would include somewhere in its body, a passage reading \"No government shall ever be established within this land, no law shall ever be passed on this soil, no restrictions of any sort may ever been enacted for any reason.\" Since so passage exists, this was never the intent of the Founding Fathers.\n \n \nWhat you need to be very afraid of is that the SCOTUS will reject YOUR absolutist position on 2A, which has far less underpinning it in its text than 1A does and rule in a way you will truly dislike.\n\n \n The only thing absolutist about our position is that the Second Amendment protects a right that's purely individual, completely independent from the nonsensical believe that one must serve in the army, and that it does nothing to grant any power to any organization of any sort.\n \n I hardly see that as an unreasonable position.", 
   {}, 
   305456, 
   null, 
   1205374620.0
  ], 
  [
   305502, 
   null, 
   "bhbcu64", 
   "grider,\n \n You see, unlike YOU we're actually reasonable people, and we're fully willing to accept restrictions so long as they're perfectly reasonable. \n \n And, as we know, REASONABLE people can differ in their understanding of the definition of the word \"reasonable\".\n \n You say 2A permits the private ownership of firearms. You call that reasonable. I call that unreasonable.\n \n I would like to see firearms, except for hunting guns, extirpated from the USA. I call that reasonable. You call it unreasonable.\n \n It's a push!", 
   {}, 
   305486, 
   null, 
   1205380380.0
  ], 
  [
   305505, 
   null, 
   "Bryan", 
   "What I have been saying all along is that, even in the face of the absolutist terms of 1A (NO LAW), the SCOTUS has interpreted that out of all rational meaning. \n \n Actually no, bhcbu64, it took you several times of assuming the position and yelling \"thank you sir may I have another\" before I disabused you of the opposite view. It was only this morning that you finally agreed with what I have been saying all along. \n \n What you need to be very afraid of is that the SCOTUS will reject YOUR absolutist position on 2A....\n \n Actually no, I have never assumed that view. Between us I have always been the one to argue that the scope of the individual RKBA is limited, and can be subject to rational limitation. But you knew that. I have posted this view in every response I have given you in this thread. \n \n Now you're just being deliberately dishonest (again). \n \n I'm glad you're slowing down your typing speed. Consider, however, that no one here is judging you on a words-per-minute basis. What we are judging is how little thought and veracity goes into what you type, regardless of its speed.\n \n ---\n \n \"Do not veil the truth with falsehood, nor conceal the truth knowingly.\" The Koran, 2:42", 
   {
    "post_info": {
     "post_title": "The goalpost thief was recently spotted...."
    }, 
    "unicode_changes_made": true
   }, 
   305502, 
   null, 
   1205382240.0
  ], 
  [
   305511, 
   null, 
   "Ghost Rider", 
   "And, as we know, REASONABLE people can differ in their understanding of the definition of the word \"reasonable\".\n\n \n Actually we're pretty uniform on what we consider \"reasonable firearms laws and restrictions\". Background checks, we're okay with that. Severe punishments for criminals in possession of a firearm, we're okay with that. A more involved process for purchasing a machinegun than what's involved with any other type of firearm, we're okay with that.\n \n What we aren't okay with are things like the DC gun ban, waiting periods, registration, bans on so called \"assault weapons\" and other such BS that has no basis in anything other than existing simply for the purpose of existing.\n \n \nYou say 2A permits the private ownership of firearms. You call that reasonable. I call that unreasonable.\n\n \n And I call bulls**t on you. I think you're just looking for a fight and don't care how you get it.\n \n \nI would like to see firearms, except for hunting guns, extirpated from the USA. I call that reasonable. You call it unreasonable.\n\n \n That's because it is unreasonable. Especially since the accepted definition of \"hunting guns\" has warped in the last 50 years. Since there's no specific criteria that needs to be met to qualify as a hunting firearm, any gun capable of downing game with one or two shots is perfectly suitable for hunting. Just recently the AR-15 platform has been adapted for the .338 Federal cartridge, which will take deer and elk easily.", 
   {}, 
   305502, 
   null, 
   1205384880.0
  ], 
  [
   305536, 
   null, 
   "Seekerrr", 
   "Actually we're pretty uniform on what we consider \"reasonable firearms laws and restrictions\". Background checks, we're okay with that. Severe punishments for criminals in possession of a firearm, we're okay with that. A more involved process for purchasing a machinegun than what's involved with any other type of firearm, we're okay with that.\n\n \n Ahem.....We're not as \"uniform\" in what we consider reasonable as you proclaim GR. I frequent several gun forums and, except for a few who are similar to the guy you're responding to here and just like to argue for the sake of arguing, I've never seen proclamations such as the one above before. \n \n Background checks are nothing more than permission slips for future confiscations. You consent to that intrusion in order to exercise your God-given rights, and you might as well kiss the \"God-given\" aspect of it away and accept that it is \"man-granted\" and \"man-controlled.\" \n \n \"They\" say that the pen is mightier than the sword, yet you would not deny criminals their 1st, 4th or 5th Amendment rights, only their 2nd. I could understand the advocation by a 2nd A advocate of restricting their gun rights until some showing of rehabilitation can be shown, but I honestly believe that a lifetime denial of rights, along with \"severe penalties\" for exercising those rights, is not only highly unreasonable, but illegal under any originalist reading of The Constitution.\n \n And a \"more involved process\" for buying a machine gun than for other guns? You're playing right into the Brady mindset. You claim you're against bans on \"assault weapons,\" and even put the fear-mongering phrase in quotes to emphasize the ludicrousness of it (I presume), but want the government to decide if you're able to buy or own one legally? \n \n You're welcome to these conclusions about your own view, but please, speak for yourself. \"We\" are not at all unified in these issues. In fact, there's only a gnat's breath worth of difference between what you're advocating here and what Brady and the AWB mandated before it was finally allowed to die an unceremonial death. Sorry, but that's just the way I see it.\n \n Seekerrr", 
   {}, 
   305511, 
   null, 
   1205411700.0
  ], 
  [
   305540, 
   null, 
   "bhbcu64", 
   "HMMM!\n \n Could it be that there is dissension among the gun nuts as to just what the word \"reasonable\" means?\n \n Look at the previous two posts. One guy thinks a reasonable restriction would be to prevent felons from ever again possessing firearms; the other one calls this unreasonable.\n \n Well, Glory be!!emoticon_xangel", 
   {}, 
   305536, 
   null, 
   1205415000.0
  ], 
  [
   305549, 
   null, 
   "Ghost Rider", 
   "[QUOTE]\nAhem.....We're not as \"uniform\" in what we consider reasonable as you proclaim GR. I frequent several gun forums and, except for a few who are similar to the guy you're responding to here and just like to argue for the sake of arguing, I've never seen proclamations such as the one above before.\n\n \n I talk to a lot of people, we all share similar viewpoints.\n \n \nBackground checks are nothing more than permission slips for future confiscations. You consent to that intrusion in order to exercise your God-given rights, and you might as well kiss the \"God-given\" aspect of it away and accept that it is \"man-granted\" and \"man-controlled.\"\n\n \n Here's the thing. We've already established that no right is ever absolute, and we're alright with that fact. Realistically we need to accept certain limitations on exactly what the Second Amendment means and does. If we refuse absolutely everything we're no better than the crazy nuts and anti-gunners. We need to be reasonable on this issue.\n \n What would you suggest as reasonable gun control laws? \n \n \n\"They\" say that the pen is mightier than the sword, yet you would not deny criminals their 1st, 4th or 5th Amendment rights, only their 2nd. I could understand the advocation by a 2nd A advocate of restricting their gun rights until some showing of rehabilitation can be shown, but I honestly believe that a lifetime denial of rights, along with \"severe penalties\" for exercising those rights, is not only highly unreasonable, but illegal under any originalist reading of The Constitution.\n\n \n Well if somebody's proven that they're going to go out and willfully murder people for absolutely no reason, they deserve to be locked up or put down.\n \n The people responsible for all the school massacres are sick individuals. I don't think they could be trusted no matter how much rehabilitation they're given.\n \n \nAnd a \"more involved process\" for buying a machine gun than for other guns? You're playing right into the Brady mindset. You claim you're against bans on \"assault weapons,\" and even put the fear-mongering phrase in quotes to emphasize the ludicrousness of it (I presume), but want the government to decide if you're able to buy or own one legally?\n\n \n Well what about a higher price for true machineguns than their semi-automatic cousins? People are willing to pay $1,000 for a new AR-15 (I know, I've seen 'em do it!) what about $2,500 for a new model M-16 made after 1986? Would that be more acceptable?\n \n \nYou're welcome to these conclusions about your own view, but please, speak for yourself. \"We\" are not at all unified in these issues. In fact, there's only a gnat's breath worth of difference between what you're advocating here and what Brady and the AWB mandated before it was finally allowed to die an unceremonial death. Sorry, but that's just the way I see it.\n\n \n Actually there's a much larger difference between what I say and what the other side wanted. They advocated a total and outright ban on certain models based on nothing but cosmetic features. What I'm advocating is lessened restrictions until we're at a reasonable level that we can tolerate.\n \n I'm in full support of the repealment of the machinegun ban, the machinegun importation ban, the handgun safety lock law, the \"sporting provision\" of the Gun Control Act and many other insane laws that are of no purpose. The laws I DO support are the ones that are supposed to actually make a difference and inhibit criminals more than honest citizens. \n \n Yes I know the background check can be superceded by the black market, I'm not denying that and I never have. Because criminals can't buy from licensed dealers that makes it harder to actually set up sting operations and catch them. The only good part about the background checks is that we can say that we're not allowing criminals to get their guns at any legal location.\n \n The thing we have to remember is that the battle of gun control vs. gun rights is unlikely to be settled in one big bill that'll give us everything we want. We're going to have to compromise on what we want and what we get. Oftentimes we're going to need to settle for less than what we want in the short run, if in the long run we can get a total repeal.", 
   {}, 
   305536, 
   null, 
   1205424000.0
  ], 
  [
   305550, 
   null, 
   "Ghost Rider", 
   "Could it be that there is dissension among the gun nuts as to just what the word \"reasonable\" means?\n\n \n There's dissension among the ranks of gun-haters as to just what the word \"reasonable\" means as well.\n \n \nLook at the previous two posts. One guy thinks a reasonable restriction would be to prevent felons from ever again possessing firearms; the other one calls this unreasonable.\n\n \n Well if you go out and murder innocent people for kicks, then no you shouldn't ever be able to touch a gun again. I hardly see how that's unreasonable. There are certain degrees of felonies, and cold blooded murder is a very serious degree.", 
   {}, 
   305540, 
   null, 
   1205424360.0
  ], 
  [
   305555, 
   null, 
   "bhbcu64", 
   "grider,\n \n There's dissension among the ranks of gun-haters as to just what the word \"reasonable\" means as well.\n \n \n \n No argument there.\n \n Seems as though we need to let the courts resolve the matter. That's their function under Article III and Marbury.", 
   {}, 
   305550, 
   null, 
   1205426820.0
  ], 
  [
   305964, 
   null, 
   "kesseltron", 
   "I would have to agree with Ghost Rider in that background checks are reasonable. I think that most felons who are barred from owning guns should be allowed to own guns, but I find it difficult to understand why someone would be against enforcing the existing laws. That, to me, is as lame as Clinton's \"don't ask, don't tell\" solution to gays in the military. Change the law, don't avoid it.\n \n As far as machine guns go, I fail to see why they should cost more. all that is is an economic restriction on their possesion. That is why there is currently a $200 tax on their transfer. The \"man\" wants to keep weapons out of the hands of the poor. That is where much of the saturday night special legeslation comes from. \n \n As for the second ammendment protecting only hunting guns, and not weapons, ...\n \n I can't even muster a response. That is possible the most idiotic thing I have ever read. \n \n \"Civilian ownership of deer rifles, being necesary to the security of tonight's dinner, the right of the people to hunt, shall not be infringed.\"\n \n I own an ar-15. It is chambered in .223, and in Ohio (my state of residence), it is nearly useless for the persuit of game. It is my people hunting rifle. I keep it and train with it because that is my duty ss a member of the unorganized militia. I also teach everybody who is willing to learn how to shoot. It would be nice if everybody would take the same innitiative. We would all be a lot safer (especialy in the long run).", 
   {}, 
   305555, 
   null, 
   1205469060.0
  ], 
  [
   305967, 
   null, 
   "Ghost Rider", 
   "I have nothing against cheap handguns or their ownership. I also have nothing against machineguns. I'm simply trying to think of a way people can freely own new models again, while at the same time being able to point out to the stupid media that they're not easy for criminals to get.", 
   {}, 
   305964, 
   null, 
   1205470620.0
  ], 
  [
   305968, 
   null, 
   "Seekerrr", 
   "[QUOTE=Ghost Rider;305549]\nWhat would you suggest as reasonable gun control laws?\n \n Well, I look to the main intent of the 2nd Amendment, which was at least as much about one's ability to defend themselves and their families, as it was about defending the country from usurpers, even if those usurpers happened to be Americans and/or American politicians. \"Reasonable\" is relative to the threat you face. In deciding \"reasonable\" armament to enforce The Constitution from a run amok government, I would focus on the word \"arms,\" as in \"...to keep and bear arms....\" I can agree that nukes and missile batteries might not fall within a strict definition of \"arms.\" Arms, as used by the Framers, probably referred to small arms, things that could be carried and wielded by hand. The reason I say that the bigger armament \"might not\" fall into the protected right category is that there is a lot of history in the U.S. of private ownership of cannon and mortar, and I don't recall ever reading about a 2nd Amendment ruling that said they weren't included in the protected right, but I wouldn't feel put-upon if the SCOTUS decided they weren't. I do however, feel very put-upon that I have to ask permission, any degree of permission, to exercise my right to own whatever weapon I want that is at least as effective in combat as any of the small arms that the government might bring to bear against us. I believe to my core that this is a reasonable reading of the 2nd Amendment, and it is most certainly consistent with the reasons that many Framers stated for including the 2nd in the Bill of Rights.\n \n I believe that \"realistically\" we have allowed Congress, presidents and the courts to engage in usurpation already. I am not willing to voluntarily concede more constitutional ground, and I am frankly disappointed when I see/hear gun-owners and self-proclaimed 2nd Amendment proponents offer such vast amounts of concessions simply to appear \"reasonable\" to those who would send our government to our homes to take our guns by force if they had that authority. To me, it's analogous to George Washington sending an envoy to Cornwallis' encampment at Yorktown to offer compromise on thoroughly trouncing him in the final battle because to do such would make the King and the people back in England think negatively of the Revolutionary Army. Who on our side should've cared what they thought? And why should you or I care what gun-grabbers think of our willingness (or in my case, unwillingness) to compromise today? I have a real hard time even thinking about compromising what our Founders bequeathed us as fundamental, unalienable rights. And that my friend, is imminently reasonable.\n \n \nWell if somebody's proven that they're going to go out and willfully murder people for absolutely no reason, they deserve to be locked up or put down.\n \n The people responsible for all the school massacres are sick individuals. I don't think they could be trusted no matter how much rehabilitation they're given.\n\n \n I can live with this clarification, but this is hardly how you put it when I responded to it. You didn't mention \"murderers,\" just \"criminals.\" I used to work with a guy that got busted for two joints back in '63 or '64. It wasn't enough for him to serve one year for each joint (that's right, TWO YEARS IN PRISON for two joints!), but he also lost his voting privileges and his fundamental, unalienable right to own a gun. For TWO JOINTS! These are the kinds of criminals I was responding on behalf of, not whacked out, murderous freaks. The people to whom you refer above should be deprived of their right to live, period, and that will take care of depriving them of their gun rights at the same time.\n \n \n\n Well what about a higher price for true machineguns than their semi-automatic cousins? People are willing to pay $1,000 for a new AR-15 (I know, I've seen 'em do it!) what about $2,500 for a new model M-16 made after 1986? Would that be more acceptable?\n\n \n Of course not! Why? What on Earth would that accomplish, other than artificially inflate the prices of inanimate objects that the government has no business regulating to begin with? You want only rich people to have *unalienable* rights? Are you really serious about this? \n \n \nActually there's a much larger difference between what I say and what the other side wanted. They advocated a total and outright ban on certain models based on nothing but cosmetic features. What I'm advocating is lessened restrictions until we're at a reasonable level that we can tolerate.\n\n \n Again, I ask you to please speak only for yourself. The Firearms Act of 1934 went well beyond what I am willing to \"tolerate.\" If the Heller case is decided that the 2nd is an individual right, that act will effectively be repealed, as well as the vast majority of gun control laws currently on the books. Would that be an \"unreasonable\" outcome for you? Would it be \"intolerable?\" \n \n With pro-gunners like this, who needs Sarah Brady?\n \n \nI'm in full support of the repealment of the machinegun ban, the machinegun importation ban, the handgun safety lock law, the \"sporting provision\" of the Gun Control Act and many other insane laws that are of no purpose. \n\n \n Right, as long as the government involves itself in the pricing of said weapons.\n \n \nThe laws I DO support are the ones that are supposed to actually make a difference and inhibit criminals more than honest citizens. \n\n \n And just exactly how are criminals inhibited by blanket laws that encompass law-abiding citizens within their unconstitutional mandates? How does charging a law-abiding citizen a premium for a small arm inhibit criminals? How on Earth does it inhibit them any more than the honest citizen? Criminals won't pay that premium, they'll just wait for ol' Honest Joe Citizen to buy one and steal it from him! Will Honest Joe at least get a refund from Uncle Sam for the difference between the \"criminal-inhibiting\" premium and what the gun should've cost to begin with? \n \n I'm stunned. Really. \n \n \nThe thing we have to remember is that the battle of gun control vs. gun rights is unlikely to be settled in one big bill that'll give us everything we want. We're going to have to compromise on what we want and what we get. Oftentimes we're going to need to settle for less than what we want in the short run, if in the long run we can get a total repeal.\n\n \n You really gotta take it easy with that \"we\" thing. I'm not going for a repeal of any bill. I'm in it for preserving The Constitution, all of it, and if Heller is decided correctly, repealing bills that the court just made unenforceable would be moot, wouldn't it? I honestly can't imagine how \"unreasonable\" you will see the 2nd Amendment if it's, well, upheld. \n \n I guess I gotta get out more. The forums that I frequent the most are those that are mostly populated by staunch supporters of an originalist view of The Constitution in general, and the 2nd Amendment specifically. Dare I say, WE don't molly-coddle gun-grabbers in hopes that we can dumb down the 2nd Amendment far enough for us to be viewed as \"reasonable.\" It either means what it says, or it means nothing. And if it means nothing, God help us, we don't have a snowball's chance in Hell of keeping any of the rest of it meaningful and enforceable.\n \n Seekerrr", 
   {}, 
   305555, 
   null, 
   1205470740.0
  ], 
  [
   305978, 
   null, 
   "bhbcu64", 
   "grider & seekerr,\n \n We gun control advocates will sit this one out by being on the sidelines with smiles on our faces.\n \n How about you two duel it out?\n \n Do pistols at ten paces sound good to you?\n \n Worked for Burr, Hamilton, and Old Hickory.", 
   {}, 
   305968, 
   null, 
   1205500260.0
  ], 
  [
   306001, 
   null, 
   "kesseltron", 
   "I believe that private citizens should be allowed to own cannons and mortars in most circumstances. The battles of Lexington and Concord, which initiated the revelutionary war, were fought in defense of armories containing cannons. This is significant on several levels. Firts of all, they were not fighting to defend an armory of small arms, because they kept those in their homes or they would bear them on their person. Next, it demonstrates how centralized armories are easy targets for the government in order to disarm the people. Further, it shows to importance of artillery in a revelutionary movement.\n \n Now, I understand that some modern cannons can do catastrophic damage, far too great a power to be trusted to any citizen. The question is: Where do we draw the line between private ownership of weapons and rouge citizens having access to wmd's?\n \n Machine guns and armor piercing bullets should be available to civilians, as both are used in the military by infantry. Acording to the miller decision, we need weapons in common use at the time. I would say that an m-16 would be considered pretty common at this time.", 
   {}, 
   305978, 
   null, 
   1205528460.0
  ], 
  [
   306013, 
   null, 
   "billsco", 
   "I believe that private citizens should be allowed to own cannons and mortars in most circumstances.\n\n \n What circumstances would you not allow a private citizen to own a cannon? \n \n \n \n Now, I understand that some modern cannons can do catastrophic damage, far too great a power to be trusted to any citizen. The question is: Where do we draw the line between private ownership of weapons and rouge citizens having access to wmd's?\n \n \n\n \n That doesn't seem to be the question at all. You state that there are too large of cannons that should not be in the possession of any citizen. But what if the cannons are stored in an armory?", 
   {}, 
   306001, 
   null, 
   1205536920.0
  ], 
  [
   306027, 
   null, 
   "Ghost Rider", 
   "I believe that \"realistically\" we have allowed Congress, presidents and the courts to engage in usurpation already. I am not willing to voluntarily concede more constitutional ground, and I am frankly disappointed when I see/hear gun-owners and self-proclaimed 2nd Amendment proponents offer such vast amounts of concessions simply to appear \"reasonable\" to those who would send our government to our homes to take our guns by force if they had that authority. To me, it's analogous to George Washington sending an envoy to Cornwallis' encampment at Yorktown to offer compromise on thoroughly trouncing him in the final battle because to do such would make the King and the people back in England think negatively of the Revolutionary Army. Who on our side should've cared what they thought? And why should you or I care what gun-grabbers think of our willingness (or in my case, unwillingness) to compromise today? I have a real hard time even thinking about compromising what our Founders bequeathed us as fundamental, unalienable rights. And that my friend, is imminently reasonable.\n\n \n Why should we care? Because the public is nothing but sheep and they're easily influenced. Public opinion speaks very loudly. No matter how loud gun owners yell, if the larger percentage of the population that doesn't own a gun speaks louder, the politicians will listen to them.\n \n \nI can live with this clarification, but this is hardly how you put it when I responded to it. You didn't mention \"murderers,\" just \"criminals.\" I used to work with a guy that got busted for two joints back in '63 or '64. It wasn't enough for him to serve one year for each joint (that's right, TWO YEARS IN PRISON for two joints!), but he also lost his voting privileges and his fundamental, unalienable right to own a gun. For TWO JOINTS! These are the kinds of criminals I was responding on behalf of, not whacked out, murderous freaks. The people to whom you refer above should be deprived of their right to live, period, and that will take care of depriving them of their gun rights at the same time.\n\n \n Alright I get the point! The trouble here is clarifying what type of criminal should be barred from possessing guns and what type shouldn't be. We've established the murders, those with genuine mental illnesses that render them dangerous to themselves and those around them. \n \n What about the other classes though, we need to clarify on who can be exempted and who can't be trusted.\n \n \nOf course not! Why? What on Earth would that accomplish, other than artificially inflate the prices of inanimate objects that the government has no business regulating to begin with? You want only rich people to have *unalienable* rights? Are you really serious about this?\n \n \n Actually it's up to the manufacturers to determine the price they want to charge for their product. Bushmaster charges $1,200 for their AR-15, DPMS charges $700. Why's this? Because. If a manufacturer can legally produce machineguns for civilian sale again then it's only logical to assume that they'd charge more for them than they would a semi-automatic version.\n \n \nAgain, I ask you to please speak only for yourself. The Firearms Act of 1934 went well beyond what I am willing to \"tolerate.\" If the Heller case is decided that the 2nd is an individual right, that act will effectively be repealed, as well as the vast majority of gun control laws currently on the books. Would that be an \"unreasonable\" outcome for you? Would it be \"intolerable?\"\n \n \n I highly doubt that the Heller case will lead to the repeal of many of the gun control laws on the books. I won't believe this until I actually see it in action.\n \n \nRight, as long as the government involves itself in the pricing of said weapons.\n\n \n Wrong.\n \n \nAnd just exactly how are criminals inhibited by blanket laws that encompass law-abiding citizens within their unconstitutional mandates? How does charging a law-abiding citizen a premium for a small arm inhibit criminals? How on Earth does it inhibit them any more than the honest citizen? Criminals won't pay that premium, they'll just wait for ol' Honest Joe Citizen to buy one and steal it from him! Will Honest Joe at least get a refund from Uncle Sam for the difference between the \"criminal-inhibiting\" premium and what the gun should've cost to begin with?\n \n \n LOOK! I'm sorry if I'm not coming off as the perfect spokesman for the Second Amendment! I'm not the expert in this!\n \n \nI guess I gotta get out more. The forums that I frequent the most are those that are mostly populated by staunch supporters of an originalist view of The Constitution in general, and the 2nd Amendment specifically. Dare I say, WE don't molly-coddle gun-grabbers in hopes that we can dumb down the 2nd Amendment far enough for us to be viewed as \"reasonable.\" It either means what it says, or it means nothing. And if it means nothing, God help us, we don't have a snowball's chance in Hell of keeping any of the rest of it meaningful and enforceable.\n\n \n Gun owners can't afford to project the image of being the type of religiously uphold the belief of \"Anything short of a repealment of every last gun control law on the books is completely unacceptable!\" If we come off as extremists we'll be ignored and get nowhwere.\n \n The politician in me says that for gun owners to get the final say in the matter, they're gonna have to conform to what the majority of Americans define as \"reasonable\". That doesn't mean we should support gun control bills, but it means that it's bad public relations to try and push for everything we want all at once.\n \n Do you honestly believe that gun owners would have any chance at all of getting a bill pushed through that would literally repeal every last single gun control law in the entire nation?", 
   {}, 
   305968, 
   null, 
   1205550600.0
  ], 
  [
   306028, 
   null, 
   "Seekerrr", 
   "grider & seekerr,\n \n We gun control advocates will sit this one out by being on the sidelines with smiles on our faces.\n \n How about you two duel it out?\n \n Do pistols at ten paces sound good to you?\n \n Worked for Burr, Hamilton, and Old Hickory.\n\n \n Why are you being such a vapid little troll? Have you never had a point of contention with someone who is generally on your side of a given issue? I am not on your side of anything I've seen from you so far, but still I tried to find something you said that I could agree with. But here, you don't agree or disagree, instead you just try to foment discord between two people trying to have a civil conversation. \n \n Maybe we can agree on one thing here; I believe there should be strict troll-control on forums. How about you Troll?", 
   {}, 
   305978, 
   null, 
   1205551200.0
  ], 
  [
   306029, 
   null, 
   "bhbcu64", 
   "seekerr,\n \n But here, you don't agree or disagree, instead you just try to foment discord between two people trying to have a civil conversation.\n \n Sorry, Jack, but I'm not fomenting anything.\n \n You and the grider are having quite a set-to; we're just sitting back, watching, and grinning.\n \n I hope you do enjoy the cannon that that old gun-grabber ghost rider is trying to snatch from your cold, dead hands.:)", 
   {}, 
   306028, 
   null, 
   1205552040.0
  ], 
  [
   306031, 
   null, 
   "Ghost Rider", 
   "Sorry, Jack, but I'm not fomenting anything.\n\n \n I agree with Seeker, you're definitely a troll.\n \n \nYou and the grider are having quite a set-to; we're just sitting back, watching, and grinning.\n\n \n You're the one who started it!\n \n \nI hope you do enjoy the cannon that that old gun-grabber ghost rider is trying to snatch from your cold, dead hands.:)\n\n \n I'm not the one advocating bans. I'm simply trying to sort through everything to arrive at the best possible conclusion, at this point in time. The long term battle will require somebody to compromise on points, we've got to accept that. Politics is full of compromises, and if you're not willing to make them then you get screwed.", 
   {}, 
   306029, 
   null, 
   1205552940.0
  ], 
  [
   306039, 
   null, 
   "Seekerrr", 
   "Ghost Rider, first let me say that I apologize for the reference to you being similar to Sarah Brady. A bit of hyperbole never really hurt anyone, but it does tend to detract from the main message I was trying to get across to you. In my first post directed to you I responded only to what you said. I didn't take anything out of context or engage in trying to belittle you, just told you where I took issue with what you were saying. The crux of the issue for me is the \"we\" thing. I feel when you use that word so often and so matter-of-factly, that you are trying to speak for people, myself included, for whom you don't have the right. Really, it's not as much that you don't have the right as it is that you don't have the knowledge to make such unequivocal statements in a way that makes it appear that you're speaking for other folks. Maybe I'm being a bit nit-picky, but I can't help it, I do prefer to speak for myself and to make my own case for the issues that I'm passionate about. This is obviously one of those issues.\n \n With that said, I'll try to answer your current post to the best of my ability, without getting carried away with hyperbole.\n \n \nWhy should we care? Because the public is nothing but sheep and they're easily influenced. Public opinion speaks very loudly. No matter how loud gun owners yell, if the larger percentage of the population that doesn't own a gun speaks louder, the politicians will listen to them.\n\n \n Oh, no disagreement here at all. The difference though in how you're looking at the issue and how I am is that you're allowing politicians to control the outcome, whatever it might be, while I am demanding that courts reign in those same politicians and make them live by the law that they're sworn to uphold. I focused on Heller because I honestly believe it is our last, best hope to restore the 2nd Amendment to its unequivocal, unambiguous, unalienable glory. Maybe not the \"last\" hope, but certainly it will be a looooooong wait before another court is seated with a Chief Justice that has the cajones to take on an issue that the SCOTUS has been avoiding like the plague for our entire history as a nation. This case is monumentally historical, both in its potential to strengthen the 2nd Amendment or to make it totally meaningless to us as individuals. We've been waiting for 230 years for this! Now is not the time for compromise and/or equivocation, it's time for citizens to rise and demand that the court finally uphold the promise of The Constitution and of the birthright that hundreds of thousands revolutionary patriots fought to guarantee to every citizen. They fought to codify it in law that was meant to serve us in perpetuity in the greatest document ever written by man. Yeah, it's heady stuff. Hifalutin as all get-out, but this is where I'm coming from, and sheeple or no sheeple, politicians or no politicians, I refuse to sully the memory of these great men by buckling under to usurpers who I know in my heart of hearts are wrong, and whom I believe to my core do not have the preservation of individual freedom as their motivation.\n \n \nAlright I get the point! The trouble here is clarifying what type of criminal should be barred from possessing guns and what type shouldn't be. We've established the murders, those with genuine mental illnesses that render them dangerous to themselves and those around them. \n \n What about the other classes though, we need to clarify on who can be exempted and who can't be trusted.\n\n \n I don't \"need\" to clarify my thoughts on this score in the context of this discussion. I do need to get across that I don't want anyone speaking or clarifying for me, and that's really my only bone of contention with you directly. I don't begrudge you your right to come to your own conclusions about this or any other issue, even if I vehemently disagree with you. I just am asking that you present your views that way; as your views, and leave me and the millions of gun-owners and 2A activists that you can't possibly know the accuracy of including them in whatever \"we\" you perceive to be talking about, out of it. Fair 'nuff?\n \n \nActually it's up to the manufacturers to determine the price they want to charge for their product. Bushmaster charges $1,200 for their AR-15, DPMS charges $700. Why's this? Because. If a manufacturer can legally produce machineguns for civilian sale again then it's only logical to assume that they'd charge more for them than they would a semi-automatic version.\n\n \n Wait a minute GR, this is not at all how you brought up the idea of \"charging more\" for machine guns. Here's how that exchange went:\n \n \nSeekerrr said:\n And a \"more involved process\" for buying a machine gun than for other guns? You're playing right into the Brady mindset. You claim you're against bans on \"assault weapons,\" and even put the fear-mongering phrase in quotes to emphasize the ludicrousness of it (I presume), but want the government to decide if you're able to buy or own one legally?\n\n \n And your reply to that, precisely as quoted, was:\n \n \nGhost Rider said in reply:\n Well what about a higher price for true machineguns than their semi-automatic cousins? People are willing to pay $1,000 for a new AR-15 (I know, I've seen 'em do it!) what about $2,500 for a new model M-16 made after 1986? Would that be more acceptable?\n\n \n You're clearly asking me if I would find it more acceptable to impose some kind of extra charge in lieu of giving the government the power to pick and choose which small-arms weapons you're allowed to keep and bear. At least, I don't see how to read it any other way. Now, if you wish to retract that idea, that's fine with me, but the way you presented it included nothing about market forces which you are saying is what you were talking about now.\n \n \nI highly doubt that the Heller case will lead to the repeal of many of the gun control laws on the books. I won't believe this until I actually see it in action.\n\n \n If the court finds that the 2A is indeed an individual, unalienable right which shall not be infringed, then how do states that impose 7 or 14 day waiting periods get around that \"shall not be infringed\" part? The court will have a choice if it finds in our favor on the individual vs. collective right issue; either include everything that can be legally construed as infringement within the Heller ruling (which is what I predict they will do), or commit lower courts and themselves to years and years, probably decades, maybe even a century or so, of civil right suit after civil right suit challenging every single law that can be made to appear as an infringement of the right to keep and bear arms in even the most insignificant, inconsequential or tangential way.\n \n This case is HUGE GR. As a gun-owner and/or strong 2nd Amendment advocate, its importance cannot be overstated, and I do believe it has the potential to render a slew of local, state and federal laws null and void. Or, in American legal parlance, unconstitutional.\n \n \nWrong.\n\n \n I don't even remember what this was in response to, and I don't feel like going back to find out, so I'll cede the point, whatever it was. But hey, this wouldn't be the first time I was wrong......I was wrong once before......I thought I was wrong and I wasn't! ;) \n \n \nLOOK! I'm sorry if I'm not coming off as the perfect spokesman for the Second Amendment! I'm not the expert in this!\n\n \n Hey, no big problem really. But you kind of reinforce my main point here; if you're not an expert, refrain from lumping \"us\" all in your conclusions by asserting that \"we\" are unified in them. That's all I was trying to say.\n \n \nGun owners can't afford to project the image of being the type of religiously uphold the belief of \"Anything short of a repealment of every last gun control law on the books is completely unacceptable!\" If we come off as extremists we'll be ignored and get nowhwere.\n\n \n Again, I am not lobbying Congress or my state or my city to repeal anything. I'm encouraging, in the strongest terms I know, the SCOTUS to uphold the supreme law of the land. The \"strongest terms I know\" are nothing more than repeating at every opportunity, my strong and deeply-held conviction that The Constitution means what it says, that The Federalist Papers do a great job of displaying what the Founding Fathers had in mind for every right delineated within the subsequent constitution, and that the simplest, and yet most courageous thing today's Supreme Court can do is rule according to the precepts unequivocally-stated in those documents and publications. I am not asking the court to be activist, I am asking them to do their duty to their oath, and take back the authority to decide and rule on what The Constitution means from a run amok Congress and Executive, and to rule on it as it is written and with full confidence in their knowledge that they know what the Framers intended it to mean.\n \n In post-Constitution-ratification days, I would've been seen as the most liberal of Americans because I would've supported our hard-fought liberation from England. Today I am seen as a right-wing nutjob because, well, I still support our liberation from England, but I deign to support the preservation of the document that cemented the finalization of that separation to boot, and that's the rub. If I am labeled a \"right-wing nutjob\" by the likes of people who would demand of their Congress and President that The Constitution be changed, contorted and ruined by legislative fiat, I wear that label as a badge of honor. I want nothing repealed. I only want The Constitution upheld.\n \n \nThe politician in me says that for gun owners to get the final say in the matter, they're gonna have to conform to what the majority of Americans define as \"reasonable\". That doesn't mean we should support gun control bills, but it means that it's bad public relations to try and push for everything we want all at once.\n \n Do you honestly believe that gun owners would have any chance at all of getting a bill pushed through that would literally repeal every last single gun control law in the entire nation?\n\n \n Well, if there really is a politician in you, then my views are probably stepping pretty heavily on your toes. I hope you can see where I'm coming from now though. No, I don't think a bill can accomplish restoring what it took 13 years and hundreds of thousands of patriot-lives to create, but the right court ruling can. Of course, this same ruling has the potential to make my views obsolete too. For me there is no middle-ground. I find nothing \"reasonable\" about 9 unelected men and women in black robes \"ruling\" that the 2nd Amendment doesn't mean what every signatory to The Constitution knew it to mean. If that happens, this discussion will be completely moot because America, for all intents and purposes, will then be dead.\n \n Seekerrr", 
   {}, 
   306027, 
   null, 
   1205560080.0
  ], 
  [
   306076, 
   null, 
   "Ghost Rider", 
   "Oh, no disagreement here at all. The difference though in how you're looking at the issue and how I am is that you're allowing politicians to control the outcome, whatever it might be, while I am demanding that courts reign in those same politicians and make them live by the law that they're sworn to uphold. I focused on Heller because I honestly believe it is our last, best hope to restore the 2nd Amendment to its unequivocal, unambiguous, unalienable glory. Maybe not the \"last\" hope, but certainly it will be a looooooong wait before another court is seated with a Chief Justice that has the cajones to take on an issue that the SCOTUS has been avoiding like the plague for our entire history as a nation. This case is monumentally historical, both in its potential to strengthen the 2nd Amendment or to make it totally meaningless to us as individuals. We've been waiting for 230 years for this! Now is not the time for compromise and/or equivocation, it's time for citizens to rise and demand that the court finally uphold the promise of The Constitution and of the birthright that hundreds of thousands revolutionary patriots fought to guarantee to every citizen. They fought to codify it in law that was meant to serve us in perpetuity in the greatest document ever written by man. Yeah, it's heady stuff. Hifalutin as all get-out, but this is where I'm coming from, and sheeple or no sheeple, politicians or no politicians, I refuse to sully the memory of these great men by buckling under to usurpers who I know in my heart of hearts are wrong, and whom I believe to my core do not have the preservation of individual freedom as their motivation.\n\n \n Here's the problem with that Seeker. The Supreme Court currently has four judges that supposedly support the individual rights idea, four that don't, and one guy who can vote either way. There's no guarantee that the outcome will be in our favor, meaning that there's a need to keep all options open in case of another bad ruling coming to the light of day.\n \n The Supreme Court has ruled in the past that blacks aren't citizens and not subject to the rights in the Bill of Rights, and they've ruled that women have a right to have an abortion. Many have disagreed with these rulings, we need to keep in mind that such a ruling very well could come down the pike.\n \n \nI don't \"need\" to clarify my thoughts on this score in the context of this discussion. I do need to get across that I don't want anyone speaking or clarifying for me, and that's really my only bone of contention with you directly.\n \n \n Alright I get the picture!\n \n \nWait a minute GR, this is not at all how you brought up the idea of \"charging more\" for machine guns. Here's how that exchange went:\n\n \n I have difficulty expressing myself in the way I'd like to. I try to say one thing but it doesn't always come out right and comes off as something different. The last thing I want to do is let politicians have anymore say over the people who got them there.\n \n \nIf the court finds that the 2A is indeed an individual, unalienable right which shall not be infringed, then how do states that impose 7 or 14 day waiting periods get around that \"shall not be infringed\" part? The court will have a choice if it finds in our favor on the individual vs. collective right issue; either include everything that can be legally construed as infringement within the Heller ruling (which is what I predict they will do), or commit lower courts and themselves to years and years, probably decades, maybe even a century or so, of civil right suit after civil right suit challenging every single law that can be made to appear as an infringement of the right to keep and bear arms in even the most insignificant, inconsequential or tangential way.\n \n This case is HUGE GR. As a gun-owner and/or strong 2nd Amendment advocate, its importance cannot be overstated, and I do believe it has the potential to render a slew of local, state and federal laws null and void. Or, in American legal parlance, unconstitutional.\n\n \n I'm very aware of how big this case is, I know exactly what's riding on it. However my position is that I don't believe that simply ruling the Second Amendment to be an individual right is going to wipe out 74 years of bad legislation. For that to happen the SCJs would have to determine that not only is the right individual in nature, but also that \"shall not be infringed\" translates into \"no law, restriction or regulation may ever be passed for any reason\" and I just can't forsee that ever happening.\n \n \nI don't even remember what this was in response to, and I don't feel like going back to find out, so I'll cede the point, whatever it was. But hey, this wouldn't be the first time I was wrong......I was wrong once before......I thought I was wrong and I wasn't! ;)\n\n \n You'd accused me of wanting the government to set the price on new make and model machineguns.\n \n \nHey, no big problem really. But you kind of reinforce my main point here; if you're not an expert, refrain from lumping \"us\" all in your conclusions by asserting that \"we\" are unified in them. That's all I was trying to say.\n\n \n Alright!\n \n \nAgain, I am not lobbying Congress or my state or my city to repeal anything. I'm encouraging, in the strongest terms I know, the SCOTUS to uphold the supreme law of the land. The \"strongest terms I know\" are nothing more than repeating at every opportunity, my strong and deeply-held conviction that The Constitution means what it says, that The Federalist Papers do a great job of displaying what the Founding Fathers had in mind for every right delineated within the subsequent constitution, and that the simplest, and yet most courageous thing today's Supreme Court can do is rule according to the precepts unequivocally-stated in those documents and publications. I am not asking the court to be activist, I am asking them to do their duty to their oath, and take back the authority to decide and rule on what The Constitution means from a run amok Congress and Executive, and to rule on it as it is written and with full confidence in their knowledge that they know what the Framers intended it to mean.\n\n \n Good luck with that. In today's world that's gonna be damn difficult.\n \n \nWell, if there really is a politician in you, then my views are probably stepping pretty heavily on your toes. I hope you can see where I'm coming from now though. No, I don't think a bill can accomplish restoring what it took 13 years and hundreds of thousands of patriot-lives to create, but the right court ruling can. Of course, this same ruling has the potential to make my views obsolete too. For me there is no middle-ground. I find nothing \"reasonable\" about 9 unelected men and women in black robes \"ruling\" that the 2nd Amendment doesn't mean what every signatory to The Constitution knew it to mean. If that happens, this discussion will be completely moot because America, for all intents and purposes, will then be dead.\n\n \n The politician side of myself says that options are needed and that all bases and angles need to be addressed and covered. If the Heller case goes south, then we're gonna need to bring out the proverbial big guns. What we'd need in the event of a bad ruling is enough public outcry to make congress feel compelled (read scared s**tless) enough to pass a new amendment to the constitution, clarifying that the right of the people to keep and bear arms is not military in nature and is truly an indivudal right.", 
   {}, 
   306039, 
   null, 
   1205619900.0
  ], 
  [
   306109, 
   null, 
   "Seekerrr", 
   "Here's the problem with that Seeker. The Supreme Court currently has four judges that supposedly support the individual rights idea, four that don't, and one guy who can vote either way. There's no guarantee that the outcome will be in our favor, meaning that there's a need to keep all options open in case of another bad ruling coming to the light of day.\n \n The Supreme Court has ruled in the past that blacks aren't citizens and not subject to the rights in the Bill of Rights, and they've ruled that women have a right to have an abortion. Many have disagreed with these rulings, we need to keep in mind that such a ruling very well could come down the pike.\n\n \n You haven't shown any problem with my rationale that I haven't already accounted for in some way or other. I have predicated all of my predictions with, \"IF the ruling goes our way.....\" If it doesn't, then yeah, obviously none of my predictions or hopes, or fantasies if you prefer, will come true. I realize that, but I prefer to think in terms of the ruling going our way. \n \n I would much prefer that Ginsberg or another one of the dried up ol' farts with more communist....er, I mean, more socialist.... uh, wait, more flaming liberal leanings would retire before HillBill or Obama worm their way into office, but on the other hand, I find it hard to believe that a majority of that august body will lack so much conscience as to totally ignore what the 2A says, or what is extremely easy to prove the authors of it meant it to protect. Constitutionally-speaking, even the Supreme Court does not have that authority, though admittedly, I don't have a clue how we might enforce that truism if they detour even further from original intent than they have already. As I said in my last closing line, if that be the outcome, I will consider our form of government dead. At the very least, it will have been overthrown from within, an ideological, judicial coup, the very reason the Founders put the 2nd in there in the first place, and there will be nothing we can do about it because just as soon as that ruling is made that way, they will be coming for our guns. Mark my words. After that ruling, even talking about it being an illegal one might constitute sedition, or some knucklehead like John McCain will assert it as such and pass another law like McCain/Feingold, and how on Earth we could have confidence that the 1st Amendment will be upheld shortly after the 2nd being completely obliterated is well beyond my ability to maintain even the slightest glimmer of hope for.\n \n \nI'm very aware of how big this case is, I know exactly what's riding on it. However my position is that I don't believe that simply ruling the Second Amendment to be an individual right is going to wipe out 74 years of bad legislation. \n\n \n And that's fine, you're welcome to that belief. We simply disagree. I don't see how such a ruling couldn't wipe out an awful lot of those laws though, being as Congress has had free reign to disregard the individual-right aspect of the 2nd by an absentee court on the issue. This is really the first time in our history that it is being constitutionally tested in a full and comprehensive way, and as such, we, or more importantly, the Congress and the courts haven't had guidance on the issue from past decisions. \n \n My train of thought is pretty elementary; if the ruling goes our way, that means that the court took notice of a large dose of original intent. Once the threshold of original intent has been crossed, and it becomes the basis for ruling the right an individual one, how much of a leap is it to rule likewise that all of the laws that ignored the 2nd's status as a protected indivdual right by putting heavy restrictions on the free exercise of it would then be unconstitutional? Personally, I don't see how those laws could stand, but hey, maybe I'm mistaken and you're right. We may get the opportunity to find out, but we may not.\n \n \nFor that to happen the SCJs would have to determine that not only is the right individual in nature, but also that \"shall not be infringed\" translates into \"no law, restriction or regulation may ever be passed for any reason\" and I just can't forsee that ever happening.\n\n \n Is that what you think I'm saying? I do believe that most subsequent laws passed after a successful Heller ruling will be challenged in court by one side or the other, and as such, some will stand and some will be deemed unconstitutional. I tend to think the major point of contention will be around defining the word \"arms,\" but whatever, of course there will be subsequent laws. The difference being that they will have to be written within the parameters that the ruling dictates, something that has not been the case for our entire history, except of course, for the short period of time after ratification when all of the founders were still alive and still active in government and would decisively repel any attempted weakening of any part of their brainchild, The Constitution. But for at least 200 years, Congress has been left to interpret the 2nd Amendment as they wished, and 20,000+ laws on the books that have never been constitutionally tested is the consequence of SCOTUS' abdication of their responsibilities. Surely an affirmative ruling in Heller would have a significant effect on a lot of those laws, no? I just can't envision how it wouldn't, but again, you might be right.\n \n \nYou'd accused me of wanting the government to set the price on new make and model machineguns.\n\n \n Umm....No, I believe I responded directly to something you said, which, in this post, you admit was not clearly-stated. (shrug)\n \n \nSeekerrr said:\n Again, I am not lobbying Congress or my state or my city to repeal anything. I'm encouraging, in the strongest terms I know, the SCOTUS to uphold the supreme law of the land. The \"strongest terms I know\" are nothing more than repeating at every opportunity, my strong and deeply-held conviction that The Constitution means what it says, that The Federalist Papers do a great job of displaying what the Founding Fathers had in mind for every right delineated within the subsequent constitution, and that the simplest, and yet most courageous thing today's Supreme Court can do is rule according to the precepts unequivocally-stated in those documents and publications. I am not asking the court to be activist, I am asking them to do their duty to their oath, and take back the authority to decide and rule on what The Constitution means from a run amok Congress and Executive, and to rule on it as it is written and with full confidence in their knowledge that they know what the Framers intended it to mean. \n\n \n \nGhost Rider said in response:\n Good luck with that. In today's world that's gonna be damn difficult.\n\n \n Huh? So you think it's next to impossible to get The Supreme Court of The United states of America to consider their duty under The Constitution? If it's that difficult, then maybe this country is already dead. Certainly getting 5 people to see things through a constitutional prism is easier than getting 535 politicians using their votes mostly for pandering to special interests to see it that way, isn't it? But wait, I guess the following answers my question:\n \n \nThe politician side of myself says that options are needed and that all bases and angles need to be addressed and covered. If the Heller case goes south, then we're gonna need to bring out the proverbial big guns. What we'd need in the event of a bad ruling is enough public outcry to make congress feel compelled (read scared s**tless) enough to pass a new amendment to the constitution, clarifying that the right of the people to keep and bear arms is not military in nature and is truly an indivudal right.\n\n \n I've got news for ya my friend, if Heller is decided against the individual right, the 2nd Amendment is dead. There's no coming back from that decision because it means that not only the uninformed masses and a Congress that has already proven its disdain for constitutional limits on its power didn't care about the meaning of The Constitution, but the SCOTUS will have proven they have signed onto the same seditious, traiterous anti-American mindset. That would be the coup de gras to The Constitution. The Grand Finale to the American dream of an enduring representative republic. A dead 2nd Amendment is a dead Constitution is a dead America. \n \n I can't believe that anyone could really think that today's Congress would go all conservative on the court and restore the 2nd Amendment after the court had basically repealed it. That would be the net result of a wrong decision in Heller, wouldn't you agree? \n \n I am also incredulous as to how you consider it almost impossible to expect the court to follow its duty, but you think Congress will do their job for them if we just threaten not to vote for them and make a lot of noise. Unless you are referring to actual \"big guns\" rather than figurative ones, that's what I'm getting from your two previous quotes.\n \n Seekerrr", 
   {}, 
   306076, 
   null, 
   1205637660.0
  ], 
  [
   306119, 
   null, 
   "Ghost Rider", 
   "And that's fine, you're welcome to that belief. We simply disagree. I don't see how such a ruling couldn't wipe out an awful lot of those laws though, being as Congress has had free reign to disregard the individual-right aspect of the 2nd by an absentee court on the issue. This is really the first time in our history that it is being constitutionally tested in a full and comprehensive way, and as such, we, or more importantly, the Congress and the courts haven't had guidance on the issue from past decisions.\n \n \n Well I still fail to see how determining the Second Amendment is an individual right would do something like wipe out the National Firearms Act of 1934, which focused on the reclassifying of certain firearms and setting up minimum/maximum measurements.\n \n How exactly do you forsee the decision that the right is individual, making all these other laws go away? The First Amendment is an indivudal right but you've still gotta file for a permit before you can form a public gathering.\n \n \nIs that what you think I'm saying?\n\n \n Yeah that's what I was interpreting as your saying.\n \n \nHuh? So you think it's next to impossible to get The Supreme Court of The United states of America to consider their duty under The Constitution?\n\n \n Well where the hell have they been during the reign of the Patriot Act? What about the guantanomo bay detainees? Where's the Supreme Court been on these issues? Why have they remained silent or even upheld these gross violations of our rights?\n \n \nI am also incredulous as to how you consider it almost impossible to expect the court to follow its duty, but you think Congress will do their job for them if we just threaten not to vote for them and make a lot of noise. Unless you are referring to actual \"big guns\" rather than figurative ones, that's what I'm getting from your two previous quotes.\n\n \n Again, why haven't they upheld their duty in the post-911 era that we live in?\n \n We now live in a time where police and the government can obtain any records for any reason without first obtaining a search warrant from a judge. You can be detained without legal council, we've got warantless eavsdropping going on. And what are the Supreme Court justices doing about it? NOTHING!\n \n If they won't do anything about these violations of the 4th Amendment, I have my doubts that they'll really feel all that much of an obligation to get a Second Amendment issue correct.", 
   {}, 
   306109, 
   null, 
   1205646840.0
  ], 
  [
   306125, 
   null, 
   "kesseltron", 
   "Actually, some parts of the patriot act were recently repealed on constitutional grounds. I say: \"GREAT!\"", 
   {}, 
   306119, 
   null, 
   1205649660.0
  ], 
  [
   306134, 
   null, 
   "Ghost Rider", 
   "Actually, some parts of the patriot act were recently repealed on constitutional grounds. I say: \"GREAT!\"\n\n \n Care to supply the proof of this? Because last time I checked the Patriot Act was expanded and made permanent.", 
   {}, 
   306125, 
   null, 
   1205679120.0
  ], 
  [
   306140, 
   null, 
   "Seekerrr", 
   "Well, obviously I was mistaken about the political leanings of the person I was talking to. I know how forums are supposed to work and I will respect the standard ettiquette by not going totally off-topic and responding to issues which have absolutely nothing to do with gun control or the tenor of this specific thread. I'm done here.\n \n Seekerrr", 
   {}, 
   306134, 
   null, 
   1205684400.0
  ], 
  [
   306152, 
   null, 
   "Ghost Rider", 
   "We just spent countless posts poking numerous holes in BS' position of how the phrase \"Congress shall make no laws\" means \"No law may ever be passed, for any reason, under any circumstances\" and how no right is ever absolute or without some scope of magnitude, and explaining that if that were what the Founding Fathers meant then they would've ensured that no government was ever allowed to come into formation.\n \n You actually have the nerve to be upset with me, when I say that I fail to see how the determination that the Second Amendment is an individual right, would actually eradicate 74 years of gun control laws, wiping the National Firearms Act of 1934, the Gun Control Act of 1968, the machinegun ban of 1986, and countless other legislation right off the books?\n \n You have quite a bit of nerve, you know that? None of the other rights enjoy such wide reaching scope and magnitude, it's ludicrous to assume that such would be different here. For that to happen the Supreme Court would have to determine that the Second Amendment protects a right that's absolute in terms of scope and that no limitation can ever be passed on it, opening up the debate for whether or not a person can legally own modern nuclear warheads and WMDs.", 
   {}, 
   306140, 
   null, 
   1205697840.0
  ], 
  [
   306182, 
   null, 
   "Seekerrr", 
   "I'm not upset with you at all GR. And I thought that it would be blatantly obvious that I wasn't referring to your take on Heller or gun-control in general when I tried to bow out gracefully from this conversation by saying I would respect forum etiquette by not responding to off-topic banter. I was referring to your off-topic rantings about the notion that Guantanamo prisoners are entitled to 4th Amendment protections. That's an absurd example of how *our* 4th Amendment rights have been....how did you put it....oh yeah, \"grossly violated.\" \n \n I don't have any particular problem with my government listening in on suspected terrorists calling into this country, even if they are talking to a US citizen. In fact, of all the problems I have with today's government, that is one of the very few things that they're doing that I believe is a major tenant of their job description; protect the country from violent enemies. If you're talking to suspected terrorists, I contend that law enforcement's duty is to monitor those kinds of communications, and that foreigners should have no expectation of privacy when calling into our country to plot against us. It's pretty basic stuff, and I don't think it takes a constitutional scholar to understand the prudence or legality of monitoring the communications of people whom we know want to kill us. I'm at a loss to understand a US citizen's mindset that would argue, on constitutional grounds(???), against that premise. So I refrained from getting into it with you here in this gun-control topic.\n \n I'm no big fan of the Patriot Act, but it's completely off-topic to this discussion, so I refrained from commenting, pro or con, on your bringing it up. Big deal, get over it already.\n \n So now you've whined loud enough to goad me into ignoring forum decorum and comment on your off-topic rant. Do you feel any better? I don't, and so I'll take my own advice to myself and say, again, I'm done here. I tried to be nice to you. I tried to just tell you my thoughts without minimizing or degrading the ones you expressed. I allowed for the possibility that you were right and I am wrong. Imagine the nerve of me for doing that! My conclusion? You're impossible to have a calm, on-topic conversation with, so have at it in this thread however you wish from this point on, but just do it without me.\n \n AMF,\n \n Seekerrr", 
   {}, 
   306152, 
   null, 
   1205708580.0
  ], 
  [
   306256, 
   null, 
   "Ghost Rider", 
   "Another misunderstanding then...\n \n \nI was referring to your off-topic rantings about the notion that Guantanamo prisoners are entitled to 4th Amendment protections. That's an absurd example of how *our* 4th Amendment rights have been....how did you put it....oh yeah, \"grossly violated.\"\n \n \n I was under the belief that we had American citizens detained there as well.\n \n \nI don't have any particular problem with my government listening in on suspected terrorists calling into this country, even if they are talking to a US citizen.\n\n \n I do, because absolutely anything can turn you into a suspected terrorist. That's why we're fighting so hard to never let the bill that would allow the Attorney General to deny firearms ownership to suspected terrorist individuals.\n \n There's no guidelines for what makes someone qualify as a suspected terrorist, there's no way of knowing when you get on the list, there's no way of getting off the list. You're branded a suspected terrorist for life and there's no oversight on it.\n \n \nIn fact, of all the problems I have with today's government, that is one of the very few things that they're doing that I believe is a major tenant of their job description; protect the country from violent enemies. If you're talking to suspected terrorists, I contend that law enforcement's duty is to monitor those kinds of communications, and that foreigners should have no expectation of privacy when calling into our country to plot against us. It's pretty basic stuff, and I don't think it takes a constitutional scholar to understand the prudence or legality of monitoring the communications of people whom we know want to kill us. I'm at a loss to understand a US citizen's mindset that would argue, on constitutional grounds(???), against that premise. So I refrained from getting into it with you here in this gun-control topic.\n\n \n Just remember that \"in the name of protecting the country from violent enemies\" politicians want to pass a bill that will ban gun ownership to anybody whose name is in the suspected terrorist watchlist. And you don't get informed of why you were denied, so that's a constitutional violation.\n \n The whole point of this off-angle tangent was to point out that the Supreme Court hasn't stepped in and done their duty to rule any other terrorist-era rights violation as unconstitutional, so they're obviously not doing their job. So I just find it unlikely that they'd feel some great compulsion to change their style of working with the Heller case.", 
   {}, 
   306182, 
   null, 
   1205775000.0
  ], 
  [
   306843, 
   null, 
   "Shooterandproud", 
   "Well that was a good start. Are you planning on insulting everyone who replies to your post?\n \n Of course it would be more difficult for criminals to get hold of guns if there were fewer of them around. It would also make it more difficult for children to get hold of them, or feuding neighbours who, on the spur of the moment, think that waving a gun around might bring about a solution to their problems.\n \n If you don't think you're going to like the answers to your question, then don't ask the question.\n \n Smiley\n\n \n Did the Prohibition stop drinking? Did the drug war stop smoking? What makes you think it is different with guns?", 
   {}, 
   299268, 
   null, 
   1206566640.0
  ], 
  [
   306876, 
   null, 
   "Ghost Rider", 
   "The insults are reserved only for those that make a stupid argument.", 
   {}, 
   306843, 
   null, 
   1206631680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A question for supporters of gun control", 
  "url": "http://www.4forums.com/political/gun-control-debates/10871-question-supporters-gun-control.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 10871, 
  "discussion_files": [
   [
    "29479.html", 
    "http://www.4forums.com/political/gun-control-debates/10871-question-supporters-gun-control-print.html"
   ], 
   [
    "29480.html", 
    "http://www.4forums.com/political/gun-control-debates/10871-question-supporters-gun-control-9-print.html"
   ], 
   [
    "29481.html", 
    "http://www.4forums.com/political/gun-control-debates/10871-question-supporters-gun-control-7-print.html"
   ], 
   [
    "29482.html", 
    "http://www.4forums.com/political/gun-control-debates/10871-question-supporters-gun-control-5-print.html"
   ], 
   [
    "29483.html", 
    "http://www.4forums.com/political/gun-control-debates/10871-question-supporters-gun-control-4-print.html"
   ], 
   [
    "29484.html", 
    "http://www.4forums.com/political/gun-control-debates/10871-question-supporters-gun-control-6-print.html"
   ], 
   [
    "29485.html", 
    "http://www.4forums.com/political/gun-control-debates/10871-question-supporters-gun-control-8-print.html"
   ], 
   [
    "29486.html", 
    "http://www.4forums.com/political/gun-control-debates/10871-question-supporters-gun-control-3-print.html"
   ], 
   [
    "29487.html", 
    "http://www.4forums.com/political/gun-control-debates/10871-question-supporters-gun-control-2-print.html"
   ]
  ], 
  "identifier": 10871
 }
]