[
 [
  [
   299702, 
   null, 
   "foundit66", 
   "School Suggests Students Who Support Gay Rights Are an \"Illegal Organization\"\n \n PONCE DE LEON, FL - A Florida high school has been trampling the First Amendment rights of students who support equal rights for gay people, according to a federal lawsuit filed today by the American Civil Liberties Union. In its lawsuit, the ACLU described an atmosphere of fear and censorship at Ponce de Leon High School, where the school board's attorney says even expressions like a rainbow sticker may mean students are members of an \"illegal organization.\"\n \n \"All any of us wants to do is be able to talk about gay rights issues without having to be scared,\" said Heather Gillman, a 16-year-old junior at the school. \"Nobody should have to worry about being kicked out of school just for having a rainbow sticker on your notebook.\"\n \n The ACLU sent a letter in November to the school board's attorney on behalf of Gillman, asking for clarification as to whether a variety of symbols and slogans, such as the rainbow flag or \"I support my gay friends,\" would be allowed at the school. The school district replied that it would not allow any expressions of support for gay rights at all because such speech would \"likely be disruptive.\" The district then went even further, claiming that such symbols and slogans were signs that students were part of a \"secret/illegal organization.\"\n \n The letter was sent after Gillman and other students approached the ACLU about an atmosphere in which students say they were routinely intimidated by school officials for things like writing \"gay pride\" on their arms and notebooks or wearing rainbow-themed clothing. According to students, problems began in September when a lesbian student tried to report to school officials that she was being harassed by other students because she is a lesbian. Instead of addressing the harassment, students say the school responded with intimidation and censorship.\n http://www.wmbb.com/gulfcoastwest/mbb/news.apx.-content-articles-MBB-2008-01-31-0010.html\n \n Environments like this don't just exist because one or two people decide to bully.\n It exists because of a \"mob mentality\" that enforces its prejudicial will, or gives support to gay condemnation.", 
   {
    "post_info": {
     "post_title": "Students Who Support Gay Rights Are an &quot;Illegal Organization&quot;"
    }
   }, 
   null, 
   null, 
   1201904340.0
  ], 
  [
   299705, 
   null, 
   "jim's trucking", 
   "[.....Environments like this don't just exist because one or two people decide to bully.\n It exists because of a \"mob mentality\" that enforces its prejudicial will, or gives support to gay condemnation.\n...and sometimes it's because a narrow-minded nit wit has been put in charge of the school. A principal with a goody-two-shoes, Victorian outlook on life can wreak havoc on the freedom of others to be what they are.", 
   {}, 
   299702, 
   null, 
   1201906260.0
  ], 
  [
   299711, 
   null, 
   "lesz", 
   "This is the same sort of stupidity as when schools try to ban religious student groups. The law is clear: so long as schools permit the formation of extracurricular groups, they have to admit all groups, so long as their purpose isn't illegal. Doesn't matter if they worship Jesus or support equal rights for all Americans. It isn't illegal.\n \n Still, I suspect there is a difference. Schools that mistakenly attempt to ban religious groups usually do so because they don't understand the law separating church and state. The ACLU often defends religious organisations against such silliness. A letter is usually enough to clear things up. In this case, I suspect *gasp* anti-gay bigotry.\n \n Let's face it, a student organisation supporting equal rights is not a religious group. There is no possibility of innocent but naive confusion about the separation of church and state here. These censors are determined to stamp out expression of support for equal rights. This is pure restriction of freedom of speech, arising from homophobia.", 
   {}, 
   299705, 
   null, 
   1201908240.0
  ], 
  [
   299721, 
   null, 
   "MrWriteLA", 
   "Environments like this don't just exist because one or two people decide to bully.\nOh, now. I'm sure overweight kids have to put with the same level of so-called \"harrassment.\" emoticon_rolleyes", 
   {}, 
   299711, 
   null, 
   1201915020.0
  ], 
  [
   299727, 
   null, 
   "flygirl", 
   "Well, if the ACLU is involved, that's the ballgame.They nearly never lose. The school better pack up and go home. The ACLU got involved with the suit over a girl's tigger socks and that triviality cost the school nearly $100,000.\n The ACLU's only reason for existance is to protect this country's constitution and I'd bet that the consequences for this school's blatant discrimination will be much costlier.\n \n Oh, if anyone's unaware of the 'tigger socks' debacle, here's a link;\n http://www.theconservativevoice.com/ap/article.html?mi=D8TI559O0&apc=9024", 
   {}, 
   299721, 
   null, 
   1201916220.0
  ], 
  [
   299736, 
   null, 
   "Dane", 
   "Well, if the ACLU is involved, that's the ballgame.They nearly never lose. The school better pack up and go home. The ACLU got involved with the suit over a girl's tigger socks and that triviality cost the school nearly $100,000.\nThey also helped fix the stupid school board of Dover, PA, where the plan was to teach \"intelligent design\" to students. That cost the school $1 mill, and the entire right-wing part of the school board was fired.", 
   {}, 
   299727, 
   null, 
   1201924740.0
  ], 
  [
   299737, 
   null, 
   "jyoshu", 
   "Well, if the ACLU is involved, that's the ballgame.They nearly never lose. The school better pack up and go home. The ACLU got involved with the suit over a girl's tigger socks and that triviality cost the school nearly $100,000.\n The ACLU's only reason for existance is to protect this country's constitution and I'd bet that the consequences for this school's blatant discrimination will be much costlier.\n \n Oh, if anyone's unaware of the 'tigger socks' debacle, here's a link;\n http://www.theconservativevoice.com/ap/article.html?mi=D8TI559O0&apc=9024\n\n \n \"Officials in a Northern California school district might not think Tiggers are such wonderful things after agreeing to pay $95,000 in lawyers' fees to five families who sued the school over its dress code.\"\n Sounds like the lawyers were the main winners. Bet they love the ACLU too. emoticon_frazzled", 
   {}, 
   299727, 
   null, 
   1201924860.0
  ], 
  [
   299741, 
   null, 
   "CUNxTime", 
   "The only remedy for Free Speech is More of It. Let them have their club but don't fight against it when the religious wackos start their own little anti gay club in response...", 
   {}, 
   299737, 
   null, 
   1201926120.0
  ], 
  [
   299753, 
   null, 
   "lesz", 
   "Free speech is all very well, but advocating terrorism against any group of students is beyond any reasonable version of speech. Gay groups threaten no-one; anti-gay groups do. You might as well allow student KKK chapters to terrorise black kids.\n \n I don't really understand the kneejerk right-wing allergy to the ACLU... unless, of course, conservatives don't really believe in defending individual liberty against government power. Could that possibly be? Yes, I think it could.", 
   {}, 
   299741, 
   null, 
   1201934100.0
  ], 
  [
   299754, 
   null, 
   "lesz", 
   "Sounds like the lawyers were the main winners. Bet they love the ACLU too. emoticon_frazzled\n\n \n Yes, in an ideal conservative world, everyone would respect everyone else's rights without having to be reminded of what those rights are. In the real world, however, we have to suffer lawyers, because authoritarians love telling other people how they should live their lives. Oddly enough, most authoritarians are conservatives! emoticon_rolleyes", 
   {}, 
   299737, 
   null, 
   1201934400.0
  ], 
  [
   299757, 
   null, 
   "Steeeeve", 
   "The ACLU's only reason for existance is to protect this country's constitution\nSince when? The ACLU likes to protect their idea of what the constitution says but that is far from the reality of what it says.", 
   {}, 
   299754, 
   null, 
   1201935240.0
  ], 
  [
   299758, 
   null, 
   "lesz", 
   "Odd, then, that the ACLU wins most of its cases. Damn activist judges, always finding for liberty over government coercion! There can't be a judge in the entire country with our Steeeve's special insight into the Constitution. Except Mr. Injustice Scalia, of course.", 
   {}, 
   299757, 
   null, 
   1201936860.0
  ], 
  [
   299780, 
   null, 
   "Penfold", 
   "Obviously the school's reactionary behaviour is appalling, but I could not help but smile at their name. Perhaps having increasing numbers of British incomers with second homes in the sun around, they are unusually paranoid.\n \n ponce \n noun \n 1. a man who is effeminate in his manner and fussy in the way he dresses \n 2. someone who procures customers for whores (in England they call a pimp a ponce) [syn: pimp] \n \n WordNet® 3.0, © 2006 by Princeton University. \n :)", 
   {}, 
   299758, 
   null, 
   1201957680.0
  ], 
  [
   299782, 
   null, 
   "Matthew S", 
   "School Suggests Students Who Support Gay Rights Are an \"Illegal Organization\"\n \n PONCE DE LEON, FL - A Florida high school has been trampling the First Amendment rights of students who support equal rights for gay people, according to a federal lawsuit filed today by the American Civil Liberties Union. In its lawsuit, the ACLU described an atmosphere of fear and censorship at Ponce de Leon High School, where the school board's attorney says even expressions like a rainbow sticker may mean students are members of an \"illegal organization.\"\n \n \"All any of us wants to do is be able to talk about gay rights issues without having to be scared,\" said Heather Gillman, a 16-year-old junior at the school. \"Nobody should have to worry about being kicked out of school just for having a rainbow sticker on your notebook.\"\n \n The ACLU sent a letter in November to the school board's attorney on behalf of Gillman, asking for clarification as to whether a variety of symbols and slogans, such as the rainbow flag or \"I support my gay friends,\" would be allowed at the school. The school district replied that it would not allow any expressions of support for gay rights at all because such speech would \"likely be disruptive.\" The district then went even further, claiming that such symbols and slogans were signs that students were part of a \"secret/illegal organization.\"\n \n The letter was sent after Gillman and other students approached the ACLU about an atmosphere in which students say they were routinely intimidated by school officials for things like writing \"gay pride\" on their arms and notebooks or wearing rainbow-themed clothing. According to students, problems began in September when a lesbian student tried to report to school officials that she was being harassed by other students because she is a lesbian. Instead of addressing the harassment, students say the school responded with intimidation and censorship.\n http://www.wmbb.com/gulfcoastwest/mbb/news.apx.-content-articles-MBB-2008-01-31-0010.html\n \n Environments like this don't just exist because one or two people decide to bully.\n It exists because of a \"mob mentality\" that enforces its prejudicial will, or gives support to gay condemnation.\n\n \n And they wonder why kids decide to shoot up the school. emoticon_xdonno", 
   {}, 
   299702, 
   null, 
   1201958100.0
  ], 
  [
   299783, 
   null, 
   "lesz", 
   "Well, Juan Ponce de León was the first Spanish explorer of Florida while allegedly looking for the Fountain of Youth. From his picture in Wiki, I'd say he never found it... and for what it's worth, in Atlanta, there are or used to be several gay bars on Ponce de Leon Ave., one of them being The Eagle, which is, like all Eagles, pretty anti-ponce.", 
   {}, 
   299780, 
   null, 
   1201958520.0
  ], 
  [
   299784, 
   null, 
   "flygirl", 
   "Since when? The ACLU likes to protect their idea of what the constitution says but that is far from the reality of what it says.\n\n They have different versions of the constitution now? Where was I when this happened? The ACLU's whole reason for existing is to uphold the constitution.The ACLU's stated mission is \"to defend and preserve the individual rights and liberties guaranteed to every person in this country by the Constitution and laws of the United States.\n They don't pick and choose causes according to popular opinion. It was the ACLU in the scopes trial, in brown vs. the board of education, in the ban on interracial marriage, in roe v. wade. They have defended neo-nazis and churches, They defended Rush Limbaugh's right to privacy concerning his medical records, and then went against warrantless wire-tapping by the government, something Rush is vocally in FAVOR of. It's pretty clear to me that their test question when considering a case is, 'have this individual's, or organization's, constitutional rights been violated?'", 
   {}, 
   299757, 
   null, 
   1201960560.0
  ], 
  [
   299799, 
   null, 
   "bhbcu64", 
   "fly,\n \n It's pretty clear to me that their test question when considering a case is, 'have this individual's, or organization's, constitutional rights been violated?'\n \n Which is why the ACLU even went to the defense of the disgusting Jerry Foulwell a few years back.emoticon_xagree", 
   {}, 
   299784, 
   null, 
   1201973820.0
  ], 
  [
   299801, 
   null, 
   "Dane", 
   "Since when? The ACLU likes to protect their idea of what the constitution says but that is far from the reality of what it says.\n\n Oh look, a \"just because I say so\" blatant falsehood. How lame.emoticon_rolleyes", 
   {}, 
   299757, 
   null, 
   1201974480.0
  ], 
  [
   299820, 
   null, 
   "flygirl", 
   "\n Which is why the ACLU even went to the defense of the disgusting Jerry Foulwell a few years back.emoticon_xagree\n\n Which was EXACTLY my point. Popularity of a case isn't their guide, it's constitutionality is. Thanks for getting it.", 
   {}, 
   299799, 
   null, 
   1201982340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Students Who Support Gay Rights Are an \"Illegal Organization\"", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10883-students-who-support-gay-rights-illegal-organization.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10883, 
  "discussion_files": [
   [
    "30978.html", 
    "http://www.4forums.com/political/gay-rights-debates/10883-students-who-support-gay-rights-illegal-organization-print.html"
   ], 
   [
    "30979.html", 
    "http://www.4forums.com/political/gay-rights-debates/10883-students-who-support-gay-rights-illegal-organization-2-print.html"
   ]
  ], 
  "identifier": 10883
 }
]