[
 [
  [
   301102, 
   null, 
   "HonestAbe", 
   "\"I see no light behind that terrible curtain. I do not think one religion better than another, and I think the Christian religion has brought far more misery, crime, and suffering, far more tyranny and evil, than any other.\"\n -- Eliza Lynn Linton, letter to clergyman, 1897, as quoted in Mrs. Lynn Linton: Her Life, Letters and Opinions (p. 367). \n \n http://ffrf.org/", 
   {
    "post_info": {
     "post_title": "Free thinkers"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1202668020.0
  ], 
  [
   301114, 
   null, 
   "charlie horse", 
   "For the theist, the God-given ability to reason comes with a penalty: don't challenge God, the faith, the clergy, the bible. If you do use your reason, you'll dismiss them all (and burn in hell as a consequence...)\n \n Fortunately free thinking encourages the power of reason.", 
   {}, 
   301102, 
   null, 
   1202676720.0
  ], 
  [
   301120, 
   null, 
   "HonestAbe", 
   "For the theist, the God-given ability to reason comes with a penalty: don't challenge God, the faith, the clergy, the bible. If you do use your reason, you'll dismiss them all (and burn in hell as a consequence...)\n \n Fortunately free thinking encourages the power of reason.\n\n \n It is our great benefit to know that these people did challenge the teachings of the priests and clergy. Our world would be quite different if they had not. We'd all be living on a flat earth in Europe.", 
   {}, 
   301114, 
   null, 
   1202679840.0
  ], 
  [
   301127, 
   null, 
   "Penfold", 
   "Western civilisation has known the Earth is round since a couple of centuries AD. Mostly the \"flat earth\" myth stems from Washington Irving's error in his book about Columbus in 1850ish.", 
   {}, 
   301120, 
   null, 
   1202685120.0
  ], 
  [
   301129, 
   null, 
   "jyoshu", 
   "For the theist, the God-given ability to reason comes with a penalty: don't challenge God, the faith, the clergy, the bible. If you do use your reason, you'll dismiss them all (and burn in hell as a consequence...)\n\n \n I'm a theist, and *I* certainly have not been \"penalized\" as such. I have questioned and challenged God and faith many times. Don't mistake coming to different conclusions than you as lack of questioning.\n \n I swear, I don't understand for the life of me why there are some on this forum who are so out to intentionally equate religion with ignorance and non-reason. If you don't believe in God, then that's fine. That's your choice; no one's going to make you do otherwise. But please, stop the condescending and claiming that religious people can't 'challenge God' or the implications/assertions that religious people aren't \"free thinkers\". These are just not true. Why can't you people just let religious people be?", 
   {}, 
   301114, 
   null, 
   1202685600.0
  ], 
  [
   301131, 
   null, 
   "Penfold", 
   "Think of it as your proselytising being reflected back at you.emoticon_rolleyes", 
   {}, 
   301129, 
   null, 
   1202685960.0
  ], 
  [
   301133, 
   null, 
   "jyoshu", 
   "Think of it as your proselytising being reflected back at you.emoticon_rolleyes\n\n \n Funny, I don't recall too many religious people trying to convert people to their religion by chain yanking. And if they have, then you're only showing that you're stooping to the level of those that do.", 
   {}, 
   301131, 
   null, 
   1202686260.0
  ], 
  [
   301134, 
   null, 
   "jim's trucking", 
   "Free thinkers are nothing more than pompous narcissists who think that to agree with an established creed is a sign of weakness. They do not even consider themselves equal for fear of establishing a flock.\n \n More turmoil has been started in the name of Islam than in the name of Christ. The fact that more people have been killed in the name of Christ says something to the strength of Islam.\n \n Kill emoticon_xkill all radical Muslims and those who support them!!", 
   {}, 
   301131, 
   null, 
   1202686740.0
  ], 
  [
   301135, 
   null, 
   "HonestAbe", 
   "Free thinkers are nothing more than pompous narcissists who think that to agree with an established creed is a sign of weakness. They do not even consider themselves equal for fear of establishing a flock.\n \n More turmoil has been started in the name of Islam than in the name of Christ. The fact that more people have been killed in the name of Christ says something to the strength of Islam.\n \n Kill emoticon_xkill all radical Muslims and those who support them!!\n\n \n You are a joke. The Christian Church is responsible for the deaths and suffering of millions and it continues into this day. :xbanghead", 
   {}, 
   301134, 
   null, 
   1202687520.0
  ], 
  [
   301141, 
   null, 
   "trebor", 
   "Funny, I don't recall too many religious people trying to convert people to their religion by chain yanking. And if they have, then you're only showing that you're stooping to the level of those that do.\n\n \n Easyrider, Archangel, God's cowboy,", 
   {}, 
   301133, 
   null, 
   1202688540.0
  ], 
  [
   301163, 
   null, 
   "T.Q", 
   "I don't see what point a thread like this serves. This is just the mirror image of what AA and Marc do on a daily basis. If it's not acceptable for them, why is it acceptable for you?", 
   {}, 
   301141, 
   null, 
   1202703300.0
  ], 
  [
   301195, 
   null, 
   "Jo Bennett", 
   "For the theist, the God-given ability to reason comes with a penalty: don't challenge God, the faith, the clergy, the bible. If you do use your reason, you'll dismiss them all (and burn in hell as a consequence...)\n \n Fortunately free thinking encourages the power of reason.\n\n \n Challenge God I'll accept. All the others are open to challenge, otherwise how do you explain:\n John Wycliff\n Martin Luther\n Thomas Moore\n Thomas Cromwell\n Oliver Cromwell\n George Fox\n John Wesley\n Charles Darwin\n Helda Camara\n Need any more?\n All believers, all Christians in fact, all challenged one or more of your list. The history of the church is one of continual attempts to move closer to God, disrupted by human failings.", 
   {}, 
   301114, 
   null, 
   1202729520.0
  ], 
  [
   301201, 
   null, 
   "Ripskar", 
   "I think it's a question of degee, the believers may have questioned their beliefs to some extent, but they didn't get back to first principles because it is impossible to get to monotheism from that point. If you did manage it would would have achieved something that the best philosophers the human race has ever produced, failed to do and be well on the way to proving the existance of a deity outright (Nobel prize here-we-come). There must be some base-line assumptions you didn't question, and thus what your faith is built upon.", 
   {}, 
   301195, 
   null, 
   1202742180.0
  ], 
  [
   301205, 
   null, 
   "jyoshu", 
   "There must be some base-line assumptions you didn't question, and thus what your faith is built upon.\n\n \n Or did question and come to different conclusions than you did.", 
   {}, 
   301201, 
   null, 
   1202743800.0
  ], 
  [
   301208, 
   null, 
   "lesz", 
   "Free thinkers are nothing more than pompous narcissists who think that to agree with an established creed is a sign of weakness. They do not even consider themselves equal for fear of establishing a flock.\n \n More turmoil has been started in the name of Islam than in the name of Christ. The fact that more people have been killed in the name of Christ says something to the strength of Islam.\n \n Kill emoticon_xkill all radical Muslims and those who support them!!\n\n \n Oh lord, save us from your devoted followers! emoticon_rolleyes", 
   {}, 
   301134, 
   null, 
   1202744040.0
  ], 
  [
   301209, 
   null, 
   "HonestAbe", 
   "\"I cannot believe in the immortality of the soul. . . . I am an aggregate of cells, as, for instance, New York City is an aggregate of individuals. Will New York City go to heaven? . . . . No; nature made us--nature did it all--not the gods of the religions.\"\n -- Thomas Alva Edison, The New York Times, Oct. 2, 1910 (\"No Immortality of the Soul\" Says Thomas A. Edison, interview by Edward Marshall) \n \n Another American Free Thinker", 
   {
    "unicode_changes_made": true
   }, 
   301208, 
   null, 
   1202744460.0
  ], 
  [
   301215, 
   null, 
   "jitobear", 
   "I don't believe that having faith or not having it determines whether one is intelligent or free-thinking. Nor is it responsible for evil - people do that. There has been good and bad that has been born inside and outside religion.\n \n The issues I do see in religion.[*]Many have a heirarchy that you are discouraged to challenge. Some to the point of being cults.[*]There is no other force on the planet like it that can compell large groups of people to act. This is evidenced by the charity that surrounds religious organizations. The sad part is that is also compells otherwise good people to do horrible things. It has been used to inspire a decent person to dicriminate, hurt or even murder - all because they believe they are doing it for \"God\". (Nationalism comes pretty close in this - many will also do these things for \"country\").", 
   {}, 
   301209, 
   null, 
   1202748060.0
  ], 
  [
   301218, 
   null, 
   "HonestAbe", 
   "I don't believe that having faith or not having it determines whether one is intelligent or free-thinking. Nor is it responsible for evil - people do that. There has been good and bad that has been born inside and outside religion.\n \n The issues I do see in religion.[*]Many have a heirarchy that you are discouraged to challenge. Some to the point of being cults.[*]There is no other force on the planet like it that can compell large groups of people to act. This is evidenced by the charity that surrounds religious organizations. The sad part is that is also compells otherwise good people to do horrible things. It has been used to inspire a decent person to dicriminate, hurt or even murder - all because they believe they are doing it for \"God\". (Nationalism comes pretty close in this - many will also do these things for \"country\").\n\n \n Historically, I believe, Free Thinkers were considered to be those who did not follow a religious tradition, and who spoke or wrote opinions that flatly denied the existence of deities etc. When you read about these people, they are generally the intellectuals living in a society at a particular time. Whether they were more intelligent that believers...who knows, or cares. They just had the courage to speak out against what the majority took \"on faith.\"", 
   {}, 
   301215, 
   null, 
   1202749140.0
  ], 
  [
   301221, 
   null, 
   "Archangel", 
   "For the theist, the God-given ability to reason comes with a penalty: don't challenge God, the faith, the clergy, the bible. If you do use your reason, you'll dismiss them all (and burn in hell as a consequence...)\n \n Fortunately free thinking encourages the power of reason.\n\n \n You constantly prove how blatantly ignorant you are to the things of the spirit charlie. You speak as if you actually know what you're talking about when you haven't a clue at all. NO MAN or CHURCH tells me what I believe or how I must interpret the Bible which is God's Word. And neither will questioning any Doctrine or Belief condemn me to hell in any way as my salvation is unconditional and not based on my performance or righteousness at all, but is based on Gods righteousness, holiness and sacrifice for my personal sins. It is by grace that we are saved by faith so that no man may boast. It is a free gift that only need be received. There is nothing we can do to be worthy, or earn our salvation. And neither will God condemn those who receive His FREE GIFT of SALVATION.\n \n John 14:26 But the Comforter, [which is] the Holy Ghost, whom the Father will send in my name, he shall teach you all things, and bring all things to your remembrance, whatsoever I have said unto you.\n \n Ephesians 2:8 For it is by grace you have been saved, through faith-and this not from yourselves, it is the gift of God-\n Jhn 10:25 Jesus replied, \"I have already told you, and you don't believe me. The proof is what I do in the name of my Father.\n Jhn 10:26 But you don't believe me because you are not part of my flock.\n Jhn 10:27 My sheep recognize my voice; I know them, and they follow me.\n Jhn 10:28 I give them eternal life, and they will never perish. No one will snatch them away from me,\n Jhn 10:29 for my Father has given them to me, and he is more powerful than anyone else. So no one can take them from me.\n Jhn 10:30 The Father and I are one.\"\n  As a side note to CxT: Notice how Jesus declares that He and the Father are ONE? That is a pretty clear statement of His station as a member of the TRINITY. So your claim that He never said He was God is effectively refuted by Jesus Himself. ", 
   {}, 
   301114, 
   null, 
   1202752560.0
  ], 
  [
   301224, 
   null, 
   "trebor", 
   "Challenge God I'll accept. All the others are open to challenge, otherwise how do you explain:\n John Wycliff\n Martin Luther\n Thomas Moore\n Thomas Cromwell\n Oliver Cromwell\n George Fox\n John Wesley\n Charles Darwin\n Helda Camara\n Need any more?\n All believers, all Christians in fact, all challenged one or more of your list. The history of the church is one of continual attempts to move closer to God, disrupted by human failings.\n\n \n At least one of those lost their head over their free thinking.\n And, if it wasn't for a german nobel patron, Martin Luthor would have too.", 
   {}, 
   301195, 
   null, 
   1202753520.0
  ], 
  [
   301227, 
   null, 
   "Ripskar", 
   "Or did question and come to different conclusions than you did.\n\n \n Only possible if they were irrational about it, You cannot prove god exists, you cannot arrive at monotheism without making assumptions or irrational justifications, see Descartes.", 
   {}, 
   301205, 
   null, 
   1202755320.0
  ], 
  [
   301228, 
   null, 
   "Another opinion", 
   "Free thinking is thinking that allows itself to question any or all aspect of human knowledge. Rational thinking takes accepted knowledge as a base and progresses from there through logical analyis to attain new knowledge. \n \n I would say that religious thinking can be rational since it can use logical analyis of accepted religious and secular knowledge to reach further understanding. However, it is not entirely free since some basic assumptions (such as the very existence of God or a supernatural) are not fully questioned. The trouble, of course, with rational thinking that is not free is that, if the original accepted knowledge is not correct, then any new knowledge one gains from its analysis can also easily be false. So, like a carefully constructed house of cards, it can fall apart due to the poor base. \n \n That restrained rational thinking was the only route for scholars for many centuries. It is only once it was freed from the cage of authority (either religious or secular - ex. in assuming that Aristotle had to be right) through the Enlightment that the attainment of knowledge really took off - mainly through Science.\n \n To be fair, the progress of Science is also occasionally impeded by constrained thinking since Science, after all, is pursued by scientists who can succumb to human limitations - such as the egos of scientists who find it very hard to part with certain pet theories, or the enormous obstacles that a scientist can encounter when trying to refute a popularly accepted theory, even if they can present just as supportable a theory. Nonetheless, most limited thinking in Science is eventually ironed out, allowing scientific knowledge to progress.", 
   {}, 
   301224, 
   null, 
   1202755920.0
  ], 
  [
   301249, 
   null, 
   "HonestAbe", 
   "most limited thinking in Science is eventually ironed out, allowing scientific knowledge to progress.\n \n Well, we can thank god for that.", 
   {}, 
   301228, 
   null, 
   1202772180.0
  ], 
  [
   301254, 
   null, 
   "jyoshu", 
   "Only possible if they were irrational about it, You cannot prove god exists, you cannot arrive at monotheism without making assumptions or irrational justifications, see Descartes.\n\n \n Nope. You can no more disprove God than prove it. Either conclusion can be arrived at or not. There are plenty of religious scientists for which religion and reason are not incompatible (as well as some very famous scientists in history) and it is an unfortunate fairly modern misconception that they have to be.", 
   {}, 
   301227, 
   null, 
   1202773200.0
  ], 
  [
   301257, 
   null, 
   "Another opinion", 
   "Nope. You can no more disprove God than prove it. Either conclusion can be arrived at or not. There are plenty of religious scientists for which religion and reason are not incompatible (as well as some very famous scientists in history) and it is an unfortunate fairly modern misconception that they have to be.\n\n It is true that one cannot disprove the existence of God or the supernatural but, for religion to claim any confidence in its proclamations of knowledge, it needs to present proof of the existence of God - not just lack of a proof against God's existence. If one wants to pursue a consistent and logical course toward truth, one cannot start with an unsupported assumption and logically progress from there. Otherwise, the world view one has constructed is like a house of cards that can easily tumble away if ones original assumption (in the case of religion, the existence of God or the supernatural) is false. \n \n Science built its structure of knowledge on a solid foundation of evidence. It did not need to make an unprovable assumption of the non-existence of God or the supernatural in order to progress in knowledge. It follows the path of evidence, which has led to great gains in human knowledge.", 
   {}, 
   301254, 
   null, 
   1202774100.0
  ], 
  [
   301259, 
   null, 
   "Zardoz", 
   "For the theist, the God-given ability to reason comes with a penalty: don't challenge God, the faith, the clergy, the bible. If you do use your reason, you'll dismiss them all (and burn in hell as a consequence...)\n \n Fortunately free thinking encourages the power of reason.\n\n \n As the wisened greenie dude Yoddler the Shoulder Sitter once said:\n \"Reasoning leads to questioning.\n Questioning leads to doubting.\n Doubting leads to the dark...erm, Damnation.\n Do as I say and not as I do and the force will be strong in you.\"\n \n I saw it in a historical documentary.\n This dude knows a lot about what he said.\n Lifted big rocks and jet planes with less than a mustard seeds of faith.\n And he taught the guy who wrote the bible, Luke, a lof of his powerful magics.\n One day, that Luke fella smote mightily his pappy, Arnold, who was damned because of his constant questioning. Is it not written in the bible that you must hate your pappy to love your God? Well, this Luke guy was a strong hater of his pappy. \n Shoulda seen it.\n They was sword fighting like they did in bible times.\n Jumping all over the place with their powers.\n Using the 'god-kinda-faith' to move things about.\n \n I did think it odd that the Luke dude smooched his sister though. But, that's what they did in bible times.\n Of course. There are sad parts too in the documentary.\n Like when all the shriveled up Jewas got killed by the Roman legionares for being uppity and driving around in gas guzzlers. Musta cause that global warming in their times like it is in ours. Cause there was desert everywhere.\n \n And then there was the time when Luke's pappy blew up the Garden of Eden world. That must be why we can't find it any more. Just rocks in it's place.\n Between Mars and Jupiter I think. Sad. I'd have liked to have visited that place. But, I wouldn't want any Jewas visiting. They'd just pollute it up.\n \n I'm glad I have a smarted up preacha to learn me the write way to thunk.", 
   {}, 
   301114, 
   null, 
   1202775300.0
  ], 
  [
   301266, 
   null, 
   "jyoshu", 
   "It is true that one cannot disprove the existence of God or the supernatural but, for religion to claim any confidence in its proclamations of knowledge, it needs to present proof of the existence of God - not just lack of a proof against God's existence. If one wants to pursue a consistent and logical course toward truth, one cannot start with an unsupported assumption and logically progress from there. Otherwise, the world view one has constructed is like a house of cards that can easily tumble away if ones original assumption (in the case of religion, the existence of God or the supernatural) is false.\n\n \n The problem is that some even approach the issue as a 'proveable' or needing-to-be-proven one to begin with. Science isn't threatened by belief in God, it's threatened by people who are anti-science. Your statement that \"for religion to claim any confidence in its proclamations of knowledge, it needs to present proof\" begs the question that it's an issue needing to be proven to begin with. Why should anyone need to prove God exists, any more than they need to disprove it? I see no reason why it should even be approached that way. Religion is a matter of faith, not proof.\n \n \nScience built its structure of knowledge on a solid foundation of evidence.\n\n \n For scientific and empirical issues, that's fine. But religion doesn't fall into that category.", 
   {}, 
   301257, 
   null, 
   1202781660.0
  ], 
  [
   301274, 
   null, 
   "Ghost Rider", 
   "I believe that there are certain things in this world that exist but simply can't be proven at this point in time. God, bigfoot, the Loch Ness Monster, aliens, the chupacabra, the mothman, etc. they all exist, we've seen pieces of evidence here and there that hint at them being real. Even if we can't fully prove it, people still believe in it.", 
   {}, 
   301266, 
   null, 
   1202787840.0
  ], 
  [
   301308, 
   null, 
   "Zardoz", 
   "I believe that there are certain things in this world that exist but simply can't be proven at this point in time. God, bigfoot, the Loch Ness Monster, aliens, the chupacabra, the mothman, etc. they all exist, we've seen pieces of evidence here and there that hint at them being real. Even if we can't fully prove it, people still believe in it.\n\n \n Yeah, like the female orgasm and women's intuition.\n \n Mythical mystical mumbo-jumbo.\n \n But...they could be real. So we gotta look for em and believe.", 
   {}, 
   301274, 
   null, 
   1202794500.0
  ], 
  [
   301310, 
   null, 
   "Archangel", 
   "Yeah, like the female orgasm and women's intuition.\n \n Mythical mystical mumbo-jumbo.\n \n But...they could be real. So we gotta look for em and believe.\n\n \n Are you actually saying that you have never witnessed a woman having an orgasm Zardoz? Is that why you think they are mythical mumbo jumbo? Do you have any idea what that say's about your lovemaking skills? I can very confidently attest to bringing every woman I have ever been with, except my first girlfriend to multiple orgasms. Just a tip for you, it's all about generous foreplay and putting her needs first.", 
   {}, 
   301308, 
   null, 
   1202794920.0
  ], 
  [
   301313, 
   null, 
   "Ghost Rider", 
   "The female orgasm exists, it's the G-spot that doesn't exist.", 
   {}, 
   301310, 
   null, 
   1202795100.0
  ], 
  [
   301333, 
   null, 
   "charlie horse", 
   "... NO MAN or CHURCH tells me what I believe or how I must interpret the Bible which is God's Word...\n\n Then how do you interpret the bible, Archie? The Spirit? Voices in your head? Remember this:\n \n 2 Peter 1:20 For YOU know this first, that no prophecy of Scripture springs from any private interpretation.  Yet you will resolve it by private interpretation.\n \n I stand by what I said. Neither did I say that questioning will condemn you. It's the questioning and dismissal of fairy tales. You latch on to your interpretation, and that's the be-all and end-all for you. Swallow it whole.\n \n And quoting reams of scripture doesn't validate your argument.", 
   {}, 
   301221, 
   null, 
   1202818740.0
  ], 
  [
   301341, 
   null, 
   "Jo Bennett", 
   "The female orgasm exists, it's the G-spot that doesn't exist.\n\n \n Coulda fooled me...", 
   {}, 
   301313, 
   null, 
   1202821500.0
  ], 
  [
   301353, 
   null, 
   "HonestAbe", 
   "\"I can indeed hardly see how anyone ought to wish Christianity to be true; for if so the plain language of the text seems to show that the men who do not believe, and this would include my Father, Brother, and almost all my best friends, will be everlastingly punished. And this is a damnable doctrine.\"\n -- Charles Darwin, Autobiography \n \n www.ffrf.org", 
   {
    "unicode_changes_made": true
   }, 
   301341, 
   null, 
   1202831820.0
  ], 
  [
   301354, 
   null, 
   "HonestAbe", 
   "\"Mr. Lincoln was never a member of any Church, nor did he believe in the divinity of Christ, or the inspiration of the Scriptures in the sense understood by evangelical Christians.\n \n When a boy, he showed no sign of that piety which his many biographers ascribe to his manhood. When he went to church at all, he went to mock, and came away to mimic.\n \n When he came to New Salem, he consorted with Freethinkers, joined with them in deriding the gospel story of Jesus, read Volney and Paine, and then wrote a deliberate and labored essay, wherein he reached conclusions similar to theirs.\"\n -- Colonel Ward H. Lamon (a religionist and Lincoln's longtime friend), Life of Abraham Lincoln, pp. 486, 487, 157 (1872), cited by Franklin Steiner in The Religious Beliefs of Our Presidents \n \n www.ffrf.org", 
   {
    "unicode_changes_made": true
   }, 
   301353, 
   null, 
   1202831880.0
  ], 
  [
   301356, 
   null, 
   "HonestAbe", 
   "\"When I was quite a boy, I had a spasm of religion which lasted six weeks . . . But I never since have swallowed the Christian fable.\"\n -- George Meredith, letter to Mr. Clodd (Memories), cited by Joseph McCabe, A Biographical Dictionary of Modern Rationalists. \n \n www.ffrf.org", 
   {
    "unicode_changes_made": true
   }, 
   301354, 
   null, 
   1202832000.0
  ], 
  [
   301365, 
   null, 
   "jyoshu", 
   "Funny how an organization that purports itself to be for the purpose of protecting the principle of separation of church and state has so many quotes in the interest of trying to debunk religion. Protecting separation of church and state in no way requires atheistic evangelism or attacking religion itself.", 
   {}, 
   301356, 
   null, 
   1202834220.0
  ], 
  [
   301369, 
   null, 
   "lesz", 
   "Funny how an organization that purports itself to be for the purpose of protecting the principle of separation of church and state has so many quotes in the interest of trying to debunk religion. Protecting separation of church and state in no way requires atheistic evangelism or attacking religion itself.\n\n \n Yawn. Religious believers spend a lot of time attacking atheists. If they didn't do that, we wouldn't have to defend ourselves.\n \n Religion doesn't need debunking; it needs to prove itself to be valid. One presumes that every religious claim is false until it is proven true.", 
   {}, 
   301365, 
   null, 
   1202835540.0
  ], 
  [
   301372, 
   null, 
   "Steeeeve", 
   "Yawn. Religious believers spend a lot of time attacking atheists. If they didn't do that, we wouldn't have to defend ourselves.\n \n Religion doesn't need debunking; it needs to prove itself to be valid. One presumes that every religious claim is false until it is proven true.\n\n \n Seems Jyoshu's point went right over your head. :xbanghead", 
   {}, 
   301369, 
   null, 
   1202837100.0
  ], 
  [
   301376, 
   null, 
   "Another opinion", 
   "The problem is that some even approach the issue as a 'proveable' or needing-to-be-proven one to begin with. Science isn't threatened by belief in God, it's threatened by people who are anti-science. Your statement that \"for religion to claim any confidence in its proclamations of knowledge, it needs to present proof\" begs the question that it's an issue needing to be proven to begin with. Why should anyone need to prove God exists, any more than they need to disprove it? I see no reason why it should even be approached that way. Religion is a matter of faith, not proof.\n\n I think that for any world view to be able to convince others through reason of the truth of its understanding of the world, it needs to base its core assumptions on ideas or knowledge that is proven. Otherwise, as I said before, its constructs of knowledge are like a house of cards that rests on a flimsy foundation of unproven assumptions. \n \n Fortunately, for religion, religious world views do not need to appeal to reason to gain converts but mainly to emotion. Unfortunately for religion, emotional appeals are so general that a wide range of religions can successfully appeal to the same emotions to gain converts - which is why there is such a wide range of religions. Appeals to reason that are made by Science, on the other hand, lead to a far better defined and unified world view since there is far less arbitrariness to its structure of knowledge since it is based on reason and observation - not emotion and leaps of faith.", 
   {}, 
   301266, 
   null, 
   1202838120.0
  ], 
  [
   301383, 
   null, 
   "lesz", 
   "Seems Jyoshu's point went right over your head. :xbanghead\n\n \n You and he spend a lot of your time attacking atheists, without ever being able to score a hit. Maybe you need a more effective faith.", 
   {}, 
   301372, 
   null, 
   1202839860.0
  ], 
  [
   301384, 
   null, 
   "jitobear", 
   "You can no more disprove God than prove it. Either conclusion can be arrived at or not.\n\n \n The same could be said of Zues, Krishna, Rhianon.....etc.", 
   {}, 
   301254, 
   null, 
   1202839920.0
  ], 
  [
   301385, 
   null, 
   "lesz", 
   "Religious believers are constitutionally incapable of figuring out it's their religious claims that need proving. There is no need to debunk silliness. Let the advocates of silliness prove it isn't silly.", 
   {}, 
   301384, 
   null, 
   1202840040.0
  ], 
  [
   301386, 
   null, 
   "jyoshu", 
   "I think that for any world view to be able to convince others through reason of the truth of its understanding of the world, it needs to base its core assumptions on ideas or knowledge that is proven. Otherwise, as I said before, its constructs of knowledge are like a house of cards that rests on a flimsy foundation of unproven assumptions. \n \n Fortunately, for religion, religious world views do not need to appeal to reason to gain converts but mainly to emotion. Unfortunately for religion, emotional appeals are so general that a wide range of religions can successfully appeal to the same emotions to gain converts - which is why there is such a wide range of religions. Appeals to reason that are made by Science, on the other hand, lead to a far better defined and unified world view since there is far less arbitrariness to its structure of knowledge since it is based on reason and observation - not emotion and leaps of faith.\n\n \n I think the two serve distinct and different purposes, or at least they should. Science isn't likely to be much comfort to a grieving widow, but religion does that all the time. (Nothing 'silly' about that!) On the other hand, religion isn't likely to accurately explain scientific matters such as specifics of how the human race came about. The two need to stay on their own turf, and let the other do whatever each does to help humanity. It is a waste of time for skeptics to devote a lot of time and effort to trying to debunk religion. Not only does it play a beneficial role in our society, it's not going to go away, no matter how much anti-religious people would prefer it did. Where religion errs by influencing things like war, then religion should be dealt with by reform rather than attempt of eradication, which is hopelessly impossible anyway. Religion shouldn't have to 'prove' itself to provide such comfort and do what it does best; it shouldn't have to bear some arbitrary burden of proof for non-empirical claims. If it infringes on science, then that's different, of course, but again they both need to stay off ea other's turf. The existence of God is not science's turf, because science can't deal with that--it's un-proveable. It's a faith matter.", 
   {}, 
   301376, 
   null, 
   1202840040.0
  ], 
  [
   301389, 
   null, 
   "jyoshu", 
   "The same could be said of Zues, Krishna, Rhianon.....etc.\n\n \n So ....... ? If you want to debate which religion is 'correct', then that's a whole different debate.", 
   {}, 
   301384, 
   null, 
   1202840100.0
  ], 
  [
   301391, 
   null, 
   "lesz", 
   "The existence of God is not science's turf, because science can't deal with that--it's un-proveable. It's a faith matter.\n\n \n All depends on your definition of \"god\". The Christian definition is very much on the turf of science, and it has no scientific legitimacy at all. Without validation, faith alone is worthless.", 
   {}, 
   301386, 
   null, 
   1202840700.0
  ], 
  [
   301395, 
   null, 
   "jyoshu", 
   "All depends on your definition of \"god\". The Christian definition is very much on the turf of science\n\n \n How so? One thing that determines if it's on the turf of science is whether or not it's even a 'proveable' matter to begin with at all. I doubt you'll find too many Christians who would say you (or they) could measurably prove God, empirically.", 
   {}, 
   301391, 
   null, 
   1202842620.0
  ], 
  [
   301396, 
   null, 
   "Another opinion", 
   "I think the two serve distinct and different purposes, or at least they should. Science isn't likely to be much comfort to a grieving widow, but religion does that all the time. (Nothing 'silly' about that!) On the other hand, religion isn't likely to accurately explain scientific matters such as specifics of how the human race came about. The two need to stay on their own turf, and let the other do whatever each does to help humanity.\n\n A large part of the problem is that religion doesn't stay on its own turf. I think that the main reason for that is that the turf allocated to religion has gotten smaller and smaller as Science fills in answers that were and are often given by religion - ex. how the Earth, planets and man came about; how storms, earthquakes, floods function, etc. Even in the realm of the soul, brain research has attributed so much of what was previously viewed as the domain of the soul to the physical brain - personality, memory, etc. Given that shrinking turf, I think that some conflict is inevitable. \n \n It is a waste of time for skeptics to devote a lot of time and effort to trying to debunk religion. Not only does it play a beneficial role in our society, it's not going to go away, no matter how much anti-religious people would prefer it did. Where religion errs by influencing things like war, then religion should be dealt with by reformed rather than attempt of eradication, which is hopelessly impossible anyway. Religion shouldn't have to 'prove' itself to provide such comfort and do what it does best; it shouldn't have to bear some arbitrary burden of proof for non-empirical claims. If it infringes on science, then that's different, of course, but again they both need to stay off ea other's turf. The existence of God is not science's turf, because science can't deal with that--it's un-proveable. It's a faith matter.\n\n I think that a lot of the newer efforts at debunking religion are spurred on by the fact that religious leaders have very much tried to push their views on the rest of the population by law. If someone wants to push a law on the rest of the population, most people need to hear a logical reason for that law, not \"because I say so\" (or, in the case of religion, \"because the Bible says so\"). If not for the newer efforts of the Religious Right to impose its beliefs on the rest of the population, then most non-believers would be far less pushy with their views.", 
   {}, 
   301386, 
   null, 
   1202842740.0
  ], 
  [
   301397, 
   null, 
   "jyoshu", 
   "A large part of the problem is that religion doesn't stay on its own turf. \n\n \n As long as you agree it sometimes goes both ways, I have no problem with that.\n \n \nI think that the main reason for that is that the turf allocated to religion has gotten smaller and smaller as Science fills in answers that were and are often given by religion - ex. how the Earth, planets and man came about; how storms, earthquakes, floods function, etc. Even in the realm of the soul, brain research has attributed so much of what was previously viewed as the domain of the soul to the physical brain - personality, memory, etc. Given that shrinking turf, I think that some conflict is inevitable. \n\n \n The human brain could be entirely 'mapped' down to every neuron and synapse, and every chemical, and it would not infringe upon religion's views of the soul and spirit. I think there are probably plenty of skeptics who WANT it to infringe on it, but the bottom line is that what is physically observed only pertains to what is physical. It does nothing to address what people believe is spiritual. Watching brain activity or comparing it during actions such as prayer ultimately speaks to nothing but ... well, brain activity.\n \n Anyway, religion was turned to for centuries to explain scientific matters, because there was no other real option. Science wasn't far enough along. Science is not so much taking religion's turf as it is taking it's OWN, that religion held for a long time out of necessity. (and of course didn't want to give up either, at times, because of power-hungry church leaders.) But science can only ever go so far--it's just unlikely going to be the same comfort to a grieving person having to deal with the death of a loved-one, or be as powerful a source of inspiration in some cases that people long for. I just don't see how it can as easily fill one's spiritual need as does religion (or other things, for that matter). And the thing is, why is that not ok, anyway? I get the impression sometimes that skeptics really, really want science to be the be-all and end-all of the human experience, but I think that would be sad state of affairs if it were all that's left. I for one LIKE having some mystery and spirituality to life, and I suspect many feel the same way. I just this this whole idea that religion even SHOULD be overtaken by science is absolutely un-necessary. (Not to mention likely impossible anyway.)\n \n \nI think that a lot of the newer efforts at debunking religion are spurred on by the fact that religious leaders have very much tried to push their views on the rest of the population by law.\n\n \n That may be, but why not limit reaction to the specific areas where law is trying to be changed? Or simply fight from the standpoint that it shouldn't be put into law rather than trying to debunk the belief itself (which exists independently of whether or not laws are made over it)?", 
   {}, 
   301396, 
   null, 
   1202843820.0
  ], 
  [
   301405, 
   null, 
   "Another opinion", 
   "As long as you agree it sometimes goes both ways, I have no problem with that.\n\n It does work both ways - Science does encroach upon the traditional positions of religion. It doesn't do it on purpose as much as it is simply following the path of evidence and draws conclusions independently of any previously held views. I don't think that there would be any sense in having a territorial statement saying - don't go there, its our intellectual territory.\n \nThe human brain could be entirely 'mapped' down to every neuron and synapse, and every chemical, and it would not infringe upon religion's views of the soul and spirit. I think there are probably plenty of skeptics who WANT it to infringe on it, but the bottom line is that what is physically observed only pertains to what is physical. It does nothing to address what people believe is spiritual. Watching brain activity or comparing it during actions such as prayer ultimately speaks to nothing but ... well, brain activity.\n \n Anyway, religion was turned to for centuries to explain scientific matters, because there was no other real option. Science wasn't far enough along. Science is not so much taking religion's turf as it is taking it's OWN, that religion held for a long time out of necessity. (and of course didn't want to give up either, at times, because of power-hungry church leaders.) But science can only ever go so far--it's just unlikely going to be the same comfort to a grieving person having to deal with the death of a loved-one, or be as powerful a source of inspiration in some cases that people long for. I just don't see how it can as easily fill one's spiritual need as does religion (or other things, for that matter). And the thing is, why is that not ok, anyway? I get the impression sometimes that skeptics really, really want science to be the be-all and end-all of the human experience, but I think that would be sad state of affairs if it were all that's left. I for one LIKE having some mystery and spirituality to life, and I suspect many feel the same way. I just this this whole idea that religion even SHOULD be overtaken by science is absolutely un-necessary. (Not to mention likely impossible anyway.)\n\n Some skeptics do want to debunk religion all together. Some are simply intellectual purists thinking that whatever shows no evidence of itself cannot exist. Others react out of anger toward the pushy, hateful and intolerant aspects of the religious right. I don't necessarily agree with them but I can see some of the influences that drive them.\n \n As for the mind, brain and soul, I personally would like to believe that there is an immortal soul and that we will someday reunite with loved ones who die, but many of the findings of brain science disturb me and leave me skeptical about many views held about the soul. For example, people who have lobotomies or who have brain diseases have utterly transformed personalities, mental capabilities, etc. If it is the soul that defines these aspects, then how could that happen? If the soul does not contain a sense of personality or mental capability, then that would be very dissappointing and would give much less solace to someone grieving for a loved one - since the person they knew really would be gone forever. Perhaps some \"essence of life\" survives, but that is not nearly as emotionally sattisfying.\n \nThat may be, but why not limit reaction to the specific areas where law is trying to be changed? Or simply fight from the standpoint that it shouldn't be put into law rather than trying to debunk the belief itself (which exists independently of whether or not laws are made over it)?\n\n I personally don't support those who are trying to debunk religion all together. However, while disagreeing with them, I can understand some of the things that drive them - as I mentioned in an earlier paragraph.", 
   {}, 
   301397, 
   null, 
   1202848080.0
  ], 
  [
   301409, 
   null, 
   "HonestAbe", 
   "Freedom From Religions is as important in a secular society as Freedom of Religion. There is now right of government to force religion on the populace. Religion belongs in the churches and individual homes....not the public square. The Pledge of Allegiance should not contain reference to a supreme being. Neither should our money.", 
   {}, 
   301397, 
   null, 
   1202848800.0
  ], 
  [
   301418, 
   null, 
   "Zardoz", 
   "Are you actually saying that you have never witnessed a woman having an orgasm Zardoz? Is that why you think they are mythical mumbo jumbo? Do you have any idea what that say's about your lovemaking skills? I can very confidently attest to bringing every woman I have ever been with, except my first girlfriend to multiple orgasms. Just a tip for you, it's all about generous foreplay and putting her needs first.\n\n \n emoticon_rolleyes \n \n If you can't take 'tongue in cheek' humor (and many comedians rant on about the 'female orgasm') then you should quietly sit aside and NOT CONFESS TO YOUR SINS as a sign of success in sexual immorality.\n You get the scarlet letter award. \n \n I have never had a problem bringing my wife to orgasm if it makes any difference.\n And a tip for you, it's about accomodating the woman's desires. If she wants 'foreplay' then do it. If she don't, then maybe it's not needed. Rather than 'do it' as you seem to imply, communications and asking might be in order.\n But, I'm sure a fornicator like you'd know that.\n ;)", 
   {}, 
   301310, 
   null, 
   1202853720.0
  ], 
  [
   301421, 
   null, 
   "Archangel", 
   "Hey Zardoz, I never said I wasn't a womanizer in my youth, and I feel no compunction to apologize to you for that. But you so blatantly admitted that you believe that a woman's orgasm is Mythical mystical mumbo-jumbo that to now say it was a joke is very telling. Now you're back pedaling and actually giving me advice on lovemaking as if you now are some casanova? Don't make me laugh. Either way though, it's your wife's problem, not mine, so change your name to Romeo for all I care. But don't try to pass that statement off as a joke now because you also claimed woman's intuition is mythical mystical mumbo-jumbo and their is no scientific evidence that that exists, so at least that statement had some validity. \n \n \nemoticon_rolleyes \n \n If you can't take 'tongue in cheek' humor (and many comedians rant on about the 'female orgasm') then you should quietly sit aside and NOT CONFESS TO YOUR SINS as a sign of success in sexual immorality.\n You get the scarlet letter award. \n \n I have never had a problem bringing my wife to orgasm if it makes any difference.\n And a tip for you, it's about accomodating the woman's desires. If she wants 'foreplay' then do it. If she don't, then maybe it's not needed. Rather than 'do it' as you seem to imply, communications and asking might be in order.\n But, I'm sure a fornicator like you'd know that.\n ;)\n\n \n \nYeah, like the female orgasm and women's intuition.\n \n Mythical mystical mumbo-jumbo.\n \n But...they could be real. So we gotta look for em and believe.\n", 
   {}, 
   301418, 
   null, 
   1202860500.0
  ], 
  [
   301428, 
   null, 
   "T.Q", 
   "Hey Zardoz, I never said I wasn't a womanizer in my youth, and I feel no compunction to apologize to you for that. But you so blatantly admitted that you believe that a woman's orgasm is Mythical mystical mumbo-jumbo that to now say it was a joke is very telling. Now you're back pedaling and actually giving me advice on lovemaking as if you now are some casanova? Don't make me laugh. Either way though, it's your wife's problem, not mine, so change your name to Romeo for all I care. But don't try to pass that statement off as a joke now because you also claimed woman's intuition is mythical mystical mumbo-jumbo and their is no scientific evidence that that exists, so at least that statement had some validity.\n\n \n Anyone who's read Zardoz's posts, or has watched any stand up comedy can see it was meant as a humourous remark. The fact you insist on making it an issue is telling.", 
   {}, 
   301421, 
   null, 
   1202863440.0
  ], 
  [
   301429, 
   null, 
   "Archangel", 
   "Interesting you should say that, because I don't see a joke anywhere in his comment. If I said the same thing you would jump all over me for my sexist, chauvinistic and sexually repressive assertion. But from Zardoz it's humor? The fact that you would make excuses for him when he finally makes a sincere statement is very telling. Even if it is admitting he has never brought a woman to orgasm. \n \n \nAnyone who's read Zardoz's posts, or has watched any stand up comedy can see it was meant as a humourous remark. The fact you insist on making it an issue is telling.\n\n \n \nYeah, like the female orgasm and women's intuition.\n \n Mythical mystical mumbo-jumbo.\n \n But...they could be real. So we gotta look for em and believe.\n", 
   {}, 
   301376, 
   null, 
   1202865300.0
  ], 
  [
   301430, 
   null, 
   "T.Q", 
   "Interesting you should say that, because I don't see a joke anywhere in his comment. If I said the same thing you would jump all over me for my sexist, chauvinistic and sexually repressive assertion. But from Zardoz it's humor? The fact that you would make excuses for him when he finally makes a sincere statement is very telling. Even if it is admitting he has never brought a woman to orgasm.\n\n \n \nAnyone who's read Zardoz's posts, or has watched any stand up comedy can see it was meant as a humourous remark.\n\n \n I really don't know what more I can say here AA. The whole \"myth of the female orgasm\" schtick is pretty common in comedy, and it's not misogynistic, chauvanistic, etc. The humour comes from men reinforcing the stereotype that men only care for their own pleasure, and that the man doing the routine is unable to bring a woman to orgasm, thus showing what a bad lover he is. However, in the bit, it is not his fault. He's obviously the perfect man. If the woman can't climax, it's because the female orgasm is a myth, not because he's a substandard lover.\n \n Now that you've amply demonstrated your lack of any semblance of a sense of humour, how about you dispense with the attacks on Zardoz and get back to the point of the thread (though I still think such a thread is pointless).", 
   {}, 
   301429, 
   null, 
   1202865900.0
  ], 
  [
   301432, 
   null, 
   "HonestAbe", 
   "I am shocked. Shocked I say. Arch is a unrepentant fornicator.emoticon_wow", 
   {}, 
   301430, 
   null, 
   1202866800.0
  ], 
  [
   301478, 
   null, 
   "Zardoz", 
   "Interesting you should say that, because I don't see a joke anywhere in his comment. If I said the same thing you would jump all over me for my sexist, chauvinistic and sexually repressive assertion. But from Zardoz it's humor? The fact that you would make excuses for him when he finally makes a sincere statement is very telling. Even if it is admitting he has never brought a woman to orgasm.\n\n \n Yes Arch, people would jump all over you.\n \n Because you don't have an established history of making such comments except in the 'fun forum'. Me, I quite often make such asinine comments unless in a serious discussion. I'm a fascist member of a world controlling agency with all the trappings.\n I wonder how many of my 'sincere' comments (and there are many) you actually believe to be true.\n Seems to get to the jest of my siggy.\n -If imock you on an Internet forum...and you're too stupid to know...are you really being mocked?\n \n As for being a womanizer in your youth though...didn't you say you gave all that up many, many years ago? Like when you were 17-21ish?\n \n I think the fact that you have to jump on this type of comment is very telling.\n \n \n \n Now, why don't you go tend to any and all bastard kids you produced.\n Cause I'm sure the production of illigitimate kids is also a sign of sexual prowes.", 
   {}, 
   301429, 
   null, 
   1202913900.0
  ], 
  [
   301479, 
   null, 
   "Penfold", 
   "Not only did he jump on that particular topic, but he ignored the other half of the sentence to do so. Or does he agree that women's intuition is mythological? I've certainly suffered from it enough times to be a believer!", 
   {}, 
   301478, 
   null, 
   1202915640.0
  ], 
  [
   301493, 
   null, 
   "Archangel", 
   "Yes Arch, people would jump all over you.\n\n \n Yes they would, and it has nothing to do with my perspective on any issue either. That's why I speak my beliefs and understand that the spiritually dead will refute it no matter what it is I say.\n \n \nBecause you don't have an established history of making such comments except in the 'fun forum'. Me, I quite often make such asinine comments unless in a serious discussion.\n \n \n I agree, you normally make asinine commentary and contribute very little here in the way of real substantial opinions. Much of what you add is irrelevant mockery of the truth. But it is also very obvious when you scoff at the truth. This statement wasn't that at all. And the evidence is that woman's intuition is truly a mythical ability that can't be proven and you spoke of intuition and orgasms as examples of mystical mythical things that don't exist. You could only say such a ridiculous thing if that has been your experience. And I am only responding based on my personal experience. \n \n \nI'm a fascist member of a world controlling agency with all the trappings.\n\n \n That fact goes without saying, and it also fits with your admitted lack of skills as a lover. emoticon_wow \n \n \nI wonder how many of my 'sincere' comments (and there are many) you actually believe to be true.\n Seems to get to the jest of my siggy.\n -If imock you on an Internet forum...and you're too stupid to know...are you really being mocked?\n\n \n I really don't know because I rarely read your irrational tirades anymore. But I can usually tell when you are mocking and the post in question sounded very sincere in comparison.\n \n \nAs for being a womanizer in your youth though...didn't you say you gave all that up many, many years ago? Like when you were 17-21ish?\n\n \n I got saved at 22 yrs old. But I was very active in the bar and nightclub scene prior to that. And I got married at 25, and the wife counts doesn't she? I have always put her needs first and mine were always satisfied as a result.\n \n \nI think the fact that you have to jump on this type of comment is very telling.\n\n \n I think the fact that you believe that a female orgasm is a mythical event is very telling Zardoz. And very sad too. At least for your wife. \n \n \nNow, why don't you go tend to any and all bastard kids you produced.\n Cause I'm sure the production of illigitimate kids is also a sign of sexual prowes.\n\n \n I was a womanizer Zardoz but I wasn't irresponsible so no, I don't have any bastards floating around out there, as disappointing as that must be for you. And don't forget that it wasn't all my fault as I was often picked up by women and did nothing to provoke the affair at all. At least you can rest in the fact that this was never even a concern or issue for you though.", 
   {}, 
   301478, 
   null, 
   1202920800.0
  ], 
  [
   301501, 
   null, 
   "lesz", 
   "How so? One thing that determines if it's on the turf of science is whether or not it's even a 'proveable' matter to begin with at all. I doubt you'll find too many Christians who would say you (or they) could measurably prove God, empirically.\n\n \n You probably can't prove god exists using science, but unfortunately for religion, it usually does make a lot of real world claims about their god that CAN be tested scientifically. For example, many Christians claim their god created the world in six days and that Noah really did take all the surviving animals on to his ark. Science categorically disproves those claims, therefore that version of god is an illusion. \n \n Other Christians claim their saviour not only raised people from the dead, he raised himself from the dead, and assumed the body and soul of his mother into heaven. Now, science can't really disprove such outlandish claims, any more than it can positively disprove that Joe Sixpack got abducted and sexually molested by aliens. There are limits to what science can do or claim, as opposed to religion where anything goes. But such claims are so outlandish, so at odds with everyday reality, it is the responsibility of the claimants to prove they are true.\n \n Extraordinary claims require extraordinary proofs.\n \n You can create a version of god that is so nebulous that science cannot touch it -- but that wouldn't be a Christian god, it would be a deistic one.", 
   {}, 
   301395, 
   null, 
   1202924160.0
  ], 
  [
   301506, 
   null, 
   "jyoshu", 
   "You can create a version of god that is so nebulous that science cannot touch it -- but that wouldn't be a Christian god, it would be a deistic one.\n\n \n I disagree. I think the Christian God certainly is untouchable by science. Unless you have time machine, that is, which I doubt. In fact I think that's the really the heart of the issue--most ALL religious belief isn't really testable.", 
   {}, 
   301501, 
   null, 
   1202926620.0
  ], 
  [
   301507, 
   null, 
   "lesz", 
   "I disagree. I think the Christian God certainly is untouchable by science. Unless you have time machine, that is, which I doubt. In fact I think that's the really the heart of the issue--most ALL religious belief isn't really testable.\n\n \n Well, I suppose you can bury miracles in the past. Science can't prove they never happened, any more than they can disprove a UFO landed on your Aunt Millie's lawn in 1963 -- it's in her diaries, therefore it must have happened, right? But the analogy is apt -- that is the level of miraculous claims.\n \n But when religion makes the claim that god created the earth in six days, and science demonstrates the earth is billions of years old and species evolved from common ancestors rather than being created de novo, then that god is disproven.\n \n It doesn't mean the religious believer can't retreat to a vaguer and less testable version of his god. But frankly, an appeal to miracles may be good religion, but it's appalling science. You can't believe in miracles as a way of life, and expect science to work. There is a fundamental inconsistency there.", 
   {}, 
   301506, 
   null, 
   1202927340.0
  ], 
  [
   301510, 
   null, 
   "jyoshu", 
   "But when religion makes the claim that god created the earth in six days, and science demonstrates the earth is billions of years old and species evolved from common ancestors rather than being created de novo, then that god is disproven.\n\n \n No; rather, a specific account of creation--in terms of being scientific fact--is disproven. It doesn't disprove any god, per se.", 
   {}, 
   301507, 
   null, 
   1202927760.0
  ], 
  [
   301515, 
   null, 
   "lesz", 
   "No; rather, a specific account of creation--in terms of being scientific fact--is disproven. It doesn't disprove any god, per se.\n\n \n Oh c'mon. We have Christian Creationists claiming that their god did X, Y and Z. Scientific analysis of the geological and genetic records proves that X, Y and Z did not happen. Therefore the god of the Christian Creationists doesn't exist, because that god is inextricably associated with events X, Y and Z.\n \n Then you complain that this falsification of the Christian Creationist god doesn't disprove some other, non-Christian, non-Creationist version of god! Well, no it doesn't, but it does disprove THAT one.\n \n God is whatever religious believers define it as, and science can only address such definitions. If you feel moved to define a god in terms science can't address, feel free, but it won't be a standard, traditional Christian god -- the white haired, bearded, elderly, white male smiting people and dishing out commandments.\n \n Oh, so your version of the Christian god isn't a white haired, bearded, elderly, white male with a blood-lust and authoritarian instincts? Well, then it's a different god. Maybe there are many versions of a Christian god, but whenever Christians make claims that science can test, they get disproven.", 
   {}, 
   301510, 
   null, 
   1202928660.0
  ], 
  [
   301526, 
   null, 
   "jyoshu", 
   "Oh c'mon. We have Christian Creationists claiming that their god did X, Y and Z. Scientific analysis of the geological and genetic records proves that X, Y and Z did not happen. Therefore the god of the Christian Creationists doesn't exist, because that god is inextricably associated with events X, Y and Z.\n\n \n So is it the \"god of Christian Creationists\" you're talking about, or \"GOD\" period (as in, ANY god)? If you're talking about 'Christian creationists,' then that doesn't speak to the issue of the existence of GOD at all--only one very rigid view of GOD. And if this is the approach you're taking for Christianity in general or religion at large then it's a gross over-simplification, pure and simple. You're being more literal in your approach of the the creation story of Genesis than some fundies themselves, in terms of your demands, by making no allowance whatsoever for symbolism or story for the sake of principle! I note you've shifted from Christians to \"Christian Creationists\" though, no doubt because that's a heck of a lot easier to defend in terms of what you're saying. \n \n \nThen you complain that this falsification of the Christian Creationist god doesn't disprove some other, non-Christian, non-Creationist version of god! Well, no it doesn't, but it does disprove THAT one.\n\n \n And that's exactly the point. Religious belief is largely untestable. It's only when religious belief infringes on the turf of science that there are problems, but you seem to want to throw the whole baby out with the bathwater, regardless, when all you seem to be able to really refute are the most rigidly literal forms of religious creationism.\n \n \nIf you feel moved to define a god in terms science can't address, feel free, but it won't be a standard, traditional Christian god\n\n \n Sure it is. See, you just got done using the phrase \"Christian Creationist God\" not \"traditional Christian God.\" Now you're changing it up again. In terms of anything standard across the board in Christianity about God, there's nothing really testable. You're taking beliefs of fundamentalists who are literalists and trying to have your cake and eat it too by indicating that speaks to the existence of GOD at all, period. Look, either there's a god or there's not, regardless of how some groups think he created the universe or not.\n \n \nWell, then it's a different god. Maybe there are many versions of a Christian god, but whenever Christians make claims that science can test, they get disproven.\n\n \n So basically you're saying that all you disprove when that happens is THAT version of god, eh? Fine with me. Certainly doesn't speak to whether GOD is really there or not (as in the Divine; the Supernatural being, or whatever), only that one group's god--and even then really only that one account. See, this doesn't go unnoticed--that whenever you and other skeptics argue about this with religious people, you move to the more and more specific throughout the discussion in terms of what you're arguing about. It starts with 'the existence of GOD', then moves more specifically to \"Christian God\" then even moves more so, to \"Creationist God\". Suddenly, the only thing what you're saying really even applies to is a narrow literal interpretation. And so that's what science disproves. No problem there!", 
   {}, 
   301515, 
   null, 
   1202932020.0
  ], 
  [
   301534, 
   null, 
   "Zardoz", 
   "Shame on you archy for 'bearing false witness'.\n \n You really should lay off the personal attacks and lying you engage in.\n \n I'd suggest a bout of prayer to God asking him for forgiveness.", 
   {}, 
   301310, 
   null, 
   1202935860.0
  ], 
  [
   301552, 
   null, 
   "lesz", 
   "So is it the \"god of Christian Creationists\" you're talking about, or \"GOD\" period (as in, ANY god)?\n\n \n I'm talking about any god whose devout believers make real world claims for. All those gods are testable and potentially disprovable.\n \n \nIf you're talking about 'Christian creationists,' then that doesn't speak to the issue of the existence of GOD at all--only one very rigid view of GOD.\n\n \n Well, one very common view of god. That's the view most Christians espouse.\n \n \nAnd if this is the approach you're taking for Christianity in general or religion at large then it's a gross over-simplification, pure and simple.\n\n \n I'm not making any simpifications. Religious believers are.\n \n \nYou're being more literal in your approach of the the creation story of Genesis than some fundies themselves, in terms of your demands, by making no allowance whatsoever for symbolism or story for the sake of principle! I note you've shifted from Christians to \"Christian Creationists\" though, no doubt because that's a heck of a lot easier to defend in terms of what you're saying. \n\n \n Oh come off your high horse! I am perfectly happy to treat your bible as pure allegory. Mere metaphor. But most Christians are not -- they believe your bible is the literal truth of what happened. The problem with this notion is it isn't scientifically realistic. Therefore the religion that generates it is disproven.\n \n \nAnd that's exactly the point. Religious belief is largely untestable. It's only when religious belief infringes on the turf of science that there are problems, but you seem to want to throw the whole baby out with the bathwater, regardless, when all you seem to be able to really refute are the most rigidly literal forms of religious creationism.\n\n \n I know, I know... it comes hard to accept that a lot of religious beliefs actually are testable... and disproven. That's why many devout religious believers see science as the enemy. Science disproves their superstitions!\n \n \nSure it is. See, you just got done using the phrase \"Christian Creationist God\" not \"traditional Christian God.\" Now you're changing it up again. In terms of anything standard across the board in Christianity about God, there's nothing really testable. You're taking beliefs of fundamentalists who are literalists and trying to have your cake and eat it too by indicating that speaks to the existence of GOD at all, period. Look, either there's a god or there's not, regardless of how some groups think he created the universe or not.\n\n \n The Fundamentalists we are discussing are Christians. They believe in a god that isn't real. Their religion is disproven. I realise you can't abide the notion of disproving a religion, but science has achieved that. Get over it.\n \n \nSo basically you're saying that all you disprove when that happens is THAT version of god, eh? Fine with me. Certainly doesn't speak to whether GOD is really there or not (as in the Divine; the Supernatural being, or whatever), only that one group's god--and even then really only that one account. See, this doesn't go unnoticed--that whenever you and other skeptics argue about this with religious people, you move to the more and more specific throughout the discussion in terms of what you're arguing about. It starts with 'the existence of GOD', then moves more specifically to \"Christian God\" then even moves more so, to \"Creationist God\". Suddenly, the only thing what you're saying really even applies to is a narrow literal interpretation. And so that's what science disproves. No problem there!\n\n \n Well, you are always at liberty to argue the God of the Gaps argument. God exists everywhere science fails to find an alternative. It's a rapidly diminishing field. You are also welcome to redefine the \"Christian god\" beyond the narrow confines of Christian fundamentalists. But if you do, it's no longer the god of the bible. \n \n That god is dead. Raise whatever effigy you like in its place. It isn't the Christian god, it's a deist one.\n \n Maybe you need to read your Jefferson.", 
   {}, 
   301526, 
   null, 
   1202944620.0
  ], 
  [
   301559, 
   null, 
   "T.Q", 
   "emoticon_xbouncer Zardoz, how can i be bearing false witness when I quoted and responded to what you, yourself said? And how does that reflect on the size of anyones penis? What is establishes pretty clearly is that you are most probably a selfish lover who never took the time to learn how to bring a woman to orgasm. Because if you did, you wouldn't think female orgasms are mythical, and you would also understand that it doesn't even require a penis to bring a woman to orgasm. I get my woman off before even finishing our lovemaking sessions with intercourse. It should be obvious to you that intercourse alone doesn't last long enough to complete the process for a woman. It takes intimacy, manual manipulation and mutual interaction to even bring a woman to the place where she is orgasmic. I can tell when my wife is primed by the quivering that takes place in her stomach as her muscles contract. But I'm sure this is all beyond you.\n \n You should just quietly back out of this discussion on sexually pleasing a woman because you really are proving you're a neanderthal in bed who has no clue about actually making love. You should have taken a hint when I told you that foreplay was the key. I was telling you the truth.\n\n \n After Zardoz has told you it was said in jest, and after it was explained to you that it is an old comedy standby, the fact that you would continue on this subject reveals a lot about your own insecurities Archie.\n \n Do you think anyone cares to hear about your sex life? Maybe we should invite Matthew to this thread so he can tell us all how he pleases his lovers.", 
   {}, 
   301534, 
   null, 
   1202948040.0
  ], 
  [
   301563, 
   null, 
   "Archangel", 
   "After Zardoz has told you it was said in jest, and after it was explained to you that it is an old comedy standby, the fact that you would continue on this subject reveals a lot about your own insecurities Archie.\n \n Do you think anyone cares to hear about your sex life? Maybe we should invite Matthew to this thread so he can tell us all how he pleases his lovers.\n\n \n Since when is explaining something on this site ever believed at face value? Especially when one can read for themselves and see that nothing about it was said in humor? But nice back pedaling by both of you. And what I wrote wasn't just about my sex life TQ, but is good advice for any man who wants to be a sensitive and responsive lover. But thanks for butting in on a discussion that had nothing to do with you once again. \n \n But because you will take anything out of context and claim it was something it isn't, as in insisting it was meant to be humorous. Here is Ghost Riders post, and Zardoz's response to it as posted. Now you tell me if you still claim it was said in jest. Any more back pedaling TQ?\n \n \n \n I believe that there are certain things in this world that exist but simply can't be proven at this point in time. God, bigfoot, the Loch Ness Monster, aliens, the chupacabra, the mothman, etc. they all exist, we've seen pieces of evidence here and there that hint at them being real. Even if we can't fully prove it, people still believe in it.\n\n \n \nYeah, like the female orgasm and women's intuition.\n \n Mythical mystical mumbo-jumbo.\n \n But...they could be real. So we gotta look for em and believe.\n", 
   {}, 
   301559, 
   null, 
   1202951700.0
  ], 
  [
   301565, 
   null, 
   "Jo Bennett", 
   "\n Well, one very common view of god. That's the view most Christians espouse.\n \n \n\n \n No, it really isn't. Most Christians do not believe that Genesis account to be literally true. Most Christians are Catholic. The Vatican says the Genesis account is not literally true. Few Anglicans believe that Genesis is literally true. In fact YE creationism is largely confined to Evangelical Protestants in the US.", 
   {}, 
   301552, 
   null, 
   1202952060.0
  ], 
  [
   301569, 
   null, 
   "HonestAbe", 
   "creationism is largely confined to Evangelical Protestants in the US\n \n I think this is probably very true, Jo. These evangelicals are like brainwashed zombies.", 
   {}, 
   301565, 
   null, 
   1202952420.0
  ], 
  [
   301570, 
   null, 
   "T.Q", 
   "Since when is explaining something on this site ever believed at face value? Especially when one can read for themselves and see that nothing about it was said in humor? But nice back pedaling by both of you. And what I wrote wasn't just about my sex life TQ, but is good advice for any man who wants to be a sensitive and responsive lover. But thanks for butting in on a discussion that had nothing to do with you once again. \n \n But because you will take anything out of context and claim it was something it isn't, as in insisting it was meant to be humorous. Here is Ghost Riders post, and Zardoz's response to it as posted. Now you tell me if you still claim it was said in jest. Any more back pedaling TQ?\n\n \n Who's backpedaling? It's been explained to you-it was a joke. Everyone but you got the joke. Zardoz has said it's a joke. It's apparent just by looking at Ghost Rider's response to Zardoz, which is the classic comeback line to Zardoz's joke:\n \nThe female orgasm exists, it's the G-spot that doesn't exist.\n \n\n \n Yet you decided to make an issue out of it and use it as an excuseto brag about your prowess in bed. \n \n As for butting in, if you don't want people pointing out your flaws, try not to demonstrate them so much. Also, I'm not sure if you noticed this, but this is an open debate forum, meaning I'm free to respond to any thread, just as you are. And you'll also notice that I pointed out it was a joke, explained the joke to you, then said this:\n \nNow that you've amply demonstrated your lack of any semblance of a sense of humour, how about you dispense with the attacks on Zardoz and get back to the point of the thread (though I still think such a thread is pointless).\n\n But nope, you have to keep talking about your sexual prowess. Wotta Man! We get it emoticon_rolleyes \n \n Now, want to drop it and actually take part in the discussion that's going on around you? If you haven't gotten the joke yet, you probably never will, and I'm pretty much done trying to explain it to you.", 
   {}, 
   301563, 
   null, 
   1202952780.0
  ], 
  [
   301572, 
   null, 
   "Archangel", 
   "Like I said TQ, your explanations don't carry much weight around here. But I have made my point and see no reason to beat a dead horse.", 
   {}, 
   301570, 
   null, 
   1202953200.0
  ], 
  [
   301576, 
   null, 
   "T.Q", 
   "Like I said TQ, your explanations don't carry much weight around here. But I have made my point and see no reason to beat a dead horse.\n\n \n Whatever you have to tell yourself Archie.", 
   {}, 
   301572, 
   null, 
   1202953620.0
  ], 
  [
   301578, 
   null, 
   "Archangel", 
   "Whatever you have to tell yourself Archie.\n\n \n I wasn't telling myself that TQ, I was telling you.", 
   {}, 
   301576, 
   null, 
   1202954640.0
  ], 
  [
   301579, 
   null, 
   "Archangel", 
   "No; rather, a specific account of creation--in terms of being scientific fact--is disproven. It doesn't disprove any god, per se.\n\n \n And the battle between evo and creation continues in Europe too.\n \n http://www.theledger.com/article/20080209/BREAKING/360127402", 
   {}, 
   301510, 
   null, 
   1202954760.0
  ], 
  [
   301582, 
   null, 
   "Archangel", 
   "And here's a thought provoking article...\n \n http://news.google.com/news/url?sa=t&ct=us/2-0&fp=47b3d1a91c2c87e9&ei=74SzR7ukFqbiyATSwaS9DQ&url=http%3A//www.pressconnects.com/apps/pbcs.dll/article%3FAID%3D/20080210/OPINION/802100358/1005/OPINION&cid=0\n More responses to the evolution vs. creationism debate\n \n Clair Wilson, Chemung\n \n Evolutionary theory is just that -- an unproven theory.\n \n If we consider all life which either currently exists on earth, or has existed but is now extinct, we have absolutely no direct, observable proof that any of it evolved from something lesser. The assertion that life evolved from the soup 4 billion years ago was never observed and is not provable and not reproducible in the lab. It is just a theory.\n \n To suppose that nothingness invented a living, self-replicating cell is preposterous. Thousands of scientists currently know exactly what is in a cell, yet we cannot manufacture one single living cell. If all current intelligence on earth cannot create one single living cell, how are we supposed to believe the fairy tale that utter nothingness (total lack of intelligence) created all life on earth? Utterly ridiculous.\n \n Even if one cell could have been produced by accident, how could it have lived to replicate itself and produce all that has existed on earth?\n \n The following is a list of realities which are totally unexplained by evolution, and which logically could have been produced only by an intelligent force or being greater than ourselves: There is no proof that any body organ evolved from something lesser.\n \n The brain. (Thought. Memory. Intelligence.)\n \n Four-chambered heart. First a single-chambered heart, then a two-chambered heart, then a four-chambered heart? Utterly ridiculous. Never happened. Either the human heart works perfectly with four chambers, or the creature dies. Partial chambers even today cause the death of the child.\n \n The heart is a muscle, which gets fed from blood which gets pumped by the heart. Therefore, the heart feeds itself, so that it can feed the rest of the body. Blood had to exist in its current form also in order to carry the nutrients to the heart. There is not time in any of this for anything to \"evolve\" Everything had to work perfectly the first time, or else nothing would have worked.\n \n Stomach. Intestines. Bladder. Liver. Pituitary gland? Skeletal system? Endocrine system? Digestive system?\n \n Feeling? Taste? Smell? Hearing? Electrical pulse generation and electrical flow.\n \n Sight is too complex to have evolved. We see an image which is created by an incredibly complex neurological and electrical flow of impulses, which are combined by the brain (nobody knows how) to produce an image in the brain which we call sight.\n \n Animal instinct. The creature could NOT have survived unless instinct was functioning perfectly. The only answer is that instinct was fully developed on day 1, otherwise the creatures could never have survived to further evolve.\n \n How could sexual reproduction evolve? It either works to produce the next generation, or else there is no next generation for evolution to work on.\n \n Thousands of symbiotic relationships in nature which evolutionists have no explanation for. We can't have bees without flowers, and we can't have flowers without bees. We can't have a functional queen bee without worker bees, and we can't have worker bees without the queen bee. So which came first? And how could any of them survive unless the flowers were already perfectly formed so that they could supply the bees with pollen? And vice versa.\n \n Which came first? The chicken or the egg? The elm seed or the elm tree? The oak tree or the acorn? Sperm and egg both evolved independently at the same time? That is pure fantasy.\n \n This is the crux of intelligent design. It really has absolutely nothing to do with organized religion. It is just intelligent people asking intelligent questions which need to be answered before we can come to ANY conclusions as to how we got here. And there is absolutely nothing unscientific about that. It is pure science borne out of love for the facts, the truth, a reality.\n \n Science has never proven and cannot prove that we were not created. So how can we say that we were not created? We can't. It is impossible to prove that God does not exist. Why not proceed with the inquiry. That is scientific thought\n \n What are the evolutionists so afraid of? A little competition in the arena of public thought?", 
   {}, 
   301579, 
   null, 
   1202955420.0
  ], 
  [
   301594, 
   null, 
   "electrolyte", 
   "And here's a thought provoking article...\n\n A \"thought provoking article\"? It's a letter to the editor written by a scientifically illiterate XXXXX.\n \n On second thought, no wonder you found it \"thought provoking\"...\n \n \"OMG TEH EYE CANNOT EVLOVE COS IT AER TWO COMMPLEXTICATED!!~!#~!!11one\"\n \n This is what passes in Archieland for impeccable logic.", 
   {}, 
   301582, 
   null, 
   1202960880.0
  ], 
  [
   301595, 
   null, 
   "T.Q", 
   "Heh, anyone want to go throught that article and list the errors? I would, but I don't have 2-3 hours to spend. \n That's the nice thing about being a creationist. You can just spout stuff off without bothering to research it. Then, the guy who's stuck showing how your wrong spends a few hours to show how your 2-3 sentences are wrong and why.\n \n And speaking of derailing threads Archie...", 
   {}, 
   301594, 
   null, 
   1202961180.0
  ], 
  [
   301596, 
   null, 
   "Archangel", 
   "A \"thought provoking article\"? It's a letter to the editor written by a scientifically illiterate XXXXX.\n \n On second thought, no wonder you found it \"thought provoking\"...\n \n \"OMG TEH EYE CANNOT EVLOVE COS IT AER TWO COMMPLEXTICATED!!~!#~!!11one\"\n \n This is what passes in Archieland for impeccable logic.\n\n \n Interesting, because anyone can see that her opinion was far more intelligently outlined than your moronic and juvenile attack against me.", 
   {}, 
   301594, 
   null, 
   1202961420.0
  ], 
  [
   301598, 
   null, 
   "T.Q", 
   "Interesting, because anyone can see that her opinion was far more intelligently outlined than your moronic and juvenile attack against me.\n\n \n It really wan't more intelligently outlined. All these unanswered questions have been answered for years. And I would almost bet that the explanations have been given to you before. That is why Electrolyte's response was what it was. These \"problems\" are only problems to those who don't know, and don't care to know, anything about biology or the ToE.", 
   {}, 
   301596, 
   null, 
   1202962080.0
  ], 
  [
   301600, 
   null, 
   "electrolyte", 
   "Interesting, because anyone can see that her opinion was far more intelligently outlined than your moronic and juvenile attack against me.\n\n How does a statement of fact qualify as an attack?\n \n Find one evolutionary biologist who claims that the sperm and the egg evolved independently.\n You won't, because not any biologist does. Your letter-to-the-editor author is a dunce.\n \n There are numerous species of animals that have eyes in various stages of development. To say that there is no way the eye can evolve is (1) an argument from ignorance, a fallacy, and (2) directly contradictory to evidence that can be seen by anybody who doesn't have her head up her XXX.\n This statement is directed at the author, but considering you see nothing wrong with her claim...\n \n We have observed numerous instances of speciation. Your author says that there is no evidence for such.\n You know, except that we've seen it happen. A lot. The author is an absolute dipstick.\n \n Ignorant of the facts, relying upon fallacies, fabricating claims... And she's your hero.\n \n I have no need to be juvenile. The facts alone make you and your friend look \"moronic\" all by themselves.", 
   {}, 
   301596, 
   null, 
   1202962440.0
  ], 
  [
   301602, 
   null, 
   "jyoshu", 
   "Well, one very common view of god. That's the view most Christians espouse.\n\n \n Prove it.\n \n \nI know, I know... it comes hard to accept that a lot of religious beliefs actually are testable... \n\n \n Well sure, the ones that are testable are certainly indeed testable. emoticon_frazzled You're the one who seems to think untestable beliefs are testable/disprovable.\n \n \nThe Fundamentalists we are discussing are Christians. They believe in a god that isn't real. Their religion is disproven. I realise you can't abide the notion of disproving a religion, but science has achieved that. Get over it.\n\n \n So because fundies are Christians, and you disprove something fundies say, you've disproven the Christian religion at large?? No offense, but it seems you need a bit of practice with straightforward logic. I don't know why you don't seem to get this, but in terms of the creation story, the only \"religion\" that's been 'disproven' is that one account in the Bible actually took place literally. That's all. You seem to think that somehow disproves Christianity or even one group's entire religion, but frankly that's pretty silly. And it SURE doesn't much speak to the overall question of the existence of GOD, which is where you started with this whole logical quagmire you've gotten yourself into here.\n \n \nWell, you are always at liberty to argue the God of the Gaps argument. God exists everywhere science fails to find an alternative. It's a rapidly diminishing field. You are also welcome to redefine the \"Christian god\" beyond the narrow confines of Christian fundamentalists. But if you do, it's no longer the god of the bible.\n\n \n Only if you're a literalist. Like I said, you're apparently quite the literalist yourself! As far as your 'God of the gaps' thing, you're setting up a false dichotomy by not taking into account the 1000 lb elephant that God Himself could have set in place the laws and of nature that science discovers. (e.g. theistic evolution.) So the idea of God is certainly not confined to scientific gaps. \n \n \nThat god is dead. Raise whatever effigy you like in its place. It isn't the Christian god, it's a deist one.\n\n \n Nope, the Christian one. Unfortunately for you, the central tenets of the Christian faith are untestable. Unless, again, you have a time machine. (Did you actually think your 6-day-creationism example was a central tenet???? No way.) Look, you aren't going to kill GOD, so stop this silly crusade and give up this chip on your sholder. Learn to abide religion. It's learning to abide science, but you're going to have to accept religion as well. Religion is not going away, no matter how much you want it to, and no matter how much science discovers. People will always have faith and a desire for mystery in their lives, thank goodness.", 
   {}, 
   301600, 
   null, 
   1202962800.0
  ], 
  [
   301603, 
   null, 
   "T.Q", 
   "Prove it.\n \n \n \n Well sure, the ones that are testable are certainly indeed testable. emoticon_frazzled You're the one who seems to think untestable beliefs are testable/disprovable.\n \n \n \n So because fundies are Christians, and you disprove something fundies say, you've disproven the Christian religion at large?? No offense, but it seems you need a bit of practice with straightforward logic. I don't know why you don't seem to get this, but in terms of the creation story, the only \"religion\" that's been 'disproven' is that one account in the Bible actually took place literally. That's all. You seem to think that somehow disproves Christianity or even one group's entire religion, but frankly that's pretty silly. And it SURE doesn't much speak to the overall question of the existence of GOD, which is where you started with this whole logical quagmire you've gotten yourself into here.\n \n \n \n Only if you're a literalist. Like I said, you're apparently quite the literalist yourself! As far as your 'God of the gaps' thing, you're setting up a false dichotomy by not taking into account the 1000 lb elephant that God Himself could have set in place the laws and of nature that science discovers. (e.g. theistic evolution.) So the idea of God is certainly not confined to scientific gaps. \n \n \n \n Nope, the Christian one. Unfortunately for you, the central tenets of the Christian faith are untestable. Unless, again, you have a time machine. (Did you actually think your 6-day-creationism example was a central tenet???? No way.) Look, you aren't going to kill GOD, so stop this silly crusade. Learn to abide religion. It's learning to abide science, but you're going to have to accept religion as well. Religion is not going away, no matter how much you want it to, and no matter how much science discovers. People will always have faith and a desire for mystery in their lives, thank goodness.\n\n \n \n Sorry Lesz, Jyoshu's right here. The creationist version of events has been disproven. Hell, it was disproven by creationists who set out to prove it! That doesn't however mean that god, whether it be the christian god or not, has been disproven. Science cannot disprove the existence of god. As soon as you look at the supernatural, you're looking outside the realm of science. However, if religion makes claims on the natural world, those can be investigated by science.", 
   {}, 
   301602, 
   null, 
   1202962980.0
  ], 
  [
   301607, 
   null, 
   "GiantOreo", 
   "emoticon_xbouncer Zardoz, how can i be bearing false witness when I quoted and responded to what you, yourself said? And how does that reflect on the size of anyones penis? What is establishes pretty clearly is that you are most probably a selfish lover who never took the time to learn how to bring a woman to orgasm. Because if you did, you wouldn't think female orgasms are mythical, and you would also understand that it doesn't even require a penis to bring a woman to orgasm. I get my woman off before even finishing our lovemaking sessions with intercourse. It should be obvious to you that intercourse alone doesn't last long enough to complete the process for a woman. It takes intimacy, manual manipulation and mutual interaction to even bring a woman to the place where she is orgasmic. I can tell when my wife is primed by the quivering that takes place in her stomach as her muscles contract. But I'm sure this is all beyond you.\n \n You should just quietly back out of this discussion on sexually pleasing a woman because you really are proving you're a neanderthal in bed who has no clue about actually making love. You should have taken a hint when I told you that foreplay was the key. I was telling you the truth.\n\n \n Yes Archie, we get it - you think you are god's gift to women. Personally I feel sorry for your wife having to put up with someone like you. Now, if you are quite done with your Ego Masturbation, could we get back to the actual TOPIC? emoticon_xdonno emoticon_xdonno emoticon_xdonno emoticon_xdonno", 
   {}, 
   301534, 
   null, 
   1202963460.0
  ], 
  [
   301609, 
   null, 
   "GiantOreo", 
   "Sorry Lesz, Jyoshu's right here. The creationist version of events has been disproven. Hell, it was disproven by creationists who set out to prove it! That doesn't however mean that god, whether it be the christian god or not, has been disproven. Science cannot disprove the existence of god. As soon as you look at the supernatural, you're looking outside the realm of science. However, if religion makes claims on the natural world, those can be investigated by science.\n\n \n Yep, Gotta agree with TQ and Jyoshu here.", 
   {}, 
   301603, 
   null, 
   1202963520.0
  ], 
  [
   301613, 
   null, 
   "Archangel", 
   "It really wan't more intelligently outlined. All these unanswered questions have been answered for years. And I would almost bet that the explanations have been given to you before. That is why Electrolyte's response was what it was. These \"problems\" are only problems to those who don't know, and don't care to know, anything about biology or the ToE.\n\n \n Actually, the answers that evolution adherents accept aren't really answers of anything at all. They are not proven or supported by anything real or concrete. They are self delusions that people who need to believe this myth accept in spite of the fact that none of what they believe will ever be proven in true scientific terms. And you know why? Because it's all based on a lie. It's as simple as that.\n \n And what is so funny is that these same adherents of evolution will call the people who are smart enough to see through this secular humanist scam, ignorant and stupid. So go on you geniuses, explain for me how sight actually works. That is what lyte made fun of. So go ahead, explain this process and show me how it has been duplicated in a lab proving that sight came about by natural means. I quote from the article you mock yet once again don't refute.\n \n \nSight is too complex to have evolved. We see an image which is created by an incredibly complex neurological and electrical flow of impulses, which are combined by the brain (nobody knows how) to produce an image in the brain which we call sight.\n \n \n http://news.google.com/news/url?sa=t&ct=us/2-0&fp=47b3d1a91c2c87e9&ei=74SzR7ukFqbiyATSwaS9DQ&url=http%3A//www.pressconnects.com/apps/pbcs.dll/article%3FAID%3D/20080210/OPINION/802100358/1005/OPINION&cid=0", 
   {}, 
   301598, 
   null, 
   1202964120.0
  ], 
  [
   301614, 
   null, 
   "Archangel", 
   "Yes Archie, we get it - you think you are god's gift to women. Personally I feel sorry for your wife having to put up with someone like you. Now, if you are quite done with your Ego Masturbation, could we get back to the actual TOPIC? emoticon_xdonno emoticon_xdonno emoticon_xdonno emoticon_xdonno\n\n \n Trolling again cookie? emoticon_xdonno emoticon_xdonno emoticon_xdonno emoticon_xdonno", 
   {}, 
   301607, 
   null, 
   1202964240.0
  ], 
  [
   301627, 
   null, 
   "obvious_child", 
   "Actually, the answers that evolution adherents accept aren't really answers of anything at all. They are not proven or supported by anything real or concrete. \n\n \n Wrong.\n \n http://www.4forums.com/political/showthread.php?t=10884\n \n Furthermore, even if evolution was wrong, creationism would be no further to the truth. Creationists have always failed to prove their belief on its own merits and thus relied on the fallacy of an false dichotomy. One surefire way of having creationists flee is to add another religion's creation story to the fight. When placed next to another factless belief, biblical creationism has nothing to run on and can't attack the other stories as neither has any evidence.\n \n \nSight is too complex to have evolved. We see an image which is created by an incredibly complex neurological and electrical flow of impulses, which are combined by the brain (nobody knows how) to produce an image in the brain which we call sight.\n\n \n Translation: Don't know, Goddidit.\n \n And we are suppose to teach that to kids?", 
   {}, 
   301613, 
   null, 
   1202966520.0
  ], 
  [
   301638, 
   null, 
   "Archangel", 
   "Wrong.\n \n http://www.4forums.com/political/showthread.php?t=10884 \n\n \n Are you actually posting something you wrote as evidence of anything? Repeat after me child, self deluded e-g-o-m-a-n-i-a-c. But unfortunately, it isn't worth the cyber space it's written in. \n \n \nFurthermore, even if evolution was wrong, creationism would be no further to the truth. Creationists have always failed to prove their belief on its own merits and thus relied on the fallacy of an false dichotomy. One surefire way of having creationists flee is to add another religion's creation story to the fight. When placed next to another factless belief, biblical creationism has nothing to run on and can't attack the other stories as neither has any evidence.\n\n \n You mean no \"closer\" to the truth. But anyway, You are again wrong and making huge assumptions which are based on nothing. I admit that God can't be proven in a lab, but as I've said a thousand times He will reveal Himself to each of us personally because He is a personal God. \n \n But I notice once again you COMPLETELY IGNORE my challenge that your boyfriends who also mocked the article have refused to answer to also. So let's have it child. Dazzle us with your genius.\n \n \nActually, the answers that evolution adherents accept aren't really answers of anything at all. They are not proven or supported by anything real or concrete. They are self delusions that people who need to believe this myth accept in spite of the fact that none of what they believe will ever be proven in true scientific terms. And you know why? Because it's all based on a lie. It's as simple as that.\n \n And what is so funny is that these same adherents of evolution will call the people who are smart enough to see through this secular humanist scam, ignorant and stupid. So go on you geniuses, explain for me how sight actually works. That is what lyte made fun of. So go ahead, explain this process and show me how it has been duplicated in a lab proving that sight came about by natural means. I quote from the article you mock yet once again don't refute.\n\n \n \n \nSight is too complex to have evolved. We see an image which is created by an incredibly complex neurological and electrical flow of impulses, which are combined by the brain (nobody knows how) to produce an image in the brain which we call sight.\n \n", 
   {}, 
   301627, 
   null, 
   1202969220.0
  ], 
  [
   301639, 
   null, 
   "electrolyte", 
   "But I notice once again you COMPLETELY IGNORE my challenge that your boyfriends who also mocked the article have refused to answer to also. So let's have it child. Dazzle us with your genius.\n\n You say this as if it's hard. Yawn.", 
   {}, 
   301638, 
   null, 
   1202969400.0
  ], 
  [
   301643, 
   null, 
   "Archangel", 
   "You say this as if it's hard. Yawn.\n\n \n You yawn as if you answered the question lyte. Where have the scientists created an eye in any lab, thus proving by repeated experiments the process of it evolving from natural sources? We know the process of how the eye works, but we can't duplicate because we don't really know HOW it works. We don't know how it converts the neurological and electrical impulses into sight that registers as information in the human or animals brain. \n \n So thanks for acting like your smart and bored with my infantile question, and your shallow attempt to again sleaze by with out actually answering the question. But if you can answer, I'm still waiting. But don't worry, I know you can't.", 
   {}, 
   301639, 
   null, 
   1202971560.0
  ], 
  [
   301647, 
   null, 
   "electrolyte", 
   "You yawn as if you answered the question lyte. Where have the scientists created an eye in any lab, thus proving by repeated experiments the process of it evolving from natural sources?\n\n If someone kills your wife while you're away at work so that there are no witnesses, do you just give up looking for the killer because you won't be able to \"prove\" that he's guilty because you can't get him to kill your wife again?\n \n See, even you know that your requirements are ridiculous. Literal repetition and replication are good, but the lack of either is not grounds for declaring lack of proof or for showing unreasonableness. The fact is that we observe developmental stages of the eye in the real world.\n \n \nWe know the process of how the eye works, but we can't duplicate because we don't really know HOW it works. We don't know how it converts the neurological and electrical impulses into sight that registers as information in the human or animals brain.\n\n So what? Why would that information be required in order to know that the eye evolved? Do you need to know the precise reordering of atoms in oxidizing gunpowder to know that the bullet it projects can kill?\n \n \nSo thanks for acting like your smart and bored with my infantile question, and your shallow attempt to again sleaze by with out actually answering the question. But if you can answer, I'm still waiting. But don't worry, I know you can't.\n\n Acting like my smart and bored, huh? Not too effective a magnanimous pout, if I may say so.\n Of course you're still waiting. I show that we have plenty of evidence that the eye evolved, and then you suddenly want somebody to explain to you in a post what researchers have published probably thousands of articles discussing. Combine this with the fact that you have virtually no understanding of biochemistry (or electrical impulses, Professor Quantum Mechanics), and it becomes clear that even without your complete lack of desire to actually learn, you'd be lost. But if it makes you feel any better, I'll put this in terms that you might understand: If we had no idea how this worked, how could we be restoring partial sight to blind people with electronics?", 
   {}, 
   301643, 
   null, 
   1202973840.0
  ], 
  [
   301648, 
   null, 
   "obvious_child", 
   "Are you actually posting something you wrote as evidence of anything?\n\n \n In this case, those aren't my words. Those are verbatim quotes from an practicing biologist and geologist. If you bothered to check them, you'd notice that as I've given credit to them. \n \n \nRepeat after me child, self deluded e-g-o-m-a-n-i-a-c. But unfortunately, it isn't worth the cyber space it's written in.\n\n \n Good thing I'm going to report you for another TOS violation. Thanks for the fodder. And thanks for again showing you have no argument but personal insults. Which by the way you were warned by the admin for. Did you forget that? \n \n \nYou mean no \"closer\" to the truth.\n\n \n Where it is right now, it's the distance is the same. \n \n \nBut anyway, You are again wrong and making huge assumptions which are based on nothing.\n\n \n Because you said so and have no argument to back up anything you've stated about anyone. \n \n Are you going to call me an liar now? emoticon_xgood \n \n \nI admit that God can't be proven in a lab, but as I've said a thousand times He will reveal Himself to each of us personally because He is a personal God.\n\n \n Your God is no more real then Thor. And evolution does not reject God. And you have repeatively ignored how literal genesis makes God an liar.\n \n \nBut I notice once again you COMPLETELY IGNORE my challenge that your boyfriends who also mocked the article have refused to answer to also. So let's have it child. Dazzle us with your genius.\n\n \n What challenge?\n \n I already posted several concrete supports of evolution. You didn't even bother to read the links.\n \n Therefore you are wrong as your challenge has been met. \n \n Intelligent Design is nothing more then \"can't explain = Goddidit\"\n \n Watch. you claim that sight it too complex to come on its own, therefore Goddidit. \n \n Let's go back 10,000 years. No one knew why the seasons came. Therefore since it was too complex to explain, Goddidit. God caused the rain, God caused the seasons. Let's go back just 100 years. No one knew what El Nino was. Therefore since we couldn't explain it at the time, Goddidit. \n \n Your argument as for why ID is valid is the same reason for why God is the reason the sun sets.", 
   {}, 
   301638, 
   null, 
   1202974140.0
  ], 
  [
   301659, 
   null, 
   "lesz", 
   "Prove it.\n\n \n All I have to do is ask them or post some of the driveling apologetics that get posted on websites.\n \n\n Well sure, the ones that are testable are certainly indeed testable. emoticon_frazzled You're the one who seems to think untestable beliefs are testable/disprovable.\n\n \n Naturally you are frazzled about it, because of course I've made no such claim. I have said that many common religious beliefs are not only disprovable, but have been disproven. For example, the literal god of Genesis. Therefore the gods associated with such beliefs cannot exist the way they are imagined to by those poor, deluded believers.\n \n \nSo because fundies are Christians, and you disprove something fundies say, you've disproven the Christian religion at large?? No offense, but it seems you need a bit of practice with straightforward logic. I don't know why you don't seem to get this, but in terms of the creation story, the only \"religion\" that's been 'disproven' is that one account in the Bible actually took place literally. That's all. You seem to think that somehow disproves Christianity or even one group's entire religion, but frankly that's pretty silly. And it SURE doesn't much speak to the overall question of the existence of GOD, which is where you started with this whole logical quagmire you've gotten yourself into here.\n\n \n All you lot do is keep moving the goalposts. When one version of your religion gets drop kicked by rational analysis, you move the posts and smugly claim no goal was scored! At this rate, you'll become a devout deist rather than a theist! There are Christian deists and even atheists out there, though they are thin on the ground compared with Christian Creationists.\n \n \nOnly if you're a literalist. Like I said, you're apparently quite the literalist yourself! As far as your 'God of the gaps' thing, you're setting up a false dichotomy by not taking into account the 1000 lb elephant that God Himself could have set in place the laws and of nature that science discovers. (e.g. theistic evolution.) So the idea of God is certainly not confined to scientific gaps. \n \n \n Science is about real things. I am not a literalist, but a naturalistic realist. Science cannot yet address questions of why is there something rather than nothing, or why the universe operates by laws rather than being totally chaotic. I don't know if human science will ever manage to address such questions.\n \n However, it is you who are committing a logical whopper by assuming that because science cannot answer this question, therefore your version of god exists! You are setting up the false dichotomy of either science or Jesus. Even if science doesn't have the answers, that doesn't in any way, shape or form \"prove\" that Jesus is real, or the only conceivable alternative. \n \n \nNope, the Christian one. Unfortunately for you, the central tenets of the Christian faith are untestable. Unless, again, you have a time machine.\n\n \n But we DO have a time machine of sorts -- we have historical sciences such as geology and genetics that prove the god of Genesis didn't work the way his believers claimed he did. Historical events leave residues in the present, and it's possible to analyse the present and infer past events that generated it. So you need some other sort of god if you insist on worshipping a deity.\n \n \n (Did you actually think your 6-day-creationism example was a central tenet???? No way.) Look, you aren't going to kill GOD, so stop this silly crusade and give up this chip on your sholder. Learn to abide religion. It's learning to abide science, but you're going to have to accept religion as well. Religion is not going away, no matter how much you want it to, and no matter how much science discovers. People will always have faith and a desire for mystery in their lives, thank goodness.\n\n \n It's a core tenet for many, probably most Christians. More than half the population in the US claims to believe in the god of Genesis as being literally true. Or are you going for the usual dodge of claiming they aren't \"real Christians\"?\n \n And yes, it's true I can't \"kill god\". I can't kill Santa Claus, either, for similar reasons. Most people may always have a hankering for mysticism, but i wouldn't regard that as an unbridled boon. It gets them into trouble as often as not.", 
   {}, 
   301602, 
   null, 
   1202989440.0
  ], 
  [
   301661, 
   null, 
   "Jo Bennett", 
   "\n It's a core tenet for many, probably most Christians. More than half the population in the US claims to believe in the god of Genesis as being literally true. Or are you going for the usual dodge of claiming they aren't \"real Christians\"?\n \n\n \n US=/=Christianity. The US has more than its fair share of literalists, due to the leanings of the puritans who were among the early colonists. I've already pointed out that at least half the world's Christians, those who are Roman Catholic, are not YE creationists.\n \n As to the claim that there are Christian deists, that makes no sense at all. A deist maintains that God does not intervene in his creation. The entire Bible is the story of God's intervention in creation, and ultimately of his direct participation in the person of Jesus Christ.", 
   {}, 
   301659, 
   null, 
   1202992140.0
  ], 
  [
   301665, 
   null, 
   "T.Q", 
   "Actually, the answers that evolution adherents accept aren't really answers of anything at all. They are not proven or supported by anything real or concrete. They are self delusions that people who need to believe this myth accept in spite of the fact that none of what they believe will ever be proven in true scientific terms. And you know why? Because it's all based on a lie. It's as simple as that.\n \n And what is so funny is that these same adherents of evolution will call the people who are smart enough to see through this secular humanist scam, ignorant and stupid. So go on you geniuses, explain for me how sight actually works. That is what lyte made fun of. So go ahead, explain this process and show me how it has been duplicated in a lab proving that sight came about by natural means. I quote from the article you mock yet once again don't refute.\n \n \n \n http://news.google.com/news/url?sa=t&ct=us/2-0&fp=47b3d1a91c2c87e9&ei=74SzR7ukFqbiyATSwaS9DQ&url=http%3A//www.pressconnects.com/apps/pbcs.dll/article%3FAID%3D/20080210/OPINION/802100358/1005/OPINION&cid=0\n\n Start a new thread if you want. Why derail this one? Why even bother however. You don't want answers. You're already convinced that there are no answers. \n \n Either way, no one should post anymore on this topic in this thread. Lesz and Jyoshu are having a decent discussion here. Let Archie start a new thread on the C vs E forums if he wants.", 
   {}, 
   301613, 
   null, 
   1202997300.0
  ], 
  [
   301672, 
   null, 
   "HonestAbe", 
   "\"I cannot believe in the immortality of the soul. . . . I am an aggregate of cells, as, for instance, New York City is an aggregate of individuals. Will New York City go to heaven? . . . . No; nature made us--nature did it all--not the gods of the religions.\"\n -- Thomas Alva Edison, The New York Times, Oct. 2, 1910 (\"No Immortality of the Soul\" Says Thomas A. Edison, interview by Edward Marshall) \n \n An aggregate of cells....that pretty much explains who we are.\n \n www.ffrf.org", 
   {
    "post_info": {
     "post_title": "Another Free Thinker"
    }, 
    "unicode_changes_made": true
   }, 
   301665, 
   null, 
   1203001380.0
  ], 
  [
   301673, 
   null, 
   "HonestAbe", 
   "\"I can indeed hardly see how anyone ought to wish Christianity to be true; for if so the plain language of the text seems to show that the men who do not believe, and this would include my Father, Brother, and almost all my best friends, will be everlastingly punished. And this is a damnable doctrine.\"\n -- Charles Darwin, Autobiography \n \n www.ffrf.org", 
   {
    "post_info": {
     "post_title": "Darwin himself."
    }, 
    "unicode_changes_made": true
   }, 
   301672, 
   null, 
   1203001500.0
  ], 
  [
   301674, 
   null, 
   "HonestAbe", 
   "Mr. Lincoln was never a member of any Church, nor did he believe in the divinity of Christ, or the inspiration of the Scriptures in the sense understood by evangelical Christians.\n \n When a boy, he showed no sign of that piety which his many biographers ascribe to his manhood. When he went to church at all, he went to mock, and came away to mimic.\n \n When he came to New Salem, he consorted with Freethinkers, joined with them in deriding the gospel story of Jesus, read Volney and Paine, and then wrote a deliberate and labored essay, wherein he reached conclusions similar to theirs.\"\n -- Colonel Ward H. Lamon (a religionist and Lincoln's longtime friend), Life of Abraham Lincoln, pp. 486, 487, 157 (1872), cited by Franklin Steiner in The Religious Beliefs of Our Presidents \n \n \n www.ffrf.org", 
   {
    "post_info": {
     "post_title": "Lincoln and Darwin were born Feb. 12, 1809"
    }, 
    "unicode_changes_made": true
   }, 
   301673, 
   null, 
   1203001620.0
  ], 
  [
   301678, 
   null, 
   "lesz", 
   "US=/=Christianity.\n\n \n Point taken. Although I'm back in Britain now, I've spent virtually all my adult life in the US, which gives me a somewhat biased perspective. However, I have noticed considerable efforts to export American fundamentalism to Britain and other British ex-colonies, so let's not speak too soon!\n \n \nThe US has more than its fair share of literalists, due to the leanings of the puritans who were among the early colonists. I've already pointed out that at least half the world's Christians, those who are Roman Catholic, are not YE creationists.\n\n \n Still, you might be surprised how many Catholics have fairly literal interpretations of the bible. And I've heard some pretty fundamentalist noises coming out of Herr Ratzinger's Vatican. \n \n \nAs to the claim that there are Christian deists, that makes no sense at all. A deist maintains that God does not intervene in his creation. The entire Bible is the story of God's intervention in creation, and ultimately of his direct participation in the person of Jesus Christ.\n\n \n By Christian deist I mean someone, for example someone such as Ken Miller, who appears to believe that god set things in motion according to natural laws, allows the universe generally to operate according to such laws, but then made himself manifest as the Christ to some of the self-aware products of evolution, i.e. Christians. Such Christians do not necessarily believe that every story of miracles in the bible is literally true -- they tend to look on the bible as allegory. (Not that I agree with that sort of thinking, but it does mean one can be a deist and Christian as well.)\n \n I'll go further and claim there are Christian atheists! I may even be one, because I was raised a Christian (Catholic), and I see things in Christ's teachings that I can admire, such as the Sermon on the Mount, while completely rejecting bogus claims of his divinity. If one accepts Christ's secular teachings, can't one be regarded as a Christian? And if Christianity is such an exclusive club, who is it gets to select its membership? You? The pope? Pat Robertson?", 
   {}, 
   301661, 
   null, 
   1203005520.0
  ], 
  [
   301680, 
   null, 
   "jyoshu", 
   "US=/=Christianity. The US has more than its fair share of literalists, due to the leanings of the puritans who were among the early colonists. I've already pointed out that at least half the world's Christians, those who are Roman Catholic, are not YE creationists.\n\n \n For that matter, I seriously doubt it's even a fundamental tenet of most churches in the U.S. Maybe to certain churches in the Bible belt.", 
   {}, 
   301661, 
   null, 
   1203005880.0
  ], 
  [
   301681, 
   null, 
   "jyoshu", 
   "Science is about real things. I am not a literalist, but a naturalistic realist. Science cannot yet address questions of why is there something rather than nothing, or why the universe operates by laws rather than being totally chaotic. I don't know if human science will ever manage to address such questions.\n \n However, it is you who are committing a logical whopper by assuming that because science cannot answer this question, therefore your version of god exists! You are setting up the false dichotomy of either science or Jesus. Even if science doesn't have the answers, that doesn't in any way, shape or form \"prove\" that Jesus is real, or the only conceivable alternative. \n\n \n Nope, that's where your especially wrong. This is not a case of me trying to prove to you GOD exists. This is a case of you (atheists) shoving someone and saying prove to me your belief (when in fact my belief is actually personal). That's why the retort is often that you can't disprove God, because frankly, most believers are probably content with their belief--they have no need to prove it to you. The need is obviously on your end. YOU'RE not content with their belief.\n \n And it's not me juxtaposing science and Jesus--it's you. I have no problem with the idea that God is behind science. That doesn't require deism at all, by the way (which involves a god uninvolved in his universe rather than one actively keeping it's laws going). \n \n \nBut we DO have a time machine of sorts -- we have historical sciences such as geology and genetics that prove the god of Genesis didn't work the way his believers claimed he did. Historical events leave residues in the present, and it's possible to analyse the present and infer past events that generated it. So you need some other sort of god if you insist on worshipping a deity.\n\n \n Sorry, but this \"time machine\" of yours can't disprove God. Your crusade is silly--until you can go back in time you're simply not going to be able to show the ressurection didn't happen, or that Jesus didn't die on a cross, or that that Jesus was God in the flesh, etc., it's a pointless endeavor on your part. THESE are among the central tenets of Christianity--not your 6-day-creationism straw man. Obviously, they aren't in the realm of the testable.", 
   {}, 
   301659, 
   null, 
   1203006600.0
  ], 
  [
   301683, 
   null, 
   "jyoshu", 
   "Science is about real things. I am not a literalist, but a naturalistic realist. Science cannot yet address questions of why is there something rather than nothing, or why the universe operates by laws rather than being totally chaotic. I don't know if human science will ever manage to address such questions.\n \n However, it is you who are committing a logical whopper by assuming that because science cannot answer this question, therefore your version of god exists! You are setting up the false dichotomy of either science or Jesus. Even if science doesn't have the answers, that doesn't in any way, shape or form \"prove\" that Jesus is real, or the only conceivable alternative. \n\n \n Nope, that's where your especially wrong. This is not a case of me trying to prove to you GOD exists. This is a case of you (atheists) shoving someone and saying prove to me your belief, when in fact I wasn't out to do so to begin with. That's why the retort is often that you can't disprove God, because frankly, most believers are probably content with their belief--they have no need to prove it to you. The need is obviously on your end. YOU'RE not content with their belief.\n \n And it's not me juxtaposing science and Jesus--it's you. I have no problem with the idea that God is behind science. That doesn't require deism at all, by the way (which involves a god uninvolved in his universe rather than one actively keeping it's laws going). \n \n \nBut we DO have a time machine of sorts -- we have historical sciences such as geology and genetics that prove the god of Genesis didn't work the way his believers claimed he did. Historical events leave residues in the present, and it's possible to analyse the present and infer past events that generated it. So you need some other sort of god if you insist on worshipping a deity.\n\n \n Sorry, but this \"time machine\" of yours can't disprove God. Your crusade is silly--until you can go back in time you're simply not going to be able to show the ressurection didn't happen, or that Jesus didn't die on a cross, or that that Jesus was God in the flesh, etc., it's a pointless endeavor on your part. THESE are among the central tenets of Christianity--not your 6-day-creationism straw man. Obviously, they aren't in the realm of the testable.\n \n \nIt's a core tenet for many, probably most Christians. More than half the population in the US claims to believe in the god of Genesis as being literally true. Or are you going for the usual dodge of claiming they aren't \"real Christians\"?\n\n \n Do you seriously think that just because people believe something it's a 'core tenet' of the religion???? Christianity doesn't require 6-day-creationism for someone to be Christian. It's just not a core belief. Again, disproving one story from one book of the Bible does not disprove Christianity or the existence of GOD. You've hedged your bet on this one example of disproof, but you've failed to realise that it doesn't disprove the existence of GOD at all.", 
   {}, 
   301659, 
   null, 
   1203006900.0
  ], 
  [
   301703, 
   null, 
   "lesz", 
   "Nope, that's where your especially wrong. This is not a case of me trying to prove to you GOD exists. This is a case of you (atheists) shoving someone and saying prove to me your belief, when in fact I wasn't out to do so to begin with. That's why the retort is often that you can't disprove God, because frankly, most believers are probably content with their belief--they have no need to prove it to you. The need is obviously on your end. YOU'RE not content with their belief.\n\n \n If they'd keep their superstitions to themselves, who would care what they believed? But no... they want to force them on everyone else. You Christians insist that everyone accept your god exists. You can't stand the fact that lots of us don't take your beliefs seriously.\n \n \nAnd it's not me juxtaposing science and Jesus--it's you. I have no problem with the idea that God is behind science. That doesn't require deism at all, by the way (which involves a god uninvolved in his universe rather than one actively keeping it's laws going). \n \n \n Sorry, but science excludes a lot of the bible. The meddlesome biblical god is not what science reveals.\n \n \nSorry, but this \"time machine\" of yours can't disprove God.\n\n \n Sorry, but it has disproved the biblical god. All you can do is try to erect some version of god that isn't a biblical one. Good luck on that.\n \n \nYour crusade is silly--until you can go back in time you're simply not going to be able to show the ressurection didn't happen, or that Jesus didn't die on a cross, or that that Jesus was God in the flesh, etc., it's a pointless endeavor on your part. THESE are among the central tenets of Christianity--not your 6-day-creationism straw man. Obviously, they aren't in the realm of the testable.\n\n \n I have no idea whether or not any person called Jesus died on any cross. The Roman records do not mention this incident, neither do Jewish records, we only have the word of Christians it ever happened, and they aren't objective or eye witnesses. Doesn't mean he didn't, but the history is shaky.\n \n As for the resurrection, have you ever known anyone come back from the dead? You can comfort yourself with the argument that just because no-one has ever seen this phenomenon doesn't mean to say it never happened, but this is just another Santa Claus argument. You can postulate any miracle you like and challenge science to disprove it, but the inability of science to disprove every piece of idiocy doesn't prove the idiocy is true.\n \n \n \n \nDo you seriously think that just because people believe something it's a 'core tenet' of the religion????\n\n \n Yes. Do you seriously believe it isn't??????????????????????????????????????\n \n How many question marks do you need?\n \n \nChristianity doesn't require 6-day-creationism for someone to be Christian.\n\n \n Then neither does it need Christ's alleged divinity or resurrection.\n \n \nIt's just not a core belief.\n\n \n It is for a very large number of Christians. If it isn't for you, how do you know you are a Christian?\n \n \nAgain, disproving one story from one book of the Bible does not disprove Christianity or the existence of GOD. You've hedged your bet on this one example of disproof, but you've failed to realise that it doesn't disprove the existence of GOD at all.\n\n \n When you disprove one biblical allegation, you cast doubt on all of them. It means that bibliolators have to prove that biblical allegations are true.\n \n It's true that by disproving biblical notions, I cannot disprove every single concept of \"GOD\". But I can disprove the god of the bible. You need some other god.", 
   {}, 
   301683, 
   null, 
   1203014520.0
  ], 
  [
   301709, 
   null, 
   "Jo Bennett", 
   "The core beliefs of Christianity were agreed by the church more than 1500 years ago, when the church met together and approved the Nicene Creed, and previously the Apostles' Creed. For reference:\n \n I believe in God, the Father almighty, \n creator of heaven and earth. \n I believe in Jesus Christ, his only Son, our Lord, \n who was conceived by the Holy Spirit, \n born of the Virgin Mary, \n suffered under Pontius Pilate, \n was crucified, died, and was buried; \n he descended into hell. \n On the third day he rose again; \n he ascended into heaven, \n he is seated at the right hand of the Father, \n and he will come to judge the living and the dead. \n I believe in the Holy Spirit, \n the holy catholic Church, \n the communion of saints, \n the forgiveness of sins, \n the resurrection of the body, \n and the life everlasting. \n Amen. \n \n Note that while creation is mentioned, no specification is given as to method or timing. You will also note the centrality of the resurrection.", 
   {}, 
   301703, 
   null, 
   1203016860.0
  ], 
  [
   301717, 
   null, 
   "Zardoz", 
   "emoticon_xbouncer Zardoz, how can i be bearing false witness when I quoted and responded to what you, yourself said?\n\n You did not quote me when you made your comments. You extrapolated and pushed your beliefs off as something factual.\n I never said I believed anything. I clarified what was stated. This was supported as being understood by all except you.\n You engaged in an unnecessary personal attack not even related to religion nor to the topic at hand.\n I would have responded instantly with comments such as attacking your wife. But, such would be pretty low. So, I gave you time to understand the error of your ways.\n \n \nAnd how does that reflect on the size of anyones penis?\n\n Once again. I'll explain. If you can't address the topic and resort to bragging about yourself in a sexual manner, to people who can't verify your comments, all you're doing is penis waving.\n Those who engage is such childish behavior, except in jest, are often psychologically over compensating for something they lack in.\n It's like a man buying a gun too big to shoot or a gigantic SUV.\n It's over compensation for inadequacies.\n \n If you'd like to do a search of all the threads I've made, You'll come accross the comment that I whored myself for my son.\n The women I've been with didn't just pick me up thinking I had money like they may have you. But paid me. I can please a woman.\n I didn't bring this up in this thread until now because such commentary is irrelevant and uncalled for.\n But, I'd say, if we had to 'go there', I'd have a bigger penis than you and not only knew what to do with it but what to do with a woman to please her.\n \n \nWhat is establishes pretty clearly is that you are most probably a selfish lover who never took the time to learn how to bring a woman to orgasm. Because if you did, you wouldn't think female orgasms are mythical, and you would also understand that it doesn't even require a penis to bring a woman to orgasm. I get my woman off before even finishing our lovemaking sessions with intercourse. It should be obvious to you that intercourse alone doesn't last long enough to complete the process for a woman. It takes intimacy, manual manipulation and mutual interaction to even bring a woman to the place where she is orgasmic. I can tell when my wife is primed by the quivering that takes place in her stomach as her muscles contract. But I'm sure this is all beyond you.\n\n All you do is make me laugh.\n And to continue personal attacks.\n I could go on about the selfish nature of Arab men. The machismo nature of their inate culture plus the one you adopted by becoming an evangelical Christian.\n I could even cite the studies that show that Catholics (of which I am a cultural member) have better sex lives than protestants or evangelicals. But, what's the point there?\n I could even comment on the wives tale that men who have sons often have bigger penises than those who have daughters.\n Do you have a son Archy? I know you have daughters.\n See? More penis waving.\n Whooopy! emoticon_rolleyes \n \n \nYou should just quietly back out of this discussion on sexually pleasing a woman because you really are proving you're a neanderthal in bed who has no clue about actually making love. You should have taken a hint when I told you that foreplay was the key. I was telling you the truth.\n\n \n No archy, you don't know the truth.\n You only know your limited experiences.\n Ever had a woman experience a vaginal orgasm.\n Or do you have to resort to clitoral stimulation?\n Do you keep your hand in a glove filled with vaseline? Does it help when you beat on George or does Lenny stop your from doing that?\n \n Each woman is different Archy.\n Someone with your 'experience' would know that.\n \n \n Ask your wfe.\n She paid me $50 after you left thinking you satisfied her.\n You didn't.\n \n Like it?\n Didn't think so.\n This is the nature of dick waving.\n Personal attacks of an utterly pointless nature.\n My commentary wasn't even initially addressed to you or about you.\n I wasn't even making an internally contradictoray statement like you get nailed on.\n Such as making off-color jokes while maintiaining to be a pious christian.\n Or even bragging on how your personal sins (which you believe in) committed 30+ years ago somehow make you a good lover.\n \n So, yeah, you should repent of your wicked ways.\n Bearing false witness in regards to commentary on anothers sex life, which you know nothing about.\n \n Normally, I would have chalked up your 1st response to you being an ignorant old codger with cultural and generational gaps in your understanding and with a basic lack of comprehension skills. \n But, once I explained my comments, you felt the need to continue.\n As I said, I can go all night long. Ask your wife. *drum roll-baddabing*\n I can see your attack and raise the ante...but then again, I have the bigger dick. People with bigger dicks can often raise a lot more than those with small ones.\n It's sooo big, I need a 2nd Hummer to transport it in.\n Occasionally, I wake up in the morning and find it's been used as a flag poll by the local car dealsership. I wouldn't mind so much but it's embarrasing finding your wife's granny panties hanging from the tip as a flag.\n \n \n Is any of this mean spiritedness and pointedly unsubstantiated commentary getting accross to you Archy???\n And that's just simple attacks on your manliness and wife.\n Much as you've done against mine.\n I can stoop to a whole new level if needed.\n Actually, when I'm flacid, I rent my penis out a drudging equimpment for river deltas. So, I can stoop pretty low...or at least hang low.\n I mean it's just so unbelievably rediculous how massive my member is.\n \n It's so big an entire sect of Christian fundamentalist have migrated there thinking it was the Garden of Eden.\n It's quite annoying having to yell at them to quit searching the tree for the fruit of everlasting life.\n It's more annoying having to repeatedly tell them No, I'm not God and the white creamy stuff is not Mana.\n But, they've been there for a decade and must be living off of something...so maybe it is. I know your wife calls out God everytime I come over.\n \n So, no Archy, I wouldn't feel bad about my wife. I don't feel bad about yours. I know she's being pleased. If she wasn't...she wouldn't be paying me...\n OFTEN.\n \n \n This childish school-yard attack brought to you by my big penis.\n emoticon_rolleyes \n \n My big penis would like to thank Archangel for 'going there'. For without such an immature attack, it would have never been allowed to have so much attention.\n And if the kind people of 4forums would like to help my get my big penis back into my pants, I'd greatly appreciate it. It's quite cold and snowy here and I'm afraid some dewds high on Dew may mistake the goosebumps for a new mountain range and try to snowboard down it.\n It's embarassing enough to note the scars where low flying planes have collided with it as it is without having to worry about some XXXXXX resorting to canabalism if they get stranded. Or worse...joining the evangelicals already there.\n \n Someone...\n Please help...", 
   {}, 
   301534, 
   null, 
   1203019800.0
  ], 
  [
   301719, 
   null, 
   "Zardoz", 
   "A \"thought provoking article\"? It's a letter to the editor written by a scientifically illiterate XXXXX.\n \n On second thought, no wonder you found it \"thought provoking\"...\n \n \"OMG TEH EYE CANNOT EVLOVE COS IT AER TWO COMMPLEXTICATED!!~!#~!!11one\"\n \n This is what passes in Archieland for impeccable logic.\n\n \n Yep, the odds are soo astronomical against it that it couldn't have had happened. \n It's like computing the odds of Archy being born.\n \n One lone sperm out of millions shot out went to create him.\n Compound that with the 1 in millions needed to make his daddy.\n Then compound that all the way back through the generations to poor ole Noah. Then think about the odds it would take to even get to Noah from Adam.\n \n The odds are mindboggling.\n So, the logical answer is it didn't happen that way. \n So, he must be made of invisible pink unicorn ####.", 
   {}, 
   301594, 
   null, 
   1203020700.0
  ], 
  [
   301733, 
   null, 
   "lesz", 
   "The core beliefs of Christianity were agreed by the church more than 1500 years ago, when the church met together and approved the Nicene Creed, and previously the Apostles' Creed. For reference:\n \n I believe in God, the Father almighty, \n creator of heaven and earth. \n I believe in Jesus Christ, his only Son, our Lord, \n who was conceived by the Holy Spirit, \n born of the Virgin Mary, \n suffered under Pontius Pilate, \n was crucified, died, and was buried; \n he descended into hell. \n On the third day he rose again; \n he ascended into heaven, \n he is seated at the right hand of the Father, \n and he will come to judge the living and the dead. \n I believe in the Holy Spirit, \n the holy catholic Church, \n the communion of saints, \n the forgiveness of sins, \n the resurrection of the body, \n and the life everlasting. \n Amen. \n \n Note that while creation is mentioned, no specification is given as to method or timing. You will also note the centrality of the resurrection.\n\n \n Are you seriously claiming all Christians believe this? Even when I was a Christian, I didn't believe all that. Virgin Mary? You gotta be kidding me. Even as a Catholic, that didn't make any sense. This creed strains credulity to the utmost, and i suspect you'll find lots of Christians who don't accept it literally.", 
   {}, 
   301709, 
   null, 
   1203026040.0
  ], 
  [
   301739, 
   null, 
   "HonestAbe", 
   "Zardoz...you remind me of the guy who said the two things he hated were size queens and little dicks.", 
   {}, 
   301733, 
   null, 
   1203026640.0
  ], 
  [
   301740, 
   null, 
   "HonestAbe", 
   "Are you seriously claiming all Christians believe this? Even when I was a Christian, I didn't believe all that. Virgin Mary? You gotta be kidding me. Even as a Catholic, that didn't make any sense. This creed strains credulity to the utmost, and i suspect you'll find lots of Christians who don't accept it literally.\n\n \n I remember reciting that each Sunday morning as a boy wondering how many people actually believed a word of it. But they all knew the words. Maybe that's one of the reasons I find religion to be such a hypocritical entity.", 
   {}, 
   301733, 
   null, 
   1203026700.0
  ], 
  [
   301749, 
   null, 
   "lesz", 
   "I remember reciting that each Sunday morning as a boy wondering how many people actually believed a word of it. But they all knew the words. Maybe that's one of the reasons I find religion to be such a hypocritical entity.\n\n \n I don't think most Christians think about it all that much. If they ever thought seriously about the things they are supposed to belief, I think they'd be horrified. They'd certainly laugh at people of other faiths who believe in similar sorts of things.", 
   {}, 
   301740, 
   null, 
   1203028200.0
  ], 
  [
   301759, 
   null, 
   "HonestAbe", 
   "I don't think most Christians think about it all that much. If they ever thought seriously about the things they are supposed to belief, I think they'd be horrified. They'd certainly laugh at people of other faiths who believe in similar sorts of things.\n\n \n Yet these are the beliefs of the christian church. Today's church has added the personal god that one is suppose to find once he's been born again. Talk about snake oil.", 
   {}, 
   301749, 
   null, 
   1203032400.0
  ], 
  [
   301762, 
   null, 
   "Jo Bennett", 
   "Are you seriously claiming all Christians believe this? Even when I was a Christian, I didn't believe all that. Virgin Mary? You gotta be kidding me. Even as a Catholic, that didn't make any sense. This creed strains credulity to the utmost, and i suspect you'll find lots of Christians who don't accept it literally.\n\n \n I can't vouch for what others believe. The creeds are a pretty accurate summary of my beliefs as regards who and what God is. The Apostles' Creed is the statement of belief used at baptism in most of Christianity, so it would be strange for someone to have been baptised (or confirmed if they were baptised as an infant) without believing this to be true.\n \n To be honest I'm surprised by the idea that people (outside the pseudo-Christian sects like the Mormons and Jehovah's Witnesses) who claim to be Christians would not believe what is stated in the Creeds, it's not something that really occurred to me. I know that some people misunderstand the use of the word catholic in the last paragraph but that's about it.", 
   {}, 
   301733, 
   null, 
   1203033120.0
  ], 
  [
   301764, 
   null, 
   "jyoshu", 
   "Are you seriously claiming all Christians believe this? Even when I was a Christian, I didn't believe all that. Virgin Mary? You gotta be kidding me. Even as a Catholic, that didn't make any sense. This creed strains credulity to the utmost, and i suspect you'll find lots of Christians who don't accept it literally.\n\n \n It's still all untestable. But the fact lots of Christians don't accept things like this literally is what YOU need to realise, not Jo Bennett. You seem to think that by disproving one literal belief of some Christians, you've disproven the whole religion. Which doesn't even pass the ... what is it you call it? The 'giggle test', I believe.", 
   {}, 
   301733, 
   null, 
   1203033660.0
  ], 
  [
   301769, 
   null, 
   "sinjin", 
   "The Apostles' Creed is the statement of belief used at baptism in most of Christianity, so it would be strange for someone to have been baptised (or confirmed if they were baptised as an infant) without believing this to be true.\nGiven that many Catholics are baptized as infants and confirmed at age 12 or so, I do not find it at all strange to actually not believe it when one finally is grown enough to know one's own mind. Not too many 12 yr. old \"free thinkers\".", 
   {}, 
   301762, 
   null, 
   1203034140.0
  ], 
  [
   302487, 
   null, 
   "DrD", 
   "Let me add the words of Thomas Paine\n \n THE AGE OF REASON\n \n by Thomas Paine\n \n TO MY FELLOW-CITIZENS OF THE UNITED STATES OF AMERICA: \n \n I PUT the following work under your protection. It contains my opinions upon Religion. You will do me the justice to remember, that I have always strenuously supported the Right of every Man to his own opinion, however different that opinion might be to mine. He who denies to another this right, makes a slave of himself to his present opinion, because he precludes himself the right of changing it. The most formidable weapon against errors of every kind is Reason. I have never used any other, and I trust I never shall. Your affectionate friend and fellow-citizen, \n \n \n THOMAS PAINE \n Luxembourg, 8th Pluvoise, \n Second Year of the French Republic, one and indivisible. \n January 27, O. S. 1794.\n \n Can you believe he wrote The Age of Reason way back then?\n \n Deism is becoming a growing part of thought because it is about reason and thinking with reason rather than just believing in something.\n \n http://www.deism.com/images/The%20Age%20of%20Reason%201794.pdf This is the complete text. Simple to read yet profound in its logic. enjoy", 
   {}, 
   301769, 
   null, 
   1203450060.0
  ], 
  [
   302873, 
   null, 
   "HonestAbe", 
   "\"Irrationally held truths may be more harmful than reasoned errors.\"\n -- Thomas Huxley, \"The Coming of Age of the Origin of Species,\" 1880", 
   {
    "unicode_changes_made": true
   }, 
   302487, 
   null, 
   1203604920.0
  ], 
  [
   303352, 
   null, 
   "HonestAbe", 
   "\". . . the vast mass of existing gods or divine persons, when we come to analyze them, do actually turn out to be dead and deified human beings. . . . I believe that corpse worship is the protoplasm of religion.\"\n -- Grant Allen, cited in Who's Who in Hell edited by Warren Allen Smith \n \n www.ffrg.org", 
   {
    "unicode_changes_made": true
   }, 
   302873, 
   null, 
   1203876900.0
  ], 
  [
   305977, 
   null, 
   "HonestAbe", 
   "\"I cannot imagine a God who rewards and punishes the objects of his creation, whose purposes are modeled after our own--a God, in short, who is but a reflection of human frailty. Neither can I believe that the individual survives the death of his body, although feeble souls harbor such thoughts through fear or ridiculous egotism. It is enough for me to contemplate the mystery of conscious life perpetuating itself through all eternity, to reflect upon the marvelous structure of the universe which we can dimly perceive, and to try humbly to comprehend even an infinitesimal part of the intelligence manifested in nature.\"\n -- Albert Einstein, column for The New York Times, Nov. 9, 1930 (reprinted in The New York Times obituary, April 19, 1955) \n \n www.ffrf.org", 
   {
    "unicode_changes_made": true
   }, 
   303352, 
   null, 
   1205499600.0
  ], 
  [
   306016, 
   null, 
   "DrD", 
   "Beautiful!!", 
   {}, 
   305977, 
   null, 
   1205541780.0
  ], 
  [
   306356, 
   null, 
   "HonestAbe", 
   "\"A religious person is a dangerous person. He may not become a thief or a murderer, but he is liable to become a nuisance. He carries with him many foolish and harmful superstitions, and he is possessed with the notion that it is his duty to give these superstitions to others. That is what makes trouble. Nothing is so worthless as superstition. . . .\"\n -- Marilla M. Ricker, \"Science Against Creeds,\" I Am Not Afraid Are You? (1917). Read more about Marilla M. Ricker in Women Without Superstition: No Gods - No Masters.\n \n \"There is no such source and cause of strife, quarrel, fights, malignant opposition, persecution, and war, and all evil in the state as religion. Let it once enter our civil affairs, our government would soon be destroyed. Let it once enter our common schools, they would be destroyed . . . Those who made our Constitution saw this, and used the most apt and comprehensive language in it to prevent such a catastrophe.\"\n -- Justice H.S. Orton of the Supreme Court of Wisconsin, concurring opinion in Weiss v. the District Board, decided on March 18, 1890, ruling bible readings and devotionals in public schools unconstitutional", 
   {
    "unicode_changes_made": true
   }, 
   306016, 
   null, 
   1205843460.0
  ], 
  [
   306366, 
   null, 
   "CUNxTime", 
   "\"I contend we are both atheists, I just believe in one fewer god than you do. When you understand why you dismiss all the other possible gods, you will understand why I dismiss yours.\" (Stephen F. Roberts)\n emoticon_idea", 
   {
    "unicode_changes_made": true
   }, 
   306356, 
   null, 
   1205860440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Free thinkers", 
  "url": "http://www.4forums.com/political/religion-debates/10911-free-thinkers.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10911, 
  "discussion_files": [
   [
    "1558.html", 
    "http://www.4forums.com/political/religion-debates/10911-free-thinkers-print.html"
   ], 
   [
    "1559.html", 
    "http://www.4forums.com/political/religion-debates/10911-free-thinkers-9-print.html"
   ], 
   [
    "1560.html", 
    "http://www.4forums.com/political/religion-debates/10911-free-thinkers-7-print.html"
   ], 
   [
    "1561.html", 
    "http://www.4forums.com/political/religion-debates/10911-free-thinkers-5-print.html"
   ], 
   [
    "1562.html", 
    "http://www.4forums.com/political/religion-debates/10911-free-thinkers-4-print.html"
   ], 
   [
    "1563.html", 
    "http://www.4forums.com/political/religion-debates/10911-free-thinkers-6-print.html"
   ], 
   [
    "1564.html", 
    "http://www.4forums.com/political/religion-debates/10911-free-thinkers-8-print.html"
   ], 
   [
    "1565.html", 
    "http://www.4forums.com/political/religion-debates/10911-free-thinkers-3-print.html"
   ], 
   [
    "1566.html", 
    "http://www.4forums.com/political/religion-debates/10911-free-thinkers-2-print.html"
   ]
  ], 
  "identifier": 10911
 }
]