[
 [
  [
   301380, 
   null, 
   "lesz", 
   "This may turn out to be a self-extinguishing phenomenon.\n \n Christian, Maybe. Compassionate, Hardly. \n \n This is a commentary on the statistical surveys of the Christian Barna group, and especially its head, David Kinnaman. Kinnaman fears that Christianity has now become identified by obsessive homophobia:\n \n \nKinnaman focuses on young people 16-29, particularly those he calls \"outsiders\"-atheists, agnostics, adherents of other religions and the \"unchurched.\" Those now make up 40 percent of young people, he reports. Just a decade ago Christianity had an overwhelmingly positive image among the young, including outsiders, he says. But no longer.\n \n \"Our most recent data show that young outsiders have lost much of their respect for the Christian faith.\" They hold several negative images of Christianity: it is judgmental (87 percent agreed), too involved in politics (75 percent), hypocritical (85 percent), and out of touch (72 percent).\n \n But the predominant negative perception is that Christianity is \"antihomosexual.\" Fully 91 percent of \"outsiders\" say Christianity is anti-gay. Remarkably, 80 percent of young churchgoers agree: \n \n \"In our research, the perception that Christians are 'against' gays and lesbians-not only objecting to their lifestyle\"-i.e., sex-\"but also harboring irrational fear and unmerited scorn toward them-has reached critical mass. The gay issue has become the 'big one,' the negative image most likely to be intertwined with Christianity's reputation.\" In short, \"A new generation of adults ... now accepts homosexuality as a legitimate way of life.\"\n\n \n If young people are increasingly accepting of gay human beings on the one hand, and critical of Christianity for being obsessed with its homophobia on the other, what is the future for Christianity in the West?\n \n \nKinnaman's book is meant to warn Christians that their political influence on the issue of homosexuality will ebb and that they need to undertake a \"kinder, gentler\" approach to gays such as getting to know them, engaging them in conversation, showing compassion, and talking about Jesus instead of initially taking a moralistic approach.\n \n I am not sure that \"compassion\" is what gays expect these days. Acceptance is what most expect. But given the reiterated condemnations of \"the homosexual lifestyle\" (i.e., sex) by Kinnaman and his commentators in the book, evangelical Christians cannot offer that. It is their bottom line, their obsession. \n \n It's true. We don't expect compassion. We do not expect \"good Christians\" to lead us out of our \"sin\". We expect them to keep their interfering hands off, and accept us as human beings, perhaps a little bit different from them, but still with a place on this planet.\n\n \n Christianity these days has become offensive to gay people because of its constant condemnation of love we find natural. Their claim that gay love is somehow illegitimate is neither friendly, nor compassionate, nor accepting. It is obnoxious.\n \n If a new generation of Christians finds this message of acceptance increasingly compelling, what is the future of current Christian homophobia? I'd hope it's bleak. It won't die out till the last homophobe croaks, but I think it is on the way out.\n \n Surveys suggest that Old Christianity, the Christianity that hates gays, is not long for this world. No-one will mourn it. When it kicks the bucket, we will give it a not-so-fond farewell.", 
   {
    "post_info": {
     "post_title": "The Bankruptcy of Christian Homophobia"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1202839380.0
  ], 
  [
   301382, 
   null, 
   "jitobear", 
   "Time and again it has been shown that most forms of prejudice eventually become an shameful piece of history. So will homophobia some day.", 
   {}, 
   301380, 
   null, 
   1202839620.0
  ], 
  [
   301393, 
   null, 
   "jyoshu", 
   "Surveys suggest that Old Christianity, the Christianity that hates gays, is not long for this world. No-one will mourn it. When it kicks the bucket, we will give it a not-so-fond farewell.\n\n \n But you've indicated that your view is that even Christianity that is gay-friendly is \"silly\" so why should you care? You've called religion period as \"silly\"; but that, of course, has to include the belief of those who aren't homophobic, as well as those inspired by it to fight for equality.", 
   {}, 
   301380, 
   null, 
   1202840880.0
  ], 
  [
   301402, 
   null, 
   "foundit66", 
   "But you've indicated that your view is that even Christianity that is gay-friendly is \"silly\" so why should you care?\n\n I think a better question would be why don't you care.\n \n And if your question is serious, I don't understand how you don't have the answer already.\n Lesz is talking about religion moving away from its fixated focus on homosexuality, and you ask that question.\n I think most people could put two and two together to realize that when christianity finally does move away from harassing and discriminating against gays, that the lives of gays will improve.", 
   {}, 
   301393, 
   null, 
   1202845440.0
  ], 
  [
   301403, 
   null, 
   "HonestAbe", 
   "Anyone whose life has been injured by christianity would be interested in learning that the next generation might not be so hateful as the present group.emoticon_confused", 
   {}, 
   301402, 
   null, 
   1202847840.0
  ], 
  [
   301407, 
   null, 
   "foundit66", 
   "I guess part of the issue extends to how ridiculous the anti-gay religious right's claims get on this issue.\n \n Gay marriage is going to destroy America.\n Gays are out to destroy heterosexual marriage.\n Gays are out to \"indoctrinate\" our children.\n \n For a rational person who hasn't been programmed to blindly believe \"in Jesus name\", those claims are dubious at best.\n Outrights at worst.\n \n Especially proven fallacious when these \"independents\" often ACTUALLY KNOW gay people that they talk to, and know they aren't as vile as the anti-gay religious right proclaims.\n \n Archie provided an excellent example recently. He was quoting all sorts of \"material\" that made outrageous claims about gays and gay groups that were EASILY proven as lies.\n And his insistence on lashing out only furthered the image that Archie (and others like him) just don't give a damn about HONESTY, and will continue to quote sources that say things that are convenient for their cause, REGARDLESS OF STATUS OF TRUTH.\n \n In some ways, some elements of Christianity have traded parts of their \"morality soul\" in exchange for \"higher ground\" in going after gays.\n And it doesn't go unnoticed.\n \n And to exacerbate the issue, it ALSO doesn't go unnoticed when those elements of christianity lash out at gays with multi-million dollar campaigns, and other elements of christianity stay quiet. Quiet complacency can be viewed negatively.\n \n I think it's a fairly obvious observation that some elements of Christianity essentially fixate on homosexuality, elevating its \"sin\" status above and beyond numerous other sins in the bible.\n I think a day will come when, like racist or anti-semite prejudice, it is a rarity instead of something readily able to find.\n Christians will learn to keep their religious condemnation to themselves, cause THEIR religion is something THEY practice in THEIR lives, and not something that is called for to enforce in governmental law.\n .\n And if somebody else is Jewish, or gay, or divorced, that doesn't mean that they have to insist that the government discriminate against them as a form of \"religious expression\".", 
   {}, 
   301402, 
   null, 
   1202848380.0
  ], 
  [
   301410, 
   null, 
   "HonestAbe", 
   "\n Gay marriage is going to destroy America.\n Gays are out to destroy heterosexual marriage.\n Gays are out to \"indoctrinate\" our children.\n \n These are certainly silly statements. How could so small a minority be capable of doing all this.", 
   {}, 
   301407, 
   null, 
   1202849820.0
  ], 
  [
   301502, 
   null, 
   "lesz", 
   "But you've indicated that your view is that even Christianity that is gay-friendly is \"silly\" so why should you care? You've called religion period as \"silly\"; but that, of course, has to include the belief of those who aren't homophobic, as well as those inspired by it to fight for equality.\n\n \n If the Christianity that gives us homophobia and theocracy were to die, i wouldn't mourn. If it were to be replaced with a more philosophical and less zealous form of Christianity, which does seem to have happened hee and there, I'm not going to object.\n \n I think religious belief is in general profoundly mistaken. People claiming to know the mind of a god deserve ridicule. I know of no objectively compelling reasons to believe in a god. But claiming to know what that god thinks??? That is sheer stupidity at best, hubris at worst.", 
   {}, 
   301393, 
   null, 
   1202924520.0
  ], 
  [
   301505, 
   null, 
   "jyoshu", 
   "I think religious belief is in general profoundly mistaken. People claiming to know the mind of a god deserve ridicule.\n\n \n Even if that claim includes the idea that God supports human rights?", 
   {}, 
   301502, 
   null, 
   1202926440.0
  ], 
  [
   301509, 
   null, 
   "lesz", 
   "Even if that claim includes the idea that God supports human rights?\n\n \n What makes you think god has any notion of human rights? It can't be the Old Testament. And even the New Testament isn't exactly resounding in its espousal of human rights. If one wants to support the concept of fundamental human rights, one looks to the god of the bible in vain.\n \n My point really is that when you compare a human to a god, you might as well compare a dog to Newton. One cannot reasonably be expected to understand the mind of the other, as Darwin pointed out. Who knows what god supports or not?", 
   {}, 
   301505, 
   null, 
   1202927520.0
  ], 
  [
   301512, 
   null, 
   "jyoshu", 
   "What makes you think god has any notion of human rights? It can't be the Old Testament. And even the New Testament isn't exactly resounding in its espousal of human rights. If one wants to support the concept of fundamental human rights, one looks to the god of the bible in vain.\n\n \n I'm not going to argue with you if he does or doesn't. You'll have to take that up with some of the people in the gay rights movement. My point is that many people who have fought for human rights claim religion as part of their inspiration, and with your all-or-nothing approach, I can only assume you'd STILL condemn religion even if gets more and more gay friendly. So I find it odd you'd even bother to indicate any distinction.", 
   {}, 
   301509, 
   null, 
   1202927940.0
  ], 
  [
   301517, 
   null, 
   "lesz", 
   "I'm not going to argue with you if he does or doesn't. You'll have to take that up with some of the people in the gay rights movement. My point is that many people who have fought for human rights claim religion as part of their inspiration, and with your all-or-nothing approach, I can only assume you'd STILL condemn religion even if gets more and more gay friendly. So I find it odd you'd even bother to indicate any distinction.\n\n \n I've spoken favorably of religious believers who stand up for gay rights against a tyrannical version of Christianity. What more do you want? Blood?\n \n Look, I disagree with the entire concept of religion. My view is that when religious believers support something that's right, they do it despite their religion, because it makes sense to them on the basis of humanitarian instincts, not religious ones. Maybe sometimes their religion coincides with humanitarianism. All I can say to that is i wish it would do it more often than it does in practice!", 
   {}, 
   301512, 
   null, 
   1202929080.0
  ], 
  [
   301567, 
   null, 
   "HonestAbe", 
   "Religions exist because people fear death and religion promises life after death. Of course, it is irrational to believe such nonsense, but many do, and over the centuries have done much harm and evil in the name of their god. Religion will bring mankind to the brink of extinction.", 
   {}, 
   301517, 
   null, 
   1202952240.0
  ], 
  [
   301591, 
   null, 
   "Kronus", 
   "So I find it odd you'd even bother to indicate any distinction.\n\n \n Why odd? Something that's silly and harmful is much worse than something that's just silly, right? Personally, I have no problem with people believing things I don't, even things I think are silly. It's when they start hurting people that I have a problem. That's a crucial, and i would think obvious, distinction.", 
   {}, 
   301512, 
   null, 
   1202960400.0
  ], 
  [
   307426, 
   null, 
   "Existantia", 
   "I think when something does something for human rights, it's because they are a decent human being and has nothing to do with religion. Lesz is right, it goes beyond ones own religious beliefs. Religion is full of dogmas and practices which go against human rights many times, it's a control mechanism. It can also take people away from their own reality. So unless Christianity adapts to change their views to accept all of humanity, I hope it goes the way of the dinosaur.", 
   {}, 
   301591, 
   null, 
   1207260180.0
  ], 
  [
   307551, 
   null, 
   "jyoshu", 
   "I think when something does something for human rights, it's because they are a decent human being and has nothing to do with religion. Lesz is right, it goes beyond ones own religious beliefs. Religion is full of dogmas and practices which go against human rights many times, it's a control mechanism. It can also take people away from their own reality. So unless Christianity adapts to change their views to accept all of humanity, I hope it goes the way of the dinosaur.\n\n \n The problem with that is, numerous religious people who have done great things for human rights have said, very clearly, that it DOES have to do with their religion. I can give you numerous examples. ML King, Jr. and William Wilberforce are two, right off the top of my head. That is their own assertion, and to say it doesn't is to make them out to be lying.\n \n I don't think it's exactly fair for people to have an approach that criticizes religion when it goes against human rights and attribute THAT to religion, but then refuse to give it credit when it supports and bolsters human rights--only attributing THAT to \"being a decent human being.\"", 
   {}, 
   307426, 
   null, 
   1207344300.0
  ], 
  [
   307564, 
   null, 
   "Existantia", 
   "The problem with that is, numerous religious people who have done great things for human rights have said, very clearly, that it DOES have to do with their religion. I can give you numerous examples. ML King, Jr. and William Wilberforce are two, right off the top of my head. That is their own assertion, and to say it doesn't is to make them out to be lying.\n \n I don't think it's exactly fair for people to have an approach that criticizes religion when it goes against human rights and attribute THAT to religion, but then refuse to give it credit when it supports and bolsters human rights--only attributing THAT to \"being a decent human being.\"\n\n \n Can you quote them on how they specifically said religion had something to do with it?\n \n Listen, I'm not saying they're not both a humanitarian AND religious. They are. But religion isn't the reason people treat others well, in fact, it's more the opposite. They treat each other well because it's the human thing to do. \n \n I think its absolutely fair to criticize religion. It is meant to be criticized.", 
   {}, 
   307551, 
   null, 
   1207348560.0
  ], 
  [
   307658, 
   null, 
   "Jo Bennett", 
   "If you refuse to credit religion with causing people to do good, then it is bizarre to turn around and claim that religion causes people to do evil. Homophobia is present regardless of religion. I teach kids who will laugh at my faith but glibly use \"fagg*t\" or \"gay\" as an insult. In my experience the church is far more tolerant of gays and lesbians than society in general.", 
   {}, 
   307564, 
   null, 
   1207391160.0
  ], 
  [
   307674, 
   null, 
   "foundit66", 
   "If you refuse to credit religion with causing people to do good, then it is bizarre to turn around and claim that religion causes people to do evil.\n\n 1) A corollary of that is true.\n For those Christians who insist on crediting religion with causing all sorts of good, it is bizarre to ignore the evil that it also does.\n \n 2) Personally, I accept that religion is responsible for both good and evil.\n Others may have different opinions.\n \n \n \nHomophobia is present regardless of religion.\n\n \"Is present\" is a lot different than \"has no causal correlation from religion\".\n Yes. Non-religious homophobia does exist.\n However, there is a huge link to homophobia from religion, as proven by a variety of polls. Polls which examine the person involved, and cut down the statistics according to religious category.\n \n Per capita, homophobia is more prevalent WITH religion than WITHOUT religion. If you look at people without religion, the statistics on those who oppose gay equality drop dramatically.\n \n \n \nI teach kids who will laugh at my faith but glibly use \"fagg*t\" or \"gay\" as an insult. In my experience the church is far more tolerant of gays and lesbians than society in general.\n\n I really am not sure how you come by such an experience.\n What non-religious source of homophobia do you have in your area.\n \n Look at the national groups which are formed to discriminate against gays. Focus on Family. American Family Association. etc, etc.\n They ALL have religious ties and a Christian basis. (I have an outstanding challenge for anybody to name me any major \"family\" group that advocates discrimination against gays that does not have a Christian basis.)\n \n I really don't see how you come to the conclusion you make above.\n If you do a little digging, most attempts at anti-gay discrimination have a \"Christian\" basis. (As in, people who claim \"christianity\" are behind the effort.)\n I think it would take considerable effort to find a major group (or minor group for that matter) which is not based in \"Christianity\".", 
   {}, 
   307658, 
   null, 
   1207415580.0
  ], 
  [
   307676, 
   null, 
   "Jo Bennett", 
   "I suspect that there is a difference between blatant homophobia and direct discrimination, and believing that homosexuality is wrong. I've never heard a sermon in any church I've attended attacking gay people, or even homosexuality in general. Christians in the UK have been prominent in passing gay rights legislation in the UK, much of it has been passed under the direction of the recent Catholic convert Tony Blair. Examples of public homophobia have come from some clerics, but most noticeably from the likes of DJ Chris Moyles, who repeatedly used gay as a synonym for rubbish on his radio 1 show. The situation is very different here compared to the US.\n \n In any case, I was talking about my personal experience, not statistical correlation.", 
   {}, 
   307674, 
   null, 
   1207416480.0
  ], 
  [
   307683, 
   null, 
   "foundit66", 
   "I suspect that there is a difference between blatant homophobia and direct discrimination, and believing that homosexuality is wrong.\n\n I agree.\n If a person JUST believes that \"gay is wrong\", I don't consider that homophobia.\n If that person goes BEYOND just \"gay is wrong\", to supporting discrimination against gays, I consider that homophobia.\n \n By analogy, Christians believe that not believing in Christ is wrong.\n But that is significantly different from deciding to not hire a Buddhist, or believing that it should be legal to fire Jews just because they are Jewish.\n \n \n \nI've never heard a sermon in any church I've attended attacking gay people, or even homosexuality in general.\n\n Yet, they do exist.\n The evidence of such, including priests speaking out in public and others closely tied to the church doing likewise, can also be shown.\n \n Have you heard of the reaction to Barack Obama's talk in a church, when he tried to bring up gay equality?\n \n \n \nChristians in the UK have been prominent in passing gay rights legislation in the UK, much of it has been passed under the direction of the recent Catholic convert Tony Blair. Examples of public homophobia have come from some clerics, but most noticeably from the likes of DJ Chris Moyles, who repeatedly used gay as a synonym for rubbish on his radio 1 show. The situation is very different here compared to the US.\n\n I have no doubts that some Christians are helping to make progress.\n \n But we shouldn't ignore where the REAL OPPOSITION to such gay equality movements is coming from as well.\n Fellow Christians.\n \n Regarding \"Chris Moyles\", my real problem is with people who rally votes to get legalized discrimination against gays.\n Not \"Chris Moyles\" who is using the word \"gay\" disparagingly.\n That may be a negative thing, but it's less significant when compared to laws that prevent gays from adopting, or getting into legal unions, or getting in the military, or even making gay sex illegal.", 
   {}, 
   307676, 
   null, 
   1207425780.0
  ], 
  [
   307689, 
   null, 
   "jyoshu", 
   "If you refuse to credit religion with causing people to do good, then it is bizarre to turn around and claim that religion causes people to do evil. Homophobia is present regardless of religion.\n\n \n Thanks; you expressed that much better than I did, I think. I think there's a double standard there if someone is unwilling to ascribe good to religion when it applies but is willing to ascribe bad.", 
   {}, 
   307658, 
   null, 
   1207436760.0
  ], 
  [
   307704, 
   null, 
   "foundit66", 
   "On this message board, there are some frequent accusations of \"modernizing\" religion when it ignores the \"sin\" of homosexuality.\n Ignoring explicit Biblical standards, in favor of \"change\" that has \"no biblical basis\".\n \n Okay. I understand the argument...\n But by the same token, HOW can we accept such an argument AGAINST change based on a lack of biblical basis, and then turn around and give credit to religion for helping OTHER changes that also lack a biblical basis.\n Doesn't the bible never change?\n Isn't God's stance on things \"constant\"?\n \n For example, women's equal rights.\n Explicitly forbidden in the bible. Both Old and New Testament are very explicit in the status of relations between women and men. Women are inferior in status to men. \"Child-bearing\" is how they are to better themselves.\n It is a logical assessment to realize that advancements in women's equality occurred not because of, but IN SPITE OF religion.\n \n Likewise, there have been NUMEROUS religious arguments posed for a variety of issues. Slavery is never condemned in the bible. In fact, both the Old and New Testament include numerous passages for slavery, how to own slavery, advice to slaves on how to be good slaves, etc, etc, etc...\n So again, if one questions the validity of \"change\" for homosexuals based on an absence of biblical teachings, one has to come to a similar conclusion about giving credit to christianity for advancement in other \"equal rights\" categories.\n \n The bible never talks about \"equal rights\".\n In fact, it is arguable that the ideology of \"rights\" is a foreign concept to the biblical dogma.\n \n The bible should be given credit when it's actual positive teachings are followed. \"Love thy neighbor\". Give to the poor. etc, etc...\n \n But when it comes to the advancement of civil rights? When the concept is not even found in the bible in the first place? And the bible has actually been historically a tool used AGAINST those rights for numerous centuries BEFORE the change actually came into being?\n \n It's like having the sun rise in the east for months with action X not happening. And for those many days in those many months, people claimed that the sun rising in the east was responsible for action X NOT happening.\n And then on one day, the sun rises in the east and action X does happen to occur.\n And then trying to give credit to the sun rising in the east for action X... emoticon_rolleyes \n \n It makes no sense.\n \n For many Christian attempts at \"claiming credit\" for a variety of some good, it should be more accurately attributed to our evolving society, sometimes IN SPITE OF religion.\n \n \"Heaven knows\" that the opposition to gay equality is steeped more in \"religion\" than the support of gay equality has a credit for \"religion\".", 
   {}, 
   307689, 
   null, 
   1207447140.0
  ], 
  [
   307707, 
   null, 
   "foundit66", 
   "The strongest indicator of where a voter falls on the issue is whether he or she self-identifies as an evangelical Christian. Ninety-percent of white Protestant evangelicals oppose gay marriage, compared with 48 percent of non-evangelical white Protestants. Seventy-two percent of evangelical white Protestants support a constitutional amendment prohibiting gay marriage, while just 33 percent of non-evangelicals back such a ban. http://blog.washingtonpost.com/thefix/2006/06/parsing_the_polls_gay_marriage.html\n And highly religious Americans who attend church weekly (33 percent) are less likely to say it's an acceptable lifestyle than those who seldom or never attend church (74 percent).http://www.christianpost.com/article/20070529/27674.htm\n \n You know, in years to come there will be message boards where people will ignore the religious opposition to the societal advancement of gay civil rights, and try to proclaim loudly and vigorously that it is christianity that deserves credit for gays being equal... emoticon_rolleyes", 
   {}, 
   307704, 
   null, 
   1207447740.0
  ], 
  [
   307796, 
   null, 
   "Existantia", 
   "You said it Foundit66.", 
   {}, 
   307707, 
   null, 
   1207547340.0
  ], 
  [
   307809, 
   null, 
   "jyoshu", 
   "For many Christian attempts at \"claiming credit\" for a variety of some good, it should be more accurately attributed to our evolving society, sometimes IN SPITE OF religion.\n\n \n Sometimes, sure. But there are also movements you'd consider good (I hope) in religion. Much of the civil rights movement grew in churches. That's just the reality of the situation. There has long been a movement in religion known as liberation/justice theology, which champions the cause of the poor and homeless. Indeed, Christ taught a lot about this. And what of the (gasp) evangelicals who have recently taken a pro-environmental stance on global warming? Is that not good? These aren't examples that are 'in spite' of the religion--they are because of the religion: e.g. the teachings of Christ to help the poor and the belief that the environment God has made is in our charge to take care of and protect.\n \n Religion is like most anything else--it can be used for good or bad. I know there are people here who are pretty bitter toward religion, but like it or not, sometimes things that you view as good come out of it. And it's not exactly fair for people to refuse to give credit where credit is due, yet jump at the chance to condemn it when it can be blamed.", 
   {}, 
   307704, 
   null, 
   1207579020.0
  ], 
  [
   307826, 
   null, 
   "foundit66", 
   "Sometimes, sure. But there are also movements you'd consider good (I hope) in religion.\n\n Part of the point is that there is a difference between \"movements I'd consider good in religion\" and \"movement caused by christian theology\".\n \n \n \nMuch of the civil rights movement grew in churches. That's just the reality of the situation.\n\n In black churches, sure.\n It's the place where the oppressed regularly gathered, and they discussed their problems.\n Independent of religion.\n \n How many large WHITE-centered civil rights movements started in churches?\n \n \n \nThere has long been a movement in religion known as liberation/justice theology, which champions the cause of the poor and homeless. Indeed, Christ taught a lot about this.\n\n In fact, I gave examples of this and explicitly acknowledged that it was explicitly mentioned in Christianity. And that this credit is undeniable cause and effect.\n But that isn't \"civil rights\".\n \n \n \nAnd what of the (gasp) evangelicals who have recently taken a pro-environmental stance on global warming? Is that not good?\n\n Compare the SCOPE of those \"evangelicals\" to the rest of the Christian community, which includes MANY TIMES MORE christians who oppose an \"environmental stance on global warming\" with almost religious fervor.\n (That is actually something I wanted to bring up, that deserves its own thread. How the \"global warming\" debate takes on such a religious divide in the first place, but I usually chalk it up to stubborn resistance of anything those \"godless liberals\" say, therefore it must be wrong because some \"brands\" of christianity don't like the source...)\n \n But getting back to your comment, THIS is part of what I'm talking about.\n You take an example where SOME people who have a \"christian\" name-tag (evangelical) support it, and you automatically IGNORE the larger number who share that name-tag that OPPOSE it and you ignore that the cause of the support IS NOT BASED on the name-tag...\n That's according to a new report by The Barna Group, which surveys trends among evangelicals -- which it defines as a more doctrinally conservative band among those who define themselves as born-again Christians.\n \n Only 33 percent thought global warming was a major problem, compared with 69 percent in the latter category. Other Christian and non-Christian groups were also more concerned about global warming.http://www.bluegrassreport.org/bluegrass_politics/2007/09/poll-evangelica.html\n \n And a second web-site that shows 62% secular believe man to be the cause of global warming, and 37% white evangelicals with the same view.\n http://pewforum.org/docs/index.php?DocID=153\n \n Your attempt to give credit to evangelicals doesn't make sense.\n It's like trying to give credit to the Hatfield family for fighting for the North in the civil war, when the truth is that you have ONE out of FIVE brothers fighting for the north, and the rest fight for the South!\n \n \n \nThese aren't examples that are 'in spite' of the religion--they are because of the religion: e.g. the teachings of Christ to help the poor and the belief that the environment God has made is in our charge to take care of and protect.\n\n How can you jump from \"civil rights\" to \"helping the poor\"?\n They aren't the same things.\n \n I have already granted that \"helping the poor\" is something you can attribute to the Christian theology.\n But what I ALSO said, which you have failed to even try to comment on, is that other issues like slavery and equal treatment of women have Christianity with more credit for OPPOSING those equal rights than for supporting.\n \n \n \nReligion is like most anything else--it can be used for good or bad. I know there are people here who are pretty bitter toward religion, but like it or not, sometimes things that you view as good come out of it. And it's not exactly fair for people to refuse to give credit where credit is due, yet jump at the chance to condemn it when it can be blamed.\n\n I have already talked about \"giving credit where credit is due\".\n Quite frankly, I think the converse of your statement should be more of an issue for you.\n In the past, you have refused to acknowledge the damage that \"Christianity\" has done to the gay people. You want to \"give credit\" to Christianity, but you refuse to accept blame.", 
   {}, 
   307809, 
   null, 
   1207587660.0
  ], 
  [
   307834, 
   null, 
   "jyoshu", 
   "In black churches, sure.\n It's the place where the oppressed regularly gathered, and they discussed their problems. Independent of religion.\n\n \n They also listen to sermons, heard about how the Bible speaking against mistreatment of others, etc. You seem to be implying they were just having secular meeting in a church building. Sorry, but there wasn't some uncrossed line between religion and their \"meetings\" about civil rights. They were inter-related, and often still are, in such churches. Do you seriously not realise that religion has played a big role in civil rights? Do you not realise that it's not just coincidence that many of the civil rights leaders were, in fact, preachers?\n \n Take the Jeremiah Wright example, that's been in the news a lot lately. IF you read his statements, you aren't going to just find civil rights-related statements divorced from Christian teaching. It's all related. he spoke of Jesus, God, etc. (Not that I agree with everything the man said. But I use the example to exemplify the point.) His sermons weren't just secular civil rights rallies. They were, in fact, religious.\n \n \nIn fact, I gave examples of this and explicitly acknowledged that it was explicitly mentioned in Christianity. And that this credit is undeniable cause and effect. But that isn't \"civil rights\".\n\n \n How is that not a part of the civil rights movement? The liberation movement certainly IS a part of the civil rights movement. Frankly, I can't possibly see how you could say otherwise.\n \n \nCompare the SCOPE of those \"evangelicals\" to the rest of the Christian community, which includes MANY TIMES MORE christians who oppose an \"environmental stance on global warming\" with almost religious fervor.\n\n \n Such as? The opposition to global warming crosses lines of whether people are religious or not. Sure, some evangelicals aren't on board, but there are far more that take it seriously than those that don't. That's the way society is, in general. It has been found that 70% of evangelicals believing global warming was a real threat and 2/3rds of them believed it warranted immediate response! Not exactly much of a \"split\". Meanwhile, VERY high profile leaders (some of whom you no doubt consider villains who oppose gay rights) are publicly coming out in an environmental stance. We're talking about people like Pat Robertson here.\n \n \nBut getting back to your comment, THIS is part of what I'm talking about. You take an example where SOME people who have a \"christian\" name-tag (evangelical) support it, and you automatically IGNORE the larger number who share that name-tag that OPPOSE it and you ignore that the cause of the support IS NOT BASED on the name-tag...\n\n \n Larger #, like 30%, as the poll linked about demonstrates? emoticon_rolleyes \n \n \nThat's according to a new report by The Barna Group, which surveys trends among evangelicals -- which it defines as a more doctrinally conservative band among those who define themselves as born-again Christians.\n \n Only 33 percent thought global warming was a major problem, compared with 69 percent in the latter category. Other Christian and non-Christian groups were also more concerned about global warming.http://www.bluegrassreport.org/bluegrass_politics/2007/09/poll-evangelica.html\n\n \n From the poll I posted ...\n \"And now details from a new poll of evangelical Christians seem to strengthen the call made the group of 86 evangelical leaders for action to reduce global warming.\n \n In the poll, conducted by Ellison Research&#8212;-which frequently surveys church leaders&#8212;-70 percent of evangelicals said they believed global warming will pose a serious threat to future generations. Sixty-three percent of evangelicals believed that although global warming may be a long-term problem, since it is being caused today, the nation must start addressing it immediately.\"\n Oh, and what's their reason? Why, it's religious! ;) \n \"In other findings from the Ellison Research poll, 95 percent of evangelical respondents agreed that &#8220;God gave us dominion over His creation, so we have a responsibility to care for it.&#8221;\n \n I'll respond to the rest of your post a bit later.", 
   {}, 
   307826, 
   null, 
   1207591620.0
  ], 
  [
   307846, 
   null, 
   "foundit66", 
   "They also listen to sermons, heard about how the Bible speaking against mistreatment of others, etc. You seem to be implying they were just having secular meeting in a church building. Sorry, but there wasn't some uncrossed line between religion and their \"meetings\" about civil rights.\n\n Then kindly explain to me why this \"phenomenon\" was observed so prominently in the black churches, but in the white churches an entirely different sort of \"meeting\" was taking place...\n \n After all, it's about the same bible, right?\n \n The problem with your perspective is that YOU ARE trying to associate the good while ignoring the bad.\n \n By your limited logic, we could also claim that the RACISM seen in the white churches was caused by the religion as well, right?\n The KKK claims a KHRISTIAN mandate for their beliefs, do they not?\n \n My approach is to observe that INDEPENDENT SECULAR motivations existed which caused the discussions, in this case the oppressed blacks had their discussion prompted based on the fact that they were oppressed. NOT based on the religion.\n \n \n \nThey were inter-related, and often still are, in such churches. Do you seriously not realise that religion has played a big role in civil rights? Do you not realise that it's not just coincidence that many of the civil rights leaders were, in fact, preachers?\n\n And do YOU not seriously realize that religion also played a big role in the KKK side of the fence?\n Look at Hitler's speeches. He claims a religious / christian mandate for his actions.\n \n As for the BLACK men who played a big role in civil rights being PREACHERS, how the heck do you think that's going to work?\n Are they going to turn to their black senator instead? (Oh wait. They didn't have one.)\n With poor black people, the only black people who are PAID to TALK are the PREACHERS. And it also crosses the line where religion is USED (not applied, but USED) to ends that are not endorsed by the religion.\n \n By your approach, the Rev Al Sharpton and Rev Jesse Jackson's actions are based on christianity, right?\n \n This conversation is funny in that I am repeatedly trying to delve into DEEPER THOUGHT on these issues instead of blind association, while you repeatedly go for the blind association.\n You cannot show me BIBLE PASSAGES which lead to racial equality, so instead you try causal factor by association.\n \n \n \nTake the Jeremiah Wright example, that's been in the news a lot lately. IF you read his statements, you aren't going to just find civil rights-related statements divorced from Christian teaching. It's all related. he spoke of Jesus, God, etc. (Not that I agree with everything the man said. But I use the example to exemplify the point.) His sermons weren't just secular civil rights rallies. They were, in fact, religious.\n\n So is \"Whitey is the devil!\" a Christian philosophy then?\n \n A perfect example of what is REALLY going on here is with Archie.\n In another thread, he is talking about a LOT of stuff that goes well beyond the actual theology found in the bible.\n But he CLAIMS it as knowledge, associated with the religion.\n \n I mean geez. Christians can't agree on whether or not it's actually Christ's body and blood, or represents it, or is transubstantiated.\n And then you have the VERY real historical dispute on whether or not the bible plays a part in racial equality?\n I can't get past the very real fact that the bible EXPLICITLY TELLS SLAVES how to be GOOD SLAVES.\n So jumping from that to telling us that the bible supports racial equality is unreal.\n \n \n \nHow is that not a part of the civil rights movement? The liberation movement certainly IS a part of the civil rights movement. Frankly, I can't possibly see how you could say otherwise.\n\n Giving to the poor is not a civil rights issue.\n Giving to the poor is not black equality.\n Quit trying to use pronouns to confuse the issue. When I talk about X, stop pretending I'm talking about Y.\n \n \n \nSuch as? The opposition to global warming crosses lines of whether people are religious or not. Sure, some evangelicals aren't on board, but there are far more that take it seriously than those that don't. That's the way society is, in general. It has been found that 70% of evangelicals believing global warming was a real threat and 2/3rds of them believed it warranted immediate response! Not exactly much of a \"split\". Meanwhile, VERY high profile leaders (some of whom you no doubt consider villains who oppose gay rights) are publicly coming out in an environmental stance. We're talking about people like Pat Robertson here.\n\n I would hardly invoke Pat Robertson if I were you, unless you're willing to also associate his stances on \"other\" issues as being \"religious\".\n Would you care to delve into his various positions regarding RACE? Can we automatically associate THOSE with religion as well?\n Or is it just pick-and-choose buffet?\n \n But back to the topic, you are approaching the issue from only one dimension, and attempting to associate \"causality\" based on ONE DIMENSION.\n Likewise, I could observe \"75% who have characteristic X believe in Y\". (What you just did.)\n And then we could loudly proclaim \"Characteristic X causes Y.\" And that would be nonsense.\n \n But then if we REALLY took a step back and looked at how many people who DO NOT have characteristic X, and compare positions on \"Y\", THAT would be a more encompassing analysis.\n And on THIS issue, the fact that evangelicals are LESS LIKELY to go after global warming than their non-evangelical counter-parts CANNOT be overlooked.\n By the above analogy, when 95% who do NOT have characteristic X also believe in Y, one comes to a different conclusion.\n One starts to question if characteristic X HINDERS a belief in Y, cause people are MORE LIKELY to believe in Y WITHOUT X.\n \n And on a final note, have you ever heard of \"Ellison Research\" before?\n http://www.ellisonresearch.com/mission.htm\n Looking at their web-site, they sound more like a P.R. firm, which would make more sense when one also considers that the \"Ellison\" poll flies in the face of numerous other polls on the exact same issue.\n And how much you want to bet that the \"poll\" was commissioned by the \"Evangelical Climate Initiative\"?\n \n If you seriously want to discuss this issue, you have to address the fact that evangelicals are LESS LIKELY to support \"global warming\" defensive action than non-evangelicals.\n \n \n \nLarger #, like 30%, as the poll linked about demonstrates? emoticon_rolleyes \n\n Actually, it was 33%. (From my article at least...)\n \"Only 33 percent (of evangelicals) thought global warming was a major problem...\"\n \n There are numerous polls substantiating my point. The likelihood of an evangelical supporting global warming is LOWER than the likelihood of a NON-evangelical supporting global warming.\n And based on that, it is nonsensical to claim \"evangelical\" as a causal factor for \"supporting global warming\".\n \n Another one:\n \"According to an August 2006 poll by the Pew Research Center's Forum on Religion and Public Life, 78 percent of secular Americans had a favorable view of the environmentalist movement, compared to 49 percent of white evangelical Christians.\n Regarding global warming specifically, the poll shows that 25 percent of white evangelicals believe that there is no solid evidence that the earth is getting warmer, compared to 9 percent of secularists\"\n \n http://pewforum.org/docs/index.php?DocID=153\n \n (And note, this poll is a different year than the previous Pew poll, showing the consistency of the evangelicals to be MORE AGAINST global warming.)", 
   {
    "unicode_changes_made": true
   }, 
   307834, 
   null, 
   1207600380.0
  ], 
  [
   307868, 
   null, 
   "jyoshu", 
   "Then kindly explain to me why this \"phenomenon\" was observed so prominently in the black churches, but in the white churches an entirely different sort of \"meeting\" was taking place...\n \n After all, it's about the same bible, right?\n \n The problem with your perspective is that YOU ARE trying to associate the good while ignoring the bad.\n \n By your limited logic, we could also claim that the RACISM seen in the white churches was caused by the religion as well, right?\n The KKK claims a KHRISTIAN mandate for their beliefs, do they not?\n \n My approach is to observe that INDEPENDENT SECULAR motivations existed which caused the discussions, in this case the oppressed blacks had their discussion prompted based on the fact that they were oppressed. NOT based on the religion.\n \n And do YOU not seriously realize that religion also played a big role in the KKK side of the fence? ([the KKK card])\n \n ... [and the Hitler card ....]\n\n \n Tell you what. I certainly am NOT ignoring that bad things have come out of religion, and even though I've stated such ALREADY in this conversation with you, I'll do it again right here, just so you won't be able to indicate a falsehood that I don't. So yes, the bulk of opposition against gays has come out of religion (not just Christianity, BTW). There, you see? Now, hopefully, you'll stop this diversion. \n \n Now, if you'll just simply admit that GOOD also sometimes comes out of religion (rather than ONLY happening DESPITE religion, as you've very clearly asserted), then I'll be perfectly happy and won't need to argue with you on this anymore. Because that's the issue, as far as I'm concerned.", 
   {}, 
   307846, 
   null, 
   1207607100.0
  ], 
  [
   307869, 
   null, 
   "foundit66", 
   "Tell you what. I certainly am NOT ignoring that bad things have come out of religion, and even though I've stated such ALREADY in this conversation with you, I'll do it again right here, just so you won't be able to indicate a falsehood that I don't. So yes, the bulk of opposition against gays has come out of religion (not just Christianity, BTW). There, you see? Now, hopefully, you'll stop this diversion. \n \n Now, if you'll just simply admit that GOOD also sometimes comes out of religion, then I'll be perfectly happy and won't need to argue with you on this anymore. Because that's the issue, as far as I'm concerned.\n\n \n As usual, not the full story...\n 1) I'm talking about the actual negative impact upon gays that the gay preaching has had.\n You will happily give \"Christianity\" the credit for the anti-gay discrimination, but I'm talking about MORE than just the discrimination, but rather just the impact of the OPINION towards gays...\n \n 2) Asking me to say something I already said?\n foundit66: \"The bible should be given credit when it's actual positive teachings are followed. \"Love thy neighbor\". Give to the poor. etc, etc...\" emoticon_rolleyes \n \n I have never said good can never come out of religion.\n I explicitly gave examples of some of the good that comes out of religion. emoticon_rolleyes", 
   {}, 
   307868, 
   null, 
   1207607340.0
  ], 
  [
   307871, 
   null, 
   "jyoshu", 
   "As usual, not the full story...\n 1) I'm talking about the actual negative impact upon gays that the gay preaching has had.\n You will happily give \"Christianity\" the credit for the anti-gay discrimination, but I'm talking about MORE than just the discrimination, but rather just the impact of the OPINION towards gays...\n\n \n Sure, I have no problem saying as such as well. I agree. Why should I have any problem with that?\n \n \n2) Asking me to say something I already said?\n foundit66: \"The bible should be given credit when it's actual positive teachings are followed. \"Love thy neighbor\". Give to the poor. etc, etc...\" emoticon_rolleyes \n \n I have never said good can never come out of religion.\n I explicitly gave examples of some of the good that comes out of religion. emoticon_rolleyes\n\n \n Then please explain this statement of yours, if you would, and what you mean SPECIFICALLY: \"For many Christian attempts at \"claiming credit\" for a variety of some good, it should be more accurately attributed to our evolving society, sometimes IN SPITE OF religion.\"\n \n \n If Christianity has done good, then why should Christians NOT attempt to claim credit?", 
   {}, 
   307869, 
   null, 
   1207607880.0
  ], 
  [
   307872, 
   null, 
   "smiley", 
   "Sure, I have no problem saying as such as well. I agree. Why should I have any problem with that?\n \n \n \n Then please explain this statement of yours, if you would, and what you mean SPECIFICALLY: \"For many Christian attempts at \"claiming credit\" for a variety of some good, it should be more accurately attributed to our evolving society, sometimes IN SPITE OF religion.\"\n \n \n If Christianity has done good, then why should Christians NOT attempt to claim credit?\n\n In his defense, he did say 'many' christians, and 'sometimes' inspite of religion. These are classic get out clauses used in 'many' ads on TV, so they could quite legitimately apply here too.\n \n Smiley", 
   {}, 
   307871, 
   null, 
   1207608360.0
  ], 
  [
   307873, 
   null, 
   "foundit66", 
   "Then please explain this statement of yours, if you would, and what you mean SPECIFICALLY: \"For many Christian attempts at \"claiming credit\" for a variety of some good, it should be more accurately attributed to our evolving society, sometimes IN SPITE OF religion.\"\n If Christianity has done good, then why should Christians NOT attempt to claim credit?\n\n I am not claiming that ALL claimed good is invalid.\n I was specifying \"a VARIETY of SOME good\"\n \n I even gave an example of SOME of that good that I don't think Christianity can claim credit for.\n Racial equality. Women's equality.\n \n The Old Testament is filled with racial prejudice, often ADVOCATED by God.\n Even in the New Testament, when Jesus healed the centurion's servant, the people felt obligated to justify why this non-Israelite person should be helped.\n Granted, Jesus never uttered a syllable requiring this justification, but he also made no criticism of it either. In all of Jesus's travels, it is very rare for any of his \"aid\" to help somebody who was not an Israelite.\n \n If it weren't his later command to go forth and preach to all nations, I would think that the Israelite \"Christianity\" would have taken on a very exclusionary approach, much like the Old Testament Hebrew approach.\n \n And as for women's equality, I think the premise is so accepted (that the religion does more to oppose women's equality) that it isn't even attempted to be debated.", 
   {}, 
   307871, 
   null, 
   1207608960.0
  ], 
  [
   307939, 
   null, 
   "Jo Bennett", 
   "Christianity is opposed to racial and sex discrimination, hence the passage \"in Christ there is neither male nor female, Greek nor Jew, slave nor free\".", 
   {}, 
   307873, 
   null, 
   1207676340.0
  ], 
  [
   307944, 
   null, 
   "foundit66", 
   "Christianity is opposed to racial and sex discrimination, hence the passage \"in Christ there is neither male nor female, Greek nor Jew, slave nor free\".\n\n That is not what that passage says at all.\n \n Gal 3:26 ¶ For ye are all the children of God by faith in Christ Jesus. \n Gal 3:27 For as many of you as have been baptized into Christ have put on Christ. \n Gal 3:28 There is neither Jew nor Greek, there is neither bond nor free, there is neither male nor female: for ye are all one in Christ Jesus. \n \n The logical translation is that Jesus does not discriminate in belief. Not forbidding Christians to discriminate amongst themselves.\n If it were really interpreted as \"no racial or sexual discrimination\", one would have to wonder how a \"Christian\" nation could ever have instituted misogyny or slavery in the first place.\n \n Misogyny is well documented in the bible.\n \n 1Ti 2:9 In like manner also, that women adorn themselves in modest apparel, with shamefacedness and sobriety; not with broided hair, or gold, or pearls, or costly array; \n 1Ti 2:10 But (which becometh women professing godliness) with good works. \n 1Ti 2:11 Let the woman learn in silence with all subjection. \n 1Ti 2:12 But I suffer not a woman to teach, nor to usurp authority over the man, but to be in silence. \n 1Ti 2:13 For Adam was first formed, then Eve. \n 1Ti 2:14 And Adam was not deceived, but the woman being deceived was in the transgression. \n 1Ti 2:15 Notwithstanding she shall be saved in childbearing, if they continue in faith and charity and holiness with sobriety. \n \n Christianity (at least the biblical dogma) wants women silent, barefoot and pregnant.", 
   {}, 
   307939, 
   null, 
   1207678800.0
  ], 
  [
   307945, 
   null, 
   "foundit66", 
   "1Cr 14:34 Let your women keep silence in the churches: for it is not permitted unto them to speak; but [they are commanded] to be under obedience, as also saith the law. \n 1Cr 14:35 And if they will learn any thing, let them ask their husbands at home: for it is a shame for women to speak in the church. \n \n \n \"Slaves, obey your human masters with fear and trembling, in the sincerity of your heart, as to Christ.\" (Ephesians 6:5)\n \n \"Slaves, obey your human masters in everything; don't work only while being watched, in order to please men, but work wholeheartedly, fearing the Lord.\" (Colossians 3:22)\n \n \"Slaves are to be submissive to their masters in everything, and to be well-pleasing, not talking back .\" (Titus 2:9)\n \n \"Slaves, submit yourselves to your masters with all respect, not only to the good and gentle but also to the cruel. \" (1 Peter 2:18)\n \n That's right slaves.\n If your master is cruel, the bible tells you that you STILL have to submit to him.\n \n \n And Archie if you're listening, even though we know your heart and mind are closed, THIS is one of the various problems I have with the \"Christian\" religion.\n It is NOT indicative of a book that was written by a \"good\" and \"loving\" god. Not one indicative of a \"just\" god that was \"constant\".\n \n It reads like a book written by primitive men, using religion to justify their primitive (and IMMORAL) positions on a variety of subjects that we now know are WRONG. And that the only christians who support the bible on these passages are labelled as \"racist\" or \"misogynist\".\n \n So you can continue with these lame rejoinders of \"ignorant of the truth\" just because I don't believe as you do, but I will keep tossing the biblical \"truth\" back in your face.", 
   {}, 
   307944, 
   null, 
   1207679340.0
  ], 
  [
   312812, 
   null, 
   "jazyjason", 
   "1Cr 14:34 Let your women keep silence in the churches: for it is not permitted unto them to speak; but [they are commanded] to be under obedience, as also saith the law. \n 1Cr 14:35 And if they will learn any thing, let them ask their husbands at home: for it is a shame for women to speak in the church. \n \n \n \"Slaves, obey your human masters with fear and trembling, in the sincerity of your heart, as to Christ.\" (Ephesians 6:5)\n \n \"Slaves, obey your human masters in everything; don't work only while being watched, in order to please men, but work wholeheartedly, fearing the Lord.\" (Colossians 3:22)\n \n \"Slaves are to be submissive to their masters in everything, and to be well-pleasing, not talking back .\" (Titus 2:9)\n \n \"Slaves, submit yourselves to your masters with all respect, not only to the good and gentle but also to the cruel. \" (1 Peter 2:18)\n \n That's right slaves.\n If your master is cruel, the bible tells you that you STILL have to submit to him.\n \n \n And Archie if you're listening, even though we know your heart and mind are closed, THIS is one of the various problems I have with the \"Christian\" religion.\n It is NOT indicative of a book that was written by a \"good\" and \"loving\" god. Not one indicative of a \"just\" god that was \"constant\".\n \n It reads like a book written by primitive men, using religion to justify their primitive (and IMMORAL) positions on a variety of subjects that we now know are WRONG. And that the only christians who support the bible on these passages are labelled as \"racist\" or \"misogynist\".\n \n So you can continue with these lame rejoinders of \"ignorant of the truth\" just because I don't believe as you do, but I will keep tossing the biblical \"truth\" back in your face.\n\n \n \n Basically this is the view most modern Christians have including my parents as far as homosexuality goes. it's like a disease to them or something. Maybe I should bring medical masks to them when I come out to them so they dont catch what i have lol. Anyways foundit you worded it perfectly. A god that was suited for the time of primitve man where they still crucified people for their beliefs tore toungues out and burnt people at stakes. Sound like the modern middle east anyone? When you view religion in that part of the world its like looking into a time capsule and seeing how horrid the ancient world really was.", 
   {}, 
   307945, 
   null, 
   1213029120.0
  ], 
  [
   312817, 
   null, 
   "Archangel", 
   "This may turn out to be a self-extinguishing phenomenon.\n \n Christian, Maybe. Compassionate, Hardly. \n \n This is a commentary on the statistical surveys of the Christian Barna group, and especially its head, David Kinnaman. Kinnaman fears that Christianity has now become identified by obsessive homophobia:\n \n If young people are increasingly accepting of gay human beings on the one hand, and critical of Christianity for being obsessed with its homophobia on the other, what is the future for Christianity in the West?\n \n Christianity these days has become offensive to gay people because of its constant condemnation of love we find natural. Their claim that gay love is somehow illegitimate is neither friendly, nor compassionate, nor accepting. It is obnoxious.\n \n If a new generation of Christians finds this message of acceptance increasingly compelling, what is the future of current Christian homophobia? I'd hope it's bleak. It won't die out till the last homophobe croaks, but I think it is on the way out.\n \n Surveys suggest that Old Christianity, the Christianity that hates gays, is not long for this world. No-one will mourn it. When it kicks the bucket, we will give it a not-so-fond farewell.\n\n \n All you have shown in 38 posts foundit is #1, your complete inability to interpret the word of God as He intended it to be interpreted. And #2, your communities anti-christian bigotry and heterophobia. maladies which you are all woefully blind to seeing in yourselves. You actually think and believe that just because you believe in and make these assertions against Gods word, that you are in any way right in your critiques. A better example of self delusion would be difficult to find. emoticon_frazzled", 
   {}, 
   301380, 
   null, 
   1213036740.0
  ], 
  [
   312834, 
   null, 
   "T.Q", 
   "All you have shown in 38 posts foundit is #1, your complete inability to interpret the word of God as He intended it to be interpreted. And #2, your communities anti-christian bigotry and heterophobia. maladies which you are all woefully blind to seeing in yourselves. You actually think and believe that just because you believe in and make these assertions against Gods word, that you are in any way right in your critiques. A better example of self delusion would be difficult to find. emoticon_frazzled\n\n \n Just so we're clear here, a gay person wanting the right to marry whom they choose, and for their partner to have the same rights you and your wife takes for granted makes them a \"heterophobe\"; but you wanting to deny a gay person these same rights does not make you a homophobe? To use your own words: \"A better example of self delusion would be difficult to find\"", 
   {}, 
   312817, 
   null, 
   1213053660.0
  ], 
  [
   312837, 
   null, 
   "Archangel", 
   "All you have shown in 38 posts foundit is #1, your complete inability to interpret the word of God as He intended it to be interpreted. And #2, your communities anti-christian bigotry and heterophobia. maladies which you are all woefully blind to seeing in yourselves. You actually think and believe that just because you believe in and make these assertions against Gods word, that you are in any way right in your critiques. A better example of self delusion would be difficult to find. emoticon_frazzled\n\n \n \nJust so we're clear here, a gay person wanting the right to marry whom they choose, and for their partner to have the same rights you and your wife takes for granted makes them a \"heterophobe\"; but you wanting to deny a gay person these same rights does not make you a homophobe? To use your own words: \"A better example of self delusion would be difficult to find\"\n\n \n Talk about projecting! Point out any of what you attribute to me saying that was actually said by me in my post you quoted?", 
   {}, 
   312834, 
   null, 
   1213055280.0
  ], 
  [
   312839, 
   null, 
   "T.Q", 
   "Talk about projecting! Point out any of what you attribute to me saying was actually said by me in my post that you quoted?\n\n \n Since your denying it so strenuously, I can only conclude you therefore support the right of gays to marry the partner of their choice and to enjoy the same benefits you and your spouse enjoy. Or was there some other portion of my post that is contradictory to your beliefs?\n \n Aw, how cute! Archie learnt a new word: Projecting. How is what I said \"projecting\" Archie?", 
   {}, 
   312837, 
   null, 
   1213056600.0
  ], 
  [
   312841, 
   null, 
   "Archangel", 
   "I didn't think you'd answer my question and actually point out where I said anything you attributed to me as saying. Why is that? Because you made it all up. emoticon_wow", 
   {}, 
   312839, 
   null, 
   1213056900.0
  ], 
  [
   312844, 
   null, 
   "T.Q", 
   "I didn't think you'd answer my question and actually point out where I said anything you attributed to me as saying. Why is that? Because you made it all up. emoticon_wow\n\n \n Which part did I make up exactly? You calling someone who supports gay rights a heterophobe? Or you denying that you're a homophobe? We can go around in circles like this all day, or you could just answer my questions so we can each clarify our positions. One looks good for you, the other bad. I'll let you decide which option you'd like to take.", 
   {}, 
   312841, 
   null, 
   1213057920.0
  ], 
  [
   312847, 
   null, 
   "jazyjason", 
   "Like I said earlier his head will pop off sooner or later because his lack of rationalization and modern thinking will overload what logic he has drawn from ancient texts and laws which have endorced slavery murder and other henious acts in cluding the slaughter of thousands in the name of a god or because god told them so or gods wills it. Funny if man can understand the will of god then why is there suffering hurt and poverty in the world? If man truely understood the will of god wouldnt he have opened up the clouds decended and given sugar free soda and cracker to all his good little sheep? I for one am not going to the slaughterhouse of logic.", 
   {}, 
   312844, 
   null, 
   1213059600.0
  ], 
  [
   312858, 
   null, 
   "Archangel", 
   "Like I said earlier his head will pop off sooner or later because his lack of rationalization and modern thinking will overload what logic he has drawn from ancient texts and laws which have endorced slavery murder and other henious acts in cluding the slaughter of thousands in the name of a god or because god told them so or gods wills it. Funny if man can understand the will of god then why is there suffering hurt and poverty in the world? If man truely understood the will of god wouldnt he have opened up the clouds decended and given sugar free soda and cracker to all his good little sheep? I for one am not going to the slaughterhouse of logic.\n\n \n Thanks for sharing your opinion jason, but that's all it is and it carries little weight in reality. On the other hand, my perspective is not my own but is a reflection of the one true God, the maker of all that is. Granted, you and those who think like you are blind to that reality and truth, but that has no bearing at all in nullifying or negating the eternal truths that come with knowing Him.\n \n If you take anything at all from these debates, please take this. My animosity and harsh response toward homosexuality; my lack of tolerance with the sin it represents according to Gods Word has nothing at all to do with my personal concern, care, love and compassion for you and all homosexuals whom I see as lost souls in dire need of salvation and redemption according to the promises God makes to all of His children through His Word, the bible. \n \n According to the bible, if I just accepted your sin as right and normal in spite of it being condemned in the bible, I would be not only betraying you and helping condemn you one day, but I would be betraying God Himself and calling His Holy Word a lie and unreliable. So please don't see the contention and lack of compromise I bring to this forum as an act of hatred for you. No my friend, please see it as an act of love. Because even though I know that i am hated, attacked, condemned and vilified by my fellow members who are secular humanists and atheists, I still stand on principle and without compromise, I share eternal truths with you that lead to agape love, eternal life and personal fellowship with the maker of all that is in time and space.\n \n I know that in ten million years I will be fellowshiping with my Heavenly Father in an unending eternity. The only question I have, is will any of you be there with us? And consider this also my young friend, sometimes the person who hurts you the most is telling you the hardest truth to accept, but he who accepts your error is supporting your downfall.", 
   {}, 
   312847, 
   null, 
   1213067040.0
  ], 
  [
   312882, 
   null, 
   "Matthew S", 
   "Thanks for sharing your opinion jason, but that's all it is and it carries little weight in reality. On the other hand, my perspective is not my own but is a reflection of the one true God, the maker of all that is. Granted, you and those who think like you are blind to that reality and truth, but that has no bearing at all in nullifying or negating the eternal truths that come with knowing Him.\n \n If you take anything at all from these debates, please take this. My animosity and harsh response toward homosexuality; my lack of tolerance with the sin it represents according to Gods Word has nothing at all to do with my personal concern, care, love and compassion for you and all homosexuals whom I see as lost souls in dire need of salvation and redemption according to the promises God makes to all of His children through His Word, the bible. \n \n According to the bible, if I just accepted your sin as right and normal in spite of it being condemned in the bible, I would be not only betraying you and helping condemn you one day, but I would be betraying God Himself and calling His Holy Word a lie and unreliable. So please don't see the contention and lack of compromise I bring to this forum as an act of hatred for you. No my friend, please see it as an act of love. Because even though I know that i am hated, attacked, condemned and vilified by my fellow members who are secular humanists and atheists, I still stand on principle and without compromise, I share eternal truths with you that lead to agape love, eternal life and personal fellowship with the maker of all that is in time and space.\n \n I know that in ten million years I will be fellowshiping with my Heavenly Father in an unending eternity. The only question I have, is will any of you be there with us? And consider this also my young friend, sometimes the person who hurts you the most is telling you the hardest truth to accept, but he who accepts your error is supporting your downfall.\n\n \n \n This is you opinion, one that is opposite to Lutheran teaching BTW. You may have and hold this opinion all you want and I will respect your right to have and even voice this opinion. But the moment you push for, support those your put this opinion into law that the rest of us have to live under is when you give up you righ to have an opinion. \n \n BTW the Lutheran theology teaches that we are saved though grace that no matter what we have done we are all ready saved. There is nothing we can do either way to effect the grace of God. No one has to \"get saved\" or accept Jesus as his/her personal savior because it was already done 2000 years ago on the cross. WE are saved through grace. The big sin is that you are telling Jason that his God given, joyous gift is a sin and something that needs repenting. Shame on you he might as well repent for letting the sun fall on his face or repent that the rain fell to water his garden. God created him gay, blesses his gayness, and Jason has nothing to repent for. If someone has to repent for the way God made then then when are you going to repent for being a heterosexual? Jesus himself said some are born gay.\n \n Matthew 19:11-12\n 11Jesus replied, \"Not everyone can accept this word, but only those to whom it has been given. 12For some are eunuchs because they were born that way; others were made that way by men; and others have renounced marriage because of the kingdom of heaven. The one who can accept this should accept it.\"\n http://www.youtube.com/watch?v=1sq3Hca_21A\n http://www.youtube.com/watch?v=jULRsvRWWoM\n \n So please get off Jasons back with your fundie teaching.", 
   {}, 
   312858, 
   null, 
   1213105440.0
  ], 
  [
   312892, 
   null, 
   "Archangel", 
   "\n \n BTW the Lutheran theology teaches that we are saved though grace that no matter what we have done we are all ready saved. There is nothing we can do either way to effect the grace of God. No one has to \"get saved\" or accept Jesus as his/her personal savior because it was already done 2000 years ago on the cross. WE are saved through grace. The big sin is that you are telling Jason that his God given, joyous gift is a sin and something that needs repenting. Shame on you he might as well repent for letting the sun fall on his face or repent that the rain fell to water his garden. God created him gay, blesses his gayness, and Jason has nothing to repent for. If someone has to repent for the way God made then then when are you going to repent for being a heterosexual? Jesus himself said some are born gay.\n\n \n Lie to me all you want Matthew, but stop lying to Jason, and especially to yourself. Must you corrupt every single thought process and philosophy you discuss? By me saying above that gays can be saved, and that Jesus accepts us all where we are at at the time, I am saying that He died for all of us no matter what our personal or predominant sins were. But you must inject this erroneous belief that everyone is saved whether they like it or not which goes against EVERYTHING Jesus or His Gospel teaches. Like any gift that is freely offered, Salvation must be accepted to be received. we must repent which means to turn away from that lifestyle which leads to our destruction.\n \n \n Romans 3:23 for all have sinned and fall short of the glory of God\n \n Romans 5:12 Therefore, just as through one man sin entered into the world, and death through sin, and so death spread to all men, because all sinned\n \n Are we justified when living by the 10 commandments?\n \n Romans 3:20 because by the works of the Law no flesh will be justified in His sight; for through the Law comes the knowledge of sin.\n \n See also bible verses ROM 7:5, ROM 7:25, GAL 5:4\n \n \n Then are we doomed?\n \n John 3:36 \"He who believes in the Son has eternal life; but he who does not obey the Son will not see life, but the wrath of God abides on him.\"\n \n John 3:17 \"For God did not send the Son into the world to judge the world, but that the world might be saved through Him. 18 \"He who believes in Him is not judged; he who does not believe has been judged already, because he has not believed in the name of the only begotten Son of God.\n \n Romans 10:9 that if you confess with your mouth Jesus as Lord, and believe in your heart that God raised Him from the dead, you will be saved;\n \n Romans 8:1 Therefore there is now no condemnation for those who are in Christ Jesus. 2 For the law of the Spirit of life in Christ Jesus has set you free from the law of sin and of death.\n \n See also bible verses IS 1:18, MK 2:5, LK 1:77, LK 7:48-50, JN 5:24, JN 11:25, ACTS 10:43, ACTS 16:31, ROM 1:17, ROM 3:22, GAL 3:26, ROM 10:10-13, ACTS 26:18\n \n \n How come?\n \n John 3:16 \"For God so loved the world, that He gave His only begotten Son, that whoever believes in Him shall not perish, but have eternal life.\n \n Mark 10:45 \"For even the Son of Man did not come to be served, but to serve, and to give His life a ransom for many.\"\n \n Acts 17:30 \"Therefore having overlooked the times of ignorance, God is now declaring to men that all people everywhere should repent, 31 because He has fixed a day in which He will judge the world in righteousness through a Man whom He has appointed, having furnished proof to all men by raising Him from the dead.\"\n \n Romans 5:19 For as through the one man's disobedience the many were made sinners, even so through the obedience of the One the many will be made righteous.\n \n Romans 5:21 so that, as sin reigned in death, even so grace would reign through righteousness to eternal life through Jesus Christ our Lord.\n \n 1 Corinthians 15:22 For as in Adam all die, so also in Christ all will be made alive.\n \n Titus 2:11 For the grace of God has appeared, bringing salvation to all men, 12 instructing us to deny ungodliness and worldly desires and to live sensibly, righteously and godly in the present age, 13 looking for the blessed hope and the appearing of the glory of our great God and Savior, Christ Jesus, 14 who gave Himself for us to redeem us from every lawless deed, and to purify for Himself a people for His own possession, zealous for good deeds.\n \n See also bible verses ROM5, ROM 5:15, 1JN 2:2, 1JN 4:9, ROM 3:22-26\n \n \n Isn't this kind of strange?\n \n Acts 13:38 \"Therefore let it be known to you, brethren, that through Him forgiveness of sins is proclaimed to you, 39 and through Him everyone who believes is freed from all things, from which you could not be freed through the Law of Moses. 40 \"Therefore take heed, so that the thing spoken of in the Prophets may not come upon you: 41 `BEHOLD, YOU SCOFFERS, AND MARVEL, AND PERISH; FOR I AM ACCOMPLISHING A WORK IN YOUR DAYS, A WORK WHICH YOU WILL NEVER BELIEVE, THOUGH SOMEONE SHOULD DESCRIBE IT TO YOU.' \"\n \n Act 2:38 Then Peter said to them, \"Repent\", and let every one of you be baptized in the name of Jesus Christ for the remission of sins; and you shall receive the gift of the Holy Spirit.\n 1 Corinthians 1:18 For the word of the cross is foolishness to those who are perishing, but to us who are being saved it is the power of God.\n \n 1 Corinthians 1:21 For since in the wisdom of God the world through its wisdom did not come to know God, God was well-pleased through the foolishness of the message preached to save those who believe. 22 For indeed Jews ask for signs and Greeks search for wisdom; 23 but we preach Christ crucified, to Jews a stumbling block and to Gentiles foolishness,\n \n 1 Corinthians 1:27 but God has chosen the foolish things of the world to shame the wise, and God has chosen the weak things of the world to shame the things which are strong,\n \n \n What should we do then?\n \n Acts 16:30 and after he brought them out, he said, \"Sirs, what must I do to be saved?\" 31 They said, \"Believe in the Lord Jesus, and you will be saved, you and your household.\"\n \n Mark 1:15 and saying, \"The time is fulfilled, and the kingdom of God is at hand; repent and believe in the gospel.\"\n \n John 6:28 Therefore they said to Him, \"What shall we do, so that we may work the works of God?\" 29 Jesus answered and said to them, \"This is the work of God, that you believe in Him whom He has sent.\"\n \n See also bible verse MT4:17\n \n So as you can see, the bible requires that we accept Jesus as our savior and then turn away from our sins through repentance. We then receive His Holy Spirit which indwells us as our Guide and connection to the living God which makes us one with Him. This is the pure and simple gospel of Christ and all of the corrupting that you do to change it to suit your personal preferences wont change that reality. If you lie to yourself about what is true, do you think that changes the truth? Of course it doesn't, but you do it in every debate you participate in.\n \n So tell me Matt, do you wake up each morning and ask the Lord how you can glorify Him with your life? Do you check your actions each and every moment of your life in order to try not to offend a Just and Holy God whom you know died for your sins? Based on what you have ever posted here, I would seriously doubt that you live for anyone other than yourself and what feels good to you. To you, all that matters is satisfying the needs of this corrupted and corruptible flesh that is temporary at best compared to eternal standards that really matter to us as children of God. That is the inevitable truth that you are destined to learn someday Matthew. Whether you realize it or not; we will all know the absolute truth one day. \n \n So if you persist in lying to yourself regarding what makes a true follower of Christ, that is obviously your choice. But don't lie to jason and attempt to feed the same lies of justification for sins to him. \n \n \nRepent\n \n Re*pent\"\\ (r?-p?nt\"), v. i. [imp. & p. p. Repented; p. pr. & vb. n. Repenting.] [F. se repentir; L. pref. re- re- + poenitere to make repent, poenitet me it repents me, I repent. See Penitent.]\n 1. To feel pain, sorrow, or regret, for what one has done or omitted to do.\n First she relents With pity; of that pity then repents. --Dryden.\n \n 2. To change the mind, or the course of conduct, on account of regret or dissatisfaction.\n\n \n Have you repented, or asked God to forgive you of your sins which He condemns in HIS WORD, and then turned away from those sins Matthew? Have you sought to honor God with your body in Jesus name? Have you accepted Jesus Christ as your personal savior? If so, then why are you telling Jason that we are all saved no matter what our lifestyle is? You are preaching universal salvation, and nowhere in the bible is that supported at all which is proven by the verses I posted above.\n \n I have shown above that even if you were living according to the 10 commandments you wouldn't be justified in Gods sight, so how can you possibly believe, and teach others that you are justified when participating in acts which God openly condemns? It is pure self deception which means you are purposely lying to yourself in order to excuse yourself for doing what you know to be WRONG. Think about it Matthew, you're only kidding yourself in the end. So please get off Jasons back with your spiritually corrupted teaching.", 
   {}, 
   312882, 
   null, 
   1213118520.0
  ], 
  [
   312975, 
   null, 
   "jazyjason", 
   "Lie to me all you want Matthew, but stop lying to Jason, and especially to yourself. Must you corrupt every single thought process and philosophy you discuss? By me saying above that gays can be saved, and that Jesus accepts us all where we are at at the time, I am saying that He died for all of us no matter what our personal or predominant sins were. But you must inject this erroneous belief that everyone is saved whether they like it or not which goes against EVERYTHING Jesus or His Gospel teaches. Like any gift that is freely offered, Salvation must be accepted to be received. we must repent which means to turn away from that lifestyle which leads to our destruction.\n \n \n Romans 3:23 for all have sinned and fall short of the glory of God\n \n Romans 5:12 Therefore, just as through one man sin entered into the world, and death through sin, and so death spread to all men, because all sinned\n \n Are we justified when living by the 10 commandments?\n \n Romans 3:20 because by the works of the Law no flesh will be justified in His sight; for through the Law comes the knowledge of sin.\n \n See also bible verses ROM 7:5, ROM 7:25, GAL 5:4\n \n \n Then are we doomed?\n \n John 3:36 \"He who believes in the Son has eternal life; but he who does not obey the Son will not see life, but the wrath of God abides on him.\"\n \n John 3:17 \"For God did not send the Son into the world to judge the world, but that the world might be saved through Him. 18 \"He who believes in Him is not judged; he who does not believe has been judged already, because he has not believed in the name of the only begotten Son of God.\n \n Romans 10:9 that if you confess with your mouth Jesus as Lord, and believe in your heart that God raised Him from the dead, you will be saved;\n \n Romans 8:1 Therefore there is now no condemnation for those who are in Christ Jesus. 2 For the law of the Spirit of life in Christ Jesus has set you free from the law of sin and of death.\n \n See also bible verses IS 1:18, MK 2:5, LK 1:77, LK 7:48-50, JN 5:24, JN 11:25, ACTS 10:43, ACTS 16:31, ROM 1:17, ROM 3:22, GAL 3:26, ROM 10:10-13, ACTS 26:18\n \n \n How come?\n \n John 3:16 \"For God so loved the world, that He gave His only begotten Son, that whoever believes in Him shall not perish, but have eternal life.\n \n Mark 10:45 \"For even the Son of Man did not come to be served, but to serve, and to give His life a ransom for many.\"\n \n Acts 17:30 \"Therefore having overlooked the times of ignorance, God is now declaring to men that all people everywhere should repent, 31 because He has fixed a day in which He will judge the world in righteousness through a Man whom He has appointed, having furnished proof to all men by raising Him from the dead.\"\n \n Romans 5:19 For as through the one man's disobedience the many were made sinners, even so through the obedience of the One the many will be made righteous.\n \n Romans 5:21 so that, as sin reigned in death, even so grace would reign through righteousness to eternal life through Jesus Christ our Lord.\n \n 1 Corinthians 15:22 For as in Adam all die, so also in Christ all will be made alive.\n \n Titus 2:11 For the grace of God has appeared, bringing salvation to all men, 12 instructing us to deny ungodliness and worldly desires and to live sensibly, righteously and godly in the present age, 13 looking for the blessed hope and the appearing of the glory of our great God and Savior, Christ Jesus, 14 who gave Himself for us to redeem us from every lawless deed, and to purify for Himself a people for His own possession, zealous for good deeds.\n \n See also bible verses ROM5, ROM 5:15, 1JN 2:2, 1JN 4:9, ROM 3:22-26\n \n \n Isn't this kind of strange?\n \n Acts 13:38 \"Therefore let it be known to you, brethren, that through Him forgiveness of sins is proclaimed to you, 39 and through Him everyone who believes is freed from all things, from which you could not be freed through the Law of Moses. 40 \"Therefore take heed, so that the thing spoken of in the Prophets may not come upon you: 41 `BEHOLD, YOU SCOFFERS, AND MARVEL, AND PERISH; FOR I AM ACCOMPLISHING A WORK IN YOUR DAYS, A WORK WHICH YOU WILL NEVER BELIEVE, THOUGH SOMEONE SHOULD DESCRIBE IT TO YOU.' \"\n \n Act 2:38 Then Peter said to them, \"Repent\", and let every one of you be baptized in the name of Jesus Christ for the remission of sins; and you shall receive the gift of the Holy Spirit.\n 1 Corinthians 1:18 For the word of the cross is foolishness to those who are perishing, but to us who are being saved it is the power of God.\n \n 1 Corinthians 1:21 For since in the wisdom of God the world through its wisdom did not come to know God, God was well-pleased through the foolishness of the message preached to save those who believe. 22 For indeed Jews ask for signs and Greeks search for wisdom; 23 but we preach Christ crucified, to Jews a stumbling block and to Gentiles foolishness,\n \n 1 Corinthians 1:27 but God has chosen the foolish things of the world to shame the wise, and God has chosen the weak things of the world to shame the things which are strong,\n \n \n What should we do then?\n \n Acts 16:30 and after he brought them out, he said, \"Sirs, what must I do to be saved?\" 31 They said, \"Believe in the Lord Jesus, and you will be saved, you and your household.\"\n \n Mark 1:15 and saying, \"The time is fulfilled, and the kingdom of God is at hand; repent and believe in the gospel.\"\n \n John 6:28 Therefore they said to Him, \"What shall we do, so that we may work the works of God?\" 29 Jesus answered and said to them, \"This is the work of God, that you believe in Him whom He has sent.\"\n \n See also bible verse MT4:17\n \n So as you can see, the bible requires that we accept Jesus as our savior and then turn away from our sins through repentance. We then receive His Holy Spirit which indwells us as our Guide and connection to the living God which makes us one with Him. This is the pure and simple gospel of Christ and all of the corrupting that you do to change it to suit your personal preferences wont change that reality. If you lie to yourself about what is true, do you think that changes the truth? Of course it doesn't, but you do it in every debate you participate in.\n \n So tell me Matt, do you wake up each morning and ask the Lord how you can glorify Him with your life? Do you check your actions each and every moment of your life in order to try not to offend a Just and Holy God whom you know died for your sins? Based on what you have ever posted here, I would seriously doubt that you live for anyone other than yourself and what feels good to you. To you, all that matters is satisfying the needs of this corrupted and corruptible flesh that is temporary at best compared to eternal standards that really matter to us as children of God. That is the inevitable truth that you are destined to learn someday Matthew. Whether you realize it or not; we will all know the absolute truth one day. \n \n So if you persist in lying to yourself regarding what makes a true follower of Christ, that is obviously your choice. But don't lie to jason and attempt to feed the same lies of justification for sins to him. \n \n \n \n Have you repented, or asked God to forgive you of your sins which He condemns in HIS WORD, and then turned away from those sins Matthew? Have you sought to honor God with your body in Jesus name? Have you accepted Jesus Christ as your personal savior? If so, then why are you telling Jason that we are all saved no matter what our lifestyle is? You are preaching universal salvation, and nowhere in the bible is that supported at all which is proven by the verses I posted above.\n \n I have shown above that even if you were living according to the 10 commandments you wouldn't be justified in Gods sight, so how can you possibly believe, and teach others that you are justified when participating in acts which God openly condemns? It is pure self deception which means you are purposely lying to yourself in order to excuse yourself for doing what you know to be WRONG. Think about it Matthew, you're only kidding yourself in the end. So please get off Jasons back with your spiritually corrupted teaching.\n\n \n \n LOL why am I the middle man all of a sudden? Archie I did accept Jesus and followed his teachings. I followed his attitude of meekness loving everyone being kind and following a cause for the good of people. Thats why I joined the military cause I thought that I was helping democracy and ensuring the freedoms of this good country and of the world be swearing an oath to defend the country. Not to fight Bush's war but to defend the rights and freedoms of every person selflessly. Unfourtunately the military isnt so glamourous and as valiant an institution as I once thought and have gone through a lot of suffering and heartache because of it. The point being is I asked god to love me for who I am and if he made me this way and if I love guys which I really do especially my sweet boyfriend, then it's ok. I keep my sexuality to myslef like I dont flaunt it and I dont flaunt my religion. I'm perfectly at ease. I love jesus and I thank him for creating me and loving me for who I am. It's when people take the true nature and teachings of Jesus and twist them for their own personal gain or insecurities and harm others through it is when I have a problem with it. It's wrong.", 
   {}, 
   312892, 
   null, 
   1213201020.0
  ], 
  [
   312976, 
   null, 
   "jazyjason", 
   "This is you opinion, one that is opposite to Lutheran teaching BTW. You may have and hold this opinion all you want and I will respect your right to have and even voice this opinion. But the moment you push for, support those your put this opinion into law that the rest of us have to live under is when you give up you righ to have an opinion. \n \n BTW the Lutheran theology teaches that we are saved though grace that no matter what we have done we are all ready saved. There is nothing we can do either way to effect the grace of God. No one has to \"get saved\" or accept Jesus as his/her personal savior because it was already done 2000 years ago on the cross. WE are saved through grace. The big sin is that you are telling Jason that his God given, joyous gift is a sin and something that needs repenting. Shame on you he might as well repent for letting the sun fall on his face or repent that the rain fell to water his garden. God created him gay, blesses his gayness, and Jason has nothing to repent for. If someone has to repent for the way God made then then when are you going to repent for being a heterosexual? Jesus himself said some are born gay.\n \n Matthew 19:11-12\n 11Jesus replied, \"Not everyone can accept this word, but only those to whom it has been given. 12For some are eunuchs because they were born that way; others were made that way by men; and others have renounced marriage because of the kingdom of heaven. The one who can accept this should accept it.\"\n http://www.youtube.com/watch?v=1sq3Hca_21A\n http://www.youtube.com/watch?v=jULRsvRWWoM\n \n So please get off Jasons back with your fundie teaching.\n\n \n Thanks for understanding my issues Matt. I'm glad at least a few people do.", 
   {}, 
   312882, 
   null, 
   1213201080.0
  ], 
  [
   312991, 
   null, 
   "Archangel", 
   "LOL why am I the middle man all of a sudden? Archie I did accept Jesus and followed his teachings. I followed his attitude of meekness loving everyone being kind and following a cause for the good of people. Thats why I joined the military cause I thought that I was helping democracy and ensuring the freedoms of this good country and of the world be swearing an oath to defend the country. Not to fight Bush's war but to defend the rights and freedoms of every person selflessly. Unfourtunately the military isnt so glamourous and as valiant an institution as I once thought and have gone through a lot of suffering and heartache because of it. The point being is I asked god to love me for who I am and if he made me this way and if I love guys which I really do especially my sweet boyfriend, then it's ok. I keep my sexuality to myslef like I dont flaunt it and I dont flaunt my religion. I'm perfectly at ease. I love jesus and I thank him for creating me and loving me for who I am. It's when people take the true nature and teachings of Jesus and twist them for their own personal gain or insecurities and harm others through it is when I have a problem with it. It's wrong.\n\n \n Tell me jason, what personal gain is there for me by standing against homosexuality? And how is anything I've said to you intended to harm you? But listen, We must all travel our own path so I wont bother sharing any unsolicited wisdom with you any further.", 
   {}, 
   312975, 
   null, 
   1213213980.0
  ], 
  [
   313070, 
   null, 
   "jazyjason", 
   "Tell me jason, what personal gain is there for me by standing against homosexuality? And how is anything I've said to you intended to harm you? But listen, We must all travel our own path so I wont bother sharing any unsolicited wisdom with you any further.\n\n \n \n I didnt say you had any personal gain or intended harm to me Archie. But there are those who would want to cause harm to me and get self gratification through it because I'm gay. However if I may point out that you have shut out persons opinions and their comments on your postings and have made a notion to I think foundit66 that hes getting whats coming to him. \n \n True they may have said some sharp remarks to your opinion but still everyone is entitled to their opinion and right to express it. I'm not saying your a bigot or insulting you I just observe that you become very defensive and almost counter attack towards certain comments. I have my opinions but I never seek to personally hurt or isult someone. I'm just looking out for your credibility on this forum.", 
   {}, 
   312991, 
   null, 
   1213291020.0
  ], 
  [
   313074, 
   null, 
   "sinjin", 
   "...so I wont bother sharing any unsolicited wisdom with you any further.\nYou really are somethin'.", 
   {}, 
   312991, 
   null, 
   1213293900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Bankruptcy of Christian Homophobia", 
  "url": "http://www.4forums.com/political/gay-rights-debates/10917-bankruptcy-christian-homophobia.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 10917, 
  "discussion_files": [
   [
    "25131.html", 
    "http://www.4forums.com/political/gay-rights-debates/10917-bankruptcy-christian-homophobia-print.html"
   ], 
   [
    "25132.html", 
    "http://www.4forums.com/political/gay-rights-debates/10917-bankruptcy-christian-homophobia-4-print.html"
   ], 
   [
    "25133.html", 
    "http://www.4forums.com/political/gay-rights-debates/10917-bankruptcy-christian-homophobia-3-print.html"
   ], 
   [
    "25134.html", 
    "http://www.4forums.com/political/gay-rights-debates/10917-bankruptcy-christian-homophobia-2-print.html"
   ]
  ], 
  "identifier": 10917
 }
]