[
 [
  [
   301124, 
   null, 
   "jyoshu", 
   "\"A distasteful comment about Chelsea Clinton by an MSNBC anchor could imperil Sen. Hillary Clinton's participation in future presidential debates on the network, a Clinton spokesman said. Sen. Hillary Clinton greets supporters during a rally in Tacoma, Washington, Friday. In a conference call with reporters, Clinton communications director Howard Wolfson on Friday excoriated MSNBC's David Shuster for suggesting the Clinton campaign had \"pimped out\" 27-year old Chelsea by having her place phone calls to celebrities and Democratic Party \"superdelegates\" on her mother's behalf. Wolfson called Shuster's comment \"beneath contempt\" and disgusting. \"I, at this point, can't envision a scenario where we would continue to engage in debates on that network,\" he added.\"\n From http://www.cnn.com/2008/POLITICS/02/08/msnbc.clinton/index.html\n \n Am I the only person who thinks people (particularly the Clinton campaign) are over-reacting to this? I agree the comment was pretty untactful and certainly careless, but Chelsea Clinton is not a child anymore. She's a grown woman who is basically campaigning on behalf of the Clinton candidacy, and it just seems to me that they're making a mountain out of a molehill over that. Isn't she a bit old for the whole sheltering-parent thing?\n \n I also note that if Clinton refuses to debate for MSNBC over this, they might as well just go ahead and make a CNN-only policy for the campaign because there's really not much else left. They already won't go on Fox. If someone screws up at CNN, are they just not going to debate at all since there will be no other cable-based news networks left to shun?", 
   {
    "post_info": {
     "post_title": "Are people over-reacting over David Shuster?"
    }
   }, 
   null, 
   null, 
   1202684460.0
  ], 
  [
   301132, 
   null, 
   "jim's trucking", 
   "Politicians should be larger than that. Hillary is acting like she's sensitive when she's really nothing but a cold hearted bitch.", 
   {}, 
   301124, 
   null, 
   1202686200.0
  ], 
  [
   301151, 
   null, 
   "Penfold", 
   "How do you know this to be so?emoticon_rolleyes", 
   {}, 
   301132, 
   null, 
   1202697660.0
  ], 
  [
   301153, 
   null, 
   "Archangel", 
   "\"A distasteful comment about Chelsea Clinton by an MSNBC anchor could imperil Sen. Hillary Clinton's participation in future presidential debates on the network, a Clinton spokesman said. Sen. Hillary Clinton greets supporters during a rally in Tacoma, Washington, Friday. In a conference call with reporters, Clinton communications director Howard Wolfson on Friday excoriated MSNBC's David Shuster for suggesting the Clinton campaign had \"pimped out\" 27-year old Chelsea by having her place phone calls to celebrities and Democratic Party \"superdelegates\" on her mother's behalf. Wolfson called Shuster's comment \"beneath contempt\" and disgusting. \"I, at this point, can't envision a scenario where we would continue to engage in debates on that network,\" he added.\"\n From http://www.cnn.com/2008/POLITICS/02/08/msnbc.clinton/index.html\n \n Am I the only person who thinks people (particularly the Clinton campaign) are over-reacting to this? I agree the comment was pretty untactful and certainly careless, but Chelsea Clinton is not a child anymore. She's a grown woman who is basically campaigning on behalf of the Clinton candidacy, and it just seems to me that they're making a mountain out of a molehill over that. Isn't she a bit old for the whole sheltering-parent thing?\n \n I also note that if Clinton refuses to debate for MSNBC over this, they might as well just go ahead and make a CNN-only policy for the campaign because there's really not much else left. They already won't go on Fox. If someone screws up at CNN, are they just not going to debate at all since there will be no other cable-based news networks left to shun?\n\n \n The Clintons wrote the book on gaining sympathy by becoming victims, and this is just another example of just such a ploy. Also, notice for the third time in a row, the very day before a Primary, Hillbilly once again conveniently cries before a live audience. If she wasn't so pathetic, it would be humorous.\n \n http://us.lrd.yahoo.com/_ylt=AsHah6Y4esadkrX1rLalyBB82PAI;_ylu=X3oDMTFmamFkdGZiBGlpZAMyNjgxOTcwNDM4NDYzMjIxNTQ4BG5vaAM0BHBvcwMxBHJpZAMxMTYzODQ2/SIG=15lvk2ukg/**http%3A//us.rd.yahoo.com/dailynews/rss/photos/categories/1756/index/*http%3A//news.yahoo.com/nphotos/Most-Emailed-Photos/ss/1756/im%3A/080209/480/37e15e00cf584d47971c72ac6b53fa95", 
   {}, 
   301124, 
   null, 
   1202699100.0
  ], 
  [
   301200, 
   null, 
   "Matthew S", 
   "Politicians should be larger than that. Hillary is acting like she's sensitive when she's really nothing but a cold hearted bitch.\n\n \n Is that pot and kettles?", 
   {}, 
   301132, 
   null, 
   1202741280.0
  ], 
  [
   301241, 
   null, 
   "Penfold", 
   "Was Romney pimping his sons? The inference of prostitution is not only disgusting in itself, but also carries undertones of good ol' misogyny.", 
   {}, 
   301200, 
   null, 
   1202768220.0
  ], 
  [
   301350, 
   null, 
   "jyoshu", 
   "The Clintons wrote the book on gaining sympathy by becoming victims, and this is just another example of just such a ploy. Also, notice for the third time in a row, the very day before a Primary, Hillbilly once again conveniently cries before a live audience. If she wasn't so pathetic, it would be humorous.\n\n \n I guess MSNBC is getting to be the newest 'biased media' target. I'm not that familiar with the network, but I had always heard it leaned more liberal like CNN, so it's kind of strange. Maybe they were trying to come across more the other way to compensate and said some stupid things in doing so.\n \n \"Tonight, the Politico's John Harris asked Clinton for her thoughts on the situation during an interview that aired on Washington, D.C.'s local ABC affiliate WJLA:\n \n Clinton said that her staff had sent her \"some independent study\" \"which seemed to suggest that\" \"in terms of the fairness of the coverage,\" Fox News Channel has treated her campaign more fairly than MSNBC.\n \n \"I really am troubled by this pattern of behavior and comments that you hear\" on MSNBC, said Clinton. Recently, two MSNBC hosts -- Chris Matthews and Joe Scarborough -- have come under heat for comments deemed sexist by many and liberal media watchdog group MediaMatters has increased its scrutiny of the cable network.\n \n The Clinton campaign recently suggested that Shuster's suspension was inadequate and Harris asked what Clinton thought would be a more appropriate punishment.\n \n \"That's not my job John,\" said Clinton. \"That's the job of the people who run the network.\"\n \n \"They need to take a hard look. This is like the third time they've had to apologize and there are lot of things that they haven't had to apologize for that might have merited one. So I wish they would take a look at some of the patterns of demeaning comments made on their network.\" \n \n http://www.mediabistro.com/fishbowlDC/television/hillary_slams_msnbcpraises_fox_77235.asp", 
   {}, 
   301153, 
   null, 
   1202830500.0
  ], 
  [
   301435, 
   null, 
   "daewoo", 
   "Yes. She completely over reacted. Saying you \"pimped so-and-so out\" is not an uncommong terminology and is not typically considered offensive. I have in teh past loaned out or rented out employees and referred to it as \"pimping them out\". Nobody threw a fit. This is just one of those stupid non issues. \n \n As far as MSNBC, I watch them a lot. IMO they are the closest thing to a centrist network that we have.", 
   {}, 
   301350, 
   null, 
   1202869080.0
  ], 
  [
   301447, 
   null, 
   "CUNxTime", 
   "[I][INDENT][INDENT]\n Am I the only person who thinks people (particularly the Clinton campaign) are over-reacting to this? I agree the comment was pretty untactful and certainly careless, but Chelsea Clinton is not a child anymore. She's a grown woman who is basically campaigning on behalf of the Clinton candidacy, and it just seems to me that they're making a mountain out of a molehill over that. Isn't she a bit old for the whole sheltering-parent thing?\n \n\n \n No you are not the only person who thinks that. In fact, the Clinton campaign is purposefully overreacting to the comment. MSNBC has a decidedly Obamish slant and Sen. Clinton knows the value of crying wolf (vast right wing conspiracy) and she gets the doubly positive outcomes of both being the victim and serving notice that if you are the media, you don't mess with the Clinton Express. It was a very poor choice of words, but Chelsea is a 28 year old woman who campaigns for her mother when she is not working at her hedgefund job.", 
   {}, 
   301124, 
   null, 
   1202877480.0
  ], 
  [
   301454, 
   null, 
   "Taxi Rob", 
   "...Am I the only person who thinks people (particularly the Clinton campaign) are over-reacting to this? I agree the comment was pretty untactful and certainly careless, but Chelsea Clinton is not a child anymore. She's a grown woman who is basically campaigning on behalf of the Clinton candidacy, and it just seems to me that they're making a mountain out of a molehill over that. Isn't she a bit old for the whole [I]sheltering-parent thing[I]?\n\n \n Dude, I can understand Ashford and Simpson, and even Stevie Wonder calling me on the 5th, but Scarlet Johansen? Hey, if her folks don't mind, I don't. Now that's PIMP. No Chelsea, though, I guess they're saving her for the 21 year old Super Delegates.... I don't think she looks as good as Scarlet... What is she doing with her hands? Very suggestive, Chelsea. Anything for a vote? Naughty, naughty...311", 
   {
    "post_info": {
     "attachments": 2, 
     "post_title": "Big pimpin'"
    }
   }, 
   301124, 
   null, 
   1202880720.0
  ], 
  [
   301460, 
   null, 
   "Archangel", 
   "You are absolutely right that MSNBC is left leaning, but not quite on par with CNN. But the reason Hillary is feeling persecuted is because the Liberal Media isn't blindly supporting her with a free ride but is being very positive with Obama. I believe that the fix is in with the powers that be and she doesn't like being pushed aside in favor of the new kid on the block. I don't want, trust or support Obama at all, but wouldn't be a bit surprised if he wakes up dead for getting in the Clintons way. \n \n I personally believe hillary had JFK Jr. killed because he was planning to run for the Senate in NY against her, and I believe that Barak's life is in more danger with every delegate he captures. \n \n \nI guess MSNBC is getting to be the newest 'biased media' target. I'm not that familiar with the network, but I had always heard it leaned more liberal like CNN, so it's kind of strange. Maybe they were trying to come across more the other way to compensate and said some stupid things in doing so.\n \n", 
   {}, 
   301350, 
   null, 
   1202884260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Are people over-reacting over David Shuster?", 
  "url": "http://www.4forums.com/political/politics-debates/10912-people-over-reacting-over-david-shuster.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 10912, 
  "discussion_files": [
   [
    "7519.html", 
    "http://www.4forums.com/political/politics-debates/10912-people-over-reacting-over-david-shuster-print.html"
   ]
  ], 
  "identifier": 10912
 }
]