[
 [
  [
   301699, 
   null, 
   "MrWriteLA", 
   "Curious as to how our resident \"Christian\" apologists feel about this...\n \n http://sportsillustrated.cnn.com/2008/highschool/02/13/female.official.ap/index.html?cnn=yes \nKANSAS CITY, Mo. (AP) -- Kansas activities officials are investigating a religious school's refusal to let a female referee call a boys' high school basketball game.\n \n The Kansas State High School Activities Association said referees reported that Michelle Campbell was preparing to officiate at St. Mary's Academy near Topeka on Feb. 2 when a school official insisted that Campbell could not call the game.\n \n The reason given, according to the referees: Campbell, as a woman, could not be put in a position of authority over boys because of the academy's beliefs.\n \n Campbell then walked off the court along with Darin Putthoff, the referee who was to work the game with her.\n \n \"I said, 'If Michelle has to leave, then I'm leaving with her,\"' Putthoff said Wednesday. \"I was disappointed that it happened to Michelle. I've never heard of anything like that.\"\n \n Fred Shockey, who was getting ready to leave the gym after officiating two junior high games, said he was told there had been an emergency and was asked to stay and officiate two more games.\n \n \"When I found out what the emergency was, I said there was no way I was going to work those games,\" said Shockey, who spent 12 years in the Army and became a ref about three years ago. \"I have been led by some of the finest women this nation has to offer, and there was no way I was going to go along with that.\"\n \n Shockey noted that referees normally don't work Saturday games, but he agreed to officiate because his daughter's basketball game slated for that day was canceled.\n \n The Activities Association said it is considering whether to take action against the private religious school. St. Mary's Academy, about 25 miles northwest of Topeka, is owned and operated by the Society of St. Pius X, which follows older Roman Catholic laws. The society's world leader, the late Archbishop Marcel Lefebvre, was excommunicated by Pope John Paul II in the late 1980s.\n \n Gary Musselman, the association's executive director, said the organization will not make a decision until it confirms whether St. Mary's Academy has a policy of not allowing female referees to work boys basketball games.\n \n If that is indeed the school's written policy, Musselman said, the association could decide to remove St. Mary's Academy from the list of approved schools and take away its ability to compete against the association's more than 300 member schools.\n \n St. Mary's Academy officials declined comment when contacted by The Associated Press on Wednesday.\n \n St. Mary's Academy is among 30 schools on the list that are not full association members but compete against schools that are. Musselman said St. Mary's Academy plays one or two games per season against member schools but has no more scheduled this school year.\n \n He said if removed from the approved list for next school year, St. Mary's Academy still would be able to compete against approved schools that are not members of the association.\n \n Musselman said the association hopes to resolve the matter sometime this week. He said he sent a letter to the school's principal, Vicente A. Griego, the day of the incident but has not heard back from him.\n \n Putthoff and other supporters of Campbell said they believe state activities officials will handle the situation properly.\n \n Campbell did not return phone calls seeking comment Wednesday.\n \n However, she told The Kansas City Star that she was \"dumbfounded\" by the incident but that she is not angry at the school. She said she does not want the situation to go any further than it already has.\n \n \"This issue was going to come up eventually,\" said Campbell, 49, a retired Albuquerque, N.M., police officer who now lives in Ozawkie, Kan. \"I just happened to be the person who was there this time.\n \n \"It's kind of a sticky situation. It needs to be looked at carefully, slowly, with all the facts.\"\n \n Putthoff said he has called games at St. Mary's Academy off and on for 10 or 12 years, but doubts he will officiate at the school again.\n \n \"Out of defense to Michelle, I'm probably going to decline to go back there,\" he said. \"We have to support our fellow officials.\"\n \n Campbell, one of about five female referees in the Topeka Officials Association, has been officiating games for about two years.\n \n \"We don't support any institutions that would discriminate against any of our officials,\" said Steve Bradley, president of the Topeka group. \"We support Michelle 100 percent.\n \n \"Michelle works hard. She cares about what she does. She is not a person who's on a crusade. She's a good person. She's a good official. You will not find a person who's more serious about doing a good job than Michelle.\"\n \n Musselman said this was his first time dealing with a situation in which a school turned away a referee because of gender.\n \n \"We view officials not as male or female, Hispanic or African-American or Asian-American. We view officials as officials,\" Musselman said. \"Discrimination against our officials is something we can't be party to.\"\n \n Still, he said, the association wants to be fair to everyone involved and gather all the information before taking action.\n", 
   {
    "post_info": {
     "post_title": "Religious high school refuses female ref for boys' basketball"
    }
   }, 
   null, 
   null, 
   1203012300.0
  ], 
  [
   301701, 
   null, 
   "Zardoz", 
   "A ref would really not be in a position of 'authority' over such players.\n A coach would.\n A principal or teacher would.\n A local leader or even president.\n \n \n The school (if it follows such strict beleifs) should remove itself from America and go to some place where they're accepted.\n \n I hear Jonestown was left to rot.\n Last I heard, there used to be a religous commune there lead by a strict male leader.\n They served 'tasty beveriges' too.", 
   {}, 
   301699, 
   null, 
   1203013080.0
  ], 
  [
   301805, 
   null, 
   "obvious_child", 
   "I thought those days were over. After the trouncing that companies who refused to offer benefits to gay coupled got by companies who did and thus hired up all of the talent for cheap, you'd figure that such strict ideas would have fallen by the wayside. \n \n But I guess I should never underestimate the capacity for strict religious organizations to reject talent and dim their own futures.", 
   {}, 
   301701, 
   null, 
   1203056940.0
  ], 
  [
   301824, 
   null, 
   "HonestAbe", 
   "I wonder if Michele was a lesbian and that's why they rejected her.", 
   {}, 
   301805, 
   null, 
   1203081480.0
  ], 
  [
   301866, 
   null, 
   "jitobear", 
   "I thought those days were over. After the trouncing that companies who refused to offer benefits to gay coupled got by companies who did and thus hired up all of the talent for cheap, you'd figure that such strict ideas would have fallen by the wayside. \n \n But I guess I should never underestimate the capacity for strict religious organizations to reject talent and dim their own futures.\n\n \n Yes. The ultimite disservice every bigot does themselves.", 
   {}, 
   301805, 
   null, 
   1203100140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Religious high school refuses female ref for boys' basketball", 
  "url": "http://www.4forums.com/political/religion-debates/10929-religious-high-school-refuses-female-ref-boys-basketball.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 10929, 
  "discussion_files": [
   [
    "31496.html", 
    "http://www.4forums.com/political/religion-debates/10929-religious-high-school-refuses-female-ref-boys-basketball-print.html"
   ]
  ], 
  "identifier": 10929
 }
]