[
 [
  [
   302049, 
   null, 
   "CUNxTime", 
   "There's been much talk of late that a win by Democrats in Nov. will lead to a revival of The Fairness Doctrine. \n Is this likely? \n Is the Fairness Doctrine a violation of the 1st amendment? \n Would a revived Fairness Doctrine be an attempt to silence the right? \n Is the Fairness Doctrine 'Fair'? \n Is silencing free discourse ever acceptable or necessary?\n If revived, would that be an admission that the Left can't compete in the arena of ideas? If no, what does it signify and why (if you agree with it) is it correct or important (or even legal).\n \n Or has the rapid growth of 'satellite' radio made that format (unregulated and not under the jurisdiction of the FCC) the logical future home of talk radio thus rendering the Fairness Doctrine irrelevant?\n \n For those who don't know what the Fairness Doctrine is (was) according to Wikipedia....\n The Fairness Doctrine was a United States FCC regulation requiring broadcast licensees to present controversial issues of public importance in a manner deemed by the FCC to be honest, equitable, and balanced. The doctrine has since been withdrawn by the FCC, and certain aspects of the doctrine have been questioned by courts.[1]\n http://en.wikipedia.org/wiki/Fairness_Doctrine\n \n It was ruled unconstitutional in 1984 when\n \n \"The Supreme Court decided that the scarcity rationale underlying the doctrine did not apply to expanding communications technologies, and that the doctrine was limiting the breadth of public debate (FCC v. League of Women Voters, 468 U.S. 364)[9]. The Court's majority decision by William J. Brennan, Jr. noted concerns that the Fairness Doctrine was \"chilling speech,\" and added that the Supreme Court would be \"forced\" to revisit the constitutionality of the doctrine if it did have \"the net effect of reducing, rather than enhancing speech.\"\n http://en.wikipedia.org/wiki/Fairness_Doctrine\n \n http://www.museum.tv/archives/etv/F/htmlF/fairnessdoct/fairnessdoct.htm", 
   {
    "post_info": {
     "post_title": "The Fairness Doctrine: Possible?  Fair? Irrelevant?"
    }
   }, 
   null, 
   null, 
   1203208380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Fairness Doctrine: Possible?  Fair? Irrelevant?", 
  "url": "http://www.4forums.com/political/politics-debates/10942-fairness-doctrine-possible-fair-irrelevant.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 10942, 
  "discussion_files": [
   [
    "2192.html", 
    "http://www.4forums.com/political/politics-debates/10942-fairness-doctrine-possible-fair-irrelevant-print.html"
   ]
  ], 
  "identifier": 10942
 }
]