[
 [
  [
   18666, 
   null, 
   "Rev. HellH0und", 
   "\"To accomplish the goal of ridding our streets of assault weapons, the new law must ban all--not just some--semiautomatic assault rifles, pistols, and shotguns. Strong, effective legislation that will force the gun industry to finally cease the production and marketing of assault weapons--the \"Assault Weapons Ban and Law Enforcement Protection Act of 2003\"--has been introduced in the U.S. House and Senate. More than 100 members of the U.S. House of Representatives have already signed on in support of the House bill (H.R. 2038), which is sponsored by Rep. Carolyn McCarthy of New York. Support is steadily building for the Senate bill (S. 1431) [not really], sponsored by Sen. Frank[enstien] Lautenberg of New Jersey.\"\n \n \n Yeah these humps are all about \"reasonable gun control\".\n \n Note to the uninformed. \"semiautomatic pistols\" covers ALL pistols except revolvers. \n \n \n These civil rights violators can have em sure.... Bullets first!\n \n \n HEY VPC....MOLON LABE!", 
   {
    "post_info": {
     "post_title": "Civil Rights Violators in their own words!"
    }
   }, 
   null, 
   null, 
   1065623820.0
  ], 
  [
   18669, 
   null, 
   "AMD4EVER", 
   "You are going to be able to find fanatical supporters of gun control just as you are able to find fanatical supporters of gun rights. Both extreme ends of this debate will make their respective side look rediculous. So don't think that just because you can find one extreme opinion that it means the rest who support gun control is that extreme.", 
   {}, 
   18666, 
   null, 
   1065627960.0
  ], 
  [
   18670, 
   null, 
   "Rev. HellH0und", 
   "You are going to be able to find fanatical supporters of gun control just as you are able to find fanatical supporters of gun rights. Both extreme ends of this debate will make their respective side look rediculous. So don't think that just because you can find one extreme opinion that it means the rest who support gun control is that extreme.\n\n \n \n ONE EXTREME EXAMPLE!?!?!? This is the VPC they claim to be for \"moderate gun control laws\" They used to be HCI. This is one of the largest anti-civil rights groups operating in the US", 
   {}, 
   18669, 
   null, 
   1065628140.0
  ], 
  [
   18672, 
   null, 
   "AMD4EVER", 
   "ONE EXTREME EXAMPLE!?!?!? This is the VPC they claim to be for \"moderate gun control laws\" They used to be HCI. This is one of the largest anti-civil rights groups operating in the US\n\n \n Oh? And what do you consider yourself when it comes to gun rights? Are you moderate or fanatical? Would you actually declare yourself a fanatic or would you like to be known as a moderate?\n \n I don't think any organization who wants to be taken seriously will declare themselves fanatical about their cause because that would take away from their credibility.", 
   {}, 
   18670, 
   null, 
   1065628680.0
  ], 
  [
   18675, 
   null, 
   "DHard3006", 
   "You are going to be able to find fanatical supporters of gun control just as you are able to find fanatical supporters of gun rights. Both extreme ends of this debate will make their respective side look rediculous. So don't think that just because you can find one extreme opinion that it means the rest who support gun control is that extreme.\n\n \n Gun haters always use this line \"extreme ends of this debate \"! The only extremist are the gun haters that want to ban the right to bear arms.\n \n Case in point, the racist used this line when Black Americans were fighting for their civil rights. The racist would claim the extremist Blacks from up north are coming down here instigating our blacks to fight for their civil rights. The chief of the FBI even claimed MLK was a communist to try to label him a extremist! This is what hate does to people that want to take rights away from other people!\n \n Whenever a person defends their rights they will be labeled an extremist be the hate group attacking that right! Gun haters are no different then any other hate group!\n \n Here is what gun haters will do. Gun haters always demand that people defending the right to bear arms should compromise. Ok, gun haters want to ban the right to bear arms and are willing to compromise on not banning it. So the gun haters claiming to be people defending the right to bear arms get the other people defending the right to bear arms to agree to some limits. One must remember gun haters are not giving up anything. Gun haters are not compromising on their goal to ban the right to bear arms!This just a little common sense limit on the right to bear arms the gun haters claim.\n \n A year or two later the gun haters are back demanding yet another common sense limit on the right to bear arms. And of course what do the gun haters claim, they are willing to compromise with the extremist defending the right to bear arms. Once again they get some people claiming to be people defending the right to bear arms to say we must compromise. Then another so called common sense limit is placed on the right to bear arms.\n \n This cycle will take place until the gun haters ban the right to bear arms with common sense limits!\n \n Not once will the gun haters want a common sense law dealing with keeping dangerous criminals off of the streets of America to make it safe. \n \n All of the gun control laws the gun haters want will only be obeyed by the law abiding citizens!\n \n Gun haters are the extremist hate group demanding to ban the right to bear arms!", 
   {
    "unicode_changes_made": true
   }, 
   18669, 
   null, 
   1065630840.0
  ], 
  [
   18683, 
   null, 
   "sundowner", 
   "Oh? And what do you consider yourself when it comes to gun rights? Are you moderate or fanatical? Would you actually declare yourself a fanatic or would you like to be known as a moderate?\n \n I don't think any organization who wants to be taken seriously will declare themselves fanatical about their cause because that would take away from their credibility.\n\n \n Seems like DHARD just proved your point for you. \n There has to be extremists at both ends of an argument, otherwise the argument is only one sided, and therefore there is no argument. If everyone who did not agree with DHARD was a \"gun hater\" and wanted to ban the right to bear arms, you would already either have handed them in or run for the hills. The truth is that there are moderates, people who see a little bit of both sides of the debate. These of coarse are seen as extremists by the people on both ends, because the only person who is not seen as an extremist is someone who shares your extremist views. These moderates are many of the law abinding citizens you speak of, many of us own guns. Many of us would not give our guns up. But many of us realize that if we want to keep those guns, we need to have some laws to govern them. There are some places we should not carry them. There are a few types of weapons that the general public does not need (although banning \"assault weapons\" and semi-automatic guns is just stupid, and not what most of us would call a common sense measure).", 
   {}, 
   18672, 
   null, 
   1065636660.0
  ], 
  [
   18689, 
   null, 
   "DHard3006", 
   "Seems like DHARD just proved your point for you. \n There has to be extremists at both ends of an argument, otherwise the argument is only one sided, and therefore there is no argument. If everyone who did not agree with DHARD was a \"gun hater\" and wanted to ban the right to bear arms, you would already either have handed them in or run for the hills. The truth is that there are moderates, people who see a little bit of both sides of the debate. These of coarse are seen as extremists by the people on both ends, because the only person who is not seen as an extremist is someone who shares your extremist views. These moderates are many of the law abinding citizens you speak of, many of us own guns. Many of us would not give our guns up. But many of us realize that if we want to keep those guns, we need to have some laws to govern them. There are some places we should not carry them. There are a few types of weapons that the general public does not need (although banning \"assault weapons\" and semi-automatic guns is just stupid, and not what most of us would call a common sense measure).\n\n \n This is where gun hater pilot is wrong. Gun haters are people like gun hater pilot that want gun control laws that infringe on the right to bear arms. \n \n Hey here is the definition of infringement \n 1. 1 : the act of infringing \n 2 : an encroachment or trespass on a right or privilege \n So tell us gun hater pilot how you are pro right to bear arms if you want \n limits on that right? \n \n Now with gun hater pilot this has to deal with the subject of denying a person the right to bear arms to defend themself. Gun hater pilot logic is for companies and governments to deny a person the right to bears arms to defend ones self then not be held responsible when these companies and governments fail to protect the unarmed citizens! For this gun hater pilots uses insults to respond!\n \n Gun hater pilot's logic is to disarm law abiding people then not be held responsible for their safety! Is this the type of logic that should be demanding common sense limits on a right? No!\n \n Once again we hear the moderate bs. Now to get this moderate bs what must first happen? Well the people defending the right to bear arms must compromise the right to bear arms to the gun haters by allowing what gun haters call common sense limits on a right. \n \n One must notice that every time a gun hater uses the moderate bs it is always at the cost of a right. The racist tried this with Black Americans during the fight for their civil rights. Hate groups will do anything to take rights away from people! Even call themselves a gun owner!\n \n Gun hater pilot would have called the founding fathers extremist for demanding freedom from England!\n \n Gun hater pilot would have called Black Americans extremist for demanding their civil rights!\n \n Gun hater pilot would have called Women extremist for demanding their civil rights!\n \n Gun hater pilot would have called Homosexuals extremist for demanding their civil rights!\n \n Gun hater pilot will call anybody an extremist for defending their rights! Typical hate group tactics!\n \n The only people that are extremist are the gun haters, a hate group that has only one goal and that is to take a right away from the American people!", 
   {
    "unicode_changes_made": true
   }, 
   18683, 
   null, 
   1065641520.0
  ], 
  [
   18755, 
   null, 
   "voiceofreason", 
   "ONE EXTREME EXAMPLE!?!?!? This is the VPC they claim to be for \"moderate gun control laws\" They used to be HCI. This is one of the largest anti-civil rights groups operating in the US\n\n The VPC did not used to be HCI. The Brady Campaign to Prevent Gun Violence used to be HCI. It's true that the VPC is somewhat extremist, but the Brady Campaign to Prevent Gun Violence is much more moderate on the issue.", 
   {}, 
   18670, 
   null, 
   1065683820.0
  ], 
  [
   18765, 
   null, 
   "Rev. HellH0und", 
   "The VPC did not used to be HCI. The Brady Campaign to Prevent Gun Violence used to be HCI. It's true that the VPC is somewhat extremist, but the Brady Campaign to Prevent Gun Violence is much more moderate on the issue.\n\n \n \n Oh they are? Thats strange... I could not find where exactly they stand on any of thier numerous websites, just more restrictions... And the old HCI was not \"moderate\"", 
   {}, 
   18755, 
   null, 
   1065709740.0
  ], 
  [
   18848, 
   null, 
   "kelvin90701", 
   "The VPC did not used to be HCI. The Brady Campaign to Prevent Gun Violence used to be HCI. It's true that the VPC is somewhat extremist, but the Brady Campaign to Prevent Gun Violence is much more moderate on the issue.\n\n \n Can you please tell me who owns, runs, and belongs to the VPC? Check the website: http://www.vpc.org/\n \n They claim to be expert, professionals, and think tankers. Check the website, there are NO NAMES, NO CONTACTS, and NO MEMBERSHIP.\n \n Who is it? How can you trust a source if you do not know WHO, WHOM, or WHAT it is?", 
   {}, 
   18755, 
   null, 
   1065760200.0
  ], 
  [
   18849, 
   null, 
   "kelvin90701", 
   "Seems like DHARD just proved your point for you. \n There has to be extremists at both ends of an argument, otherwise the argument is only one sided, and therefore there is no argument. If everyone who did not agree with DHARD was a \"gun hater\" and wanted to ban the right to bear arms, you would already either have handed them in or run for the hills. The truth is that there are moderates, people who see a little bit of both sides of the debate. These of coarse are seen as extremists by the people on both ends, because the only person who is not seen as an extremist is someone who shares your extremist views. These moderates are many of the law abinding citizens you speak of, many of us own guns. Many of us would not give our guns up. But many of us realize that if we want to keep those guns, we need to have some laws to govern them. There are some places we should not carry them. There are a few types of weapons that the general public does not need (although banning \"assault weapons\" and semi-automatic guns is just stupid, and not what most of us would call a common sense measure).\n\n \n One problem. You assume gun control will always be \"common sense\". Once you loose the rights, they are never comming back. Do you believe that the UK, the Aussies, and Canadians will every reverse the policy? Even if it found to ever be faulty, even if only parts of are faulty, will parts of it that are faulty ever be repealled?\n \n Once it is gone, it is gone for ever.", 
   {}, 
   18683, 
   null, 
   1065760440.0
  ], 
  [
   18913, 
   null, 
   "sundowner", 
   "One problem. You assume gun control will always be \"common sense\". Once you loose the rights, they are never comming back. Do you believe that the UK, the Aussies, and Canadians will every reverse the policy? Even if it found to ever be faulty, even if only parts of are faulty, will parts of it that are faulty ever be repealled?\n \n Once it is gone, it is gone for ever.\n\n \n I don't see why parts of the law could not be repealed or replaced with better if they were found to be faulty. Although, this would probably be a difficult process, and you are right, it is not assured. I don't propose for banning of arms. Yes, you know I have supported ENFORCED gun free zones like airports and schools. These to me are the common sense laws I seek. Airports are already doing it, and some schools do. I support ALL schools doing it. I also support criminal and mental health background checks. Aside from the established laws these are the only other gun control measures I support. I even support the removal of some of the laws currently in place, as many of them are worthless laws that do nothing to prevent gun related violence or crimes. Aside from these things, I will fight to the death to keep my guns. But I still argue that any right needs laws to govern it, no man made  right is absolute. Total repeal of the laws would cause far more harm than good. So would banning guns.", 
   {}, 
   18849, 
   null, 
   1065808860.0
  ], 
  [
   18920, 
   null, 
   "DHard3006", 
   "When I defended the right of a company such as an airline or government to ban a person from carrying a gun in some places a gun haters did nothing but insult me for this! The gun hater did this because I simply stated when a company or government does ban a person right to bear arms, that company or government is responsible for the safety of the unarmed citizens! Plus the gun hater said it had a problem with law abiding citizens carrying guns. \n \n \n \nI But I still argue that any right needs laws to govern it, no man made  right is absolute. Total repeal of the laws would cause far more harm than good. So would banning guns.\n\n \n You will notice the gun hater is always demanding laws that only affect the law abiding citizen. Not once willt the gun hater demand laws that punish criminals for using guns!\n \n Remember the gun hater lie of wanting to keep guns away from dangerous criminals. Upon arrest the guns are taken away from dangerous criminals. So why do gun haters scream for laws to do this?", 
   {}, 
   18913, 
   null, 
   1065810060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Civil Rights Violators in their own words!", 
  "url": "http://www.4forums.com/political/gun-control-debates/1094-civil-rights-violators-their-own-words.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1094, 
  "discussion_files": [
   [
    "9097.html", 
    "http://www.4forums.com/political/gun-control-debates/1094-civil-rights-violators-their-own-words-print.html"
   ]
  ], 
  "identifier": 1094
 }
]