[
 [
  [
   302104, 
   null, 
   "CUNxTime", 
   "What do you think?\n \n Any comments will be appreciated. I've written the book to particularly speak to the young adult demographic and to teens (which is why there's little cussing and less blood). However, it should appeal to many people who went through high school and like adventure fiction...", 
   {
    "post_info": {
     "post_title": "The first couple chapters of my first novel..."
    }
   }, 
   null, 
   null, 
   1203224040.0
  ], 
  [
   302105, 
   null, 
   "CUNxTime", 
   "\n\n \n \n Chapter 1\n December 14th 10am Fairbanks, Alaska\n The dark blue government van with the tinted windows pulled into the covered underground parking lot at 101 Lacey Street in Fairbanks Alaska. If the oppressive weight of the building above was taking its toll on the occupants of the van, you couldn't tell by their demeanor. This fact was not lost on both the driver and the other guard, Derek 'Deke' Brooks, riding shotgun in the front seat. The status quo for the pair was to derive immense enjoyment by restlessly tormenting the prisoners in their custody. The two men in the back of the van were shackled together with half inch thick links of solid steel. The chains that bound them together were further secured through steel rings bolted to the undercarriage. Both men appeared more calm and composed than your average commuter taking the bus to work.\n Jackson Crowley, aka Jack Crow, seated on the passenger side, looked like the hardened criminal that he was. A jagged reddish, almost purple, scar ran down from the crown of his forehead diagonally across his face. His left eye, which interrupted and bisected the fleshy scar, was a milky dirty white orb that was reminiscent of the eyes on a long dead fish. Prison tattoos covered his neck, forearms, and even his knuckles. Instead of \"Love\" and \"Hate\" inked on his knuckles as in the old cliché, both his right and left fists screamed \"KILL\". \"Born to\" was stenciled vertically down the back of each of his hands. His greasy hair hung down over his shoulders even though he had been given the opportunity to have it cut at the holding facility before his trial. He had declined in an extremely uncivilized manner. He hadn't even bothered to shave with the 1/8 inch safety razor they had allowed into his cell earlier in the morning. \n The driver, Bob White had tried to terrorize Jack on the ride over. \"You wait boy, till they get you up in the Bank,\" he sneered, referring to the Fairbanks 'SuperMax' Correctional Facility. \"They're going to take a liking to a cute thing like you.\" Jack leaned forward and spit directly into the driver's ear. This was not Jack's first van ride to court to receive his verdict in a criminal case.\n The other occupant of the van was, at least in appearance, the complete opposite of Jack. James Parker had a medium build and a clean cut façade. His tawny hair was perfectly in place and he was wearing a well cut suit as opposed to the bright orange jumpsuit of his riding companion. That was where his normalcy ended. In fact, neither guard had even attempted to carry on their tradition of intimidation with this particular detainee.\n While James Parker may have appeared ordinary, he was actually anything but. Going back 15 years or more, he had a record within both the penal system and the mental health system of several states. It began with complaints from his neighbors in a suburb of Seattle, Washington. They began to suspect James of being responsible for a rash of dog and cat disappearances. Luckily for the neighbors, it was never discovered exactly what happened to their precious companions. Still, James' long relationship with the system had begun. \n After a brief stint in Juvenile Detention, Parker left the area and began his rapid downward spiral into serial criminality. Before long, he was traveling the country in a practically uncontrolled frenzy of depravity. Less than two years ago, he wandered into Alaska. He was drawn by the same ideals that brought many to the frozen north. \n Alaska was still in many ways a wild frontier. Freedom was a reality there. The people that were drawn there were cut from a different cloth. They were attracted to the wide open spaces, fresh air, and breathing room. They came to get away from the rat races. The people of Alaska came to escape being stacked on top of each other in little boxes called apartments or 'condo,' if you could afford to buy your own little box. \n Parker journeyed to Alaska to use the beauty and openness of the frontier to his advantage. He would corrupt the very dream that brought people here. He came to turn legroom into isolation. He would turn other folks' liberty into his freedom from the law. \n Well, his carefully laid plans were interrupted by a routine traffic stop that revealed some interesting human cargo in the trunk. Now after his arrest and subsequent trial it seemed that his dreams of carnage and murder would have to be postponed rather indefinitely. He knew it would be impossible for a jury to acquit; the police had an air tight case against them. Nevertheless, Parker was relaxed and smirking as they pulled him from the van and into the holding cell below the court-room to await judgment by a jury of his 'peers'. \n Chapter 2\n December 14th 3:58pm Front Royal, Virginia\n The cold breeze rustled the bronze and golden grounded leaves bringing with it the sharp smell of pine smoke and winter. Ian had been waiting for this trip for the whole school year. He thought he would explode long before winter break would arrive. However, just as the internal pressures created by his adolescent excitement threatened to overwhelm him completely, winter arrived as a long frosty sigh blown down from the northern reaches of Canada's artic circle. As the inaugural flakes slowly drifted to the frost hardened ground, a smile spread over his wind reddened cheeks revealing strait white teeth. \n \"Less than one week,\" he thought to himself as he hurried home from school. \n His father was taking him to the REI store tonight to get some last minute gear. He began his mental checklist for what must have been the 10th time that day. Ian had nearly twice the equipment that had been required by the sponsors of the trip into the boondocks of Alaska. In fact, he had bought nearly everything he needed early in Fall when he and his wilderness ecosystems biology class had teamed up with the ski club to lobby for and organize a two week winter trip to the Alaskan backcountry. Now it was just around the corner, they were departing on December 20th, but each minute felt as if it was dragging by like an hour. \n He raced the last few blocks home, his overstuffed backpack swaying back and forth like a pendulum. His mother told him time and time again to use his locker. \"You'll ruin your back,\" she would chide. However, being fifteen he was certain of his invincibility and that perfect health was sure to last forever. \n He veritably flew past the last two split-level homes on the ever so typically American cul-de-sac. He did not notice the new for sale sign in front of his neighbor's house. Of course, at the age of 15 there is plenty that you fail to grasp. Conversely, Ian would say that youth's lack of wisdom is offset, handily, by all that one forgets as time inevitably marches on. \n He yanked the door open and flew past his younger sister, Libby. Slowing only to shrug off the backpack, he stomped up the stairs without acknowledging her presence. \"Hello, Ian. How was school?\" She tried to ask as he whisked by her at warp speed. \"Mom said don't leave your stuff on the floor,\" she shouted behind him as he tramped up the steps. Manners may be the greatest casualty of youth, but what teenage boy has time for his 9-year-old sister?\n Up and into his room, he slammed the door and fired up his computer. After checking his emails, he typed up a short text to his best friend Mark Smith asking him if he wanted to come to REI with him. Before Ian can hit the send key, he began to second-guess inviting Mark on the shopping jaunt. Mark's asthma, coupled with an over protective mother caused him to miss out on many of the things Ian, and almost every other young man, enjoy. Ian tried to be considerate of Mark's dilemma. He usually managed not to twist the proverbial knife, but it was difficult when something of this magnitude came along. Ian knew that this trip was a life-shaping event and to his friend's credit, Mark tried to share his excitement. He clicked cancel without sending and put his computer back on stand-by. \n Ian's room was a carbon copy of countless teens across the country. Posters of some of the latest bands were next to others of cars and cover girls filled most of the wall space. One feature that differentiated his sanctuary from that of many other boys his age was the sheer number of books scattered about the desk and floor and even stacked neatly on shelves. There were tons of science fiction paperbacks mixed in with thick college science texts. Physics and chemistry sat beside dragons and wizards a true allegory of Ian's varied and often contradictory interests. \n \"This is going to rock,\" he thought to himself. Not only was this the first time he was going to be away from his family for an extended time, this trip would also be coed. Girls. One particular girl in fact, Monica Treadway. Ian had been completely and utterly enthralled with the toned, shapely, blonde goddess since they returned to school after summer vacation in 9th grade, last school year. \n He often thought back to when Monica had been a skinny and lanky bean pole with a freckled face and glasses. What a difference a summer makes! Monica had returned to school completely changed and Ian wasn't the only one to notice. Suddenly, the junior and even some senior guys were paying attention to her and who could blame them. Always tall, she had filled out her frame in all the right places. Now she was a curvy leggy beauty who seemed to glide down the halls at school, making concentration exceptionally difficult for a significant portion of the male population of Ronald Reagan High.\n Ian thought back to all the times he had done stupid boy things to her. Stupid, Stupid, Stupid!!! He cursed himself. Why had he chased her with the spider on the playground in 6th grade? Why did he put the earthworm in her hair back in 5th grade? Well it was probably too late now anyway. While he had refrained from torturing her with insects lately, how could he hope to compete with guys on the football team who had their own cars? He'd made up his mind though, on this trip he would make his move, whatever it took!\n This fantasy had played through his mind countless times. Monica laying there shivering in her frosty sleeping bag and he'd just happen to be there with an extra blanket and a thermos of hot coco. The fire would be glowing softly and the wind would be howling outside the cabin. Flights of fancy would enrapture his imagination with infinite variations on this theme for hours, until Ian was certain that he would go crazy.\n Ian could not get Monica out of his mind. There was something about her, something in the way she looked, her expression, the way she carried herself, a sad, shy vulnerability that made Ian want to protect her, to take her in his arms and shelter her from the world. There was something about her that made him want to take responsibility for her, to provide her anything she could possibly need. Sometimes he felt that the most important accomplishment in his life would be to make, and keep, her happy for all time.\n \"Are you sleeping up there?\" his father, Ian Sr., yelled from the bottom of the stairs. Ian's head snapped up from his daydream. He'd done it again. \n \"Coming Dad,\" he shouted back as he gathered the list of 'necessities' off his desk. Ian ran down the stairs and out the front to where his father was waiting with the car running. As he slammed the door behind him, he didn't quite hear his mother's voice drifting out in his wake, \"don't leave your books down here....\"\n \n ............................................................................................................\n Chapter 3\n Elsewhere in Front Royal, Virginia\n Jane Hopkins was an academic all-American with a perfect 4.0 grade point average. She was also on the student council, a member of the debate team, and involved in many other clubs and activities. She had finished her preparations for the excursion weeks ago. She had purchased every single piece of equipment on the list of recommended items sent home by Nancy Stone, her biology teacher and the faculty sponsor of the outing to Alaska's frozen wilderness. \n Jane couldn't believe she was being allowed to go. Her parents drove her relentlessly to excel academically and veritably forced her into multitudes of extracurricular activities. However, for all of Jane's efforts they allowed her very little freedom of her own. She sometimes felt tethered to her overbearing parents. Shy to begin with, she found it impossible to even contemplate having a boyfriend while under her parents' collective thumb. She wasn't even allowed to spend the night at her best friend's house for fear that 'something terrible' might happen. Jane hated the fact that she was being punished for her mother and father's fear, no abject terror, of modern society. Well this would be different, she promised herself. Her little white lie about the extra credit in biology had ensured her folk's grudging cooperation on this one opportunity she had to escape their iron grip.\n She danced around in circles with her stuffed dog FeFe, which she'd had since turning two years old. Humming to herself, she daydreamed about her long time crush, Ian Thomas. She pictured him, with his cute crooked grin, standing there in the snow. May be he'd come to her cabin with an extra blanket and some hot chocolate and offer to help keep her warm on a blustery evening on the frigid tundra.\n \"Are you finished your homework,\" Pauline Hopkins screeched from the bottom of the stairs. \"You know you have piano practice at 6:30 tonight!\"\n \"Yeah, Yeah, Yeah, it's always something,\" she shouted back. \n \"What, what, what?!?\" her mother yelled back.\n \"I said, Yeah, I'm coming!\" Jane roared down to her mother. Jane grabbed her coat off of her perfectly made bed, careful not to disturb her precisely placed stuffed animals. She placed FeFe in his spot in the middle and brushed some imaginary lint off of the cute pink fringed pillow cases. She took a last look around her room, making sure everything was in place. All of her academic awards and certificates were hanging straight. Her spelling bee trophies were arranged chronologically starting in pre-kindergarten. Her completed homework was stacked on her desk next to the three textbooks from the classes in which she had homework. Yes, everything was perfect, as it should be, so she turned off the light and closed the door behind her as she left.\n \"How many chaperones will be on this trip anyway?\" Asked her mother for about the hundredth time, as they drove over to Mrs. Hanson's house for Jane's piano tutoring.\n \"Mom, I've told you it's an extended onsite lab,\" she retorted\n \"Well nonetheless,\" said her mother, \"how many?\"\n \"Besides our two biology teachers, one parent and two professional guides will all be helping take care of everything. There will also be another group of students there and I'm sure they are going to have ADULT SUPERVISION as well, Mother.\" Jane always called her 'Mother,' never mom or mommy and usually with more annoyance than respect.\n \"You don't understand how the world is out there Jane! Your father and I only want to protect you.\"\n \"I know, but don't worry, this trip is all planned out by the professionals, and it will give me an edge getting into Perdue when I graduate. There's only a couple years left before graduation.\"\n \"That is true, if you don't start setting yourself apart now, you'll end up at some state college. Then what kind of future will you have probably living on the street or in section 8 housing.....\"\n ...........................................................................................................\n Chapter 4\n December 15th 8:12am Ronald Reagan High School\n \n Every Monday thorough Friday, at exactly ten minutes past eight in the morning, just as they were unlocked, Chuck Hatter would walk as fast as he could through the front doors of Ronald Regan High School. While his goal was always the same, he was rarely successful. Today would be no different.\n As Chuck rounded the corner of the hallway that lead to his locker, he saw the small group of boys standing near by. Chuck began to slowdown immediately while simultaneously dropping his gaze to the floor.\n \"Why me,\" he thought. \"Why won't they find someone else to pick on?\"\n \"Hey there he is,\" shouted the tallest of those gathered around the lockers. \n Larry Pike had always been big for his age and had excelled in nearly every athletic endeavor he'd ever attempted. Now, at 6'1\" and 215 lbs he was not only captain of the football and basketball teams, he was already being scouted by top colleges. Although he was kept busy with sports and friends and trying to keep his grades high enough to remain eligible to play, Larry ALWAYS made time to torment those he saw as weak and unpopular. Chuck was, by far, his favorite target.\n \"Wow, Upchuck, your looking particularly piggish today. Has you father been slopping you with the hogs again?\" Several of the boys chuckled at this reference to both Chuck's weight and his father's occupation as a hog farmer and veterinarian. \n \"Dang, boys, what is that smell,\" Larry, now the carnival barker, turned the volume up another notch, so as to attract a larger audience to the carnage. \"I swear, they're talking about making a dress code at this school. What about a hygiene code?\"\n \"Aw, come on Larry, I took a shower today,\" Chuck's voice barely a hoarse whisper.\n \"What's that Upchuck Fatter? Are you mumbling something over there? I swear to God your face is so fat that I think you've swallowed your own freaking mouth, Fat stuff,\" Larry, now beginning to guffaw loudly, his face turning scarlet red, knows he's got a quite an audience forming.\n Chuck was still intently gazing at the carpet as if the answers to all life's questions were written in the no-pile fibers of the floor beneath him. More likely, he was hoping to make himself small, small enough to craw into the rug, smaller than an atom. He thought often about being tiny. He often thought that he'd give anything to not be 6'2\" and 310 lbs. He sometimes thought he wanted to die.\n Chuck's cheeks were now burning with a searing intensity nearing that of a supernova. His face took on the splotchy, rosy red reverse camouflage coloring to which obese people are prone. \"Please, please, please,\" he kept repeating, a mantra in his head. He didn't know what he was asking for. Was it that the punishment and torment stop? Was he asking not to cry, right there in the hallway, in front of his classmates? \n As the sweat began to stream in glistening snail-trails down his burning cheeks, Chuck knew, with certainty that he was going to cry. He could feel his tear ducts filling with his salty shame. His vision was commencing to blur. The carpet began to refract into prisms of brown and green stripes shimmering and dancing in Chuck's eyes. \n \"Shouldn't you be studying, Pike?\" A factiously pleasant, forcefully impertinent voice drifted from the crowd. \"Your mother called Gramms, just yesterday, to ask if I could help you with English and Biology so that you'd be able to play basketball this year!\"\n Mandy O'Brian was not a shy girl. In fact, Mandy O'Brian was one tough son of a gun. She'd always been somewhat of a Tomboy. Yet, Tomboy or not, she was still quite attractive. Tall, at 5'11\", Mandy had short blondish hair cut in a sort of updated 1920's flapper style, and style was Mandy's middle name.\n In the cauldron of conformity that is American high school society, Mandy marched to the beat of a different drum. Heck, she marched to the beat of a different trombone. Mandy never did ANYTHING simply because it was expected of her. Conversely, Mandy refused to refrain from activities that were considered inappropriate for her race, gender, or any other cultural attribute. She, as they would have said in an earlier generation, did her own thing. Whereas nearly everyone else in the school knelt and groveled at Larry's size 13 feet, Mandy was only too happy to confront him about his unconscionable behavior. \n Larry, knowing that there was nothing to gain by loosing a battle of wits with the granddaughter of one of his mother's church friends, figured he had put on enough of a show for those he considered his 'followers.' \"Look guys. I think Upchuck Fatter is about to cry! We better get outta here before his Amazon lover here decides to beat us all down.\" He and his gang of scavengers turn and walk, laughing, back down the hall. As they leave, they stop at a few of the lockers where advanced level students are gathering their books for the morning classes. In a fit of pique they slam the doors of the lockers, which automatically lock upon closing. It was just another small, irksome show of power and a reminder of the natural pecking order of high school civilization.\n The crystalline fireworks display that covered Chuck's field of vision began to pull back, like the drawing of a curtain allowing the carpet fibers to fuse back, first into individual strands then into a mat of brown and green beneath his feet. He was breathing hard but, thanks to Mandy, he hadn't lost the battle with his tears. \n \"Why do you put up with that jerk?\" Mandy asked. \"You shouldn't let him walk all over you like that. You need to stand up to him.\"\n \"Just leave alone! I can take care of myself,\" Chuck huffed in a breathy wheeze as he brushed by Mandy and her best friend/shadow Julie and walked over to his locker. He just stood there unmoving; hand on the combination dial, staring through the door into nothingness.\n \"Can you believe that,\" Mandy's friend Julie 'Jules' Winslow whispered. \"If he can't stand up for himself, he could at least be thankful for your help, God.\"\n \"Leave it be, Jules. It's not his fault. He's shy,\" Mandy said quietly. It was completely uncharacteristic for her to make excuses for anyone. \"Let's go to homeroom, come on.\"\n \"OHMYGOD, you have a crush on Upchuck!\" Heads turned toward the pair as Jules luckily managed to clamp down on the volume for the last word of her exclamation.\n \"Shut up! And don't call him that. I just think he's sweet and that there is a lot more than meets the eye with Chuck, Okay. And Larry is a brutish tyrant. I can't stand them torturing anyone let alone someone who's so good-natured and gentle. Now let's go!\"", 
   {
    "unicode_changes_made": true
   }, 
   302104, 
   null, 
   1203224220.0
  ], 
  [
   302827, 
   null, 
   "CUNxTime", 
   "Anybody? Comments?", 
   {}, 
   302105, 
   null, 
   1203575880.0
  ], 
  [
   302922, 
   null, 
   "Peeling", 
   "I've read Chapter 1 so far, and if it's OK I'll give you my feedback on that before continuing.\n \n The first thing that hits me, right up front, is that it's pretty much 100% pure 'telling' and no 'showing'. Let me illustrate what I mean by that:\n \n Colin was very intelligent and enjoyed crosswords. He was unusually good at them, and on his lunch break liked to sit with a cup of coffee and fill in all the clues.\n \n The above tells you (presumably) important information about Colin. But it's just a fact-dump: it gives you as a reader nothing to do; nothing to notice, nothing to deduce. Nor is it particularly entertaining: it's not advancing the story. We know something about someone called Colin, but nothing has actually happened yet.\n \n If you look over chapter 1 again, you'll notice that the first couple of lines describe something happening - and that's about it. The rest of the chapter is a list of facts, apart from the very last line which, at first reading, I didn't realise was actually happening 'now' - I thought it was part of the preceding descriptive stuff. \n \n Falling into the trap of telling rather than showing is really easy and there's no shame in it. You, the author, know a tremendous amount - about the story, about the people in it, about what has happened and what will happen, while the reader knows nothing at all. The urge to equalise that pressure, to tell the reader all the cool stuff you know, can be overwhelming.\n \n Let's go back to Colin, then, and show the reader the things we want him to know:\n \n Colin studied the back page of the newspaper, idly tapping his pen on the rim of his coffee-cup. Steve, sitting opposite and deep in thought, frowned.\n \"Do you mind?\"\n \"Mmm? Oh, sorry.\" Colin took a sip, grunted and filled in the remaining empty squares before tossing the completed crossword onto the cafeteria table. \"Pay up.\"\n \"What?\" Steve snatched up the discarded paper and glared at it. \"You've got to be kidding me.\"\n Colin shrugged and stretched out his hand.\n \"Come on, I'm hungry and you're buying. Again.\"\n \n By delivering the information via a scene rather than a fact-dump, we've turned something dull into something almost worth reading. The reader still knows Colin is remarkably good at crosswords and does them in his lunch-break, but he also knows a bit more about Colin's personality, his friend Steve whom Colin is not above exploiting for petty cash, etc.\n \n The scene also allows us to set the reader up for a later 'reveal' - we could, for instance, have a later scene where Colin meets an attractive woman on the train to work - this meeting furthering the main plot - and at the same time we let the reader in on the joke:\n \n The invitation to pursue the subject hung in the air. Colin twiddled his pen thoughtfully. Rain began to streak the carriage window, blurring the high-rises flashing past outside. He pushed the incomplete crossword away. What the heck, he could buy his own lunch for once.\n \n See? We thought we knew Colin, but we didn't, and he's a deeper, richer character for it.\n \n Here's the bad news: Showing takes longer than telling, and it's harder. It takes discipline. Telling is the mark of impatience. Your first chapter has enough factual 'meat' to fill five times as many pages, and it needs to be done with care. You're introducing four characters, a bunch of physical description, odds and ends of personal history, and trying to set the scene (arriving for a trial hearing). So let's ask ourselves: what does the reader really need to know at this early stage, and how best to structure the way we show and tell?\n \n One option would be to introduce an earlier 'chapter 1' or prologue, in which we see Parker at liberty in Alaska, driving along. We don't tell the reader he's a murderer, we don't tell him there's a body, or bits of bodies, in the trunk. We show him appreciating the open vistas, maybe changing stations to find some music he likes. Maybe we are privy to his thoughts regarding the frontier lifestyle he's adopted, or maybe we see him mentally cataloguing the people he's planning to visit in the coming days. He might be considering which order to visit them, debating which would be the most efficient route to take. In effect, we're not only telling the reader he looks normal, we lull them into believing he is normal. Then we end on something like:\n \n James sighed and popped the trunk. He stepped back and gazed out across the valley, admiring the crisp greens, ice-clear blues and the perfect mirror of the lake, while the patrolman retched and cursed and fumbled for his sidearm. So close. The cop shouted something. A mile more to the lake, maybe?\n \"I said on the floor, you son of a bitch!\"\n James knelt. Far away down on the highway a silver tanker-truck caught the sun and became for a moment a speeding golden bullet. He watched it, entranced.\n A thick-soled boot caught him hard in the small of the back, and James Parker's world became a faceful of gravel and the patrolman's hoarse, vomit-smelling breath.\n \n More later; gotta go home now!", 
   {}, 
   302827, 
   null, 
   1203622680.0
  ], 
  [
   302926, 
   null, 
   "CUNxTime", 
   "Peeling, thanks for the input I know it had to have taken a while to do that post and I appreciate it more than you could know. I will go back and take another look at that. One thing though that I should probably tell you and it may be a mistake on my part for starting with a scene with Parker and Crow. As you'll see, they are VERY ancillary characters (at least until the very end). The vast majority of the book centers around a group of characters from a high school. The book itself is a sort of combination of \"The Breakfast Club\" meets \"Lord of the Flies\" meets \"Alive\" Also, I've read on many publisher websites that they don't want to read more than 110K words in a manuscript. I've already written 98,000 and I still must finish the conclusion and the epilogue (should be today or tomorrow, YEA!)\n \n Knowing what I've just told you about them not being 'Main' characters and the fact that I'm almost to my \"Word Limit\", do you think I should 'fluff up' the beginning? I'm worried that if I go to long, I won't even be considered for publication. Although, I'm engaging an agent on my behalf.\n \n Thanks again for the post and the advise! I appreciate what you've said and the time you've taken to do so.", 
   {}, 
   302922, 
   null, 
   1203623640.0
  ], 
  [
   303009, 
   null, 
   "Peeling", 
   "First of all, I ought to have prefaced my earlier coments by saying that there was plenty I didn't have to criticize. You've got a lot of the fundamentals working - sentence construction, grammar and so forth - so take it as read if I'm not mentioning it, it's not something that's bothering me.\n \n Secondly, what you're telling me about the two criminals changes things - not the showing vs telling thing, that still stands - but when you say they're 'ancilliary', how do you mean? Do we keep track of them as the book progresses?\n \n When I said earlier that you know everything and the reader knows nothing, you should keep in mind that that's your power. What your reader doesn't know yet keeps them curious, keeps them interested, keeps them reading. Don't give up what you know too lightly. Applying this thinking to the criminals, ask yourself this: how much of what you've put in chapter 1 does the reader really need to know by the end of it? Do you need to explain in such explicit detail who those men are, what they look like, and what they're doing in the van? Or could you maybe pare it right back, and show just enough to set the scene and intrigue the reader, then fill in more and more details later?\n \n I'm guessing the 'Alaska' part is going to be significant later, so presumably you'll need to weave that in. Let me run an idea past you: what if you let the reader think to begin with that Parker isn't a criminal at all, but Crow's brief?\n \n Van is on the move, Crow and Parker in the back, cops in the front.\n \n Crow is uncommunicative, Parker is breezy and chatty. Mention his clothes in passing - brushing off his suit etc. Mention the cuffs on Crow (he rubs where they've chafed his skin, maybe) but not the ones on Parker. Parker talks about what a lovely day it is, how it reminds him of the weather up in Alaska, asks the cops if they've ever been, tells them how beautiful it is, how he had a cabin up there and how it's a real escape from the rat-race, and how he plans to go back there someday when he escapes all this. Asks Crow if he has his story straight - Crow just glowers at him. At end of chapter, we see the van pull into the underground car-park beneath a courthouse sign.\n \n You get the gist, anyway. Just for fun, if I were writing the story (obviously I don't know how yours progresses), I might do something like this:\n \n Next time we see Crow, he's on the run, alone. \n \n In main storyline, one of the characters reads or sees or hears a news report about a prison bus overturning and a number of prisoners escaping including a dangerous serial killer.\n \n Later, we see Crow considering his options - head for Mexico? No, he has an idea: go and hole up in the cabin Parker told him about. And if Parker's there, he'll deal with him.\n \n Main story progresses, we get to see the collision course the two story threads are on: Alaska. More incidental mention of the escaped convicts, and someone comments on what an ugly bastard one of them is, with that scar and all.\n \n Story continues, main characters somehow end up bumping into Parker up in his cabin in Alaska; he offers to take them in until the weather improves. One of the kids (nobody believes him/her) insists he/she has seen someone following them.\n \n One of the kids goes missing.\n \n Cut to Crow prowling around the woods outside the cabin, trying to stay warm, trying to figure out how to deal with Parker and the kids.\n \n Parker puts on an act, telling the kids that he'd heard on the radio that the escaped serial killer was believed to be heading in their direction. Tells them how this guy preyed on children, gets them all worked up - he's loving it inside but keeps a straight face for them and the reader.\n \n More kids disappear.\n \n Ending? Could go any one of a few ways. Crow could be dead and the kids have to deal with Parker themselves. Parker could kill all the kids but be killed himself by Crow - who could then also die. Crow could save kids, but be killed by law enforcement anyway. Crow could save kids and then make good his escape, or try but freeze to death, or 'they never find a body, but nobody could survive that weather'.\n \n Anyway, it's your story, not mine :)\n \n Moving on to Chapter 2, I wanted to highlight the 'telling' you're still doing:\n \n \nThe cold breeze rustled the bronze and golden grounded leaves bringing with it the sharp smell of pine smoke and winter. Ian had been waiting for this trip for the whole school year. He thought he would explode long before winter break would arrive. However, just as the internal pressures created by his adolescent excitement threatened to overwhelm him completely, winter arrived as a long frosty sigh blown down from the northern reaches of Canada's artic circle. As the inaugural flakes slowly drifted to the frost hardened ground, a smile spread over his wind reddened cheeks revealing strait white teeth.\n \"Less than one week,\" he thought to himself as he hurried home from school.\n His father was taking him to the REI store tonight to get some last minute gear. He began his mental checklist for what must have been the 10th time that day. Ian had nearly twice the equipment that had been required by the sponsors of the trip into the boondocks of Alaska. In fact, he had bought nearly everything he needed early in Fall when he and his wilderness ecosystems biology class had teamed up with the ski club to lobby for and organize a two week winter trip to the Alaskan backcountry. Now it was just around the corner, they were departing on December 20th, but each minute felt as if it was dragging by like an hour.\n He raced the last few blocks home, his overstuffed backpack swaying back and forth like a pendulum. His mother told him time and time again to use his locker. \"You'll ruin your back,\" she would chide. However, being fifteen he was certain of his invincibility and that perfect health was sure to last forever.\n He veritably flew past the last two split-level homes on the ever so typically American cul-de-sac. He did not notice the new for sale sign in front of his neighbor's house. Of course, at the age of 15 there is plenty that you fail to grasp. Conversely, Ian would say that youth's lack of wisdom is offset, handily, by all that one forgets as time inevitably marches on.\n He yanked the door open and flew past his younger sister, Libby. Slowing only to shrug off the backpack, he stomped up the stairs without acknowledging her presence. \"Hello, Ian. How was school?\" She tried to ask as he whisked by her at warp speed. \"Mom said don't leave your stuff on the floor,\" she shouted behind him as he tramped up the steps. Manners may be the greatest casualty of youth, but what teenage boy has time for his 9-year-old sister?\n Up and into his room, he slammed the door and fired up his computer. After checking his emails, he typed up a short text to his best friend Mark Smith asking him if he wanted to come to REI with him. Before Ian can hit the send key, he began to second-guess inviting Mark on the shopping jaunt. Mark's asthma, coupled with an over protective mother caused him to miss out on many of the things Ian, and almost every other young man, enjoy. Ian tried to be considerate of Mark's dilemma. He usually managed not to twist the proverbial knife, but it was difficult when something of this magnitude came along. Ian knew that this trip was a life-shaping event and to his friend's credit, Mark tried to share his excitement. He clicked cancel without sending and put his computer back on stand-by.\n Ian's room was a carbon copy of countless teens across the country. Posters of some of the latest bands were next to others of cars and cover girls filled most of the wall space. One feature that differentiated his sanctuary from that of many other boys his age was the sheer number of books scattered about the desk and floor and even stacked neatly on shelves. There were tons of science fiction paperbacks mixed in with thick college science texts. Physics and chemistry sat beside dragons and wizards a true allegory of Ian's varied and often contradictory interests.\n \"This is going to rock,\" he thought to himself. Not only was this the first time he was going to be away from his family for an extended time, this trip would also be coed. Girls. One particular girl in fact, Monica Treadway. Ian had been completely and utterly enthralled with the toned, shapely, blonde goddess since they returned to school after summer vacation in 9th grade, last school year.\n He often thought back to when Monica had been a skinny and lanky bean pole with a freckled face and glasses. What a difference a summer makes! Monica had returned to school completely changed and Ian wasn't the only one to notice. Suddenly, the junior and even some senior guys were paying attention to her and who could blame them. Always tall, she had filled out her frame in all the right places. Now she was a curvy leggy beauty who seemed to glide down the halls at school, making concentration exceptionally difficult for a significant portion of the male population of Ronald Reagan High.\n Ian thought back to all the times he had done stupid boy things to her. Stupid, Stupid, Stupid!!! He cursed himself. Why had he chased her with the spider on the playground in 6th grade? Why did he put the earthworm in her hair back in 5th grade? Well it was probably too late now anyway. While he had refrained from torturing her with insects lately, how could he hope to compete with guys on the football team who had their own cars? He'd made up his mind though, on this trip he would make his move, whatever it took!\n This fantasy had played through his mind countless times. Monica laying there shivering in her frosty sleeping bag and he'd just happen to be there with an extra blanket and a thermos of hot coco. The fire would be glowing softly and the wind would be howling outside the cabin. Flights of fancy would enrapture his imagination with infinite variations on this theme for hours, until Ian was certain that he would go crazy.\n Ian could not get Monica out of his mind. There was something about her, something in the way she looked, her expression, the way she carried herself, a sad, shy vulnerability that made Ian want to protect her, to take her in his arms and shelter her from the world. There was something about her that made him want to take responsibility for her, to provide her anything she could possibly need. Sometimes he felt that the most important accomplishment in his life would be to make, and keep, her happy for all time.\n \"Are you sleeping up there?\" his father, Ian Sr., yelled from the bottom of the stairs. Ian's head snapped up from his daydream. He'd done it again.\n \"Coming Dad,\" he shouted back as he gathered the list of 'necessities' off his desk. Ian ran down the stairs and out the front to where his father was waiting with the car running. As he slammed the door behind him, he didn't quite hear his mother's voice drifting out in his wake, \"don't leave your books down here....\"\n\n \n Imagine for a moment your book is a movie. Apart from the description of the contents of Ian's bedroom, none of the parts I've bolded work. Imagine watching the movie with your reader, and every time one of those big lumps of 'telling' crops up you have to hit 'pause' and explain a whole bunch of stuff to him:\n \n <click<\"Yeah, see, he deleted that mail instead of sending it because his friend is asthmatic and can't go on the trip, so although Ian would like to spend time with him he doesn't want to rub it in by dragging him around the equipment store. And now he's thinking about this girl he really likes but who he used to be mean to and now never even notices him. She's going on the trip too, and he's fantasizing about getting together with her.\"<click<\n \n Pretending your story is a movie is useful because when you're reading a good book, that's what plays out in your mind: a movie - with the added intimacy of being able to know what someone is thinking, maybe.\n \n So let's think about Chapter 2 as a scene from a movie. Ian's running home - fine. He's thinking about his checklist - ok, forget running, he's walking fast and looking at the checklist in his hand; we get to see ticks next to some of the gear and not next to others. We see it start to snow, and Ian look up and smile with excitement. He shifts his backpack to get it comfortable, and mutters 'Use your locker, you'll ruin your back' under his breath, mimicking his mother. He breaks into a run.\n \n He gets home and brushes past his sister, shouts to his mother that he's inviting his friend along, then slams into his room, tossing his backpack down among the D&D paraphenalia, textbooks and field guides to Alaska strewn across his bed. We see him write the e-mail inviting his friend, then we see him hesitate and delete it rather than sending. Do we need to know about the girl he likes yet? Nah; save that for later. His father calls and he rushes off downstairs.\n \n Cut to the equipment store with him and his father. Father says \"What happened to picking up Mark on the way?\" Ian explains how he didn't think it was fair to rub Mark's nose in the fact he wasn't coming. Father understands, appreciates Ian being thoughtful, yadda yadda. This is a perfect unobtrusive way to establish the details of the trip - where they're going etc. Two birds, one stone.\n \n When we do get to see Monica in a later chapter, we see Ian going all misty eyed, her ignoring him, and Mark saying \"Well, it's like I always say: if you're going to put worms in a girl's hair, make sure she isn't going to turn out to be a total babe first. True story. Hey, maybe you two can hook up out there; I hear it gets real cold at night... perfect for an ice queen to take a lover\"\n \n You get the idea. Picture a movie, and then write THAT story. Be sparing with the additional telling you do; always ask yourself if the reader needs to know what you're telling him right now, or if there's maybe a way you could show it later.\n \n I realise the prospect of editing so much story is daunting, but it's absolutely worth it. Anyway, I hope this has been some use to you.", 
   {
    "unicode_changes_made": true
   }, 
   302926, 
   null, 
   1203648420.0
  ], 
  [
   303076, 
   null, 
   "Peeling", 
   "Chapter 3 manages to show more and tell less:\n \n \nEvery Monday thorough Friday, at exactly ten minutes past eight in the morning, just as they were unlocked, Chuck Hatter would walk as fast as he could through the front doors of Ronald Regan High School. While his goal was always the same, he was rarely successful. Today would be no different.\n As Chuck rounded the corner of the hallway that lead to his locker, he saw the small group of boys standing near by. Chuck began to slowdown immediately while simultaneously dropping his gaze to the floor.\n \"Why me,\" he thought. \"Why won't they find someone else to pick on?\"\n \"Hey there he is,\" shouted the tallest of those gathered around the lockers.\n Larry Pike had always been big for his age and had excelled in nearly every athletic endeavor he'd ever attempted. Now, at 6'1\" and 215 lbs he was not only captain of the football and basketball teams, he was already being scouted by top colleges. Although he was kept busy with sports and friends and trying to keep his grades high enough to remain eligible to play, Larry ALWAYS made time to torment those he saw as weak and unpopular. Chuck was, by far, his favorite target.\n \"Wow, Upchuck, your looking particularly piggish today. Has you father been slopping you with the hogs again?\" Several of the boys chuckled at this reference to both Chuck's weight and his father's occupation as a hog farmer and veterinarian.\n \"Dang, boys, what is that smell,\" Larry, now the carnival barker, turned the volume up another notch, so as to attract a larger audience to the carnage. \"I swear, they're talking about making a dress code at this school. What about a hygiene code?\"\n \"Aw, come on Larry, I took a shower today,\" Chuck's voice barely a hoarse whisper.\n \"What's that Upchuck Fatter? Are you mumbling something over there? I swear to God your face is so fat that I think you've swallowed your own freaking mouth, Fat stuff,\" Larry, now beginning to guffaw loudly, his face turning scarlet red, knows he's got a quite an audience forming.\n Chuck was still intently gazing at the carpet as if the answers to all life's questions were written in the no-pile fibers of the floor beneath him. More likely, he was hoping to make himself small, small enough to craw into the rug, smaller than an atom. He thought often about being tiny. He often thought that he'd give anything to not be 6'2\" and 310 lbs. He sometimes thought he wanted to die.\n Chuck's cheeks were now burning with a searing intensity nearing that of a supernova. His face took on the splotchy, rosy red reverse camouflage coloring to which obese people are prone. \"Please, please, please,\" he kept repeating, a mantra in his head. He didn't know what he was asking for. Was it that the punishment and torment stop? Was he asking not to cry, right there in the hallway, in front of his classmates?\n As the sweat began to stream in glistening snail-trails down his burning cheeks, Chuck knew, with certainty that he was going to cry. He could feel his tear ducts filling with his salty shame. His vision was commencing to blur. The carpet began to refract into prisms of brown and green stripes shimmering and dancing in Chuck's eyes.\n \"Shouldn't you be studying, Pike?\" A factiously pleasant, forcefully impertinent voice drifted from the crowd. \"Your mother called Gramms, just yesterday, to ask if I could help you with English and Biology so that you'd be able to play basketball this year!\"\n Mandy O'Brian was not a shy girl. In fact, Mandy O'Brian was one tough son of a gun. She'd always been somewhat of a Tomboy. Yet, Tomboy or not, she was still quite attractive. Tall, at 5'11\", Mandy had short blondish hair cut in a sort of updated 1920's flapper style, and style was Mandy's middle name.\n In the cauldron of conformity that is American high school society, Mandy marched to the beat of a different drum. Heck, she marched to the beat of a different trombone. Mandy never did ANYTHING simply because it was expected of her. Conversely, Mandy refused to refrain from activities that were considered inappropriate for her race, gender, or any other cultural attribute. She, as they would have said in an earlier generation, did her own thing. Whereas nearly everyone else in the school knelt and groveled at Larry's size 13 feet, Mandy was only too happy to confront him about his unconscionable behavior.\n Larry, knowing that there was nothing to gain by loosing a battle of wits with the granddaughter of one of his mother's church friends, figured he had put on enough of a show for those he considered his 'followers.' \"Look guys. I think Upchuck Fatter is about to cry! We better get outta here before his Amazon lover here decides to beat us all down.\" He and his gang of scavengers turn and walk, laughing, back down the hall. As they leave, they stop at a few of the lockers where advanced level students are gathering their books for the morning classes. In a fit of pique they slam the doors of the lockers, which automatically lock upon closing. It was just another small, irksome show of power and a reminder of the natural pecking order of high school civilization.\n The crystalline fireworks display that covered Chuck's field of vision began to pull back, like the drawing of a curtain allowing the carpet fibers to fuse back, first into individual strands then into a mat of brown and green beneath his feet. He was breathing hard but, thanks to Mandy, he hadn't lost the battle with his tears.\n \"Why do you put up with that jerk?\" Mandy asked. \"You shouldn't let him walk all over you like that. You need to stand up to him.\"\n \"Just leave alone! I can take care of myself,\" Chuck huffed in a breathy wheeze as he brushed by Mandy and her best friend/shadow Julie and walked over to his locker. He just stood there unmoving; hand on the combination dial, staring through the door into nothingness.\n \"Can you believe that,\" Mandy's friend Julie 'Jules' Winslow whispered. \"If he can't stand up for himself, he could at least be thankful for your help, God.\"\n \"Leave it be, Jules. It's not his fault. He's shy,\" Mandy said quietly. It was completely uncharacteristic for her to make excuses for anyone. \"Let's go to homeroom, come on.\"\n \"OHMYGOD, you have a crush on Upchuck!\" Heads turned toward the pair as Jules luckily managed to clamp down on the volume for the last word of her exclamation.\n \"Shut up! And don't call him that. I just think he's sweet and that there is a lot more than meets the eye with Chuck, Okay. And Larry is a brutish tyrant. I can't stand them torturing anyone let alone someone who's so good-natured and gentle. Now let's go!\"\n\n \n Look at the bolded bits and ask yourself: are they even necessary? I can figure out most of what you're telling me by myself; I don't need to be force-fed. Look what you get with the crudest edit possible; just deleting the bolded parts:\n \n \nAs Chuck rounded the corner of the hallway that lead to his locker, he saw the small group of boys standing near by. Chuck began to slowdown immediately while simultaneously dropping his gaze to the floor.\n \"Why me,\" he thought. \"Why won't they find someone else to pick on?\"\n \"Hey there he is,\" shouted the tallest of those gathered around the lockers.\n \"Wow, Upchuck, your looking particularly piggish today. Has you father been slopping you with the hogs again?\" \n \"Dang, boys, what is that smell,\" Larry, now the carnival barker, turned the volume up another notch. \"I swear, they're talking about making a dress code at this school. What about a hygiene code?\"\n \"Aw, come on Larry, I took a shower today,\" Chuck's voice barely a hoarse whisper.\n \"What's that Upchuck Fatter? Are you mumbling something over there? I swear to God your face is so fat that I think you've swallowed your own freaking mouth, Fat stuff,\" Larry, now beginning to guffaw loudly, his face turning scarlet red, Chuck was still intently gazing at the carpet as if the answers to all life's questions were written in the no-pile fibers of the floor beneath him.\n Chuck's cheeks were now burning with a searing intensity nearing that of a supernova. His face took on the splotchy, rosy red reverse camouflage coloring to which obese people are prone. \"Please, please, please,\" he kept repeating, a mantra in his head. He didn't know what he was asking for. Was it that the punishment and torment stop? Was he asking not to cry, right there in the hallway, in front of his classmates?\n As the sweat began to stream in glistening snail-trails down his burning cheeks, Chuck knew, with certainty that he was going to cry. He could feel his tear ducts filling with his salty shame. His vision was commencing to blur. The carpet began to refract into prisms of brown and green stripes shimmering and dancing in Chuck's eyes.\n \"Shouldn't you be studying, Pike?\" A factiously pleasant, forcefully impertinent voice drifted from the crowd. \"Your mother called Gramms, just yesterday, to ask if I could help you with English and Biology so that you'd be able to play basketball this year!\"\n Larry, knowing that there was nothing to gain by loosing a battle of wits with the granddaughter of one of his mother's church friends, figured he had put on enough of a show for those he considered his 'followers.' \"Look guys. I think Upchuck Fatter is about to cry! We better get outta here before his Amazon lover here decides to beat us all down.\" He and his gang of scavengers turn and walk, laughing, back down the hall. As they leave, they stop at a few of the lockers where advanced level students are gathering their books for the morning classes. In a fit of pique they slam the doors of the lockers, which automatically lock upon closing. It was just another small, irksome show of power and a reminder of the natural pecking order of high school civilization.\n The crystalline fireworks display that covered Chuck's field of vision began to pull back, like the drawing of a curtain allowing the carpet fibers to fuse back, first into individual strands then into a mat of brown and green beneath his feet. He was breathing hard but, thanks to Mandy, he hadn't lost the battle with his tears.\n \"Why do you put up with that jerk?\" Mandy asked. \"You shouldn't let him walk all over you like that. You need to stand up to him.\"\n \"Just leave alone! I can take care of myself,\" Chuck huffed in a breathy wheeze as he brushed by Mandy and her best friend/shadow Julie and walked over to his locker. He just stood there unmoving; hand on the combination dial, staring through the door into nothingness.\n \"Can you believe that,\" Mandy's friend Julie 'Jules' Winslow whispered. \"If he can't stand up for himself, he could at least be thankful for your help, God.\"\n \"Leave it be, Jules. It's not his fault. He's shy,\" Mandy said quietly. \"Let's go to homeroom, come on.\"\n \"OHMYGOD, you have a crush on Upchuck!\" Heads turned toward the pair as Jules luckily managed to clamp down on the volume for the last word of her exclamation.\n \"Shut up! And don't call him that. I just think he's sweet and that there is a lot more than meets the eye with Chuck, Okay. And Larry is a brutish tyrant. I can't stand them torturing anyone let alone someone who's so good-natured and gentle. Now let's go!\"\n\n \n It doesn't flow perfectly, but a couple of quick link sentences (eg \"Chuck looked up but could see nothing through his tears. It sounded like Mandy O'Brian. Rescued by a girl. The thought of her pitying him, of what he must look like to her was worse than having to put up with Larry\") and you're pretty much there. It's OK for the reader to find out more about Mandy and Larry later. When Chuck's eyes clear we can see what she looks like to him. Remember who the reader is 'with' in each chapter and try to describe the world as he/she sees it - does Chuck know what an 'updated 1920's flapper style' is? No, so that's not what he sees - he just thinks she looks pretty and her hair suits her. Does he really 'get' style? Probably not, so he doesn't know style is Mandy's middle name - he just knows she always looks great.\n \n And one last thing: I underlined a section where you slipped into present tense briefly - that needs fixing.\n \n So, to summarise:\n \n 1. Tell less, show more.\n \n 2. Remember who the reader is 'with' in each scene, and show the world how the character sees it - that tells the reader more about the character they're with than any amount of biographical info-dump.\n \n 3. Think carefully about how much you tell the reader and when - knowledge is power. I expect later on, when these kids are thrown together against adversity in Alaska, they're going to learn things about each other, maybe get past their preconceptions, form new bonds and new rivalries. Let the reader go on that journey too. If you keep introducing every character with a full, unambiguous bio you leave the reader with nothing to look forward to, no curiosity to satisfy.\n \n 4. Personal pet peeves: I try to avoid littering text with ALL CAPS - it leaves you with nowhere to go when you really need to depict someone screaming at the top of their voice. Also, I particularly dislike the use of numbers. They're parsed by a different part of your brain and it's like hitting a little speed-bump every time you come across one while reading. Larry is over six feet and two hundred pounds. Chuck is slightly taller but tops the scales at over three hundred. No need for strict numerical accuracy.\n \n 5. You might want to dial back the purple prose a little. When you're using 'supernova' in the third chapter to describe what is after all an everyday event, you aren't leaving yourself a lot of headroom later for when you really want to emphasise something.\n \n Thanks for the read; hope this has been helpful.", 
   {
    "unicode_changes_made": true
   }, 
   303009, 
   null, 
   1203683580.0
  ], 
  [
   303157, 
   null, 
   "CUNxTime", 
   "Peeling, first of all,, THANK YOU! Second of all, what in the hell are you doing reading my s#@t at 5:33 in the damn morning, don't you sleep? emoticon_xhoho As far as the editing goes, it IS daunting, however, when I'm finished (next day or 2), I fully plan on spending a couple of weeks at it. One thing that concerns me, I was very careful to keep the manuscript PG-13 or less so that there won't be any (many?) objections from parents and so that high schools can carry it in the library. That is one of the reasons I tried to be fairly literal (no pun!) and straight forward, I didn't want to go over the heads of the 'average' 14/15 year old. Am I not giving them enough credit? For example, the characters; I could have been much, much more subtle when developing their characters but, to put it bluntly, I put it bluntly.\n \n As for staying in tense, man, that's been so hard. I've had to go back again and again to turn -ing into -ed. I'm hoping to catch the rest during the rewrite/edit.\n \n You obviously know a whole lot about this kind of thing. Let me ask you, how important is the 'word limit'? As I said in the earlier post, I'm at about 99K words. I should finish up (before rewrite deletions and edits) @ about 105K words. I've been told the 110K is too much, publishers won't consider longer manuscripts. Should I go over that if that's what it takes to 'show' more and 'tell' less. Also, what about the YA market, are you shore I don't have to be fairly blunt? Also, although there are only a few MAIN, front line, ultra important characters, there are 11 survivors of the plane crash and they all do, to a greater or lesser extent, provide important insights and conflicts for the really important characters. Is it ok to real expand the book that much? To show rather than tell about that many characters (and actually, there are maybe 6 or 8 other's who's 'back stories' or personalities or certain events from their past become relevant or otherwise important to the story. We're talking about adding another 100+/- pages to the total. Is that acceptable? \n \n Concerning Parker and Crow, throughout the story we check up on them every 5 or 8 chapters. They serve 2 purposes, because they kill 2 transport officers and escape, the sheriff (who believes that the downed plane, which they'd lost contact with couldn't possibly have any survivors) spends his resources trying to find the murders, AND the sickos come across the kids and all hell breaks lose. This is at the VERY end, after the teens have survived more blizzards, bears, and etc... and Parker does kill Crow, since he doesn't like to share. Of course, Parker gets it to, just minutes later. Then all's well!\n \n BTW-I'm very glad you gave me your opinion on the CAPS. I struggled with that, trying to decide if I should use that technique. The only reason I caved and did it, was because it seems that that is the way young people write (on the posts and the few chat rooms I've seen). I will certainly change that, WITH PLEASURE...\n \n Peeling, thank you for all your help and the time you've spent here. I don't know how to thank you properly and you can't imagine how helpful your guidance has been!", 
   {}, 
   303076, 
   null, 
   1203715140.0
  ], 
  [
   303404, 
   null, 
   "Peeling", 
   "One thing that concerns me, I was very careful to keep the manuscript PG-13 or less so that there won't be any (many?) objections from parents and so that high schools can carry it in the library. That is one of the reasons I tried to be fairly literal (no pun!) and straight forward, I didn't want to go over the heads of the 'average' 14/15 year old. Am I not giving them enough credit? For example, the characters; I could have been much, much more subtle when developing their characters but, to put it bluntly, I put it bluntly.\n\n \n Hmm. That's a tough call for me to make. I was... let's say 'non-standard' in terms of literacy in my youth. \n \n When I think it over, though, I keep coming back to the fact that in movies and real life, we learn by seeing things happen. We intuitively 'get' the concept of a person's character being revealed by their actions. Tell a story as if it were a PG-13 movie and you can't go far wrong, I think. In terms of giving your audience the right amount of credit, I think it's more about considering the amount of life-experience they have and what they're interested in, what they see as important. The characters you're describing are familiar, to some degree, to any person that age - all the more reason to demonstrate that you are on their wavelength. Fail to credit your audience with the ability to recognise, say, a bully by his actions alone, and you risk alienating them. What you can do, though, is provide a further level of insight. You can show them why he's a bully despite being so successful academically and in sports. Showing why other people are the way they are can be very enlightening.\n \n\n You obviously know a whole lot about this kind of thing. Let me ask you, how important is the 'word limit'? As I said in the earlier post, I'm at about 99K words. I should finish up (before rewrite deletions and edits) @ about 105K words. I've been told the 110K is too much, publishers won't consider longer manuscripts. Should I go over that if that's what it takes to 'show' more and 'tell' less.\n\n To be honest, a good rule is 2nd draft = 1st draft - 10%. \n \n Will reply more tomorrow- need to get to bed.", 
   {}, 
   303157, 
   null, 
   1203901620.0
  ], 
  [
   303439, 
   null, 
   "Peeling", 
   "Ok, as I was saying, a good rule of thumb is to reduce the length of your second draft by at least 10%, so I wouldn't worry about edging over your self-imposed limit. As we've seen already, it's possible to cut big chunks of 'telling' without appreciably affecting the reader's understanding.\n \nAlso, what about the YA market, are you shore I don't have to be fairly blunt?\n\n Does the YA market watch \"The OC\"? If so, I don't see them having any problem with understanding characters and relationships they're shown rather than told about.\n \nAlso, although there are only a few MAIN, front line, ultra important characters, there are 11 survivors of the plane crash and they all do, to a greater or lesser extent, provide important insights and conflicts for the really important characters. Is it ok to real expand the book that much? To show rather than tell about that many characters (and actually, there are maybe 6 or 8 other's who's 'back stories' or personalities or certain events from their past become relevant or otherwise important to the story. We're talking about adding another 100+/- pages to the total. Is that acceptable?\n\n It's hard to be sure without a specific example to work with, but here's what I think: \n \n First, none of the three chapters I've looked at so far have become longer as a result of cutting back on the telling.\n \n Secondly, let's think about the alternatives to telling in more detail, and what they actually involve:\n \n 1. Don't bother.\n \n If a fact isn't crucial to the reader's understanding and enjoyment, or if it merely states something that can already be inferred elsewhere, just get rid of it. Even if you're really proud of the language you've used, what's important is the pace and flow of the story: all things must serve that end. Check out the awkward line where you tell the reader what Chuck's dad does for a living - the insults themselves make it clear enough. Snip.\n \n 2. Make use of existing opportunities to show rather than tell.\n \n Every time your characters have a conversation, particularly a conversation about someone else, that's an opportunity to mention something you might otherwise have to tell the reader. It's an opportunity for a character to voice a question the reader is asking, and for that question to be answered. You've got the perfect opportunity to do this, too: the plane flight. Who sits with who, the conversations they have, watching each other, talking about each other.\n \n Every time the character you're 'riding with' sees another character do something, that's an opportunity for them to mentally contribute their understanding to the reader. Mandy watches Larry walking away and wonders why he torments Chuck so; why his own success isn't enough for him.\n \n 3. Use introspection. \n \n We all mull things over, and showing a character mulling things over is a great way to inform the reader. It just needs to be done at the right time, so that it doesn't interrupt the flow of a scene. The biggest problem with the telling in the chapters above is that it keeps stalling the narrative, breaking the mood and preventing it from picking up momentum. Chuck's being bullied, and we're being treated to Mandy's light-hearted bio ;)\n \n 4. Keep the point of view consistent in each scene.\n \n Telling starts to creep in whenever you let the point of view wander within a scene:\n \nLarry, knowing that there was nothing to gain by loosing a battle of wits with the granddaughter of one of his mother's church friends, figured he had put on enough of a show for those he considered his 'followers.'\n\n We shouldn't be seeing what Larry thinks here; we're riding with Chuck. We should see Chuck's perspective on the encounter until it's over. Then by all means insert a line-break and switch to Mandy's perspective:\n \n \"Why do you put up with that jerk?\" Mandy asked. \"You shouldn't let him walk all over you like that. You need to stand up to him.\"\n \"Just leave alone! I can take care of myself,\" Chuck huffed in a breathy wheeze as he brushed by Mandy and the girl with her and walked over to his locker. \n \n Mandy watched Chuck, feeling frustrated and saddened. He was just standing there unmoving; hand on the combination dial, staring through the door into nothingness.\n \"Can you believe that?\" her friend Julie whispered. \"If he can't stand up for himself, he could at least be thankful for your help, God.\"\n \"Leave it be, Jules. It's not his fault. He's shy,\" Mandy said quietly. \"Let's go to homeroom, come on.\"\n \n Five words shorter than the original, and it manages to say even more. Mandy and 'the girl with her' shows us Chuck notices Mandy more than her friend.\n \n \nBTW-I'm very glad you gave me your opinion on the CAPS. I struggled with that, trying to decide if I should use that technique. The only reason I caved and did it, was because it seems that that is the way young people write (on the posts and the few chat rooms I've seen). I will certainly change that, WITH PLEASURE...\n\n \n Chat rooms and forums are playgrounds, and everyone shouts in the playground. It's a competition. In a book, you're the only one talking; you don't need to shout.\n \n While I'm here, I just noticed I missed a chapter by mistake. Let's apply some of our thinking to it:\n \nJane Hopkins was an academic all-American with a perfect 4.0 grade point average. She was also on the student council, a member of the debate team, and involved in many other clubs and activities. She had finished her preparations for the excursion weeks ago. She had purchased every single piece of equipment on the list of recommended items sent home by Nancy Stone, her biology teacher and the faculty sponsor of the outing to Alaska's frozen wilderness.\n Jane couldn't believe she was being allowed to go. Her parents drove her relentlessly to excel academically and veritably forced her into multitudes of extracurricular activities. However, for all of Jane's efforts they allowed her very little freedom of her own. She sometimes felt tethered to her overbearing parents. Shy to begin with, she found it impossible to even contemplate having a boyfriend while under her parents' collective thumb. She wasn't even allowed to spend the night at her best friend's house for fear that 'something terrible' might happen. Jane hated the fact that she was being punished for her mother and father's fear, no abject terror, of modern society. Well this would be different, she promised herself. Her little white lie about the extra credit in biology had ensured her folk's grudging cooperation on this one opportunity she had to escape their iron grip.\n She danced around in circles with her stuffed dog FeFe, which she'd had since turning two years old. Humming to herself, she daydreamed about her long time crush, Ian Thomas. She pictured him, with his cute crooked grin, standing there in the snow. May be he'd come to her cabin with an extra blanket and some hot chocolate and offer to help keep her warm on a blustery evening on the frigid tundra.\n \"Are you finished your homework,\" Pauline Hopkins screeched from the bottom of the stairs. \"You know you have piano practice at 6:30 tonight!\"\n \"Yeah, Yeah, Yeah, it's always something,\" she shouted back.\n \"What, what, what?!?\" her mother yelled back.\n \"I said, Yeah, I'm coming!\" Jane roared down to her mother. Jane grabbed her coat off of her perfectly made bed, careful not to disturb her precisely placed stuffed animals. She placed FeFe in his spot in the middle and brushed some imaginary lint off of the cute pink fringed pillow cases. She took a last look around her room, making sure everything was in place. All of her academic awards and certificates were hanging straight. Her spelling bee trophies were arranged chronologically starting in pre-kindergarten. Her completed homework was stacked on her desk next to the three textbooks from the classes in which she had homework. Yes, everything was perfect, as it should be, so she turned off the light and closed the door behind her as she left.\n \"How many chaperones will be on this trip anyway?\" Asked her mother for about the hundredth time, as they drove over to Mrs. Hanson's house for Jane's piano tutoring.\n \"Mom, I've told you it's an extended onsite lab,\" she retorted\n \"Well nonetheless,\" said her mother, \"how many?\"\n \"Besides our two biology teachers, one parent and two professional guides will all be helping take care of everything. There will also be another group of students there and I'm sure they are going to have ADULT SUPERVISION as well, Mother.\" Jane always called her 'Mother,' never mom or mommy and usually with more annoyance than respect.\n \"You don't understand how the world is out there Jane! Your father and I only want to protect you.\"\n \"I know, but don't worry, this trip is all planned out by the professionals, and it will give me an edge getting into Perdue when I graduate. There's only a couple years left before graduation.\"\n \"That is true, if you don't start setting yourself apart now, you'll end up at some state college. Then what kind of future will you have probably living on the street or in section 8 housing.....\"\n\n \n See how much redundant telling there is here - you're already doing the showing later on! What's actually missing, on the other hand, is an understanding of who Jane is and why she does what she does. Does she do what her parents want out of love? Fear? For the sake of a quiet life? Whose idea is it for her room to be so perfect? Is Jane quite content, secretly, to hide away in academia and dream of freedom she'd probably be too scared to enjoy for real? Is she like the guy in a bar brawl who struggles against his friends' restraining arms - but doesn't struggle so hard as to risk breaking free? \n \nPeeling, thank you for all your help and the time you've spent here. I don't know how to thank you properly and you can't imagine how helpful your guidance has been!\n\n \n Not at all; I just hope I'm giving good advice :)", 
   {
    "unicode_changes_made": true
   }, 
   303157, 
   null, 
   1203948180.0
  ], 
  [
   303464, 
   null, 
   "CUNxTime", 
   "OK, it's starting to get through my thick skull (show vs. tell). I think what I need to do is hurry up and finish the conclusion and prologue (I'm almost @ 100K words, & should be done by 105-110K) then of course it'll be time to start in on the serious rewrite. \n \n I'm going to certainly use your advice and suggestions when I go to rewrite and edit it. I don't know a lot about you, from your profile. I don't know how busy you are or even what you do. Would you consider editing the entire book? Perhaps we could work out a price per hour, or (better yet for my current bank account) I could give you a % of the proceeds. I'd be happy to email you the entire manuscript for you to peruse if that would help you decide. Of course, I'd like to give you a copy anyway after I edit it and a signed copy when it (assuming it does) gets published. If you are too busy or just don't want to mess with it, I completely understand, its just a thought. I'd been thinking about hiring someone anyway, and you obviously know what you are talking about. What do you think? (again, if you're too busy just say so)", 
   {}, 
   303439, 
   null, 
   1203971700.0
  ], 
  [
   303561, 
   null, 
   "Peeling", 
   "I'm going to certainly use your advice and suggestions when I go to rewrite and edit it. I don't know a lot about you, from your profile. I don't know how busy you are or even what you do. Would you consider editing the entire book?\n\n I'd love to try; that would be great! Editing a full novel is not something I've done before.\n \n Some background so you can make a more informed decision:\n \n By trade I'm a software engineer; writing has been a long-standing hobby. My first short story was a last-minute entry to the Stephen King 'On Writing' competition, which made it into the final eleven sent to Mr King for judging.\n \n Since then I've written a number of other short stories and published them on www.fanstory.com. I won a couple of competitions, made it into the top 10 authors on the site and (until I allowed my account to lapse) one story held the #1 all-time highest rated spot. I spent quite a lot of time reviewing and helping others with their stories. I also got 45,000 words into a novel before work and a new addition to the family made it impossible to concentrate :)\n \n Aside from that, I've edited a 40,000 word degree course dissertation which recieved a pass with distinction, and helped out on numerous smaller documents for my wife's work in project management.\n \n If you want, I can mail you a couple of my short stories - or just post one here - so you can see if you like my take on storytelling.\n \n \nPerhaps we could work out a price per hour, or (better yet for my current bank account) I could give you a % of the proceeds. \n\n \n I'd be very uncomfortable taking money up front (that is, prior to acceptance for publication) for providing a service of unknown value. The latter option, a cut of the proceeds, sounds much better.\n \n \nI'd been thinking about hiring someone anyway, and you obviously know what you are talking about. What do you think? (again, if you're too busy just say so)\n\n As this isn't my day job, I'd always advocate engaging the services of a professional - unless that's beyond your means. A professional will charge either an hourly rate or per page/300 words. A quick rummage through google is quoting me anything from £500 to £2100 for proofreading, grammar and typo correction, and revision suggestions on a 100,000 word novel.\n \n Some sites offer a free sample edit, which is a risk-free way of evaluating their services. I'd recommend trying some of them first.\n \n If you still want me to take a shot after that, I'd be happy to. Editing, unlike writing, is something I can fit in around my existing commitments. Let me know if you want me to post one of my stories meanwhile.", 
   {}, 
   303464, 
   null, 
   1204029060.0
  ], 
  [
   303575, 
   null, 
   "CUNxTime", 
   "I'd love to read your stories anyway. However, I've already seen enough of your editing and proofing abilities fully believe in the value of having your help on this project. I'm sold on the idea of you doing the edit and I'd be more than happy to work out something on the back end. This is the first time I've worked on something of this magnitude (I too have started a few other novels without completing them) and it is more than worth it, in my opinion, to share the proceeds in order to deliver a marketable product for publication. Let's decide on a compensation amount (% or otherwise) and how we'll go about doing the editing and draw something up for us to sign.", 
   {}, 
   303561, 
   null, 
   1204045260.0
  ], 
  [
   303581, 
   null, 
   "CUNxTime", 
   "I went to fansite. Do I need to sign up to view your work, I didn't see a search function? And is it listed under 'Peeling'? Like I said, I'm already sold on your editing, but I'd like to see your stuff for its own value.", 
   {}, 
   303575, 
   null, 
   1204047120.0
  ], 
  [
   303583, 
   null, 
   "Peeling", 
   "I would not accept more than 10%. If you don't make a fortune, I wouldn't want to significantly deplete what you do get for your efforts. And if you do make a fortune, well, 10% of a fortune is still pretty good :)\n \n Apart from that, I'm open to offers.\n \n In terms of the actual editing process, I'd suggest:\n \n 1. I read the whole book, end to end, to get a proper sense of what's going on.\n 2. I provide high-level feedback: the overall pace of the story, anything I felt was unclear or unbelievable, any irrelevant or superfluous characters, anything I thought needed to be 'set up' better early in the story etc. Also what worked really well.\n 3. We discuss if and how you want to tackle these high-level issues. Maybe one character is surplus to requirements and his/her lines could be given to other people. Or maybe that character is needed, but the reasons aren't sufficiently clear. Whatever, we come up with a plan you're happy with.\n 4. You come up with a quick second rough draft and I proofread that. All we're aiming for here is something that tells me the story you want to tell.\n 5. Assuming all is well, I make a more detailed pass like I did on the sample chapters, picking up on parts that might be streamlined and making suggestions. These I will feed back to you a chapter or so at a time as I go along.\n 6. You produce a 'beta' third draft incorporating whichever of my recommendations you think appropriate.\n 7. When you're happy with that, I'll do a final pass as a second pair of eyes to check grammar and catch any misused words (Word is good but not perfect) and get it as polished as possible.\n \n About the only caveat I can think of is that whereas professional services promise a two-week turnaround, realistically I'm going to be restricted to a couple of hours a day, so it might be a bit of a slog, especially stage 5.\n \n What do you think?", 
   {}, 
   303575, 
   null, 
   1204048980.0
  ], 
  [
   303584, 
   null, 
   "Peeling", 
   "I went to fansite. Do I need to sign up to view your work, I didn't see a search function? And is it listed under 'Peeling'? Like I said, I'm already sold on your editing, but I'd like to see your stuff for its own value.\n\n \n I'll post one of them here. My account on Fanstory.com has lapsed and my stories don't show up in the listings unless I pay to reopen it.", 
   {}, 
   303581, 
   null, 
   1204049160.0
  ], 
  [
   303588, 
   null, 
   "CUNxTime", 
   "Hell, don't pay! Not for my sake, anyway. You can send it to me or post it here.", 
   {}, 
   303584, 
   null, 
   1204051080.0
  ], 
  [
   303592, 
   null, 
   "CUNxTime", 
   "As to the deal, I think that sounds good. I don't mind going 10%, I think that is fair. We are talking about the net though, right? Our taxes here aren't nearly as bad as in the UK (that's where you live right?) but they will take a chunk. I wouldn't mind at all to pay 10% of my money, but I'd hesitate to promise 10% of what isn't even mine yet-lol. Time wise, I wouldn't put any pressure on you at all. In fact, as soon as I get it finished (I keep saying any day now!) I can send you the whole thing to peruse at your leisure and then when I get each chapter finished with my rewrite, I can get it to you. That way you have a headstart while I'm still working on it. Then, when I'm done you'll be part of the way there already with your proofing. What do you think?", 
   {}, 
   303588, 
   null, 
   1204051860.0
  ], 
  [
   303618, 
   null, 
   "Peeling", 
   "Net, absolutely. Story's posted, by the way.", 
   {}, 
   303592, 
   null, 
   1204075680.0
  ], 
  [
   303622, 
   null, 
   "CUNxTime", 
   "Sounds like we've got a deal. I really think this is going to help me quite a bit. Between your help AND the drive it'll give me, I think this is going to work out great! By the way, when I send you the rough draft of the whole manuscript, if you change your mind, I'll completely understand. I mean it. I really feel that its a good story and has a very good chance of being really well received by its target demographic. But if, for whatever reason, you think its a 'lost cause' or whatever, just say so.\n \n BTW-Do I find your work on fansite, under 'Peeling'?", 
   {}, 
   303618, 
   null, 
   1204079460.0
  ], 
  [
   303668, 
   null, 
   "Peeling", 
   "No, you find it by going 'back' one page and clicking on Short Story: End Time\n \n :)", 
   {}, 
   303622, 
   null, 
   1204125720.0
  ], 
  [
   303670, 
   null, 
   "CUNxTime", 
   "Cool, no wonder, I couldn't find yaemoticon_idea .\n \n BTW: Do you want to write something up per our agreement and sign it? Then send it to me and I'll sign and notarize it. Or shall I write it up and send it to you?", 
   {}, 
   303668, 
   null, 
   1204126680.0
  ], 
  [
   303671, 
   null, 
   "Peeling", 
   "To be honest, I don't really see the point. I'm not about to start suing someone on the other side of the planet; life's too short and lawyers eat plenty well enough already without you or me paying their tab. Frankly I think the world would be a nicer place with a bit more trust and a bit less litigation. Let's just do it and see what happens.", 
   {}, 
   303670, 
   null, 
   1204127700.0
  ], 
  [
   303672, 
   null, 
   "CUNxTime", 
   "I can't seem to locate a 'search' function on fanstory. How do I get 'End Time' to show up? What category (fantasy, mystery, etc...)? I'm been looking all over but they don't list by date (in fact I can't see any rhyme or reason).", 
   {}, 
   303670, 
   null, 
   1204128420.0
  ], 
  [
   303673, 
   null, 
   "CUNxTime", 
   "To be honest, I don't really see the point. I'm not about to start suing someone on the other side of the planet; life's too short and lawyers eat plenty well enough already without you or me paying their tab. Frankly I think the world would be a nicer place with a bit more trust and a bit less litigation. Let's just do it and see what happens.\n\n \n There is always this record of our agreement. However, it is your work and effort going into this and I would want you to know you are protected and have no worries about your future compensation. I will write something up anyway and I can scan it and email it to you (if you send me an email to the address I sent you I can reply to it with not only that but with the entire manuscript when it is finished). I just want you to feel comfortable putting your time into this...", 
   {}, 
   303671, 
   null, 
   1204128720.0
  ], 
  [
   303674, 
   null, 
   "Peeling", 
   "I can't seem to locate a 'search' function on fanstory. How do I get 'End Time' to show up? What category (fantasy, mystery, etc...)? I'm been looking all over but they don't list by date (in fact I can't see any rhyme or reason).\n\n \n Heh... \n \n Y'know, this is what hyperlinks are for.\n \n http://www.4forums.com/political/showthread.php?t=11000", 
   {}, 
   303672, 
   null, 
   1204129380.0
  ], 
  [
   303677, 
   null, 
   "CUNxTime", 
   "Oh cr@p, I've been looking on fanstory for it all along!!! LOL. I even signed up, hehe. DUH...I didn't know it was on here. I even sent the admin on fanstory and emial complaining that I couldn't find it... Can't wait to hear back from them!", 
   {}, 
   303674, 
   null, 
   1204129980.0
  ], 
  [
   376594, 
   null, 
   "liberty4all", 
   "I read it really liked it. then I read Peelings critique and thought \"this person has got to be an English professor or teacher somewhere.\" I guess knowing a whole other language or several (software engineer right?) will sufice for the equivalent of qualified in the writing dept. Even though both are different in how the end result is accomplished, both require a mastery of language usage. \n Really impressed with both story and the critique. I was just gonna say the story held my attention and had good flow from one chapter to the next, letting the reader know some of what was happening but also not too descriptive that some authors have a way with. Sometimes the overdescriptive can bore a reader but is sometimes a necessary component to make the later parts meld correctly. I think those authors are falling into the trap of showing vs. telling, and myself not being a writer of any magnitude, would never realized but for reading the posts by Peeler and the examples given.\n Hope it does well on the racks or in the schools for you.", 
   {
    "post_info": {
     "post_title": "Wow"
    }
   }, 
   303583, 
   null, 
   1257261180.0
  ], 
  [
   376649, 
   null, 
   "ImYY4U", 
   "To be honest, I don't really see the point. I'm not about to start suing someone on the other side of the planet; life's too short and lawyers eat plenty well enough already without you or me paying their tab. Frankly I think the world would be a nicer place with a bit more trust and a bit less litigation. Let's just do it and see what happens.\n\n \n \"Trust, but verify.\"\n ... Ronald Reagan", 
   {}, 
   303671, 
   null, 
   1257281280.0
  ], 
  [
   376650, 
   null, 
   "ImYY4U", 
   "What do you think?\n \n Any comments will be appreciated. I've written the book to particularly speak to the young adult demographic and to teens (which is why there's little cussing and less blood). However, it should appeal to many people who went through high school and like adventure fiction...\n\n \n \"Cussing\" and blood are what teens want a lot of.", 
   {}, 
   302104, 
   null, 
   1257281460.0
  ], 
  [
   376652, 
   null, 
   "ImYY4U", 
   "\nChapter 1\n December 14th 10am Fairbanks, Alaska\n \n Chapter 2\n December 14th 3:58pm Front Royal, Virginia\n The cold breeze rustled the bronze and golden grounded leaves bringing with it the sharp smell of pine smoke and winter. Ian had been waiting for this trip for the whole school year. He thought he would explode long before winter break would arrive. However, just as the internal pressures created by his adolescent excitement threatened to overwhelm him completely, winter arrived as a long frosty sigh blown down from the northern reaches of Canada&#8217;s artic circle. As the inaugural flakes slowly drifted to the frost hardened ground, a smile spread over his wind reddened cheeks revealing strait white teeth. \n &#8220;Less than one week,&#8221; he thought to himself as he hurried home from school. \n His father was taking him to the REI store tonight to get some last minute gear. He began his mental checklist for what must have been the 10th time that day. Ian had nearly twice the equipment that had been required by the sponsors of the trip into the boondocks of Alaska. In fact, he had bought nearly everything he needed early in Fall when he and his wilderness ecosystems biology class had teamed up with the ski club to lobby for and organize a two week winter trip to the Alaskan backcountry. Now it was just around the corner, they were departing on December 20th, but each minute felt as if it was dragging by like an hour. \n He raced the last few blocks home, his overstuffed backpack swaying back and forth like a pendulum. His mother told him time and time again to use his locker. &#8220;You&#8217;ll ruin your back,&#8221; she would chide. However, being fifteen he was certain of his invincibility and that perfect health was sure to last forever. \n He veritably flew past the last two split-level homes on the ever so typically American cul-de-sac. He did not notice the new for sale sign in front of his neighbor&#8217;s house. Of course, at the age of 15 there is plenty that you fail to grasp. Conversely, Ian would say that youth&#8217;s lack of wisdom is offset, handily, by all that one forgets as time inevitably marches on. \n He yanked the door open and flew past his younger sister, Libby. Slowing only to shrug off the backpack, he stomped up the stairs without acknowledging her presence. &#8220;Hello, Ian. How was school?&#8221; She tried to ask as he whisked by her at warp speed. &#8220;Mom said don&#8217;t leave your stuff on the floor,&#8221; she shouted behind him as he tramped up the steps. Manners may be the greatest casualty of youth, but what teenage boy has time for his 9-year-old sister?\n Up and into his room, he slammed the door and fired up his computer. After checking his emails, he typed up a short text to his best friend Mark Smith asking him if he wanted to come to REI with him. Before Ian can hit the send key, he began to second-guess inviting Mark on the shopping jaunt. Mark&#8217;s asthma, coupled with an over protective mother caused him to miss out on many of the things Ian, and almost every other young man, enjoy. Ian tried to be considerate of Mark&#8217;s dilemma. He usually managed not to twist the proverbial knife, but it was difficult when something of this magnitude came along. Ian knew that this trip was a life-shaping event and to his friend&#8217;s credit, Mark tried to share his excitement. He clicked cancel without sending and put his computer back on stand-by. \n Ian&#8217;s room was a carbon copy of countless teens across the country. Posters of some of the latest bands were next to others of cars and cover girls filled most of the wall space. One feature that differentiated his sanctuary from that of many other boys his age was the sheer number of books scattered about the desk and floor and even stacked neatly on shelves. There were tons of science fiction paperbacks mixed in with thick college science texts. Physics and chemistry sat beside dragons and wizards a true allegory of Ian&#8217;s varied and often contradictory interests. \n &#8220;This is going to rock,&#8221; he thought to himself. Not only was this the first time he was going to be away from his family for an extended time, this trip would also be coed. Girls. One particular girl in fact, Monica Treadway. Ian had been completely and utterly enthralled with the toned, shapely, blonde goddess since they returned to school after summer vacation in 9th grade, last school year. \n He often thought back to when Monica had been a skinny and lanky bean pole with a freckled face and glasses. What a difference a summer makes! Monica had returned to school completely changed and Ian wasn&#8217;t the only one to notice. Suddenly, the junior and even some senior guys were paying attention to her and who could blame them. Always tall, she had filled out her frame in all the right places. Now she was a curvy leggy beauty who seemed to glide down the halls at school, making concentration exceptionally difficult for a significant portion of the male population of Ronald Reagan High.\n Ian thought back to all the times he had done stupid boy things to her. Stupid, Stupid, Stupid!!! He cursed himself. Why had he chased her with the spider on the playground in 6th grade? Why did he put the earthworm in her hair back in 5th grade? Well it was probably too late now anyway. While he had refrained from torturing her with insects lately, how could he hope to compete with guys on the football team who had their own cars? He&#8217;d made up his mind though, on this trip he would make his move, whatever it took!\n This fantasy had played through his mind countless times. Monica laying (sic) there shivering in her frosty sleeping bag and he&#8217;d just happen (sic) to be there with an extra blanket and a thermos of hot coco (sic). The fire would be glowing softly and the wind would be howling outside the cabin. Flights of fancy would enrapture his imagination with infinite variations on this theme for hours, until Ian was certain that he would go crazy.\n Ian could not get Monica out of his mind. There was something about her, something in the way she looked, her expression, the way she carried herself, a sad, shy vulnerability that made Ian want to protect her, to take her in his arms and shelter her from the world. There was something about her that made him want to take responsibility for her, to provide her anything she could possibly need. Sometimes he felt that the most important accomplishment in his life would be to make, and keep, her happy for all time.\n &#8220;Are you sleeping up there?&#8221; his father, Ian Sr., yelled from the bottom of the stairs. Ian&#8217;s head snapped up from his daydream. He&#8217;d done it again. \n &#8220;Coming Dad,&#8221; he shouted back as he gathered the list of &#8216;necessities&#8217; off his desk. Ian ran down the stairs and out the front to where his father was waiting with the car running. As he slammed the door behind him, he didn&#8217;t quite hear his mother&#8217;s voice drifting out in his wake, &#8220;don&#8217;t leave your books down here&#8230;.&#8221;\n \n &#8221;\n\n \n Your characters, especially the teen-aged protagonist, Ian, need more fleshing out, and the whole story needs to be more descriptive (more detail)\n in order to let the reader more thoroughly immerse himself in the narrative.\n If not too much rancor arises over this small criticism, I will audit the other chapters.", 
   {}, 
   302105, 
   null, 
   1257283200.0
  ], 
  [
   376660, 
   null, 
   "MarieAntoinette", 
   "I think that writer went into a coma, then died.", 
   {}, 
   376652, 
   null, 
   1257288660.0
  ], 
  [
   376672, 
   null, 
   "gansao", 
   "I think that writer went into a coma, then died.\n\n \n Antonia admitted that she was very fat.\n Fat people are supposed be jolly but Antonia was not jolly at all.\n Can you tell me why?\n I believe that you know her.", 
   {}, 
   376660, 
   null, 
   1257293100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The first couple chapters of my first novel...", 
  "url": "http://www.4forums.com/political/writings/10944-first-couple-chapters-my-first-novel.html", 
  "breadcrumbs": [
   "Writings"
  ], 
  "id_number": 10944, 
  "discussion_files": [
   [
    "27177.html", 
    "http://www.4forums.com/political/writings/10944-first-couple-chapters-my-first-novel-print.html"
   ], 
   [
    "27178.html", 
    "http://www.4forums.com/political/writings/10944-first-couple-chapters-my-first-novel-3-print.html"
   ], 
   [
    "27179.html", 
    "http://www.4forums.com/political/writings/10944-first-couple-chapters-my-first-novel-2-print.html"
   ]
  ], 
  "identifier": 10944
 }
]