[
 [
  [
   302368, 
   null, 
   "bmittking", 
   "With the high probability of a McCain v. Obama race in the fall, one wonders where the independent vote will go. Both candidates have strong independent appeal.\n \n And what about opposite-party votes? Will McCain' Democratic supporters outnumber the Obamacans, or will it be the other way around?", 
   {
    "post_info": {
     "post_title": "Independents &amp; Across the Aisle"
    }
   }, 
   null, 
   null, 
   1203387540.0
  ], 
  [
   302378, 
   null, 
   "obvious_child", 
   "Mccain more cross over then Obama, but independents too early to call, assuming a O v M race.\n \n In a H v M race, independents and cross over to McCain for sure.", 
   {}, 
   302368, 
   null, 
   1203388920.0
  ], 
  [
   302385, 
   null, 
   "CUNxTime", 
   "The biggest influence on the Independents will be the actual campaign and the debates between McCain and Obama. If Obama is able to keep the race strictly rhetorical, then he may get more. However, if McCain is able to pin him down and really get into solutions, experience, and the issues, he will have a chance to claim more independents than Obama.", 
   {}, 
   302378, 
   null, 
   1203392640.0
  ], 
  [
   302475, 
   null, 
   "DrD", 
   "IMO the current POTUS and his admin have turned their party into shambles. With respect to independents, they will vote against the right. Whether this will be a vote for the left, I'm not sure. However the entire country wants change.\n \n McCain literally screwed himself when he said he would continue the Bush policies in Iraq and be willing to stay a 100 more years. BIG Oops since more than 70% of the population disagree with this policy.", 
   {}, 
   302385, 
   null, 
   1203447480.0
  ], 
  [
   304306, 
   null, 
   "Archangel", 
   "With the high probability of a McCain v. Obama race in the fall, one wonders where the independent vote will go. Both candidates have strong independent appeal.\n \n And what about opposite-party votes? Will McCain' Democratic supporters outnumber the Obamacans, or will it be the other way around?\n\n \n It all depends how much information like this is released, and who it's about. Here's an excerpt from the article and links to the thesis. It's in 4 parts. This could really hurt Obama if he ends up winning the nomination. \n \n The Louis Farrakhan endorsement is also hurting him because of Farrakhan's statements that Jews are a gutter race and that whites are a skunk race. But what will really kill his candidacy is that Obamas minister and Spiritual advisor at his home church awarded Farrakhan with an award for all of his Race related accomplishments which pretty much exposes Obamas public condemnation of Farakhans Racist statements as outright lies. Just wait till Hillary packages this mental picture for public dissemination. And if not her, then McCain. Either way it's a deal killer and will scare off too many white voters.\n Michelle Obama thesis was on racial divide\n By: Jeffrey Ressner \n Feb 22, 2008 04:20 PM EST \n Updated: February 23, 2008 09:51 AM EST\n \n Michelle Obama's senior thesis at Princeton University shows a young woman grappling with race and society.\n \n Michelle Obama's senior year thesis at Princeton University, obtained from the campaign by Politico, shows a document written by a young woman grappling with a society in which a black Princeton alumnus might only be allowed to remain \"on the periphery.\" Read the full thesis here: Part 1, Part 2, Part 3, Part 4.\n \n \"My experiences at Princeton have made me far more aware of my 'blackness' than ever before,\" the future Mrs. Obama wrote in her thesis introduction. \"I have found that at Princeton, no matter how liberal and open-minded some of my white professors and classmates try to be toward me, I sometimes feel like a visitor on campus; as if I really don't belong. Regardless of the circumstances underwhich I interact with whites at Princeton, it often seems as if, to them, I will always be black first and a student second.\" \n \n The thesis, titled \"Princeton-Educated Blacks and the Black Community\" and written under her maiden name, Michelle LaVaughn Robinson, in 1985, has been the subject of much conjecture on the blogosphere and elsewhere in recent weeks, as it has been \"temporarily withdrawn\" from Princeton's library until after this year's presidential election in November. Some of the material has been written about previously, however, including a story last year in the Newark Star Ledger. \n \n Obama writes that the path she chose by attending Princeton would likely lead to her \"further integration and/or assimilation into a white cultural and social structure that will only allow me to remain on the periphery of society; never becoming a full participant.\" \n \n During a presidential contest in which the term \"transparency\" has been frequently bandied about, candidates have buried a number of potentially revealing documents and papers. In Hillary Rodham Clinton's case, there's been a clamoring for tax records, White House memos and other material the candidate's team has chosen to keep from release. The 96-page Princeton thesis, restricted from release by the school's Mudd Library, has also been the subject of recent scrutiny. \n \n Earlier this week, commentator Jonah Goldberg remarked on National Review Online, \"A reader in the know informs me that Michelle Obama's thesis ... is unavailable until Nov. 5, 2008, at the Princeton library. I wonder why.\" \n \n \"Why a restricted thesis?\" asked blogger-pastor Louis Lapides on his site Thinking Outside the Blog. \"Is the concern based on what's in the thesis? Will Michelle Obama appear to be too black for white America or not black enough for black America?\" \n \n Attempts to retrieve the document through Princeton proved unsuccessful, with school librarians having been pestered so much for access to the thesis that they have resorted to reading from a script when callers inquire about it. Media officers at the prestigious university were similarly unhelpful, claiming it is \"not unusual\" for a thesis to be restricted and refusing to discuss \"the academic work of alumni.\"\n http://www.politico.com/news/stories/0208/8642.html", 
   {}, 
   302368, 
   null, 
   1204520520.0
  ], 
  [
   304518, 
   null, 
   "HonestAbe", 
   "McCain, Hagee, `The Great Whore', the Israel Lobby\n \n by shergald, Sat Mar 01, 2008 at 09:31:27 AM EST\n \n The Huffington Post this morning published a story (John Hagee's McCain Endorsement Sparks Uproar) about McCain's endorsement by James Hagee, the founder of Christians United for Israel (CUI) and leader of the Christian Zionists, relating more fully the extent of Hagee's bigotry. Not only are Muslims in the sights of CUI's guns, but Catholics (The Great Whore), Blacks, gays, women, and others have also been targeted.\n \n Hagee is the purveyor of a Christian eschatology in which end days are coming when Jews will be subjected to conversion, but his antiMuslim rhetoric, especially his support for attacking Iran, has attracted extreme right wing Israeli supporters like Benjamin Netanyahu, leader of the extremist Likud party in Israel, and Joe Lieberman to his fold. Both Netanyahu and Lieberman have spoken at CUI conventions, and Hagee in turn has spoken before AIPAC, the face of the Israel Lobby in the US, which is also an advocate of Likud (no Palestinian state) politics.\n \n McCain's problem is this Hagee bigot. Worse than Farriken.", 
   {}, 
   304306, 
   null, 
   1204674840.0
  ], 
  [
   304593, 
   null, 
   "obvious_child", 
   "But what will really kill his candidacy is that Obamas minister and Spiritual advisor at his home church awarded Farrakhan with an award for all of his Race related accomplishments which pretty much exposes Obamas public condemnation of Farakhans Racist statements as outright lies.\n\n \n Only to people who think that the people who go to a Church are incapable of independent thought and accept at face value whatever their Church says without question....so people like you.", 
   {}, 
   304306, 
   null, 
   1204771860.0
  ], 
  [
   304646, 
   null, 
   "DrD", 
   "Let me put it simply. . . .John Hagee is a nut burger. This is the meanest \"Christian\" preacher I have ever seen. This man needs ECT. . . .many, many times.", 
   {}, 
   304593, 
   null, 
   1204825560.0
  ], 
  [
   304690, 
   null, 
   "HonestAbe", 
   "Let me put it simply. . . .John Hagee is a nut burger. This is the meanest \"Christian\" preacher I have ever seen. This man needs ECT. . . .many, many times.\n\n \n Yet McCain has not denounced his support as far as I've been able to see.", 
   {}, 
   304646, 
   null, 
   1204858200.0
  ], 
  [
   304695, 
   null, 
   "DrD", 
   "How sad. . .Not only for McCain but for the country as well.", 
   {}, 
   304690, 
   null, 
   1204860840.0
  ], 
  [
   304753, 
   null, 
   "jyoshu", 
   "McCain, Hagee, `The Great Whore', the Israel Lobby\n \n by shergald, Sat Mar 01, 2008 at 09:31:27 AM EST\n \n The Huffington Post this morning published a story (John Hagee's McCain Endorsement Sparks Uproar) about McCain's endorsement by James Hagee, the founder of Christians United for Israel (CUI) and leader of the Christian Zionists, relating more fully the extent of Hagee's bigotry. Not only are Muslims in the sights of CUI's guns, but Catholics (The Great Whore), Blacks, gays, women, and others have also been targeted.\n \n Hagee is the purveyor of a Christian eschatology in which end days are coming when Jews will be subjected to conversion, but his antiMuslim rhetoric, especially his support for attacking Iran, has attracted extreme right wing Israeli supporters like Benjamin Netanyahu, leader of the extremist Likud party in Israel, and Joe Lieberman to his fold. Both Netanyahu and Lieberman have spoken at CUI conventions, and Hagee in turn has spoken before AIPAC, the face of the Israel Lobby in the US, which is also an advocate of Likud (no Palestinian state) politics.\n \n McCain's problem is this Hagee bigot. Worse than Farriken.\n\n \n When you paste such things as this, please link to the source or at least cite where you pasted it from, please.", 
   {}, 
   304518, 
   null, 
   1204923600.0
  ], 
  [
   304763, 
   null, 
   "HonestAbe", 
   "When you paste such things as this, please link to the source or at least cite where you pasted it from, please.\n\n \n Sorry. It came from the Huffington Post as it says in the beginning of the article.", 
   {}, 
   304753, 
   null, 
   1204930200.0
  ], 
  [
   304790, 
   null, 
   "jyoshu", 
   "http://www.usatoday.com/news/politics/election2008/2008-03-07-mccain-hagee_N.htm?csp=34", 
   {
    "post_info": {
     "post_title": "McCain rejects Hagee's views on Catholics"
    }
   }, 
   304690, 
   null, 
   1204943580.0
  ], 
  [
   306104, 
   null, 
   "Archangel", 
   "Only to people who think that the people who go to a Church are incapable of independent thought and accept at face value whatever their Church says without question....so people like you.\n\n \n Been watching the News lately child? It seems my words were prophetic and yours were, well; let's just say they reflected your political insight. BTW, care to point out any aspect of the public outrage that I failed to predict? emoticon_frazzled emoticon_xbye", 
   {}, 
   304593, 
   null, 
   1205633820.0
  ], 
  [
   307080, 
   null, 
   "Bassman", 
   "Sorry. It came from the Huffington Post as it says in the beginning of the article.\nFluffington Post? Figures emoticon_rolleyes", 
   {}, 
   304763, 
   null, 
   1206946920.0
  ], 
  [
   307183, 
   null, 
   "obvious_child", 
   "Been watching the News lately child? It seems my words were prophetic and yours were, well; let's just say they reflected your political insight. BTW, care to point out any aspect of the public outrage that I failed to predict? emoticon_frazzled emoticon_xbye\n\n \n Good job on proving my point.\n \n You completely ignore everything else. \n \n I'm still dead on:\n \n Only to people who think that the people who go to a Church are incapable of independent thought and accept at face value whatever their Church says without question....so people like you.", 
   {}, 
   306104, 
   null, 
   1207082760.0
  ], 
  [
   307207, 
   null, 
   "Archangel", 
   "Good job on proving my point.\n \n You completely ignore everything else. \n \n I'm still dead on:\n \n Only to people who think that the people who go to a Church are incapable of independent thought and accept at face value whatever their Church says without question....so people like you.\n\n \n How typical, you again ignore the complete point made while discussing a non issue.\n http://www.4forums.com/political/showpost.php?p=304593&postcount=7\n \n And here's the original prediction that I made that was well before the Rev Wright story broke. \n http://www.4forums.com/political/showpost.php?p=304306&postcount=5", 
   {}, 
   307183, 
   null, 
   1207088340.0
  ], 
  [
   307213, 
   null, 
   "obvious_child", 
   "How typical, you again ignore the complete point made while discussing a non issue.\n http://www.4forums.com/political/showpost.php?p=304593&postcount=7\n\n \n You're right, it is non-issue, especially when one looks at Obama as a whole, his pastor's other words and other issues. What is amusing is that Hagee's words for McCain haven't earned McCain anywhere near the #### that Obama's gotten. Bias I suspect. But this whole story just shows just how desperate people are for dirt on Obama. I personally may vote McCain, but the filth that people are willing to put on themselves in this is amusing. \n \n You proved my point. You took everything on face value and ignored everything else.", 
   {}, 
   307207, 
   null, 
   1207089780.0
  ], 
  [
   307227, 
   null, 
   "Archangel", 
   "You're right, it is non-issue, especially when one looks at Obama as a whole, his pastor's other words and other issues. What is amusing is that Hagee's words for McCain haven't earned McCain anywhere near the #### that Obama's gotten. Bias I suspect. But this whole story just shows just how desperate people are for dirt on Obama. I personally may vote McCain, but the filth that people are willing to put on themselves in this is amusing. \n \n You proved my point. You took everything on face value and ignored everything else.\n\n \n I took nothing just at face value. But I did recognize the hypocrisy of Obama staying in a racist church for 20 years trying to look like a christian for appearance sake when he is nothing of the sort. And the reason Hagee hasn't had the same effect on Mcain is because Mcain didn't attend his church for 20 years; but even if he did, Hagee isn't an avowed racist who went to libya with a radical black muslim like Louis Farrakan either. So comparing the two is like comparing apples to oranges.", 
   {}, 
   307213, 
   null, 
   1207092540.0
  ], 
  [
   307237, 
   null, 
   "obvious_child", 
   "I took nothing just at face value. But I did recognize the hypocrisy of Obama staying in a racist church for 20 years trying to look like a christian for appearance sake when he is nothing of the sort. And the reason Hagee hasn't had the same effect on Mcain is because Mcain didn't attend his church for 20 years; but even if he did, Hagee isn't an avowed racist who went to libya with a radical black muslim like Louis Farrakan either. So comparing the two is like comparing apples to oranges.\n\n \n Again, you are taking things at face value. You are assuming that one statement from his pastor is everything. Would you like to be judged on a single inflammatory statement made by your pastor and have everyone ignore everything else? \n \n Second, you obviously haven't heard what Hagee said (or probably pretending he didn't say anything which is likely given your history), nor did you hear McCain's statements on his appreciation for Hagee or you are again pretending he never said such words.\n \n My point is dead on, as usual when I discuss you.", 
   {}, 
   307227, 
   null, 
   1207098540.0
  ], 
  [
   307240, 
   null, 
   "Archangel", 
   " \n Second, you obviously haven't heard what Hagee said (or probably pretending he didn't say anything which is likely given your history), nor did you hear McCain's statements on his appreciation for Hagee or you are again pretending he never said such words.\n \n\n \n Rather than making unfounded accusations, why not just post a link to clarify what you're implying is such a terrible scandal that Mcain has gotten a pass on? Why all the childish games child? I guess it's just your nature huh?", 
   {}, 
   307237, 
   null, 
   1207100340.0
  ], 
  [
   307291, 
   null, 
   "obvious_child", 
   "Rather than making unfounded accusations, why not just post a link to clarify what you're implying is such a terrible scandal that Mcain has gotten a pass on? Why all the childish games child? I guess it's just your nature huh?\n\n \n I stopped bothering to post any links with you several months back. You'll excuse me if I'm going to go off past history, even if it does not always predict future results. \n \n You never read links. The ONLY time you inform and educate yourself is when you go out on your own and research. The entire evolution forum is a huge example of you ignoring everything you do not like. Only if your discussion with peeling shows you actually learning something and that was from your own effort outside of this place to research. I'm not stupid. I know exactly how you think and how you learn. People posting links has not worked in the past.", 
   {}, 
   307240, 
   null, 
   1207168680.0
  ], 
  [
   307301, 
   null, 
   "Archangel", 
   "I stopped bothering to post any links with you several months back. You'll excuse me if I'm going to go off past history, even if it does not always predict future results. \n \n You never read links. The ONLY time you inform and educate yourself is when you go out on your own and research. The entire evolution forum is a huge example of you ignoring everything you do not like. Only if your discussion with peeling shows you actually learning something and that was from your own effort outside of this place to research. I'm not stupid. I know exactly how you think and how you learn. People posting links has not worked in the past.\n\n \n So you admit that you can't support your claims with actual evidence, so you blame me for your inability to prove what you say? Sounds pretty stupid to me. \n \n And since you brought up intelligence; and you're ignoring isly's request, care to diagram this sentence structure and explain what it means? It's your statement after all:\n \n You can harp all you want but when you never win anything here and command the respect of those no one things is worth talking to, what does that say about you?", 
   {}, 
   307291, 
   null, 
   1207173900.0
  ], 
  [
   307305, 
   null, 
   "obvious_child", 
   "So you admit that you can't support your claims with actual evidence, so you blame me for your inability to prove what you say? Sounds pretty stupid to me. \n \n And since you brought up intelligence; and you're ignoring isly's request, care to diagram this sentence structure and explain what it means? It's your statement after all:\n \n You can harp all you want but when you never win anything here and command the respect of those no one things is worth talking to, what does that say about you?\n\n \n No, it's a basic cost analysis. You have a long history of ignoring whatever you want and not reading links. Therefore, it is not worth my time to bother to research and post when I know you won't read them. It's really simple. Past performance predicts future performance. \n \n And you should be the last person talking about backing up claims with evidence. \n \n I'm ignoring her post when I haven't posted since she posted?\n \n By that logic you have ignored huge volumes of posts to you.\n \n How can you not understand what it means? \n \n You people b*tch all of the time, but few people respect you or consider your posts largely worthless. What does that say about you?", 
   {}, 
   307301, 
   null, 
   1207178040.0
  ], 
  [
   307310, 
   null, 
   "Archangel", 
   "No, it's a basic cost analysis. You have a long history of ignoring whatever you want and not reading links. Therefore, it is not worth my time to bother to research and post when I know you won't read them. \n\n \n yawn... Can your excuses get any weaker? After all, we're talking about a claim \"you made\" regarding the current political news of the past week or so, and I quote you directly: What is amusing is that Hagee's words for McCain haven't earned McCain anywhere near the #### that Obama's gotten. So tell me how much research is needed in order to support your alleged factual claim about the News regarding Mcains relationship with Hagee? Obviously your claim is without merit or surely you would support it by simply googling a link to an article that proves that Mcain had a relationship with Hagee. But there is in fact no long term relationship between them so your claim is as usual, a false one; and all of these childish claims that I wont read your evidence is as shallow as your debating style. But at least you're being consistent.", 
   {}, 
   307305, 
   null, 
   1207180140.0
  ], 
  [
   307355, 
   null, 
   "obvious_child", 
   "AA, let's look at it from my point of view:\n \n Why would I bother to go through the effort of finding multiple sources on what Hagee said and how McCain accepted and was appreciative of his support when you have a extremely long history of ignoring whatever you don't like and never ever ever opening any links given to you?\n \n What is there to suggest that you will suddenly change your behavior over night from one that completely ignores everything he doesn't like and doesn't read any links to one that actually reads what people write and opens links?", 
   {}, 
   307310, 
   null, 
   1207208160.0
  ], 
  [
   307375, 
   null, 
   "Archangel", 
   "AA, let's look at it from my point of view:\n Why would I bother to go through the effort of finding multiple sources on what Hagee said and how McCain accepted and was appreciative of his support when you have a extremely long history of ignoring whatever you don't like and never ever ever opening any links given to you?\n \n What is there to suggest that you will suddenly change your behavior over night from one that completely ignores everything he doesn't like and doesn't read any links to one that actually reads what people write and opens links?\n\n \n Who ever said that multiple sources are needed to support an allegation about current events child? This isn't rocket science we're debating here. And you made the claim yourself. If it was provable, you would surely support it with a link if you could. So stop blaming me for your inability to support your own unprovable claim, It makes you look incredibly weak.", 
   {}, 
   307355, 
   null, 
   1207235460.0
  ], 
  [
   309370, 
   null, 
   "bhbcu64", 
   "OK< Archie,\n \n How about this link:\n \n http://truth-about-mccain.blogspot.com/2008/03/bigtop-mccain-ally-held-slave-auction.html\n \n wherein McStain accepted with pleasure the endorsement of a \"pastor\" who had the temerity in the 21st Century to run a slave auction and who then gave the weasel apology, \"If anyone was offended, I apologize.\n \n This fool has all the tonal awareness of Alban Berg's Wozzek.", 
   {}, 
   307375, 
   null, 
   1208819580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Independents & Across the Aisle", 
  "url": "http://www.4forums.com/political/politics-debates/10953-independents-across-aisle.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 10953, 
  "discussion_files": [
   [
    "17573.html", 
    "http://www.4forums.com/political/politics-debates/10953-independents-across-aisle-print.html"
   ], 
   [
    "17574.html", 
    "http://www.4forums.com/political/politics-debates/10953-independents-across-aisle-2-print.html"
   ]
  ], 
  "identifier": 10953
 }
]