[
 [
  [
   302589, 
   null, 
   "electrolyte", 
   "T.Q posted a thread earlier that referenced a post where Archangel accused T.Q, me, and others of being dishonest.\n \n \nThis definition of trolling PERFECTLY defines the baiting, abuse, insults and accusations of running away from debates based on some perceived cowardice or fear by child, TQ, electrolyte and even Kronus, whenever I have attempted to walk away from debates with them because their methods are so dishonest.\n\n \n \n I challenge, for the umpteenth time, for Archangel to support his repeated assertions that I am dishonest. If I have been dishonest for even the smallest fraction of the instances that I've been accused of being dishonest, Archie should have no trouble posting multiple examples.", 
   {
    "post_info": {
     "post_title": "Put Up or Shut Up Time, part II"
    }
   }, 
   null, 
   null, 
   1203484080.0
  ], 
  [
   302621, 
   null, 
   "electrolyte", 
   "I challenge, for the umpteenth time, for Archangel to support his repeated assertions that I am dishonest.\n\n Despite the fact that Archangel has been on the forum and found the time to lie about my qualifications, insult my education, and (unsurprisingly) completely avoid the entire point of one of my posts, he has (for some inexplicable reason, of course) skipped this thread.", 
   {}, 
   302589, 
   null, 
   1203489720.0
  ], 
  [
   302639, 
   null, 
   "isly ilwott", 
   "Apparently, he is busy answering the others of your pack in the remaining seven attacks. No doubt there will be more. What a silly, childish bunch you atheists are.\n \n Of all the things to put on what should be a polite venue, admin chooses to create a hate forum. It may be good to draw all you children to the same spot, but it doesn't seem to keep you from ruining other forums so it really does no good.\n \n I noticed you gave him an hour an thirty-two minutes to respond before you became impatient. How kind of you!\n \n If you feel guilty about being silly, perhaps you can delete this whole thread like your childish friend did the one he got waxed in.", 
   {}, 
   302621, 
   null, 
   1203511200.0
  ], 
  [
   302645, 
   null, 
   "Archangel", 
   "Apparently, he is busy answering the others of your pack in the remaining seven attacks. No doubt there will be more. What a silly, childish bunch you atheists are.\n \n Of all the things to put on what should be a polite venue, admin chooses to create a hate forum. It may be good to draw all you children to the same spot, but it doesn't seem to keep you from ruining other forums so it really does no good.\n \n I noticed you gave him an hour an thirty-two minutes to respond before you became impatient. How kind of you!\n \n If you feel guilty about being silly, perhaps you can delete this whole thread like your childish friend did the one he got waxed in.\n\n \n Thanks for speaking up isly, but to think that lyte would do anything more mature than a middle schooler is hoping for the impossible. And just watch him have an embolism when I ignore this thread on principle. One must keep them wanting more or they'll just take me for granted. emoticon_xhoho Besides, I hate being redundant. \n \n Also, this forum is just an experiment. When admin sees that it has no effect on how these thugs negatively impact the other forums, he'll do the right thing.", 
   {}, 
   302639, 
   null, 
   1203513420.0
  ], 
  [
   302673, 
   null, 
   "Steeeeve", 
   "This is a proper use of this forum. \n \n Archangel, you will need to show specific examples of where those posters are being dishonest.", 
   {}, 
   302645, 
   null, 
   1203526920.0
  ], 
  [
   302766, 
   null, 
   "electrolyte", 
   "Apparently, he is busy answering the others of your pack in the remaining seven attacks.\n\n Yet he had plenty of time to respond to even my tangential points in other posts?\n \n \nNo doubt there will be more.\n\n Yes, if Archangel doesn't stop lying, there will undoubtedly be more demands that he put up or shut up.\n \n \nWhat a silly, childish bunch you atheists are.\n\n See Steeeeve's post.\n \n \nI noticed you gave him an hour an thirty-two minutes to respond before you became impatient. How kind of you!\n\n I've backed up Archangel before when I felt that his silence was highlighted prematurely. The fact that Archangel was crawling the forums making plenty of posts and then disappeared without addressing mine elicited this comment, and it seems to me to be perfectly justified.\n \n \nIf you feel guilty about being silly, perhaps you can delete this whole thread like your childish friend did the one he got waxed in.\n\n If I was actually being silly, perhaps I'd feel guilty. Fortunately for me, that's not a problem.\n \n \nThanks for speaking up isly, but to think that lyte would do anything more mature than a middle schooler is hoping for the impossible.\n\n But isly calls me immature...\n \n \nAnd just watch him have an embolism when I ignore this thread on principle.\n\n So when other people accuse him of lying, Archangel jumps right in. When I demand that he back up his accusations of my dishonesty, he has a sudden bout of \"principle\" that keeps him from posting in the thread...\n Except that he does post in the thread. And accuses me of immaturity. And doesn't back up his accusations of my dishonesty. Must be that \"principle.\"\n \n \nBesides, I hate being redundant.\n\n It would only be redundant, Archie, if you had ever before shown where I have lied.\n \n \nAlso, this forum is just an experiment. When admin sees that it has no effect on how these thugs negatively impact the other forums, he'll do the right thing.\n\n Yeah, I don't think it'll do much either when the accusee plays the \"I have so much principle that I refuse to support my lies about somebody else's dishonesty\" card.\n \n \nThis is a proper use of this forum. \n \n Archangel, you will need to show specific examples of where those posters are being dishonest.\n\n Steeeeve, what if he refuses to do so?", 
   {}, 
   302673, 
   null, 
   1203561120.0
  ], 
  [
   302768, 
   null, 
   "admin", 
   "\n Steeeeve, what if he refuses to do so?\n\n \n Then you win and he shouldn't call you dishonest any more and you will stop bringing it up.\n \n admin", 
   {}, 
   302766, 
   null, 
   1203561960.0
  ], 
  [
   302774, 
   null, 
   "electrolyte", 
   "Then you win and he shouldn't call you dishonest any more and you will stop bringing it up.\n \n admin\n\n And if he doesn't stop calling me dishonest?", 
   {}, 
   302768, 
   null, 
   1203562920.0
  ], 
  [
   302777, 
   null, 
   "admin", 
   "And if he doesn't stop calling me dishonest?\n\n \n I will warn him, and let him know that he has to stop or prove the accusation. If he continues doing it, I will eventually ban him. Hopefully this will not happen. My goal is to eliminate the accusations, and just have friendly debates. We will seldom change our opponents mind. But we might convince some of the people who read these debates and I believe a friendly discourse is usually more persuasive.", 
   {}, 
   302774, 
   null, 
   1203564480.0
  ], 
  [
   302835, 
   null, 
   "obvious_child", 
   "I will warn him, and let him know that he has to stop or prove the accusation. If he continues doing it, I will eventually ban him. Hopefully this will not happen. My goal is to eliminate the accusations, and just have friendly debates. We will seldom change our opponents mind. But we might convince some of the people who read these debates and I believe a friendly discourse is usually more persuasive.\n\n \n This is unlikely with serial users of dishonesty, particularly with those who refuse to fact check or bother to actually read what people write. I will keep reporting every instance where AA makes a accusation against someone without any evidence.", 
   {}, 
   302777, 
   null, 
   1203576540.0
  ], 
  [
   303017, 
   null, 
   "marc9000", 
   "I will warn him, and let him know that he has to stop or prove the accusation. If he continues doing it, I will eventually ban him. Hopefully this will not happen. My goal is to eliminate the accusations, and just have friendly debates. We will seldom change our opponents mind. But we might convince some of the people who read these debates and I believe a friendly discourse is usually more persuasive.\n\n \n This liar's corner sure is a hot place, but it may be accomplishing your goal partly, by channeling the heat here, and partially taking it out of the other forums. I have another idea for another forum that could accomplish that goal too, for what it's worth. It could be a more general forum than this one, (not necessarily a replacement, just a supplement) to settle disputes, structured, yet non judged and non formal? Maybe another place to channel some of the nastiness? \n \n My suggestion would be for one person to challenge another (any subject - something they got into in one of the regular forums) and have a limited, one on one exchange about it. 3, 4, or 5 posts each, maybe 1000 or 1500 words maximum. (subject to changes if both parties agree) No time limits or any other special rules - just let them go at it then close it after the 6th, 8th, or 10th post. No other posters allowed. Possibly a one or two week limit - if one of them seems to have abandoned it, it could be closed as well. Or it could be prematurely closed by moderation if it got too nasty, with a note by moderation of which of the two caused it to be closed. Then any reader of it could make up their own mind about which one of them made the best points. \n \n Just a thought - would probably need a few more details figured out.", 
   {
    "unicode_changes_made": true
   }, 
   302777, 
   null, 
   1203650580.0
  ], 
  [
   303018, 
   null, 
   "marc9000", 
   "This is unlikely with serial users of dishonesty, particularly with those who refuse to fact check or bother to actually read what people write. I will keep reporting every instance where AA makes a accusation against someone without any evidence.\n\n \n Have you ever had a long, friendly, respectable debate here, with anyone you disagreed with? \n \n Here are three of mine;\n \n My opponent was jaxian\n \n My opponent was zachvac\n \n My opponent was Another Opinion\n \n People I disagreed with, that I debated back and fourth with for anywhere from 9 to about 15 or more posts each time, and we never got nasty with each other. I could probably find several more. \n \n Have you ever done that once?", 
   {}, 
   302835, 
   null, 
   1203651480.0
  ], 
  [
   303019, 
   null, 
   "admin", 
   "My suggestion would be for one person to challenge another (any subject - something they got into in one of the regular forums) and have a limited, one on one exchange about it. 3, 4, or 5 posts each, maybe 1000 or 1500 words maximum. (subject to changes if both parties agree) No time limits or any other special rules - just let them go at it then close it after the 6th, 8th, or 10th post. No other posters allowed. Possibly a one or two week limit - if one of them seems to have abandoned it, it could be closed as well. Or it could be prematurely closed by moderation if it got too nasty, with a note by moderation of which of the two caused it to be closed. Then any reader of it could make up their own mind about which one of them made the best points. \n \n Just a thought - would probably need a few more details figured out.\n\n \n I like the idea, anybody got any ideas for rules to control it?", 
   {
    "unicode_changes_made": true
   }, 
   303017, 
   null, 
   1203651480.0
  ], 
  [
   303023, 
   null, 
   "Archangel", 
   "Have you ever had a long, friendly, respectable debate here, with anyone you disagreed with? \n \n Here are three of mine;\n \n My opponent was jaxian\n \n My opponent was zachvac\n \n My opponent was Another Opinion\n \n People I disagreed with, that I debated back and fourth with for anywhere from 9 to about 15 or more posts each time, and we never got nasty with each other. I could probably find several more. \n \n Have you ever done that once?\n\n \n And Peeling and I had 2 separate respectable debates going in the evolution forum before both of them were hijacked and derailed by the same gang.", 
   {}, 
   303018, 
   null, 
   1203651960.0
  ], 
  [
   303042, 
   null, 
   "electrolyte", 
   "Archangel has recently reaffirmed his accusation that I am dishonest and a liar:\n \n \nYet he [electrolyte] constantly complains that I am calling him names without cause.\n\n \nIs this a denial that you call me dishonest, a liar, a hack, a presumptuous spaz, immoral, and a fraud? [bold added]\n\n \nOf course it isn't a denial, I have told the truth about you ...\n\n \n Archangel has said that he refuses to participate in this thread due to principle, but he is participating in this thread. Futhermore, any alleged principle would have Archangel either not calling honest posters liars or would have Archangel supporting his accusation.\n \n I therefore reintroduce my challenge to Archangel to support his accusation that I am dishonest and a liar.\n \n How many times is a poster allowed to make accusations while refusing to support them?", 
   {}, 
   303023, 
   null, 
   1203659220.0
  ], 
  [
   303052, 
   null, 
   "Archangel", 
   "OK lyte, have it your way. you want proof that you're a blatant and unapologetic liar? Here you go.\n \n Here you are lying by attacking my intelligence as usual, as your only method of responding to my post.\n http://www.4forums.com/political/showpost.php?p=303034&postcount=11\n \n Here, you produce no evidence of anything but again lie about me by attacking my intelligence and the validity of my questions about the obvious holes in the age of the Universe. The complete substance of you post is to attack and insult while contributing absolutely nothing of substance at all to the debate.\n http://www.4forums.com/political/showpost.php?p=301147&postcount=172\n \n Here you lie as you attack both marc and me for our, and I quote: \nmarc and Archie flail their lies and slander left and right with no penalty seems pretty silly.\n\n \n And here is the greatest lie of all of them as it reveals that you have never, and will never EVER admit that you are wrong in any way, shape or form. You are too egomaniacal and self important to admit you are spewing irrelevant horse dung most of the time. But we are always wrong and ignorant. \n \nmarc refuses to defend his points because there are \"seven rabid atheists\" that disagree with him, but if his points were any good, he could kick the asses of seven people instead of just one.\n\n http://www.4forums.com/political/showpost.php?p=300420&postcount=65\n \n So debating with you isn't debating at all. It is first and formost defending ones intelligence against the attacks on it by an insecure, overpaid school teacher who think a BS is anything more than a degree in BS which you prove every single time you must try to win a debate by insulting the oppositions intelligence rather than just producing evidence that proves your point.\n \n But we debate evolution all the time, and you know you can't prove any of it at all so your only tack is to silence the opposition by tearing them down and driving them off. Yet when you get asked questions you can't answer, you run away like a scared little girl. Only I never chase after you accusing you or your buddies of being afraid and running away. Here'a a question that you, child, TQ and kronus have all run away from, so I'll ask again:\n  Also, I just recently asked the whole bunch of you how you can claim so adamantly that the so called primate/hominid fossils such as Lucy, Peking, Java and Neanderthal MAN are related to modern man because of genetic markers that evolutionists claim is evidence of our biological kinship, when chimps share 98% of our DNA, and are contemporary to us currently so we can observe first hand how inferior they are to us in all aspects of intelligence, imagination, creativity and reason. Not one of you dealt with that question at all in a rational way. you all completely evaded even touching it even though I reposted it repeatedly.\n \n So stop running away lyte and explain this inconsistency that completely nullifies all of the assumptive evidence that evolutionists claim the genetic markers in hominid fossils as evidence that we are direct descendants of them.", 
   {}, 
   303042, 
   null, 
   1203662880.0
  ], 
  [
   303059, 
   null, 
   "T.Q", 
   "Here'a a question that you, child, TQ and kronus have all run away from, so I'll ask again:\n  Also, I just recently asked the whole bunch of you how you can claim so adamantly that the so called primate/hominid fossils such as Lucy, Peking, Java and Neanderthal MAN are related to modern man because of genetic markers that evolutionists claim is evidence of our biological kinship, when chimps share 98% of our DNA, and are contemporary to us currently so we can observe first hand how inferior they are to us in all aspects of intelligence, imagination, creativity and reason. Not one of you dealt with that question at all in a rational way. you all completely evaded even touching it even though I reposted it repeatedly.\n \n So stop running away lyte and explain this inconsistency that completely nullifies all of the assumptive evidence that evolutionists claim the genetic markers in hominid fossils as evidence that we are direct descendants of them.\n\n \n \n Where did you ask this question? Because I recently answered one very similar to this, to which you never responded.", 
   {}, 
   303052, 
   null, 
   1203665520.0
  ], 
  [
   303072, 
   null, 
   "electrolyte", 
   "I'll address this post in two sections: A) my alleged lying, and B) the charge that I don't support my points.\n \n Part A:\n \nHere you are lying by attacking my intelligence as usual, as your only method of responding to my post.\n \n ... \n \n Here, you ... again lie about me by attacking my intelligence and the validity of my questions about the obvious holes in the age of the Universe.\n\n \"Attacking\" one's intelligence is not a lie. You called me both dishonest and a liar, so you need to show where I have been dishonest or lying; that means you need to show where I knowingly presented false information as if it were true. Highlighting the ignorance shown by your statements is not lying.\n \n \nHere you lie as you attack both marc and me for our, and I quote: \n \nOriginally Posted by electrolyte\n marc and Archie flail their lies and slander left and right with no penalty seems pretty silly.\n\n\n See above. Also note how you've ripped this phrase out of the complete sentence.\n \n \nAnd here is the greatest lie of all of them as it reveals that you have never, and will never EVER admit that you are wrong in any way, shape or form. You are too egomaniacal and self important to admit you are spewing irrelevant horse dung most of the time. But we are always wrong and ignorant. \nmarc refuses to defend his points because there are \"seven rabid atheists\" that disagree with him, but if his points were any good, he could kick the asses of seven people instead of just one.\n\n\n And how is this a lie? Do you deny that marc could win the argument by using good points to dispel the allegedly bad ones?\n This is \"the greatest lie of all of them,\" but it's not even a lie. In fact, any experienced debater will confirm that this is true.\n \n I maintain that Archangel has not shown a single instance of my lying or dishonesty. His \"greatest\" example by his own designation is a well-known tenet of debate.\n \n Part B:\n \nHere, you produce no evidence of anything... The complete substance of you post is to attack and insult while contributing absolutely nothing of substance at all to the debate.\n\n It is true that I technically produce no \"evidence\" in this post. However, I expose the hypocrisy of Archangel's argument, I provide information that Archangel clearly did not previously know (coincidentally, I left the negative sign off of the exponent in Planck time, which is 10^-43 seconds after singularity), and I expose the hypocrisy and wishful thinking of his other argument regarding unknown variables. The post is extremely substantive, and Archangel made no subsequent request that I provide sources for my claim about Planck time. (In fact, one will note that Archangel didn't respond to any of my points from this post.) I could do that now if you'd like, Archie, but you'd have to ask. Of course, a quick Google search will save you the bother of having such a challenge -- one based on your unfamiliarity with science -- rebounded back at you with massive support, but that's still your call.\n \n \nyou have never, and will never EVER admit that you are wrong in any way, shape or form. You are too egomaniacal and self important to admit you are spewing irrelevant horse dung most of the time.\n\n If this were true, why can't you show why my statements are wrong? Can you show that your \"you can't give an exact number, and you can't give a range either\" approach isn't hypocritical? Can you show that your \"there are unknown variables that nobody knows, but I know that they have certain effects\" argument isn't both hypocritical and completely devoid of evidence?\n \n \nSo debating with you isn't debating at all. It is first and formost defending ones intelligence against the attacks on it by an insecure, overpaid school teacher who think a BS is anything more than a degree in BS which you prove every single time you must try to win a debate by insulting the oppositions intelligence rather than just producing evidence that proves your point.\n\n Here's an idea: How about you try posting evidence for me to thrash instead of insisting that you're entitled to post your opinion and get all ticked off when someone makes you look foolish?\n \n \nBut we debate evolution all the time, and you know you can't prove any of it at all so your only tack is to silence the opposition by tearing them down and driving them off.\n\n What was the last substantive thing you posted about evolution? Link us, please.\n \n \nHere'a a question that you, child, TQ and kronus have all run away from, so I'll ask again:\n [snip]\n\n Peeling addressed your basic concern sufficiently.\n \n But just so we're clear:\n \n Also, I just recently asked the whole bunch of you how you can claim so adamantly that the so called primate/hominid fossils such as Lucy, Peking, Java and Neanderthal MAN are related to modern man because of genetic markers that evolutionists claim is evidence of our biological kinship...\n\n This is new to me. Show me the scientific sources that conclude that Lucy is related to modern man \"because of genetic markers.\" Then show me the scientific sources that say we are \"direct descendants of them\" as you claim below.\n \n \nSo stop running away lyte and explain this inconsistency that completely nullifies all of the assumptive evidence that evolutionists claim the genetic markers in hominid fossils as evidence that we are direct descendants of them.\n\n You have a strange definition of running away. In case you didn't notice, I'm addressing your allegations, challenging your assertions, questioning your reasoning, and demanding a response.", 
   {}, 
   303052, 
   null, 
   1203671760.0
  ], 
  [
   303108, 
   null, 
   "Archangel", 
   "I'll address this post in two sections: A) my alleged lying, and B) the charge that I don't support my points.\n \n Part A:\n \n \"Attacking\" one's intelligence is not a lie. You called me both dishonest and a liar, so you need to show where I have been dishonest or lying; that means you need to show where I knowingly presented false information as if it were true. Highlighting the ignorance shown by your statements is not lying.\n\n \n Regarding the bolded: Sure it is; when that person is a College Graduate just as you are. Only with a different major. You have lied about my intelligence on almost every single response you have ever made to me on this forum. And you have slandered and defamed me in the process also. We both give our opinions most of the time, but according to you, my opinions are steeped in ignorance while yours are spot on and based in understanding and insight. \n \n And yet I disagree with pretty much every scientific assumption you make and see them as infantile in their depth of understanding. But that doesn't stop you from claiming victory at every turn when none of your conclusions can actually be proven at all.\n \n \nSee above. Also note how you've ripped this phrase out of the complete sentence.\n\n \n http://www.4forums.com/political/showpost.php?p=300420&postcount=65\n And yet I posted the link so all could check the context themselves didn't I! Why have you failed to carry the links I gave you over to your explanation, in order to allow people to check your answers with the original links used to make the accusations? Why do you make it harder to confirm your answers, yet you accuse me of taking statements out of context when I gave the links to support my allegations? Which one of us is being honest and which one is being their usual deceitful manipulator?\n \n \nAnd how is this a lie? Do you deny that marc could win the argument by using good points to dispel the allegedly bad ones?\n This is \"the greatest lie of all of them,\" but it's not even a lie. In fact, any experienced debater will confirm that this is true.\n\n \n Of course I deny that. In every debate I have read between you and mark I have seen the same exact cowardly tactics by you of attacking marcs intelligence and JUST DISMISSING HIS POINTS MADE WHILE IGNORING THE MEAT OF HIS ARGUMENTS COMPLETELY. Then in typical fashion you respond with your OPINION which is supposed to be accepted as fact. It leaves me totally incredulous and mind numbed that you get away with such dishonest debating tactics for so long without being banned.\n \n \nI maintain that Archangel has not shown a single instance of my lying or dishonesty. His \"greatest\" example by his own designation is a well-known tenet of debate.\n\n \n Of course you maintain that. Because you have no sense of honor or fair play. You have no concept of actually dealing honestly with your opposition. You can't see that calling a person who has single handedly stood up against multiple posters en-masse in numerous debates and not getting driven off or intimidated by you is a sign of intelligence and confidence in his beliefs. You have no respect for someone who has a different World view than you but is so insecure in your beliefs that you feel obligated to not just exchange ideas but you must destroy, insult, attack, degrade and drive off that opponent. For a so called self described expert in the sciences, you don't represent a teachers attitude or character very well at all. You act more like an 8th grader who must scream that he is right all the time while insisting that everyone else is wrong and stupid like DANE does in almost every post of his. \n \n I'll deal with part B on the next post:", 
   {}, 
   303072, 
   null, 
   1203702900.0
  ], 
  [
   303117, 
   null, 
   "Penfold", 
   "While attacking another's intelligence may be rude, a slur, or an insult, it is not a lie per se.", 
   {}, 
   303108, 
   null, 
   1203704820.0
  ], 
  [
   303130, 
   null, 
   "Archangel", 
   "Part B:\n \n \nIt is true that I technically produce no \"evidence\" in this post. However, I expose the hypocrisy of Archangel's argument, I provide information that Archangel clearly did not previously know (coincidentally, I left the negative sign off of the exponent in Planck time, which is 10^-43 seconds after singularity), and I expose the hypocrisy and wishful thinking of his other argument regarding unknown variables.\n \n \n Here is more evidence of your corrupted debating style, and how you rely on bait and switch methods in order to feel like you're winning something. Here is the link to my answer to CxT where I crushed her claim with a solid link than answered her directly that in fact science has no such date that the big bang happened down to the billions of a second, but in fact allows for as large as a 10 billion year gap as to when it occurred.\n \n http://www.4forums.com/political/showpost.php?p=300903&postcount=137\n \n http://www.4forums.com/political/showpost.php?p=301147&postcount=172\n \n \nThe post is extremely substantive, and Archangel made no subsequent request that I provide sources for my claim about Planck time. (In fact, one will note that Archangel didn't respond to any of my points from this post.) I could do that now if you'd like, Archie, but you'd have to ask. Of course, a quick Google search will save you the bother of having such a challenge -- one based on your unfamiliarity with science -- rebounded back at you with massive support, but that's still your call.\n\n \n That's because your response was a complete corruption of what I was discussing with CxT and it was nothing more than a derailment based, once again on your opinion with no supporting evidence. Why must I ask for supporting evidence to your ridiculous assertions after the fact all the time? Why don't you support your claims at the time that you make them? Is that proper debating etiquette? Of course it isn't. But you only bring that up where you feel it applies to the opposition. \n \n I have provided the links above to support my arguments, yet you just got through condemning me again with insults to my intelligence, your personal claims of victory once again based on nothing more than your own inflated opinion of yourself. In what world is that evidence of anything? Now in your shallow response to me, this part of my statement would be completely edited out as would any other evidence I produced to support my claims. Just as you edited out the 3 links I posted which you responded to by editing them out also.\n \n \nIf this were true, why can't you show why my statements are wrong? Can you show that your \"you can't give an exact number, and you can't give a range either\" approach isn't hypocritical? Can you show that your \"there are unknown variables that nobody knows, but I know that they have certain effects\" argument isn't both hypocritical and completely devoid of evidence?  \n\n \n You just don't get it do you lyte. I show evidence in debates that support my beliefs. But you disregard it and insult it as foolishness or fraudulent or just seeped in ignorance. While your evolution evidence is flawless reasoning in your opinion. Regarding the bolded, You just prove how ignorant you are in reality in spite of your claims that you're some scientific prodigy. Here are a few paragraphs that show more unknown variables than I was willing to count for this post. But you can if you like. It's a scientific source, not a christian link at all so forget that attack angle. But it shows just how little is actually known about the big bang while making the same claims you will undoubtedly agree with.\n \n http://rds.yahoo.com/_ylt=A0geu5DD_75HhigApVhXNyoA;_ylu=X3oDMTFhc29jcGc5BHNlYwNzcgRwb3MDMwRjb2xvA2FjMgR2dGlkA1BSMDIwXzEyNgRsA1dTMQ--/SIG=1293npi33/EXP=1203786051/**http%3a//library.thinkquest.org/27930/bigbangtheory.htm\n \n THE BIG BANGIntroduction\n The Big Bang theory is the currently accepted scientific theory of the beginning of the universe. According to the classic Big Bang theory (newer, more exotic ideas can be found in Theoretical Cosmology), the universe was once condensed into a single ball of matter that had a size of zero, defined to be a point, and infinite density and temperature. Because of these properties, the currently known laws of the physical universe break down at this point, called a singularity because no known laws explain it. For unknown reasons, this singularity began to expand some 10-20 billion years ago. The groundwork for the Big Bang theory was laid by Einstein's theory of general relativity. The greatest evidence for it was revealed by Edwin Hubble, who discovered in 1929 that all galaxies have a red shift (See The Doppler Effect) and are moving away from each other. Moreover, the galaxies' motion indicated that the universe was expanding uniformly. From this idea came the thought that all the matter currently in the universe was once condensed into a small hot ball of matter and has since expanded at an exponential rate. Though scientists have not yet worked out all the details of the theory, its basic tenets are generally accepted.\n \n The Basic Theory\n \n According to the classic Big Bang theory, the universe began, as stated above, as a small, hot, dense ball of primordial matter. Some event then caused this ball of matter to suddenly expand at an incredible rate of speed. The four fundamental forces at that time were merged into one (the theory of which is still being researched) and later separated into the familiar gravity, electromagnetic force, strong nuclear force, and weak nuclear force (See The Four Fundamental Forces). As the universe expanded and cooled, gravity was able to exert its force, causing particles to be attracted to one another. These \"clumps\" of matter were the predecessors of today's galaxies, which later subdivided into the traditional cosmological structures of stars, planets, and the like. It is worth noting that there is another, smaller school of thought that believes smaller cosmological structures developed first and then congregated into the larger structures of galaxies. This is called the bottom-up school; the more generally accepted first idea is called the top-down school. There are many variations on the Big Bang theory other than those listed here, and scientists are still divided about which if any correctly explains the universe. The most likely of these variations will be discussed in Theoretical Cosmology.\n \n The Early Universe\n \n Controversy rages about the exact nature of the universe in the first few seconds after the Big Bang. However, certain aspects are agreed upon by most physicists. The \"stuff\" of the Big Bang is thought to be mainly elementary particles. One second after the Big Bang, the universe is thought to have cooled from infinite temperature to about ten thousand million degrees K. At this point it would have contained mainly photons, electrons, neutrinos, and their antiparticles, along with some protons and neutrons. In addition, these particles would have been so energetic that they could avoid attraction to each other due to the four fundamental forces. They are also likely to have collided with such force that particle/antiparticle pairs were produced more rapidly than they would be annihilated.\n \n Once the universe cooled off more, however, changes would occur rapidly. Particle/antiparticle pairs would be created much less often due to lower collision energies, and eventually the rate of annihilation would be greater than the rate of creation. Also, as previously mentioned, the four forces would \"crystallize\" into their familiar forms and give rise to ever-increasing attractions between particles, which were then moving slowly enough to be affected by such forces. Nevertheless, virtually massless neutrinos would not have annihilated each other because of their very weak interactions. The detection of these neutrinos, left over from the Big Bang, would not only reconfirm the Big Bang theory but also provide important insight into the exact mass of neutrinos and their contribution to the total density of the universe.\n \nHere's an idea: How about you try posting evidence for me to thrash instead of insisting that you're entitled to post your opinion and get all ticked off when someone makes you look foolish?\n\n \n This tact isn't going to work either lyte, because anyone reading these debates will see that I have two main techniques for beating you evos; one is the links I use to support my claims, and 2 is the questions I ask that because you can't answer them, you attack me as ignorant for asking them. Just as you did above regarding the 10 billion year gap given for when the big bang actually occurred. And this scientific link also speaks to the 10 billion years gap as to when the big bang actually occurred. So what is this cr*p of yours about 10<43rd as to the second it occurred? It is your pseudo intellectual, self important attempt at sounding smart when you don't really even know what you're talking about. So these three posts are convincing evidence of your lies, obfuscation and dishonest way of responding to, and allegedly debating issues which you control by using bait and switch methods that are meant to confuse and change the subject rather than actually respond to the questions being asked of you. That is the definition of lying, and you epitomize it. \n \n I will complete answering these on another post", 
   {}, 
   303108, 
   null, 
   1203707160.0
  ], 
  [
   303136, 
   null, 
   "T.Q", 
   "So what is this cr*p of yours about 10<43rd as to the second it occurred? It is your pseudo intellectual, self important attempt at sounding smart when you don't really even know what you're talking about.\n\n \n \n Actually, right there you show your ignorance of what Electrolyte is talking about. No where did he claim we know down to 10 -43 seconds when the big bang occured. He said, and everyone else has said, that we know down to 10 -43 seconds what occured.", 
   {}, 
   303130, 
   null, 
   1203708300.0
  ], 
  [
   303138, 
   null, 
   "Penfold", 
   ".... And redebating the argument does nothing to clarify the complaint.", 
   {}, 
   303136, 
   null, 
   1203710220.0
  ], 
  [
   303141, 
   null, 
   "Archangel", 
   "PART B CONTINUED\n \n \nWhat was the last substantive thing you posted about evolution? Link us, please.\n\n \n Why am I not surprised that you wouldn't have a clue. How bout this question you're currently ignoring once again?\n \n \nPeeling addressed your basic concern sufficiently.\n\n \n Uh, no he didn't. he kept saying he would get back to it but you and your gang of thugs derailed the thread before that happened. Which you and your gang did to the previous attempt me and Peeling made at having a polite and respectful debate.\n \n \nBut just so we're clear:\n \n This is new to me. Show me the scientific sources that conclude that Lucy is related to modern man \"because of genetic markers.\" Then show me the scientific sources that say we are \"direct descendants of them\" as you claim below.\n\n \n Are you kidding me??? It's your sides claim, are you now denying Lucy's importance as a link in human evolution? Then why did Pandion say that going to the Houston exhibit was on par with having the best sex in his life it was so important an experience? \n \n And thanks for again revealing your typical style of obfuscation as you ignore the meat of my question by focusing on a side issue that has nothing to do with the larger issue. That just shows that you can't deal with the actual question being asked so you avoid it by changing the subject. That is what I mean when I refer to your cowardly way of debating.\n \n \nYou have a strange definition of running away. In case you didn't notice, I'm addressing your allegations, challenging your assertions, questioning your reasoning, and demanding a response.\n\n \n NO YOUR NOT ADDRESSING MY ALLEGATIONS, NOR DID YOU AT ALL. You haven't addressed any aspect of my question, which was this: \n Also, I just recently asked the whole bunch of you how you can claim so adamantly that the so called primate/hominid fossils such as Lucy, Peking, Java and Neanderthal MAN are related to modern man because of genetic markers that evolutionists claim is evidence of our biological kinship, when chimps share 98% of our DNA, and are contemporary to us currently so we can observe first hand how inferior they are to us in all aspects of intelligence, imagination, creativity and reason. Not one of you dealt with that question at all in a rational way. you all completely evaded even touching it even though I reposted it repeatedly.\n So you see lyte, there is nothing honest or intelligent about your responses to my posts. You claim victory while proving nothing at all, and you insist how ignorant I am when i at least support my assertions with links which you promptly either completely ignore or disregard as stupid. You demand a response while never having answered any of my arguments at all. You will even disregard the scientific link above because it opposes your inane responses to my prior posts which I have supported here. So by what standard of debating are any of your tactics valid or edifying to this forum?\n \n How are your pompous, sanctimonious and ego maniacal responses that you make which are nothing more that you insisting how smart you are add anything real to debates? Other than allow you to falsely believe you are winning something when all you're doing is insulting the opposition that you have no clue as to how to actually answer them. That is the definition of intellectual cowardice lyte. never actually responding honestly while diverting from the meat of an issue while attacking the oppositions intelligence and sources at every single turn. Such is the methodology of you and your gang of thugs who do nothing but disrupt this forum.", 
   {}, 
   303130, 
   null, 
   1203711120.0
  ], 
  [
   303142, 
   null, 
   "Archangel", 
   "Actually, right there you show your ignorance of what Electrolyte is talking about. No where did he claim we know down to 10 -43 seconds when the big bang occured. He said, and everyone else has said, that we know down to 10 -43 seconds what occured.\n\n \n Tomato, tomatoe... And beside that, is it absolutely impossible for you to keep your nose out of a debate on this forum that is between two other members? Must you guys always try to gang up on a lone poster who is facing just one of you? And if you want to get real about this, you are again focussing on minutia rather than the meat of the issue being debated by us. The fact is that CxT made that precise claim and that is what I was responding to.", 
   {}, 
   303136, 
   null, 
   1203711720.0
  ], 
  [
   303143, 
   null, 
   "Archangel", 
   ".... And redebating the argument does nothing to clarify the complaint.\n\n \n Yes it does troll, as it clarifies his dishonest style of debating. But why would I expect you to get that.", 
   {}, 
   303138, 
   null, 
   1203712080.0
  ], 
  [
   303144, 
   null, 
   "T.Q", 
   "Tomato, tomatoe... \n\n The difference between \"what\" and \"when\" is a little more significant than that.\n \n \nAnd beside that, is it absolutely impossible for you to keep your nose out of a debate on this forum that is between two other members?\n\n I was trying to point out where your error had been made, as you and Electrolyte are speaking at cross purposes here.\n \n \nMust you guys always try to gang up on a lone poster who is facing just one of you?\n\n Who's ganging up? I'm pointing out that you are arguing against something that no one has ever stated.\n \n \nAnd if you want to get real about this, you are again focussing on minutia rather than the meat of the issue being debated by us.\n\n If you aren't even arguing against what is stated, the \"meat\" of the argument makes no difference. How is anyone supposed to know what you're talking about when you aren't addressing what is actually said? That is the exact problem here:\n \nQuote:\n But just so we're clear:\n \n This is new to me. Show me the scientific sources that conclude that Lucy is related to modern man \"because of genetic markers.\" Then show me the scientific sources that say we are \"direct descendants of them\" as you claim below. \n \n \n Are you kidding me??? It's your sides claim, are you now denying Lucy's importance as a link in human evolution? Then why did Pandion say that going to the Houston exhibit was on par with having the best sex in his life it was so important an experience? \n\n No one has claimed that genetic markers identify Lucy as an ancestor of modern man. And no one has claimed that we are direct decendants of the hominids you listed. This is the source of many of your problems: You don't actually read what is written, but read your assumptions into it.\n \n \nThe fact is that CxT made that precise claim and that is what I was responding to.\n\n Who is CxT, and where was this claim made?\n \n If you want to continue arguing against claims no one ever made, go hard. But don't be surprised when people roast you for it.", 
   {}, 
   303142, 
   null, 
   1203712320.0
  ], 
  [
   303146, 
   null, 
   "Archangel", 
   "The difference between \"what\" and \"when\" is a little more significant than that.\n \n \n I was trying to point out where your error had been made, as you and Electrolyte are speaking at cross purposes here.\n \n \n Who's ganging up? I'm pointing out that you are arguing against something that no one has ever stated.\n \n \n If you aren't even arguing against what is stated, the \"meat\" of the argument makes no difference. How is anyone supposed to know what you're talking about when you aren't addressing what is actually said? That is the exact problem here:\n \n No one has claimed that genetic markers identify Lucy as an ancestor of modern man. And no one has claimed that we are direct decendants of the hominids you listed. This is the source of many of your problems: You don't actually read what is written, but read your assumptions into it.\n \n \n Who is CxT, and where was this claim made?\n \n If you want to continue arguing against claims no one ever made, go hard. But don't be surprised when people roast you for it.\n\n \n By making such adament statements of fact against my arguments, wont I be proving you a liar by exposing what you said is a lie? And this happens in every debate with you guys. We never get to the meat because you insist on obfuscating with minutia. Here is the link for you:\n \n http://www.4forums.com/political/showpost.php?p=300896&postcount=135\n \n And her statement:\n \nWe can determine the history of the Universe down to one hundred thousand million billion billion billionth of a second from the beginning. \n\n \n So who is lying again TQ? And who is misrepresenting what was said TQ? Is it YOU!!!, or me. \n \n So why don't you deal with your own debates with me on this forum and let your boyfriend defend himself? I have posted links to support my contentions and see no reason to repeat myself for you. I'm already going to have to do that for lyte as he will be reacting like a caged rattlesnake as it is. So butt out TQ, obviously this debate is beyond you to comprehend.", 
   {}, 
   303144, 
   null, 
   1203713280.0
  ], 
  [
   303147, 
   null, 
   "Archangel", 
   "\n Also, I just recently asked the whole bunch of you how you can claim so adamantly that the so called primate/hominid fossils such as Lucy, Peking, Java and Neanderthal MAN are related to modern man because of genetic markers that evolutionists claim is evidence of our biological kinship, when chimps share 98% of our DNA, and are contemporary to us currently so we can observe first hand how inferior they are to us in all aspects of intelligence, imagination, creativity and reason. Not one of you dealt with that question at all in a rational way. you all completely evaded even touching it even though I reposted it repeatedly.\n \nWhere did you ask this question? Because I recently answered one very similar to this, to which you never responded.\n\n \n Care to post a link to the question and your answer that shows the time and date that you answered it?", 
   {}, 
   303059, 
   null, 
   1203713460.0
  ], 
  [
   303151, 
   null, 
   "Kronus", 
   " Care to post a link to the question and your answer that shows the time and date that you answered it?\n\n \n You first. You claim to have already asked it; show us where?", 
   {}, 
   303147, 
   null, 
   1203714540.0
  ], 
  [
   303154, 
   null, 
   "T.Q", 
   "By making such adament statements of fact against my arguments, wont I be proving you a liar by exposing what you said is a lie? And this happens in every debate with you guys. We never get to the meat because you insist on obfuscating with minutia. Here is the link for you:\n \n http://www.4forums.com/political/showpost.php?p=300896&postcount=135\n \n And her statement:\n \n \n So who is lying again TQ? And who is misrepresenting what was said TQ? Is it YOU!!!, or me. \n \n So why don't you deal with your own debates with me on this forum and let your boyfriend defend himself? I have posted links to support my contentions and see no reason to repeat myself for you. I'm already going to have to do that for lyte as he will be reacting like a caged rattlesnake as it is. So butt out TQ, obviously this debate is beyond you to comprehend.\n\n \n Your questions regarding my intelligence and sexuality aside, it seems to me we have another misunderstanding here. I read that to mean exactly what I stated above. You read it to mean what you stated above. Why don't you ask CxT to clarify for you instead of declaring that your interpretation is the correct one and we are all liars?\n \n \nQuote:\n Originally Posted by T.Q \n Where did you ask this question? Because I recently answered one very similar to this, to which you never responded. \n \n \n Care to post a link to the question and your answer that shows the time and date that you answered it?\n\n As Kronus said, could you please post a link to the post and thread in question? You asked a very similar question as to how we can consider H. Neanderthalensis to be a \"man\", which I answered Here.\n \nQuote:\n then justify why Neanderthals are men, WITH EVIDENCE. And good luck proving it. \n \n Art, burial rites, complex social structures, familial bonds, technology, morphology.\n Yeah, you'll want links. Read up on H. Neanderthalensis. All common knowledge. Try here first: Archie's handy-dandy research site so he doesn't embarass himself further.\n", 
   {}, 
   303146, 
   null, 
   1203715020.0
  ], 
  [
   303155, 
   null, 
   "Penfold", 
   "Yes it does troll, as it clarifies his dishonest style of debating. But why would I expect you to get that.\n\n \n \n If it did that, then you might have won an argument by now.", 
   {}, 
   303143, 
   null, 
   1203715080.0
  ], 
  [
   303162, 
   null, 
   "Archangel", 
   "Your questions regarding my intelligence and sexuality aside, it seems to me we have another misunderstanding here. I read that to mean exactly what I stated above. You read it to mean what you stated above. Why don't you ask CxT to clarify for you instead of declaring that your interpretation is the correct one and we are all liars?\n\n \n As usual you want to go back and get reinforcements so you can reframe the debate in your favor. Another example of your cowardly debating style. Here is CxTs response to my post challenging her dating of the big bang, and she never claimed I misinterpreted her at all . All she did was back pedal which is alot more honest than your attempts to confuse and obfuscate when cornered.\n http://www.4forums.com/political/showpost.php?p=300906&postcount=139", 
   {}, 
   303154, 
   null, 
   1203717420.0
  ], 
  [
   303163, 
   null, 
   "Kronus", 
   "As usual you want to go back and get reinforcements so you can reframe the debate in your favor. \n\n \n To the admin:\n \n I'd really like your opinion on this. T.Q. clearly said, why don't you ask for clarification; a reasonable request. AA totally changed what he said to make is sound dishonest and underhanded. Does this constitute a lie, and (second question) is this acceptable debating tactics for this forum?\n \n Just trying to calibrate my measuring stick. :)", 
   {}, 
   303162, 
   null, 
   1203717660.0
  ], 
  [
   303166, 
   null, 
   "T.Q", 
   "As usual you want to go back and get reinforcements so you can reframe the debate in your favor.\n\n Oh can it! I want you to ask the person who made the point exactly what they were trying to say, as there seems to have been a misunderstanding. This is the way adults do things!\n \n \nAnother example of your cowardly debating style.\n\n You want to stop with the names sometime soon? It doesn't help you at all.\n \n \nHere is CxTs response to my post challenging her dating of the big bang, and she never claimed I misinterpreted her at all.\n\n Probably because she was incensed at all the name calling you threw her way.\n \n \nAll she did was back pedal\n\n yeah, ok, whatever.\n \n \nwhich is alot more honest than your attempts to confuse and obfuscate when cornered.\n http://www.4forums.com/political/showpost.php?p=300906&postcount=139\n\n \n Listen you stupid XXX! I said this seems like a misunderstanding, and to be sure that you're both talking about the same thing, which is not the way it looks to me, how about you just say \"Hey, CxT, did you mean we can pinpoint the time of the big bang to x seconds, or did you mean we know the sequence of events back to x seconds?\" Explain to me how that is cowardly or dishonest. \n \n You know what, you just got a new thread started in this forum. Congrats!", 
   {}, 
   303162, 
   null, 
   1203718200.0
  ], 
  [
   303168, 
   null, 
   "Archangel", 
   "Poor baby, can't deal with the facts so you need a new thread to outline a new attack position? It must be great to be able to ignore all evidence that answers your repeated questions while demanding the same questions get answered again.", 
   {}, 
   303166, 
   null, 
   1203718680.0
  ], 
  [
   303170, 
   null, 
   "T.Q", 
   "Poor baby, can't deal with the facts so you need a new thread to outline a new attack position? It must be great to be able to ignore all evidence that answers your repeated questions while demanding the same questions get answered again.\n\n \n I honestly want to know, did you even read what I posted here?", 
   {}, 
   303168, 
   null, 
   1203718920.0
  ], 
  [
   303172, 
   null, 
   "admin", 
   "To the admin:\n \n I'd really like your opinion on this. T.Q. clearly said, why don't you ask for clarification; a reasonable request. AA totally changed what he said to make is sound dishonest and underhanded. Does this constitute a lie, and (second question) is this acceptable debating tactics for this forum?\n \n Just trying to calibrate my measuring stick. :)\n\n \n It does seem like a harsh response to a reasonable question for clarity.\n It doesn't seem friendly to me.", 
   {}, 
   303163, 
   null, 
   1203719100.0
  ], 
  [
   303178, 
   null, 
   "Archangel", 
   "I posted # 135, 137, and 141 which was CxTs claim, my response to her, and and her next post to me. For TQ to want to go hunt Cxt down in hindsight and allow her to redefine what she originally meant when I proved her wrong once is nothing more than an attempt to give her another shot at the apple with all of this extra minutia as ammo to re-argue this issue. So there is nothing at all reasonable about his request.", 
   {}, 
   303172, 
   null, 
   1203719760.0
  ], 
  [
   303179, 
   null, 
   "T.Q", 
   "I posted # 135, 137, and 141 which was CxTs claim, my response to her, and and her next post to me. For TQ to want to go hunt Cxt down in hindsight and allow her to redefine what she originally meant when I proved her wrong once is nothing more than an attempt to give her another shot at the apple with all of this extra minutia as ammo to re-argue this issue. So there is nothing at all reasonable about his request.\n\n \n OK, once more, read what I posted. I said:\n \"I read that to mean exactly what I stated above. You read it to mean what you stated above. Why don't you ask CxT to clarify for you instead of declaring that your interpretation is the correct one and we are all liars?\n \"\n This was after you implied I was a homosexual and insulted my intelligence.\n \n You then follow it up with the drivel above. Yeah, I'm so damn sneaky and manipulative! \n \n Or, I could just see that what you say CxT is saying doesn't appear to be what CxT is actually saying, so maybe you should clarify instead of assuming we're all liars and that you are automatically right.\n \n No matter, you have a thread to respond to", 
   {}, 
   303178, 
   null, 
   1203720120.0
  ], 
  [
   303181, 
   null, 
   "Archangel", 
   "You may want to re-hash my prior debates with other posters just to make sure I got it right TQ, but that is your personal issue. I see no reason to do that as we dealt with that issue. I submit that you read what she said and you will see clearly that I interpreted it right as her response to me AT THE TIME, IN THE MOMENT never implied I didn't.\n \n http://www.4forums.com/political/showpost.php?p=300896&postcount=135\n \n \n http://www.4forums.com/political/showpost.php?p=300903&postcount=137\n \n \n http://www.4forums.com/political/showpost.php?p=300906&postcount=139", 
   {}, 
   303179, 
   null, 
   1203720720.0
  ], 
  [
   303184, 
   null, 
   "T.Q", 
   "You may want to re-hash my prior debates with other posters just to make sure I got it right TQ, but that is your personal issue. I see no reason to do that as we dealt with that issue. I submit that you read what she said and you will see clearly that I interpreted it right as her response to me AT THE TIME, IN THE MOMENT never implied I didn't.\n \n http://www.4forums.com/political/showpost.php?p=300896&postcount=135\n \n \n http://www.4forums.com/political/showpost.php?p=300903&postcount=137\n \n \n http://www.4forums.com/political/showpost.php?p=300906&postcount=139\n\n \n \n You have another thread to respond to", 
   {}, 
   303181, 
   null, 
   1203720840.0
  ], 
  [
   303192, 
   null, 
   "Archangel", 
   "You have another thread to respond to\n\n \n Yeah, well you still have this one to answer to.", 
   {}, 
   303184, 
   null, 
   1203722160.0
  ], 
  [
   303200, 
   null, 
   "T.Q", 
   "Yeah, well you still have this one to answer to.\n\n \n Wait, you make a big deal about me butting in to derail the thread and back up my \"boyfriend\", and now I have something to respond to here?\n \n Never mind reading what I post, do you read what you post?", 
   {}, 
   303192, 
   null, 
   1203724920.0
  ], 
  [
   303203, 
   null, 
   "thelmoose", 
   "This was after you implied I was a homosexual ... \n\n \n Not that there's anything wrong with that emoticon_smile", 
   {}, 
   303179, 
   null, 
   1203725220.0
  ], 
  [
   303207, 
   null, 
   "T.Q", 
   "Not that there's anything wrong with that emoticon_smile\n\n \n No, there isn't. Except I know to AA that's a despicable thing to accuse someone of. So while I'm not offended, I know the intention was to offend.", 
   {}, 
   303203, 
   null, 
   1203726000.0
  ], 
  [
   303208, 
   null, 
   "thelmoose", 
   "No, there isn't. Except I know to AA that's a despicable thing to accuse someone of. So while I'm not offended, I know the intention was to offend.\n\n \n Exactly. \n I know you did not have any intention to offend nor would you be offended if someone mistakenly thought you were gay. I have never used a smiley before (I have this aversion to them as well as the chat abbreviations), but I added that for the first time ever, hoping you knew I was joking. (It's a Seinfeld line.)\n \n You are right, AA actually thinks it is an insult to call someone a homosexual. How third grade is that?", 
   {}, 
   303207, 
   null, 
   1203726540.0
  ], 
  [
   303214, 
   null, 
   "T.Q", 
   "Exactly. \n I know you did not have any intention to offend nor would you be offended if someone mistakenly thought you were gay. I have never used a smiley before (I have this aversion to them as well as the chat abbreviations), but I added that for the first time ever, hoping you knew I was joking. (It's a Seinfeld line.)\n \n You are right, AA actually thinks it is an insult to call someone a homosexual. How third grade is that?\n\n \n Don't worry, I caught the smiley, and I wasn't worried about being accused of taking offense to such an immature attempt at name calling. It generally amuses me when Archie thinks he's being clever.", 
   {}, 
   303208, 
   null, 
   1203728040.0
  ], 
  [
   303215, 
   null, 
   "obvious_child", 
   "Have you ever had a long, friendly, respectable debate here, with anyone you disagreed with? \n \n Here are three of mine;\n \n My opponent was jaxian\n \n My opponent was zachvac\n \n My opponent was Another Opinion\n \n People I disagreed with, that I debated back and fourth with for anywhere from 9 to about 15 or more posts each time, and we never got nasty with each other. I could probably find several more. \n \n Have you ever done that once?\n\n \n I regularly disagree with Jyhous (can never spell his name right). I often disagree with Zardoz on aspects of religion. Pandion showed some flaws in my flood argument. None of these were not polite.", 
   {}, 
   303018, 
   null, 
   1203728100.0
  ], 
  [
   303233, 
   null, 
   "electrolyte", 
   "Sure it is; when that person is a College Graduate just as you are. Only with a different major.\n\n Oh for crying out loud... Do I really need to go find the infamous post where you discuss how quantum physics is a total sham and then sing the praises of electricity... which is explained by quantum physics? Look, when you make statements about the nature of science that are clearly incorrect to anybody with any understanding of science, I nail you on it. I can cite myself as a credible source because I have qualifications as such. You do not, so your opinion is trumped absent evidence to the contrary.\n Unfortunately for you, you only provide the evidence for my position. T.Q posted a long list of scientific theories, and you attacked them as if each one was complete guesswork. Really, nobody can blame me when handed such comedy gold on a silver platter.\n \n \nYou have lied about my intelligence on almost every single response you have ever made to me on this forum.\n\n I haven't lied at all. I've expressed the observations I've made. You may not be a complete idiot in every single aspect, but it is clear that you are woefully uneducated about the sciences and about science in general.\n \n \nAnd yet I disagree with pretty much every scientific assumption you make and see them as infantile in their depth of understanding.\n\n Where you're making the mistake is thinking that I'm making assumptions. It is not an assumption that energy exists in quantized packets. It is not an assumption that there is cosmic microwave background radiation. These are observable facts that support scientific theories, not assumptions.\n \n \nWhich one of us is being honest and which one is being their usual deceitful manipulator?\n\n Look, I simply pointed out that the context in which you presented it was incomplete. And it was. What was said was not that your comments were silly, but that there was no penalty for your lies and slanderous comments. You're trying to paint me as dishonest for asking readers to note that this is the case? Get real.\n \n \nIn every debate I have read between you and mark I have seen the same exact cowardly tactics by you of attacking marcs intelligence and JUST DISMISSING HIS POINTS MADE WHILE IGNORING THE MEAT OF HIS ARGUMENTS COMPLETELY. Then in typical fashion you respond with your OPINION which is supposed to be accepted as fact.\n\n So when I tell marc that we have observed instances of speciation, you think that this is opinion? Go get a dictionary and look up \"opinion.\"\n \n \nFor a so called self described expert in the sciences, you don't represent a teachers attitude or character very well at all.\n\n Yet most of my posts include information that the person to whom I'm responding doesn't already know... or in your case, most of the time, it's information that you refuse to accept, even if it has mountains of evidence and no counterevidence. I already busted you for lying about my \"lying.\" Your self-proclaimed \"best\" examples of my lies were nothing of the sort, yet you maintain that I've done nothing but lie and be dishonest. I started this thread as a challenge to you to post just a single instance of my dishonesty, and you couldn't find a single one, yet you continue to call me dishonest.\n \n \nIt leaves me totally incredulous and mind numbed that you get away with such dishonest debating tactics for so long without being banned.\n\n You have a serious problem with projection. You call me dishonest, but you have to twist and contort the meaning of the word (i.e. be dishonest) in order to \"support\" your accusations. What hypocrisy.\n \n \nHere is the link to my answer to CxT where I crushed her claim with a solid link than answered her directly that in fact science has no such date that the big bang happened down to the billions of a second, but in fact allows for as large as a 10 billion year gap as to when it occurred.\n\n I wouldn't say \"crushed.\" As somebody who actually knows some science factoids, I recognized that CxT was referring to Planck time, even though the statement was not very clear. So, I tried to clarify because you didn't understand here.If you had any idea what anybody was talking about, which happens maybe once in a blue moon, you'd realize that he's talking about Planck time, [10^-43] seconds after singularity. We have a pretty damn good explanation for what happened then. [negative sign added for correction]\nBut to understand how truly despicable your argument is, I already brought up this very post.It is true that I technically produce no \"evidence\" in this post. However, I expose the hypocrisy of Archangel's argument, I provide information that Archangel clearly did not previously know (coincidentally, I left the negative sign off of the exponent in Planck time, which is 10^-43 seconds after singularity), and I expose the hypocrisy and wishful thinking of his other argument regarding unknown variables.\nI addressed your points substantively, and -- in fact -- I provided information in true teacher form, contrary to your allegation that I don't. But you call me dishonest?\n Then you present this post again as if it weren't addressed at all. This is the third time it has been addressed.\n \n \nThat's because your response was a complete corruption of what I was discussing with CxT and it was nothing more than a derailment based, once again on your opinion with no supporting evidence.\n\n A simple search for \"Planck time\" would show that I'm not making up sh*t like you do. Or, you could actually ask me to provide the evidence if you really think I'm full of cr*p. But you didn't, did you? Is that because you knew that I could present evidence?\"According to the Big Bang theory nothing is known about the universe at time=0, though it is presumed that all fundamental forces coexisted and that all matter, energy, and spacetime expanded outward from an extremely hot and dense singularity. One Planck time after the event is the closest that theoretical physics can get to it, and at that time it appears that the fundamental forces separated somehow.\" --wikipedia\"0-10^-43 seconds: Planck Era\n Conditions were so extreme in the Planck Era that our current understanding of physics is inadequate to tell us much about them.\" --link with pictures for the conceptually or scientifically impaired\n \nWhy don't you support your claims at the time that you make them? Is that proper debating etiquette?\n\n Because I'm not going to waste my time finding links for you if you're not going to deny that a specific claim is true. Usually, you just call me a liar in a very blanket manner. Why don't you challenge my claims at the time I make them instead of just calling me names?\n Will you now acknowledge that it is very likely that CxT was referring to Planck time, that you didn't understand because (1) CxT's statement was less than entirely clear and (2) your knowledge of the Big Bang theory is quite incomplete?\n \n \nJust as you edited out the 3 links I posted which you responded to by editing them out also.\n\n They're there for everyone to see. I didn't claim that you made up anything. I didn't claim that you didn't post links. Am I now required to quote your every word before I can respond to your points?\n \n \nIf this were true, why can't you show why my statements are wrong? Can you show that your \"you can't give an exact number, and you can't give a range either\" approach isn't hypocritical? Can you show that your \"there are unknown variables that nobody knows, but I know that they have certain effects\" argument isn't both hypocritical and completely devoid of evidence?\nYou just don't get it do you lyte. I show evidence in debates that support my beliefs.\n\n Where is the evidence that these things that I will loosely call \"unknown variables\" merely for the sake of addressing this point undermine our theories like gravity and evolution? Do you deny that our current models are based on the most accurate representation we can come up with?\n \n \nThis tact isn't going to work either lyte, because anyone reading these debates will see that I have two main techniques for beating you evos; one is the links I use to support my claims,\n\n You mean like the one above that says virtually nothing about \"unknown variables\" and yet supports my claim that there's lots of evidence in support of the big bang theory? Sure Archie, you go right ahead thinking that proving me right is an undercut of my points... emoticon_rolleyes\n \n \nand 2 is the questions I ask that because you can't answer them, you attack me as ignorant for asking them.\n\n Well, in some cases, yes. You've claimed that scientists declare that Lucy is a direct ancestor of ours based on genetic markers. To my knowledge, nobody claims that Lucy is a direct ancestor of ours based on genetic markers. I challenged you to support this claim, and you don't.\n \n \nSo what is this cr*p of yours about 10<43rd as to the second it occurred?\n\n This has now been explained at least three times. I can't be blamed for your willful ignorance.\n \n \nSo these three posts are convincing evidence of your lies, obfuscation and dishonest way of responding to, and allegedly debating issues which you control by using bait and switch methods that are meant to confuse and change the subject rather than actually respond to the questions being asked of you. That is the definition of lying, and you epitomize it.\n\n And as I've refuted your characterizations of my actions, you have no grounds for calling me either dishonest or a liar. But I won't be holding my breath for you to stop.\n \n \nAre you kidding me??? It's your sides claim, are you now denying Lucy's importance as a link in human evolution?\n\n It is not my side's claim. I am challenging you to support your statement that we use \"genetic markers\" to argue that Lucy is a direct ancestor of humans. Instead of meeting the challenge, you are pretending that I am backtracking when I am doing nothing of the sort. Support your statement.\n \n \nAnd thanks for again revealing your typical style of obfuscation as you ignore the meat of my question by focusing on a side issue that has nothing to do with the larger issue.\n\n But this is precisely the issue according to your post. You claim the reasoning is faulty because of the genetic correlation between humans and chimps, but you haven't shown that any such \"genetic markers\" actually show correlation between humans and Lucy.\n \n \nNO YOUR NOT ADDRESSING MY ALLEGATIONS, NOR DID YOU AT ALL. You haven't addressed any aspect of my question, which was this:Also, I just recently asked the whole bunch of you how you can claim so adamantly that the so called primate/hominid fossils such as Lucy, Peking, Java and Neanderthal MAN are related to modern man because of genetic markers that evolutionists claim is evidence of our biological kinship...\n\n See, when you do stuff like this, your only defenses are stupidity or ignorance. Either you don't understand that when I talk about genetic markers that are allegedly applicable to Lucy I'm talking about genetic markers that are allegedly applicable to Lucy, or you are ignoring the fact that I'm talking about genetic markers that are allegedly applicable to Lucy even though you're asking me to talk about genetic markers that are allegedly applicable to Lucy. Take your pick.", 
   {}, 
   303215, 
   null, 
   1203747120.0
  ], 
  [
   303273, 
   null, 
   "Archangel", 
   "Here we see ONCE AGAIN, how you edit my question to delete the relevant meat of it in order to mock it in your typical fashion without answering any of it. At the bottom of this post is the complete question I asked, but directly below is your edited version of it. And then of course, in the middle is your non answer. Thanks again for proving why it's a waste of time even attempting to reason with you.\n \n Rather than just take Lucy out of the equation and answer the question you know very well that I am asking, you completely ignore the relevant question and focus on Lucy. I guess it would never occur to you to just say that in your opinion Lucy doesn't apply to the question and go ahead and answer the question without her as a consideration. that would never occur to you huh? Thanks for nothing lyte, at least you're consistent. \n \n \n \n NO YOUR NOT ADDRESSING MY ALLEGATIONS, NOR DID YOU AT ALL. You haven't addressed any aspect of my question, which was this:\n Also, I just recently asked the whole bunch of you how you can claim so adamantly that the so called primate/hominid fossils such as Lucy, Peking, Java and Neanderthal MAN are related to modern man because of genetic markers that evolutionists claim is evidence of our biological kinship...\n\n \n \n \nSee, when you do stuff like this, your only defenses are stupidity or ignorance. Either you don't understand that when I talk about genetic markers that are allegedly applicable to Lucy I'm talking about genetic markers that are allegedly applicable to Lucy, or you are ignoring the fact that I'm talking about genetic markers that are allegedly applicable to Lucy even though you're asking me to talk about genetic markers that are allegedly applicable to Lucy. Take your pick.\n\n \n \n [Archangel]NO YOUR NOT ADDRESSING MY ALLEGATIONS, NOR DID YOU AT ALL. You haven't addressed any aspect of my question, which was this:\n \n Also, I just recently asked the whole bunch of you how you can claim so adamantly that the so called primate/hominid fossils such as Lucy, Peking, Java and Neanderthal MAN are related to modern man because of genetic markers that evolutionists claim is evidence of our biological kinship, when chimps share 98% of our DNA, and are contemporary to us currently so we can observe first hand how inferior they are to us in all aspects of intelligence, imagination, creativity and reason. Not one of you dealt with that question at all in a rational way. you all completely evaded even touching it even though I reposted it repeatedly.", 
   {}, 
   303233, 
   null, 
   1203790980.0
  ], 
  [
   303276, 
   null, 
   "electrolyte", 
   "Here we see ONCE AGAIN, how you edit my question to delete the relevant meat of it in order to mock it in your typical fashion without answering any of it. At the bottom of this post is the complete question I asked, but directly below is your edited version of it. And then of course, in the middle is your non answer.\n\n Look, Holmes, your question was fraudulent, and I called you out on it. See below.\n \n \nRather than just take Lucy out of the equation and answer the question you know very well that I am asking, you completely ignore the relevant question and focus on Lucy. I guess it would never occur to you to just say that in your opinion Lucy doesn't apply to the question and go ahead and answer the question without her as a consideration. that would never occur to you huh?\n\n But I did, and I did it so effectively that you reworded your question to remove mention of genetic markers and removed Lucy from your list of specimens. I'm slowly making your question coincide with that pesky thing we call reality so that we can cut through your bullspit and get a question that isn't ignorant.\n \n You don't even remember your new version?By what standard of evidence does evolution science claim a direct evolutionary relationship with those hominids that preceded us such as Java, Peking and Neanderthal MAN, Is it based on chromosomal, amino acids, cytochrome c, genetics, DNA, lifestyle, or simply based on their hominid/primate similarities? Now if you come back with evidence that Neanderthal buried their dead, and deduce from that a direct relationship with modern man, then surely some chemical relationship has also been discovered since the advent of DNA technology, whether it it nuclear or mitochondrial similarities/connections, or one of the other chemical relationships mentioned above.\nBut rather than be honest about your mistake, you just changed things without paying any attention to the fact that we've shown you have no idea what you're talking about when it comes to the claims of the scientific community.. at least, not until somebody tells you. (And you accuse me of not having a teacher's mentality as I educate you in something you didn't previously know... How pathetic.)\n \n \n[Archangel]NO YOUR NOT ADDRESSING MY ALLEGATIONS, NOR DID YOU AT ALL. You haven't addressed any aspect of my question, which was this:\n \n Also, I just recently asked the whole bunch of you how you can claim so adamantly that the so called primate/hominid fossils such as Lucy, Peking, Java and Neanderthal MAN are related to modern man because of genetic markers that evolutionists claim is evidence of our biological kinship, when chimps share 98% of our DNA, and are contemporary to us currently so we can observe first hand how inferior they are to us in all aspects of intelligence, imagination, creativity and reason. Not one of you dealt with that question at all in a rational way. you all completely evaded even touching it even though I reposted it repeatedly.\n\n So, really, you acknowledged that your question was a big pile of nonsense when you changed it, but now you're posting the original version and calling me an evading coward. pandion has already told you that the scientific community doesn't regard these specimens as \"direct ancestors\" as you claim, so your question does not apply. (Next we can discuss how we'd have DNA evidence from Peking Man even though the specimen was lost before any analytical techniques were developed.) Why are you lying by saying that the scientific community says something that it doesn't say? Why can't you just ask a question that isn't full of lies and false insinuations? If you're so p*ssy about my exposing the disinformation that you lace your questions with, cut the posturing and ask a simple question that doesn't rely upon a foundation of lies.", 
   {}, 
   303273, 
   null, 
   1203794640.0
  ], 
  [
   303281, 
   null, 
   "Archangel", 
   "So what you're saying here is that it doesn't matter how clearly and simply I attempt to phrase or ask a question; you will invariably twist it to be something deceptive, ignorant and/or fallacious. More proof of why it's a waste of time reasoning with you. I wont even try to continue this debate with you lyte. But if anyone else reads my posts above and understands my question, and wants to answer, I welcome your input.", 
   {}, 
   303276, 
   null, 
   1203797460.0
  ], 
  [
   303287, 
   null, 
   "Dane", 
   "So what you're saying here is that it doesn't matter how clearly and simply I attempt to phrase or ask a question; you will invariably twist it to be something deceptive, ignorant and/or fallacious. More proof of why it's a waste of time reasoning with you. I wont even try to continue this debate with you lyte. But if anyone else reads my posts above and understands my question, and wants to answer, I welcome your input.\nYour question is understood, and electrolyte did answer it, after which you merely tried to reword it to avoid Electrolyte's answer. Highly deceptive.", 
   {}, 
   303281, 
   null, 
   1203800820.0
  ], 
  [
   303321, 
   null, 
   "electrolyte", 
   "Why can't you just ask a question that isn't full of lies and false insinuations? If you're so p*ssy about my exposing the disinformation that you lace your questions with, cut the posturing and ask a simple question that doesn't rely upon a foundation of lies.\n\n Notice that here I ask Archangel to simply ask a question that doesn't contain dishonesty. He responds,\n \nSo what you're saying here is that it doesn't matter how clearly and simply I attempt to phrase or ask a question; you will invariably twist it to be something deceptive, ignorant and/or fallacious.\n\n Now, is that what I said? No; in fact, I said the exact opposite. I said to cut the cr*p and ask a question that has an answer. I can't answer a question that is worded, \"Because you beat your wife, I was wondering just when you're going to stop beating your wife,\" first because I don't beat my wife, and second because I don't have one.\n \n I can't show genetic marker evidence that Lucy is a direct ancestor, but I never claimed that I could. In fact, nobody claims that they can. Nobody claims that Lucy is a direct ancestor. Nobody claims to have genetic marker data from Lucy. Only Archie, in his amazing displays of smoke-blowing, demands that somebody else should defend claims that Archie himself pulls out of his rectum.\n \n \nMore proof of why it's a waste of time reasoning with you.\n\n I think the problem here is that -- between the two of us -- only one of us knows what reasoning is, and that person isn't you. All you've proven here is that you can neither ask a coherent question nor understand the simple words that I use to explain to you why your question is fraudulent.", 
   {}, 
   303281, 
   null, 
   1203828780.0
  ], 
  [
   303371, 
   null, 
   "Archangel", 
   "Notice that here I ask Archangel to simply ask a question that doesn't contain dishonesty. He responds,\n \n I can't show genetic marker evidence that Lucy is a direct ancestor, but I never claimed that I could. In fact, nobody claims that they can. Nobody claims that Lucy is a direct ancestor. Nobody claims to have genetic marker data from Lucy. Only Archie, in his amazing displays of smoke-blowing, demands that somebody else should defend claims that Archie himself pulls out of his rectum.\n \n I think the problem here is that -- between the two of us -- only one of us knows what reasoning is, and that person isn't you. All you've proven here is that you can neither ask a coherent question nor understand the simple words that I use to explain to you why your question is fraudulent.\n\n \n Yeah, Right lyte. As usual you make absolute statements that you neither support with evidence or that will even hold up to scrutiny. And yet you insist that you are the provider of absolute reliable information. Then how do you explain this?\n Discovery rocks human-origin theories\n \n By Tim Friend, USA TODAY\n \n \n Fred Spoor, AFP\n A complete skull believed to represent a new genus of hominid, or early human.\n \n Paleontologists have discovered a new skeleton in the closet of human ancestry that is likely to force science to revise, if not scrap, current theories of human origins.\n \n The fossil, 3.5 million years old, consists of a partial skull and teeth that are more human-like than the accepted direct ancestor, Lucy.\n \n The fossil is described in today's Nature as a new genus and species, Kenyanthropus platyops. The discoverers, led by Meave Leakey, wife of paleontologist Richard Leakey, say the discovery means that modern humans could have sprung from at least two possible lineages, not one. Leakey also says Kenyanthropus could replace Lucy as the best candidate on the human family tree for our direct ancestor, but she says neither Lucy nor the new fossil is necessarily \"the one.\"\n \n Since Lucy's partial skeleton was discovered in 1974 in Ethiopia, she has been generally accepted as the oldest known human ancestor.\n http://www.usatoday.com/news/science/2001-03-21-skull.htm\n \n So why is it lyte that as you constantly claim that I am blowing something out of my rectum due to my unending ignorance in the face of your intellectual and scientific superiority, that you always end up eating dirt and being shown to be the one who either doesn't know any better or is outright lying in order to demonize me as ignorant? I mean, why do you refuse to ever supply a link that proves what you claim to be true?", 
   {}, 
   303321, 
   null, 
   1203889380.0
  ], 
  [
   303391, 
   null, 
   "Dane", 
   "As USA TODAY is not a scientific source anyway, it is useless for your argument. So Elctrolytes point still stands.", 
   {}, 
   303371, 
   null, 
   1203896340.0
  ], 
  [
   303400, 
   null, 
   "electrolyte", 
   "Yeah, Right lyte. As usual you make absolute statements that you neither support with evidence or that will even hold up to scrutiny. And yet you insist that you are the provider of absolute reliable information. Then how do you explain this?Since Lucy's partial skeleton was discovered in 1974 in Ethiopia, she has been generally accepted as the oldest known human ancestor.\n So why is it lyte that as you constantly claim that I am blowing something out of my rectum due to my unending ignorance in the face of your intellectual and scientific superiority, that you always end up eating dirt and being shown to be the one who either doesn't know any better or is outright lying in order to demonize me as ignorant? I mean, why do you refuse to ever supply a link that proves what you claim to be true?\n\n Because you are? Notice how you de-emphasized the fact that you asked for the genetic marker evidence. There is none, and others here did a fine job of pointing out how utterly clueless of the testing you must be to make this demand. You also asked for the same for Peking Man, then expressed astonishment that I would so much as suggest that testing couldn't be done... because you didn't even know that the fossils had disappeared.\n \n I will admit, openly, for everybody to see, that I was wrong about Lucy not being regarded as a human ancestor, or so it would seem. There was no intent to pass false information; I was plainly wrong. But for you to take this one instance of my being incorrect and try to pass it off as a deliberate lie, or that I am reliably unreliable, is backhanded slander. On the other hand, that article is six years old, and the statement that it makes about Lucy being the oldest known human ancestor is no longer true.\n \n To understand why these specimens are classified as they are, Archangel needs to look into paleoanthropology. As I am not a paleoanthropologist and have little knowledge about the technical details of that discipline, I am not the best source of comparative knowledge. I can say that there are several things, especially pelvis, spinal column, knee, and skull characteristics as well as the angles of the pelvis, spine/pelvis intersection, and the skull/spine intersection that play large roles.\n I'd love to go on, but as Archie just tried to impeach my statements to eanassir about astronomy because I am technically not an astronomer, I cannot possibly produce anything that Archie would accept. It's quite the catch-22, actually, because Archie asks the impossible. He demands that I explain paleoanthropology to him, but he will not accept anything I say about it unless I am a paleoanthropologist. In this case, the best that he can do is look at authoritative sources himself.\n \n Personally, I like this starting point.", 
   {}, 
   303371, 
   null, 
   1203898800.0
  ], 
  [
   303401, 
   null, 
   "Penfold", 
   "Even the \"evidence\" supplied contains this conveniently ignored disclaimer:\n \n \"she says neither Lucy nor the new fossil is necessarily \"the one.\"\"\n \n Which kind of undercuts the argument.", 
   {}, 
   303391, 
   null, 
   1203899220.0
  ], 
  [
   303406, 
   null, 
   "Archangel", 
   "Because you are? Notice how you de-emphasized the fact that you asked for the genetic marker evidence. There is none, and others here did a fine job of pointing out how utterly clueless of the testing you must be to make this demand. You also asked for the same for Peking Man, then expressed astonishment that I would so much as suggest that testing couldn't be done... because you didn't even know that the fossils had disappeared.\n\n \n You see, here's the problem with your claim lyte; If you wanted to be honest here, you know what my larger question is. But you don't want to answer that question, so you want to focus on this side issue which in reality is irrelevant as I have shown that Since Lucy's partial skeleton was discovered in 1974 in Ethiopia, she has been generally accepted as the oldest known human ancestor. \n \n So what is actually being exposed here is that the venerable science of evolution has been claiming that as a conclusion based on, well, on nothing reliable at all. Forgive me, a layman for making the stupid assumption that since I knew they were claiming her as a direct ancestor, that they actually had some perceived evidence of it. Yet rather than focus on the larger issue of my question, once again you focus on a side issue designed to avoid dealing with the larger question I have asked. And you continue to do that.\n \n \nI will admit, openly, for everybody to see, that I was wrong about Lucy not being regarded as a human ancestor, or so it would seem. There was no intent to pass false information; I was plainly wrong. But for you to take this one instance of my being incorrect and try to pass it off as a deliberate lie, or that I am reliably unreliable, is backhanded slander. On the other hand, that article is six years old, and the statement that it makes about Lucy being the oldest known human ancestor is no longer true.\n\n \n This ONE instance???? Are you kidding me? I have been knocking holes in your arguments all along. You're just real consistent at denying reality and responding with attacks on my intelligence and honesty. Right now on the evolution debate that Peeling started with me, you're avoiding my response to you which is proving you wrong regarding this same exact issue. And my response to you assuming that you're lying or being deceptive is the same thing you do with every single post of mine you respond to, unless you're just calling me ignorant or my arguments stupid. \n \n So how does it feel? It would be nice to debate without every mistake being used against you as perceived evidence of dishonesty or stupidity, wouldn't it? Well that's how I feel too. So stop doing it to me in every one of your responses and I'll stop doing it to you.\n \n \nTo understand why these specimens are classified as they are, Archangel needs to look into paleoanthropology. As I am not a paleoanthropologist and have little knowledge about the technical details of that discipline, I am not the best source of comparative knowledge. I can say that there are several things, especially pelvis, spinal column, knee, and skull characteristics as well as the angles of the pelvis, spine/pelvis intersection, and the skull/spine intersection that play large roles.\n\n \n I understand very well that where and how the head sits on the neck, how the knee, hip and other joints meet, and how the spine sits on the pelvis plays an important role in helping Paleos (for short) determine how ancient fossils compare to modern Man. My problems lie with the limited remains discovered and the fact that she is dated to be over 3 million years old. If she really was an ancestor, who's to say what skeletal structure is correct or not? It just goes to the huge assumptions being made once again.\n \n \nI'd love to go on, but as Archie just tried to impeach my statements to eanassir about astronomy because I am technically not an astronomer, I cannot possibly produce anything that Archie would accept. It's quite the catch-22, actually, because Archie asks the impossible. He demands that I explain paleoanthropology to him, but he will not accept anything I say about it unless I am a paleoanthropologist. In this case, the best that he can do is look at authoritative sources himself.\n \n Personally, I like this starting point.\n\n \n Nice evasion, really... only what i said on that thread is why didn't you post a supporting link that would be believed? As now, when I asked what you evos base your belief that these ancient extinct Apes are in fact ancestors to modern man? I wasn't trying to limit you to any particular type of biochemical evidence at all. Just what leads you to believe as you do. No limitations at all. Just what is it you believe. Yet here we are still discussing this side issue. So just post links to support your opinions, that's all. No catch 22 here at all.", 
   {}, 
   303400, 
   null, 
   1203903180.0
  ], 
  [
   303407, 
   null, 
   "Archangel", 
   "Now for the Troll responses:\n \n \nAs USA TODAY is not a scientific source anyway, it is useless for your argument. So Elctrolytes point still stands.\n\n \n But you see Dane, the USA Today didn't write it as an opinion piece, but reported on a science paper by Rick Potts of the Smithsonian Institution's Museum of Natural History. Does that explain to you why it is a legitimate source of information? And electrolyte, obvious child, TQ or kronus, why, if you are such sticklers for accuracy, don't you ever correct these guys for the infantile statements they make? \n \n You have absolutely no problem derailing complete threads and never answering a directly asked question because of ridiculous minutia with me, but you'll completely ignore this kind of foolishness. Do you see how that damages your credibility and sense of fair play?\n \n \nEven the \"evidence\" supplied contains this conveniently ignored disclaimer:\n \n \"she says neither Lucy nor the new fossil is necessarily \"the one.\"\"\n \n Which kind of undercuts the argument.\n\n \n Not at all Penfold. Because I was posting the link for the highlighted evidence only. You must realize that I don't accept any part of that link as actually true or correct. I'm posting it only for the generally accepted belief within the evolutionist community that Lucy is an accepted ancestor of ours. But what is evident is that people like you and Dane will pick any foolish reason to stand against anything I offer as evidence of anything. It doesn't matter what it is.", 
   {}, 
   303406, 
   null, 
   1203904140.0
  ], 
  [
   303409, 
   null, 
   "Dane", 
   "But you see Dane, the USA Today didn't write it as an opinion piece, but reported on a science paper by Rick Potts of the Smithsonian Institution's Museum of Natural History. Does that explain to you why it is a legitimate source of information?\nIt isn't. newpapers \"report\" on things all the time and get it wrong. GO find the original data. Reporting on a reporting of data from elsewhere is simply not reliable.\n \nYou have absolutely no problem derailing complete threads\nActually, it is your stark dishonesty which derails them. because when you post your falsehoods, the subject changes from the topic to that of your dishonesty.", 
   {}, 
   303407, 
   null, 
   1203904560.0
  ], 
  [
   303410, 
   null, 
   "Archangel", 
   "It isn't. newpapers \"report\" on things all the time and get it wrong. GO find the original data. Reporting on a reporting of data from elsewhere is simply not reliable.\n Actually, it is your stark dishonesty which derails them. because when you post your falsehoods, the subject changes from the topic to that of your dishonesty.\n\n \n So you're still calling me a liar? Do I have to start a new thread and make you prove it? Write this 100 times Dane; \n disagreeing with Dane does NOT mean people are lying. \n disagreeing with Dane does NOT mean people are lying. \n disagreeing with Dane does NOT mean people are lying.\n disagreeing with Dane does NOT mean people are lying.\n disagreeing with Dane does NOT mean people are lying.\n disagreeing with Dane does NOT mean people are lying.\n \n Now you do it 94 more times and maybe you'll get it. See ya...", 
   {}, 
   303409, 
   null, 
   1203905520.0
  ], 
  [
   303412, 
   null, 
   "Penfold", 
   "\n Not at all Penfold. Because I was posting the link for the highlighted evidence only. You must realize that I don't accept any part of that link as actually true or correct. I'm posting it only for the generally accepted belief within the evolutionist community that Lucy is an accepted ancestor of ours. \n\n \n Whilst you must accept that all of the informaton contained in a link is pertinent to the discussion. It is frankly dishonest to both us and yourself to cherrypick a source only for the selected items which agree with your preconceptions, while ignoring those which do not fit your worldview.", 
   {}, 
   303407, 
   null, 
   1203909000.0
  ], 
  [
   303415, 
   null, 
   "electrolyte", 
   "This ONE instance???? Are you kidding me?\n\n Can't say that I am. Have you shown where I've been wrong anywhere else? Let me remind you that when challenged to support your claims that I'm dishonest, you said that my calling you uneducated about certain topics was a lie, when it is quite clear that my claims are 100% true. (See disappearing Peking Man and Lucy's genetic markers.)\n \n \nRight now on the evolution debate that Peeling started with me, you're avoiding my response to you which is proving you wrong regarding this same exact issue.\n\n Link me.\n \n \nAnd my response to you assuming that you're lying or being deceptive is the same thing you do with every single post of mine you respond to, unless you're just calling me ignorant or my arguments stupid.\n\n Yes; logically, those are the only options. Either you know that this claptrap you forward is untrue -- making you a liar -- or you don't know that this claptrap you forward is untrue, making you ignorant of the topic. The difference is that you're wrong so damn often, and I'm wrong so rarely that you get to make a big deal out of this one. So have your fun now. For clarification, though, it should be noted that by \"direct ancestor,\" we mean an ancestral species, not necessarily that a particular specimen was in the literal genetic chain leading to humans. If the latter is what you meant, then I wouldn't be wrong, but I'll be humble enough to admit that my statement was not based on a misinterpretation of your claim.\n \n \nSo how does it feel? It would be nice to debate without every mistake being used against you as perceived evidence of dishonesty or stupidity, wouldn't it?\n\n If it bothers you so much, quit being wrong/dishonest about virtually every claim you make. I was absolutely shocked that you actually went out and looked at a non-creationist site for information. Of course, you didn't understand the bigger picture of what was being discussed, but that's a different matter.\n Or, I might just let it slip that my refusing to answer was part of a plan: you clearly weren't listening to anything I would say, so I helped you eliminate the faulty portions of your question. Once you did that, it was a question that could be answered if you reduced its breadth, so I asked you to do so. Since you didn't, I let you look for yourself.\n \n \nI understand very well that where and how the head sits on the neck, how the knee, hip and other joints meet, and how the spine sits on the pelvis plays an important role in helping Paleos (for short) determine how ancient fossils compare to modern Man. .... who's to say what skeletal structure is correct or not? It just goes to the huge assumptions being made once again.\n\n So, really, you don't understand. It's not like the pieces are randomly stuck together, or that they're put together with the intent of producing a lineage from primitive hominid to man. (As rationale for this, suppose it were true: we would see the proposed lineage as a straight line instead of having branches and dead ends.) They're put together according to the characteristics of the bones. For example, a spinal connection at the back of the skull means that the hominid walked stooped; at the base means a more upright posture. Simple, and testable via extant species.\n \n \nNice evasion, really... only what i said on that thread is why didn't you post a supporting link that would be believed? As now, when I asked what you evos base your belief that these ancient extinct Apes are in fact ancestors to modern man?\n\n As I explained, this is not my area of expertise. I know the basics, but you are capable of finding the basics yourself, and you demand of me more than I know off the top of my head. If you want to go back to DNA comparison, I can possibly help you understand techniques there (but obviously not for specimens for which we have no DNA). You can call it evasion if you want, but I already exposed this as backhanded: either I try to answer the questions and you jump on me for answering without being an expert, or I don't answer and you jump on me for not answering. Either way, I can be sure to repeat this until it becomes clear to everybody but you that you will accept nothing less than your own personal Doctor of Paleoanthropology. God forbid you go to one of those evil atheistic university classes and learn from one, of whom you can ask questions and not have to worry about attacking for the lack of a PhD.", 
   {}, 
   303406, 
   null, 
   1203910680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Put Up or Shut Up Time, part II", 
  "url": "http://www.4forums.com/political/liars-corner/10964-put-up-shut-up-time-part-ii.html", 
  "breadcrumbs": [
   "Liars Corner"
  ], 
  "id_number": 10964, 
  "discussion_files": [
   [
    "29680.html", 
    "http://www.4forums.com/political/liars-corner/10964-put-up-shut-up-time-part-ii-print.html"
   ], 
   [
    "29681.html", 
    "http://www.4forums.com/political/liars-corner/10964-put-up-shut-up-time-part-ii-5-print.html"
   ], 
   [
    "29682.html", 
    "http://www.4forums.com/political/liars-corner/10964-put-up-shut-up-time-part-ii-4-print.html"
   ], 
   [
    "29683.html", 
    "http://www.4forums.com/political/liars-corner/10964-put-up-shut-up-time-part-ii-3-print.html"
   ], 
   [
    "29684.html", 
    "http://www.4forums.com/political/liars-corner/10964-put-up-shut-up-time-part-ii-2-print.html"
   ]
  ], 
  "identifier": 10964
 }
]