[
 [
  [
   302861, 
   null, 
   "obvious_child", 
   "In fact, let me know if you agree with this definition: A lie is when you post something that you know to be false, untrue, or misleading.\n\n \n The problem I see with Steeeve's definition is that of people who believe what they are saying is true despite it factually be wrong. Someone who believes what they say to be true despite being proven wrong in the past is not lying. If someone willfully ignores facts and refutations, does that make them a liar? Steeeve's definition clearly casts a lie as something one knows to be false, untrue or misleading. \n \n What do we call people who say things that we know and can prove are false, untrue and misleading but who sincerely believe such things are true? \n \n Someone who is delusional is not a liar even though they describe the world as something we know to be untrue. In the same fashion someone who uses arguments that were proven to them to be untrue, but unaccepted by them to untrue is not a liar as what they believe those arguments are factual. \n \n This is probably the first of many fatal flaws of this sub forum. It ignores the issue of people who genuinely believe their arguments and accusations to be true when in reality and independent of their beliefs, the arguments are not.", 
   {
    "post_info": {
     "post_title": "How do we deal with this serious problem?"
    }
   }, 
   null, 
   null, 
   1203587280.0
  ], 
  [
   302869, 
   null, 
   "Kronus", 
   "I've thought about that, and here's the approach I'm tempted to take.\n \n This is a debate forum, not a blog. You come here not to just post ideas, but to exchange and discuss them. When you post here you implicitly agree to debate what you post, and debate includes considering and responding to other people's posts. If you post something as fact and another poster makes a legitimate attempt to show that you're wrong, then you have implicitly agreed to consider and discuss what they've said. If you ignore it and go on repeating your original assertion then you are breaking your implicit word to debate. Even if you believe your original assertion to be true, if someone makes a legitimate attempt to show it to be false you must either refute their attempt or stop making your assertion, otherwise you are lying when you claim to be willing to debate.", 
   {}, 
   302861, 
   null, 
   1203604080.0
  ], 
  [
   302877, 
   null, 
   "daewoo", 
   "IMO, you guys are taking this too seriously. \n \n I have alwasy believed that debate should be a REQUIRED course in both high school and college. Believe me, the debate classes I took have turned out to be a LOT more useful that most of the math, science, or english classes I took. \n \n One thing that you HAVE to learn early, though, is that there are jsut osme people out there who you can show facts, numbers, and evidence to from now until the end of time and they are not going to change their minds. That is just life. You should read some of my latest exchanges with Missouri Mule. \n \n Laugh at it and move on. I know it is tempting to try to drive into the point and FORCE them to see reality, but that seldon (read that never) works. Now, I keep driving at mule because I enjoy making him look like a fool and think it is funny when other people mock him. Usually when people come back with fantasy laden ####, though, I just don't bother answering their post. It takes too long and unless they go into the kind of idiotic mental masterbation that mule does, it is usually not amusing. \n \n Regardless, you have to get used to the idea that sometimes you jsut can;t change peoples minds.", 
   {}, 
   302869, 
   null, 
   1203606120.0
  ], 
  [
   302880, 
   null, 
   "Archangel", 
   "I've thought about that, and here's the approach I'm tempted to take.\n\n \n You be sure to let me know when you determine forum policy and I'll be sure to leave and never return kronus, ok?\n \n \nThis is a debate forum, not a blog. You come here not to just post ideas, but to exchange and discuss them. When you post here you implicitly agree to debate what you post, and debate includes considering and responding to other people's posts. If you post something as fact and another poster makes a legitimate attempt to show that you're wrong, then you have implicitly agreed to consider and discuss what they've said. If you ignore it and go on repeating your original assertion then you are breaking your implicit word to debate. Even if you believe your original assertion to be true, if someone makes a legitimate attempt to show it to be false you must either refute their attempt or stop making your assertion, otherwise you are lying when you claim to be willing to debate.\n\n \n And when you can enforce TOS rule #5 with the gang that distorts and misinterprets what the opposition debates, then maybe these problems will end.\n \n \n5. Do not exaggerate, misrepresent or mis-quote other user's post.\n\n \n I know that child is complaining about my refusal to accept, and insistence that evolution is a false and fraudulent science, in spite of the so called evidence he and others have repeatedly insisted is true and right. The only problem with that is that none of you can prove that your evidence is reliable at all, because it redefines itself with every new discovery that proves the previous assumptions and conclusions WRONG. \n \n I maintain that every claim the Origins sciences make regarding how life came to be on Earth is based on completely theoretical assumptions that not only have never been confirmed or proven, but will never be confirmed or proven. \n \n Nothing about my position is a lie or even disingenuous, especially since many many millions of people, if not billions of people around the World agree with me. Just because we have a strong and determined gang of secular humanists here who want to squelch all opposition views to their religion of evolution in no way nullifies the value of my position, nor my right to promote it against what evolution represents and claims to be true. \n \n So for anyone to attempt to impose some rule that just because evolutionists have posted so called evidence of their false beliefs in evolution a certain number of times that that automatically assumes they have proven something is patently ridiculous, and the epitome of arrogance.", 
   {}, 
   302869, 
   null, 
   1203609660.0
  ], 
  [
   302893, 
   null, 
   "admin", 
   "Nothing about my position is a lie or even disingenuous, especially since many many millions of people, if not billions of people around the World agree with me. Just because we have a strong and determined gang of secular humanists here who want to squelch all opposition views to their religion of evolution in no way nullifies the value of my position, nor my right to promote it against what evolution represents and claims to be true. \n \n So for anyone to attempt to impose some rule that just because evolutionists have posted so called evidence of their false beliefs in evolution a certain number of times that that automatically assumes they have proven something is patently ridiculous, and the epitome of arrogance.\n\n \n This is not a rule and will not be a rule.\n admin", 
   {}, 
   302880, 
   null, 
   1203614280.0
  ], 
  [
   302896, 
   null, 
   "Archangel", 
   "This is not a rule and will not be a rule.\n admin\n\n \n Thanks for responding admin, had I read this before my last post, I wouldn't have written it.", 
   {}, 
   302893, 
   null, 
   1203614520.0
  ], 
  [
   302965, 
   null, 
   "jim's trucking", 
   "I've thought about that, and here's the approach I'm tempted to take.\n \n This is a debate forum, not a blog. You come here not to just post ideas, but to exchange and discuss them. When you post here you implicitly agree to debate what you post, and debate includes considering and responding to other people's posts. If you post something as fact and another poster makes a legitimate attempt to show that you're wrong, then you have implicitly agreed to consider and discuss what they've said. If you ignore it and go on repeating your original assertion then you are breaking your implicit word to debate. Even if you believe your original assertion to be true, if someone makes a legitimate attempt to show it to be false you must either refute their attempt or stop making your assertion, otherwise you are lying when you claim to be willing to debate.\nClearly, you have been confused about ignoring posters and their statements. I do believe there's a function in my control panel that allows me to do just that.", 
   {}, 
   302869, 
   null, 
   1203634920.0
  ], 
  [
   302972, 
   null, 
   "Archangel", 
   "Clearly, you have been confused about ignoring posters and their statements. I do believe there's a function in my control panel that allows me to do just that.\n\n \n Yeah jim, but the ignore feature is a joke, because it doesn't work if only one person uses it. I have had electrolyte on ignore for months, yet with almost every opinion I gave to any member here, he would troll after me and rip my opinion apart from his warped and sick perspective. I must have reported hundreds of unsolicited attacks by him on me to admin before I finally gave up and started to respond to him in kind. And admin can attest to the number of times I have pleaded for help in silencing lytes trolling.\n \n Yet he constantly complains that I am calling him names without cause.", 
   {}, 
   302965, 
   null, 
   1203636840.0
  ], 
  [
   302974, 
   null, 
   "Kronus", 
   "Clearly, you have been confused about ignoring posters and their statements. I do believe there's a function in my control panel that allows me to do just that.\n\n \n If your not responding to someone they could hardly accuse you of lying, now could they? Failure to respond is just fine. It's when you do respond to a person but ignore what they say that you're being dishonest.", 
   {}, 
   302965, 
   null, 
   1203636960.0
  ], 
  [
   303013, 
   null, 
   "electrolyte", 
   "I have had electrolyte on ignore for months, yet with almost every opinion I gave to any member here, he would troll after me and rip my opinion apart from his warped and sick perspective.\n\n 1) If you have me on ignore, how can you have read my posts?\n 2) Ripping apart your opinion based on its utter lack of merit does not constitute an attack. Showing you to be grossly uneducated about that of which you speak is not an attack.\n 3) You have never shown where my perspective has been \"warped\" or \"sick.\" You just hate it because I beat your XXX down mercilessly on a regular basis and have no rational defense. The fact that you are the one with no rational defense implies that those descriptors belong best to you instead of to me.\n \n \nI must have reported hundreds of unsolicited attacks by him on me to admin\n\n Really? And the overwhelming majority elicited no action whatsoever on the part of admin. I hate that you whined so constantly to him; he undoubtedly has better things to do.\n \n \n... before I finally gave up and started to respond to him in kind.\n\n What rubbish. My posts contain reason and evidence. You haven't responded \"in kind\" once.\n \n \nAnd admin can attest to the number of times I have pleaded for help in silencing lytes trolling.\n\n And I can attest to the number of times that admin didn't warn me for \"trolling.\"\n \n \nYet he constantly complains that I am calling him names without cause.\n\n Is this a denial that you call me dishonest, a liar, a hack, a presumptuous spaz, immoral, and a fraud? Does this mean that you would eat crow upon my posting such namecalling? Many of your hateful, vile-spewing posts have been deleted, but enough remain to make my job really easy if only you'd be so kind as to challenge me to back up my allegation.\n Or, does this mean that you think your namecalling has just cause? If so, show where I've been dishonest, lying, a hack, a spaz, immoral, or fraudulent. In fact, I've invited you to show where I have been dishonest or where I have outright lied in the \"Liar's Corner\" forum, but you refuse to back up your assertion. Now, whyever could that be?", 
   {}, 
   302972, 
   null, 
   1203649980.0
  ], 
  [
   303034, 
   null, 
   "Archangel", 
   "1) If you have me on ignore, how can you have read my posts?\n\n \n You know; that pesky little view post button that allows me to read the post? But you knew that already, you just love to ask stupid pointless questions to make false points.\n \n \n2) Ripping apart your opinion based on its utter lack of merit does not constitute an attack. Showing you to be grossly uneducated about that of which you speak is not an attack. \n\n \n This is the infuriating thing about dealing with an ego maniac like you. You offer nothing more than your own opinions just as I do, but you're always right in your opinion and I am grossly uneducated. Can't you see how disingenuous and blatantly corrupt that debating style is? I can only assume you can't see it.\n \n \n3) You have never shown where my perspective has been \"warped\" or \"sick.\" You just hate it because I beat your XXX down mercilessly on a regular basis and have no rational defense. The fact that you are the one with no rational defense implies that those descriptors belong best to you instead of to me.\n\n \n According to you I have never ever made a valid point lyte!!! Talking to you is like talking to a wall. Your whole style of debating is to win through attrition, by beating the other person with insults and declarations of your victory before the other person has even responded yet. Why do you think I have placed you on ignore for so long, only reading posts that were directly below my responses to other members.\n \n \nReally? And the overwhelming majority elicited no action whatsoever on the part of admin. I hate that you whined so constantly to him; he undoubtedly has better things to do.\n \n And I can attest to the number of times that admin didn't warn me for \"trolling.\"\n\n \n Interesting; you will attest to how many times he didn't warn you, but you didn't attest to how many times he DID warn you. Typical obfuscation from you. And also, you didn't even want to touch on how many of those posts were deleted did you?\n \n \nIs this a denial that you call me dishonest, a liar, a hack, a presumptuous spaz, immoral, and a fraud? Does this mean that you would eat crow upon my posting such namecalling?\n \n \n Of course it isn't a denial, I have told the truth about you as you have insulted my intelligence in virtually every post you have ever written to me, just as child and TQ do also, INCLUDING THIS ONE. Rather than debate issues you insult me until I just say screw him and walk away. Then like a typical bully who dodged a bullet, you then claim victory and accuse me of running away scared. It's mind boggling how corrupt and cowardly your debating style is. \n \n You and your gang are the most frustrating and pathetic bunch of internet thugs I have ever dealt with. Now you will call this insulting you but I'm just describing how you are in reality. I challenge you to respond to a post of mine or marc9000s with no attacks on our intelligence. It can't be done.", 
   {}, 
   303013, 
   null, 
   1203656580.0
  ], 
  [
   303043, 
   null, 
   "electrolyte", 
   "You know; that pesky little view post button that allows me to read the post? But you knew that already, you just love to ask stupid pointless questions to make false points.\n\n Actually, I didn't know that already, because I don't put people on ignore. The better question is why you bother having anyone on ignore if you're always taking steps to read that person's posts anyway.\n \n \nThis is the infuriating thing about dealing with an ego maniac like you. You offer nothing more than your own opinions just as I do, but you're always right in your opinion and I am grossly uneducated.\n\n This coming from Professor Quantum Mechanics? I'm sorry, maybe I've misunderstood: You actually have a good understanding of electrons in conductors but you deny that our explanation of such is accurate? Seriously, are you challenging me to provide evidence for quantum physics, or will you just start eating your humble pie now?\n \n \nCan't you see how disingenuous and blatantly corrupt that debating style is?\n\n I provide evidence when asked to do so. (Unsurprisingly, you rarely ask; you know that I have the facts on my side.) You don't provide evidence; you only whine that you're being attacked when your talking points are demolished. Can't you see how disingenuous and corrupt your \"debating\" style is?\n \n \nAccording to you I have never ever made a valid point lyte!!!\n\n I've said nothing of the sort. I'm sure you've made a couple of valid points here and there. The problem is that they are generally few and far between.\n \n \nYour whole style of debating is to win through attrition, by beating the other person with insults and declarations of your victory before the other person has even responded yet.\n\n No, my style is presenting overwhelming evidence and/or impeaching faulty logic. The fact that you refuse to acknowledge said evidence or impeachment or to provide any counterargument whatsoever and instead only repeat yourself ad nauseum really isn't my fault.\n \n \nWhy do you think I have placed you on ignore for so long, only reading posts that were directly below my responses to other members.\n\n Why do I think? Because you hated reading my battering of your points and being unable to respond with anything that even resembled sanity.\n \n \nInteresting; you will attest to how many times he didn't warn you, but you didn't attest to how many times he DID warn you.\n\n Two or three, perhaps. Out of \"hundreds,\" I'd say that's not too bad.\n \n \nAnd also, you didn't even want to touch on how many of those posts were deleted did you?\n\n I don't know how many were deleted. I don't generally go back and read my old posts unless someone refers to it again.\n \n \nOf course it isn't a denial, I have told the truth about you as you have insulted my intelligence in virtually every post you have ever written to me, just as child and TQ do also, INCLUDING THIS ONE.\n\n Ah, so you renew your accusation that I am a liar. See my thread in Liar's Corner.\n \n \nRather than debate issues you insult me until I just say screw him and walk away.\n\n Maybe if you gave me something substantive to respond to, we could have a real conversation. Counterargument, evidence, something... that is, something other than the belligerent screaming and repeating of the same refuted nonsense.\n \n \nIt's mind boggling how corrupt and cowardly your debating style is.\n\n It's mind boggling that you can accuse me of tracking you down to post responses and at the same time call me cowardly. \"He's coming after me, what a coward!\"\n \n \nYou and your gang are the most frustrating and pathetic bunch of internet thugs I have ever dealt with.\n\n Yeah, the truth is often painful to those who willfully try to ignore it.\n \n \nNow you will call this insulting ...\n\n Nah, it's hilarious. Go back and read again in case you didn't notice the first time.\n \n \nI challenge you to respond to a post of mine or marc9000s with no attacks on our intelligence. It can't be done.\n\n I'll do that as soon as you can post an intelligible response that isn't full of intentional deceit or absolute balderdash. marc has seen me do it because he has the capability of doing that.", 
   {}, 
   303034, 
   null, 
   1203659880.0
  ], 
  [
   303403, 
   null, 
   "foundit66", 
   "I've thought about that, and here's the approach I'm tempted to take.\n \n This is a debate forum, not a blog. You come here not to just post ideas, but to exchange and discuss them. When you post here you implicitly agree to debate what you post, and debate includes considering and responding to other people's posts. If you post something as fact and another poster makes a legitimate attempt to show that you're wrong, then you have implicitly agreed to consider and discuss what they've said. If you ignore it and go on repeating your original assertion then you are breaking your implicit word to debate. Even if you believe your original assertion to be true, if someone makes a legitimate attempt to show it to be false you must either refute their attempt or stop making your assertion, otherwise you are lying when you claim to be willing to debate.\n\n \n Excellent advice.\n \n That, and keep things in perspective.\n If we were to have this discussion in the real world, Archie would be laughed out of the place.\n \n But here in the micro-cosm of internet with its own \"rules\", we get something else.\n \n Quite frankly, if it gets to a person go take some time off from the boards.\n I think it's firmly established that Archie could stare at the sun all day, and even if he went blind he wouldn't be able to admit it emits light.\n \n The other item of interest about these threads is to note how it shifts the playing field, and how \"some\" people will actually come out and DEFEND Archie's extremist behavior. While they wouldn't be able to touch a lot of his behavior with a ten-foot pole, this gives a skewed perspective where they can actually DEFEND his antics.\n And it's interesting to note who jumps out of the wood-works to defend such antics.", 
   {}, 
   302869, 
   null, 
   1203900900.0
  ], 
  [
   325657, 
   null, 
   "Lihualee", 
   "Bump! thx !", 
   {
    "post_info": {
     "post_title": "good friend"
    }
   }, 
   303403, 
   null, 
   1222737420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How do we deal with this serious problem?", 
  "url": "http://www.4forums.com/political/liars-corner/10975-how-do-we-deal-serious-problem.html", 
  "breadcrumbs": [
   "Liars Corner"
  ], 
  "id_number": 10975, 
  "discussion_files": [
   [
    "12774.html", 
    "http://www.4forums.com/political/liars-corner/10975-how-do-we-deal-serious-problem-print.html"
   ]
  ], 
  "identifier": 10975
 }
]