[
 [
  [
   303126, 
   null, 
   "Steeeeve", 
   "This is a place holder to get things started. I plan on continuing a discussion we are currently having in the abortion forum with hopes that it will not get derailed since it will only be the two of us. \n \n Basically this thread will talk about the following:[*]Human rights and how they come to exist[*]Reasons for human rights[*]How human rights relate to abortion[*]How morality deals with the issues of abortion[*]What makes someone deserving of human rights\n There may be more to it.\n \n The invited posters are as follows:[*]Steeeeve[*]Another Opinion\n There may be others invited ONLY if agreed upon by ALL members of the currently invited list.\n \n My first post will be kind of linking this thread to the previous one of the abortion forum and then responding to a post where we left off.\n \n This will be edited on Monday since I will be gone on a trip until then.", 
   {
    "post_info": {
     "post_title": "Morality and Abortion - Another Opinion and Steeeeve"
    }
   }, 
   null, 
   null, 
   1203706800.0
  ], 
  [
   303694, 
   null, 
   "Steeeeve", 
   "Ok, then we both agree that \"human rights\" refers to the most critical of rights, not the more everyday rights of property, voting, etc.\n \n Perhaps there is a misunderstanding going on about what I mean by observation. Observation is a cataloguing of facts that arises to us through the senses. For example, one can say - that table is 6 feet long, or the sky is blue, or that man is relatively old. One can also observe that, for nearly every human being, if you damage them physically, then they will suffer pain. One can also observe that people have egos - some more, some less. One can also observe the range of human reactions to various existing moral systems. Observations themselves do not require any initial assumptions (unless you want to start making extreme arguements questioning whether our senses can tell us about reality, etc.). The analysis one makes of those observations DO require reasoned analysis. So, the observations themselves are \"A\" in your definition, and the analysis of observations are \"B\". Of course, this assumes that one uses objectivity to begin with to not purposely ignore some evidence or exagerate other evidence - which admittedly sometimes happens.\n \n There are basic rules of logic that are hard to disprove because they are so, well, logical. One plus one equals two. How well people use logic in their reasoning is another story. That is why debate and discussion is so useful when it comes to any claims of law or morality. Some people may genuinely think that they are making a reasoned arguement but their biases may keep them from seeing the subtleties. Other people are basing their reason on assumptions which they don't even realize they are making. So, I would agree that one can challenge people's reasoning but the challenge needs to be based on logic to make sense. Morality and law also are influenced by emotional appeals (we are both emotional and logical creatures after all), but emotional decisions made with out reason or logic have far too often led to very bad results. Reason is an incredibly useful tool in all areas of life - including morality and law.\n \n Again, by observation, I just mean a cataloguing of things that our senses show us about reality - not the analysis of those senses. If you would prefer I use a different word for that, in order to avoid confusion, then recommend one.\n \n I asked you to in this thread since you brought it up in this thread. You cannot make a statement comparing abortion to slavery and expect not to be challenged on it. \n \n You say that \"I assume in my example that human being is what it is.\" That is the main point. You think zygotes are human beings, so you apply rights to them just based on that definition. We don't think zygotes are human beings. So, any arguement you make concerning that definition is useless if we don't agree on a definition. To us, your arguements that \"zygotes are human beings and therefore deserve rights' seem just as arbitrary as a hypothetical claim one could make that \"unfertilized eggs are human beings and therefore deserve rights\". If we disagree on the term \"human being\" then such claims are useless.\n \n I would not condone a society which randomly allows people to be shot because I would not like to be randomly shot or face the fear of potentially being randomly shot. This is the usual \"do unto others\" arguement, or its converse of not treating others as you would not like to be treated. I think my mother had every right to abort me prior to my mental existence. Therefore, my moral approach is consistent.\n \n Not all rights, but those basic human rights that protect people from cruelty at the hands of others - yes. Sometimes, there is a balance of rights - as in self-protection. For example, if someone is about to kill you or your loved ones, you should have the right to defend yourself - by lethal force, if necessary. Similarly, in the case of late-term abortion, when the mother's life or major health is at risk, abortion might be justified from the point of view of self-protection. Otherwise, if there is no major self-protection arguement that balances the human rights of the mother with the human rights of the fetus, then then mother should have to carry that late term fetus to term.\n \n Mental development is not simply brain development of any sort. Mental means pertaining to the mind - from Late Latin mentalis, from Latin ment-, mens meaning mind. Since science tells us that our mentality originates in the brain, that is why we discuss the development of the brain. If I have given you the impression that it was the brain itself that was important, not the mental functioning of the brain, then please reference the post where my wording had given you that impression and I will be more careful about my wording. I have tried to be careful about my wording, so I really am interested why you would get that impression.\n \n Early brain waves themselves are not a sign of mental development. They are too disorganized which, along with analysis of early brains, shows a lack of communication between brain cells that is needed for mental existence. Even late-term organized brain waves do not guarantee a mental existence but support the possibility that a mental existence might be there. \n It is mental existence that matters. Self-awareness, as I understand it, requires a mind to recognize itself. I do not require a mind to recognize itself in order to say it exists. So, yes, self-awareness doesn't matter to me for the basis of human rights. That is a more developed mental state (which still happens quite early). My main moral drive is the \"do unto others\" which is itself largely driven by empathy. I can empathize with a mind, whether or not it recognizes itself. A being with a mind but no self-awareness can still suffer, have emotions, etc. - just like many animals.\n \n Well, I myself got the impression, mainly from many points you brought up, that you wanted to extend the definition of human being from the biological realm to abortion. However, I will let this point go since it is possible indeed that your purposes were different in your arguements with the other posters than with me. I would be curious, though, if the other pro-choice posters made the same interpretations I did. My guess is that they did but, once again, they should speak for themselves.\n\n \n Response pending...", 
   {}, 
   303126, 
   null, 
   1204139460.0
  ], 
  [
   330009, 
   null, 
   "Darn Republican", 
   "love to join up with this little foray.", 
   {
    "post_info": {
     "post_title": "Ohh.... I'd"
    }
   }, 
   303126, 
   null, 
   1225148280.0
  ], 
  [
   330032, 
   null, 
   "Shooterandproud", 
   "Me too, if it is agreed upon.", 
   {}, 
   330009, 
   null, 
   1225154700.0
  ], 
  [
   330276, 
   null, 
   "Another opinion", 
   "I would be fine with both of you joining - making a three or four way conversation. I will post a personal message to Steeeeve to see if he is still interested in this discussion and, if so, if he is fine with both of you joining in...", 
   {}, 
   330032, 
   null, 
   1225314720.0
  ], 
  [
   330582, 
   null, 
   "Another opinion", 
   "Steeeeve sent me a personal message that he is a bit too busy to participate now. So, if Darn Republican and ShooterandProud, if you are still interested, we could debate the points of the opening posts here and Steeeeve could join in if he has time. I will repeat them:\n \nBasically this thread will talk about the following:[*]Human rights and how they come to exist [*]Reasons for human rights [*]How human rights relate to abortion [*]How morality deals with the issues of abortion [*]What makes someone deserving of human rights\n\n \n So, are you both still interesting in debating these topics?", 
   {}, 
   330276, 
   null, 
   1225470000.0
  ], 
  [
   333017, 
   null, 
   "CUNxTime", 
   "I too would like to participate a bit, if it's alright. What caught my eye was the 'human rights' argument, explicitly where A. Opinion mentioned \"...Ok, then we both agree that \"human rights\" refers to the most critical of rights, not the more everyday rights of property, voting, etc.\" Let me know if I can join. Thanks.", 
   {}, 
   330582, 
   null, 
   1226864820.0
  ], 
  [
   333283, 
   null, 
   "Another opinion", 
   "I too would like to participate a bit, if it's alright. What caught my eye was the 'human rights' argument, explicitly where A. Opinion mentioned \"...Ok, then we both agree that \"human rights\" refers to the most critical of rights, not the more everyday rights of property, voting, etc.\" Let me know if I can join. Thanks.\n\n Since nobody else seems to have come back to this thread, it should be fine for you to join. The others can join in if they have interest. \n \n This differentiation between \"human rights\" and the everyday rights of property, voting, etc. was one made originally by Steeeeve that I agreed to since I didn't have much of an arguement against subdividing it that way. I personally do not have a good idea of how one clearly defines these critical rights - that is something that Steeeeve, if he did join, might best answer since he was the one that wanted to subdivide them that way. If the most critical rights are simply the ones that people feel most strongly about then the trouble arises that someone may feel as strongly about property rights as someone else might feel about freedom of speech, or as someone else might feel about having the right to control her own body. The value people place on certain rights can depend on the person.\n \n Either way, where morality and abortion are concerned, my general view is that the analysis of abortion rights need to take into account a balance of rights and a determination of when rights begin. Prior to the beginning of a mental existence, the fetus / embryo is just a developing body with \"nobody home\". I don't think mere bodies deserve rights. It is only once a fetus gains the possibility of a mental existence (the ability to think, feel, have emotions, a sense of self, the ability to feel pain - or any subset of that) that I think it makes sense to speak of it having rights. Neurology says that such mental processes cannot happen before roughly the beginning of the third trimester - when the cerebral cortex is sufficiently developed by growing neural connections. After that, one has to balance the rights of the fetus to the rights of the woman to her own body (which, prior to that point, was the only right that mattered).", 
   {}, 
   333017, 
   null, 
   1227030840.0
  ], 
  [
   333570, 
   null, 
   "CUNxTime", 
   "\n Either way, where morality and abortion are concerned, my general view is that the analysis of abortion rights need to take into account a balance of rights and a determination of when rights begin. Prior to the beginning of a mental existence, the fetus / embryo is just a developing body with \"nobody home\". I don't think mere bodies deserve rights. It is only once a fetus gains the possibility of a mental existence (the ability to think, feel, have emotions, a sense of self, the ability to feel pain - or any subset of that) that I think it makes sense to speak of it having rights. Neurology says that such mental processes cannot happen before roughly the beginning of the third trimester - when the cerebral cortex is sufficiently developed by growing neural connections. After that, one has to balance the rights of the fetus to the rights of the woman to her own body (which, prior to that point, was the only right that mattered).\n\n \n I agree with most of that, medically and otherwise. However, I don't think the choice side should argue the medical side of it. With the rapid development of science, we can't know what will be discovered in the future. I think that it should be a matter of equality and self determination. Throughout history (and still in some cultures) women have certainly be dealt a sorry hand. I feel that our society, today, is a great example of a truly legitimate and advanced civilization. One facet I examine to critique a culture and the one I find most telling, is the treatment of women. I can't fathom what it would be like to have to subvert my dreams and goals in life because I didn't have control over my own body. Abortion rights are truly the test of whether women and men are on the same footing. If a woman can't enjoy the same rights as men (sexual and otherwise) then the society is not truly equal and thus not truly legitimate.", 
   {}, 
   333283, 
   null, 
   1227214500.0
  ], 
  [
   333607, 
   null, 
   "Another opinion", 
   "I agree with most of that, medically and otherwise. However, I don't think the choice side should argue the medical side of it. With the rapid development of science, we can't know what will be discovered in the future. I think that it should be a matter of equality and self determination. Throughout history (and still in some cultures) women have certainly be dealt a sorry hand. I feel that our society, today, is a great example of a truly legitimate and advanced civilization. One facet I examine to critique a culture and the one I find most telling, is the treatment of women. I can't fathom what it would be like to have to subvert my dreams and goals in life because I didn't have control over my own body. Abortion rights are truly the test of whether women and men are on the same footing. If a woman can't enjoy the same rights as men (sexual and otherwise) then the society is not truly equal and thus not truly legitimate.\n\n I agree that the right to one's own body is a very important right and the main one that I agree should be used when a state tries to control that right. I would even philosophically personally call it a natural right...However, as with many rights, one might encounter a situation where one person's rights impinges upon the rights of another - so that a balance needs to be made. In self-protection, for example, someone who is attacking you to kill you usually has the right to life. However, you have the right to defend yourself - with lethal force if truly necessary - so that the self-defense arguement is often accepted in courtrooms as legitimate reasons for one person to infringe on the rights of another by killing them. \n \n Abortion is or, in my view and the view of many others should be, similar. At some point, we view that the fetus is developed enough that it ALSO deserves rights. I and many others argue that this point is at the beginning of a mental existence. Separation of Church and State thankfully would prevent an arbitrary determination of the start of this mental existence based on varying religious views of the soul (which, by the way, was considered to enter the body at quickening through most of Christian history). Instead, science is taken as the best legal measure of objective truths and neurologists say that thought, emotion, etc. cannot exist before the cerebral cortex is sufficiently developed - around the beginning of the third trimester. Most of the uncertainty currently lies in when, after that earliest point, the mind does exist - i.e. it may still not yet exist once sufficient neural connections are made, but might require even more development. Nevertheless, I am personally willing to give the fetus the benefit of the doubt, just as I would like to have the benefit of the doubt if I would be in potentially recoverable coma near the end of life. \n \n Alternatively, Roe vs Wade starts addressing fetal rights to life once the fetus reaches viability - also around the beginning of the third trimester. I personally find the Roe vs Wade stance currently comfortable since the time frames correspond. However, I worry that technological improvement might someday render a fetus viable much earlier and that, therefore, such a stance might restrict abortion rights to too early a stage.\n \n Anyway, those are my views. In your view, do you also consider that late stage fetuses (at the extreme, those just prior to birth) should have rights? If not, then why not?", 
   {}, 
   333570, 
   null, 
   1227224880.0
  ], 
  [
   333847, 
   null, 
   "CUNxTime", 
   "\n In your view, do you also consider that late stage fetuses (at the extreme, those just prior to birth) should have rights? If not, then why not?\n\n \n I had written a response to this and now its gone. Pooh! \n \n Anyway, I fully believe that that the unborn have rights. There should be strict time limits for abortion. I think that even in the earliest stages of pregnancy the baby has rights (which is why I'd agree that someone who kills a preg. woman should be charged with 2 crimes). It's just that in the early stage, the woman has a more of a right to her own body. As the pregnancy continues, the woman eventually has allowed the baby to gain more of a right to be born than she has to control her body. The important thing is that she have at some distinct point the ability to control her own destiny. By allowing that time to lapse the choice is made.", 
   {}, 
   333607, 
   null, 
   1227389940.0
  ], 
  [
   334079, 
   null, 
   "Another opinion", 
   "I had written a response to this and now its gone. Pooh! \n \n Anyway, I fully believe that that the unborn have rights. There should be strict time limits for abortion. I think that even in the earliest stages of pregnancy the baby has rights (which is why I'd agree that someone who kills a preg. woman should be charged with 2 crimes). It's just that in the early stage, the woman has a more of a right to her own body. As the pregnancy continues, the woman eventually has allowed the baby to gain more of a right to be born than she has to control her body. The important thing is that she have at some distinct point the ability to control her own destiny. By allowing that time to lapse the choice is made.\n\n I would agree with most of that. The only place where I would disagree is in viewing the early term fetuses as having rights also. I only view rights arriving with the arrival of mental existence.\n \n Either way, we both agree that there is a time limit during which she would have the right to an abortion. It is interesting to note that polls show that 2/3rds of Americans would allow for first trimester abortions (which surprisingly would mean that some self-proclaimed pro-life proponents would also fit under that category), but that most Americans would place limits on second trimester abortions and nearly all (84%) would limit third trimester abortions. I personally would place limits at around the beginning of the third trimester because of neurological arguements about the beginning of cognition/the mind. Where would you place the time limit?", 
   {}, 
   333847, 
   null, 
   1227559080.0
  ], 
  [
   334118, 
   null, 
   "CUNxTime", 
   "If restricting it to first term would make abortion more 'palatable' and get the people screaming at the terrified women headed into clinics, I'm all for it. Just as long as there is a well defined window that gives women time to find out, prepare, and get to a clinic if they feel that they can't bring a child into the world. I think the choice side has to understand that, while there will always be people who oppose ALL abortions, public opinion goes a long way. Those that want unlimited abortion up to 9 months including partial birth etc. are as misguided as those who are unmovable on the other side.", 
   {}, 
   334079, 
   null, 
   1227570900.0
  ], 
  [
   334195, 
   null, 
   "Another opinion", 
   "If restricting it to first term would make abortion more 'palatable' and get the people screaming at the terrified women headed into clinics, I'm all for it. Just as long as there is a well defined window that gives women time to find out, prepare, and get to a clinic if they feel that they can't bring a child into the world. I think the choice side has to understand that, while there will always be people who oppose ALL abortions, public opinion goes a long way. Those that want unlimited abortion up to 9 months including partial birth etc. are as misguided as those who are unmovable on the other side.\n\n It is interesting to note that the UK has abortion limits set at around the beginning of third trimester, while most of the rest of Europe has abortion limits set at around the end of the first trimester. As a pro-choice supporter who sees good reasons to limit third trimester abortions, but not second or first, I would support stricter rules on third trimester abortions, but not on second unless absolutely politically necessary. The types of exceptions to third trimester abortions that I would support would include risk to mothers life, significant risk to mother's health, and malformed fetuses - though I am personally open to arguements about other exceptions. Granted that most third trimester abortions already fall under such exceptions, but I do think that there would be a political and reasonable justification in presenting a law to more clearly outline such limits and exceptions anyway. I suspect that many Democrats would also be willing to present legislation to more clearly define third trimester abortion limits, but they are afraid of slippery-slope wording being put in by the pro-life crowd that could risk having all abortions outlawed. I don't really blame the pro-life crowd since it is precisely the third trimester abortion photos that draw the most support. There is far less support (indeed, only ~30%) for strictly limiting first trimester abortions.", 
   {}, 
   334118, 
   null, 
   1227633480.0
  ], 
  [
   334535, 
   null, 
   "Joel_Henderson", 
   "It is interesting to note that the UK has abortion limits set at around the beginning of third trimester, while most of the rest of Europe has abortion limits set at around the end of the first trimester. As a pro-choice supporter who sees good reasons to limit third trimester abortions, but not second or first, I would support stricter rules on third trimester abortions, but not on second unless absolutely politically necessary. The types of exceptions to third trimester abortions that I would support would include risk to mothers life, significant risk to mother's health, and malformed fetuses - though I am personally open to arguements about other exceptions. Granted that most third trimester abortions already fall under such exceptions, but I do think that there would be a political and reasonable justification in presenting a law to more clearly outline such limits and exceptions anyway. I suspect that many Democrats would also be willing to present legislation to more clearly define third trimester abortion limits, but they are afraid of slippery-slope wording being put in by the pro-life crowd that could risk having all abortions outlawed. I don't really blame the pro-life crowd since it is precisely the third trimester abortion photos that draw the most support. There is far less support (indeed, only ~30%) for strictly limiting first trimester abortions.\n\n \n \n What's the difference? Do you have some inside information on EXACTLY when life begins, that they don't? \n \n Or do you simply think \"viability\" has something to do with it, i.e. it's ok to kill your kids when their lives depend on you?\n \n As for life-risks, these are clearly so rare as to warrant exeption; rather, they're talking about \"health\" risks, which could simply mean her being depressed over not being ALLOWED to have an abortion-- which is like saying that if someone is depressed over not having a million dollars, then their health-insurance better cough up the megabuck. This was mentioned at the Obama-McCain debates, and Obama didn't deny it.\n \n Constitutionally speaking, women should have the same \"opt-out window\" that MEN have-- no more.", 
   {}, 
   334195, 
   null, 
   1227821160.0
  ], 
  [
   334872, 
   null, 
   "Another opinion", 
   "What's the difference? Do you have some inside information on EXACTLY when life begins, that they don't? \n\n Pro-life people generally state that life begins at conception and that this is what is most critical in determining rights of the fetus. Those of us on the pro-choice side obviously disagree. What are the changes that happen at conception that are so critical? At conception, the egg gets a second half of DNA added from the sperm and chemical reactions take place which start the growth process. This is the beginning of growth which, from one interpretation, could indeed be called the beginning of life (other interpretations acknowledge that the egg and sperm are also alive, etc.). However, AT THAT MOMENT and up to roughly the beginning of the third trimester, all that exists is various stages of a developing body with \"nobody home\" - no mind: no emotions, no thoughts, no sense of pain, no senses whatsoever - nothing. Many of us on the pro-choice side, including myself, don't think that such bodies deserve rights - especially given the very important right of a woman over her own body that such fetal rights would challenge. However, once there exists some level of mind in the fetus (the earliest possible point being around the beginning of the third trimester), then many of us would view that such a being deserves rights, at which point our concern is how to balance rights of the fetus with the rights of the mother over her own body - leading, in my view, to the exceptions to third trimester abortion restrictions I mentioned in my last post. \n \nAs for life-risks, these are clearly so rare as to warrant exeption; rather, they're talking about \"health\" risks, which could simply mean her being depressed over not being ALLOWED to have an abortion-- which is like saying that if someone is depressed over not having a million dollars, then their health-insurance better cough up the megabuck. This was mentioned at the Obama-McCain debates, and Obama didn't deny it.\n\n I agree that the health exception is insufficiently legally defined. I tried to start a thread here once to explore it, but it didn't get very far. My own views are that minimal health problems (ex. a pregnancy leading to an altered metabolism, a minor increase in risks of heart problems, any rare but mild type of psychological problem such as the one you mentioned) should not be excepted from third trimester abortion restrictions, but major health problems (ex. major risk of paralysis or other permanent grand disability, major risk of near-term heart attack, etc.) should be excepted. The gray region in between is what poses the main problems and needs to be further explored. \n \nConstitutionally speaking, women should have the same \"opt-out window\" that MEN have-- no more.\n\n My personal view is that men should also have an \"opt out\" window, but one that is shorter than the woman's \"opt out\" window since many decisions on abortion depend on whether or not the resulting child can be supported - where many women could not support the child without the father. However, I also aknowledge that there are many women who are pro-life who essentially have no \"opt out\" window. There, I think that any man who knowingly engages in sex with a woman of pro-life views should have the same responsibilities as laws currently demand - i.e. that he would be responsible in helping to support any resulting child.", 
   {}, 
   334535, 
   null, 
   1228149060.0
  ], 
  [
   335107, 
   null, 
   "Ryuuichi", 
   "\n \n My personal view is that men should also have an \"opt out\" window, but one that is shorter than the woman's \"opt out\" window since many decisions on abortion depend on whether or not the resulting child can be supported - where many women could not support the child without the father. However, I also aknowledge that there are many women who are pro-life who essentially have no \"opt out\" window. There, I think that any man who knowingly engages in sex with a woman of pro-life views should have the same responsibilities as laws currently demand - i.e. that he would be responsible in helping to support any resulting child.\n\n \n Why? A woman doesn't have to have a child if the man happens to be pro-life so why should this be reversed?", 
   {}, 
   334872, 
   null, 
   1228267200.0
  ], 
  [
   335227, 
   null, 
   "Another opinion", 
   "Why? A woman doesn't have to have a child if the man happens to be pro-life so why should this be reversed?\n\n If a man knowingly engages in sex with a pro-life woman, then he would have known ahead of time that any pregnancy would result in a child - just as if the laws had forced that child to be carried. For the pro-life woman, there is no real choice so I would think that there should be no choice for the man either. Again, this is only if this knowledge is firmly established ahead of time (which might be hard to prove in real world situations). \n \n If, on the other hand, a woman is pro-choice, then it is her choice to keep the child and so the man should have a choice as well. However, a woman cannot decide to be pro-life in the middle of her pregnancy since there would have been no way for the man to know ahead of time that she would change her mind. It all comes down to what was known ahead of time about the result of a pregnancy.", 
   {}, 
   335107, 
   null, 
   1228323960.0
  ], 
  [
   335250, 
   null, 
   "Ryuuichi", 
   "If a man knowingly engages in sex with a pro-life woman, then he would have known ahead of time that any pregnancy would result in a child - just as if the laws had forced that child to be carried. For the pro-life woman, there is no real choice so I would think that there should be no choice for the man either. Again, this is only if this knowledge is firmly established ahead of time (which might be hard to prove in real world situations). \n \n If, on the other hand, a woman is pro-choice, then it is her choice to keep the child and so the man should have a choice as well. However, a woman cannot decide to be pro-life in the middle of her pregnancy since there would have been no way for the man to know ahead of time that she would change her mind. It all comes down to what was known ahead of time about the result of a pregnancy.\n\n \n So basically a woman can opt out regardless of what the man believes even if she knew he felt a certain way but a man can't?\n \n According to you if a man's pro life it doesn't matter but if a woman is the man should suck it up and pay for the child. You do realise that's hypocrisy don't you?", 
   {}, 
   335227, 
   null, 
   1228334880.0
  ], 
  [
   335259, 
   null, 
   "Another opinion", 
   "So basically a woman can opt out regardless of what the man believes even if she knew he felt a certain way but a man can't?\n \n According to you if a man's pro life it doesn't matter but if a woman is the man should suck it up and pay for the child. You do realise that's hypocrisy don't you?\n\n I do realize there is an imbalance but that imbalance is defined by nature in the fact that enforced pregnancy endangers a woman's right to her own body. There is no equivalent danger to men - his rights to his own body are not in danger. Any other types of rights (ex. right to support or not to support) are or should be applied equally to both parents. For example, I don't think that a mother should be able to just abandon her child to the care of its father without having a responsibility to at least financially help support that child.\n \n Also, once again, the man would only have his \"opting out\" option taken away if it was clear ahead of time that a pregnancy would lead to a child in need of support. If the situation was unclear ahead of time (ex. the woman is pro-choice or doesn't in some provable way state that she is pro-life) then the man still has the opt-out option. At least that is my view. That is better than the way it currently stands, where the man doesn't have a choice whether or not the woman is pro-choice or pro-life.", 
   {}, 
   335250, 
   null, 
   1228337220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Morality and Abortion - Another Opinion and Steeeeve", 
  "url": "http://www.4forums.com/political/challengers-corner/10984-morality-abortion-another-opinion-steeeeve.html", 
  "breadcrumbs": [
   "Challengers Corner"
  ], 
  "id_number": 10984, 
  "discussion_files": [
   [
    "32821.html", 
    "http://www.4forums.com/political/challengers-corner/10984-morality-abortion-another-opinion-steeeeve-print.html"
   ], 
   [
    "32822.html", 
    "http://www.4forums.com/political/challengers-corner/10984-morality-abortion-another-opinion-steeeeve-2-print.html"
   ]
  ], 
  "identifier": 10984
 }
]