[
 [
  [
   303465, 
   null, 
   "jyoshu", 
   "\"Gilles Langis, a senior forecaster with the Canadian Ice Service in Ottawa, says the Arctic winter has been so severe the ice has not only recovered, it is actually 10 to 20 cm thicker in many places than at this time last year.\n \n OK, so one winter does not a climate make. It would be premature to claim an Ice Age is looming just because we have had one of our most brutal winters in decades.\n \n But if environmentalists and environment reporters can run around shrieking about the manmade destruction of the natural order every time a robin shows up on Georgian Bay two weeks early, then it is at least fair game to use this winter's weather stories to wonder whether the alarmist are being a tad premature.\n \n And it's not just anecdotal evidence that is piling up against the climate-change dogma.\"\n \n More at http://www.nationalpost.com/opinion/columnists/story.html?id=332289", 
   {
    "post_info": {
     "post_title": "&quot;Forget global warming: Welcome to the new Ice Age&quot;"
    }
   }, 
   null, 
   null, 
   1203971820.0
  ], 
  [
   303475, 
   null, 
   "Steeeeve", 
   "I saw an article the other day talking about the lack of sunspots may cause a mini ice age similar to the one in the 1600s. I'm not sure how credible the data is but interesting non-the-less.\n \n http://www.dailytech.com/article.aspx?newsid=10630\n \n \nIn 2005, Russian astronomer Khabibullo Abdusamatov predicted the sun would soon peak, triggering a rapid decline in world temperatures. Only last month, the view was echoed by Dr. Oleg Sorokhtin, a fellow of the Russian Academy of Natural Sciences. who advised the world to \"stock up on fur coats.\" Sorokhtin, who calls man's contribution to climate change \"a drop in the bucket,\" predicts the solar minimum to occur by the year 2040, with icy weather lasting till 2100 or beyond.\n", 
   {}, 
   303465, 
   null, 
   1203976260.0
  ], 
  [
   303495, 
   null, 
   "obvious_child", 
   "As I understand it, Global warming doesn't mean that all seasons are warmer. Due to the changes in ocean currents from the salinity ratios changing, less heat is carried towards the poles and less cold towards the equatorial areas. Therefore, winters will be continue to get colder and summers will keep getting hotter. Thus, having a really bad winter isn't a sign that warming isn't true as the theory predicts that will happen.", 
   {}, 
   303465, 
   null, 
   1203981120.0
  ], 
  [
   303537, 
   null, 
   "CUNxTime", 
   "Well, if it gets colder, my property will be worth more down here on the Redneck Riviera. If it gets warmer, the oceans will rise and my property 20 miles in from the ocean will be oceanfront. Again, I win.\n \n If Al Gore stops flying on private jets or cutting his electric bills to under $1500 a month, I'm going to start worrying that this Global Warming might actually have some truth to it...", 
   {}, 
   303495, 
   null, 
   1203998520.0
  ], 
  [
   303549, 
   null, 
   "Archangel", 
   "This subject reminded me of another debate on Global Warming Jyoshu started a couple of months ago. So I did a search, and found this post. I came across evidence for that debate that scientists suspected Solar Activity and specifically sun spots as being the cause for Global Warming and also for the melting of the Ice Caps on Mt Kilimanjaro back in the 1880s. So we have seen evidence of both extremes attributed to the Sun. Interesting articles:\n \n http://www.4forums.com/political/showpost.php?p=296672&postcount=60", 
   {}, 
   303537, 
   null, 
   1204004400.0
  ], 
  [
   303550, 
   null, 
   "CUNxTime", 
   "Also, didn't I read somewhere that some of the testing sites that they used to calculate the temps were horribly placed, like in the exhaust of AC units and other places that could throw off the accuracy?", 
   {}, 
   303549, 
   null, 
   1204004820.0
  ], 
  [
   303560, 
   null, 
   "Symbiote", 
   "I agree. In fact global warming isn't about warming at all, it's about the warming of the cooling. Unless we can warm the cooling the ice caps will melt as the poles get colder, bringing hot summers to the northern hemisphere and frosty typhoons to the super hot equator. In addition the sea leavels will rise, increasing the diameter of the arctic circle and cutting off shipping through the Panama Canal. Locusts, Malaria, AIDS, and a rash on your groin are also likely consequences of a failure to warm the cooling.\n \n As you can see, global warming theory is second only to freudian psychoanalysis in its unfalsifiability (aka, irrefutability!)", 
   {}, 
   303495, 
   null, 
   1204028580.0
  ], 
  [
   305061, 
   null, 
   "trebor", 
   "This subject reminded me of another debate on Global Warming Jyoshu started a couple of months ago. So I did a search, and found this post. I came across evidence for that debate that scientists suspected Solar Activity and specifically sun spots as being the cause for Global Warming and also for the melting of the Ice Caps on Mt Kilimanjaro back in the 1880s. So we have seen evidence of both extremes attributed to the Sun. Interesting articles:\n \n http://www.4forums.com/political/showpost.php?p=296672&postcount=60\n\n \n They have pretty much ruled out that the changes in sun spots is causing the warming effects.", 
   {}, 
   303549, 
   null, 
   1205181240.0
  ], 
  [
   308819, 
   null, 
   "Miniare", 
   "Hello, \n perhaps, you know that a few years ago the US Environmental Protection Agency submitted a report to the UN that endorses that \"human activities such as oil refining, gas and coal firing, power generation and car emissions are significant causes of global warming\". According to the White House, every country should reduce its greenhouse gas emissions (carbon dioxide) significantly. \n However, according to what reputable climate experts would say (for example, Rob Carter from James Cook University in Townsville is among them), global warming is cyclical and depends on planet's evolution stages. Besides that, it was cleared out that \"carbon dioxide is not a harmful gas and has helped produce the \"green\" world agricultural revolution.\" Also according to them, the \"rising level of carbon dioxide in the atmosphere in recent decades had boosted agricultural crop yields\". So why would Washington push the panic button? I think the answer is that American top politics seek ways to make America's political rivals become less mighty as they would have to reduce their oil, gas and coal production and consumption. \n According to Professor Carter, a marine geologist who is research professor in the university's Marine Geophysical Laboratory, the decrease in amount of greenhouse gases would deliver no significant cooling - less than 0.02 degrees Celsius by 2050. And it would cost some countries billions, even trillions, of dollars to make relevant changes in their energy structure. So what I say, Washington, stop cheating on us!", 
   {
    "post_info": {
     "post_title": "US's the main scaremonger for the global warming lobby?"
    }
   }, 
   305061, 
   null, 
   1208367960.0
  ], 
  [
   308828, 
   null, 
   "Archangel", 
   "They have pretty much ruled out that the changes in sun spots is causing the warming effects.\n\n \n Who's they?", 
   {}, 
   305061, 
   null, 
   1208374680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  \"Forget global warming: Welcome to the new Ice Age\"", 
  "url": "http://www.4forums.com/political/environmental-debates/10998-forget-global-warming-welcome-new-ice-age.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 10998, 
  "discussion_files": [
   [
    "32604.html", 
    "http://www.4forums.com/political/environmental-debates/10998-forget-global-warming-welcome-new-ice-age-print.html"
   ]
  ], 
  "identifier": 10998
 }
]