[
 [
  [
   303644, 
   null, 
   "Undeterred", 
   "The worst song ever recorded (and released as single) was \"Calling Occupants of Interplanetary Craft\", by the Carpenters. (Well actually the song was written and originally released by a band named \"Klaatu\" in 1976, and the Carpenters released it about a year later.) \n \n To start with, check out this sample of lyrics -\n \n Please interstellar policemen\n Won't you give us a sign give us a sign that we've reached you\n \n With your mind you have ability to form\n And transmit thought energy far beyond the norm\n You close your eyes, you concentrate, together that's the way\n To send a message we declare World Contact Day\n \n This song wins the \"Worst Song Ever\" Grammy. Or does it? What's the worst song ever?", 
   {
    "post_info": {
     "post_title": "The Worst Song Ever."
    }
   }, 
   null, 
   null, 
   1204087080.0
  ], 
  [
   303662, 
   null, 
   "Iuris", 
   "Yer 'aven't 'eard me singin', 'ave yer? :)", 
   {}, 
   303644, 
   null, 
   1204104660.0
  ], 
  [
   303663, 
   null, 
   "snakespit", 
   "Hmmm...toss-up. It's either that Petula Clark song Downtown or that one that goes \"I get knocked down...but I get up again...\", I think that was by Chumba Wumba...maybe I'm mistaken. Anyway, for some reason, I'd like to knock everyone who was ever involved with the production of those 2 songs down, never to see them get up again. Those 2 songs have a tendency to make me feel this tiny little spot of pain deep in my brain just to the right and about 1mm down from it's center point that makes me want to punch nuns.\n \n Either those 2, or anything by ABBA. emoticon_xclown", 
   {}, 
   303662, 
   null, 
   1204107000.0
  ], 
  [
   303681, 
   null, 
   "jitobear", 
   "\"We Built This City\" by Jefferson Starship - soo disappointing considering that band's original incarnation.", 
   {}, 
   303663, 
   null, 
   1204133640.0
  ], 
  [
   303697, 
   null, 
   "DrNo", 
   "\"Shiny Happy People\" by REM. And I love REM. But that song makes me want to violently stab out my own ear drums when I hear it.", 
   {}, 
   303644, 
   null, 
   1204140540.0
  ], 
  [
   303702, 
   null, 
   "JimStPete", 
   "The two songs that I actually thought were a joke when I heard them only to realize they were REAL songs that sold records: Afternoon Delight, Seasons In The Sun!", 
   {}, 
   303697, 
   null, 
   1204143300.0
  ], 
  [
   303744, 
   null, 
   "isly ilwott", 
   "I would vote for \"Tip Toe thru the Tulips\" by Tiny Tim.", 
   {
    "post_info": {
     "post_title": "dating myself"
    }
   }, 
   303702, 
   null, 
   1204156020.0
  ], 
  [
   303746, 
   null, 
   "thelmoose", 
   "The worst song ever recorded (and released as single) was \"Calling Occupants of Interplanetary Craft\", by the Carpenters. (Well actually the song was written and originally released by a band named \"Klaatu\" in 1976, and the Carpenters released it about a year later.) \n \n To start with, check out this sample of lyrics -\n \n Please interstellar policemen\n Won't you give us a sign give us a sign that we've reached you\n \n With your mind you have ability to form\n And transmit thought energy far beyond the norm\n You close your eyes, you concentrate, together that's the way\n To send a message we declare World Contact Day\n \n This song wins the \"Worst Song Ever\" Grammy. Or does it? What's the worst song ever?\n\n \n I never knew The Carpenters did this. Sounds awful. \n \n BUT, to put it in context, the Klaatu album in 1976 was attempting that sci-fi \"concept album\" genre (a la Ziggy Stardust) that was trying to be \"serious\" and tell a story. Granted the lyrics are contrived and attempt to be poetry, but with the overproduced synthesized music blaring and just the right chemical extras, there was a little something there. \n \n Though I haven't heard it in 30 years and it is probably #### as you suggest.", 
   {}, 
   303644, 
   null, 
   1204157040.0
  ], 
  [
   303795, 
   null, 
   "CUNxTime", 
   "One song I can't stand is 'Steppin Out' when MTV first came on (I guess I was about 7) they only had like 2 videos, 'Video Killed the Radio Star' and 'Steppin Out.' They played it over and over and over, man I hated that! Also, just about anything by AC/DC.emoticon_xkill", 
   {}, 
   303746, 
   null, 
   1204215360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Worst Song Ever.", 
  "url": "http://www.4forums.com/political/fun-debates/11002-worst-song-ever.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 11002, 
  "discussion_files": [
   [
    "10230.html", 
    "http://www.4forums.com/political/fun-debates/11002-worst-song-ever-print.html"
   ]
  ], 
  "identifier": 11002
 }
]