[
 [
  [
   304009, 
   null, 
   "obvious_child", 
   "How bad -- how ugly, how far over the line of decency -- is it to invoke Barack Obama's middle name in attacking him?\n \n It's so ugly and so far over the line that not even Alan Keyes in his most overwrought, spittle-flecked moments did it during his 2004 Senate run against Obama in Illinois....\n \n The only reason to say \"Barack Hussein Obama,\" as radio talk show host Bill Cunningham did repeatedly Tuesday in warming up a John McCain campaign rally in Cincinnati, is to try to excite anti-Muslim, anti-Arab prejudices (though Obama is neither Muslim nor of Arab descent) and not so subtly suggest that Obama's actually a slippery foreigner.\n \n Obama is \"a stealth candidate, a Manchurian candidate,\" Cunningham said later on Fox News Channel, his reference being to a book and movie in which a presidential contender has been brainwashed into becoming a sleeper agent for the Communist Party.\n \n Cunningham was livid that McCain had quickly and forcefully repudiated his odious appeal to prejudice, so he used it again and again-a performance similar to that of right-wing harridan Ann Coulter two weeks ago on Fox News in which she smirked that she prefers to say \"B. Hussein Obama.\"\n \n Why?\n \n \"I think it's funny,\" she said.\n\n \n http://blogs.chicagotribune.com/news_columnists_ezorn/2008/02/middle-name-cal.html\n \n This reminds me, among other things, of people who attack someone over their grammar mistakes. As if that had anything to do with the validity of their arguments.", 
   {
    "post_info": {
     "post_title": "Are the Republicans Grasping For Straws?"
    }
   }, 
   null, 
   null, 
   1204332120.0
  ], 
  [
   304033, 
   null, 
   "antonia", 
   "John Sidney McCain III\n Hillary Diane Rodham Clinton\n Barack Hussein Obama, Jr.\n \n The full names for each, as reported in wikipedia.", 
   {}, 
   304009, 
   null, 
   1204339920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Are the Republicans Grasping For Straws?", 
  "url": "http://www.4forums.com/political/elections-debates/11012-republicans-grasping-straws.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11012, 
  "discussion_files": [
   [
    "25588.html", 
    "http://www.4forums.com/political/elections-debates/11012-republicans-grasping-straws-print.html"
   ]
  ], 
  "identifier": 11012
 }
]