[
 [
  [
   304637, 
   null, 
   "jim's trucking", 
   "http://web.israelinsider.com/views/12681.htm\n \n Dan Rather, Katie Couric, and an Israeli commando were captured by terrorists in Iraq. The leader of the terrorists told them that he would grant them each one last request before they were beheaded.\n \n Dan Rather said, \"Well, I'm a Texan, so I'd like one last bowlful of hot spicy chili.\"\n \n The leader nodded to an underling who left and returned with the chili.\n \n Rather ate it all and said, \"Now I can die content.\"\n \n Katie Couric said, \"I'm a reporter to the end. I want to take out my tape recorder and describe the scene here and what's about to happen. Maybe someday someone will hear it and know that I was on the job till the end.\"\n \n The terror leader directed an aide to hand over the tape recorder and Couric dictated some comments. She then said, \"Now I can die happy.\"\n \n The leader turned and said, \"And now, Mr. Israeli tough guy, what is your final wish?\"\n \n \"Kick me in the XXX,\" said the soldier.\"\n \n \"What?\" asked the leader? \"Will you mock us in your last hour?\"\n \n \"No, I'm not kidding. I want you to kick me in the XXX,\" insisted the Israeli.\n \n So the leader shoved him into the open and kicked him in the XXX.\n \n The soldier went sprawling, but rolled to his knees, pulled a 9 mm pistol from under his flak jacket, and shot the leader dead. In the resulting confusion, he jumped to his knapsack, pulled out his carbine and sprayed the terrorists with gunfire.\n \n In a flash, all terrorists were either dead or fleeing for their lives.\n \n As the soldier was untying Rather and Couric, they asked him, \"Why didn't you just shoot them in the beginning? Why did you ask them to kick you in the XXX first?\"\n \n \"What?\" replied the Israeli, \"and have you two #######s report that I was the aggressor?!", 
   {
    "post_info": {
     "post_title": "A joke...but not far from reality!"
    }
   }, 
   null, 
   null, 
   1204820880.0
  ], 
  [
   304648, 
   null, 
   "Iuris", 
   "Well, given the Israeli commando was in Iraq...", 
   {}, 
   304637, 
   null, 
   1204827000.0
  ], 
  [
   305207, 
   null, 
   "Kronus", 
   "What a horrible bit of propoganda. That's should be beneath you Jim. emoticon_cry", 
   {}, 
   304648, 
   null, 
   1205253300.0
  ], 
  [
   305217, 
   null, 
   "jim's trucking", 
   "What a horrible bit of propoganda. That's should be beneath you Jim. emoticon_cry\nYes...I feel soooooooooo contrite!emoticon_rolleyes", 
   {}, 
   305207, 
   null, 
   1205263800.0
  ], 
  [
   305240, 
   null, 
   "Kronus", 
   "Yes...I feel soooooooooo contrite!emoticon_rolleyes\n\n \n Yeah, that's why I said it should be beneath you, not that it actually was. ;)", 
   {}, 
   305217, 
   null, 
   1205270520.0
  ], 
  [
   305258, 
   null, 
   "jim's trucking", 
   "Yeah, that's why I said it should be beneath you, not that it actually was. ;)\nActually, you said \"That's should be beneath you Jim.\" meaning \"That is should be beneath you Jim.\"\n \n I was soooooooo confused. I didn't know whether you meant the \"is\" or the \"should\".\n \n I also don't know how to get under a \"you Jim\". What you should have said, if you meant to use \"should\" is, \n \n \n \"That should be beneath you, Jim.\"\n \n \n If this is your first mistake, please ignore this notice. You're forgiven.", 
   {}, 
   305240, 
   null, 
   1205273580.0
  ], 
  [
   305269, 
   null, 
   "Kronus", 
   "Actually, you said \"That's should be beneath you Jim.\" meaning \"That is should be beneath you Jim.\"\n \n I was soooooooo confused. I didn't know whether you meant the \"is\" or the \"should\".\n \n I also don't know how to get under a \"you Jim\". What you should have said, if you meant to use \"should\" is, \n \n \"That should be beneath you, Jim.\"\n \n If this is your first mistake, please ignore this notice. You're forgiven.\n\n \n In point of fact my mistake was initally typing \"That's beneath you\". I realized I was wrong, and stuck in \"should be\" without taking off the 's.\n \n Your mistake is being a grammar nazi, or more accuarately a typo nazi. It's really obnoxious, and there's no call to be a jerk like that.", 
   {}, 
   305258, 
   null, 
   1205276520.0
  ], 
  [
   305270, 
   null, 
   "smiley", 
   "In point of fact my mistake was initally typing \"That's beneath you\". I realized I was wrong, and stuck in \"should be\" without taking off the 's.\n \n Your mistake is being a grammar nazi, or more accuarately a typo nazi. It's really obnoxious, and there's no call to be a jerk like that.\n\n He's right! And don't point out the spelling mistake in this one either. :p \n \n Smiley", 
   {}, 
   305269, 
   null, 
   1205276820.0
  ], 
  [
   305282, 
   null, 
   "CUNxTime", 
   "That is a GREAT joke! And so near the truth!", 
   {}, 
   305270, 
   null, 
   1205284140.0
  ], 
  [
   305396, 
   null, 
   "jim's trucking", 
   "In point of fact my mistake was initally typing \"That's beneath you\". I realized I was wrong, and stuck in \"should be\" without taking off the 's.\nI knew that, too.\n \n \n \n\n \n Your mistake is being a grammar nazi, or more accuarately a typo nazi. It's really obnoxious, and there's no call to be a jerk like that.\nNeither type nazi am I. My being obnoxious is your fault...you're far to sensitive to mild rejection and public exposure of your shortcomings...and I fully realize there's been no call for my critiques of grammar and spelling. I do it voluntarily. There is no legitimate excuse for sloveness and careless expression of thought.\n \n \nHe's right! And don't point out the spelling mistake in this one either. :p \n \n Smiley\nI see none...except that your screen name is smiley, not Smiley.", 
   {}, 
   305270, 
   null, 
   1205346720.0
  ], 
  [
   305406, 
   null, 
   "Kronus", 
   "\n Neither type nazi am I. My being obnoxious is your fault... \n\n At least take responsibility for your own actions.\n \n \n\n and I fully realize there's been no call for my critiques of grammar and spelling. I do it voluntarily. \n\n So you admit you do it willing and with no due cause, but it isn't your fault? Whatever. I'll try not to underestimate how low you might sink in the future.", 
   {}, 
   305396, 
   null, 
   1205349660.0
  ], 
  [
   305411, 
   null, 
   "CUNxTime", 
   "Did I miss something guys? There seems to be an awful lot of animosity going on here.", 
   {}, 
   305406, 
   null, 
   1205352720.0
  ], 
  [
   305421, 
   null, 
   "Kronus", 
   "Did I miss something guys? There seems to be an awful lot of animosity going on here.\n\n \n If you did miss something, you're not the only one. Jim has apparently decided he wants me to think he's a jerk. Why, I couldn't tell you, but it worked.", 
   {}, 
   305411, 
   null, 
   1205354460.0
  ], 
  [
   305430, 
   null, 
   "CUNxTime", 
   "I think we all need a little of Rodney King's just gettin' alongemoticon_love ! Especially on the Joke threademoticon_xhoho", 
   {}, 
   305421, 
   null, 
   1205357340.0
  ], 
  [
   305562, 
   null, 
   "jim's trucking", 
   "At least take responsibility for your own actions.\nI do. The fact that you become upset when someone points out your mistakes does not make the pointer wrong. Surely, you've not mutated into a crybaby, for God's sake!\n \n \n\n So you admit you do it willing and with no due cause, but it isn't your fault?\nNo. I do it willingly and with due cause. Your being upset is not my fault. It is your's for making the mistake in the first place.\n \n \n Whatever. I'll try not to underestimate how low you might sink in the future.\nHow low I sink in the future has little if anything to do with what you think is low.\n \n \n \nDid I miss something guys? There seems to be an awful lot of animosity going on here.\nHatfields and McCoys.\n \n \nIf you did miss something, you're not the only one. \nWho are the others?\n \n \n Jim has apparently decided he wants me to think he's a jerk. \nThere you go again...guessing at my motivations.\n \n \n Why, I couldn't tell you, but it worked.\nCould you define \"jerk\" as used in the context of this exchange?\n \n \nI think we all need a little of Rodney King's just gettin' alongemoticon_love ! Especially on the Joke threademoticon_xhoho\nAll I need is love...emoticon_love \n dant\n tahdant\n tahdah\n \n All I need is love...emoticon_love \n \n dant \n tahdant\n tahdah\n \n All I need is love...emoticon_love \n \n Love is all I need.emoticon_love emoticon_love emoticon_love \n \n \n \n The Beatles said it!", 
   {}, 
   305430, 
   null, 
   1205430360.0
  ], 
  [
   305948, 
   null, 
   "Kronus", 
   "I do. The fact that you become upset when someone points out your mistakes does not make the pointer wrong. Surely, you've not mutated into a crybaby, for God's sake!\n \n No. I do it willingly and with due cause. Your being upset is not my fault. It is your's for making the mistake in the first place.\n \n\n \n \"Hey Kronus, you forgot a comma.\" That's pointing out a mistake. You were sarcastic, condescending, and mean spirted. In short, insulting. Why, I really have no idea, but clearly you meant to insult me. An insult from you doesn't actually bother me all that much, but please at least have the decency to admit that that's what you were doing. Or not, I guess. In the end I can't really get all that worked up about it, I'm just confused by your behavior; both the insults and the lying about the insults.", 
   {}, 
   305562, 
   null, 
   1205458140.0
  ], 
  [
   306020, 
   null, 
   "jim's trucking", 
   "\"Hey Kronus, you forgot a comma.\" \nI never said that. If you don't retract that claim, I will report you in the Liar's Corner and demand an apology. LOL\n \n \n That's pointing out a mistake. \nTrue\n \n \n You were sarcastic, condescending, and mean spirted.\nNone of the above.\n \n \n In short, insulting. Why, I really have no idea, but clearly you meant to insult me.\nNot at all. \n \n \n An insult from you doesn't actually bother me all that much, but please at least have the decency to admit that that's what you were doing. \nI would, but it wasn't. I was making light fun of the human mistakes you made, similar to those we all make from time to time...in an effort to express constructive criticism and add levity to 4forums in the Fun Debates Forum.\n \n \n Or not, I guess. \n?? \n \n \nIn the end I can't really get all that worked up about it, I'm just confused by your behavior; both the insults and the lying about the insults.\nYou appear to be more shaken than claimed.\n \n Please indicate where I lied. Don't make me have to go to the Liar's Corner and seek help from those who might agree with me. \n \n Better yet...just go buy yourself a drink and charge it to me.emoticon_xhoho", 
   {}, 
   305948, 
   null, 
   1205545140.0
  ], 
  [
   307308, 
   null, 
   "Phyllis", 
   "Since we're in the business of correcting grammar and spelling mistakes:\n \n \nMy being obnoxious is your fault...you're far to sensitive to mild rejection and public exposure of your shortcomings...\n\n Should not you have typed, \"you're far too sensitive to\" rather than what you typed? After all, \n \n \nThere is no legitimate excuse for sloveness and careless expression of thought.\n\n I have no idea what \"sloveness\" is, but I am in total agreement with you.emoticon_xclown \n \n I'm just having fun, really.", 
   {}, 
   305396, 
   null, 
   1207179240.0
  ], 
  [
   307313, 
   null, 
   "Mucusaur", 
   "what a #### joke", 
   {}, 
   307308, 
   null, 
   1207182120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A joke...but not far from reality!", 
  "url": "http://www.4forums.com/political/fun-debates/11035-joke-but-not-far-reality.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 11035, 
  "discussion_files": [
   [
    "22030.html", 
    "http://www.4forums.com/political/fun-debates/11035-joke-but-not-far-reality-print.html"
   ], 
   [
    "22031.html", 
    "http://www.4forums.com/political/fun-debates/11035-joke-but-not-far-reality-2-print.html"
   ]
  ], 
  "identifier": 11035
 }
]