[
 [
  [
   305105, 
   null, 
   "Bassman", 
   "http://www.nytimes.com/2008/03/10/nyregion/10cnd-spitzer.html?em&ex=1205294400&en=d0917c3b73427b6a&ei=5087%0A\n \n Spitzer Is Linked to Prostitution Ring \n \n \n By DANNY HAKIM and WILLIAM K. RASHBAUM\n Published: March 10, 2008 \n \n \n \nALBANY - Gov. Eliot Spitzer, who gained national prominence relentlessly pursuing Wall Street wrongdoing, has been caught on a federal wiretap arranging to meet with a high-priced prostitute at a Washington hotel last month, according to a law enforcement official and a person briefed on the investigation.\n \n \n Mr. Spitzer, a first term Democrat, today made a brief public appearance during which he apologized for his behavior, and described it as a &#8220;private matter.&#8221; He did not address his political future.\n\n \n =snip=\n emoticon_xdonno ", 
   {
    "post_info": {
     "post_title": "Gov. Spitzer gets caught with his pants down-Literally!"
    }
   }, 
   null, 
   null, 
   1205193480.0
  ], 
  [
   305110, 
   null, 
   "E Mutz", 
   "Bass,\n \n What is the response in NY? \n \n Bad news for Clinton as this was one of her endorsers. AND a superdelegate. Will she disavow the support of the Gov as she asked Obama? Will she reject or merely renounce?\n \n This is NOT a private matter. What the Executive of the State does in private opens him up to bribery and blackmail and compromises his integrity. If the man can break a vow he has made before God and his wife, how can the voters trust any promise he may make?\n \n He is toast.", 
   {}, 
   305105, 
   null, 
   1205196600.0
  ], 
  [
   305138, 
   null, 
   "Bassman", 
   "Bass,\n \n What is the response in NY?\nRight now, Joe Bruno, the Senate Majority leader, has asked for consideration, so I believe that is warranted. But this cannot be good for NY Democrats. \n \n \nBad news for Clinton as this was one of her endorsers. AND a superdelegate. Will she disavow the support of the Gov as she asked Obama? Will she reject or merely renounce?\nThank goodness. Let's hope that McCain can milk this one for all it's worth.\n \n \nThis is NOT a private matter. What the Executive of the State does in private opens him up to bribery and blackmail and compromises his integrity. If the man can break a vow he has made before God and his wife, how can the voters trust any promise he may make?\nAnd don't we find it ironic that all of the Clintonistas have said \"leave him alone\" while he did Monica?? You are absolutely correct! What elected officials do in regards to their private lives do in fact impact their public lives!\n \n \nHe is toast.\nDefinately.", 
   {}, 
   305110, 
   null, 
   1205206380.0
  ], 
  [
   305142, 
   null, 
   "obvious_child", 
   "Wow. Another politician doing bad things. \n \n Interesting Bassman how you said nothing when Vitter (R) did the same thing but now you're bashing democrats.....\n \n Politicians by nature are scum, corrupt and cannot be trusted. Giving free passes to Republicans while you attack Democrats for the same behavior is a sign of partisan hackery. If you cared about America, you'd slam both sides instead of just one.", 
   {}, 
   305138, 
   null, 
   1205206860.0
  ], 
  [
   305144, 
   null, 
   "Bassman", 
   "Wow. Another politician doing bad things. \n \n Interesting Bassman how you said nothing when Vitter (R) did the same thing but now you're bashing democrats.....\n \n Politicians by nature are scum, corrupt and cannot be trusted. Giving free passes to Republicans while you attack Democrats for the same behavior is a sign of partisan hackery. If you cared about America, you'd slam both sides instead of just one.\nI'm tired of the double standard routinely displayed by Liberal Democrats. All last midterm we heard about the so-called \"culture of corruption\" and yet we now have the most arrogant, hypocritical governor in NY history doing what you routinely accuse the GOP of doing!! Typical!!", 
   {}, 
   305142, 
   null, 
   1205207220.0
  ], 
  [
   305145, 
   null, 
   "obvious_child", 
   "I'm tired of the double standard routinely displayed by Liberal Democrats. All last midterm we heard about the so-called \"culture of corruption\" and yet we now have the most arrogant, hypocritical governor in NY history doing what you routinely accuse the GOP of doing!! Typical!!\n\n \n Obviously you missed this:\n \n Politicians by nature are scum, corrupt and cannot be trusted.\n \n Where was I defending Spitzer? Or did you make that up so you could attack me since you have no argument? Why do you think that I exclude Democrats from the category of Politician? \n \n When did I routinely accuse the GOP of using prostitutes? Or are you making things up to attack me on due to your otherwise lack of any argument whatsoever? The last time I mentioned it, was it Vitter, who you did not even talk about at all. I ran a search for all of your posts with his name and got ZERO results. \n \n You give free passes to the GOP for the same behavior you slam Democrats for.\n \n How is that not hypocritical behavior?\n \n I'm not the one with the double standard. Anyone who looks at your posts will see you are actively practicing it. \n \n If you cared about America, you'd vote both parties out of office. But it is pretty obvious that you don't.", 
   {}, 
   305144, 
   null, 
   1205207580.0
  ], 
  [
   305147, 
   null, 
   "Bassman", 
   "Obviously you missed this:\n \n Politicians by nature are scum, corrupt and cannot be trusted.\nOh, no doubt.\n \n \nWhere was I defending Spitzer? Or did you make that up so you could attack me since you have no argument? Why do you think that I exclude Democrats from the category of Politician?\nHow about the pass that the Clintonistas routinely gave to Bubba for his Oval Orifice tryst with Monica?? \n \n \nWhen did I routinely accuse the GOP of using prostitutes? Or are you making things up to attack me on due to your otherwise lack of any argument whatsoever? The last time I mentioned it, was it Vitter, who you did not even talk about at all. I ran a search for all of your posts with his name and got ZERO results.\n Please emoticon_rolleyes All last term we heard of NOTHING BUT Larry Craig this, and Mark Foley that, and Trent Lott the other thing. \n \n \nYou give free passes to the GOP for the same behavior you slam Democrats for.\n \n How is that not hypocritical behavior?\nLike I stated, you and your ilk gave William Jefferson Clinton a pass when he was doing Monica. I also said that an elected official's private live does in fact affect his public life.\n \n \nI'm not the one with the double standard. Anyone who looks at your posts will see you are actively practicing it. \n \n If you cared about America, you'd vote both parties out of office. But it is pretty obvious that you don't.\nFind me a bunch of solid Conservatives and then we'll talk about that!", 
   {}, 
   305145, 
   null, 
   1205208300.0
  ], 
  [
   305151, 
   null, 
   "obvious_child", 
   "How about the pass that the Clintonistas routinely gave to Bubba for his Oval Orifice tryst with Monica??\n\n \n Are you seriously suggesting that I gave a pass to Clinton or are you, as I asserted, making **** up?\n \n Where did I defend Spitzer? Or are you pretending that question doesn't exist because it makes your life easier and doesn't require you to think?\n \n \nPlease emoticon_rolleyes All last term we heard of NOTHING BUT Larry Craig this, and Mark Foley that, and Trent Lott the other thing. \n\n \n Funny you use the word 'accuse.' Last time I checked, Foley is now openly gay living in Florida with his male partner and several doormen to the Page's dorm came forward stating they denied him access to the dorms several times. Hardly an accusation when there's solid proof. And Lott admitted his behavior. Republican moral failures get brought up because the GOP likes to cast itself as the moral superior choice. Obviously that's got some chinks in its armor. You don't see Democrats going around claiming to be the party of moral superiority. As for Craig, most of the flak he's taking is from fellow Republicans. \n \n Do you even understand the problem of the relationship between a party that has serious moral scandals on a regular basis and one that claims to be the morally superior choice? \n \n \nLike I stated, you and your ilk gave William Jefferson Clinton a pass when he was doing Monica. I also said that an elected official's private live does in fact affect his public life.\n\n \n My ilk? Now you are deliberately ignoring this:\n \n Politicians by nature are scum, corrupt and cannot be trusted. Where did I put the * saying that Democrats are not included? Or did you make that up so you could attack me since you have no argument?\n \n \nFind me a bunch of solid Conservatives and then we'll talk about that!\n\n \n Depends what you mean by 'Conservative.' Your version seems far more liberal then anything that is actually Conservative. \n \n 1) You have a serious double standard problem\n 2) You give free passes to the GOP for the same behavior you slam Democrats for.\n 3) If you cared about America, you'd vote both parties out of office. But it is pretty obvious that you don't.", 
   {}, 
   305147, 
   null, 
   1205208840.0
  ], 
  [
   305175, 
   null, 
   "Iuris", 
   "Ye gods...\n \n OK, so someone got caught ordering a prostitute. Primarily, this should be between the man and his wife's rolling pin.\n \n What worries me more is the whole Clinton affair. To most people it is simply about \"Did Clinton cheat on his wife?\". Noone remembers what really was happening: alleged sexual harassment and impeding the process of law.\n \n Everyone forgot the only important bits and focused on the completely irrelevent ones...", 
   {}, 
   305151, 
   null, 
   1205226960.0
  ], 
  [
   305180, 
   null, 
   "Archangel", 
   "What I find most interesting is the tone of the articles reporting on the Spitzer story, compared to how they reported on Foley and Craig. With Spitzer who was a Law and Order Democrat as a DA, the headlines read \"WHAT WAS HE THINKING?\" Where as with Foley and Craig it was \"HYPOCRITES EXPOSED\"... A much more inflammatory and destructive condemnation of them even though in both cases, virtually no physical sexual contact took place at all, or was alleged to have taken place. Foley was crucified for inappropriate talk to a male Page while Craig was arrested for propositioning an undercover cop in a Rest Room. Both acts were despicable, I agree, but they weren't equal to the negative coverage and demonization that persists to this day. \n \n Just watch how quickly the liberal apologists come out and make excuses, justifications and explanations that lead to calls to forgive him because, after all, this is a private issue between him and his wife. When in reality, the Foley and Craig cases were true private spousal issues as no physical contact took place; but Spitzer committed a crime and broke the Prostitution Laws of NY State which he was elected to enforce, which is why he will be forced to resign. The double standard by the main stream media will be glaring when all is said and done. Just as it was with Democratic Governor McGreavey who had to resign due to a gay relationship that exposed him of also cheating on his wife.\n \n http://www.foxnews.com/story/0,2933,128836,00.html\n One source, a senior McGreevey political adviser, said Cipel threatened McGreevey several weeks ago that unless he was paid \"millions of dollars,\" Cipel would file a lawsuit against the governor charging him with sexual harassment.", 
   {}, 
   305175, 
   null, 
   1205241060.0
  ], 
  [
   305200, 
   null, 
   "CUNxTime", 
   "In all honesty though, O.C. you've got to admit, when a Pub does something like this the party tars and feathers them and runs them out of town. When the shoe's on the other foot, the Dems urge caution and patience.\n \n Personally, I don't care what any of them do 'personally' (as long as its not illegal or rape or something) Technically, I know, prostitution is 'illegal' but its a victimless crime. Without debating that, I'd have to say that it makes him a cad. Does it make him unable to govern? Only if it makes him unable to govern (ie. people can't get past it). I wish though, that the ONLY thing we had to worry about our damn politicians was that they were out banging hookers!emoticon_xlove", 
   {}, 
   305180, 
   null, 
   1205250420.0
  ], 
  [
   305202, 
   null, 
   "bhbcu64", 
   "CUNx,\n \n Well said.\n \n This fits perfectly the definition of \"tempest in a teapot\".", 
   {}, 
   305200, 
   null, 
   1205251200.0
  ], 
  [
   305247, 
   null, 
   "jyoshu", 
   "Wonder where all our resident hypocrisy-police people are who jump up and cry \"hypocrisy!!!\" whenever a 'family-values guy' messes up? Funny, they don't seem to be so eager to call out hypocrisy in this case ....", 
   {}, 
   305202, 
   null, 
   1205271480.0
  ], 
  [
   305248, 
   null, 
   "jyoshu", 
   "When the shoe's on the other foot, the Dems urge caution and patience.\n\n \n Well sure; when it's a Democrat that gets caught. What do you expect??", 
   {}, 
   305200, 
   null, 
   1205271540.0
  ], 
  [
   305263, 
   null, 
   "obvious_child", 
   "In all honesty though, O.C. you've got to admit, when a Pub does something like this the party tars and feathers them and runs them out of town. When the shoe's on the other foot, the Dems urge caution and patience.\n\n \n Only when it comes to public attention. Gringrich was engaging in an affair at the SAME time he was attacking Clinton. Another of the pro-impeachment crowd fathered a kid with his mistress at the SAME TIME. Foley's behavior was covered up by Hastert for at least 4 years. Craig has been suspected of homosexual behavior for most of his political career. Don't forget that Vitter was APPLAUDED after apologizing for teabagging a hooker. He still has his job. \n They are NO better then the Democrats. At least the Democrats don't pretend to be morally superior. That's what bugs me the most. The outright lying and hypocrisy. \n \n I know politicians are scum. People trying to cast one party as morally better is just ignorant. And hypocritical. \n \n \nI wish though, that the ONLY thing we had to worry about our damn politicians was that they were out banging hookers!emoticon_xlove\n\n \n It is a sad reflection of our political system that such behavior would be deemed not so bad.", 
   {}, 
   305200, 
   null, 
   1205275560.0
  ], 
  [
   305267, 
   null, 
   "bhbcu64", 
   "OC,\n \n It is a sad reflection of our political system that such behavior would be deemed not so bad.\n \n \n No! What the real sad reflection is is the equating of sexual behavior, which is really a family matter, with the dragging of the entire nation into an illegal, immoral oil war in the desert.\n \n Where's your moral compass, old boy?", 
   {}, 
   305263, 
   null, 
   1205276100.0
  ], 
  [
   305271, 
   null, 
   "E Mutz", 
   "No! What the real sad reflection is is the equating of sexual behavior, which is really a family matter, with the dragging of the entire nation into an illegal, immoral oil war in the desert.\n \n Where's your moral compass, old boy?\n\n \n If a man makes a vow to his wife then breaks it, what right does that man have to expect the voters to take him at his word. The man's integrity is compromised, his moral authority is compromised, and his judgment cannot be trusted. \n \n I do not want a man who views a $5,000/hour hooker as a justified expense presiding over budget discussions for my state. \n \n A soldier in the US Army may be court martialed and dishonorably discharged for infidelity. As commander in chief of the NY National Guard, Gov. Spitzer must set the example and hold to the behavior expected of the lowest soldier in his chain of command.", 
   {}, 
   305267, 
   null, 
   1205278560.0
  ], 
  [
   305280, 
   null, 
   "CUNxTime", 
   "It is a little worse when a 'family values' guy does it because there's the added hypocrisy. However, I've been hearing that Spitz went after prosecutions of that kind of thing pretty hard when her was a prosecutor, so I guess he'll get what he deserves!", 
   {}, 
   305248, 
   null, 
   1205283300.0
  ], 
  [
   305281, 
   null, 
   "CUNxTime", 
   "[QUOTE]\nOnly when it comes to public attention. Gringrich was engaging in an affair at the SAME time he was attacking Clinton. Another of the pro-impeachment crowd fathered a kid with his mistress at the SAME TIME. Foley's behavior was covered up by Hastert for at least 4 years. Craig has been suspected of homosexual behavior for most of his political career. Don't forget that Vitter was APPLAUDED after apologizing for teabagging a hooker. He still has his job. \n They are NO better then the Democrats. At least the Democrats don't pretend to be morally superior. That's what bugs me the most. The outright lying and hypocrisy. \n\n \n Yeah, I said in another post that it IS worse when you go around casting stones and etc. especally a gay basher like Craig. I laughed my AZZ off with that one! But I would say the Pubs are a bit better on the 'morals' thing (ie. doing something about it), because the Dems do point the finger when a Pub does something. Also, I thought the Clinton thing was a bit blown out, but only for the BJ. He did lie (although, If I was married to Hill, I'd have lied tooemoticon_xgood ) I truly do believe though that he's been guilty of Sexual Harrassment (if not sexual assult) on some of the other ones. Also, the whole 21 y/o with the prez is almost sexual harrassment because of the possition of power. Again though, I wish that was the only thing we had to worry about this ALL of the elected people on both sides.\n \n \nI know politicians are scum. People trying to cast one party as morally better is just ignorant. And hypocritical. \n\n \n 100% agree. The funniest thing I ever heard what that Mega Church guy and his gay, crystal meth boyfriend!\n \n \n \n \nIt is a sad reflection of our political system that such behavior would be deemed not so bad.\n\n \n Only compared to some of the other stuff they get into.", 
   {}, 
   305263, 
   null, 
   1205283780.0
  ], 
  [
   305293, 
   null, 
   "jyoshu", 
   "It is a little worse when a 'family values' guy does it because there's the added hypocrisy. However, I've been hearing that Spitz went after prosecutions of that kind of thing pretty hard when her was a prosecutor, so I guess he'll get what he deserves!\n\n \n That's the point. He was flagrantly violating ethics while going after others' for violating ethics. So, no, 'family values' cases are no worse.", 
   {}, 
   305280, 
   null, 
   1205287080.0
  ], 
  [
   305300, 
   null, 
   "bhbcu64", 
   "mutz,\n \n If a man makes a vow to his wife then breaks it, what right does that man have to expect the voters to take him at his word.\n \n That statement is based on the completely fallacious assumption that there is any linkage whatsoever between the two.\n \n Did FDR's dalliance with his girlfriend affect his leadership of the country.\n \n Did Ike's affair with Kay Summersby affect his leadership?\n \n What about JFK & Marilyn?\n \n Which would you rather have lead the country - FDR or Straight Arrow Hoover?\n \n JFK or Nixon?", 
   {}, 
   305293, 
   null, 
   1205289300.0
  ], 
  [
   305304, 
   null, 
   "CUNxTime", 
   "We do have to remember, though, that Spitz has put people in Jail for prostitution.", 
   {}, 
   305300, 
   null, 
   1205292480.0
  ], 
  [
   305313, 
   null, 
   "Bassman", 
   "The other thing that irks me is the fact that like Bill Clinton, Eliot Spitzer compromised the integrity of the offices to which they were elected.", 
   {}, 
   305304, 
   null, 
   1205295480.0
  ], 
  [
   305317, 
   null, 
   "Archangel", 
   "mutz,\n \n If a man makes a vow to his wife then breaks it, what right does that man have to expect the voters to take him at his word.\n \n That statement is based on the completely fallacious assumption that there is any linkage whatsoever between the two.\n \n Did FDR's dalliance with his girlfriend affect his leadership of the country.\n \n Did Ike's affair with Kay Summersby affect his leadership?\n \n What about JFK & Marilyn?\n \n Which would you rather have lead the country - FDR or Straight Arrow Hoover?\n \n JFK or Nixon?\n\n \n Your examples don't equal what Spitzer did legally speaking. Granted, they committed adultery which was morally wrong; but he committed multiple felonies over approximately 5 years. If just one of these dalliances involved more than 5,000 dollars exchanging hands, then how much did he spend over 5 years? And I don't understand the legalities, but having the Prostitute cross State lines made this a felony charge.\n \n I also heard today that it was the Patriot Act that got him busted because Banks must report any suspicious money transfers and he had many of them into a shell bank account which was a blind account for the Prostitution ring. The Government knew he was dumping large amounts of money into a suspicious account, but never imagined it was going for prostitutes. They originally thought it was money laundering or diverting campaign contributions. \n \n So this is about much more than just sex, especially when a Governor is involved and susceptible to black mail or political coercion. Of course that's also a very real concern when a President has affairs too. One of Kennedy's women was actually from the Eastern Block with connections in enemy Governments at the time. So he was in fact playing with very real fire with at least one woman he had an affair with.", 
   {}, 
   305300, 
   null, 
   1205296620.0
  ], 
  [
   305332, 
   null, 
   "Jo Bennett", 
   "The other thing that irks me is the fact that like Bill Clinton, Eliot Spitzer compromised the integrity of the offices to which they were elected.\n\n \n It really says something about american politics when getting a blow job is considered more damaging to the office of the president than slaughtering 10s of thousands of people.", 
   {}, 
   305313, 
   null, 
   1205305380.0
  ], 
  [
   305337, 
   null, 
   "bhbcu64", 
   "Archie,\n \n Your examples don't equal what Spitzer did legally speaking. Granted, they committed adultery which was morally wrong; but he committed multiple felonies over approximately 5 years. If just one of these dalliances involved more than 5,000 dollars exchanging hands, then how much did he spend over 5 years? And I don't understand the legalities, but having the Prostitute cross State lines made this a felony charge.\n \n Frankly, my dear, I don't give a da*n.\n \n These are archaic laws placed on the books merely to serve as stimulation for the prurient.\n \n They should have been repealed decades ago.\n \n The only people who should be concerned are the members of his family.\n \n In the list of deadly \"sins\" (not that there is any such thing as \"sin\"), taking a country into an illegal and immoral oil war in the desert is so much more serious than whose lock one's key fits into that it is ludicrous to even think about comparing the two.", 
   {}, 
   305332, 
   null, 
   1205312700.0
  ], 
  [
   305342, 
   null, 
   "Archangel", 
   "Archie,\n \n Your examples don't equal what Spitzer did legally speaking. Granted, they committed adultery which was morally wrong; but he committed multiple felonies over approximately 5 years. If just one of these dalliances involved more than 5,000 dollars exchanging hands, then how much did he spend over 5 years? And I don't understand the legalities, but having the Prostitute cross State lines made this a felony charge.\n \n Frankly, my dear, I don't give a da*n.\n \n These are archaic laws placed on the books merely to serve as stimulation for the prurient.\n \n They should have been repealed decades ago.\n \n The only people who should be concerned are the members of his family.\n \n In the list of deadly \"sins\" (not that there is any such thing as \"sin\"), taking a country into an illegal and immoral oil war in the desert is so much more serious than whose lock one's key fits into that it is ludicrous to even think about comparing the two.\n\n \n If you don't give a damn, then what are you doing on a debate forum wasting our time insisting that you don't care? And as for our illegal and immoral war, like any good pacifist liberal, I suppose you would be very content with the mass graves saddam had filled with hundreds of thousands of innocent iraqi's; or the rape rooms, or the children's prisons. That illegal and immoral genocide, torture and human rights abuses didn't bother you at all because, after all, out of sight, out of mind huh? Your cowardice and selfishness is pathetic capo; to hate your own country for defending the defenseless, but be fine with standing by as they are slaughtered like so many diseased animals by a mad man is just fine by you, huh!", 
   {}, 
   305337, 
   null, 
   1205315460.0
  ], 
  [
   305352, 
   null, 
   "bhbcu64", 
   "Archie,\n \n And as for our illegal and immoral war, like any good pacifist liberal, I suppose you would be very content with the mass graves saddam had filled with hundreds of thousands of innocent iraqi's; or the rape rooms, or the children's prisons.\n \n Just in case you haven't noticed, Saddam Hussein has been out of power and off this earth lo these many years.\n \n Mission accomplished! Bring the troops home now!\n \n BTW, if that killing is so bad, why are we not in Darfu? Think that just maybe it's because there's no oil there?\n \n And I still say that sending the flower of American youth off to die or to be brought home in pieces in the heat of the desert is far worse than anything Gov. Spitzer is accused of doing.\n \n What Spitzer may or may not have done doesn't deserve mention on the back pages of some neighborhood weekly Pennysaver.\n \n BTW, if the Son-of-a-Bush's mad oil war in the desert is so moral, are you posting from Iraq, or are you another one of those bloviators who is all sizzle and no fajita?\n \n BTW, Archie, ever going to get around to telling us whether you favor or oppose the right of two people of the same gender to marry each other - that's MARRY, not civil unions, not marriage light - full civil marriage?", 
   {}, 
   305342, 
   null, 
   1205329980.0
  ], 
  [
   305355, 
   null, 
   "CUNxTime", 
   "It really says something about american politics when getting a blow job is considered more damaging to the office of the president than slaughtering 10s of thousands of people.\n\n \n \n The you go again. The wars in I and A are both important to the security of the US and the world, not to mention to the people of those countries. The UN agreed, Hillary agreed, and (as you saw after the liberation) most of the people of those countries we thankful. War is hell, but sometimes you've got to get rid of the bad guys.\n \n Furthermore, it think the 'damaging' part Bass was talking about is the lying and cheating part. Not the actual act.", 
   {}, 
   305332, 
   null, 
   1205330940.0
  ], 
  [
   305360, 
   null, 
   "bhbcu64", 
   "CUNx,\n \n War is hell, but sometimes you've got to get rid of the bad guys.\n \n \n Which is just what those who oppose the mad oil wars in their countries are convinced that is what they are doing when they kill the flower of American youth.\n \n Good guy/bad guy very much depends on which side of the fence one is on.", 
   {}, 
   305355, 
   null, 
   1205334660.0
  ], 
  [
   305361, 
   null, 
   "CUNxTime", 
   "CUNx,\n \n War is hell, but sometimes you've got to get rid of the bad guys.\n \n \n Which is just what those who oppose the mad oil wars in their countries are convinced that is what they are doing when they kill the flower of American youth.\n \n Good guy/bad guy very much depends on which side of the fence one is on.\n\n \n \n Yes, you are very much correct. That is very far from one of the potential absolutes we've been talking about. I'd hope we'd agree the the soldiers aren't the 'bad' guys, though. (as in they're doing what they've been ordered to do). But you must remember, the UN, the Dems, and many other countries voted to clear out the Taliban and Saddam! So you can't only point the finger at 'son of a Bush'. And this is not a war for oil (I think we should repay ourselves, but the leadership is too 'moral' for that!) this is a war to make the world safer, especially for those who live in A and I. That's small compensation for those that are dead now. But you can thank Iran and Syria for a lot of that. Our intention is to stop the bad guys, not kill innocent people. The intention of our enemy is to kill and kill and kill until they can enslave the people to their brand of fundamental religon (and to set up a puppet state for Iran).", 
   {}, 
   305360, 
   null, 
   1205335500.0
  ], 
  [
   305367, 
   null, 
   "bhbcu64", 
   "CUNx,\n \n I'd hope we'd agree the the soldiers aren't the 'bad' guys, though. (as in they're doing what they've been ordered to do). \n \n Oh, good! The Nurenburg defense!\n \n Didn't work for Goering, Streicher, and the rest.\n \n Why is it suddenly valid now?\n \n Keep posting, though, because with every post you put up you demonstrate over again just how absurd it is to state that there are moral absolutes.", 
   {}, 
   305361, 
   null, 
   1205338080.0
  ], 
  [
   305376, 
   null, 
   "Archangel", 
   "Archie,\n \n And as for our illegal and immoral war, like any good pacifist liberal, I suppose you would be very content with the mass graves saddam had filled with hundreds of thousands of innocent iraqi's; or the rape rooms, or the children's prisons.\n \n Just in case you haven't noticed, Saddam Hussein has been out of power and off this earth lo these many years.\n \n Mission accomplished! Bring the troops home now!\n\n \n But if we did what you wanted and never went in because it's an allegedly illegal war, then saddam would still be alive and creating new mass graves as we speak. And more civilians would have died by now anyway as did in this war to free them, but they would have died like sheep led to the slaughter your way. That's real compassionate and caring of you.\n \n \nBTW, if that killing is so bad, why are we not in Darfu? Think that just maybe it's because there's no oil there?\n\n \n Because we can't fight Islam on every single front on Earth. But if OIL was our motive for being in Iraq, rather than National Security, then why are we paying over 3 dollars a gallon for gasoline now when we could just take Iraq's in payment for fighting this War for them?\n \n \nAnd I still say that sending the flower of American youth off to die or to be brought home in pieces in the heat of the desert is far worse than anything Gov. Spitzer is accused of doing.\n \n What Spitzer may or may not have done doesn't deserve mention on the back pages of some neighborhood weekly Pennysaver.\n\n \n Completely different issues; but why would I expect you to get that.\n \n \nBTW, if the Son-of-a-Bush's mad oil war in the desert is so moral, are you posting from Iraq, or are you another one of those bloviators who is all sizzle and no fajita?\n\n \n No Capo, at 54 years old, they didn't want me. But one of my daughters is serving proudly in the Air Force.\n \n \nBTW, Archie, ever going to get around to telling us whether you favor or oppose the right of two people of the same gender to marry each other - that's MARRY, not civil unions, not marriage light - full civil marriage?\n\n \n That's another thread Capo, but I answered your baiting question there just the same.", 
   {}, 
   305352, 
   null, 
   1205341080.0
  ], 
  [
   305381, 
   null, 
   "CUNxTime", 
   "CUNx,\n \n I'd hope we'd agree the the soldiers aren't the 'bad' guys, though. (as in they're doing what they've been ordered to do). \n \n Oh, good! The Nurenburg defense!\n \n Didn't work for Goering, Streicher, and the rest.\n \n Why is it suddenly valid now?\n \n Keep posting, though, because with every post you put up you demonstrate over again just how absurd it is to state that there are moral absolutes.\n\n \n Look, I'm trying to be civil with you. In fact, we've even found some common ground on some of these threads. But don't you dare start comparing our soldiers to NAZI SS. Don't troll that way, it is beneath you.", 
   {}, 
   305367, 
   null, 
   1205342280.0
  ], 
  [
   305382, 
   null, 
   "CUNxTime", 
   "And when I say doing what they're supposed to do, I'm talking about patrolling and protecting and NOT targeting citizens. They are there because people like Hillary sent them there!", 
   {}, 
   305381, 
   null, 
   1205342340.0
  ], 
  [
   305383, 
   null, 
   "CUNxTime", 
   "What is Capo?", 
   {}, 
   305382, 
   null, 
   1205342460.0
  ], 
  [
   305384, 
   null, 
   "CUNxTime", 
   "BTW, how did we get here from Gov. Spitz.", 
   {}, 
   305383, 
   null, 
   1205342640.0
  ], 
  [
   305385, 
   null, 
   "CUNxTime", 
   "And BTW BH how do you go from calling them the 'Flower of American Youth' to calling them Nazi stormtroopers? You make we sick with talk like that.", 
   {}, 
   305384, 
   null, 
   1205342760.0
  ], 
  [
   305388, 
   null, 
   "bhbcu64", 
   "Archie,\n \n But if we did what you wanted and never went in because it's an allegedly illegal war, then saddam would still be alive and creating new mass graves as we speak.\n \n STRAWMAN ALERT!!\n \n He's gone, and we're still there.\n \n Why?\n \n BTW, Darfur has little or nothing to do with Islam.\n \n BTW #2, Why didn't we intervene in Argentina or Chile during their mass murder periods?\n \n Because the perpetrators were OUR mass murderers.", 
   {}, 
   305385, 
   null, 
   1205343900.0
  ], 
  [
   305391, 
   null, 
   "bhbcu64", 
   "CUNx,\n \n  But don't you dare start comparing our soldiers to NAZI SS. Don't troll that way, it is beneath you.\n \n \n Good Grief, man. I did no such thing.\n \n All that I said is that international law does not recognize the \"following orders\" defense, and for you to try to raise it vis a vis our troops in Iraq is ridiculous.\n \n Either we prosecute our own to the limits of the law, or we once again face the world's scorn as talkers out of both sides of our mouths.\n \n BTW, for the families of the murdered innocents, there is not a lick of difference between the Nazis and our troops.\n \n Now that the Son-of-a-Bush has explicitly approved of waterboarding, Heaven help any of our troops who are captured by the Iraqis or Afghanis.", 
   {}, 
   305388, 
   null, 
   1205344200.0
  ], 
  [
   305398, 
   null, 
   "Archangel", 
   "[Archie] \n But if we did what you wanted and never went in because it's an allegedly illegal war, then saddam would still be alive and creating new mass graves as we speak.\n \n \n\n STRAWMAN ALERT!!\n \n He's gone, and we're still there.\n \n Why?\n\n \n Don't you know anything? Because pro saddam and radical islamists are still strapping bombs onto wheel chairs and terrorists and blowing up innocents in mosques and markets. That's why!!!\n \n \nBTW, Darfur has little or nothing to do with Islam.\n\n \n Look Capo, go educate yourself and then come back and we'll talk. And here's a link to get you started on your jouney into reality.\n \n http://www.jihadwatch.org/archives/002628.php\n \n \n \nBTW #2, Why didn't we intervene in Argentina or Chile during their mass murder periods?\n \n Because the perpetrators were OUR mass murderers.\n\n \n Got any links defining precisely what and when you're referring to, or is this just more of your unproven who shot john drivel?", 
   {}, 
   305388, 
   null, 
   1205346780.0
  ], 
  [
   305401, 
   null, 
   "CUNxTime", 
   "CUNx,\n \n \n Now that the Son-of-a-Bush has explicitly approved of waterboarding, Heaven help any of our troops who are captured by the Iraqis or Afghanis.\n\n \n \n Are you nuts? They've been cutting off the heads of nuns, journalists, and many other 'western' people, LONG before waterboarding became an issue! You can't equate waterboarding to what the animals responsible for the beheadings and etc. do.", 
   {}, 
   305391, 
   null, 
   1205348340.0
  ], 
  [
   305403, 
   null, 
   "CUNxTime", 
   "CUNx,\n \n War is hell, but sometimes you've got to get rid of the bad guys.\n \n \n Which is just what those who oppose the mad oil wars in their countries are convinced that is what they are doing when they kill the flower of American youth.\n \n Good guy/bad guy very much depends on which side of the fence one is on.\n\n \n You were talking about soldiers in general and I said not to confuse the soldiers with the policy of war. You compared them to the folks a Nuremberg. That's ignorant and dead wrong. Our soldiers are far and away much better people than the average citizen. So don't call them the flower of American youth when it suits you then start talking about Nuremberg! Talk about bait.", 
   {}, 
   305360, 
   null, 
   1205348520.0
  ], 
  [
   305413, 
   null, 
   "trebor", 
   "BTW, how did we get here from Gov. Spitz.\n\n \n Because right now, Gov Spitz is irrelevant, cause he is resigning.", 
   {}, 
   305384, 
   null, 
   1205352900.0
  ], 
  [
   305419, 
   null, 
   "Jo Bennett", 
   "The you go again. The wars in I and A are both important to the security of the US and the world, not to mention to the people of those countries. The UN agreed, Hillary agreed, and (as you saw after the liberation) most of the people of those countries we thankful. War is hell, but sometimes you've got to get rid of the bad guys.\n \n Furthermore, it think the 'damaging' part Bass was talking about is the lying and cheating part. Not the actual act.\n\n \n Opinion poll after opinion poll in Iraq has shown that the Iraqi people do not want the occupation. The UN did not sanction the invasion of Iraq, as I've explained to you before, I don't see why the actions of the democratic party are in any way relevant, the line between democrats and republicans is razor thin in global terms. I did not support the war, more than half the population of my country did not support the war. Me and 2 million others protested against the invasion. Life has not measurably improved more the majority of Iraqis, and certainly not for the 600 000 who have died over and above average since the invasion.", 
   {}, 
   305355, 
   null, 
   1205353800.0
  ], 
  [
   305422, 
   null, 
   "CUNxTime", 
   "The Iraqi govt. does not want the US to leave because it can't stave off the foreign influences. The people were VERY (except the 20% who made up the Baath party) when we freed them. They've gotten upset with the death toll caused by foreign fighters (Al-qaeda and Iran influences) and are tired of dying. Now that we've got their army starting to come back on line and we've got more of our soldiers there, the violence is calming and public opinion is swinging. The cause of the problems are the foreign fighters (who make up the majority of the 'insurgents'). The ongoing problems, like electricity and such are because the enemy keep blowing up the work we do. The Iraqis know that and have been rising up against them, which combined with the surge, is bringing the situation back into our favor!", 
   {}, 
   305419, 
   null, 
   1205354700.0
  ], 
  [
   305435, 
   null, 
   "obvious_child", 
   " But I would say the Pubs are a bit better on the 'morals' thing (ie. doing something about it), because the Dems do point the finger when a Pub does something.\n\n \n The Pubs only act when it is public knowledge. If they were indeed moral, they'd act when it was not public knowledge. It is really hard for me to accept them as the moral party when they have a long history of covering up moral scandals only to disown the parties in that scandal when the media releases news. If they were actually the moral party instead of whoring themselves for that vote, they'd do something before CNN got word of it. \n \n \nAlso, I thought the Clinton thing was a bit blown out, but only for the BJ. He did lie (although, If I was married to Hill, I'd have lied tooemoticon_xgood ) I truly do believe though that he's been guilty of Sexual Harrassment (if not sexual assult) on some of the other ones.\n\n \n Perhaps. Clinton's who BJ was massively overblown. \n \n \nOnly compared to some of the other stuff they get into.\n\n \n We seriously need to start putting presidents on trial the day after the leave office. Good ol' Sparta had that.", 
   {}, 
   305281, 
   null, 
   1205359980.0
  ], 
  [
   305436, 
   null, 
   "obvious_child", 
   "then why are we paying over 3 dollars a gallon for gasoline now when we could just take Iraq's in payment for fighting this War for them?\n\n \n Because you don't understand what a commodity market is. This war isn't directly for oil. It is for the security and power projection over the Middle East and ensuring the stability of future oil. So really, it's for land. The reason oil is so high is because of the Bush's administration failure for proper post invasion planning, along with Chavez being a nutjob and Iran's nuclear desires. Now, if the US had an autarky economy and a nationalized oil company, we could do that.", 
   {}, 
   305376, 
   null, 
   1205360220.0
  ], 
  [
   305437, 
   null, 
   "obvious_child", 
   "is bringing the situation back into our favor!\n\n \n Have you read \"Learning to Eat Soup with a Knife\" ? \n \n We only had the favor for a very short time. Only after Rummy and his incompetence was kicked out and proper counter insurgency tactics were installed has the tide slowly started to shift.", 
   {}, 
   305422, 
   null, 
   1205360340.0
  ], 
  [
   305452, 
   null, 
   "snakespit", 
   "In all honesty though, O.C. you've got to admit, when a Pub does something like this the party tars and feathers them and runs them out of town. When the shoe's on the other foot, the Dems urge caution and patience.\n\n Agreed. \n \n \nPersonally, I don't care what any of them do 'personally' (as long as its not illegal or rape or something) Technically, I know, prostitution is 'illegal' but its a victimless crime. Without debating that, I'd have to say that it makes him a cad. Does it make him unable to govern? Only if it makes him unable to govern (ie. people can't get past it). I wish though, that the ONLY thing we had to worry about our damn politicians was that they were out banging hookers!emoticon_xlove\n\n \n Guys get drug into jails all over this country every day for solicitation. Why should he be any different? It's a trust issue with the public. Personally, I'm not really bothered by the betrayal of the public trust...I never trust politicians in the first place. But to play this off as a \"victimless crime\" is absolutely absurd. The guy is alleged to have spent about 80K over 10 years. How much of that 80K do you think was written off as \"business expenses\"? Make no mistakes about it, taxpayer dollars paid for his orgasms. I don't care who you are or how much money you make, wives would tend to notice 8K going missing every year. I would be willing to bet that he was not swiping his personal MAC card to pay for his booty calls. I'm sure it gotta somehow be a felony to use taxpayer dollars to score with a hooker.", 
   {}, 
   305200, 
   null, 
   1205363640.0
  ], 
  [
   305454, 
   null, 
   "snakespit", 
   "Perhaps. Clinton's who BJ was massively overblown. \n\n \n Actually, I think Clinton was the one who was massively overblown. ;) \n \n Seriously OC, that was far too easy. Next time just put <*insert snide remark here*<.", 
   {}, 
   305435, 
   null, 
   1205364060.0
  ], 
  [
   305457, 
   null, 
   "CUNxTime", 
   "\n Guys get drug into jails all over this country every day for solicitation. Why should he be any different? It's a trust issue with the public. Personally, I'm not really bothered by the betrayal of the public trust...I never trust politicians in the first place. But to play this off as a \"victimless crime\" is absolutely absurd. The guy is alleged to have spent about 80K over 10 years. How much of that 80K do you think was written off as \"business expenses\"? Make no mistakes about it, taxpayer dollars paid for his orgasms. I don't care who you are or how much money you make, wives would tend to notice 8K going missing every year. I would be willing to bet that he was not swiping his personal MAC card to pay for his booty calls. I'm sure it gotta somehow be a felony to use taxpayer dollars to score with a hooker.\n\n \n \n I wasn't suggesting he shouldn't get what he deserves, I said in an earlier post its worse for him since he put people in jail as a prosecute for prostitution. Also, if he committed fraud and what not then that's another story. But in general, politicians having affairs and even going to a prostitute aren't, to me, the big problem with government. The hypocrisy is worse than the 'crime', IMO (in most political sex scandals).", 
   {}, 
   305452, 
   null, 
   1205364600.0
  ], 
  [
   305472, 
   null, 
   "Archangel", 
   "Because you don't understand what a commodity market is. This war isn't directly for oil. It is for the security and power projection over the Middle East and ensuring the stability of future oil. So really, it's for land. The reason oil is so high is because of the Bush's administration failure for proper post invasion planning, along with Chavez being a nutjob and Iran's nuclear desires. Now, if the US had an autarky economy and a nationalized oil company, we could do that.\n\n \n You're only partially right child. OPEC has cut back on production even though World usage is up so that based on supply and demand, the price is forced up, just as is happening. But my point stands that if the US was really in Iraq for OIL which is the claim I was responding to, then we could be loading 11,473,000+ gallons of oil in just one tanker and be transporting it home in tankers like this one all day, every day, assuring that our price per gallon remained low. I agree that protecting the flow of OIL is a true National security issue as oil is the lubricant that greases America's economic machine. So without it, we become another third World Country. Is that what you want?\n \n http://www.time.com/time/magazine/article/0,9171,824076,00.html?promoid=googlep", 
   {}, 
   305436, 
   null, 
   1205367960.0
  ], 
  [
   305477, 
   null, 
   "obvious_child", 
   "You're only partially right child. OPEC has cut back on production even though World usage is up so that based on supply and demand, the price is forced up, just as is happening.\n\n \n Yes and No. As I stated before, you don't understand what a commodity market is. Prices for commodities such as oil are set well before the product is actually traded. The price of oil is sky high due to the trading of futures. Futures prices are set somewhat by oil speculators. Oil speculators are getting spooked for a variety of reasons. OPEC's reduction has more to do with its declining capacity, fraudulently stated reserves and general failure to invest in its oil extraction industry then wanting to keep prices high. OPEC for several decades deliberately lowered prices to prevent what they feared was permanent damage to oil market, the key price at which true alternatives would arise and the monopoly OPEC so cherished would come crashing down.\n \n \nBut my point stands that if the US was really in Iraq for OIL which is the claim I was responding to, then we could be loading 11,473,000+ gallons of oil in just one tanker and be transporting it home in tankers like this one all day, every day, assuring that our price per gallon remained low.\n\n \n And your argument is stupid because it does not account for commodity markets, assumes the US has a nationalized oil company and the US economy is defined autarky\n \n \nIs that what you want?\n\n \n Learn what a commodity market is before talking about oil.\n Some of the dumbest arguments about oil arise from peoples' ignorance of Commodity Markets.", 
   {}, 
   305472, 
   null, 
   1205370840.0
  ], 
  [
   305491, 
   null, 
   "Archangel", 
   "I'm sorry child, I forgot; you know everything and trying to deal with you is an absolute waste of time. Suffice it to say that i disagree with you but explaining why would just be a waste of time, so why bother.", 
   {}, 
   305477, 
   null, 
   1205376600.0
  ], 
  [
   305554, 
   null, 
   "bhbcu64", 
   "Archie,\n \n Suffice it to say that i disagree with you but explaining why would just be a waste of time, so why bother.\n \n The only difference between you and God is that God doesn't think She's Archie.emoticon_xangel", 
   {}, 
   305491, 
   null, 
   1205426340.0
  ], 
  [
   305571, 
   null, 
   "CUNxTime", 
   "Come come now, can't we get some Rodney King cooperation going in here!?!", 
   {}, 
   305554, 
   null, 
   1205433780.0
  ], 
  [
   305577, 
   null, 
   "Archangel", 
   "Archie,\n \n I'm sorry child, I forgot; you know everything and trying to deal with you is an absolute waste of time. Suffice it to say that i disagree with you but explaining why would just be a waste of time, so why bother.\n \n The only difference between you and God is that God doesn't think She's Archie.emoticon_xangel\n\n \n Do you see how foolish your post looks in proper context capo? You're accusing me of claiming to know everything when it is child who is acting like he knows all. Yet you place that accusation on me. But since you brought it up, do you want to back this statement up capo? Where have I ever claimed to know all that God knows? Be specific please as you have said this elsewhere too. And if you think you're offending me by referring to God as she, you're not; because the same God who created Adam, also created Eve, so God possesses the feminine attributes He created into women, just as He possesses the male attributes He created into Man. \n \n We are all a reflection of God, not just men. emoticon_xgood", 
   {}, 
   305554, 
   null, 
   1205436720.0
  ], 
  [
   305584, 
   null, 
   "bhbcu64", 
   "Archie,\n \n But since you brought it up, do you want to back this statement up capo? Where have I ever claimed to know all that God knows? \n \n How about this from your #148 in Gay Rights:\n \n I have spoken of the coming judgment that America is facing because of our iniquity and you are proving just how deserving we are of it with your rebellious and condemning attitude towards the God who holds your very life in His hands. You are showing that you don't appreciate his Grace which He has covered America with for so long, so let's see how you feel when He withdraws His Spirit of Grace from this Country and we implode as a Nation. \n \n Why do I think that your next post will dwell on your use of the word all?", 
   {}, 
   305577, 
   null, 
   1205441580.0
  ], 
  [
   305586, 
   null, 
   "bhbcu64", 
   "Form #58:\n \n We are all a reflection of God, not just men.\n \n Get this, Jack, I don;t want to be a reflection of your god. \n \n He's an ill-tempered, crabby old SOB!", 
   {}, 
   305584, 
   null, 
   1205441700.0
  ], 
  [
   305589, 
   null, 
   "CUNxTime", 
   "Archie,\n \n But since you brought it up, do you want to back this statement up capo? Where have I ever claimed to know all that God knows? \n \n How about this from your #148 in Gay Rights:\n \n I have spoken of the coming judgment that America is facing because of our iniquity and you are proving just how deserving we are of it with your rebellious and condemning attitude towards the God who holds your very life in His hands. You are showing that you don't appreciate his Grace which He has covered America with for so long, so let's see how you feel when He withdraws His Spirit of Grace from this Country and we implode as a Nation. \n \n Why do I think that your next post will dwell on your use of the word all?\n\n \n Archie, you're not one of those Westboro Baptist Chuch types, are you? You don't buy that stuff about 'God Hates the ### Army' and 'God hates America' do you?", 
   {}, 
   305584, 
   null, 
   1205444460.0
  ], 
  [
   305590, 
   null, 
   "Archangel", 
   "Archie, you're not one of those Westboro Baptist Chuch types, are you? You don't buy that stuff about 'God Hates the ### Army' and 'God hates America' do you?\n\n \n Of course not. And don't let Capo's distortions of my prior posts fool you. She can't win unless she slanders me. That is her MO you know.", 
   {}, 
   305589, 
   null, 
   1205445060.0
  ], 
  [
   305591, 
   null, 
   "Archangel", 
   "Form #58:\n \n We are all a reflection of God, not just men.\n \n Get this, Jack, I don;t want to be a reflection of your god. \n \n He's an ill-tempered, crabby old SOB!\n\n \n Don't worry Capo, I never assumed or implied that \"YOU\" are a reflection of my God at all.", 
   {}, 
   305586, 
   null, 
   1205445180.0
  ], 
  [
   305595, 
   null, 
   "bhbcu64", 
   "Archie,\n \n Don't worry Capo, I never assumed or implied that \"YOU\" are a reflection of my God at all.\n \n \n For which I am truly grateful.:) \n \n Now, why not try to explain to the forum how quoting you verbatim and in whole is a distortion?:xbanghead", 
   {}, 
   305591, 
   null, 
   1205446680.0
  ], 
  [
   305945, 
   null, 
   "CUNxTime", 
   "Actually, the reflection of god would be dog... Now play nice.", 
   {}, 
   305595, 
   null, 
   1205454780.0
  ], 
  [
   306033, 
   null, 
   "obvious_child", 
   "I'm sorry child, I forgot; you know everything and trying to deal with you is an absolute waste of time. Suffice it to say that i disagree with you but explaining why would just be a waste of time, so why bother.\n\n \n Good job on constantly failing to refute anything and always relying on personal insults instead of actually making an argument!\n \n Instead of addressing why I'm wrong, why my arguments are wrong and why your arguments are correct, you just say I'm a waste of time. Oddly you say that to EVERYONE who regularly rips you a new one. \n \n Coincidence? I think not.\n \n You are wrong. Act your age and admit it.\n \n But since you seem to believe my arguments are wrong explain to me how the prices of commodities are set, and how futures and options play a role in those prices.\n \n oh noes, It's economics RUN AWAY!!!", 
   {}, 
   305491, 
   null, 
   1205555760.0
  ], 
  [
   306414, 
   null, 
   "bhbcu64", 
   "http://www.nytimes.com/aponline/world/AP-Cheney.html\n \n Dr. Strangelove, the cardiac cripple, continues to beat the war drum for a conflict he cannot fight in.", 
   {}, 
   306033, 
   null, 
   1205955000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gov. Spitzer gets caught with his pants down-Literally!", 
  "url": "http://www.4forums.com/political/current-events-debates/11047-gov-spitzer-gets-caught-his-pants-down-literally.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 11047, 
  "discussion_files": [
   [
    "29559.html", 
    "http://www.4forums.com/political/current-events-debates/11047-gov-spitzer-gets-caught-his-pants-down-literally-print.html"
   ], 
   [
    "29560.html", 
    "http://www.4forums.com/political/current-events-debates/11047-gov-spitzer-gets-caught-his-pants-down-literally-5-print.html"
   ], 
   [
    "29561.html", 
    "http://www.4forums.com/political/current-events-debates/11047-gov-spitzer-gets-caught-his-pants-down-literally-4-print.html"
   ], 
   [
    "29562.html", 
    "http://www.4forums.com/political/current-events-debates/11047-gov-spitzer-gets-caught-his-pants-down-literally-3-print.html"
   ], 
   [
    "29563.html", 
    "http://www.4forums.com/political/current-events-debates/11047-gov-spitzer-gets-caught-his-pants-down-literally-2-print.html"
   ]
  ], 
  "identifier": 11047
 }
]