[
 [
  [
   304941, 
   null, 
   "isly ilwott", 
   "In two separate incidents, Georgia co-eds were brutally murdered recently...one at Auburn University and one at UNC, Chapel Hill. Both were victims of criminals using handguns.\n \n Apparently, both were victims of young, black males. Should we focus on the guns or the young, black males in determining the cause of these violent acts?\n \n Should we argue that guns should be taken from everyone?\n Should we argue that guns should be taken from young, black males?\n Should we argue that young, black males need special attention?\n Should we argue that co-eds need carry permits and firearms training?\n \n What should we argue for as a result of these senseless killings? Where should our anger be directed, if at anything?", 
   {
    "post_info": {
     "post_title": "Recent shootings..."
    }
   }, 
   null, 
   null, 
   1205092380.0
  ], 
  [
   304942, 
   null, 
   "Ghost Rider", 
   "In two separate incidents, Georgia co-eds were brutally murdered recently...one at Auburn University and one at UNC, Chapel Hill. Both were victims of criminals using handguns.\n\n \n Here we go...\n \n \nApparently, both were victims of young, black males.\n\n \n Not the least bit surprising.\n \n \nShould we focus on the guns or the young, black males in determining the cause of these violent acts?\n\n \n Whenever there's a drunk driving, we absolutely never focus on the car. Whenever somebody's killed through bludgeoning, we never focus on the bludgeon. We never seem to focus on the tool in any other instance, so why should we focus on the tool in a case like this? Why don't we instead focus on the person or persons who were actually responsible? You think we have all those laws outlawing illegal acitivities so guns will behave themselves?\n \n I could easily kill just as many people with a screwdriver, but there really isn't much demand for screwdriver control. Why is it?\n \n \nShould we argue that guns should be taken from everyone?\n\n \n Only if we argue that cars should be taken from everyone after the very next hit and run incident occurs. No cars means no drunk driving, no speeding and no police chases, it's that simple.\n \n \nShould we argue that guns should be taken from young, black males?\n\n \n Keeping guns out of the hands of the poor hasn't worked well before since they tend to need them more than the rich.\n \n I'd almost bet my .308 rifle that these boys weren't even legally able to buy the guns they used.\n \n \nShould we argue that young, black males need special attention?\n\n \n I think we should argue that these young individuals need to face the full impact of their crimes and not be treated special or given a plea deal.\n \n \nWhat should we argue for as a result of these senseless killings? Where should our anger be directed, if at anything?\n\n \n I think we should argue that it's time to stop making people easy targets. The reason so many people are getting killed and victimized is because there are too many laws against self-defense, giving too much power to those that are fully intent on doing harm in an illegal manner.", 
   {}, 
   304941, 
   null, 
   1205092860.0
  ], 
  [
   304945, 
   null, 
   "Jo Bennett", 
   "When there are a lot of drink driving incidents we do focus on the supply of alcohol, not just the individual.", 
   {}, 
   304942, 
   null, 
   1205094000.0
  ], 
  [
   304946, 
   null, 
   "Ghost Rider", 
   "When there are a lot of drink driving incidents we do focus on the supply of alcohol, not just the individual.\n\n \n We don't focus on the availability of cars though. Gotta be 21 to buy beer, only gotta be 16 to buy a car or any other vehicle.", 
   {}, 
   304945, 
   null, 
   1205094240.0
  ], 
  [
   304995, 
   null, 
   "Bryan", 
   "In two separate incidents, Georgia co-eds were brutally murdered recently...one at Auburn University and one at UNC, Chapel Hill. Both were victims of criminals using handguns.\n \n Apparently, both were victims of young, black males. Should we focus on the guns or the young, black males in determining the cause of these violent acts?\n \n Should we argue that guns should be taken from everyone?\n Should we argue that guns should be taken from young, black males?\n Should we argue that young, black males need special attention?\n Should we argue that co-eds need carry permits and firearms training?\n \n What should we argue for as a result of these senseless killings? Where should our anger be directed, if at anything?\n\n \n I would say that we should not blame the sword for the hand that wields it. \n \n What we should do instead is hold those who are a fault accountable&#8212;the person who chose to commit a wrongful act through an unjustifiable motive, be it anger, hatred, revenge, greed, etc. \n \n We should seek to hold accountable the person who knew right from wrong, who understood the nature and consequences of his actions, and who made a conscious choice to take someone&#8217;s life without a shred of legitimate excuse or justification. \n \n This is how we should respond to murder.\n \n In doing so I would also suggest that we do not direct any anger at a suspect. Being angry is one thing, reacting through anger is entirely another. Giving reign to our anger or frustration serves only to tempt us to rush forward through a process in which we substitute the goal of vengeance for principle of justice. Two eyes for an eye and a heart for a tooth cannot be our motto.\n \n These are not new or novel concepts. They have formed the foundation of our system of criminal justice for more than two centuries.", 
   {
    "post_info": {
     "post_title": "This is how we should respond...."
    }
   }, 
   304941, 
   null, 
   1205125620.0
  ], 
  [
   305049, 
   null, 
   "sinjin", 
   "I could easily kill just as many people with a screwdriver, but there really isn't much demand for screwdriver control.\nThis I highly doubt. I think you have the 2nd Amendment on your side. I don't think acknowledging how a firearm facilitates killing weakens your case. Of course neither does your nearly constant condescension and generally insulting style. It's just annoying.", 
   {}, 
   304942, 
   null, 
   1205175900.0
  ], 
  [
   305113, 
   null, 
   "Ghost Rider", 
   "This I highly doubt.\n\n \n I'm not surprised.\n \n \nI think you have the 2nd Amendment on your side.\n\n \n I have more than that, I also have common sense on my side.\n \n \nI don't think acknowledging how a firearm facilitates killing weakens your case.\n\n \n Firearms don't facilitate killing, firearms facilitate keeping criminals from getting a corner market on domination. The police are outnumbered by the criminals, the criminals are outnumbered by the law-abiding citizens. We shouldn't be unarmed when we're the majority force in maintaining the balance.\n \n \nOf course neither does your nearly constant condescension and generally insulting style. It's just annoying.\n\n \n Too bad.", 
   {}, 
   305049, 
   null, 
   1205198040.0
  ], 
  [
   306126, 
   null, 
   "kesseltron", 
   "Dude, firearms facilitate killing. That is the whole point.\n \n I see guns as the great equaliser in any modern society. Without guns, whoever has the most muscle, or whoever has the most time to train with a sword, or whoever walks around in chainmail day to day will win the majority of engagments. Criminals will work out, train, and wear armor because it gives them a significant advantage over ordinary people. With guns, everybody is on more or less equal footing. And because criminals are in the minority, they are disadvantaged.\n \n guns=facilitated killing=good", 
   {}, 
   305113, 
   null, 
   1205650860.0
  ], 
  [
   307720, 
   null, 
   "Shooterandproud", 
   "In two separate incidents, Georgia co-eds were brutally murdered recently...one at Auburn University and one at UNC, Chapel Hill. Both were victims of criminals using handguns.\n \n Apparently, both were victims of young, black males. Should we focus on the guns or the young, black males in determining the cause of these violent acts?\n \n Should we argue that guns should be taken from everyone?\n Should we argue that guns should be taken from young, black males?\n Should we argue that young, black males need special attention?\n Should we argue that co-eds need carry permits and firearms training?\n \n What should we argue for as a result of these senseless killings? Where should our anger be directed, if at anything?\n\n \n Easy. Criminals.", 
   {}, 
   304941, 
   null, 
   1207452600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Recent shootings...", 
  "url": "http://www.4forums.com/political/gun-control-debates/11040-recent-shootings.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11040, 
  "discussion_files": [
   [
    "30250.html", 
    "http://www.4forums.com/political/gun-control-debates/11040-recent-shootings-print.html"
   ]
  ], 
  "identifier": 11040
 }
]