[
 [
  [
   306139, 
   null, 
   "CUNxTime", 
   "Today I woke up thinking about communism and capitalism. Over time, I've heard a lot of negative comments about capitalism--that its not 'fair' and that people are hurt by having to compete and many other things. I was thinking about how the people who espouse communism deny that the USSR was 'true communism'. \n \n But I was thinking that there are places where 'true' communism has been practiced for thousands of years. I, of course, am referring to the tribes living in the jungle rainforests in Brazil, Africa, and S. Asia. Now, whether or not you think that one culture is 'better' or not, we can say that, in the thousands of years they've been at it, life hasn't changed much in those cultures. They have an extremely high infant mortality rate and are acceptable to minor changes in the environment (1 year drought can wipe out a whole village, etc). These villages share everything. One must share what they kill or find for food, no private property, etc.. so there's no incentive to strive to better your position, no innovation, and no 'growth' as a culture.\n \n Now, capitalism has only been for a few hundred years and our society has literally rocketed from agrarian to the moon. IMO This is indicative of the effort people will generate when they are able to accumulate private property. \n I'd like to get some feedback from both sides on this issue, especially people who think that capitalism isn't a good system. Thanks!", 
   {
    "post_info": {
     "post_title": "True communism- tried and found wanting!"
    }
   }, 
   null, 
   null, 
   1205684220.0
  ], 
  [
   306954, 
   null, 
   "Siegfriedson", 
   "I would recommending reading this description of Marxism:\n \n http://www.fredoneverything.net/Marx.shtml\n \n \n \n .", 
   {}, 
   306139, 
   null, 
   1206764040.0
  ], 
  [
   307794, 
   null, 
   "CUNxTime", 
   "I would recommending reading this description of Marxism:\n \n http://www.fredoneverything.net/Marx.shtml\n \n \n \n .\n\n \n \n LOVED it brother!", 
   {}, 
   306954, 
   null, 
   1207547100.0
  ], 
  [
   307876, 
   null, 
   "obvious_child", 
   "Cun, the USSR was not Communist. \n \n For a nation to be communist, a few things need to be in place:\n 1) Rule by the workers, essentially a democracy\n 2) Classless Society\n 3) Communal Ownership\n \n Now, if you look at the USSR, it was run by a few men, or one man at any one point in time. The workers had virtually no say in the direction of the nation or policy. That is antithetical to Communism. Second, classes did exist. Those higher up within the military as well as those in the party were significently better off and had more rights and powers then the average citizen. The scientists in the military and research cities had much more ownership rights and were rewarded based on a capitalistic method. The more research and applied concepts they produced the more stuff they got, like fridges and cars. \n \n That's not a Marxist Communist nation.", 
   {}, 
   307794, 
   null, 
   1207610820.0
  ], 
  [
   307912, 
   null, 
   "Iuris", 
   "The closes to the idea of communism we get in the real world is when we look at the family as a form of communism. Other real world attempts never got even close to as close to true communism.", 
   {}, 
   307876, 
   null, 
   1207643460.0
  ], 
  [
   307917, 
   null, 
   "bhbcu64", 
   "CUNx,\n \n One must share what they kill or find for food, no private property, etc.. so there's no incentive to strive to better your position, no innovation, and no 'growth' as a culture.\n \n Why are these necessarily the most important values for a society to have?\n \n Sounds more than a bit ethnocentric to me.emoticon_smile", 
   {}, 
   307912, 
   null, 
   1207663320.0
  ], 
  [
   307919, 
   null, 
   "CUNxTime", 
   "CUNx,\n \n One must share what they kill or find for food, no private property, etc.. so there's no incentive to strive to better your position, no innovation, and no 'growth' as a culture.\n \n Why are these necessarily the most important values for a society to have?\n \n Sounds more than a bit ethnocentric to me.emoticon_smile\n\n \n Perhaps, but my wife watches a show called living with the Mek. Those people haven't changed in 1000 years and they still have a high infant mortality rate, the entire tribe faces death when there is the slightest trouble with the food supply, and they're susceptible to every disease and have no medicine. One bad year can wipe an entire tribe out.", 
   {}, 
   307917, 
   null, 
   1207664100.0
  ], 
  [
   307920, 
   null, 
   "CUNxTime", 
   "Cun, the USSR was not Communist. \n \n For a nation to be communist, a few things need to be in place:\n 1) Rule by the workers, essentially a democracy\n 2) Classless Society\n 3) Communal Ownership\n \n Now, if you look at the USSR, it was run by a few men, or one man at any one point in time. The workers had virtually no say in the direction of the nation or policy. That is antithetical to Communism. Second, classes did exist. Those higher up within the military as well as those in the party were significently better off and had more rights and powers then the average citizen. The scientists in the military and research cities had much more ownership rights and were rewarded based on a capitalistic method. The more research and applied concepts they produced the more stuff they got, like fridges and cars. \n \n That's not a Marxist Communist nation.\n\n \n No, but the Mek are!", 
   {}, 
   307876, 
   null, 
   1207664160.0
  ], 
  [
   307941, 
   null, 
   "Jo Bennett", 
   "Marxism describes a situation following a revolution in a capitalist system. You cannot claim that a tribal society is marxist, it simply doesn't fit the theory. It's worth remembering that developed tribal societies lasted well into the 1700s in western europe and it was only forcible eradication that destroyed them. I'm thinking of course of the highland clans.\n \n If we're going to take infant mortality as the measure of a society, you will note that (ostensibly) communist Cuba has a lower infant mortality rate than capitalist America.", 
   {}, 
   307920, 
   null, 
   1207676760.0
  ], 
  [
   307962, 
   null, 
   "CUNxTime", 
   "First, I'm sure that the Cuban's report whatever they feel is 'good' for Cuba. But I'm sure the difference between Cuba and the US is nothing compared to the US and the Mek or even Mexico and the Mek.", 
   {}, 
   307941, 
   null, 
   1207699260.0
  ], 
  [
   307963, 
   null, 
   "daewoo", 
   "Debates about what the \"better\" system is are as old as the hills and frankly will (IMO) never be resolved for the simple fact that there are serious problems with both systems. For every example like the Mek, I could give you 10 examples of poor, starving trabes in Africa that are based on a capitalist system. Neither system seems to ensure prosperity or to even increase the odds of prosperity.\n \n Part of the problem with capitalism is with our implementation of capitalism, which more closely resembles feudalism than any classic picture of capitalism. Maybe it is a fundamental weakness of capitalist systems that those who manage to acquire wealth will use that wealth to influence whatever governing power exists in order to codify unfair advantages for themselves. It has certainly happened in every capitalist society we have ever seen, so maybe it is inherent to the capitalist system. \n \n In all practicality the \"best\" system for now is probably some mix of the two. IMO part of what has hampered our development as a species over the last several decades has been the idea that there are essentially 2 choices when it comes to the system we live under and we MUST pick one and defend it. The day may well come that we recognize that NEITHER system is the answer to all the worlds ills. \n \n In the mean time, we seem to have an awful lot of people who would not know a free market if they tripped over it running around arguing that letting the free market sort out industries like the oil industry and health care industry, which are not free market industries either in practice or by their very nature. \n \n That seems to pollute the issue quite a bit.", 
   {}, 
   307941, 
   null, 
   1207699560.0
  ], 
  [
   307969, 
   null, 
   "obvious_child", 
   "Debates about what the \"better\" system is are as old as the hills and frankly will (IMO) never be resolved for the simple fact that there are serious problems with both systems. For every example like the Mek, I could give you 10 examples of poor, starving trabes in Africa that are based on a capitalist system. Neither system seems to ensure prosperity or to even increase the odds of prosperity.\n\n \n And more pointed, Somalia during the warlord eras was essentially anarchy. That is absolutely free capitalism. Yet Somalia's GDP actually decreased significently during those times of absolute free capitalism. \n \n \nMaybe it is a fundamental weakness of capitalist systems that those who manage to acquire wealth will use that wealth to influence whatever governing power exists in order to codify unfair advantages for themselves. It has certainly happened in every capitalist society we have ever seen, so maybe it is inherent to the capitalist system.\n\n \n That is assumed with Capitalism. The very framework for capitalism to operate properly is one that can be manipulated by those within it. \n \n \nIn the mean time, we seem to have an awful lot of people who would not know a free market if they tripped over it running around arguing that letting the free market sort out industries like the oil industry and health care industry, which are not free market industries either in practice or by their very nature.\n\n \n Well that is partially due to their failure to understand what capitalism actually is. One user I was talking to said that a capitalistic market will take care of the uninsured. He fled the scene after I discussed that capitalist ventures only allocate resources towards things that will be profitable. Uninsured and poverty healthcare is a money losing proposition. Therefore no capitalist venture will engage in it.", 
   {}, 
   307963, 
   null, 
   1207706820.0
  ], 
  [
   307988, 
   null, 
   "Jo Bennett", 
   "First, I'm sure that the Cuban's report whatever they feel is 'good' for Cuba. But I'm sure the difference between Cuba and the US is nothing compared to the US and the Mek or even Mexico and the Mek.\n\n \n Well, I'm basing this on figures from the CIA World Factbook. Are you saying the CIA trusts Cuban propaganda? emoticon_xclown", 
   {}, 
   307962, 
   null, 
   1207722000.0
  ], 
  [
   308015, 
   null, 
   "Iuris", 
   "Are you saying the CIA trusts Cuban propaganda? \n\n Umm, it's the CIA. Might improve report accuracy?", 
   {}, 
   307988, 
   null, 
   1207736460.0
  ], 
  [
   308017, 
   null, 
   "CUNxTime", 
   "Well, I'm basing this on figures from the CIA World Factbook. Are you saying the CIA trusts Cuban propaganda? emoticon_xclown\n\n \n \n Their track record hasn't been sparkling, ever since Clinton dismantled them in the 90's.emoticon_xclown", 
   {}, 
   307988, 
   null, 
   1207750800.0
  ], 
  [
   308483, 
   null, 
   "JakeCJB", 
   "Now, capitalism has only been for a few hundred years and our society has literally rocketed from agrarian to the moon. IMO This is indicative of the effort people will generate when they are able to accumulate private property. \n I'd like to get some feedback from both sides on this issue, especially people who think that capitalism isn't a good system. Thanks!\n\n \n The reason for such spectacular technological advance has been public, not private, investment. The speculative captialist investor is guided by self-interest and short-term profits. They do not usually make the bulk of long-term investments in research and development, over decades, needed for major technological and scientific discoveries or breakthroughs. Literally going to the moon, was because of NASA, a government-owned, publically(taxpayer) funded company, not a private one. Computers were invented with public money for R&D. The research and development for new drugs to keep us healthy is mostly public money.", 
   {}, 
   306139, 
   null, 
   1208073420.0
  ], 
  [
   308540, 
   null, 
   "obvious_child", 
   "The reason for such spectacular technological advance has been public, not private, investment. The speculative captialist investor is guided by self-interest and short-term profits. They do not usually make the bulk of long-term investments in research and development, over decades, needed for major technological and scientific discoveries or breakthroughs. Literally going to the moon, was because of NASA, a government-owned, publically(taxpayer) funded company, not a private one. Computers were invented with public money for R&D. The research and development for new drugs to keep us healthy is mostly public money.\n\n \n Which shows that early development for many things is properly done in the public setting (which is seems to be true given the huge grants to universities) while commercial development and refinement is done best in the private sector. \n \n This isn't a bad thing. In fact this may be the best allocation of resources. Capitalism generally does not allocate resources to ventures it believes may not work where public financing often does.", 
   {}, 
   308483, 
   null, 
   1208120940.0
  ], 
  [
   308567, 
   null, 
   "CUNxTime", 
   "The reason for such spectacular technological advance has been public, not private, investment. The speculative captialist investor is guided by self-interest and short-term profits. They do not usually make the bulk of long-term investments in research and development, over decades, needed for major technological and scientific discoveries or breakthroughs. Literally going to the moon, was because of NASA, a government-owned, publically(taxpayer) funded company, not a private one. Computers were invented with public money for R&D. The research and development for new drugs to keep us healthy is mostly public money.\n\n \n \n I think you have a point in some respects, but it is generally the profit incentive that really pushes and drives advances. Bell's telephone networks are still running and Edison's light bulb is lighting the way. The dishwasher to the automobile to the many patents of GE have all been private. Look at other countries (ie. the former USSR and China) who generally rely on stolen technology for their economies and military, since the real breakthroughs come from profit motivated systems.", 
   {}, 
   308483, 
   null, 
   1208139600.0
  ], 
  [
   308586, 
   null, 
   "daewoo", 
   "I think you have a point in some respects, but it is generally the profit incentive that really pushes and drives advances. Bell's telephone networks are still running and Edison's light bulb is lighting the way. The dishwasher to the automobile to the many patents of GE have all been private. Look at other countries (ie. the former USSR and China) who generally rely on stolen technology for their economies and military, since the real breakthroughs come from profit motivated systems.\n\n \n These are pretty bad examples since both the nations electrical grid and the phone system were constructed almost entirely using public monies. \n \n There seems to be some disconnect here when it comes to the definition of capitalism. Capitalism does not necessarily preclude the possibility of government investment in some areas, particularly infrastructure investment. If not for government investment, we would not be much better off than some of those tribes were were discussing earlier that despite a capitalist structure are still running around in loin cloths chucking spears at their dinner.\n \n Look at the automobile. Before Henry Ford even finished his first factory he had employed people who did nothing but travel around trying to convince state and local governments to install automobile friendly roads. Automobiles were not well suited for the wagon tracks that passed for roads in most of the country and Ford knew that if governments, starting with federal followed by state and local, could not be convinced to install the better roads that led consumers to purchase automobiles that his brain child was going to be stillborn. \n \n This is what a lot of the \"free market\" advocates cannot seem to get their heads wrapped around. \"The market\" does a pretty decent job of spurring innovation when it comes to short term projects. When it comes to the longer view, the \"free market\" falls flat on its face because if there is not a profit there in the immediate and foreseeable future, nobody is going to do it. I have actually seen people argue for a market supplied solution to road building and maintenance. The argument falls flat on its face in the face of logical discussion and real world experience.\n \n We are getting into a \"free market\" type debate of late when it comes to alternative energy research and if the free marketers have their way, we are going to end up in a crisis with large numbers of Americans starving in the streets (literally). It may already be too late.\n \n The problem is that we are coming up on peak oil. At this point the only question is which year we passed it. The problem is that Alternative energy is still not really profitable for the most part and will not be for several more years. Thus far, the government has funded over 80% of AE research that has been done, so even the relatively minimal strides we have made there are thanks to government funding. Where the real problem comes is when oil production starts to decline. Studies have shown that in order to make it through that with only minimal disruptions (and even the \"minimal disruptions\" scenario sounds pretty bad when you consider our current lifestyles) we will have needed to start a CRASH PROGRAM similar to the Manhattan project 20 years before it occurs. \n \n This is jsut not something that free markets do well\n \n It is worth noting when discussing the relative merits of capitalism and socialism that both terms denote a means of production, no more, no less. Anything else that you amy attach to the terms is emotional baggage.", 
   {}, 
   308567, 
   null, 
   1208147940.0
  ], 
  [
   309000, 
   null, 
   "CUNxTime", 
   "Dae,\n \n I hear you and have said many times that I'm not a Laissez Faire type guy. My point was that the ability to accumulate capital (personal property) is the reason that the US is the country it is today. Sure there's a place for the govt. in ANY system, including this one. However, the reason our country has done so well, for so long and the reason we're so productive as workers is the fact that we have a right to participate in the system and accumulate wealth. \n \n Yes, the govt. will be needed to provide certain services. Yes, it is necessary to have rules, taxes, and a govt. to provide security and facilitate trade and etc... I've never said any different. However, there's a difference between saying that and saying that everything good has come through the govt. That's not true and if it was the USSR (or Germany) would rule the world today. The private sector is what drives the govt. and the economy. Without the Private Sector, there wouldn't be any govt. or tax money or tax payers to fund all the wonderful things that the govt. does. But too much govt. and the private sector whithers and with it, the govt. as well.", 
   {}, 
   308586, 
   null, 
   1208493660.0
  ], 
  [
   309008, 
   null, 
   "Jo Bennett", 
   "Your argument doesn't hold up. The economy of the USSR went from feudal agrarian to industrial in less than half a century. The proletariat at the time of the revolution numbered 4% of the population. The command economy catapulted the USSR to superpower status, which it only lost as a result of trying to maintain military superiority (40% of GDP on arms is going to do that). Many criticisms can be made of the USSR, lack of economic growth is not one of them. When capitalism was allowed in, look at the mess that resulted.", 
   {}, 
   309000, 
   null, 
   1208499960.0
  ], 
  [
   309051, 
   null, 
   "sinjin", 
   "Dae,\n \n I hear you and have said many times that I'm not a Laissez Faire type guy. My point was that the ability to accumulate capital (personal property) is the reason that the US is the country it is today. Sure there's a place for the govt. in ANY system, including this one. However, the reason our country has done so well, for so long and the reason we're so productive as workers is the fact that we have a right to participate in the system and accumulate wealth. \n \n Yes, the govt. will be needed to provide certain services. Yes, it is necessary to have rules, taxes, and a govt. to provide security and facilitate trade and etc... I've never said any different. However, there's a difference between saying that and saying that everything good has come through the govt. That's not true and if it was the USSR (or Germany) would rule the world today. The private sector is what drives the govt. and the economy. Without the Private Sector, there wouldn't be any govt. or tax money or tax payers to fund all the wonderful things that the govt. does. But too much govt. and the private sector whithers and with it, the govt. as well.\n\n I think you undervalue the combination of poor immigrants and vast untapped natural resources as it pertains to our success.", 
   {}, 
   309000, 
   null, 
   1208548140.0
  ], 
  [
   309084, 
   null, 
   "CUNxTime", 
   "Your argument doesn't hold up. The economy of the USSR went from feudal agrarian to industrial in less than half a century. The proletariat at the time of the revolution numbered 4% of the population. The command economy catapulted the USSR to superpower status, which it only lost as a result of trying to maintain military superiority (40% of GDP on arms is going to do that). Many criticisms can be made of the USSR, lack of economic growth is not one of them. When capitalism was allowed in, look at the mess that resulted.\n\n \n \n First of all, the people of the USSR were whipped into submission for that entire time. Not only didn't they have freedom, they didn't have meat, butter, or any of those 'little extras' we're so used to here. They were slaves to the state, basically. It's completely ludicrous to think that the 'average' citizen of the USSR lived in any comparable comfort to Westerners. Of course, those are the ones who lived and weren't murdered by Stalin or the KGB. GREAT PLACE, YEAH!!!!!!", 
   {}, 
   309008, 
   null, 
   1208559960.0
  ], 
  [
   309095, 
   null, 
   "daewoo", 
   "First of all, the people of the USSR were whipped into submission for that entire time. Not only didn't they have freedom, they didn't have meat, butter, or any of those 'little extras' we're so used to here. They were slaves to the state, basically. It's completely ludicrous to think that the 'average' citizen of the USSR lived in any comparable comfort to Westerners. Of course, those are the ones who lived and weren't murdered by Stalin or the KGB. GREAT PLACE, YEAH!!!!!!\n\n \n And you think that the tyranny and oppression under which the Soviets lived was the result of their economic system???", 
   {}, 
   309084, 
   null, 
   1208565240.0
  ], 
  [
   309128, 
   null, 
   "CUNxTime", 
   "And you think that the tyranny and oppression under which the Soviets lived was the result of their economic system???\n\n \n \n Actually, the only way a govt. could ever control a person enough to supplant their natural wish for freedom and opportunity is to brutally subjugate them. So, yes, actually, the brutality IS a result of their economic system. If the people (in the USSR) had had the ability to participate in the economic system then they wouldn't have had to have been suppressed like that. Look at China now (and Cuba, etc...) the reason that communist citizens must be totally controlled is because they aren't free and because that economic system can't produce enough of the products that people need (much less the products they want).", 
   {}, 
   309095, 
   null, 
   1208583720.0
  ], 
  [
   309134, 
   null, 
   "Jo Bennett", 
   "Actually, the only way a govt. could ever control a person enough to supplant their natural wish for freedom and opportunity is to brutally subjugate them. So, yes, actually, the brutality IS a result of their economic system. If the people (in the USSR) had had the ability to participate in the economic system then they wouldn't have had to have been suppressed like that. Look at China now (and Cuba, etc...) the reason that communist citizens must be totally controlled is because they aren't free and because that economic system can't produce enough of the products that people need (much less the products they want).\n\n \n You continue to neglect the very recent pre-industrial starting points of all these countries. I should also point out that America's wealth was built on slavery too. The reason the USSR couldn't provide for its people was that it was spending 40% of GDP on armaments and empire building. Political freedom has little to do with economic systems, most ordinary citizens have little control over what is produced by the economy, and what goods are available to them. A democratically controlled command economy would actually have more scope for freedom than the current plutocratic system. Every time a country has attempted democratic socialism, the CIA have intervened backing death squads and the like to suppress it. Ever heard of the School of the Americas?", 
   {}, 
   309128, 
   null, 
   1208598420.0
  ], 
  [
   309374, 
   null, 
   "CUNxTime", 
   "You continue to neglect the very recent pre-industrial starting points of all these countries. I should also point out that America's wealth was built on slavery too. The reason the USSR couldn't provide for its people was that it was spending 40% of GDP on armaments and empire building. Political freedom has little to do with economic systems, most ordinary citizens have little control over what is produced by the economy, and what goods are available to them. A democratically controlled command economy would actually have more scope for freedom than the current plutocratic system. Every time a country has attempted democratic socialism, the CIA have intervened backing death squads and the like to suppress it. Ever heard of the School of the Americas?\n\n \n \n The STARTING POINT of EVERYTHING was 'pre-industrial'. The US started with a couple of boat loads of people. How's that for a slow start? Hell, the USSR and others had to fence people in to their 'utopian' wonderland. As for the US wealth being built on Slavery, that's just plain wrong. The agrairian South (Actually the South East really) was the only place in the US that used slaves. The general culture of the south was poor and rural. The US spent much more ridding our country of slaver (durring the Civil war) than that economic system ever produced. \n \"A democratically controlled command economy\"? Yeah, right. Private Property is what gives people the incentive to be productive. Again, the proof is in the pudding. The US isn't the most populous country nor is it the biggest. It certainly isn't the oldest. But something about this young country has propelled not only us but much of the rest of the world into the modern era with a huge middle class and a robust economy that's produced more wealth, as well as technological and medical advances. What is it that makes the US so great? One of the biggest reasons is our SYSTEM. The system that allows people to control their own economic destiny.", 
   {}, 
   309134, 
   null, 
   1208821620.0
  ], 
  [
   309400, 
   null, 
   "daewoo", 
   "The STARTING POINT of EVERYTHING was 'pre-industrial'. The US started with a couple of boat loads of people. How's that for a slow start? Hell, the USSR and others had to fence people in to their 'utopian' wonderland. As for the US wealth being built on Slavery, that's just plain wrong. The agrairian South (Actually the South East really) was the only place in the US that used slaves. The general culture of the south was poor and rural. The US spent much more ridding our country of slaver (durring the Civil war) than that economic system ever produced. \n \"A democratically controlled command economy\"? Yeah, right. Private Property is what gives people the incentive to be productive. Again, the proof is in the pudding. The US isn't the most populous country nor is it the biggest. It certainly isn't the oldest. But something about this young country has propelled not only us but much of the rest of the world into the modern era with a huge middle class and a robust economy that's produced more wealth, as well as technological and medical advances. What is it that makes the US so great? One of the biggest reasons is our SYSTEM. The system that allows people to control their own economic destiny.\n\n \n LOL. Not exactly. \n \n The US was originally populated as part of the European imperial drive which was itself the result of the fact that Europe was starting to bump up against some pretty serious resource constraints so they were essentially forced to adopt a (very expensive) drive to increase their territory and, by proxy, their resource base.\n \n The US was a HUGE land just chalk full of the kind of natural resources that Europe needed. Initially it was this massive resource base that allowed the US to prosper (but only with some decidedly un-capitalist measures to encourage people to emigrate here to exploit those resources). As natural resources in Europe and England dwindled, the US make an enormous amount of money exploiting and selling ours. by 1915 fully half of the worlds gold reserves (talking bullion and coins here...not gold in place) had been produced by the United States. \n \n What actually allowed the US to emerge as a world leader and the richest nation in the world was WWII. Prior to WWII (and prior to the depression) Americans had a reasonably good standard of living, but nothing to write home about. Most Europeans had a comparable standard of living with many countries actually surpassing the US in that regard. When WWII came along, our government instituted massive spending programs to tool up for the war. They were careful to ensure that the money they spent for wartime production would not be wasted when the war was over. They ensured that the factories, etc.. that were built could serve a dual purpose...they could be quickly converted to civilian production in a post war world.\n \n Post WWII we had the only intact industrial infrastructure on the planet. That gave us a pretty good edge when it came to trade. We sold the rest of the world consumer goods. WE sold them industrial goods. We financed all the sales and collected interest on them for the next 20 years. If there was ever a \"golden age\" for america, that was it. Incomes shot through the roof, standard of living shot through the roof, debt hit an all time low (people did not need to borrow...they were making too much money to need that...only about 20% of people even took out mortgages for their homes). Since all that growth was the result of the production of tangible value, inflation was not even a problem. \n \n We made so much money in the post WWII manufacturing boom that it pretty much has allowed us to live on our national \"savings\" and rack up debt for the last 30 years, which from an industrial standpoint have been largely unproductive. That is also why we are now the worlds biggest debtor nation, our treasury secretary keeps having to get up in front of congress and warn that we are nearing insolvency, and our comptroller keeps warning us that we may well end up a third world nation within the next couple decades. \n \n None of this is the result of capitalism. In fact the resource exploitation that pretty much funded the country for the first half of its existence was primarily the result of socialist like policies. \n \n I will be the first to agree that capitalism is a pretty good system but you seem to have a real problem with the relationship between correlation and causation.", 
   {}, 
   309374, 
   null, 
   1208842860.0
  ], 
  [
   309408, 
   null, 
   "Jo Bennett", 
   "You missed the key words \"very recent\" - the USSR pretty much began from an agrarian base in 1917. The US entered the industrial revolution not long after Britain did, in a far more hospitable climate and without outside pressure - let's not forget that the new regime came under attack from white forces almost as soon as WW1 ended.", 
   {}, 
   309400, 
   null, 
   1208845380.0
  ], 
  [
   309416, 
   null, 
   "CUNxTime", 
   "LOL. Not exactly. \n \n The US was originally populated as part of the European imperial drive which was itself the result of the fact that Europe was starting to bump up against some pretty serious resource constraints so they were essentially forced to adopt a (very expensive) drive to increase their territory and, by proxy, their resource base.\n \n The US was a HUGE land just chalk full of the kind of natural resources that Europe needed. Initially it was this massive resource base that allowed the US to prosper (but only with some decidedly un-capitalist measures to encourage people to emigrate here to exploit those resources). As natural resources in Europe and England dwindled, the US make an enormous amount of money exploiting and selling ours. by 1915 fully half of the worlds gold reserves (talking bullion and coins here...not gold in place) had been produced by the United States. \n \n What actually allowed the US to emerge as a world leader and the richest nation in the world was WWII. Prior to WWII (and prior to the depression) Americans had a reasonably good standard of living, but nothing to write home about. Most Europeans had a comparable standard of living with many countries actually surpassing the US in that regard. When WWII came along, our government instituted massive spending programs to tool up for the war. They were careful to ensure that the money they spent for wartime production would not be wasted when the war was over. They ensured that the factories, etc.. that were built could serve a dual purpose...they could be quickly converted to civilian production in a post war world.\n \n Post WWII we had the only intact industrial infrastructure on the planet. That gave us a pretty good edge when it came to trade. We sold the rest of the world consumer goods. WE sold them industrial goods. We financed all the sales and collected interest on them for the next 20 years. If there was ever a \"golden age\" for america, that was it. Incomes shot through the roof, standard of living shot through the roof, debt hit an all time low (people did not need to borrow...they were making too much money to need that...only about 20% of people even took out mortgages for their homes). Since all that growth was the result of the production of tangible value, inflation was not even a problem. \n \n We made so much money in the post WWII manufacturing boom that it pretty much has allowed us to live on our national \"savings\" and rack up debt for the last 30 years, which from an industrial standpoint have been largely unproductive. That is also why we are now the worlds biggest debtor nation, our treasury secretary keeps having to get up in front of congress and warn that we are nearing insolvency, and our comptroller keeps warning us that we may well end up a third world nation within the next couple decades. \n \n None of this is the result of capitalism. In fact the resource exploitation that pretty much funded the country for the first half of its existence was primarily the result of socialist like policies. \n \n I will be the first to agree that capitalism is a pretty good system but you seem to have a real problem with the relationship between correlation and causation.\n\n \n \n Again, the USSR is bigger than the US and has more resources. How come they weren't doing so well? You've got to admit that it is our SYSTEM that allows a country that isn't the biggest, the most populous, or with the most resources. Its the system.", 
   {}, 
   309400, 
   null, 
   1208879640.0
  ], 
  [
   309439, 
   null, 
   "Jo Bennett", 
   "Again, the USSR is bigger than the US and has more resources. How come they weren't doing so well? You've got to admit that it is our SYSTEM that allows a country that isn't the biggest, the most populous, or with the most resources. Its the system.\n\n \n The climate certainly has an impact, as does the starting point, which you keep trying to wriggle out of. Russia only emancipated its serfs in the late 19th century, something which happened centuries earlier in western europe. It took the capitalist system 300 years to achieve what centralised planning managed in 50. It's also worth noting that during the quickest phases of development, both the US and western europe were heavily protectionist and supportive of their own industries, they developed best with the addition of central support, much as China is doing today and South Korea did previously.", 
   {}, 
   309416, 
   null, 
   1208888220.0
  ], 
  [
   309465, 
   null, 
   "Iuris", 
   "Do you know what pre-communist Russia was like? What the rest of the eastern block areas were like? How advanced they were compared to the west?\n \n Well, for starters try this: my very own Slovenia was an averagely developed area of Austro-Hungary (how do you English call it, anyway?), and when it became a part of Yugoslavia, it benefited because it was suddenly the most advanced region of Yugoslavia.\n \n The US has had a long war free period to develop in while the soviet Russia started during an exhausting war, faced another war soon after, and even before the first war was underdeveloped.\n \n \n \n Anyway, all beside the point. The basics of communism were only barely tried. And not in russia - poor Yugoslavia took the most experimental approaches. Marx' ideas were a critique and a proposed solution to the excesses of capitalism gone rampant. WHile the methods he proposed are suspect, at least you may want to think about what it must have been like that people went for them.\n \n \n \n One final thought I'd like to offer, my own evaluation of communism: while it did not work out as it was supposed to (for starters, it never actually got implemented), it did offer an alternative to western capitalism, and the very existence of this alternative has made capitalist systems restrain themselves, which made capitalism better.", 
   {}, 
   309416, 
   null, 
   1208896860.0
  ], 
  [
   309518, 
   null, 
   "daewoo", 
   "Again, the USSR is bigger than the US and has more resources. How come they weren't doing so well? You've got to admit that it is our SYSTEM that allows a country that isn't the biggest, the most populous, or with the most resources. Its the system.\n\n \n As other posters have pointed out, climate has a lot to do with it, as does the fact that they had their industrial revolution later than we did and did not have the socialist, anti private property policies that the US had in place to encourage productive resource utilization. Additionally, while they do have large amounts of some resources, they were not lucky enough to end up with literally millions of tons of gold that they could just wash out of streams or that could be accessed with 19th century mining technology. \n \n The USSR failed because we engaged them in an expensive proxy war for decades, after they took MASSIVE losses in WWII.", 
   {}, 
   309416, 
   null, 
   1208937900.0
  ], 
  [
   309519, 
   null, 
   "obvious_child", 
   "Again, the USSR is bigger than the US and has more resources. How come they weren't doing so well? You've got to admit that it is our SYSTEM that allows a country that isn't the biggest, the most populous, or with the most resources. Its the system.\n\n \n Interestingly enough, it has relatively little to do with capitalism. The USSR industrialized and grew its GDP to relatively near the the US, except it did it in 30~40 years where the US took 200. Britain took even longer. That's a serious accomplishment. What is preventing Russia to grow outside of hydrocarbons it is serious lack of the necessary legal and regulatory framework for capitalism to function. Perestroika & Glasnost essentially screwed over Russia. Too much too soon. It's not Communism vs Capitalism that is preventing Russian growth. It is the lack of a proper legal and regulatory framework.", 
   {}, 
   309416, 
   null, 
   1208938260.0
  ], 
  [
   309526, 
   null, 
   "CUNxTime", 
   "The climate certainly has an impact, as does the starting point, which you keep trying to wriggle out of. Russia only emancipated its serfs in the late 19th century, something which happened centuries earlier in western europe. It took the capitalist system 300 years to achieve what centralised planning managed in 50. It's also worth noting that during the quickest phases of development, both the US and western europe were heavily protectionist and supportive of their own industries, they developed best with the addition of central support, much as China is doing today and South Korea did previously.\n\n \n The USSR wasn't EVER able to properly support its people. The only reason that system was able to last as long as it did was because the people were beaten into submission. The people of the USSR and other communist countries only allowed the system to persist because they either were 1. in control or 2. controlled. That communist could ever compete with capitalism is impossible and wouldn't have lasted half as long as it did without the iron fist of the govt.\n \n @dae You want to talk about Massive losses, Stalin killed 20,000,000 people. Obviously they had population to spare.\n \n @ O.C. I'm talking more about the USSR, not so much the problems of Russia today (which are many). The point is that A. communism never competed with capitalism economically since we were able to win the Guns AND Butter races and B. the main difference is that people in capitalist societies participate because they CAN and in Communist countries because the HAVE to. People are much more productive doing things that the choose to do rather than things they are forced to do....", 
   {}, 
   309439, 
   null, 
   1208960520.0
  ], 
  [
   309541, 
   null, 
   "daewoo", 
   "The USSR wasn't EVER able to properly support its people. The only reason that system was able to last as long as it did was because the people were beaten into submission. The people of the USSR and other communist countries only allowed the system to persist because they either were 1. in control or 2. controlled. That communist could ever compete with capitalism is impossible and wouldn't have lasted half as long as it did without the iron fist of the govt.\n\n \n And then somebody whispers \"Sweden\" and your entire argument swirls down the toilet. Sweden is a nation of granola crunching socialists and they have the highest standard of living in the world...higher even than the US. \n \n I admit that I have not kept up on world events quite as well since I retired, but I have not seen any stories about Swedish death camps or about the tyrannical conditions under which the swedes live. \n \n \n@dae You want to talk about Massive losses, Stalin killed 20,000,000 people. Obviously they had population to spare.\n \n\n \n They did have population to spare....especially since so much of their industrial infrastructure and so many of their major cities had been completely WIPED OUT. That is why we won the \"guns and butter\" race. They had to start the race by building an entirely new industrial infrastructure and rebuilding several major cities. We started the race with a brand new industrial infrastructure and no war damage. \n \n In that same vein...how many European nations, which started rebuilding at the same time as the Soviets, but with massive aid from the US, managed to rebuild into a superpower?? I can not think of any off the top of my head.", 
   {}, 
   309526, 
   null, 
   1208971860.0
  ], 
  [
   309543, 
   null, 
   "Jo Bennett", 
   "I don't think the all the people in the US participate out of choice, for many they are forced to work horrendous hours for sub-survivable wages in order to scrape by. The unemployed are forced into work long distances from home simply to satisfy the middle class lust for punishment of the poor, with no thought to helping them secure retraining and a long term future. Not to mention all those living with chronic illnesses because they can't afford insurance or medical fees.", 
   {}, 
   309541, 
   null, 
   1208973240.0
  ], 
  [
   309600, 
   null, 
   "CUNxTime", 
   "I don't think the all the people in the US participate out of choice, for many they are forced to work horrendous hours for sub-survivable wages in order to scrape by. The unemployed are forced into work long distances from home simply to satisfy the middle class lust for punishment of the poor, with no thought to helping them secure retraining and a long term future. Not to mention all those living with chronic illnesses because they can't afford insurance or medical fees.\n\n \n Jo, even unemployeed people on welfare have flatscreen tvs and cable.", 
   {}, 
   309543, 
   null, 
   1209010020.0
  ], 
  [
   309601, 
   null, 
   "CUNxTime", 
   "[QUOTE]\nAnd then somebody whispers \"Sweden\" and your entire argument swirls down the toilet. Sweden is a nation of granola crunching socialists and they have the highest standard of living in the world...higher even than the US. \n\n \n Except the difference is that Sweden makes its money laundering everyone ELSE'S dirty money. \n \n \nI admit that I have not kept up on world events quite as well since I retired, but I have not seen any stories about Swedish death camps or about the tyrannical conditions under which the swedes live. \n\n \n No, and if the US was a tiny, mountainous, homogeneous country made of gold and banks full of well educated people who don't mind working for a living, we probably wouldn't have half the problems we have here today. But of course, then everyone would be speaking German, Italian, and Japoneese and the world would be just GREAT! yeehaa! \n \n \n \nThey did have population to spare....especially since so much of their industrial infrastructure and so many of their major cities had been completely WIPED OUT. That is why we won the \"guns and butter\" race. They had to start the race by building an entirely new industrial infrastructure and rebuilding several major cities. We started the race with a brand new industrial infrastructure and no war damage. \n \n In that same vein...how many European nations, which started rebuilding at the same time as the Soviets, but with massive aid from the US, managed to rebuild into a superpower?? I can not think of any off the top of my head.\n\n \n \n Actually, their industrial infrastructure was put on trains and moved East to avoid war damage AND the US gave them plenty of Aid during the war. But I guess the fact that the entire 100,000,000 (-20,000,000 killed) population were basically slave labor helped too! And they were able to keep them enslaved for about 50 more years, until they realized its better to be free (and have butter and TV's)", 
   {}, 
   309541, 
   null, 
   1209010560.0
  ], 
  [
   309631, 
   null, 
   "Jo Bennett", 
   "Jo, even unemployeed people on welfare have flatscreen tvs and cable.\n\n \n Prove it. Prove that every unemployed person has cable and a flatscreen TV. Heck, prove to me that more than half have them.\n \n EDIT: learn the difference between Sweden and Switzerland.", 
   {}, 
   309600, 
   null, 
   1209025800.0
  ], 
  [
   309644, 
   null, 
   "CUNxTime", 
   "Prove it. Prove that every unemployed person has cable and a flatscreen TV. Heck, prove to me that more than half have them.\n\n \n I happen to know many people who receive benefits of various kinds. The particular example I was thinking of is a couple who have (including 2 of hers from a previous relationship) 4 kids, a drug problem, AND a computer and a flat screen TV. They get jobs every now and then but, as I said, still manage to keep the cable on (most of the time). Also, as I've said before, I grew up very poor in MD. I knew many people (and still do) who got food stamps (now called the independence cardemoticon_frazzled ) and HBO, they didn't have flat screens then-lol. There many, many examples of this. Our poor should be the envy of the world (or are) and most of their problems are, one way or another, of their own making.\n \n \n EDIT: learn the difference between Sweden and Switzerland.\n\n \n LOL, my glasses broke and its getting rather embarrassing", 
   {}, 
   309631, 
   null, 
   1209051420.0
  ], 
  [
   384626, 
   null, 
   "mysticjbyrd", 
   "LOL, my glasses broke and its getting rather embarrassing\n\n \n I too would be embarrassed, if I was as ignorant as you.", 
   {}, 
   309644, 
   null, 
   1262659500.0
  ], 
  [
   385053, 
   null, 
   "CUNxTime", 
   "I too would be embarrassed, if I was as ignorant as you.\n\n \n Hey there, I've really never done any of these argument sites but my brother, Cunxtime (or Sep to the rest of us) really enjoyed it. He may have been many things but ignorant wasn't one of them. It cool though that a lot of his thoughts are here on this site. He talked a lot about his discussions. I'm going to try to figure out how this works and make an account...it's weird enough using his old computer. Give me a while to read through these old comments and I'll take a shot at defending him...certainly not as well as he would but still I can't have someone insulting my dead brother.", 
   {}, 
   384626, 
   null, 
   1262941020.0
  ], 
  [
   385062, 
   null, 
   "gansao", 
   "Hey there, I've really never done any of these argument sites but my brother, Cunxtime (or Sep to the rest of us) really enjoyed it. He may have been many things but ignorant wasn't one of them. It cool though that a lot of his thoughts are here on this site. He talked a lot about his discussions. I'm going to try to figure out how this works and make an account...it's weird enough using his old computer. Give me a while to read through these old comments and I'll take a shot at defending him...certainly not as well as he would but still I can't have someone insulting my dead brother.\n\n \n Cunxtime was liked and respected by all but a few on this site.\n Dont be too offended by some insults..We all give and recieve them from time to time,its part of the fun!\n Thank you for confiming what most of us suspected but the person that insulted Sep would not have known that he had passed away.\n Maybe you will stick around and become one of the regular combatants!\n Please give my/our regards to Seps widow who was kind enough to let us know how ill he was.", 
   {}, 
   385053, 
   null, 
   1262953920.0
  ], 
  [
   385071, 
   null, 
   "trebor", 
   "Hey there, I've really never done any of these argument sites but my brother, Cunxtime (or Sep to the rest of us) really enjoyed it. He may have been many things but ignorant wasn't one of them. It cool though that a lot of his thoughts are here on this site. He talked a lot about his discussions. I'm going to try to figure out how this works and make an account...it's weird enough using his old computer. Give me a while to read through these old comments and I'll take a shot at defending him...certainly not as well as he would but still I can't have someone insulting my dead brother.\n\n \n You have my condolences over the passing of your brother.", 
   {}, 
   385053, 
   null, 
   1262966040.0
  ], 
  [
   385076, 
   null, 
   "Penfold", 
   "Condolences too. What a happy coincidence that you should log on to this site a mere 6 hours after a passing troll registers here and attacks Sep's two years old post. I'm confident you'll be able to quickly pick up the skills in order to defend your dead brother's reputation, and indeed establish one of your own. Welcome.", 
   {}, 
   385071, 
   null, 
   1262968020.0
  ], 
  [
   385083, 
   null, 
   "JPSartre12", 
   "Hey there, I've really never done any of these argument sites but my brother, Cunxtime (or Sep to the rest of us) really enjoyed it. He may have been many things but ignorant wasn't one of them. It cool though that a lot of his thoughts are here on this site. He talked a lot about his discussions. I'm going to try to figure out how this works and make an account...it's weird enough using his old computer. Give me a while to read through these old comments and I'll take a shot at defending him...certainly not as well as he would but still I can't have someone insulting my dead brother.\n\n \n My condolences on your lost. Your brother had a keen mind. We enjoyed his wit as well. \n We hope you stay a while.", 
   {}, 
   385053, 
   null, 
   1262969880.0
  ], 
  [
   434131, 
   null, 
   "kowalskil", 
   " \n \n ... But I was thinking that there are places where 'true' communism has been practiced for thousands of years. I, of course, am referring to the tribes living in the jungle rainforests in Brazil, Africa, and S. Asia. ... \n\n \n Yes, the term communism has many different meanings. \n \n Ludwik Kowalski (see Wikipedia)\n .", 
   {}, 
   306139, 
   null, 
   1310276700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  True communism- tried and found wanting!", 
  "url": "http://www.4forums.com/political/society-debates/11069-true-communism-tried-found-wanting.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 11069, 
  "discussion_files": [
   [
    "28921.html", 
    "http://www.4forums.com/political/society-debates/11069-true-communism-tried-found-wanting-print.html"
   ], 
   [
    "28922.html", 
    "http://www.4forums.com/political/society-debates/11069-true-communism-tried-found-wanting-4-print.html"
   ], 
   [
    "28923.html", 
    "http://www.4forums.com/political/society-debates/11069-true-communism-tried-found-wanting-3-print.html"
   ], 
   [
    "28924.html", 
    "http://www.4forums.com/political/society-debates/11069-true-communism-tried-found-wanting-2-print.html"
   ]
  ], 
  "identifier": 11069
 }
]