[
 [
  [
   306122, 
   null, 
   "foundit66", 
   "(Edinburgh) Claims by a Catholic bishop that gays use the Holocaust to further their political objectives have sparked outrage in the Scottish capital.\n \n \"The homosexual lobby has been extremely effective in aligning itself with minority groups,\" the Right Rev Joseph Devine, the Roman Catholic Bishop of Motherwell, told a Glasgow audience.\n \n \"It is ever present at the service each year for the Holocaust memorial - as if to create for themselves the image of a group of people under persecution,\" he told the audience.\n \n \"I want to ask you if you are able to see the giant conspiracy that's taking place before our eyes? It's a very small group of people, but very active and organized, and extremely indulgent.\"\n \n Devine, in his speech titled 'Sectarianism and Secularism: Bugbears for the Catholic Church in Scotland' went on to further blast LGBT civil rights leaders, specifically targeting Oscar-winning actor Sir Ian McKellen.\n \n McKellen, who was one of the founder of gay rights group Outrage, was honored by the Queen this year.\n \n \"In this New Year's Honours List, I saw actor Ian McKellen being honoured for his work on behalf of homosexuals. A century ago, Oscar Wilde was locked up and put in jail,\" Devine said.\n \n The speech drew immediate condemnation from Scottish gays.\n \n Calum Irving, the director of Stonewall Scotland, said the bishop was \"deluded\" and failed to note that the Catholic Church wields considerably more power than gay activists.\n \n \"I'm flattered that the bishop thinks we could mount a 'huge and well-orchestrated' conspiracy, but he is much deluded,\" Irving told the Scotsman newspaper. \"After all, which 'lobby' really has the greater resources and political access?\"\n \n Irving said he \"would defend the bishop's right to practice his faith and yet he would deny me basic dignity and respect. Worse, he appears to hanker after an age when Oscar Wilde was put in jail for being gay. Worse still, he seems to infer that gay people have no right to be remembered as victims of the Holocaust.\"\n \n The Nazis required \"sexual deviants\" to wear the pink triangle. \n \n Under Paragraph 175 of the German penal code, which banned sexual intimacy between members of the same gender, an untold number of gays were rounded up by the Nazis and send to concentration camps where they were subjected to medical experiments including lobotomies, and forced to work in labor camps.\n \n The number of gays sent to the camps ranges from 5,000 to 15,000, many of them sent to the gas chambers.\n \n Irving and other LGBT leaders have called on Devine to apologize. The bishop says he has nothing to apologize for.\n http://www.365gay.com/Newscon08/03/031308scot.htm\n \n I am eternally amused at the refusal to admit the obvious for some anti-gay people.\n Gays WERE killed in the Holocaust.\n And this guy objects to the idea that people want that fact remembered along with the deaths of the Jews.\n \n Yet another reason why so many young people, Christian and non-Christian alike, are recognizing the anti-gay venom that some loud elements of Christianity have.\n \n One would think that the OTHER elements of Christianity would want to try to help save face, and correct these members who lose themselves in anti-gay prejudice...", 
   {
    "post_info": {
     "post_title": "Gay Deaths At Hands Of Nazi's A Political Ploy Says Catholic Bishop"
    }
   }, 
   null, 
   null, 
   1205648580.0
  ], 
  [
   306181, 
   null, 
   "jyoshu", 
   "For anyone interested, there has been more attention given in recent years to recognize the millions of victims of the holocaust that were not Jewish. Those victims included the disabled, mentally ill, christians, gays, freemasons, Soviet POWS, and lots of others.\n \n http://www.holocaustforgotten.com/fivmil.htm\n \n http://en.wikipedia.org/wiki/Holocaust_victims", 
   {}, 
   306122, 
   null, 
   1205708520.0
  ], 
  [
   306188, 
   null, 
   "bhbcu64", 
   "jyoshu,\n \n You might just be interested in a book called The Pink Triangle which deals with the Nazi treatment of gay men.\n \n Lesbian women, on the other hand, were bred to SS soldiers and had a relatively easier time of it.", 
   {}, 
   306181, 
   null, 
   1205712780.0
  ], 
  [
   306191, 
   null, 
   "Big_Bear_Scot", 
   "Bishop Devine, what an idiot that guy is. He claimed that there is an organized conspiracy from the Gay Community to destroy traditional Christian values. I would say the Catholic Church has done that already.\n \n \n\"In this New Year's Honours List, I saw actor Ian McKellen being honoured for his work on behalf of homosexuals. A century ago, Oscar Wilde was locked up and put in jail,\" Devine said.\n\n \n I guess he wants to go back to the days when a Homosexual could be sent to prison. How very Christian of him.\n \n What amazes me this not from some wacko Fundamentalist, he is one of the highest ranking Bishops in the UK.\n \n He also doesn't want Gays to teach Catholic Children\n http://news.bbc.co.uk/1/hi/scotland/4366075.stm\n He also doesn't want Gays to adopt children\n http://www.patrickharviemsp.com/?p=48\n \n This is another reason why the Catholic Church in Scotland is fast becoming an irrelevance.", 
   {}, 
   306188, 
   null, 
   1205713980.0
  ], 
  [
   306228, 
   null, 
   "HonestAbe", 
   "Bishop Devine, what an idiot that guy is. He claimed that there is an organized conspiracy from the Gay Community to destroy traditional Christian values. I would say the Catholic Church has done that already.\n \n \n \n I guess he wants to go back to the days when a Homosexual could be sent to prison. How very Christian of him.\n \n What amazes me this not from some wacko Fundamentalist, he is one of the highest ranking Bishops in the UK.\n \n He also doesn't want Gays to teach Catholic Children\n http://news.bbc.co.uk/1/hi/scotland/4366075.stm\n He also doesn't want Gays to adopt children\n http://www.patrickharviemsp.com/?p=48\n \n This is another reason why the Catholic Church in Scotland is fast becoming an irrelevance.\n\n \n IMHO, the world would be better off if all religions became irrelevant.", 
   {}, 
   306191, 
   null, 
   1205755080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gay Deaths At Hands Of Nazi's A Political Ploy Says Catholic Bishop", 
  "url": "http://www.4forums.com/political/gay-rights-debates/11068-gay-deaths-hands-nazis-political-ploy-says-catholic-bishop.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 11068, 
  "discussion_files": [
   [
    "32023.html", 
    "http://www.4forums.com/political/gay-rights-debates/11068-gay-deaths-hands-nazis-political-ploy-says-catholic-bishop-print.html"
   ]
  ], 
  "identifier": 11068
 }
]