[
 [
  [
   305997, 
   null, 
   "GiantOreo", 
   "Was reading AA and Peeling's 1 on 1 debate, and read Archangels latest post. Since there isn't a \"popcorn gallery\" sort of thing going on for that forum, I'll comment here.\n \n Here was the quote that caught my eye: \nThis link about Geologic Evolution: http://www.handprint.com/PS/GEO/geoevo.html goes back 510 million years to the present and explains the processes the Earth took to get to where the Earth is today, geologically speaking. Notice how it describes the level life on Earth had attained around 270 million years ago, yet I just watched a documentary on Nat. Geo that very clearly showed that 250 million years ago, the Earth was basically engulfed in volcanic flames. Another example of contradictory evidence within the scientific community regarding the different stages of evolution the Earth experienced in order to get where we're at today.\n \n\n \n Now, there seem to be several sources of confusion for Archangel here. The first is that the time scale on the site he linked to is off The Permian began 300 million years ago (not 270 - unless they are trying to name when a particular event occured or something). Triasic began 250 Ma (not 230) - actually more like 251 Ma So I see where that could confuse you.\n \n Second, I don't think you are grasping the length of time involved here - I have to admit it is hard to do (I am a Geologist and it took me three years of college before I finally grasped it and even now it is tricky). So even taking the dates you named off (270 and 250), that is TWENTY MILLION!\n \n Thirdly, Nat Geo got it about right - around 250-251 Ma, was the end of the Permian and beginning of the Triassic - marked by the P-T extinction event, althought there are several vying hypotheses about the CAUSE of that extinction (I think what they are referring to are the flood basalts of the Siberian Traps which are indeed of Permian age). \n \n I can see why that might also be confusing, but you must remember the P-T event was the most deadly event in history - over 80% were wiped out.\n \n So no, it is not a \"contradiction\", it is WHAT HAPPENED! Yes there was a huge thriving population 300-270 Ma, and yes around 250 Ma a large portion of the world was covered in \"volcanic flames\" (and may have played a role in the P-T event although the extent of that role is still debated) - the Siberian Traps: \nVast volumes of basaltic lava paved over a large expanse of primeval Siberia in a flood basalt event. Today the area covered is about 2 million km² and estimates of the original coverage are as high as 7 million km². The original volume of lava is estimated to range from 1 to 4 million km³.\n \n The area covered lies between 50 and 75 degrees north latitude and 60 to 120 degrees east longitude. The volcanism continued for a million years and spanned the Permian-Triassic boundary.\n \n\n \n Hopefully you read this, Archangel, and this clears up some of the confusion you have here. Feel free to ask more questions on the subject as Geology is my passion.", 
   {
    "post_info": {
     "post_title": "Archangel: &quot;Geologic Evolution&quot;"
    }
   }, 
   null, 
   null, 
   1205515980.0
  ], 
  [
   306054, 
   null, 
   "pandion", 
   "One think I notice about the debate is that Archy seems particularly ignorant of evolution and evolutionary theory. Now he has shown that he is also pretty ignorant of geology.", 
   {}, 
   305997, 
   null, 
   1205597700.0
  ], 
  [
   306055, 
   null, 
   "GiantOreo", 
   "One think I notice about the debate is that Archy seems particularly ignorant of evolution and evolutionary theory. Now he has shown that he is also pretty ignorant of geology.\n\n \n Yes, I've noticed that. I do think part of the problem is that he hasn't bothered to get educated in the subject. From the arguments I've seen from him over the time he's been here he seems to rely on YEC websites for information, and when he gets to something he doesn't know it seems like he cuts-and-pastes (often without fuly reading) from google (leading to the Civil War Dinosaur fiasco and the Nazca stones fiasco) that seems to support his views", 
   {}, 
   306054, 
   null, 
   1205599380.0
  ], 
  [
   306068, 
   null, 
   "obvious_child", 
   "The sad thing is that his constant defeats haven't caused him to realize he is ignorant of his own ignorance.", 
   {}, 
   306055, 
   null, 
   1205612400.0
  ], 
  [
   306070, 
   null, 
   "trebor", 
   "The sad thing is that his constant defeats haven't caused him to realize he is ignorant of his own ignorance.\n\n \n However, I have learned much by people explaining things to him..", 
   {}, 
   306068, 
   null, 
   1205616360.0
  ], 
  [
   306071, 
   null, 
   "pandion", 
   "The sad thing is that his constant defeats haven't caused him to realize he is ignorant of his own ignorance.\nThere was a study done a few years ago that found that the incompetent usually overestimate their own competence. Or, in Archy's case, it could be that he actually thinks that by reading creationist sites he is learning what evolution is. Such people are also quite likely to be so ignorant of the topic that they are unable to tell what is good science and what is not.\n \n One good example is Pahu, who actually believes that Walt Brown is presenting scientifically valid evidence as to why the mountains could spring up some 25,000 feet in just a few years without reducing the entire surface of the globe to molten lava.", 
   {}, 
   306068, 
   null, 
   1205616480.0
  ], 
  [
   306079, 
   null, 
   "Archangel", 
   "The sad thing is that his constant defeats haven't caused him to realize he is ignorant of his own ignorance.\n\n \n To be constantly told I've been defeated by pseudo intellectuals who constantly claim victories when there is absolutely nothing to be gained from debating here shows just how lacking of any actual intelligence you people possess. But you sure feel smart after patting each other on your sanctimonious backs after convincing yourselves that what you know is actually correct when it is no more correct in reality than your warped and very corrupted World views. \n \n I will proudly stand alone against your combined self perceived intellect, and most importantly, I will confidently place my beliefs against yours at the end of this life when the true answers to the questions we debate will finally be known. And at that time, this ignorant christian will be standing tall in his knowledge as you all regret everything you have ever believed in your lives. emoticon_xangel", 
   {}, 
   306068, 
   null, 
   1205620560.0
  ], 
  [
   306084, 
   null, 
   "T.Q", 
   "To be constantly told I've been defeated by pseudo intellectuals who constantly claim victories when there is absolutely nothing to be gained from debating here shows just how lacking of any actual intelligence you people possess. But you sure feel smart after patting each other on your sanctimonious backs after convincing yourselves that what you know is actually correct when it is no more correct in reality than your warped and very corrupted World views. \n \n I will proudly stand alone against your combined self perceived intellect, and most importantly, I will confidently place my beliefs against yours at the end of this life when the true answers to the questions we debate will finally be known. And at that time, this ignorant christian will be standing tall in his knowledge as you all regret everything you have ever believed in your lives. emoticon_xangel\n\n \n Pseudo-intellectuals-check\n sanctimonious-check\n world view-check\n intimation of higher knowledge-check\n threats of hellfire and damnation-check\n \n \n You covered your usual points AA. The last few posts served no purpose other than to insult you, but here you are, responding in your usual fashion with insults and threats. Why bother?", 
   {}, 
   306079, 
   null, 
   1205622120.0
  ], 
  [
   306086, 
   null, 
   "Archangel", 
   "\n The last few posts served no purpose other than to insult you, \n\n \n How telling, and typical of YOU TQ, that you recognize the above, yet you still criticize the person being attacked for responding to them, rather than those doing the attacking.", 
   {}, 
   306084, 
   null, 
   1205625360.0
  ], 
  [
   306090, 
   null, 
   "T.Q", 
   "How telling, and typical of YOU TQ, that you recognize the above, yet you still criticize the person being attacked for responding to them, rather than those doing the attacking.\n\n \n If you want to claim the moral high ground, then don't respond (constantly) with insults and threats. Otherwise, your moral high ground isn't so high, is it?\n \n If you want to continue to attack me, be my guest. Frankly, I'm sick and tired of your childishness.", 
   {}, 
   306086, 
   null, 
   1205626920.0
  ], 
  [
   306099, 
   null, 
   "Archangel", 
   "If you want to claim the moral high ground, then don't respond (constantly) with insults and threats. Otherwise, your moral high ground isn't so high, is it?\n \n If you want to continue to attack me, be my guest. Frankly, I'm sick and tired of your childishness.\n\n \n Nothing I said was a threat toward anyone at all. It was a promise that ultimate truth will be known by all in the end. If you consider that to be a threat, then I'm sorry for you. And why is pointing out how you constantly side with the offenders against the victims of their insults always interpreted by you as an attack? Can't you handle the truth when I point out that you always blame me rather than the real offenders at all? That's not very high ground of you at all TQ, yet you constantly attempt to appear above the fray lately. But all your really doing is trying to stoke the fire. So if you really want to take the high ground, why not just pass the thread by without blaming me for responding to their unwarranted attacks and insults?", 
   {}, 
   306090, 
   null, 
   1205632920.0
  ], 
  [
   306153, 
   null, 
   "GiantOreo", 
   "To be constantly told I've been defeated by pseudo intellectuals who constantly claim victories when there is absolutely nothing to be gained from debating here shows just how lacking of any actual intelligence you people possess. But you sure feel smart after patting each other on your sanctimonious backs after convincing yourselves that what you know is actually correct when it is no more correct in reality than your warped and very corrupted World views. \n \n I will proudly stand alone against your combined self perceived intellect, and most importantly, I will confidently place my beliefs against yours at the end of this life when the true answers to the questions we debate will finally be known. And at that time, this ignorant christian will be standing tall in his knowledge as you all regret everything you have ever believed in your lives. emoticon_xangel\n\n \n Just wondering if you are going to respond to the OP (as it was addressed to you to help you to understand something).\n \n If you ask me I'd just ignore the negative comments that some posters make toward you. Just focus onexplanations of misunderstandings and constructive criticism.", 
   {}, 
   306079, 
   null, 
   1205698440.0
  ], 
  [
   306155, 
   null, 
   "Archangel", 
   "Just wondering if you are going to respond to the OP (as it was addressed to you to help you to understand something).\n \n If you ask me I'd just ignore the negative comments that some posters make toward you. Just focus onexplanations of misunderstandings and constructive criticism.\n\n \n You mean like this sanctimonious criticism of my education? Is that what I'm supposed to just ignore as I respond to your speaking down to me? Let me be clear with you cookie, the day will come when you will LEARN THE TRUTH that much of what you accepted as true according to your very flawed science was totally wrong, and that this ignorant christian whom you mocked, spoke down to, and condemned as uneducated was right in his beliefs and understanding. \n \n And thanks for your concern but I'm already debating this issue with Peeling and have no desire to get pounced on in unison by you and your buddies just for disagreeing with your very flawed World view.\n \n \nYes, I've noticed that. I do think part of the problem is that he hasn't bothered to get educated in the subject. From the arguments I've seen from him over the time he's been here he seems to rely on YEC websites for information, and when he gets to something he doesn't know it seems like he cuts-and-pastes (often without fuly reading) from google (leading to the Civil War Dinosaur fiasco and the Nazca stones fiasco) that seems to support his views\n", 
   {}, 
   306153, 
   null, 
   1205699400.0
  ], 
  [
   306162, 
   null, 
   "obvious_child", 
   "To be constantly told I've been defeated by pseudo intellectuals who constantly claim victories when there is absolutely nothing to be gained from debating here shows just how lacking of any actual intelligence you people possess. But you sure feel smart after patting each other on your sanctimonious backs after convincing yourselves that what you know is actually correct when it is no more correct in reality than your warped and very corrupted World views.\n\n \n That is cheap talk. We have asked you to back your claims up, address issues such as hydrology, fluid mechanics and you have completely failed. Even in non-science issues you run away without providing any argument relying on asinine personal attacks. You ran from the discussion on how commodity prices are set. I think you know you are in fact wrong, but your hubris prevents you from acting as a mature adult. Instead of addressing points, defending your points and generally making arguments and researching, you act as a child and argue everyone is wrong because you said so. \n \n \nI will proudly stand alone against your combined self perceived intellect, and most importantly, I will confidently place my beliefs against yours at the end of this life when the true answers to the questions we debate will finally be known. And at that time, this ignorant christian will be standing tall in his knowledge as you all regret everything you have ever believed in your lives. emoticon_xangel\n\n \n More threats. Surprise surprise.\n \n Simple facts: \n 1) If we were wrong, you'd be able to prove it. \n 2) You constantly run from challenges to prove your assertions\n 3) When faced with defeat, instead of admitting it, you claim that your opponent, who you can't refute, isn't worth the time", 
   {}, 
   306079, 
   null, 
   1205702400.0
  ], 
  [
   306175, 
   null, 
   "Archangel", 
   "You mean rather than just delete the thread like you have done so often before that option was taken from you child? You're a real forum warrior aren't you.", 
   {}, 
   306162, 
   null, 
   1205705340.0
  ], 
  [
   306180, 
   null, 
   "GiantOreo", 
   " You mean like this sanctimonious criticism of my education? Is that what I'm supposed to just ignore as I respond to your speaking down to me? \n \"speaking down to you\"? Hardly. Criticism using an observation from what I have observed from your posts is not an \"attack\", nor is it \"sanctimoniuous\".\n \n If you can't take criticism, fine. \n \n \nLet me be clear with you cookie, the day will come when you will LEARN THE TRUTH that much of what you accepted as true according to your very flawed science was totally wrong, and that this ignorant christian whom you mocked, spoke down to, and condemned as uneducated was right in his beliefs and understanding. \n \n Sorry bud, fearmongering just isn't effective with me. Especially when it is fearmongering with a nonexistant \"God\" who, from the stories told about him, seems to be a jealous, petty little hypocritic B@$tard.\n \n \n\n And thanks for your concern but I'm already debating this issue with Peeling and have no desire to get pounced on in unison by you and your buddies just for disagreeing with your very flawed World view.\n\n \n \"pounced on\"?\n \n I brought up a legitimate riticism of someone's argument and SHOWED THEM HOW THEY MAY HAVE MISUNDERSTOOD GIVEN THE SOURCE THEY USED, and that is \"POUNCING ON\"? My you seem to have quite a martyrdom problem there.\n \n Geez. Next time I'll keep my mouth shut and let you continue to argue something that no one claims and not point out (very politely given your past vitriol toward me I might add) where you had gotten confused. emoticon_rolleyes :xbanghead", 
   {}, 
   306155, 
   null, 
   1205707680.0
  ], 
  [
   306187, 
   null, 
   "Archangel", 
   "Geez. Next time I'll keep my mouth shut \n\n \n Thank you very much. I'll hold you to that.\n \n \nand let you continue to argue something that no one claims and not point out (very politely given your past vitriol toward me I might add) where you had gotten confused.\n\n \n You're wrong about nobody claiming it oreo; I claim it. Unlike you, I don't need others to assert something in order for me to dare to accept it as reasonable. Especially since nothing you guys claim about evo is actually provable anyway. So if your assumptions are reasonable, so are mine. Whether you accept my claims or not is completely irrelevant to me; and definitely has no bearing on my perspective at all.\n \n The reason I say that is that just as the 20 million years between 250 and 270 million years stated is a long time; the fact that evolutionists can claim these time spans so factually as if they have a time machine to confirm them just makes me laugh. I respond to the accepted claims in debates and argue using the numbers I don't accept as factual or true on any level of rationale, yet you have the nerve to come back and try to explain to me why the 20 million year gap is reasonable, and why I'm confused. If what you believe wasn't so pathetic in its futility, it would be funny.", 
   {}, 
   306180, 
   null, 
   1205711940.0
  ], 
  [
   306216, 
   null, 
   "GazzaElliott", 
   "If what you believe wasn't so pathetic in its futility, it would be funny.\n\n \n Ooooo, I think someone tweaked AA's tail! \n \n \nUnlike you, I don't need others to assert something in order for me to dare to accept it as reasonable.\n\n \n Well that's a flat out lie... You accept the Bible as truth because the people in it assert it is the truth. Jeez, that darned analysis of evidence is a real kicker. I mean, who'd a guessed that you might actually not believe a 1500 year old book if you looked at the world around you.....\n \n \nSo if your assumptions are reasonable, so aren't mine.\n\n \n And here's a reason to never post before you read what you've written!\n \n \nEspecially since nothing you guys claim about evo is actually provable anyway.\n\n \n :xbanghead emoticon_xkill :xcensored emoticon_rolleyes \n \n I'm amazed. I really am. I've met some people who obfuscate before, I've met some people who really refuse to deal with reality before, but that just takes the p***. Do you have the rest of the forum on ignore or something??? Evolution has been observed, recorded, analysed and stored. Allele frequencies change in populations over time. It happens. You could even do it yourself at home with a simple re-creation of Mendel's experiments....\n \n \nthe fact that evolutionists can claim these time spans so factually as if they have a time machine to confirm them just makes me laugh.\n\n \n Yet you go for 7 days to create the earth. Are the numbers too big for you or something? When you're dealing with a timescale that's 4.5 billion (US) years long, an error bar of 20 million is nothing. Also it depends on the technique used. I have some issues with molecular clocks, but there are plenty of other valid dating methods out there.\n \n \nWhether you accept my claims or not is completely irrelevant to me; and definitely has no bearing on my perspective at all.\n\n \n That we've noticed. If this has no effect on you then why argue it? Yo seem to threaten more than preach, so evangelizing can't be the reason. You don't listen to counter-arguments, so you can't be testing your faith. I can't actually think of a reason why you aren't sat in a cave somewhere with a bible and your fingers in your ears.....", 
   {}, 
   306187, 
   null, 
   1205732220.0
  ], 
  [
   306225, 
   null, 
   "obvious_child", 
   "You mean rather than just delete the thread like you have done so often before that option was taken from you child? You're a real forum warrior aren't you.\n\n \n Often? I made 79 threads. I deleted 2. Therefore the rate of deletion at 2.5%. If you consider 2 in 79, or 1 per 39.5 to be often, then you must consider your abandonment of arguments and threads to be almost assured every time you make an argument. And I deleted those threads because they were completely off tangent and in no way were adding any value to anything. \n \n Again, good job on completely failing to address anything anyone has ever said and relying upon threads and \"I said so\" arguments to counter your inherent lack of any debate skills whatsoever. \n \n You can dish it out, but you can't take even a tiny fraction.", 
   {}, 
   306175, 
   null, 
   1205743680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Archangel: \"Geologic Evolution\"", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11064-archangel-geologic-evolution.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 11064, 
  "discussion_files": [
   [
    "11012.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11064-archangel-geologic-evolution-print.html"
   ], 
   [
    "11013.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11064-archangel-geologic-evolution-2-print.html"
   ]
  ], 
  "identifier": 11064
 }
]