[
 [
  [
   19030, 
   null, 
   "AMD4EVER", 
   "http://www.cnn.com/2003/ALLPOLITICS/10/10/bush.cuba/index.html\n \n It would seem as if Bush is trying to diplomatically and economically destroy the Castro regime. My first reaction to this is that it simply cannot be done. All our attempts for the last few decades have been unsuccessful and I don't think anything short of Castro's death is going to have any big impact on the leadership there. I think Bush is setting himself up for another failure. What does everyone else think?", 
   {
    "post_info": {
     "post_title": "Bush switches focus to Cuba"
    }
   }, 
   null, 
   null, 
   1065916800.0
  ], 
  [
   19060, 
   null, 
   "SilentPoet", 
   "I think Bush is playing politics. He is doing poorly into the polls and if things continue at this rate he might very well loose the next election. I'm not sure if I agree or disagree with Bush's latest additions to foreign policy with Cuba but I mainly see it as a political ploy to win votes in Cuba. Perhaps he should have saved the \"Cuba Policy\" card for a time closer to the election.", 
   {}, 
   19030, 
   null, 
   1065932520.0
  ], 
  [
   19061, 
   null, 
   "Broker", 
   "Well, he's in the third year slump that Clinton and Reagan experienced in their first terms. He's got a lot working for him now... the deficit is now projected at only 390 billion dollars, things in Iraq are going really well (despite what the TV says), and the economy is set for 4.5% GDP growth... we just gained jobs for the first time in 8 months. When the election comes, the Democrats can only lie or spin, and that won't be hard to refute. They say bad economy, Bush says 9/11 and Clinton recession. They say Iraq bad, Bush says you voted for it.\n \n I think it's a good idea to step up the pressure on Cuba. He's going to gain a great deal more popularity among hispanics, last election he had 35% of the vote. If the Republicans can get 10- 15% of that vote and hold what they have, we will see a huge power shift throughout the nation. It's a great idea politically.", 
   {}, 
   19060, 
   null, 
   1065934200.0
  ], 
  [
   19064, 
   null, 
   "montalban", 
   "I think it's a good idea to step up the pressure on Cuba. He's going to gain a great deal more popularity among hispanics, last election he had 35% of the vote. If the Republicans can get 10- 15% of that vote and hold what they have, we will see a huge power shift throughout the nation. It's a great idea politically.\n\n \n \n Why does Bush need to move on foreign policy to pander to a particular domestic group? Surely, they're all Americans looking out for America's best interests.", 
   {}, 
   19061, 
   null, 
   1065937200.0
  ], 
  [
   19067, 
   null, 
   "Broker", 
   "Don't get me started... I'll start ranting about the Democrats and how what's bad for America is good for them...\n \n I think the policy should be stepped up in the first place. And at the same time you make the hispanics happy and gain some votes... everyone but Castro wins.", 
   {}, 
   19064, 
   null, 
   1065939960.0
  ], 
  [
   19098, 
   null, 
   "Rev. HellH0und", 
   "None of you see it?\n \n \"Enforcement of travel restrictions already in place will be strengthened, he said. \"We've instructed the Department of Homeland Security to increase inspections of travelers and shipments to and from Cuba.\" \n \n \"The U.S. Treasury Department forbids Americans to spend money in Cuba on pleasure trips, but exceptions are made for people visiting relatives, offering humanitarian aid or conducting research. \"\n \n \n \n \"In addition, U.S. citizens who travel to Cuba through third countries or by boat in violation of the U.S. embargo will be targeted, he said. \"\n \n \n \n I would be for a 50,000 troop invasion than these \"restrictions\" on freemen. Another way to \"target\" Americans for behavior that the fedgov does not like....\n \n \n Oh don't get me wrong... ANY democrat would be worse than Bush....", 
   {}, 
   19067, 
   null, 
   1065984960.0
  ], 
  [
   19103, 
   null, 
   "AMD4EVER", 
   "I would be for a 50,000 troop invasion than these \"restrictions\" on freemen. Another way to \"target\" Americans for behavior that the fedgov does not like....\n\n \n lol, a strange point of view. You would rather force people to risk their lives for government benefits than to restrict inconsequential freedoms for government benefits. I'll tell you what, I'd rather not have the freedom to go to Cuba than to go to Cuba and risk death.\n \n How about you, what are you willing to do to help the government? Do you want to risk your life for them or simply not have the option to spend money in support of a cruel dictator?\n \n \nOh don't get me wrong... ANY democrat would be worse than Bush....\n\n \n I don't think any democrat would be worse and perhaps not even the majority are. However, of those looking to run against him in the next election I think Bush is the best. He will at least work to eliminate dictatorships and terrorist threats while democrats will allow things to just get too out of control.", 
   {}, 
   19098, 
   null, 
   1065985860.0
  ], 
  [
   19144, 
   null, 
   "montalban", 
   "Don't get me started... I'll start ranting about the Democrats and how what's bad for America is good for them...\n\n \n Why? What have they done?\n \n \nI think the policy should be stepped up in the first place. And at the same time you make the Hispanics happy and gain some votes... everyone but Castro wins.\n\n \n Is it only some dictators you don't like? As a nation you guys seemed happy with S. Hussein for a while. Manuel Noriega, Marcos, Diem, Hitler, Stalin, Augusto Pinochet (oh, actually he's still in favour - though out of power).\n \n You even helped Castro to victory in Cuba!", 
   {}, 
   19067, 
   null, 
   1066051320.0
  ], 
  [
   19157, 
   null, 
   "AMD4EVER", 
   "Is it only some dictators you don't like? As a nation you guys seemed happy with S. Hussein for a while. Manuel Noriega, Marcos, Diem, Hitler, Stalin, Augusto Pinochet (oh, actually he's still in favour - though out of power).\n \n You even helped Castro to victory in Cuba!\n\n \n Things change my friend. At one time Hitler was doing a good job reuniting Germany and wasn't killing Jews left and right or trying to take over the world. He had even gained the respects of Winston Churchill for rallying Germany back from post-WWI devastation. He could have gone down as a great leader if he hadn't started WWII. However, things did change. He is now known as a ruthless killer.\n \n Castro was in favor at one time but went out of favor during the Cold War. Things changed.\n \n Saddam was in favor at one time but went out of favor especially after invading Kuwait. Things changed.\n \n There is no way to predict the future so you can never know which ally today is going to be your enemy tomorrow. I bet another dictatorship or tyrannical government that we are supporting today will eventually turn on us or we on them in the ever changing world of politics and I won't be too surprised when it happens.", 
   {}, 
   19144, 
   null, 
   1066055640.0
  ], 
  [
   19161, 
   null, 
   "Broker", 
   "Because they've lost their power! If things keep going as well as they are, the Democrats are in big trouble... I'm currently projecting that the GOP picks up 3- 4 Senate seats and 8- 12 House seats. By the time the election comes, we're going to be in the Bush 2004- 2008 economic expansion. The Democrats need that to be bad if they want to just hold what they have.\n \n It depends what administration you're dealing with. Once Reagan left, we ended our relationship with Hussein. That was three years before the invasion of Kuwait. Also the timeframe... because people change, or announce their/ show their true intentions. That'd be the case for Hitler and Castro. Note that almost all of those examples were CIA support. I wouldn't mind tightening the grip on what they do... because they get involved in... everything.", 
   {}, 
   19157, 
   null, 
   1066058400.0
  ], 
  [
   19247, 
   null, 
   "montalban", 
   "Things change my friend. At one time Hitler was doing a good job reuniting Germany and wasn't killing Jews left and right or trying to take over the world. He had even gained the respects of Winston Churchill for rallying Germany back from post-WWI devastation. He could have gone down as a great leader if he hadn't started WWII. However, things did change. He is now known as a ruthless killer.\n \n Castro was in favor at one time but went out of favor during the Cold War. Things changed.\n \n Saddam was in favor at one time but went out of favor especially after invading Kuwait. Things changed.\n\n \n Yes Mussolini got the trains running on time.\n Hitler built nice roads\n All of this leads to 'stability' which on another post you seem to think is the peak of virtues.\n \n Saddam was in favour even when he was killing Kurds.\n \n Hitler was only your enemy in late 1941, almost 10 years after coming to power and several years into punishing the Jews.\n \n \nThere is no way to predict the future so you can never know which ally today is going to be your enemy tomorrow. I bet another dictatorship or tyrannical government that we are supporting today will eventually turn on us or we on them in the ever changing world of politics and I won't be too surprised when it happens.\n\n \n This doesn't send shivers down your spine? Why support them? Oh, that's right, because they bring stability!\n \n Good night emoticon_zzzz It's getting late", 
   {}, 
   19157, 
   null, 
   1066138020.0
  ], 
  [
   19249, 
   null, 
   "AMD4EVER", 
   "Yes Mussolini got the trains running on time.\n Hitler built nice roads\n All of this leads to 'stability' which on another post you seem to think is the peak of virtues.\n\n \n Stability is only one thing. It is great that things became stable in these countries so they could focus on other important aspects. But since they choose the ways of war, well that is more defining than noting that they were stable before that time.\n \n \nSaddam was in favour even when he was killing Kurds.\n \n Hitler was only your enemy in late 1941, almost 10 years after coming to power and several years into punishing the Jews.\n\n \n Saddam and Hitler were both respected at one time or another, especially Hitler.\n \n \nThis doesn't send shivers down your spine? Why support them? Oh, that's right, because they bring stability!\n\n \n I wouldn't suggest not supporting anyone for fear that they will become our enemies one day. Look what we have been able to accomplish simply by treating everyone like a potential ally. Globalism is one result of what we have been working towards and that surely brings stability to the world.", 
   {}, 
   19247, 
   null, 
   1066138680.0
  ], 
  [
   19276, 
   null, 
   "Parcum", 
   "Bush is correct in saying \"Cuba will soon be free\", as their economy is collapsing, and I'm positive with a litte push the government will fall. If there's going to be any militaristic action, I pray that it will not be as big as Iraq. \n \n \nI think it's a good idea to step up the pressure on Cuba. He's going to gain a great deal more popularity among hispanics, last election he had 35% of the vote. If the Republicans can get 10- 15% of that vote and hold what they have, we will see a huge power shift throughout the nation. It's a great idea politically.\n\n \n I don't think he'll get gain among hispanics. I come from mexican decent, and the hispanic population (at least in California) isn't going to vote for Bush because of Cuba. The hispanics have been voting democrat for the longest time when the Democrats mean nothing to them. Mexicans are Pro-Family, Pro-Life, Traditional, and Catholic. The democrats are the opposate- they are pro-choice, liberal, and pro-birth control. The Republicans are the true party that morally support their views, but the democrats try despirately to control their views. It's really a shame.", 
   {}, 
   19249, 
   null, 
   1066162800.0
  ], 
  [
   19280, 
   null, 
   "Broker", 
   "That's the thing! Democrats talk, but they switch their view or don't do what they said they would in office. I don't understand why minorities vote Democratic... it just doesn't make sense. And it's not going to do much in California, but here in Florida it means a lot. That's the main target, I believe.", 
   {}, 
   19276, 
   null, 
   1066163880.0
  ], 
  [
   19351, 
   null, 
   "AMD4EVER", 
   "I don't think Bush will get any more hispanic support by attacking Cuba so I doubt he will do that if all he is looking for is more support. Cuba is such a touchy situation anyways that I don't expect any military action there.", 
   {}, 
   19280, 
   null, 
   1066186380.0
  ], 
  [
   19960, 
   null, 
   "montalban", 
   "That's the thing! Democrats talk, but they switch their view or don't do what they said they would in office. I don't understand why minorities vote Democratic... it just doesn't make sense. And it's not going to do much in California, but here in Florida it means a lot. That's the main target, I believe.\n\n \n http://www.johnpilger.com/\n Has an interesting story about how 'free' Afghanistan is now.", 
   {}, 
   19280, 
   null, 
   1066546200.0
  ], 
  [
   20197, 
   null, 
   "epaphras_faith", 
   "I don't think Bush will get any more hispanic support by attacking Cuba so I doubt he will do that if all he is looking for is more support. Cuba is such a touchy situation anyways that I don't expect any military action there.\n\n \n Bush would certainly receive more hispanic support. There is no one in the hispanic community that I know that supports castro. However, an attack isn't necessary, Reagans Cold war tactics will suffice. Communist nations have notoriously week and fragile economies. They can only stand if everyone else is communist. And that ain't going to happen.", 
   {}, 
   19351, 
   null, 
   1066775460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush switches focus to Cuba", 
  "url": "http://www.4forums.com/political/politics-debates/1108-bush-switches-focus-cuba.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 1108, 
  "discussion_files": [
   [
    "29311.html", 
    "http://www.4forums.com/political/politics-debates/1108-bush-switches-focus-cuba-print.html"
   ], 
   [
    "29312.html", 
    "http://www.4forums.com/political/politics-debates/1108-bush-switches-focus-cuba-2-print.html"
   ]
  ], 
  "identifier": 1108
 }
]