[
 [
  [
   306860, 
   null, 
   "bmittking", 
   "This is the question her campaign and the whole Democratic party need to answer.\n \n Clinton has almost no chance of winning the nomination without causing a rift in the party, and she has an even smaller chance of winning in the general. \n \n Recent polls say that almost half of all Americans have a negative opinion of her, and the Reverend Wright scandal seems to have hurt Obama less than Clinton's campaign has hurt her in the past weeks.\n \n The longer Hillary Clinton stays in the race, the less likely it is that the Democrats will win in November.", 
   {
    "post_info": {
     "post_title": "Why is Hillary still in the race?"
    }
   }, 
   null, 
   null, 
   1206584220.0
  ], 
  [
   306885, 
   null, 
   "Waxy", 
   "This is the question her campaign and the whole Democratic party need to answer.\n \n Clinton has almost no chance of winning the nomination without causing a rift in the party, and she has an even smaller chance of winning in the general. \n \n Recent polls say that almost half of all Americans have a negative opinion of her, and the Reverend Wright scandal seems to have hurt Obama less than Clinton's campaign has hurt her in the past weeks.\n \n The longer Hillary Clinton stays in the race, the less likely it is that the Democrats will win in November.\n\n \n As an outside observer, these are my thoughts too.\n \n It's plain selfish and stubborn as far as I'm concerned, I'm surprised that the Democratic party itself isn't stepping in, maybe they are behind the scenes.\n \n Waxy", 
   {}, 
   306860, 
   null, 
   1206645660.0
  ], 
  [
   306887, 
   null, 
   "isly ilwott", 
   "The Clintons are a political machine. Hillary is a narcissist. She cares nothing for others except as they represent a potential vote to grant her the power she craves. She will likely not leave the race on her own...no matter what the polls say.\n \n I suspect that Obama's racism will surface again before the general election. The Republicans will see to that.", 
   {}, 
   306885, 
   null, 
   1206651780.0
  ], 
  [
   306892, 
   null, 
   "smiley", 
   "It could be very interesting if the Repugs try to introduce the subject of racism into the next election, given their history of disenfranchising black Americans in the last two elections.\n \n Hopefully the populous would see through such a tactic - though somehow I doubt it.\n \n Smiley", 
   {}, 
   306887, 
   null, 
   1206654780.0
  ], 
  [
   306895, 
   null, 
   "sinjin", 
   "I suspect that Obama's racism will surface again before the general election. The Republicans will see to that.\nSo now it's Obama's racism? As repugnant as the comments of the Wright Reverend might be, they still fall along the spectrum of attitudes of black Americans as a group. BHO's recognition of this and his refusal to disavow some sympathy for those who hold even the more extreme positions makes him honorable IMO. Just as many of those at any Catholic mass are pro-choice while the pulpit says otherwise.", 
   {}, 
   306887, 
   null, 
   1206657120.0
  ], 
  [
   306903, 
   null, 
   "bmittking", 
   "I can understand why Paul and even Huckabee were in the race for so long, because they were just trying to get their messages out. They didn't hurt the Republicans' chances of winning in November, and I think that McCain is a stronger candidate because of them.\n \n However, it is different with Hillary. People already know about her ideas, and all the voters who care about the policy differences between her and Obama already know them. This primary season is obviously not about policy, but instead about principals, experience, electability, and emotion.\n \n I would like a Clinton supporter to weigh in on this question.", 
   {}, 
   306895, 
   null, 
   1206683220.0
  ], 
  [
   307067, 
   null, 
   "Archangel", 
   "I can understand why Paul and even Huckabee were in the race for so long, because they were just trying to get their messages out. They didn't hurt the Republicans' chances of winning in November, and I think that McCain is a stronger candidate because of them.\n \n However, it is different with Hillary. People already know about her ideas, and all the voters who care about the policy differences between her and Obama already know them. This primary season is obviously not about policy, but instead about principals, experience, electability, and emotion.\n \n I would like a Clinton supporter to weigh in on this question.\n\n \n I'm not a Clinton supporter, but I must agree with isly regarding Hillary's narcissism and craving for power. If God appeared to her and told her that another candidate was the perfect man for the job according to Gods perfect will, she still wouldn't get out of the race because she feels she is entitled to it. It has nothing at all to do with public service or making life better for the average american. It's all about personal power and making history by being the first woman president. Kudos isly, for once again writing a concise and accurate post. \n \n \nThe Clintons are a political machine. Hillary is a narcissist. She cares nothing for others except as they represent a potential vote to grant her the power she craves. She will likely not leave the race on her own...no matter what the polls say.\n \n I suspect that Obama's racism will surface again before the general election. The Republicans will see to that.\n", 
   {}, 
   306903, 
   null, 
   1206935640.0
  ], 
  [
   307071, 
   null, 
   "electrolyte", 
   "I'm not a Clinton supporter, but I must agree with isly regarding Hillary's narcissism and craving for power. If God appeared to her and told her that another candidate was the perfect man for the job according to Gods perfect will, she still wouldn't get out of the race because she feels she is entitled to it. It has nothing at all to do with public service or making life better for the average american. It's all about personal power and making history by being the first woman president. Kudos isly, for once again writing a concise and accurate post.\n\n By all means, agree with isly's characterization of Obama's racism while actually basing the above comments on your own sexism.\n \n There are three people currently in the running for President, but only Hillary is a \"narcissist\" and \"craves power,\" according to you rightwing pundits, and your evidence is that, you know, she's running for office.. uh, just like the other two. And you hate her for the alleged reason that she wants to \"make history by being the first woman president,\" huh?\n \n Gotta love it when you boys show your true colors.", 
   {}, 
   307067, 
   null, 
   1206936960.0
  ], 
  [
   307073, 
   null, 
   "Archangel", 
   "By all means, agree with isly's characterization of Obama's racism while actually basing the above comments on your own sexism.\n \n There are three people currently in the running for President, but only Hillary is a \"narcissist\" and \"craves power,\" according to you rightwing pundits, and your evidence is that, you know, she's running for office.. uh, just like the other two. And you hate her for the alleged reason that she wants to \"make history by being the first woman president,\" huh?\n \n Gotta love it when you boys show your true colors.\n\n \n If you'll notice, I was responding to bmittkings post which is quoted below. And it was specifically in reference to hillary. So don't assume that just because I believe this is a power trip for Hillary that I don't think similar thoughts about the other candidates also. It's just that Hillary was the focus of this response and this thread in fact; so all isly and I am guilty of is staying on topic. \n \n \nI can understand why Paul and even Huckabee were in the race for so long, because they were just trying to get their messages out. They didn't hurt the Republicans' chances of winning in November, and I think that McCain is a stronger candidate because of them.\n \n However, it is different with Hillary. People already know about her ideas, and all the voters who care about the policy differences between her and Obama already know them. This primary season is obviously not about policy, but instead about principals, experience, electability, and emotion.\n \n I would like a Clinton supporter to weigh in on this question.\n", 
   {}, 
   307071, 
   null, 
   1206937680.0
  ], 
  [
   307211, 
   null, 
   "michael777", 
   "This is the question her campaign and the whole Democratic party need to answer.\n \n Clinton has almost no chance of winning the nomination without causing a rift in the party, and she has an even smaller chance of winning in the general. \n \n Recent polls say that almost half of all Americans have a negative opinion of her, and the Reverend Wright scandal seems to have hurt Obama less than Clinton's campaign has hurt her in the past weeks.\n \n The longer Hillary Clinton stays in the race, the less likely it is that the Democrats will win in November.\n\n \n Isn't it good for the economy? They sure like to spend the money.\n The dirty laundry is quite nice also. michael777", 
   {}, 
   306860, 
   null, 
   1207089720.0
  ], 
  [
   307233, 
   null, 
   "bmittking", 
   "The Clintons are a political machine. Hillary is a narcissist. She cares nothing for others except as they represent a potential vote to grant her the power she craves. She will likely not leave the race on her own...no matter what the polls say.\n \n I suspect that Obama's racism will surface again before the general election. The Republicans will see to that.\n\n \n I think that it's more about ego than power. She thinks she is the best candidate, no matter what the American people say.", 
   {}, 
   306887, 
   null, 
   1207096440.0
  ], 
  [
   307318, 
   null, 
   "electrolyte", 
   "If you'll notice, I was responding to bmittkings post which is quoted below. And it was specifically in reference to hillary. So don't assume that just because I believe this is a power trip for Hillary that I don't think similar thoughts about the other candidates also. It's just that Hillary was the focus of this response and this thread in fact; so all isly and I am guilty of is staying on topic.\n\n How the hell is that a defense of your sexism, Archie? And why do you think that my responding to your \"topical\" comment is a derailment?", 
   {}, 
   307073, 
   null, 
   1207192440.0
  ], 
  [
   307322, 
   null, 
   "Archangel", 
   "How the hell is that a defense of your sexism, Archie? And why do you think that my responding to your \"topical\" comment is a derailment?\n\n \n Are you actually asserting that there aren't hundreds of valid reasons for rejecting Hillbilly as commander in chief? And then claiming that by rejecting her I must be a sexist? How incredibly weak and irrational an accusation is that? I reject the most polarizing woman in politics today because she's a liar and a self serving power monger and all you can come up with for an attack is that I must be a sexist? It would never occur to you that my rejection of her is because of her and what she represents, would it.", 
   {}, 
   307318, 
   null, 
   1207193760.0
  ], 
  [
   307328, 
   null, 
   "electrolyte", 
   "Are you actually asserting that there aren't hundreds of valid reasons for rejecting Hillbilly as commander in chief?\n\n I neither said nor implied anything of the sort. Learn how to read.\n \n \nAnd then claiming that by rejecting her I must be a sexist?\n\n Gee, Archie, when you make statements like this one:It's all about personal power and making history by being the first woman president.\nit seems like you're bringing her sex to the forefront. You make accusations of arrogance and powermongering based on her behavior, which is the same as everyone else's in the race. If those behaviors were actually evidence, then you'd have said the same thing about everyone else.\n \n \nIt would never occur to you that my rejection of her is because of her and what she represents, would it.\n\n Non-dumbass thinking? No, I'd believe that you reject that, too. In fact, I expect you to.", 
   {}, 
   307322, 
   null, 
   1207196520.0
  ], 
  [
   307332, 
   null, 
   "Archangel", 
   " \n Are you actually asserting that there aren't hundreds of valid reasons for rejecting Hillbilly as commander in chief? And then claiming that by rejecting her I must be a sexist? \n\n \n \nI neither said nor implied anything of the sort. Learn how to read.\n \n\n \n Sure you did! are you unable to retain what you yourself say from one post to another? You specifically and directly called me a sexist; see? And I quote you directly:\n \n \n \n How the hell is that a defense of your sexism, Archie? \n\n \n So why are you now denying that you said or implied anything of the sort? Is lying so easy for you, and is your delusion so complete that you think that you can blatantly lie about making clear statements just one post removed and nobody will notice? Do you have such little respect for the other members of this forum that you think you can deny you made such an accusation just one post after making it? \n \n Now be a good boy and apologize to the rest of the forum for lying about calling me a sexist just because I refuse to support a lying scumbag like Hillbilly Clinton. Now Conde Rice, there's a woman I could support. And Margaret Thatcher, if she was an American; she's a woman with proven leadership qualities whom i could support also.", 
   {}, 
   307328, 
   null, 
   1207197900.0
  ], 
  [
   307334, 
   null, 
   "electrolyte", 
   "Look, I can't do any better than Archie summing things up for himself.\n Are you actually asserting that there aren't hundreds of valid reasons for rejecting Hillbilly as commander in chief? And then claiming that by rejecting her I must be a sexist?\n\n \n\n I neither said nor implied anything of the sort. Learn how to read.\n\n Sure you did! are you unable to retain what you yourself say from one post to another? You specifically and directly called me a sexist; see? And I quote you directly:\n \nHow the hell is that a defense of your sexism, Archie?\n\n So why are you now denying that you said or implied anything of the sort?\n\n Apparently in Archie's world, \"How the hell is that a defense of your sexism?\" implies that there aren't valid reasons for not supporting a candidate.\n \n He proceeds to call me a liar and claim that I've called him sexist because he doesn't support Hillary, neither of which are true.\n \n I've explained in plain language my reasoning. Archie hasn't produced any explanation for his comments and instead is trying so hard to put things in my mouth that he's hoping nobody else can read.", 
   {}, 
   307332, 
   null, 
   1207199220.0
  ], 
  [
   307338, 
   null, 
   "Archangel", 
   "My point is clear. Your denials are a conglomeration of irrational obfuscations. I will allow the reader to make up their own minds rather than waste my time attempting to reason with the unreasonable and irrational.", 
   {}, 
   307334, 
   null, 
   1207201440.0
  ], 
  [
   308920, 
   null, 
   "DrD", 
   "Why is Hillary still in the race? \n \n Because this is America!!", 
   {}, 
   307332, 
   null, 
   1208460480.0
  ], 
  [
   308922, 
   null, 
   "isly ilwott", 
   "So now it's Obama's racism? As repugnant as the comments of the Wright Reverend might be, they still fall along the spectrum of attitudes of black Americans as a group. BHO's recognition of this and his refusal to disavow some sympathy for those who hold even the more extreme positions makes him honorable IMO. Just as many of those at any Catholic mass are pro-choice while the pulpit says otherwise.\nMy apologies for not revisiting this thread sooner to respond to you.\n \n Perhaps I should have said that the question of Obama's racism will surface again. That would be more accurate as I do not know for sure that he is racist. As the scrutiny proceeds, he appears to have links to many people who appear to be racist....such as his mentor pastor, his highly regarded Farrakhan role model, his link to the Black Panthers, his wife and who knows what others will come along before the general election. The question of his racism will surface again.\n \n While I feel comfortable claiming that Hillary is searching for every dart she can find on him, I think the Republicans, with or without the approval of John McCain, will find more after he is established as the Democratic candidate.\n \n I believe Hillary is toast.", 
   {}, 
   306895, 
   null, 
   1208461860.0
  ], 
  [
   308929, 
   null, 
   "sinjin", 
   "Can someone of a mixed racial background be racist? \n \n Are you of the opinion that distrust of white people equals racism? I am not.", 
   {}, 
   308922, 
   null, 
   1208464560.0
  ], 
  [
   308934, 
   null, 
   "isly ilwott", 
   "Can someone of a mixed racial background be racist? \nI think so. I think anybody can be racist. It is a mindset, not passed down the bloodline. \n \n \n \n\n Are you of the opinion that distrust of white people equals racism? I am not.\nWhat is your definition of racism? Do you distinguish between bigotry and racism? Is racism a form of bigotry?", 
   {}, 
   308929, 
   null, 
   1208466180.0
  ], 
  [
   308944, 
   null, 
   "sinjin", 
   "What is your definition of racism? Do you distinguish between bigotry and racism? Is racism a form of bigotry?\n\n \n Bigotry is prejudice associated with race in common usage.\n \n Racism is a belief in the ultimate superiority of a given race, usually one's own.\n \n They are related but not identical.", 
   {}, 
   308934, 
   null, 
   1208469900.0
  ], 
  [
   308951, 
   null, 
   "isly ilwott", 
   "Bigotry is prejudice associated with race in common usage.\n \n Racism is a belief in the ultimate superiority of a given race, usually one's own.\n \n They are related but not identical.\nI differ slightly. Bigotry is not necessarily tied to race. Bigotry is when one is intolerantly devoted to his own church, party, belief or opinion and will not accept as valid any thought that conflicts with his. It does not have to be associated with race. It does not have to imply superiority except in correctness of thought.\n \n Racism is quite understandably related to race. Racism is the belief that race is the primary determinant of worth and that one race is superior to the other by way of heredity. I think bigotry and racism are related only in that they both require one party to be thought less valuable than the other. When the bigotry is applied to things others than race, there is no racism involved. Bigotry when applied to race becomes racism.", 
   {}, 
   308944, 
   null, 
   1208471880.0
  ], 
  [
   308958, 
   null, 
   "sinjin", 
   "I differ slightly. Bigotry is not necessarily tied to race. Bigotry is when one is intolerantly devoted to his own church, party, belief or opinion and will not accept as valid any thought that conflicts with his. It does not have to be associated with race. It does not have to imply superiority except in correctness of thought.\n \n Racism is quite understandably related to race. Racism is the belief that race is the primary determinant of worth and that one race is superior to the other by way of heredity. I think bigotry and racism are related only in that they both require one party to be thought less valuable than the other. When the bigotry is applied to things others than race, there is no racism involved. Bigotry when applied to race becomes racism.\nIndeed bigotry is not racial exclusively. The \"common usage\" was my attempt to imply that racial bigotry is what commonly gets one labeled a bigot. Apologies for my vagueness. Otherwise we are in agreement.\n \n To my mind one needs to be claiming racial superiority to be fairly called a racist. Few non-whites claim this about their race. Certainly some do. Mr. Obama certainly does not and which would he claim even if he wanted to? He's bi-racial.", 
   {}, 
   308951, 
   null, 
   1208475420.0
  ], 
  [
   308959, 
   null, 
   "isly ilwott", 
   "Indeed bigotry is not racial exclusively. The \"common usage\" was my attempt to imply that racial bigotry is what commonly gets one labeled a bigot. Apologies for my vagueness. Otherwise we are in agreement.\nGood.\n \n \n \n\n To my mind one needs to be claiming racial superiority to be fairly called a racist. Few non-whites claim this about their race. Certainly some do. Mr. Obama certainly does not and which would he claim even if he wanted to? He's bi-racial.\nI question that (bolded). Jesse Jackson, Al Sharpton, Jeremiah Wright, Louis Farrakhan and more than just a few others seem racist to me. They are non-white. Not that one racist remark brands one permanently as \"racist\", but repetition of expressions of superiority can make the label stick.\n \n Are you telling me that you believe a higher percentage of whites are racist? I would certainly agree that there are many racists in the world...white and non-white. It's hard to quantify \"a few\" when we're talking of the whole world.", 
   {}, 
   308958, 
   null, 
   1208476380.0
  ], 
  [
   309035, 
   null, 
   "sinjin", 
   "I question that (bolded). Jesse Jackson, Al Sharpton, Jeremiah Wright, Louis Farrakhan and more than just a few others seem racist to me. They are non-white. Not that one racist remark brands one permanently as \"racist\", but repetition of expressions of superiority can make the label stick.\nIMO only one deserves the title. Rev. Wright gets dishonorable mention. \n \n \nAre you telling me that you believe a higher percentage of whites are racist? I would certainly agree that there are many racists in the world...white and non-white. It's hard to quantify \"a few\" when we're talking of the whole world. \nIn the U.S. I'd say yes, a higher percentage of whites believe in the superiority of white race than non-whites who believe their race to be superior. Certainly many more whites in number owing to their majority. \n \n Are there other peoples in the world who see themselves as racially superior to most or all others? Ubetcha.", 
   {}, 
   308959, 
   null, 
   1208540160.0
  ], 
  [
   309181, 
   null, 
   "isly ilwott", 
   "IMO only one deserves the title. Rev. Wright gets dishonorable mention. \nSurely, you jest. Farrakhan is the worst of those listed.\n \n \n \n\n In the U.S. I'd say yes, a higher percentage of whites believe in the superiority of white race than non-whites who believe their race to be superior. Certainly many more whites in number owing to their majority. \nI do not yet agree with your claim that a higher percentage of whites are racist. The white race has not been suppressed and relieved of rights and properties near as much as blacks, American Indians and Asians. I would suspect more resentment and hatred in their midst than among whites who have not experienced such things. Many whites likely have not been taught to hate other races because they have not been exposed to the hatred as much. Many white children are taught Christian views (including that all are children of God) and have no hatred or feelings of superiority over other races. This is not to say that they are no Christians in the other races...certainly there are many. I believe the history of how a race has been treated has much to do with the percentage of angry racists among them. \n \n Another factor is the degree of racism in their leaders. Adolp Hitler was certainly racist. Many people under his control became racist by instruction.\n \n I am thankful that not all Germans agreed with his hatred of Jews...Oscar Schindler for one.\n \n \n \n\n Are there other peoples in the world who see themselves as racially superior to most or all others? Ubetcha.\nWe agree again.", 
   {}, 
   309035, 
   null, 
   1208655900.0
  ], 
  [
   309193, 
   null, 
   "Jo Bennett", 
   "I would have thought it was fairly safe to say a higher proportion of blacks and hispanics were practising Christians than whites, so I can't really see why whites should be more likely to teach tolerance and respect than others.", 
   {}, 
   309181, 
   null, 
   1208679780.0
  ], 
  [
   309197, 
   null, 
   "Bill Thompson", 
   "This is the question her campaign and the whole Democratic party need to answer.\n \n Clinton has almost no chance of winning the nomination without causing a rift in the party, and she has an even smaller chance of winning in the general. \n \n Recent polls say that almost half of all Americans have a negative opinion of her, and the Reverend Wright scandal seems to have hurt Obama less than Clinton's campaign has hurt her in the past weeks.\n \n The longer Hillary Clinton stays in the race, the less likely it is that the Democrats will win in November.\n\n \n I think you are right. And I think people will not take her seriously either after this is all over. Hurting her party just because of her jumbo ego is a bad thing and says a lot.", 
   {}, 
   306860, 
   null, 
   1208686800.0
  ], 
  [
   309211, 
   null, 
   "Zardoz", 
   "Yes, you can be racist against your own race.\n The cartoon series 'Boondocks' parodies that concept with one character who loaths the blacks (his own race).\n In real life, one member of white suprimicist movement was outted as having mixed race parents. They even made a documenary movie about it (didn't watch it myself though).\n \n I'd say you don't have to think your own race superior to all others to generally loath one particular race. One of the common jibs against jews by white suprimicist is the acknowledge that they are intelligent and shrewd but are immoral money grubbers.", 
   {}, 
   309197, 
   null, 
   1208715780.0
  ], 
  [
   309232, 
   null, 
   "Jo Bennett", 
   "Yes, you can be racist against your own race.\n The cartoon series 'Boondocks' parodies that concept with one character who loaths the blacks (his own race).\n In real life, one member of white suprimicist movement was outted as having mixed race parents. They even made a documenary movie about it (didn't watch it myself though).\n \n I'd say you don't have to think your own race superior to all others to generally loath one particular race. One of the common jibs against jews by white suprimicist is the acknowledge that they are intelligent and shrewd but are immoral money grubbers.\n\n \n White supremacists aren't exactly renowned for their logic, they generally manage to hold the position that whites are the master race of superior human beings and yet at the same time believe Jews have the power and intelligence for a tiny group to control the entire world.", 
   {}, 
   309211, 
   null, 
   1208722320.0
  ], 
  [
   309316, 
   null, 
   "sinjin", 
   "Surely, you jest. Farrakhan is the worst of those listed.\nHe'd be the one with the title. Wright not quite.", 
   {}, 
   309181, 
   null, 
   1208798520.0
  ], 
  [
   309319, 
   null, 
   "isly ilwott", 
   "He'd be the one with the title. Wright not quite.\n\n Okay. I misunderstood your last comment. I'm not sure I'd release Wright from the group called racists.", 
   {}, 
   309316, 
   null, 
   1208799480.0
  ], 
  [
   309324, 
   null, 
   "Archangel", 
   "White supremacists aren't exactly renowned for their logic, they generally manage to hold the position that whites are the master race of superior human beings and yet at the same time believe Jews have the power and intelligence for a tiny group to control the entire world.\n\n \n Your opinion is very euro-centric Jo. Just look at Japan and China, both frown very seriously on interracial marriage outside their race. And consider the white man to be very intellectually inferior to them. Asian Societies are the most openly racist on Earth considering the day and age we occupy since they don't even try to hide their superiority and their disdain for the Westerner.", 
   {}, 
   309232, 
   null, 
   1208800200.0
  ], 
  [
   309493, 
   null, 
   "gman", 
   " \n The longer Hillary Clinton stays in the race, the less likely it is that the Democrats will win in November.\n\n \n Hang in there Hillary!!!!!!!!!emoticon_xbouncer", 
   {}, 
   306860, 
   null, 
   1208918580.0
  ], 
  [
   309861, 
   null, 
   "michael777", 
   "The Clintons are a political machine. Hillary is a narcissist. She cares nothing for others except as they represent a potential vote to grant her the power she craves. She will likely not leave the race on her own...no matter what the polls say.\n \n I suspect that Obama's racism will surface again before the general election. The Republicans will see to that.\n\n \n I think Hillary will be trying to get the key to the White House even\n after she is declared the loser. She is definitely out of touch with reality.\n \n The only way she will get the nomination is if Obama somehow leaves the \n scene. I can't understand the people who keep funneling her money.\n michael777", 
   {}, 
   306887, 
   null, 
   1209250740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why is Hillary still in the race?", 
  "url": "http://www.4forums.com/political/politics-debates/11092-why-hillary-still-race.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 11092, 
  "discussion_files": [
   [
    "32943.html", 
    "http://www.4forums.com/political/politics-debates/11092-why-hillary-still-race-print.html"
   ], 
   [
    "32944.html", 
    "http://www.4forums.com/political/politics-debates/11092-why-hillary-still-race-3-print.html"
   ], 
   [
    "32945.html", 
    "http://www.4forums.com/political/politics-debates/11092-why-hillary-still-race-2-print.html"
   ]
  ], 
  "identifier": 11092
 }
]