[
 [
  [
   19095, 
   null, 
   "hermes", 
   "Just like the topic says-- please give me PRO mainly and some con if youd like.", 
   {
    "post_info": {
     "post_title": "Should a Government lie to it's people in a case of war?"
    }
   }, 
   null, 
   null, 
   1065982980.0
  ], 
  [
   19101, 
   null, 
   "AMD4EVER", 
   "Just like the topic says-- please give me PRO mainly and some con if youd like.\n\n \n Pro - It keeps moral up and therefore production remains stronger and the war can better be supported.\n \n Con - The people won't know the truth and eventually may begin to stop trusting anything the government says.\n \n The pros outweight the cons in my opinion.", 
   {}, 
   19095, 
   null, 
   1065985500.0
  ], 
  [
   19591, 
   null, 
   "sundowner", 
   "The US government lies to it's people during peace time, what makes you think they don't during war? I believe very little of what our government tells us. I do however trust SOME of the media, and I think that the media is the majority source of where people get most of their information during a war. The media is more likely to be objective and report the good and the bad news. After all, it seems that the US media thrives on bad news lately, the more bloodshed and carnage, the more people want to watch.", 
   {}, 
   19101, 
   null, 
   1066336320.0
  ], 
  [
   19594, 
   null, 
   "AMD4EVER", 
   "The US government lies to it's people during peace time, what makes you think they don't during war? I believe very little of what our government tells us. I do however trust SOME of the media, and I think that the media is the majority source of where people get most of their information during a war. The media is more likely to be objective and report the good and the bad news. After all, it seems that the US media thrives on bad news lately, the more bloodshed and carnage, the more people want to watch.\n\n \n I agree that the government will lie to us constantly and that we need to be suspicious of them to protect ourselves from these lies.\n \n The freedom of the press was originally put in place to keep the government in check and I think you are correct that it does provide more honesty than our government does.\n \n One thing I want to note is that one media source actually became more popular recently for providing the accurate news instead of the bad news, bloodshed, and carnage. FOX News was the station that gained the most popularity after the Iraqi war and they were the ones who were probably the most optimistic about it. Every other channel except FOX and MSNBC were pretty negative about it and at the end of the day we discovered that the best source of truth came from the optimistic networks and not the gloom and doomers. I think this little event showed that bad news will fall a distant second to honest reporting.", 
   {}, 
   19591, 
   null, 
   1066336920.0
  ], 
  [
   19605, 
   null, 
   "epaphras_faith", 
   "US government aside, the question is should a government lie to its people in time of war.\n \n My answer, no. I do not have a problem of withholding information so long as it is not done in order to deceive but rather to protect others so that the information will not harm them.\n \n A government should be honest at all times. Especially the US government (getting back to the US), because it is a government of the people and people should be honest. When answering a question might hurt someone I vote it simply is not answered.", 
   {}, 
   19594, 
   null, 
   1066343580.0
  ], 
  [
   19641, 
   null, 
   "AMD4EVER", 
   "My answer, no. I do not have a problem of withholding information so long as it is not done in order to deceive but rather to protect others so that the information will not harm them.\n\n \n What if a lie will save lives and possible save the entire country. What if false hope will prove the difference between your enemies victory and your own.\n \n The governments job is more than to just inform the people. Their job includes protecting them as well and making decisions that will allow their citizens to live the best possible lives. If a lie is going to help protect the people by allowing moral to stay high and therefore keeping production efforts up and military support high then I think they are doing the right thing. I don't doubt that there are situations where we have been lied to and really shouldn't have been but I don't deny that there are situations where I would want the government to lie to us because it is what is best for the country.", 
   {}, 
   19605, 
   null, 
   1066364880.0
  ], 
  [
   19735, 
   null, 
   "montalban", 
   "Pro- politicians are already good at it, so they don't have to change tact just because of war\n \n Con- politicians are already good at it, so they don't have to change tact just because of war", 
   {}, 
   19641, 
   null, 
   1066411680.0
  ], 
  [
   19745, 
   null, 
   "epaphras_faith", 
   "What if a lie will save lives and possible save the entire country. What if false hope will prove the difference between your enemies victory and your own.\n \n The governments job is more than to just inform the people. Their job includes protecting them as well and making decisions that will allow their citizens to live the best possible lives. If a lie is going to help protect the people by allowing moral to stay high and therefore keeping production efforts up and military support high then I think they are doing the right thing. I don't doubt that there are situations where we have been lied to and really shouldn't have been but I don't deny that there are situations where I would want the government to lie to us because it is what is best for the country.\n\n \n It what case would that occur where simply saying nothing would not work as well AND is related to a government speaking to its own people?", 
   {}, 
   19641, 
   null, 
   1066415220.0
  ], 
  [
   19764, 
   null, 
   "AMD4EVER", 
   "It what case would that occur where simply saying nothing would not work as well AND is related to a government speaking to its own people?\n\n \n Hmmm, well theoretically I think the government could help a war effort by saying we were doing well and just needed to work hard at home in order to support the war and we will win. Regardless as to whether we were winning or not this would probably help boost patriotism and work production at home. The work would then carry over into our war effort. Do you think this is probably true?", 
   {}, 
   19745, 
   null, 
   1066422960.0
  ], 
  [
   19773, 
   null, 
   "epaphras_faith", 
   "Hmmm, well theoretically I think the government could help a war effort by saying we were doing well and just needed to work hard at home in order to support the war and we will win. Regardless as to whether we were winning or not this would probably help boost patriotism and work production at home. The work would then carry over into our war effort. Do you think this is probably true?\n\n \n No. Especially not in this day and age. Information is too freely available for this scenario. The governmental lie is too easily found out. Wars are very public events. \n \n Heck, even Clinton couldn't hide an affair with Monica Lewinsky. It caused him gain the dubios honor of one of the very few presidents to be impeached by the HoR. He got caught in a lie \"read my lips, I did not have sexual relations with that woman, Monica Lewinsky\" on national TV. He then later had to admit it as he couldn't hide it. Lies are only likely to demoralize. Not saying, isn't much better but our government sure looks better.", 
   {}, 
   19764, 
   null, 
   1066428660.0
  ], 
  [
   19846, 
   null, 
   "IcePrincess", 
   "I dont think the gov't should be allowed to lie to its ppl at any time what-so-ever. If the gov't lies to us during war, how do we kno they'll stop when its peace time? lieing can be addictive. if the ppl found out the govt lied to them, they'd never trust it again! they also wouldnt support anything goin on that the gov't had supported, includin that war. of course i dont believe anythin the govt says anyways, especially about the war in iraq and the so-called 'war on terrorism'. \n \n \nThe US government lies to it's people during peace time, what makes you think they don't during war? I believe very little of what our government tells us. I do however trust SOME of the media, and I think that the media is the majority source of where people get most of their information during a war. The media is more likely to be objective and report the good and the bad news. After all, it seems that the US media thrives on bad news lately, the more bloodshed and carnage, the more people want to watch.\n \n \n\n \n I agree with you fully on that! i do trust the media more than the govt", 
   {}, 
   19773, 
   null, 
   1066452180.0
  ], 
  [
   19848, 
   null, 
   "SilentPoet", 
   "Just like the topic says-- please give me PRO mainly and some con if youd like.\n \n \n I must hand it to you. Its a thought provoking question.", 
   {}, 
   19846, 
   null, 
   1066452660.0
  ], 
  [
   19897, 
   null, 
   "epaphras_faith", 
   "I dont think the gov't should be allowed to lie to its ppl at any time what-so-ever. If the gov't lies to us during war, how do we kno they'll stop when its peace time? lieing can be addictive. if the ppl found out the govt lied to them, they'd never trust it again! they also wouldnt support anything goin on that the gov't had supported, includin that war. of course i dont believe anythin the govt says anyways, especially about the war in iraq and the so-called 'war on terrorism'. \n \n \n \n I agree with you fully on that! i do trust the media more than the govt\n\n \n IP: You are very cogent on this one. I suggest you rethink trusting the media before the government. Government is not a business. It is not out to make money. Should you verbatim trust the government? NO. However, the media is out to make money. They will and do lie. The worst part of it is that they pretend to be objective and just report the facts when actually they twist things by leaving out crucial information.\n \n For instance, I think it was MSNBC that ran an article that said soldiers were dissatisfied in Iraq. However, if you actually look at the poll you find that on one question they answered that they thought their units morale was low. About 65% I think. That is what was reported. They didn't bother to report that 67% of soldiers in Iraq report their morale to be good or better. They also didn't report the question that asked if the soldiers saw a reason for being over there. 66% said they saw a good or better reason for being over there.\n \n The media has a bias against conservative positions. Look for it. You will find it in most newspapers and TV stations. Fox News seems to have the most balanced reporting.", 
   {}, 
   19846, 
   null, 
   1066470000.0
  ], 
  [
   19905, 
   null, 
   "AMD4EVER", 
   "No. Especially not in this day and age. Information is too freely available for this scenario. The governmental lie is too easily found out. Wars are very public events. \n \n Heck, even Clinton couldn't hide an affair with Monica Lewinsky. It caused him gain the dubios honor of one of the very few presidents to be impeached by the HoR. He got caught in a lie \"read my lips, I did not have sexual relations with that woman, Monica Lewinsky\" on national TV. He then later had to admit it as he couldn't hide it. Lies are only likely to demoralize. Not saying, isn't much better but our government sure looks better.\n\n \n A good point, but in the case of a war that threatens are very way of life I don't think the American media will be doing what they did to Clinton and the people will be more willing to trust our own media and government than any opposing media or government.", 
   {}, 
   19773, 
   null, 
   1066485960.0
  ], 
  [
   20104, 
   null, 
   "epaphras_faith", 
   "A good point, but in the case of a war that threatens are very way of life I don't think the American media will be doing what they did to Clinton and the people will be more willing to trust our own media and government than any opposing media or government.\n\n \n \n Certainly true if we are comparing our media and government and the opposing media and government - check out Iraq and good ole Bagdhad Bob. Sure there were no American troops in Bagdhad........\n \n However, I am willing to believe only certain media outlets. Most network media I do not trust at all. For instance, the network media still attacks the war in Iraq as unjust. However, go to http://www.whitehouse.gov/news/releases/2003/09/iraq/20030920-4.html and look up the anecdotal info on what was done to the Iraqi people by Saddam Hussein. It is page after page after page of reports coming from towns that had been liberated by the american troops. it is almost completely American media sources. They report these terrible stories and then still have the gall to say that the war was not justified. They are out to make money and to prosit an agenda. I hate that.", 
   {}, 
   19905, 
   null, 
   1066693980.0
  ], 
  [
   20899, 
   null, 
   "mizmaxx", 
   "They report these terrible stories and then still have the gall to say that the war was not justified. They are out to make money and to prosit an agenda.\n\n \n Now, now, we don't want to get caught up in an OT argument over the war, do we?\n \n \nThe freedom of the press was originally put in place to keep the government in check and I think you are correct that it does provide more honesty than our government does.\n\n \n Actually, freedom of speech had freedom of the press tacked onto it because of the early factionalism in the US gov't. Look into it in any history of the US press or early US history. Sorry, but no idealistic need to ensure gov't fairness is the root here, just plain old fashiloned politicking.\n \n \nThe media has a bias against conservative positions. Look for it.\n\n \n I think it's fairer to say that the media is biased against anything not \"middle-of-the-road\". Whatever they feel is an \"extreme\" position, they will regard as suspect. This goes as much for the \"left \" as for the \"right\". \n \n The only bias they have are anything that goes against their economic interests. If a position is marginal or extreme it might offend people who might then stop watching, boycott, withdraw ad money ( emoticon_wow ) or otherwise cause problems. It is unimportant what is true, or what is left or right. They are just as unlikely to embrace an \"extremely liberal\" position as they are an \"extremely conservative\" one. That's why they love words like \"controversial\"- it piques interest but says nothing.", 
   {}, 
   20104, 
   null, 
   1067501700.0
  ], 
  [
   20937, 
   null, 
   "epaphras_faith", 
   "Now, now, we don't want to get caught up in an OT argument over the war, do we?.\n Not trying to touch the war, just that the media representation of it (for the most part) was far from accurate. Chritianne Amanpour was one of the worst offenders. You will note that her ratings were abysmal. She attacked the war and then it was reported later that she knew of tortures of Iraqi staffers and said nothing out of fear of reprisals. Then, after it is safe to criticise she still defends the government.\n \n \n \n \nI think it's fairer to say that the media is biased against anything not \"middle-of-the-road\". Whatever they feel is an \"extreme\" position, they will regard as suspect. This goes as much for the \"left \" as for the \"right\". \n \n The only bias they have are anything that goes against their economic interests. If a position is marginal or extreme it might offend people who might then stop watching, boycott, withdraw ad money ( emoticon_wow ) or otherwise cause problems. It is unimportant what is true, or what is left or right. They are just as unlikely to embrace an \"extremely liberal\" position as they are an \"extremely conservative\" one. That's why they love words like \"controversial\"- it piques interest but says nothing.\n\n \n i disagree, the media has an agenda that aggrandizes the liberal left leaning agenda as that is what will make money for them. It has to do with the \"feel good\" attitude.", 
   {}, 
   20899, 
   null, 
   1067550480.0
  ], 
  [
   20978, 
   null, 
   "mizmaxx", 
   "Then, after it is safe to criticise she still defends the government.\n\n \n Defends which government? Did she actually defend Iraq, or just make it clear that it is wrong for the US to attack them?\n \n You do realize that far worse human rights abuses are done every day by governments that the US supports. Historically, whether a government is abusive and violent or democratic and good has been irrelevant as to whether the US sees them as an enemy. The sole mitigating factor has always been economic. If a government lets US economic interests control it, the US gov't considers them a friend and will ignore horrible human rights abuses (Saudia Arabia, Panama at first, Iraq before). If a government does anything that goes against the US corporate monopoly, the US will attack them, regardless of whether they are democratic and peaceful or horrible dictatorships (Nicaragua, Chile, Panama afterwards, Iraq now).\n \n That's simply a historical fact. \n \n So no amount of human rights abuses by Iraq would explain the US war against them. Not to mention that US sanctions and warfare have left the Iraqi people in a far worse state now than they were just with their horrible dictator. Not to mention that the US helped Iraq violently quash a rebellion that would have overturned the dictatorship genberations ago...\n \n \nthe media has an agenda that aggrandizes the liberal left leaning agenda as that is what will make money for them\n\n \n I guess we have a different definition of \"liberal\" and \"left\". I don't think left wing views will make media companies much money at all, and I rarely see anything left of mainstream centre-right on tv.\n \n You want left-wing media, check out journalists who aren't corporate-censored. Like indymedia , the independant media centre...\n \n Personally, I think the mainstream media would see you as a right-wing extremist, and me as a left-wing extremist, and they would disagree with us both.", 
   {}, 
   20937, 
   null, 
   1067589300.0
  ], 
  [
   21053, 
   null, 
   "theLIBERTARIAN", 
   "In a Democracy it is important for the government not to lie. I agree with epaphras_faith that it may be necessary to withhold some information like troop movements etc. But they should not withhold information for the sake of making the war look favorable. At least in a Democracy.\n \n In a Dictatorship it doesn't matter.", 
   {
    "unicode_changes_made": true
   }, 
   20104, 
   null, 
   1067680560.0
  ], 
  [
   21080, 
   null, 
   "AMD4EVER", 
   "In a Democracy it is important for the government not to lie. I agree with epaphras_faith that it may be necessary to withhold some information like troop movements etc. But they should not withhold information for the sake of making the war look favorable. At least in a Democracy.\n \n In a Dictatorship it doesn't matter.\n\n \n What if we risk being defeated by a dictatorship? Would it be better to tell the truth and risk demoralizing the people who are fueling the war efforts or would it be better to tell the truth and risk the demoralizing the people?", 
   {
    "unicode_changes_made": true
   }, 
   21053, 
   null, 
   1067756940.0
  ], 
  [
   21089, 
   null, 
   "theLIBERTARIAN", 
   "What if we risk being defeated by a dictatorship? Would it be better to tell the truth and risk demoralizing the people who are fueling the war efforts or would it be better to tell the truth and risk the demoralizing the people?\n\n \n Can you give me a scenario where you think it would be OK for our government to lie to us? The reason I ask is, I don't see one beyond troop movements and such.", 
   {
    "unicode_changes_made": true
   }, 
   21080, 
   null, 
   1067761380.0
  ], 
  [
   21110, 
   null, 
   "Hank", 
   "What if we risk being defeated by a dictatorship? Would it be better to tell the truth and risk demoralizing the people who are fueling the war efforts or would it be better to tell the truth and risk the demoralizing the people?\n\n \n Vietnam was the prime example of the government lying to the people to &#8220;keep up moral&#8221;. Victory was always just a few months away and we were going to win soon. After years of dismal failures and being lied to, the people finally saw the truth, mainly by press reports and dead solders being shipped home in body bags. We are still trying to overcome that distrust today. A little truth would have gone a long way towards settling this terrible war and saving lives. A democracy only works when the people are informed. To say that the government should lie to the American people is to say that those people that were put in power by the people don&#8217;t trust the people. And that is a slippery slope to a dictatorship.\n \n When we a fighting a war on the other side of the world, the people have a right to know why we are fighting and what are the risk and advantages. It could be a case where the politicians have made the wrong decision to fight a war. In that case, moral should be low so something will be done about a bad decision. When the people are told the truth and know their lives are in danger, you don&#8217;t have to worry about moral, they will fight tooth and toenail to preserve their families.", 
   {}, 
   21080, 
   null, 
   1067792460.0
  ], 
  [
   21113, 
   null, 
   "AMD4EVER", 
   "Can you give me a scenario where you think it would be OK for our government to lie to us? The reason I ask is, I don't see one beyond troop movements and such.\n\n \n If we were to be invaded and things looked bleak I think it would be best for our government to report upbeat things than the negative truth since upbeat things will allow us to rally and stay focused on achieving victory rather than avoiding defeat. Moral and productivity would be at stake here and both are important to the war.", 
   {
    "unicode_changes_made": true
   }, 
   21089, 
   null, 
   1067793240.0
  ], 
  [
   21114, 
   null, 
   "AMD4EVER", 
   "Vietnam was the prime example of the government lying to the people to \"keep up moral\". Victory was always just a few months away and we were going to win soon. After years of dismal failures and being lied to, the people finally saw the truth, mainly by press reports and dead solders being shipped home in body bags. We are still trying to overcome that distrust today. A little truth would have gone a long way towards settling this terrible war and saving lives. A democracy only works when the people are informed. To say that the government should lie to the American people is to say that those people that were put in power by the people don't trust the people. And that is a slippery slope to a dictatorship.\n\n \n Vietnam is a good example of where lying went too far and wasn't worth it. It was a pointless war for the most part.\n \n If lying in the government leads to a dictatorship then you have to know that every politician today is leading us in that direction. Name one who doesn't lie. If you cannot, do you expect us to be a dictatorship soon?\n \n \nWhen we a fighting a war on the other side of the world, the people have a right to know why we are fighting and what are the risk and advantages. It could be a case where the politicians have made the wrong decision to fight a war. In that case, moral should be low so something will be done about a bad decision. When the people are told the truth and know their lives are in danger, you don't have to worry about moral, they will fight tooth and toenail to preserve their families.\n\n \n But what if America is where the war is? What then is your policy?", 
   {
    "unicode_changes_made": true
   }, 
   21110, 
   null, 
   1067793540.0
  ], 
  [
   21126, 
   null, 
   "Hank", 
   "Vietnam is a good example of where lying went too far and wasn't worth it. It was a pointless war for the most part.\n\n \n So you are only in favor of lying to the American people when it doesn&#8217;t go too far and when it&#8217;s worth it. Now who determines when it doesn&#8217;t go too far and when it&#8217;s worth it? Are you going to let the government or the people decide which war is pointless? BTW were you an adult during the Vietnam war?\n \n \nIf lying in the government leads to a dictatorship then you have to know that every politician today is leading us in that direction. Name one who doesn't lie. If you cannot, do you expect us to be a dictatorship soon? \n\n \n Politicians like everyone lie, some more than others. People lie to protect their own interest. I was referring to the government, which is not a politician but a collection of representatives. Fortunately the government is divided, as the founding fathers intended, and there is always a battle between what should be told and the lies as is evident more than ever today. If all the representatives get together and decide to lie to the American people as a group, then yes we will soon be in a dictatorship. I have great faith in the American system so I don&#8217;t think we are headed in that direction. But I may be naive. \n \n \nBut what if America is where the war is? What then is your policy?\n\n \n My policy is to trust the people with the truth. Otherwise there is no oversight of the people over the government. And that is what the founding fathers warned us against.", 
   {}, 
   21114, 
   null, 
   1067795520.0
  ], 
  [
   21130, 
   null, 
   "AMD4EVER", 
   "So you are only in favor of lying to the American people when it doesn't go too far and when it's worth it. Now who determines when it doesn't go too far and when it's worth it? Are you going to let the government or the people decide which war is pointless? BTW were you an adult during the Vietnam war?\n\n \n Personally I would hope that the government would do what is in their best interest and what is in their best interests is going to be what is in the best interest of the country as a whole. We need to elect people with a brain to make the important decisions so that we never get into another Vietnam.\n \n No I wasn't even born when the Vietnam war was going on.\n \n \nPoliticians like everyone lie, some more than others. People lie to protect their own interest. I was referring to the government, which is not a politician but a collection of representatives. Fortunately the government is divided, as the founding fathers intended, and there is always a battle between what should be told and the lies as is evident more than ever today. If all the representatives get together and decide to lie to the American people as a group, then yes we will soon be in a dictatorship. I have great faith in the American system so I don't think we are headed in that direction. But I may be naive. \n\n \n The government is made up of politicians that lie. How does this not reflect at all on the government? Mix that in with the CIA and FBI and you have a lot of lies, half truths, and hidden events. No one should ever trust that the government is going to be honest about anything in the first place simply because they do not have to be honest.\n \n I also have faith in the American system because we are forced to be democratic by the other countries in the world. We know that a dictatorship would result in a fall in the production and importance of our country compared to the rest of the world. Therefore the government would not even consider a dictatorship because it would ultimately hurt them more than anyone else.\n \n \nMy policy is to trust the people with the truth. Otherwise there is no oversight of the people over the government. And that is what the founding fathers warned us against.\n\n \n So you would rather have lower moral and lower productivity in return for truth? Would you be at all upset if this decision was the one that swung the war the other way and we fell to a dictatorship? It seems strange to me that you love democracy so much but you are willing to allow our enemies to take advantage of our system of truth in order to destroy us. Does this not prove that democracy is ultimately going to fall due to itself?", 
   {
    "unicode_changes_made": true
   }, 
   21126, 
   null, 
   1067796840.0
  ], 
  [
   21159, 
   null, 
   "mizmaxx", 
   "It seems strange to me that you love democracy so much but you are willing to allow our enemies to take advantage of our system of truth in order to destroy us. Does this not prove that democracy is ultimately going to fall due to itself?\n\n \n If the US was really a democracy, the government would not be able to lie at all. COINTELPRO, the Iran-Contra scandal, Watergate, Vietnam, and countless other things we still don't know about, none of these would have happened.\n \n If the government didn't lie, very few people would be going to attack Iraq, or wherever the \"target of the hour\" is. \n \n Democracy works. The US isn't a democracy, and it doesn't have a \"system of truth\", so the government lies to get people to do things for it, and will continue to do so.", 
   {}, 
   21130, 
   null, 
   1067822520.0
  ], 
  [
   21192, 
   null, 
   "AMD4EVER", 
   "If the US was really a democracy, the government would not be able to lie at all. COINTELPRO, the Iran-Contra scandal, Watergate, Vietnam, and countless other things we still don't know about, none of these would have happened.\n \n If the government didn't lie, very few people would be going to attack Iraq, or wherever the \"target of the hour\" is. \n \n Democracy works. The US isn't a democracy, and it doesn't have a \"system of truth\", so the government lies to get people to do things for it, and will continue to do so.\n\n \n So you would trade what the US has right now in favor of risking everything for the sake of truth even if that means the future will never again know truth?", 
   {}, 
   21159, 
   null, 
   1067842440.0
  ], 
  [
   21204, 
   null, 
   "mizmaxx", 
   "So you would trade what the US has right now in favor of risking everything for the sake of truth even if that means the future will never again know truth?\n\n \n The US is not a democracy being threatened by a dictatorship, so I don't understand the relevance of your question. \n \n I would, and do, do everything I can to encourage people to live democratically, and to encourage open and transparent democratic systems.", 
   {}, 
   21192, 
   null, 
   1067845380.0
  ], 
  [
   21217, 
   null, 
   "theLIBERTARIAN", 
   "If we were to be invaded and things looked bleak I think it would be best for our government to report upbeat things than the negative truth since upbeat things will allow us to rally and stay focused on achieving victory rather than avoiding defeat. Moral and productivity would be at stake here and both are important to the war.\n\n \n That is better than any example I could think of. IMHO lying to the American people could cause us to fail in the example you give. I would still say no.", 
   {}, 
   21113, 
   null, 
   1067854320.0
  ], 
  [
   21229, 
   null, 
   "AMD4EVER", 
   "The US is not a democracy being threatened by a dictatorship, so I don't understand the relevance of your question. \n \n I would, and do, do everything I can to encourage people to live democratically, and to encourage open and transparent democratic systems.\n\n \n I didn't say anything concerning the US being a democracy in my last question. All I asked is if you would risk what the US is today in order to hear the truth even if it means we could fall to a new order which will not tell us the truth ever again. Pretend it is the Cold War and communist Russia has invaded and look like they will win. Do you want the US government to try and rally the American people by making things look better than they are and giving them hope or do you want to know the truth and risk disheartening them and therefore risk having our government fall to communism?", 
   {}, 
   21204, 
   null, 
   1067876520.0
  ], 
  [
   21379, 
   null, 
   "Hank", 
   "Personally I would hope that the government would do what is in their best interest and what is in their best interests is going to be what is in the best interest of the country as a whole. We need to elect people with a brain to make the important decisions so that we never get into another Vietnam.\n\n \n You need to do some reading about history and political science if you think what is in the best interest of a government is always in the best interest of the people. And you didn&#8217;t address my question about who should determine when the government should start lying.\n \n We have exactly the same case right now in Iraq. Some people believe we should be there and some do not. I&#8217;d bet you are on one side or the other. Only time will tell which side is right.\n \n \nNo I wasn't even born when the Vietnam war was going on. \n\n \n Then you have no idea how much anger there was between the people and the government about lying to them. \n \n \nThe government is made up of politicians that lie. How does this not reflect at all on the government? Mix that in with the CIA and FBI and you have a lot of lies, half truths, and hidden events. No one should ever trust that the government is going to be honest about anything in the first place simply because they do not have to be honest.\n\n \n And politicians are made up of people. And people lie. That is why the government should be divided so that one part cannot get enough power to only give one side of an issue.\n \n If no one should ever trust the government, how does that fit in with your previous statement about electing people with a brain to make important decisions.\n \n \nI also have faith in the American system because we are forced to be democratic by the other countries in the world. We know that a dictatorship would result in a fall in the production and importance of our country compared to the rest of the world. Therefore the government would not even consider a dictatorship because it would ultimately hurt them more than anyone else. \n\n \n No one &#8220;forces&#8221; us to be democratic. We fought a war to have the right to be democratic. I think you are very naïve if you believe we can assume the government will never try to take power over the people. Every heard the saying &#8220;Power corrupts, absolute power corrupts absolutely&#8221;? \n \n \nSo you would rather have lower moral and lower productivity in return for truth? Would you be at all upset if this decision was the one that swung the war the other way and we fell to a dictatorship? It seems strange to me that you love democracy so much but you are willing to allow our enemies to take advantage of our system of truth in order to destroy us. Does this not prove that democracy is ultimately going to fall due to itself?\n\n \n I assume by &#8220;lower productivity&#8221; that you mean economic productivity. But during the Vietnam war productivity did not suffer any worse than any other time. In fact wars tend to stimulate the economy.\n \n But I reject your premise. You say that the only option is lying or lower moral and lower productivity. Point to me a case in history where that has been the case. Your premise is that the ends justify the means. If nothing else, my religious beliefs would reject that philosophy. All the great religious personalities taught against that. In addition you are stating that the American people can not handle the truth. That somehow we will just lie down and let someone run over us if we find out we are in trouble. To me that&#8217;s a poor attitude and an inaccurate belief about people in general and the American people in particular.\n \n This weekend my little girl&#8217;s 7 year old soccer team, whom I coach, was behind towards the end of the last quarter and they didn&#8217;t realize they were behind. There was a break in the action after the other team scored and as they were walking back to line up I hollered at them to come towards me right quick. I told them we were one point behind and that it didn&#8217;t matter whether we lost by one point or 20 points. Then I told them everyone on the field except the goalie should attack as soon as we kicked off. We made two goals within two minutes and won the game. According to your theory, I should have said nothing to prevent them from being demoralized.\n \n Just keep the American people in the dark and let the government make the correct decisions? Not in this lifetime if I have anything to say about it. I&#8217;ve seen that scenario and didn&#8217;t like it. And neither did the American people at the time. Obviously the new generation has not read much history.", 
   {}, 
   21130, 
   null, 
   1067958960.0
  ], 
  [
   21390, 
   null, 
   "AMD4EVER", 
   "You need to do some reading about history and political science if you think what is in the best interest of a government is always in the best interest of the people. And you didn't address my question about who should determine when the government should start lying.\n \n We have exactly the same case right now in Iraq. Some people believe we should be there and some do not. I'd bet you are on one side or the other. Only time will tell which side is right.\n\n \n Provide an example of when the government did something that was in their interest but not in the interest of the country. Did the event actually end up benefiting the government or the country? Would the government repeat this event?\n \n Who should determine when the government should start lying? Well since a government lie would require the backing of a whole lot of politicians and the people elect these politicians to speak on their behalf, I think the politicians in the government should be the ones to determine when the government should start or stop lying. If a single politician feels the government has gone too far then they should speak out the truth. If you really believe that democracy works then you have to believe the government can regulate itself based on the quality of people in the position of power.\n \n As for whether we did the right thing in Iraq or not, that is going to be determined by the people of Iraq. I've heard repeatedly that only 20% of the country is still providing resistance to our troops while the other 80% is relatively peaceful. If we want to talk democratically Iraq has already shown that it is ready to move forward from here and that means the building of a new government that is for the people. In the long run do you believe that the new government will be better for the people than Saddam was? Do you think that a government that is better for the people is also going to be better for the country? Do you also think that a government the is better for the country could end up influencing the people of the surrounding countries into realizing things can get better?\n \n \nThen you have no idea how much anger there was between the people and the government about lying to them.\n\n \n I know the anger I felt for our governments incompetence after 9/11. However you are correct. I'm lucky that I am living in a time where I have no major reason to be angry about my government lying to me.\n \n \nAnd politicians are made up of people. And people lie. That is why the government should be divided so that one part cannot get enough power to only give one side of an issue.\n\n \n The politicians all have agendas and most of those agendas include trying to get re-elected by the people who elected them in the past. Politicians who lie have to still keep in mind the people who they need to get re-elected as well as those who wish to run against them and bring up the lies they are telling.\n \n The government is actually divided because a title is given to their name and that title is either Democrat or Republican. If you take away the titles and take away partician lines you will have a less divided government. However you won't have the counter balances that you have today because of our two party system. It is probably beneficial for the government to be divided because it keeps the system honest.\n \n \nIf no one should ever trust the government, how does that fit in with your previous statement about electing people with a brain to make important decisions.\n\n \n No one ever should trust the government. If people fall into just trusting everything the government says then the government will have free reign. We cannot trust the government enough to do that and of course since this is a democracy it is our right to say our piece on what the government should be doing. If we don't like being lied to then do what the people of California did to their lying and corrupt politician. This is democracy at its finest.\n \n Electing people with a brain is important to our system as well. Although you don't want to trust their every decision you still want them to be able to make good decisions. Keep a close eye on them regardless of how honest and smart they seem to be but if they really are a politician who is honest and smart they will only benefit our country and our government.\n \n \nNo one \"forces\" us to be democratic. We fought a war to have the right to be democratic. I think you are very naïve if you believe we can assume the government will never try to take power over the people. Every heard the saying \"Power corrupts, absolute power corrupts absolutely\"? \n\n \n No one forces us to be that was but world relations basically prevent it from changing to basically we are forced to remain the same. If we were to suddenly become communist or facist or a dictatorship it would have a ripple affect across the world that would hurt us in many ways and throw our system into chaos.\n \n I never assumed that our goverment will never take power over the people. I did assume that the government will do what is in their best interest and taking control of the people is not in their best interest at this time therefore it will not happen right now. Perhaps if situations change drastically they will have a reason to do this but as it stands today they do not have a reason to.\n \n Absolute power? Name the person in our system who has absolute power. Even our government has to make deal with other governments around the world therefore they don't have absolute power anywhere. In a democracy the amount of power the government has is even more limited because the people are playing in a role in the government as well. So if you believe the government has absolute power then I think you are misunderstanding our government.\n \n \nI assume by \"lower productivity\" that you mean economic productivity. But during the Vietnam war productivity did not suffer any worse than any other time. In fact wars tend to stimulate the economy.\n\n \n Productivity will generally increase during the time of war as you stated. Vietnam went on for a long time before the people even turned against the war. Check the stats for the last few years of the war to determine if productivity actually did drop when the people turned against the war.\n \n \nBut I reject your premise. You say that the only option is lying or lower moral and lower productivity. Point to me a case in history where that has been the case. Your premise is that the ends justify the means. If nothing else, my religious beliefs would reject that philosophy. All the great religious personalities taught against that. In addition you are stating that the American people can not handle the truth. That somehow we will just lie down and let someone run over us if we find out we are in trouble. To me that's a poor attitude and an inaccurate belief about people in general and the American people in particular.\n\n \n If you want a place where lying has worked, just look at the Cuban missile crisis. The truth was kept secret from the people of the US and the result was beneficial. I gather from your opinions that you don't believe in doing such things as this. You would rather know about the nukes in Cuba and allow panic to grip the nation and the people, who do have a say in our society, to be overtaken by fear and eventually begin protesting for war. The Cuban missile crisis is about as close as the US has ever been to being invaded and on this occasion the people of the US benefited from not being told the truth. Could it have gone the same way that it did if the people of the US knew everything that was going on? I really doubt it since the Russian government did not want to let anyone know that they were the ones that pulled out after pressure from the US. It would be losing too much face for them to publicly be humiliated. So would the truth have led to lower productivity and moral as well? Absolutely.\n \n I think you do misunderstand where I allow the government to lie to us. In Vietnam the war was far, far away and there was no reason for us to be lied to. I don't wish for those types of wars to include lies because the nation is not being threatened. However, if the war was ever to come to the US I would rather the government determine what they will tell us than have the government tell us every bit of information. Propaganda is what it is called and it has worked throughout the ages to benefit countries in times of war while hurting other countries.\n \n \nThis weekend my little girl's 7 year old soccer team, whom I coach, was behind towards the end of the last quarter and they didn't realize they were behind. There was a break in the action after the other team scored and as they were walking back to line up I hollered at them to come towards me right quick. I told them we were one point behind and that it didn't matter whether we lost by one point or 20 points. Then I told them everyone on the field except the goalie should attack as soon as we kicked off. We made two goals within two minutes and won the game. According to your theory, I should have said nothing to prevent them from being demoralized.\n\n \n That is not my theory at all. If you knew that they were all going to die in 24 hours and they were having fun right now it is my theory that it is better for them to be allowed to have the fun they are having without having to hear the truth. My theory also includes that if you were to tell them the truth they would have less of a chance of victory in the game they were playing. Does my theory hold up in your mind?\n \n \nJust keep the American people in the dark and let the government make the correct decisions? Not in this lifetime if I have anything to say about it. I've seen that scenario and didn't like it. And neither did the American people at the time. Obviously the new generation has not read much history.\n\n \n Once again you misunderstand my position. I never said keep Americans in the dark. I said keep them in the dark in the time of war where we are being threatened. This would include on a very specific event instead of a very general one. We haven't really been threatened for a long time and most of the times that we were threatened we have been able to tell the truth since victory was going to be ours. If we ever have a time where victory is not as assured and the moral and productivity of our nation will be important then I'd rather the government try and help the war effort in any way they can than to simply tell the truth about everything and not question whether or not it will hurt our war efforts or not. The war would be more important to me than anything because the war would be the difference between democracy and the United States being around tomorrow or not.", 
   {
    "unicode_changes_made": true
   }, 
   21379, 
   null, 
   1067969040.0
  ], 
  [
   21783, 
   null, 
   "mizmaxx", 
   "The war would be more important to me than anything because the war would be the difference between democracy and the United States being around tomorrow or not.\n\n \n I suppose all depends on what you think the United States is, whether you believe it is a good thing, how you define democracy, etc.", 
   {}, 
   21390, 
   null, 
   1068190980.0
  ], 
  [
   21806, 
   null, 
   "AMD4EVER", 
   "I suppose all depends on what you think the United States is, whether you believe it is a good thing, how you define democracy, etc.\n\n \n What do you believe the United States is? Do you believe it is a good thing? Would you rather hear one true statement and risk never hearing one again or one false statement and improve the chances of the United States carrying on.", 
   {}, 
   21783, 
   null, 
   1068220200.0
  ], 
  [
   21901, 
   null, 
   "mizmaxx", 
   "Would you rather hear one true statement and risk never hearing one again or one false statement and improve the chances of the United States carrying on.\n\n \n That's such a hypothetical question, because you're assuming that the US government presently tells the truth, and that someone is threatening for this to end. In reality, the government only ever tells the truth when they have to. In fact, isn't it explicitly policy that people only find out US military information on a \"need-to-know\" basis, defined by- the US military. For all you know, the gov't could be lying to you all the time. How would you know the difference?\n \n Second, you assume that the military interventions the US engages in effect US national policies in such a way as to make them more democratic. In fact, the opposite has been the case. Take 9/11 and Patriot Act-type legislation, which clearly would be considered unacceptable without an impending intervention. So far, no one has demonstated any evidence of anyone who has the power to threaten democracy in the US but the US gov't and US corporations themselves. \n \n The US is a settler nation-state. The people who run it are old money- rich businessmen who come from rich businessmen and so on. If that were to end, I wouldn't shed a tear, in fact I'd happily dance on the ruins of the Pentagon. However, these same businessmen have a habit of causing international trouble such that if, as you say, someone were to threaten the US with retaliation than I doubt that any of said people in power would have anything to worry about. People such as thise who worked as secretaries or cleaning-people in the Twin Towers however, are another story.\n \n People often accuse me of hating America. That's bs, how could I hate my own people? What I hate are the people who put my family in jeapardy to fatten their ginormous wallets. So if you're talking about a threat to them, well look no further than the whitehouse for that.", 
   {}, 
   21806, 
   null, 
   1068256620.0
  ], 
  [
   21960, 
   null, 
   "Hank", 
   "I feel almost silly arguing that the US government should NOT lie to us. And I find it difficult to believe that there are people in the US that think there are cases where ignorance of government policy is a good thing. But I&#8217;m going to stick with this debate for at least a little while longer. \n \n \nProvide an example of when the government did something that was in their interest but not in the interest of the country. Did the event actually end up benefiting the government or the country? Would the government repeat this event?\n\n \n I&#8217;ve already stated Vietnam. The lies allowed the ones in power to be reelected. If we had know the truth, they would have been thrown out at the next election and the people would have been much better off. And most politicians will continue to repeat this event if it gets him/her reelected.\n \n \nWho should determine when the government should start lying? Well since a government lie would require the backing of a whole lot of politicians and the people elect these politicians to speak on their behalf, I think the politicians in the government should be the ones to determine when the government should start or stop lying. If a single politician feels the government has gone too far then they should speak out the truth. If you really believe that democracy works then you have to believe the government can regulate itself based on the quality of people in the position of power.\n\n \n I believe that democracy is the best form of government that we have at this time. But I do not trust the government even though it is a democracy. Therefore I do not believe the government can regulate itself and I certainly don&#8217;t HAVE to believe it can regulate itself.\n \n \nAs for whether we did the right thing in Iraq or not, that is going to be determined by the people of Iraq. I've heard repeatedly that only 20% of the country is still providing resistance to our troops while the other 80% is relatively peaceful. If we want to talk democratically Iraq has already shown that it is ready to move forward from here and that means the building of a new government that is for the people. In the long run do you believe that the new government will be better for the people than Saddam was? Do you think that a government that is better for the people is also going to be better for the country? Do you also think that a government the is better for the country could end up influencing the people of the surrounding countries into realizing things can get better? \n\n \n Iraq MAY be ready for democracy if you mean democracy for the male gender. I seriously doubt women will be given the right to vote in this society. And if it&#8217;s like Iran, which it looks like it&#8217;s headed in that direction, the religious leaders will have the final say even in a democracy. I have no idea if the new government will be better for the people than Saddam was and neither does anyone else. That&#8217;s not a question for the US though. It&#8217;s their country, and if they are not threatening us then it&#8217;s up to their people what kind of government they have.\n \n \nI know the anger I felt for our governments incompetence after 9/11. However you are correct. I'm lucky that I am living in a time where I have no major reason to be angry about my government lying to me. \n\n \n You&#8217;re government lying to you should be a major reason in itself.\n \n \nThe politicians all have agendas and most of those agendas include trying to get re-elected by the people who elected them in the past. Politicians who lie have to still keep in mind the people who they need to get re-elected as well as those who wish to run against them and bring up the lies they are telling.\n\n \n And you want to justify this in some cases?\n \n \nThe government is actually divided because a title is given to their name and that title is either Democrat or Republican. If you take away the titles and take away partician lines you will have a less divided government. However you won't have the counter balances that you have today because of our two party system. It is probably beneficial for the government to be divided because it keeps the system honest. \n\n \n It doesn&#8217;t keep the system honest just because it&#8217;s partisan. It does allow the people to see both extremes and try to read what is actually the truth.\n \n \nNo one ever should trust the government. If people fall into just trusting everything the government says then the government will have free reign. We cannot trust the government enough to do that and of course since this is a democracy it is our right to say our piece on what the government should be doing. If we don't like being lied to then do what the people of California did to their lying and corrupt politician. This is democracy at its finest.\n\n \n You just got through say that you have to believe the government can regulate itself. So which is it?\n \n Do you really think that California elected someone that is not corrupt or going to lie to them?\n \n \nNo one forces us to be that was but world relations basically prevent it from changing to basically we are forced to remain the same. If we were to suddenly become communist or facist or a dictatorship it would have a ripple affect across the world that would hurt us in many ways and throw our system into chaos.\n \n I never assumed that our goverment will never take power over the people. I did assume that the government will do what is in their best interest and taking control of the people is not in their best interest at this time therefore it will not happen right now. Perhaps if situations change drastically they will have a reason to do this but as it stands today they do not have a reason to.\n \n Absolute power? Name the person in our system who has absolute power. Even our government has to make deal with other governments around the world therefore they don't have absolute power anywhere. In a democracy the amount of power the government has is even more limited because the people are playing in a role in the government as well. So if you believe the government has absolute power then I think you are misunderstanding our government. \n\n Germany was a democracy and no one had absolute power before Hitler took over. It has happened and can happen again. \n \n \nProductivity will generally increase during the time of war as you stated. Vietnam went on for a long time before the people even turned against the war. Check the stats for the last few years of the war to determine if productivity actually did drop when the people turned against the war. \n\n \n Productivity rose about 2.5% each year in the 50&#8217;s and 60&#8217;s and about 1% in the 70&#8217;s and 80&#8217;s. Do you attribute the 1.5% decrease over the 20 year period to the Vietnam war?\n \n \nIf you want a place where lying has worked, just look at the Cuban missile crisis. The truth was kept secret from the people of the US and the result was beneficial. I gather from your opinions that you don't believe in doing such things as this. You would rather know about the nukes in Cuba and allow panic to grip the nation and the people, who do have a say in our society, to be overtaken by fear and eventually begin protesting for war. The Cuban missile crisis is about as close as the US has ever been to being invaded and on this occasion the people of the US benefited from not being told the truth. Could it have gone the same way that it did if the people of the US knew everything that was going on? I really doubt it since the Russian government did not want to let anyone know that they were the ones that pulled out after pressure from the US. It would be losing too much face for them to publicly be humiliated. So would the truth have led to lower productivity and moral as well? Absolutely.\n\n \n I have no idea what you are talking about and apparently you don&#8217;t either. I was a junior in high school and it was on the front page of every paper in America. I just looked and the lead story in the Washington Post was &#8220;Kennedy Orders Blockade of Cuba As Reds Build Nuclear Bases There; U.S. Will Sink Defiant Arms Ships&#8221;. The whole front page was covered with articles relating to the story. And there was no panic. People did not run in the streets and become &#8220;overtaken by fear&#8221; or &#8220;begin protesting for war&#8221;. The workforce did not shut down and schools were not closed. Of course people were concerned as well they should have been, but there was no panic. So according to your own example, the truth did not cause any demoralization of the people. Maybe you&#8217;d better pick a different example.\n \n \nI think you do misunderstand where I allow the government to lie to us. In Vietnam the war was far, far away and there was no reason for us to be lied to. I don't wish for those types of wars to include lies because the nation is not being threatened. However, if the war was ever to come to the US I would rather the government determine what they will tell us than have the government tell us every bit of information. Propaganda is what it is called and it has worked throughout the ages to benefit countries in times of war while hurting other countries. \n\n \n Well you don&#8217;t &#8220;allow&#8221; the government to lie to us, they just do it. You can&#8217;t pick and chose when you want the government to lie and when you don&#8217;t want them to lie.\n \n \nThat is not my theory at all. If you knew that they were all going to die in 24 hours and they were having fun right now it is my theory that it is better for them to be allowed to have the fun they are having without having to hear the truth. My theory also includes that if you were to tell them the truth they would have less of a chance of victory in the game they were playing. Does my theory hold up in your mind? \n\n \n You don&#8217;t tell children fearful things because they are not mature enough to handle it. And I trust parents a million times more to have the interest of their children at heart than I do the government to have the interest of the people at heart. If they were going to die in 24 hours, there would be no game to lose as their parents would not even have them playing so your theory doesn&#8217;t hold up in my mind. On the other hand, we&#8217;re talking about the government intentionally lying to the American people when the government thanks they should.\n \n \nOnce again you misunderstand my position. I never said keep Americans in the dark. I said keep them in the dark in the time of war where we are being threatened. This would include on a very specific event instead of a very general one. We haven't really been threatened for a long time and most of the times that we were threatened we have been able to tell the truth since victory was going to be ours. If we ever have a time where victory is not as assured and the moral and productivity of our nation will be important then I'd rather the government try and help the war effort in any way they can than to simply tell the truth about everything and not question whether or not it will hurt our war efforts or not. The war would be more important to me than anything because the war would be the difference between democracy and the United States being around tomorrow or not.\n\n \n No I understand your position perfectly. But the most important time the people should know the truth is when they are threatened. That is the most critical time when a dictatorship can take root. Look at history and see when our freedoms were the most restricted and challenged. It&#8217;s always during time of war.\n \n But if you want the government to keep you in the dark during critical times, you won&#8217;t get any argument from the government. So just keep that philosophy that you need protection from the truth because you might panic if you knew the truth. And by the way, be sure and teach your children that it is okay to lie when you consider it expedient. But don&#8217;t be surprised when they lie to you to stay out of trouble on the premise that you would have panicked if they had told you the truth so they were just protecting you from yourself.", 
   {}, 
   21390, 
   null, 
   1068310020.0
  ], 
  [
   22002, 
   null, 
   "AMD4EVER", 
   "I have no idea what you are talking about and apparently you don't either. I was a junior in high school and it was on the front page of every paper in America. I just looked and the lead story in the Washington Post was \"Kennedy Orders Blockade of Cuba As Reds Build Nuclear Bases There; U.S. Will Sink Defiant Arms Ships\". The whole front page was covered with articles relating to the story. And there was no panic. People did not run in the streets and become \"overtaken by fear\" or \"begin protesting for war\". The workforce did not shut down and schools were not closed. Of course people were concerned as well they should have been, but there was no panic. So according to your own example, the truth did not cause any demoralization of the people. Maybe you'd better pick a different example.\n\n \n I'll probably get back to the rest of your reply later but this point I will make now rather than later. We were lied to in the Cuban missile crisis in that our government didn't tell us the details about how it ended and the government also did well to cover up early information about the crisis. Of course the truth got out eventually, that is the state of the US today. Not even the government is able to hide everything especially when on the scale of the Cuban missile crisis. However the way that it was handled is that the government did not announce how they were ultimately victorious in the political battle between themsevles and the Russian government. Had this been the case it would have only escalated Cold War tensions.", 
   {
    "unicode_changes_made": true
   }, 
   21960, 
   null, 
   1068340500.0
  ], 
  [
   22011, 
   null, 
   "Hank", 
   "I'll probably get back to the rest of your reply later but this point I will make now rather than later. We were lied to in the Cuban missile crisis in that our government didn't tell us the details about how it ended and the government also did well to cover up early information about the crisis. Of course the truth got out eventually, that is the state of the US today. Not even the government is able to hide everything especially when on the scale of the Cuban missile crisis. However the way that it was handled is that the government did not announce how they were ultimately victorious in the political battle between themsevles and the Russian government. Had this been the case it would have only escalated Cold War tensions.\n\n \n I perfectly understand that the government will not tell us details about international or nation negotiations. Heck the executive branch won&#8217;t even tell the legislative branch everything. But there is a big difference between not telling details and deliberately lying to the public. So exactly what did the government lie to us about during the Cuban missile crisis and how did that keep the American public from panic?", 
   {}, 
   22002, 
   null, 
   1068342720.0
  ], 
  [
   22022, 
   null, 
   "AMD4EVER", 
   "I perfectly understand that the government will not tell us details about international or nation negotiations. Heck the executive branch won't even tell the legislative branch everything. But there is a big difference between not telling details and deliberately lying to the public. So exactly what did the government lie to us about during the Cuban missile crisis and how did that keep the American public from panic?\n\n \n Do you believe that withholding information isn't lying? If the government were to deny you access to information would you think that they were acting truthfully? I'm not under the same impression that you are I guess. If the government is to not tell us anything then they are inessence not fulfilling their duty to be truthful to us and as a result are lying about what their intentions really are. Do you believe that this is not accurate?", 
   {
    "unicode_changes_made": true
   }, 
   22011, 
   null, 
   1068355680.0
  ], 
  [
   22028, 
   null, 
   "Hank", 
   "Do you believe that withholding information isn't lying? If the government were to deny you access to information would you think that they were acting truthfully? I'm not under the same impression that you are I guess. If the government is to not tell us anything then they are inessence not fulfilling their duty to be truthful to us and as a result are lying about what their intentions really are. Do you believe that this is not accurate?\n\n \n I said I understand the government does not tell us DETAILS of international negotiations. If someone tells you they went to the grocery store but doesn't tell you they bought apples, do you think they lied to you? Yes I believe that when the government withholds information that is essential for the public to understand the situation, then that is lying. But I don&#8217;t believe the government should do that. And I don&#8217;t think the American public will panic when told the truth and the Cuban missile crises that you brought up is a very good example of that.\n \n Why do you ask me questions without answering the questions I ask you?", 
   {}, 
   22022, 
   null, 
   1068366960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Should a Government lie to it's people in a case of war?", 
  "url": "http://www.4forums.com/political/government-debates/1109-should-government-lie-its-people-case-war.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 1109, 
  "discussion_files": [
   [
    "17152.html", 
    "http://www.4forums.com/political/government-debates/1109-should-government-lie-its-people-case-war-print.html"
   ], 
   [
    "17153.html", 
    "http://www.4forums.com/political/government-debates/1109-should-government-lie-its-people-case-war-3-print.html"
   ], 
   [
    "17154.html", 
    "http://www.4forums.com/political/government-debates/1109-should-government-lie-its-people-case-war-2-print.html"
   ]
  ], 
  "identifier": 1109
 }
]