[
 [
  [
   19134, 
   null, 
   "montalban", 
   "What does death mean to atheists?", 
   {
    "post_info": {
     "post_title": "Death to Atheists"
    }
   }, 
   null, 
   null, 
   1066037340.0
  ], 
  [
   19142, 
   null, 
   "AMD4EVER", 
   "What does death mean to atheists?\n\n \n To me death is the equivalent to a computer shutting down.", 
   {}, 
   19134, 
   null, 
   1066050840.0
  ], 
  [
   19146, 
   null, 
   "montalban", 
   "To me death is the equivalent to a computer shutting down.\n\n \n \n A bad anaology?\n \n Who shuts you down? Can you be re-started?", 
   {}, 
   19142, 
   null, 
   1066051500.0
  ], 
  [
   19150, 
   null, 
   "AMD4EVER", 
   "A bad anaology?\n \n Who shuts you down? Can you be re-started?\n\n \n Your brain shuts down if the power is cut or it is damaged. You can be re-started but only for a short period of time before your volatile systems are destroyed.\n \n But you are picking at things that don't relate to the original question. You want to know what death is. Death doesn't involve coming back to life or determining why you died. It just involves the process of no longer existing.", 
   {}, 
   19146, 
   null, 
   1066051980.0
  ], 
  [
   19153, 
   null, 
   "montalban", 
   "Your brain shuts down if the power is cut or it is damaged. You can be re-started but only for a short period of time before your volatile systems are destroyed.\n \n But you are picking at things that don't relate to the original question. You want to know what death is. Death doesn't involve coming back to life or determining why you died. It just involves the process of no longer existing.\n\n \n I'm just dishing out to you what you did to me on another post... re: poor analogy. At this time of night I'm a small-minded and petty person.\n emoticon_zzzz \n Good night", 
   {}, 
   19150, 
   null, 
   1066052220.0
  ], 
  [
   19155, 
   null, 
   "AMD4EVER", 
   "I'm just dishing out to you what you did to me on another post... re: poor analogy. At this time of night I'm a small-minded and petty person.\n emoticon_zzzz \n Good night\n\n \n I didn't tell you that you made a poor analogy for no reason or to attack you. I only did it because I believed it was a poor analogy and I gave reasons and examples of why and how it was a poor analogy.\n \n Anyways, did I present the response you were looking for in my last post?", 
   {}, 
   19153, 
   null, 
   1066054140.0
  ], 
  [
   19172, 
   null, 
   "Crim", 
   "Depends on the atheist.\n To me, death means you essentially cease to exist.", 
   {}, 
   19155, 
   null, 
   1066065480.0
  ], 
  [
   19179, 
   null, 
   "gilligan8503", 
   "when our organs of communication shut down and no longer allow us to associate and apply ourselves to the outside world (i.e. eyes, ears, vocal cords, etc.). i consider a \"vegetable\" dead. just because the body is self-sufficiant, doesn't mean the actual person is still there. it is only the memory.\n \n literally and specifically, without brainwaves. without the latter, nothing else is functionable.", 
   {}, 
   19172, 
   null, 
   1066068420.0
  ], 
  [
   19193, 
   null, 
   "SilentPoet", 
   "Death - End of life. End of existance.\n \n You cease to hear, think, move, speak, etc....\n You are no longer.", 
   {}, 
   19179, 
   null, 
   1066088880.0
  ], 
  [
   19233, 
   null, 
   "montalban", 
   "So, when are you dead?\n \n What do you think of people who have had experiences of things after being brought back from the dead?", 
   {}, 
   19193, 
   null, 
   1066123740.0
  ], 
  [
   19320, 
   null, 
   "SilentPoet", 
   "So, when are you dead?\n \n \n I don't understand your question.\n \n \nWhat do you think of people who have had experiences of things after being brought back from the dead?\n\n \n Please provide atleast three examples and sources for these \"experiences\".", 
   {}, 
   19233, 
   null, 
   1066179360.0
  ], 
  [
   19324, 
   null, 
   "epaphras_faith", 
   "I don't understand your question.\n \n \n \n Please provide atleast three examples and sources for these \"experiences\".\n\n \n I think he is making a general statement about the \"after death\" or \"near death\" experiences.\n \n Likewise I think he is asking for you or others to define when actual death occurs.\n \n Montalban:\n \n You asked for info from atheists. Do you want my input?", 
   {}, 
   19320, 
   null, 
   1066179780.0
  ], 
  [
   19328, 
   null, 
   "Crim", 
   "So, when are you dead?\n \n \n I believe it's at most a couple minutes after your brain stops receiving oxygen.\n \n \nWhat do you think of people who have had experiences of things after being brought back from the dead?\n \n \n NDE's can be reproduced, so to speak, with natural causes too little o2 or too much co2 in the brain.", 
   {}, 
   19324, 
   null, 
   1066180140.0
  ], 
  [
   19336, 
   null, 
   "epaphras_faith", 
   "I believe it's at most a couple minutes after your brain stops receiving oxygen.\n \n \n \n NDE's can be reproduced, so to speak, with natural causes too little o2 or too much co2 in the brain.\n\n \n Crim your posts are always to the point. I have a question for you. How do you feel about ceasing to exist? What does that mean as far as what you can or cannot do while you live? If you will cease to exist then there seems little point to me to continue for only about 70 years or so.", 
   {}, 
   19328, 
   null, 
   1066181280.0
  ], 
  [
   19342, 
   null, 
   "Crim", 
   "How do you feel about ceasing to exist?\n \n \n Well I'm not thrilled about it. \n \n \nIf you will cease to exist then there seems little point to me to continue for only about 70 years or so.\n \n \n If you only get 70 years, those are some really damn important 70 years. You gotta squeeze as much livin into them as you can. And after you're dead, the consequences of your actions live on through your family, friends, coworkers, etc.", 
   {}, 
   19336, 
   null, 
   1066182660.0
  ], 
  [
   19355, 
   null, 
   "SilentPoet", 
   "Epaphras_faith,\n \n \nI think he is making a general statement about the \"after death\" or \"near death\" experiences.\n \n \n I'd still enjoy some specific examples so we can both agree on specifically what we are talking about.\n \n \nLikewise I think he is asking for you or others to define when actual death occurs.\n\n \n When your organs stop moving, brain stops functioning and you have lost all forms of conciousness. \n \n Crim,\n \n \nIf you only get 70 years, those are some really damn important 70 years. You gotta squeeze as much livin into them as you can. And after you're dead, the consequences of your actions live on through your family, friends, coworkers, etc.\n \n \n I'm pretty sure that as an atheist you don't beleive in absolute morals or values. On that basis I'd like to ask you: What does it really matter what you do during those 70 years? Why should you attempt to live life to the fullest if its all not to matter anyways?", 
   {}, 
   19342, 
   null, 
   1066187100.0
  ], 
  [
   19361, 
   null, 
   "AMD4EVER", 
   "I'm pretty sure that as an atheist you don't beleive in absolute morals or values. On that basis I'd like to ask you: What does it really matter what you do during those 70 years? Why should you attempt to live life to the fullest if its all not to matter anyways?\n\n \n I really, really liked his explaination. He basically stated that he feels it is important to live the life he was given so that he can make his mark on the others who will carry on after he is gone. He expresses how his life will carry on even after he is dead. So regardless as to whether there is an afterlife he will live on through the people left behind.\n \n \n Personally I want to live my 70 years because I have a very strong interest in many things in this world such as this debate forum. If I am enjoying this moment why should I consider whether it is important that I am having it or not? Does there have to be a God in order for me to enjoy this life?", 
   {}, 
   19355, 
   null, 
   1066188300.0
  ], 
  [
   19398, 
   null, 
   "montalban", 
   "I think he is making a general statement about the \"after death\" or \"near death\" experiences.\n \n Likewise I think he is asking for you or others to define when actual death occurs.\n \n Montalban:\n \n You asked for info from atheists. Do you want my input?\n\n \n You've hit the nail on the head. I don't mind your input. I didn't mean to suggest this is just for atheists.\n \n These people who made statements before yours talk about being dead as final... but I'd like to know when that finality comes about... otherwise, if I bring forth a case of near-death/post-death revival, they could say \"That person was never really, 'really dead'.", 
   {}, 
   19324, 
   null, 
   1066212420.0
  ], 
  [
   19443, 
   null, 
   "epaphras_faith", 
   "Well I'm not thrilled about it. \n \n \n \n If you only get 70 years, those are some really damn important 70 years. You gotta squeeze as much livin into them as you can. And after you're dead, the consequences of your actions live on through your family, friends, coworkers, etc.\n\n \n If you are not thrilled about it, one would think you would want to believe in an afterlife. Do you at all? is it just that it does not make scientific sense? Is it just that you don't like the pictures of the afterlife that others have represented? What is it that makes you not believe in an afterlife. I heard on person say \"The fact the we create is evidence of a creator.\"", 
   {}, 
   19342, 
   null, 
   1066255980.0
  ], 
  [
   19491, 
   null, 
   "AMD4EVER", 
   "If you are not thrilled about it, one would think you would want to believe in an afterlife. Do you at all? is it just that it does not make scientific sense? Is it just that you don't like the pictures of the afterlife that others have represented? What is it that makes you not believe in an afterlife. I heard on person say \"The fact the we create is evidence of a creator.\"\n\n \n I would debate that the fact that we create because we want to believe is evidence that what we believe in is only what we want to see and not necessarily what is true. Your paragraph makes this point.", 
   {}, 
   19443, 
   null, 
   1066274100.0
  ], 
  [
   19565, 
   null, 
   "epaphras_faith", 
   "I would debate that the fact that we create because we want to believe is evidence that what we believe in is only what we want to see and not necessarily what is true. Your paragraph makes this point.\n\n \n I don't follow.", 
   {}, 
   19491, 
   null, 
   1066327560.0
  ], 
  [
   19578, 
   null, 
   "AMD4EVER", 
   "I don't follow.\n\n \n You stated \"one would think you would want to believe in an afterlife.\" Then you began proding him with questions about why he doesn't believe in the afterlife. This indicates that you were asking him why he doesn't believe in the afterlife even though it sounds like he would want to believe in it. You are basically saying here that if you want it to be true then why not just act like it is true. That is part one.\n \n Part two is this quote \"The fact the we create is evidence of a creator.\" In addition to the first point that you had made about wanting to have an afterlife and therefore creating a belief that there is one I assumed you were of the belief that this phenomenon was evidence of a creator. I in turn wanted to debate that our willingness to believe in something because we want to believe in it is evidence that we believe in what we want to believe in rather than what should be believed in.\n \n This is why I made my statement about belief being more about what we want to see than what we do see as well as my point that your paragraph shows a case of this happening.\n \n I actually think you did make a good point in your post without trying to when you stated \"If you are not thrilled about it, one would think you would want to believe in an afterlife\". It shows how a common way of thinking will get you to the point where you believe in something more because you want to believe in it. I doubt that this is what you were trying to state but it struck me as an interesting point anyways so I thought I would point it out.", 
   {}, 
   19565, 
   null, 
   1066333140.0
  ], 
  [
   19580, 
   null, 
   "epaphras_faith", 
   "You stated \"one would think you would want to believe in an afterlife.\" Then you began proding him with questions about why he doesn't believe in the afterlife. This indicates that you were asking him why he doesn't believe in the afterlife even though it sounds like he would want to believe in it. You are basically saying here that if you want it to be true then why not just act like it is true. That is part one.\n \n Part two is this quote \"The fact the we create is evidence of a creator.\" In addition to the first point that you had made about wanting to have an afterlife and therefore creating a belief that there is one I assumed you were of the belief that this phenomenon was evidence of a creator. I in turn wanted to debate that our willingness to believe in something because we want to believe in it is evidence that we believe in what we want to believe in rather than what should be believed in.\n \n This is why I made my statement about belief being more about what we want to see than what we do see as well as my point that your paragraph shows a case of this happening.\n \n I actually think you did make a good point in your post without trying to when you stated \"If you are not thrilled about it, one would think you would want to believe in an afterlife\". It shows how a common way of thinking will get you to the point where you believe in something more because you want to believe in it. I doubt that this is what you were trying to state but it struck me as an interesting point anyways so I thought I would point it out.\n\n \n Thank you for the clarification. Actually, I am trying to make the point that wanting to believe in the afterlife is a necessary and important construction of the human. It is the way we are made. We all have a desire to be a part of something larger than ourselves. Crim's response points to this quite clearly when he points out that he believes he goes on in the lives of the people he has touched (not an exact quote but a reasonable paraphrase).\n \n I have even heard you point out that you want to believe in a God but just can't. The question is why do you want to? What does that say about your nature? This is where I am going.", 
   {}, 
   19578, 
   null, 
   1066333560.0
  ], 
  [
   19590, 
   null, 
   "AMD4EVER", 
   "Thank you for the clarification. Actually, I am trying to make the point that wanting to believe in the afterlife is a necessary and important construction of the human. It is the way we are made. We all have a desire to be a part of something larger than ourselves. Crim's response points to this quite clearly when he points out that he believes he goes on in the lives of the people he has touched (not an exact quote but a reasonable paraphrase).\n\n \n I tend to believe that our need to think about an afterlife comes from out fear of death as well as our optimism that life has meaning other than just to live our short lifespan.\n \n Crim shows that he believes we live a virtual afterlife because our lives are carried on by others after we die. He doesn't actually speak of a true afterlife.\n \n \nI have even heard you point out that you want to believe in a God but just can't. The question is why do you want to? What does that say about your nature? This is where I am going.\n\n \n The reason that I want to believe in God is the same reason that I believe he doesn't exist. My need to believe in him is similar to the needs that all the people throughout history have wanted to and have developed religions and Gods to believe in. I don't think I can state it any better than \"we create (Gods and religions) because we want to believe therefore what we believe in is only what we want to see and not necessarily what is true\". Even religious people will realize that this was true for millennia before the birth of Christ and is still true to this very day in every single religion except the one they believe in. They want to believe that they are the exception to thousands of years of mistakes and flawed ideas.\n \n I want to believe in God and therefore am willing to go as far as to create a God if one doesn't fit me. I don't think this is just the way I am but rather the way many people are and if I was charismatic enough about it I could probably get people to follow my beliefs. Eventually those beliefs could grow and be passed on through generations until those ideas become less my opinion and more a mix of opinions that are treated as facts. It is the religious life cycle and it is true in Christianity as well based on the writings of the Bible and how many peoples interpretations are in it. Sure JC was the main source but before and beyond him came tons of other sources including people who will never get named such as those who influenced, intentionally or not, the writers of the Bible. This would seem to tie into the religious life cycle to me.\n \n So why do you think Christianity must be the exception? Do you doubt that past religions were considered to be the absolute truth yet today you are positive they were not? Are you sure this cannot happen to Christianity and have it be completely legitimate and correct just as it was for the Greeks? Do you doubt that people were willing to give their lives to Gods that didn't exist in the past? This has to be happening daily right now so are you sure that the Muslims have to be wrong and Christianity must be right? Do you doubt that under different circumstances that you would have latched onto a different religion and believed in it just as strongly if Christianity wasn't presented to you?\n \n I don't doubt any of these things. History has shown that MAJOR mistakes have been made in belief in certain religions. Not only does history supporting further major mistakes happening but also human nature since, as you said, humans want to believe in a God but just don't know what one. Also dealing with needing to believe in God, if I grew up in the Middle East and was forced to believe in a certain religion or face ridicule from parents and society I don't doubt that atheism or Christianity or Judaism never would have crossed my mind. Belief in God doesn't just come from within and society will play a role in beliefs. Even the US has many society influences that push people towards Christianity and therefore make it more likely that people will believe in Christianity regardless of the reason that society does. This is another reason I know that I feel the need to believe in Christianity and I know this is a reason that others believe in it and I also know this is not a valid reason to believe in it but it will help this idea of a religion carry on based on human nature. It is absolutely stupid that humans would latch on to something like religion just based on what other people tell them but I have no doubt that this happens. The same goes for rumors as well. If you hear it enough from others you will latch onto it and therefore the rumor can become truth. I'm sure religions in the past started with these roots just as Christianity could have.\n \n There are just so many reasons that I want to believe in God therefore I cannot believe that he actually exists that I could go on forever about this. We would have to start a new thread for this and focus on them one at a time otherwise I would just end up in tangents like this one. I may as well just leave it at \"we create (Gods and religions) because we want to believe therefore what we believe in is only what we want to see and not necessarily what is true\".\n \n \n I see where you are going with your debate that our need to believe indicates that there is a God. So lets just pretend for a moment that there has to be a God. Do you have any real reason to think that our belief in there being a God means that the Christian one must be that God? Throughout the ages we have had the need for there to be a God an hundreds of them have been believed in. So just based on the fact that we need to believe in God, how does this support Christianity anymore than it supports Muslims or Buddhists or Greek Mythology?", 
   {
    "unicode_changes_made": true
   }, 
   19580, 
   null, 
   1066336200.0
  ], 
  [
   19602, 
   null, 
   "epaphras_faith", 
   "I tend to believe that our need to think about an afterlife comes from out fear of death as well as our optimism that life has meaning other than just to live our short lifespan.\n \n Crim shows that he believes we live a virtual afterlife because our lives are carried on by others after we die. He doesn't actually speak of a true afterlife.\n \n \n \n The reason that I want to believe in God is the same reason that I believe he doesn't exist. My need to believe in him is similar to the needs that all the people throughout history have wanted to and have developed religions and Gods to believe in. I don't think I can state it any better than \"we create (Gods and religions) because we want to believe therefore what we believe in is only what we want to see and not necessarily what is true\". Even religious people will realize that this was true for millennia before the birth of Christ and is still true to this very day in every single religion except the one they believe in. They want to believe that they are the exception to thousands of years of mistakes and flawed ideas.\n \n I want to believe in God and therefore am willing to go as far as to create a God if one doesn't fit me. I don't think this is just the way I am but rather the way many people are and if I was charismatic enough about it I could probably get people to follow my beliefs. Eventually those beliefs could grow and be passed on through generations until those ideas become less my opinion and more a mix of opinions that are treated as facts. It is the religious life cycle and it is true in Christianity as well based on the writings of the Bible and how many peoples interpretations are in it. Sure JC was the main source but before and beyond him came tons of other sources including people who will never get named such as those who influenced, intentionally or not, the writers of the Bible. This would seem to tie into the religious life cycle to me.\n \n So why do you think Christianity must be the exception? Do you doubt that past religions were considered to be the absolute truth yet today you are positive they were not? Are you sure this cannot happen to Christianity and have it be completely legitimate and correct just as it was for the Greeks? Do you doubt that people were willing to give their lives to Gods that didn't exist in the past? This has to be happening daily right now so are you sure that the Muslims have to be wrong and Christianity must be right? Do you doubt that under different circumstances that you would have latched onto a different religion and believed in it just as strongly if Christianity wasn't presented to you?\n \n I don't doubt any of these things. History has shown that MAJOR mistakes have been made in belief in certain religions. Not only does history supporting further major mistakes happening but also human nature since, as you said, humans want to believe in a God but just don't know what one. Also dealing with needing to believe in God, if I grew up in the Middle East and was forced to believe in a certain religion or face ridicule from parents and society I don't doubt that atheism or Christianity or Judaism never would have crossed my mind. Belief in God doesn't just come from within and society will play a role in beliefs. Even the US has many society influences that push people towards Christianity and therefore make it more likely that people will believe in Christianity regardless of the reason that society does. This is another reason I know that I feel the need to believe in Christianity and I know this is a reason that others believe in it and I also know this is not a valid reason to believe in it but it will help this idea of a religion carry on based on human nature. It is absolutely stupid that humans would latch on to something like religion just based on what other people tell them but I have no doubt that this happens. The same goes for rumors as well. If you hear it enough from others you will latch onto it and therefore the rumor can become truth. I'm sure religions in the past started with these roots just as Christianity could have.\n \n There are just so many reasons that I want to believe in God therefore I cannot believe that he actually exists that I could go on forever about this. We would have to start a new thread for this and focus on them one at a time otherwise I would just end up in tangents like this one. I may as well just leave it at \"we create (Gods and religions) because we want to believe therefore what we believe in is only what we want to see and not necessarily what is true\".\n \n \n I see where you are going with your debate that our need to believe indicates that there is a God. So lets just pretend for a moment that there has to be a God. Do you have any real reason to think that our belief in there being a God means that the Christian one must be that God? Throughout the ages we have had the need for there to be a God an hundreds of them have been believed in. So just based on the fact that we need to believe in God, how does this support Christianity anymore than it supports Muslims or Buddhists or Greek Mythology?\n\n \n An honest and thoughtful answer. Thank you. I don't think it means that the christian God is THE GOD. I am not trying to get there just yet. I think the first step for people is simply to believe that they are not God and then the second step is that there is a God that is outside of them. After that, we can get into who God is. This is actually well reflected in twelve step programs. \n \n I personally, do believe the Christian God is THE GOD and Jesus is the son of God and our savior. I can give you personal answers on why Jesus over others, but I don't think I can give you an answer to prove it to you. (you and I have been down this path before I think). I can tell you I have tried others and this one is what really works. The argument then becomes.....\"well, it works for you.\" I believe truth is truth. I do not believe in a relative truth. That makes it non truth and rather opinion. The Christian religion is much the same as many others claiming an afterlife and methods to get there. The only difference that I see, is that all of the others declare that the power to get there lies within the person. The Christian religion says that the power does not lie within you or I but within God. However, he is willing to give us what we need to transform our lives and he evidenced that by the birth, life, death, and ressurection of His son.\n \n Crim:\n \n I am hoping you will still attempt to answer my questions.", 
   {
    "unicode_changes_made": true
   }, 
   19590, 
   null, 
   1066342080.0
  ], 
  [
   20458, 
   null, 
   "gilligan8503", 
   "i applaud you amd4ever for you thorough explaination. you hit the nail right on the head. you said what we've all been saying in sporatic, sepatated and random posts.\n \n top drawer! :)", 
   {}, 
   19602, 
   null, 
   1067038260.0
  ], 
  [
   20466, 
   null, 
   "SilentPoet", 
   "AMD,\n \n \nPersonally I want to live my 70 years because I have a very strong interest in many things in this world such as this debate forum. If I am enjoying this moment why should I consider whether it is important that I am having it or not? Does there have to be a God in order for me to enjoy this life?\n\n \n My point being:\n If you don't beleive in God why would you place any kind of value on anything?", 
   {}, 
   20458, 
   null, 
   1067042100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Death to Atheists", 
  "url": "http://www.4forums.com/political/religion-debates/1111-death-atheists.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1111, 
  "discussion_files": [
   [
    "13621.html", 
    "http://www.4forums.com/political/religion-debates/1111-death-atheists-print.html"
   ], 
   [
    "13622.html", 
    "http://www.4forums.com/political/religion-debates/1111-death-atheists-2-print.html"
   ]
  ], 
  "identifier": 1111
 }
]