[
 [
  [
   19194, 
   null, 
   "rapture", 
   "My prediction of the next Pope.....Lucifer himself( Anti-Christ) and listed below are just 2 reasons for my prediction, nevertheless, the former Pope is fading fast and soon another will take the throne- I'm sure you have some predictions of your own\n \n Isaiah 14: 12\n \n How art thou fallen from heaven ,O Lucifer, son of the morning! how art thou cut down to the ground , which didst walk- weaken the nations!\n \n For thou has said in thine heart, I will ascend into heaven, I willl exalt my throne above the stars of God. I willl sit also upon the mount of the congregation, in the sides of the north:\n \n I will ascend above the heights of the clouds: I will be like the most High\n \n Luke 10:18\n \n And he said unto them I beheld Satan as lighting falling from heaven(Christ speaking)\n \n \n  Here is wisdom. Let him that hath understanding count the number of the beast: for it is the number of a man; and his number is Six hundred threescore and six( Rev 13:18-KJV)\n \n \n What are the Latin words over the throne of the Pope? How do they add up to 666 and what do they mean?\n \n Use roman numerals.. ( X for 10, V for 5.... ..)\n \n VICARIVS FILII DEI\n \n 5+1+100+1+5 + 1+50+1+1 500+1 =  666\n \n \n The Latin words VICARIVIS FILII DEI means\" Instead of the Son Of God\"", 
   {
    "post_info": {
     "post_title": "The Next Pope(Anti-Christ)"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1066090020.0
  ], 
  [
   19195, 
   null, 
   "Chobo Char", 
   "Oh wow. Lol.\n \n I can already hear montalban coming this way...\n and he has a board with a nail in it.", 
   {}, 
   19194, 
   null, 
   1066090380.0
  ], 
  [
   19198, 
   null, 
   "rapture", 
   "Oh wow. Lol.\n \n I can already hear montalban coming this way...\n and he has a board with a nail in it.\n\n \n \n No predictions?", 
   {}, 
   19195, 
   null, 
   1066090560.0
  ], 
  [
   19199, 
   null, 
   "Chobo Char", 
   "No predictions?\n\n That WAS my prediction lol. \n \n \n Seriously though, \"VICARIUS FILII DEI\" means Vicar of the Son of God. Not \"Instead of the Son of God\".", 
   {}, 
   19198, 
   null, 
   1066090860.0
  ], 
  [
   19201, 
   null, 
   "sundowner", 
   "My prediction is:\n \n I see you on a leather couch....trying to explain to professionals that you really are not insane, just full of the holy spirit. \n \n I think you are full of something...", 
   {}, 
   19199, 
   null, 
   1066091520.0
  ], 
  [
   19204, 
   null, 
   "SilentPoet", 
   "My prediction of the next Pope\n \n \n I do think its interesting that for the longest time generations have thought that the end is near.\n \n Why the next pope?\n Why not 3 popes from now?\n Why not 200?", 
   {}, 
   19201, 
   null, 
   1066092540.0
  ], 
  [
   19206, 
   null, 
   "epaphras_faith", 
   "My prediction of the next Pope.....Lucifer himself( Anti-Christ) and listed below are just 2 reasons for my prediction, nevertheless, the former Pope is fading fast and soon another will take the throne- I'm sure you have some predictions of your own\n \n Isaiah 14: 12\n \n How art thou fallen from heaven ,O Lucifer, son of the morning! how art thou cut down to the ground , which didst walk- weaken the nations!\n \n For thou has said in thine heart, I will ascend into heaven, I willl exalt my throne above the stars of God. I willl sit also upon the mount of the congregation, in the sides of the north:\n \n I will ascend above the heights of the clouds: I will be like the most High\n \n Luke 10:18\n \n And he said unto them I beheld Satan as lighting falling from heaven(Christ speaking)\n \n \n  Here is wisdom. Let him that hath understanding count the number of the beast: for it is the number of a man; and his number is Six hundred threescore and six( Rev 13:18-KJV)\n \n \n What are the Latin words over the throne of the Pope? How do they add up to 666 and what do they mean?\n \n Use roman numerals.. ( X for 10, V for 5.... ..)\n \n VICARIVIS FILII DEI\n \n 5+1+100+1+5 + 1+50+1+1 500+1 =  666\n \n \n The Latin words VICARIVIS FILII DEI means\" Instead of the Son Of God\"\n\n \n Actually 5+1+100+1+5+1 for VICARIVIS. You left out an I (aka a 1) This adds up to 667. Does that mean the next pope will be Ferris Beuhler?", 
   {
    "unicode_changes_made": true
   }, 
   19194, 
   null, 
   1066093140.0
  ], 
  [
   19217, 
   null, 
   "maximus", 
   "And fundamentalists accuse Catholics of \"inventing\" things that are not found in scripture? \n \n By the way, Chobo, FYI, Montalban does not adhere to the Pope as he is Orthodox and not Catholic.", 
   {}, 
   19206, 
   null, 
   1066103700.0
  ], 
  [
   19223, 
   null, 
   "Parcum", 
   "Rapture, you're very funny. On top of that, you're making up complete Jack Chick lies.\n \n Firstly, I have studied Latin, and VICARIVIS FILII DEI does not mean instead of the son of God. \"Instead\" in Latin, is \"Pro\". So if it meant \"Instead of the Son of God\", it would say \"Pro Filii Dei\", not \"Vicarivis Filii Dei\", which means \"Vicar of the Son of God\". \n \n Secondly, although \"VICARIVIS FILI DEI\" does indeed add up to 666, \"VICARIUS FILI DEI\" doesn't. Further, last time I checked, the last book of the bible was written in Greek, not Latin. The \"beast\" would be displayed in Greek, not Latin. There is a meaning of the V \"VICARIUS FILI DEI\" in Greek, but it's not even close to your argument. The \"Number of the beast\" came from Nero Caesar, which in Greek is nrwn qsr. In Greek, his name adds up to 666. In Latin, however, his name adds up to 616, which is the alternative \"beast\" number. When they translated the bible into Latin, the Latin translators thought that 666 was an error, and that 616 was the real one. So we see the GREEK manuscripts saying \"666\", and the later Latin ones with \"616\". Hence, the beast was Nero Caesar, not the pope. \n \n And actually, Martin Luther's own NAME in Latin translates to \"666\". But of course, he isn't the anti-Christ, is he?\n \n \"I will ascend above the heights of the clouds: I will be like the most High\"\n \n I don't understand your point- what does this have to be? The Pope is not like the most High, nor does he admit to be. Sure, he's the Vicar of Christ, but not nearly high as the Lord is. \n \n Do I think the next pope will be Lucifer? No. However, there probably will be a person who claims to be the Pope who will be the anti-Christ. He wont be the real pope, but he'll claim to be. Why? Because Lucifer wants to attack the truth. If the Catholic Church is evil, then Satan wouldn't bother with it- we're already going to hell, right? He wants to attack something that is closest to God. That is why he wants to attack the Church.", 
   {
    "unicode_changes_made": true
   }, 
   19217, 
   null, 
   1066112940.0
  ], 
  [
   19224, 
   null, 
   "Parcum", 
   "Montabaln is Orthodox? I would love to have a discussion with this person!", 
   {}, 
   19223, 
   null, 
   1066113000.0
  ], 
  [
   19236, 
   null, 
   "montalban", 
   "Actually 5+1+100+1+5+1 for VICARIVIS. You left out an I (aka a 1) This adds up to 667. Does that mean the next pope will be Ferris Beuhler?\n\n \n I recall...\n \n Ronald Winston Reagan\n \n 6 6 6\n \n Numbers can mean anything.", 
   {}, 
   19206, 
   null, 
   1066125120.0
  ], 
  [
   19237, 
   null, 
   "montalban", 
   "Oh wow. Lol.\n \n I can already hear montalban coming this way...\n and he has a board with a nail in it.\n\n \n Do you know anything about Orthodoxy? I mean, anything at all?\n \n I am an Orthodox Christian... not a good one, granted, but I'm not pro-Pope. I'm not anti-Pope either, not to the point where I'll take any verse from the bible to twist it into something.", 
   {}, 
   19195, 
   null, 
   1066125540.0
  ], 
  [
   19238, 
   null, 
   "montalban", 
   "My prediction of the next Pope.....Lucifer himself( Anti-Christ) and listed below are just 2 reasons for my prediction, nevertheless, the former Pope is fading fast and soon another will take the throne- I'm sure you have some predictions of your own\n \n blah blah\n \n\n \n You have, in an instant, demonstrated the major fault with Protestant Christianity. You can take verses out of context and make them mean anything. This is in fact not having any respect for the Word of God.\n \n \n I posted this on another thread... obviously you missed it. It demonstrates other people taking Bible verses out of context. Even to the point where you can have two diametrically opposed view-points.\n \n If you base your beliefs on the Bible alone, you can end up anywhere...\n My own favourite period of history, the British Isles in the 1600s is full of Biblical prophecy groups; Adamites, (Antimonians), Anabaptists, Baptists, Behmenists, Brownists, Diggers, Fifth Monarchists, Grindletonians, Jacobites, Levellers, Muggletonians, Puritans, Quakers, Ranters, Sabbatarians, Seekers, and Socinians.\n The Fifth Monarchist believe that the Kingdom of God was at hand; that the King, Charles Stuart was the anti-Christ. They believed it was therefore justifiable to rise up against him.*\n \"On January 6, 1661, an event occurred that threatened to overwhelm whatever friendship King Charles harboured toward these sectarian subjects of his. A London congregation of Fifth Monarchists, a Baptist-derived group of millenarians who held that Jesus intended to return physically to sit upon England?s throne, staged an abortive uprising under the slogan, \"King Jesus.\" Although occupying St. Paul?s cathedral for a brief time, they were quickly subdued; fourteen, including their leader, were executed, their heads stuck up on London Bridge as grisly warnings to others with similar ideas\"\n http://www.kimopress.com/Ingle-02.htm\n \"The \"Fifth Monarchy\" or the \"Fifth Kingdom\" is a biblical reference. The reference is based of the Old Testament (Daniel 2: 44) of a prophesy in a dream by King Nebuchadnezzar. He envisioned five kingdoms in history, and the last, or Fifth Kingdom would usher in a new kingdom on earth. Millenarianism was a popular message of the Interregnum (1649-1660). \"The godly being in league with God ...\" (1626) wrote Thomas Gataker.\n Works such as Henry Archer's: The Personal Reign of Christ upon Earth (1642) became a popular work during the period on the Millennium. It foretold the conversions of the Jews (1650) and the destruction of the Turks, and foretold the second coming of Christ (1700). The Civil War itself became a vehicle of new religious fervour. The execution of Charles I (1649) became a rallying point as a sign from God ushering in His New Kingdom to many.\"\n http://www.exlibris.org/nonconform/...onarchists.html\n *Oddly enough, Charles' father James I was able to argue from the Bible in favour of Monarchy! Thus you can have diametrically opposed beliefs, based on the Bible.\n \"The state of monarchy is the supremest thing on earth. For kings are not only God's lieutenants upon earth, and sit upon God's throne, but even by God himself they are called gods...\"\n King James Stuart in \"A Speech to the Lords and Commons of the Parliament at White-Hall\" (1610) - this is the same King James who gave us the King James Bible.\n See also \"An Homily against Disobedience and Wylful Rebellion\" (1570)", 
   {}, 
   19237, 
   null, 
   1066125660.0
  ], 
  [
   19265, 
   null, 
   "epaphras_faith", 
   "You have, in an instant, demonstrated the major fault with Protestant Christianity. You can take verses out of context and make them mean anything. This is in fact not having any respect for the Word of God.\n \n \n I posted this on another thread... obviously you missed it. It demonstrates other people taking Bible verses out of context. Even to the point where you can have two diametrically opposed view-points.\n \n If you base your beliefs on the Bible alone, you can end up anywhere...\n My own favourite period of history, the British Isles in the 1600s is full of Biblical prophecy groups; Adamites, (Antimonians), Anabaptists, Baptists, Behmenists, Brownists, Diggers, Fifth Monarchists, Grindletonians, Jacobites, Levellers, Muggletonians, Puritans, Quakers, Ranters, Sabbatarians, Seekers, and Socinians.\n The Fifth Monarchist believe that the Kingdom of God was at hand; that the King, Charles Stuart was the anti-Christ. They believed it was therefore justifiable to rise up against him.*\n \"On January 6, 1661, an event occurred that threatened to overwhelm whatever friendship King Charles harboured toward these sectarian subjects of his. A London congregation of Fifth Monarchists, a Baptist-derived group of millenarians who held that Jesus intended to return physically to sit upon England?s throne, staged an abortive uprising under the slogan, \"King Jesus.\" Although occupying St. Paul?s cathedral for a brief time, they were quickly subdued; fourteen, including their leader, were executed, their heads stuck up on London Bridge as grisly warnings to others with similar ideas\"\n http://www.kimopress.com/Ingle-02.htm\n \"The \"Fifth Monarchy\" or the \"Fifth Kingdom\" is a biblical reference. The reference is based of the Old Testament (Daniel 2: 44) of a prophesy in a dream by King Nebuchadnezzar. He envisioned five kingdoms in history, and the last, or Fifth Kingdom would usher in a new kingdom on earth. Millenarianism was a popular message of the Interregnum (1649-1660). \"The godly being in league with God ...\" (1626) wrote Thomas Gataker.\n Works such as Henry Archer's: The Personal Reign of Christ upon Earth (1642) became a popular work during the period on the Millennium. It foretold the conversions of the Jews (1650) and the destruction of the Turks, and foretold the second coming of Christ (1700). The Civil War itself became a vehicle of new religious fervour. The execution of Charles I (1649) became a rallying point as a sign from God ushering in His New Kingdom to many.\"\n http://www.exlibris.org/nonconform/...onarchists.html\n *Oddly enough, Charles' father James I was able to argue from the Bible in favour of Monarchy! Thus you can have diametrically opposed beliefs, based on the Bible.\n \"The state of monarchy is the supremest thing on earth. For kings are not only God's lieutenants upon earth, and sit upon God's throne, but even by God himself they are called gods...\"\n King James Stuart in \"A Speech to the Lords and Commons of the Parliament at White-Hall\" (1610) - this is the same King James who gave us the King James Bible.\n See also \"An Homily against Disobedience and Wylful Rebellion\" (1570)\n\n \n Your first paragraph is amazingly prejudicial. Protestants do not take anything out of context anymore than do catholics or orthodox or any other christian. \n \n I do not take things out of context. I have studied hermaneutics and understand the correct methods for understanding scripture. It irks me no end that you lump rapture's ramblings in with all protestants. Grow Up!!!!!!!!!!!!!!!!!!! Just because there is one foolish individual DO NOT make us all out to be that way!!!!!!!!!!!!", 
   {}, 
   19238, 
   null, 
   1066156080.0
  ], 
  [
   19274, 
   null, 
   "Parcum", 
   "\n Your first paragraph is amazingly prejudicial. Protestants do not take anything out of context anymore than do catholics or orthodox or any other christian. \n\n \n I don't mean to be rude or prejeduce, but I find it humorous that many protestants claim to know the bible better than both the Catholic and Orthodox Churches. These two Churches who actually within them have many seperate Rites and Churches (some who were cloistered from Christianity for hundrds of years) have read the bible for two thousand years and completely understand it. We have been there, done that. WE have debated the arguments today. The explainations are in the Church, you simply have to find it.\n \n Has anyone heard of the St. Thomas Christian, aka the Syro-Malabar Catholic Church? In 52 AD Saint Thomas the Apostle went to Malabar, India, to preach. He converted many to Christianity, and many were persecuted. St. Thomas himself was persecuted in Southeast India. But the Christians there, who became known as the St. Thomas Christians, went on. They had some communication with the Nestorians, but really kept their traditions. They seemed so different from the EUropean CHurches and Rites, but were actually one in the same. They were so different that when the Portuguese came to India, they thought the Malabar Christians were heretics and immediately persecuted them, putting them under romanization. Nonetheless, they fought for their traditions, and even to this day - although seemingly very different- have successfully preserved the original teachings of Saint Thomas the Apostle (and ultimately of CHrist) in the most purest mannar. They believe in most of everything that the Orthodox and Catholics believe, with a few exceptions, but none heretical. Quite interesting.", 
   {}, 
   19265, 
   null, 
   1066159740.0
  ], 
  [
   19277, 
   null, 
   "epaphras_faith", 
   "I don't mean to be rude or prejeduce, but I find it humorous that many protestants claim to know the bible better than both the Catholic and Orthodox Churches. These two Churches who actually within them have many seperate Rites and Churches (some who were cloistered from Christianity for hundrds of years) have read the bible for two thousand years and completely understand it. We have been there, done that. WE have debated the arguments today. The explainations are in the Church, you simply have to find it.\n \n Has anyone heard of the St. Thomas Christian, aka the Syro-Malabar Catholic Church? In 52 AD Saint Thomas the Apostle went to Malabar, India, to preach. He converted many to Christianity, and many were persecuted. St. Thomas himself was persecuted in Southeast India. But the Christians there, who became known as the St. Thomas Christians, went on. They had some communication with the Nestorians, but really kept their traditions. They seemed so different from the EUropean CHurches and Rites, but were actually one in the same. They were so different that when the Portuguese came to India, they thought the Malabar Christians were heretics and immediately persecuted them, putting them under romanization. Nonetheless, they fought for their traditions, and even to this day - although seemingly very different- have successfully preserved the original teachings of Saint Thomas the Apostle (and ultimately of CHrist) in the most purest mannar. They believe in most of everything that the Orthodox and Catholics believe, with a few exceptions, but none heretical. Quite interesting.\n\n \n One would almost have to completely ignore the reformation and the counter reformation to make a statement that the catholic church is always right. Which is what you say. I simply was complaining of the overgenralization made about protestants. Have you studied hermaneutics? How many catholic church goers do you know that have. I know of none. zip, nada, zilch. And I would easily say that I know over two hundred people who are caatholic and go to church regularly.\n \n As for protestants, I know of many many who have had teaching on proper hermaneutics.\n \n Do not lump all protestants together. Especially do not lump me with \"rapture\". I have yet to agree with anything that rapture says. To lunp all together is the definition of Prejudice.", 
   {}, 
   19274, 
   null, 
   1066162920.0
  ], 
  [
   19279, 
   null, 
   "Parcum", 
   " Have you studied hermaneutics? How many catholic church goers do you know that have. I know of none. zip, nada, zilch. And I would easily say that I know over two hundred people who are caatholic and go to church regularly.\n\n \n What, biblical study/interpretation? Of course I have. How many Church goes do I know who have studied it? I can think of a few, actually hundreds. But simply because I don't know many people doesn't mean my argument is invalid, and further simply because you don't know Catholics who study the bible means that they don't exist. What is important is we have clergy and theologians who study the bible. I'll be honest with you, if I read the bible on my own without any explaination, there would be no doubt my faith would be Protestantism. However, I also understand that the bible was written in Greek/Aramaic/Hebrew, not English, so I need assistance on some areas. And yet even further, although I know many Protestants, I can only think of five who study the bible, one who is in a bible college, and the other four who I met at a bible study class.", 
   {
    "unicode_changes_made": true
   }, 
   19277, 
   null, 
   1066163580.0
  ], 
  [
   19281, 
   null, 
   "maximus", 
   "One would almost have to completely ignore the reformation and the counter reformation to make a statement that the catholic church is always right. Which is what you say. \n \n\n \n Epaphras,\n The Catholic Church has never been wrong on an issue involving faith or morals. It is the Church founded by Christ and he told us that the gates of hell would not prevail against it and that he would be with it until the end of the age. The reformation was more of a rebellion of doctrine than a reformation of discipline and practice which it should have been.", 
   {}, 
   19277, 
   null, 
   1066164480.0
  ], 
  [
   19289, 
   null, 
   "epaphras_faith", 
   "Epaphras,\n The Catholic Church has never been wrong on an issue involving faith or morals. It is the Church founded by Christ and he told us that the gates of hell would not prevail against it and that he would be with it until the end of the age. The reformation was more of a rebellion of doctrine than a reformation of discipline and practice which it should have been.\n\n \n Maximus:\n \n What of the catholic churches sale of indulgences for the \"redecorating\" in rome? Was this ordained by God?\n \n We have had the argument on the founding of the church. I do not accept the founding of the pope and the cardinals etc. etc. You know that. True the reformation was a rebellion of doctrine but also an issue of morality. How could a church SELL indulgences and call that moral? This was a part of luther's protest. It was not all. \n \n There was a period where the \"layman\" was not allowed to read scripture for himself. Clearly against what Jesus taught.", 
   {}, 
   19281, 
   null, 
   1066169940.0
  ], 
  [
   19291, 
   null, 
   "Parcum", 
   "What of the catholic churches sale of indulgences for the \"redecorating\" in rome? Was this ordained by God?\n\n \n That wasn't dogmatic. It was simply something some churches did, including Saint PEter's basilica. It was wrong, yes, but not illegal in the church.\n \n \n \nWe have had the argument on the founding of the church. I do not accept the founding of the pope and the cardinals etc. etc. You know that. \n\n \n Even though the amount of evidence in support of it is overwealmly supportive of the CHurch?", 
   {}, 
   19289, 
   null, 
   1066170480.0
  ], 
  [
   19301, 
   null, 
   "epaphras_faith", 
   "That wasn't dogmatic. It was simply something some churches did, including Saint PEter's basilica. It was wrong, yes, but not illegal in the church.\n\n \n Not dogmatic?! The pope himself did this. What does it say about who he believed God to be that he thought he could sell time off in purgatory to people who gave money? Given what Montalban and others have been saying about \"church tradition\" I would think it was precisely dogmatic. YIPES!\n \n \nEven though the amount of evidence in support of it is overwealmly supportive of the CHurch?\n\n \n I have been down this debate path already with maximus and montalban and agreement was not reached among us.\n \n I will say this as a statement of belief. There is one church, one faith, one God and Father of All, there is one baptism, one life in the spirit given freely to all. Some shepherds (protestant and catholic and orthodox) have pastured themselves on their sheep. God has come out against them and scattered his people of faith.\n \n This why denominations exist. However, note, christian is christian. I do not accept the pope as my leader. Pope John Paul (the current) is and has been a godly man. I trust much that is in him. He is still flawed. He is human. He is not my leader.", 
   {}, 
   19291, 
   null, 
   1066172580.0
  ], 
  [
   19304, 
   null, 
   "Parcum", 
   " Not dogmatic?! The pope himself did this. What does it say about who he believed God to be that he thought he could sell time off in purgatory to people who gave money? Given what Montalban and others have been saying about \"church tradition\" I would think it was precisely dogmatic. YIPES!\n\n \n This is pure evidence of ignorance. Just because the pope did it, doesn't mean it's dogmatic. Pope Alexander the sixth had six children. That doesn't mean everyone has to have six children lol!\n \n \n I have been down this debate path already with maximus and montalban and agreement was not reached among us.\n\n \n I don't understand what there is to debate; it's very clear. If we look into the oldest bible ever written- the Peshitta bible- it clearly says that Peter was the foundation of the church. Even in Greek, the reason why it said \"Petra\" and \"Petros\" was because grammatically that was the only way to write it. \n \n \n I will say this as a statement of belief. There is one church, one faith, one God and Father of All, there is one baptism, one life in the spirit given freely to all. Some shepherds (protestant and catholic and orthodox) have pastured themselves on their sheep. God has come out against them and scattered his people of faith.\n\n \n That's really nice, honestly (I'm serious). I really wish this was true, but it's not. Christ founded one church with one belief, not many churches with at many times completely different interpretations. Did Christ truly want this separation in his church? Of course not. He wanted one, united, Holy, Katholik, and Apostolic Church, with everyone having the same belief. \n \n \n This why denominations exist. However, note, christian is christian. I do not accept the pope as my leader. Pope John Paul (the current) is and has been a godly man. I trust much that is in him. He is still flawed. He is human. He is not my leader.\n\n \n He is our shepherd- Christ told Peter \"Feed my sheep\". Peter was the leader of the apostles and the Christian Church on earth, the Pope is as well. Even Orthodox accept the Pope as the successor of Peter, and although they aren't obedient to him (they have patriarchs, which are basically successors of the apostles), they still respect him as the successor of Peter.", 
   {
    "unicode_changes_made": true
   }, 
   19301, 
   null, 
   1066175460.0
  ], 
  [
   19305, 
   null, 
   "epaphras_faith", 
   "This is pure evidence of ignorance. Just because the pope did it, doesn't mean it's dogmatic. Pope Alexander the sixth had six children. That doesn't mean everyone has to have six children lol!\n\n \n \n It is not ignorance. I think you show ignorance by not admitting the faults of the church. How could the pope (the leader of the catholic church) remit a persons time in purgatory. Judgement bleongs to God. This was simply one instance of a church being lead by an immoral man and having the distinction of \"infallability\". I assume that applies to doctrine and morals etc. On this I could be wrong. Your understanding of greek is incorrect. At least from my greek classes it is.\n \n Again, we have been down this debate path. There is another thread, maximus or mantalban will you point our friend there. I tire of this debate. Peter is not the leader of the church and the pope is not directly descended from peter. Come on! 12 guys decide that one of them is the next descendent of peter. Yipes. Before you declare me ignorant, I would appreciate that you check out the other posts on other threads on this issue. There are many other that I no longer wish to debate. I am done on this thread as well.\n \n I was simply reading and responding to montalban's comment about protestants based on what \"rapture\" posted. It is prejudicial. Now that you have successfully pulled me off topic I choose to go back. Do not lump all protestants into the \"crazy category\". \n \n God shall judge not I.", 
   {
    "unicode_changes_made": true
   }, 
   19304, 
   null, 
   1066175940.0
  ], 
  [
   19308, 
   null, 
   "Parcum", 
   " It is not ignorance. I think you show ignorance by not admitting the faults of the church. How could the pope (the leader of the catholic church) remit a persons time in purgatory. Judgement bleongs to God. This was simply one instance of a church being lead by an immoral man and having the distinction of \"infallability\". I assume that applies to doctrine and morals etc.\n\n \n The Pope doesn't permit man less time in purgatory; God does, through the priest. We can give ourselves a plenary indulgence if we say the magnificat and go to confession within 8 days of saying it. It's quite simple. \n \n \n . On this I could be wrong. Your understanding of greek is incorrect. At least from my greek classes it is.\n\n \n My teacher, of course, speaks Greek and Latin perfectly, and she told us \"Whether Peter is the rock or not is not the issue, the mere fact is that the sentence cannot be written in any other way via translation\". If petros and Petra meant \"Rock\" and \"Pebble\", then why do all the other bibles written around the same time, say, the Peshitta bible, say otherwise? \n \n \n Again, we have been down this debate path. There is another thread, maximus or mantalban will you point our friend there. I tire of this debate. Peter is not the leader of the church and the pope is not directly descended from peter. Come on! 12 guys decide that one of them is the next descendent of peter. Yipes. Before you declare me ignorant, I would appreciate that you check out the other posts on other threads on this issue. There are many other that I no longer wish to debate. I am done on this thread as well.\n\n \n You seem ignorant because you are dismissing my points because you say \"I've already debated this\"- that is a sure sign of weakness in a debate, and is very unprofessional! \n \n Descendent? You do mean successor, right? At any rate, all the apostles had successors. That is what Patriarchs are. Patriarchs are basically Popes. A Pope is a successor of the Apostles. It's just that the Roman Catholic Pope is the successor of Peter, who was the leader of the apostles and of the Church on Earth. Your next statement seems ambiguous, and has two different ideas. If you're talking about how the Pope is elected, there aren't twelve people who elect him, there are ninety people who elect him. IF you're talking about Jesus making one man to be the foundation of the Church on earth, how is it impossible? Abraham was chosen to be the father of generations to come. Moses was chosen out of thousands to lead the people, Joseph was chosen to lead the Hebrews in Egypt, David was chosen to be the King of the Israelites, it's happened many times throughout biblical history.", 
   {
    "unicode_changes_made": true
   }, 
   19305, 
   null, 
   1066177020.0
  ], 
  [
   19310, 
   null, 
   "epaphras_faith", 
   "You seem ignorant because you are dismissing my points because you say \"I've already debated this\"- that is a sure sign of weakness in a debate, and is very unprofessional! \n \n \n\n \n \n It is not unprofessional. I have just done it to death. I did not want to discuss it. I wanted to address montalban on his prejudicial statement. Do you have anything to say on that. Since you ignore, completely, that point, I assume you agree that it is prejudicial.\n \n As for inforamtion concerning catholocism, I admit that you do know more than I on that issue. As it should be. I am not catholic, you are. Now, that out of the way, any comments on my actual issue or are you going to continue to dodge it?", 
   {
    "unicode_changes_made": true
   }, 
   19308, 
   null, 
   1066177860.0
  ], 
  [
   19311, 
   null, 
   "epaphras_faith", 
   "By the way Parcum:\n \n Where in canonized scripture is purgatory?", 
   {}, 
   19310, 
   null, 
   1066177920.0
  ], 
  [
   19312, 
   null, 
   "Parcum", 
   " As for inforamtion concerning catholocism, I admit that you do know more than I on that issue. As it should be. I am not catholic, you are. Now, that out of the way, any comments on my actual issue or are you going to continue to dodge it?\n\n \n On the Pope being the anti-christ? I've already answered rapture, who hasn't responded to me as of yet. \n \n \n It is not unprofessional. I have just done it to death. I did not want to discuss it. I wanted to address montalban on his prejudicial statement. Do you have anything to say on that. Since you ignore, completely, that point, I assume you agree that it is prejudicial.\n\n \n I have participated in many debates, and have witnessed many professional ones, and to say \"I've already debated this with somebody you don't know\" is considered a weakness, and a red herring to the debate. You're trying to get away from the issue. \n \n What was Montalban's prejudicial statement?", 
   {
    "unicode_changes_made": true
   }, 
   19310, 
   null, 
   1066178220.0
  ], 
  [
   19314, 
   null, 
   "epaphras_faith", 
   "On the Pope being the anti-christ? I've already answered rapture, who hasn't responded to me as of yet. \n \n \n \n I have participated in many debates, and have witnessed many professional ones, and to say \"I've already debated this with somebody you don't know\" is considered a weakness, and a red herring to the debate. You're trying to get away from the issue. \n \n What was Montalban's prejudicial statement?\n\n \n quote by Montalban: You have, in an instant, demonstrated the major fault with Protestant Christianity. You can take verses out of context and make them mean anything. This is in fact not having any respect for the Word of God.\n \n He is commenting on something \"rapture\" said. I was pointing out that rapture does not represent protestant christianity. My comment was that to assume that protestants take things out of context based upon what \"rapture\" has said is ludicrous. He used other examples of people taking things out of context but that still does not represent all protestants and to say so is prejudicial by definition.\n \n As to your comment on my \"weakness\", perhaps I am weak on this issue as I am not as well educated on the catholic or orthodox positions. I simply spent a great deal of time debating it on more than one occasion. I would only prefer to leave it to another to debate.\n \n If you wish to challenge me to a debate (formally) I am happy to do that but will need some time as I am already involved in two others. I do not have that kind of time.\n \n Can we plan after November 1? you could start another thread to discuss tradition vs scripture. One of the previous threads is the \"sola scriptura\" thread. I believe Maximus started it.", 
   {
    "unicode_changes_made": true
   }, 
   19312, 
   null, 
   1066178760.0
  ], 
  [
   19316, 
   null, 
   "epaphras_faith", 
   "I too have viewed and participated in many many many debates. I am 36 and a diamond member of the national forensics league. You?", 
   {}, 
   19314, 
   null, 
   1066178940.0
  ], 
  [
   19317, 
   null, 
   "Parcum", 
   " Where in canonized scripture is purgatory?\n\n \n Everywhere! Matthew 12:32 states that sinners will not be able to go to heaven, but we are all sinners. How are we to get to heaven? Only through fire, according to 1 Corinthians 3:15, \"He will suffer loss, though he himself will be saved, but only as through fire\". What is the purpose of Purgatory? \"nothing unclean shall enter\" (Rev. 21:27) is the purest answer. \n \n Further, Orthodox Jews follow of a form of purification, which is what purgatory is. They pray the Mourner's Kaddish when somebody dies, which is a prayer that the soul will go through purification properly before entering the other world.", 
   {
    "unicode_changes_made": true
   }, 
   19312, 
   null, 
   1066179060.0
  ], 
  [
   19322, 
   null, 
   "epaphras_faith", 
   "Everywhere! Matthew 12:32 states that sinners will not be able to go to heaven, but we are all sinners. How are we to get to heaven? Only through fire, according to 1 Corinthians 3:15, \"He will suffer loss, though he himself will be saved, but only as through fire\". What is the purpose of Purgatory? \"nothing unclean shall enter\" (Rev. 21:27) is the purest answer. \n \n Further, Orthodox Jews follow of a form of purification, which is what purgatory is. They pray the Mourner's Kaddish when somebody dies, which is a prayer that the soul will go through purification properly before entering the other world.\n\n \n Rom 3:23 For all have sinned and fall short of the glory of God.\n \n Rom6:23 For the WAGES of sin is death, but the FREE GIFT of God is eternal life through Jesus Christ our Lord.\n \n Your interpretation of Matthew does not point to Purgatory. The passage you quote Jesus is speaking to the pharisees that have contradicted him. They have told him that it was that he was driving demons out by Satan. He rebukes them. He says that every sin will be forgiven except the sin of blasephemy against the spirit. He is saying to the pharisees that they are saying that God is acting as Satan. He is telling them that God will not forgive that. \n \n The conditions at that time do not exist any longer and cannot be repeated. Therefore that argument is moot. God will forgive man. Your scripture does not point at all to purgatory. You have taken it out of context. Hmmmmmmmmmm apparently protestants are not the only ones to do this.\n \n Do you have other scripture since you are so faulty here?", 
   {
    "unicode_changes_made": true
   }, 
   19317, 
   null, 
   1066179660.0
  ], 
  [
   19332, 
   null, 
   "Parcum", 
   " quote by Montalban: You have, in an instant, demonstrated the major fault with Protestant Christianity. You can take verses out of context and make them mean anything. This is in fact not having any respect for the Word of God.\n \n He is commenting on something \"rapture\" said. I was pointing out that rapture does not represent protestant christianity. My comment was that to assume that protestants take things out of context based upon what \"rapture\" has said is ludicrous. He used other examples of people taking things out of context but that still does not represent all protestants and to say so is prejudicial by definition. \n\n \n Although that is a pretty rude statement, he is somewhat correct. This is the reason why there is such a great separation amongst the Protestant groups. You ask one protestant about something, you get a completely different answer from another. Protestants make the bible mean anything. This may not be with all protestants, but generally speaking this is what ends up happening. \n \n I don't want to bother you if you're busy. When you want to debate I'm always ready. \n \n \n As to your comment on my \"weakness\", perhaps I am weak on this issue as I am not as well educated on the catholic or orthodox positions. \n\n \n No, the weakness I see is giving up because you're basically to tired of debating the issue.\n \n \n \n I too have viewed and participated in many many many debates. I am 36 and a diamond member of the national forensics league. You?\n\n \n I am 16, but don't adhere to any debate club of any sort. I am a pro-life activist and have been to debating camps. I have read books on debating. I have listened to professional debating.", 
   {
    "unicode_changes_made": true
   }, 
   19317, 
   null, 
   1066180620.0
  ], 
  [
   19334, 
   null, 
   "epaphras_faith", 
   "Although that is a pretty rude statement, he is somewhat correct. This is the reason why there is such a great separation amongst the Protestant groups. You ask one protestant about something, you get a completely different answer from another. Protestants make the bible mean anything. This may not be with all protestants, but generally speaking this is what ends up happening. \n \n I don't want to bother you if you're busy. When you want to debate I'm always ready. \n \n \n \n No, the weakness I see is giving up because you're basically to tired of debating the issue.\n \n \n \n \n I am 16, but don't adhere to any debate club of any sort. I am a pro-life activist and have been to debating camps. I have read books on debating. I have listened to professional debating.\n\n \n Perhaps protestant groups do not agree on things, many catholics do not agree, that does not mean the catholic church is terrible and it is not right for me to label the catholic (or orthodox) church based on what you or montalban say. That is prejudicial by definition and actually will not hold up in a debate. It is a logical fallacy. \n \n Have you studied the various fallacies. See the one that says you cannot go from one specific example to a generalized statement.\n \n Let us set a debate tournament in the tournament thread concerning the other issue. Write the topic any way you choose. I will then provide feedback on an agreeable topic for debate. I will start the thread in the debate tournaments and we will begin working out the details. \n \n I am not afraid of debate, just a working man who has to choose what is worth his time and what is not.", 
   {
    "unicode_changes_made": true
   }, 
   19332, 
   null, 
   1066180980.0
  ], 
  [
   19347, 
   null, 
   "Parcum", 
   "Romans also says that sanctification involves suffering, right before chapter six. \"And not only so: but we glory also in tribulation, knowing that tribulation worketh patience; And patience trial; and trial hope; And hope confoundeth not: because the charity of God is poured forth in our hearts, by the Holy Ghost who is given to us.\" (Rom. 5:3-5).\n \n The Matthew quote was one of many quotes. I can quote 2 Thessalonians 2:13, which says that we need the Holy Ghost's sanctification to enter heaven, Hebrews 12:14, and so on. The point is Christ said nobody unclean can enter heaven. Since all have sinned, we need to be purified before entering heaven.\n \n \n Rom6:23 For the WAGES of sin is death, but the FREE GIFT of God is eternal life through Jesus Christ our Lord.\n\n \n The gift is free, but our sins are still there. God can't just ignore them, we need to be purified. \n \n \n The conditions at that time do not exist any longer and cannot be repeated. Therefore that argument is moot. God will forgive man. Your scripture does not point at all to purgatory. You have taken it out of context. Hmmmmmmmmmm apparently protestants are not the only ones to do this.\n\n \n Umm, the Orthodox Jews still do it today. Purgatory can be whatever you want it to be, it could be something that can be unfelt, or something that takes hard work and penance to gain, all we know is that there is purification. It is a place without God where we are purified. \n \n \n Do you have other scripture since you are so faulty here?\n\n \n Way ahead of you- I already have. First, you have completely ignored Revelation's \"nothing unclean shall enter\". \n \n \"Make friends quickly with your accuser, while you are going with him to court, lest your accuser hand you over to the judge, and the judge to the guard, and you be put in prison; truly, I say to you, you will never get out till you have paid the last penny.\" Matthew 5:25-26\n \n I know this isn't biblical, but I thought I'd throw it in:\n \n  Of course I pray for the dead. At our age the majority of those we love best are dead. What sort of intercourse with God could I have if what I love best were unmentionable to Him? I believe in purgatory. Our souls demand purgatory, don't they? My favourite image on this matter comes from the dentist's chair. I hope that when the tooth of life is drawn, a voice will say, 'Rinse your mouth out with this.' This will be purgatory.- C.S. Lewis (Protestant)\n \n \n Perhaps protestant groups do not agree on things, many catholics do not agree, that does not mean the catholic church is terrible and it is not right for me to label the catholic (or orthodox) church based on what you or Montalban say. That is prejudicial by definition and actually will not hold up in a debate. It is a logical fallacy.\n\n \n At least the Catholic Church has a defined doctrine that has been here for over 2000 years with no retakes besides our additions. Also, the Catholic Church was one united church for 1000 years, two churches closely related for 500 years, and now still the same. But the protestant churches have split up into several churches. Although it used to be only a few churches- Calvinists, Lutherans, Anabaptists, Moravians, Anglican and a few others, now it has split up to several churches, from New England Lutherans, Missouri Synod Lutherans, Presbyterians, Sixth-Day Adventists, et cetera. Actually, the only Protestant Church that has stayed united is the Anglican Church, which basically has the Church of Ireland, Church of England, and Church of America (i.e., Episcopalian). Coincidentally, the Anglicans are closer related to the Catholic doctrine then that of other protestants.", 
   {
    "unicode_changes_made": true
   }, 
   19334, 
   null, 
   1066183140.0
  ], 
  [
   19348, 
   null, 
   "epaphras_faith", 
   "Romans also says that sanctification involves suffering, right before chapter six. \"And not only so: but we glory also in tribulation, knowing that tribulation worketh patience; And patience trial; and trial hope; And hope confoundeth not: because the charity of God is poured forth in our hearts, by the Holy Ghost who is given to us.\" (Rom. 5:3-5).\n \n The Matthew quote was one of many quotes. I can quote 2 Thessalonians 2:13, which says that we need the Holy Ghost's sanctification to enter heaven, Hebrews 12:14, and so on. The point is Christ said nobody unclean can enter heaven. Since all have sinned, we need to be purified before entering heaven.\n \n \n \n The gift is free, but our sins are still there. God can't just ignore them, we need to be purified. \n \n \n \n Umm, the Orthodox Jews still do it today. Purgatory can be whatever you want it to be, it could be something that can be unfelt, or something that takes hard work and penance to gain, all we know is that there is purification. It is a place without God where we are purified. \n \n \n \n Way ahead of you- I already have. First, you have completely ignored Revelation's \"nothing unclean shall enter\". \n \n \"Make friends quickly with your accuser, while you are going with him to court, lest your accuser hand you over to the judge, and the judge to the guard, and you be put in prison; truly, I say to you, you will never get out till you have paid the last penny.\" Matthew 5:25-26\n \n I know this isn't biblical, but I thought I'd throw it in:\n \n  Of course I pray for the dead. At our age the majority of those we love best are dead. What sort of intercourse with God could I have if what I love best were unmentionable to Him? I believe in purgatory. Our souls demand purgatory, don't they? My favourite image on this matter comes from the dentist's chair. I hope that when the tooth of life is drawn, a voice will say, 'Rinse your mouth out with this.' This will be purgatory.- C.S. Lewis (Protestant)\n \n \n \n At least the Catholic Church has a defined doctrine that has been here for over 2000 years with no retakes besides our additions. Also, the Catholic Church was one united church for 1000 years, two churches closely related for 500 years, and now still the same. But the protestant churches have split up into several churches. Although it used to be only a few churches- Calvinists, Lutherans, Anabaptists, Moravians, Anglican and a few others, now it has split up to several churches, from New England Lutherans, Missouri Synod Lutherans, Presbyterians, Sixth-Day Adventists, et cetera. Actually, the only Protestant Church that has stayed united is the Anglican Church, which basically has the Church of Ireland, Church of England, and Church of America (i.e., Episcopalian). Coincidentally, the Anglicans\n\n \n I know the scripture you quote. Not one bit of it refers to purgatory specifically. Nothing unclean is correct. I have been washed clean by the blood of Christ. I need nothing more. The doctrine of purgatory cheapens the sacrifice of Jesus. Hebrews tells us that He SAT DOWN at the right hand of God. The scripture, in context indicates a finished work. We have been bout and sealed.\n \n The tribulations spoken of in Romans that produces hope is what we work out in this life, not hte beyond. There is no reference to this occuring in purgatory.\n \n Ephesians 2:8 tells us that it is a gift of the grace of God that we enter heaven. Jesus says through much of the sermon on the mount that \"The Kingdom of Heaven is at Hand\".\n \n As for the Roman Catholic church doctrine standing for that many years, how many catechisims have been printed, how many revisions, by whom and when? You will find your doctrine is not as stable as you state.\n \n The working of my faith is an outworking of the work already completed in me with the SEAL of the Holy Spirit. Isaiah says \"I will take their heart of stone and give them a heart of flesh\". Psalms (I think) says \"I will remove their sins from them as far as the east is from the west.", 
   {
    "unicode_changes_made": true
   }, 
   19334, 
   null, 
   1066183200.0
  ], 
  [
   19349, 
   null, 
   "Parcum", 
   " I know the scripture you quote. Not one bit of it refers to purgatory specifically. Nothing unclean is correct. I have been washed clean by the blood of Christ. I need nothing more. The doctrine of purgatory cheapens the sacrifice of Jesus. Hebrews tells us that He SAT DOWN at the right hand of God. The scripture, in context indicates a finished work. We have been bout and sealed.\n\n \n Of course, it says nothing unclean must enter. Although Christ's blood saves us, it doesn't cleanse us. We are ALL sinners, remember? If heaven is a place of all goodness, then why would God allow us sinners in? Obviously he doesn't want a sex addict in heaven, does he? He wants us to be clean. As stated, even the Jews believed in a form of purgatory! Do you think this purgatory simply disappeared when Christ resurrected? Do you think God only wanted the Jews to go through purification to get to heaven and the Christians not? Of course not. God wanted NOBODY UNCLEAN in heaven ALWAYS. God doesn't want sin in heaven. We are all sinners. Hence, we cannot go to heaven, unless we are sinless. To be sinless, we must be purified, \"But only as through fire\". \n \n \n Ephesians 2:8 tells us that it is a gift of the grace of God that we enter heaven. Jesus says through much of the sermon on the mount that \"The Kingdom of Heaven is at Hand\".\n\n \n Yes! What a great gift Christ has given us! However, would God also give the gift to non-Christians? What about satan? Obviously, we can't all go to heaven at the state we're in. \n \n \n As for the Roman Catholic church doctrine standing for that many years, how many catechisims have been printed, how many revisions, by whom and when? You will find your doctrine is not as stable as you state.\n\n \n No revisions-- perhaps redefining, but no revisions. Revisions involves changing our doctrine, which we hadn't done. \n \n \n The working of my faith is an outworking of the work already completed in me with the SEAL of the Holy Spirit. Isaiah says \"I will take their heart of stone and give them a heart of flesh\". Psalms (I think) says \"I will remove their sins from them as far as the east is from the west.\n\n \n Yes, and the Holy Spirit heals us as through purification.", 
   {
    "unicode_changes_made": true
   }, 
   19348, 
   null, 
   1066185240.0
  ], 
  [
   19363, 
   null, 
   "maximus", 
   "There was a period where the \"layman\" was not allowed to read scripture for himself. Clearly against what Jesus taught.\n\n \n Epaphras,\n This is false history. I must ask you how the \"layman\" was going to read the Bible since the majority of them were illiterate. They had to go to Church to hear the word of God.\n \n Protestants also say that the Catholic Church used to hoard the Bible to keep it from the common man by chaining it to the podium in the Church. In actuality this was done because the Bibles were so valuable. They took 3 years wages to buy because it took about that long for a learned monk to hand write   the Bible on vellum. Remember there was no printing press for 1500 years after Christ. \n \n The Church was NOT trying to keep a translation of the Bible from the faithful. The Church was trying to keep poor, faulty  translations  of the Bible from getting out there. The Church was in reality trying to protect the flock from misinterpretation and mistranslation that might corrupt the true teaching and impair the faith. One only has to research history to know this. Wycliff was not the first to translate the Bible into English. \n \n Have you ever heard of the Christian band Caedmon's Call? What was Caedmon's call? His call, as a Catholic monk, was to translate scripture into the vernacular. This occurred in the late 600s. In the 700s the Venerable Bede, Eadhelm (Bishop of Sherborne), Guthlac (a hermit), Egbert (Bishop of Holy Island). A while later there were translations by King Alfred the Great, Aelfric (Archbishop of Canterbury). There were other translations around 1150 and 1250. All of these years and years prior to the Reformation that has in time used Church control of the Bible as one of its motives. The above mentioned vernacular translations were only the ones in the varying tongues of England. (Even the Authorized Version--King James in the preface mentions prior translations by the Church) And this is not to mention the vernaculars that already existed in Spanish, Italian, Danish, French, Norwegian, Polish, Bohemian, and Hungarian. *information from Where We Got the Bible  by Henry Graham", 
   {}, 
   19289, 
   null, 
   1066188780.0
  ], 
  [
   19364, 
   null, 
   "maximus", 
   "Rapture,\n Just a random thought. You would argue that the \"Pope\" is not scriptural. Yet you say that scripture has told you that the next \"Pope\" will be the anti-Christ. How does the bible deny the idea of the \"Pope\" yet tell you that the next \"Pope\" will be the anti-Christ?", 
   {}, 
   19363, 
   null, 
   1066188960.0
  ], 
  [
   19366, 
   null, 
   "maximus", 
   "Maximus:\n \n What of the catholic churches sale of indulgences for the \"redecorating\" in rome? Was this ordained by God?\n \n We have had the argument on the founding of the church. I do not accept the founding of the pope and the cardinals etc. etc. You know that. True the reformation was a rebellion of doctrine but also an issue of morality. How could a church SELL indulgences and call that moral? This was a part of luther's protest. It was not all. \n\n \n Firstly, indulgences were not for sell (Canon 2327 excommunicates anyone who seeks material profit from indulgences). Secondly, indulgences did not grant forgiveness. An indulgence is the remission of the debt of temporal punishment   (not the eternal punishment) due to sin after its guilt has been forgiven. It is the remission of sentence of penalty and not a commutation of the sentence or penalty. The remission of debt is not the remission of guilt. An indulgence has nothing to do with the guilt of the sin. In fact, an indulgence can only be gained by one who is not in a state of sin; one who has secured forgiveness of his sins by repentance and Confession. This does nothing to detract from the eternal salvation bought for us by Christ on the cross. Even after Christ's sacrifice, we are not exempt from suffering. \n \n Scriptural foundations for indulgences can be found in Matthew 16:19, \"I will give you the keys of the kingdom of heaven, and whatever you bind on earth shall be bound in heaven, and whatever you loose on earth shall be loosed in heaven.\" Jesus gave the Church the power to bind and loose, including the penalty for sin. This is the power the Church uses in granting indulgences. Paul gives us an example of remitting temporal punishment due to sin (as an indulgence does) in 2 Corinthians 2: 6-10 when he allows the man found guilty of sinning with his stepmother (1 Corinthians 5:1) back in to the church after learning of his repentance. There are many more examples in scripture where works can offset the consequences of sin (James 5:20  and 1 Peter 4:8 as well as many Old Testament verses)\n \n Indulgences can also be illustrated with a practical example. Suppose a boy throws a rock through the window of a store to win a bet with his friend (a sin). The boy feels badly after throwing the rock and confesses to the crime with an immediate apology (contrition and confession). The store manager knows the boy and he talks to the owner of the store about the incident. The owner gives the manager the permission to decide whether or not formal charges for vandalism will be pressed. The manager elects not to press charges for the indiscretion (forgiveness). However, he still has a broken window to repair (consequence of sin). He decides to let the boy work off the debt at the store by sweeping for 5 days. The boy comes in every day for 4 days on time. The boy has a very good attitude during his work. He actually helps the storeowner stock shelves and cleans out the freezer without the storeowner requiring it of him (good works/penance). Because the boy has shown a change of heart and reformed his ways the store manager cancels the debt of the remaining day (an indulgence). In effect the boy gets time off for good behavior. This does not change the fact that the boy sinned, nor is the sin abolished. Rather, the good works lessen the penalty of that sin. \n \n I acknowledge that there were abuses concerning indulgences in the time of Luther but the Church never sanctioned this. Indulgences were granted to those who would give alms towards the building of St. Peter's Basilica in Rome. These people gave alms for a good work. Just as Christ gave a special blessing to the widow who gave her mite as an alm to the temple in Jerusalem, indulgences were granted to those who gave alms for St. Peter's. \n \n \n \nNot dogmatic?! The pope himself did this. What does it say about who he believed God to be that he thought he could sell time off in purgatory to people who gave money? Given what Montalban and others have been saying about \"church tradition\" I would think it was precisely dogmatic. YIPES!\n\n \n Epaphras,\n Just because the pope does something that does not make it dogma. Also, the pope can and does sin. The pope is not impeccable--perfect without sin. But he is infallible--without error--when he teaches ex cathedra on faith and morals.", 
   {
    "unicode_changes_made": true
   }, 
   19289, 
   null, 
   1066189740.0
  ], 
  [
   19368, 
   null, 
   "maximus", 
   "By the way Parcum:\n \n Where in canonized scripture is purgatory?\n\n \n Epaphras,\n \n Not everything the Catholic Church teaches is explicit in scripture but NOTHING the Church teaches is contrary to scripture. Some things are implied and have been carried on through Tradition. Remember the quotes that I gave you on the other thread concerning Paul's words on tradition.\n \n On Purgatory, consider this verse, 1 Peter 3:19. I am not saying that this is Purgatory--the \"prison\" where those of the Old Testament time were. But this does provide evidence that a place or state like Purgatory can exist after earthly death does it not?", 
   {}, 
   19311, 
   null, 
   1066190520.0
  ], 
  [
   19384, 
   null, 
   "rapture", 
   "Name the mortal(mammel) that will Stop Power hungry Lucifer from sitting on his thrown? I can see him looking in the mirror, triple crown miter, approx.. one billion followers(vessels) at his beck and call, stroking his fiendish ego, puffing his black heart, with echos of Holy Father finally he is a god, loyalty, just for being elected Pontiff( too perfect) nevertheless, and more importantly he Dammned his soul for this", 
   {}, 
   19368, 
   null, 
   1066197120.0
  ], 
  [
   19388, 
   null, 
   "maximus", 
   "Rapture,\n Could you possibly address the posts instead of rambling seeming nonsense?", 
   {}, 
   19384, 
   null, 
   1066198260.0
  ], 
  [
   19389, 
   null, 
   "rapture", 
   "Concerning the sixty eight million slain by the Roman Catholic Church, what time in history did this take place, and over how long a period of time did this take place?\n \n (The red horse rider)Rev 6:4\n \n \n \n \nTake Schmucker's Glorious Reformation, i guess some of these scholars have that; and it's the history of the church. And I forget now just what page it's on, but it the thing was produced or given to the church by Saint Augustess of Hippo, Africa. the massacre of Ireland. From A.D. 354 To A.D. 1850 , according to the history there were sixty-eight million protestants put to death recorded on the Roman martyrology for disagreeing] with the pope of Rome- that's history. If you want to say it's wrong. well then, mabey George Washington wasn't here or Lincoln, (none of us lived back to see it.) but I believe they were here anyhow. I see signs that they were here.\n \n \n Excerpt by William Braham\n\n \n \n \n Perhaps another Pope like this one here? The church has a history of wicked Popes and ungodly deeds. If the R.C.C. is a example of heaven and a representation of God one should desire destruction totally- at least the flames will cease.", 
   {
    "unicode_changes_made": true
   }, 
   19388, 
   null, 
   1066198920.0
  ], 
  [
   19399, 
   null, 
   "montalban", 
   "Your first paragraph is amazingly prejudicial. Protestants do not take anything out of context anymore than do catholics or orthodox or any other christian. \n \n I do not take things out of context. I have studied hermaneutics and understand the correct methods for understanding scripture. It irks me no end that you lump rapture's ramblings in with all protestants. Grow Up!!!!!!!!!!!!!!!!!!! Just because there is one foolish individual DO NOT make us all out to be that way!!!!!!!!!!!!\n\n \n The context of the Bible is the Church....the Church that gave the world the Bible!\n \n I've mentioned this analogy twice before but no one's commented on it.\n \n If you want to study Australia's form of government, you could pick up the Constitution (our supreme law) and study it. But you'd not realise that there exist many conventions in Australia that are not set down in law.\n \n To read the Constitution by itself, you'd probably be convinced that we're a military dictatorship, because large powers are given to the un-elected Governor General. In practice however, he holds virtually no powers. Technically he's the head of the army, but the army follows the elected members of the Parliament....(England gets by even without a constitution... living off traditions)\n \n To read the Constitution by itself, and just argue from it, you'd be wrong, because you've taken it out of the context of a larger thing... Australian democracy.\n \n Thus, to look at the Bible, by itself, and to argue only about it and from it is to take it from the Church that created it. The same Church produced and produces volumes of works on theological issues. The whole is important to understand Christianity. Taking one book, however important that book might be, is against the thought of that same Church.", 
   {}, 
   19265, 
   null, 
   1066213200.0
  ], 
  [
   19401, 
   null, 
   "montalban", 
   "quote by Montalban: You have, in an instant, demonstrated the major fault with Protestant Christianity. You can take verses out of context and make them mean anything. This is in fact not having any respect for the Word of God.\n \n He is commenting on something \"rapture\" said. I was pointing out that rapture does not represent protestant christianity. My comment was that to assume that protestants take things out of context based upon what \"rapture\" has said is ludicrous. He used other examples of people taking things out of context but that still does not represent all protestants and to say so is prejudicial by definition.\n\n \n I didn't just comment on something Rapture said...I gave examples of many other peoples who take parts of the Bible to serve their purpose. It is a major fault if large groups of Protestants can do what Rapture did! And they do 'do it'.\n \n Specifically, Rapture touched upon the issue of prophecy. I mentioned a number of groups that did exactly the same; and they were able to predict the end days, and this justified all manner of acts. This is not a small thing that only happened 'back then'. This happens any time I switch on TV and see a Bible minister talking about the 'end days'. Protestants were encouraged to look to the Bible to seek guidance for the age in which they lived. And Protestants are still encouraged.\n \n As I see it, large numbers of Protestants try to seek out the 'end days' from the Bible...\n \"To speculate on the Second Coming, even if it be only the year, is to seek to wrest a secret from God that Jesus explicitly states only the Father possesses. Therefore, speculating on the timing of our Lord's return is arrogance bordering on blasphemy.\"\n from \"The Last Days\" in \"Voice in the Wilderness\" Vol 11 No 2 April-June 2003, ,p24.(published by Apostoliki Diakonia Committee Greek Orthodox Archdiocese of Australia)\n \n I see this as a major fault.\n \n I could give you examples throughout Protestantism's short history. But this isn't just an issue of Bible-verse pinching from the past.\n \n They still do it.\n \n That is why there is a plethora of Protestant denominations...\n \n Quite simply many Protestant groups began on one issue theology.\n Charismatics concentrate on Spiritual Gifts\n Baptists stem from the issue of 'baptism' for adults\n Anglicans stem from an issue of divorce\n Quakers on direct divine revelation.\n \n They may have beefed up their theology to include other issues, but even here the fault exists - they all use the Bible, and all come to completely different ways of worship, different dogma, just plain different.\n \n I'd like to say that there was no fault in Christianity, and people don't do these things, but they do.\n \n \n \n And, how quick were you to start fault-finding in Catholicism.... over the Pope etc. I know it annoys you when I point out things I disagree with but let's not get precious. Let's realise we're all playing the same game here.", 
   {}, 
   19314, 
   null, 
   1066214820.0
  ], 
  [
   19402, 
   null, 
   "montalban", 
   "Concerning the sixty eight million slain by the Roman Catholic Church, what time in history did this take place, and over how long a period of time did this take place?.\n\n \n Are we switching the debate to how many people have been killed 'in the name of' a particular Church?\n \n We have a sliding scale of 'evil'...\n From \n Here in Australia, AIM (Aboriginal Inland Mission) (run by the Baptists) was responsible for cultural genocide.\n To\n How many Anabaptists did Lutherans condemn to death\n \n Actually this is a rather silly debate switch, I don't know what you're doing.\n \n \n \nPerhaps another Pope like this one here? The church has a history of wicked Popes and ungodly deeds. If the R.C.C. is a example of heaven and a representation of God one should desire destruction totally- at least the flames will cease.\n\n \n Again, silly.\n \n Great Protestants such as Luther happily condemned Jews and Anabaptists, and poor German peasants.\n \n Do you remember Rev Baker, Rev Roberts? How many telly-evangelists are skimming money now?", 
   {}, 
   19389, 
   null, 
   1066215600.0
  ], 
  [
   19421, 
   null, 
   "epaphras_faith", 
   "Of course, it says nothing unclean must enter. Although Christ's blood saves us, it doesn't cleanse us. We are ALL sinners, remember? If heaven is a place of all goodness, then why would God allow us sinners in? Obviously he doesn't want a sex addict in heaven, does he? He wants us to be clean. As stated, even the Jews believed in a form of purgatory! Do you think this purgatory simply disappeared when Christ resurrected? Do you think God only wanted the Jews to go through purification to get to heaven and the Christians not? Of course not. God wanted NOBODY UNCLEAN in heaven ALWAYS. God doesn't want sin in heaven. We are all sinners. Hence, we cannot go to heaven, unless we are sinless. To be sinless, we must be purified, \"But only as through fire\". \n \n \n \n Yes! What a great gift Christ has given us! However, would God also give the gift to non-Christians? What about satan? Obviously, we can't all go to heaven at the state we're in. \n \n \n \n No revisions-- perhaps redefining, but no revisions. Revisions involves changing our doctrine, which we hadn't done. \n \n \n \n Yes, and the Holy Spirit heals us as through purification.\n\n \n You are wrong! Jesus blood does cleanse us. Can you have read the bible for so long and not know this. Hebrews9:22 and 1John 1:7 just to name a couple. His blood cleanses us. \n \n Jesus' sacrifice made us righteous not just justified. Those whom he called he justified, those he justified, he sanctified, those he sanctified, he glorified. Note these are all in the PAST tense. I believe they are in the aorist in greek indicating something that was true and continues to be true. \n \n I also suggest you look at your catechism's history more closely. You parse words with me by using the word \"redefine\" as opposed to revise. There are some doctrines that came into being that never were. The infallability of the pope didn't come up for centuries after the beginning of the church. There are some now who would do away with issues surrounding contraception. \n \n I actually am sorry for you as you do not see Christ's sacrifice for what it is in your life. You live in the bondage of fear of not measuring up of missing the mark (sin). Romans 8:1 Therefore there is no condemnation for those who are in Christ Jesus.", 
   {
    "unicode_changes_made": true
   }, 
   19349, 
   null, 
   1066238640.0
  ], 
  [
   19422, 
   null, 
   "epaphras_faith", 
   "Epaphras,\n \n Not everything the Catholic Church teaches is explicit in scripture but NOTHING the Church teaches is contrary to scripture. Some things are implied and have been carried on through Tradition. Remember the quotes that I gave you on the other thread concerning Paul's words on tradition.\n \n On Purgatory, consider this verse, 1 Peter 3:19. I am not saying that this is Purgatory--the \"prison\" where those of the Old Testament time were. But this does provide evidence that a place or state like Purgatory can exist after earthly death does it not?\n\n \n I need to look up some things but will be back. I do consider what you have said and probably should educate myself better before writing.", 
   {}, 
   19368, 
   null, 
   1066238940.0
  ], 
  [
   19423, 
   null, 
   "epaphras_faith", 
   "I didn't just comment on something Rapture said...I gave examples of many other peoples who take parts of the Bible to serve their purpose. It is a major fault if large groups of Protestants can do what Rapture did! And they do 'do it'.\n \n Specifically, Rapture touched upon the issue of prophecy. I mentioned a number of groups that did exactly the same; and they were able to predict the end days, and this justified all manner of acts. This is not a small thing that only happened 'back then'. This happens any time I switch on TV and see a Bible minister talking about the 'end days'. Protestants were encouraged to look to the Bible to seek guidance for the age in which they lived. And Protestants are still encouraged.\n \n As I see it, large numbers of Protestants try to seek out the 'end days' from the Bible...\n \"To speculate on the Second Coming, even if it be only the year, is to seek to wrest a secret from God that Jesus explicitly states only the Father possesses. Therefore, speculating on the timing of our Lord's return is arrogance bordering on blasphemy.\"\n from \"The Last Days\" in \"Voice in the Wilderness\" Vol 11 No 2 April-June 2003, ,p24.(published by Apostoliki Diakonia Committee Greek Orthodox Archdiocese of Australia)\n \n I see this as a major fault.\n \n I could give you examples throughout Protestantism's short history. But this isn't just an issue of Bible-verse pinching from the past.\n \n They still do it.\n \n That is why there is a plethora of Protestant denominations...\n \n Quite simply many Protestant groups began on one issue theology.\n Charismatics concentrate on Spiritual Gifts\n Baptists stem from the issue of 'baptism' for adults\n Anglicans stem from an issue of divorce\n Quakers on direct divine revelation.\n \n They may have beefed up their theology to include other issues, but even here the fault exists - they all use the Bible, and all come to completely different ways of worship, different dogma, just plain different.\n \n I'd like to say that there was no fault in Christianity, and people don't do these things, but they do.\n \n \n \n And, how quick were you to start fault-finding in Catholicism.... over the Pope etc. I know it annoys you when I point out things I disagree with but let's not get precious. Let's realise we're all playing the same game here.\n\n \n Perhaps you did not intend to lump us all together but that is what you did. I am protestant and I do not agree with Rapture. I think Rapture has some problem we are unaware of.\n \n I can accept that large groups do think that, but not all. Certainly not me. And not most of those I interact with.", 
   {}, 
   19401, 
   null, 
   1066239060.0
  ], 
  [
   19424, 
   null, 
   "epaphras_faith", 
   "I need to look up some things but will be back. I do consider what you have said and probably should educate myself better before writing.\n\n \n Maximus:\n \n Could you comment on Parcums comment that the blood of Jesus does not cleanse us.", 
   {}, 
   19422, 
   null, 
   1066239120.0
  ], 
  [
   19430, 
   null, 
   "rapture", 
   "The R.C.C. acts as if it is the Supreme Authority, believing to have the power to create and evoke the Saints or just change anything in the Bible they desire. I could see how one could get a puffed up heart like that being called Holy Father, as if God didn't exist, nevertheless, Mary would not be bless if she had to watch Satan use her image to decieve millions", 
   {}, 
   19401, 
   null, 
   1066240620.0
  ], 
  [
   19441, 
   null, 
   "epaphras_faith", 
   "The R.C.C. acts as if it is the Supreme Authority, believing to have the power to create and evoke the Saints or just change anything in the Bible they desire. I could see how one could get a puffed up heart like that being called Holy Father, as if God didn't exist, nevertheless, Mary would not be bless if she had to watch Satan use her image to decieve millions\n\n \n Please provide data to back up your statement that they change anything in the bible they desire. I do not see that.", 
   {}, 
   19430, 
   null, 
   1066254720.0
  ], 
  [
   19453, 
   null, 
   "Parcum", 
   "Concerning the sixty eight million slain by the Roman Catholic Church, what time in history did this take place, and over how long a period of time did this take place?\n \n\n \n Hey, that's a creative red herring (It really is red)!\n \n We mussn't blame the Church for being the only one who has massacred innocent Christians. Protestants have done just as much- if not, greater amounts of damage. I could mention Queen Elizabeth, King James, the many cruel massacres in Germany, especially in the south-- there are many more. Your attempt to blame the Catholic Church for killing 68 million and implying that Protestants are innocent is a sad attempt to distract from the real issues. Yes, satan has attacked the church- but what better place to attack it then the institution Christ founded? Christ said the gates of the netherworld would never prevail against it- not block it from all evil.", 
   {}, 
   19441, 
   null, 
   1066263360.0
  ], 
  [
   19456, 
   null, 
   "epaphras_faith", 
   "Hey, that's a creative red herring (It really is red)!\n \n We mussn't blame the Church for being the only one who has massacred innocent Christians. Protestants have done just as much- if not, greater amounts of damage. I could mention Queen Elizabeth, King James, the many cruel massacres in Germany, especially in the south-- there are many more. Your attempt to blame the Catholic Church for killing 68 million and implying that Protestants are innocent is a sad attempt to distract from the real issues. Yes, satan has attacked the church- but what better place to attack it then the institution Christ founded? Christ said the gates of the netherworld would never prevail against it- not block it from all evil.\n\n \n From the quote, I saw a question and no blame soley on the catholic church but a question as to when in history and over what period of time. Is this a question that you cannot answer or just do not want to answer or is rapture going off on a tangent and no such killing ever occurred. If it is history and you know it then own up to it. Then the rest of your argument makes sense. But to defend that which is not in evidence implies an attempt to subvert an argument that has not occurred. It is a position of weakness. \n \n Now to the questions, did it occur? If it did, when? If not explain the inquisition and the likes.", 
   {}, 
   19453, 
   null, 
   1066264440.0
  ], 
  [
   19472, 
   null, 
   "Parcum", 
   "Probably the most notable mention of protestant killings of Catholics is the Massacres of Drogheda and Wexford in Ireland. When Oliver Cromwell siege Ireland in 1649, he concluded the siege by massacring Catholics in the area. 3500 died in Drogheda, 1500 in Wexford for a grand total of 5000 Catholics killed in a matter of hours. The Irish under James I did fight back (and lost), but why shouldn't they? Catholics were oppressed to the extreme, where in England and it's territories being a Catholic priest during the 16th and 17th centuries was punishable by hanging, drawing and quartering, et cetera. \n \n After the Treaty of Westphalia in 1648, the Church was declared subservient to the state, meaning that the protestant princes of Germany were allowed to close monasteries. In the Republic of Geneva, which was one of the Swiss Cannons, Calvinism became fundamental law. Priest who opposed Calvinism were slained or exiled. Catholics living in the area were oppressed and forced to attend Calvinist sermons. Further, shortly after the toleration act of Charles IX in 1562, the Calvinists oppressed Catholics in France greatly, especially In the south, and even burned Catholic priests in the suburbs of Paris. When this civil war ended, the Catholics suffered more losses; churches were burned; relics of saints scattered throughout the lands; numerous religious men and women murdered. In Kronstadt in 1532, the Mass was abolished. Under Queen Elizabeth's Oath, she was ecclesiastically supreme. Hence, she oppressed and killed anyone who wasn't part of the Anglican Established Church, including Catholics and Presbyterians. \n \n Should I say anymore? I can also mention some others in Hungary, Holland, Denmark, Sweden, Poland, Italy, and in our very own nation?\n \n \n As for the Inquisition,  The 1480-1505 Inquisition claimed 2000 lives. Under Charles, there wasn't really an Inquisition. They had Auto-De-Fe's, but the numbers there were very small. Including all the wars, protestant oppression, massive massacres of the Spanish against the protestants, according to Will Durant, an agnostic who is generally considered anti-Catholic, there were around 30-60 thousand protestants killed in Spain in a 350 year period. This is actually not a lot. \n \n The Inquisition was justified because biblically it happened- remember the Ten Commandments? God sent heretics to hell. Although I personally don't justify this action, Isabelle was pretty kind about it, and gave the accused a fair trial, even making their prisons more comfortable then their own homes! According to one protestant source, 16 million Protestants were killed in the Inquisition. This is impossible, as there weren't even 16 million people in Spain (the population was around 5 million I believe), let alone Protestants. There were merely a few tens of thousands of Protestants in Spain, and very few were killed. \n \n Hence, the Inquisition is exaggerated, and Protestants have had their share of persecutions.", 
   {
    "unicode_changes_made": true
   }, 
   19456, 
   null, 
   1066267800.0
  ], 
  [
   19477, 
   null, 
   "epaphras_faith", 
   "Probably the most notable mention of protestant killings of Catholics is the Massacres of Drogheda and Wexford in Ireland. When Oliver Cromwell siege Ireland in 1649, he concluded the siege by massacring Catholics in the area. 3500 died in Drogheda, 1500 in Wexford for a grand total of 5000 Catholics killed in a matter of hours. The Irish under James I did fight back (and lost), but why shouldn't they? Catholics were oppressed to the extreme, where in England and it's territories being a Catholic priest during the 16th and 17th centuries was punishable by hanging, drawing and quartering, et cetera. \n \n After the Treaty of Westphalia in 1648, the Church was declared subservient to the state, meaning that the protestant princes of Germany were allowed to close monasteries. In the Republic of Geneva, which was one of the Swiss Cannons, Calvinism became fundamental law. Priest who opposed Calvinism were slained or exiled. Catholics living in the area were oppressed and forced to attend Calvinist sermons. Further, shortly after the toleration act of Charles IX in 1562, the Calvinists oppressed Catholics in France greatly, especially In the south, and even burned Catholic priests in the suburbs of Paris. When this civil war ended, the Catholics suffered more losses; churches were burned; relics of saints scattered throughout the lands; numerous religious men and women murdered. In Kronstadt in 1532, the Mass was abolished. Under Queen Elizabeth's Oath, she was ecclesiastically supreme. Hence, she oppressed and killed anyone who wasn't part of the Anglican Established Church, including Catholics and Presbyterians. \n \n Should I say anymore? I can also mention some others in Hungary, Holland, Denmark, Sweden, Poland, Italy, and in our very own nation?\n \n \n As for the Inquisition,  The 1480-1505 Inquisition claimed 2000 lives. Under Charles, there wasn't really an Inquisition. They had Auto-De-Fe's, but the numbers there were very small. Including all the wars, protestant oppression, massive massacres of the Spanish against the protestants, according to Will Durant, an agnostic who is generally considered anti-Catholic, there were around 30-60 thousand protestants killed in Spain in a 350 year period. This is actually not a lot. \n \n The Inquisition was justified because biblically it happened- remember the Ten Commandments? God sent heretics to hell. Although I personally don't justify this action, Isabelle was pretty kind about it, and gave the accused a fair trial, even making their prisons more comfortable then their own homes! According to one protestant source, 16 million Protestants were killed in the Inquisition. This is impossible, as there weren't even 16 million people in Spain (the population was around 5 million I believe), let alone Protestants. There were merely a few tens of thousands of Protestants in Spain, and very few were killed. \n \n Hence, the Inquisition is exaggerated, and Protestants have had their share of persecutions.\n\n \n I do not deny that protestants have their share of persecutions. Shall we look at the crusades as well.......... I just don't hink you are looking at it objectively. The catholic church has not been perfect. I do not deny that it is a force of Good in the world today. But please, don't just defend. Look realistically. You have gone on at length about protestant persecutions, now let us hear about the catholic persecutions. Did the church not recently apologize for the crusades. Give us the history. If you don't, there is no doubt some protestant or atheist will.", 
   {
    "unicode_changes_made": true
   }, 
   19472, 
   null, 
   1066268700.0
  ], 
  [
   19487, 
   null, 
   "rapture", 
   "Please provide data to back up your statement that they change anything in the bible they desire. I do not see that.\n\n \n Just one:\n \n \n \n Matthew 20:25-28, \"But Jesus called them unto Him, and said, Ye know that the princes of the Gentiles exercise dominion over them, and they that are great exercise authority upon them. But it shall not be so among you; but whosoever will be great among you , let him be your minister; and whosoever will be chief among you; let him be your servant: Even as the Son of man came not to be ministered unto , but to minister, and to give His life a ransom for many.\" Matthew 23:8-9, But be ye not called Rabbi: for one is your Master, even Christ; and all ye are brethren. And call no man your father upon the earth: for One is your Father, Which is in heaven.\"\n \n \n  Matthew 23:12 And whosoever shall exalt himself shall be abased; and he that shall humble himself shall be exalted\n \n \n ** Luciferian charcteristics\n \n \n \n Isaiah 14: 12\n \n \n \n How art thou fallen from heaven ,O Lucifer, son of the morning! how art thou cut down to the ground , which didst walk- weaken the nations!\n \n \n For thou has said in thine heart, I will ascend into heaven, I willl exalt my throne above the stars of God. I willl sit also upon the mount of the congregation, in the sides of the north:\n \n \n I will ascend above the heights of the clouds:  I will be like the most High", 
   {
    "unicode_changes_made": true
   }, 
   19441, 
   null, 
   1066271520.0
  ], 
  [
   19488, 
   null, 
   "Parcum", 
   "You're talking to somebody who defends most of what went on in the crusades, and the albigensian inquisition. So those don't really count lol.\n \n \nI do not deny that protestants have their share of persecutions. Shall we look at the crusades as well.......... I just don't hink you are looking at it objectively. The catholic church has not been perfect. I do not deny that it is a force of Good in the world today. But please, don't just defend. Look realistically. You have gone on at length about protestant persecutions, now let us hear about the catholic persecutions. Did the church not recently apologize for the crusades. Give us the history. If you don't, there is no doubt some protestant or atheist will.\n\n \n I don't either! In fact, I said exactly what you've stated. And I completely know the catholic church isn't perfect- in fact, I bet the anti-Christ will adhere to the Catholic faith, and in fact claim to be a pope. Will he truly be a successor of Peter? Of course not. Will he truly be a Christian, let alone a Catholic? Nope.", 
   {}, 
   19487, 
   null, 
   1066272840.0
  ], 
  [
   19490, 
   null, 
   "rapture", 
   "Rev 17 And there came one of the seven angels which had the seven vials, and talked with me , saying unto me, Come hither, I will shew unto thee the judgment of the great whore that sitteth upon many waters:\n \n With whom the kings of the earth have committeed fornication, and the inhabitants of the earth have been made drunk with the wine of her fornication.\n \n So he carried me in the spirit into the wilderness: and I saw a woman sit upon a scarlet coloured beast, full of names of blasphemy, having seven heads ands ten horn.\n And the woman was arrayed in purple and scarlet colour,and decked with gold and precious stones and pearls, having a golden cup in her hand full of abominations and filthiness of her fornication\n \n And upon her forehead was a name written, MYSTERY,BABYLON THE GREAT,THE MOTHER OF HARLOTS AND ABONINATIONS OF THE EARTH.\n And I saw the  woman drunken with the blood of the saints, and with the blod of the martyrs of Jesus: and when I saw her, I wondered with great admiration.\n And the angel said unto me, Wherefore didst thou marvel? Iwill tell thee the mystery of the woman, and of the beast that carrieth her, which hath the seven heads and ten horns \n \n The beast that thou sawest was, and is not; and shall ascend out of the bottomless pit, and go into perdition: and they that dwell on the Earth shall wonder, whose names were not written in the book of life from the foundation of the world, when they behold the beast that was, and is not, and yet is.\n \n \n And here is the mind which hath wisdom.\n \n \n The seven heads are seven mountains, on which the woman sitteth\n \n \n Palatine\n Capitoline\n Quirinal\n Viminal\n Esquiline\n Caelian\n Aventine", 
   {}, 
   19488, 
   null, 
   1066274040.0
  ], 
  [
   19492, 
   null, 
   "Parcum", 
   "What are you saying?", 
   {}, 
   19490, 
   null, 
   1066274280.0
  ], 
  [
   19530, 
   null, 
   "montalban", 
   "What are you saying?\n\n \n He's giving you a list of seven hills. But he forgets that the 'new Rome' of Constantinople was also on seven hills.\n \n Near where I live, in western Sydney, is the suburb of Seven Hills.\n \n So, Rome, Constantinople, or Sydney, could each be a candidate for the city mentioned in Revelations.\n \n How many other 'cities of seven hills\" are there?", 
   {}, 
   19492, 
   null, 
   1066296540.0
  ], 
  [
   19531, 
   null, 
   "montalban", 
   "Perhaps you did not intend to lump us all together but that is what you did. I am protestant and I do not agree with Rapture. I think Rapture has some problem we are unaware of.\n \n I can accept that large groups do think that, but not all. Certainly not me. And not most of those I interact with.\n\n \n It is never my intent to use stereotypes of other Christians.\n \n I have a friend whom I consider more kind and balanced than anyone I know, and he's a Protestant.\n \n But it was my understanding that all Protestants are able to interpret the word of the Bible for themselves. This to me seemed to be a flaw if it lead to excesses such as those listed.", 
   {}, 
   19423, 
   null, 
   1066296720.0
  ], 
  [
   19533, 
   null, 
   "montalban", 
   "The R.C.C. acts as if it is the Supreme Authority, believing to have the power to create and evoke the Saints or just change anything in the Bible they desire. I could see how one could get a puffed up heart like that being called Holy Father, as if God didn't exist, nevertheless, Mary would not be bless (sic) if she had to watch Satan use her image to decieve (sic) millions\n\n \n I looked at this post, Rapture, for some time. I then went and had dinner, and came back and read it again. There's an argument in there somewhere, but I still can't find it.\n \n It would help if you didn't generalise. What parts of the Bible did 'they' desire to change? I must assume you mean the Roman Catholic Church, but what about the Orthodox Church? We claim we are the original church too, therefore we put the Bible together.\n \n \n \nMary would not be bless (sic) if she had to watch Satan use her image to decieve (sic) millions\n\n \n Firstly, are you saying that Mary is not blessed?\n \n In deciphering this statement of yours, I must conclude that Mary would be blessed if she didn't have to watch Satan use her image to deceive millions, and therefore as she doesn't watch that, because it doesn't happen and therefore she must be blessed!\n \n Where? How? Is Satan using the image of Mary?\n \n \n \n Why is he using the image of Mary?", 
   {}, 
   19430, 
   null, 
   1066304040.0
  ], 
  [
   19534, 
   null, 
   "montalban", 
   "I do not deny that protestants have their share of persecutions. Shall we look at the crusades as well.......... I just don't hink (sic) you are looking at it objectively. The catholic church has not been perfect. I do not deny that it is a force of Good in the world today. But please, don't just defend. Look realistically. You have gone on at length about protestant persecutions, now let us hear about the catholic persecutions. Did the church not recently apologize for the crusades. Give us the history. If you don't, there is no doubt some protestant or atheist will.\n\n \n Parcum is not trying to deny massacres. Simply put, Rapture blamed the Catholic Church for many massacres. This is a fact, but he states it by itself - without reference to the massacres Parcum uses, to imply that the Catholic Church is inherently evil.\n \n Parcum therefore is not stating his facts as a justification, but rather to contextually posit the massacres. All Christians have done wrongs. Except mine. Ouch! (only kidding!).\n \n In saying that, the 'crusades' as an issue is also taken out of context. I take it you mean 'the Crusades' (any crusade is not of itself wrong - Billy Graham held 'crusades').\n \n The Crusades were not an action. They were a re-action. Almost all the lands that they fought over had been at one point, Christian lands; northern Africa, the Middle East, Asia Minor. (the reconquest of Spain is not always counted as a 'Crusade').\n \n Mohammedans were war-like from their very beginnings. They over-ran large areas of Christendom. Although they were oppressive, it was the advent of the even more insidious Turks (who prevented pilgrimages and greatly threatened the Byzantine Empire), that the Crusades began. They were intent on liberating the Holy Land. That they partly succeeded, but did so in a very bloody fashion has been commentated from here to sunset.\n \n Thus everyone recognises the Fourth Crusade as being highly un-Christian - because the Westerners attacked the Christian city of Constantinople!\n \n Thus the \"What about the Crusades?\" reaction displayed by your good-self is inappropriate, and quite divisive... the sort of thing I'd expect an ill-educated atheist to say. I must say there is so much anti-Catholic feeling in Protestantism, that many of your collective salvos are in fact used by atheists to undermine all Christianity. Such as mentioning the Crusades. Even now Mohammedans likewise will quote with relish the writings of apologetic Catholics, and blinkered Protestants over this matter. The 'enemy' laugh at such divisions.\n \n If you were talking about another 'crusade' such as that of Charlemagne against the Saxons, or Heraclius against the Persians, or that of northern France against the Albergensians, or the Teutonic Knights against the Prussians, I did not pick that up. Please let me know, and I'd be more than happy to set them into context too.", 
   {}, 
   19477, 
   null, 
   1066305060.0
  ], 
  [
   19557, 
   null, 
   "rapture", 
   "[Quote]\nI looked at this post, Rapture, for some time. I then went and had dinner, and came back and read it again. There's an argument in there somewhere, but I still can't find it.\n \n It would help if you didn't generalise. What parts of the Bible did 'they' desire to change? I must assume you mean the Roman Catholic Church, but what about the Orthodox Church? We claim we are the original church too, therefore we put the Bible together.\n\n \n \n \n I decided awhile back while trying to understand the Bible to ask the author to interpret his words. My mind is feeble and weak, and I could use alot of cubits to my stature, but the author has been kind and patient and his own time, and way brings me into understanding \n \n \n \nFirstly, are you saying that Mary is not blessed?\n\n \n If Mary is anywhere near God she is blessed\n \n \n \n \nIn deciphering this statement of yours, I must conclude that Mary would be blessed if she didn't have to watch Satan use her image to deceive millions, and therefore as she doesn't watch that, because it doesn't happen and therefore she must be blessed!\n\n \n \n That's it \n \n \nWhere? How? Is Satan using the image of Mary?\n\n \n From what I see Satan has mislead the people into believing Mary can intercede for their sin's yet it's not scriptural. But ask yourself this....if such was true what would Mary get out of this arrangement? Worship! \n If it's not God's love it's not free, anyways, all the spirtualism, bowing and kissing images and corpses ect.... I think that stuff stems from merging with the pagans/wiccans/druids..ect.....in the R.C.C early history.\n \n \n \n \nWhy is he using the image of Mary?\n\n \n It works... but here lately, on Mother's Day he made hisself known over St.Vincent De Paul Catholic Church. He looks just like one of those hideous gargoyles that be on the old buildings. I always was leary of churchs with demon statues starring", 
   {}, 
   19533, 
   null, 
   1066322820.0
  ], 
  [
   19558, 
   null, 
   "epaphras_faith", 
   "Parcum is not trying to deny massacres. Simply put, Rapture blamed the Catholic Church for many massacres. This is a fact, but he states it by itself - without reference to the massacres Parcum uses, to imply that the Catholic Church is inherently evil.\n \n Parcum therefore is not stating his facts as a justification, but rather to contextually posit the massacres. All Christians have done wrongs. Except mine. Ouch! (only kidding!).\n \n In saying that, the 'crusades' as an issue is also taken out of context. I take it you mean 'the Crusades' (any crusade is not of itself wrong - Billy Graham held 'crusades').\n \n The Crusades were not an action. They were a re-action. Almost all the lands that they fought over had been at one point, Christian lands; northern Africa, the Middle East, Asia Minor. (the reconquest of Spain is not always counted as a 'Crusade').\n \n Mohammedans were war-like from their very beginnings. They over-ran large areas of Christendom. Although they were oppressive, it was the advent of the even more insidious Turks (who prevented pilgrimages and greatly threatened the Byzantine Empire), that the Crusades began. They were intent on liberating the Holy Land. That they partly succeeded, but did so in a very bloody fashion has been commentated from here to sunset.\n \n Thus everyone recognises the Fourth Crusade as being highly un-Christian - because the Westerners attacked the Christian city of Constantinople!\n \n Thus the \"What about the Crusades?\" reaction displayed by your good-self is inappropriate, and quite divisive... the sort of thing I'd expect an ill-educated atheist to say. I must say there is so much anti-Catholic feeling in Protestantism, that many of your collective salvos are in fact used by atheists to undermine all Christianity. Such as mentioning the Crusades. Even now Mohammedans likewise will quote with relish the writings of apologetic Catholics, and blinkered Protestants over this matter. The 'enemy' laugh at such divisions.\n \n If you were talking about another 'crusade' such as that of Charlemagne against the Saxons, or Heraclius against the Persians, or that of northern France against the Albergensians, or the Teutonic Knights against the Prussians, I did not pick that up. Please let me know, and I'd be more than happy to set them into context too.\n\n \n Montalban: There is no doubting your knowledge of history. I stand corrected. I DID read Parcum as saying the catholic church had no flaws. I also stand corrected on the divisiviness. Jesus in John 17 prayed that we would all be one. United to the Father. I will curb my attacks. They were actually a bit of a spat between Parcum and I. He had accused me of avoiding the topic and claimed it presented as weak. I was simply pointing out that he was not answering the question but attacking it. Also weak. However, irrelevant, as a christian I am charged with Behaving rightly regardless of another's actions.\n \n We could all easily point out all of the slaughter done in the name of Jesus over the years. I agree that may be a fruitless argument.\n \n Now a word to Rapture: Rapture, be careful of your predictions concerning Revelation. Remember the correct title of the book is \"The Revelation of Jesus Christ.\" The end times will be evident when they are upon us. Trying to predict their time of coming is fruitless. (I think it actually says that in one of the Gospels). Instead, look at the book for what it says about our Lord. He is portrayed as both merciful and just. \n \n Michael Card wrote a book on this book called \"Unveiled Hope\" I reccommend it highly to all christians of any denomination.", 
   {}, 
   19534, 
   null, 
   1066322820.0
  ], 
  [
   19574, 
   null, 
   "Parcum", 
   "Saint Malachy, who died in 1148, prophesied that the last pope would be a man known as Peter the Roman:\n \n  \"In extreme persecution, the seat of the Holy Roman Church will be occupied by Peter the Roman, who will feed the sheep through many tribulations, at the term of which the city of seven hills will be destroyed, and the dreadful Judge will judge the people.\"\n \n The city known for it's seven hills is Rome. I don't understand the debate, I almost probably is Rome. Constantinople was destroyed in 1453 while in the throne of Constantine XI and the city was renamed Istanbul. There are ruins of the old city such as the Hagia Sophia (converted to a Mosque, it is now a museum). I highly doubt that Sydney will be this \"Seven hilled City\". Will it be in Rome? We probably won't ever know until the end. I can certainly see it happening in Rome (Like Israel, it is literally in the center of the world), and quite possibly even a Pope could be the anti-Christ (of course, he wont be a real pope, but he'll call himself a Pope). \n \n \n I could see how one could get a puffed up heart like that being called Holy Father, as if God didn't exist,\n\n \n I don't see what the problem is calling him the Holy Father. It isn't wrong. Although the Bible says \"Call no man Father\", it obviously doesn't mean that we can't call anyone Father. We often call Pushkin the father of Russian literature. Oh! That's a sin! We call Teddy Roosevelt the father of the Industrial America. Can't do that! We even call our own parent \"father\". Should we refrain form that? Of course not. I've seen parents who are very holy. Is it bad to call the fathers holy? You're taking that passage out of context.\n \n Christ said he would never abandon us. What better way not to abandon us that declare Peter the head of the church and have holy men succeed him? The bible doesn't forbid it, it actually orders us to do it.  \"ap ena emar 'na l'akh d'at haw keepa w'al hade keepa aebneyh 'eedtee wartee dsheeol la nekh snaw nah\", and also  \"Kagoo de soi legoo hoti su ei Petros, kai epi tautee tee petra oikodomeesoo mou teen ekkleesian, kai pulai Hadou ou katischusousin autees.\". Obviously, Christ meant for Peter to be the foundation of his church on earth, and further, he wanted a \"Peter\" to always be on earth. \n \n Several churches believe in the Pope as the successor of Peter- not just the Romans- Byzantines, Assyrians, Malabar, Nestorians, Coptic, Ethiopian, and we even have the ancient Hebrew Catholics in Israel. They all have preserved their traditions for thousands of years and believe in the Papacy because of it. \n \n \n If it's not God's love it's not free, anyways, all the spirtualism, bowing and kissing images and corpses ect.... I think that stuff stems from merging with the pagans/wiccans/druids..ect.....in the R.C.C early history.\n\n \n This is the biggest misconception that Protestants bring over, and over, and over again. We in no way worship Mary, although many would consider it looks like it. Mary is in heaven, body and soul. She is really close to Jesus- he was her son! What not better saint to ask for prayers than Mary? We ask her to pray for us, just as I ask a fellow Christian to pray for us. We don't ask her for mercy- that's worship- we ask her to pray for us! Since Christ makes it clear those who are in heaven are truly alive, why shouldn't we ask them? \n \n In regards to kissing and talking to statues- what's the problem? When I go to a grave yard, I often talk to the person who was buried there. Is that wrong? Of course not. We've done this for thousands of years. Are we all of a sudden pagans for \"worshipping a body\"? No! It's always good to have visuals. Jews had statues and the such in their temples. Even the Ark of the Covenant has angels on it. Are the Jews pagan? No!", 
   {
    "unicode_changes_made": true
   }, 
   19558, 
   null, 
   1066331700.0
  ], 
  [
   19575, 
   null, 
   "epaphras_faith", 
   "Saint Malachy, who died in 1148, prophesied that the last pope would be a man known as Peter the Roman:\n \n  \"In extreme persecution, the seat of the Holy Roman Church will be occupied by Peter the Roman, who will feed the sheep through many tribulations, at the term of which the city of seven hills will be destroyed, and the dreadful Judge will judge the people.\"\n \n The city known for it's seven hills is Rome. I don't understand the debate, I almost probably is Rome. Constantinople was destroyed in 1453 while in the throne of Constantine XI and the city was renamed Istanbul. There are ruins of the old city such as the Hagia Sophia (converted to a Mosque, it is now a museum). I highly doubt that Sydney will be this \"Seven hilled City\". Will it be in Rome? We probably won't ever know until the end. I can certainly see it happening in Rome (Like Israel, it is literally in the center of the world), and quite possibly even a Pope could be the anti-Christ (of course, he wont be a real pope, but he'll call himself a Pope). \n \n \n \n I don't see what the problem is calling him the Holy Father. It isn't wrong. Although the Bible says \"Call no man Father\", it obviously doesn't mean that we can't call anyone Father. We often call Pushkin the father of Russian literature. Oh! That's a sin! We call Teddy Roosevelt the father of the Industrial America. Can't do that! We even call our own parent \"father\". Should we refrain form that? Of course not. I've seen parents who are very holy. Is it bad to call the fathers holy? You're taking that passage out of context.\n \n Christ said he would never abandon us. What better way not to abandon us that declare Peter the head of the church and have holy men succeed him? The bible doesn't forbid it, it actually orders us to do it.  \"ap ena emar 'na l'akh d'at haw keepa w'al hade keepa aebneyh 'eedtee wartee dsheeol la nekh snaw nah\", and also  \"Kagoo de soi legoo hoti su ei Petros, kai epi tautee tee petra oikodomeesoo mou teen ekkleesian, kai pulai Hadou ou katischusousin autees.\". Obviously, Christ meant for Peter to be the foundation of his church on earth, and further, he wanted a \"Peter\" to always be on earth. \n \n Several churches believe in the Pope as the successor of Peter- not just the Romans- Byzantines, Assyrians, Malabar, Nestorians, Coptic, Ethiopian, and we even have the ancient Hebrew Catholics in Israel. They all have preserved their traditions for thousands of years and believe in the Papacy because of it. \n \n \n \n This is the biggest misconception that Protestants bring over, and over, and over again. We in no way worship Mary, although many would consider it looks like it. Mary is in heaven, body and soul. She is really close to Jesus- he was her son! What not better saint to ask for prayers than Mary? We ask her to pray for us, just as I ask a fellow Christian to pray for us. We don't ask her for mercy- that's worship- we ask her to pray for us! Since Christ makes it clear those who are in heaven are truly alive, why shouldn't we ask them? \n \n In regards to kissing and talking to statues- what's the problem? When I go to a grave yard, I often talk to the person who was buried there. Is that wrong? Of course not. We've done this for thousands of years. Are we all of a sudden pagans for \"worshipping a body\"? No! It's always good to have visuals. Jews had statues and the such in their temples. Even the Ark of the Covenant has angels on it. Are the Jews pagan? No!\n\n \n I agree with you for the most part. I am still unclear on Peter and successors and he as the first pope. I am working on this issue. \n \n I am also not so certain that it is all that good to have visuals. God says to make no graven image. \n \n God is bigger than anything we can represent him with. I think we would all agree on that. Our imaginations were given to us for a reason, and that is to know God better, to see that which cannot be seen. By making an image of Jesus or Mary or God or Angels etc. etc., we may artificially limit what people think about God. I would think we would want people to see God for who he really is not how we might represent him. I think this makes him to small. That is why I believe he gave us the commandment about graven images. He knew that over time man would come to worship the image and not God.\n \n I do think think that there are images which are invaluable, rembrant's prodigal for instance. A powerful image that provokes the imagination for God and does not dull it. It was a self portrait in a way for rembrant.\n \n I am not saying that it is wrong to have such images but simply that they are not always good.", 
   {
    "unicode_changes_made": true
   }, 
   19574, 
   null, 
   1066332360.0
  ], 
  [
   19593, 
   null, 
   "Parcum", 
   " I am also not so certain that it is all that good to have visuals. God says to make no graven image.\n\n \n God ordered the Jews to build him a temple full of things that you would call \"graven images\". \n \n  \"And you shall make two cherubim of gold [i.e., two gold statues of angels]; of hammered work shall you make them, on the two ends of the mercy seat. Make one cherub on the one end, and one cherub on the other end; of one piece of the mercy seat shall you make the cherubim on its two ends. The cherubim shall spread out their wings above, overshadowing the mercy seat with their wings, their faces one to another; toward the mercy seat shall the faces of the cherubim be\" (Ex. 25:18-20)\n \n  \"for the altar of incense made of refined gold, and its weight; also his plan for the golden chariot of the cherubim that spread their wings and covered the ark of the covenant of the Lord. All this he made clear by the writing of the hand of the Lord concerning it all, all the work to be done according to the plan\" (1 Chr. 28:18-19)\n \n  \"On the walls round about in the inner room and [on] the nave were carved likenesses of cherubim.\" (Ezekiel 41:17-18)\n \n We have many statues in the United States- one of Abraham Lincoln. Are they wrong to have? No. Further, God told us that we must use these images in a ritual sense. \n \n  \"make [a statue of] a fiery serpent, and set it on a pole; and every one who is bitten, when he sees it shall live. So Moses made a bronze serpent, and set it on a pole; and if a serpent bit any man, he would look at the bronze serpent and live\" (Num. 21:8-9).\n \n That serpent was later worshipped by the Israelites, and so King Hezekiah destroyed it (2 Kings 18:4).\n \n God told us to look at the serpent to be healed. Hence, the serpent was used ritually, not just as religious symbolism. Catholics use images so that we can look at something to talk to. Sometimes it's easier to look at a statue or painting of a saint, then to imagine it in your head. In fact, wouldn't it be idolatry to imagine Christ on the cross? Of course not. It's good to imagine Christ on the cross so that we understand what he went through. However, I could never get a full glimpse of Christ on the cross until I look at an actual painting or statue, and thus if I look at a crucifix I see Christ's pain and suffering, and pray to him by looking at something that looks like him, the image. Just like when you think about your friends or relatives in a photo, we pray to Jesus by looking at his images. Nothing wrong there. \n \n What about bowing, kissing, et cetera? Japanese bow as a greeting. I bow before the Queen of England. But I'm not in anyway praying or worshipping these people as a God. \n \n \n I am still unclear on Peter and successors and he as the first pope. I am working on this issue.\n\n \n Please, feel free to ask :-)", 
   {
    "unicode_changes_made": true
   }, 
   19575, 
   null, 
   1066336560.0
  ], 
  [
   19603, 
   null, 
   "epaphras_faith", 
   "God ordered the Jews to build him a temple full of things that you would call \"graven images\". \n \n  \"And you shall make two cherubim of gold [i.e., two gold statues of angels]; of hammered work shall you make them, on the two ends of the mercy seat. Make one cherub on the one end, and one cherub on the other end; of one piece of the mercy seat shall you make the cherubim on its two ends. The cherubim shall spread out their wings above, overshadowing the mercy seat with their wings, their faces one to another; toward the mercy seat shall the faces of the cherubim be\" (Ex. 25:18-20)\n \n  \"for the altar of incense made of refined gold, and its weight; also his plan for the golden chariot of the cherubim that spread their wings and covered the ark of the covenant of the Lord. All this he made clear by the writing of the hand of the Lord concerning it all, all the work to be done according to the plan\" (1 Chr. 28:18-19)\n \n  \"On the walls round about in the inner room and [on] the nave were carved likenesses of cherubim.\" (Ezekiel 41:17-18)\n \n We have many statues in the United States- one of Abraham Lincoln. Are they wrong to have? No. Further, God told us that we must use these images in a ritual sense. \n \n  \"make [a statue of] a fiery serpent, and set it on a pole; and every one who is bitten, when he sees it shall live. So Moses made a bronze serpent, and set it on a pole; and if a serpent bit any man, he would look at the bronze serpent and live\" (Num. 21:8-9).\n \n That serpent was later worshipped by the Israelites, and so King Hezekiah destroyed it (2 Kings 18:4).\n \n God told us to look at the serpent to be healed. Hence, the serpent was used ritually, not just as religious symbolism. Catholics use images so that we can look at something to talk to. Sometimes it's easier to look at a statue or painting of a saint, then to imagine it in your head. In fact, wouldn't it be idolatry to imagine Christ on the cross? Of course not. It's good to imagine Christ on the cross so that we understand what he went through. However, I could never get a full glimpse of Christ on the cross until I look at an actual painting or statue, and thus if I look at a crucifix I see Christ's pain and suffering, and pray to him by looking at something that looks like him, the image. Just like when you think about your friends or relatives in a photo, we pray to Jesus by looking at his images. Nothing wrong there. \n \n What about bowing, kissing, et cetera? Japanese bow as a greeting. I bow before the Queen of England. But I'm not in anyway praying or worshipping these people as a God. \n \n \n \n Please, feel free to ask :-)\n\n \n Please note that the graven images I think are harmful are the ones of God, or Jesus. Others, are art. Like I said, the rembrant painting draws me to God. My objection was simply that representations of God or Jesus or even Mary can make our image of God to small. I include Mary because, while many catholics (and perhaps orthodox) ask Mary to pray for them, there are many that venerate Mary to the point of God hood. \n \n An Abe Lincoln statue could do harm if people considered him God. I don't think anyone does at this point though.\n \n How does the catholic faith see the graven images thing?\n \n As a point of curiosity, and feel free to answer in a PM instead of this thread, Do you or anyone know where the crucifix vs. just the cross came from?", 
   {
    "unicode_changes_made": true
   }, 
   19593, 
   null, 
   1066342440.0
  ], 
  [
   19609, 
   null, 
   "Parcum", 
   " Please note that the graven images I think are harmful are the ones of God, or Jesus. Others, are art. Like I said, the rembrant painting draws me to God. My objection was simply that representations of God or Jesus or even Mary can make our image of God to small. I include Mary because, while many catholics (and perhaps orthodox) ask Mary to pray for them, there are many that venerate Mary to the point of God hood.\n\n \n God doesn't have a body, so being \"small\" or \"big\" matters not. The point is proving his magnificence and benevolence, and we have successfully done that. I don't see anything wrong with showing his goodness to us through statues that remind us of him. \n \n Many of the Eastern Catholic Churches believe that statues are wrong, so they have Iconography. This way, they can prove the benevolence of God without making people look like they are worshipping statues of God, and understand that Christ is in the Eucharist, not in a statue.", 
   {
    "unicode_changes_made": true
   }, 
   19603, 
   null, 
   1066346160.0
  ], 
  [
   19676, 
   null, 
   "montalban", 
   "Parcum, it is the idea of Rapture to connect Rome to the city of seven hills in the Bible, and therefore to prove that Rome is the seat of the anti-Christ.\n \n However, we've digressed for a wee moment.\n \n \nGod doesn?t have a body, so being ?small? or ?big? matters not. The point is proving his magnificence and benevolence, and we have successfully done that. I don?t see anything wrong with showing his goodness to us through statues that remind us of him. \n \n Many of the Eastern Catholic Churches believe that statues are wrong, so they have Iconography. This way, they can prove the benevolence of God without making people look like they are worshipping statues of God, and understand that Christ is in the Eucharist, not in a statue.\n\n \n So, I'll continue briefly, if I can indulge your time...\n \n Also, Orthodoxy doesn't depict God the Father. So, we'd never have had that famous scene on the Sistine Chapel with God about to give life to Adam - where God is portrayed as an old man.\n \n God the Father is essentially indescribable. God the Son, however took on the human form. therefore we see no reason not to portray him.\n \n The first time I went into an Orthodox Church (I am a convert), I noticed people kissing the icons. This was something that I was uncomfortable with. Then I recalled that people kiss the sceptre of their king, or the hem of a flag.\n \n Orthodoxy had some run ins with iconoclasm; the destruction of images. There was even a council c.700s that condemned icons. However the people rejected it so it never became Orthodox, and icons were restored.\n \n We believe that in our service all the senses experience God.\n Seeing the icons\n Hearing the Gospel\n Tasting the Holy Communion\n Smelling the incense\n Touching the icons\n \n But getting back to the anti-Christ...\n \n \"...the vast majority of the early Christians, (were) amillennilist. The ancient Church taught that the millennium of Revelation 20 is a present reality as Christ reigns through His Church. In other words, the millennium is now, the Church Age. According to the early Church, opposition to Christ's reign will continue to escalate until it climaxes with the rise of the Antichrist and the final persecution of the Church...\" \"Voice in the Wilderness\", Vol 11, No1 Jan-Mar 2003, p24 (published by the Greek Orthodox Archdiocese of Australia).\n \n Thus the anti-Christ is not just anti-Christian, but anti-Church! I believe Catholics think along these lines too.", 
   {}, 
   19609, 
   null, 
   1066402140.0
  ], 
  [
   19742, 
   null, 
   "rapture", 
   "This is the biggest misconception that Protestants bring over, and over, and over again. We in no way worship Mary, although many would consider it looks like it[. Mary is in heaven, body and soul. She is really close to Jesus- he was her son! What not better saint to ask for prayers than Mary? We ask her to pray for us, just as I ask a fellow Christian to pray for us. We don't ask her for mercy- that's worship- we ask her to pray for us! Since Christ makes it clear those who are in heaven are truly alive, why shouldn't we ask them? \n\n \n \n \n One place in the Bible where Mary is assigned mediator between God and men? To pray for our dirty sin's? Peradventure, say Mary was put in such a postion...what do humans give her out of the deal? Nothing for Something? The Pope just ordered, here recent, the laity to dedicate prayers/worship to Mary -\n \n \n \nI don't see what the problem is calling him the Holy Father. It isn't wrong. Although the Bible says \"Call no man Father\", it obviously doesn't mean that we can't call anyone Father. We often call Pushkin the father of Russian literature. Oh! That's a sin! We call Teddy Roosevelt the father of the Industrial America. Can't do that! We even call our own parent \"father\". Should we refrain form that? Of course not. I've seen parents who are very holy. Is it bad to call the fathers holy? You're taking that passage out of context.\n\n \n I can think of one HE IS NOT THE HOLY Father. He might be somebody's father, as many Popes were, but not the Holy Father. There is only one of those and he's not even human,nevertheless, I can see how Lucifer already has it made- a breeze. Whoever sits in Vaticans throne is automatically Holy Father with billions of followers to stroke his wicked ego. He dammned his soul to be worshiped", 
   {
    "unicode_changes_made": true
   }, 
   19676, 
   null, 
   1066414860.0
  ], 
  [
   19746, 
   null, 
   "epaphras_faith", 
   "God doesn't have a body, so being \"small\" or \"big\" matters not. The point is proving his magnificence and benevolence, and we have successfully done that. I don't see anything wrong with showing his goodness to us through statues that remind us of him. \n \n Many of the Eastern Catholic Churches believe that statues are wrong, so they have Iconography. This way, they can prove the benevolence of God without making people look like they are worshipping statues of God, and understand that Christ is in the Eucharist, not in a statue.\n\n \n I like the digression more than the topic I am afraid. The Big or small I am talking about is that we, in our minds, limit what we think about God. He is magnificient. I ask this question of all believers, Is God so big that you are willing to allow calamity to fall on your children, husbands, wives, friends, yourselves, knowing that God will use it for their good? Now I do not say that you or God cause it, but like Job, will you accept calamity with the good? I have a friend with ALS. He will likely die soon. He did not have it 2 years ago when I met him. I first got to know him as he was getting the diagnosis. He and his wife and five children are struggling with this concept right now. How big do you really see God, and please be honest?", 
   {
    "unicode_changes_made": true
   }, 
   19609, 
   null, 
   1066415760.0
  ], 
  [
   19774, 
   null, 
   "Parcum", 
   " I like the digression more than the topic I am afraid. The Big or small I am talking about is that we, in our minds, limit what we think about God\n\n \n If that's your opinion, fine, don't look at images of God. But don't stop others from trying to increase their holiness.\n \n \n How big do you really see God, and please be honest?\n\n \n One cannot even imagine God's magnificence. We aren't even worthy to look at him. \n \n \n One place in the Bible where Mary is assigned mediator between God and men? To pray for our dirty sin's? Peradventure, say Mary was put in such a postion...what do humans give her out of the deal? Nothing for Something? The Pope just ordered, here recent, the laity to dedicate prayers/worship to Mary -\n\n \n A) Saints are in heaven.\n B) People in heaven are alive.\n C) People in heaven can hear us.\n \n If people in heaven are alive and can hear us, why not ask them to pray for us? Show me one biblical verse that says it's wrong to pray to saints. You wont find any. \n \n \n He might be somebody's father, as many Popes were,\n\n \n Two, my friend. Not many, two.\n \n \n I can think of one HE IS NOT THE HOLY Father. He might be somebody's father, as many Popes were, but not the Holy Father. There is only one of those and he's not even human,nevertheless, I can see how Lucifer already has it made- a breeze. Whoever sits in Vaticans throne is automatically Holy Father with billions of followers to stroke his wicked ego. He dammned his soul to be worshiped\n\n \n It's not wrong to call somebody a \"Holy\" Father. Why should it be? The man is in the seat of Peter! Is it wrong to my dad a \"Holy Father\"? Is it wrong to name my child \"Holy\"? There's nothing wrong with it. It's just a title like we call a King, Queen, et cetera. Speaking of which, shouldn't we not call Kings, \"Kings\"? Christ is the King, not a leader of England. What about the Holy Roman Emperor? It's not wrong to give somebody the title of \"Holy Father\", especially when the man who is the Holy Father is truly a holy man. Being called \"Holy\" is not the same as being called \"God\". God isn't just holy- he's all goodness.", 
   {
    "unicode_changes_made": true
   }, 
   19746, 
   null, 
   1066428780.0
  ], 
  [
   19777, 
   null, 
   "epaphras_faith", 
   "If that's your opinion, fine, don't look at images of God. But don't stop others from trying to increase their holiness.\n \n One cannot even imagine God's magnificence. We aren't even worthy to look at him. \n \n \n\n \n If you actually believe that looking at images will increase your holiness, when that is strictly an act of God, you might want to think again.\n \n So what if you cannot actually fully imagine God's magnificance, why wouldn't you want to try? Plus you didn't really answer the questions. We are not worthy but we are given free access to Him. We can walk boldly into the presence of God (the apostle Paul). We call him Abba Father. Literally, Daddy!\n \n Answer the questions, are you willing to place yourself and more specifcally your loved ones into harms way knowing that it is from God? That is what the apostles did.\n \n I can truly say, that while I hope that I would, I sometimes question that very thing. I sure don't like it when calamity comes. could you be like Job?", 
   {
    "unicode_changes_made": true
   }, 
   19774, 
   null, 
   1066429080.0
  ], 
  [
   19784, 
   null, 
   "Parcum", 
   " If you actually believe that looking at images will increase your holiness, when that is strictly an act of God, you might want to think again.\n\n \n It certainly can. If you pray to Jesus and look at a picture of him, you meditate better. You can have a visual of Christ suffering on the cross to truly understand why he died for us. \n \n \n So what if you cannot actually fully imagine God's magnificance, why wouldn't you want to try? Plus you didn't really answer the questions. We are not worthy but we are given free access to Him. We can walk boldly into the presence of God (the apostle Paul). We call him Abba Father. Literally, Daddy!\n\n \n Let me say a few things, firstly, Catholics don't really have paintings of God (the father). We have a few, but they aren't for meditative purposes, they are for artistic ones. We do, however, have statues and paintings of Jesus and the Holy Spirit, but that's only because we know what they look like. Although we don't know what the Holy Spirit looks like, we know how he has come onto earth, as a dove. So we make a painting of a dove. \n \n \n Answer the questions, are you willing to place yourself and more specifcally your loved ones into harms way knowing that it is from God? That is what the apostles did.\n\n \n \n I can truly say, that while I hope that I would, I sometimes question that very thing. I sure don't like it when calamity comes. could you be like Job?\n\n \n What are the purposes of these questions?", 
   {
    "unicode_changes_made": true
   }, 
   19777, 
   null, 
   1066430400.0
  ], 
  [
   19796, 
   null, 
   "epaphras_faith", 
   "It certainly can. If you pray to Jesus and look at a picture of him, you meditate better. You can have a visual of Christ suffering on the cross to truly understand why he died for us. \n \n Let me say a few things, firstly, Catholics don't really have paintings of God (the father). We have a few, but they aren't for meditative purposes, they are for artistic ones. We do, however, have statues and paintings of Jesus and the Holy Spirit, but that's only because we know what they look like. Although we don't know what the Holy Spirit looks like, we know how he has come onto earth, as a dove. So we make a painting of a dove. \n \n What are the purposes of these questions?\n\n \n On your first paragraph, point taken, but just to be clear, the looking at the picture is not what will make you holy, it is not some infernal lamp to rub. It is the meditating on God. (Phil 4, if there is anything of good repute........meditate on these things). God is sho makes you holy, your meditation places you so as to receive this gift.\n \n as to your question, the purposes of my questions are to get you to look at what you believe and apply it directly to your life. If we do not apply scripture to our lives then, as Paul says, it is like looking in a mirror and going away with broccoli in your teeth still (a paraphrase but accurate). \n \n Are you willing to rest your life and the lives of those you love squarely on God and nothing else? Are you willing to accept calamity as Job did from the hand of God. The questions are intended to help you understand just how big God is to you. I know I am quite a bit older and have been closer to death (most likely) so I just wanted you to consider that maybe you don't see God as big enough and that, through your imagination you can enlargen your view of Him.\n \n This was my point in graven images. It defines God way to small for me. certainly meditation is an excellent discipline and if the image is helpful for your imagination, then by all means do so. \n \n Allow me to challenge you with something a little different. Try listening to meditative music instead of staring at a picture. Close your eyes and imagine. \n \n I believe the imagination is where the seen meets the unseen. It is a place where we meet the Spirit of God. \n \n peace to you", 
   {
    "unicode_changes_made": true
   }, 
   19784, 
   null, 
   1066433580.0
  ], 
  [
   19801, 
   null, 
   "Parcum", 
   " On your first paragraph, point taken, but just to be clear, the looking at the picture is not what will make you holy, it is not some infernal lamp to rub. It is the meditating on God. (Phil 4, if there is anything of good repute........meditate on these things). God is sho makes you holy, your meditation places you so as to receive this gift.\n\n \n Well, yes, looking at the picture will make you holier, but looking at the picture alone wont make you holy. You must pray that God will make you holier. I think we've cleared up this issue. \n \n \n Allow me to challenge you with something a little different. Try listening to meditative music instead of staring at a picture. Close your eyes and imagine.\n\n \n I'm a pianist, so of course I know how powerful music can be to your imagination, and emotionally (ever have an emotional brake down on a beautiful piece? I used to make fun of people who did that... and then found myself doing the same. I still make fun of people who do that though). However, art can also give you an imagination. This was the point of the Renaissance, the rebirth of art, the rebirth of emotion, the rebirth of everything that was destroyed in the Roman Empire. \n \n \n God is sho\n\n \n ? LOL that sounds like something my Russian-immigrant neighbor would say. \"God. Is. Sho\". LOL hahaha. Peraps a clarification? :P", 
   {
    "unicode_changes_made": true
   }, 
   19796, 
   null, 
   1066435920.0
  ], 
  [
   19805, 
   null, 
   "i-wonder", 
   "This thread has really got me thinking. Being a \"Protestant\" for 20 years I was involved in Baptist, Pentecoastal, Methodist and non-denominational. It was only a year or so ago I had started thinking (as opposed to feeling) about some of the things I was taught. The first being the pre-trib rapture. I quite haven't come to grip with that...a general reading of the New Testament doesn't support it.\n \n Now I see some things about Catholosism posted here that, if true, will keep me awake many nights asking, seeking and knocking. \n \n It seems to me that the link below has answered many of my own questions concerning the diffrent denominations. \n \n http://www.str.org/free/commentaries/theology/whatis.htm\n \n As for now, I'm being very cautiously optimistic, willing to learn cuz I sure don't KNOW.\n \n PEACE", 
   {}, 
   19796, 
   null, 
   1066436760.0
  ], 
  [
   19806, 
   null, 
   "epaphras_faith", 
   "Well, yes, looking at the picture will make you holier, but looking at the picture alone wont make you holy. You must pray that God will make you holier. I think we've cleared up this issue. \n \n \n \n I'm a pianist, so of course I know how powerful music can be to your imagination, and emotionally (ever have an emotional brake down on a beautiful piece? I used to make fun of people who did that... and then found myself doing the same. I still make fun of people who do that though). However, art can also give you an imagination. This was the point of the Renaissance, the rebirth of art, the rebirth of emotion, the rebirth of everything that was destroyed in the Roman Empire. \n \n \n \n ? LOL that sounds like something my Russian-immigrant neighbor would say. \"God. Is. Sho\". LOL hahaha. Peraps a clarification? :P\n\n \n oops - God is WHO makes you holy. emoticon_cry emoticon_xangel emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   19801, 
   null, 
   1066436940.0
  ], 
  [
   19807, 
   null, 
   "epaphras_faith", 
   "This thread has really got me thinking. Being a \"Protestant\" for 20 years I was involved in Baptist, Pentecoastal, Methodist and non-denominational. It was only a year or so ago I had started thinking (as opposed to feeling) about some of the things I was taught. The first being the pre-trib rapture. I quite haven't come to grip with that...a general reading of the New Testament doesn't support it.\n \n Now I see some things about Catholosism posted here that, if true, will keep me awake many nights asking, seeking and knocking. \n \n It seems to me that the link below has answered many of my own questions concerning the diffrent denominations. \n \n http://www.str.org/free/commentaries/theology/whatis.htm\n \n As for now, I'm being very cautiously optimistic, willing to learn cuz I sure don't KNOW.\n \n PEACE\n\n \n Very cool and welcome. I am uncertain on the whole pre trib, post trib, amillenial, pre millenial, post millenial etc. I have checked it out often. I choose the pre-trib rapture because I like it best (frankly). However, it matters little which is true - either way the signs will be unmistakeable.", 
   {}, 
   19805, 
   null, 
   1066437120.0
  ], 
  [
   19811, 
   null, 
   "Parcum", 
   "Sometimes when the truth hits you, it hits you hard. I know several people who have gone through much confusion trying to find out about catholicism. Some of them stayed protestants; others joined the church.", 
   {}, 
   19807, 
   null, 
   1066438140.0
  ], 
  [
   19880, 
   null, 
   "maximus", 
   "Epaphras,\n I cannot fully answer your question on Christ's blood cleansing us. I would have to do more study. If you find the online catechism then these paragraphs may be related 601-618 and 1987-2011 (sections on justification, grace, and merit). \n \n A few quick words on the Crusades...they were a response to Muslim aggression. And if it weren't for the defense of the Crusaders, Islam would perhaps dominate the world today. (This is not to say there were not abuses but these acts were not sanctioned by the Church).\n \n A few quick words on icons...Stro and I had a discussion on this topic on the \"What's Wrong with Catholicism\" thread. I think Montalban has an essential point when he talks of Christ coming among us. Christ became the face of God when in the past God had been faceless. Christ became an icon of God. This changed things forever from what the Jews had known in the past. Parcum cited important scripture concerning idols. One can look at Exodus 25:18-19, 1 Kings 6:23-29, and 1 Kings 7:25-45. Aren't the cherubim described a \"likeness\" of that which is \"in heaven?\" What does God mean when he says in Exodus 20:4-5 that we can't make any images of things in earth or sea? He is clearly outlawing worship of these images as a god--idolatry. He is not outlawing the images themselves. He is seeking to prevent a golden cow.\n \n Icons stir the heart and increase one's comprehension. More from my other post:\n \n Why do we have crucifixes? for a deeper meditation on and understanding of the pain and suffering Jesus went through to save us and with this a realization of how far we must actually go as Christians in living a Christian life\n \n Why do we have statues of saints? to embrace the models that the saints have given us walking in the pathway of Christ so that we may attempt to walk more suitably along that road \"I urge you, then, be imitators of me. Therefore I sent to you Timothy, my beloved and faithful child in the Lord, to remind you of my ways in Christ, as I teach them everywhere in every church\" (1 Cor. 4:16-17)\n \n Anyway, the worry of idol worship should not be restricted to Catholics. Kids and adults of all creeds are more likely to idolize (yes, often in a sinful sense) rock stars, sports heroes, movie stars, etc. Have you seen the fan shows on MTV and VH1? People setting their lives up around rock stars. Tattoos and tears for these idols?...acting as if an autograph is as valuable as the word of the Lord.", 
   {
    "unicode_changes_made": true
   }, 
   19811, 
   null, 
   1066463400.0
  ], 
  [
   19882, 
   null, 
   "montalban", 
   "Anyway, the worry of idol worship should not be restricted to Catholics. Kids and adults of all creeds are more likely to idolize (yes, often in a sinful sense) rock stars, sports heroes, movie stars, etc. Have you seen the fan shows on MTV and VH1? People setting their lives up around rock stars. Tattoos and tears for these idols?...acting as if an autograph is as valuable as the word of the Lord.\n\n \n I do think that \"Thou shalt have no other gods...\" also refers to this. Some people make money or career their god.\n \n We seem to have moved far away from the anti-Pope rantings that started this thread.\n \n As an Orthodox, I'm not pro-Pope, with regards to the claims of his office. However, he is the head of the 'sister' church, and no one seems to recognise the good that Catholics do", 
   {}, 
   19880, 
   null, 
   1066463940.0
  ], 
  [
   19886, 
   null, 
   "maximus", 
   "Mont,\n Amen on the career and money stuff. I have to beat myself into submission at times being a product of the U.S. capitalist system.", 
   {}, 
   19882, 
   null, 
   1066464420.0
  ], 
  [
   19888, 
   null, 
   "epaphras_faith", 
   "Mont,\n Amen on the career and money stuff. I have to beat myself into submission at times being a product of the U.S. capitalist system.\n\n \n Max: Take your time I am still working on your peter stuff. \n \n Mont: I agree with you about money and career etc. \n \n I would ask the same questions of you that I did of Parcum? Do you think of God as so big as to be able to accept calamity in yourself or your family (in particular children) from the hand of God? Is God able to handle the war in Iraq for instance (if any of you have relatives or friends there as I do) or Is He trust worthy enough to care for you even if one of your parents or spouse gets hooked on a drug(s)?\n \n I ask not to argue it with you but to charge you with seeing more of God than you do currently (always a good thing don't you think?)", 
   {}, 
   19886, 
   null, 
   1066464900.0
  ], 
  [
   19904, 
   null, 
   "montalban", 
   "Although not Orthodox teaching, but my own; the issue of money in the Bible is why I lean towards socialism. (You might disagree - fair enough).\n \n Getting back to the Pope bits.\n \n A few years ago, my good Protestant friend decided to do an Honours course on Martin Luther. I decided to help point him in the right direction with some information - and in looking up some web-sites I stumbled upon www.reformation.org\n \n This is the sort of site that's right up Rapture's alley. I was surprised to find a Catholic 'end times' site (http://www.icubed.com/~rpoe/endtimes.htm)\n \n One of my things is to read about cultic behaviours (including those in mainstream religions)*, and the machinations of people on the fringes of society.**\n \n If you type TEOTWAWKI into a search engine*** and see what crops up.\n \n \n *Mainstream cults - This is not an oxymoron.\n http://www.littlepebble.org\n is a group of Catholics who are not mainstream.\n \n **Montalban is the name a mythical castle for people who didn't quite fit in anywhere. I have never much been able to fit in well with any group.\n \n ***It stands for The End Of The World As We Know It", 
   {}, 
   19888, 
   null, 
   1066479360.0
  ], 
  [
   19913, 
   null, 
   "rapture", 
   "A) Saints are in heaven.\n \n \n Agreed\n \n \nB) People in heaven are alive.\n \n \n I hope so\n \n \nC) People in heaven can hear us.\n \n \n What scripture? \n \n \nIf people in heaven are alive and can hear us, why not ask them to pray for us? Show me one biblical verse that says it's wrong to pray to saints. You wont find any.\n \n \n It's not a question of right or wrong. It's just not scriptural, anywhere, further isn't there some kind of penalty for adding or taking away from God's word? \n \n \n 1 Peter 1:18\n \n Ye also, as lively stones, are built up a spirtual house, an holy priesthood, to offer up spiritual sacrifices, acceptable to God by Jesus Christ\n \n Not the Saints\n \n \n \nTwo, my friend. Not many, two.\n\n \n I was speaking of the former Popes as well\n \n \n \n \nIt's not wrong to call somebody a \"Holy\" Father. Why should it be?\n\n \n \n Even though the SCRIPTURES say not to do so? And what mammel on Earth is flawless or equal to God?\n \n \n \nThe man is in the seat of Peter!\n\n \n  ODD....The R.C.C doesn't follow the teaching's of Peter, and Peter was a disciple of Christ\n \n \n \nIs it wrong to my dad a \"Holy Father\"?\n \n Is it wrong to name my child \"Holy\"? There's nothing wrong with it. It's just a title like we call a King, Queen, et cetera. Speaking of which, shouldn't we not call Kings, \"Kings\"? Christ is the King, not a leader of England. What about the Holy Roman Emperor? It's not wrong to give somebody the title of \"Holy Father\", especially when the man who is the Holy Father is truly a holy man. Being called \"Holy\" is not the same as being called \"God\". God isn't just holy- he's all goodness.\n\n \n We are told to cast down reasonings, nevertheless, Look back through history at all the wicked Popes all called Holy Father. \n It's not natural for a man to want to take the Glory from God and be worshipped himself. If I RECALL that is Lucifer insane mission", 
   {
    "unicode_changes_made": true
   }, 
   19774, 
   null, 
   1066497960.0
  ], 
  [
   19921, 
   null, 
   "Parcum", 
   " What scripture?\n\n \n Revalation 5:8:\n \n \"And when he had opened the book, the four living creatures and the four and twenty ancients fell down before the Lamb, having every one of them harps and golden vials full of odours, which are the prayers of saints.\"\n \n \n Not the Saints\n\n \n That's your conclusion. They never said anywhere that Saints cannot hear us- only that they can. \n \n \n I was speaking of the former Popes as well\n\n \n What? What a perverted mind! To claim that one of the holiest person on earth would do such a thing. This is the truth of Jack Chick Protestants like yourselves- you claim to \"love\" Catholics, when the truth is you hate them. I'm starting to wonder if Jack Chick himself in the antichrist. \n \n \n Even though the SCRIPTURES say not to do so? And what mammel on Earth is flawless or equal to God?\n\n \n Nobody is equal to God, and nobody one currently on earth is flawless. However, there certainly are Holy people. Holy people doesn't mean that they are flawless, there were many holy people who aren't flawless. Peter was holy, but obviously not flawless. Paul was holy, but not flawless. Many people were holy and not flawless. \n \n \n We are told to cast down reasonings, nevertheless, Look back through history at all the wicked Popes all called Holy Father. \n It's not natural for a man to want to take the Glory from God and be worshipped himself. If I RECALL that is Lucifer insane mission\n\n \n I wouldn't say there were any \"wicked\" popes. There were certainly corrupt ones, but none who were \"wicked\". \"Wicked\" is a very strong word, more close to \"evil\", whjch isn't so. I'm sure every pope we have had was and is holy, and the popes to come will be holy. Will they be flawless and incorrupt? Of course not. But they can still be considered holy. \n \n Your argument seems to be made up of puerile attempts to criticize the church and attack Catholics. I recommend you begin acting more mature.", 
   {
    "unicode_changes_made": true
   }, 
   19913, 
   null, 
   1066519920.0
  ], 
  [
   19935, 
   null, 
   "rapture", 
   "=Parcum]Revalation 5:8:\n \n \"And when he had opened the book, the four living creatures and the four and twenty ancients fell down before the Lamb, having every one of them harps and golden vials full of odours, which are the prayers of saints.\"\n\n \n So you equate the Saints with the followers of the R.C.C.?\n \n \n \n \nThat's your conclusion. They never said anywhere that Saints cannot hear us- [b]only that they can.\n \n \n \n What scripture?\n \n \n \n \nWhat? What a perverted mind! To claim that one of the holiest person on earth would do such a thing. This is the truth of Jack Chick Protestants like yourselves- you claim to \"love\" Catholics, when the truth is you hate them. I'm starting to wonder if Jack Chick himself in the antichrist. \n\n \n Come off of it- POPES HAD ILLEGETIMATE CHIDREN and Where do you find hate?\n \n \n \n \nNobody is equal to God, and nobody one currently on earth is flawless. However, there certainly are Holy people. Holy people doesn't mean that they are flawless, there were many holy people who aren't flawless. Peter was holy, but obviously not flawless. Paul was holy, but not flawless. Many people were holy and not flawless.\n \n \n And for that very reason nobody should be addressed Holy Father\n \n \n \n \nI wouldn't say there were any \"wicked\" popes. There were certainly corrupt ones, but none who were \"wicked\". \"Wicked\" is a very strong word, more close to \"evil\", whjch isn't so. I'm sure every pope we have had was and is holy, and the popes to come will be holy. Will they be flawless and incorrupt? Of course not. But they can still be considered holy.\n \n \n Yeah if Hitler is considered Holy as well \n \n \n \n \nYour argument seems to be made up of puerile attempts to criticize the church and attack Catholics. I recommend you begin acting more mature.\n\n \n \n What argument? And have I spoken lies", 
   {
    "unicode_changes_made": true
   }, 
   19921, 
   null, 
   1066531440.0
  ], 
  [
   19939, 
   null, 
   "montalban", 
   " What argument? And have I spoken lies\n\n \n Aren't you arguing? You seem to be. What is it you think you are doing? I do think that your post is so full of hate that you don't even know what you are doing, let alone saying. \n \n e.g.\n \n \n Yeah if Hitler is considered Holy as well\n \n \n Are you trying to compare the murder of millions to infidelity? How gross. I suppose therefore if I steal a postage stamp from work, that I too am as bad as Hitler. You've made all sins equal...But then as a Protestant, what's it matter what sin is committed, because either you're saved or not. So, it's a non-argument on your own level.\n \n As to which Scripture...\n \n \"From the parable of the Lord about the rich man and Lazarus (Luke 16:19-31) we know that Abraham, being in heaven, could hear the cry of the rich man who was suffering in hell, despite the \"great gulf\" that separates them. The words of Abraham about the rich man's brethren, \"They have Moses and the prophets; let them hear them\" (Luke 16:29), clearly indicate that Abraham knows the life of the Hebrew people which has occurred after his death; he knows of Moses and the Law, of the prophets and their writings.\"\n http://www.orthodox.net/articles/communion-with-the-saints-fr-michael-pomazansky.html\n \n Clearly the dead can hear.", 
   {}, 
   19935, 
   null, 
   1066533540.0
  ], 
  [
   19943, 
   null, 
   "Parcum", 
   " Come off of it- POPES HAD ILLEGETIMATE CHIDREN and Where do you find hate?\n\n \n Two popes had illegitimate children, and the current Pope is definitely not one of them!\n \n \n And for that very reason nobody should be addressed Holy Father\n\n \n Why not? Give me one scriptural reason why it is wrong. He's a father, and he's holy. Why not call him the holy father?\n \n \n Yeah if Hitler is considered Holy as well\n\n \n What ridiculousness are you talking about now? Comparing Popes to Hitler? What perversion! \n \n \n What argument? And have I spoken lies\n\n \n You make scandalous lies that the current pope has illegitimate children, you have given no biblical support for your argument, you have ignored my biblical support, you have attacked the Church complaining about it's corruptness, and over all are a very childish person.", 
   {
    "unicode_changes_made": true
   }, 
   19939, 
   null, 
   1066539000.0
  ], 
  [
   19953, 
   null, 
   "maximus", 
   "I would ask the same questions of you that I did of Parcum? Do you think of God as so big as to be able to accept calamity in yourself or your family (in particular children) from the hand of God? Is God able to handle the war in Iraq for instance (if any of you have relatives or friends there as I do) or Is He trust worthy enough to care for you even if one of your parents or spouse gets hooked on a drug(s)?\n \n I ask not to argue it with you but to charge you with seeing more of God than you do currently (always a good thing don't you think?)\n\n \n I don't understand the question. Can you re-word it or elaborate? Can God accept calamity in myself or family from the hand of God? Or can I accept calamity as being from the hand of God?", 
   {}, 
   19888, 
   null, 
   1066544820.0
  ], 
  [
   19954, 
   null, 
   "maximus", 
   "Although not Orthodox teaching, but my own; the issue of money in the Bible is why I lean towards socialism. (You might disagree - fair enough).\n\n \n Mont,\n Perhaps we are opening another thread but I think socialism fails miserably in lining up with Christian thought. But so does capitalism. Socialism takes away freedom. In socialism we lose our freedom to the government but in capitalism we lose it to corporations. We have communal life in socialism but really no life--plus it fosters dependence. We have freedom in capitalism but money becomes our God. G.K. Chesterton wrote cleverly on this. He has some killer quotes destroying both philosophies--you should hear them. I don't have the book with me now. \n \n There must be a middle road between capitalism and socialism. I didn't know one existed. But one does--distributism. I am not very familiar with it as I have just learned about it. Put in a web search on it and you will find a few sites with introductions to it. I think the theory began with a papal encyclical Rerum Novarem.", 
   {}, 
   19904, 
   null, 
   1066545300.0
  ], 
  [
   19957, 
   null, 
   "montalban", 
   "Mont,\n Perhaps we are opening another thread but I think socialism fails miserably in lining up with Christian thought. But so does capitalism. Socialism takes away freedom. In socialism we lose our freedom to the government but in capitalism we lose it to corporations. We have communal life in socialism but really no life--plus it fosters dependence. We have freedom in capitalism but money becomes our God. G.K. Chesterton wrote cleverly on this. He has some killer quotes destroying both philosophies--you should hear them. I don't have the book with me now. \n \n There must be a middle road between capitalism and socialism. I didn't know one existed. But one does--distributism. I am not very familiar with it as I have just learned about it. Put in a web search on it and you will find a few sites with introductions to it. I think the theory began with a papal encyclical Rerum Novarem.\n\n \n I believe in Acts they gave all their money to one person who dished it out on a needs basis.\n \n or\n \n \"from each according to their ability to each according to their needs\" - Karl Marx\n \n If the state is democratic I have no problem submitting to it (for the most part).", 
   {}, 
   19954, 
   null, 
   1066546020.0
  ], 
  [
   19964, 
   null, 
   "Parcum", 
   "This makes me want to read some Adam Smith.", 
   {}, 
   19957, 
   null, 
   1066547940.0
  ], 
  [
   19967, 
   null, 
   "montalban", 
   "This makes me want to read some Adam Smith.\n\n \n Was he a Christian? (not that Marx was).", 
   {}, 
   19964, 
   null, 
   1066561560.0
  ], 
  [
   19994, 
   null, 
   "Parcum", 
   "He was nothing. He said he wasn't a skeptic or atheist in the book.", 
   {}, 
   19967, 
   null, 
   1066586820.0
  ], 
  [
   20022, 
   null, 
   "rapture", 
   "=montalban]Aren't you arguing? You seem to be. What is it you think you are doing? I do think that your post is so full of hate that you don't even know what you are doing, let alone saying. \n\n \n \n Talking..Where is the Hate?\n \n \n \n \n \n \nAre you trying to compare the murder of millions to infidelity?[/B] How gross. I suppose therefore if I steal a postage stamp from work, that I too am as bad as Hitler. You've made all sins equal...But then as a Protestant, what's it matter what sin is committed, because either you're saved or not. So, it's a non-argument on your own level.\n\n \n \n No \n \n \nAs to which Scripture...\n \n \"From the parable of the Lord about the rich man and Lazarus (Luke 16:19-31) we know that Abraham, being in heaven, could hear the cry of the rich man who was suffering in hell, despite the \"great gulf\" that separates them. The words of Abraham about the rich man's brethren, \"They have Moses and the prophets; let them hear them\" (Luke 16:29), clearly indicate that Abraham knows the life of the Hebrew people which has occurred after his death; he knows of Moses and the Law, of the prophets and their writings.\"\n http://www.orthodox.net/articles/communion-with-the-saints-fr-michael-pomazansky.html\n\n \n Where is the scripture that makes Saints mediators between God and Men? Likewise one for Mary? That's what I requested", 
   {}, 
   19939, 
   null, 
   1066601100.0
  ], 
  [
   20023, 
   null, 
   "rapture", 
   "=Parcum]Two popes had illegitimate children, and the current Pope is definitely not one of them!\n\n \n \n I'm sure there was more than that \n \n \n \nWhy not? Give me one scriptural reason why it is wrong. He's a father, and he's holy. Why not call him the holy father?\n\n \n \n The Bible said so.\n \n \n \n \nWhat ridiculousness are you talking about now? Comparing Popes to Hitler? What perversion!\n \n \n If it is so ridiculous why bother? Anyways, Hilter was a mass murder just like that Holy Father that killed millions of protestants for disagreeing with him\n \n \n \n \nYou make scandalous lies that the current pope has illegitimate ]children, you have given no biblical support for your argument, you have ignored my biblical support, you have attacked the Church complaining about it's corruptness, and over all are a very childish person.\n\n \n Where? I did use biblical support:\n \n \n Matthew 20:25-28, \"But Jesus called them unto Him, and said, Ye know that the princes of the Gentiles exercise dominion over them, and they that are great exercise authority upon them. But it shall not be so among you; but whosoever will be great among you , let him be your minister; and whosoever will be chief among you; let him be your servant: Even as the Son of man came not to be ministered unto , but to minister, and to give His life a ransom for many.\" Matthew 23:8-9, But be not ye called Rabbi for one is your master, even Christ; and all ye are brethren. And call no man your father upon the earth: for One is your Father, Which is in heaven.\"\n \n **Straight from the Bible(KJV)WORD FOR WORD( Christ speaking)\n \n \n  Now where ever is the scripture for purgatory?", 
   {
    "unicode_changes_made": true
   }, 
   19943, 
   null, 
   1066602060.0
  ], 
  [
   20028, 
   null, 
   "rapture", 
   "http://www.born-again-christian.info/popes.htm\n \n \n \n \n ** With holiness like that of the R.C.C. Satan is going have to seek unemployment", 
   {}, 
   20023, 
   null, 
   1066607460.0
  ], 
  [
   20031, 
   null, 
   "Parcum", 
   " I'm sure there was more than that\n\n \n Evidence? Or is this what your pastor told you? \n \n \n If it is so ridiculous why bother? Anyways, Hilter was a mass murder just like that Holy Father that killed millions of protestants for disagreeing with him\n\n \n Millions? It's not even close to that amount. More like in the tens of thousands, and not because they \"disagreed\" with him, it's because they were preaching against God. When the Hebrews went against God, God ordered the damnation of those men, and Moses had them killed. \n \n Further, the Israelites after the exodus had an Inquisition. We read, Deut. 13:6-18\n \n  6 \"(10) If your brother, your mother's son, or your son or daughter, or the wife you cherish, or your friend who is as your own soul, entice you secretly, saying, '(11) Let us go and serve other gods' (whom neither you nor your fathers have known, \n 7 of the gods of the peoples who are around you, near you or far from you, from one end of the earth to the other end), \n 8 (12) you shall not yield to him or listen to him; (13) and your eye shall not pity him, nor shall you spare or conceal him. \n 9 \"(14) But you shall surely kill him; (15) your hand shall be first against him to put him to death, and afterwards the hand of all the people. \n 10 \"So you shall stone him to death because he has sought (16) to seduce you from the LORD your God who brought you out from the land of Egypt, out of the house of slavery. \n 11 \"Then (17) all Israel will hear and be afraid, and will never again do such a wicked thing among you. \n 12 \"If you hear in one of your cities, which the LORD your God is giving you to live in, anyone saying that \n 13 some worthless men have gone out from among you and have seduced the inhabitants of their city, saying, '(18) Let us go and serve other gods' (whom you have not known), \n 14 then you shall investigate and search out and inquire thoroughly. If it is true and the matter established that this abomination has been done among you, \n 15 (19) you shall surely strike the inhabitants of that city with the edge of the sword, utterly destroying it and all that is in it and its cattle with the edge of the sword. \n 16 \"(20) Then you shall gather all its booty into the middle of its open square and burn the city and all its booty with fire as a whole burnt offering to the LORD your God; and it shall be a (21) ruin forever. It shall never be rebuilt. \n 17 \"Nothing from that which is put under the ban shall cling to your hand, in order that the LORD may turn from (22) His burning anger and (23) show mercy to you, and have compassion on you and (24) make you increase, just (25) as He has sworn to your fathers, \n 18 if you will listen to the voice of the LORD your God, keeping all His commandments which I am commanding you today, and doing what is right in the sight of the LORD your God.\n \n It is not merely disagreeing with God, it is being scandalous against his Church and trying to destroy it. If they are going to threaten the Church in such a way, they threaten the world. The only logical thing to do is to exterminate the heresy. How do they do this? Trials, and if they continue to disagree, execution is the only option. Nonetheless, your reference that millions were killed is ludicrous.\n \n Further, the Protestants (as I've already shown) have had their share of killings. The British oppressed the Irish Catholics, and illegalized Catholicism in both Britain and Ireland. The French Calvinists rebelled and pillaged Catholic villages. Calvinist Switzerland oppressed Catholics. What is interesting is that Protestantism was founded on these murders of innocent people, while Catholicism was founded on peace, where we were being oppressed and killed. \n \n \n \"But Jesus called them unto Him, and said, Ye know that the princes of the Gentiles exercise dominion over them, and they that are great exercise authority upon them. But it shall not be so among you; but whosoever will be great among you , let him be your minister; and whosoever will be chief among you; let him be your servant: Even as the Son of man came not to be ministered unto , but to minister, and to give His life a ransom for many.\" Matthew 23:8-9, But be not ye called Rabbi for one is your master, even Christ; and all ye are brethren. And call no man your father upon the earth: for One is your Father, Which is in heaven.\"\n\n \n We have already discussed this. If Christ truly meant to call no man father, then we wouldn't be able to call Pushkin the father of Russian literature, call our male parent, father, call Theodore Roosevelt the father of industrial America, et cetera. We obviously can call people \"Father\". My question was what the problem was calling somebody \"holy\". Is there any biblical evidence? Nope. \n \n And of course Rapture concludes his post by mentioning pedophile priests and blaming Catholicism for the mess. LOL. A sure sign of weakness. He probably isn't going to accept the fact that 10% of Protestant Ministers have admitted to sexual misconduct, and 3% are considered pedophiles. Catholic clergy only has .9%-1.7% of our clergy admitting to pedophilia. Hmmm...", 
   {
    "unicode_changes_made": true
   }, 
   20028, 
   null, 
   1066627500.0
  ], 
  [
   20040, 
   null, 
   "montalban", 
   " Where is the scripture that makes Saints mediators between God and Men? Likewise one for Mary? That's what I requested\n\n \n Actually you dis also say that the dead can't hear; thus I refuted it.\n \n I can only deal with one thing at a time, as I'm deeply engrossed in the Rugby World Cup.", 
   {}, 
   20022, 
   null, 
   1066642440.0
  ], 
  [
   20054, 
   null, 
   "epaphras_faith", 
   "I don't understand the question. Can you re-word it or elaborate? Can God accept calamity in myself or family from the hand of God? Or can I accept calamity as being from the hand of God?\n\n \n I am speaking specifically about the kind of thing Job endured. Can you accept calamity and still praise God FOR the calamity. Not just praise Him in spite of calamity but actually know that it comes from the hand of God. I am not saying God causes evil but He is sovereign therefore he either causes or allows all things.\n \n Satan caused evil to come upon Job. God allowed it. God actually pointed Job out to Satan.\n \n At this point I don't remember the context in which I asked the question. I hope what I have said was helpful. If your whole family was destroyed in a fire, could you, would you still praise God. If your wife was raped and she developed a serious mental illness and your children cursed you and hid your grandshildren from you, due to no fault of your own, would you still praise God FOR the circumstances not just in spite of them.", 
   {}, 
   19953, 
   null, 
   1066669740.0
  ], 
  [
   20118, 
   null, 
   "maximus", 
   "I am speaking specifically about the kind of thing Job endured. Can you accept calamity and still praise God FOR the calamity. Not just praise Him in spite of calamity but actually know that it comes from the hand of God. I am not saying God causes evil but He is sovereign therefore he either causes or allows all things.\n\n \n Epaphras,\n I could but I'm sure it would not be easy. I would have to continue in my journey of faith, growing in Christ to accept the suffering. I'm sure I would be angry and lash out at times. I think you have seen me often times quote the Bible verses that tell us we must suffer with Jesus. All of those quotes would all apply in this instance. Christianity may be the only thing I can think of that tells me my suffering has purpose.", 
   {}, 
   20054, 
   null, 
   1066704480.0
  ], 
  [
   20169, 
   null, 
   "epaphras_faith", 
   "Epaphras,\n I could but I'm sure it would not be easy. I would have to continue in my journey of faith, growing in Christ to accept the suffering. I'm sure I would be angry and lash out at times. I think you have seen me often times quote the Bible verses that tell us we must suffer with Jesus. All of those quotes would all apply in this instance. Christianity may be the only thing I can think of that tells me my suffering has purpose.\n\n \n \n I appreciate your answer. No one else seems willing to consider the truth in themselves but only to argue theology as long as it doesn't affect them. I consider these debates very seriously as I hope they do. I understand the question is tough and many here are young. They may not have had the experience to deal with this issue yet. Thanks for your reply.", 
   {}, 
   20118, 
   null, 
   1066756740.0
  ], 
  [
   20579, 
   null, 
   "montalban", 
   "I appreciate your answer. No one else seems willing to consider the truth in themselves but only to argue theology as long as it doesn't affect them. I consider these debates very seriously as I hope they do. I understand the question is tough and many here are young. They may not have had the experience to deal with this issue yet. Thanks for your reply.\n\n \n You've got me on this one (and I'm not young either). I do not have the faith to trust God. I can't barely trust anyoen, so trusting God is a major leap.\n \n I can argue theology (quite well) until the cows come home but when the chips are down (not a pun), I am the first to be angered by God (or rather my perception that He has abandoned me - though oddly, I've never lost faith that He exists)", 
   {}, 
   20169, 
   null, 
   1067178900.0
  ], 
  [
   20696, 
   null, 
   "epaphras_faith", 
   "You've got me on this one (and I'm not young either). I do not have the faith to trust God. I can't barely trust anyoen, so trusting God is a major leap.\n \n I can argue theology (quite well) until the cows come home but when the chips are down (not a pun), I am the first to be angered by God (or rather my perception that He has abandoned me - though oddly, I've never lost faith that He exists)\n\n \n Montalban:\n \n Thank you for your candor. As to you maximus. \n \n Now I have another question. Given, in you and in me that we would agree that we blame God or get angry or believe that He has abandoned me. Given that all of us, theologians in our own right (I use this term somewhat loosely), KNOW the correct answer, What is wrong in our theology? Our theology will in large part play a role in how we view God.\n \n Each person, will likely have their own story. \n \n Next question, What would it look like if I believed that there was absolutely nothing I could do that would ever casue God to turn away from me (given that I already know him)? Be honest, and try not to debate the whole eternal security thing here. Instead IMAGINE the result. Think about it in yourself. Would this actually cause you to run off and do things that you know God deplores?", 
   {}, 
   20579, 
   null, 
   1067291100.0
  ], 
  [
   24693, 
   null, 
   "rapture", 
   "\"Just how bad did Martin judge things to be? Extremely so, even if his traditionalist viewpoint saw little difference between homosexuality and pedophilia, neopaganism and satanism:\"\n \n \n \"Suddenly it became unarguable that now during this papacy, the Roman Catholic organization carried a permanent presence of clerics who worshipped Satan and liked it; of bishops and priests who sodomized boys and each other; of nuns who performed the \"Black Rites\" of Wicca, and who lived in lesbian relationships.. . . every day, including Sundays and Holy Days, acts of heresy and blasphemy and outrage and indifference were committed and permitted at holy Altars by men who had been called to be priests. Sacrilegious actions and rites were not only performed on Christ's Altars, but had the connivance or at least the tacit permission of certain Cardinals, archbishops, and bishops. . . In total number they were a minority - anything from one to ten percent of Church personnel. But of that minority, many occupied astoundingly high positions or rank.\n \n . . .The facts that brought the Pope to a new level of suffering were mainly two: The systematic organizational links - the network, in other words - that had been established between certain clerical homosexual groups and Satanist covens. And the inordinate power and influence of that network.(pp. 492-3. Emphasis added)http://www.theharrowing.com/martin.html", 
   {
    "post_info": {
     "post_title": "Malachi Martin"
    }, 
    "unicode_changes_made": true
   }, 
   20696, 
   null, 
   1070174040.0
  ], 
  [
   24717, 
   null, 
   "Parcum", 
   "What's your point, Rapture?", 
   {}, 
   24693, 
   null, 
   1070183460.0
  ], 
  [
   24729, 
   null, 
   "montalban", 
   "I believe his point is - that he can quote from a number of sources and not relate them to anything.", 
   {}, 
   24717, 
   null, 
   1070196420.0
  ], 
  [
   24792, 
   null, 
   "Parcum", 
   "Oh! Wow! Good for you Rapture!", 
   {}, 
   24729, 
   null, 
   1070233800.0
  ], 
  [
   25375, 
   null, 
   "rapture", 
   "Was Malachi Martin just some liar?Out to destroy Divinity? Was there not a\" hint\" of truth to his words? Or anybody eles? Brain washed sheep\n \n \n \n \n \n I also want to find out more about the ceremony those snakes performed in Lucifer's honor?", 
   {}, 
   24792, 
   null, 
   1070495400.0
  ], 
  [
   25381, 
   null, 
   "Parcum", 
   "Malachi Martin was a great man. GIving me biased information about him doesn't help.", 
   {}, 
   25375, 
   null, 
   1070498340.0
  ], 
  [
   25400, 
   null, 
   "rapture", 
   "Malachi Martin was a great man. GIving me biased information about him doesn't help.\n\n \n \n \n \n Perhaps we should read his books? Might explain a little more why The Virgin Scary is looming over St. Paul's", 
   {
    "post_info": {
     "attachments": 1
    }
   }, 
   25381, 
   null, 
   1070504160.0
  ], 
  [
   25406, 
   null, 
   "Parcum", 
   "Umm.. nice picture. \n \n \n What is it?", 
   {}, 
   25400, 
   null, 
   1070509560.0
  ], 
  [
   25417, 
   null, 
   "montalban", 
   "Umm.. nice picture. \n \n \n What is it?\n\n Maybe it's the soul of that 'gay' telly-tubby.", 
   {}, 
   25406, 
   null, 
   1070511120.0
  ], 
  [
   25426, 
   null, 
   "Parcum", 
   "If you squint your eye, hop up and down, and cough, it looks like President Bush.", 
   {}, 
   25417, 
   null, 
   1070514120.0
  ], 
  [
   25510, 
   null, 
   "epaphras_faith", 
   "Not that ridiculous picture again!\n \n Isn't there something we can do about this?\n \n Rapture, would you mind confining that stupid picture to one thread. I think it is just taking up space as you keep posting it in spite of the multitude of arguments that have surrounded it. You have yet to accept anyone else's explanation or even presented a plausible one yourself. You ignore logic and evidence. Please, Please, Please, Please, Please, for your own sake stop posting it.", 
   {}, 
   25426, 
   null, 
   1070580240.0
  ], 
  [
   25587, 
   null, 
   "rapture", 
   "=epaphras_faith]Not that ridiculous picture again!\n\n \n \n Agitated?\n \n \nIsn't there something we can do about this?\n\n \n Get out of denial? \n \n \nRapture, would you mind confining that stupid picture to one thread.\n\n \n \n I thought you was on your way to the promise land? Epaphas, You sound spooked...\n \n \n \n I think it is just taking up space as you keep posting it in spite of the multitude of arguments that have surrounded it.\n\n \n \n Many arguments..to think some call him Christ/ Angelic being with a heart of Love/Alein/hoax/ monster... and the list goes on\n \n \n \n \n \n \n You have yet to accept anyone else's explanation or evenpresented a plausible one yourself.\n \n \n How much more evidence/explanation can I present? How can I possibly make this plausible? Paranormal realm? Nevertheless, there is 2 things constant in this life, however, taxes and death\n \n \n \nYou ignore logic and evidence.\n\n \n \n What logic? What evidence?\n \n \n \n Please, Please, Please, Please, Please, for your own sake stop posting it.\n\n \n Is Scary Mary going to get me? \n \n \n \n I do realize that I need a group/Dr. who can deal with people who experience paranormal encounters................", 
   {}, 
   25510, 
   null, 
   1070608140.0
  ], 
  [
   25613, 
   null, 
   "montalban", 
   " Is Scary Mary going to get me? \n \n\n \n \n Who is Scary Mary?\n \n Why are you afraid of her?", 
   {}, 
   25587, 
   null, 
   1070628300.0
  ], 
  [
   25644, 
   null, 
   "epaphras_faith", 
   "Who is Scary Mary?\n \n Why are you afraid of her?\n\n \n Rapture thinks that this photo is satan (scary mary) and has appeared in some sort of transdimensional gate over a catholic church which rapture equates with satan or the beast. \n \n This particular photo has been shown on numerous threads. It is ridiculous and rapture just proves that rapture has a need for medication or to stop smoking whatever he is smoking.\n \n Spooked? No. Anoyed? Yes. Give it up already.", 
   {}, 
   25613, 
   null, 
   1070645880.0
  ], 
  [
   25698, 
   null, 
   "montalban", 
   "Rapture thinks that this photo is satan (scary mary) and has appeared in some sort of transdimensional gate over a catholic church which rapture equates with satan or the beast. \n \n This particular photo has been shown on numerous threads. It is ridiculous and rapture just proves that rapture has a need for medication or to stop smoking whatever he is smoking.\n \n Spooked? No. Anoyed? Yes. Give it up already.\n\n \n It looked like a picture of smoke to me.\n \n Okay, I'll leave this one alone.", 
   {}, 
   25644, 
   null, 
   1070667660.0
  ], 
  [
   25704, 
   null, 
   "epaphras_faith", 
   "It looked like a picture of smoke to me.\n \n Okay, I'll leave this one alone.\n\n \n Actually my give it up was directed at Rapture not you.", 
   {}, 
   25698, 
   null, 
   1070667960.0
  ], 
  [
   25751, 
   null, 
   "montalban", 
   "Actually my give it up was directed at Rapture not you.\n\n \n No worries. Until he actually says something that makes sense, I still think your advice is good.", 
   {}, 
   25704, 
   null, 
   1070689500.0
  ], 
  [
   25825, 
   null, 
   "mizmaxx", 
   "I saw the face of a serpent in my mashed potatoes! The pope was on tv at the time- it must be SATAN! It's coming to get us all! AAAAAAAAaaaaaaa.......\n \n [/psychotic episode]", 
   {}, 
   25751, 
   null, 
   1070711040.0
  ], 
  [
   25921, 
   null, 
   "rapture", 
   "=montalban]Who is Scary Mary?\n\n \n \n \n The serpent above St.Vincent De Paul Catholic Church\n \n \n \n \nWhy are you afraid of her?\n\n \n \n \n Evil", 
   {}, 
   25613, 
   null, 
   1070754600.0
  ], 
  [
   25922, 
   null, 
   "rapture", 
   "=mizmaxx]I saw the face of a serpent in my mashed potatoes! The pope was on tv at the time- it must be SATAN!\n \n \n \n Was he covering up the crimes of the satanic sodomites? Teaching everbody was going to purgatory? .yep it was SATAN\n \n \n \n \n \n \nIt's coming to get us all! AAAAAAAAaaaaaaa.......\n \n \n \n Not all just the majority.....", 
   {}, 
   25825, 
   null, 
   1070754720.0
  ], 
  [
   25927, 
   null, 
   "rapture", 
   "=epaphras_faith]Rapture thinks that this photo is satan (scary mary) and has appeared in some sort of transdimensional gate over a catholic church  rapture equates with satan or the beast. \n\n \n \n \n  Does it look like the HOLY GHOST? The Bible clearly states that the anti-Christ spirit was already in the world, of course, look at the world, and that once incarnated( this leader), would decieve the majority of the world- the next Pope \n \n \n Why don't you just be patient! Pope John reaks of death/hell\n \n \n \n \n \n \n \nIt is ridiculous and rapture just proves that rapture has a need for medication or to stop smoking whatever he is smoking.\n\n \n \n I have a need for people to deal with reality( HUMANS ARE NOT THE ONLY BEINGS IN THE UNIVERSE)\n \n \n \nSpooked? No.\n \n \n I can't tell\n \n \n Anoyed? Yes.\n \n \n Beyond normal?\n \n \n \nGive it up already.\n\n \n Why? forgetabout it- I'll seek God on this one..ask him the purpose of the photo/encounter to begin with.\n \n \n \n \n \ntransdimensional gate\n\n \n \n A dimension of horror", 
   {}, 
   25644, 
   null, 
   1070755860.0
  ], 
  [
   25966, 
   null, 
   "rapture", 
   "\"When we read the news headlines today concerning the evil acts of numerous Catholic priests and even bishops against children, we can not help think about what Fr. Malachi Martin prophesied six years ago. Fr. Martin also said that the \"Third Secret of Fatima\" concerned the apostasy of the Roman Catholic Church. He said that the essential message seems to be about Satanists lurking in the shadows, from the heart of the Vatican down to the local parishes, manipulating events and putting great effort to subvert the Roman Catholic Church. He said that these Satanists are in league with Zionists and what he called the \"Universal Assembly\", a Masonic group of Western plutocrats and the Illuminati.\" \n \n And where does Pope John Paul II stand in all of this? Pope John Paul II has stated that we are definitely in the end times. He says that \"the signs are clear\"! The Pope has expressed concerns that his successor will be \"the final pope\" and the \"anti-pope\". The anti-pope is a person who will betray true Catholicism and Christianity as part of a pact with \"Lucifer\" and a future world government.\n \n \n \n \n http://aztlan.net/malachimartin.htm", 
   {
    "post_info": {
     "post_title": "Belief of John Paul II"
    }, 
    "unicode_changes_made": true
   }, 
   25927, 
   null, 
   1070774160.0
  ], 
  [
   26224, 
   null, 
   "epaphras_faith", 
   " Does it look like the HOLY GHOST? The Bible clearly states that the anti-Christ spirit was already in the world, of course, look at the world, and that once incarnated( this leader), would decieve the majority of the world- the next Pope \n \n \n \n\n \n Nope. Looks like a smudge on a camera lense looking into the sun.", 
   {}, 
   25927, 
   null, 
   1070905920.0
  ], 
  [
   26279, 
   null, 
   "mizmaxx", 
   "Upon entering Satan's playground (Vatican City), Bowers & Hardwick were shocked beyond belief. \"It was worse than any nightmare, worse than any horror film, worse than anything in Revelation,\" reported Hardwick. \"There were hundreds of idols and icons everywhere -- statues of mortals with a multitude of Catholics kneeling before the granite and praying to false gods. Some even kissed the rocks. Such brazen defiance of God's word! It was as though these Catholics had looked right into the face of Jesus and spit. I stopped to rebuke several candle-lighters and Betty was moved by Jesus to righteously slap some Italian woman wearing a doily on her head to stop her from slobbering on an apostle's foot. Pansy priests pranced around in hideous dresses, all of which were black, Satan's favorite color.\" Bowers was as horrified by the artwork as she was by the effeminate clergy. \"Now, no one would accuse me of not enjoying a feminine flourish in every room, but the whole Vatican looked like it had been whomped up by some New Jersey florist who had just won the lottery. Las Vegas looks downright Mies van der Rohe by comparison! It was so shockingly over-the-top. And whoever St. Peter's uses as its interior decorator had picked the most nefarious pieces. There were subliminal appeals to the devil lurking on every wall. By the time we exited the devil's palace, I had seen the winking face of Lucifer no less than 200 times.\" \n Landover Baptists (parody site)\n \n You know, it's true. You sound exactly like them. Are you just some anti-baptist joker with too much time on your hands? Or is this just another case of reality being stranger than fiction?", 
   {}, 
   26224, 
   null, 
   1070921820.0
  ], 
  [
   26282, 
   null, 
   "epaphras_faith", 
   "Landover Baptists (parody site)\n \n You know, it's true. You sound exactly like them. Are you just some anti-baptist joker with too much time on your hands? Or is this just another case of reality being stranger than fiction?\n\n To whom are you speaking?", 
   {}, 
   26279, 
   null, 
   1070922180.0
  ], 
  [
   26359, 
   null, 
   "maximus", 
   "Rapture is a Oneness Pentecostal.", 
   {}, 
   26282, 
   null, 
   1070942100.0
  ], 
  [
   26451, 
   null, 
   "epaphras_faith", 
   "Rapture is a Oneness Pentecostal.\n\n \n Maximus, you never cease to amaze me. How did you determine this? By questioning that I have not seen? or did you discern from various statements?", 
   {}, 
   26359, 
   null, 
   1070990280.0
  ], 
  [
   26527, 
   null, 
   "mizmaxx", 
   "To whom are you speaking?\n\n \n rapture, of course.", 
   {}, 
   26282, 
   null, 
   1071023040.0
  ], 
  [
   29131, 
   null, 
   "rapture", 
   "Rapture is a Oneness Pentecostal.\n\n \n \n \n Rapture belongs/answers to know one but God- \n \n \n \n \nNope. Looks like a smudge on a camera lense looking into the sun\n\n \n \n Invert the photo..should clear all that right up \n \n The serpent, whether good or bad, is entertwined in viturally every culture/ religion/ or cult since the beginnings of human origin- A bizarre connection?\n \n \n \n \n \n \nOr is this just another case of reality being stranger than fiction\n\n \n BLESS ME Father, for I have sinned? How does Satan find the time? Being approx. one billion followers and all? Oh that's right, silly me, Satan made the Virgin/Saints overworked secretaries \n \n God don't bless sinners... (scripture?)", 
   {}, 
   26359, 
   null, 
   1072425900.0
  ], 
  [
   29132, 
   null, 
   "montalban", 
   "Rapture belongs/answers to know one but God- \n \n Invert the photo..should clear all that right up \n \n The serpent, whether good or bad, is entertwined in viturally every culture/ religion/ or cult since the beginnings of human origin- A bizarre connection?\n \n BLESS ME Father, for I have sinned? How does Satan find the time? Being approx. one billion followers and all? Oh that's right, silly me, Satan made the Virgin/Saints overworked secretaries \n \n God don't bless sinners... (scripture?)\n\n \n Rapture, I am but an ignorant antiopedan, so you might want to take people in like me when you make statements - because I can't understand what you're on about. Or, what you're on.", 
   {}, 
   29131, 
   null, 
   1072429860.0
  ], 
  [
   29325, 
   null, 
   "rapture", 
   "Rapture, I am but an ignorant antiopedan, so you might want to take people in like me when you make statements - because I can't understand what you're on about. Or, what you're on.\n\n \n \n \n \n I believe you said I was a oneness pentocostal? I responded, the other commets was answers to other posters. I realize I FORGOT to put a name with the comment, however, perhaps you can help me to understand why catholics say, \n \n \n BLESS ME Father, for I have sinned?God don't bless sinners..(scripture?)", 
   {}, 
   29132, 
   null, 
   1072586100.0
  ], 
  [
   29330, 
   null, 
   "maximus", 
   "I believe you said I was a oneness pentocostal? I responded, the other commets was answers to other posters. I realize I FORGOT to put a name with the comment, however, perhaps you can help me to understand why catholics say, \n \n BLESS ME Father, for I have sinned?God don't bless sinners..(scripture?)\n\n \n Montalban,\n Forgive my intrusion.\n \n Rapture,\n I was the one who labeled you a Oneness Pentecostal.\n \n Furthermore, Montalban is Orthodox, not Catholic.\n \n Finally, in regard to your question above on \"Bless me father for I have sinned,\" what do you think of the following scripture?\n \n 1 John 1:7-10  \"...and the blood of Jesus his Son cleanses us from all sin. If we say we have no sin, we deceive ourselves, and the truth is not in us. If we confess our sins, he is faithful and just, and will forgive our sins and cleanse us from all unrighteousness. If we say we have not sinned, we make him a liar, and his word is not in us.\"\n \n Are you a sinner?\n \n Do you confess your sins?", 
   {}, 
   29325, 
   null, 
   1072591800.0
  ], 
  [
   33485, 
   null, 
   "kidicarus", 
   "in the end god will judge you on what you know, not what you dont know.", 
   {}, 
   26451, 
   null, 
   1075702380.0
  ], 
  [
   33662, 
   null, 
   "rapture", 
   "Do you confess your sins?\n\n \n \n \n \n Of course, at his feet, not at that foot of a mammel. I do pray that all my confessed/forgiven sins become real hot and acidic flames for Lucifer and his imps, perhaps the Lord will honor it..( who knows)\n \n \n \n \n  Forgive me Father, for I have sinned\n \n \n or\n \n \n  Bless me Father, for I have sinned. ( Are we talking to Scary Mary?)\n \n \n \n \nAre you a sinner?\n\n \n Not intentionally but it happens.", 
   {}, 
   33485, 
   null, 
   1075844340.0
  ], 
  [
   33665, 
   null, 
   "rapture", 
   "in the end god will judge you on what you know, not what you dont know.\n\n \n \n \n \n Perhaps ignorance is bliss..", 
   {}, 
   33485, 
   null, 
   1075844700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Next Pope(Anti-Christ)", 
  "url": "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1113, 
  "discussion_files": [
   [
    "20670.html", 
    "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ-print.html"
   ], 
   [
    "20671.html", 
    "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ-10-print.html"
   ], 
   [
    "20672.html", 
    "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ-8-print.html"
   ], 
   [
    "20673.html", 
    "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ-6-print.html"
   ], 
   [
    "20674.html", 
    "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ-4-print.html"
   ], 
   [
    "20675.html", 
    "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ-5-print.html"
   ], 
   [
    "20676.html", 
    "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ-7-print.html"
   ], 
   [
    "20677.html", 
    "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ-9-print.html"
   ], 
   [
    "20678.html", 
    "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ-3-print.html"
   ], 
   [
    "20679.html", 
    "http://www.4forums.com/political/religion-debates/1113-next-pope-anti-christ-2-print.html"
   ]
  ], 
  "identifier": 1113
 }
]