[
 [
  [
   308843, 
   null, 
   "obvious_child", 
   "Enjoy. \n \n link", 
   {
    "post_info": {
     "post_title": "Why do people laugh at creationists?"
    }
   }, 
   null, 
   null, 
   1208390940.0
  ], 
  [
   308856, 
   null, 
   "Archangel", 
   "I don't know, could it be because they're XXXXXX? Or maybe it's because atheists are deluded. emoticon_xbye http://www.youtube.com/watch?v=bkhQLt1vbWU&feature=related", 
   {}, 
   308843, 
   null, 
   1208394420.0
  ], 
  [
   308861, 
   null, 
   "marc9000", 
   "Enjoy. \n \n link\n\n \n Another question might be, have evolutionists figured out the \"mock\" gene yet? Mockery was a great ingredient in Christian salvation. Judas mocked Jesus in the garden, the chief priests and scribes laughed him to scorn, Herod mocked him, the servants and the soldiers jeered at him and insulted him, and on the cross all sorts of taunts were thrown at him. \n \n I don't claim to be perfect - mockery could possibly be an effective tool in certain instances, but I may be wrong about that. Is mockery synonymous with evil? The opposite of love? Do atheists do it more than Christians?", 
   {}, 
   308843, 
   null, 
   1208397000.0
  ], 
  [
   308863, 
   null, 
   "Mucusaur", 
   "Another question might be, have evolutionists figured out the \"mock\" gene yet? Mockery was a great ingredient in Christian salvation. Judas mocked Jesus in the garden, the chief priests and scribes laughed him to scorn, Herod mocked him, the servants and the soldiers jeered at him and insulted him, and on the cross all sorts of taunts were thrown at him\n\n \n Jesus did not post post nonsense on the internet, from the garden of Gethsemane internet Cafe or else where. The mockery creationists receive is of a different breed to the mockery Jesus got, and well deserved.", 
   {}, 
   308861, 
   null, 
   1208397300.0
  ], 
  [
   308881, 
   null, 
   "obvious_child", 
   "I don't know, could it be because they're XXXXXX? Or maybe it's because atheists are deluded. emoticon_xbye http://www.youtube.com/watch?v=bkhQLt1vbWU&feature=related\n\n \n Did you happen to notice this on the side?\n \n \nMy undisputable Biblical proof that atheists are deluded and stupid. (Yes, this is a SATIRE.)\n\n \n By the way, that video, among others is obviously satire on literal creationists. Edward Current has been running around making satirical videos on creationists and theists. The funny thing is, you can't figure out it's satire. What is even funnier is that you appear to think that the arguments Edward Current gives are actually good and prove that atheists are deluded. He uses so many fallacies including circular reasoning and you can't seem to notice that those methods of argumentation are extremely poor. \n \n But then again, you seem to think that Co2 is the primary input gas for ATP production rather then O2....\n \n I'm still waiting for your equations proving that ATP production is massively higher with Co2 rather then O2.", 
   {}, 
   308856, 
   null, 
   1208406660.0
  ], 
  [
   308882, 
   null, 
   "obvious_child", 
   "Another question might be, have evolutionists figured out the \"mock\" gene yet? Mockery was a great ingredient in Christian salvation. Judas mocked Jesus in the garden, the chief priests and scribes laughed him to scorn, Herod mocked him, the servants and the soldiers jeered at him and insulted him, and on the cross all sorts of taunts were thrown at him. \n \n I don't claim to be perfect - mockery could possibly be an effective tool in certain instances, but I may be wrong about that. Is mockery synonymous with evil? The opposite of love? Do atheists do it more than Christians?\n\n \n Why you quoted me is questionable. What I posted was merely a series of mathematical equations proving that Hovind is completely full of ****. How you consider mathematical equations \"mockery\" I don't know, but more likely, you did not bother to watch the video. Instead, in your normal fashion, you simply ASSUMED what you wanted to believe and then went from there rather then actually looking at what it was and what it had to say. \n \n Your post more accurately is towards the link that AA posted in defense of his beliefs (yet failed to realize was satirizing those beliefs). Furthermore, I'm not an atheist even though your poor definition wants me to be.", 
   {}, 
   308861, 
   null, 
   1208406840.0
  ], 
  [
   308887, 
   null, 
   "electrolyte", 
   "Poe's Law \n \n Similar to Murphy's Law, Poe's Law concerns internet debates, particularly regarding religion or politics.\n \n \"Without a winking smiley or other blatant display of humor, it is impossible to create a parody of Fundamentalism that SOMEONE won't mistake for the real thing.\"\n \n In other words, No matter how bizzare, outrageous, or just plain idiotic a parody of a Fundamentalist may seem, there will always be someone who cannot tell that it is a parody, having seen similar REAL ideas from real religious/political Fundamentalists.\n See also Russell's Law, \"It Is Impossible To Distinguish A Creationist From A Parody Of A Creationist.\"", 
   {
    "unicode_changes_made": true
   }, 
   308881, 
   null, 
   1208409000.0
  ], 
  [
   309213, 
   null, 
   "lpdm", 
   "I don't know, could it be because they're XXXXXX? Or maybe it's because atheists are deluded. emoticon_xbye\n\n \n they don't want to except that there is something/someone more powerful than them:xbanghead", 
   {
    "post_info": {
     "post_title": "Pride"
    }
   }, 
   308843, 
   null, 
   1208716620.0
  ], 
  [
   309227, 
   null, 
   "electrolyte", 
   "they don't want to except that there is something/someone more powerful than them:xbanghead\n\n You've gotta love when ignorance lends itself to incredible mistakes like the above statement. \"Excepting\" that there is some magical sky man is precisely what atheists do.\n \n Looks like we have another Einstein who wants to test his opinions with people who actually know what they're talking about.\n \n lpdm, you'd better learn quickly, or I don't think you'll like it here as much as you were hoping.\n \n \nI'm always right,...... except when I'm wrong\n\n So far, you've been nothing but wrong.", 
   {}, 
   309213, 
   null, 
   1208719080.0
  ], 
  [
   309228, 
   null, 
   "marc9000", 
   "Did you happen to notice this on the side?\n \n \n \n By the way, that video, among others is obviously satire on literal creationists. Edward Current has been running around making satirical videos on creationists and theists. The funny thing is, you can't figure out it's satire. What is even funnier is that you appear to think that the arguments Edward Current gives are actually good and prove that atheists are deluded. He uses so many fallacies including circular reasoning and you can't seem to notice that those methods of argumentation are extremely poor. \n\n \n I was a little disturbed by a few things in the link AA put up. I suspected it was \"satire\". It can be difficult to difficult to see sometimes. Satan is called the great deciever in the Bible. Makes it hard to tell where people like Edward Current and...........Kenneth Miller are coming from.", 
   {}, 
   308881, 
   null, 
   1208719680.0
  ], 
  [
   309229, 
   null, 
   "marc9000", 
   "Why you quoted me is questionable. What I posted was merely a series of mathematical equations proving that Hovind is completely full of ****. How you consider mathematical equations \"mockery\" I don't know, but more likely, you did not bother to watch the video. \n\n \n Well, you got that one exactly right. I didn't bother to watch your video. It was pretty predictable coming from you - personal attacks on creationists. I quoted YOU because of what YOU said. \n \n \nInstead, in your normal fashion, you simply ASSUMED what you wanted to believe and then went from there rather then actually looking at what it was and what it had to say. \n\n \n I only looked at what YOU had to say. It concerned mocking.", 
   {}, 
   308882, 
   null, 
   1208719920.0
  ], 
  [
   309395, 
   null, 
   "obvious_child", 
   "Well, you got that one exactly right. I didn't bother to watch your video. It was pretty predictable coming from you - personal attacks on creationists. I quoted YOU because of what YOU said. \n\n \n And what did I say? \n \n I quoted the title of the video, said \"Enjoy\" and labeled the link \"link\"\n \n So how is saying \"enjoy\" and \"link\" which were MY words mockery? The only thing that suggests otherwise is the VIDEO's Title, which I did not create. \n \n \nI only looked at what YOU had to say. It concerned mocking.\n\n \n Read above for why your argument sucks. \n \n Thanks for proving you never ever ever read anything or watch anything given to you. \n \n Just assume whatever we want and hope people don't laugh at us?", 
   {}, 
   309229, 
   null, 
   1208841300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why do people laugh at creationists?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11154-why-do-people-laugh-creationists.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 11154, 
  "discussion_files": [
   [
    "12310.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11154-why-do-people-laugh-creationists-print.html"
   ]
  ], 
  "identifier": 11154
 }
]