[
 [
  [
   309574, 
   null, 
   "Symbiote", 
   "http://economictimes.indiatimes.com/Earth/Are_we_heading_to_ice_age/articleshow/2975016.cms\n \n \nEvidence in support of this theory has come from pictures obtained from the US Solar and Heliospheric Observatory, which showed no spots on the sun, thus determining that sunspot activity has not resumed after hitting an 11-year low in March last year. \n \n A sunspot is a region on the sun that is cooler than the rest and appears dark. \n \n Some scientists believe a strong solar magnetic field, when there is plenty of sunspot activity, protects the earth from cosmic rays, cutting cloud formation, but that when the field is weak - during low sunspot activity - the rays can penetrate into the lower atmosphere and cloud cover increases, cooling the surface. \n \n According to Australian astronaut and geophysicist Phil Chapman, this might have caused the world to cool quickly between January last year and January this year, by about 0.7C. \n \n \"This is the fastest temperature change in the instrumental record, and it puts us back to where we were in 1930,\" said Dr Chapman. \n\n \n I'd like to be the first to propose a global snow tax, and I believe the UN should take it into its hands to punish those nations without sufficient industrial capacity to boost levels of greenhouse gases proportionally. We should begin setting targets to triple the atmospheric concentration of Methane by 2050 to ward off catastrophe. Falling sea levels could reap catastrophe on many coastal communities, and destroy coral reefs exposed to the harsh rays of the sun.", 
   {
    "post_info": {
     "post_title": "Global Cooling: The 21st Century's Greatest Challenge"
    }
   }, 
   null, 
   null, 
   1208991300.0
  ], 
  [
   309627, 
   null, 
   "Jo Bennett", 
   "Is someone seriously you suggesting you can determine a trend with two data points? emoticon_xdonno", 
   {}, 
   309574, 
   null, 
   1209025140.0
  ], 
  [
   309634, 
   null, 
   "Symbiote", 
   "I'm just wondering how global warming zealots interpret the data, after spending the last few years denying the impact of sunspots on global temperature.\n \n Or are we beyond that point, is it enough now to heckle anyone who defies the central dogma of \"consensus\".\n \n Here is probably a better article, published in The Australian today\n http://www.theaustralian.news.com.au/story/0,25197,23583376-7583,00.html", 
   {}, 
   309627, 
   null, 
   1209035520.0
  ], 
  [
   363621, 
   null, 
   "Winston Smith", 
   "Around the world, thousands of scientists have devoted their professional lives to studying the climate. Not centrally organised, they sometimes build temporary affiliations but they remain scientists throughout &#8211; that is, they are independent, constantly challenge each other and are committed to searching for truth through objective, independently verifiable evidence.\n \n Overwhelmingly, this evidence has led to four conclusions. The first is that the world is warming. The global average temperature has increased by about 0.8 degrees since 1850, with most of the increase occurring since 1950. The warming varies among decades because of natural fluctuations but the overall trend has been inexorably upward.\n \n Warming is evident in other indicators, such as rising sea levels and reduced sea-ice and snow cover. Of these, the most important measure is the extra heat in the oceans, which is steadily rising. Claims that climate change has reversed since 1998 are misrepresentations of the full data.\n \n The second conclusion is that the dominant cause of the warming since about 1950 is the increase in the atmospheric concentrations of greenhouse gases released by human activities, of which carbon dioxide (CO2) is the most important.\n \n This critical conclusion is based on several independent lines of evidence, including basic physics, studies of climate changes in both in the geological past and in the industrial era, and finally &#8211; but far from solely &#8211; from the predictions of climate models. Together, these provide an overwhelming case that increasing greenhouse gas concentrations cause warming, and that CO2 is the largest contributor to the current warming trend.\n \n Other contributors include changes in the sun&#8217;s output associated with sunspots and solar flares, and volcanic dust. However, if these were solely responsible for temperature changes since 1850, the world should have cooled over the past half-century rather than warming at an increasing rate.\n \n The third conclusion is that warming will increase in future, if emissions of CO2 and other greenhouse gases maintain their present paths. \"Business as usual\" scenarios for future emissions lead to likely global temperature increases of up to six degrees above present temperatures by 2100.\n \n These are dramatic temperature increases, which would be accompanied by major disruptions to food supplies, river flows and water availability, significant and ongoing rises in sea level (of up to about a metre by 2100 and potentially metres over longer times), disease threats, disruptions to ecosystems including the extinction of many species, and social and geopolitical destabilisation.\n \n The fourth conclusion is that climate change cannot be reversed for many centuries, because of the massive heat stores in the world&#8217;s oceans. Even if CO2 and other greenhouse gas concentrations were stabilised today at their present levels, a further warming of at least 0.6 degrees would inevitably follow (on top of the 0.8 degrees observed since 1850) and sea-level rise would continue for centuries to millenniums.\n \n These four conclusions have been known and agreed among thousands of independent climate scientists for more than a decade. However, new findings suggest that the situation is, if anything, more serious than the assessment of just a few years ago.\n \n The heightened concern among climate scientists arises from a growing realisation that climate change can be accelerated beyond current predictions by reinforcing \"climate feedbacks\", which contribute to climate change and are accelerated as it occurs, thus causing climate change to feed on itself. When these feedbacks are sufficiently strong they become \"climate tipping points\" which can flip the climate into a new state with essentially no way to recover.\n \n Several feedbacks are of immediate concern. Interactions between climate and the earth&#8217;s carbon cycle (the exchange of carbon between the atmosphere, the land and the oceans) will act to accelerate climate change if sinks do not keep pace with emissions (as is already happening) and/or if previously stable carbon stores are released to the atmosphere under climate change, for example by the thawing of carbon-rich frozen soils.\n \n Accelerated polar warming will cause loss of ice and a consequent darkening of the surface, leading to more heat absorption and faster warming. Atmospheric concentrations of aerosols (tiny particulates) are likely to decrease in future as nations improve air quality, leading to accelerated warming as the cooling effect of aerosols is reduced.\n \n Oceans are becoming more acidic as a consequence of increased CO2 in the atmosphere. When CO2 concentrations exceed levels to be reached by 2035 under business-as-usual emissions scenarios, there will be severe disruptions to marine ecosystems (including the Great Barrier Reef and ocean food chains), which will endanger fisheries and weaken the uptake of CO2 by oceans.\n \n Temperature rises of two to three degrees (or higher) carry a high risk of irreversible decay of the Greenland ice sheet from surface warming alone, leading to a sea level rise of up to about seven metres. Destabilisation of the West Antarctic Ice Sheet would cause a further few metres of sea-level rise.\n \n A climate conference in Copenhagen in March concluded that societies were highly vulnerable to even modest levels of climate change, with poor nations and communities particularly at risk. Temperature rises above two degrees will be very difficult for contemporary societies to cope with and will increase the level of climate disruption through the rest of the century.\n \n All of these concerns are firmly grounded in science. They have led the great majority of climate scientists to conclude (paraphrasing the summary of the Copenhagen conference) that rapid, sustained and effective emissions reductions are required to avoid &#8216;&#8216;dangerous climate change&#8217;&#8217;, regardless of how it is defined.\n \n Higher future emissions increase the risk of crossing climate tipping points and they increase the likelihood that the long-term social and economic costs of both adaptation and mitigation will be higher.\n \n This article was written by Michael Raupach and John Church, CSIRO; David Griggs, Amanda Lynch and Neville Nicholls, Monash University; Nathan Bindoff, Antarctic Climate and Ecosystems Co-operative Research Centre; Matthew England and Andy Pitman, University of NSW; Ann Henderson-Sellers and Lesley Hughes, Macquarie University; Ove Hoegh-Guldberg, University of Queensland; Roger Jones, Victoria University; David Karoly, University of Melbourne; and Tony McMichael and Will Steffen, Australian National University.\n \n \n Climate change poised to feed on itself - Opinion - smh.com.au", 
   {
    "post_info": {
     "post_title": "Believe it or not or stick your head in sand"
    }
   }, 
   309634, 
   null, 
   1249266780.0
  ], 
  [
   363626, 
   null, 
   "Symbiote", 
   "You go on being a global cooling denialist, one day when hell freezes over you'll be sorry. Global cooling denialists are just like flat earthers and creationists.\n \n Even Michael Mann, inventor of the now shamefully discredited \"hockey stick\" graph admits global temperatures are falling and predicts further temperature declines for the next 10 years.\n \n The consensus is in, global warming hysteria is yesterday's news, global cooling hysteria is the new hot fad.\n \n You now have the choice of opposing\n \n a) Global Cooling\n b) Swine Flu\n c) China\n \n for your dose of politically correct feel-good moralising. Please get on the bandwagon and choose one of the above to bloviate about until otherwise instructed.\n \n Global cooling in fact began with the release of \"An Inconvenient Truth\". Temperatures are down just over 0.7 degrees since the day of release, with many scientists speculating that irony results in a negative feedback to the global temperature cycle. Accordingly, the locus of the global cooling trend is Al Gore's house, with his home town recording the coldest July since 1877. This cooling is taken place even when we take measurements from land based thermometers positioned on concrete slabs and near air conditioning outlets.\n \n Sadly, the international community moved too slowly to be able to claim credit for this change in temperature trend. Had Kyoto been more successful, this variance could have been claimed as a trophy.", 
   {}, 
   363621, 
   null, 
   1249267860.0
  ], 
  [
   363638, 
   null, 
   "Winston Smith", 
   "Well, I am in good company. :)\n \n See you in hell then before it freezes over.\n \n Gee! the power of the documentary, it caused global cooling. so the pen is mightier than CO2", 
   {}, 
   363626, 
   null, 
   1249270200.0
  ], 
  [
   363650, 
   null, 
   "Archangel", 
   "Gee, I pointed this cooling trend out 2 years ago, and based on the sunspot decrease no less. And all I got was grief. emoticon_frazzled", 
   {}, 
   363638, 
   null, 
   1249272840.0
  ], 
  [
   363658, 
   null, 
   "Winston Smith", 
   "Yes, Archie\n \n \nOverwhelmingly, this evidence has led to four conclusions. The first is that the world is warming. The global average temperature has increased by about 0.8 degrees since 1850, with most of the increase occurring since 1950. The warming varies among decades because of natural fluctuations but the overall trend has been inexorably upward.\n \n Warming is evident in other indicators, such as rising sea levels and reduced sea-ice and snow cover. Of these, the most important measure is the extra heat in the oceans, which is steadily rising. Claims that climate change has reversed since 1998 are misrepresentations of the full data.\n", 
   {}, 
   363650, 
   null, 
   1249277820.0
  ], 
  [
   363671, 
   null, 
   "Accipiter", 
   "Weather the earth warms or cools there is not much difference in what it would do to our infrastructure.\n \n Climate change could happen faster then our technology and money could compensate for.\n \n The earth&#8217;s climate is changing constantly even without the help of our civilization.\n \n It was called the ice age and glaciers covered a big chunk of North America.\n \n The study of climate change is important.\n \n Even though it contradicts it self it&#8217;s still something we should be keeping a close watch on.", 
   {}, 
   363658, 
   null, 
   1249296960.0
  ], 
  [
   364271, 
   null, 
   "simone", 
   "Baloney! There has been major melting of ice at both the North and South Poles, meaning that far more of the sun's energy heat and energy will remain trapped in the Earth's atmosphere rather than being bounced off into outer space.\n \n Further, enormously unseasonably warm weather recently experienced in the Pacific Northwest broke all sorts of historic records.\n \n Temperatures of 104 degrees Farenheit in a region which very rarely registers three-digit temps.\n \n In fact, the weather templates of the local TV stations were unable to easily record the record temperatures.\n \n Also, the nightly temperatures also reached record highs never before recorded historically.\n \n So.... where the devil is this global cooling that a single battalion of fools thinks is in existence?", 
   {}, 
   363671, 
   null, 
   1249589280.0
  ], 
  [
   364310, 
   null, 
   "Symbiote", 
   "The Astronomical Society of Australia have just released a report confirming we have embarked on a ~25 year global cooling trend, the scientific consensus is in and there is only a holdout amongst head in the sand denialists.\n \n btw even if you don't believe in global cooling (which no sane or honest person would deny - do you work for a carbon capture corporation by any chance, hmmm!?), surely you agree that we have to do something now to prevent even the possibility of it!", 
   {}, 
   364271, 
   null, 
   1249607820.0
  ], 
  [
   364314, 
   null, 
   "Winston Smith", 
   "What report?\n \n the 29 year warming trend stands at 1.5 degree cent per century.\n \n the trend is that the earth is warming. Of course is not a steady straight line as you well know. The surface temp on land and sea is rising. This is the scientific consensus.\n \n by the way, if I remember correctly until recently you didn't care about 'scientific consensus' that you now invoke but you can not prove that is in your side.", 
   {}, 
   364310, 
   null, 
   1249611540.0
  ], 
  [
   364315, 
   null, 
   "Winston Smith", 
   "Three glaciers in different climate zones of the U.S. Northwest have shrunk rapidly since 1989, confirming the impact of global warming on their decline, the government said in a report. \n \n The glaciers in Alaska and the state of Washington have shown a &#8220;rapid and sustained&#8221; loss of mass over the two decades, according to today&#8217;s report from the U.S. Geological Survey. The South Cascade glacier in Washington is shrinking at a rate that may see it disappear in 50 years, said Edward Josberger, the report&#8217;s lead author. \n \n Glaciers in the Northwest have gained or lost mass from year to year since the agency began collecting data in 1957, because of changes in winter storm patterns tied to shifts in Pacific Ocean currents, Josberger said. The cumulative decline since 1989 suggests that global warming has overcome those seasonal variations. \n &#8220;That&#8217;s telling us something on a larger scale is happening,&#8221; Josberger, a senior scientist at the geological survey stationed in Tacoma, Washington, said in an interview. \n \n Melting glaciers add to the rise of sea level, threatening low-lying and coastal communities. The loss of glaciers in the Northwest also affects rivers and streams where species such as bull trout and salmon live, Josberger said. Those fish prefer the colder, highly oxygenated water that runs off the glaciers in the spring and summer. \n \n Maritime, Interior Glaciers \n \n Two of the glaciers, Wolverine on Alaska&#8217;s coast and South Cascade, are in maritime climates that are strongly influenced by Pacific Ocean currents and winter storms. The third, Gulkana, is in the interior of Alaska where there is less annual snowfall and the temperatures are colder and drier. \n \n Scientists track the growth and decline of glaciers by taking snow core samples and measuring the height of the annual snowfall. The data are used to estimate the net balance of a glacier, its average mass over a year. \n \n &#8220;More than 99 percent of America&#8217;s thousands of large glaciers have long-documented records of an overall shrinkage as climate warms,&#8221; agency scientist Bruce Molnia said in a statement. \n \n Global warming is shrinking glaciers in the Himalayan mountains, threatening water supplies in China and India, and increasing the likelihood of regional disputes, according to a report earlier this year from the Asia Society, a New York-based nonprofit group that promotes Asian-U.S. relations. Asia, with half the world&#8217;s population, has less fresh water than any continent except Antarctica. \n \n To contact the reporter on this story: Jim Efstathiou Jr. in New York at jefstathiou@bloomberg.net \n \n Last Updated: August 6, 2009 15:04 EDT", 
   {
    "post_info": {
     "post_title": "Shrinking Glaciers Reveal Global Warming in U.S. Northwest"
    }
   }, 
   364314, 
   null, 
   1249611720.0
  ], 
  [
   364316, 
   null, 
   "Winston Smith", 
   "The Astronomical Society of Australia have just released a report confirming we have embarked on a ~25 year global cooling trend, the scientific consensus is in and there is only a holdout amongst head in the sand denialists.\n \n btw even if you don't believe in global cooling (which no sane or honest person would deny - do you work for a carbon capture corporation by any chance, hmmm!?), surely you agree that we have to do something now to prevent even the possibility of it!\n\n \n do you by any chance work for the coal mining industry ?", 
   {}, 
   364310, 
   null, 
   1249611900.0
  ], 
  [
   364318, 
   null, 
   "Symbiote", 
   "As the scientific community knows, glaciers are a lagging indicator used as propaganda by carbon trading corporates to justify their greed.\n \n The fact is anyone who genuinely cares about the planet admits global cooling is a real problem, and the government needs to act, harshly, brutally and punitively to deal with it. Those with true compassion suggest immediate decapitation of all people involved in the solar and wind industries, with their corpses to be burned over the antarctic.\n \n Your objections are irrelevant, we have no time for naysayers. We need to act NOW.", 
   {}, 
   364316, 
   null, 
   1249612260.0
  ], 
  [
   364354, 
   null, 
   "Winston Smith", 
   "ACT! emoticon_rolleyes", 
   {}, 
   364318, 
   null, 
   1249626420.0
  ], 
  [
   364355, 
   null, 
   "Winston Smith", 
   "we will just pass a law preventing any of you global warming deniers from buying or using fnas or air conditioners in your cars, places of work or houses.\n but since the planet is cooling according to you ... \n \n you live by the sword, you sweat by the sword", 
   {}, 
   364318, 
   null, 
   1249626660.0
  ], 
  [
   364363, 
   null, 
   "snakespit", 
   "The Astronomical Society of Australia have just released a report confirming we have embarked on a ~25 year global cooling trend, the scientific consensus is in and there is only a holdout amongst head in the sand denialists.\n \n btw even if you don't believe in global cooling (which no sane or honest person would deny - do you work for a carbon capture corporation by any chance, hmmm!?), surely you agree that we have to do something now to prevent even the possibility of it!\n\n \n \nInterestingly, the Sun's solar cycle has been in the phase locked mode for the last 105 yr (1900-2005) and the indications are that it is about to suffer another phase catastrophe in the later part of cycle 24 (i.e. the solar cycle that will peak in ~2011-2012). If this is the case, then we should expect that in the two decades following the phase catastrophe, the world's mean temperature should be noticeably cooler i.e. the cooling should start in the late 2010s. This claim is based on the precedent that there were noticeable decreases in the world's mean temperature following the last two phase catastrophes. The cool period know as the Dalton Minimum (1800-1820) that followed the phase catastrophe in the early 1790s and a similar cool period called the Victorian Minimum (1880-1900) that followed the phase catastrophe in the late 1870s.\n\n http://www.publish.csiro.au/view/journals/dsp_journal_fulltext.cfm?nid=138&f=AS06018\n The paper you reference (published in June '08) talks about cycles of solar activity. This paper in no way indicates that man made global warming is false. It suggests that solar activity occurs in cycles, and we may be coming to the end of a cycle of peak solar activity, after which the earth will cool a few degrees for a 20 year period. It is notable that if this does occur, it will be a temporary cooling. The overall temperature of the earth has increased dramatically over the past 200 years in spite of both the Dalton and Victorian minimums. So while this cooling could temporarily bring global temps down, they will return to pre-minimum levels, which will still be above average. \n \n But then it should be noted that one of the authors of this paper recommended that we bulldoze snow to make it less reflective to counter the effects of global cooling. Genious. emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   364310, 
   null, 
   1249632180.0
  ], 
  [
   364364, 
   null, 
   "Symbiote", 
   "First of all snakespit, I had thought better of you than to schill for corporate interests, I guess I was wrong.\n \n Secondly, we are past the point of debating the issue - it is too critical to the future of humanity to avoid global cooling to at this point have it in the hands of denialists and head-in-the-sanders. Either start shovelling coal or get out of the way, no more hand waving and do-nothing arguments designed to obfuscate the issue while you get rich exploiting the planet.\n \n As the past illustrates, global cooling can easily run away, freezing much of the planet. If you have any sense at all you will agree we need to stop this from happening, regardless of how much you have invested in the carbon trading markets. The people warning about this are scientists, you are not qualified to disagree with them or question their logic.\n \n If you want anyone to take you seriously you need to link peer reviewed papers from at least 10 qualified astronomers denying global cooling - I will then proceed to smear and defame them based on their age, race, gender, employer (past or present), education, papers published by them earlier in their careers, or tangential association with carbon trading corporations or government funded entities.", 
   {}, 
   364363, 
   null, 
   1249632900.0
  ], 
  [
   364366, 
   null, 
   "Winston Smith", 
   "people like you, specially you, ought to be taken to a sauna and let to steam at 100 degree C while waiting for the planet to cool. or better still be taken to a tropical island one of those sinking below sea level thanks to man induced global warming and buried to your neck on the beach waiting for the hight tide to come in or the sea level drop.", 
   {}, 
   364364, 
   null, 
   1249638540.0
  ], 
  [
   364377, 
   null, 
   "snakespit", 
   "First of all snakespit, I had thought better of you than to schill for corporate interests, I guess I was wrong.\n \n Secondly, we are past the point of debating the issue - it is too critical to the future of humanity to avoid global cooling to at this point have it in the hands of denialists and head-in-the-sanders. Either start shovelling coal or get out of the way, no more hand waving and do-nothing arguments designed to obfuscate the issue while you get rich exploiting the planet.\n \n As the past illustrates, global cooling can easily run away, freezing much of the planet. If you have any sense at all you will agree we need to stop this from happening, regardless of how much you have invested in the carbon trading markets. The people warning about this are scientists, you are not qualified to disagree with them or question their logic.\n \n If you want anyone to take you seriously you need to link peer reviewed papers from at least 10 qualified astronomers denying global cooling - I will then proceed to smear and defame them based on their age, race, gender, employer (past or present), education, papers published by them earlier in their careers, or tangential association with carbon trading corporations or government funded entities.\n\n \n Either you are trolling, or completely impervious to logic and common sense. :)", 
   {}, 
   364364, 
   null, 
   1249649160.0
  ], 
  [
   364379, 
   null, 
   "gansao", 
   "I am doing my very best to try to stop global cooling but there is only so much one person can do.\n I drive the biggest car with the biggest engine I can afford. It was made in 1996 and is a grey import from Japan so it produces plenty of CO2.\n I also try to produce as much methane that I can( actually I find this quite easy).\n It looks like China and India are helping to stop the Earth cooling by building hundreds of coal fired power stations. That should cancel out a few wind turbinesemoticon_xgood", 
   {}, 
   364366, 
   null, 
   1249649880.0
  ], 
  [
   364381, 
   null, 
   "gansao", 
   "Either you are trolling, or completely impervious to logic and common sense. :)\n\n \n I think Symbiote is making a valid point and not trolling at all!\n Anyone who doubts the certainty of global warming are called 'deniers' by the believers with the same venom that 'heretic' was used against others in the past .\n The total knowledge of all the people who believe in global warming on this forum is gleaned from newspapers and the internet. I dont believe anyone on here actually is involved in research.\n So my guess is as good as yours.", 
   {}, 
   364377, 
   null, 
   1249650540.0
  ], 
  [
   364383, 
   null, 
   "Jo Bennett", 
   "\n The total knowledge of all the people who believe in global warming on this forum is gleaned from newspapers and the internet. I dont believe anyone on here actually is involved in research.\n \n\n \n That's actually a false dichotomy. I have studied related fields so I have some knowledge beyond the layman in the relevant areas of quantum physics, I'm by no means an expert in the field but to say all my knowledge comes from newspapers and the Internet is incorrect.\n \n I have no doubt at all that there are solar radiation cycles that affect our climate. This has no bearing on the problems caused by CO2 emissions, the most it can do is provide a breathing space to get CO2 emissions under control. If temperatures are restrained slightly by a low point in natural cycles then it will give us time to get low carbon technology in place for when it reaches another peak - a peak in natural cycles plus the effect of CO2 emissions would be even worse.", 
   {}, 
   364381, 
   null, 
   1249652820.0
  ], 
  [
   364386, 
   null, 
   "Symbiote", 
   "I have no doubt at all that there are solar radiation cycles that affect our climate.\n\n \n My god, can we finally put to rest the myth that recent climate change has been a result of solar cycles? \n \n Man is causing this cooling by burning insufficient fossil fuels, regardless of what you denialists believe, fossil fuel emissions drive climate change. The recent high point in solar cycles has given us a breathing space to get our CO2 emissions up to scratch. If temperatures are slightly elevated by a high point in natural cycles it will give us time to build up our high carbon technology for when it reaches another low. A low in natural cycles plus the effect of low CO2 emissions would be even worse.\n \n Where is your list of astronomers for me to ridicule and potentially write threatening letters to? Do you call failing to provide me with a list of astronomers to attack science!? I think not!", 
   {}, 
   364383, 
   null, 
   1249653540.0
  ], 
  [
   364392, 
   null, 
   "Winston Smith", 
   "Either you are trolling, or completely impervious to logic and common sense. :)\n\n \n \n of course she is trolling, how many posting of hers you have to read to realize that? \n \n she doesn't want to admit what she knows it's true so she is making fun of it.\n \n making fun of it won't cool the Earth. :)\n \n I suppose that had she been aboard the Titanic she would have denied it was sinking and kept on dancing until she was in the water.", 
   {}, 
   364377, 
   null, 
   1249655280.0
  ], 
  [
   364397, 
   null, 
   "Archangel", 
   "Here's some science worth considering. http://icecap.us/images/uploads/TheCooling.pdf", 
   {}, 
   364386, 
   null, 
   1249655820.0
  ], 
  [
   364404, 
   null, 
   "gansao", 
   "That's actually a false dichotomy. I have studied related fields so I have some knowledge beyond the layman in the relevant areas of quantum physics, I'm by no means an expert in the field but to say all my knowledge comes from newspapers and the Internet is incorrect.\n \n \n\n Which adds up to you have no more idea whether global warming is actually happening nor whether man is the cause of it than I have.", 
   {}, 
   364383, 
   null, 
   1249658100.0
  ], 
  [
   364405, 
   null, 
   "gansao", 
   "If CO2 is the cause of global warming and global warming will cause a worldwide catastrophe in the near future then the biggest threat to mankind today is the industrialisation of China and India.\n So why is the West buying goods from these countries?\n Do all the Global warming Cassandras refuse to but cheap clothes and electrical goods from China or do they make do and mend to save the planet?", 
   {}, 
   364404, 
   null, 
   1249658460.0
  ], 
  [
   364418, 
   null, 
   "Winston Smith", 
   "if you knew anything about Greek mythology you ought to know that Cassandra was proven right\n \n the difference between you and symbiote is that she knows that the earth is not cooling down, so she resorts to sarcasm trying to make fun of the scientific consensus that yes CO2 is warming up the planet. you instead think that really the earth is not warming up.\n \n If you put a heater in a room and as the temperature is raising you turn on the air conditioner of course the room's temp will drop for as long as the aircond is on but it doesn't mean the heater is not introducing heat in the room. the earth's 'heater' is the CO2 we the human kind is pumping into the atmosphere.", 
   {}, 
   364405, 
   null, 
   1249663260.0
  ], 
  [
   364420, 
   null, 
   "Winston Smith", 
   "I think Symbiote is making a valid point and not trolling at all!\n Anyone who doubts the certainty of global warming are called 'deniers' by the believers with the same venom that 'heretic' was used against others in the past .\n The total knowledge of all the people who believe in global warming on this forum is gleaned from newspapers and the internet. I dont believe anyone on here actually is involved in research.\n So my guess is as good as yours.\n\n \n these people are involved in research:\n \n This article was written by Michael Raupach and John Church, CSIRO; David Griggs, Amanda Lynch and Neville Nicholls, Monash University; Nathan Bindoff, Antarctic Climate and Ecosystems Co-operative Research Centre; Matthew England and Andy Pitman, University of NSW; Ann Henderson-Sellers and Lesley Hughes, Macquarie University; Ove Hoegh-Guldberg, University of Queensland; Roger Jones, Victoria University; David Karoly, University of Melbourne; and Tony McMichael and Will Steffen, Australian National University.\n \n Climate change poised to feed on itself - Opinion - smh.com.au\n \n it is not our guess. what you read in the internet on on papers and magazines are the results and pronostics of scientists, not the reporter's opinion who wrote the article for the newspapers or their readers.\n \n Do you think that governments all over the world are acting because of something they wrote here in this forum?", 
   {}, 
   364381, 
   null, 
   1249663440.0
  ], 
  [
   364421, 
   null, 
   "gansao", 
   "Thats the problem, they are not acting !\n If the world leaders were as convinced as you are about global warming they would be far more aggressive in trying to combat it!\n \n I dont know whether the earth is warming up or not and neither do you!\n As I stated all of your information comes from the newspapers and internet and you confirmed it !\n \n Cassandra was probably the wrong choice to describe global warming believers because as you say, she was correct and at the moment we do not know whether they are or not.\n \n As I stated China and India must be seen as a threat to mankind if they industrialise so why are we feeding the thing that will destroy us?\n \n Resources of oil and gas are supposed to be running out. The countries with the most oil and gas are generally ones that are not particularly friendly to the West. After the cold war there does not seem to be much that can frighten the people of the West enough to make them compliant. It would be in the interest of both the Suppliers and the consumer governments to have us believe that using the worlds resources of oil and gas at the present rate will result in catastrophe.\n \n I stress again I do not know whether global warming is as bad as we are led to believe and I do not know whether it is a man made problem but I do know that governments will lie to us.\n If the global warming information given to us through the media had a lot less worst case scenarios presented to us as inevitable and the believers did not shout 'denier' at anyone who might question it , I might take it more seriously.\n Until then my guess is as good as yours.", 
   {}, 
   364420, 
   null, 
   1249665180.0
  ], 
  [
   364424, 
   null, 
   "gansao", 
   "CNSNews.com - Another New Study Challenges Climate Change ?Orthodoxy?\n \n \n \n http://climatedepot.com/a/611/UN-IPCC-Scientist-No-convincing-scientific-arguments-to-support-claim-that-increases-in-greenhouse-gases-are-harmful-to-the-climate\n \n and this one!\n \n You see I can find evidence to support my argument in the same way as you did.", 
   {}, 
   364421, 
   null, 
   1249667580.0
  ], 
  [
   364473, 
   null, 
   "gansao", 
   "Climate Skeptics Reveal 'Horror Stories' of Scientific Suppression (NYC Conference Report)\n \n another article quoting scientists", 
   {
    "unicode_changes_made": true
   }, 
   364424, 
   null, 
   1249679820.0
  ], 
  [
   364487, 
   null, 
   "simone", 
   "CNSNews.com - Another New Study Challenges Climate Change ?Orthodoxy?\n \n \n \n UN IPCC Scientist: 'No convincing scientific arguments to support claim that increases in greenhouse gases are harmful to the climate' | Climate Depot\n \n and this one!\n \n You see I can find evidence to support my argument in the same way as you did.\n\n CNSN! Ptah!\n \n Founded by right wing nitwit Brent Bozell III.\n \n Got any decent resources on this?", 
   {}, 
   364424, 
   null, 
   1249685460.0
  ], 
  [
   364489, 
   null, 
   "simone", 
   "Climate Skeptics Reveal 'Horror Stories' of Scientific Suppression (NYC Conference Report)\n \n another article quoting scientists\n\n Jeepers creepers! FreeRepublic!\n \n Like the bleeding Freepers have anything worthwhile to say.\n \n Give me a break!", 
   {
    "unicode_changes_made": true
   }, 
   364473, 
   null, 
   1249685580.0
  ], 
  [
   364492, 
   null, 
   "gansao", 
   "Same ol 'same ol' if it dont agree then it cant be right.\n \n These are the views of people who have first hand information to research but do not agree with with the current religion!\n Simone cant even disagree with their views because she doesnt know anything about it so she says things like ptahemoticon_rolleyes", 
   {}, 
   364489, 
   null, 
   1249686000.0
  ], 
  [
   364496, 
   null, 
   "Jo Bennett", 
   "Same ol 'same ol' if it dont agree then it cant be right.\n \n These are the views of people who have first hand information to research but do not agree with with the current religion!\n Simone cant even disagree with their views because she doesnt know anything about it so she says things like ptahemoticon_rolleyes\n\n \n Thing is, when you quote those sort of sources, it's hard to respond to them without knowing how much of it theyve made up. We know, for example, that the 400 scientists claim is junk, the list containing a great many economists, others who agree with the science of global warming but think technology will get us out of the mess, and a great many who are no more scientists than I am (i.e. they have a degree in a science subject). Knowing that this list is complete hocum, what are we to make of the rest of the piece?", 
   {}, 
   364492, 
   null, 
   1249687140.0
  ], 
  [
   364499, 
   null, 
   "gansao", 
   "Thing is, when you quote those sort of sources, it's hard to respond to them without knowing how much of it theyve made up. We know, for example, that the 400 scientists claim is junk, the list containing a great many economists, others who agree with the science of global warming but think technology will get us out of the mess, and a great many who are no more scientists than I am (i.e. they have a degree in a science subject). Knowing that this list is complete hocum, what are we to make of the rest of the piece?\n\n \n \n Quote... De Freitas, based at Auckland University&#8217;s School of Geography and Environmental Science and with 30 years of climate science under his belt, does not deny that atmospheric CO2 concentration is rising, but questions the effect that that is having, and in particular whether it is dangerous.\n \n Quote... \"Al Gore brought me back to the battle and prompted me to do renewed research in the field of climatology. And because of all the misinformation that Gore and his army have been spreading about climate change I have decided that &#8216;real' climatologists should try to help the public understand the nature of the problem,&#8221; Climatologist Robert Durrenberger, past president of the American Association of State Climatologists, declared in May 2007. \n \n \n \n \n \n The thing is ..there are eminent scientists who think that man made global warming has become a religion, that we are given worst case scenarios as fact when they are not and that there should be a more constructive argument to promote GW not the apocalyptic shrill that is fed to us by the media.\n My point is that you me and everyone on this forum gets our information through the same sources so ...your guess is as good as mine..but no better.\n \n There are climate scientists that are sceptical about the global warming doomfest that is being pedalled today but if it was a government lie one would expect that they would have little chance to put forward their argument against . Also it would not be in the interest of anyone wanting a doctorate in climate sciences to express any doubt.", 
   {}, 
   364496, 
   null, 
   1249688280.0
  ], 
  [
   364501, 
   null, 
   "Jo Bennett", 
   "The problem with that argument is that for most of the 8 years of the Bush presidency, the US government was intent on trying to undermine climate change science, as were the major energy companies. Bush finally bowed to the overwhelming weight of the evidence and, yes, the consensus. There were plenty of people looking very hard to find alternative explanations for the evidence and the reality is that they failed totally. If a researcher, whether post-grad or post-doc or professor, finds compelling evidence that undermines the theories that underpin climate change they're going to be hailed as a genius, and if someone had already come up with this evidence then the denial industry would be proclaiming it from the rooftops, as they've already attempted to do with their myriad other attempts (sunspots et al). Finally if such evidence exist there ought to be some scientific papers outlining it. I've posted links in the past to an archive of the papers, dating back a century or more, that support climate change, where are the papers that undermine it?", 
   {}, 
   364499, 
   null, 
   1249688940.0
  ], 
  [
   364506, 
   null, 
   "gansao", 
   "The problem with that argument is that for most of the 8 years of the Bush presidency, the US government was intent on trying to undermine climate change science, as were the major energy companies. Bush finally bowed to the overwhelming weight of the evidence and, yes, the consensus. There were plenty of people looking very hard to find alternative explanations for the evidence and the reality is that they failed totally. If a researcher, whether post-grad or post-doc or professor, finds compelling evidence that undermines the theories that underpin climate change they're going to be hailed as a genius, and if someone had already come up with this evidence then the denial industry would be proclaiming it from the rooftops, as they've already attempted to do with their myriad other attempts (sunspots et al). Finally if such evidence exist there ought to be some scientific papers outlining it. I've posted links in the past to an archive of the papers, dating back a century or more, that support climate change, where are the papers that undermine it?\n\n \n \n They would not be hailed as a genius if the world governments did not want people to believe it!!\n \n Ive posted links to climatologists that doubt man made global warming but of course they cant be right because they do not believe in global warmingemoticon_xdonno\n \n I notice you use the term deniers..curious\n \n there is evidence to support man made global warming and there is evidence against( but any evidence against must be bogus..right) and there are climatologists that believe in man made global warming and a few that do not(\n but they are deniers so they must be wrong..right).\n \n The papers that you linked have no relevance because you are not a climatologist so even if you have read them you are not qualified to comment on them.\n So once again..my guess is as good as yours\n \n As for the bush government. They may have been persuaded that man made global warming is a reality or the only wayto reduce the dependence of the west to a commodity that is getting scarcer and in the hands of potential lethal enemies and to control the masses with fear all at the same time.\n \n I dont know and nor do you", 
   {}, 
   364501, 
   null, 
   1249690080.0
  ], 
  [
   364510, 
   null, 
   "Winston Smith", 
   "if you don't know and you said that all information obtained in newspaper is false then why do you bother to provide it here ?\n \n for someone who said that doesn't know it is clear from your postings that you had the strong opinion that the earth is not warming up.\n if you were consequent with your words you would not have an opinion either in favor or against global warming.\n \n why do you think the glaciers are melting all over the world if the temp is not rising? \n \n do you really think that basic science is wrong also and CO2 does not trap heat? This was proven in the XIXth century by the way.\n \n so governments are listening to scientists who know nothing, such as the group of Australian scientists I quoted several times in this thread?\n \n I suppose that if a loony tells you that the earth is flat that would be enough for you to believe it is so.\n \n Have a look at any chart of temperature of the earth since the dawn of the industrial age and you will see an average steady rise. There are spikes up and down but the trend is definitely upwards.\n \n If you want to sit and wait for the Titanic to sink be my guest, but the rest of us are pumping the water out and trying to plug the hole, if it is not too late already.\n \n I know what people like you will say if nothing is done and the predictions come true:\n \n \"Well, it wasn't proven then, I had to see it with my own eyes to be convinced\" and also of course \"Why didn't the government do something, isn't that what the government is supposed to do?\"\n \n I suppose that the only way for you to be convinced that if you jump off a cliff you'll fall and kill yourself is to try it, right?\n \n Well, most people have common sense and therefore listen to the consensus of the experts on the matter.", 
   {
    "post_info": {
     "post_title": "the sky is not falling"
    }
   }, 
   364506, 
   null, 
   1249696260.0
  ], 
  [
   364516, 
   null, 
   "Symbiote", 
   "blah blah blah, more pomp and bluster from unscientific global cooling denialists. We can talk once you find me a list of denialist astronomers, until then let the scientists do the thinking.", 
   {}, 
   364510, 
   null, 
   1249699740.0
  ], 
  [
   364534, 
   null, 
   "gansao", 
   "if you don't know and you said that all information obtained in newspaper is false then why do you bother to provide it here ?\n \n for someone who said that doesn't know it is clear from your postings that you had the strong opinion that the earth is not warming up.\n if you were consequent with your words you would not have an opinion either in favor or against global warming.\n \n why do you think the glaciers are melting all over the world if the temp is not rising? \n \n do you really think that basic science is wrong also and CO2 does not trap heat? This was proven in the XIXth century by the way.\n \n so governments are listening to scientists who know nothing, such as the group of Australian scientists I quoted several times in this thread?\n \n I suppose that if a loony tells you that the earth is flat that would be enough for you to believe it is so.\n \n Have a look at any chart of temperature of the earth since the dawn of the industrial age and you will see an average steady rise. There are spikes up and down but the trend is definitely upwards.\n \n If you want to sit and wait for the Titanic to sink be my guest, but the rest of us are pumping the water out and trying to plug the hole, if it is not too late already.\n \n I know what people like you will say if nothing is done and the predictions come true:\n \n \"Well, it wasn't proven then, I had to see it with my own eyes to be convinced\" and also of course \"Why didn't the government do something, isn't that what the government is supposed to do?\"\n \n I suppose that the only way for you to be convinced that if you jump off a cliff you'll fall and kill yourself is to try it, right?\n \n Well, most people have common sense and therefore listen to the consensus of the experts on the matter.\n\n \n \n \n \n \n I have stressed time and time again that I get my source of information from the same place as you..the internet and newspapers and there are conflicting opinions from the internet and newspapers !\n I did not say they were wrong or right. I said that none of us are climate scientists so we do not know OR my guess is as good as yours ..didnt you read that or were you too busy bashing the keyboard with your superior opinionemoticon_rolleyes\n \n Yes CO2 traps heat in the atmosphere but not as much as water vapour!!\n Aparently the climate changes over the past few tears do not match the ipcc computer models etc etc.\n there is plenty of information on the internet and newspapers to make one sceptical of man made global warming.\n \n I will repeat my point again and maybe you will read it this time.\n The earth may or may not be warming up and if it is warming up it may or may not be due to increased CO2 in the atmosphere...\n The sources of oil and gas seem to drying up and we will need to cut back on our consumption anyway .So if we are led to believe that we are in IMMINENT danger from global warming because of our consumtion of oil and gas it would suit both the governments of the producers and the consumers.\n the price per unit of oil and gas will rise for the producers and it will make the populace of the consumers countries fearful .This would give the governments of the west far more power over the people.\n I do not trust our governments and I believe that they would never tell the truth when a lie will do.\n \n They will alway be able to find people like you to do their dirty work ie not read what people actually write but think' deniers' and post stupid comments about flat earth and Titanic yawnemoticon_xclown\n \n I bet the 31st december 1999 was a bad day for youemoticon_rolleyes\n \n and all this coming from someone who thinks Pearl harbour was an attacked by American planes in 1941", 
   {}, 
   364510, 
   null, 
   1249732800.0
  ], 
  [
   364535, 
   null, 
   "gansao", 
   "Another point that I posted but obviously went over your head is that China and India are busy building coal fired power stations by the hundreds . \n so while you are wringing your hands with worry and conglatulating yourself for buying low energy lightbulbs and dreaming of a Toyota prius they are planning to pump millions of tons of CO2 into the atmosphere!\n If the doomsday merchants are correct we will see the effects of man made global warming in our life time and it will be catastophic. So why are we in the west the biggest market for their produce?\n Do we not stop buying goods from countries that are deemed to be or potentially will be major polluters in the years to come?\n Why arent we completely rethinkiing the way that we will live in the latter part of the 21st century so that we can reduce the amount of CO2 produced and cope with the effects of what we have already done?\n Possibly because our governments do not believe in man made global warming as much as you do!", 
   {}, 
   364534, 
   null, 
   1249735560.0
  ], 
  [
   364661, 
   null, 
   "snakespit", 
   "I think Symbiote is making a valid point and not trolling at all!\n Anyone who doubts the certainty of global warming are called 'deniers' by the believers with the same venom that 'heretic' was used against others in the past .\n\n I like the terms 'uneducated' and 'naive' better than 'denier'. \n \n \nThe total knowledge of all the people who believe in global warming on this forum is gleaned from newspapers and the internet. I dont believe anyone on here actually is involved in research.\n So my guess is as good as yours.\n\n \n Spending time reading about any subject can be research. Just because someone is not a climatologist does not mean that they cannot educate themselves.", 
   {}, 
   364381, 
   null, 
   1249793160.0
  ], 
  [
   364666, 
   null, 
   "snakespit", 
   "I dont know whether the earth is warming up or not and neither do you!\n\n I do. \n So do these people.\n \n \nAs I stated China and India must be seen as a threat to mankind if they industrialise so why are we feeding the thing that will destroy us?\n\n Because many people don't believe it? Because some believe it but just don't care? Because people are greedy and more worried about making money? Should I continue?", 
   {}, 
   364421, 
   null, 
   1249795140.0
  ], 
  [
   364687, 
   null, 
   "gansao", 
   "I like the terms 'uneducated' and 'naive' better than 'denier'. .\n\n \n I prefer 'sceptic' and my choice is as valid as yours\n \n \n \n [QUOTE=snakespit;364661Spending time reading about any subject can be research. Just because someone is not a climatologist does not mean that they cannot educate themselves.[/QUOTE]\n \n Depends on what you read and if you understand it enough to know if it is valid.", 
   {}, 
   364661, 
   null, 
   1249818480.0
  ], 
  [
   364690, 
   null, 
   "gansao", 
   "I do. \n So do these people.\n \n\n Even if you 'know' the earth is warming up you and these people do not know if is man made...there is evidence but not proof\n \n \nBecause many people don't believe it? Because some believe it but just don't care? Because people are greedy and more worried about making money? Should I continue?\n\n \n you can if you want..why ask me?", 
   {}, 
   364666, 
   null, 
   1249818900.0
  ], 
  [
   364723, 
   null, 
   "snakespit", 
   "Even if you 'know' the earth is warming up you and these people do not know if is man made...there is evidence but not proof\n\n There is no 'if' about it. The earth has been warming dramatically for the last 200 years. The temperature record does not lie. \n \n So the question is this. If you are skeptical about man-made global warming...what is your alternative theory? Surely you have something. \n \n You asked an intersting question a few posts back\n \n \nWhy arent we completely rethinkiing the way that we will live in the latter part of the 21st century so that we can reduce the amount of CO2 produced and cope with the effects of what we have already done?\n \n\n Ask yourself that question. Many of us are already doing our part. Why aren't you?", 
   {}, 
   364690, 
   null, 
   1249839960.0
  ], 
  [
   364728, 
   null, 
   "gansao", 
   "There is no 'if' about it. The earth has been warming dramatically for the last 200 years. The temperature record does not lie. \n\n \n If the earths temperature has been rising for the last 200 years then it probably isnt due to man then is it ?So turning your thermostat down will not make a lot of difference!\n Your making it easy for meemoticon_xgood\n \n \nSo the question is this. If you are skeptical about man-made global warming...what is your alternative theory? Surely you have something. \n \n \n \n \n Ask yourself that question. Many of us are already doing our part. Why aren't you?\n\n \n \n The answers are in my previous posts", 
   {}, 
   364723, 
   null, 
   1249841700.0
  ], 
  [
   364839, 
   null, 
   "snakespit", 
   "If the earths temperature has been rising for the last 200 years then it probably isnt due to man then is it ?So turning your thermostat down will not make a lot of difference!\n\n Turning my thermostat down will not make a lot of difference, but if everyone turned their thermostat down...\n \n And why would you say that man is probably not responsible? Ever heard of a little thing called the industrial revolution? \n \n \nThe answers are in my previous posts\n\n \n You have repeated something similar to this over and over...\n \n \nI have stressed time and time again that I get my source of information from the same place as you..the internet and newspapers and there are conflicting opinions from the internet and newspapers !\n I did not say they were wrong or right. I said that none of us are climate scientists so we do not know OR my guess is as good as yours \n\n \n Just because I am not a climatologist does not mean that I cannot educate myself and form an educated opinion. You seem to feel that only experts should be allowed to have a firm belief about global warming. I think you either lack basic reading comprehension and deductive reasoning skills, or you simply have not put time into learning about the subject. \n \n \nThe earth may or may not be warming up and if it is warming up it may or may not be due to increased CO2 in the atmosphere...\n\n While the involvment of CO2 is the most probable explanation by far, I could accept you saying that you do not believe that it is the cause of global warming. What I cannot accept is that you don't even seem willing to admit that the earth is warming up. That is a proven fact, yet you still seem unwilling to admit it. No wonder people like you are called 'deniers'. \n \n I will ask again...\n \n Do you have any alternative theory to explain why the earth has warmed dramatically?", 
   {}, 
   364728, 
   null, 
   1249880760.0
  ], 
  [
   364856, 
   null, 
   "gansao", 
   "Turning my thermostat down will not make a lot of difference, but if everyone turned their thermostat down...\n\n \n Tell that to the Chinese and Indians every time you turn your lights off early they build another coal fired power station\n \n \nAnd why would you say that man is probably not responsible? Ever heard of a little thing called the industrial revolution? ...\n\n Are you kidding me? You think that the Industrial revolution started the warming the Earth 200 years ago.And you say you have studied global warming? You obviously do not know anything about the Industrial revolution if you think the amount of energy gained fron coal was enough to start global warming from 200 years agoemoticon_xdonno\n \n \n \nYou have repeated something similar to this over and over...\n\n \n Just as you are repeating something similar\n \n \n \n \nJust because I am not a climatologist does not mean that I cannot educate myself and form an educated opinion. You seem to feel that only experts should be allowed to have a firm belief about global warming. ...?\n \n You can deduce whatever you want to from reading the newspapers and the internet but I do not feel obliged to agree with you.\n \n \nI think you either lack basic reading comprehension and deductive reasoning skills, or you simply have not put time into learning about the subject. ...?\n \n \n This confirms what I have been saying people who believe in man made global warming. Because I do not agree with you I must be lacking in something that they have.\n Anyone can say that.It does not help one bit with your argument and it tells more about you than your argument.\n I have put forward my reasons for being sceptical about man made global warming. I would even( and have) accept for the purpose of the debate that the earth is warming .\n You have not answered any of the points I made. Indeed you have put at least one point so stupid that it confirms my sceptism. Then you accuse ME of lacking reasoning skills etc.\n You are shouting 'heretic' at someone who is sceptical of you half baked conclusions\n \n \n \n \n \n \nWhile the involvment of CO2 is the most probable explanation by far, I could accept you saying that you do not believe that it is the cause of global warming. What I cannot accept is that you don't even seem willing to admit that the earth is warming up. That is a proven fact, yet you still seem unwilling to admit it. No wonder people like you are called 'deniers'. ...?\n\n \n Do you not know what the word 'if' means I have not actually denied the earth is warming up. I dont know and nor do you. I also stressed that IF the Earth is warming up there still is the question of whether it is man made or not.\n \n And you say I lack basic reading skills\n \n \nI will ask again...\n \n Do you have any alternative theory to explain why the earth has warmed dramatically...?\n\n Give me strength:(", 
   {}, 
   364839, 
   null, 
   1249903560.0
  ], 
  [
   364875, 
   null, 
   "Penfold", 
   "We'll take that as a no, then. Contrarianism might seem fun, but it is intellectual bankruptcy.", 
   {}, 
   364856, 
   null, 
   1249914420.0
  ], 
  [
   364881, 
   null, 
   "gansao", 
   "We'll take that as a no, then. Contrarianism might seem fun, but it is intellectual bankruptcy.\n\n \n As usual Penfold trolls without reading the postsemoticon_xclown", 
   {}, 
   364875, 
   null, 
   1249919280.0
  ], 
  [
   364940, 
   null, 
   "snakespit", 
   "Are you kidding me? You think that the Industrial revolution started the warming the Earth 200 years ago.And you say you have studied global warming? You obviously do not know anything about the Industrial revolution if you think the amount of energy gained fron coal was enough to start global warming from 200 years agoemoticon_xdonno\n\n It has nothing to do with \"amount of energy gained\"...whatever that means. It does however have to do with the release of greenhouse gases due to the mass burning of fossil fuels that began back in the mid to late 18th century (strangely enough, about the time of the beginning of the idustrial revolution). The first appreciable rises in global CO2 concentration appeared ~1840. \n \n \nI have put forward my reasons for being sceptical about man made global warming.\n\n Where?\n \n \nDo you not know what the word 'if' means I have not actually denied the earth is warming up. I dont know and nor do you. I also stressed that IF the Earth is warming up there still is the question of whether it is man made or not.\n\n Herein lies the problem. Until you can accept some basic facts, you are not worth debating. I already posted a link showing global temps, including the unprecedented increase since ~1950. There is no doubt that the global temp has risen, the only question is what has made it rise? If you are not ready to unequivocally accept the facts regarding the global temp increase, then you have no business in this debate.", 
   {}, 
   364856, 
   null, 
   1249945800.0
  ], 
  [
   364943, 
   null, 
   "Penfold", 
   "As usual Penfold trolls without reading the postsemoticon_xclown\n\n \n ..........While Gansao demonstrates the accuracy of Penfold's assessment.", 
   {}, 
   364881, 
   null, 
   1249946040.0
  ], 
  [
   364946, 
   null, 
   "gansao", 
   "It has nothing to do with \"amount of energy gained\"...whatever that means. It does however have to do with the release of greenhouse gases due to the mass burning of fossil fuels that began back in the mid to late 18th century (strangely enough, about the time of the beginning of the idustrial revolution). The first appreciable rises in global CO2 concentration appeared ~1840. \n\n \n In the 18th century they only needed a small amount of energy from fossil fuels because there was only a tiny amount of energy needed to run the mills and factories that where there.\n Also they had a lot fewer motors cars than there are today ..in fact there were No motor cars because they had not been invented.\n Therefore if the energy requirements where miniscule compared with today the fossil fuels burnt were miniscule compared with today so it must follow that the amount of CO2 released into the atmosphere was miniscule compared to today.Hope that explains what I mean by amount of energy gained.\n So guess what ..the amount of man made global warmong must have been miniscule compared with today.\n \n So..if global warming increased significantly in 1840 it could not have been caused by the amount of CO2 released into the atmosphere by man.\n \n \n \n \n \nWhere?.\n\n \n Its there if you bother to look\n \n \n \nHerein lies the problem. Until you can accept some basic facts, you are not worth debating. I already posted a link showing global temps, including the unprecedented increase since ~1950. There is no doubt that the global temp has risen, the only question is what has made it rise? If you are not ready to unequivocally accept the facts regarding the global temp increase, then you have no business in this debate.\n\n \n As I said on the last post I am quite willing to accept for the purpose of debate that the global temperature is rising. It may well be rising.\n Between 5000 and 3000BC average global temperatures were warmer than they are today and 1550 to 1850 AD there was a cooling period known as the little Ice age. So just as the earth warmed up ..it cooled later\n There was even serious talk of a forthcoming ice age predicted by scientists in the 1970s.\n What you and the other warmers seem to insist on is that the rise is a caused by human activity.", 
   {}, 
   364940, 
   null, 
   1249947420.0
  ], 
  [
   364948, 
   null, 
   "gansao", 
   "..........While Gansao demonstrates the accuracy of Penfold's assessment.\n\n \n \n If you dont read the posts Penfold you cant really assess .", 
   {}, 
   364943, 
   null, 
   1249947720.0
  ], 
  [
   364956, 
   null, 
   "Jo Bennett", 
   "\n As I said on the last post I am quite willing to accept for the purpose of debate that the global temperature is rising. It may well be rising.\n Between 5000 and 3000BC average global temperatures were warmer than they are today and 1550 to 1850 AD there was a cooling period known as the little Ice age. So just as the earth warmed up ..it cooled later\n There was even serious talk of a forthcoming ice age predicted by scientists in the 1970s.\n What you and the other warmers seem to insist on is that the rise is a caused by human activity.\n\n \n Thing is, we know that heightened CO2 levels cause warming, it's a matter of basic physics.\n We know that CO2 levels have increased massively in recent years, now around 35% above the long term average.\n We know that the increase is a result of human activity.\n The only topic for discussion is how much of an increase will be caused in the future.", 
   {}, 
   364946, 
   null, 
   1249953720.0
  ], 
  [
   364967, 
   null, 
   "Penfold", 
   "Those liberal glaciers are only melting to make a political point!\n \n \" U.S. scientists monitoring shrinking glaciers in Washington and Alaska reported this week that a major meltdown is under way.\n \n The Gulkana glacier in Alaska is one of three glaciers considered a benchmark by the U.S. Geological Survey.\n \n A 50-year government study found that the world's glaciers are melting at a rapid and alarming rate. The ongoing study is the latest in a series of reports that found glaciers worldwide are melting faster than anyone had predicted they would just a few years ago.\n \n It offers a clear indication of an accelerating climate change and warming earth, according to the authors. ...... \"\n \n \n Glaciers a canary in the coal mine of global warming - CNN.com", 
   {}, 
   364956, 
   null, 
   1249957800.0
  ], 
  [
   364989, 
   null, 
   "gansao", 
   "Thing is, we know that heightened CO2 levels cause warming, it's a matter of basic physics.\n We know that CO2 levels have increased massively in recent years, now around 35% above the long term average.\n We know that the increase is a result of human activity.\n The only topic for discussion is how much of an increase will be caused in the future.\n\n To be honest Jo, that was the answer I was after!\n You never copy and pasted.\n You never called me a denier but to refute what you posted would make me one!\n \n In truth there are certain aspects of my previous posts that I am concerned about. I do suspect that our governments would gain in an alarmist global warming debate.\n The public would accept having huge wind farms across the country and sky high energy prices if they thought that global warming will cause a catastophic change in the climate in 20 years rather than 100 years.\n Also it is said that reserves of coal, oil and gas are depleting and will not last much longer so we need to find alternative ways to produce energy anyway.\n Once again it would be in the interest of the western governments to egg the global warming pudding to frighten us into accepting higher energy prices etc.\n Also China and India ( and Brazil I think) are building power stations at an alarming rate kind of cancels out all the efforts that we in the West are making to conserve energy.\n None of that negates the fact that global warming is a real phenomen and as you say..The only topic for discussion is how much of an increase will be caused in the future.\n \n I was going to say that the smoking gun lies in the glaciers but Penfold beat me to it!\n \n \n By the way I have low energy bulbs throughout the house, cavity wall insulation, double glazing, loft insulation and I want to invest in a condensing boiler next year. \n I drive a large car but its old and will only last a couple more years and my wife drives a very small Renault.\n So I am doing my bit!\n \n As a physics lecturer , do you think a nuclear fusion reactor is an impossible dream?", 
   {}, 
   364956, 
   null, 
   1249977600.0
  ], 
  [
   364992, 
   null, 
   "Jo Bennett", 
   "There is no overriding government interest in climate change that I can see. It would be an awful lot easier in both Britain and the US to rely on coal. Britain has coal for 300 years or more (and considerable marginal oil shales in places like North Somerset), I could see an argument for a tory government 20 years ago not wanting coal from a political point of view, but any government today would rather do without the headache of nimbyism over wind turbines and nuclear power. I don't see an interest for the government in higher energy prices either. Either politicians have genuine concerns about climate change, or they are responding to public concerns about climate change for electoral expediency.\n \n I agree that the short term impact of energy saving measures will be cancelled out by growth in China and India, but in 10 years time we need to be able to go to India and China and say, \"look, we know it wouldn't be fair to ask you to not develop in order to save the world from the mess we made, but we've cut our contribution as much as possible, here's the tech we've used now can you agree to use this in future and develop more sustainably?\" There's already signs of this happening with India asking for development money for a massive photo-voltaic solar plant.\n \n As for fusion, I don't know enough detail the make a judgement of my own, but I understand that cold fusion is impossible as far as our current knowledge of physics goes, and hot fusion will need to be on a massive scale to produce rather than consume energy, because containing plasma is hugely energy consuming.", 
   {}, 
   364989, 
   null, 
   1249990440.0
  ], 
  [
   365009, 
   null, 
   "Winston Smith", 
   "Keep mining coal and pumping petroleum, the more the better for they are non-renewable resources and the sooner we run out of them, the sooner our civilization will collapse and that is good news for the planet and all other species except our own.\n Imagine a pristine planet, without the worst animal ever to walk on the face of the Earth, the most destructicve pest ever, gone for good or reduced to a few million instead of billions. No more mass slaughter of whales, fish, chicken, pigs, horses, cows etc. No more cruel raising of animals for the consumption of the human kind. No more 'experimentation' with defenseless animals either.\n No more destruction of wild life and their habitat, no more mass extinctions of species by the human kind.\n No more oil spills, no more toxic waste, no more radioactive waste.\n So I thank China, India, and the US of A for helping rid the planet of the human race. That is being greenies with a capital G.\n \n By a big car, a humvee preferably, and fly around the world as often as you can. Have lots of fat kids. Have a great time at the airconditioned mall. Eat as much as you can. Consume as if there is no tomorrow.\n It is all for a good cause: to save our beautiful blue planet.\n \n Enjoy! emoticon_xgood", 
   {}, 
   364992, 
   null, 
   1250000280.0
  ], 
  [
   365015, 
   null, 
   "Jo Bennett", 
   "Problem is that we're likely to cause a mass extinction event of the kind that has wiped out 95% of the species alive at the time. Plus human beings are like cockroaches, when pressed we'll live in almost any conditions.", 
   {}, 
   365009, 
   null, 
   1250004420.0
  ], 
  [
   365027, 
   null, 
   "gansao", 
   "I live on a island created by reclaimed land in the Thames Estuary near London.\n My house is below sea level!\n Could be problem.", 
   {}, 
   365015, 
   null, 
   1250007180.0
  ], 
  [
   365104, 
   null, 
   "Winston Smith", 
   "Problem is that we're likely to cause a mass extinction event of the kind that has wiped out 95% of the species alive at the time. Plus human beings are like cockroaches, when pressed we'll live in almost any conditions.\n\n \n as long as we are included in the 95% of spiecies to become extinct it is good news.\n \n the human population was low in pre-industrial times and without mechanized means of transport, it will impossible for the human (disg)race to invade wild remote areas.\n without mass production and transportation of food, famine and disease will cut the numbers to the bone.\n \n we will live like cockroaches but it won't be billions of us just a couple of millions. This will leave the rest of the planet for the rest of the animals to leave in their natural way.", 
   {}, 
   365015, 
   null, 
   1250034780.0
  ], 
  [
   365125, 
   null, 
   "JPSartre12", 
   "Thing is, we know that heightened CO2 levels cause warming, it's a matter of basic physics.\n We know that CO2 levels have increased massively in recent years, now around 35% above the long term average.\n We know that the increase is a result of human activity.\n The only topic for discussion is how much of an increase will be caused in the future.\n\n \n The latest estimate that I heard was : If we institute all of the Cap and Trade provisions in Waxman-Markey, we'll decrease the mean temp by 0.05F by 2050 at a cost of $Trillions.", 
   {}, 
   364956, 
   null, 
   1250044740.0
  ], 
  [
   365128, 
   null, 
   "Archangel", 
   "The latest estimate that I heard was : If we institute all of the Cap and Trade provisions in Waxman-Markey, we'll decrease the mean temp by 0.05F by 2050 at a cost of $Trillions.\n\n \n This is true, I read it also.\n \n GREENIE WATCH: 11/01/2008 - 12/01/2008", 
   {}, 
   365125, 
   null, 
   1250045340.0
  ], 
  [
   365129, 
   null, 
   "Symbiote", 
   "I see only bluster and diversion from global cooling denialists. Not one has been able to come up with a list of ASTRONOMERS (scientists, rather than crackpots) who oppose global cooling hysteria, which really says it all.\n \n Thing is, we know that heightened CO2 levels cause warming, it's a matter of basic physics.\n We know that CO2 levels have increased massively in recent years, now around 35% above the long term average.\n We know that the increase is a result of human activity.\n We know that the Earth is cooling.\n We know that when the Earth cools, much of life will be wiped out.\n The only topic for discussion is how much of an increase in CO2 outpot will be needed in the future to save the world from catastrophic cooling.", 
   {}, 
   365128, 
   null, 
   1250046180.0
  ], 
  [
   365131, 
   null, 
   "Archangel", 
   "I see only bluster and diversion from global cooling denialists. Not one has been able to come up with a list of ASTRONOMERS (scientists, rather than crackpots) who oppose global cooling hysteria, which really says it all.\n\n \n That's because they have no substantial evidence to support their faith in man made global warming. Here are numerous short yet informative videos which make some very interesting points.\n \n YouTube - Another scientist comes out against global warming", 
   {}, 
   365129, 
   null, 
   1250048040.0
  ], 
  [
   365147, 
   null, 
   "Penfold", 
   "This scientist isn't called Steve, is he? emoticon_xgood", 
   {}, 
   365131, 
   null, 
   1250075160.0
  ], 
  [
   365150, 
   null, 
   "Winston Smith", 
   "Two scientists, Michael F. Wehner and David R. Easterling, show that such decade-long fluctuations are quite common in weather history. From day to day, season to season, and year to year, the weather shows great variability thanks to natural factors like capricious wind patterns and ocean currents.\n Changes in climate -- that is, changes in typical weather conditions over long periods of time -- are more difficult to assess.\n These short-term changes, say the scientists, must be differentiated from long-lasting, consequential trends in order to determine the role of human activities in shaping climate and to formulate industrial policy -- such as imposing a tax on carbon emissions.\n Wehner, who works at the Lawrence Berkeley National Laboratory in Berkeley, Calif., says that the long-term trend really is toward a warmer planet, but that a single year, 1998, has temporarily thrown off the overall upward march in temperature.\n In that year, an immense transfer of heat from the western to the eastern Pacific occurred: El Nino (Spanish for \"Christ Child\"), which often coincides with Christmas time. An El Nino event can have a major impact on rainfall patterns and temperatures over several continents.\n El Nino and other weather factors can cause a short reversal in the warming trend for a year. A 10-year reversal is less likely, but still possible. Just as in throwing a coin, seven heads in a row is unexpected, but it does happen now and then.\n In the journal Geophysical Review Letters, Wehner says that even a period of 20 years of modest cooling -- the equivalent of throwing 20 heads in a row -- would not reverse the scientific finding that long-term world temperature is trending upward; the trend is based on data now stretching back more than a century.\n Does this mean that after 10 years of relative cooling the next few years will be particularly warm in order to make up the cool years?\n No -- scientists can only say that the overall trend, over many years, is toward higher temperatures.\n No unusually warm day in January or unusually cool day in July can negate the overall trend. Neither can a cooling decade negate a century-long warming trend.\n In making policy decisions, argues Wehner and Easterling, don't let today's weather or even this year's weather influence your judgment. Concentrate on the long-term trend.\n This story was reported by Inside Science News Service.", 
   {}, 
   365147, 
   null, 
   1250076840.0
  ], 
  [
   365151, 
   null, 
   "Winston Smith", 
   "That's because they have no substantial evidence to support their faith in man made global warming. Here are numerous short yet informative videos which make some very interesting points.\n \n YouTube - Another scientist comes out against global warming\n\n \n is the Bible in youtube?\n \n what about another scientist comes out in favor of the flat earth ?", 
   {}, 
   365131, 
   null, 
   1250077020.0
  ], 
  [
   365152, 
   null, 
   "Winston Smith", 
   "I see only bluster and diversion from global cooling denialists. Not one has been able to come up with a list of ASTRONOMERS (scientists, rather than crackpots) who oppose global cooling hysteria, which really says it all.\n \n Thing is, we know that heightened CO2 levels cause warming, it's a matter of basic physics.\n We know that CO2 levels have increased massively in recent years, now around 35% above the long term average.\n We know that the increase is a result of human activity.\n We know that the Earth is cooling.\n We know that when the Earth cools, much of life will be wiped out.\n The only topic for discussion is how much of an increase in CO2 outpot will be needed in the future to save the world from catastrophic cooling.\n\n \n we know you are a troll.", 
   {}, 
   365129, 
   null, 
   1250077080.0
  ], 
  [
   365436, 
   null, 
   "JPSartre12", 
   "we know you are a troll.\n\n \n He's a troll because he's in OZ? Oh wait, aren't YOU in OZ, too? ;)", 
   {}, 
   365152, 
   null, 
   1250277000.0
  ], 
  [
   365459, 
   null, 
   "Archangel", 
   "That's because they have no substantial evidence to support their faith in man made global warming. Here are numerous short yet informative videos which make some very interesting points.\n \n YouTube - Another scientist comes out against global warming\n\n \n \nis the Bible in youtube?\n\n \n Try to pay attention smith, this discussion is about man made global warming, not God. The videos I linked to are about Global Warming, not religion or God. Stay focussed or go take a nap until you can concentrate and stay on topic, ok?", 
   {}, 
   365151, 
   null, 
   1250288760.0
  ], 
  [
   366074, 
   null, 
   "Winston Smith", 
   "I can't understand why a scientific issue such as global warming end up being treated as a religious issue. Of course religious fundamentalists such as archie deny it is happening because they think only God can change the climate.\n I suppose the rest just find it an uncomfortable truth and think that denying it, will make it go away.\n \n The Guardian had an interesting piece about it today:\n \n Climate change deniers claim they're censored. What hypocrites. Anthony Watts, sceptic and scourge of climate change science, has used copyright laws to censor an opponent\n \n One of the allegations made repeatedly by climate change deniers is that they are being censored. There's just one problem with this claim: they have yet to produce a single valid example. On the other hand, there are hundreds of examples of direct attempts to censor climate scientists.\n \n Most were the work of the Bush administration. In 2007 the Union of Concerned Scientists collated 435 instances of political interference in the work of climate researchers in the US.\n \n Scientists working for the government were pressured by officials to remove the words \"climate change\" and \"global warming\" from their publications; their reports were edited to change the meaning of their findings, others never saw the light of day. Scientists at the National Oceanographic and Atmospheric Administration and the US Fish and Wildlife Service were forbidden to speak to the media; James Hansen at Nasa was told by public relations officials that there would be \"dire consequences\" if he continued to call for big cuts in greenhouse gases.\n \n Philip Cooney, a senior White House aide who previously worked at the American Petroleum Institute, admitted to Congress that he had made hundreds of changes to government reports about climate change on behalf of the Bush government.\n \n Among other changes, he had struck out evidence that glaciers were retreating and inserted phrases suggesting that there was serious scientific doubt about global warming. In the UK, both Viscount Monckton and Martin Durkin, the director of Channel 4's The Great Global Warming Swindle, have threatened to sue people who have criticised the claims they've made about the science.\n \n Where, on the other hand, is a single verifiable instance of a climate denier being silenced by the authorities? They have yet to produce one. But it suits them to cry wolf. They love to imagine that they are important enough to censor. The claim chimes with their paranoid invocation of a great conspiracy - involving most of the world's scientists, most of the world's governments, most of the world's media and a few hundred million others - to suppress the truth about global warming.\n \n Now we have another marvellous instance of this hypocrisy. Anthony Watts spends much of his time maligning climate scientists and environmentalists on his blog Wattsupwiththat. But while he can dole it out, he can't take it. As Kevin Grandia of desmogblog shows, Watts has just used US copyright laws to take down a YouTube video which exposes his claims. Grandia has since reposted the video (see above) so you can see for yourself what all the fuss is about.\n \n It is not clear how his copyright was infringed by the video, but the US laws have been widely used by other people to block material that they don't like. Websites are obliged to remove any video which is subject to a takedown request, and they can put it back up only if they win an appeal. I charge Watts with the accusation he unjustly levels at other people: this looks to me like an attempt to silence his critics.\n \n Climate change deniers claim they're censored. What hypocrites | George Monbiot | Environment | guardian.co.uk", 
   {
    "post_info": {
     "post_title": "the sky is not falling"
    }, 
    "unicode_changes_made": true
   }, 
   365459, 
   null, 
   1250769840.0
  ], 
  [
   366075, 
   null, 
   "gansao", 
   "This was a comment posted on the Guardian site in responce to the article.\n I totally agree......\n \n \n \n The problem I see with all these climate debates is three fold.\n \n I'm a well educated, (reasonably) intelligent person. I have various bits of paper that tell me so. However, I'm not a scientist and I honestly don't feel able to discern XXXX from shinola as far as the raw data and evidence is concerned.\n \n Consequently I'm totally at the mercy of advocates / lobbyists / apologists and how they ALL chose to present their cases to me.\n \n It seems to me that there is mudslinging, malpractice, egotism and general 'smark-alecyness' on all sides of this. It all blurs into infantile shouting.\n \n None of you, who have any strong opinion on this want people like me to actually 'get' this for ourselves. You all simply want us to agree with whatever it is you're selling.\n \n You'd all rather I was jaded and apathetic than well-informed. I think that's very sad.", 
   {}, 
   366074, 
   null, 
   1250770440.0
  ], 
  [
   366078, 
   null, 
   "Winston Smith", 
   "You have taken a side. Your side is that nothing will convince you that global warming is hapenning. Your excuse is that you are not a scientist, therefore you can't decide, that is your way out.\n \n So if a doctor tells you, you are sick, you don't believe it. No, you have to become a doctor yourself to decide for yourself if you are sick or not.\n \n If a mechanic tells you your car needs a spare part, you also don't believe him, you have to become a mechanic yourself and you decide if he is right or not.\n \n Funny way to live.\n \n Is this the way an educated person functions?\n \n Why do you think governments have scientific advisors? \n \n Yes, you are right Obama must go back to Uni get a degree in environmental sciences, specifically in climate, do all the tests himself and then decide.\n But if he after doing all of the above decides that yes the climate is changing due to human intervention that would not be enough for you, because Obama probably has a hidden agenda, he is a Nazi or a Socialist blah blah\n \n I think nothing will convince you because you are too scared to face the truth. You can't face the truth. Period", 
   {}, 
   366075, 
   null, 
   1250777940.0
  ], 
  [
   366079, 
   null, 
   "Archangel", 
   "That's because they have no substantial evidence to support their faith in man made global warming. Here are numerous short yet informative videos which make some very interesting points.\n \n YouTube - Another scientist comes out against global warming\n\n \n \nis the Bible in youtube?\n \n what about another scientist comes out in favor of the flat earth ?\n\n \n \nTry to pay attention smith, this discussion is about man made global warming, not God. The videos I linked to are about Global Warming, not religion or God. Stay focussed or go take a nap until you can concentrate and stay on topic, ok?\n\n \n \nI can't understand why a scientific issue such as global warming end up being treated as a religious issue. Of course religious fundamentalists such as archie deny it is happening because they think only God can change the climate.\n I suppose the rest just find it an uncomfortable truth and think that denying it, will make it go away.\n\n \n What is the problem with your brain winny? Are you completely incapable of comprehending the english language? You are the only person here who is attempting to inject religion into this debate, and you continue doing it after I have repeatedly insisted it isn't a religious issue, and have only posted secular based evidence against it. So get a clue and respond to the actual evidence I posted above rather than attempting to redefine the debate in such a dishonest way.", 
   {}, 
   366074, 
   null, 
   1250778660.0
  ], 
  [
   366084, 
   null, 
   "gansao", 
   "You have taken a side. Your side is that nothing will convince you that global warming is hapenning. Your excuse is that you are not a scientist, therefore you can't decide, that is your way out.\n \n So if a doctor tells you, you are sick, you don't believe it. No, you have to become a doctor yourself to decide for yourself if you are sick or not.\n \n If a mechanic tells you your car needs a spare part, you also don't believe him, you have to become a mechanic yourself and you decide if he is right or not.\n \n Funny way to live.\n \n Is this the way an educated person functions?\n \n Why do you think governments have scientific advisors? \n \n Yes, you are right Obama must go back to Uni get a degree in environmental sciences, specifically in climate, do all the tests himself and then decide.\n But if he after doing all of the above decides that yes the climate is changing due to human intervention that would not be enough for you, because Obama probably has a hidden agenda, he is a Nazi or a Socialist blah blah\n \n I think nothing will convince you because you are too scared to face the truth. You can't face the truth. Period\n\n \n If you read my later posts you would know that I do accept global warming is a fact.\n I debated on the side of an extreme sceptic until someone posted a reply that was undeniable and written by themselves instead of copy and pasted.\n \n IT is XXXXXX like you that use name calling and insults to try to promote your arguments. Whereas the simple logic of Jo Bennett posted an impartial and intelligent argument.Something what you are incapable of doing, it seems.\n \n \n You didnt even address the my post , you just came straight in at me with your pathetic little rant.\n Did you get the chip on your shoulder from Australia or is it because you come from a insignificant third world backwater?", 
   {}, 
   366078, 
   null, 
   1250782800.0
  ], 
  [
   366101, 
   null, 
   "JPSartre12", 
   "There is no overriding government interest in climate change that I can see. It would be an awful lot easier in both Britain and the US to rely on coal. Britain has coal for 300 years or more (and considerable marginal oil shales in places like North Somerset), I could see an argument for a tory government 20 years ago not wanting coal from a political point of view, but any government today would rather do without the headache of nimbyism over wind turbines and nuclear power. I don't see an interest for the government in higher energy prices either. Either politicians have genuine concerns about climate change, or they are responding to public concerns about climate change for electoral expediency.\n \n\n \n I disagree. There is a huge windfall to be gained by our government (US) in the form of Cap and Trade. Selling CO2 credits is like selling the \"ether\" that fills the universe. It is a license to print money and our liberal government sees that with crystal clarity.\n \n Additionally, pumping 10's of billion of taxpayer dollars into renewable energy projects creates jobs and keeps politicians in office.\n \n So, it is imperative that Obama and crew sell the idea of AGW to the gullable public in order for him to finance his liberal programs.\n \n\n I agree that the short term impact of energy saving measures will be cancelled out by growth in China and India, but in 10 years time we need to be able to go to India and China and say, \"look, we know it wouldn't be fair to ask you to not develop in order to save the world from the mess we made, but we've cut our contribution as much as possible, here's the tech we've used now can you agree to use this in future and develop more sustainably?\" There's already signs of this happening with India asking for development money for a massive photo-voltaic solar plant.\n \n\n \n Are you serious? You expect China to curtail its growth in order to \"save the world\"? That's a lot to ask of a country that has almost zero regard for the environment now. \n \n\n As for fusion, I don't know enough detail the make a judgement of my own, but I understand that cold fusion is impossible as far as our current knowledge of physics goes, and hot fusion will need to be on a massive scale to produce rather than consume energy, because containing plasma is hugely energy consuming.\n\n \n I doubt that we'll see a fusion reactor in our lifetime. It would require huge advances in magnetic containment and solving a host of other extreme temperature issues.\n Breeder reactors seems to be the ticket. You make energy and fuel at the same time. It's a win-win proposition.", 
   {}, 
   364992, 
   null, 
   1250795160.0
  ], 
  [
   366129, 
   null, 
   "Jo Bennett", 
   "I disagree. There is a huge windfall to be gained by our government (US) in the form of Cap and Trade. Selling CO2 credits is like selling the \"ether\" that fills the universe. It is a license to print money and our liberal government sees that with crystal clarity. \n\n \n The government already has a licence to print money, it doesn't need another one. Besides, if the government raises revenue from CO2 credits instead of other taxation, all it does it alter the tax base. If the government needs more revenue then it's not a bad way of getting it. Governments don't raise taxes to spend on swimming pools and hookers (actually may be they do in the US, the way bills get through congress I wouldn't be surprised to find a \"Company for lonely Congressmen\" rider attached to the climate change bill) they spend it on infrastructure and helping people (and blowing things up of course).\n \n \n\n \n Additionally, pumping 10's of billion of taxpayer dollars into renewable energy projects creates jobs and keeps politicians in office.\n \n So, it is imperative that Obama and crew sell the idea of AGW to the gullable public in order for him to finance his liberal programs. \n\n \n Sorry, renewable energy is going to create jobs and so you think this is a bad thing?!\n \n \n\n Are you serious? You expect China to curtail its growth in order to \"save the world\"? That's a lot to ask of a country that has almost zero regard for the environment now. \n \n\n \n That's not what I said, I said we can't expect carbon cuts from China until we can offer them the technology to continue to grow and cut carbon at the same time. It's outrageous for us to expect them to keep their people in poverty before we put a brake on our wasteful lifestyles.", 
   {}, 
   366101, 
   null, 
   1250807460.0
  ], 
  [
   366134, 
   null, 
   "JPSartre12", 
   "The government already has a licence to print money, it doesn't need another one. Besides, if the government raises revenue from CO2 credits instead of other taxation, all it does it alter the tax base. If the government needs more revenue then it's not a bad way of getting it. Governments don't raise taxes to spend on swimming pools and hookers (actually may be they do in the US, the way bills get through congress I wouldn't be surprised to find a \"Company for lonely Congressmen\" rider attached to the climate change bill) they spend it on infrastructure and helping people (and blowing things up of course).\n\n \n Most government-run spending programs are inefficient - downright ridiculous.\n If you think solar and windpower are viable alternatives to our current/future energy needs, you need to lay off the crack pipe.\n The shear acreage needed for wind and solar farms will requires many states to be covered wall-to-wall with such monstrosities. And never mind that you would have to build in a large overcapacity and include energy storage farms to handle the inherent randomness of wind/sunshine. \n \n\n Sorry, renewable energy is going to create jobs and so you think this is a bad thing?!\n \n\n I think any artificially created make-work job is a bad thing. If it makes fiscal sense, the private industry would fund it itself.\n \n\n That's not what I said, I said we can't expect carbon cuts from China until we can offer them the technology to continue to grow and cut carbon at the same time. It's outrageous for us to expect them to keep their people in poverty before we put a brake on our wasteful lifestyles.\n\n \n China has no interest in becoming PC. They have sewn up Russian oil with long-term deals and made several other long-term commitments to fossil fuels.\n And, IMO, they aren't as gullable as The West is.", 
   {}, 
   366129, 
   null, 
   1250809140.0
  ], 
  [
   366170, 
   null, 
   "Jo Bennett", 
   "You're vastly exaggerating the space required for solar. Wind is part of the solution, but so are wave, tidal, biomass and others. Solar hot water heating is very efficient and cost effective, for example, and would drastically cut gas and electricity use. Using reflectors to focus sunlight onto water to drive turbines and generate electricity also has a lot of promise. The other key thing is that energy consumption needs to be cut, insulation, heat exchange systems, better build quality will all make a big dent in energy consumption, before we get on to actual lifestyle changes, like fuel efficient vehicles and public transport.", 
   {}, 
   366134, 
   null, 
   1250846640.0
  ], 
  [
   366181, 
   null, 
   "Archangel", 
   "I think any artificially created make-work job is a bad thing. If it makes fiscal sense, the private industry would fund it itself.\n \n\n \n And wind technology is a perfect example of this waste of resources. It has been shown that by the time the capital investment for building a new wind farm is recuperated through energy production, the cost of blades and the maintenance required to keep the wind mills running has eaten up any profit they may have afforded their investors. Add to this the impact on birds and wildlife since these windfarms can occupy thousands of acres of land where as one clean coal fired power plant can generate 100 times the energy, take up only 2-4 acres of land and start to return a healthy profit to its investors almost immediately. No wind farms anywhere exist without government subsidy because no private company will make the commitment to such an unprofitable money pit. Here's what I mean. \n \n A hefty cost\n Wind farms are hardly cheap.\n \n One large wind farm easily can cost as much as a coal-fired plant, at $400 million to $500 million. Each turbine is $2 million to $4 million. Most are made in Europe, though production is shifting to the United States.\n Unlike a coal plant that can be counted on to run at 80 percent of capacity or higher, most wind farms run at full power only 20 percent to 30 percent of the time, when the wind blows briskly.\n In a modern power grid, where brownouts or dangerous power surges can occur if the flow of electricity doesn't precisely meet ever-changing demands, wind turbines aren't easy to integrate and require conventional-fuel backups, typically natural gas plants.\n Boone, the Maryland critic, compared utility use of wind energy to an airline being required to fly some of its passengers on gliders.\n The Midwest Independent System Transmission Operator, which runs the power grid in the Midwest, handles the growing number of wind farms being hooked into its system with a kind of tail-wagging-the-dog approach.\n The power that MISO's wind farms generate is the first power assigned and used by its utility members, said Eric Laverty, director of transmission access planning for MISO.\n MISO then turns to its conventional coal and gas plants to fill its remaining power needs with its boilers, which can be scaled up or down as demand warrants.\n A German meteorological company hired by MISO forecasts when it can count on getting power from its wind turbines.\n Dennis Stillings, who lives with his wife, Cathryn, in North Dakota within a third of a mile of two giant wind turbines, can give Indiana residents an idea of the downside some feel living near a wind farm.\n \"It makes sounds almost like a jet plane taking off and just hanging in the air. A whoosh, a whup. It's just about at one-second intervals.\"\n Blowback: Indiana's emerging wind farms whip up controversy | IndyStar.com | The Indianapolis Star", 
   {}, 
   366170, 
   null, 
   1250863380.0
  ], 
  [
   366182, 
   null, 
   "Jo Bennett", 
   "Clean coal fired power stations don't even exist.", 
   {}, 
   366181, 
   null, 
   1250863920.0
  ], 
  [
   366183, 
   null, 
   "JPSartre12", 
   "You're vastly exaggerating the space required for solar. Wind is part of the solution, but so are wave, tidal, biomass and others. Solar hot water heating is very efficient and cost effective, for example, and would drastically cut gas and electricity use. Using reflectors to focus sunlight onto water to drive turbines and generate electricity also has a lot of promise. The other key thing is that energy consumption needs to be cut, insulation, heat exchange systems, better build quality will all make a big dent in energy consumption, before we get on to actual lifestyle changes, like fuel efficient vehicles and public transport.\n\n \n Solar heating of water is already in widespread use in those areas that actually get regular sunlight. I saw many examples of it while in Hawaii, for example. For the rest of us though, especially those of you in foggy England, solar isn't a viable answer. \n Additionally, there needs to be a back-up system for when the sun isn't shining...like at night, which occurs on a regular basis. ;)\n \n And as for the land requirements needed for solar farms, I'll dig up the number of thousands of square miles needed based on a study that I read when I get a chance to.\n \n On edit: \n The largest solar farm will be 80MW peak and occupy 640 acres - 1 square mile.\n The US electricity consumption for 2005 was 3,816,000,000 MWh.\n Assuming 365 days of sunlight at peak output for 12 hours/day, you'd still need 11890 square miles of solar panels to meet US' 2005 demand. Now, if we convert to electic automobiles, we'll need to start building our houses on pontoons in the ocean because there won't be enough land left for houses. ;)\n \n Check my math though, I'm doing this while working.", 
   {}, 
   366170, 
   null, 
   1250864640.0
  ], 
  [
   366184, 
   null, 
   "Archangel", 
   "Clean coal fired power stations don't even exist.\n\n \n Really? Clean-Coal Debut in Germany - ABC News", 
   {}, 
   366182, 
   null, 
   1250865840.0
  ], 
  [
   366186, 
   null, 
   "Penfold", 
   "Cleaner yes, clean no. There is no such thing as a clean coal fired power station.", 
   {}, 
   366184, 
   null, 
   1250867280.0
  ], 
  [
   366198, 
   null, 
   "Jo Bennett", 
   "Solar heating of water is already in widespread use in those areas that actually get regular sunlight. I saw many examples of it while in Hawaii, for example. For the rest of us though, especially those of you in foggy England, solar isn't a viable answer. \n Additionally, there needs to be a back-up system for when the sun isn't shining...like at night, which occurs on a regular basis. ;)\n \n And as for the land requirements needed for solar farms, I'll dig up the number of thousands of square miles needed based on a study that I read when I get a chance to.\n \n On edit: \n The largest solar farm will be 80MW peak and occupy 640 acres - 1 square mile.\n The US electricity consumption for 2005 was 3,816,000,000 MWh.\n Assuming 365 days of sunlight at peak output for 12 hours/day, you'd still need 11890 square miles of solar panels to meet US' 2005 demand. Now, if we convert to electic automobiles, we'll need to start building our houses on pontoons in the ocean because there won't be enough land left for houses. ;)\n \n Check my math though, I'm doing this while working.\n\n \n Assuming you're right, that's an area around 110 miles by 110 miles, to put that in perspective, the total area of the US is around 3.8 million square miles, so you'd have to cover maybe, being generous and say we need 3 times as much area for access roads, power lines, electric cars etc, 1% of the total land mass of the US. And that assumes you want to get all power from solar, which is by no means sensible.\n \n As for solar only being effective in hotter climbs, I've just come back from holiday in Orkney, staying in a cottage where the main water heating was by solar energy, and perfectly adequate (ok it's summer but still, the wind gets up quite a lot in winter so it balances out).", 
   {}, 
   366183, 
   null, 
   1250878320.0
  ], 
  [
   366202, 
   null, 
   "ServantOfChrist", 
   "You're vastly exaggerating the space required for solar. Wind is part of the solution, but so are wave, tidal, biomass and others. Solar hot water heating is very efficient and cost effective, for example, and would drastically cut gas and electricity use. Using reflectors to focus sunlight onto water to drive turbines and generate electricity also has a lot of promise. The other key thing is that energy consumption needs to be cut, insulation, heat exchange systems, better build quality will all make a big dent in energy consumption, before we get on to actual lifestyle changes, like fuel efficient vehicles and public transport.\n\n \n No, he really isn't. Solar and wind require monstrous amounts of land to be feasible.\n \n A 1,000 megawatt facility would require over enormous amounts of land for solar, and even greater for wind.\n \n The NERC is projecting that by 2017, energy consumption in merely the US will be 925GW for summer and 756 GW for winter.\n \n That's \"G\" as in GIGA.", 
   {}, 
   366170, 
   null, 
   1250881320.0
  ], 
  [
   366207, 
   null, 
   "Archangel", 
   "No, he really isn't. Solar and wind require monstrous amounts of land to be feasible.\n \n A 1,000 megawatt facility would require over enormous amounts of land for solar, and even greater for wind.\n \n The NERC is projecting that by 2017, energy consumption in merely the US will be 925GW for summer and 756 GW for winter.\n \n That's \"G\" as in GIGA.\n\n \n You're absolutely right regarding the land these technologies require in order to become feasible. And the loss of that land for farming, wildlife habitats and development will cost society more than the energy created by the technology.", 
   {}, 
   366202, 
   null, 
   1250884080.0
  ], 
  [
   366209, 
   null, 
   "Penfold", 
   "You're absolutely right regarding the land these technologies require in order to become feasible. And the loss of that land for farming, wildlife habitats and development will cost society more than the energy created by the technology.\n\n \n Wrong.\n \n Solar thermal power plants use less land than hydroelectric dams or coal plants for a similar output. While all power plants require land and have an environmental impact, the best locations for solar power plants are deserts.", 
   {}, 
   366207, 
   null, 
   1250885400.0
  ], 
  [
   366210, 
   null, 
   "Penfold", 
   "No, he really isn't. Solar and wind require monstrous amounts of land to be feasible.\n \n A 1,000 megawatt facility would require over enormous amounts of land for solar, and even greater for wind.\n \n The NERC is projecting that by 2017, energy consumption in merely the US will be 925GW for summer and 756 GW for winter.\n \n That's \"G\" as in GIGA.\n\n \n 10,000 acres? In a desert? No biggie.\n \n AV Solar Ranch One is a proposed 230 MW power station owned by NextLight Renewable Power. The photovoltaic array will occupy about 2,100 acres (850 ha) in the Antelope Valley. They will sell the electricity for 13c per Kwh.\n (Photovoltaic arrays are not the most efficient converters of energy available.)", 
   {}, 
   366202, 
   null, 
   1250885940.0
  ], 
  [
   366219, 
   null, 
   "Archangel", 
   "Wrong.\n \n Solar thermal power plants use less land than hydroelectric dams or coal plants for a similar output. While all power plants require land and have an environmental impact, the best locations for solar power plants are deserts.\n\n \n \n10,000 acres? In a desert? No biggie.\n \n AV Solar Ranch One is a proposed 230 MW power station owned by NextLight Renewable Power. The photovoltaic array will occupy about 2,100 acres (850 ha) in the Antelope Valley. They will sell the electricity for 13c per Kwh.\n (Photovoltaic arrays are not the most efficient converters of energy available.)\n\n \n I would like some evidence these technologies have actually been installed anywhere on earth yet in a sand dune type DESERT. I would be very concerned about the damage sandstorms could and would do to the mechanisms and moving parts in both solar screens which turn to angle toward the sun and wind turbines which are finely balanced blades. I can envision the havoc caused by the fine sand from every sand storm which came by. The maintenance in such an environment would be cost prohibitive. Antelope Valley is not such a desert atmosphere and could be utilized for farming as the poppy fields show. California State Parks\n \n And you are dead wrong in saying that Coal fired plants use more land than wind or solar farms. You are off by a factor of around 10,000%.", 
   {}, 
   366210, 
   null, 
   1250893680.0
  ], 
  [
   366220, 
   null, 
   "Penfold", 
   "I would like some evidence these technologies have actually been installed anywhere on earth yet in a sand dune type DESERT. I would be very concerned about the damage sandstorms could and would do to the mechanisms and moving parts in both solar screens which turn to angle toward the sun and wind turbines which are finely balanced blades. I can envision the havoc caused by the fine sand from every sand storm which came by. The maintenance in such an environment would be cost prohibitive. Antelope Valley is not such a desert atmosphere and could be utilized for farming as the poppy fields show. California State Parks\n \n And you are dead wrong in saying that Coal fired plants use more land than wind or solar farms. You are off by a factor of around 10,000%.\n\n \n Note PROPOSED solar farm it will be built next year.\n There are several already functioning in a little place called the MOJAVE desert. Nellis AFB has one.\n Where does the coal for a coal fired plant come from? Vast opencast mines. DOH!", 
   {}, 
   366219, 
   null, 
   1250894880.0
  ], 
  [
   378695, 
   null, 
   "Winston Smith", 
   "Everyone knows that the ice sheet on Greenland is melting. But new research shows it is disappearing much faster than previously thought. The findings could mean that ocean levels are also rising more quickly.\n The dimensions of this frosty giant go way beyond human imagination. With a surface area spanning some 1.7 million square kilometers (656,000 square miles), a view of Greenland's ice above the Sermeq-Kujalleq glacier near Ilulisat makes it seem endless. The idea that this sheet of ice, which is up to three kilometers thick in parts, is melting seems absurd in the extreme.\n Were Greenland to lose all of its ice, sea levels would rise some seven meters higher than today's levels. Such a scenario will not become reality overnight -- indeed the process could last hundreds of years. But new results from a team of Dutch researchers suggest that conservative estimates as to the speed with which the ice is melting should be shelved. According to the study, the rate at which Greenland's ice is melting has accelerated substantially in recent years.\n There are, strictly speaking, two parallel processes responsible for the ice's retreat. On the one hand, rising temperatures melt the ice on land while warmer ocean currents eat away at the glaciers that jut out into the ocean. A research team led by Michiel van den Broeke from the University of Utrecht reported in the most recent edition of the journal Science that the two processes are contributing equally to the disappearance of the ice sheet.\n Losing Weight \n According to the new report, Greenland lost an estimated 1,500 gigatons (one gigaton is equal to 1 billion tons) of ice from the year 2000 to 2008. \"That is at the upper end of recent estimates of Greenland mass loss using various other methods,\" van den Broeke told SPIEGEL ONLINE. Between 2006 and 2008, the loss in weight totaled 273 gigatons per year, he said. \n The scientists are convinced their results are accurate because they arrived at their numbers using two fundamentally different methods -- both of which returned the same conclusion. On the one hand, they monitored the movement of the ice which they fed into a regional computer model. For a second data source, they used the Grace observation satellites, which measure the Earth's gravitational field. \n In the period between 2000 and 2008, the dwindling glaciers have been responsible for the sea level rising by an average of about half a millimeter per year. However, during the last three years of observation, the value rose to 0.75 millimeters per year. According to the researchers, these results could indicate that the sheet of ice is melting at an accelerated rate.\n \n A Warming Arctic: Greenland's Ice Sheet Melting Faster than Ever - SPIEGEL ONLINE - News - International", 
   {
    "post_info": {
     "post_title": "the sky is not falling"
    }
   }, 
   366220, 
   null, 
   1258461420.0
  ], 
  [
   379946, 
   null, 
   "Steeeeve", 
   "I don't know much about the global warming debate and frankly I don't care since I'm an accounting guy...you science people figure it out but does anyone know about this:\n \n Climategate: the final nail in the coffin of &#8216;Anthropogenic Global Warming&#8217;? &#8211; Telegraph Blogs\n \n \nIf you own any shares in alternative energy companies I should start dumping them NOW. The conspiracy behind the Anthropogenic Global Warming myth (aka AGW; aka ManBearPig) has been suddenly, brutally and quite deliciously exposed after a hacker broke into the computers at the University of East Anglia's Climate Research Unit (aka Hadley CRU) and released 61 megabites of confidential files onto the internet. (Hat tip: Watts Up With That)\n \n When you read some of those files - including 1079 emails and 72 documents - you realise just why the boffins at Hadley CRU might have preferred to keep them confidential. As Andrew Bolt puts it, this scandal could well be \"the greatest in modern science\". These alleged emails - supposedly exchanged by some of the most prominent scientists pushing AGW theory - suggest:\n Conspiracy, collusion in exaggerating warming data, possibly illegal destruction of embarrassing information, organised resistance to disclosure, manipulation of data, private admissions of flaws in their public claims and much more.\n\n \n It goes on.", 
   {
    "unicode_changes_made": true
   }, 
   378695, 
   null, 
   1259080740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Global Cooling: The 21st Century's Greatest Challenge", 
  "url": "http://www.4forums.com/political/environmental-debates/11169-global-cooling-21st-centurys-greatest-challenge.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 11169, 
  "discussion_files": [
   [
    "15990.html", 
    "http://www.4forums.com/political/environmental-debates/11169-global-cooling-21st-centurys-greatest-challenge-print.html"
   ], 
   [
    "15991.html", 
    "http://www.4forums.com/political/environmental-debates/11169-global-cooling-21st-centurys-greatest-challenge-7-print.html"
   ], 
   [
    "15992.html", 
    "http://www.4forums.com/political/environmental-debates/11169-global-cooling-21st-centurys-greatest-challenge-5-print.html"
   ], 
   [
    "15993.html", 
    "http://www.4forums.com/political/environmental-debates/11169-global-cooling-21st-centurys-greatest-challenge-4-print.html"
   ], 
   [
    "15994.html", 
    "http://www.4forums.com/political/environmental-debates/11169-global-cooling-21st-centurys-greatest-challenge-6-print.html"
   ], 
   [
    "15995.html", 
    "http://www.4forums.com/political/environmental-debates/11169-global-cooling-21st-centurys-greatest-challenge-3-print.html"
   ], 
   [
    "15996.html", 
    "http://www.4forums.com/political/environmental-debates/11169-global-cooling-21st-centurys-greatest-challenge-2-print.html"
   ]
  ], 
  "identifier": 11169
 }
]