[
 [
  [
   309369, 
   null, 
   "Penfold", 
   "\" ... \"But clearly, the prime minister has laid down some ground rules which any functioning democratic state would insist upon, having to do with, you know, arms belonging to the state, not to -- not in private hands,\" she said. ... \"\n \n http://news.yahoo.com/s/mcclatchy/20080420/wl_mcclatchy/2915454", 
   {
    "post_info": {
     "post_title": "Condy backs state, not private gun ownership."
    }
   }, 
   null, 
   null, 
   1208819520.0
  ], 
  [
   309384, 
   null, 
   "Ghost Rider", 
   "I don't see how this makes her as an anti-gun candidate. She's the one that resisted America signing onto the global arms trade treaty.", 
   {}, 
   309369, 
   null, 
   1208830260.0
  ], 
  [
   309385, 
   null, 
   "daewoo", 
   "I don't see how this makes her as an anti-gun candidate. She's the one that resisted America signing onto the global arms trade treaty.\n\n \n So, you don't see how stating that in a functioning democratic society guns belong only in the hands of the state is not anti gun?? Maybe you could give us an example of a statement that is more anti gun that that because I am having trouble imagining one.", 
   {}, 
   309384, 
   null, 
   1208832120.0
  ], 
  [
   309387, 
   null, 
   "Ghost Rider", 
   "She was referring to a war-torn country filled with suicide bombers. I doubt that she was saying that America should be a place without private gun ownership. If it were the case then why did she resist the global arms trade treaty?", 
   {}, 
   309385, 
   null, 
   1208832720.0
  ], 
  [
   309392, 
   null, 
   "daewoo", 
   "She was referring to a war-torn country filled with suicide bombers. I doubt that she was saying that America should be a place without private gun ownership. If it were the case then why did she resist the global arms trade treaty?\n\n \n I guess the fact she said \"any functioning democratic state\" led me to believe that she meant any functioning democratic state.\n \n She opposed the global arms treaty because contrary to all the hype around it, the treaty was about trafficking, not so much ownership by private citizens. It would not have had any impact on ownership of private arms in the US or importation of arms to the US. It would, however, have placed limits on our arms manufacturers and we all know that defense contractors are a powerful group.", 
   {}, 
   309387, 
   null, 
   1208838180.0
  ], 
  [
   309436, 
   null, 
   "Ghost Rider", 
   "Come back when you can find a link where she personally said she believed that the DC gun ban should be left in place. Then you'll have something more concrete.", 
   {}, 
   309369, 
   null, 
   1208886000.0
  ], 
  [
   309479, 
   null, 
   "Penfold", 
   "More concrete than the thought processes which dismiss out of hand the flat statement of the US Secretary of State opining that no functioning democracy should allow private ownership of guns, but allow them only to be lawfully held by the state? Sleep well.", 
   {}, 
   309436, 
   null, 
   1208902380.0
  ], 
  [
   309497, 
   null, 
   "daewoo", 
   "More concrete than the thought processes which dismiss out of hand the flat statement of the US Secretary of State opining that no functioning democracy should allow private ownership of guns, but allow them only to be lawfully held by the state? Sleep well.\n\n \n No kidding. What could POSSIBLY be more concrete? As far as I can tell, she has never publicly made a statement specifically about the DC gun ban but since, as you pointed out, she DID say that no functioning democracy should allow private ownership of guns, I have trouble believing that she thinks the private citizens of DC should be allowed to own guns, UNLESS what she is saying is that since we own guns, we should move toward a monarchy or perhapse some kind of dictatorship. She did not, as far as I know, voice her opinion regarding private gun ownership in a totalitarian system.", 
   {}, 
   309479, 
   null, 
   1208923440.0
  ], 
  [
   310343, 
   null, 
   "Penfold", 
   "I have seen the argument that as a republic, the USA is not a democracy, and the existence of the electoral college would seem to support that view. Perhaps that was what she meant, or it could be that she was signalling that you are ushering in an era of Diebold-managed autocracy. ;)", 
   {}, 
   309497, 
   null, 
   1209825900.0
  ], 
  [
   310356, 
   null, 
   "Rick_OShea", 
   "I guess the fact she said \"any functioning democratic state\" led me to believe that she meant any functioning democratic state.\n\n \n A functioning democratic state could, in principle, have strict weapons control for private citizens. The Iraqi form of democratic government, while cribbed together using ours as a template does not share the same philosophical underpinnings. I do not find anything disconcerting about her remarks.", 
   {}, 
   309392, 
   null, 
   1209861300.0
  ], 
  [
   310372, 
   null, 
   "chester", 
   "A functioning democratic state could, in principle, have strict weapons control for private citizens. The Iraqi form of democratic government, while cribbed together using ours as a template does not share the same philosophical underpinnings. I do not find anything disconcerting about her remarks.\n\n \n Rick,\n \n Canada provides the paradigm of this.\n \n There are fewer handgun murders per year in Toronto per year than there are in Las Vegas per month.\n \n I wonder what they know that we do not.emoticon_smile", 
   {}, 
   310356, 
   null, 
   1209919680.0
  ], 
  [
   310376, 
   null, 
   "Zardoz", 
   "\n I wonder what they know that we do not.emoticon_smile\n\n \n That there's a lot less money to made through criminal actions in Toronto that in Vegas, the city that never sleeps?\n \n \n Beyond that, as to the gist of Condi's statements.\n On the face, they are anti-gun and since she hasn't (to my knowledge) clarified them nor made any comments to contradict them, I would take it at face value.\n \n Beyond that, on speculation as to what she was talking about, I'd sugest she was speaking about private armies. While called a militia in the media, in effect, they are Cleric Al-Sadr's private army.\n \n Is it legal for anyone in the US to have a private army?\n \n \n \n \n On a personal note, I'd side with Sadr in principle. The Iraqi gov't isn't fully formed and stable. If you want some key position of power and a better chance to enact your beliefs, one of the best ways of doing that would be to take up arms and use that as a means to carve out a piece of the pie for yourself and your agenda.\n Seems to work in most cases where it's done.", 
   {}, 
   310372, 
   null, 
   1209923820.0
  ], 
  [
   310388, 
   null, 
   "Rick_OShea", 
   "Rick,\n \n Canada provides the paradigm of this.\n\n \n Yes, it certainly does.\n \n \nI wonder what they know that we do not.emoticon_smile\n\n \n Well, the government of Canada knows that theirs is not a government founded on the existence and protection of the citizen's inherent and inalienable rights. In the USA the citizen's right to arms does not emanate from any legislative act of man . . . That means it is not so much protected by the 2nd Amendment as it is by the absolute silence of the US Constitution on the subject of the private arms of the citizen. The US government is one of strictly defined and thus limited powers, succinctly summed up in the maxim; all not surrendered is retained. \n \n The 2nd Amendment has but one simple purpose and action; to redundantly prohibit the exercise of powers that the federal government does not possess.\n \n From where does the \"right\" to keep and bear arms emanate from in the Canadian model?", 
   {}, 
   310372, 
   null, 
   1209937680.0
  ], 
  [
   310413, 
   null, 
   "chester", 
   "Rick,\n \n The 2nd Amendment has but one simple purpose and action; to redundantly prohibit the exercise of powers that the federal government does not possess.\n \n Try as you might to goad me into it, I'm simply not going to debate 2A with you.\n \n All that I point out is that Canada, which has very strict gun control laws, also has a much lower murder rate than does the USA.\n \n While correlation does not necessarily indicate causation, I believe there is a tight linkage.:)", 
   {}, 
   310388, 
   null, 
   1209953640.0
  ], 
  [
   310424, 
   null, 
   "Rick_OShea", 
   "Rick,\n \n Try as you might to goad me into it, I'm simply not going to debate 2A with you.\n\n \n Whatever.\n \n Just understand that the level of restriction you propose will never happen here because the citizenry have the right to be armed. The criminal use of firearms will need to be addressed by focusing on those who perpetrate the offenses, not by blanket restrictions on the nation.\n \n \nAll that I point out is that Canada, which has very strict gun control laws, also has a much lower murder rate than does the USA.\n\n \n An indisputable fact as is the fact that all crime is lower in Canada. In America we have a core population of criminals who repeatedly are captured but then are returned into society. In the USA, 36% of those convicted of murder had an active criminal justice status when arrested. Fifteen percent of murderers were on probation, 13% were on pretrial release, and 8% were on parole. 58% of those convicted of murder had at least one prior felony arrest, 21% had 5 or more prior felony arrest charges, and 10% had 10 or more. \n \n Instead of the USA following Canada, Canada is following the USA. If C-26 is enacted Canada will also see its prison population swell with those serving mandatory sentences for drug crimes and see violent offenders being forced out of prison to make room. We have had over 20 years of such mandatory minimum nonsense and it has done noting but increase crime.\n \n \nWhile correlation does not necessarily indicate causation, I believe there is a tight linkage.:)\n\n \n I believe there is a tight linkage between proven violent criminals not being in jail and the level of violent crime, especially murder, in the USA. If just having strict gun control laws is the answer to reducing the level of criminal homicide please explain why (and more importantly how) Jamaica is such a hellhole.\n \n An interesting read.\n \"In response to a sharply rising crime rate in Jamaica in the early 1970s, the government imposed complete gun prohibition. In fact, possession of a bullet meant a mandatory life sentence in prison. There was a special gun court where people would be tried in secret for gun possession offenses. . . . They had gun sweeps, drug sweeps, militarized law enforcement, the government breaking into people's houses, with no probable cause at all, to look for illegal weapons and drugs. Every kind of oppressive measure you could want, censorship of violent television and movies, everything you could want in terms of \"let's get really serious and crack down and get rid of all these silly constitutional liberties that are standing in the way of rough and tough law enforcement,\" they did. What happened was the crime rate and the homicide rate dropped substantially for the first six months. They then started to rise again, got back to their old levels, and within a few years were far ahead of their old levels, and a few years later were at double and triple the levels which had inspired this kind of crackdown in the first place. One of the kinds of violence that increased in Jamaica was homicide by police officers. Jamaicans were getting killed by their police at a rate higher than the general American homicide rate of anybody getting killed by anybody. \"\n And there is the siren song of strict gun control laws. When they don't work the only place left to go is draconian enforcement on the entire population. To expect strict gun control laws to have any effect, in and of themselves, in a nation with 300,000,000 guns in private hands is ridiculous. Criminals will be the very last people with guns and the entire nation will suffer offenses far worse than criminal activity. When a nations citizenry fear the police more than criminals the foundation was laid in laws like Jamaica's Gun Court Act of 1974.", 
   {}, 
   310413, 
   null, 
   1209979260.0
  ], 
  [
   310432, 
   null, 
   "chester", 
   "From Rick O's link - :long but worth reading:\n \n The first of these two nations with strict laws is Japan. In Japan, rifles and handguns are entirely outlawed and the possession of shotguns and air guns is only allowed under a very, very severe licensing system that imposes an enormous bureaucratic burden on the potential licensee. Japan is an extremely safe society. You can walk down the street at 4:00 A.M. in the roughest part of Tokyo and feel no concern at all for your personal safety. I think the Japanese gun laws have quite a lot to do with that, indirectly, because guns are unavailable. Japan has a very strong organized crime group known as the Yakuza. Illegal drugs, illegal guns, illegal anything else you want, Filipino sex slaves literally, all those kinds of things are available through the Yakuza. But there is very little demand even within the criminal community for guns. The cultural lesson that is taught in Japan by the very strict gun laws reinforces a message that exists throughout Japanese society--the individual is subordinate to the larger organization, whether it's the child and the family, the student and the school, the worker and the corporation, or the individual and society. People are expected to subordinate their individual desires to the greater collective good. Gun control, even though it doesn't directly work at disarming criminals who want to get guns, plays an important role in reinforcing this cultural message. \n \n Quite different from the cowboy culture prevalent in the USA.\n \n The other nation that is equally as safe as Japan is Switzerland. Switzerland also has very strict gun controls, but of a different kind. In Switzerland, every male, starting at about age twenty and continuing for the next thirty-five years of his life, has to serve several weeks a year in the militia.\n \n Why aren't our gun advocates doing the same - lining up for militia training?", 
   {}, 
   310424, 
   null, 
   1210003440.0
  ], 
  [
   310465, 
   null, 
   "Rick_OShea", 
   "Gun control, even though it doesn't directly work at disarming criminals who want to get guns, plays an important role in reinforcing this cultural message. \n\n \n So, Japan's low incidence of criminal gun homicide isn't attributable to gun control; their strict gun control just \"fits\" into the long-standing culture of dominant government and subservient citizenry that, simply by its fundamental and universal nature, limits the offensive use of firearms even among powerful criminal syndicates who find Japan's strict gun control no impediment to acquiring firearms. \n \n OKaaaaaay . . . .And that relates to the USA how?\n \n [\nQuite different from the cowboy culture prevalent in the USA.\n\n \n Well, I would have to say the vast majority of the USA's present crop of homicidal criminals are bigger fans of Snoop Dogg and 50Cent than Billy the Kid or Jesse James.\n \n \nWhy aren't our gun advocates doing the same - lining up for militia training?\n\n \n We used to have a system nearly identical to the Swiss. That system was destroyed by the federal government over the years with the final nail being driven with the Dick Act in 1903 federalizing the state guard units. The Dick Act nullified the Militia Act of 1792 and as amended in 1795 which were in effect until then.\n \n The Militia Act of 1792 directed every male citizen to sign the roll of his local militia company and furnish himself with an appropriate firearm and accessories. Of course, even then the states never fulfilled their duties under these Militia Acts and the militia system withered. That the states and federal government are derelict in their duties to administer and direct a system for the training of the militia does not extinguish the individual citizen's right to keep and bear arms. The right does not exist to maintain an organized militia, an organized militia is possible because the citizen's pre-existing right to arms is forever secured.\n \n I do note with interest that you did not address the Jamaica example at all . . . \n \n As a sidenote I vacationed on a Caribbean Island where US residents were a very small minority. Every day at 1pm there was an air rifle shoot just off the beach. Expensive and extremely accurate German target rifles were supplied. It is quite intimidating to have a six foot gorgeous blond topless Swiss woman absolutely kick your and everyone's butt. Every day, five shot 1cm group offhand at 10 meters. emoticon_love emoticon_love emoticon_love (She was a Biathlon competitor though)", 
   {}, 
   310432, 
   null, 
   1210039980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Condy backs state, not private gun ownership.", 
  "url": "http://www.4forums.com/political/gun-control-debates/11167-condy-backs-state-not-private-gun-ownership.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11167, 
  "discussion_files": [
   [
    "10972.html", 
    "http://www.4forums.com/political/gun-control-debates/11167-condy-backs-state-not-private-gun-ownership-print.html"
   ], 
   [
    "10973.html", 
    "http://www.4forums.com/political/gun-control-debates/11167-condy-backs-state-not-private-gun-ownership-2-print.html"
   ]
  ], 
  "identifier": 11167
 }
]