[
 [
  [
   310357, 
   null, 
   "jim's trucking", 
   "What is the object depicted?\n \n http://i3.photobucket.com/albums/y86/jimstrucking/11oclockfromthemoon.jpg\n \n Bonus question:\n \n How far away is it from then camera lens that was used to make the picture?", 
   {
    "post_info": {
     "post_title": "A simple question for Peeling..."
    }
   }, 
   null, 
   null, 
   1209865620.0
  ], 
  [
   310358, 
   null, 
   "jim's trucking", 
   "Here is the same object in a viewed in a different frame, shown at about 11:30 from the moon.\n \n For a real bonus...tell me what time this photo was taken.\n \n \n http://i3.photobucket.com/albums/y86/jimstrucking/alstom059.jpg", 
   {
    "post_info": {
     "post_title": "A hint..."
    }
   }, 
   310357, 
   null, 
   1209866460.0
  ], 
  [
   310578, 
   null, 
   "Peeling", 
   "Tricky. Pretty much anything could be made to look like that :) The low quality of the images nudges me toward neptune or uranus but I haven't managed to simulate a recent conjunction with anything in that precise configuration. Obviously the cresent in the second image can't be either of those planets since we can never see them as anything less than oblate - which makes no sense since the planets we can see as a crescent ought to be much brighter, relatively speaking. Venus and the moon would be the right relative brightness, but I can't for the life of me explain why it would be such a terrible picture of them. So far, so stumped :)", 
   {}, 
   310358, 
   null, 
   1210185360.0
  ], 
  [
   310590, 
   null, 
   "jim's trucking", 
   "Tricky. Pretty much anything could be made to look like that :) The low quality of the images nudges me toward neptune or uranus but I haven't managed to simulate a recent conjunction with anything in that precise configuration. Obviously the cresent in the second image can't be either of those planets since we can never see them as anything less than oblate - which makes no sense since the planets we can see as a crescent ought to be much brighter, relatively speaking. Venus and the moon would be the right relative brightness, but I can't for the life of me explain why it would be such a terrible picture of them. So far, so stumped :)\nTruly tricky it was. I apologize for that.\n \n Both photos were taken during the most recent lunar eclipse as the moon was beginning to come out of darkness. The blue dot is a star that my neighbor...(the one that is freakishly into astronomy...to the point that he can tell me from memory how far away certain stars are)...says is 72 light years away.\n \n As we stood in the street, staring through the light cloud veil that kept obscuring our vision, I saw the blue dot. It actually appeared blue to the naked eye, that's not a function of camera hue adjustment.\n \n I have several frames of it. What amazes me is that even though these are only 2meg images, if I zoom in on the photo, I see stars by the thousands. I can't wait to make some 8meg photos of something similar. I do think a tri-pod would improve the quality.\n \n There was another planet in conjunction (or close) with the moon. I think it was Saturn. It was at a position near 7:30 and not as far radially from the moon.\n \n I have lots more poor frames if you'd like to study them. It was all done with a hand held camera. If I'd just had the sense to set everything manually, the pictures could have been better. I've since learned how to do that...now all I need is a good telescope with a camera mount.\n \n I think maybe if you look at the properties of the photos, you can tell what time it was taken...however, that information may be obscured by photobucket.\n \n If you are really into astronomy, you should meet my neighbor.", 
   {}, 
   310578, 
   null, 
   1210196580.0
  ], 
  [
   310634, 
   null, 
   "Peeling", 
   "I am quite into astronomy, though for reasons of geography not as much as I once was. Long exposure photography can be very rewarding especially with modern digital cameras. Last year I got some nice pictures of the Orion nebula and Andromeda, and one time in South Africa I got a nice tripod shot of the Milky Way. One day I plan to haul the old Meade up to the highlands of Scotland for a couple of weeks and do the job properly with my wife's new D300 - a fantastic bit of kit, by the way.", 
   {}, 
   310590, 
   null, 
   1210264680.0
  ], 
  [
   310656, 
   null, 
   "jim's trucking", 
   "I am quite into astronomy, though for reasons of geography not as much as I once was. Long exposure photography can be very rewarding especially with modern digital cameras. Last year I got some nice pictures of the Orion nebula and Andromeda, and one time in South Africa I got a nice tripod shot of the Milky Way. One day I plan to haul the old Meade up to the highlands of Scotland for a couple of weeks and do the job properly with my wife's new D300 - a fantastic bit of kit, by the way.\nYes it is. 12.2mp makes quite refined images compared to mine. The Canon 16mp is a daydream I have...but I'd be forced to lay off the exotic single malts I demand for too many months to work it into my playthings budget.\n \n With a computerized servo-drive, you should be able to create some awesome images. Share when you do, please.", 
   {}, 
   310634, 
   null, 
   1210282200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A simple question for Peeling...", 
  "url": "http://www.4forums.com/political/science-math-debates/11194-simple-question-peeling.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 11194, 
  "discussion_files": [
   [
    "28373.html", 
    "http://www.4forums.com/political/science-math-debates/11194-simple-question-peeling-print.html"
   ]
  ], 
  "identifier": 11194
 }
]