[
 [
  [
   310514, 
   null, 
   "Ethmi", 
   "I don't think so. I know a kid named Eric Booher. He was smoking pot with a bunch of friends. Then it went through one of their stupid intoxicated heads to set him on fire just for fun. The kid suffered severe 3rd degree burns, and was hospitalized for a long time. As for medical uses, well, I think we should stick to morphine. While it may be more addictive, It's harder to find outside of a hospital. I know a reporter who went to a drug rehab center, and interviewed quite a few recovering drug addicts, and just talked to even more. Every singe one of them said they started on Marijuana. So much for people saying that weed doesn't lead to a drug addiction. And as for people who say that marijuana isn't as bad for the lungs as tobacco: it will be if we legalize it. Farmers will start producing it in mass quantities. Soon, they'll want more money, and start spraying their plants with pesticides, just like tobacco farmers do. Pesticides are what make tobacco so unhealthy, and it will do that same thing with Weed.", 
   {
    "post_info": {
     "post_title": "Should We Legalize Marijuana?"
    }
   }, 
   null, 
   null, 
   1210115160.0
  ], 
  [
   310529, 
   null, 
   "thelmoose", 
   "I don't think so. I know a kid named Eric Booher. He was smoking pot with a bunch of friends. Then it went through one of their stupid intoxicated heads to set him on fire just for fun. The kid suffered severe 1st degree burns, and was hospitalized for a long time. As for medical uses, well, I think we should stick to morphine. While it may be more addictive, It's harder to find outside of a hospital. I know a reporter who went to a drug rehab center, and interviewed quite a few recovering drug addicts, and just talked to even more. Every singe one of them said they started on Marijuana. So much for people saying that weed doesn't lead to a drug addiction. And as for people who say that marijuana isn't as bad for the lungs as tobacco: it will be if we legalize it. Farmers will start producing it in mass quantities. Soon, they'll want more money, and start spraying their plants with pesticides, just like tobacco farmers do. Pesticides are what make tobacco so unhealthy, and it will do that same thing with Weed.\n\n \n Misinformation thy name is Ethmi.[*]It would be astonishingly unlikely that marijuana intoxication alone would cause that behavior. [*]First-degree burns are the mildest (sunburn is an example) and no one gets hospitalized for those.[*]The medical uses of marijuana are unrelated to the medical uses of morphine; it makes no sense to compare them.[*]Probably all recovering drug addicts have drunk alcohol or smoked cigarettes as well. Are they also to be implicated?[*]Not all marijuana use leads to addiction. Your observation of addicts only is selecting for addicts who tend to use drugs in general.[*]The quantitites of marijuana that farmers grow has no effect on its lung toxicity.[*]Smoking tobacco is quite unhealthy even without pesticides.\n Do you even know how to say anything that isn't dumb?", 
   {}, 
   310514, 
   null, 
   1210124640.0
  ], 
  [
   310530, 
   null, 
   "Ethmi", 
   "Misinformation thy name is Ethmi.[LIST][*]First-degree burns are the mildest (sunburn is an example) and no one gets hospitalized for those.\n \n\n Ah, I always get 'em mixed up.\n \n Now, onto the debate!", 
   {}, 
   310529, 
   null, 
   1210124940.0
  ], 
  [
   310533, 
   null, 
   "Ethmi", 
   "Misinformation thy name is Ethmi.[*]It would be astonishingly unlikely that marijuana intoxication alone would cause that behavior. \n\n \n I'm sure you've been high on marijuana before. And when you're high, you're too ignorant and doped up to know that it's the marijuana that's making you act like a XXXXX.\n \n \n[*]The medical uses of marijuana are unrelated to the medical uses of morphine; it makes no sense to compare them.\n\n \n That's right. In America, marijuana HAS NO MEDICAL USES. It is completely illegal, and I'd prefer to keep it that way.\n \n \n[*]Probably all recovering drug addicts have drunk alcohol or smoked cigarettes as well. Are they also to be implicated?\n\n \n The first illegal drug they used was usually marijuana. Alchohol and cigarettes are not illegal, because their effects aren't as sever as marijuana.\n \n \n[*]Not all marijuana use leads to addiction. Your observation of addicts only is selecting for addicts who tend to use drugs in general.\n\n \n Wow. It's quite a coincidence that the reporter just happened to choose almost everyone in the rehab center.\n \n \n[*]The quantitites of marijuana that farmers grow has no effect on its lung toxicity.\n\n \n But once they use pesticides it will.\n \n \n[*]Smoking tobacco is quite unhealthy even without pesticides.\n\n \n Oh, really? Does that mean that pesticides will be OK on marijuana plants? NO.\n \n \nDo you even know how to say anything that isn't dumb?\n\n \n Do you? Ha! For that matter, you're so doped up that you posted and forgot to vote!", 
   {}, 
   310529, 
   null, 
   1210125360.0
  ], 
  [
   310538, 
   null, 
   "thelmoose", 
   "I'm sure you've been high on marijuana before. And when you're high, you're too ignorant and doped up to know that it's the marijuana that's making you act like a XXXXX.\n\n \n You clearly don't understand the effects different drugs. Comment on something you understand. If there is anything.\n \n \nThat's right. In America, marijuana HAS NO MEDICAL USES. It is completely illegal, and I'd prefer to keep it that way.\n\n There may be legal pharmaceuticals that are more effective than marijuana for certain indications, but there are some conditions for which marijuana clearly does have benefit. Whether used in America or whether it's legal is irrelevant. And none of this has anything to do with morphine, to which YOU compared it. \n \n \n\n The first illegal drug they used was usually marijuana. Alchohol and cigarettes are not illegal, because their effects aren't as sever as marijuana.\n\n Legality does not affect addictive qualities. Alcohol and tobacco are much more addictive whan marijuana. There is dooubt that there is such a thing as a \"gateway\" drug anyway. Those that are predisposed to addiction will use lots of stuff. It does not follow logically that if use of marijuana preceded cocaine addiction that the latter addiction is related causally to the former marijuana use. \n \n \n\n Wow. It's quite a coincidence that the reporter just happened to choose almost everyone in the rehab center.\n\n Not a coincidence, just a stupid population to look at to understand whether marijuana does or does not lead to \"harder\" drugs. And the word of some guy you heard about is how you draw conclusions?\n \n \n \nBut once they use pesticides it will\n.\n Huh?\n \n \n \nOh, really? Does that mean that pesticides will be OK on marijuana plants? NO.\n\n No it means tobacco is unhealthy with or without pesticides. \n \n \nDo you? Ha! For that matter, you're so doped up that you posted and forgot to vote!\n\n Good one!!\n \n Ethmi,\n \n Each of your responses demonstrates you missed each point. You are batting 1000 there, fella.\n \n If you are this close-minded, impervious to logic and show this much delight in ignorance at your tender age, can you imagine how (much more) insufferable you'll be when you grow up?", 
   {}, 
   310533, 
   null, 
   1210130340.0
  ], 
  [
   310539, 
   null, 
   "snakespit", 
   "I'm sure you've been high on marijuana before. And when you're high, you're too ignorant and doped up to know that it's the marijuana that's making you act like a XXXXX.\n\n And I'm guessing by your misinformed posts that you have not been high before. Did you recently watch a film called Reefer Madness by any chance? \n \n \nThat's right. In America, marijuana HAS NO MEDICAL USES. It is completely illegal, and I'd prefer to keep it that way.\n\n Uh...actually it does. Just because it is currently against federal law to buy, sell, possess, or grow it, does not mean that it has no legitimate medical uses. Many people self medicate themselves with marijuana because it works for them. Some states have decriminalized it. Some states even have medical marijuana laws. There is even a drug called Marinol that contains THC, the psychoactive component of marijuana. It is used widely across the country, especially in the fields of oncology, pain management, and even rheumotology and neurology. Marijuana is illegal because it contains THC, yet we can make a drug with THC (which is even plant derived) and prescribe it every day...does that make sense? Why you ask...so drug companies can sell it and make a profit. \n \n \nThe first illegal drug they used was usually marijuana. Alchohol and cigarettes are not illegal, because their effects aren't as sever as marijuana.\n\n What? Are you sure about that? Alcohol is far more harmful and debilitating than marijuana, both in short term effects and long term effects. Smoking does not compare either, as when placed in comparison the average cigarette smoker smokes far more tobacco than the average marijuana smoker smokes marijuana. \n \n \nWow. It's quite a coincidence that the reporter just happened to choose almost everyone in the rehab center.\n\n Typically rehab centers are a good place to find drug addicts. As far as marijuana being a stepping stone to other drugs: do you really believe that if marijuana ceased to exist tomorrow that people would not still try other drugs? Please. \n \n \nBut once they use pesticides it will.\n Oh, really? Does that mean that pesticides will be OK on marijuana plants? NO.\n\n Ok Artie McStrawman.\n \n \n \nDo you? Ha! For that matter, you're so doped up that you posted and forgot to vote!\n\n You're not going to last long here on 4forums.", 
   {}, 
   310533, 
   null, 
   1210130700.0
  ], 
  [
   310541, 
   null, 
   "snakespit", 
   "It is completely illegal, and I'd prefer to keep it that way.\n\n To specifically address this point...why do you prefer to keep it that way? Are you afraid that you are going to use it if it is legalized?", 
   {}, 
   310533, 
   null, 
   1210131060.0
  ], 
  [
   310588, 
   null, 
   "sinjin", 
   "I could smoke a mountain of pot and not be as dopey as this character.:xbanghead", 
   {}, 
   310541, 
   null, 
   1210191960.0
  ], 
  [
   310592, 
   null, 
   "Steeeeve", 
   "You really could never convince me that marijuana doesn't make people XXXXXX (the chronic users). I've seen enough to know that while it has no direct effect it certainly makes you lazy enough for a long enough time to not do what you are supposed to do as a functional human being. Combine this with chronic use and you now have a long term user that is an idiot. Considering the quality of intelligence by the thread creator, can we really afford this risk?\n \n So, in my opinion, it isn't so much that the product is unhealthy and causes an eminent thread to the others in a society but rather that it is just plain stupid to do. Whether this is reason enough to make it illegal, I dunno. I prefer it be illegal in public buildings (stores, office buildings, etc) and illegal while driving at the very least.", 
   {}, 
   310588, 
   null, 
   1210197000.0
  ], 
  [
   310597, 
   null, 
   "sinjin", 
   "You really could never convince me that marijuana doesn't make people XXXXXX (the chronic users). I've seen enough to know that while it has no direct effect it certainly makes you lazy enough for a long enough time to not do what you are supposed to do as a functional human being. Combine this with chronic use and you now have a long term user that is an idiot. Considering the quality of intelligence by the thread creator, can we really afford this risk?\nIt gives the lazy a great excuse but in the not so lazy it presents no real impediment to action.", 
   {}, 
   310592, 
   null, 
   1210200120.0
  ], 
  [
   310605, 
   null, 
   "Ethmi", 
   "You clearly don't understand the effects different drugs. Comment on something you understand. If there is anything.\n\n \n YOU clearly don't understand how serious marijuana is. When you're drunk, you don't know your drunk. Same thing with being high. \n \n \n\n There may be legal pharmaceuticals that are more effective than marijuana for certain indications, but there are some conditions for which marijuana clearly does have benefit. Whether used in America or whether it's legal is irrelevant. And none of this has anything to do with morphine, to which YOU compared it.\n \n \n Put down the blunt and think with your microscopic brain (for once). They can both be used for pain relief. Only morphine is harder to get. \n \n \nLegality does not affect addictive qualities. Alcohol and tobacco are much more addictive whan marijuana. There is dooubt that there is such a thing as a \"gateway\" drug anyway.\n\n \n Then why do marijuana addicts tend to end up on heroin? And how come people that only smoke every weekend never forget to smoke on individual weekends?\n \n \nThose that are predisposed to addiction will use lots of stuff. It does not follow logically that if use of marijuana preceded cocaine addiction that the latter addiction is related causally to the former marijuana use.\n \n \n Marijuana is a gateway drug. Once you smoke too much (which is not much), you develop a taste for being high and move on to cocaine, heroin, LSD, etc.\n \n \nNot a coincidence, just a stupid population to look at to understand whether marijuana does or does not lead to \"harder\" drugs. And the word of some guy you heard about is how you draw conclusions?\n\n \n Oh, so this only happens here, huh? Every single hardcore drug addict is here, huh?\n \n \nHuh?\n\n \n Marijuana has taken it's toll on your mind --- you can't even understand what I wrote!\n \n \nNo it means tobacco is unhealthy with or without pesticides.\n \n \n Marijuana is worse than tobacco. Not only does it get you high, but it has the same effects on the lungs as tobacco. And your argument is not a good one. If I said \"this food is bad because it's poisonous, so lets use this one and add poison to it.\" Does that make any sense? NO.\n \n \nGood one!!\n \n Ethmi,\n \n Each of your responses demonstrates you missed each point. You are batting 1000 there, fella.\n\n \n You're not much better. You're missing my points as well.\n \n \nIf you are this close-minded, impervious to logic and show this much delight in ignorance at your tender age, can you imagine how (much more) insufferable you'll be when you grow up?\n\n \n You throw personal insults more than I do. So when will YOU grow up?", 
   {}, 
   310538, 
   null, 
   1210203240.0
  ], 
  [
   310608, 
   null, 
   "sinjin", 
   "YOU clearly don't understand how serious marijuana is. When you're drunk, you don't know your drunk. Same thing with being high.\nThe effects are not remotely similar. \n \n \nThey can both be used for pain relief. Only morphine is harder to get.\nMarijuana is not an effective pain reliever. It is commonly prescribed to treat nervous disorders and nausea.\n \n \nThen why do marijuana addicts tend to end up on heroin? \nThey don't. The vast majority of users(not addicts) are functioning citizens. The fact that you don't know that proves the point.\n \n \nMarijuana is a gateway drug. Once you smoke too much (which is not much), you develop a taste for being high and move on to cocaine, heroin, LSD, etc.\nThis is old and tired. The only gateway is the dealer who is encouraged to carry multiple products. That and the fact that many young people figure that if they were lied to about the seriousness of dangers associated with marijuana, maybe those other drugs aren't as bad as they say either. Wonderful strategy on the part of the antis. \n \n \nMarijuana is worse than tobacco. Not only does it get you high, but it has the same effects on the lungs as tobacco.\nExcept no one smokes 20-40 joints a day.", 
   {}, 
   310605, 
   null, 
   1210204080.0
  ], 
  [
   310609, 
   null, 
   "thelmoose", 
   "You really could never convince me that marijuana doesn't make people XXXXXX (the chronic users). I've seen enough to know that while it has no direct effect it certainly makes you lazy enough for a long enough time to not do what you are supposed to do as a functional human being. Combine this with chronic use and you now have a long term user that is an idiot. Considering the quality of intelligence by the thread creator, can we really afford this risk?\n \n So, in my opinion, it isn't so much that the product is unhealthy and causes an eminent thread to the others in a society but rather that it is just plain stupid to do. Whether this is reason enough to make it illegal, I dunno. I prefer it be illegal in public buildings (stores, office buildings, etc) and illegal while driving at the very least.\n\n \n Everything you say makes sense, but as sinjin said, some of the lower function problems may be related to the underlying character. Certainly there exists a character-type that is undermotivated and gets high a lot. Chicken or egg?\n \n My point to the opening poster was that anyone who knows anything about the effects of marijuana ingestion knows the last thing a stony would do is light a friend on fire.", 
   {}, 
   310592, 
   null, 
   1210204800.0
  ], 
  [
   310610, 
   null, 
   "T.Q", 
   "YOU clearly don't understand how serious marijuana is. When you're drunk, you don't know your drunk. Same thing with being high. \n\n So what does this have to do with the topic? Alcohol is legal, marijuana isn't, but they both serve the same purpose (getting high), so why should one be illegal and the other not?\n \n \n \n \nPut down the blunt and think with your microscopic brain (for once). \n\n This will get you banned if you keep it up.\n \n They can both be used for pain relief. Only morphine is harder to get. \n\n Pain relief is only one medical application of marijuana. And you can't be serious when you say that marijuana is just as addictive as morphine is.\n \n \n \n \nThen why do marijuana addicts tend to end up on heroin?\n\n Because they are predisposed to addiction.\n \nAnd how come people that only smoke every weekend never forget to smoke on individual weekends?\n\n What? That's like saying that anyone who enjoys a beer on the weekend is an alcoholic.\n \n \n \n \nMarijuana is a gateway drug.\n\n No, it isn't.\n \n \n Once you smoke too much (which is not much),\n\n Oh? And what is the specific amount of pot you have to smoke before you become a drug crazed fiend?\n \n \nyou develop a taste for being high and move on to cocaine, heroin, LSD, etc.\n\n Incorrect. There is no direct corellation between marijuana use and the use of \"harder\" drugs.\n \n \nOh, so this only happens here, huh? Every single hardcore drug addict is here, huh?\n\n Do you understand what was said? If you're looking to see if marijuana use leads to the use of \"hard\" drugs, asking a room full of heroin addicts isn't exactly a balanced sample.\n \n \nMarijuana has taken it's toll on your mind --- you can't even understand what I wrote!\n\n This will also get you banned.\n \n \nMarijuana is worse than tobacco.\n\n No, it isn't. Tobacco is much more addictive (ranks up there with heroin)\n \n \nNot only does it get you high, but it has the same effects on the lungs as tobacco.\n\n It has higher tar levels, but much less chemicals, so it's actually a little better for your lungs.\n \n \n And your argument is not a good one. If I said \"this food is bad because it's poisonous, so lets use this one and add poison to it.\" Does that make any sense? NO.\n\n Actually, your argument makes no sense. It's not the pesticides used on the tobacco crop that makes it harmful, it's the chemicals they add to the tobacco to make the smoke more palatable. Your whole point here is moot.\n \n \nYou throw personal insults more than I do. So when will YOU grow up?\n\n \n Well, since you've called those who've disagreed with you here stupid (and variations thereof), and insinuated that they're too stoned to understand you, I think you have the most ground to make up. You also provide no support for your statements, most of which were debunked years ago as drug czar propoganda.", 
   {}, 
   310605, 
   null, 
   1210204800.0
  ], 
  [
   310614, 
   null, 
   "Ethmi", 
   "So what does this have to do with the topic? Alcohol is legal, marijuana isn't, but they both serve the same purpose (getting high), so why should one be illegal and the other not?\n\n \n Because one has second-hand smoke, 70% of all drug addicts started on it, and is harder to control how much you take in.\n \n \nThis will get you banned if you keep it up.\n\n \n The person I was responding to used personal insults on several occasions, yet you don't seem too eager to report them. Perhaps that because my opinions contradict yours? \n \n \nPain relief is only one medical application of marijuana. And you can't be serious when you say that marijuana is just as addictive as morphine is.\n\n \n I never implied that. But morphine is harder to get than marijuana is.\n \n \nBecause they are predisposed to addiction.\n\n \n HA! Everyone is predisposed to addiction!\n \n \nWhat? That's like saying that anyone who enjoys a beer on the weekend is an alcoholic.\n\n \n Not exactly. It's easier to control how much alcohol you take in than it is marijauna.\n \n \nNo, it isn't.\n\n \n HA!! Is that the most intelligent thing you had to say? You're not even gonna try to back that up? HA!!!\n \n \nOh? And what is the specific amount of pot you have to smoke before you become a drug crazed fiend?\n\n \n I'm smart enough not to try and find out. So why don't you tell me?\n \n \nIncorrect. There is no direct corellation between marijuana use and the use of \"harder\" drugs.\n\n \n So I guess it's just coincidence that 70% of all drug addicts started on marijuana.\n \n \nDo you understand what was said? If you're looking to see if marijuana use leads to the use of \"hard\" drugs, asking a room full of heroin addicts isn't exactly a balanced sample.\n\n \n \n \nThis will also get you banned.\n\n \n How old are you? Do you have any idea how childish it is to go around threatening to report people? Even more so when you sit there and laugh when someone who's on your side does the exact same thing.\n \n \nNo, it isn't. Tobacco is much more addictive (ranks up there with heroin)\n\n \n You're only counting the physical addiction. What about the mental addiction? Did you think of that?\n \n \nIt has higher tar levels, but much less chemicals, so it's actually a little better for your lungs.\n\n \n Do you think weed farmers won't add chemicals to it if it's legalized? If you do, then you're a very nieve person.\n \n \nActually, your argument makes no sense. It's not the pesticides used on the tobacco crop that makes it harmful, it's the chemicals they add to the tobacco to make the smoke more palatable. Your whole point here is moot.\n\n \n By closing the hold I made you just opened up another one. Once they start producing weed in mass quantities, the greedy scumbag farmers will want more money, and they'll add chemicals to it.\n \n \nWell, since you've called those who've disagreed with you here stupid (and variations thereof), and insinuated that they're too stoned to understand you, I think you have the most ground to make up.\n\n \n I don't regret anything I've said.\n \n \nYou also provide no support for your statements,\n \n Oh, and you do?\n \n \n most of which were debunked years ago as drug czar propoganda.\n\n \n Who proved it wrong? Huh? NOBODY. It was just assumed so scumbags like you could rationalize doing something that they shouldn't have done.", 
   {}, 
   310610, 
   null, 
   1210210560.0
  ], 
  [
   310618, 
   null, 
   "T.Q", 
   "Because one has second-hand smoke,\n\n Yet cigarettes are legal. There goes that argument.\n \n \n70% of all drug addicts started on it,\n\n I bet quite a few drug addicts sniffed glue and gasoline as well. We should probably ban those substances as well. They're even easier to get than pot is.\n \nand is harder to control how much you take in.\n\n How so?\n \n \n \nThe person I was responding to used personal insults on several occasions, yet you don't seem too eager to report them. Perhaps that because my opinions contradict yours?\n\n When you call someone (ie-me) a \"scumbag\" because they disagree with you, I'd say you're the one who needs to be reprimanded. Or did I insult you numerous times as well?\n \n \nHA! Everyone is predisposed to addiction!\n\n Oh? So everyone is a drug addict/alcoholic waiting to happen? Sorry sparky, not the case.\n \n \nNot exactly. It's easier to control how much alcohol you take in than it is marijauna.\n\n I say again: how so?\n \n \n \n \nHA!! Is that the most intelligent thing you had to say? You're not even gonna try to back that up? HA!!!\n\n Well, seeing as how you haven't even attempted to support your assertions yet, and mine are common knowledge, I don't see the need to actually provide sources for my assertions.\n \n \nI'm smart enough not to try and find out. So why don't you tell me?\n\n Well, seeing as how it was you who said \"Once you smoke too much (which is not much)...\"\n So, seeing as how it's your assertion that a small, measurable amount is enough to turn you into a heroin addict, I assumed you might actually be able to support your point. My mistake.\n \n \nSo I guess it's just coincidence that 70% of all drug addicts started on marijuana.\n\n No, it's not a coincedence. Pot is cheap and easy to get. If something else was cheap and easy to get, it would have been that. There is no causal link between marijuana use and harder drug addiction\n \n \n \nHow old are you? Do you have any idea how childish it is to go around threatening to report people?\n\n Nowhere did I threaten to report you. I told you that what you are doing could earn you a ban. In other words \"if you want to stick around, you may want to stop that before admin sees it\".\n \n \nEven more so when you sit there and laugh when someone who's on your side does the exact same thing.\n\n I'll say what I said above:\n When you call someone (ie-me) a \"scumbag\" because they disagree with you, I'd say you're the one who needs to be reprimanded. Or did I insult you numerous times as well?\n \n \n \n \nYou're only counting the physical addiction. What about the mental addiction? Did you think of that?\n\n I did. Did you?\n \n \n \n \nDo you think weed farmers won't add chemicals to it if it's legalized? If you do, then you're a very nieve person.\n\n It's actually \"naive\", and what you're doing is called \"moving the goalposts\"\n \n \n \nBy closing the hold[sic] I made you just opened up another one.\n\n Um, no, I didn't.\n \n Once they start producing weed in mass quantities, the greedy scumbag farmers will want more money, and they'll add chemicals to it.\n\n Are all people that grow cash crops \"greedy scumbag farmers\", or just the ones who grow crops you don't agree with? And you're moving the goalposts again.\n \n \nI don't regret anything I've said.\n\n Your kind seldom do.\n \n \n \nOh, and you do?\n\n As I said, my statements are common knowledge, available to anyone who has read anything on the subject.\n \n \n \n \nWho proved it wrong?\n\n Research scientists.\n \n \nIt was just assumed so scumbags like you could rationalize doing something that they shouldn't have done.\n\n \n This will get you banned. And why would you assume that I've ever even used pot?\n \n Using another user name after you've been banned will also get you (re)banned, Spicy.\n \n (if this isn't spicy, I'll eat my hat. The \"HA!\", constant insults, spelling errors, and complete lack of logic are big tips. The scarier thought is that there is more than one of them out there)", 
   {}, 
   310614, 
   null, 
   1210213680.0
  ], 
  [
   310635, 
   null, 
   "Steeeeve", 
   "It gives the lazy a great excuse but in the not so lazy it presents no real impediment to action.\nThis has not been my experience but I am referring to chronic users such as those that use it 1-2 times a day. I've seen a lot of smart people end up working at grocery stores thanks to marijuana. Only question I can ask is \"what on earth were you thinking?\".", 
   {}, 
   310597, 
   null, 
   1210264740.0
  ], 
  [
   310640, 
   null, 
   "sinjin", 
   "This has not been my experience but I am referring to chronic users such as those that use it 1-2 times a day. I've seen a lot of smart people end up working at grocery stores thanks to marijuana. Only question I can ask is \"what on earth were you thinking?\".\nAnd I know rocket scientists and engineers and other technical professionals that use at the level you describe and more.\n \n Some people opt out of a more demanding career because they want to smell the roses. That people like that might also get high surprises me little.", 
   {}, 
   310635, 
   null, 
   1210266840.0
  ], 
  [
   310647, 
   null, 
   "snakespit", 
   "I never implied that. But morphine is harder to get than marijuana is.\n\n Perhaps...but what about Oxycontin and Percocet and Vicoden and Codeine...etc. I could find those more readily than marijuana around here most times. Should we make them illegal too? Acute intoxication from Oxycontin kills people all the time...never seen someone keel over after smoking a joint. Anything can be found, you just have to know where to look for it. Morphine is no exception, and it is abused often. sometimes with deadly results. \n \n \nNot exactly. It's easier to control how much alcohol you take in than it is marijauna.\n\n Really? Then why do I see so many alcohol OD's and no marijuana OD's? Why do people die from drinking too much, yet I have yet to see someone die from smoking too much marijuana? \n \n \nSo I guess it's just coincidence that 70% of all drug addicts started on marijuana.\n\n You got figures to back that up? \n \n \nHow old are you? Do you have any idea how childish it is to go around threatening to report people? Even more so when you sit there and laugh when someone who's on your side does the exact same thing.\n\n Then stop the name-calling and childish taunts that you keep throwing out. It's rude and distasteful, and has no place in an intelligent debate. \n \n \nYou're only counting the physical addiction. What about the mental addiction? Did you think of that?\n\n The physical addiction to tobacco is easy to break. Th mental addiction to tobacco is about as hard as heroin to break. Marijuana exhibits little to no physical or mental addiction. \n \n \nDo you think weed farmers won't add chemicals to it if it's legalized? If you do, then you're a very nieve person. \n \n By closing the hold I made you just opened up another one. Once they start producing weed in mass quantities, the greedy scumbag farmers will want more money, and they'll add chemicals to it.\n\n I don't recall this happening in the Netherlands...does anyone else? Actually, it has helped to ensure quality and purity.", 
   {}, 
   310614, 
   null, 
   1210271340.0
  ], 
  [
   310648, 
   null, 
   "sinjin", 
   "I don't recall this happening in the Netherlands...does anyone else? Actually, it has helped to ensure quality and purity.\nMost of the people I've met from NoCal that are involved in production are no more likely to put pesticides on their crop than to put it on their kids cereal.", 
   {}, 
   310647, 
   null, 
   1210271580.0
  ], 
  [
   310652, 
   null, 
   "Steeeeve", 
   "And I know rocket scientists and engineers and other technical professionals that use at the level you describe and more.\n \n Some people opt out of a more demanding career because they want to smell the roses. That people like that might also get high surprises me little.\n\n \n No doubt it is possible..but I wouldn't advise it. You can be an alcoholic and a good doctor but being an alcoholic will more likely make you not a productive member of society.", 
   {}, 
   310640, 
   null, 
   1210279140.0
  ], 
  [
   310658, 
   null, 
   "sinjin", 
   "No doubt it is possible..but I wouldn't advise it. You can be an alcoholic and a good doctor but being an alcoholic will more likely make you not a productive member of society.\nAlcoholism is physically debilitating in the long run. Not so with pot smokers. As far as being a productive member of society, I don't believe it takes 24/7 sobriety to qualify. \"Hard good and hard work fine but first take care of head\". You know the song?", 
   {}, 
   310652, 
   null, 
   1210284420.0
  ], 
  [
   310667, 
   null, 
   "snakespit", 
   "No doubt it is possible..but I wouldn't advise it. You can be an alcoholic and a good doctor but being an alcoholic will more likely make you not a productive member of society.\n\n But not everyone who drinks classifies as an alcoholic. In fact, it is probably a minority of those who do. We see nothing wrong with social use of alcohol in our society, and I wonder what makes marijuana use any different. I know many professionals who smoke marijuana in their off time. They maintain healthy family relationships, are productive workers, and are often times some of the smarter and more intellectual people I know. Marijuana use is far more common than many people think, and the image of a lazy pot smoking hippie eating cheetos and watching VH1 all day is simply a misrepresentation. Don't get me wrong, I don't mean to imply that these people do not exist, but I would guess in no greater proportion than alcoholics. And in my line of work, I see far more problems from those who are drunk than those who are high on marijuana.", 
   {}, 
   310652, 
   null, 
   1210298940.0
  ], 
  [
   313291, 
   null, 
   "Ethmi", 
   "Yet cigarettes are legal. There goes that argument.\n \n\n Cigarettes don't get you high.\n \n \n \nI bet quite a few drug addicts sniffed glue and gasoline as well. We should probably ban those substances as well. They're even easier to get than pot is.\n\n \n They can be used to do something constructive. Weed can't.\n \n \nHow so?\n\n \n Because alcohol is more easily measurable, but since blunts and joints take a while to smoke, you are less aware of how much you smoked.\n \n \nWhen you call someone (ie-me) a \"scumbag\" because they disagree with you, I'd say you're the one who needs to be reprimanded. Or did I insult you numerous times as well?\n\n \n \n \n \nOh? So everyone is a drug addict/alcoholic waiting to happen? Sorry sparky, not the case.\n\n \n So I guess only people predisposed to alcoholism can become alcoholics.\n \n \n \nI say again: how so?\n\n Read the what I wrote before in this post.\n \n \n\n Well, seeing as how you haven't even attempted to support your assertions yet, and mine are common knowledge, I don't see the need to actually provide sources for my assertions.\n\n \n How are yours common knowledge? Do you live in Europe or something? All the Europeans are a bunch of liberals.\n \n \n [/QUOTE]Well, seeing as how it was you who said \"Once you smoke too much (which is not much)...\"\n So, seeing as how it's your assertion that a small, measurable amount is enough to turn you into a heroin addict, I assumed you might actually be able to support your point. My mistake.[/QUOTE]\n \n How do you measure it?\n \n \nNo, it's not a coincedence. Pot is cheap and easy to get. If something else was cheap and easy to get, it would have been that. There is no causal link between marijuana use and harder drug addiction.\n\n \n If what you say is true, then it is a coincedence.\n \n \n \nNowhere did I threaten to report you. I told you that what you are doing could earn you a ban. In other words \"if you want to stick around, you may want to stop that before admin sees it\".\n\n \n Oh my God, I'm dealing with a bunch of babies here! You try taking the stress I do and see if you can keep your sanity!\n \n \nI'll say what I said above:\n When you call someone (ie-me) a \"scumbag\" because they disagree with you, I'd say you're the one who needs to be reprimanded. Or did I insult you numerous times as well?\n\n \n And I'll say what I said above:\n Oh, quit being such a baby. If you complain about that, then you would be in a mental institution if you experienced the frustration I do on a daily basis.\n \n \n \nI did. Did you?\n\n \n Heroin has a much stronger mental addiction than tobacco.\n \n \nIt's actually \"naive\", and what you're doing is called \"moving the goalposts\"\n\n \n We're debating weed, not spelling here.\n \n \nUm, no, I didn't.\n\n \n So they'll just sell weed without making it tastier?\n \n \nAre all people that grow cash crops \"greedy scumbag farmers\", or just the ones who grow crops you don't agree with? And you're moving the goalposts again.\n\n \n Neither! Just the ones that sell stuff that will ruin somebody's life.\n \n \n \nYour kind seldom do.\n\n \n Why should I regret it? People don't regret what they say to me. \n \n \nAs I said, my statements are common knowledge, available to anyone who has read anything on the subject.\n\n \n They're common assumptions.\n \n \nResearch scientists.\n\n \n Who are they? Huh? What research scientists? The potheads? Did they \"discover\" this before or after they smoked weed?\n \n \nThis will get you banned. And why would you assume that I've ever even used pot?\n\n \n I'm debating with babies here.\n \n \nUsing another user name after you've been banned will also get you (re)banned, Spicy.\n\n \n Dealing with babies.\n \n \n(if this isn't spicy, I'll eat my hat. The \"HA!\", constant insults, spelling errors, and complete lack of logic are big tips. The scarier thought is that there is more than one of them out there)\n\n \n Dealing with big babies. And how is \"Ha!\" an insult? Did it imply anything?", 
   {}, 
   310618, 
   null, 
   1213509300.0
  ], 
  [
   313295, 
   null, 
   "T.Q", 
   "Cigarettes don't get you high.\n\n Yeah, they do.\n \n \nThey can be used to do something constructive. Weed can't.\n\n Oh, guess you got me there. Oh wait, you're wrong again.\n \n \n \nBecause alcohol is more easily measurable, but since blunts and joints take a while to smoke, you are less aware of how much you smoked.\n\n Drinking a beer:\n 1)Buy at local store\n 2)pick up beer\n 3)crack cap\n 4) drink\n 5) GOTO 1)\n \n Smoking a joint:\n 1)get from dealer (hope he has some and can get it to you when you want it)\n 2)open baggie\n 3)realize you forgot to buy papers\n 4)go buy papers, doritos, ho-ho's, some Jolt cola\n 5)go home\n 6)open baggie\n 7)take out one paper\n 8)measure small amount of pot into paper\n 9)carefully roll-not too tight, not too loose0\n 10)seal\n 11)look for lighter\n 12)light\n \n \nSo I guess only people predisposed to alcoholism can become alcoholics.\n\n They have a much higher frequency, yes.\n \n \nRead the what I wrote before in this post.\n\n I'd suggest you do the same.\n \n \n \nHow are yours common knowledge? Do you live in Europe or something? All the Europeans are a bunch of liberals.\n\n I'm just curious, are guys like you born this proud of your ignorance, or does it take lots of practice?\n \n \n \nHow do you measure it?\n\n That's a very good question! Why didn't I ask that? Wait, I did.\n \n \n \n \nIf what you say is true, then it is a coincedence.\n\n Which would pretty much be my point...\n \n \nOh my God, I'm dealing with a bunch of babies here! You try taking the stress I do and see if you can keep your sanity!\n\n So you're stressed out and that means it's fine for you to come here and call people scumbags and other assorted insults? Sorry sparky, it doesn't work that way.\n \n \nAnd I'll say what I said above:\n Oh, quit being such a baby. If you complain about that, then you would be in a mental institution if you experienced the frustration I do on a daily basis.\n\n You think you're suffering? Think of the poor people who have to deal with you on a daily basis!\n \n \nHeroin has a much stronger mental addiction than tobacco.\n\n Well, you don't say! Really, do you even read what you're responding to? You claimed marijuana was as addictive as tobacco, despite every study showing it isn't. I told you no, tobacco is almost as addictive as heroin. Now you're trying to argue with me that heroin is more addictive than tobacco?\n \n \nWe're debating weed, not spelling here.\n\n Debate involves an exchange of intelligent conversation and facts. I'm not seeing much of either from you\n \n \nSo they'll just sell weed without making it tastier?\n\n Have you ever heard of a logical chain of thought? This is like having a conversation with a five year old suffering from ADD.\n \n \nNeither! Just the ones that sell stuff that will ruin somebody's life.\n\n You must hate brewers, distillers, refiners, foresters, etc, etc, etc then as well, eh?\n \n \nWhy should I regret it? People don't regret what they say to me. \n\n Probably because you don't give them much cause to.\n \n \nThey're common assumptions.\n\n Yes, that's right. I'm making this all up.\n \n \n\n Who are they? Huh? What research scientists? The potheads? Did they \"discover\" this before or after they smoked weed?\n\n And that, ladies and gentlemen, is why I\"m not going to even bother doing a simple google search to find some commonly known studies for him. Why bother? It's already the \"potheads\" who did the \"reasearch\" and \"discovered\" what they wanted to. That's the great thing about science, isn't it Ethmi? You can make up whatever you want and no one will ever know!\n \n \nI'm debating with babies here.\n\n No fair! You stole my line!\n \n \nDealing with babies.\n \n \n \n Dealing with big babies.\n\n \n Not much imagination on you, eh Ethmi. No worries, I can see now how you take constructive criticism. In the future (well, beginning now actually), I'll be sure to treat you with the same respect you've shown me.\n \n \nAnd how is \"Ha!\" an insult? Did it imply anything?\n\n \n Ethmi's homework assignment: What is the purpose of the comma in the following sentence:\n The \"HA!\", constant insults, spelling errors, and complete lack of logic are big tips.", 
   {}, 
   313291, 
   null, 
   1213511640.0
  ], 
  [
   313308, 
   null, 
   "chester", 
   "Ethmi eeds to be reminded that 100% of all drug addicts started on milk.\n \n As anyone even remotely familiar with statistics well knows, correlation does not indicate causation.", 
   {}, 
   313295, 
   null, 
   1213542360.0
  ], 
  [
   313314, 
   null, 
   "jitobear", 
   "All right Ethmi, your just ticking me off and I don't do drugs. Me getting wild is 2-3 beers over a four to five hour period on a Saturday afternoon. But I do hate misinformation and you are full of it.\n \n Here is a sight that ranks six of the most commonly used drugs in terms of their danger and addictiveness. The ranking was created by medical professionals at top institutions, it clearly ranks nicotine high and marijuana dead last.\n \n http://www.druglibrary.org/schaffer/library/basicfax5.htm\n \n More doctors lists - all tell the same story.\n \n http://www.procon.org/AddictChart.htm\n \n Here is a website that lists the medical uses of marijuana and the research or anecdotal evidence that backs them up.\n \n http://www.medicalmarijuanainformation.com/therapeuticuses/\n \n Here is info about morphine, an opiate (which is SIGNIFIGANTLY more addictive that marijuana - Heroin is an opiate). Its only purpose is alleviating severe pain.\n \n http://en.wikipedia.org/wiki/Statex\n \n I also support the complete legalization of all drugs (to adults).\n \n 1 - It is an infringement of personal liberty. \n 2 - The war on drugs is a failure. \n \n Roughly half the resources invested in law enforcement, the justice system and prisons is on the war on drugs. A great many of those prosecuted are non-violent drug offenders, and due mandatory minimum sentencing, many of these non-violent drug offenders see more prison time than actual violent criminals. And even when we do bring in a dealer, someone just replaces him. The problem isn't solved. \n \n People want drugs. As long as there is a demand, there will be a supply. And currently that supply is controlled by thugs who murder, jack up prices and tear apart neighborhoods in gang and turf wars. The same thing happened during prohibition (fortunately we got smart and repealed it). Currently the estimates are that half of all homocides and a third of all thefts are the result of the illegal drug trade.\n \n If drugs were legal these thugs would lose their business which could help create safer neighborhoods, we could better control who can get drugs (i.e., only adults), we could control the pricing so that addicts could afford them rather than resort to crime to obtain them, they would be regulated by the FDA and would be safer, we could tax them, and we could free up our law enforcement agencies and prisons to deal with REAL criminals.", 
   {}, 
   313308, 
   null, 
   1213547280.0
  ], 
  [
   313477, 
   null, 
   "jazyjason", 
   "Wheres Archie in this fun little debate? I'm sure it says in genesis some where that cause God said so he can smoke pot. Actually maybe if he did get high it would open his mind and clear his thinking. I've never done drugs as a personal choice and just cause I see no need to and I hate losing self control such as being intoxicated. But I say for medical purposes only.", 
   {}, 
   313314, 
   null, 
   1213797900.0
  ], 
  [
   313480, 
   null, 
   "trebor", 
   " And in my line of work, I see far more problems from those who are drunk than those who are high on marijuana.\n\n \n \n Could it be because there are less people high on marijuana than booze?\n \n On the other hand, I have seen people who are really mean drunks, but I have never seen anybody that was a MEAN pot smoker (i.e. get angry and violent when high on pot).\n \n On the other hand, I have noticed people who got paranoid when high.", 
   {}, 
   310667, 
   null, 
   1213800300.0
  ], 
  [
   313554, 
   null, 
   "NoobDebater", 
   "Legalize marijuana with similar regulations as alcohol and smoking. No smoking in public, no public intoxication...\n \n For myself, it's all about personal responsibility. Stay home, get high, don't be a risk to public safety. emoticon_xagree \n \n My belief is that a person's proclivity towards stupidity is no longer inhibited by euphoria induced by alcohol or marijuana. emoticon_xbouncer", 
   {}, 
   313480, 
   null, 
   1213870320.0
  ], 
  [
   313770, 
   null, 
   "snakespit", 
   "Could it be because there are less people high on marijuana than booze?\n \n On the other hand, I have seen people who are really mean drunks, but I have never seen anybody that was a MEAN pot smoker (i.e. get angry and violent when high on pot).\n \n On the other hand, I have noticed people who got paranoid when high.\n\n \n No, I would say per capita it's not even a close race. I see many many people high on pot...they just don't usually cause problems. I have never had someone high on marijuana try to assault me, throw me down a flight of steps, fight with me and my partner, spit on me, puke all over me, etc. As far as the drunks...that has all happened to me in the last 2 months thanks to the wonders of alcohol. I would much rather arrive on scene to find someone stoned than someone drunk. \n \n Isn't America great? You can't sit in your living room and smoke a joint to relax, but you can drive to a bar and get absolutely stupid in a public setting. Now I ask, which person is more likely to affect the wellbeing of others?", 
   {}, 
   313480, 
   null, 
   1214036760.0
  ], 
  [
   314791, 
   null, 
   "Omegamon_X", 
   "If people with to smoke marijuana legally, then allow them to do so, but only after adding cyanide to it.\n \n If people want to smoke poison, then give them the real deal.", 
   {}, 
   310614, 
   null, 
   1215036840.0
  ], 
  [
   316156, 
   null, 
   "snakespit", 
   "If people with to smoke marijuana legally, then allow them to do so, but only after adding cyanide to it.\n \n If people want to smoke poison, then give them the real deal.\n\n \n No more of a poison than alcohol (actually far less), should we start lacing that with strychnine? \n \n ***I can see it now***\n \n *Excuse me bartender...what are the drink specials?\n \n -We got Bud Light bottles for $4.00, Jagerbombs for $7.50, and this new drink called Convulsions on the Beach. First one is on the house!", 
   {}, 
   314791, 
   null, 
   1215700980.0
  ], 
  [
   316397, 
   null, 
   "DrNo", 
   "\n \n They can be used to do something constructive. Weed can't.\n \n \n\n \n I hope you don't listen to any music, look any artwork, watch TV, watch movies, play video games, read books, etc.\n \n There's a lot of people who smoke tons of pot who create incredible things.", 
   {}, 
   313291, 
   null, 
   1215811380.0
  ], 
  [
   316401, 
   null, 
   "DrNo", 
   "If people want to smoke poison, then give them the real deal.\n\n \n We already have. They are called cigarettes. Cigarettes contain cyanide.", 
   {}, 
   314791, 
   null, 
   1215812580.0
  ], 
  [
   316402, 
   null, 
   "jim's trucking", 
   "I hope you don't listen to any music, look any artwork, watch TV, watch movies, play video games, read books, etc.\n \n There's a lot of people who smoke tons of pot who create incredible things.\nWillie Nelson, Boz Scaggs, Jackie Gleason, Bing Crosby, Cheech and Chong...to name a few.\n \n Here's a short list...http://www.slatts.fsworld.co.uk/famous.htm", 
   {}, 
   316397, 
   null, 
   1215813000.0
  ], 
  [
   316705, 
   null, 
   "cake.or.death", 
   "Because alcohol is more easily measurable, but since blunts and joints take a while to smoke, you are less aware of how much you smoked.\n\n There has been lots of controversy about alcohol measurements and how difficult it actually is to keep a track of how much you drink in one night. This isn't helped by bars increasing alcohol measurements and doing deals on alcohol to encourage people to drink. \n \n http://women.timesonline.co.uk/tol/life_and_style/women/diet_and_fitness/article655857.ece\n \n You have to physically roll a joint, it's very easy to keep track of how much you're smoking. Much more then just having to go up to a bar and ordering your drinks over a long period of time.\n \n \nHow are yours common knowledge? Do you live in Europe or something? All the Europeans are a bunch of liberals.\n\n \n I live in Europe. Thanks for the generalisation. As for us all being a bunch of liberals, tell that to these guys...\n http://www.bnp.org.uk/", 
   {}, 
   313291, 
   null, 
   1216143960.0
  ], 
  [
   316740, 
   null, 
   "Ethmi", 
   "Thank you, TQ. You seem to think that \"common knowledge\" is a valid excuse for you not to show a source, yet you still ask for a source to prove Obama's \"guns and religion comment\".", 
   {}, 
   316705, 
   null, 
   1216161600.0
  ], 
  [
   316748, 
   null, 
   "T.Q", 
   "Thank you, TQ. You seem to think that \"common knowledge\" is a valid excuse for you not to show a source, yet you still ask for a source to prove Obama's \"guns and religion comment\".\n\n \n Oh for F's sake...\n \n I haven't posted on this topic in a month, and here you are trying to insult me again. Here's the difference:\n Studies on marijuana and it's dangers are well known and numerous, and you wouldn't read them if I posted any links anyways, as you've already stated you think they were done by \"potheads\". Whereas the Obama comments were ones I was not aware of, and I wanted to know what the subject under discussion was.\n \n And do not send me any more private messages like this:\n \nYou're Proving my Point \n \n --------------------------------------------------------------------------------\n \n Thank you, T.Q., for proving to me that you're a hypocrite. I have to back up Obama's comment which actually is common knowledge, but you seem to think that \"common knowledge\" is a valid excuse not to give a source for your posts on marijuana. This proves that you're a hypocrite. \n \n I wonder if this is proof of double standards?\n\n \n No, this is proof that you're a troll.", 
   {}, 
   316740, 
   null, 
   1216163760.0
  ], 
  [
   316750, 
   null, 
   "Fishbulb", 
   "Thank you, TQ. You seem to think that \"common knowledge\" is a valid excuse for you not to show a source, yet you still ask for a source to prove Obama's \"guns and religion comment\".\n\n \n Perhaps you should check your own history. Like when you posted this in a debate about gun control:\n \nStatistically, tobacco kills nine times as many people as all homicides and gun accidents combined, and alcohol kills almost twice as many as die in gun-related deaths. (src)\n Even if you count suicides (assuming every single one of them was with a gun, which they weren't), alcohol still kills more people. So, if your intention is to save lives, then why don't you ban this stuff? Could it have something to do with the fact that you enjoy alcohol and tobacco?\n\n \n Note the link, which is from drugwarfacts.org, and is sponsored by Common Sense for Drug Policy.\n \n \nCommon Sense for Drug Policy is a nonprofit 501(c)(3) organization dedicated to reforming drug policy and expanding harm reduction. CSDP disseminates factual information and comments on existing laws, policies and practices. CSDP provides advice and assistance to individuals and organizations and facilitates coalition building. CSDP supports syringe exchanges, the expansion of Methadone and Buprenorphine availability and other public health measures to reduce harm to users and restrict the spread of HIV / AIDS and Hepatitis C. CSDP advocates the regulation and control of marijuana in a manner similar to alcohol and subject to local option. CSDP favors decriminalizing the use of hard drugs and providing them only through prescription. CSDP also advocates clear federal guidelines for the practice of pain management so that physicians need not fear unwarranted law enforcement scrutiny of medical practices. (emphasis added, http://www.csdp.org/about.htm)\n\n Even just a quick glance shows that this site contains a great deal of information about drugs.\n \n I am wondering why you are asking for a source that shows that marijuana is relatively harmless, when you provided one yourself.", 
   {}, 
   316740, 
   null, 
   1216165140.0
  ], 
  [
   316771, 
   null, 
   "Shooterandproud", 
   "In my opinion, all this drug war is doing is wasting tax dollars and getting people killed.", 
   {}, 
   316750, 
   null, 
   1216174800.0
  ], 
  [
   316797, 
   null, 
   "Ethmi", 
   "Oh for F's sake...\n \n I haven't posted on this topic in a month, and here you are trying to insult me again. Here's the difference:\n Studies on marijuana and it's dangers are well known and numerous, and you wouldn't read them if I posted any links anyways, as you've already stated you think they were done by \"potheads\". Whereas the Obama comments were ones I was not aware of, and I wanted to know what the subject under discussion was.\n\n \n Well that figures. You claim victimhood rather than explaining why your so called \"facts\" are common knowledge, and yet I need a source to back up \"guns and religion\" which everyone except for you heard about.\n \n \nAnd do not send me any more private messages like this:\n \n \n No, this is proof that you're a troll.\n\n \n Oh, boohoo. Once again, you claim victimhood rather than addressing the point.", 
   {}, 
   316748, 
   null, 
   1216193160.0
  ], 
  [
   316798, 
   null, 
   "Ethmi", 
   "Perhaps you should check your own history. Like when you posted this in a debate about gun control:\n \n \n Note the link, which is from drugwarfacts.org, and is sponsored by Common Sense for Drug Policy.\n \n \n Even just a quick glance shows that this site contains a great deal of information about drugs.\n \n I am wondering why you are asking for a source that shows that marijuana is relatively harmless, when you provided one yourself.\n\n \n Because you are the one who is obligated to give me a source. I won't argue with myself.\n \n Also, considering how hardcore drugs were on the upper part of the list, and I stated earlier that 70% of drug addicts started on weed, well, you do the math.", 
   {}, 
   316750, 
   null, 
   1216193400.0
  ], 
  [
   316819, 
   null, 
   "DrNo", 
   "Because you are the one who is obligated to give me a source. I won't argue with myself.\n \n Also, considering how hardcore drugs were on the upper part of the list, and I stated earlier that 70% of drug addicts started on weed, well, you do the math.\n\n \n Assuming your statistic is correct (70% of drug addicts started on weed), it is completely meaningless and holds no implication against marijuana whatsoever. Until you can show that 70% of people who smoke weed become addicted to harder drugs, you are making an illogical association.\n \n What if you discovered that 70% of serial killers watched cartoons as a kid? Would you conclude that watching cartoons leads to serial killing?", 
   {}, 
   316798, 
   null, 
   1216215420.0
  ], 
  [
   316942, 
   null, 
   "MrWriteLA", 
   "Correlation does not imply causation.\n \n http://en.wikipedia.org/wiki/Correlation_does_not_imply_causation", 
   {}, 
   316819, 
   null, 
   1216348800.0
  ], 
  [
   319965, 
   null, 
   "EchoR1", 
   "yes because you can practically take any pills now and turn them into drugs so why not allow marijuana to become legal too?\n \n no because i dont think anyone should be under the influence of drugs.\n \n for medical purposes only because theyre may be something about it that could help cure something, who knows?", 
   {
    "post_info": {
     "post_title": "...well..."
    }
   }, 
   310514, 
   null, 
   1218490200.0
  ], 
  [
   319982, 
   null, 
   "chester", 
   "How many others have noticed the change in the beer ads on the radio & on TV?\n \n They used to say, \"Have a designated driver.\"\n \n Now they say merely, \"Don't drive drunk.\"\n \n Are the ads giving drivers \"permission\" to drink before doing so?\n \n Do the beer companies, such as the one from which Cindy McCain drew her vast fortune, plan on installing Breathalyzers in taverns?", 
   {}, 
   319965, 
   null, 
   1218500460.0
  ], 
  [
   330443, 
   null, 
   "Lurch907", 
   "I voted no. But not for the reasons usually given: gateway drug, makes people do bad things, etc. etc. I voted no because society doesn't need anymore drains on the system. I can only speak for Alaska but I imagine it holds true in most places, pot smokers are a drain on those who don't smoke pot. They can't get a decent job, in Alaska even McDonalds does drug screening, so most end up collecting wellfare or worse to support themselves. There are people out there that don't use pot simply because its illegal, I don't want to add them to the people that I have to carry through my taxes. I can also tell you that if pot was legalized none of the companies I know of would remove it from the list of disqualifying drugs they test for.\n \n Happy Halloween,\n Lurch\n \n ETA: I don't buy the medical use argument either. What few medical uses it has are far outweighed by its hazards and we have too many alternatives to make it worth it.", 
   {}, 
   310514, 
   null, 
   1225393560.0
  ], 
  [
   330495, 
   null, 
   "Charliegone", 
   "I used to think drugs were the evil of the world, but the reality is making it \"look\" bad is what makes people want to do drugs. For example, when alcohol was illegal many places opened up around the country selling the stuff and as a result gangs got filthy rich, there was massive corruption and crime went up, but when it was legalized again, it went down and also down went the \"major\" popularity it had. Also, I have searched and searched but there is only 1 case that I know of that in which a person has had an overdose of MJ and died, while there are tons of known incidents involving alcohol. IMO, legalizing MJ would probably benefit society more than it being illegal, simply because you'd get rid of the crime related with it, you'd be able to regulate it and you'd have less people, especially youngsters from wanting to \"try it out.\"", 
   {}, 
   330443, 
   null, 
   1225414680.0
  ], 
  [
   333093, 
   null, 
   "Joel_Henderson", 
   "As to whether \"we\" should legalize marijuana or any other drug:\n \n Ok, define \"we.\" The federal government can only exercise those powers delegated to it via the Constitution, with the rest remained to the states and their people RESPECTIVELY; and I don't see anything in the Constitution about drugs. In fact if you recall, they needed an Amendment to ban BOOZE, so there's no reason that they should be able to ban any other similar category of substance with a mere statute; rather, such power is entirely reserved under the 10th Amendment, to the governments and people of the individual STATES.\n \n Therefore the federal government simply usurped the power to regulate drugs-- and the Supreme Court concurred, trumping up some absurd perversion vis-a-vis the so-called \"necessary and proper commerce clause\" etc; it doesn't matter HOW they did it, since their word is FINAL, their authority absolute as long as the government will enforce it (and they never turn down power).\n \n It's no secret that an unchecked power is a slippery slope of endless attrition, expanding its powers and encroaching on freedoms-- until the end of freedom comes not with a shout but a whisper; and this is what the federal government is doing, seeping like a rising tide of water through every crevice in the bulwark of checks against it, until freedom drowns entirely. \n \n Anyone who thinks the Constitution foolproof, is proof of a fool; Madison stated explicitly in his Report on the Virginia Resolutions, that \"If the deliberate exercise of dangerous powers, palpably withheld by the Constitution, could not justify the parties to it in interposing even so far as to arrest the progress of the evil, and thereby to preserve the Constitution itself, as well as to provide for the safety of the parties to it, there would be an end to all relief from usurped power, and a direct subversion of the rights specified or recognized under all the state constitutions, as well as a plain denial of the fundamental principle on which our independence itself was declared.... However true, therefore, it may be, that the judicial department is, in all questions submitted to it by the forms of the Constitution, to decide in the last resort, this resort must necessarily be deemed the last in relation to the authorities of the other departments of the government; not in relation to the rights of the parties to the constitutional compact, from which the judicial, as well as the other departments, hold their delegated trusts. On any other hypothesis, the delegation of judicial power would annul the authority delegating it; and the concurrence of this department with the others in usurped powers, might subvert forever, and beyond the possible reach of any rightful remedy, the very Constitution which all were instituted to preserve.\"\n \n So in conclusion, the question is one of regulatory power; I would rather legalize marijuana, than outlaw freedom.\n If it's going to be outlawed, it must be by STATE statute-- NOT federal; the ONLY way the federal government can outlaw it, is by AMENDMENT-- and that worked SO well with Prohibition.", 
   {}, 
   330495, 
   null, 
   1226904420.0
  ], 
  [
   334518, 
   null, 
   "Darn Republican", 
   "No, we shouldn't", 
   {}, 
   310614, 
   null, 
   1227812640.0
  ], 
  [
   334520, 
   null, 
   "Joel_Henderson", 
   "No, we shouldn't\n\n \n Constitutionally, it's up to the states... but then, so is abortion, so it's tit for tat.", 
   {}, 
   334518, 
   null, 
   1227813000.0
  ], 
  [
   346151, 
   null, 
   "Killer Hawk", 
   "Drugs are America's enemy number one.I stronly support all drugs prohibition inluding this strinky marijuana that ruins the minds of our youth.", 
   {}, 
   334520, 
   null, 
   1236323400.0
  ], 
  [
   346159, 
   null, 
   "snakespit", 
   "Drugs are America's enemy number one.I stronly support all drugs prohibition inluding this strinky marijuana that ruins the minds of our youth.\n\n \n But I like good wine and the occasional glass of tequila. Why exactly do you want to take them away from me?", 
   {}, 
   346151, 
   null, 
   1236327000.0
  ], 
  [
   346160, 
   null, 
   "Killer Hawk", 
   "But I like good wine and the occasional glass of tequila. Why exactly do you want to take them away from me?\n\n I do not lobby for the the prohibition of alcohol.I support the dope prohibiton for things like marijuana,cocaine,other life killers.I drink in moderation.", 
   {}, 
   346159, 
   null, 
   1236328620.0
  ], 
  [
   346164, 
   null, 
   "snakespit", 
   "I do not lobby for the the prohibition of alcohol.I support the dope prohibiton for things like marijuana,cocaine,other life killers.I drink in moderation.\n\n \n But you said all drugs. \n \n \nDrugs are America's enemy number one.I stronly support all drugs prohibition inluding this strinky marijuana that ruins the minds of our youth. \n\n See? All drugs. \n \n Got news for you, alcohol is a drug (and argueably as harmful if not more harmful than marijuana). Why do you get to pick and choose which ones should be allowed and which ones should not be allowed? Suppose I smoke marijuana in moderation?", 
   {
    "post_info": {
     "post_title": "Hypocrisy at it's finest!"
    }
   }, 
   346160, 
   null, 
   1236331140.0
  ], 
  [
   346182, 
   null, 
   "Killer Hawk", 
   "But you said all drugs. \n \n \n See? All drugs. \n \n Got news for you, alcohol is a drug (and argueably as harmful if not more harmful than marijuana). Why do you get to pick and choose which ones should be allowed and which ones should not be allowed? Suppose I smoke marijuana in moderation?\n\n Alcohol is not the drug that we talk.", 
   {}, 
   346164, 
   null, 
   1236360660.0
  ], 
  [
   346184, 
   null, 
   "thelmoose", 
   "Why is it the freakazoid chistians have such grandiose names. Check out killer hawks profile page picture a la Fred Phelps. Hey admin, is \"god hates fags\" allowed here? here", 
   {}, 
   346182, 
   null, 
   1236361140.0
  ], 
  [
   346186, 
   null, 
   "Killer Hawk", 
   "Why is it the freakazoid chistians have such grandiose names. Check out killer hawks profile page picture a la Fred Phelps. Hey admin, is \"god hates fags\" allowed here? here\n\n I just reply to admin that I am going to ban myself from this forum.I am not hostile guy and I never wish homos death.This forum is politically correct and I can't be a PC Christian.PC Christians go to Hell.I will return back to my Argue With Everyone Political Forums forum where 1st Amendment is respected,unless users post threats.I never do such evil things as threatening anyone.I respect all heathen.", 
   {}, 
   346184, 
   null, 
   1236362400.0
  ], 
  [
   346198, 
   null, 
   "jitobear", 
   "\"Go to heaven for the climate, hell for the company.\" ~ Mark Twain", 
   {}, 
   346186, 
   null, 
   1236367260.0
  ], 
  [
   346202, 
   null, 
   "snakespit", 
   "I just reply to admin that I am going to ban myself from this forum.I am not hostile guy and I never wish homos death.This forum is politically correct and I can't be a PC Christian.PC Christians go to Hell.I will return back to my Argue With Everyone Political Forums forum where 1st Amendment is respected,unless users post threats.I never do such evil things as threatening anyone.I respect all heathen.\n\n \n Don't let the door hit you in the fleshy part below your bible belt on the way out.", 
   {}, 
   346186, 
   null, 
   1236369660.0
  ], 
  [
   346318, 
   null, 
   "thelmoose", 
   "Killer removed the offensive image on his profile page immediately after I called him on it while at the same time proclaiming he's not inclined to pull punches.", 
   {}, 
   346198, 
   null, 
   1236443400.0
  ], 
  [
   346702, 
   null, 
   "trebor", 
   "I do not lobby for the the prohibition of alcohol.I support the dope prohibiton for things like marijuana,cocaine,other life killers.I drink in moderation.\n\n \n \n When compared to alcohol, how is marijuana a 'life killer'?", 
   {}, 
   346160, 
   null, 
   1236712500.0
  ], 
  [
   346818, 
   null, 
   "snakespit", 
   "When compared to alcohol, how is marijuana a 'life killer'?\n\n \n I guess it depends on the twisted mind making the comparison. It helps to have perspective and intelligence, which clearly some people lack.", 
   {}, 
   346702, 
   null, 
   1236815460.0
  ], 
  [
   347291, 
   null, 
   "foundit66", 
   "Family Guy had an interesting comparison on the issue...\n \n If we outlaw \"marijuana\", is there any rational justification which prevents people from outlawing \"trans-fats\" as well?\n People who try to restrict things should tread carefully, cause while they come for the item you don't like today, they could go after something you DO like tomorrow...", 
   {}, 
   346818, 
   null, 
   1237325460.0
  ], 
  [
   347342, 
   null, 
   "Killer Hawk", 
   "Keep all drugs illegal.", 
   {}, 
   347291, 
   null, 
   1237397400.0
  ], 
  [
   347356, 
   null, 
   "snakespit", 
   "Keep all drugs illegal.\n\n As soon as you tell me that you are giving up all alcohol, I might be remotely interested in hearing something you have to say.", 
   {}, 
   347342, 
   null, 
   1237401960.0
  ], 
  [
   347365, 
   null, 
   "simone", 
   "Keep all drugs illegal.\n\n Oh please God! NOOOOOOOOOOOOOOOOO!\n \n I have to have caffeine!\n \n Caffeine!!!!!\n \n Caffeine!!!\n \n I can't live without caffeine!", 
   {}, 
   347342, 
   null, 
   1237407300.0
  ], 
  [
   347368, 
   null, 
   "T.Q", 
   "Keep all drugs illegal.\n\n \n Weren't you leaving?", 
   {}, 
   347342, 
   null, 
   1237408680.0
  ], 
  [
   347480, 
   null, 
   "Killer Hawk", 
   "Weren't you leaving?\n\n \n I decided to stay as long I have freedom of speech to tell people the truth about run away America that we have today.\n Dealing with dope as marijuana.It is a degrading drug that kills sanity.It must stay on eternal prohibition as well as meth,cocaine,heroine,and other life killing dopes.", 
   {}, 
   347368, 
   null, 
   1237485240.0
  ], 
  [
   347515, 
   null, 
   "T.Q", 
   "I decided to stay as long I have freedom of speech to tell people the truth about run away America that we have today.\n Dealing with dope as marijuana.It is a degrading drug that kills sanity.It must stay on eternal prohibition as well as meth,cocaine,heroine,and other life killing dopes.\n\n \n Unfortunately, we can't ban intellect killing dopes...", 
   {}, 
   347480, 
   null, 
   1237496220.0
  ], 
  [
   347520, 
   null, 
   "snakespit", 
   "I decided to stay as long I have freedom of speech to tell people the truth about run away America that we have today.\n Dealing with dope as marijuana.It is a degrading drug that kills sanity.It must stay on eternal prohibition as well as meth,cocaine,heroine,and other life killing dopes.\n\n \n Eternal prohibition...that's 1 step past double-secret prohibition for those keeping track.\n \n Could you define the term \"kills sanity\"? And you have statistics to back that up, correct?", 
   {}, 
   347480, 
   null, 
   1237498080.0
  ], 
  [
   350749, 
   null, 
   "luv2icesk8t", 
   "Ok just because some people can be stupid when it comes to marijuana not all people are....now i'm not saying that it is a good thing but just give it a chance.", 
   {}, 
   310514, 
   null, 
   1240494540.0
  ], 
  [
   356731, 
   null, 
   "MarielB", 
   "prohibition didn't work.\n \n we waste lots of tax dollars locking up pot heads.\n \n we could be making tax revenue from controlled sales.\n \n \"tobacco states\" could grow something easier, (less harmful to the environment) and less deadly than tobacco.\n \n hemp as other purposes, like making paper (save some trees in the bargain).\n \n \n marijuana, by itself, does less harm then alcohol, or cigarettes.", 
   {
    "post_info": {
     "post_title": "legalizing marijuana"
    }
   }, 
   350749, 
   null, 
   1244488500.0
  ], 
  [
   356743, 
   null, 
   "CUNxTime", 
   "prohibition didn't work.\n \n we waste lots of tax dollars locking up pot heads.\n \n we could be making tax revenue from controlled sales.\n \n \"tobacco states\" could grow something easier, (less harmful to the environment) and less deadly than tobacco.\n \n hemp as other purposes, like making paper (save some trees in the bargain).\n \n \n marijuana, by itself, does less harm then alcohol, or cigarettes.\n\n \n Q for T\n \n Not much I can add to that!", 
   {}, 
   356731, 
   null, 
   1244490660.0
  ], 
  [
   356750, 
   null, 
   "Accipiter", 
   "I decided to stay as long I have freedom of speech to tell people the truth about run away America that we have today.\n Dealing with dope as marijuana.It is a degrading drug that kills sanity.It must stay on eternal prohibition as well as meth,cocaine,heroine,and other life killing dopes.\n\n \n Do you have any personal experience with marijuana which allows you to know this or are you just making stuff up?", 
   {}, 
   347480, 
   null, 
   1244492100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Should We Legalize Marijuana?", 
  "url": "http://www.4forums.com/political/crime-debates/11201-should-we-legalize-marijuana.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 11201, 
  "discussion_files": [
   [
    "7567.html", 
    "http://www.4forums.com/political/crime-debates/11201-should-we-legalize-marijuana-print.html"
   ], 
   [
    "7568.html", 
    "http://www.4forums.com/political/crime-debates/11201-should-we-legalize-marijuana-6-print.html"
   ], 
   [
    "7569.html", 
    "http://www.4forums.com/political/crime-debates/11201-should-we-legalize-marijuana-4-print.html"
   ], 
   [
    "7570.html", 
    "http://www.4forums.com/political/crime-debates/11201-should-we-legalize-marijuana-5-print.html"
   ], 
   [
    "7571.html", 
    "http://www.4forums.com/political/crime-debates/11201-should-we-legalize-marijuana-3-print.html"
   ], 
   [
    "7572.html", 
    "http://www.4forums.com/political/crime-debates/11201-should-we-legalize-marijuana-2-print.html"
   ]
  ], 
  "identifier": 11201
 }
]