[
 [
  [
   310816, 
   null, 
   "Undeterred", 
   "Well a beauty parlour opened in my street a year ago.\n \n And for men's and women's haircuts it's the only place to go.\n \n And they do fantastic manicures, and pedicures as well,\n \n But they just don't speak much English there, as far as I can tell.\n \n \n So to let them know about whatever services you need,\n \n You just point up to the price list, and that gets them up to speed.\n \n 'Cos it's posted in their native tongue, with English written too,\n \n But the person who translated didn't really have a clue. \n \n \n See, a pedicure's a \"foot job\", and to get a manicure,\n \n You just ask them for a \"hand job\" and they'll give you one for sure.\n \n But the biggest trade the salon does is cutting people's hair,\n \n So you indicate the \"head job\", and you'll get a great one there.\n \n \n Yes, the head jobs that they give me are the best I've ever had,\n \n And I even tried a foot job, and I found it wasn't bad.\n \n Even though I found the whole idea at first a bit exotic,\n \n It was really quite relaxing, and a little bit erotic!\n \n \n Now I don't expose that part of my anatomy that much,\n \n But the girl was very pretty, with a really gentle touch.\n \n And before I knew it, I was so relaxed I was away.\n \n And I'm now more confident to show my feet off ev'ry day.\n \n \n When I can, I get a hand job. It's an absolute delight.\n \n But I have to do my own when I find money's pretty tight.\n \n And I have to say, I'm pretty awesome, when it comes down to it \n \n But it's so much more enjoyable when someone else can do it.\n \n \n When I find I need a head job, it's the only place to go. \n \n And I don't need an appointment, I'm a regular you know.\n \n Even when they're really busy, they just take it on the chin.\n \n I just see my favourite lady and she says \"I'll fit you in.\"\n \n \n So by now you know I like the parlour. I'm its biggest fan.\n \n But a little while ago they went and hired themselves a man.\n \n And I went down for a head job but my favourite girl was busy,\n \n So they said \"Give Steve a try, he's great at head jobs!\" - I said \"Is he?\"\n \n \n Well the next thing that I knew, I was reclining in a chair,\n \n And the guy could give a head job - yes he had a certain flair.\n \n Then he said, \"I see you have more than a little bit of stubble,\n \n I could fix that right up for you sir, it really is no trouble.\"\n \n \n So he got a cut-throat razor and some lather on his hands,\n \n And he said \"There are some details that a feller understands,\n \n That these ladies try to master, but they never really get.\n \n By the way, I notice that your hair is still a little wet.\"\n \n \n \"How about a little blow job, I can throw it in for free.\"\n \n \"Steve,\" I said, \"you've done enough to earn you double of your fee.\"\n \n And he had. He'd done some stuff the girls had never offered to me.\n \n First a really top rate head job, then he shaved me, then he blew me.\n \n \n And a certain misconception was dispelled for me that day,\n \n 'Cos I always thought that guys within that industry were gay.\n \n So when Steve said he was married I said \"Wow that's a surprise.\"\n \n He said \"Not at all. A lot of blokes get head jobs from straight guys!\"\n \n \n So go down and get a hand job, or a head job if you need it.\n \n And you'll figure out the price list 'cos I've told you how to read it.\n \n Come on down and see the girls and Steve, they're really very nice.\n \n Boy, I'd get a head job twice a day - if I could do it twice!", 
   {
    "post_info": {
     "post_title": "Hairstylee Long Time"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1210576980.0
  ], 
  [
   310826, 
   null, 
   "snakespit", 
   "That was rather amusing. First thing to make me laugh all night.", 
   {}, 
   310816, 
   null, 
   1210595040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hairstylee Long Time", 
  "url": "http://www.4forums.com/political/writings/11213-hairstylee-long-time.html", 
  "breadcrumbs": [
   "Writings"
  ], 
  "id_number": 11213, 
  "discussion_files": [
   [
    "24538.html", 
    "http://www.4forums.com/political/writings/11213-hairstylee-long-time-print.html"
   ]
  ], 
  "identifier": 11213
 }
]