[
 [
  [
   310741, 
   null, 
   "marc9000", 
   "I live in northern Ky, an area where three states converge. Ohio, Kentucky, and Indiana. A pretty large international airport nearby, a reasonable amount of business activity. Of the three states, only Indiana currently permits casino gambling in a limited way. \n \n Years ago, I was involved in a little face to face chat with a few other 40-something men. One of them owned a small (Northern Ky.) courier service, about 10 employees. He had 3 or 4 \"box trucks\" (straight trucks with 20' van bodies) and a couple of small cargo vans. In addition, he had a couple of small passenger vans and one full size coach (bus) Two businesses in one - general courier work during regular business hours, and bus people across the river to Indiana's casino boats on some evenings and weekends. Both done roughly the same way, some spur of the moment requests, some one or two day notice, with little long term scheduling. During the conversation about what he does, I asked him which of the two activities was the best - which one made him the most money. Though he didn't seem interested in going into detail, and the conversation took a pretty quick turn, I've never forgotten the first words he said with a shrug, \"the buses are a fast buck\". \n \n So what he had was a transportation business, with two completely different types of transportation. One product and service oriented, and one entertainment oriented. The way he said the buses were a fast buck told me that they made him the most money at the moment, but he didn't seem to take them as seriously as he did the courier work. My guess is that at least partially by \"fast buck\", he meant easy in, easy out, and unstable, (no real accomplishment?) \n \n Now, lets visualize a group of young people in their 20's, friends looking for something to do together on a weekend, a little fellowship. One of them has a newly purchased house, and would like to do some improvements, pour some sidewalks, build a storage shed in the backyard, something like that. The extent of the local government permits and inspections required for something like this vary from location to location across the U.S. but no doubt he's going to have to get involved with government regulation in some small way, and it could end up causing some inconvenience. The alternative method of fellowship would be to forget sidewalks and sheds, and simply load the SUV with a few half barrels of beer, and have a party. Seldom if ever are government regulation or permits required for parties.\n \n So if money is the goal of the transportation guy above, and fellowship is the goal of the young people above, which are the paths of least resistance, and which accomplish the most? The obvious answers are that the courier service and sidewalk/shed work accomplish something long term, while the casino buses and beer party only accomplish something short term. The courier service and sidewalk shed work require planning, investment, and risk of loss more than the buses/party. \n \n There have been no new oil refineries built in the U.S. in several decades, yet there have been many new casinos, sports arenas, auto race tracks, etc. built recently. Can most, if not all businesses in the US be classified as being \"fast buck\" vs non fast buck? Is the U.S. seeing more and more fast buck businesses appear simply because it's the path of least resistance for investors/businessmen? Is it a good thing? \n \n I'd like to see others opinions of what is, or is not, a \"fast buck\" business, and how start-ups have changed in the U.S. in the last 50 or 100 years. Is it strictly a long term accomplishment vs short term accomplishment thing, or is morality involved?", 
   {
    "post_info": {
     "post_title": "Fast buck business"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1210462320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Fast buck business", 
  "url": "http://www.4forums.com/political/economics-debates/11212-fast-buck-business.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 11212, 
  "discussion_files": [
   [
    "28615.html", 
    "http://www.4forums.com/political/economics-debates/11212-fast-buck-business-print.html"
   ]
  ], 
  "identifier": 11212
 }
]