[
 [
  [
   311070, 
   null, 
   "T.Q", 
   "Why is McCain getting a free pass when his \"spiritual advisor\" says stuff like this?\n \n http://www.talk2action.org/story/2008/5/15/141520/281", 
   {
    "post_info": {
     "post_title": "So why isn't this getting any play?"
    }
   }, 
   null, 
   null, 
   1210982160.0
  ], 
  [
   311073, 
   null, 
   "Archangel", 
   "Why is McCain getting a free pass when his \"spiritual advisor\" says stuff like this?\n \n http://www.talk2action.org/story/2008/5/15/141520/281\n\n \n Because Hagee gave Mcain a political endorsement, but wasn't in any way his spiritual advisor as you suggest he is or was. Mcain never attended his church for decades or ever claimed him as his spiritual mentor as Obama did with Wright. And Obama did go to Wrights church for 20 years, was married by him and Wright baptized his children. None of which was the case with Mcain and Hagee.\n \n Mcain is a religious hypocrite who hopes to garner conservative christian support with endorsements from men like Hagee, but he in fact has no more personal faith in God than you do, imo.\n \n And I would love for you to point out exactly what Hagee said in that video that offends you so much, if you can define it for us.", 
   {}, 
   311070, 
   null, 
   1210983900.0
  ], 
  [
   311079, 
   null, 
   "snakespit", 
   "I would like to actually hear or see the original transcript of that sermon before I would be willing to believe that there was not some creative cut and paste work done. \n \n And the bigger point...the man endorsed him for president. Big deal! Hanoi Jane Fonda endorsed Barack Obama...she has a rather sordid past as well. Americans need to keep their eye on the ball here. Who cares who gets who's endorsement? Focus on what the candidates are saying...so we can make an informed choice for our next president and hold them accountable for their words later.", 
   {}, 
   311073, 
   null, 
   1210992300.0
  ], 
  [
   311081, 
   null, 
   "Archangel", 
   "I would like to actually hear or see the original transcript of that sermon before I would be willing to believe that there was not some creative cut and paste work done. \n \n And the bigger point...the man endorsed him for president. Big deal! Hanoi Jane Fonda endorsed Barack Obama...she has a rather sordid past as well. Americans need to keep their eye on the ball here. Who cares who gets who's endorsement? Focus on what the candidates are saying...so we can make an informed choice for our next president and hold them accountable for their words later.\n\n \n Even if we take that video at face value though, all Hagee is saying in it is that Jeremiah prophesied that the Jews who responded to the call to return to Israel, avoided getting caught up in the Holocaust while those who ignored the call ended up dying in it. He then went on to say that Israel is physically alive now but according to Gods promise to Abraham, until the children receive Messiah, they wont be spiritually alive. But that will surely happen before the end and Hagee was acknowledging that. TQ is just too spiritually blind to understand what was really being said so his anti-christian bigotry causes him to judge and condemn every aspect of what is being said.", 
   {}, 
   311079, 
   null, 
   1210993200.0
  ], 
  [
   311097, 
   null, 
   "T.Q", 
   "TQ is just too spiritually blind to understand what was really being said so his anti-christian bigotry causes him to judge and condemn every aspect of what is being said.\n\n \n \n \n The point I was making was pretty much the point made by Snakespit-Who cares what was said by who about the candidates-with an addendum.\n It seems that Obama is getting a lot more of these types of things being attached to him, which distracts from him actually talking about the issues. McCain seems to be getting a free pass from the media. \n \n It's time for the media to start reporting the news again, instead of trying to make the news.\n \n *If AA is free to run willy-nilly insulting people, I see no reason why others shouldn't be allowed the same privilege. Please show me anywhere in this thread where I said anything about Christianity. We've got a 10+ page thread about how anti-American Obama's family preacher is, so I wanted to know why something like this isn't getting at least some press. There seems to be a double standard as far as the media is concerned, and that was the point I was addressing here. If AA wants to make this a ####### match, go hard, but I won't be taking part in it.", 
   {}, 
   311081, 
   null, 
   1210997220.0
  ], 
  [
   311098, 
   null, 
   "Zardoz", 
   "Because Hagee gave Mcain a political endorsement, but wasn't in any way his spiritual advisor as you suggest he is or was. Mcain never attended his church for decades or ever claimed him as his spiritual mentor as Obama did with Wright. And Obama did go to Wrights church for 20 years, was married by him and Wright baptized his children. None of which was the case with Mcain and Hagee.\n \n Mcain is a religious hypocrite who hopes to garner conservative christian support with endorsements from men like Hagee, but he in fact has no more personal faith in God than you do, imo.\n \n And I would love for you to point out exactly what Hagee said in that video that offends you so much, if you can define it for us.\n\n \n Yep.\n \n McCain loathed the fundy evangelical not too long ago.\n Now, he's just pandering to them for votes. And not denouncing Hagee pretty much proves this.\n \n And, Hagee is the epitomy of human filth.\n I've listened to hours of his sermonizing and read plenty of his material.\n His goal is armageddon. And he believes, as a dominionist, that humans were put here to enact God's will. It's up to man to make conditions right to breing about the 2nd coming. He ties in well with the Word of Faithers who deny your Gods soverignity Archy, placing all things in the hand of man and saying it has 'Gods stamp of approval'.\n His schtick is the middle east of course, focusing on Israel (he who blesses Israel and it's people will be blessed by God). Assisting those poor damned fools because 'bible says so'.\n Reinterpreting prophesies over and over regarding the end times to put the scare in the followers to get them to feed his ministries.\n Eagerly desiring to have a puppet with a finger on the big red button...\n \n \n Nah, Hagee is just and opprotunistic demagogue.\n And McCain is too yellow to #### off the Christian right.\n \n Obama and Wright had a personal relationship.\n Not exactly the same thing.", 
   {}, 
   311073, 
   null, 
   1210998000.0
  ], 
  [
   311099, 
   null, 
   "Archangel", 
   "I answered every question you ask here on my first post on this thread schmuck. So I reposted it below for you. This time, actually read it, nkaaaay? :) Now, you weren't making the same point as snakspit in any way, but you were attacking Mcain as if Hagee was his spiritual advisor, just as Wright was Obamas. See, I quote you: [T.Q] Why is McCain getting a free pass when his \"spiritual advisor\" says stuff like this? And you don't have to say anything directly about christianity in order to project your anti-christian bigotry which this baiting thread is just another example of. Sorry if my pointing that FACT out to you so offends your sensibilities.\n \n \nBite me, putz*\n \n The point I was making was pretty much the point made by Snakespit-Who cares what was said by who about the candidates-with an addendum.\n It seems that Obama is getting a lot more of these types of things being attached to him, which distracts from him actually talking about the issues. McCain seems to be getting a free pass from the media. \n \n It's time for the media to start reporting the news again, instead of trying to make the news.\n \n *If AA is free to run willy-nilly insulting people, I see no reason why others shouldn't be allowed the same privilege. Please show me anywhere in this thread where I said anything about Christianity. We've got a 10+ page thread about how anti-American Obama's family preacher is, so I wanted to know why something like this isn't getting at least some press. There seems to be a double standard as far as the media is concerned, and that was the point I was addressing here. If AA wants to make this a ####### match, go hard, but I won't be taking part in it.\n\n \n \nBecause Hagee gave Mcain a political endorsement, but wasn't in any way his spiritual advisor as you suggest he is or was. Mcain never attended his church for decades or ever claimed him as his spiritual mentor as Obama did with Wright. And Obama did go to Wrights church for 20 years, was married by him and Wright baptized his children. None of which was the case with Mcain and Hagee.\n \n Mcain is a religious hypocrite who hopes to garner conservative christian support with endorsements from men like Hagee, but he in fact has no more personal faith in God than you do, imo.\n \n And I would love for you to point out exactly what Hagee said in that video that offends you so much, if you can define it for us.\n", 
   {}, 
   311097, 
   null, 
   1210998360.0
  ], 
  [
   311109, 
   null, 
   "Bassman", 
   "If there was ever a need to close a thread, it's here. Play nice, boys.", 
   {}, 
   311099, 
   null, 
   1211033340.0
  ], 
  [
   311182, 
   null, 
   "Matthew S", 
   "Why is McCain getting a free pass when his \"spiritual advisor\" says stuff like this?\n \n http://www.talk2action.org/story/2008/5/15/141520/281\n\n \n Because, if you hadn't noticed, republicans are expected to have religious nutcase, christianist support.", 
   {}, 
   311070, 
   null, 
   1211119860.0
  ], 
  [
   311663, 
   null, 
   "antonia", 
   "I saw a yahoo news article about this yesterday. It said McCain repudiated everything Hagee said and that he rejected his endorsement. So he's still a step ahead in the American political game there to Obama. Whichever candidate you do or don't support.\n \n But maybe this a sign. They were meant for each other. They both have at least a few ministers to throw under the bus. And the Democratic leadership, hand in hand with the media, seems to be dealing more in signs these days, than logic.\n \n Hope you will all get a chance to see the election data (projected winners, McCain/Obama, McCain/Clinton) I posted on the next thread. I would like to know why that is not getting any play in the Democratic Party.", 
   {}, 
   311182, 
   null, 
   1211554500.0
  ], 
  [
   311773, 
   null, 
   "daewoo", 
   "Yep.\n \n McCain loathed the fundy evangelical not too long ago.\n Now, he's just pandering to them for votes. And not denouncing Hagee pretty much proves this.\n\n \n As was Bush. You would think that the religious right would wake up one of these days and stop supporting people who are very obviously and clearly just using them.", 
   {}, 
   311098, 
   null, 
   1211632740.0
  ], 
  [
   311774, 
   null, 
   "Zardoz", 
   "As was Bush. You would think that the religious right would wake up one of these days and stop supporting people who are very obviously and clearly just using them.\n\n \n I remember some time back covering news interviews of the guy who was in charge of Bush's 'faith based initiative' thingy in the Whitehouse coming out with a book on how most in Bush's admin. were very hateful of the evangelicals even though it was them who got them into office.\n \n *gets off lazy butt and does a quick search*\n \n Ahh, here's one article on it.\n \n I don't really know what Bush's attitude towards the fundies is (I'd say sympathetic or better personally) but, I'd find it hard to believe that most of the rest in his admin. wouldn't simply turn their nose up on them.\n \n Seriously, I can see Bush writhing on the floor and speaking in gibberish like a Pentecostal...he has done drugs in his past like many in that faith, But, seeing Karl Rove do the same...\n Well, I can see Rove as a twisted leader of such a sect of sheeple.\n \"Sacrafice a baby, yer gawd demands it! MuAhahahahhaha. Oh, and if any of you amongst us still have two coppers to rub togther in your pockets, you're stealing from gawd AND will surely die! Here, let me quote bible to you to show you what I mean! So gimme, gimme, gimme...Halliburtonya!", 
   {}, 
   311773, 
   null, 
   1211645160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  So why isn't this getting any play?", 
  "url": "http://www.4forums.com/political/elections-debates/11228-so-why-isnt-getting-any-play.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11228, 
  "discussion_files": [
   [
    "13450.html", 
    "http://www.4forums.com/political/elections-debates/11228-so-why-isnt-getting-any-play-print.html"
   ]
  ], 
  "identifier": 11228
 }
]