[
 [
  [
   312413, 
   null, 
   "isly ilwott", 
   "Amazing it is to me that we are still discovering heretofore-unknown species in the forest canopies. It was recently that I thought I heard a scientist say that it is estimated that there are 20 times the number of distinct species of living things yet undiscovered in the canopies as there are known to be there. Finding them and naming them will continue as long as we explore the canopy. Access to the canopy has been advanced to the point of outdoor luxury and when serviced occasionally by helicopters, a visit can be prolonged to seasonal limits and beyond.\n \n There is little I think more exciting than to know that you are singly viewing and hopefully photographing for the first time an animal or plant that has never been seen by humans in any anthology of living or once living things. To know that you may be able to name it is a formidable thought, more so than choosing a name for a newborn registered canine. \n \n By itself, the realization of being where few or no humans have been before seems worth a trip to the canopy...more so than to the North Pole. For those of you that can afford the pleasure, I suggest you do it once before you die...and don't forget to tip your waiters.", 
   {
    "post_info": {
     "post_title": "A visit to the canopy..."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1212417300.0
  ], 
  [
   312470, 
   null, 
   "Symbiote", 
   "I don't get it, is this thread some sort of pun on the word canape?", 
   {}, 
   312413, 
   null, 
   1212496200.0
  ], 
  [
   312472, 
   null, 
   "Archangel", 
   "I don't get it, is this thread some sort of pun on the word canape?\n\n \n Not at all. Your confusion is confusing to me.\n canopy |&#712;kan&#601;p&#275;|\n noun ( pl. -pies)\n an ornamental cloth covering hung or held up over something, esp. a throne or bed.\n \u0095 figurative something hanging or perceived as hanging over a person or scene : the canopy of twinkling stars.\n \u0095 Architecture a rooflike projection or shelter : they mounted the station steps under the concrete canopy.\n \u0095 the transparent plastic or glass cover of an aircraft's cockpit.\n \u0095 the expanding, umbrellalike part of a parachute, made of silk or nylon.\n \u0095 [in sing. ] the uppermost trees or branches of the trees in a forest, forming a more or less continuous layer of foliage : monkeys spend hours every day sitting high in the canopy.\n verb ( -pies, -pied) [ trans. ] [usu. as adj. ] ( canopied)\n cover or provide with a canopy : a canopied bed | the river was canopied by overhanging trees.\n ORIGIN late Middle English : from medieval Latin canopeum 'ceremonial canopy,' alteration of Latin conopeum 'mosquito net over a bed,' from Greek k&#333;n&#333;peion 'couch with mosquito curtains,' from k&#333;n&#333;ps 'mosquito.'\n \n Thesaurus \n canopy\n noun\n the canopy gave us some relief from the sun awning, shade, sunshade; marquee; chuppah.\n ", 
   {
    "unicode_changes_made": true
   }, 
   312470, 
   null, 
   1212497100.0
  ], 
  [
   312488, 
   null, 
   "isly ilwott", 
   "I don't get it, is this thread some sort of pun on the word canape?\nNo pun at all. Just a lot of fun if you can afford to go or have someone pay you to go and visit them. \n \n \n \n \n http://rainforests.mongabay.com/0401.htm\n \n An estimated 70-90 percent of life in the rainforest exists in the trees, above the shaded forest floor. Primary tropical rainforest is vertically divided into at least five layers: the overstory, the canopy, the understory, the shrub layer, and the forest floor. Each layer has its own unique plant and animal species interacting with the ecosystem around them. The overstory refers to the crowns of emergent trees which soar 20-100 feet above the rest of the canopy. The canopy is the dense ceiling of closely spaced trees and their branches, while the understory is the term for more widely spaced, smaller tree species and juvenile individuals that form a broken layer below the canopy. The shrub layer is characterized by shrubby species and juvenile trees that grow only 5-20 feet off the forest floor. The forest floor is the ground layer of the forest made up of the trunks of trees, fungus, and low-growing vegetation. These layers are not always distinct and can vary from forest to forest, but serve as a good model of the vegetative and mechanical structures of the forest. \n \n The overstory is characterized by scattered emergent trees that tower above the rest of the canopy, the tops of some species exceeding 210 feet (65 m). Below the overstory trees, the canopy stretches for vast distances, seemingly unbroken when observed from an airplane. However, despite overlapping tree branches, canopy trees rarely interlock or even touch. Instead they are separated from one another by a few feet. Why the branches of these trees do not touch is still a mystery, but it is thought that it might serve as protection from infestations from tree-eating caterpillars and tree diseases like leaf blight. To survive, canopy dwellers must have the ability to negotiate these gaps by climbing, leaping, gliding, or flying. \n \n The billions of leaves of the canopy, acting as miniature solar panels, provide the source of power for the forest by converting sunlight to energy through photosynthesis. Photosynthesis is the process by which plants convert atmospheric carbon dioxide and water into oxygen and simple sugars. Since the rate of photosynthesis of canopy trees is so high, these plants have a higher yield of fruits, seeds, flowers, and leaves which attract and support a wide diversity of animal life. Besides attracting a broad array of wildlife, the canopy plays an important role in regulating regional and global climate because it is the principal site of the interchange of heat, water vapor, and atmospheric gases. In addition to collecting solar energy and regulating the climate, the canopy shields the understory from harsh and intense sunlight, drying winds, and heavy rainfall, and retains the moisture of the forest below. Thus the forest interior is a far less volatile environment than the upper parts of the canopy ceiling. The interior region is protected from the extremes of the canopy: temperature fluctuations, damaging solar radiation, and strong winds. Light levels are diffuse and subdued, the humidity is higher and more constant, and there is very little direct sunlight in the lower canopy.\n \n \n http://www.dreamforestcanopy.com/\n \n Feel the rush as you soar high through the rain forest on the most thrilling canopy zip lines in the central pacific!! A wild and fun adventure you will never forget!!\n Our canopy is fully inside the jungle, located just minutes from Manuel Antonio in the beautiful and mystical mountains, maximizing your fun time on the zip lines.\n Learn about and enjoy our amazing wild life and vegetation, including monkeys, tucans, unbelievably huge colorful butterflies, unique frogs, two and three-toed sloths, breathtaking flowers and other animals and trees you can only dream about. All at the home of Dream Forest Canopy.\n \n \n \n http://en.wikipedia.org/wiki/Canopy_(forest)\n \n The canopy is one of the uppermost levels of a forest, below the emergent layer, formed by the tree crowns. Canopy trees refers to the trees in a forest which form the canopy. The uneven layers of the canopy is formed by both dominant and co-dominant trees. Emergents - of which there are typically one or two per hecatre - reach above the canopy.\n The canopy of a rainforest is typically 10m thick, and intercepts around 95% of sunlight. With an abundance of water and a near ideal temperature, light and minerals are the two restricting factors on a tree's growth. Plants grow rapidly to reach the canopy, but have no need to grow any taller after reaching the light.\n The canopy is home to a unique flora and fauna not found in other layers of a forest.\n The term has also been adopted by the permaculture and forest gardening community, who use the distinction between canopy and secondary trees in their seven layer design system.\n The canopy of an individual tree refers to the extent of the outer layer of a trees leaves. Shade trees normally have a dense canopy blocking out the light from lower growing plants. The Leaf Area Index can be used to measure the density of the canopy.\n Canopy is also the name given to the upper layer of trees (mostly in tropical rainforests) which cover the forest's floor and protect it from strong winds and storms. Although the canopy protects the soil from winds and storms it also keeps sunlight from reaching it as well as a considerable amount of rain. As a consequence the rainforest floor has considerably less vegetation than the rest of the forest layers.\n Trees in the canopy are able to photosynthesise very rapidly thanks to the large amount of light, so it supports the widest diversity of plant as well as animal life in most rainforests. Many rainforest animals have evolved to live solely in the canopy, and will never touch the ground.\n · Canopy in rainforests \n · Canopy gap \n · Canopy research \n · Canopy walkway \n · The Layers of the Rainforest \n · Understory (the area below the canopy)", 
   {}, 
   312470, 
   null, 
   1212523680.0
  ], 
  [
   312542, 
   null, 
   "Symbiote", 
   "I know what a canopy is, I don't get what you mean by \"tipping your waiters\" while in the canopy.", 
   {}, 
   312488, 
   null, 
   1212581820.0
  ], 
  [
   312579, 
   null, 
   "isly ilwott", 
   "I know what a canopy is, I don't get what you mean by \"tipping your waiters\" while in the canopy.\nIf you go there, you'll likely have people waiting on you hand and foot. Tip them. Tip the Sherpas. Tip those that serve you. Tip the guides. Tip the doorman. Tip the waiters. \n \n This was written after another short piece related to minimum wage and waitress wages that concluded with a need to tip those who serve you...if they made your kind of money, they wouldn't be servants of others. Spread the wealth to those willing to do a little work for it.\n \n Where did the reference to canape come from?", 
   {}, 
   312542, 
   null, 
   1212615120.0
  ], 
  [
   312614, 
   null, 
   "Symbiote", 
   "Living in Australia I more immediately think of tropical Queensland as the place of the canopy, rather than South America.\n \n So tipping your waiters there seemed to be incongruous with the rest, and perhaps the punchline of a joke.", 
   {}, 
   312579, 
   null, 
   1212667740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A visit to the canopy...", 
  "url": "http://www.4forums.com/political/environmental-debates/11257-visit-canopy.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 11257, 
  "discussion_files": [
   [
    "33026.html", 
    "http://www.4forums.com/political/environmental-debates/11257-visit-canopy-print.html"
   ]
  ], 
  "identifier": 11257
 }
]