[
 [
  [
   313029, 
   null, 
   "SeriousSister08", 
   "I want to know if anyone who believes in evolution can prove. With sources, and only with sources. That there was a gradual proccess. Prove with the fossil records that there were species that turned into other species over time. The rules of the game is that whoever is the first to do a personal insult. Loses the debate, and is automaticly declared the loser. People should be able to have a debate without childish insults.", 
   {
    "post_info": {
     "post_title": "Can Evolution Prove Through Fossils That There Was A Gradual Development?!"
    }
   }, 
   null, 
   null, 
   1213255800.0
  ], 
  [
   313032, 
   null, 
   "electrolyte", 
   "I want to know if anyone who believes in evolution can prove. With sources, and only with sources. That there was a gradual proccess. Prove with the fossil records that there were species that turned into other species over time. The rules of the game is that whoever is the first to do a personal insult. Loses the debate, and is automaticly declared the loser. People should be able to have a debate without childish insults.\n\n Is the pro-evolution debater restricted to using only references to fossils, or may that person use other pieces of evidence?\n Also, what constitutes \"proof\" for the purposes of this debate, and is such appropriate in terms of the nature of evolutionary theory? Science rarely aims to \"prove\" anything, but rather to show that one scenario is better supported than all others.", 
   {}, 
   313029, 
   null, 
   1213256820.0
  ], 
  [
   313039, 
   null, 
   "Symbiote", 
   "The concept of a species is arbitrary. \n \n The definition of gradual is arbitrary.\n \n Why bother with a debate when we already know how it will play out.\n \n Scientist: Here are A and Z. And here is N, halfway between A and Z.\n \n Creationist: Ok but that isn't gradual enough, how did A evolve to N\n \n Scientist: Well here is fossil F\n \n Creationist: Ok but that isn't gradual enough, how did A evolve to F\n \n Scientist: Here is fossil D\n \n Creatrionist: Ok but that isn't gradual enough, how did A evolve to D\n \n Ad nauseum, until we run out of fossils.\n \n Not everything that dies turns into a fossil, so it is pretty much inconceivable we will have a fossilised record depicting a complete lineage of creatures over millions of years.\n \n If the resolution of change we are lucky enough to have in the fossil record isn't sufficient to satisfy your absurdly high standards, the problem lies with your standards and not the theory.", 
   {}, 
   313032, 
   null, 
   1213274100.0
  ], 
  [
   313048, 
   null, 
   "Archangel", 
   "The concept of a species is arbitrary. \n \n The definition of gradual is arbitrary.\n \n Why bother with a debate when we already know how it will play out.\n \n Scientist: Here are A and Z. And here is N, halfway between A and Z.\n \n Creationist: Ok but that isn't gradual enough, how did A evolve to N\n \n Scientist: Well here is fossil F\n \n Creationist: Ok but that isn't gradual enough, how did A evolve to F\n \n Scientist: Here is fossil D\n \n Creatrionist: Ok but that isn't gradual enough, how did A evolve to D\n \n Ad nauseum, until we run out of fossils.\n \n Not everything that dies turns into a fossil, so it is pretty much inconceivable we will have a fossilised record depicting a complete lineage of creatures over millions of years.\n \n If the resolution of change we are lucky enough to have in the fossil record isn't sufficient to satisfy your absurdly high standards, the problem lies with your standards and not the theory.\n\n \n You make it sound like you can actually produce those connective points of evidence at all. But in fact you have no conclusive evidence of even one transitional species that proves that evo is true. Not without making huge assumptions and leaps of faith in man made conclusions which are unprovable.", 
   {}, 
   313039, 
   null, 
   1213278120.0
  ], 
  [
   313053, 
   null, 
   "Penfold", 
   "Consider the birds of the air. They used to be dinosaurs.....Ask Archaeopteryx, A famously transitional fossil.;)", 
   {}, 
   313048, 
   null, 
   1213280880.0
  ], 
  [
   313056, 
   null, 
   "Archangel", 
   "Consider the birds of the air. They used to be dinosaurs.....Ask Archaeopteryx, A famously transitional fossil.;)\n\n \n Then explain this example of Rapid adaptation, or Dramatic 'Reverse Evolution' that has been Documented In a Fish Species.\n \n http://www.sciencedaily.com/releases/2008/05/080515120759.htm\n \n Or this article about Avian quick-change artists: exemplars of rapid adaptation, house finches show that mothers know best. http://findarticles.com/p/articles/mi_m1134/is_5_111/ai_86684504 Which attempts to claim this evidence as a confirmation of evolution when it specifically works against what Darwin described in finch's as they developed in the Galapagos which he specifically referred to in his book. Which is explained here. http://www.creationists.org/patrickyoung/article02.html", 
   {}, 
   313053, 
   null, 
   1213282020.0
  ], 
  [
   313067, 
   null, 
   "electrolyte", 
   "Then explain this example of Rapid adaptation, or Dramatic 'Reverse Evolution' that has been Documented In a Fish Species.\n\n \"Whoooo! Look at them goalposts go! They're really booking it!\"\n \n More Archie hackery. He once again LIES and says that no intermediate forms have been found. When provided with one that he already knows about, he straps the goalposts to his back and takes off. Now, instead of saying, \"Oh, hm, I guess there are intermediate forms, and my foot should be stuck so far in my mouth that it will have to be surgically extracted,\" he's asking for explanation of adaptability that doesn't contradict the Modern Synthesis at all.", 
   {}, 
   313056, 
   null, 
   1213290780.0
  ], 
  [
   313068, 
   null, 
   "Peeling", 
   "You make it sound like you can actually produce those connective points of evidence at all. But in fact you have no conclusive evidence of even one transitional species that proves that evo is true. Not without making huge assumptions and leaps of faith in man made conclusions which are unprovable.\n\n Oh AA, come on. The planet's crust is littered with transitional forms.\n \n A fossil isn't called transitional because we know for certain it's a direct descendent of one species and a direct ancestor of another. It's called transitional because it exhibits intermediate features or a combination of features, and because it's found at an appropriate level in the geological column relative to the forms to which it appears morphologically intermediate(and no, that's not the same as depth underground; uplift and erosion sees to that.) and in an appropriate geographical location.\n \n We have detailed fossil records showing both smooth species-species transitions and longer-term higher-order transitions. A couple of excerpts from the page I linked:\n \n \nRose & Bown (1984) analyzed over 600 specimens of primates collected from a 700-meter-thick sequence representing approximately 4 million years of the Eocene. They found smooth transitions between Teilhardina americana and Tetonoides tenuiculus, and also beween Tetonius homunculus and Pseudotetonius ambiguus.\n\n \nGingerich (summarized in 1977) traced two distinct species of lemur-like primates, Pelycodus frugivorus and P. jarrovii, back in time, and found that they converged on the earlier Pelycodus abditus \"in size, mesostyle development, and every other character available for study, and there can be little doubt that each was derived from that species.\" Further work (Gingerich, 1980) in the same rich Wyoming fossil sites found species-to-species transitions for every step in the following lineage: Pelycodus ralstoni (54 Ma) to P. mckennai to P. trigonodus to P. abditus, which then forked into three branches. One became a new genus, Copelemur feretutus, and further changed into C. consortutus. The second branch became P. frugivorus. The third led to P. jarrovi, which changed into another new genus, Notharctus robinsoni, which itself split into at least two branches, N. tenebrosus, and N. pugnax (which then changed to N. robustior, 48 Ma), and possibly a third, Smilodectes mcgrewi (which then changed to S. gracilis). Note that this sequence covers at least three and possibly four genera, with a timespan of 6 million years.\n\n \nKurten (1976) describes bear transitions: \"From the early Ursus minimus of 5 million years ago to the late Pleistocene cave bear, there is a perfectly complete evolutionary sequence without any real gaps. The transition is slow and gradual throughout, and it is quite difficult to say where one species ends and the next begins. Where should we draw the boundary between U. minimus and U. etruscus, or between U. savini and U. spelaeus? The history of the cave bear becomes a demonstration of evolution, not as a hypothesis or theory but as a simple fact of record.\" He adds, \"In this respect the cave bear's history is far from unique.\"\n\n \nWerdelin & Solounias (1991) wrote an extensive monograph on hyenids. They discuss over one hundred (!) named species, with extensive discussion of the eighteen best-known species, and cladistic analysis of hundreds of specimens from the SIXTY-ONE \"reasonably well known\" hyaenid fossil species. They concluded:\n \n \"We view the evolution of hyaenids as overwhelmingly gradual. The species, when studied with regard to their total variability, often grade insensibly into each other, as do the genera. Large specimens of Hyaenotherium wongii are, for example, difficult to distinguish from small specimens of Hyaenictitherium hyaenoides, a distinct genus. Viewed over the entire family, the evolution of hyaenids from small, fox-like forms to large, scavenging, \"typical\" hyenas can be followed step by step, and the assembly of features defining the most derived forms has taken place piecemeal since the Miocene. Nowhere is there any indication of major breaks identifying macroevolutionary steps.\"\n\n \n Another good page is this one detailing the evolution of horses from small, dog-like three-toed creatures 50mya, a sequence which is extremely complete and also illustrates the 'pruned bush' nature of evolution (whereby one or two surviving species today are all that's left of a flourishing diaspora of related species that all went extinct at various points).\n \n I've asked you before for an alternative explanation for the existence of these transitional forms, and the best you could come up with is that it's a colossal coincidence. According to you, all these transitional forms were independent unrelated species that just happened to have intermediate features and just happened to leave fossils only at levels in the geological column that produce an illusion of relatedness. Which is about as convincing an explanation as saying that each frame of a film actually depicts completely different people doing completely different things in completely different places and only coincidentally looks like a coherent narrative. Does it really make sense to believe that literally hundreds of slightly different independent species all lived together in the same small geographical area, and all left fossils in an order that created the illusion of evolution in action? Did you have the first idea just how numerous and fine-grained the transitional fossils we have are, when you decided that evolution had no evidential basis?", 
   {}, 
   313048, 
   null, 
   1213290900.0
  ], 
  [
   313072, 
   null, 
   "sinjin", 
   "Modern whales have thigh bones but no thighs. \n \n Fossils, here you go:\n \n http://www.sciam.com/article.cfm?id=when-whales-had-legs", 
   {}, 
   313068, 
   null, 
   1213293240.0
  ], 
  [
   313079, 
   null, 
   "Archangel", 
   "Oh AA, come on. The planet's crust is littered with transitional forms.\n \n A fossil isn't called transitional because we know for certain it's a direct descendent of one species and a direct ancestor of another. It's called transitional because it exhibits intermediate features or a combination of features, and because it's found at an appropriate level in the geological column relative to the forms to which it appears morphologically intermediate(and no, that's not the same as depth underground; uplift and erosion sees to that.) and in an appropriate geographical location.\n \n We have detailed fossil records showing both smooth species-species transitions and longer-term higher-order transitions. A couple of excerpts from the page I linked:\n \n Another good page is this one detailing the evolution of horses from small, dog-like three-toed creatures 50mya, a sequence which is extremely complete and also illustrates the 'pruned bush' nature of evolution (whereby one or two surviving species today are all that's left of a flourishing diaspora of related species that all went extinct at various points).\n \n I've asked you before for an alternative explanation for the existence of these transitional forms, and the best you could come up with is that it's a colossal coincidence. According to you, all these transitional forms were independent unrelated species that just happened to have intermediate features and just happened to leave fossils only at levels in the geological column that produce an illusion of relatedness. Which is about as convincing an explanation as saying that each frame of a film actually depicts completely different people doing completely different things in completely different places and only coincidentally looks like a coherent narrative. Does it really make sense to believe that literally hundreds of slightly different independent species all lived together in the same small geographical area, and all left fossils in an order that created the illusion of evolution in action? Did you have the first idea just how numerous and fine-grained the transitional fossils we have are, when you decided that evolution had no evidential basis?\n\n \n I marvel at how your side can be so convinced of something when you must base your ultimate conclusions on so many unprovable assumptions. As I read this, http://www.talkorigins.org/faqs/faq-transitional/part1a.html#tran I see nothing but assertions while it offers actual evidence of nothing. But its chock full of excuses to try to explain the gaps away. So just for once please admit that what you post as evidence is nothing more than wishful thinking Peeling. Nothing they offer in your link is absolute evidence of anything that is proven for sure. \n \n Especially since your evidence requires millions of years to occur but I have shown 2 examples of rapid adaptation occurring in just a number of generations for the animals used as examples. And in the case of the tiny fish, it was referred to as reverse evolution. Interesting that no one tries to actually refute them but just ignores them as they stick with the standard talking points.\n \n And shouldn't this thread be moved OUT of the one on one ONLY debates forum?", 
   {}, 
   313068, 
   null, 
   1213296240.0
  ], 
  [
   313080, 
   null, 
   "iangb", 
   "Especially since your evidence requires millions of years to occur but I have shown 2 examples of rapid adaptation occurring in just a number of generations for the animals used as examples. And in the case of the tiny fish, it was referred to as reverse evolution. Interesting that no one tries to actually refute them but just ignores them as they stick with the standard talking points.\n'Reverse Evolution' is a commonly used, but misleading, term. I saw a slightly apocryphal 'documentary' on it's occurence in humans, citing a family in a remote part of the world that walked on all fours. It turned out that the reason for this was incest - the family had interbred, causing much more sever results in a very short space of time.\n If this much more drastic mutation turns out to be beneficial, then it will still be passed on by natural selection. This could well be the case in your example(s).", 
   {}, 
   313079, 
   null, 
   1213297740.0
  ], 
  [
   313081, 
   null, 
   "electrolyte", 
   "I marvel at how your side can be so convinced of something when you must base your ultimate conclusions on so many unprovable assumptions.\n\n Yessir, Mr. Projectionist. Let's ignore this evidence and instead take upon faith the absurdities and unprovable assumptions of the Bible. What is more marvelous is how people actually don't see the stupidity of such a position.\n \n \nAs I read this, http://www.talkorigins.org/faqs/faq-transitional/part1a.html#tran I see nothing but assertions while it offers actual evidence of nothing.\n\n Gee Archie, all you had to do was click on any of the links that actually say that they show transitional/intermediate forms. Or, God forbid, you could read more than a few paragraphs. A huge list starts toward the bottom of the very same page. At the very bottom, there is a link to another huge list. Tell me, do you also marvel at your selective ignorance of the evidence that is presented to you? \n \n \nSo just for once please admit that what you post as evidence is nothing more than wishful thinking Peeling.\n\n Interesting. Archie accuses Peeling of wishful thinking while saying that there is no evidence in Peeling's links, even though the evidence is right there on the same page Archie linked.\n \n \nEspecially since your evidence requires millions of years to occur but I have shown 2 examples of rapid adaptation occurring in just a number of generations for the animals used as examples.\n\n When you can show examples of the phenotypic change represented by these intermediate forms occurring in \"just a number of generations,\" we'll talk. \n \n \nAnd in the case of the tiny fish, it was referred to as reverse evolution.\n\n Which was probably for journalistic shock value. Evolution has no defined direction. Take the example of the finch beaks: the median beak got longer, then it got shorter. How is this a falsification of the Modern Synthesis? Answer: it's not, unless you're living in Archieland, where evolutionary theory says whatever Archie cares to make it say.\n \n \nInteresting that no one tries to actually refute them but just ignores them as they stick with the standard talking points.\n\n Why refute? Where is the need to refute? I already told you that neither of these cases challenges the Modern Synthesis.\n \n \nAnd shouldn't this thread be moved OUT of the one on one ONLY debates forum?\n\n It should at least be split. I asked for clarification in good faith. The OP hasn't been back.", 
   {}, 
   313079, 
   null, 
   1213298340.0
  ], 
  [
   313088, 
   null, 
   "sinjin", 
   "This is a good source:\n http://www.pbs.org/wgbh/nova/id/transitional.html", 
   {}, 
   313081, 
   null, 
   1213308240.0
  ], 
  [
   313098, 
   null, 
   "Peeling", 
   " As I read this, http://www.talkorigins.org/faqs/faq-transitional/part1a.html#tran I see nothing but assertions while it offers actual evidence of nothing. But its chock full of excuses to try to explain the gaps away.\n\n AA, I directly quoted you no less than four gapless transitional sequences between species and genera identified in the fossil record. Gapless, as in no gaps to explain. Either refute their validity, or admit you were wrong to say we have no evidence of transitional forms. Anything else is childish obstinacy and far beneath you.\n \n When you've done that, maybe you could take a step back and look at what these 'gaps' you're so enamoured of are in. They're gaps in a clear and unambiguous nested hierarchy of forms, exactly as predicted by evolutionary theory.\n \n But fine, if you want to make this a who's-got-the-biggest-gaps contest, let's consider the fossil record your beliefs predict.\n \n According to you, all species lived side by side until they individually became extinct. So if we're really generous, and assume that the fossils we find were in every case deposited just before extinction, every span of strata below the ones in which we find the remains of a particular species constitutes a 'gap': somewhere we should find those fossils, according to your predictions, but don't. So how big are your gaps?\n \n Pretty big, as it turns out. Hardly any species are found to span more than a handful of millions of years of strata, out of an average of 1.5 billion years of fossil-bearing rock. So the fossil record, as viewed from your perspective, is around 99% gap. Not one single species is found spanning the column - not one, out of millions - despite them having all lived side by side, according to you, from the very beginning.\n \n I know you don't believe in dating methods - frankly, I couldn't care less. It doesn't matter. What matters is the narrowness of the range of fossils within the column. It doesn't matter how fast it was laid down, it's still 99% gap as far as you're concerned.\n e\n So I tell you what: I'll take your criticisms about the gaps in what looks exactly like an evolutionary hierarchy of fossil forms seriously when you pony up some semblance of an explanation as to why a) your theory is 99% gap, and b) why it's just the right 99% gap - at frankly incalculable odds - to give the illusion of an evolutionary history.", 
   {}, 
   313079, 
   null, 
   1213317840.0
  ], 
  [
   313112, 
   null, 
   "electrolyte", 
   "So I tell you what: I'll take your criticisms about the gaps in what looks exactly like an evolutionary hierarchy of fossil forms seriously when you pony up some semblance of an explanation as to why a) your theory is 99% gap, and b) why it's just the right 99% gap - at frankly incalculable odds - to give the illusion of an evolutionary history.\n\n Well put, Peeling. This should be interesting.", 
   {}, 
   313098, 
   null, 
   1213328880.0
  ], 
  [
   313133, 
   null, 
   "Peeling", 
   "Sorry I didn't get to this bit last night; it was getting late.\n \nEspecially since your evidence requires millions of years to occur but I have shown 2 examples of rapid adaptation occurring in just a number of generations for the animals used as examples. And in the case of the tiny fish, it was referred to as reverse evolution.\n\n You're right, it's a huge problem - for your version of evolution :) Could you at least consider the possibility that the version of evolution that makes no sense to you isn't the version of evolution that makes sense to me?\n \n Not that it's entirely your fault, mind you. The requirement for one mechanism, mutation, to explain every organismic change or adaptation has long been a misperception reinforced by pop culture, ever since that mechanism was first discovered. Your fault lies in clinging to that oversimplification, despite the earnest efforts of others to correct it, for no reason other than it panders to your desire for evolution not to fit the facts.\n \n For a start, there's no blanket dogma saying 'evolution = slow'. Evolution involves a number of layered and parallel processes, all influenced to different degrees by different external pressures and all operating on different timescales. Broadly speaking, these processes can be broken down according to whether they introduce new alleles, add new potential variation, realise potential variation, or reduce variation.\n \n Genetic mutation introduces new alleles - new or variant genes. Mutation rates are influenced by environmental mutagens and the time between generations, and also by the size of the population (bigger population = more mutations entering the gene pool). As an evolutionary mechanism it is at its most powerful and dynamic in bacteria, with their rapid reproductive rate and huge population sizes.\n \n Genetic mutation in sexually reproducing species also introduces new potential variation: the recombinatorial possibilities of that new gene with all the other variant alleles that exist, and potential interactions with environmental changes, like temperature, diet etc. Interbreeding, migration and environmental change all realise that potential variation, exploring the recombinatorial possibilities. This obviously happens on a much shorter timescale, and is influenced by size of population, patterns of interbreeding and, again, time between generations.\n \n Natural selection, in the form of competition for resources or predation, obviously acts to reduce variation, and can have a very rapid effect indeed - with immediate knock-on effects upon patterns of interbreeding and the recombinatorial potential thus explored.\n \n It's important to remember that the strength and direction of these various influences wax and wane, dramatically affecting the overall evolutionary rate of a species. If a population is large, well-adapted and interbreeds thoroughly within a fairly stable environment, the metaphorical foot is off the evolutionary gas-pedal. New alleles accumulate within the population, and interbreeding explores the recombinant potential, but there's no strong directional component. It's like a gradually expanding cloud of ever-richer genetic variation concentrated around the most successful combinations.\n \n However, a sudden environmental change can induce a powerful selective gradient across that peacefully expanding cloud. Variations that were value-neutral can overnight become statistically significant as they interact with novel circumstances - which obviously has a huge influence upon patterns of interbreeding in the next generation, naturally focusing recombination upon the most successful variants (here competition for mates and sexual selection acts to speed the process up even further), reinforcing those traits and inducing a kind of snowball effect of adaptation. And it's not just environmental change that can have that effect: physical segregation of a sub-population can set it adrift, no longer tied through interbreeding to the dominant combinations of 'fittest' alleles, and free to find a new 'best fit' in the absence of competition with those same 'fittest' genes.\n \n Equally dramatic explosions of variation can occur when a species encounters an environment with many empty niches. In Lake Victoria, for instance, a single species of cichlid found itself in a vast, brand new lake with abundant resources, no competition, and no predation to speak of. With natural selection temporarily on vacation the species radiated like mad - almost anything was viable. Subsequently, competition amongst the radiant subspecies imposed selective pressure and calmed things down again, with the result that over 300 species now inhabit various niches in the lake's ecosystem.\n \n So going back to the evidence I've linked to: it does not require millions of years, rather it (in places) indicates millions of years. No problem for evolutionary theory there; periods of stasis or slow drift are perfectly in line with expectations. You can even find, within the pages I linked, research that has positively correlated periods of evolutionary stasis followed by rapid change to environmental stasis followed by dramatic change (such as sudden widespread flooding). If you open your mind to the theory as it actually stands today, it's really very exciting just how well it fits with, predicts and explains a multitude of disparate observations. \n \n Now let's look at the first example of rapid evolution you provided, the sticklebacks. Sure enough, on that very page:\n \nThe ability of the fish to quickly adapt to environmental changes such as increased predation by the cutthroat trout is due, Peichel believes, to their rich genetic variation. The sticklebacks in Lake Washington contain DNA from both marine (saltwater) fish, which tend to be fully plated, and freshwater sticklebacks, which tend to be low-plated. When environmental pressures called for increased plating, some of the fish had copies of genes that controlled for both low and full plating, and so natural selection favored the latter.\n\n In other words, the fish were already genetically diverse. The changing environmental circumstances applied a selective pressure which favoured one variant, which proliferated as the other variant suffered. Interbreeding patterns inevitably altered, plated fish bred with plated fish statistically more often, reinforcing the trend. Again, entirely in line with evolutionary theory. Here 'rapid evolution' is something that happened to the population as a whole, drastically changing the relative proportions of fish with different pre-existing traits, as opposed to 'rapid adaptation' by individuals.\n \n So let's look at the next example you posted. Once again, we find that the house finch species already possesses the necessary potential variability, only here in an even more immediately accessible form regulated by developmental timing. Quite what it is induces the mothers to lay in a particular order, or how they 'choose' the sex of their eggs, is a fascinating question, but it doesn't change the fact that the 'quick change' variability we're seeing is already inherent to their genetic payload, and has no implications for how fast other, different evolutionary processes ought to proceed - in particular, it says nothing about how quickly that adaptive mechanism itself came into existence. After all, the speed at which your TV changes channel is unrelated to the amount of time it's taken for us to develop television, right?\n \n The critique you linked to makes more or less the same mistake: trying to force evolution to be a single mechanism and then complaining when no single mechanism can explain every adaptation. We've had billions of years for adaptive mechanisms to layer one atop the other, each arising as a product of its precursors - of course unpicking them is a complex and difficult task. But that doesn't make the slightest difference to the mountain of mechanism-independent evidence that evolution has happened.\n \n It's really up to you. I can't make you abandon the strawman of evolutionary theory you've latched onto. I can only keep trying to explain in the hope that one day you'll let the information in. I really wish you would come on board; there's so much fascinating stuff scientists genuinely don't understand that we could talk about instead, it seems a shame to keep rehashing the same old long-settled question of whether evolution happened at all.", 
   {}, 
   313079, 
   null, 
   1213360920.0
  ], 
  [
   313166, 
   null, 
   "electrolyte", 
   "It's really up to you. I can't make you abandon the strawman of evolutionary theory you've latched onto. I can only keep trying to explain in the hope that one day you'll let the information in. I really wish you would come on board; there's so much fascinating stuff scientists genuinely don't understand that we could talk about instead, it seems a shame to keep rehashing the same old long-settled question of whether evolution happened at all.\n\n One problem is that I suspect he doesn't comprehend the meaning and effect of 90% of your points. You should probably have him explicitly give his understanding of evolutionary theory so that you know where to start and at what comprehension level you can operate.\n \n On the other hand, Archie has emphasized that nothing, nothing will shake his \"faith,\" so I'd argue that he has already closed his mind to true consideration of this issue. Even when you hold his hand and take him to a page with flawless transition between different classes of organisms, he doesn't even look. You have much more patience than I, but I tried this approach years ago and have decided that educating Archie about something he considers to be anti-Christian is hopeless.", 
   {}, 
   313133, 
   null, 
   1213373640.0
  ], 
  [
   313345, 
   null, 
   "SeriousSister08", 
   "Is the pro-evolution debater restricted to using only references to fossils, or may that person use other pieces of evidence?\n Also, what constitutes \"proof\" for the purposes of this debate, and is such appropriate in terms of the nature of evolutionary theory? Science rarely aims to \"prove\" anything, but rather to show that one scenario is better supported than all others.\n\n \n I'am referring to fossils only. Because there have been scientist that have stated that they can prove by the fossil records alone that gradual development has taken place. I tend to feel that is false and would love to disclaim those theories. I would like to stick to terms of the evolutionary theory. I don't want the topic clouded out by other elements that may or may not relate to want is being spoken about. That is my stand on it. So I would like to keep sources based solely on the fossil records and nothing else.\n \n Also, if science rarely aims, to prove anything, then what is the reason for study and debate if you are only going to argue about something that cannot be proven?! I find that to be a paradox.\n \n \n Let me state my position on the gradual development theory. \n \n 1. I do not believe that one living thing evolved from one living thing to another. There have never been any proof in the fossil record that points to gradual development. If anyone wants to prove that there is proof of it, then I would love to see their sources. \n \n The reason for my statements is because Darwin could not find any proof in the fossil records of any gradual development. And said that over time more fossils would be uncovered and they would be proof of it. But now, to this day, there has not been a fossil showing any sign of gradual development.\n \n Can anyone refute this?! And using only fossil records?!", 
   {}, 
   313032, 
   null, 
   1213587420.0
  ], 
  [
   313346, 
   null, 
   "Penfold", 
   "They did. You lost. Next?", 
   {}, 
   313345, 
   null, 
   1213588560.0
  ], 
  [
   313356, 
   null, 
   "Peeling", 
   "1. I do not believe that one living thing evolved from one living thing to another. There have never been any proof in the fossil record that points to gradual development. If anyone wants to prove that there is proof of it, then I would love to see their sources. \n \n The reason for my statements is because Darwin could not find any proof in the fossil records of any gradual development. And said that over time more fossils would be uncovered and they would be proof of it. But now, to this day, there has not been a fossil showing any sign of gradual development.\n \n Can anyone refute this?! And using only fossil records?!\n\n If you follow the link I provided in my earlier post you'll find page after page of transitional fossils and many examples of detailed, gradual species-to-species development preserved in the fossil record. I quoted excerpts from four of them. Do you have any specific problem with those or any other examples?", 
   {}, 
   313345, 
   null, 
   1213616100.0
  ], 
  [
   313391, 
   null, 
   "SeriousSister08", 
   "They did. You lost. Next?\n\n \n Assuming you're talking to me. You want to explain how I lost instead of just saying it without backing it up with something?! Making random statements does not help to back up your case, nor does it claim another person a loser in the debate. Go do some research and then come back when you have something of some importance to say. If not, then don't waste my time make dumb remarks that get neither of us anywhere. Just some words of advice.emoticon_xagree", 
   {}, 
   313346, 
   null, 
   1213677720.0
  ], 
  [
   313392, 
   null, 
   "SeriousSister08", 
   "If you follow the link I provided in my earlier post you'll find page after page of transitional fossils and many examples of detailed, gradual species-to-species development preserved in the fossil record. I quoted excerpts from four of them. Do you have any specific problem with those or any other examples?\n\n \n Are you talking about the post on the first page?! Because I read that link, and that was an evolutionist site. Of course it would back up gradual development. Also, I only saw a bunch of statements, with no pictures or anything backing up what was said. Did I look at the wrong link?! Or was it the one you sent me via Pm?! I didn't really get to check that on out. Tell me exactly which one, and I'll gladly take a look at it.", 
   {}, 
   313356, 
   null, 
   1213678920.0
  ], 
  [
   313394, 
   null, 
   "electrolyte", 
   "I'am referring to fossils only. Because there have been scientist that have stated that they can prove by the fossil records alone that gradual development has taken place.\n\n See Peeling's link.\n See below regarding \"proof.\"\n \n \nI tend to feel that is false and would love to disclaim those theories.\n\n Right. You have a desire not to find the truth but to find a reason to reject an idea that you already reject without reason. That is, you already have your answer, yet you have no evidence. Why don't you look at the evidence and let it help you determine what is true and what is false?\n \n \nI would like to stick to terms of the evolutionary theory. I don't want the topic clouded out by other elements that may or may not relate to want is being spoken about. That is my stand on it. So I would like to keep sources based solely on the fossil records and nothing else.\n\n Evidence for evolutionary theory is not restricted to the fossil record. It's one thing to address the fossil record only; it's another thing to demand that we address evolution as a whole by talking about a single set of evidences. This is like asking me to tell you about the digestive system with the restriction that you can only talk about the esophagus.\n \n \nAlso, if science rarely aims, to prove anything,\n\n I think you've misunderstood. By its very methodology, science can't really \"prove\" anything per se. I cannot \"prove\" that when I drop my pen tomorrow, it will fall at about 9.8 meters per second per second. But repeated experimentation and observation have made it acceptable far beyond even a reasonable doubt that this will happen.\n \n \nthen what is the reason for study and debate if you are only going to argue about something that cannot be proven?!\n\n I can't prove to you that I exist. You can't prove to me that you exist. (I can't prove to me that you exist.) So why do I bother talking to somebody I can't prove exists?\n Reasonable people live in a world ruled by reason. In everyday life, is there much difference between having proof of something and not only having no reason at all to reject that something but also having every reason to accept it?\n \n \nI find that to be a paradox.\n\n Because you seem to want an answer that is beyond reproach. In science, we get to question everything, even the stuff we have lots of evidence for. But we always go where the evidence points us. So the question to ask yourself is: In this case, to where does the evidence point? Peeling has shown you.\n \n \nThere have never been any proof in the fossil record that points to gradual development. If anyone wants to prove that there is proof of it, then I would love to see their sources.\n\n Peeling gave some evidence that points to gradual development, evidence that counters your claim that there is no such evidence.\n \n \nThe reason for my statements is because Darwin could not find any proof in the fossil records of any gradual development. And said that over time more fossils would be uncovered and they would be proof of it. But now, to this day, there has not been a fossil showing any sign of gradual development.\n\n It must be interesting to live in a fantasy world where you can make statements based on no evidence that are refuted over and over again continue to believe that those statements are true.", 
   {}, 
   313345, 
   null, 
   1213684620.0
  ], 
  [
   313398, 
   null, 
   "Penfold", 
   "Which brings us neatly back to my succinct summary of the position. Ethme made a disingenuous request for information readily available to him, which he dismissed out of hand. Case closed.", 
   {}, 
   313394, 
   null, 
   1213702200.0
  ], 
  [
   313400, 
   null, 
   "Peeling", 
   "Are you talking about the post on the first page?! Because I read that link, and that was an evolutionist site. Of course it would back up gradual development.\n\n Hmm. That puts me in a rather difficult position. You want evidence for gradual development in the fossil record, but you dismiss out of hand any such evidence if it comes from an 'evolutionist site'.\n \n You're going to have to help me out here - what exactly is it you're looking for?\n \nAlso, I only saw a bunch of statements, with no pictures or anything backing up what was said. Did I look at the wrong link?! Or was it the one you sent me via Pm?! I didn't really get to check that on out. Tell me exactly which one, and I'll gladly take a look at it.\n\n The page I linked here, the one you visited, is intended as an overview of some of the results of thousands of scientific investigations, each one of which has been subjected to critical peer review. There's an extensive list of references for you to follow up on, although even that can't do justice to the volume of information available.\n \n If you want pictures, there are some here on a theistic evolution website, including both secular and theistic commentary.\n \n As far as proof goes, as others have pointed out there are practical limits as to what can be directly proved - including our very existence. Science concerns itself with identifying the best candidate for the most accurate model of reality. As a model, seperate creation of all species is a very poor candidate for predicting the fossil record we actually see, whereas evolution is a phenomenally accurate model for predicting the fossil record we see - accurate enough that scientists were able to predict the features and strata of a fossil before it had ever been discovered. \n \n It really isn't about proof. It's about deciding which hypothesis best fits the facts. There isn't one species for which we have a fossil pattern that fits the predictions of creationism (ie, broadly distributed throughout fossil-bearing strata), while on the other hand every single fossil ever found fits the predictions of evolution (ie, each species located within a relatively narrow and continuous range of strata, bracketed by similar transitional species, and forming part of a chronologically-ordered nested hierarchy of forms converging on a single common ancestor).", 
   {}, 
   313392, 
   null, 
   1213704240.0
  ], 
  [
   313403, 
   null, 
   "jim's trucking", 
   "This is an interesting topic, but this thread is misplaced if it is to continue with kibitzers. It should be moved to Formal Open Debates or limited by the thread starter to a 1 on 1 debate with the customary TWO contenders.", 
   {
    "post_info": {
     "post_title": "wrong venue"
    }
   }, 
   313400, 
   null, 
   1213715700.0
  ], 
  [
   313405, 
   null, 
   "Ripskar", 
   "http://chem.tufts.edu/science/evolution/HorseEvolution.htm\n The above link shows a selection of fossils through the equine lineage, note that these are spot points in the transition to illustrate the alterations and the range includes hundreds if not thousands of examples which are intermediate between the intermediates shown.\n eg. Merychippus has several specimins held in the Museum of Montana;\n MOR-1837\n MOR-1838\n MOR-1840\n MOR-1870\n MOR-2298\n MOR-2299\n MOR-2300\n MOR-2301\n MOR-2303\n MOR-2304\n MOR-2318\n MOR-2405\n MOR-2446\n \n Miohippus is represented at the same institution by;\n MOR-618\n MOR-641\n MOR-1229\n MOR-1762\n MOR-2260\n MOR-2264\n MOR-2266\n MOR-2268\n MOR-2302\n MOR-2340", 
   {}, 
   313400, 
   null, 
   1213716060.0
  ], 
  [
   313699, 
   null, 
   "nutter", 
   "They can't prove it because it doesn't exist. We have only one creator, God.", 
   {
    "post_info": {
     "post_title": "Evolution?"
    }
   }, 
   313112, 
   null, 
   1213989960.0
  ], 
  [
   313719, 
   null, 
   "T.Q", 
   "They can't prove it because it doesn't exist. We have only one creator, God.\n\n \n Prove to me that the sun will rise tomorrow.", 
   {}, 
   313699, 
   null, 
   1213996020.0
  ], 
  [
   313791, 
   null, 
   "Ripskar", 
   "They can't prove it because it doesn't exist. We have only one creator, God.\n\n \n If I were cruel I might challenge to prove the existance of this \"God\" you talk about, but we already know the result of that litte exercise...", 
   {}, 
   313699, 
   null, 
   1214086560.0
  ], 
  [
   313797, 
   null, 
   "Archangel", 
   "Prove to me that the sun will rise tomorrow.\n\n \n Since this request was made yesterday at 3:07 PM, this proof has already been supplied by God Himself.", 
   {}, 
   313719, 
   null, 
   1214088780.0
  ], 
  [
   313803, 
   null, 
   "electrolyte", 
   "Since this request was made yesterday at 3:07 PM, this proof has already been supplied by God Himself.\n\n Then that's not a predictive proof. T.Q was asking for \"proof\" in the sense that the OP is asking. In fact, I suspect that T.Q would issue this as a standing challenge. Prove that the sun will rise \"tomorrow,\" meaning the day following whichever day today happens to be. Using the absurd standards suggested by the OP, there can be no before-the-fact proof that the sun will rise. Yet it is absurd to believe that it will not, which tells us that there's something wrong with the OP's standards.\n \n Either you completely missed the point of T.Q's challenge, or you knew better and are purposely being patronizing. (Possibly both.) Neither makes you look good. So we'll give you the chance to try again: prove -- before the event happens -- that the sun will rise tomorrow.", 
   {}, 
   313797, 
   null, 
   1214090460.0
  ], 
  [
   313805, 
   null, 
   "T.Q", 
   "Then that's not a predictive proof. T.Q was asking for \"proof\" in the sense that the OP is asking. In fact, I suspect that T.Q would issue this as a standing challenge. Prove that the sun will rise \"tomorrow,\" meaning the day following whichever day today happens to be. Using the absurd standards suggested by the OP, there can be no before-the-fact proof that the sun will rise. Yet it is absurd to believe that it will not, which tells us that there's something wrong with the OP's standards.\n\n \n Got it in one.", 
   {}, 
   313803, 
   null, 
   1214092860.0
  ], 
  [
   313807, 
   null, 
   "Archangel", 
   "Then that's not a predictive proof. T.Q was asking for \"proof\" in the sense that the OP is asking. In fact, I suspect that T.Q would issue this as a standing challenge. Prove that the sun will rise \"tomorrow,\" meaning the day following whichever day today happens to be. Using the absurd standards suggested by the OP, there can be no before-the-fact proof that the sun will rise. Yet it is absurd to believe that it will not, which tells us that there's something wrong with the OP's standards.\n \n Either you completely missed the point of T.Q's challenge, or you knew better and are purposely being patronizing. (Possibly both.) Neither makes you look good. So we'll give you the chance to try again: prove -- before the event happens -- that the sun will rise tomorrow.\n\n \n My predictive proof that the sun will rise tomorrow is that it has risen every morning since this world was created and is estimated by YOUR GOD, QUANTUM PHYSICS to burn for billions of more years, so I can safely predict with confidence that it will rise tomorrow, whether or not the Earth even continued to exist until then. Now go ahead and prove me wrong.", 
   {}, 
   313803, 
   null, 
   1214094720.0
  ], 
  [
   313808, 
   null, 
   "Kronus", 
   "My predictive proof that the sun will rise tomorrow is that it has risen every morning since this world was created and is estimated by YOUR GOD, QUANTUM PHYSICS to burn for billions of more years, so I can safely predict with confidence that it will rise tomorrow, whether or not the Earth even continued to exist until then. Now go ahead and prove me wrong.\n\n \n The proof is in your own statement. You yourself admit that you haven't proven a thing, merely that you can \"predict with confidence\". I agree that your prediction is almost certainly correct, but no where do you show that simply because something has happened a gagillion times, it must happen again tomorrow. You have proven nothing, you've simply described the most likely outcome. Kinda like what science does!", 
   {}, 
   313807, 
   null, 
   1214096040.0
  ], 
  [
   313818, 
   null, 
   "Archangel", 
   "The proof is in your own statement. You yourself admit that you haven't proven a thing, merely that you can \"predict with confidence\". I agree that your prediction is almost certainly correct, but no where do you show that simply because something has happened a gagillion times, it must happen again tomorrow. You have proven nothing, you've simply described the most likely outcome. Kinda like what science does!\n\n \n I've also proven that TQs question is both ignorant and stupid at the same time. Asking for proof that the sun will rise tomorrow is equivalent to asking for proof that air will still exist tomorrow. It's a moronic question. But in typical fashion, not one of you so called intellectuals will even question it.", 
   {}, 
   313808, 
   null, 
   1214099520.0
  ], 
  [
   313820, 
   null, 
   "iangb", 
   "To summarise this thread so far:\n \n SeriousSister: I challenge you to prove evolution with fossils\n Everyone else: [evidence]\n Archangel: But here is a completely unrelated problem!\n Everyone else: [solution]\n SeriousSister: But the 'evidence' is from pro-evolution sites!\n Everyone else: So? It's still there. [more evidence]\n Nutter: Evolution is unprovable!\n TQ: Nothing is fundamentally 'provable'\n Archangel: But science says it is!\n Electrolyte: No, it doesn't\n Archangel: Yes it does!\n Kronos: You're kinda misunderstanding here...\n Archangel: [misses the point]\n \n By Archangels standards of the proof that the sun will rise tomorrow, the fossil record is sufficient proof that evolution occurs. It's like proving that air will exist tomorrow. Should you (Archie) disagree, I suggest you find a better way to show that the sun will rise.", 
   {}, 
   313818, 
   null, 
   1214101080.0
  ], 
  [
   313830, 
   null, 
   "Archangel", 
   "To summarise this thread so far:\n \n SeriousSister: I challenge you to prove evolution with fossils\n Everyone else: [evidence]\n Archangel: But here is a completely unrelated problem!\n Everyone else: [solution]\n SeriousSister: But the 'evidence' is from pro-evolution sites!\n Everyone else: So? It's still there. [more evidence]\n Nutter: Evolution is unprovable!\n TQ: Nothing is fundamentally 'provable'\n Archangel: But science says it is!\n Electrolyte: No, it doesn't\n Archangel: Yes it does!\n Kronos: You're kinda misunderstanding here...\n Archangel: [misses the point]\n \n By Archangels standards of the proof that the sun will rise tomorrow, the fossil record is sufficient proof that evolution occurs. It's like proving that air will exist tomorrow. Should you (Archie) disagree, I suggest you find a better way to show that the sun will rise.\n\n \n As usual you not only completely misstate what has transpired so far in the thread, but you make no sense in summarizing my argument as being anywhere near the same low standard of evidence that evolution ever occurred.", 
   {}, 
   313820, 
   null, 
   1214114280.0
  ], 
  [
   313833, 
   null, 
   "T.Q", 
   "I've also proven that TQs question is both ignorant and stupid at the same time. Asking for proof that the sun will rise tomorrow is equivalent to asking for proof that air will still exist tomorrow. It's a moronic question. But in typical fashion, not one of you so called intellectuals will even question it.\n\n \n All you've done is shown how ignorant you yourself are. \n \n As has been told to you already, you can not prove that the sun will rise tomorrow. Using previous data and observations, you can predict that there is no reason why it wouldn't.\n \n My question showed how bankrupt the opening post is. But why am I not surprised that you missed the point", 
   {}, 
   313818, 
   null, 
   1214118720.0
  ], 
  [
   313834, 
   null, 
   "electrolyte", 
   "My predictive proof that the sun will rise tomorrow is that it has risen every morning since this world was created...\n\n Oh man. Fish. Barrel. Howitzer.\n \n You've just accepted inductive logic, which is a major part of how science works. Would you like to stupidly berate me again for accepting science?\n \n The thing that you've missed -- and missed so clearly that I'm only one on a growing list of people pointing this out to you -- is that your \"proof\" that the sun will rise tomorrow is not acceptable \"proof\" by the standards issued by the original poster. Just as you realize that it is downright dumb to think that the sun will not rise tomorrow morning because you cannot deduce a \"proof\" for the claim a priori, it is downright dumb to assert that evolutionary theory is unreasonable because nobody has \"proof\" to the same absurd level. What we do have -- which has been posted and discussed and, of course, ignored by your side -- is an enormous mountain of substantial evidence that, taken even in pieces, makes rejection of evolutionary theory indefensible.\n \n What makes this so golden is that, according to your beliefs, the sun has not risen \"every morning since this world was created.\" Although morning and night were established with the first \"day\" according to your favorite goat-herder mythology, the sun didn't show up until day four.\n \n \nand is estimated by YOUR GOD, QUANTUM PHYSICS to burn for billions of more years,\n\n And this is why there is nobody here who respects you. You blatantly lie about what others believe, and you do so in a way that is intended to antagonize. This exposes your vacuous claims about loving everyone and swearing to be kind and promising to rise above the fabricated \"persecution\" as exactly what they are: XXX-covering and window dressing.\n Quantum physics is not my god. It's not even my specialty. I know little about quantum physics compared to most physicists. But I know a hell of a lot more about it than you do, and more than the average person does, so when you said that quantum mechanics was unobserved pseudoscience, I ripped you a new one and labeled you \"Professor Quantum Mechanics\". I continue to use that moniker when you reveal your complete ignorance of so many aspects of science. Stop pretending you know about things of which you are actually completely uneducated, and I won't get to keep highlighting your ignorance of these things for all the readers. (Or don't. This part is quite fun for me.)\n By the way, Professor, our estimation of the lifetime of the sun is based on astronomy, not quantum physics.\n \n \nso I can safely predict with confidence that it will rise tomorrow,\n\n Yes, you certainly can safely (i.e. reasonably) make this prediction. Our point -- which you actually acknowledged, but without actually understanding -- is that you can make this \"prediction\" without having \"proof\" of the sort that you and your ilk demand of science... when it disagrees with your goat-herding mythology, anyway.\n \n \nwhether or not the Earth even continued to exist until then. Now go ahead and prove me wrong.\n\n Well, you challenged: The sun's rising is a visual effect of Earth's axial rotation as the observer moves out of the shadow of Earth itself. If the earth ceased to exist, there would be no earthly axial rotation or Earth shadow and therefore no observable sunrise from where the earth would normally be located.\n Now, each planet and planetoid would technically have its own sunrise once every solar-day-for-that-planetoid, but that's not what was asked, was it Professor Quantum Mechanics?", 
   {}, 
   313807, 
   null, 
   1214119200.0
  ], 
  [
   313840, 
   null, 
   "Ripskar", 
   "Besides which it's Classical Physics; Atomic Theory, (not Quatum Mechanics)which predicts the length of time the Sun will continue to undergo Fusion (not burning) which is about 3 billion years.", 
   {}, 
   313834, 
   null, 
   1214136900.0
  ], 
  [
   313842, 
   null, 
   "iangb", 
   "As usual you not only completely misstate what has transpired so far in the thread, but you make no sense in summarizing my argument as being anywhere near the same low standard of evidence that evolution ever occurred.\nIn that case, I suggest you address the wealth of evidence that is stacked against you, rather than making abstract statements.", 
   {}, 
   313840, 
   null, 
   1214144280.0
  ], 
  [
   313844, 
   null, 
   "electrolyte", 
   "Besides which it's Classical Physics; Atomic Theory, (not Quatum Mechanics)which predicts the length of time the Sun will continue to undergo Fusion...\n\n It's certainly classical physics and atomic theory that we use to explain what fusion is and what is necessary to induce it, but it's the observations we make of the sun and other stars throughout the galaxy that allows us to construct a timeline.\n \n \n(not burning)\n\n Quite right. I overlooked this. More Archie ignorance of basic eighth grade science.\n \n \nwhich is about 3 billion years.\n\n The estimate that I've always seen and heard is 5 billion before the sun leaves the main sequence, but I'll grant that it's an estimate.", 
   {}, 
   313840, 
   null, 
   1214150640.0
  ], 
  [
   313845, 
   null, 
   "Archangel", 
   "In that case, I suggest you address the wealth of evidence that is stacked against you, rather than making abstract statements.\n\n \n There is no wealth of evidence stacked against me at all iangb. All we have here is more rambling tirades from lyteboy as he attempts to make himself sound intelligent. He is too ignorant to even understand that he will never impress me as long as he must twist what I say in every response to me. What a cowardly debating style it is to first reinterpret what someone say's and then pounce on that reinterpretation as if it's attacking what they actually said. But this is his SOP and is tiresome and not worth responding to as it simply feeds his childish ego and derails the debate. \n \n I'll let objective observers read these posts and they will clearly see the difference between what I say and what he falsely interprets me as saying. Just like his atheism, all he proves is his ability to kid himself and deny reality as it truly is.", 
   {}, 
   313842, 
   null, 
   1214151480.0
  ], 
  [
   313849, 
   null, 
   "electrolyte", 
   "He is too ignorant to even understand that he will never impress me as long as he must twist what I say in every response to me.\n\n Archie, I know that I will never impress you no matter what I do. I don't have to twist a damn thing to show the inanity and insanity of your claims and beliefs. But that's beside the point: are you so arrogant, so vain, so deluded as to think that I post in an effort to impress you? No, I beat your XXX mercilessly because (1) I promote actual education and (2) humiliating numbskulls has become very fun.\n \n \nWhat a cowardly debating style it is to first reinterpret what someone say's and then pounce on that reinterpretation as if it's attacking what they actually said.\n\n Oh, so you didn't say that quantum physics was my god? Oh, wait, you did.\n Oh, so you didn't say that you can't actually prove that the sun will rise tomorrow? Oh, wait, you did.\n Oh, so you didn't say that you can make reasonable predictions [based on inductive reasoning without a priori proofs]? Oh, wait, you did.\n Oh, so you didn't say that there would be a sunrise without Earth? Oh, wait, you did.\n Oh, so you didn't say that there are no intermediate forms? Oh, wait, you did.\n Also, you didn't say that homosexuals and homosexuality are abusive? Oh, wait, you did.\n And you didn't say that that homosexuals are immoral? Oh, wait, you did.\n And you didn't say that that promoting acceptance of homosexuality has negative psychiatric and psychological effects? Oh, wait, you did.\n And you didn't say that homosexuality is destructive and then refuse on multiple occasions to explain how this could be true? Oh, wait, you did.\n \n \nBut this is his SOP and is tiresome and not worth responding to as it simply feeds his childish ego and derails the debate.\n\n So you're now denying that you said these things? You think I'm just equivocating? Of course you don't think it's worth responding to my posts that expose you for the reprehensible being you make yourself out to be. I'd be ashamed if I were you, too.\n \n \nI'll let objective observers read these posts and they will clearly see the difference between what I say and what he falsely interprets me as saying.\n\n I'm fine with that. So when iangb and Kronus and T.Q and Ripskar and Penfold and Symbiote and even Peeling agree with me, that's not enough?\n No, wait, I got it: You don't consider them \"objective\" observers. What's your standard for making this determination? They don't agree with you. Nice. A self-preserving delusion.\n \n \nJust like his atheism, all he proves is his ability to kid himself and deny reality as it truly is.\n\n And the textbook parting ad hom. Classic Archie.", 
   {}, 
   313845, 
   null, 
   1214153640.0
  ], 
  [
   313886, 
   null, 
   "Archangel", 
   "All you've done is shown how ignorant you yourself are. \n \n As has been told to you already, you can not prove that the sun will rise tomorrow. Using previous data and observations, you can predict that there is no reason why it wouldn't.\n \n My question showed how bankrupt the opening post is. But why am I not surprised that you missed the point\n\n \n What I have shown tq, is that I can have a more intelligent conversation with a brick wall than with the likes of you or electrolyte. emoticon_xbye", 
   {}, 
   313833, 
   null, 
   1214190420.0
  ], 
  [
   313889, 
   null, 
   "Penfold", 
   "A peer to pier discussion? The wall would win.", 
   {}, 
   313886, 
   null, 
   1214191680.0
  ], 
  [
   313903, 
   null, 
   "electrolyte", 
   "What I have shown tq, is that I can have a more intelligent conversation with a brick wall than with the likes of you or electrolyte.\n\n No no, you're confused. The fact that the brick wall doesn't expose your stupid statements for what they are like T.Q and I do in no way makes the comments you make to it any more intelligent.", 
   {}, 
   313886, 
   null, 
   1214202480.0
  ], 
  [
   313914, 
   null, 
   "iangb", 
   "So why bother? Rather than embarassing yourself by making pronouncements on subjects you don't have the foggiest notion about, why not read and learn, or study up? Rather than try and save face by attempting to insult someone who disagrees with you, why not just pass on by?\n\n I'm starting to suspect that we are victims of Poe's Law, both in the case of Archie and Ethmi.\n \n Without a winking smiley or other blatant display of humor, it is impossible to create a parody of Fundamentalism that SOMEONE won't mistake for the real thing.\n \n Archangel, if you refuse to address valid evidence for the pure reason that you don't like the worldview of the person presenting it to you... that would explain a lot. It won't get you very far in any debate, however. Simply carrying out the equivalent of jamming your fingers in your ears and shouting abuse gets you nowhere.", 
   {}, 
   313903, 
   null, 
   1214223660.0
  ], 
  [
   313939, 
   null, 
   "jim's trucking", 
   "I want to know if anyone who believes in evolution can prove. With sources, and only with sources. That there was a gradual proccess. Prove with the fossil records that there were species that turned into other species over time. The rules of the game is that whoever is the first to do a personal insult. Loses the debate, and is automaticly declared the loser. People should be able to have a debate without childish insults.\nWho went first on this battle of insults?:p", 
   {}, 
   313029, 
   null, 
   1214235120.0
  ], 
  [
   313940, 
   null, 
   "iangb", 
   "Hmm.\n \n \nEither you completely missed the point of T.Q's challenge, or you knew better and are purposely being patronizing. (Possibly both.) Neither makes you look good.\n\n ...\n \nI've also proven that TQs question is both ignorant and stupid at the same time. Asking for proof that the sun will rise tomorrow is equivalent to asking for proof that air will still exist tomorrow. It's a moronic question. But in typical fashion, not one of you so called intellectuals will even question it.\n\n \n I'd call it a draw. I guess it depends what you want to call an 'insult'.", 
   {}, 
   313939, 
   null, 
   1214235600.0
  ], 
  [
   313942, 
   null, 
   "Peeling", 
   "Asking for proof that the sun will rise tomorrow is equivalent to asking for proof that air will still exist tomorrow.\n\n In terms of demonstrating the relevant point, absolutely.\n \nIt's a moronic question. But in typical fashion, not one of you so called intellectuals will even question it.\n\n Ok, let's question it. What is it that makes that demand for proof 'moronic'? I'd hazard a guess that you feel the rising of the sun and the continued existence of air are such self-evident givens that asking for proof is silly, right? You're irritated that someone could miss the point so grossly as to even ask for proof.\n \n If that's how you feel, then welcome to planet Peeling. All that remains is to ask yourself why those events are 'givens'. What is it that elevates them beyond reproach? It isn't the existence of a proof, obviously - which means you and I both agree that it can be fair and reasonable and sensible to declare something a fact without it having been proved.\n \n The fact of the matter is, we have more pieces of evidence confirming common descent than the human race has seen sunrises. Quite possibly more pieces than you've taken breaths. So if it's moronic to ask for proof that the sun will rise and that you'll continue to breathe tomorrow, what is it to ask for proof of something even less in doubt?", 
   {}, 
   313818, 
   null, 
   1214236200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Can Evolution Prove Through Fossils That There Was A Gradual Development?!", 
  "url": "http://www.4forums.com/political/challengers-corner/11278-can-evolution-prove-through-fossils-there-gradual-development.html", 
  "breadcrumbs": [
   "Challengers Corner"
  ], 
  "id_number": 11278, 
  "discussion_files": [
   [
    "26287.html", 
    "http://www.4forums.com/political/challengers-corner/11278-can-evolution-prove-through-fossils-there-gradual-development-print.html"
   ], 
   [
    "26288.html", 
    "http://www.4forums.com/political/challengers-corner/11278-can-evolution-prove-through-fossils-there-gradual-development-4-print.html"
   ], 
   [
    "26289.html", 
    "http://www.4forums.com/political/challengers-corner/11278-can-evolution-prove-through-fossils-there-gradual-development-3-print.html"
   ], 
   [
    "26290.html", 
    "http://www.4forums.com/political/challengers-corner/11278-can-evolution-prove-through-fossils-there-gradual-development-2-print.html"
   ]
  ], 
  "identifier": 11278
 }
]