[
 [
  [
   19473, 
   null, 
   "epaphras_faith", 
   "I have, on another thread stated that my position as a christian is that those who are saved are saved to and for eternity and cannot lose their salvation.\n \n I have copied that post here for purposes of this debate. let us have at it. i welcome input from non christians as well.\n \n The following is true of salvation:\n \n 1) God loves to the uttermost John 13:1\n 2) He purposes to keep in spite of everything John 10:28-30\n 3) He intends to present us faultless before Himself Jude 24\n 4) His Son ever lives to make intercession to keep us saved Heb:7:25 and 1John 2:1\n 5) His spirit has placed us into the body of Christ 1Cor 12:13\n 6) His spirit has sealed us until the day of redemption Eph 4:30\n 7) His word guarantees that nothing (including ourselves) can separate us from Christ Rom8:28-39\n Nowhere does the bible show that all of these works of God could be undone.\n \n Problems: 1) Hebrews 6:4-6 if this teaches loss of salvation it also teaches that it cannot be regained.\n 2) John 15:6 This probably refers to the judgement seat of Christ\n 3) James 2:14-26 Nonworking faith is not a faith that saves in the first place\n 4) 2Peter 2 and Jude are referring to false teachers who in Jude's estimation were not true believers (Jude 19 also see Rom 8:9)\n 5) Mat 24:13 End of what???? The great tribulation. See the context to verify.\n \n Over 200 times inthe NT Faith or belief is listed as the sole condition for salvation. \n \n Other additions such as surrender, baptism, repentence, and confession are a result of the work of salvation in us. ", 
   {
    "post_info": {
     "post_title": "Eternal Security?"
    }
   }, 
   null, 
   null, 
   1066267980.0
  ], 
  [
   19489, 
   null, 
   "SilentPoet", 
   "I have, on another thread stated that my position as a christian is that those who are saved are saved to and for eternity and cannot lose their salvation.\n \n \n \n How are you saved? What exactly does \"salvation\" mean? If you are to have salvation but than kill 5 million people and change your religion have you not lost your salvation?\n What possible sense does not loosing your salvation for any reason mean. Does this mean after you are saved you are free to sin?\n \n Sorry if I misunderstood. If I did not please explain.", 
   {}, 
   19473, 
   null, 
   1066273860.0
  ], 
  [
   19535, 
   null, 
   "montalban", 
   "I have, on another thread stated that my position as a christian is that those who are saved are saved to and for eternity and cannot lose their salvation.\n \n I have copied that post here for purposes of this debate. let us have at it. i welcome input from non christians as well.\n \n The following is true of salvation:\n \n 1) God loves to the uttermost John 13:1\n 2) He purposes to keep in spite of everything John 10:28-30\n 3) He intends to present us faultless before Himself Jude 24\n 4) His Son ever lives to make intercession to keep us saved Heb:7:25 and 1John 2:1\n 5) His spirit has placed us into the body of Christ 1Cor 12:13\n 6) His spirit has sealed us until the day of redemption Eph 4:30\n 7) His word guarantees that nothing (including ourselves) can separate us from Christ Rom8:28-39\n Nowhere does the bible show that all of these works of God could be undone.\n \n Problems: 1) Hebrews 6:4-6 if this teaches loss of salvation it also teaches that it cannot be regained.\n 2) John 15:6 This probably refers to the judgement seat of Christ\n 3) James 2:14-26 Nonworking faith is not a faith that saves in the first place\n 4) 2Peter 2 and Jude are referring to false teachers who in Jude's estimation were not true believers (Jude 19 also see Rom 8:9)\n 5) Mat 24:13 End of what???? The great tribulation. See the context to verify.\n \n Over 200 times inthe NT Faith or belief is listed as the sole condition for salvation. \n \n Other additions such as surrender, baptism, repentence, and confession are a result of the work of salvation in us. \n\n \n Far out man, colour!\n \n So, if you've made a once in a life-time saving, then it doesn't matter if 40 years from now you kill your family!\n \n Or, if in 20 years time you convert to Islam.\n \n Amazing... because you're still 'saved'", 
   {}, 
   19473, 
   null, 
   1066305240.0
  ], 
  [
   19554, 
   null, 
   "epaphras_faith", 
   "How are you saved? What exactly does \"salvation\" mean? If you are to have salvation but than kill 5 million people and change your religion have you not lost your salvation?\n What possible sense does not loosing your salvation for any reason mean. Does this mean after you are saved you are free to sin?\n \n Sorry if I misunderstood. If I did not please explain.\n\n \n Actually a reply to both Poet and Mont.\n \n Yes, it means precisely that you will never lose your salvation. The question if you kill your family etc is \"were you saved to begin with.\" Only God will know that. God does purpose to keep us no matter what. While your arguments make some sense they do not argue the scripture. How do you read the scripture that says nothing can separate us from Christ? How do you read the srcipture that says he intends to keep us. There is more scripture that says \"Nothing can snatch you from the father's hand.\n \n Now as the apostle Paul would say, \"Does that mean we should keep on sinning?\" \"May it Never Be!\" How are we who are dead to sin to keep on presenting ourselves to sin? \n \n Mont: Your argument is really one of incredulousness and neither scriptural or according to \"Tradition.\" It is simply a non argument. If you want to argue theology with me then provide some evidence. I do appreciate you keeping it short though. I don't need the full version of the catechism but some scripture references along with an alternate explanation for what I have provided.\n \n Poet: Yes, God is that merciful. You see, our view of God is way to small. My contention is that if you are saved, truly, by grace through faith, then even if you commit a sin then God will, in His mercy and Grace keep you. Jesus' death on the cross covered all sin, both past and future. That is what the bible teaches.", 
   {}, 
   19489, 
   null, 
   1066321800.0
  ], 
  [
   19671, 
   null, 
   "montalban", 
   "Mont: Your argument is really one of incredulousness and neither scriptural or according to \"Tradition.\" It is simply a non argument. If you want to argue theology with me then provide some evidence. I do appreciate you keeping it short though. I don't need the full version of the catechism but some scripture references along with an alternate explanation for what I have provided.\n\n \n I am trying to argue on the basis of logic, or lack of it in the position you have taken.\n \n Fortunately for some they have a once in the life-time ticket that means they are free to sin... even if you don't want to sin, you will, and you don't have to worry about it, because you're already saved.\n \n It's probably the easiest way to atonement that I've ever heard of.", 
   {}, 
   19554, 
   null, 
   1066400400.0
  ], 
  [
   19743, 
   null, 
   "epaphras_faith", 
   "I am trying to argue on the basis of logic, or lack of it in the position you have taken.\n \n Fortunately for some they have a once in the life-time ticket that means they are free to sin... even if you don't want to sin, you will, and you don't have to worry about it, because you're already saved.\n \n It's probably the easiest way to atonement that I've ever heard of.\n\n \n \n I would not say there is a lack of logic at all. Look at Paul's response to the same question, \"May it Never Be\". I think this is in Romans but will look it up and give reference. It was the exact same thing. There were some Judaizers who were saying that the free gift of grace left one with a license to sin. Paul counters this argument completely. I will look it up and post again later.", 
   {}, 
   19671, 
   null, 
   1066414920.0
  ], 
  [
   19752, 
   null, 
   "epaphras_faith", 
   "I found it in Romans Chapter 6:\n \n 6 For we know that our old self was crucified with him so that the body of sin might be done away with, that we should no longer be slaves to sin--\n 7 because anyone who has died has been freed from sin.\n 8 Now if we died with Christ, we believe that we will also live with him.\n 9 For we know that since Christ was raised from the dead, he cannot die again; death no longer has mastery over him.\n 10 The death he died, he died to sin once for all; but the life he lives, he lives to God.\n 11 In the same way, count yourselves dead to sin but alive to God in Christ Jesus.\n 12 Therefore do not let sin reign in your mortal body so that you obey its evil desires.\n 13 Do not offer the parts of your body to sin, as instruments of wickedness, but rather offer yourselves to God, as those who have been brought from death to life; and offer the parts of your body to him as instruments of righteousness.\n 14 For sin shall not be your master, because you are not under law, but under grace.\n \n \n Slaves to Righteousness\n \n 15 What then? Shall we sin because we are not under law but under grace? By no means!\n 16 Don't you know that when you offer yourselves to someone to obey him as slaves, you are slaves to the one whom you obey--whether you are slaves to sin, which leads to death, or to obedience, which leads to righteousness?\n 17 But thanks be to God that, though you used to be slaves to sin, you wholeheartedly obeyed the form of teaching to which you were entrusted.\n 18 You have been set free from sin and have become slaves to righteousness.\n 19 I put this in human terms because you are weak in your natural selves. Just as you used to offer the parts of your body in slavery to impurity and to ever-increasing wickedness, so now offer them in slavery to righteousness leading to holiness.\n 20 When you were slaves to sin, you were free from the control of righteousness.\n 21 What benefit did you reap at that time from the things you are now ashamed of? Those things result in death!\n 22 But now that you have been set free from sin and have become slaves to God, the benefit you reap leads to holiness, and the result is eternal life.\n 23 For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord.\n \n You see, this letter is written to believers, not non believers. However, he mentions the believer prior to becoming a believer in vs. 21. He talks there of the past and that the things we lived in resulted in death. But now...........ah now.................we are set free from that and the result is that we have \"eternal life.\" Then vs. 23 shows that it is a gift. I use scripture and you may even use Tradition if you (or anyone) desires. However, even Tradition cannot contradict scripture, so where there is an apparent contradiction, please provide the necessary interpretation or discussion to clarify this.", 
   {}, 
   19743, 
   null, 
   1066417620.0
  ], 
  [
   19755, 
   null, 
   "rapture", 
   "I do wait for the day that I should sin no more against God", 
   {}, 
   19752, 
   null, 
   1066418100.0
  ], 
  [
   19756, 
   null, 
   "rapture", 
   "I do pray for the day that I should sin no more", 
   {}, 
   19752, 
   null, 
   1066418160.0
  ], 
  [
   19758, 
   null, 
   "epaphras_faith", 
   "I do pray for the day that I should sin no more\n\n \n As do I, but remember Romans 8:1: There is therefore now, no condemnation for those who are in Christ Jesus...", 
   {}, 
   19756, 
   null, 
   1066419060.0
  ], 
  [
   19814, 
   null, 
   "epaphras_faith", 
   "How are you saved? What exactly does \"salvation\" mean? If you are to have salvation but than kill 5 million people and change your religion have you not lost your salvation?\n What possible sense does not loosing your salvation for any reason mean. Does this mean after you are saved you are free to sin?\n \n Sorry if I misunderstood. If I did not please explain.\n\n \n 1)Saved through Jesus Christ. \n 2)Salvation means that you are saved from sin and to God.\n 3)God's mercy and grace are greater according to the bible. Read the set of scriptures. \n 4)Eternal Security sets one up to now live free. Because it has been obtained fromGod it set us up to live freely for Him.\n 5)You are free to sin. That doesn't mean God wants you to do this. What it means actually (because you could always sin and prior to salvation actually had no choice) that you are now free not to sin.\n \n I hope this helps. it is a tough concept for a non-christian. It's hard for many christians. Let me know what you think.", 
   {}, 
   19489, 
   null, 
   1066441380.0
  ], 
  [
   19853, 
   null, 
   "montalban", 
   "As do I, but remember Romans 8:1: There is therefore now, no condemnation for those who are in Christ Jesus...\n\n \n So it doesn't matter that you continue to sin.", 
   {}, 
   19758, 
   null, 
   1066453440.0
  ], 
  [
   19859, 
   null, 
   "lappster", 
   "So it doesn't matter that you continue to sin.\n\n \n \n God tells me not to judge so I will leave that to you. IJohn deals nearly entirely on the subject on the Christian and sin. You will see that the Christian doesn't have to sin. Christ has conquerd sin on our behalf. This is one of the promises of the believer. Read it sometime if you get a chance. It may lead you to question weather or not you are or were actually saved. \n Romans 6:15\n What then? shall we sin, because we are not under the law, but under grace? God forbid.  \n We can see that we are not to continue sinning after our eyes have been open to the truth of Grace.\n Galatians 2:17\n But if, while we seek to be justified by Christ, we ourselves also are found sinners, is therefore Christ the minister of sin? God forbid.  \n These verse say that to believe a Christian can sin without remorse is against the gospel itself. Rather we see in scripture everyone who recieves Jesus as savior has a transformation.\n Romans 12:2\n And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God.  \n Through this constant renewal we become sactified.\n 2 Corinthians 5:17\n Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new.  \n You see this new creature is not prone to the same sin lifestyle as the old. This is why once you are saved you are urged to be baptized. Baptisim is the outward expression of the inward renewal. Baptism identifies you with the death, burial, and resurection of Jesus. When you arise out of the water you are often told to walk in newness of faith. (within baptist churches) Weather you dunk or you sprinkle the idea is the same. The saved person is not the same person as he was as a sinner.", 
   {}, 
   19853, 
   null, 
   1066454700.0
  ], 
  [
   19885, 
   null, 
   "epaphras_faith", 
   "God tells me not to judge so I will leave that to you. IJohn deals nearly entirely on the subject on the Christian and sin. You will see that the Christian doesn't have to sin. Christ has conquerd sin on our behalf. This is one of the promises of the believer. Read it sometime if you get a chance. It may lead you to question weather or not you are or were actually saved. \n Romans 6:15\n What then? shall we sin, because we are not under the law, but under grace? God forbid.  \n We can see that we are not to continue sinning after our eyes have been open to the truth of Grace.\n Galatians 2:17\n But if, while we seek to be justified by Christ, we ourselves also are found sinners, is therefore Christ the minister of sin? God forbid.  \n These verse say that to believe a Christian can sin without remorse is against the gospel itself. Rather we see in scripture everyone who recieves Jesus as savior has a transformation.\n Romans 12:2\n And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God.  \n Through this constant renewal we become sactified.\n 2 Corinthians 5:17\n Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new.  \n You see this new creature is not prone to the same sin lifestyle as the old. This is why once you are saved you are urged to be baptized. Baptisim is the outward expression of the inward renewal. Baptism identifies you with the death, burial, and resurection of Jesus. When you arise out of the water you are often told to walk in newness of faith. (within baptist churches) Weather you dunk or you sprinkle the idea is the same. The saved person is not the same person as he was as a sinner.\n\n \n lappster: well said. It is because we are saved eternally that the choice is given to us whether or not to sin. \n \n Mont: It does matter if one sins, it does not cause eternal damnation is all. Paul describes this fight in the believer in Romans Chapter 7. I do the very thing I don't want to do and don't do the thing I want. Paul says, \"I find the principle that sin Lives in me, my flesh.\" He then asks at the end of Ch7 \"who will set me free from the body of this death? Thanks be to our Lord Jesus Christ.\" NOtice that he asks who and then answers with a thanks because it is finished. HE then goes on in Rom 8:1 \"Therefore (remember what the therefore is there for) there is now no condemnation for those who are in christ jesus.\" \n \n If your only argument is that without fear we will just sin our socks off, you need to read more of Paul's writings.", 
   {}, 
   19859, 
   null, 
   1066464420.0
  ], 
  [
   20062, 
   null, 
   "epaphras_faith", 
   "bump:\n \n I have only heard from montalban and lappster. No scripture to refute as of yet.\n \n Has anyone looked at Hebrews Chapter 9. Look at verses 7 through 12 or 13. These also indicate that our redemption is eternal.", 
   {}, 
   19885, 
   null, 
   1066671420.0
  ], 
  [
   20268, 
   null, 
   "maximus", 
   "Epaphras and Lappster,\n \n What is your view of the following scripture in relation to Eternal Security?\n \n Philippians 3:8-16  \"Indeed I count everything as loss because of the surpassing worth of knowing Christ Jesus my Lord. For his sake I have suffered the loss of all things, and count them as refuse, in order that I may gain Christ and be found in him, not having a righteousness of my own, based on law, but that which is through faith in Christ, the righteousness from God that depends on faith; that I may know him and the power of his resurrection, and may share his sufferings, becoming like hiim in his death, that if possible I may attain the resurrection of the dead.\n Not that I have already obtained this   or am already perfect; but I press on to make it my own, because Christ Jesus has made me his own. Brethren, I do not consider that I have made it my own; but one thing I do, forgetting what lies behind and straining forward to what lies ahead, I press on toward the goal   for the prize of the upward call of God in Christ Jesus. Let those of us who are mature be thus minded; and if in anything you are otherwise minded, God will reveal that also to you. Only let us hold true to what we have attained.\"", 
   {}, 
   20062, 
   null, 
   1066851960.0
  ], 
  [
   20270, 
   null, 
   "epaphras_faith", 
   "Epaphras and Lappster,\n \n What is your view of the following scripture in relation to Eternal Security?\n \n Philippians 3:8-16  \"Indeed I count everything as loss because of the surpassing worth of knowing Christ Jesus my Lord. For his sake I have suffered the loss of all things, and count them as refuse, in order that I may gain Christ and be found in him, not having a righteousness of my own, based on law, but that which is through faith in Christ, the righteousness from God that depends on faith; that I may know him and the power of his resurrection, and may share his sufferings, becoming like hiim in his death, that if possible I may attain the resurrection of the dead.\n Not that I have already obtained this   or am already perfect; but I press on to make it my own, because Christ Jesus has made me his own. Brethren, I do not consider that I have made it my own; but one thing I do, forgetting what lies behind and straining forward to what lies ahead, I press on toward the goal   for the prize of the upward call of God in Christ Jesus. Let those of us who are mature be thus minded; and if in anything you are otherwise minded, God will reveal that also to you. Only let us hold true to what we have attained.\"\n\n \n I will answer you but then you must answer my arguments from the beginning. You do not address the scripture that I provide. You simply claim this contradicts it. Scripture says, and I already provided the reference that nothing can keep us from the love of Christ. \n \n As to this reference, it is referring to sanctification not justification. Paul was writing to believers. The ressurrection from the dead is not meant to be about justification. Paul knows his audience. Paul is talking about how to live life not achieve justification. \n \n I can choose to continue in the death that was once me. Or I can now live as if alive. That is what the whole of Philippians is about. I know this and am currently doing a study in this book.\n \n Romans also tells that who God calls, he justifies, whom he justifies, he sanctifies, whom he sanctifies he glorifies. Paul knew he was going to be with Jesus, that is why he ran the race he did. Not in order to be with Jesus but because he was already there.", 
   {}, 
   20268, 
   null, 
   1066855860.0
  ], 
  [
   20335, 
   null, 
   "maximus", 
   "I will answer you but then you must answer my arguments from the beginning. You do not address the scripture that I provide. You simply claim this contradicts it. Scripture says, and I already provided the reference that nothing can keep us from the love of Christ. \n \n As to this reference, it is referring to sanctification not justification. Paul was writing to believers. The ressurrection from the dead is not meant to be about justification. Paul knows his audience. Paul is talking about how to live life not achieve justification. \n \n I can choose to continue in the death that was once me. Or I can now live as if alive. That is what the whole of Philippians is about. I know this and am currently doing a study in this book.\n \n Romans also tells that who God calls, he justifies, whom he justifies, he sanctifies, whom he sanctifies he glorifies. Paul knew he was going to be with Jesus, that is why he ran the race he did. Not in order to be with Jesus but because he was already there.\n\n \n Epaphras,\n My response to your original post is in #1 below. (If my response is not specific enough then I will attempt a more thorough job if you insist). But my initial reaction is to reply as follows due to time and the fact that we have quoted seemingly conflicting scripture back and forth on this subject on other threads:\n \n 1. All of the verses you cited are true (but not necessarily in the sense of eternal security). That is, I have been saved   through grace by the sacrifice of Christ. He has redeemed the world, brought salvation into the world and made it possible as a free gift, undeserved.\n \n 2. I am being saved   by cooperating with Christ in sanctification during my life.\n \n 3. I will be saved   at the last Judgment. That is, I hope I will be saved provided I fulfill the proper requirements Romans 11:22. Paul almost always speaks of hope, not assurance.\n \n Now I can give abundant scriptural references for all 3 steps above if needed. But perhaps the above explanation may suffice in relating my view (that of the Catholic Church).\n \n As I indicated above, after addressing the scripture you cited, I would usually respond further to you with \"opposing\" Scripture (since that is your authority) and with Tradition (since it is also truth though you do not accept it). I think you have seen the numerous verses I quoted on the other thread in dealing with the loss of salvation? If not I can repost them. But we have been through that. So I must ask you, when two people have a disagreement on scripture, like we do, to what authority do they go to resolve the seeming conflict? Notice I say \"seeming\" because the Word of God is true and does not conflict.\n \n \n A few other questions also came to mind that I would like to share with you:\n \n 1.\"He who endures to the end will be saved\" (Matt. 24:13) What does it mean to endure the tribulation verses the evil and temptation of current life? If one does not endure the tribulation does he lose salvation?\n \n 2.Were Adam and Eve, who received the free gift of grace, able to unreconcile themselves with God the Father?\n \n 3.What do you think of the story of the Prodigal Son in relation to this topic?\n \n 4. If you committ the unforgivable sin do you lose your salvation? (or is this sin reserved only for those who have never received salvation?)\n \n 5. If God wills that all should be saved then how do some perish? \n (2 Peter 3:9)\n \n 6.If we have no ability to reject our salvation then how does this affect your view of free will?", 
   {}, 
   20270, 
   null, 
   1066891080.0
  ], 
  [
   20353, 
   null, 
   "epaphras_faith", 
   "Epaphras,\n My response to your original post is in #1 below. (If my response is not specific enough then I will attempt a more thorough job if you insist). But my initial reaction is to reply as follows due to time and the fact that we have quoted seemingly conflicting scripture back and forth on this subject on other threads:\n \n 1. All of the verses you cited are true (but not necessarily in the sense of eternal security). That is, I have been saved   through grace by the sacrifice of Christ. He has redeemed the world, brought salvation into the world and made it possible as a free gift, undeserved.\n \n 2. I am being saved   by cooperating with Christ in sanctification during my life.\n \n 3. I will be saved   at the last Judgment. That is, I hope I will be saved provided I fulfill the proper requirements Romans 11:22. Paul almost always speaks of hope, not assurance.\n \n Now I can give abundant scriptural references for all 3 steps above if needed. But perhaps the above explanation may suffice in relating my view (that of the Catholic Church).\n \n As I indicated above, after addressing the scripture you cited, I would usually respond further to you with \"opposing\" Scripture (since that is your authority) and with Tradition (since it is also truth though you do not accept it). I think you have seen the numerous verses I quoted on the other thread in dealing with the loss of salvation? If not I can repost them. But we have been through that. So I must ask you, when two people have a disagreement on scripture, like we do, to what authority do they go to resolve the seeming conflict? Notice I say \"seeming\" because the Word of God is true and does not conflict.\n \n \n A few other questions also came to mind that I would like to share with you:\n \n 1.\"He who endures to the end will be saved\" (Matt. 24:13) What does it mean to endure the tribulation verses the evil and temptation of current life? If one does not endure the tribulation does he lose salvation?\n \n 2.Were Adam and Eve, who received the free gift of grace, able to unreconcile themselves with God the Father?\n \n 3.What do you think of the story of the Prodigal Son in relation to this topic?\n \n 4. If you committ the unforgivable sin do you lose your salvation? (or is this sin reserved only for those who have never received salvation?)\n \n 5. If God wills that all should be saved then how do some perish? \n (2 Peter 3:9)\n \n 6.If we have no ability to reject our salvation then how does this affect your view of free will?\n\n \n The problem I have with just quoting contradicting scripture is this. When I present scripture that says that Nothing can separate us from the love of God and that God will keep us against all things. I am looking for an alterante explanation of what this means given that you think that the word \"nothing\" apparently means \"nothing but me.\" I accept that you are saying that we must fulfill certain things, hold up our end of the bargain as it were. How then do you interpret the scripture I present? This is what I am asking. What does nothing mean? You simply say it does not apply to salvation. Horse Hockey. In the verses I quoted they most specifically apply to that given the context of the scripture.\n \n If you are going to quote an alternative scripture and tell me that I am wrong about what I quote then you need to give me an alternate explanation. I believe I do that, generally. If I ever do not do that then let me know, call me on it. If I quote one scripture to contradict yours then I will explain where I think you are off in your interpretation about that specific scripture. I will tell you what I think it means given what I have quopted and a reason why your are wrong in your interpretation.\n \n As for the issue of Holy Tradition, for me the jury has left the room again and is reconsidering. I am not saying I accept it completely but yours and Mantalban's arguments have been convincing. Parcum's less so but have had some impact. I will let you know more as I ruminate on it further. In the meantime, I prefer we argue biblical doctrine from the bible.", 
   {}, 
   20335, 
   null, 
   1066924260.0
  ], 
  [
   20354, 
   null, 
   "epaphras_faith", 
   "Maximus:\n \n I didn't ignore your questions but will need some time to answer them.", 
   {}, 
   20353, 
   null, 
   1066924320.0
  ], 
  [
   20403, 
   null, 
   "lappster", 
   "Quote Maximus:\n 1. All of the verses you cited are true (but not necessarily in the sense of eternal security). That is, I have been saved through grace by the sacrifice of Christ. He has redeemed the world, brought salvation into the world and made it possible as a free gift, undeserved.\n \n 2. I am being saved by cooperating with Christ in sanctification during my life.\n \n 3. I will be saved at the last Judgment. That is, I hope I will be saved provided I fulfill the proper requirements Romans 11:22. Paul almost always speaks of hope, not assurance.\n \n \n \n \n Being made in the image of God means like He we have three diffrent parts to us. Soul, Mind, and Body.\n In your ilustration we see #1 that our soul is saved at justification, one may well say after this I have been saved. #2 The mind is saved through sactification. a procces which takes time. Remeber Paul said I must renew my mind daily. In this proccess I may say I am being saved. #3 at the rapture I will recieve my glorified body. I will be saved from the eternal death at this point. However a person needs only once to be saved to become subject to the following two. If the soul has been saved the mind is and the body will be saved.", 
   {}, 
   20354, 
   null, 
   1066969740.0
  ], 
  [
   20406, 
   null, 
   "lappster", 
   "Quote Maximus:\n 3.What do you think of the story of the Prodigal Son in relation to this topic?\n \n \n \n \n \n The Story of the lost son has many applications. It is a parable rich with messianic overtones. In relation to this topic I must answer this way. The boy while misdirected was his fathers son. Even in the dispaire he fell into he remained a son. I imagine a father standing at the door of his house awaiting the return of his son. Too equate this to your earlier question let me put it this way. Justified into the family earlier in the son's life. Sactified in the pig pen when he came to his senses. And glorified upon his return to his fathers house. Always a child of the father.", 
   {}, 
   20403, 
   null, 
   1066970460.0
  ], 
  [
   20422, 
   null, 
   "epaphras_faith", 
   "Epaphras, A few other questions also came to mind that I would like to share with you:\n \n 1.\"He who endures to the end will be saved\" (Matt. 24:13) What does it mean to endure the tribulation verses the evil and temptation of current life? If one does not endure the tribulation does he lose salvation?\n \n 2.Were Adam and Eve, who received the free gift of grace, able to unreconcile themselves with God the Father?\n \n 3.What do you think of the story of the Prodigal Son in relation to this topic?\n \n 4. If you committ the unforgivable sin do you lose your salvation? (or is this sin reserved only for those who have never received salvation?)\n \n 5. If God wills that all should be saved then how do some perish? \n (2 Peter 3:9)\n \n 6.If we have no ability to reject our salvation then how does this affect your view of free will?\n\n \n Maximus: Here are your answers.\n \n 1) The verse from Matthew is in regards to the end times. At that time all believers will have been raptured off the face of the earth. (This is my reading of scripture and the reading of many Seminary professors I respect. However, there is some argument about the timing of the rapture) The people he is referring to are not already believers. He is speaking to the process of becoming a believer during that dispensation.\n \n 2) Adam and Eve never initially received the gift of grace. They were given the choice. The garden had two trees. The tree of the knowledge of good and evil and the tree of life. Notice they did not choose the tree of life (the free gift of grace). You see they were created in unconfirmed righteousness as they had never been tested. At the testing they were confirmed unrighteous. You and I have been RECREATED in confirmed righteousness, that is the righteousness of Jesus Christ. \n \n 3) I do not read the prodigal as Lappster, although I agree with his conclusion, I disagree with his interpretation. Hermaneutically speaking a parable has one point and one point only. Placed in contexts of the remainder of the parables, the lost coin and the lost sheep, the prodigal speaks of the fact that all humans are children of God. That all humans are lost because they, like adam, sinned and would have sinned had they been adam. Adam like the prodigal son asked for his inheritance early. Adam like the prodigal was lost to his father. When the son returned, the father rejoiced. Like rejoicing over the lost coin and the lost sheep. The father looks for us to return. \n \n 4) the unforgivable sin is interesting. 1st the bible teaches that if one can lose their salvation to the unforgivable sin then it also teaches that one can never get it back. Look at the verses that follow that. More likely the conditions that existed at that time (Jesus on Earth at the time and a lack of indwelling of the Holy Spirit) cannot exist at this time and the unforgivable sin cannot be committed by people now.\n \n 5) You misquote Peter. It does not say that God wills, It says God wishes. God does not want any to Perish, but we have the choice.\n \n 6) As for free will it continues. Free will is free will to act within the designs of your nature. I cannot be a badger, no matter how hard I try. I can only act badger like to a degree because I am not a badger. When God recreates us, He gives us a new nature (I will take their heart of stone and give them a heart of flesh). We now have a nature that is incapable of rejecting our salvation. We still have the free will to act within our nature. We can actually reject God and sin and sin and sin. We can sin so much that it leads to actual physical death. God knows this. There is a point where God will say, \"Enough, I will not allow them to continue in sin.\" and He will take our life. It is the very reason God removed Adam and Eve from the Garden. They had confirmed themselves in unrighteouness and he drove them out so as to prevent them from eating of the tree of life and therefore continuing in that state forever. It is the perfect act of Mercy and Grace.\n \n Now, if you would, could you provide me a way that you read the verses I quoted to show that they do not lead to eternal security. I am curious how you get there?", 
   {}, 
   20335, 
   null, 
   1067012160.0
  ], 
  [
   20498, 
   null, 
   "maximus", 
   "Epaphras,\n Are you reading my posts?\n \n \nThe problem I have with just quoting contradicting scripture is this. When I present scripture that says that Nothing can separate us from the love of God and that God will keep us against all things. I am looking for an alterante explanation of what this means given that you think that the word \"nothing\" apparently means \"nothing but me.\" I accept that you are saying that we must fulfill certain things, hold up our end of the bargain as it were. How then do you interpret the scripture I present? This is what I am asking. What does nothing mean?\n \n \n I told you in my last post that I would refrain from simply quoting contradicting scripture. \n \n \nYou simply say it does not apply to salvation. Horse Hockey. In the verses I quoted they most specifically apply to that given the context of the scripture.\n\n \n I never said that the verses you quoted did not apply to salvation. I acknowledged that they could apply to salvation. However, salvation and eternal security are not identical. And I did give you an answer on what I thought of the verses though it seems as though I did not do a thorough job. It was in my last post:\n \n Epaphras,\n My response to your original post is in #1 below. (If my response is not specific enough then I will attempt a more thorough job if you insist). But my initial reaction is to reply as follows due to time and the fact that we have quoted seemingly conflicting scripture back and forth on this subject on other threads:\n \n 1. All of the verses you cited are true  (but not necessarily in the sense of eternal security). That is, I have been saved  through grace by the sacrifice of Christ. He has redeemed the world, brought salvation  into the world and made it possible as a free gift, undeserved.\n \n In actuality, it is usually your side of the debate that claims verses that show a lack of eternal security are not dealing with salvation. I have encountered this with you and lappster several times. Do you remember attempting to refute the idea that Paul was talking about an imperishable prize rather than a perishable one in 1 Corinthians 9. Then you had this to say about Philippians:\n \n \nAs to this reference, it is referring to sanctification not justification. Paul was writing to believers. The ressurrection from the dead is not meant to be about justification. Paul knows his audience. Paul is talking about how to live life not achieve justification.\n\n \n But I realize, Epaphras, that this is your interpretation of scripture. And I do appreciate that you attempt to answer sincerely and without evasion. I try to do the same. But you didn't answer one question of my post: Where do we go when we have seeming contradictions of scripture interpretation? Who is the authority?\n \n \nAs for the issue of Holy Tradition, for me the jury has left the room again and is reconsidering. I am not saying I accept it completely but yours and Mantalban's arguments have been convincing. Parcum's less so but have had some impact. I will let you know more as I ruminate on it further. In the meantime, I prefer we argue biblical doctrine from the bible.\n\n \n Think of Holy Tradition in this manner: it is one leg of a 3 legged stool. The Church is supported by three legs: Scripture, Tradition, and the teaching authority of the Church. It has been thus throughout the history of the Church even in the Old Testament. Martin Luther broke off two legs and was left with a one-legged stool of scripture. He then had to prop up his Church with his own man-made doctrine. (Stephen Ray)\n \n More later as it is very late where I live.", 
   {}, 
   20353, 
   null, 
   1067069100.0
  ], 
  [
   20532, 
   null, 
   "i-wonder", 
   "Those verses in and of themselves do seem to teach eternal security. But taking the NT as a whole seems to shed light that it is possible to lose salvation. \n \n Examples:\n ROM 11:22 \"Behold then the kindness and severity of God; to those who fell, severity, but to you, God's kindness, if you continue in His kindness; otherwise you also will be cut off.\" The people Paul is talking to are obviously saved because they had received God's kindness. However, Paul said that only IF they did not CONTINUE in the faith, they would be cut off. So, they had to continue to be followers... \n \n \n Gal 5:4 \"You have been severed from Christ, you who are seeking to be justified by law; you have fallen from grace.\" Severed from Christ? Fallen from grace? \n \n COL 1:23 \"if indeed you continue in the faith firmly established and steadfast, and not moved away from the hope of the gospel that you have heard, which was proclaimed in all creation under heaven, and of which I, Paul, was made a minister.\" IF you continue in the faith. Another verse that says we must continue. \n \n \n 1TI 4:1-2 \"But the Spirit explicitly says that in later times some will fall away from the faith, paying attention to deceitful spirits and doctrines of demons, by means of the hypocrisy of liars seared in their own conscience as with a branding iron,\" Some will fall away. How can they fall away if they were nevre saved. How can they fall away if they are once saved always saved? \n \n 1PE 4:18 \"And if it is with difficulty that the righteous is saved, what will become of the godless man and the sinner?\" A righteous man is saved with difficulty. A man must continue in the faith. \n \n Very Important verse: Rev 3:2-5 \"'Wake up, and strengthen the things that remain, which were about to die; for I have not found your deeds completed in the sight of My God. 'So remember what you have received and heard; and keep it, and repent. Therefore if you do not wake up, I will come like a thief, and you will not know at what hour I will come to you.'But you have a few people in Sardis who have not soiled their garments; and they will walk with Me in white, for they are worthy.'He who overcomes will thus be clothed in white garments; and I will not erase his name from the book of life, and I will confess his name before My Father and before His angels.\" Note the word ERASE. There would be no need to erase a name if it had not been written down first. It could only been written had someone been saved at some point. No name could ever be erased if it was once saved always saved. \n \n So, where do we go from here?", 
   {
    "unicode_changes_made": true
   }, 
   19473, 
   null, 
   1067129040.0
  ], 
  [
   20577, 
   null, 
   "montalban", 
   "What happens to born-again people who later convert to another faith? Are they un-saved?", 
   {}, 
   20532, 
   null, 
   1067177040.0
  ], 
  [
   20622, 
   null, 
   "maximus", 
   "Epaphras,\n \n \n1) The verse from Matthew is in regards to the end times. At that time all believers will have been raptured off the face of the earth. (This is my reading of scripture and the reading of many Seminary professors I respect. However, there is some argument about the timing of the rapture) The people he is referring to are not already believers. He is speaking to the process of becoming a believer during that dispensation.\n\n \n I do not believe the idea of the rapture is scripturally sound. Do you know when this idea began?\n \n \n3) I do not read the prodigal as Lappster, although I agree with his conclusion, I disagree with his interpretation. Hermaneutically speaking a parable has one point and one point only. Placed in contexts of the remainder of the parables, the lost coin and the lost sheep, the prodigal speaks of the fact that all humans are children of God. That all humans are lost because they, like adam, sinned and would have sinned had they been adam. Adam like the prodigal son asked for his inheritance early. Adam like the prodigal was lost to his father. When the son returned, the father rejoiced. Like rejoicing over the lost coin and the lost sheep. The father looks for us to return. \n \n \n And if we choose not to return?\n \n \n5) You misquote Peter. It does not say that God wills, It says God wishes. God does not want any to Perish, but we have the choice.\n\n \n And where is the choice if you do not have the power to rebel? If you cannot assent freely to the grace God has given you?\n \n \n6) As for free will it continues. Free will is free will to act within the designs of your nature. I cannot be a badger, no matter how hard I try. I can only act badger like to a degree because I am not a badger. When God recreates us, He gives us a new nature (I will take their heart of stone and give them a heart of flesh). We now have a nature that is incapable of rejecting our salvation. We still have the free will to act within our nature. We can actually reject God and sin and sin and sin. We can sin so much that it leads to actual physical death. God knows this. There is a point where God will say, \"Enough, I will not allow them to continue in sin.\" and He will take our life. It is the very reason God removed Adam and Eve from the Garden. They had confirmed themselves in unrighteouness and he drove them out so as to prevent them from eating of the tree of life and therefore continuing in that state forever. It is the perfect act of Mercy and Grace.\n\n \n So, do you say that God will reward us for our sin? That he will take us from our earthly life to give us the reward of heaven because we sin too much? \n \n Where does the concept of hell fit into your theology? How does one get banished to hell?\n \n \nNow, if you would, could you provide me a way that you read the verses I quoted to show that they do not lead to eternal security. I am curious how you get there?\n\n \n I think I did this in #1 above but I will attempt to elaborate as time permits.\n \n Peace.", 
   {}, 
   20422, 
   null, 
   1067215560.0
  ], 
  [
   20682, 
   null, 
   "epaphras_faith", 
   "Epaphras,\n \n \n \n I do not believe the idea of the rapture is scripturally sound. Do you know when this idea began?\n \n \n \n And if we choose not to return?\n \n \n \n And where is the choice if you do not have the power to rebel? If you cannot assent freely to the grace God has given you?\n \n \n \n So, do you say that God will reward us for our sin? That he will take us from our earthly life to give us the reward of heaven because we sin too much? \n \n Where does the concept of hell fit into your theology? How does one get banished to hell?\n \n \n \n I think I did this in #1 above but I will attempt to elaborate as time permits.\n \n Peace.\n\n \n Maximus: I am definitely reading your posts. The idea of the rapture is scripturally sound. 1Thes 4:13-18, 1Cor15:51-57, Jn14:1-3.\n \n As for choosing not to return, you are now taking my argument out of context. The issue for the prodigal and not returning is talking about non believers, not believers. It is man's original position that the parable refers to. We are all children of God. All mankind. God wishes for none to perish, but some will not return. Those that do are saved. Period. \n \n As for the choice afterwards, the issue there is that I have been given a new heart. I cannot act outside the confiness of my nature. I cannot be a mongoose for instance. I still have free will but I cannot choose to be a mongoose. I have been given a new nature, I cannot choose to be unborn again. Why? Because it is no longer in my nature. Gal2:20, It is no longer I who live but Christ who lives in me.\n \n No, not that he rewards our sin, but rather in his mercy he stops us from living in sin. It is his mercy that drove Adam and eve out of the garden BEFORE they ate from the tree of life so that they would not live forever in sin. This is the same mercy he shows us when he takes our lives becaue we live in sin. God does not punish the believer, Romans 8:1.\n \n One gets banished to hell by not accepting Christ.\n \n The part you didn't actually answer, that I can see, why the security is not eternal.\n \n Hebrews 9 in particular points to the fact the Jesus is at the right hand of the Father. It asks the Question \"who condemns\" and then points to Jesus intervening continuously on our behalf. This is how we are secure.\n \n Now, Our position with Christ is secure. How we experience that here on earth is our condition. We may not feel secure and therefore won't experience it.\n \n My questions are, if you or I are able to delete our salvation and then we have toearn it back again,\n \n 1) Why did Jesus have to die? It makes no sense because we are in the same state we were before his death, having to live up to a law that we cannot achieve (Romans).\n \n 2) How is this good news (gospel) ? Frankly, I find the interpretation that we can earn our way to hell and to heaven very unsettling, because I will go to hell. And so will you. That is Human nature. It is only as a gift individually not just globally that there is good news.", 
   {}, 
   20622, 
   null, 
   1067280300.0
  ], 
  [
   20778, 
   null, 
   "epaphras_faith", 
   "Maximus:\n \n As to the rapture see 1Thes 4:13-18. The words caught up are the same words used in 2Cor 12:2. 2nd thes 2:1-2 also vaguely references. Also reference Mark 13:27. The word Rapture apparently comes from the latin word for \"caught up\". Also in Revelation 3:10 there is reference to the fact that the church will be spared the coming tribulation.", 
   {}, 
   20682, 
   null, 
   1067365920.0
  ], 
  [
   20795, 
   null, 
   "lappster", 
   "What happens to born-again people who later convert to another faith? Are they un-saved?\n\n \n Eternal security says a Cristian will not be drawn away by the devil or the world. We have through Christ conquered those evils. If one were to be persuaded away from the truth that that truth did not posses his and Neither did God. No man's reason is stronger than God.", 
   {}, 
   20577, 
   null, 
   1067381400.0
  ], 
  [
   20838, 
   null, 
   "maximus", 
   "Epaphras,\n I answered you the best that I could on the original verses you cited. I have taken so long to give you a further response because I had to seek help from those more learned than myself and I had to do further study (in reality I do not debate this issue often). I will not pretend that I have come up with these answers on my own--Tim Staples replied to them. But they are all in accord with the teaching of the Catholic Church.\n \n \nThe following is true of salvation:1) God loves to the uttermost John 13:1\n\n \n TIM STAPLES RESPONDS:\n God is love according to I John 4:8. He loves everyone. Even the souls in Hell. But he gives all the freedom to either accept him or reject him. This is not because he does not love us, this is because he does love us. He loves us and respects our freedom.\n \n \n2) He purposes to keep in spite of everything John 10:28-30\n\n \n Remember verse 26 says \"my sheep hear my voice and they follow me.\" You must follow him to be his disciple as Jesus said in John 8:31. None of Jesus' true sheep will perish. But these sheep (disciples) can also choose to stop following him and reject him as Matt. 24:42-51.\n \n \n3) He intends to present us faultless before Himself Jude 24\n \n \n Absolutely! That is his will for all men according to I John 2:1-2, II Peter 3:9 and I Tim. 2:4. But we can still choose to sin and \"fall from grace\" as Gal. 5:4, Heb. 12:15, Romans 11:22 and II Peter 2:20 says. \n \n \n4) His Son ever lives to make intercession to keep us saved Heb:7:25 and 1John 2:1\n\n \n AMEN! He is certainly not going to pray that we go to Hell! If we end up in Hell that is our doing, not his! \n \n \n5) His spirit has placed us into the body of Christ 1Cor 12:13\n \n \n AMEN! And we can resist the Spirit at Acts 7:51 says and if we do not \"hold fast [to the faith\" then we will have believed in vain as I Cor. 15:1-2 says. \n \n \n6) His spirit has sealed us until the day of redemption Eph 4:30\n\n \n AMEN! And that seal can work for us or against us. For \"to whom much is given much shall be required.\" The fact that we have received an irrevocable seal in both Baptism and Confirmation gives us a greater responsibility than those who have not received such a grace. All of the commandments to fidelity to Christ do not somehow go away because of the sacred \"seal\" we have received, we are all the more responsible to keep the commandments so that we may have life and Jesus said in Matt. 19:16ff.\n \n \n7) His word guarantees that nothing (including ourselves) can separate us from Christ Rom8:28-39\n Nowhere does the bible show that all of these works of God could be undone.\n \n \n Romans 8:28-39 does not say \"including ourselves.\" And notice in all of the things it says \"cannot separate us from the love of Christ,\" it does not mention \"murder, adultery, fornication, etc.\" Why? Because these things CAN AND DO separate us from God as Gal. 5:19-21, I Cor. 6:9-11, Eph. 5:3-5 and Rev. 21:8 and 27 says.\n \n \nProblems: 1) Hebrews 6:4-6 if this teaches loss of salvation it also teaches that it cannot be regained.\n\n \n This text refers to Judaizers to were attempting to be forgiven through the Temple sacrifices and priesthood after they had a full knowledge of the truth. For them it is impossible to be renewed to repentance because they are rejecting the means of repentance in the Church that God has given to us. ANYONE who tries to create their own way of repentance and salvation after having known the truth cannot be restored to repentance. That is, of course, the reject the error of their way and come back to the source of all grace and fullness of Christ on this earth, which is the Church according to Eph. 1:22-23. \n \n \n2) John 15:6 This probably refers to the judgement seat of Christ\n \n \n AMEN! And it also says that Christians who were \"abiding in the vine\" which is Christ, if they do not continue to do so, will be cut off and cast into Hell! The text is very plain.\n \n \n3) James 2:14-26 Nonworking faith is not a faith that saves in the first place\n \n \n That is not what St. James is talking about in the text. Just read verse 26. He uses the example of the soul (works) departing from the body (faith) as an example of what happens when one does not act on his faith. This presupposes there was once a living body (faith) in order for it to die!\n \n \n4) 2Peter 2 and Jude are referring to false teachers who in Jude's estimation were not true believers (Jude 19 also see Rom 8:9)\n\n \n All one has to do is honestly read II Peter 2:20-22 after having read II Peter 1:1-4 for a context and the text speaks for itself. \n \n \n5) Mat 24:13 End of what???? The great tribulation. See the context to verify.\n \n \n Matt. 10:22 uses the same words and it is for all of us. Read the entire context of Matt. 10:22-39 and the text speaks for itself. \n \n \nOver 200 times inthe NT Faith or belief is listed as the sole condition for salvation. \n \n \n That is simply not true. Not once is faith ever listed as the SOLE condition for salvation. It is listed as A condition for salvation but never the SOLE condition. In fact, Matt. 12:37, James 2:24 and Matt. 25:31-46 explicitly tell us that it is NOT the sole criterion. \n \n \nOther additions such as surrender, baptism, repentence, and confession are a result of the work of salvation in us. \n \n \n The Bible disagrees with this statement in Acts 2:37-38, Matt. 16:16, Acts 3:19, I Peter 3:21, II Cor. 7:10 and I John 1:9. These texts and more say that repentance, baptism and confession are essential for salvation. \n \n *all responses by Tim Staples\n \n I also found 2 articles dealing with the above issue if you have the time to read them:\n \n http://ic.net/~erasmus/RAZ519.HTM \n \n http://www.cin.org/users/james/files/loss.htm", 
   {}, 
   20795, 
   null, 
   1067460180.0
  ], 
  [
   20839, 
   null, 
   "maximus", 
   "Epaphras,\n \n Neither you nor Lappster has responded to the question of what authority we solicit when we have a disagreement on scripture as we now have. What do you think??", 
   {}, 
   20838, 
   null, 
   1067460300.0
  ], 
  [
   20842, 
   null, 
   "epaphras_faith", 
   "Epaphras,\n \n Neither you nor Lappster has responded to the question of what authority we solicit when we have a disagreement on scripture as we now have. What do you think??\n\n \n \n Thank you for providing a catholic perspective. You are the first person to answer those verses, ever. By the way, I know that the phrase \"including ourselves\" is not in the text. I did not mean to indicate that it was, this is why I used parenthesis. However, the word nothing means nothing. You cannot get around that. The list is not intended to be all inclusive, that is why he uses the word nothing.\n \n I will not respond to the other arguments except to say that None of the verses I quoted indicate that we lose our salvation, and the ones you quoted do not indicate that we do either. They instead indicate a current condition not a position. That said, we are unlikely to convince each other.\n \n As for disagreement on scripture, as now, I would solicit the Holy Spirit for instruction on this issue. He can confirm or deny. It will occur, but we will need to attend to his speaking in our lives. (I do not mean to indicate an audible voice.) The issue is not really important. \n \n The one thing we do agree on is that Jesus Christ is the author and perfector of our faith. He is the way to salvation. Oddly enough, we also agree that works prove our faith. \n \n On this, I don't know if we agree or not. Jesus said that it is not what goes into a man that defiles him but what comes out. He goes on to say that what comes out comes from the heart. The issue is not our behavior but our heart. This is and was always what God is concerned about. My heart is toward God. That I know and am therefore confident that I am in Christ and will stay there, because I have been given a new nature. Christ will not let me fall from grace. There is a verse and I don't know where it is that says that God holds my hand not the other way around. I will look for it. \n \n Grace to you.", 
   {}, 
   20839, 
   null, 
   1067461080.0
  ], 
  [
   20889, 
   null, 
   "maximus", 
   "I will not respond to the other arguments except to say that None of the verses I quoted indicate that we lose our salvation, and the ones you quoted do not indicate that we do either. They instead indicate a current condition not a position. That said, we are unlikely to convince each other.\n\n \n Yes, Epaphras, we can respectfully agree to disagree. I'm not sure however what you mean by a \"current condition.\" If my current condition is one of mortal sin that I have chosen to follow, cutting myself off from God, then I think there would be consequences including and up to losing one's salvation.\n \n \nAs for disagreement on scripture, as now, I would solicit the Holy Spirit for instruction on this issue. He can confirm or deny. It will occur, but we will need to attend to his speaking in our lives. (I do not mean to indicate an audible voice.) The issue is not really important. \n \n \n The issue of authority is of supreme importance. For if there had been no authority throughout the ages then the truth of the Revelation of God would be corrupted beyond repair. The Holy Spirit can confirm or deny and he has not confirmed 33,000 Christian denominations. He has confirmed the one who was at Pentecost, the one who he will be with until the end of the age.\n \n \nThe one thing we do agree on is that Jesus Christ is the author and perfector of our faith. He is the way to salvation. Oddly enough, we also agree that works prove our faith.\n \n \n Amen to Jesus being our perfector. But I do not agree that works are solely a proof of faith.\n \n \nOn this, I don't know if we agree or not. Jesus said that it is not what goes into a man that defiles him but what comes out. He goes on to say that what comes out comes from the heart. The issue is not our behavior but our heart. This is and was always what God is concerned about. My heart is toward God. That I know and am therefore confident that I am in Christ and will stay there, because I have been given a new nature. Christ will not let me fall from grace. There is a verse and I don't know where it is that says that God holds my hand not the other way around. I will look for it. \n \n \n \n I think it is the heart and the behavior that matter.\n \n I have enjoyed our debates.\n Peace of Christ be with you.", 
   {}, 
   20842, 
   null, 
   1067494560.0
  ], 
  [
   20931, 
   null, 
   "epaphras_faith", 
   "Yes, Epaphras, we can respectfully agree to disagree. I'm not sure however what you mean by a \"current condition.\" If my current condition is one of mortal sin that I have chosen to follow, cutting myself off from God, then I think there would be consequences including and up to losing one's salvation..\n \n I disagree, the consequences, in my opinion from scripture already in evidence, would be loss of fellowship (condition) not our position as saved eternally unto Christ.\n \n \n \n \nThe issue of authority is of supreme importance. For if there had been no authority throughout the ages then the truth of the Revelation of God would be corrupted beyond repair. The Holy Spirit can confirm or deny and he has not confirmed 33,000 Christian denominations. He has confirmed the one who was at Pentecost, the one who he will be with until the end of the age..\n\n \n The head of the church is Christ, not the pope. Thecatechism makes this clear. It also makes clear that justified by faith and baptised make brothers of those in other churches (local) through the universal church.\n \n \n \n \nAmen to Jesus being our perfector. But I do not agree that works are solely a proof of faith..\n Again we disagree, I think they are not just proof but the outworking of a saving faith.\n \n \n \n \n \nI think it is the heart and the behavior that matter..\n\n \n i agree, both matter but not in the same way.\n \n \nI have enjoyed our debates.\n Peace of Christ be with you.\n I too. Peace and Amen", 
   {}, 
   20889, 
   null, 
   1067546880.0
  ], 
  [
   21684, 
   null, 
   "lappster", 
   "[QUOTE=maximus]Yes, Epaphras, we can respectfully agree to disagree. I'm not sure however what you mean by a \"current condition.\" If my current condition is one of mortal sin that I have chosen to follow, cutting myself off from God, then I think there would be consequences including and up to losing one's salvation.\n \n \n QUOTE]\n \n \n \n You cannot lose what you never had. There are those in scripture who believed they were saved, even doing miracles, yet they were not saved. Jesus told them eventually to depart as works of iniquity.", 
   {}, 
   20889, 
   null, 
   1068157440.0
  ], 
  [
   21738, 
   null, 
   "maximus", 
   "You cannot lose what you never had. There are those in scripture who believed they were saved, even doing miracles, yet they were not saved. Jesus told them eventually to depart as works of iniquity.\n\n \n So lappster,\n Do you believe you will be saved or do you know you are saved? How are you different from those in the gospels?", 
   {}, 
   21684, 
   null, 
   1068176040.0
  ], 
  [
   22205, 
   null, 
   "lappster", 
   "So lappster,\n Do you believe you will be saved or do you know you are saved? How are you different from those in the gospels?\n\n \n \n I think I might know where you are going with this line of question. I know that I am saved. That knowledge is baised on what I know of the redemption process. I have questioned my belief have found answeres to those question in scripture and prevailed. This is the basis of moving past belief to knowledge. As I assume your question to imply, one can belive something and be wrong. Even as those mentioned in the Bible in a previous post. A quick examination into the live of those in Matt who where cast away would probably reveal there belief to be fraud.\n If you are intersted in liturature to aid logical thinking in this area. I recomend The Case For Faith by Lee Strobel. This book is a series of interviews into the logic of the Christian faith. It begins with some hard questions from an ex Christian evangelist. The first question logically answered is how could this individual be an ex christian. Scripurally speaking he never was. Faith as described in scripture means a complete yeilding to God. If I hold anything back- I cannot be saved. Some hold on to there logic and dabble in faith. This will not save this will confuse, and bewilder. Fortunitly after you dive wholly into faith God is able to open your eyes and see true logic as expressed in this book. \n I know that I am saved, will be saved, and have been elected for salvation before the foundation of the Earth.", 
   {}, 
   21738, 
   null, 
   1068507240.0
  ], 
  [
   22241, 
   null, 
   "maximus", 
   "If you are intersted in liturature to aid logical thinking in this area. I recomend The Case For Faith by Lee Strobel. This book is a series of interviews into the logic of the Christian faith. It begins with some hard questions from an ex Christian evangelist. The first question logically answered is how could this individual be an ex christian. Scripurally speaking he never was. Faith as described in scripture means a complete yeilding to God. If I hold anything back- I cannot be saved. Some hold on to there logic and dabble in faith. This will not save this will confuse, and bewilder. Fortunitly after you dive wholly into faith God is able to open your eyes and see true logic as expressed in this book. \n I know that I am saved, will be saved, and have been elected for salvation before the foundation of the Earth.\n\n \n I almost picked that book up once. I have read The Case for Christ  by Strobel and it is a very good book.", 
   {}, 
   22205, 
   null, 
   1068525000.0
  ], 
  [
   22773, 
   null, 
   "lappster", 
   "I almost picked that book up once. I have read The Case for Christ  by Strobel and it is a very good book.\n\n \n \n What did you think of the strength of his arguments in favor of the historical person of Jesus Christ?", 
   {}, 
   22241, 
   null, 
   1068953280.0
  ], 
  [
   22792, 
   null, 
   "maximus", 
   "What did you think of the strength of his arguments in favor of the historical person of Jesus Christ?\n\n \n very convincing", 
   {}, 
   22773, 
   null, 
   1068964740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Eternal Security?", 
  "url": "http://www.4forums.com/political/religion-debates/1128-eternal-security.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1128, 
  "discussion_files": [
   [
    "6856.html", 
    "http://www.4forums.com/political/religion-debates/1128-eternal-security-print.html"
   ], 
   [
    "6857.html", 
    "http://www.4forums.com/political/religion-debates/1128-eternal-security-3-print.html"
   ], 
   [
    "6858.html", 
    "http://www.4forums.com/political/religion-debates/1128-eternal-security-2-print.html"
   ]
  ], 
  "identifier": 1128
 }
]