[
 [
  [
   314098, 
   null, 
   "Ethmi", 
   "Statistically, tobacco kills nine times as many people as all homicides and gun accidents combined, and alcohol kills almost twice as many as die in gun-related deaths. (src)\n Even if you count suicides (assuming every single one of them was with a gun, which they weren't), alcohol still kills more people. So, if your intention is to save lives, then why don't you ban this stuff? Could it have something to do with the fact that you enjoy alcohol and tobacco?", 
   {
    "post_info": {
     "post_title": "What is the Real Intention of the Anti-gun People?"
    }
   }, 
   null, 
   null, 
   1214350620.0
  ], 
  [
   314123, 
   null, 
   "Penfold", 
   "Got it in one! Such impressive deductive reasoning is too good for this place....Asked and answered without outside input in four sentences!", 
   {}, 
   314098, 
   null, 
   1214371980.0
  ], 
  [
   314126, 
   null, 
   "Jo Bennett", 
   "Alcohol and tobacco mostly cause harm to the user. Guns mostly cause harm to others. I fully support laws that prevent alochol and tobacco users from harming others, such as bans on smoking in public places, bans on driving while under the influence of alcohol. The difference is that the only purpose of guns is to kill things, and killing people has no place in a civilised society, and certainly isn't something Christians should be involved in.", 
   {}, 
   314123, 
   null, 
   1214375040.0
  ], 
  [
   314127, 
   null, 
   "Shooterandproud", 
   "Alcohol and tobacco mostly cause harm to the user. Guns mostly cause harm to others. I fully support laws that prevent alochol and tobacco users from harming others, such as bans on smoking in public places, bans on driving while under the influence of alcohol.\n\n \n Guns are only used to hurt others by XXXXXX or criminals. No matter what we do or what silly laws we make, we will never stop criminals from getting guns. However, the \"XXXXXX\" part can be fixed easily by safety classes and training. We can also reduce the number of legal arms criminals use by using thorough background checks and waiting periods.\n \n \n \n \n The difference is that the only purpose of guns is to kill things, and killing people has no place in a civilised society, and certainly isn't something Christians should be involved in.\n\n \n In the instance of self defense, this is a good thing.\n \n Illegal guns are the main source of gun violence, not legal arms.", 
   {}, 
   314126, 
   null, 
   1214375400.0
  ], 
  [
   314128, 
   null, 
   "daewoo", 
   "Alcohol and tobacco mostly cause harm to the user. Guns mostly cause harm to others. I fully support laws that prevent alochol and tobacco users from harming others, such as bans on smoking in public places, bans on driving while under the influence of alcohol. The difference is that the only purpose of guns is to kill things, and killing people has no place in a civilised society, and certainly isn't something Christians should be involved in.\n\n \n I fully support laws that prevent booze and tobacco users from harming others...just like I support laws that prevent gun owners from shooting people. \n \n We are not that civilized...nor will we ever be.", 
   {}, 
   314126, 
   null, 
   1214376660.0
  ], 
  [
   314206, 
   null, 
   "Ethmi", 
   "Alcohol and tobacco mostly cause harm to the user. Guns mostly cause harm to others. I fully support laws that prevent alochol and tobacco users from harming others, such as bans on smoking in public places, bans on driving while under the influence of alcohol. The difference is that the only purpose of guns is to kill things, and killing people has no place in a civilised society, and certainly isn't something Christians should be involved in.\n\n \n Does this mean it's okay to take a knife and stab yourself as long as you don't stab someone else? By the way, gun manufacturers own guns - but tobacco company CEOs don't smoke. Tobacco and booze are made by hypocritical people who paycheck relies completely on ruining the lives of others, and getting people addicted to their products.", 
   {}, 
   314126, 
   null, 
   1214436000.0
  ], 
  [
   314232, 
   null, 
   "Jo Bennett", 
   "Does this mean it's okay to take a knife and stab yourself as long as you don't stab someone else? By the way, gun manufacturers own guns - but tobacco company CEOs don't smoke. Tobacco and booze are made by hypocritical people who paycheck relies completely on ruining the lives of others, and getting people addicted to their products.\n\n \n Stabbing yourself is not ok, but that doesn't mean it should be illegal.\n \n I'm not even going to bother with your non-sequitor, but I imagine plenty of alcohol manufacturers enjoy the occasional drink.\n \n Of course guns are only used to hurt others by criminals - shooting someone is a criminal act. Unfortunately by the time you find out that the person is a criminal their victim is bleeding out on the floor. Illegal guns are generally guns that were previously held legally, whether they have been modified or stolen.", 
   {}, 
   314206, 
   null, 
   1214462400.0
  ], 
  [
   314282, 
   null, 
   "Ethmi", 
   "Stabbing yourself is not ok, but that doesn't mean it should be illegal.\n\n \n I believe suicide is murder, no matter how you look at it. It's already illegal, and if you do it, then chances are you're either taking PCP or are mentally unstable.\n \n \nI'm not even going to bother with your non-sequitor, but I imagine plenty of alcohol manufacturers enjoy the occasional drink.\n\n \n But they're not drunks, are they?\n \n \nOf course guns are only used to hurt others by criminals - shooting someone is a criminal act. Unfortunately by the time you find out that the person is a criminal their victim is bleeding out on the floor. Illegal guns are generally guns that were previously held legally, whether they have been modified or stolen.\n\n \n If the victim has guns, then they could shoot the criminal before they get shot.", 
   {}, 
   314232, 
   null, 
   1214520240.0
  ], 
  [
   314283, 
   null, 
   "Ethmi", 
   "Thank you, Jo Bennett, Penfold, and all others, for proving my point that your intention is not to save lives. If you wanted to save lives, you'd want to ban booze and cigarettes as well.", 
   {}, 
   314282, 
   null, 
   1214520540.0
  ], 
  [
   314428, 
   null, 
   "Shooterandproud", 
   "[QUOTE=Jo Bennett;314232]Stabbing yourself is not ok, but that doesn't mean it should be illegal.\n \n I'm not even going to bother with your non-sequitor, but I imagine plenty of alcohol manufacturers enjoy the occasional drink.\n \n \nOf course guns are only used to hurt others by criminals - shooting someone is a criminal act.\n\n \n These are mostly caused by illegal guns. You can't outlaw something thats already illegal.\n \n \n \nUnfortunately by the time you find out that the person is a criminal their victim is bleeding out on the floor. Illegal guns are generally guns that were previously held legally, whether they have been modified or stolen.\n\n \n I highly doubt this. How can a gun be Illegal when it used to be legal? Most illegal guns are bought off the black market.", 
   {}, 
   314232, 
   null, 
   1214771100.0
  ], 
  [
   314483, 
   null, 
   "Jo Bennett", 
   "How do they end up on the black market? Either legally bought or stolen from someone who legally bought them or converted from legal weapons. The number smuggled in for sale in the US is likely vanishingly small.", 
   {}, 
   314428, 
   null, 
   1214806860.0
  ], 
  [
   314552, 
   null, 
   "Ethmi", 
   "How do they end up on the black market? Either legally bought or stolen from someone who legally bought them or converted from legal weapons. The number smuggled in for sale in the US is likely vanishingly small.\n\n \n They got on the black market from legal guns in other countries. We can't pass laws in this country that affect weapon production in other countries, so we should make this one as safe as possible. Also, many guns are stolen from police and military authorities - should we just get rid of police and military, leaving our country vunerable to crime and invasion? I think not!!", 
   {}, 
   314483, 
   null, 
   1214865900.0
  ], 
  [
   314560, 
   null, 
   "Ethmi", 
   "Got it in one! Such impressive deductive reasoning is too good for this place....Asked and answered without outside input in four sentences!\n\n \n Look for this:\n \n (src)", 
   {}, 
   314123, 
   null, 
   1214867280.0
  ], 
  [
   314594, 
   null, 
   "Shooterandproud", 
   "How do they end up on the black market? Either legally bought or stolen from someone who legally bought them or converted from legal weapons. The number smuggled in for sale in the US is likely vanishingly small.\n\n \n It will keep vanishing, unless guns are banned. I assure you that then, it will skyrocket.", 
   {}, 
   314483, 
   null, 
   1214881140.0
  ], 
  [
   314598, 
   null, 
   "Charliegone", 
   "All I have to say is if you ban firearms you will most likely get a huge black market for them. It didn't work for alcohol, what makes us think it will work with guns? It won't. Plain and simple. What we should be doing is instead enforce the laws, punish criminals who use firearms in crimes committed, and actually rehabilitate criminals instead of throwing them in a camp where they can lift weights all day and watch Oprah. Also, I would like to add that most increases in crime are due to a poor economy.", 
   {}, 
   314594, 
   null, 
   1214884080.0
  ], 
  [
   314632, 
   null, 
   "smiley", 
   "All I have to say is if you ban firearms you will most likely get a huge black market for them. It didn't work for alcohol, what makes us think it will work with guns? It won't. Plain and simple. What we should be doing is instead enforce the laws, punish criminals who use firearms in crimes committed, and actually rehabilitate criminals instead of throwing them in a camp where they can lift weights all day and watch Oprah. Also, I would like to add that most increases in crime are due to a poor economy.\n\n Yeah, having to watch Oprah is indeed \"cruel and unusual\" punishment. No-one, and I mean no-one, deserves that.", 
   {}, 
   314598, 
   null, 
   1214923020.0
  ], 
  [
   314675, 
   null, 
   "Ethmi", 
   "Yeah, having to watch Oprah is indeed \"cruel and unusual\" punishment. No-one, and I mean no-one, deserves that.\n\n \n Yeah, with how much she sucks, I think you're right. emoticon_rolleyes\n \n By the way, it's too late to change it because I pointed it out - YOU FORGOT TO WRITE SMILEY!!!", 
   {}, 
   314632, 
   null, 
   1214974380.0
  ], 
  [
   314786, 
   null, 
   "Omegamon_X", 
   "A supporter of gun control is a supporter of Hitler, Stalin, Mussolini and other tyrannical dictators. They were all big supporters of gun control and keeping their subjects unarmed and \"in their place\". There's no way to support gun control without also supporting totalitarianism as well.", 
   {}, 
   314675, 
   null, 
   1215034800.0
  ], 
  [
   314789, 
   null, 
   "Penfold", 
   "Like Maliki and his US sponsors in Iraq. emoticon_rolleyes", 
   {}, 
   314786, 
   null, 
   1215035760.0
  ], 
  [
   314876, 
   null, 
   "Galileo", 
   "A supporter of gun control is a supporter of Hitler, Stalin, Mussolini and other tyrannical dictators. They were all big supporters of gun control and keeping their subjects unarmed and \"in their place\". There's no way to support gun control without also supporting totalitarianism as well.\n\n An article about guns in prewar Iraq&#8211; \n \"With a gun culture that closely resembles that of the United States, Iraq is one of the most heavily armed societies in the world. Its tradition of self-reliance and hard desert and mountain living puts it on a gun-per-person level rivaling other clan systems in Yemen or Somalia.\"\n http://www.csmonitor.com/2003/0310/p01s03-woiq.html\n \n Hussein obviously supported and allowed the private ownership of guns. So a supporter of gun ownership is a supporter of Hussein.", 
   {}, 
   314786, 
   null, 
   1215058740.0
  ], 
  [
   314891, 
   null, 
   "Omegamon_X", 
   "Hussein obviously supported and allowed the private ownership of guns.\n\n \n Only because anybody that tried to kill him would be put to death, along with all their family members. Nobody was willing to try and kill him so it wasn't necessary for them to be disarmed.", 
   {}, 
   314876, 
   null, 
   1215064920.0
  ], 
  [
   314930, 
   null, 
   "Penfold", 
   "You omitted the last half of the quote, Saddam supporter.....emoticon_xgood", 
   {}, 
   314891, 
   null, 
   1215103740.0
  ], 
  [
   314940, 
   null, 
   "Omegamon_X", 
   "So I guess the fact that Saddam allowed his subjects to elect him as ruling dictator again during the last election is proof that he supports governmental reform as well.", 
   {}, 
   314930, 
   null, 
   1215113520.0
  ], 
  [
   314976, 
   null, 
   "Penfold", 
   "No, he's dead.", 
   {}, 
   314940, 
   null, 
   1215127920.0
  ], 
  [
   315129, 
   null, 
   "Ethmi", 
   "You omitted the last half of the quote, Saddam supporter.....emoticon_xgood\n\n \n That figures. Pure aggression, no response. Of course, I should expect that because you never have anything intelligent to say on this forum.", 
   {}, 
   314930, 
   null, 
   1215208680.0
  ], 
  [
   315452, 
   null, 
   "Ethmi", 
   "Thanks, anti gunners - for proving my point that you don't really want to save lives.", 
   {}, 
   315129, 
   null, 
   1215447960.0
  ], 
  [
   315460, 
   null, 
   "Penfold", 
   "As usual, your sweeping insultive generalisations are too vague to be sensibly debated, let alone refuted. Define \"anti-gunner\", other than as anyone with a healthy disrespect for the lockstep NRA dogma.", 
   {}, 
   315452, 
   null, 
   1215450900.0
  ], 
  [
   315462, 
   null, 
   "Omegamon_X", 
   "Define \"anti-gunner\", other than as anyone with a healthy disrespect for the lockstep NRA dogma.\n\n \n Anyone that feels the Second Amendment should be repealed.\n \n Anybody that feels there's absolutely no reason for anyone other than military and police to have access to guns.\n \n Anybody that chooses to hate and demonize a particular class of guns.\n \n Anybody who needs to exaggerate and lie about their claims to get people to believe them (ie \"The .50 BMG can blow planes out of the sky with a single shot).\n \n Anybody who believes that Americans shouldn't own guns for self-defense purposes.\n \n Anybody who believes that the Second Amendment is outdated and can be violated at any time.\n \n Anybody who says \"I don't care if it's an individual right.\"\n \n Anybody who uses scare tactics to frighten people into submission over imaginary things (ie terrorists being able to buy machineguns in America).\n \n The list goes on. Shall I?", 
   {}, 
   315460, 
   null, 
   1215451680.0
  ], 
  [
   315464, 
   null, 
   "iangb", 
   "Now prove that 'anti-gunners don't really want to save lives'.\n \n Ethmi is good at making up 'truths'. Unfortunately he has yet to show proof.", 
   {}, 
   315462, 
   null, 
   1215452160.0
  ], 
  [
   315468, 
   null, 
   "Omegamon_X", 
   "Now prove that 'anti-gunners don't really want to save lives'.\n\n \n If they cared about saving lives then they'd push for extended sentences for criminals convicted of firearms-related charges, rather than pushing for more laws that carry short sentences.\n \n Since there are no objections I'll continue my list of defining what qualifies somebody as an anti-gunner...\n \n \n Anybody that says \"Self defense is not a valid reason for gun ownership.\"\n \n Anybody that makes the determination that a state constitution is superseded by a town's ordinance.\n \n Anybody that feels it's perfectly alright to ration gun rights to only one exercise per 30 day period.\n \n Anybody that tries to institute a \"should have known\" clause in a bill requiring gun owners to report the theft or loss of their property within 72 hours.\n \n Anybody that tells police to ignore statewide laws and to continue arresting people for violating now-defunct town ordinances.\n \n Anybody who says \"It's too hard to tell gun owners from criminals.\"\n \n Anybody who likens gun owners to cold blooded murderers and deranged killers.\n \n Anybody who makes a \"lawless wild west\" or \"blood will run in the streets\" comment anytime the talk of concealed carry or the Castle Doctrine comes up for discussion.\n \n Anybody who says \"Your constitutional rights don't extend to inside this state.\"\n \n Anybody who says \"I don't care what the Supreme Court claims, you don't have an individual right to own a gun.\"\n \n Anybody that believes harassing the law-abiding is an effective way of curbing crime.\n \n Anybody who uses nonsensical lingo (ie cop killer bullets, rapid fire automatic weapons, saturday night specials, high-powered rifles, vest buster, gun show loophole etc.) to frighten people and distort the facts.\n \n Anybody that believes the only way to stop criminals from having guns is to take them away from everybody in the world (ie supporting a global gun trade prohibition treaty).\n \n Anybody that blames the problem of their country on the \"gun culture of America\" (ie Mexico, Canada, etc.)\n \n Anybody who claims people cling to their guns out of pure bitterness.\n \n Basically anybody that dislikes gun ownership to any degree is an anti-gunner. Anybody who tries to pass laws to curb, reduce, or inhibit gun ownership is an anti-gunner.", 
   {}, 
   315464, 
   null, 
   1215453420.0
  ], 
  [
   315470, 
   null, 
   "iangb", 
   "If they cared about saving lives then they'd push for extended sentences for criminals convicted of firearms-related charges, rather than pushing for more laws that carry short sentences.\nNot really... better to slap on the wrist and stop a crime before it happens than to wait for the crime to be committed and then cut the hand off.\n \n \nAnybody who tries to pass laws to curb, reduce, or inhibit gun ownership is an anti-gunner.\n\n So I take it you are either\n a) Fine with felons, infants, alcoholics and the mentally damaged to own a gun\n or...\n b) An anti-gunner. Welcome to the club!", 
   {}, 
   315468, 
   null, 
   1215454140.0
  ], 
  [
   315472, 
   null, 
   "Omegamon_X", 
   "Not really... better to slap on the wrist and stop a crime before it happens than to wait for the crime to be committed and then cut the hand off.\n\n \n No it isn't. I'm tired of a slap on the wrist being the only punishment some criminals get, because we're seeing cases of people having 30 convictions still being out and offending.\n \n Either start putting these people away for a long time for committing a federal offense, or get out of our way and let us handle things ourselves.\n \n You claim you want to stop gun traffickers, but you won't push for laws that mandate the 10-years-per-gun sentence that such a crime carries with it. No, you just want to restrict people to buying one gun a month so guns can't be trafficked from licenses stores. In a way you're actually protecting criminals from getting caught and punished.\n \n \nSo I take it you are either\n a) Fine with felons, infants, alcoholics and the mentally damaged to own a gun\n or...\n b) An anti-gunner. Welcome to the club!\n\n \n More raw nerve, not an ounce of logic.", 
   {}, 
   315470, 
   null, 
   1215455100.0
  ], 
  [
   315473, 
   null, 
   "Penfold", 
   "30 convictions for what offence? Death for recidivist littering?", 
   {}, 
   315472, 
   null, 
   1215455940.0
  ], 
  [
   315475, 
   null, 
   "iangb", 
   "No it isn't. I'm tired of a slap on the wrist being the only punishment some criminals get, because we're seeing cases of people having 30 convictions still being out and offending.\n\n Personally, I would like something similar to an exponential system of jail time. An offence carries with it a set jail time, X, which varies with the seriousness of the crime. The felon serves jail time AX^BN, where A and B are modifiers (could well be =1, but it's standard practice to include modifier coefficients - for example, if AX = 1 then increasing N has no effect) and N is the number of convictions. For example, say a crime gave a jail time of 2 days. First offense (with A=B=1) would give 2 days imprisonment, second offense would give 4, then 8, then 16, then 32....\n Anyway, this is besides the point.\n \nEither start putting these people away for a long time for committing a federal offense, or get out of our way and let us handle things ourselves.\nI thought you denied having a 'lynch mob mentality'? I think you've just proven yourself wrong...\n \n \nYou claim you want to stop gun traffickers, but you won't push for laws that mandate the 10-years-per-gun sentence that such a crime carries with it. No, you just want to restrict people to buying one gun a month so guns can't be trafficked from licenses stores. In a way you're actually protecting criminals from getting caught and punished.\n\n Actually, I would like to stop 'for self-defence' being a valid reason to own a gun, and pretty much leave it at that, I don't know the twists and turns of the US system well enough to go much further, at this point.\n \n \nMore raw nerve, not an ounce of logic.\nSo you deny that laws preventing felons from acquiring guns are \"laws to curb, reduce, or inhibit gun ownership\"?\n \n That's... illogical.", 
   {}, 
   315473, 
   null, 
   1215456660.0
  ], 
  [
   315509, 
   null, 
   "Ethmi", 
   "WARNING . . . Best not to get too mathematical with OX around.\n \n Just use words like 'bigger' or 'more'.\n \n Smiley\n\n \n All these posts like this prove that you're a hypocrite, Smiley.", 
   {}, 
   315475, 
   null, 
   1215467580.0
  ], 
  [
   315514, 
   null, 
   "Omegamon_X", 
   "Personally, I would like something similar to an exponential system of jail time. An offence carries with it a set jail time, X, which varies with the seriousness of the crime. The felon serves jail time AX^BN, where A and B are modifiers (could well be =1, but it's standard practice to include modifier coefficients - for example, if AX = 1 then increasing N has no effect) and N is the number of convictions. For example, say a crime gave a jail time of 2 days. First offense (with A=B=1) would give 2 days imprisonment, second offense would give 4, then 8, then 16, then 32....Anyway, this is besides the point.\n\n \n No, no more time off for good behavior. It doesn't work, it just tells criminals that if they can act good for long enough while they're being watched, then they'll be rewarded for their false advances in rehabilitation.\n \n \nI thought you denied having a 'lynch mob mentality'? I think you've just proven yourself wrong...\n\n \n Not really. Lynch mobbing would involve going down to the holding cells, breaking the scumbag up and hanging him from the nearest tree. What I was referring to was allowing us to deal with violent criminals when they come looking for us. You don't wanna lock them up for breaking the law, then don't complain if they get shot and/or killed in their attempt to rob or harm us.\n \n There needs to be change, because the current system isn't working. Now you can either go one way and start locking criminals up for much longer than you are now, or you can put up with there being less living criminals to deal with. Which sounds like the better solution to you?\n \n \nActually, I would like to stop 'for self-defence' being a valid reason to own a gun,\n \n \n I'm not the least bit surprised.\n \n \nSo you deny that laws preventing felons from acquiring guns are \"laws to curb, reduce, or inhibit gun ownership\"?\n\n \n Felons don't own guns, they possess them for criminal intentions.", 
   {}, 
   315475, 
   null, 
   1215468300.0
  ], 
  [
   315520, 
   null, 
   "sinjin", 
   "I'm uncomfortable with \"gun show loopholes\".", 
   {}, 
   315514, 
   null, 
   1215469440.0
  ], 
  [
   315529, 
   null, 
   "iangb", 
   "No, no more time off for good behavior. It doesn't work, it just tells criminals that if they can act good for long enough while they're being watched, then they'll be rewarded for their false advances in rehabilitation.\nMuch to Ethmi's dismay, you've just proven Smiley right.\n \n It's not 'time off for good behaviour'. When did I mention 'behaviour', or 'time off'? It's a jail sentence that gets progressively harsher the more you break the law - less incentive to reoffend every time.\n \n \nNot really. Lynch mobbing would involve going down to the holding cells, breaking the scumbag up and hanging him from the nearest tree. What I was referring to was allowing us to deal with violent criminals when they come looking for us. You don't wanna lock them up for breaking the law, then don't complain if they get shot and/or killed in their attempt to rob or harm us.\nIn short, you don't want to have to wait for the criminal to be in the cells before you drag them out and kill them. \n You can deal with violent criminals when they come looking for you at the moment. Why would the law need to 'get out of the way'?\n \n \nThere needs to be change, because the current system isn't working. Now you can either go one way and start locking criminals up for much longer than you are now, or you can put up with there being less living criminals to deal with. Which sounds like the better solution to you?\nLocking up for longer is better than killing, but that's off-topic. An even better system would be to make it harder to acquire the weapons needed for proto-criminals to become fully-fledged murderers.\n For example, gun control.\n \n \nI'm not the least bit surprised.\nWell, I have told you before...\n \n \nFelons don't own guns, they possess them for criminal intentions.\nLemme guess, in real life you're a lawyer, correct? You must be because you're extremely hypertechnical to the point of absurdity.\n ...\n Seriously dude, you're trying to get off on a technicality here. Like a lawyer trying to argue \"Your honor my client isn't a prostitute, she's a female escort\".\n\n Hypocricy?\n Besides, by the same argument, no-one 'owns' guns - they posses them for legal intent.", 
   {}, 
   315520, 
   null, 
   1215471540.0
  ], 
  [
   315539, 
   null, 
   "Omegamon_X", 
   "Much to Ethmi's dismay, you've just proven Smiley right.\n \n It's not 'time off for good behaviour'. When did I mention 'behaviour', or 'time off'? It's a jail sentence that gets progressively harsher the more you break the law - less incentive to reoffend every time.\n\n \n My apologies. When I saw the mention of \"sentence modifier\" I was drawn to examples that we currently have in effect with our jail system.\n \n \nIn short, you don't want to have to wait for the criminal to be in the cells before you drag them out and kill them.\n\n \n Not really, this is just putting a corrupt twist on things.\n \n When you speak of a lynch mob, you're talking about men breaking into holding cells and hanging somebody based on nothing more than accusations. What I'm talking about, is making a determination based on what you're actually experiencing at the moment somebody is breaking into your home or coming right at you.\n \n Lynch mobs are after the fact, deadly force for self-defense is at the time of the fact.\n \n \nYou can deal with violent criminals when they come looking for you at the moment. Why would the law need to 'get out of the way'?\n\n \n Maybe to stop criminalizing the use of force against the offending party?\n \n \nLocking up for longer is better than killing, but that's off-topic. An even better system would be to make it harder to acquire the weapons needed for proto-criminals to become fully-fledged murderers.\n\n \n The problem with that system is that it's flawed on many, many levels. Gun control only cuts off access to guns on one front, there's still many more out there that are never addressed and as such much more desirable avenues.\n \n I can easily go to the gun store and buy a gun after going through a couple of pages of paperwork and 15 minutes worth waiting around. Trouble is now that gun can be traced because the ATF has my name attached to the serial number, and the make and model. If I wanted to cause a crime then I wouldn't want to be tracked, so I'd just go looking for unsavory characters like drug dealers and ask them where I could get a gun. By doing so I could easily defeat the gun control law and have a gun that couldn't be tracked or traced.\n \n \nHypocricy?\n Besides, by the same argument, no-one 'owns' guns - they posses them for legal intent.\n\n \n There's a difference, however. Supporting the laws that're already on the books isn't the same as pushing for new laws that would further restrict the access the law-abiding had to firearms.\n \n And now a more interesting question. As some of you may know, a felony conviction means automatic loss of Second Amendment rights for life. Now usually felons get locked up for a long time, but for some reason people getting felony convictions are being let out very early into their sentences, suggesting the people keeping them locked up feel that they've rehabilitated and can be trusted in the outside world. Yet these people who are subject to the catch and release way of doing things aren't able to buy guns legally.\n \n Now if these people can be trusted to be let out of prison two years into a ten year sentence, why can't they be trusted to own a gun again?\n \n A better question would be, if they can't be trusted to own a gun, then what're they doing out of prison and walking about freely?", 
   {}, 
   315529, 
   null, 
   1215473880.0
  ], 
  [
   315543, 
   null, 
   "sinjin", 
   "...so I'd just go looking for unsavory characters like drug dealers and ask them where I could get a gun. By doing so I could easily defeat the gun control law and have a gun that couldn't be tracked or traced.\nGuess where they would acquire that gun for you? Hint: not smuggled into the country.\n \n \n...if they can't be trusted to own a gun, then what're they doing out of prison and walking about freely?\nFor the same reason that a pedophile can be \"out\" but not allowed within 500 ft. of a school.", 
   {}, 
   315539, 
   null, 
   1215474300.0
  ], 
  [
   315548, 
   null, 
   "Omegamon_X", 
   "Guess where they would acquire that gun for you? Hint: not smuggled into the country.\n\n \n The black market of course. Plenty of stock there right now.\n \n \nFor the same reason that a pedophile can be \"out\" but not allowed within 500 ft. of a school.\n\n \n Perhaps I didn't phrase the question correctly. If a convicted felon can't be trusted to own a gun again, then what's he doing out of prison after serving just two years of a ten year sentence?", 
   {}, 
   315543, 
   null, 
   1215476040.0
  ], 
  [
   315550, 
   null, 
   "iangb", 
   "A better question would be, if they can't be trusted to own a gun, then what're they doing out of prison and walking about freely?\nFirst time offenders are deemed 'trustworthy'. Clearly this is not the case.\n \n \nMaybe to stop criminalizing the use of force against the offending party?\nAs far as I am aware, the law is not criminalising anything more than disproportionate response. See the 'joe horn' topic.\n \n \nThere's a difference, however. Supporting the laws that're already on the books isn't the same as pushing for new laws that would further restrict the access the law-abiding had to firearms.\nTrue, but that's not what you claimed. Anyway, I'm supporting the laws that are already present - in the UK.", 
   {}, 
   315543, 
   null, 
   1215476220.0
  ], 
  [
   315551, 
   null, 
   "sinjin", 
   "The black market of course. Plenty of stock there right now.\nHow is it \"stocked\"? Why won't enforcing existing laws prevent its well stockage?", 
   {}, 
   315548, 
   null, 
   1215476820.0
  ], 
  [
   315555, 
   null, 
   "Omegamon_X", 
   "First time offenders are deemed 'trustworthy'. Clearly this is not the case.\n\n \n Definitely not when it's repeat offenders.\n \n \nAs far as I am aware, the law is not criminalising anything more than disproportionate response. See the 'joe horn' topic.\n\n \n No, but there's still a lot of states that still have the \"duty to retreat\" clause, and will let a burglar sue the homeowner for damages.\n \n \nTrue, but that's not what you claimed. Anyway, I'm supporting the laws that are already present - in the UK.\n\n \n My apologies again. I'm not the best at expressing myself with words. I know what I want to say, just not always how to say it.", 
   {}, 
   315550, 
   null, 
   1215478800.0
  ], 
  [
   315557, 
   null, 
   "Omegamon_X", 
   "How is it \"stocked\"? Why won't enforcing existing laws prevent its well stockage?\n\n \n It's stocked with firearms that've already been stolen. That's why enforcing new laws against buying guns won't do any good, because they only work on licensed stores.", 
   {}, 
   315551, 
   null, 
   1215479220.0
  ], 
  [
   315560, 
   null, 
   "iangb", 
   "Hey, no problem with the wording. Sorry if I come across as testy sometimes, I'm used to Archie wilfully misinterpreting what is written if it furthers his point.\n \n \nDefinitely not when it's repeat offenders.\n\n But you still say that potential first-time offenders (ie - everyone) should be allowed a gun for a cause that it is very unlikely to be used for, despite the fact that some of them will use their legally-purchased gun in a harmful manner?\n \n \nNo, but there's still a lot of states that still have the \"duty to retreat\" clause, and will let a burglar sue the homeowner for damages.\nWhat does this clause apply to? Not shooting a burglar as they are running away?\n \n If that is the case, then I'm all for it.\n \n \nIt's stocked with firearms that've already been stolen. That's why enforcing new laws against buying guns won't do any good, because they only work on licensed stores.\nEnforcement of gun laws should not be only applied at stores - police should be actively looking for illegal guns. That includes the black market, but it also applies to individuals who are carrying illegally.", 
   {}, 
   315555, 
   null, 
   1215480000.0
  ], 
  [
   315566, 
   null, 
   "Omegamon_X", 
   "But you still say that potential first-time offenders (ie - everyone) should be allowed a gun for a cause that it is very unlikely to be used for, despite the fact that some of them will use their legally-purchased gun in a harmful manner?\n\n \n Well we have something called \"innocent until proven guilty\" and as it stands you can't be denied purchase of a firearm unless you've either done something wrong, or been certified by a judge as being mentally incapable and prove a danger to yourself and others.\n \n That means that until you do something wrong, you're given equal opportunity. And if you have bad intentions, that'll be sorted out when there's enough evidence to warrant a conviction.\n \n \nWhat does this clause apply to? Not shooting a burglar as they are running away?\n \n If that is the case, then I'm all for it.\n\n \n No, it means that you as the homeowner is required to retreat from the place of conflict, if at all possible, before resorting to the use of force to defend yourself.\n \n That \"if at all possible\" is a real kicker because it varies from one jurisdiction to another. One place could very well interpret \"if at all possible\" to mean trying to climb out a window on the second story.\n \n I don't like the duty to retreat clause one bit. If trouble comes looking for you then you shouldn't be obligated by law to run away and then punished if you fail to do so because you didn't automatically assume that escape was an option. If you've got family nearby that might get hurt by a dangerous individual, then running away is out of the question unless you're a coward that'll sacrifice loved ones for your own survival.\n \n \nEnforcement of gun laws should not be only applied at stores - police should be actively looking for illegal guns. That includes the black market, but it also applies to individuals who are carrying illegally.\n\n \n Trouble is that this isn't as easy as it sounds, black marketeers aren't exactly stupid.\n \n Then there's the issue of some police losing their own duty weapons, or their storehouses with caches of illegal weapons being raided and the weapons put right back into illegal circulation.", 
   {}, 
   315560, 
   null, 
   1215481200.0
  ], 
  [
   315581, 
   null, 
   "iangb", 
   "Well we have something called \"innocent until proven guilty\" and as it stands you can't be denied purchase of a firearm unless you've either done something wrong, or been certified by a judge as being mentally incapable and prove a danger to yourself and others.\n \n That means that until you do something wrong, you're given equal opportunity. And if you have bad intentions, that'll be sorted out when there's enough evidence to warrant a conviction.\nInnocent until proven guilty only applies to legal cases. In real life, people are only trusted with something once they've proven their worth - government/company secrets, for example, or a drivers licence. In the case of guns, shouldn't this be the same? Yes, there are proficiency tests in a few states for CCW, but I'm talking about actually having a real need to buy a gun, such as your sport or your job. Otherwise you are giving people the ability to cause massive harm for a reason which most of them will not apply.\n \n \nNo, it means that you as the homeowner is required to retreat from the place of conflict, if at all possible, before resorting to the use of force to defend yourself.\n\n If you can prove that it was not possible to run away, is this an issue? And I doubt very much that a court would prosecute you for trying to help your friends/familly run away rather than just run yourself. It's when you go to pre-emptively attack that complications start arising.\n \n \nTrouble is that this isn't as easy as it sounds, black marketeers aren't exactly stupid.\n \n Then there's the issue of some police losing their own duty weapons, or their storehouses with caches of illegal weapons being raided and the weapons put right back into illegal circulation.\n\n Aren't illegal weapons destroyed once seized? That's how they've been running it in Northern Ireland, at least... I don't know about the general police force.", 
   {}, 
   315566, 
   null, 
   1215484680.0
  ], 
  [
   315585, 
   null, 
   "Omegamon_X", 
   "Innocent until proven guilty only applies to legal cases. In real life, people are only trusted with something once they've proven their worth - government/company secrets, for example, or a drivers licence. In the case of guns, shouldn't this be the same?\n\n \n Maybe because employment and driving are legally recognized as privileges, while gun ownership has been recognized as a right, and it's been declared that licensing a right is illegal?\n \n \nYes, there are proficiency tests in a few states for CCW, but I'm talking about actually having a real need to buy a gun, such as your sport or your job. Otherwise you are giving people the ability to cause massive harm for a reason which most of them will not apply.\n\n \n Alright time for a breakdown of this statement.\n \n 1. A real need to buy a gun.\n Why exactly should you have to display a need before you can exercise a right? If on trial should you be required to show a genuine need to take the fifth and avoid incriminating yourself? Should you have to show a need before you can form an organized rally to protest something you find distasteful? Should you be required to display need to resist unwarranted searches and seizures of your property?\n \n 2. Sports or job.\n Why shouldn't you be allowed to buy a gun for your own defense, or because you feel like it, or because it's just something that you want, or because you want to get a particular model that might be faced discontinuation?\n \n You're not asked about why you need to have a driver's license even though driving is just a luxury, so why should you have to display a need for a constitutional right?\n \n \nIf you can prove that it was not possible to run away, is this an issue? And I doubt very much that a court would prosecute you for trying to help your friends/familly run away rather than just run yourself. It's when you go to pre-emptively attack that complications start arising.\n\n \n I'm reminded of a case in California, which has duty to retreat laws. A man was awoken in the late of night and discovered a man with a hatchet inside his house. The homeowner could've run outside to avoid harm, but instead he chose to stand his ground and shoot the intruder because he had family upstairs and chose not to leave them behind and alone with the crazy axe guy. He was arrested and charged because he shot first rather than ran away even though he was protecting his family.\n \n If you're the good guy you shouldn't be required to be placed behind the 8-ball when somebody has broken the law to get at you. Why should you have to prove, in a court of law, that you didn't do anything wrong, that's the job of the prosecuting attorney.\n \n \nAren't illegal weapons destroyed once seized? That's how they've been running it in Northern Ireland, at least... I don't know about the general police force.\n\n \n No, they're needed as evidence for the trial, and it can take years before you face a trial sometimes. So the weapons need to be stored until the case has been resolved, and then they can be destroyed. \n \n If you destroy illegal weapons when they're first seized, then where's the evidence of wrongdoing? You're gonna have to let the guilty party go free on a technicality and they're going to get away with their crime.\n \n Trouble is that anything can happen during that period of time, and I do mean anything.", 
   {}, 
   315581, 
   null, 
   1215485520.0
  ], 
  [
   315589, 
   null, 
   "iangb", 
   "Maybe because employment and driving are legally recognized as privileges, while gun ownership has been recognized as a right, and it's been declared that licensing a right is illegal?\n ...\n 1. A real need to buy a gun.\nYeah, but I'm also against the second amendment. You may have guessed this.\n \n \n2. Sports or job.\n Why shouldn't you be allowed to buy a gun for your own defense, or because you feel like it, or because it's just something that you want, or because you want to get a particular model that might be faced discontinuation?\n \n You're not asked about why you need to have a driver's license even though driving is just a luxury, so why should you have to display a need for a constitutional right?\n\n For most, driving is not a luxury, it's a necessity. For the rest... I quote someone from a different forum.\n For that matter, some people enjoy driving their car at 300 km/h. Now, it might be that if you let some people drive at 300 km/h, they'd misuse it, causing tragedy and death. But I don't think that should stop us from making it legal! After all, we wouldn't want someone's safety to get in the way of your cheap thrills.\n \n \nI'm reminded of a case in California, which has duty to retreat laws. A man was awoken in the late of night and discovered a man with a hatchet inside his house. The homeowner could've run outside to avoid harm, but instead he chose to stand his ground and shoot the intruder because he had family upstairs and chose not to leave them behind and alone with the crazy axe guy. He was arrested and charged because he shot first rather than ran away even though he was protecting his family.\n \n If you're the good guy you shouldn't be required to be placed behind the 8-ball when somebody has broken the law to get at you. Why should you have to prove, in a court of law, that you didn't do anything wrong, that's the job of the prosecuting attorney.\n\n Did the man lose?\n \n It's peoples right to sue for whatever the case may be (or so it appears). if it gets laughed out of court and they have to pay your legal fees, does it matter?\n \n \nNo, they're needed as evidence for the trial, and it can take years before you face a trial sometimes. So the weapons need to be stored until the case has been resolved, and then they can be destroyed.\n \n If you destroy illegal weapons when they're first seized, then where's the evidence of wrongdoing? You're gonna have to let the guilty party go free on a technicality and they're going to get away with their crime.\n \n Trouble is that anything can happen during that period of time, and I do mean anything.\nAren't they stored under police guard? So stealing them would require attacking fully armed and trained police officers?\n If it happens, I'm surprised that we don't hear about it.", 
   {}, 
   315585, 
   null, 
   1215486180.0
  ], 
  [
   315592, 
   null, 
   "Omegamon_X", 
   "Yeah, but I'm also against the second amendment. You may have guessed this.\n\n \n No surprise there.\n \n \nFor most, driving is not a luxury, it's a necessity. For the rest... I quote someone from a different forum.\n\n \n Necessity perhaps, but it's still easy enough to lose your license that it qualifies as a privilege.\n \n \nFor that matter, some people enjoy driving their car at 300 km/h. Now, it might be that if you let some people drive at 300 km/h, they'd misuse it, causing tragedy and death. But I don't think that should stop us from making it legal! After all, we wouldn't want someone's safety to get in the way of your cheap thrills.\n\n \n And it could be argued that the right to assemble and freedom of speech should be restricted because supporters of neo-nazism are allowed to spread their word of hatred and express themselves as they talk about the idea of a master race.\n \n \nDid the man lose?\n\n \n It's still in the courts.\n \n \nIt's peoples right to sue for whatever the case may be (or so it appears). if it gets laughed out of court and they have to pay your legal fees, does it matter?\n\n \n Axe man didn't sue the homeowner, the police charged him with the crime.\n \n \nAren't they stored under police guard? So stealing them would require attacking fully armed and trained police officers?\n If it happens, I'm surprised that we don't hear about it.\n\n \n http://www.kmot.com/News_Stories.asp?news=16868\n \n http://www.memphisflyer.com/memphis/Content?oid=oid%3A27812\n \n http://www.washingtonpost.com/wp-dyn/content/article/2007/01/18/AR2007011801209_pf.html", 
   {}, 
   315589, 
   null, 
   1215486900.0
  ], 
  [
   315594, 
   null, 
   "iangb", 
   "Necessity perhaps, but it's still easy enough to lose your license that it qualifies as a privilege.\nYou lose your licence for misusing your car. You lose a gun licence for misusing your gun. Surely this makes gun ownership a privilege?\n \n \nAnd it could be argued that the right to assemble and freedom of speech should be restricted because supporters of neo-nazism are allowed to spread their word of hatred and express themselves as they talk about the idea of a master race.\nIn the UK, at least, 'inciting racial hatred' has led to many people being arrested for abusing their right to free speech. I would guess that applies in the states too, though I don't know...\n \n It would be interesting to see how many weapons were stolen back, compared with the number of weapons confiscated.", 
   {}, 
   315592, 
   null, 
   1215487260.0
  ], 
  [
   315598, 
   null, 
   "Omegamon_X", 
   "You lose your licence for misusing your car. You lose a gun licence for misusing your gun. Surely this makes gun ownership a privilege?\n\n \n Not really. Gun ownership is mentioned right there in the Constitution. Just because some state has enacted a gun licensing program doesn't mean that it's constitutional or will be allowed to remain in effect.\n \n \nIn the UK, at least, 'inciting racial hatred' has led to many people being arrested for abusing their right to free speech. I would guess that applies in the states too, though I don't know...\n\n \n Not over here, otherwise those bloody Hitler supporters would be behind bars. And so would the KKK and a number of other \"racially pure\" support groups.\n \n \nIt would be interesting to see how many weapons were stolen back, compared with the number of weapons confiscated.\n\n \n It would be if such statistics were available.", 
   {}, 
   315594, 
   null, 
   1215487740.0
  ], 
  [
   315608, 
   null, 
   "iangb", 
   "Not really. Gun ownership is mentioned right there in the Constitution. Just because some state has enacted a gun licensing program doesn't mean that it's constitutional or will be allowed to remain in effect.\nIn which case, that you can lose your drivers licence for misuse of a car is not evidence that car driving is a privilege.\n Regardless, for many, driving is a necessity. Only for a few is gun ownership a necessity.\n \n Comparing the 2nd amendment to other 'rights' doesn't really apply if I am seeking to remove the second amendment.", 
   {}, 
   315598, 
   null, 
   1215488700.0
  ], 
  [
   316081, 
   null, 
   "Ethmi", 
   "I am AMAZED at how much the anti-gun people posting on here have digressed...", 
   {}, 
   315608, 
   null, 
   1215657180.0
  ], 
  [
   316084, 
   null, 
   "Omegamon_X", 
   "I've never seen a single bit of proof that the anti-gun crowd cares about saving even a single life. All you ever hear about is \"taking guns out of the hands of criminals\" but never about \"putting criminals where they can't cause anymore harm\".\n \n What's the anti-gunner's answer for when a criminal who can't get a gun instead becomes an arsonist, ban matches and gasoline next?\n \n It's actually counterproductive to the anti-gun agenda to save lives. Unless innocent people are being shot and murdered, they're not going to be able to raise outrage over anything.", 
   {}, 
   316081, 
   null, 
   1215657480.0
  ], 
  [
   316102, 
   null, 
   "iangb", 
   "I've never seen a single bit of proof that the anti-gun crowd cares about saving even a single life. All you ever hear about is \"taking guns out of the hands of criminals\" but never about \"putting criminals where they can't cause anymore harm\".\n \n What's the anti-gunner's answer for when a criminal who can't get a gun instead becomes an arsonist, ban matches and gasoline next?\n \n It's actually counterproductive to the anti-gun agenda to save lives. Unless innocent people are being shot and murdered, they're not going to be able to raise outrage over anything.\nSee, I could say here that it's actually counterproductive for you to argue well, because then you wouldn't be able to deliberately offend people. It would be about as good as your argument.\n \n 'Taking guns out of the hands of criminals' is 'putting criminals where they can't cause anyone harm' - for some, at least. It's stopping the ease with which the 'nice guys' can become the 'bad guys' - by removing the temptation of a lethal weapon. It also prevents casual crimes such as opportunistic burglary from turning into something more dangerous. How is this not 'saving lives'?", 
   {}, 
   316084, 
   null, 
   1215661800.0
  ], 
  [
   316106, 
   null, 
   "Omegamon_X", 
   "'Taking guns out of the hands of criminals' is 'putting criminals where they can't cause anyone harm' - for some, at least.\n\n \n Real life would suggest you're wrong.\n \n \nIt's stopping the ease with which the 'nice guys' can become the 'bad guys' - by removing the temptation of a lethal weapon.\n\n \n You're suggesting that the only thing keeping a person from becoming a criminal is access to guns. You're basically demonizing the firearm itself and making it out to be some sort of mystical artifact that houses an evil and malicious spirit that'll corrupt anyone that touches it and force them to become a killer.\n \n \nIt also prevents casual crimes such as opportunistic burglary from turning into something more dangerous.\n \n \n Only if the criminal individual is stupid and believes that a knife or any other weapon could never be used for harming or killing.\n \n \nHow is this not 'saving lives'?\n\n \n Let's say you manage to take a criminal's gun away from him. Good thing, right? Now let's say you made him mad and he pulls out a switchblade knife and stabs you in the heart. How's that saving your life?", 
   {}, 
   316102, 
   null, 
   1215664320.0
  ], 
  [
   316113, 
   null, 
   "Bryan", 
   "I've been here for a while now and it is always interesting to see what happens when someone new comes along and stirs everyone up. It seems like every time this happens people get their dander up and we abandon debate for competitive sniping back and forth in the pursuit of cheap \"gotcha\" points. \n \n And I am as guilty of this as the next man. \n \n I hope we all understand the RKBA is an issue on which reasonable minds may disagree.\n \n I'm not seeking to attack anyone with this post. I'm merely going to use two comments, which were not directed at me, but which were made on this thread as a springboard to re-explain my particular viewpoint. Those comments are:\n \n \"But you still say that potential first-time offenders (ie - everyone) should be allowed a gun for a cause that it is very unlikely to be used for, despite the fact that some of them will use their legally-purchased gun in a harmful manner?\"\n \n \"Innocent until proven guilty only applies to legal cases. In real life, people are only trusted with something once they've proven their worth - government/company secrets, for example, or a drivers licence. In the case of guns, shouldn't this be the same? Yes, there are proficiency tests in a few states for CCW, but I'm talking about actually having a real need to buy a gun, such as your sport or your job. Otherwise you are giving people the ability to cause massive harm for a reason which most of them will not apply.\"\n \n Here is my response. Agree or disagree as you wish...\n \n I have very real reasons for a need to have a gun, but right now I do not choose to either explain or justify them further. \n \n When we speak of \"innocent until proven guilty\" we are talking about a fundamental right which resides, like the RKBA, within the protection of the Bill of Rights. I believe that we cheapen all of these expressed rights when we liken any one of them to mere job opportunities to be entrusted with company secrets or to the privilege of having a driver's license.\n \n Like my RKBA, I don't have to justify the necessity of having a right to be free from unreasonable search and seizure; my right to free speech, press, and assembly; to blog here; to buy and read a book; to attend or not attend a church without first obtaining approval from a government functionary, to exercise my right to remain silent, to be free from cruel and unusual punishments; or my right not to be the property of another man and be called a slave. The placement of these rights in my Constitution removes the need for me to continually justify them. \n \n I have friends who are willing to take an Orwellian view of civil liberties, where all rights are equal, but the rights they like are more equal than the rights they don't like. They treat the 2nd. Amendment as if it were the red-headed stepchild of the BoR. They loath the RKBA and they are willing to sanction any means, however disingenuous, which furthers the end goal of the elimination of this right. \n \n My answer is to again say the RKBA is an issue on which reasonable minds may differ. If you don't like the RKBA, then fine. But you must realize your one and only legitimate method of taking it from me is to find the political will to amend it out of the Constitution, and unless and until that happens you are not entitled to demand why I exercise the right. You must also realize that when you cheapen it by deliberately misconstruing the intent of the Amendment, or merely arguing it is outdated or too much of a safety hazard in modern times you provide encouragement for others to use the same methods to attack other rights in the BoR they don't like. \n \n Here is a sample summary of an argument I have heard and rejected before: \"Another 9/11 style terrorist plot is out there, and we see daily how drug dealers and gang bangers poison our communities and kill those who get in their way. They are all hiding behind the protection of the right to be free from unreasonable search and seizure. If we could just get rid of that right...and I promise it won't affect you, we'll just use this new-found police state power against those we know are truly guilty....\" \n \n Now who here would not defend this right by claiming the founders placed it in the BoR for the express purpose of protecting it from this kind of opportunistic assault? \n \n If criminal misuse is to be the standard for abolishing fundamental rights, then we ought to bring back prohibition to cut down on the \"epidemic\" of drunk driving. I can see it now:\n \n The Man shows up at my door one night and demands that I surrender all the beer in my fridge. When I ask him why he says \"because we just caught a guy who killed somebody across town while driving drunk, and we have decided that we can't trust you with alcohol anymore.\" \n \n How is this different from banning guns as an attempt to cut down on crime? Who here can justify making any fundamental right I possess contingent on the misbehavior of others? If I am not responsible for the criminal misuse of guns by others, then how can someone claim that what others do justifies taking my right from me?\n \n As for me, I will continue to lay claim to not only my RKBA but my right to a presumption of innocence. I respectfully disagree with being categorized as a \"potential first time offender\" merely because I exercise my RKBA.\n \n ---\n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\" Supreme Court Justice Louis Brandeis, Olmstead v. United States, 277 U.S. 438, 485 (1928).", 
   {
    "post_info": {
     "post_title": "Just my view..."
    }, 
    "unicode_changes_made": true
   }, 
   316106, 
   null, 
   1215670740.0
  ], 
  [
   316155, 
   null, 
   "Omegamon_X", 
   "Is there anything wrong with exercising the concept of one right in order to exercise the concept of another right?", 
   {}, 
   316113, 
   null, 
   1215700680.0
  ], 
  [
   316173, 
   null, 
   "Bryan", 
   "I'm not sure I understand the question, but let me try and answer it this way...\n \n I believe our rights are not independent principles so much as they are a combined statement of our concept of liberty. The rights are designed to complement each other. \n \n SCOTUS has long engaged in its own policy of deciding that all rights are equal, but some are more equal than others. These \"more equal\" rights are referred to as \"fundamental rights\" because their very nature makes them \"preservative of other rights. See, for example the discussion of what constitutes a fundamental right in the following case which dealt with the right of suffrage:\n \n \"Undoubtedly, the right of suffrage is a fundamental matter [Page 562] in a free and democratic society. Especially since the right to exercise the franchise in a free and unimpaired manner is preservative of other basic civil and political rights, any alleged infringement of the right of citizens to vote must be carefully and meticulously scrutinized. Almost a century ago, in Yick Wo v. Hopkins, 118 U.S. 356, the Court referred to \"the political franchise of voting\" as \"a fundamental political right, because preservative of all rights.\" 118 U.S., at 370.\" Reynolds v. Sims, 377 U.S. 533, 561-562 (1964)\n \n Did our founders consider the RKBA to be \"fundamental right\"? I believe the answer lies within their Declaration of the Causes and Necessity of Taking Up Arms (July 6, 1775):\n \n We are reduced to the alternative of choosing an unconditional submission to the tyranny of irritated ministers, or resistance by force. The latter is our choice. We have counted the cost of this contest, and find nothing so dreadful as voluntary slavery. Honor, justice, and humanity, forbid us tamely to surrender that freedom which we received from our gallant ancestors, and which our innocent posterity have a right to receive from us. We cannot endure the infamy and guilt of resigning succeeding generations to that wretchedness which inevitably awaits them, if we basely entail hereditary bondage upon them.\n \n Our cause is Just. Our Union is Perfect. Our internal resources are great, and, if necessary, foreign assistance is undoubtedly attainable. - We gratefully acknowledge, as signal instances of the Divine favor towards us, that his Providence would not permit us to be called into this severe controversy, until we were grown up to our present strength, had been previously exercised in warlike operation, and possessed of the means of defending ourselves. With hearts fortified with these animating reflections, we most solemnly, before God and the world, declare, that, exerting the utmost energy of those powers, which our beneficent Creator hath graciously bestowed upon us, the arms we have been compelled by our enemies to assume, we will, in defiance of every hazard, with unabating firmness and perseverence, employ for the preservation of our liberties; being with one mind resolved to die freemen rather than to live slaves.\n \n For myself, I believe the exercise of the RKBA serves to preserve the other rights within the BoR.\n \n ---\n \n The right of self-defense is the first law of nature; in most governments it has been the study of rulers to confine this right within the narrowest possible limits...and [when] the right of the people to keep and bear arms is, under any color or pretext whatsoever, prohibited, liberty, if not already annihilated, is on the brink of destruction. Sir George Tucker, Judge of the Virginia Supreme Court and U.S. District Court of Virginia, in I Blackstone COMMENTARIES, Sir George Tucker Ed., 1803, pg. 300.\n \n Winning the battle of Pallenis, he seized the government and disarmed the people; and now he held the tyranny firmly, and he took Naxos and appointed Lygdamis ruler. The way in which he disarmed the people was this: he held an armed muster at the Temple of Theseus, and began to hold an Assembly, but he lowered his voice a little, and when they said they could not hear him, he told them to come up to the forecourt of the Acropolis, in order that his voice might carry better; and while he used up time making a speech, the men told off for this purpose gathered up the arms, locked them up in the neighboring buildings of the Temple of Theseus, and came and informed Peisistratus. Aristotle, Athenian Constitution.\n \n The inhabitants of Boston being confined within that town by the general their governor, and having, in order to procure their dismission, entered into a treaty with him, it was stipulated that the said inhabitants having deposited their arms with their own magistrates, should have liberty to depart, taking with them their own effects. They accordingly delivered up their arms, but in open violation of honor, in defiance of the obligation of treaties, which even savage nations esteemed sacred, the governor ordered the arms deposited as aforesaid, that they might be preserved for their owners, to be seized by a body of soldiers; detained the greatest part of the inhabitants in the town, and compelled the few who were permitted to retire, to leave their most valuable effects behind. Declaration of the Causes and Necessity of Taking Up Arms (July 6, 1775)\n \n Nothing will make a nation so unconquerable as a militia, or every man's being trained to arms. . . . And if the generality of housekeepers were only half disciplined, a designing prince, or ministry, would hardly dare to provoke the people by an open attack on their liberties. . . .But without the people's having some knowledge of arms, I see not what is to secure them against slavery. . . .The confidence, which a standing army gives a minister, puts him upon carrying things with a higher hand, than he would attempt to do, if the people were armed, and the court unarmed, that is, if there were no land-force in the nation, but a militia. Had we [England] at this time no standing army, we should not think of forcing money out of the pockets of three millions of our subjects. .[a long list of injustices suffered by the colonists is omitted here] . .There is no end to observations on the difference between the measures likely to be pursued by a minister backed by a standing army, and those of a court awed by the fear of an armed people. James Burgh, 2 Political Disquisitions, pp. 390 and 475-76. (London 1774).\n \n  General Gage . . . sent ought from [Boston] a large detachment of his army, who made an unprovoked assault on the inhabitants of the said province, at the town of Lexington, as appears by the affidavits of a great many persons, some of whom were officers and soldiers of the detachment, murdered eight of the inhabitants, and wounded many others. From thence the troops proceeded in warlike array to the town of Concord, where they set upon another party of the inhabitants of the same province, killing several and wounding more, until compelled to retreat by the country people suddenly assembled to repel this cruel aggression....\n The general, further emulating his ministerial masters, by a proclamation bearing date on the 12th. of June, after venting the grossest falsehoods and calumnies against the good people of these colonies, proceeds to '[D]eclare them all, either by name or description, to be rebels and traitors, to supersede the course of the common law, and instead thereof to publish and order the use and exercise of the law martial.' Declaration of the Causes and Necessity of Taking Up Arms (July 6, 1775)\n \n They tell us. . .that we are weak--unable to cope with so formidable an adversary. But when will we be stronger?. . .Will it be when we are totally disarmed, and when a British guard shall be stationed in every house?. . .Three Million people, armed in the holy cause of liberty. . .are invincible by any force which our enemy can send against us. Speech of Patrick Henry in R. Meade's Patrick Henry, p. 34 (1969)\n \n An armed republic submits less easily to the rule of one of its citizens than a republic armed by foreign forces. Rome and Sparta were for many centuries well-armed and free. The Swiss are well-armed and enjoy great freedom. . . .Among other evils caused by being disarmed, it renders you contemptible. . . . It is not reasonable to suppose that one who is armed will obey willingly one who is unarmed; or that any unarmed man will remain safe among armed servants. Machiavelli, The Prince, pp. 73 & 81 (L. Ricci, trans. 1952)\n \n In our own native land, in defense of the freedom that is our birthright, and which we ever enjoyed till the late violation of it - for the protection of our property, acquired solely by the honest industry of our fore-fathers and ourselves, against violence actually offered, we have taken up arms. We shall lay them down when hostilities shall cease on the part of the aggressors, and all danger of their being renewed shall be removed, and not before. Declaration of the Causes and Necessity of Taking Up Arms (July 6, 1775)\n \n For those who can possess and wield arms are in a position to decide whether the constitution is to continue or not. Aristotle, Politics, T. Sinclair Trans. 1962, p. 274.\n \n As civil rulers, not having their duty to the people duly before them, may attempt to tyrannize, and as the military forces which must be occasionally raised to defend our country, might pervert their power to the injury of their fellow citizens, the people are confirmed by the article in their right to keep and bear private arms. Tench Coxe, describing the purpose of the proposed 2nd. Amendment in his Remarks on the First Part of the Amendments to the Federal Constitution. Published under the pseudonym, \"A Pennsylvanian\" in the Philadelphia Federal Gazette, June 18, 1789 at 2 Col. 1.", 
   {
    "post_info": {
     "post_title": "Rights which are &quot;preservative of other rights&quot;"
    }, 
    "unicode_changes_made": true
   }, 
   316155, 
   null, 
   1215706500.0
  ], 
  [
   316176, 
   null, 
   "Roxdog", 
   "It's stopping the ease with which the 'nice guys' can become the 'bad guys' - by removing the temptation of a lethal weapon. \n\n Bwhahaaa....this is unreal. Precrime? Seriously? Minority report?\n \n And guns magically turn people into \"bad guys\"? Hum...good to know. And its funny: we will remove the temptation of a lethal weapon by enforcing new laws via our own lethal weapons. \n \n You people are freaking retarded.", 
   {}, 
   316155, 
   null, 
   1215707100.0
  ], 
  [
   316177, 
   null, 
   "Omegamon_X", 
   "Bwhahaaa....this is unreal. Precrime? Seriously? Minority report?\n \n And guns magically turn people into \"bad guys\"? Hum...good to know. And its funny: we will remove the temptation of a lethal weapon by enforcing new laws via our own lethal weapons. \n \n You people are freaking retarded.\n\n \n If guns turn people into bad guys, then it's imperative that we disarm all the police, everyone in the military, and especially the government.\n \n Demonizing objects is a stupid practice, what's the point? Once you remove the object in question and somebody commits an evil act without it, how do you explain it away then? What do you mark as evil then?", 
   {}, 
   316176, 
   null, 
   1215707340.0
  ], 
  [
   316222, 
   null, 
   "sinjin", 
   "Nice post Bryan. Thoughtful and hard to argue with.\n \n It's a shame that many who agree with your conclusions do so for far less noble reasons.", 
   {}, 
   316177, 
   null, 
   1215717480.0
  ], 
  [
   316243, 
   null, 
   "Roxdog", 
   "It's a shame that many who agree with your conclusions do so for far less noble reasons.\n\n Elaborate please. \n \n What is up with all the mind readers with an added ability to predict the future?", 
   {}, 
   316222, 
   null, 
   1215722760.0
  ], 
  [
   316270, 
   null, 
   "sinjin", 
   "Elaborate please. \n \n What is up with all the limey mind readers with an added ability to predict the future?\nI am not a subject of the Queen. Why must you be so disrespectful to our friends and allies. Ever been to the UK? Ever been out of the country?", 
   {}, 
   316243, 
   null, 
   1215729060.0
  ], 
  [
   316279, 
   null, 
   "Roxdog", 
   "If you are British, you belong to her \"majesty\"\n \n I used to live there, you dolt. emoticon_xgood", 
   {}, 
   316270, 
   null, 
   1215731340.0
  ], 
  [
   316581, 
   null, 
   "iangb", 
   "My answer is to again say the RKBA is an issue on which reasonable minds may differ. If you don't like the RKBA, then fine. But you must realize your one and only legitimate method of taking it from me is to find the political will to amend it out of the Constitution, and unless and until that happens you are not entitled to demand why I exercise the right. You must also realize that when you cheapen it by deliberately misconstruing the intent of the Amendment, or merely arguing it is outdated or too much of a safety hazard in modern times you provide encouragement for others to use the same methods to attack other rights in the BoR they don't like.\n\n Oh, absolutely. And I dislike having to return to the same initial arguments as much as you enjoy reading them, over, and over. The 'historical context' is a valid argument, however - I have no problem with every other 'right' in the constitution be reassessed by today's standards, as the Bush administration seems to be (incorrectly, IMO) doing to 'innocent until proven guilty' and 'freedom from torture' (cf Guantanemo Bay, Syria and waterboarding) under the banner of the 'war on terror'.\n \n To clarify my position, I would move that the second amendment be removed or further amended on the basis that it's current wording does more harm than good. This is mainly opinion at the moment, however, as I don't believe that there is enough evidence to prove the debate either way - just (from what I've seen) more supporting evidence for my side than against.\n \n I don't particularly believe in any fundamental 'human rights'. 'Human rights' are what we want for ourselves, and choose to give to other people in the memetic hope that they might do the same for us. To assume the existence of 'absolute rights' implies the existence of the moral absolute/God, which comes as a nothing more than one possibility to an agnostic such as myself. In that respect I treat the Constitution much as I treat the bible - I'm all for it, apart from the bits that (appear) to contradict reality.\n \n Sorry, I've rambled here. I might rewrite it better, sometime...", 
   {
    "unicode_changes_made": true
   }, 
   316279, 
   null, 
   1216001340.0
  ], 
  [
   316597, 
   null, 
   "Ethmi", 
   "Now prove that 'anti-gunners don't really want to save lives'.\n \n Ethmi is good at making up 'truths'. Unfortunately he has yet to show proof.\n\n \n For that matter, why don't you prove that you do want to save lives? I'll bet you either didn't read the OP, or you had no logical way to quote it. Now, if your intention is to save lives, then please tell me why you don't want to ban cigarettes and booze. \n \n PS: You have to prove me wrong before you can start contradicting me!", 
   {}, 
   315464, 
   null, 
   1216010700.0
  ], 
  [
   316601, 
   null, 
   "Bryan", 
   "Thank you, Sinjin. I won't say that have never tried to draw blood here when I have felt the opportunity arise, but I much prefer a more civil discussion than simple tit-for-tat. \n \n No need to apologize for going over familiar ground, Iangb. I've done it to. The subject of human rights is somewhat new to this forum. Here are my further thoughts on the matter.... \n \n I believe in the concept of fundamental human rights which transcend the legitimate authority of governments. I believe, for example, that people like Aung San Suu Kyi deserve the same freedoms of speech, press, assembly and political association that I enjoy. I have nothing to point to within the Constitution of Myranmar, though, which prohibits that nation's government from acting as it does. I can only claim, from afar, that \"we hold these truths to be self evident, that all men are created equal...\" The rulers of that nation obviously think otherwise. They do not accept my belief in basic fundamental human rights which they are morally bound to recognize. \n \n If men come to power in America who believe that there are no human rights other than those the government has elected to give to us then I believe I will be living in sad times indeed. I believe the human rights singled out for protection in my Bill of Rights were recognized and protected for the express purpose of deterring such men from deciding, for example, that political opposition can be silenced in the name of \"public order\" or \"national security.\" They cannot act upon such a desire in my nation without first doing violence to its charter of recognized liberties. In this regard, the RKBA has long been viewed as a measure of self-defense against the oppression of a tyrant: \"For those who can possess and wield arms are in a position to decide whether the constitution is to continue or not.\" Aristotle, Politics, T. Sinclair Trans. 1962, p. 274.\n \n My belief in fundamental human rights stems in part from my long acceptance of the founder's concept that all men are created equal, and are entitled to a core of basic human rights no matter what oppressive leaders say. It also stems from my belief in the existence of God. Oh I know my founders, who were largely Christians, imperfectly applied their theory of liberty at the time, for I recognize that many of these men were also slaveholders in addition to denying suffrage and political association to women. But the belief in the soundness of their underlying principle, like my belief in my religion, remains firm. If men fall short of living up to the high calling of either, then I believe it is the fault of the men and not the theory/religion.\n \n I do not speak much of my religious beliefs here because this is a gun control forum, and I do not want anyone to think I am getting too far off of the topic or trying to \"force\" my religious beliefs on anyone by mentioning them now. I will simply state this: As a religious person I have read all four Gospels pertaining to the life of Christ, and I have read of only one time when he resorted to the use of force, and that was to drive the sinners from the Temple not to make them attend. Freedom of religion exists in my country, and it includes the freedom to refuse to believe a God exists. It is, after all, a fundamental right the RKBA is designed to help protect. \n \n ---\n \n \"In Mississippi rebel State forces, men who were in the rebel armies, are traversing the State, visiting the freedmen, disarming them, perpetrating murders and outrages on them. . . .\" Congressional Globe, 39th. Congress, 1st. Session, part 1, at p. 40 (December 13, 1865) [Speech of Senator Henry Wilson (Republican-Massachusetts)]\n \n \"And I cannot see, why arms should be denied to any man who is not a slave, since they are the only true badges of liberty. . . .The possession of arms is the distinction between a freeman and a slave. He who has nothing, and belongs to another, must be defended by him, and needs no arms: but he who thinks he is his own master, and has anything he may call his own, ought to have arms to defend himself and what he possesses, or else he lives precariously and at discretion. And though for a while those who have the sword in their power abstain from doing him injury; yet, by degrees, he will be awed into submission to every arbitrary command. Our ancestors, by being always armed, and frequently in action, defended themselves against the Romans, Danes, and English; and maintained their liberty against encroachments of their own princes.\" Andrew Fletcher, Political Works, pp. 35 and 221 (1749).\n \n Editor Loyal Georgian: Have colored persons a right to own and carry firearms?--A Colored Citizen\n Almost every day we are asked questions similar to the above. We answer certainly you have the same right to own and carry arms that other citizens have. You are not only free but citizens of the United States and as such entitled to the same privileges granted to other citizens by the Constitution. . . .\n [and]\n Article II, of the amendments to the Constitution of the United States, gives the people the right to bear arms, and states that this right shall not be infringed. Any person, white or black, may be disarmed if convicted of making an improper or dangerous use of weapons, but no military or civil officer has the right or authority to disarm any class of people, thereby placing them at the mercy of others. All men, without distinction of color, have the right to keep and bear arms to defend their homes, families or themselves. From issues of the Loyal Georgian, January 20, 27 and February 3, 1866.\n \n \"Sir, I find in the Constitution of the United States an article which declares that \"the right of the people to keep and bear arms shall not be infringed.\" For myself, I shall insist that the reconstructed rebels of Mississippi respect the Constitution in their local laws. . . .\" Congressional Globe, 39th. Congress, 1st. Session, part 1, p. 1838 (April 7, 1866) [Speech of congressman Sindey Clarke (Republican-Kansas)].\n \n \"Make the colored man a citizen of the United States and he has every right which you or I have as citizens of the United States under the laws and Constitution of the United States. . . .He has a defined status; he has a country and a home; a right to defend himself and his wife and children; a right to bear arms. . . .\" Congressional Globe, 39th. Congress, 1st. Session, part 2, p. 1266 (March 8, 1866) [Speech of congressman Henry J. Raymond (Republican-New York)]\n \n \"Among the many misdeeds of the British rule in India, history will look upon the Act depriving a whole nation of arms as the blackest. If we want the Arms Act to be repealed, if we want to learn the use of arms, here is a golden opportunity. If the middle class render voluntary help to Government in the hour of its trial, distrust will disappear, and the ban on possessing arms will be withdrawn.\" Ghandi, 2 M. Gandhi, An Autobiography of the Story of My Experiments with the Truth, p. 374 (M. Desai, trans. 1927).\n \n \"Make mass searches and hold executions for found arms.\" V. I. Lenin, Collected Works, Vol. 35, 4th ed., p. 286. From Congressional Record, April 28, 1970, p. H3601.\n \n \"Pick a night and cordon off a section of South Dallas. Send hundreds of police officers--however many it would take-into the area to 'vacuum it up.' Shake down everybody on the street. Search every house and apartment. Confiscate all drugs and weapons.\" Ross Perot, The Washington Post, June 6, 1992.\n \n \"Are we at last brought to such an humiliating and debasing degradation that we cannot be trusted with arms for our own defense? Where is the difference between having our arms under our own possession and under our own direction, and having them under the management of Congress? If our defense be the real object of having those arms, in whose hands can they be trusted with more propriety, or equal safety to us, as in our own hands?\" Patrick Henry, 3 Elliot, Debates at 386.\n \n \"The most foolish mistake we could possibly make would be to allow the subject races to possess arms. History shows that all conquerors who have allowed their subject races to carry arms have prepared their own downfall by so doing. Indeed, I would go so far as to say that the supply of arms to the underdogs is a sine qua non for the overthrow of any sovereignty. So let's not have any native militia or native police. German troops alone will bear the sole responsibility for the maintenance of law and order throughout the occupied Russian territories, and a system of military strong-points must be evolved to cover the entire occupied country.\" Adolf Hitler, dinner talk on April 11, 1942, quoted in Hitler's Table Talk 1941-44: His Private Conversations, Second Edition (1973), Pg. 425-426.", 
   {
    "post_info": {
     "post_title": "Human Rights"
    }, 
    "unicode_changes_made": true
   }, 
   316597, 
   null, 
   1216016520.0
  ], 
  [
   316632, 
   null, 
   "iangb", 
   "I think that you've confirmed the basis for both our views. You believe in the existence of absolute human rights, I don't. I can't persuade you that the 2nd does more harm than good because to you, this doesn't matter - it describes for you an undeniable right. You can't persuade me that this is relevant, because I think that a right is not 'absolute'.\n \n Correct? I may be misunderstanding...\n \n Out of interest, do you believe that the Bush administration is currently not suspending some basic human rights under the rationale of a 'war on terror'?", 
   {}, 
   316601, 
   null, 
   1216071720.0
  ], 
  [
   316636, 
   null, 
   "Bryan", 
   "Well obviously we are talking theory here, but I do believe in a core of basic human rights which every person is entitled to enjoy. I believe that the individual liberties recognized in my BoR are all fundamental human rights. This does not mean that I believe all of them are contained there, though. \n \n I believe these rights are inalienable in the sense that I believe they are the birthright of every person. I believe that every person is entitled to enjoy these rights, no matter their good or bad fortune regarding whether the nation they are born into recognizes them or not. \n \n But this does not mean that I believe any of the rights expressed in my BoR is absolute in scope, no matter how they are worded. I have never argued that a right is absolute and completely immune from any limitation. In that sense we may well be in complete agreement. \n \n For example, I have long argued that the RKBA is not an absolute right and can be subject to limitation. \n \n On the issue of my government's prosecution of the \"War against Terror\" let me say this. Whether it is violating human rights or not is a question for each specific circumstance. I fear that it has in some cases. One of the basic human rights I enjoy is the freedom to disagree with my government when I choose without fear of assault or arrest. I have exercised that right before, and I will do so again now. I disagree with the policy of rendition, the policy of incarceration without trial at Gitmo, and any policy which amounts to tacit permission of torture-including water boarding. \n \n This is a fascinating discussion. Let me ask you something, Iangb. If there are no pre-existing human rights, then how do we obtain them? Do governments grant liberty? Are these rights ephemeral and tenuous enough to exist only where we the people have proven strong enough to win concessions for their recognition by our governments? History has proven this to be the case for centuries, but I am talking theory here. Is it just or right to be this way-that the strong do what they can, while the weak suffer what they must-that we should continually see the repetition of the Melian Dialogue? \n \n Assume I am the absolute ruler of Bryanistan, and I choose to torture, rape, and murder my subjects on a scale to make others call it \"genocide.\" Is it enough of an answer for me to say \"so what\"-human rights don't exist in my country because I say they don't exist, and my people lost the human rights lottery by being born where I say they are not entitled to them unless and until they prove strong enough to make me grant them these rights? \n \n Do you believe the International Court of Justice at the Hague may legitimately prosecute persons for human rights violations for crimes committed in nations where the government refuses to recognize those rights? If so, then what is the source of the court's legitimate authority?", 
   {
    "post_info": {
     "post_title": "Human rights"
    }, 
    "unicode_changes_made": true
   }, 
   316632, 
   null, 
   1216077360.0
  ], 
  [
   316641, 
   null, 
   "iangb", 
   "This is a fascinating discussion.\n\n Agreed :) Incidentally, you may find this thread an interesting read - it's from a different forum, it's almost 2 years old, it veers offtopic occasionally and the initial topic is different from this one, but it's still really quite relevant, and I'm paraphrasing myself a bit in writing this post. I also like my story-analogy on page 3, but that's just me...\n \n To look at the second part of your post first:\n \n My stance on 'human rights' is that they are one step further than (read: the ultimate version of) legal rights. To clarify (warning, I'll probably ramble - this is partly from the linked thread):\n \n There are morals, and there is legality. Morals affect what each individual person believes. For example, I could have a moral belief that murder is a good thing to do. To decide morals, individual opinions matter more than the opinions of society - obviously, because people often choose to believe their own opinion over the majorities. \n Legality, however, affects how each individual person behaves. To decide legality, the moral opinion of individuals matters less than the opinions of the majority - or the opinions of the individuals who happen to run the country at the time (unfortunately - thanks, Mugabe). Might may not make 'right', but it can make 'legal'.\n 'Human rights' (IMO) are basically laws that are (when instated) supported by the vast majority. Hence 'self-evident' - there may be counter-arguments, but few people have heard them or even considered that they might exist. They may also have more moral relevance than other laws. However, they are no more than the legal enforcement of majority morality/opinion.\n \n The most interesting scenario is the one as you've described - where two countries have different opinions on 'human rights'. I'd imagine this goes on more than is expected, in minutiae - for example, the death penalty, or gun control. To blow it out of all proportion, however, to risk the wrath of Godwin, and because it's discussed in my link (above), let's look at Hitler. In committing genocide Hitler suspended 'human rights', as seen by the modern world. How does this stand up to my model? \n Morally from our point of view, Hitler was 'wrong', and he was acting illegally (again, from our pov). However, from his point of view he was acting both morally and legally - he had the might to make 'law', and he had the individual opinion to make 'right'. So, what justification did the rest of the world have for (seemingly) imposing their morality on Hitler?\n The answer is that they were not imposing morality, but legality. The fact that because it was a 'human right' being broken then it was a moral issue does not change that Hitler was acting illegally in the eyes of the world majority - and in a global society when you break the rules, you are often punished. This - legality - is the basis on which all international prosecution takes place, not morals.\n \n I feel I've rambled enough for now... I should write this up properly, if i get the time I'll try to.", 
   {}, 
   316636, 
   null, 
   1216081740.0
  ], 
  [
   316988, 
   null, 
   "Bryan", 
   "Very well then.\n \n It appears we can agree there are \"human rights\" which transcend governmental authority even if we cannot agree on the ultimate source of these rights.\n \n I believe the RKBA is one of these fundamental human rights. You disagree. And that's that.\n \n I enjoy being able to talk to someone who I disagree with without having to resort to name calling or other foolishness. I've had similar solid discussions with Sinjin, Galileo, and Voice of Reason. Would that everyone, on both sides, be this way. Although if this were so then this site might get a little too boring... \n \n This does not mean that our future discussions, if any, will remain this way. It is entirely possible that in the future either you or I will say something to make the other say \"I can't believe he said something that foolish. I got to go jump him about that.\" \n \n Now excuse me for a moment while I do just that to someone who deserves far less respect than do you and the others I have mentioned in this post....", 
   {
    "post_info": {
     "post_title": "we agree to disagree"
    }, 
    "unicode_changes_made": true
   }, 
   316641, 
   null, 
   1216420080.0
  ], 
  [
   317006, 
   null, 
   "Shooterandproud", 
   "I think that you've confirmed the basis for both our views. You believe in the existence of absolute human rights, I don't. I can't persuade you that the 2nd does more harm than good because to you, this doesn't matter - it describes for you an undeniable right. You can't persuade me that this is relevant, because I think that a right is not 'absolute'.\n\n \n I too am agnostic, however I do believe in basic human rights. I do not believe that people have the right to take other people's rights away.\n \n In my opinion, the 2nd amendment is a very important amendment. It was designed to give the people power over the government. It's just more checks and balances. If the people have guns, the government is much less likely to turn into a dictatorship. However, I do believe that this idea is somewhat outdated. This will obviously not happen anytime soon. This is why I am against the ownership of fully automatic M4s and Kalashnikovs.\n \n However, there is another right that our people deserve to enjoy. It is the right of protection. Sure, we have phones that we can use to call the police with if something is wrong, but all the police can really do is call an ambulance for your dead or mangled body, if something happens. Once a criminal knows you have called the police, whether it be in your home or in an alleyway, they will usually flee once they are done with whatever they're doing to you. I want to prevent this from happening. The people deserve some sense of security that they can defend themselves immediately.\n \n And even though guns are devastating if they fall into the wrong hands, I believe this is an acceptable risk. If a criminal wants a gun he will get one, the same way a drug addict will obtain his illegal drugs. Banning drugs and alchohal didn't work out so well, what makes you think banning guns will?\n \n \n \n \nCorrect? I may be misunderstanding...\n \n Out of interest, do you believe that the Bush administration is currently not suspending some basic human rights under the rationale of a 'war on terror'?\n\n \n Read my sig.", 
   {}, 
   316632, 
   null, 
   1216449000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is the Real Intention Behind the Anti-gun People?", 
  "url": "http://www.4forums.com/political/gun-control-debates/11313-what-real-intention-behind-anti-gun-people.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11313, 
  "discussion_files": [
   [
    "10142.html", 
    "http://www.4forums.com/political/gun-control-debates/11313-what-real-intention-behind-anti-gun-people-print.html"
   ], 
   [
    "10143.html", 
    "http://www.4forums.com/political/gun-control-debates/11313-what-real-intention-behind-anti-gun-people-5-print.html"
   ], 
   [
    "10144.html", 
    "http://www.4forums.com/political/gun-control-debates/11313-what-real-intention-behind-anti-gun-people-4-print.html"
   ], 
   [
    "10145.html", 
    "http://www.4forums.com/political/gun-control-debates/11313-what-real-intention-behind-anti-gun-people-3-print.html"
   ], 
   [
    "10146.html", 
    "http://www.4forums.com/political/gun-control-debates/11313-what-real-intention-behind-anti-gun-people-2-print.html"
   ]
  ], 
  "identifier": 11313
 }
]