[
 [
  [
   314713, 
   null, 
   "Archangel", 
   "Jason accused me of being a hypocrite here: http://www.4forums.com/political/showpost.php?p=314709&postcount=180\n \n Prove that I don't live the philosophy and beliefs I defend and promote on this forum jason, or apologize for slandering and attacking me with lies about my character.", 
   {
    "post_info": {
     "post_title": "JazyJason accuses Archangel of being a hypocrite:"
    }
   }, 
   null, 
   null, 
   1215007860.0
  ], 
  [
   314715, 
   null, 
   "jazyjason", 
   "Jason accused me of being a hypocrite here: http://www.4forums.com/political/showpost.php?p=314709&postcount=180\n \n Prove that I don't live the philosophy and beliefs I defend and promote on this forum jason, or apologize for slandering and attacking me with lies about my character.\n\n \n OK Archie if I have to sift through the myriad of slanderous posts screaming of the ternal damnation of gays and the personal insults and attacks upon 1 the gay community and 2 persons who arent in agreement with your bigoted point of view I will. Man this is going to be a long drawn out thread.....", 
   {}, 
   314713, 
   null, 
   1215008100.0
  ], 
  [
   314718, 
   null, 
   "jazyjason", 
   "Here is an example of him insulting the gay community and insuling it.\n \n \nThe term GAY was adopted by the homosexual movement in the hope of evoking a happy existence and persona to the general public that rightfully saw your community for the pathetic self centered existence that it still represents.\n\n \n Yet he says he lives by christ and follows his way. Clearly jesus's teaching of love all people doesnt exist here. It is full of bitterness and contempt for a group of people and is thus, slanderous and judgemental.", 
   {}, 
   314715, 
   null, 
   1215008760.0
  ], 
  [
   314720, 
   null, 
   "Archangel", 
   "Here is an example of him insulting the gay community and insuling it.\n \n Yet he says he lives by christ and follows his way. Clearly jesus's teaching of love all people doesnt exist here. It is full of bitterness and contempt for a group of people and is thus, slanderous and judgemental.\n\n \n Wrong again jason. my criticism of homosexuality is a true act of love toward your eternal soul which will live well beyond the lusts of this flesh which you are so short sighted in focussing on in your desire to satisfy that flesh. Just because I don't massage and encourage your sinful desires, doesn't mean I don't love you. In fact my refusal to endorse your destructive lifestyle is the best evidence of my love for you and all gay people.", 
   {}, 
   314718, 
   null, 
   1215009480.0
  ], 
  [
   314721, 
   null, 
   "jazyjason", 
   "Wrong again jason. my criticism of homosexuality is a true act of love toward your eternal soul which will live well beyond the lusts of this flesh which you are so short sighted in focussing on in your desire to satisfy that flesh. Just because I don't massage and encourage your sinful desires, doesn't mean I don't love you. In fact my refusal to endorse your destructive lifestyle is the best evidence of my love for you and all gay people.\n\n \n SO in your warped mind slandering and isulting and aiming personal attacks on gays is justified by you thinking you will guilt us into salvation!? Are you serious? Wow so bigoted insults and judgements are now a \"true act of love\". What a bunch of self proclaimed bull.", 
   {}, 
   314720, 
   null, 
   1215009600.0
  ], 
  [
   314722, 
   null, 
   "jazyjason", 
   "I haven't slandered anyone jason, I have just told the truth and that is what riles you because you hate the truth. And I'll start a thread on the liars corner too, demanding that you prove I'm a hypocrite since I'm the most consistent person on this forum regarding my beliefs. Two can play at that game jason.\n\n \n \n You havnt slandered anyone? Really? You sure? is that your final answer? You just contradicted yourself again AND you justified it as an act of love right in this thread!!!\n \n Quote:\n Originally Posted by jazyjason \n Here is an example of him insulting the gay community and insuling it.\n \n Yet he says he lives by christ and follows his way. Clearly jesus's teaching of love all people doesnt exist here. It is full of bitterness and contempt for a group of people and is thus, slanderous and judgemental. \n \n \n Wrong again jason. my criticism of homosexuality is a true act of love toward your eternal soul which will live well beyond the lusts of this flesh which you are so short sighted in focussing on in your desire to satisfy that flesh. Just because I don't massage and encourage your sinful desires, doesn't mean I don't love you. In fact my refusal to endorse your destructive lifestyle is the best evidence of my love for you and all gay people.", 
   {}, 
   314721, 
   null, 
   1215009780.0
  ], 
  [
   314723, 
   null, 
   "jazyjason", 
   "And as for other proof, there's this classic:\n \"And let's face it, you're as touchy, judgmental and bitchy as a gay \"\n \n Standard homophobic stereotypes; classic biggotry. The original post was so offensive the admin deleted it, but many people quoted it before it was axed.\n \n http://www.4forums.com/political/showthread.php?t=10813\n\n \n Wow so offensive the admin had to delete it? I guess jesus is patting you on the back right now Archie congrats. I'm certain that you follow jesus's teachings to a tee. What a joke.", 
   {}, 
   314722, 
   null, 
   1215010680.0
  ], 
  [
   314725, 
   null, 
   "Archangel", 
   "Wow so offensive the admin had to delete it? I guess jesus is patting you on the back right now Archie congrats. I'm certain that you follow jesus's teachings to a tee. What a joke.\n\n \n This is kronus's old standby, which is taken out of context. But it does nothing to further your argument so I'll ignore it. That's why he PMd it to you rather than posted it openly. Beside, a hypocrite is someone who claims to be something they're not. You have shown no evidence at all that I don't embrace Christ and His beliefs in precisely the way I claim to.", 
   {}, 
   314723, 
   null, 
   1215011400.0
  ], 
  [
   314731, 
   null, 
   "jazyjason", 
   "This is kronus's old standby, which is taken out of context. But it does nothing to further your argument so I'll ignore it. That's why he PMd it to you rather than posted it openly. Beside, a hypocrite is someone who claims to be something they're not. You have shown no evidence at all that I don't embrace Christ and His beliefs in precisely the way I claim to.\n\n \n Umm actually I found it myself. Yes you contradict by saying you dont hate gays or whatever dribble you spew, then go off and insult ridicule and judge. That is opposite of christs teachings.", 
   {}, 
   314725, 
   null, 
   1215014400.0
  ], 
  [
   314735, 
   null, 
   "Archangel", 
   "Umm actually I found it myself. Yes you contradict by saying you dont hate gays or whatever dribble you spew, then go off and insult ridicule and judge. That is opposite of christs teachings.\n\n \n No, again, it is giving my honest opinion about what you represent. And there's nothing dishonest or hypocritical about giving my honest opinion.", 
   {}, 
   314731, 
   null, 
   1215015960.0
  ], 
  [
   314739, 
   null, 
   "jazyjason", 
   "No, again, it is giving my honest opinion about what you represent. And there's nothing dishonest or hypocritical about giving my honest opinion.\n\n \n \n So you calling gays self centered, militants, etc etc then saying you dont do that and you follow gods teachings, then give some assnine excuse that it's out of love is really just incredibble.\n \n And what do I represent? Sin? Come on Archie your saying that I'm like a disease or something when actually the only disease is the one in your head.", 
   {}, 
   314735, 
   null, 
   1215017100.0
  ], 
  [
   314741, 
   null, 
   "Archangel", 
   "So you calling gays self centered, militants, etc etc then saying you dont do that and you follow gods teachings, then give some assnine excuse that it's out of love is really just incredibble.\n \n And what do I represent? Sin? Come on Archie your saying that I'm like a disease or something when actually the only disease is the one in your head.\n\n \n The fact is that homosexuality is a very self centered lifestyle that is based on satisfying the lusts of the flesh in an unnatural way. heterosexuality in its pure form between a man and a woman leads to new life that propagates the human species naturally and as it was intended to grow. This isn't just my opinion, so you have no right to attempt to limit my speech just because you don't want to be reminded about how wrong and unnatural your lifestyle is.\n \n And I'm not saying that you're a disease jason, but you are afflicted by a disease called the \"sinful nature of man\" like every other human being alive today, INCLUDING ME. So stop allowing your poor self image and personal insecurities cause you to project your self hatred on me by blaming me for all of your self image problems.", 
   {}, 
   314739, 
   null, 
   1215018000.0
  ], 
  [
   314743, 
   null, 
   "jazyjason", 
   "The fact is that homosexuality is a very self centered lifestyle that is based on satisfying the lusts of the flesh in an unnatural way. heterosexuality in its pure form between a man and a woman leads to new life that propagates the human species naturally and as it was intended to grow. This isn't just my opinion, so you have no right to attempt to limit my speech just because you don't want to be reminded about how wrong and unnatural your lifestyle is.\n \n And I'm not saying that you're a disease jason, but you are afflicted by a disease called the \"sinful nature of man\" like every other human being alive today, INCLUDING ME. So stop allowing your poor self image and personal insecurities cause you to project your self hatred on me by blaming me for all of your self image problems.\n\n \n Heterosexuality in it's pure form. So your saying sex is a sin unless for procreation only? And why all of a sudden are you basing your arguement on that? Isn't heterosexuality a sin in some forms?\n \n Limit your speech? Again I havnt attempted that in any way. Wrong and unnatural lifestyle... Based upon what? Is it harming you or anyone around you? Once again no factual basis for these assnine claims.\n \n Oh and whats the cure for the \"sinful nature of man\" disease? I'm sure the AMA would have tried to make a vaccine by now or a foundation if it effected everyone in the world. Oh you mean free will well umm Archie it was given by god so then did god give us the disease?\n \n How do I project and blame my issues on you? Have I ever said Archie you make me loathe myself? I take care of my own issues, I just call you out on how you try to come across as some self righteous holy nut and say oh I'm for jesus and quote scripture, yet you turn right around and slander insult and even threaten other people who dont agree with you.\n \n And for the record Archie I dont have self image issues. I have been rasied as a very strong independent individual and I have served my country and I am proud of who I am. So dont sit here and again try to pull the make the gay guy look weak routine because quite frankly its pretty %&*#ing dumb and really really cowardly.", 
   {}, 
   314741, 
   null, 
   1215018600.0
  ], 
  [
   314745, 
   null, 
   "Archangel", 
   "You have just proven in your response that any spiritual references that are raised go over your head just as teaching math to an insect would go over its head. Proving once again that your assertion of acceptance of Jesus was a blatant lie. If you had accepted Him as you claim, you would stand by His teachings.", 
   {}, 
   314743, 
   null, 
   1215019380.0
  ], 
  [
   314747, 
   null, 
   "electrolyte", 
   "You have just proven in your response that any spiritual references that are raised go over your head...\n\n That's not \"spirituality,\" that's \"Bible worship.\" Just because it's not just your idea doesn't make it less idiotic.", 
   {}, 
   314745, 
   null, 
   1215019620.0
  ], 
  [
   314756, 
   null, 
   "jazyjason", 
   "You have just proven in your response that any spiritual references that are raised go over your head just as teaching math to an insect would go over its head. Proving once again that your assertion of acceptance of Jesus was a blatant lie. If you had accepted Him as you claim, you would stand by His teachings.\n\n \n Once again you try to make it appear I'm inferior to some supreme knowledge you claim to have. Funny how you use god as a front to justify your reckless bigotry and slander.", 
   {}, 
   314745, 
   null, 
   1215024060.0
  ], 
  [
   314762, 
   null, 
   "Archangel", 
   "Once again you try to make it appear I'm inferior to some supreme knowledge you claim to have. \n\n \n You are jason. And I have proven that you have wrongly slandered me by calling me a hypocrite. I'll expect an apology from you forth with. emoticon_xbye", 
   {}, 
   314756, 
   null, 
   1215025320.0
  ], 
  [
   314763, 
   null, 
   "smiley", 
   "You are jason. And I have proven that you have wrongly slandered me by calling me a hypocrite. I'll expect an apology from you forth with. emoticon_xbye\n\n Analysis by sentence:\n \n 1 - Slander.\n 2 - Just plain wrong (on both points) - you have proven nothing (ever as far as I can remember) and Jason has not slandered you, he has summed you up very accurately.\n 3 - Wishful thinking.\n \n Smiley", 
   {}, 
   314762, 
   null, 
   1215025800.0
  ], 
  [
   314772, 
   null, 
   "Archangel", 
   "Analysis by sentence:\n \n 1 - Slander.\n 2 - Just plain wrong (on both points) - you have proven nothing (ever as far as I can remember) and Jason has not slandered you, he has summed you up very accurately.\n 3 - Wishful thinking.\n \n Smiley\n\n \n And why, pray tell, should you be considered an objective arbiter of any dispute between me and one of your fellow homosexuals? Are you all completely ignorant of the concept of what an objective observer would be? Cuz believe me smiley, it aint you. emoticon_rolleyes", 
   {}, 
   314763, 
   null, 
   1215028620.0
  ], 
  [
   314773, 
   null, 
   "smiley", 
   "And why, pray tell, should you be considered an objective arbiter of any dispute between me and one of your fellow homosexuals? Are you all completely ignorant of the concept of what an objective observer would be? Cuz believe me smiley, it aint you. emoticon_rolleyes\n\n Where did you get the insane idea that I'm a homosexual?\n \n Smiley", 
   {}, 
   314772, 
   null, 
   1215028740.0
  ], 
  [
   314774, 
   null, 
   "Penfold", 
   "Because you agreed with one, of course! emoticon_rolleyes The truly pathetic part is that he sees the accusation as an insult!\n \n Given that this is the \"Liar's corner\", has Archie created a need for a \"Hypocrite's corner\" too?", 
   {}, 
   314773, 
   null, 
   1215028980.0
  ], 
  [
   314776, 
   null, 
   "DrNo", 
   "Wrong again jason. my criticism of homosexuality is a true act of love toward your eternal soul which will live well beyond the lusts of this flesh which you are so short sighted in focussing on in your desire to satisfy that flesh. Just because I don't massage and encourage your sinful desires, doesn't mean I don't love you. In fact my refusal to endorse your destructive lifestyle is the best evidence of my love for you and all gay people.\n\n \n So you must only have sex to procreate. Anything else would be short-sighted lust for the sole purpose of satisfying the flesh, correct?", 
   {}, 
   314720, 
   null, 
   1215030420.0
  ], 
  [
   314779, 
   null, 
   "thelmoose", 
   "...a true act of love toward your eternal soul which will live well beyond the lusts of this flesh \n\n \n What is a true act of love which will live beyond the lusts of the flesh, and why can't homosexuals do that?\n \n \n An aside:\n Where along the line did lust get to be a bad thing?", 
   {}, 
   314720, 
   null, 
   1215031380.0
  ], 
  [
   314783, 
   null, 
   "Archangel", 
   "Where did you get the insane idea that I'm a homosexual?\n \n Smiley\n\n \n I got it from just about everything you have ever said on this forum. Sorry if I misunderstood.\n \n \nSo you must only have sex to procreate. Anything else would be short-sighted lust for the sole purpose of satisfying the flesh, correct?\n\n \n No, not at all. The principle has always been having the ability to pro-create naturally if they are willing and able to. But you already knew that, didn't you? It's just important to attempt to trap or manipulate what I say.\n \n \nWhat is a true act of love which will live beyond the lusts of the flesh, and why can't homosexuals do that?\n \n An aside:\n Where along the line did lust get to be a bad thing?\n\n \n The fact that you must even ask these questions, say's everything about how far apart we are morally speaking moose.", 
   {}, 
   314779, 
   null, 
   1215034440.0
  ], 
  [
   314792, 
   null, 
   "Penfold", 
   "He merely seeks to clarify your views on the topic, since they are obviously far different form the norm.", 
   {}, 
   314783, 
   null, 
   1215036900.0
  ], 
  [
   314796, 
   null, 
   "electrolyte", 
   "Prove that I don't live the philosophy and beliefs I defend and promote on this forum jason, or apologize for slandering and attacking me with lies about my character.\n [to obvious_child] ... I'm trying to change the tone of how we interact with each other, and that starts with controlling how I react to attacks on me.\n \n ....\n \n I'm going to do my part to elevate the quality of interaction on this forum, partly out of respect for admin, partly because it's the right thing to do and partly because I'm tired of fighting with people over minutia rather than debating the issues.\n\"I'll do better!\" Archie cries. \"I'll debate the actual issues!\" Archie proclaims.\n \n This lasted about two days. Archie is back to his old self, accusing people of being atheists and homosexuals instead of debating the issues, letting loose with unrestrained namecalling and crying bloody murder when somebody responds in anything but a back-slapping manner, spewing baseless assertions contrary to all evidence and refusing to address counterarguments with any semblance or reason... all to avoid debating the issues.", 
   {}, 
   314713, 
   null, 
   1215037800.0
  ], 
  [
   314798, 
   null, 
   "electrolyte", 
   "I got it from just about everything you have ever said on this forum. Sorry if I misunderstood.\n\n Think nothing of it, Smiley. He decided that I must be gay when I showed I'm not a bigot.\n It's one thing to accuse people of choosing to be homosexual; it's quite another to try to insult people by trying to make that declaration for them.", 
   {}, 
   314783, 
   null, 
   1215038400.0
  ], 
  [
   314799, 
   null, 
   "Archangel", 
   "He merely seeks to clarify your views on the topic, since they are obviously far different form the norm.\n\n \n Who are you anti-christian atheists to determine or judge what is the spiritual norm from the biblical perspective? You people neither have a personal relationship with God nor do you study or even attempt to understand the bible as God intends it to be understood. But that is my whole intent without question. \n \n Does anyone here believe I would stand against homosexuality as a stumbling block for salvation if the bible said it was good and edifying for everyone who practices it? I have said a hundred times or more that I have no personal axe to grind with homosexuality except that God condemns it as a stumbling block for its practitioners.\n \n And what I marvel at is that none of the gay apologists ever even respond when I clarify that point to any of you in any posts. It fly's right over your head as you revert to attacking me as a bigot.", 
   {}, 
   314792, 
   null, 
   1215038580.0
  ], 
  [
   314800, 
   null, 
   "Penfold", 
   "What gives you the delusion that atheists perceive christianity as any different from the thousands of other supernatural imaginings? \n As for your complaint that atheists cannot make a valid comment on the bible, having never experienced god's love, the same holds true for your denigration of homosexuality. Don't knock it if you have never tried it.", 
   {}, 
   314799, 
   null, 
   1215038880.0
  ], 
  [
   314804, 
   null, 
   "thelmoose", 
   "Originally Posted by thelmoose: \n What is a true act of love which will live beyond the lusts of the flesh, and why can't homosexuals do that?\n \n \nThe fact that you must even ask these questions, say's everything about how far apart we are morally speaking moose.\n\n \n Rather than ignoring the question, please edify me. (I already know how far apart morally we are.)", 
   {}, 
   314783, 
   null, 
   1215039660.0
  ], 
  [
   314805, 
   null, 
   "electrolyte", 
   "Does anyone here believe I would stand against homosexuality as a stumbling block for salvation if the bible said it was good and edifying for everyone who practices it? I have said a hundred times or more that I have no personal axe to grind with homosexuality except that God condemns it as a stumbling block for its practitioners.\n\n I believe that you will believe whatever interpretation of the Bible you want to believe.\n \n \nAnd what I marvel at is that none of the gay apologists ever even respond when I clarify that point to any of you in any posts. It fly's right over your head as you revert to attacking me as a bigot.\n\n And I marvel at your selective amnesia. You've been repeatedly raked over the coals for your selective application of \"moral\" laws in Leviticus, yet you continue to hold this bigotry and try to justify it by appealing to your \"all-loving\" deity. Then you lie and say that nobody's challenged you on it.\n \n \"Test all things; hold fast what is good.\" 1 Thessalonians 5:21\n \n \"Test nothing, for testing is Satan's methodology; hold fast whatever you want as long as you can pretend that ancient goat herding mythology backs you up.\" Archie 1:1", 
   {}, 
   314799, 
   null, 
   1215039660.0
  ], 
  [
   314810, 
   null, 
   "Archangel", 
   "And I marvel at your selective amnesia. You've been repeatedly raked over the coals for your selective application of \"moral\" laws in Leviticus,\n\n \n Talk about selective memory. Feel free to post the debates regarding Leviticus where the secular humanists interpretations have \"repeatedly\" raked me over the coals. Go ahead lyteboy, back up your unsupportable, false and boastful clam..", 
   {}, 
   314805, 
   null, 
   1215042480.0
  ], 
  [
   314812, 
   null, 
   "Archangel", 
   "What gives you the delusion that atheists perceive christianity as any different from the thousands of other supernatural imaginings?\n\n \n Nothing at all Penfold. I fully and completely realize that you can't tell the difference between a cult and Gods eternal truth. Here's how the bible explains it.\n \n 2Th 2:9 \n The coming of the lawless one is according to the working of Satan, with all power, signs, and \"lying\" wonders,\n 2Th 2:10 \n and with all unrighteous deception among those who perish, because they did not receive the love of the truth, that they might be saved.\n 2Th 2:11 \n And for this reason God will send them strong delusion, that they should believe the lie,\n 2Th 2:12 \n that they all may be condemned who did not believe the truth but had pleasure in unrighteousness.\n \n As for your complaint that atheists cannot make a valid comment on the bible, having never experienced god's love, the same holds true for your denigration of homosexuality. Don't knock it if you have never tried it.\n\n \n There's a huge difference Penfold. You see, I don't have to roll in the mud to know that I'll get dirty if I do. Hopefully you can gleen that message from the passage above.", 
   {}, 
   314800, 
   null, 
   1215043200.0
  ], 
  [
   314815, 
   null, 
   "Penfold", 
   "The word is glean, and your \"loving\" God not only lies and deceives his \"creations\" but brags about it too? Nice. Does it occur to you that other cults make similar self-serving claims to yours?", 
   {}, 
   314812, 
   null, 
   1215044520.0
  ], 
  [
   314817, 
   null, 
   "T.Q", 
   "\n \n 2Th 2:9 \n The coming of the lawless one is according to the working of Satan, with all power, signs, and \"lying\" wonders,\n 2Th 2:10 \n and with all unrighteous deception among those who perish, because they did not receive the love of the truth, that they might be saved.\n 2Th 2:11 \n And for this reason God will send them strong delusion, that they should believe the lie,\n 2Th 2:12 \n that they all may be condemned who did not believe the truth but had pleasure in unrighteousness.\n \n \n\n Anyone else see the absolute maliciousness and depravity present in the quote, or is it just me?", 
   {}, 
   314812, 
   null, 
   1215044580.0
  ], 
  [
   314819, 
   null, 
   "Archangel", 
   "The word is glean, and your \"loving\" God not only lies and deceives his \"creations\" but brags about it too? Nice. Does it occur to you that other cults make similar self-serving claims to yours?\n\n \n Then you do believe in Him? I thought you were an avowed atheist. \n \n \nAnyone else see the absolute maliciousness and depravity present in the quote, or is it just me?\n\n \n It's the bible tq, I didn't write it, but I agree, it is a very scary passage since it speaks to the coming destruction of those who reject the truth.", 
   {}, 
   314817, 
   null, 
   1215044760.0
  ], 
  [
   314821, 
   null, 
   "electrolyte", 
   "... it speaks to the coming destruction of those who reject the truth.\n\n How noble. People reject the Truth\u0099 because God deludes them, then God punishes them for rejecting the Truth\u0099.", 
   {}, 
   314819, 
   null, 
   1215045660.0
  ], 
  [
   314822, 
   null, 
   "T.Q", 
   "It's the bible tq,\n\n No way! Really?\n \n \nI didn't write it,\n\n Well, I'm glad you cleared that misunderstanding up.\n \n \nbut I agree, it is a very scary passage since it speaks to the coming destruction of those who reject the truth.\n\n \n And it speaks to how God will intentionally trick people into going astray, so as to be able to condemn them.\n \n \nHow noble. People reject the Truth&#8482; because God deludes them, then God punishes them for rejecting the Truth&#8482;.\n\n Bingo.", 
   {}, 
   314819, 
   null, 
   1215045900.0
  ], 
  [
   314824, 
   null, 
   "jazyjason", 
   "You are jason. And I have proven that you have wrongly slandered me by calling me a hypocrite. I'll expect an apology from you forth with. emoticon_xbye\n\n \n Once again an INSULT towards me because I disagree with you on an issue. Is this out of love too? Another pathetic excuse for your destruction of threads and topics with your bigoted views and spin on issues you have no knowledge of whatsoever.\n \n And I feel no need to apologize since everyone is awaiting on you to still apologize to TQ on the comments you've made about him and cause I valled you out on the liar's corner you IMMEADIATELY flipped the issue and accused me. You really are sad.", 
   {}, 
   314762, 
   null, 
   1215046560.0
  ], 
  [
   314825, 
   null, 
   "electrolyte", 
   "Talk about selective memory. Feel free to post the debates regarding Leviticus where the secular humanists interpretations have \"repeatedly\" raked me over the coals. Go ahead lyteboy, back up your unsupportable, false and boastful clam..\n\n Let's get some clarification:\n \n Do you deny that:\n 1) you've discussed the moral codes that you think regard homosexuality that are found in the Bible, or\n 2) you've had your XXX kicked on said codes, or\n 3) both?\n \n There's no sense in arguing with you on #2. Your \"debating\" could be the most vacuous, asinine, and idiotic arguments on the face of the planet, and you would insist that your ultimate position of \"my reading of the Bible tells me [this], therefore I must be right\" makes me wrong. If I linked to every thread where somebody roasted you on your interpretation of your favorite goat-herder myths, you'd still argue that I'm lying. I'm not interested in playing that game. Deny #1, and I'll expose you as a lying sack of cr**.\n \n \n... and boastful clam..\n\n Oh, I'm sorry: a lying sack of clam.", 
   {}, 
   314810, 
   null, 
   1215046620.0
  ], 
  [
   314861, 
   null, 
   "Archangel", 
   "Stop squirming and changing the goal posts lyte. Post the threads and posts where I have been raked over the coals by any of you secular humanists and atheists regarding Leviticus AT ALL. I have refuted every false interpretation you guys have thrown out there. Especially the ones from the original language regarding homosexuality.", 
   {}, 
   314825, 
   null, 
   1215055320.0
  ], 
  [
   314879, 
   null, 
   "electrolyte", 
   "Stop squirming and changing the goal posts lyte.\n\n That must be some high quality stuff you've been smoking. I didn't move the goalposts at all. I said that there's no point in arguing that you were raked over the coals because all you would do is scream that you weren't, even when any sane reading would show that you were, and that you'll believe your interpretation no matter what. And what was your response?I have refuted every false interpretation you guys have thrown out there. Especially the ones from the original language regarding homosexuality.\nI rest my case.", 
   {}, 
   314861, 
   null, 
   1215059220.0
  ], 
  [
   314885, 
   null, 
   "jazyjason", 
   "That must be some high quality stuff you've been smoking. I didn't move the goalposts at all. I said that there's no point in arguing that you were raked over the coals because all you would do is scream that you weren't, even when any sane reading would show that you were, and that you'll believe your interpretation no matter what. And what was your response?I rest my case.\n\n \n \n Ph course he wont openly quote posts he made slandering people and attacking them with personal insults, but when it comes to him being a martyr of some sort he cries foul and complains.", 
   {}, 
   314879, 
   null, 
   1215061380.0
  ], 
  [
   314932, 
   null, 
   "Penfold", 
   "Then you do believe in Him? I thought you were an avowed atheist. ...\n\n \n \n Atheists don't make vows to invisible friends, not even the Pink Unicorn. They have no need.", 
   {}, 
   314819, 
   null, 
   1215104340.0
  ], 
  [
   315255, 
   null, 
   "Matthew S", 
   "\n \n No, not at all. The principle has always been having the ability to pro-create naturally if they are willing and able to. But you already knew that, didn't you? It's just important to attempt to trap or manipulate what I say.\n \n \n \n \n\n \n So what will you say to the gay couples who have children that are geneticly related to them both and one of them carries the child? Will you change your tune when gay people have the ability, that is comming soon, to procreate?\n \n To remind you. One of my stem cells is taken and forced to produce an egg. Then the egg is fertilized with my husbands sperm. Then I carry the child ectopicly. This is the same procedure that would be used if an infertle hetero couple tries to have a child, yet you are not concerned with infertile heteros having sex for pleasure. Why is that?", 
   {}, 
   314783, 
   null, 
   1215320640.0
  ], 
  [
   315262, 
   null, 
   "Bassman", 
   "So what will you say to the gay couples who have children that are geneticly related to them both and one of them carries the child? Will you change your tune when gay people have the ability, that is comming soon, to procreate?\n \n To remind you. One of my stem cells is taken and forced to produce an egg. Then the egg is fertilized with my husbands sperm. Then I carry the child ectopicly. This is the same procedure that would be used if an infertle hetero couple tries to have a child, yet you are not concerned with infertile heteros having sex for pleasure. Why is that?\nHave you ever even cosidered the damage it will cause you??!?! I thought it was bad enough that Matt espouses an \"anything goes\" mentality, but this is just outright dangerous! THIS is why God made male AND female!!", 
   {}, 
   315255, 
   null, 
   1215321120.0
  ], 
  [
   315282, 
   null, 
   "Archangel", 
   "Archangel \n \n No, not at all. The principle has always been having the ability to pro-create naturally if they are willing and able to. But you already knew that, didn't you? It's just important to attempt to trap or manipulate what I say.\n\n \n \nSo what will you say to the gay couples who have children that are geneticly related to them both and one of them carries the child? Will you change your tune when gay people have the ability, that is comming soon, to procreate?\n \n To remind you. One of my stem cells is taken and forced to produce an egg. Then the egg is fertilized with my husbands sperm. Then I carry the child ectopicly. This is the same procedure that would be used if an infertle hetero couple tries to have a child, yet you are not concerned with infertile heteros having sex for pleasure. Why is that?\n\n \n \n Ditto what Bassman said, and please notice the bolded word in my quoted post which you responded to Matthew? The word \"natural\" is key to it being a God blessed function between 2 people. I understand that medicine helps married couples conceive in difficult circumstances today, but it isn't defying what God intended originally as what you are looking forward to Matt.", 
   {}, 
   315255, 
   null, 
   1215323760.0
  ], 
  [
   315284, 
   null, 
   "Bassman", 
   "Arch, that's the whole mentality of people like Matt. They do not look at the long term ramifications of their actions. All they want is to govern their lives by pure emotion!", 
   {}, 
   315282, 
   null, 
   1215323880.0
  ], 
  [
   315330, 
   null, 
   "smiley", 
   "Although I agree that muddling around with nature by making an egg out of a stem cell and then mating it with a sperm is just looking for trouble (what happens if you end up with the two Y chromosomes combining?), to say that you have to have the ability to pro-create naturally means that anyone with some defect like low sperm count, or their ability to carry a baby to full term is also up the creak without a canoe.\n \n I'm sure you weren't planning on going that far and discriminating against a much greater proportion of the population, but you have to have some flexibility here. Though perhaps not as much as Matt would wish.\n \n Smiley", 
   {}, 
   315284, 
   null, 
   1215362280.0
  ], 
  [
   315334, 
   null, 
   "electrolyte", 
   "... to say that you have to have the ability to pro-create naturally means that anyone with some defect like low sperm count, or their ability to carry a baby to full term is also up the creak without a canoe.\n\n Seems to me it also means that using contraception is as terrible a sin as homosexual sex, as would be (even heterosexual) oral or anal sex. Or Family Guy style aural sex.", 
   {}, 
   315330, 
   null, 
   1215363360.0
  ], 
  [
   315368, 
   null, 
   "Matthew S", 
   "Ditto what Bassman said, and please notice the bolded word in my quoted post which you responded to Matthew? The word \"natural\" is key to it being a God blessed function between 2 people. I understand that medicine helps married couples conceive in difficult circumstances today, but it isn't defying what God intended originally as what you are looking forward to Matt.\n\n \n So when an egg and a sperm combine that is not natural? What of a woman that has an ectopic pregnancy is not natural? What of in vitro fertilization used for couples who are infertile?", 
   {}, 
   315282, 
   null, 
   1215388920.0
  ], 
  [
   315371, 
   null, 
   "Bassman", 
   "So when an egg and a sperm combine that is not natural? What of a woman that has an ectopic pregnancy is not natural? What of in vitro fertilization used for couples who are infertile?\nNot intended to sound sexist, but it is the truth. Women have the proper organs and bone structure that enable them to carry children, men don't. And yes ectopic pregnancies do occur (my friend's wife had one), but they do not last long and usually result in major problems such as hemoragging.", 
   {}, 
   315368, 
   null, 
   1215390360.0
  ], 
  [
   315382, 
   null, 
   "Archangel", 
   "So when an egg and a sperm combine that is not natural? What of a woman that has an ectopic pregnancy is not natural? What of in vitro fertilization used for couples who are infertile?\n\n \n Besides agreeing with Bassman, let me ask you Matt, do you have fallopian tubes? Not if you're a man. Besides which, such pregnancies ALWAYS FAIL. I don't know where you come up with these imaginings, but you really need to get a clue about reality.\n What is an ectopic pregnancy? \n \n Ectopic means \"in the wrong place\", so it's a pregnancy that develops outside the womb. It happens in about one in every 100 pregnancies in Britain, which works out at about 10,700 pregnancies a year. \n \n Most ectopic pregnancies (95 per cent) implant in one of the fallopian tubes, which is why it is also known as a tubal pregnancy. As the pregnancy grows, it causes pain and bleeding and, if not recognized, the tube can rupture, causing internal bleeding. \n \n This is a medical emergency and can be fatal. The pregnancy itself never survives - it can't be moved to the womb - it has to be completely removed. http://www.babycentre.co.uk/pregnancy/complications/ectopic/", 
   {}, 
   315368, 
   null, 
   1215399540.0
  ], 
  [
   315434, 
   null, 
   "jazyjason", 
   "Have you ever even cosidered the damage it will cause you??!?! I thought it was bad enough that Matt espouses an \"anything goes\" mentality, but this is just outright dangerous! THIS is why God made male AND female!!\n\n \n Wow how narrow minded. You know I often find it odd and almost comical that an issue which doesnt concern these people in their daily lives could spark so much bitterness and contempt.\n \n So how is me being gay dangerous? Am I threatening to hurt you cause I'm gay? Or am I unraveling some moral fiber that somehow holds everything in your narrow small world together? Sorry but you and archie both can have your \"relationship\" with whatever diety you deem absoulte.\n \n But when it comes to your dangerous narrow bigoted thinking in public legislature that affects everyone around you, thats when it is a danger to a free society and a true democracy.", 
   {}, 
   315262, 
   null, 
   1215436740.0
  ], 
  [
   315450, 
   null, 
   "Archangel", 
   "Wow how narrow minded. You know I often find it odd and almost comical that an issue which doesnt concern these people in their daily lives could spark so much bitterness and contempt. \n \n So how is me being gay dangerous? Am I threatening to hurt you cause I'm gay? Or am I unraveling some moral fiber that somehow holds everything in your narrow small world together? Sorry but you and archie both can have your \"relationship\" with whatever diety you deem absoulte.\n\n \n Are you so blinded by your rage and hatred against we straight people that you're unable to even follow the context of what we say before even realizing that what we're saying isn't an attack against gays, but is regarding what Matt is claiming to want to do? Can you not see that Bassman and I both are commenting on Matthews desire to have an eptopic pregnancy even though he doesn't even have fallopian tubes? Not to even mention that such pregnancies are fatal if allowed to continue?\n \n Our concern wasn't about the dangers of gayness at all, but was commenting on his ridiculous assertions that him getting pregnant and carrying a baby eptopicly is not only incredibly dangerous, but impossible for men. So by you focussing on our very reasonable concerns for Matthew's ability\n to think rationally, you just prove that you're as incapable as he is to come up with a lucid thought. So note the blue bolded sentence below to see why what Matthew suggests is so dangerous jason, if you can focus your attention in reality that long anyway. :xbanghead \n \n \nBesides agreeing with Bassman, let me ask you Matt, do you have fallopian tubes? Not if you're a man. Besides which, such pregnancies ALWAYS FAIL. I don't know where you come up with these imaginings, but you really need to get a clue about reality.\n What is an ectopic pregnancy? \n \n Ectopic means \"in the wrong place\", so it's a pregnancy that develops outside the womb. It happens in about one in every 100 pregnancies in Britain, which works out at about 10,700 pregnancies a year. \n \n Most ectopic pregnancies (95 per cent) implant in one of the fallopian tubes, which is why it is also known as a tubal pregnancy. As the pregnancy grows, it causes pain and bleeding and, if not recognized, the tube can rupture, causing internal bleeding. \n \n This is a medical emergency and can be fatal. The pregnancy itself never survives - it can't be moved to the womb - it has to be completely removed. http://www.babycentre.co.uk/pregnancy/complications/ectopic/\n", 
   {}, 
   315434, 
   null, 
   1215447660.0
  ], 
  [
   315876, 
   null, 
   "jazyjason", 
   "Are you so blinded by your rage and hatred against we straight people that you're unable to even follow the context of what we say before even realizing that what we're saying isn't an attack against gays, but is regarding what Matt is claiming to want to do? Can you not see that Bassman and I both are commenting on Matthews desire to have an eptopic pregnancy even though he doesn't even have fallopian tubes? Not to even mention that such pregnancies are fatal if allowed to continue?\n \n Our concern wasn't about the dangers of gayness at all, but was commenting on his ridiculous assertions that him getting pregnant and carrying a baby eptopicly is not only incredibly dangerous, but impossible for men. So by you focussing on our very reasonable concerns for Matthew's ability\n to think rationally, you just prove that you're as incapable as he is to come up with a lucid thought. So note the blue bolded sentence below to see why what Matthew suggests is so dangerous jason, if you can focus your attention in reality that long anyway. :xbanghead\n\n \n \n Reality? Thats the pot calling the kettle black archie. I'll admit I was scrolling through the post rather quickly as I was at work and that was my mistake. I still find it odd though that at every turn when your views are put into question you feel like you are being attacked in some way. People just question your views and want rational factual evidence to back them up. Not this oh you'll find out when you die ####.", 
   {}, 
   315450, 
   null, 
   1215609420.0
  ], 
  [
   315883, 
   null, 
   "Archangel", 
   "Reality? Thats the pot calling the kettle black archie. I'll admit I was scrolling through the post rather quickly as I was at work and that was my mistake. I still find it odd though that at every turn when your views are put into question you feel like you are being attacked in some way. People just question your views and want rational factual evidence to back them up. Not this oh you'll find out when you die ####.\n\n \n So because I believe in God and claim a personal relationship with him, I don't have a grip on reality? Is that your allegation? And how else am I to take it when you respond to my post that I'm saying all homosexuals are dangerous, when in fact Bassman and I both are responding to Matthews delusional desires to have a very dangerous, if not fatal and even physically impossible ectopic pregnancy since men don't have fallopian tubes. You had no interest in understanding my thought on any issue other than to attack and insult me falsely. And tell me this jason, how else will unbelievers who attack and insult what the bible promises spiritually, really learn the absolute truth of their rejection of it, other than by first hand evidence once they die? Some things just can't be proven here, and the supernatural is one of them. All I'm saying is that if you refuse to believe the warnings that the bible gives you NOW, then you will surely learn how true those warnings were after you die. And that's a promise.", 
   {}, 
   315876, 
   null, 
   1215611040.0
  ], 
  [
   315884, 
   null, 
   "jazyjason", 
   "So because I believe in God and claim a personal relationship with him, I don't have a grip on reality? Is that your allegation? And how else am I to take it when you respond to my post that I'm saying all homosexuals are dangerous, when in fact Bassman and I both are responding to Matthews delusional desires to have a very dangerous, if not fatal and even physically impossible ectopic pregnancy since men don't have fallopian tubes. You had no interest in understanding my thought on any issue other than to attack and insult me falsely. And tell me this jason, how else will unbelievers who attack and insult what the bible promises spiritually, really learn the absolute truth of their rejection of it, other than by first hand evidence once they die? Some things just can't be proven here, and the supernatural is one of them. All I'm saying is that if you refuse to believe the warnings that the bible gives you NOW, then you will surely learn how true those warnings were after you die. And that's a promise.\n\n \n \n Im saying that in a sense of reality there are others who dont believe what you do and have other opinions, beliefs and morals. This is the way democracy is defined is that everyone is created equal under god which thus, states that we are all to be given the same rights freedoms and liberties as the next man regardless of his sexual oreintation, religion, color, creed, sex, or any other factor that differs one person from another. \n \n These rights include gays who want to express their views and their love for one another regardless if the majority agrees or disagrees because all citizens are protected under a bill of rights and our constitution. In the pursuit of happiness gays are given clear voiance to love freely to express that love in any way including marriage, and to be protected.\n \n What I am refering to is that despite what your beliefs are, despite what you think is truth what is right and what is evil or wrong, you as a citizen cannot discriminate against or isolate a group of people due to religious beliefs. There is a seperation of church and state in this country. Because if there wasn't every religious faction from baptists to self proclaimed jedi, would constantly bicker and fight for control to make their views right under the law.", 
   {}, 
   315883, 
   null, 
   1215611880.0
  ], 
  [
   315937, 
   null, 
   "sinjin", 
   "So because I believe in God and claim a personal relationship with him, I don't have a grip on reality? Is that your allegation? And how else am I to take it when you respond to my post that I'm saying all homosexuals are dangerous, when in fact Bassman and I both are responding to Matthews delusional desires to have a very dangerous, if not fatal and even physically impossible ectopic pregnancy since men don't have fallopian tubes. You had no interest in understanding my thought on any issue other than to attack and insult me falsely. And tell me this jason, how else will unbelievers who attack and insult what the bible promises spiritually, really learn the absolute truth of their rejection of it, other than by first hand evidence once they die? Some things just can't be proven here, and the supernatural is one of them. All I'm saying is that if you refuse to believe the warnings that the bible gives you NOW, then you will surely learn how true those warnings were after you die. And that's a promise.\nA promise you needn't worry about keeping.", 
   {}, 
   315883, 
   null, 
   1215630420.0
  ], 
  [
   317335, 
   null, 
   "Shooterandproud", 
   "Wrong again jason. my criticism of homosexuality is a true act of love toward your eternal soul which will live well beyond the lusts of this flesh which you are so short sighted in focussing on in your desire to satisfy that flesh. Just because I don't massage and encourage your sinful desires, doesn't mean I don't love you. In fact my refusal to endorse your destructive lifestyle is the best evidence of my love for you and all gay people.\n\n \n I like how Christians are allowed to insult and slander gays and call it \"love\", but when one small negative word is thrown toward Christians they flip out. Interesting.", 
   {}, 
   314720, 
   null, 
   1216778220.0
  ], 
  [
   317532, 
   null, 
   "chester", 
   "I like how Christians are allowed to insult and slander gays and call it \"love\", but when one small negative word is thrown toward Christians they flip out. Interesting.\n\n \n It's called Doublestandarditis, and is brought about upon entering a \"church\" which requires you to check your rational mind at the door.\n \n Understand that these folks are out to repeal both the Enlightenment and the scientific method.", 
   {}, 
   317335, 
   null, 
   1216870800.0
  ], 
  [
   325622, 
   null, 
   "jazyjason", 
   "It's called Doublestandarditis, and is brought about upon entering a \"church\" which requires you to check your rational mind at the door.\n \n Understand that these folks are out to repeal both the Enlightenment and the scientific method.\n\n \n I can affrim that with the church my family attends. Pastor said of I dont hate gays I just dont like what they are and I love them because god does. In lamens terms I'll talk to you to convert you and I love you cause god tells me to but only if you conform to my beliefs. Otherwise your a sinner I hate you and all that you stand for and you destroy families and ruin communities...", 
   {}, 
   317532, 
   null, 
   1222724520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  JazyJason accuses Archangel of being a hypocrite:", 
  "url": "http://www.4forums.com/political/liars-corner/11335-jazyjason-accuses-archangel-being-hypocrite.html", 
  "breadcrumbs": [
   "Liars Corner"
  ], 
  "id_number": 11335, 
  "discussion_files": [
   [
    "13596.html", 
    "http://www.4forums.com/political/liars-corner/11335-jazyjason-accuses-archangel-being-hypocrite-print.html"
   ], 
   [
    "13597.html", 
    "http://www.4forums.com/political/liars-corner/11335-jazyjason-accuses-archangel-being-hypocrite-5-print.html"
   ], 
   [
    "13598.html", 
    "http://www.4forums.com/political/liars-corner/11335-jazyjason-accuses-archangel-being-hypocrite-4-print.html"
   ], 
   [
    "13599.html", 
    "http://www.4forums.com/political/liars-corner/11335-jazyjason-accuses-archangel-being-hypocrite-3-print.html"
   ], 
   [
    "13600.html", 
    "http://www.4forums.com/political/liars-corner/11335-jazyjason-accuses-archangel-being-hypocrite-2-print.html"
   ]
  ], 
  "identifier": 11335
 }
]