[
 [
  [
   314625, 
   null, 
   "iangb", 
   "http://blogs.guardian.co.uk/news/2008/07/anglican_church_in_crisis.html\n \n To summarise: the Anglican church is looking like splitting, with bishops (mainly from the southern hemisphere) threatening to walk out from the main hierarchy, due to the Church's current positions on homosexuality and the ordination of women.\n \n Personally, I wasn't even aware that ordination of women was that much of an issue any more - that traditionalists are trying to revert the system can only be viewed as somewhat tragic.", 
   {
    "post_info": {
     "post_title": "A crisis in faith"
    }
   }, 
   null, 
   null, 
   1214916720.0
  ], 
  [
   314628, 
   null, 
   "jazyjason", 
   "http://blogs.guardian.co.uk/news/2008/07/anglican_church_in_crisis.html\n \n To summarise: the Anglican church is looking like splitting, with bishops (mainly from the southern hemisphere) threatening to walk out from the main hierarchy, due to the Church's current positions on homosexuality and the ordination of women.\n \n Personally, I wasn't even aware that ordination of women was that much of an issue any more - that traditionalists are trying to revert the system can only be viewed as somewhat tragic.\n\n \n People are waking up and realizing this kind of bigoted thinking is harmful and wrong. Religion isnt a police force it is a belief.", 
   {}, 
   314625, 
   null, 
   1214919360.0
  ], 
  [
   314636, 
   null, 
   "iangb", 
   "Just to clarify - the mainstream Anglican church is pro-female ordination and pro-homosexual rights. It's the traditionalists that are walking out, because they see the mainstream as too liberal.\n \n I'm quite a fan of the Anglican Church as a model of Christianity, although that is general principles, not specific cases (where, in a few instances, homophobia has still been shown to run deep).", 
   {}, 
   314628, 
   null, 
   1214928480.0
  ], 
  [
   314648, 
   null, 
   "Jo Bennett", 
   "It's a massive oversimplification to say that the Anglican \"mainstream\" is anything. Anglicanism is the very definition of a broad church, there is no specifically Anglican catechism or confession of faith, the alliance of Christians within Anglicanism is as much an accident of history as a product of shared values. That said, for many Anglicans this very variety of belief and expression has led to greater tolerance of conflicting views. It's not even possible to pin down individual churches within the communion as being on one side or the other, though you could perhaps point to Nigeria, where the church is trying to out-hate extremist islam with regard to attitudes to women and homosexuals, as being most firmly on the reactionary side of things.\n \n It's certainly not sensible to portray this as north v south, one of the strongest proponents of liberal values in the Anglican Communion has been Archbishop Desmond Tutu, former archbishop of Cape Town, and fewer than half of African bishops attended the Faco conference. It is largely down to the personal views of Bishops, particularly in places like England where Bishops are appointed rather than elected. It's tempting with some, such as Michael Nazir-Ali, to attach some latent revenge motives to their views, given that the Bishop of Rochester was the evangelicals' favoured candidate to succeed George Carey, but that seems unchartiable.", 
   {}, 
   314636, 
   null, 
   1214943060.0
  ], 
  [
   314653, 
   null, 
   "Ripskar", 
   "I think the term \"traditionalists\" is misleading given the evangelical preponderance amongst the Gafcon group. It isn't a new conflict either, I've been following it for months, even bringing it up here once or twice, though the Yanks aren't that intrested.\n My own view is that Williams is wasting his time trying to placate this group, I doubt they'd be happy if the planet was under Puritanical dictatorship with witch burnings twice daily, far too liberal.\n The Archbishop should really deliver an ultimatum to them, \"Get in line or join the Baptists\" but I can't see him doing that.\n Thus we get this slow dragged out argument with the churches position being dragged inexorably to the far right and the congregation popping thier clogs and not being replaced.", 
   {}, 
   314648, 
   null, 
   1214949720.0
  ], 
  [
   314682, 
   null, 
   "Jo Bennett", 
   "I think the question of congregation replacement is a red herring, if anything simplistic, hate-filled rehtoric is more appealing to people who are looking for order and direction in their lives. The more usual CofE caution and uncertainty is not particularly appealing, and it is harder to negotiate. Younger people can be more inclined towards fundamentalism, whether it be in politics or religion (you don't see many middle aged suicide bombers, for example).", 
   {}, 
   314653, 
   null, 
   1214979480.0
  ], 
  [
   314684, 
   null, 
   "MrWriteLA", 
   "Younger people are turning in droves from these authoritarian shephardic myths, because they see the world as it is, and aren't taken in by some contradictory, slap-you-with-a-ruler idiocy based on what people thought 2000 years ago. \n \n They aren't deluded into denying science and the plainly observable real world, like some pathetically insecure psychotic who needs to conjure up a cruel, arbitrary, supernatural sky genie in whose image we're supposedly made (except that the genie has no need for lungs, legs, or balls) to justify his constant pathetic chanting of nyah-nyah-nyah-you're-going-to-hell-and-I'm-not and sticking his tongue out 24/7 at everyone who doesn't share his delusions, in the vain attempt to prove this makes him in some way superior--when in fact he's universally loathed and if anything drives people away from the \"religion\" he professes to promote.\n \n This pathological reliance on absurd agrarian-culture mythology is beginning to die out in the light of science and rationality, and not a moment too soon.", 
   {}, 
   314682, 
   null, 
   1214984160.0
  ], 
  [
   314768, 
   null, 
   "Ripskar", 
   "I think the question of congregation replacement is a red herring, if anything simplistic, hate-filled rehtoric is more appealing to people who are looking for order and direction in their lives. The more usual CofE caution and uncertainty is not particularly appealing, and it is harder to negotiate. Younger people can be more inclined towards fundamentalism, whether it be in politics or religion (you don't see many middle aged suicide bombers, for example).\n\n \n Well certainly all the members of the far right that I know are members of evangelical churches, none are CofE and I have heard them dismiss the CofE as \"Not real protestants\". Is that the crowd the CofE wants to attract?\n As for attracting the \"young\" what age group(s) do you think the CofE should be concentrating on?", 
   {}, 
   314682, 
   null, 
   1215027480.0
  ], 
  [
   314808, 
   null, 
   "Zardoz", 
   "As for attracting the \"young\" what age group(s) do you think the CofE should be concentrating on?\n\n \n Ouchy.\n \n You make it sound like religion markets itself to be appealing...just like a business.\n \n Wow.\n I guess that whole 'not to conform yourself to the world' is just a platitude not meant to be taken seriously.\n \n Romans 12:2", 
   {}, 
   314768, 
   null, 
   1215040800.0
  ], 
  [
   314829, 
   null, 
   "T.Q", 
   "The first thing I thought of when I read that was \"Buddy Christ\", and here comes Zardoz with his avatar ;)", 
   {}, 
   314808, 
   null, 
   1215048840.0
  ], 
  [
   314895, 
   null, 
   "Jo Bennett", 
   "Well certainly all the members of the far right that I know are members of evangelical churches, none are CofE and I have heard them dismiss the CofE as \"Not real protestants\". Is that the crowd the CofE wants to attract?\n As for attracting the \"young\" what age group(s) do you think the CofE should be concentrating on?\n\n \n The CofE is a national church, it should be attracting anyone and everyone. I don't think it should change its values in order to do that, but maybe it needs to articulate those values better. At the moment it is seen as too liberal by the fundies and too conservative by wider society.", 
   {}, 
   314768, 
   null, 
   1215065280.0
  ], 
  [
   314979, 
   null, 
   "Ripskar", 
   "Ouchy.\n You make it sound like religion markets itself to be appealing...just like a business.\n Wow.\n I guess that whole 'not to conform yourself to the world' is just a platitude not meant to be taken seriously.\n \n Romans 12:2\n\n To all intents an purposes it does, though more in the manner of a political party than a business per se. \n As Jo indicates the adolescent crowd and twenty-somethings respond more to rabble-rousing which is the trademark of the evangelicals. Kids don't count, they go where their parents send them, (in theory at least).\n That leaves us with the middle aged and the blue rinse brigade. The CofE is associated with the latter, which is the prinicipal problem.\n It also seems to have 'some' association with the wealthy, (or at any rate it has that reputation amongst the evangelicals, -see previous post for political bias associated).\n \n \nThe CofE is a national church, it should be attracting anyone and everyone. I don't think it should change its values in order to do that, but maybe it needs to articulate those values better. At the moment it is seen as too liberal by the fundies and too conservative by wider society.\n\n \n Fine as a general (and therefore meaningless) statement, though you know as well as I do that you can't please everyone. Given you want to attract a majority of the population would it make more sence to mirror the bias of \"wider society\", or pander to the proclaimations of \"fundies\", which are catered for by literally swarms of non-CofE evangelical churches, and given your choice, should Lambeth Palace even consider compromising with the Gafcon group who show no signs of compromise themselves?", 
   {}, 
   314808, 
   null, 
   1215130140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A crisis in faith", 
  "url": "http://www.4forums.com/political/religion-debates/11331-crisis-faith.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 11331, 
  "discussion_files": [
   [
    "2296.html", 
    "http://www.4forums.com/political/religion-debates/11331-crisis-faith-print.html"
   ]
  ], 
  "identifier": 11331
 }
]