[
 [
  [
   314668, 
   null, 
   "Penfold", 
   "July 1st is the 150th anniversary of the Theory of Evolution being read to the Linnean Society.\n \n http://www.wired.com/science/discoveries/news/2008/06/dayintech_0701", 
   {
    "post_info": {
     "post_title": "Happy Anniversary Evolution!"
    }
   }, 
   null, 
   null, 
   1214963160.0
  ], 
  [
   316767, 
   null, 
   "prschuster", 
   "And in those 150 years, all the creationists in the world haven't been able to falsify or debunk the theory. Of course, in their own deluded minds, they actually believe they have done just that.", 
   {}, 
   314668, 
   null, 
   1216172760.0
  ], 
  [
   316775, 
   null, 
   "marc9000", 
   "And in those 150 years, all the evolutionists in the world haven't been able to falsify or debunk the book of Genesis. Of course, in their own deluded minds, they actually believe they have done just that.", 
   {}, 
   314668, 
   null, 
   1216176120.0
  ], 
  [
   316779, 
   null, 
   "iangb", 
   "...well, no. Genesis is a faith account and creationism is not a science, which makes it kinda hard to falsify. \n \n That said, you got any answers to why we can see light from planets more than 10,000 light years away? Or why isochron dating of zircon crystals gives consistent, predictable results that date the earth at far older than literal Genesis would have you believe? Or why there are so many examples of observed stages of evolution that the creationist definition of 'impossible macroevolution' has had to shrink to preposterous levels? Or how Noah fit tens of thousands of animals on his Ark? Or....", 
   {}, 
   316775, 
   null, 
   1216176840.0
  ], 
  [
   316787, 
   null, 
   "electrolyte", 
   "And in those 150 years, all the evolutionists in the world haven't been able to falsify or debunk the book of Genesis.\n\n A literal interpretation of the book of Genesis was debunked 200 years ago by scientists studying geology.", 
   {}, 
   316775, 
   null, 
   1216182480.0
  ], 
  [
   316825, 
   null, 
   "pandion", 
   "A literal interpretation of the book of Genesis was debunked 200 years ago by scientists studying geology.\nIt is interesting to note that Genesis was debunked by scientists who were also creationists. Those creationists then began to babble about multiple, successive creations with Genesis being the last. Even worse, they also babbled about their god creating fossil evidence in order to test the faithful.", 
   {}, 
   316787, 
   null, 
   1216224360.0
  ], 
  [
   316874, 
   null, 
   "obvious_child", 
   "And in those 150 years, all the evolutionists in the world haven't been able to falsify or debunk the book of Genesis. Of course, in their own deluded minds, they actually believe they have done just that.\n\n \n Yeah, they haven't done anything in regards to the following:\n \n 1) Aid the creation of new types of seeds to start the various Green Revolutions that freed billions from famine around the world\n 2) Aid the creation of new drugs to fight all kinds of diseases\n 3) Play a huge role in agriculture, from foods to flowers\n 4) Play a huge role in animal breeding\n 5) Develop DNA testing tools for genetic counseling, in law enforcement in detective work, and in civil legal court to determine paternity of children.\n 6) Develop genetic algorithms\n \n Yup in 150 years, evolution has played no role in those. \n \n Delusions haunt those who refuse to look at reality.\n \n Btw, care to explain why it took 20 pages before one of your crackpot creationists tried to refute my argument on the flood?", 
   {}, 
   316775, 
   null, 
   1216273020.0
  ], 
  [
   316897, 
   null, 
   "sinjin", 
   "And in those 150 years, all the evolutionists in the world haven't been able to falsify or debunk the Rig-Veda. Of course, in their own deluded minds, they actually believe they have done just that.\n http://library.thinkquest.org/03oct/00875/text/IndiaC.htm", 
   {}, 
   316775, 
   null, 
   1216314360.0
  ], 
  [
   316935, 
   null, 
   "marc9000", 
   "It's interesting to note where discussions about evolution almost always lead. Is a subject best defined by the end result of where discussions of it almost always lead? Something worth exploring, I think. \n \n This thread was started with an observance of a notable date in the history of evolution. What could be more innocent than that? It inspired the very next poster to ridicule creationists - no provocation whatsoever from any creationist. The thread from long ago, Another Gap Filled started with the discovery (however controversial) of Tiktaalik roseae. Same thing, second post, no provocation, a ridicule of creationists. Another thread from the past that I remember was where no creationists posted, yet creationists were ridiculed in 20 of the 29 total posts. Probably half or more of all threads in this forum start with a ridicule of creationists, as did that one. It seems to be by far the most common bond among evolutionists, whatever their particular interest in the subject. \n \n Does evolution not have enough substance to inspire interest, excitement etc. in something besides a put down of other people? Can anyone link me to a thorough forum discussion anywhere, where multiple posters discuss what evolution claims to have done - new seeds, new drugs, agriculture, animal breeding, DNA, law enforcement, completely devoid of put downs of creationists? Is there any other natural subject with near as much dependence on ridicule of other people? \n \n \n Evolution is supposed to be science, and is said to not address religion. Why is it that so many discussions of it address religion, without any religious provocation? If evolution is science, and is taught to children as such, to further biological understanding, to help us better understand the natural world, to provide us with so many things claimed in post #7, it seems to me that the internet would be loaded with discussions of those things, and not get near religion. Other subjects do, why can't evolution? \n \n Again, is a subject best defined by the end result of where discussions of it almost always lead?\n \n (this computer is headed for the shop tomorrow, so I'll look forward to viewing all the thoughtful, loving responses to this sometime next week)", 
   {
    "unicode_changes_made": true
   }, 
   314668, 
   null, 
   1216345860.0
  ], 
  [
   316944, 
   null, 
   "electrolyte", 
   "Does evolution not have enough substance to inspire interest, excitement etc. in something besides a put down of other people?\n\n Absolutely. The idea of evolution has spawned innumerable experiments, observations, analyses, discussions, brainstorms, etc. In fact, there is so much substance that it takes some severe deficiency -- be it of information, comprehension/understanding, rationality, or brainpower -- to reject the conclusion of that substance.\n \n \nEvolution is supposed to be science, and is said to not address religion.\n\n And the scientific papers don't. The problem here is that creationists don't read the scientific papers. In fact, most can't even understand them.\n \n \nWhy is it that so many discussions of it address religion, without any religious provocation?\n\n Maybe because there are so damn many people like you who need to see how ridiculous your position is?\n \n \nIf evolution is science, and is taught to children as such, to further biological understanding, to help us better understand the natural world, to provide us with so many things claimed in post #7, it seems to me that the internet would be loaded with discussions of those things, and not get near religion.\n\n Wow, marc. This conclusion that you've drawn is amazing in that it's so incredibly nonsensical. First, why would internet discussions on a general board be devoid of discussion about creationists and creationism? Second, and more importantly, creationists make it an issue by trying to push creationism into the schools. If creationist nutjobs would quit trying to push, we'd never have to worry about religion in the science classroom.\n \n \nAgain, is a subject best defined by the end result of where discussions of it almost always lead?\n\n Regardless of the answer to this question, it's worth pointing out that the scientific articles don't rip on creationism.\n \n \n(this computer is headed for the shop tomorrow, so I&#8217;ll look forward to viewing all the thoughtful, loving responses to this sometime next week)\n\n Good luck. When you get the chance, you can respond to the AiG thread.", 
   {}, 
   316935, 
   null, 
   1216349280.0
  ], 
  [
   316946, 
   null, 
   "Archangel", 
   "Could Jones' Ruling Affect Evolution Education?\n \n Jim Bendewald\n \n Not every evolutionist is ecstatic about the decision Judge John Jones made on December 20, 2005. In a startling article published January 5, 2006, Lloyd Eby,* a philosophy professor from George Washington University, stated that the judge overstepped his bounds when he defined \"science\" in his 139 page ruling. \n \n As a result of Jones's statements Eby wrote, \"I predict that sometime in the future -- say a hundred years hence -- this case and Judge's Jones opinion in it will turn out to be seen as having been like the Catholic Church's case against Galileo. Except that this time the winning and losing sides will have switched; the proponents of evolution and scientific naturalism will by then have lost the war against religion and ID, even though they won the Dover battle.\"[1] Possibly the prediction could come true much sooner than Eby thinks.\n \n The overstepping slip by the judge amplifies one of the major arguments creationists have voiced against evolution from the beginning of this debate--evolution is not science! While evolutionists prefer an obscure definition of science, Judge Jones has now put it into law. This is very exciting for critics of evolution because Jones has made \"science\" definitive. The ramifications in the future court cases could overturn evolution education in public schools, which is exactly what Eby has predicted and is exactly the opposite of what Jones intended.\n \n Jones wrote in the ruling concerning science, \"Methodological naturalism is a 'ground rule' of science today which requires scientists to seek explanations in the world around us based upon what we can observe, test, replicate, and verify.\"[2] Jones went on in glorious detail defining science, \"NAS is in agreement that science is limited to empirical, observable and ultimately testable data: 'Science is a particular way of knowing about the world. In science, explanations are restricted to those that can be inferred from the confirmable data -- the results obtained through observations and experiments that can be substantiated by other scientists. Anything that can be observed or measured is amenable to scientific investigation. Explanations that cannot be based upon empirical evidence are not part of science.'\"[3]\n \n Jones decided that Intelligent Design is metaphysical in nature. Jones has also written, while citing various sources, that science is by nature methodological naturalism and not metaphysical. This unmuddled definition has tremendous implications not only for Intelligent Design, but also for evolution as taught in public schools.\n \n A fundamental position of ID supporters is that evolutionists do not define key terms such as \"science\". By keeping the public in the dark, evolutionists could write off Intelligent Design as religious while maintaining that evolution is scientific. This double standard might finally come to the public's attention because of Judge Jones' detailed definition and description of science.\n \n Evolution is principally metaphysics based on many unprovable assumptions. There is no empirical evidence for macroevolution, and the evidence that some call microevolution is simple adaptation. The extrapolation of evidence from adaptation to macroevolution is not empirical science. Uniformitarian geology and interpreting the fossil record in favor of evolution is based upon the unprovable assumption that evolution is true. The Big Bang is also based on the assumption that evolution is true. There is much better evidence to suggest that the universe has a center and an edge which is contrary to the Big Bang Theory. See the DVD Starlight and Time for an understandable explanation for these cosmological issues.\n \n This paragraph above could be a quote of me from any one of many debates I have had here and been roundly mocked for believing.\n \n Though Eby clearly is an evolutionist, his own honesty about the metaphysical nature of the origins issue comes to light when he writes, \"How could an irreducibly complex biological structure come about through evolutionary methods that require gradualism -- that go against what is known in revolutionary biology as saltationism or the view that completely new living things appeared all at once in discontinuous jumps from what existed before?\"[4] Eby elaborates on the impossible odds for the universe to even exist and he willingly asked such questions as, \"where did it [Big Bang] come from and what came before it?\"[5] \n \n These are all metaphysical questions. If Jones's definition of science becomes known to the broad public then evolutionary theory can no longer hide in the muddle of fuzzy \"science\". As Jones' definition comes before the public those teaching evolution will no longer be able to present assumptions as facts. Origins issues and macroevolution will be exposed for what they are -- metaphysical beliefs with no empirical evidence to support them! In fact, logic and available evidence shouts out that life does not arrive from chemicals and a universe of matter cannot come from nothing. \n \n When the time and circumstances are right some group needs to legally challenge the teaching of metaphysical evolution in public schools. What a joy it would be to someday have honesty in the science classrooms across the USA. Judge Jones has extended to critics of evolution a great and powerful favor by his definition of science now placed into law!\n The big question that I am left with after reading this piece is, why are evolutionists so afraid of a precise definition of of evolution if it is so precise and reliable a science? And the answer is that because of Judge Jones precise definition of what SCIENCE is, the cat is out of the bag regarding all of the metaphysical attributes of evolution where as science is by nature methodological naturalism and not metaphysical. This unmuddled definition has tremendous implications not only for Intelligent Design, but also for evolution as taught in public schools. http://www.opinioneditorials.com/freedomwriters/jbendewald_20060113.html", 
   {
    "unicode_changes_made": true
   }, 
   316944, 
   null, 
   1216351560.0
  ], 
  [
   316950, 
   null, 
   "electrolyte", 
   "This paragraph above could be a quote of me from any one of many debates I have had here and been roundly mocked for believing.\n\n As I'd do for anybody coming onto this forum and forwarding such nonsense. Every single sentence in that paragraph is untrue. In order by sentence:\n Evolution is not based upon metaphysics or assumptions.\n There is plenty of empirical evidence for evolution (e.g. pseudogenes).\n Extrapolation is science. That said, extrapolation is not required to the extent anti-evolutionists pretend.\n Uniformitarian geology preceded evolutionary theory and therefore cannot be reliant upon evolutionary theory. It takes an idiot to claim that it is.\n The Big Bang has nothing to do with evolutionary theory. Devoid of all evidence for biological evolution, the evidence for big bang theory remains intact.\n The \"center\" and \"edge\" of the universe argument is merely semantics according to the big bang theory. That said, see above re: dichotomy of evolution and big bang.\n I've seen a segment of \"Starlight and Time.\" It's fundamentally ignorant of relativistic effects that are well-grounded. To call it \"understandable\" may be true because it's made by simpletons for simpletons, but that doesn't make it accurate.\n \n \nThe big question that I am left with after reading this piece is, why are evolutionists so afraid of a precise definition of of evolution if it is so precise and reliable a science?\n\n PRATT.", 
   {}, 
   316946, 
   null, 
   1216356180.0
  ], 
  [
   316968, 
   null, 
   "unkerpaulie", 
   "Wow electrolyte, you totally missed the point. What marc was saying is that the popular tactic here, and on many discussion boards, is to instigate antagonizing creationists. Science doesn't have to ridicule or intimidate others into demonstrating a truth. If something is true, then its true. You're approaching a topic that should be discussing science by diving emotionally headlong into it. \n \n Granted that teaching creation in schools is indeed something to get worked up about, but I think you're the one that's deluded by thinking that you can prove that you're smart and right by the number of personal insults you throw at those that think different from your viewpoint.", 
   {}, 
   316950, 
   null, 
   1216401780.0
  ], 
  [
   316977, 
   null, 
   "Archangel", 
   "Wow electrolyte, you totally missed the point. What marc was saying is that the popular tactic here, and on many discussion boards, is to instigate antagonizing creationists. Science doesn't have to ridicule or intimidate others into demonstrating a truth. If something is true, then its true. You're approaching a topic that should be discussing science by diving emotionally headlong into it. \n \n Granted that teaching creation in schools is indeed something to get worked up about, but I think you're the one that's deluded by thinking that you can prove that you're smart and right by the number of personal insults you throw at those that think different from your viewpoint.\n\n \n Hey paulie, don't get concerned, but i think I'm falling for you. emoticon_love emoticon_xlove emoticon_xhoho emoticon_smile", 
   {}, 
   316968, 
   null, 
   1216414260.0
  ], 
  [
   316979, 
   null, 
   "T.Q", 
   "What's the title of this forum? Why, it's \"Creation(Intelligent Design) vs Evolution\"! So why is anyone surprised that many posts on here are made \"to instigate antagonizing creationists\"?\n \n This is not a science panel.\n \n And is it any wonder that many \"evolutionists\" are antagonistic to creationists? It is extremely frustrating to have someone call you a liar and accuse you of being either brainwashed or an active participant in a global, centuries spanning conspiracy as you try to explain to them something that they should have learned in elementary school science class (if dino bones are millions of years old, how come they're sitting on top of the dirt? :xbanghead)\n \n So yes, tempers get short. There's only so many times you can be called a \"pseudo-intellectual\" or \"spiritually dead secular humanist\" when you try to share or impart knowledge before you say \"To hell with it. If you want to be an imbecile I'll treat you like one.\"", 
   {}, 
   316977, 
   null, 
   1216415220.0
  ], 
  [
   316982, 
   null, 
   "ShadowPikachu", 
   "And in those 150 years, all the evolutionists in the world haven't been able to falsify or debunk the book of Genesis. Of course, in their own deluded minds, they actually believe they have done just that.\n\n \n And this from the person who when I used to debate him and did something like this complained about \"parroting\"? Hypocrite much?", 
   {}, 
   316775, 
   null, 
   1216418400.0
  ], 
  [
   316994, 
   null, 
   "electrolyte", 
   "Wow electrolyte, you totally missed the point. What marc was saying is that the popular tactic here, and on many discussion boards, is to instigate antagonizing creationists. Science doesn't have to ridicule or intimidate others into demonstrating a truth. If something is true, then its true. You're approaching a topic that should be discussing science by diving emotionally headlong into it.\n\n I probably couldn't have put it any better than T.Q did:What's the title of this forum? Why, it's \"Creation(Intelligent Design) vs Evolution\"! So why is anyone surprised that many posts on here are made \"to instigate antagonizing creationists\"?\n \n This is not a science panel.\n \n And is it any wonder that many \"evolutionists\" are antagonistic to creationists? It is extremely frustrating to have someone call you a liar and accuse you of being either brainwashed or an active participant in a global, centuries spanning conspiracy as you try to explain to them something that they should have learned in elementary school science class (if dino bones are millions of years old, how come they're sitting on top of the dirt? :xbanghead)\n \n So yes, tempers get short. There's only so many times you can be called a \"pseudo-intellectual\" or \"spiritually dead secular humanist\" when you try to share or impart knowledge before you say \"To hell with it. If you want to be an imbecile I'll treat you like one.\"\n\n \nGranted that teaching creation in schools is indeed something to get worked up about, but I think you're the one that's deluded by thinking that you can prove that you're smart and right by the number of personal insults you throw at those that think different from your viewpoint.\n\n I don't think that. I think that the substantive parts of my posts support the idea that I know what I'm talking about and am right. The fact that these people say things so blatantly stupid, dishonest, etc., based on no evidence and a complete lack of education (or dis-education) opens the door. Even if these people have sewn their eyes shut, swift kicks to the XXX can have a profound effect on more than just the kickee, such as other members and lurkers. There is no reason not to call a spade a spade; if a statement is simply wrong, I let readers know. If it takes emphasis, then that's what I use.", 
   {}, 
   316979, 
   null, 
   1216425720.0
  ], 
  [
   317013, 
   null, 
   "unkerpaulie", 
   "What's the title of this forum? Why, it's \"Creation(Intelligent Design) vs Evolution\"! So why is anyone surprised that many posts on here are made \"to instigate antagonizing creationists\"?\n \n This is not a science panel.\n \n And is it any wonder that many \"evolutionists\" are antagonistic to creationists? It is extremely frustrating to have someone call you a liar and accuse you of being either brainwashed or an active participant in a global, centuries spanning conspiracy as you try to explain to them something that they should have learned in elementary school science class (if dino bones are millions of years old, how come they're sitting on top of the dirt? :xbanghead)\n \n So yes, tempers get short. There's only so many times you can be called a \"pseudo-intellectual\" or \"spiritually dead secular humanist\" when you try to share or impart knowledge before you say \"To hell with it. If you want to be an imbecile I'll treat you like one.\"\n\n Look at the context. Look at the first reply in the topic. No accusations of lying. Nobody calling you brainwashed. No implications of any conspiracies. Evolution was first published 150 years ago, and its worth noting. Isn't that good enough? \n \n So, since by your proclamation, this is not a science panel, I'll leave you to your temper tantrums and hissy fits and attacking religion in the name of evolution, which you seem to equate to hostility against creationism. But for some of us, like me, science is far more entertaining thanthe drama bouts and shout ing matches that so easily entertain people like you", 
   {}, 
   316979, 
   null, 
   1216458840.0
  ], 
  [
   317017, 
   null, 
   "T.Q", 
   "Look at the context. Look at the first reply in the topic. No accusations of lying. Nobody calling you brainwashed. No implications of any conspiracies. Evolution was first published 150 years ago, and its worth noting. Isn't that good enough? \n \n So, since by your proclamation, this is not a science panel, I'll leave you to your temper tantrums and hissy fits and attacking religion in the name of evolution, which you seem to equate to hostility against creationism. But for some of us, like me, science is far more entertaining thanthe drama bouts and shout ing matches that so easily entertain people like you\n\n \n Time to get off your high horse there 'Paulie.\n Did I throw a temper tantrum? No.\n \n Did I attack religion? No. In fact, I have never, to my knowledge, attacked religion. I have stated my distaste for some people's interpretation of religion, but I have never attacked religion.\n \n Do I equate evolution with hostility to creationism? No. I equate evolution with one of the best established, most well supported theories of science in history. As I explained above, when you have people with no comprehension of basic science stating that evolution is \"metaphysics\", \"fabrications\", \"guesswork\", \"lies\", a \"distorted worldview\", etc. It wears thin on people's patience.\n \n Here are some examples:\n 1) \"there is \"no conclusive evidence of even one transitional species\"\n 2) evolution is based on \"huge assumptions and leaps of faith\"\n 3) \"the science of evolution is a humanistic justification to explain our origins but has no basis in fact what so ever.\"\n 4) \"most all of the so called evidence requires massive assumptions to be made in order for one to accept evo.\"\n All these were made in one thread, and were found with a quick glance over the posts. Peeling, with the patience of a saint, followed Archie down numerous rabbit holes, answered all his questions, provided mountains of evidence supporting evolution, and really the best Archie could do was say \"well, what about this then!\" as he lobbed another \"problem\" with evolutionary theory at Peeling. And after all the time Peeling spent explaining Archie's many errors, what was the result?\n \"...the reality is that the alleged evidence that you so readily accept as accurate and reliable regarding the ToE is nothing of the sort to me. And my questions and perspective of the very real problems with evolution are no closer to being dealt with than when we started this debate.\"\n Yup-it doesn't really matter what you say, I don't believe it, and you haven't answered any of my questions or concerns.\n \n I agree, science is \"entertaining\", if by entertaining you mean fascinating and sometimes very awe inspiring. As for \"people like me\" being amused by \"drama bouts and shouting matches\", not so much. I just don't like good, hard working people being slandered (ie-the constant accusations that any scientist/layperson who actually understands the ToE is partaking of a massive fraud on the global populace). I also don't like people disseminating ignorance as \"Truth\". If some people take it as an attack when they say something stupid and are told \"No, that's stupid\", there's not much I can do about that, is there? Or is it better if they are allowed to spread ignorance and falsehood unopposed, under the banner of \"Religion\"? What other banners is it OK to spread ignorance under? I'm just curious. I mean, I don't want a member of the KKK to come on here and spread his views of non caucasians and be shouted down if his brand of ignorance is under a protected banner as well.", 
   {}, 
   317013, 
   null, 
   1216461780.0
  ], 
  [
   317020, 
   null, 
   "Archangel", 
   "You just can't help but make huge assumptions in every post you write tq. I'll admit that Peeling has the party line down pat but in no way concede any defeat to him. The absolute truth regarding who is right in these debates between evo and creation wont be known for certain until all of us have passed on to eternity. Only then will we know who was right for certain, or in the case of you atheists who will know nothing at all. But I know that you will have awareness and will know at that time that everything you hold so dear regarding evolution was founded in lies and fraudulent propaganda. \n \n I'm sorry if that offends your sensibilities and causes you to want to call me ignorant. But it doesn't change the fact that things in this world are not always as they appear. And so it is with evolution.", 
   {}, 
   317017, 
   null, 
   1216463580.0
  ], 
  [
   317021, 
   null, 
   "Penfold", 
   "Thanks for the restrained succinct delineation TQ. Communication across such a chasm of basic knowledge, against active resistance, is frustrating in the extreme.", 
   {}, 
   317020, 
   null, 
   1216465020.0
  ], 
  [
   317024, 
   null, 
   "T.Q", 
   "You just can't help but make huge assumptions in every post you write tq.\n\n Oh? What assumptions did I make?\n \n \nI'll admit that Peeling has the party line down pat\n\n The \"party line\" is repeatable, verifiable results, based on observation and experimentation.\n \n \nbut in no way concede any defeat to him.\n\n And nowhere did I say you did. I know you well enough to know you never would.\n \n \nThe absolute truth regarding who is right in these debates between evo and creation wont be known for certain until all of us have passed on to eternity. Only then will we know who was right for certain, or in the case of you atheists who will know nothing at all.\n\n Blah, blah blah.\n \n \n But I know that you will have awareness and will know at that time that everything you hold so dear regarding evolution was founded in lies and fraudulent propaganda. (emphasis mine-TQ)\n\n I really like it when Archie makes my point for me.\n \n \nI'm sorry if that offends your sensibilities and causes you to want to call me ignorant.\n\n What makes me call you ignorant is the fact that you are. You have demonstrated it countless times, but refuse to be corrected.\n \n \nBut it doesn't change the fact that things in this world are not always as they appear. And so it is with evolution.\n\n Especially if you close your eyes reeeeeaaaaalllly tight and stick your fingers in your ears while chanting \"You're wrong, you're wrong, you're wrong!\"", 
   {}, 
   317020, 
   null, 
   1216467780.0
  ], 
  [
   317030, 
   null, 
   "iangb", 
   "But it doesn't change the fact that things in this world are not always as they appear. And so it is with evolution.\n\n I think that this is the creationist position in a nutshell. Evolution appears to be true - but according to Archie's interpretation of scripture, it isn't. Therefore scripture must be correct over observable reality.\n \n ...I refer you back to the 'omphalos' thread.", 
   {}, 
   317024, 
   null, 
   1216480860.0
  ], 
  [
   317032, 
   null, 
   "unkerpaulie", 
   "TQ, I'm not going to break down your post and point out exactly where you condoned temper tantrums and justified instigating antagonism. Its amazing how quickly you turn about face on practically everything you said in the previous post. Its like an entirely different person. Like you said that this evolution forum is not a science panel, then turn around and say you said that evolution is based on science (which it is). You emphasized that this forum is \"creation vs evolution\" and I shouldn't be surprised that evolutionists are antagonizing creationists, then turn around and say you never said that the evolutionist position is hostility to creationists (which you did). But like I said, go through the comparison point by point is just a waste of time for me and will only cause you to get defensive and deny what you said with more fervor and emotion. So I rest my case.", 
   {}, 
   317030, 
   null, 
   1216481820.0
  ], 
  [
   317035, 
   null, 
   "electrolyte", 
   "Electrolyte... Its like an entirely different person. \n\n That's because it is. I think you meant to direct this at T.Q; he made the subsequent post. And contrary to popular creationist belief, T.Q and I are not the same person using two different user names.\n \n Now, upon reading the above, you probably reacted when seeing my reference to creationist belief. That may rub you the wrong way, but it shouldn't. For about a year I've been accused by creationists of being one-person-as-multiple-users (most often T.Q, and in many cases additional users), and I have to deflect this bullsh** too. So I'm nipping this in the bud: nobody had better raise this nonsense again.\n \n \nYou emphasized that this forum is \"creation vs evolution\" and I shouldn't be surprised that evolutionists are antagonizing creationists, then turn around and say you never said that the evolutionist position is hostility to creationists (which you did).\n\n Sure it is, in the same way that a pro-Republican position is \"hostile\" to Democrats, and vice versa. That doesn't mean that every instance of policy talk has the purpose of instigating trouble. Look at the first \"antagonizing\" post in this thread: the anti-evolutionists have had a century and a half to come up with something substantive to falsify this idea that they don't believe. This is a fact. And creationists have been trying since Darwin's time to argue against this idea. But let's face it: Most don't accept evolution at least partly because they have made the decision not to understand it. Ignorance should not be an excuse, and I try to eliminate said ignorance. I bet a very low percentage of creationists had prior knowledge of the information in my first post in this thread. The problem is that most creationists don't bother committing those pieces of information to memory, and that's because they don't want to. They'll accept and reject whatever is necessary to maintain their beliefs. That is deluded. That is despicable. I see no reason to pander to it, and I doubt you do, too.\n \n Oh, and then there's that little, insignificant thing about \"4forums Debates and Polls,\" not \"4forums Pat on Backs and Stroke Egos and Polls.\"", 
   {}, 
   317032, 
   null, 
   1216486020.0
  ], 
  [
   317038, 
   null, 
   "unkerpaulie", 
   "You're right electrolyte, that post was directed at T. Q. and I put your name instead by accident. I recognize that this is a debate forum and any and every position can and will be met with opposition. But I think there's a thin line between debating and attacking that people jump over blissfully without a moments notice, not even acknowledging that such a line exists. Then again the first reply could be seen as provoking crationists to respond and make the debate interesting, and there's nothing wrong with that either. Regardless I still think that marc's point is valid and the cheap shots and insults are more often than not uncalled for, especially when unprovoked. And I also still think its amazing to watch TQ switch his stance so quickly", 
   {}, 
   317035, 
   null, 
   1216487640.0
  ], 
  [
   317039, 
   null, 
   "T.Q", 
   "And I also still think its amazing to watch TQ switch his stance so quickly\n\n \n And I also think it's amazing that you would think I did. Let's look at your last post to me.\n \n \nTQ, I'm not going to break down your post and point out exactly where you condoned temper tantrums and justified instigating antagonism.\n\n Because I didn't condone it. I said it's understandable that people lose their tempers, and I said it's a C vs E board. The entire point of this board is Creationism vs Evolution. \n \n \nIts amazing how quickly you turn about face on practically everything you said in the previous post.\n\n It's amazing you would think I did.\n \n \nLike you said that this evolution forum is not a science panel,\n\n Is it? Are we all scientists? What field is your speciality? I think you're confused. When I say \"panel\", I mean as in a panel, consisting of scientists, convened to discuss a subject. When I'm discussing this medium which we're currently posting on, I use \"forum\" or \"board\".\n \n \nthen turn around and say you said that evolution is based on science (which it is).\n\n True. How are these mutually exclusive concepts? This board is not a peer-reviewed journal, and evolution is science.\n \n \nYou emphasized that this forum is \"creation vs evolution\" and I shouldn't be surprised that evolutionists are antagonizing creationists,\n\n True\n \n \nthen turn around and say you never said that the evolutionist position is hostility to creationists (which you did).\n\n True, I did say that as well. How are the two contradictory? Evolution is a science. And the \"evolutionist\" position is not hostility to creationists. These, once again are not contradictory statements.\n \n \nBut like I said, go through the comparison point by point is just a waste of time for me and will only cause you to get defensive and deny what you said with more fervor and emotion. So I rest my case.\n\n Not much of a case to rest on.", 
   {}, 
   317038, 
   null, 
   1216489080.0
  ], 
  [
   317041, 
   null, 
   "Penfold", 
   "The Theory of Evolution is the status quo, and any hostility emanates from the creationist cultists who rail ineffectually against it.", 
   {}, 
   317039, 
   null, 
   1216493160.0
  ], 
  [
   317345, 
   null, 
   "obvious_child", 
   "The Theory of Evolution is the status quo, and any hostility emanates from the creationist cultists who rail ineffectually against it.\n\n \n And yet use every day products that were created in part with the help of evolution.\n \n To be a YEC, one has to have a knack for ignoring reality. See how Marc completely ignored my post?", 
   {}, 
   317041, 
   null, 
   1216785660.0
  ], 
  [
   317346, 
   null, 
   "obvious_child", 
   "And in those 150 years, all the evolutionists in the world haven't been able to falsify or debunk the Rig-Veda. Of course, in their own deluded minds, they actually believe they have done just that.\n http://library.thinkquest.org/03oct/00875/text/IndiaC.htm\n\n \n hahahaha. Classic.", 
   {}, 
   316897, 
   null, 
   1216785720.0
  ], 
  [
   317958, 
   null, 
   "iangb", 
   "The most practical triumph of science over religion is not the acceptance of the fact of evolution by the pope, or of the acknowledgement of a heliocentric solar system... it was in the seventeenth centuary, when churches began to put up lightning conductors\nI was reminded of this, also...", 
   {}, 
   317346, 
   null, 
   1217250840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Happy Anniversary Evolution!", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11332-happy-anniversary-evolution.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 11332, 
  "discussion_files": [
   [
    "21458.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11332-happy-anniversary-evolution-print.html"
   ], 
   [
    "21459.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11332-happy-anniversary-evolution-3-print.html"
   ], 
   [
    "21460.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11332-happy-anniversary-evolution-2-print.html"
   ]
  ], 
  "identifier": 11332
 }
]