[
 [
  [
   314814, 
   null, 
   "Omegamon_X", 
   "Why is it that anybody would believe, even for one second, that criminals will abide by any new laws that might get passed? Criminals, by their very definition, are people who commit crimes by breaking the law.\n \n Passing laws to stop criminals, is like shouting at a deaf person; they don't know you're there and are going to ignore you.\n \n And don't argue that the new laws can be used to get longer sentences for criminals, because most every charge a criminal is brought up on will be plea bargained away just to speed things up.\n \n So, back to the original question: why do we think that criminals will obey new laws when they're not obeying the laws we already have?", 
   {
    "post_info": {
     "post_title": "A question"
    }
   }, 
   null, 
   null, 
   1215043680.0
  ], 
  [
   314816, 
   null, 
   "Archangel", 
   "Why is it that anybody would believe, even for one second, that criminals will abide by any new laws that might get passed? Criminals, by their very definition, are people who commit crimes by breaking the law.\n \n Passing laws to stop criminals, is like shouting at a deaf person; they don't know you're there and are going to ignore you.\n \n And don't argue that the new laws can be used to get longer sentences for criminals, because most every charge a criminal is brought up on will be plea bargained away just to speed things up.\n \n So, back to the original question: why do we think that criminals will obey new laws when they're not obeying the laws we already have?\n\n \n That's my biggest argument against gun control. If the Government actually succeeded in disarming the American citizenry, only criminals would be armed and chaos would ensue as you just know that they would never turn their weapons in. On a side note, if uncle sam did attempt to disarm the law abiding American people, I think it would put us over the edge and result in that revolution that the founding fathers wanted us armed for. \n \n And welcome to the forum Omegamon.", 
   {}, 
   314814, 
   null, 
   1215044520.0
  ], 
  [
   314827, 
   null, 
   "iangb", 
   "With that argument in mind, why do we not make all laws void? After all, criminals are not going to obey them, they're /criminals/. Keeping laws just wastes police time, when they could be doing productive things like producing guns for the lynch mob to use.\n \n [/sarcasm]", 
   {}, 
   314816, 
   null, 
   1215047340.0
  ], 
  [
   314830, 
   null, 
   "Omegamon_X", 
   "With that argument in mind, why do we not make all laws void? After all, criminals are not going to obey them, they're /criminals/. Keeping laws just wastes police time, when they could be doing productive things like producing guns for the lynch mob to use.\n\n \n Just answer the question and stop being snotty. Why do you think a criminal can be trusted to actually obey the laws, or that new laws will somehow discourage them from doing what they're doing now; breaking the laws and committing illegal activities?", 
   {}, 
   314827, 
   null, 
   1215049020.0
  ], 
  [
   314831, 
   null, 
   "T.Q", 
   "Just answer the question and stop being snotty. Why do you think a criminal can be trusted to actually obey the laws, or that new laws will somehow discourage them from doing what they're doing now; breaking the laws and committing illegal activities?\n\n \n Who was being snotty? He pretty much dismissed your argument in one stroke. You ask \"why pass gun laws, since criminals aren't going to obey them?\" Apply that reasoning to every law-\"Why pass laws against murder/theft/rape/etc, since criminals aren't going to obey them?\" It's a poor argument.", 
   {}, 
   314830, 
   null, 
   1215049380.0
  ], 
  [
   314835, 
   null, 
   "Omegamon_X", 
   "Actually it's a very good argument. The laws we have are being violated left and right by criminals, people who were dumb lucky enough to be voted into office and a position of authority claim that we need new laws, indicating that they believe that the old laws aren't enough but new laws are just what's needing.\n \n As said, you might as well be shouting at a deaf person with their back turned to you; all you're going to get is ignored.\n \n The courts aren't charging criminals with the laws they've already violated, why do we need any new laws to deal with criminals if what we have aren't being addressed right now?\n \n It seems that absolutely nobody can give a straight answer anymore, they just go \"blah blah blah\" and leave it unresolved. Either address the question and actually provide an answer, or don't talk.", 
   {}, 
   314831, 
   null, 
   1215050940.0
  ], 
  [
   314839, 
   null, 
   "iangb", 
   "We are giving an answer - just in the form of a question that you don't want to reply to, because your reply can automatically be used to defeat your initial question.\n \n To answer specifically - no law stops every individual. However, prohibition of any sort cuts down, often significantly, the amount of that which it makes illegal, especially if it is enforced. That's the point of new laws, same as the point in old laws.\n \n 'Criminals disobey laws' is a tautology.", 
   {}, 
   314835, 
   null, 
   1215051720.0
  ], 
  [
   314840, 
   null, 
   "Omegamon_X", 
   "However, prohibition of any sort cuts down, often significantly, the amount of that which it makes illegal, especially if it is enforced.\n\n \n History has continually proven your statement to be wrong. The Roaring 20s when illegal moonshine empowered criminals to a level never before seen. The cocaine wars of the 70s and 80s, and the number of murders in places like Washington DC with post 1977 handguns, are just a few examples of prohibition doing nothing but making criminals stronger than they used to be, and putting good people behind the 8-ball.", 
   {}, 
   314839, 
   null, 
   1215051900.0
  ], 
  [
   314841, 
   null, 
   "smiley", 
   "Actually it's a very good argument. The laws we have are being violated left and right by criminals, people who were dumb lucky enough to be voted into office and a position of authority claim that we need new laws, indicating that they believe that the old laws aren't enough but new laws are just what's needing.\n \n As said, you might as well be shouting at a deaf person with their back turned to you; all you're going to get is ignored.\n \n The courts aren't charging criminals with the laws they've already violated, why do we need any new laws to deal with criminals if what we have aren't being addressed right now?\n \n It seems that absolutely nobody can give a straight answer anymore, they just go \"blah blah blah\" and leave it unresolved. Either address the question and actually provide an answer, or don't talk.\n\n Are you saying that in the future there should never be new laws passed just because some people will ignore them?\n \n Perhaps crime figures will need to be reduced to zero for a specified length of time (say 5 years) before any new legislation can be enacted. If this is the case, surely loads of money can be saved by sacking those who are employed to look into new legislation (at least until this 5 year period of 'excellentness' has passed). Perhaps (and this is stretching things just a little) the money that is saved from the incomes of these legislators could be used to bribe people into being nice for the aforementioned 5 years. Then the legislators could be rehired and all will be well in the world.\n \n What d'ya think?\n \n Smiley\n \n PS I thought iangb might have had a point - just maybe.", 
   {}, 
   314835, 
   null, 
   1215051900.0
  ], 
  [
   314843, 
   null, 
   "Omegamon_X", 
   "Are you saying that in the future there should never be new laws passed just because some people will ignore them?\n\n \n I'm saying to stop pressing for new laws, use the ones we already have. Don't plea deal 100 charges down to 3 and then complain when the bad guys goes out and gets in trouble again for doing the exact same thing. Either use the laws you already have, or have them repealed since they're not being enforced.\n \n \nWhat d'ya think?\n\n \n I think that you're one of the many who feels that a criminal can be trusted to obey new laws.", 
   {}, 
   314841, 
   null, 
   1215052200.0
  ], 
  [
   314844, 
   null, 
   "smiley", 
   "I'm saying to stop pressing for new laws, use the ones we already have. Don't plea deal 100 charges down to 3 and then complain when the bad guys goes out and gets in trouble again for doing the exact same thing. Either use the laws you already have, or have them repealed since they're not being enforced.\n\n Aah! Then you should have said that in the first place.\n \n Yes, we should enforce old laws rather than just replacing them and not enforcing the new ones.\n \n This does not mean that new laws should be banned for all time.\n \n \nI think that you're one of the many who feels that a criminal can be trusted to obey new laws.\n\n Then you'd be wrong.\n \n Smiley", 
   {}, 
   314843, 
   null, 
   1215052500.0
  ], 
  [
   314845, 
   null, 
   "iangb", 
   "History has continually proven your statement to be wrong. The Roaring 20s when illegal moonshine empowered criminals to a level never before seen. The cocaine wars of the 70s and 80s, and the number of murders in places like Washington DC with post 1977 handguns, are just a few examples of prohibition doing nothing but making criminals stronger than they used to be, and putting good people behind the 8-ball.\nNot so. There's a bit I cut out of my previous post because I thought it might lead the discussion offtopic. It's kinda (scarilly) relevant here, though, so here it is.\n \n 'The issue is not over the reduction caused by the law, but the effect caused by the reduction. For alcoholic prohibition, this was that reduced alcohol supply led to people brewing their own illegal moonshine which caused more injuries than were prevented by reducing legal alcohol. For gun control, the issue will be whether less gun attacks due to reducing gun availability will outweigh successful defences by firearm.'\n \n Laws do exactly what they claim to do - they reduce availability of the object that is criminalised. Whether the ramifications of this are good or bad is another matter, but it is undeniable that the laws have an effect. I can find the alcohol prohibition facts and figures if you really want them.", 
   {}, 
   314841, 
   null, 
   1215052620.0
  ], 
  [
   314850, 
   null, 
   "Omegamon_X", 
   "Laws do exactly what they claim to do - they reduce availability of the object that is criminalised.\n\n \n Unfortunately they only reduce the legal availability, but the illegal black market continues to sell banned goods to whomever has the money. This is how all the criminals in DC managed to have handguns despite there not being a single gun store in the district to steal from.\n \n I find it impossible to believe somebody when they say \"this law is going to take this product away from criminals\", because I know that such a statement would only work if the black market didn't exist and criminals were limited to what the legal stores had to offer.", 
   {}, 
   314845, 
   null, 
   1215053040.0
  ], 
  [
   314868, 
   null, 
   "Archangel", 
   "Unfortunately they only reduce the legal availability, but the illegal black market continues to sell banned goods to whomever has the money. This is how all the criminals in DC managed to have handguns despite there not being a single gun store in the district to steal from.\n \n I find it impossible to believe somebody when they say \"this law is going to take this product away from criminals\", because I know that such a statement would only work if the black market didn't exist and criminals were limited to what the legal stores had to offer.\n\n \n You are absolutely right omegamon, but you'll never convince these lefty's of that. If the current laws that are on the books are just enforced, then we will have all of the protections needed to prevent criminals from getting the upper hand over law abiding citizens. \n \n I realize your not asking for the abolition of laws as iangb suggested, but that is a typical ploy intended to exaggerate the oppositions argument in order to nullify it.", 
   {}, 
   314850, 
   null, 
   1215056700.0
  ], 
  [
   314871, 
   null, 
   "iangb", 
   "Unfortunately they only reduce the legal availability, but the illegal black market continues to sell banned goods to whomever has the money. This is how all the criminals in DC managed to have handguns despite there not being a single gun store in the district to steal from.\n \n I find it impossible to believe somebody when they say \"this law is going to take this product away from criminals\", because I know that such a statement would only work if the black market didn't exist and criminals were limited to what the legal stores had to offer.\n\n Firstly, I still (although I realise that you won't know this) haven't been given any data to prove either way that most crimes are carried out with illegal weaponry. Although I generally don't like using it as a debating tool, common sense states that this would not be the case - why buy illegal weapons when you can buy legal ones and not have to worry about being caught?\n Secondly, You've made the same mistake every pro-gun advocate makes, which is to classify individuals as two distinct classes - 'nice' and 'nasty'. 'nasty' individuals are born that way and will never be able to buy a gun, whereas it is impossible for a 'nice' individual to commit a crime. This, blatantly, is not the case. See almost every publicised school/work 'massacre' that has ever occurred.\n Finally, putting restrictions on an item really does reduce the number of criminal owners of the item, for a couple of reasons.\n 1. The market drops, so gun makers (almost all guns start off as legal...) reduce output to match. Instant effect.\n 2. More control makes that control easier to enforce - if there are less guns in circulation then investigating someone with a gun becomes much more of a priority because it's much more likely that their gun is illegal.\n 3. Introducing nation-wide laws will have a vastly different outcome to trying to introduce laws to a relatively small piece of city, where people are free to enter and leave as they please - simply legally buying a gun elsewhere, then returning to where it is illegal becomes much harder when 'legal guns' are on a different continent. This is the weakest point, because I don't support the banning of guns for legitimate reasons such as sport (shudder) or work - but the principle still applies.\n \n \nI realize your not asking for the abolition of laws as iangb suggested, but that is a typical ploy intended to exaggerate the oppositions argument in order to nullify it.\n\n It's a 'typical ploy' in the same way that it's a 'typical ploy' to point out that the magician had the rabbit in his hat all the time - because no-one has yet to counter it.\n If you can answer the question in a way that does not invalidate the OP, then I will stop using it ('common sense' loopholes apply - don't try to play semantics, please).", 
   {}, 
   314868, 
   null, 
   1215057420.0
  ], 
  [
   314896, 
   null, 
   "Omegamon_X", 
   "Firstly, I still (although I realise that you won't know this) haven't been given any data to prove either way that most crimes are carried out with illegal weaponry. \n\n \n Well if it's stolen and/or had the serial number obliterated, it's generally not considered legal anymore.\n \n \nAlthough I generally don't like using it as a debating tool, common sense states that this would not be the case - why buy illegal weapons when you can buy legal ones and not have to worry about being caught?\n\n \n Uh, because criminals can't buy legal weapons so they have to resort to getting them illegally, and generally at prices that're a fraction of what the legal market charges?\n \n \nSecondly, You've made the same mistake every pro-gun advocate makes, which is to classify individuals as two distinct classes - 'nice' and 'nasty'. 'nasty' individuals are born that way and will never be able to buy a gun, whereas it is impossible for a 'nice' individual to commit a crime. This, blatantly, is not the case. See almost every publicised school/work 'massacre' that has ever occurred.\n\n \n I think you're making the same argument that every anti-gun advocate makes: \"We can't tell the good guys from the bad guys, so we're going to disarm everybody.\"\n \n If you can't tell the good guys from the bad guys then you shouldn't be allowed to have a say on the matter.\n \n \nFinally, putting restrictions on an item really does reduce the number of criminal owners of the item, for a couple of reasons.\n\n \n Bull.\n \n \n1. The market drops, so gun makers (almost all guns start off as legal...) reduce output to match. Instant effect.\n\n \n This would only affect new guns, doing nothing to address the hundreds of millions of guns already in circulation, which criminals would make greater efforts to steal as many as possible if they found out all gun manufacture was going to be ended.\n \n \n2. More control makes that control easier to enforce - if there are less guns in circulation then investigating someone with a gun becomes much more of a priority because it's much more likely that their gun is illegal.\n\n \n Last year there were so many killings and gun shots in Washington DC that the police needed to use shot sensors, to let them know exactly where the gunfire was coming from. And this is in an area where gun ownership was, for all effective purposes, banned entirely.\n \n So no, more control doesn't mean easier enforcement. If it did then DC would have an exceedingly low crime rate, which they never have.\n \n \n3. Introducing nation-wide laws will have a vastly different outcome to trying to introduce laws to a relatively small piece of city, where people are free to enter and leave as they please - simply legally buying a gun elsewhere, then returning to where it is illegal becomes much harder when 'legal guns' are on a different continent. This is the weakest point, because I don't support the banning of guns for legitimate reasons such as sport (shudder) or work - but the principle still applies.\n\n \n This was tried from 1994 to 2004 with the erroneous \"Assault Weapons Ban\", and it did absolutely no good in reducing any sort of crime, that's why it was allowed to expire.\n \n The most violent shootout in police history even took place during the AWB, with weapons that were supposedly banned from ownership.", 
   {}, 
   314871, 
   null, 
   1215066000.0
  ], 
  [
   314986, 
   null, 
   "iangb", 
   "Well if it's stolen and/or had the serial number obliterated, it's generally not considered legal anymore.\nHow is this relevant?\n \n \nUh, because criminals can't buy legal weapons so they have to resort to getting them illegally, and generally at prices that're a fraction of what the legal market charges?\n\n You say 'criminals'. You mean 'felons' - those who have spent at least five days in a row in jail. I seriously doubt that most crime is committed by previously convicted felons.\n \n \nI think you're making the same argument that every anti-gun advocate makes: \"We can't tell the good guys from the bad guys, so we're going to disarm everybody.\"\n \n If you can't tell the good guys from the bad guys then you shouldn't be allowed to have a say on the matter.\nWay to change the subject.\n \n Can you tell the good guys from the bad guys? How do you explain the existence of people who commit crimes with legal weaponry? Or, come to that, the existence of any criminals, given that everyone is born (in the eyes of the law) as a 'good guy'?\n \n \nThis would only affect new guns, doing nothing to address the hundreds of millions of guns already in circulation, which criminals would make greater efforts to steal as many as possible if they found out all gun manufacture was going to be ended.\nSurely this proves that criminal gun supply would be adversely affected? This is all that I claimed that a law would do.\n \n \nLast year there were so many killings and gun shots in Washington DC that the police needed to use shot sensors, to let them know exactly where the gunfire was coming from. And this is in an area where gun ownership was, for all effective purposes, banned entirely.\n \n So no, more control doesn't mean easier enforcement. If it did then DC would have an exceedingly low crime rate, which they never have.\nDC is incredibly hard to police. Crime increaces wherever population density does, as anyone who lives in a city will tell you. DC has a population density of over 9000 per square mile. DC is not a fair test zone for any law enforcement.\n \n \nThis was tried from 1994 to 2004 with the erroneous \"Assault Weapons Ban\", and it did absolutely no good in reducing any sort of crime, that's why it was allowed to expire.\n\n This is irrelevant to my point that laws would reduce gun supply. You're trying to shift my words to something I did not say.\n \n How concealable is an assault weapon? Its not the sort of firearm that will be used in most offences, so it's not surprising that there was a negligible effect on crime.\n \n \nThe most violent shootout in police history even took place during the AWB, with weapons that were supposedly banned from ownership.\nAlthough I don't know what incident you are talking about, I doubt that it is a particularly relevant one. Out of curiosity, which one was it?", 
   {}, 
   314896, 
   null, 
   1215132180.0
  ], 
  [
   314992, 
   null, 
   "Omegamon_X", 
   "How is this relevant?\n\n \n Because it shows that criminals aren't running out to the corner market and buying their gear for crimes?\n \n \nYou say 'criminals'. You mean 'felons' - those who have spent at least five days in a row in jail. I seriously doubt that most crime is committed by previously convicted felons.\n\n \n Well then you're wrong about that. There's a very high rate of reoffending by previously convicted felons.\n \n \nWay to change the subject.\n\n \n Not really.\n \n \nCan you tell the good guys from the bad guys? How do you explain the existence of people who commit crimes with legal weaponry? Or, come to that, the existence of any criminals, given that everyone is born (in the eyes of the law) as a 'good guy'?\n\n \n Let's see...how can you tell an armed good guy from an armed bad guy?\n \n To begin with, good guys have legal concealed carry permits, criminals conceal their guns illegally. Good guys go out and get a hunting permit for deer season, bad guys go out and poach. Good guys actually go through background checks and fill out form 4473 so they can buy new guns, bad guys go right out and steal them or buy from somebody who stole them. Good guys own guns for their own defense, bad guys possess guns because it intimidates people into compliance.\n \n \nSurely this proves that criminal gun supply would be adversely affected? This is all that I claimed that a law would do.\n\n \n Surely you must realize that there are already tens of millions of guns circulating in the black market through various underground networks, all of which would be untouched by any law that would prohibit the manufacture or purchase of any new guns.\n \n \nDC is incredibly hard to police. Crime increaces wherever population density does, as anyone who lives in a city will tell you. DC has a population density of over 9000 per square mile. DC is not a fair test zone for any law enforcement.\n\n \n DC had the most stringent guns laws in the entire nation, and they were an island without any gun stores of any sort. It should have been a very easy location to police. I fail to see how this isn't a fair test.\n \n It's not like it was that hard for the police, the laws were very clearly spelled out regarding things like this. If you find somebody in possession of a gun, you arrest them because they're committing a crime by having a functional and loaded gun outside of their home. There were no legal exceptions to this rule. If you had a gun, you were guilty and could be arrested no questions asked.\n \n \nThis is irrelevant to my point that laws would reduce gun supply. You're trying to shift my words to something I did not say.\n\n \n Your point is irrelevant on the grounds that real life discredits it many times over.\n \n\n How concealable is an assault weapon? Its not the sort of firearm that will be used in most offences, so it's not surprising that there was a negligible effect on crime.\n\n \n Negligible? There was no effect at all.\n \n \nAlthough I don't know what incident you are talking about, I doubt that it is a particularly relevant one. Out of curiosity, which one was it?\n\n \n The 1997 North Hollywood Shootout, between two bad guys in body armor and banned firearms, against the entire police force.", 
   {}, 
   314986, 
   null, 
   1215135420.0
  ], 
  [
   314997, 
   null, 
   "iangb", 
   "Because it shows that criminals aren't running out to the corner market and buying their gear for crimes?\n\n No, because you haven't given me any figures about crimes committed by serial-number-damaged guns. You made an abstract statement about the legality of serial numbers, which was nothing to do with crime rates, as far as I am aware.\n \n \nWell then you're wrong about that. There's a very high rate of reoffending by previously convicted felons.\n\n Source? I have no idea how many offences are committed by felons, but I thought it was less than 50%... That makes <50% of criminals-to-be who don't need to buy illegal guns.\n Every first-time offender can use a legal gun. Currently.\n \n \nNot really.\nWell, yes. I said that you are claiming that 'good guys' never become 'bad guys', and that 'bad guys' are born unable to buy a gun. You replied with 'you can't tell the good guys from the bad guys'. It's not really the same thing, and quite ironic in that it applies to you far more than it does to me. For more on how you've changed the subject from my original statement, see your excerpt below.\n \n \nLet's see...how can you tell an armed good guy from an armed bad guy?\n \n To begin with, good guys have legal concealed carry permits, criminals conceal their guns illegally. Good guys go out and get a hunting permit for deer season, bad guys go out and poach. Good guys actually go through background checks and fill out form 4473 so they can buy new guns, bad guys go right out and steal them or buy from somebody who stole them. Good guys own guns for their own defense, bad guys possess guns because it intimidates people into compliance.\nDefinitely way to change the subject. The question was: how, when deciding whether to give someone a gun or not, do you decide if they are a 'good guy' or a 'bad guy'? This is deviation from the point in extremis.\n You are assuming that everyone who buys a gun legally will never use it to commit a crime. This is blatantly not the case.\n \n \nSurely you must realize that there are already tens of millions of guns circulating in the black market through various underground networks, all of which would be untouched by any law that would prohibit the manufacture or purchase of any new guns.\nIn which case, why would criminals suddenly need to make extra effort to start stealing guns? You've already undermined your own point here.\n \n \nDC had the most stringent guns laws in the entire nation, and they were an island without any gun stores of any sort. It should have been a very easy location to police. I fail to see how this isn't a fair test.\n \n It's not like it was that hard for the police, the laws were very clearly spelled out regarding things like this. If you find somebody in possession of a gun, you arrest them because they're committing a crime by having a functional and loaded gun outside of their home. There were no legal exceptions to this rule. If you had a gun, you were guilty and could be arrested no questions asked.\n\n It's not a case of the laws being hard to interpret, it's a case that (as explained, and ignored) as population density rises, crime increases virtually exponentially. Policing a city is vastly harder than policing a rural area regardless of the laws, especially with such a populated city as DC.\n Also, this study shows that when guns are specifically target by the law, gun crime is reduced.\n \n \nYour point is irrelevant on the grounds that real life discredits it many times over.\nMy point was that laws on any item reduces availability of that item. You have yet to show me a single 'real life example' that disproves this, and I can give you several examples that prove it (gun availability in different countries, the effects of alcohol prohibition, marijuana vs cigarettes...).\n \n \nNegligible? There was no effect at all.\nUh, that's what negligable means.\n \n If there was no effect (to use your terminology) then surely this also removes the pro-gun argument that gun control will increase violent crime?\n \n \nThe 1997 North Hollywood Shootout, because two bad guys in body armor and banned firearms, against the entire police force.\nMm, quite irrelevant. This was a pre-planned crime, and I have stated earlier that there will always be some people who find the black market. The reason this incident got so bad, by the looks of things, is not that the individuals had assault weapons but that they were wearing armour which standard police could not penetrate. That's an issue with poorly-armed police, not with overly-armed criminals.", 
   {}, 
   314992, 
   null, 
   1215136920.0
  ], 
  [
   315375, 
   null, 
   "cake.or.death", 
   "I'm saying to stop pressing for new laws, use the ones we already have.\n\n \n But the methods that criminals use are constantly changing. Surely, new laws are necessary if we want to identify and prosecute those using new techniques to commit new crimes?", 
   {}, 
   314843, 
   null, 
   1215392880.0
  ], 
  [
   315562, 
   null, 
   "Omegamon_X", 
   "But the methods that criminals use are constantly changing. Surely, new laws are necessary if we want to identify and prosecute those using new techniques to commit new crimes?\n\n \n Well let's stop and assume for a minute that this is right. Let's assume that the methods used by criminals are constantly changing and evolving and need to be addressed in brand new way. If the old laws can no longer work, then why do we allow them to remain on the books. They're outmoded and outdated, so they're obviously of new use and have no justification for being on the books anymore. It's the equivalent of having laws against tying your horse in front of a store; nobody rides horses anymore so why is the law still being enforced?\n \n And if new laws are needed, why don't they reflect new methods but rather just rehash what's already been tried?", 
   {}, 
   315375, 
   null, 
   1215480360.0
  ], 
  [
   315572, 
   null, 
   "Penfold", 
   "If all criminals ignore all laws why bother having any?", 
   {}, 
   315562, 
   null, 
   1215482100.0
  ], 
  [
   315576, 
   null, 
   "iangb", 
   "Well let's stop and assume for a minute that this is right. Let's assume that the methods used by criminals are constantly changing and evolving and need to be addressed in brand new way. If the old laws can no longer work, then why do we allow them to remain on the books. They're outmoded and outdated, so they're obviously of new use and have no justification for being on the books anymore. It's the equivalent of having laws against tying your horse in front of a store; nobody rides horses anymore so why is the law still being enforced?\n\n Do you know of (one of) the Creationists fallacies, that \"If humans are decended from monkey-types, why are there still monkey-types around today?\"\n You've just repeated that fallacy, in legal terms.\n Because new crime methods appear doesn't mean the old ones are eliminated. Computer hackers appear, designer drugs are peddled, identity thieves abound, but there will always be murder.", 
   {}, 
   315572, 
   null, 
   1215483180.0
  ], 
  [
   315580, 
   null, 
   "Omegamon_X", 
   "Do you know of (one of) the Creationists fallacies, that \"If humans are decended from monkey-types, why are there still monkey-types around today?\"\n You've just repeated that fallacy, in legal terms.\n Because new crime methods appear doesn't mean the old ones are eliminated. Computer hackers appear, designer drugs are peddled, identity thieves abound, but there will always be murder.\n\n \n CODs statement was that the methods of crime are constantly changing, meaning they don't remain the same. So why would you have laws that no longer apply to the current methods of crime that're being seen?", 
   {}, 
   315576, 
   null, 
   1215484200.0
  ], 
  [
   315583, 
   null, 
   "smiley", 
   "CODs statement was that the methods of crime are constantly changing, meaning they don't remain the same. So why would you have laws that no longer apply to the current methods of crime that're being seen?\n\n Your head must be very low at the moment. Everything seems to go over the top of it.\n \n Let's try again.\n \n Just because new ways of breaking the law are being thought of does not mean that the old ways of breaking the law are no longer used. So new laws need to be introduced to cope with the new methods of breaking the law, but the old laws are still needed to cope with the good old law breaking methods.\n \n Did you get it that time?\n \n Why do I bother?\n \n Smiley", 
   {}, 
   315580, 
   null, 
   1215484740.0
  ], 
  [
   315588, 
   null, 
   "Omegamon_X", 
   "Just because new ways of breaking the law are being thought of does not mean that the old ways of breaking the law are no longer used. So new laws need to be introduced to cope with the new methods of breaking the law, but the old laws are still needed to cope with the good old law breaking methods.\n\n \n And what exactly is the justification when the charges possible under the old law are later dropped and never used against the guilty party? What was the point of even bringing it up in the first place? What's the point in having a law you don't intend to use?", 
   {}, 
   315583, 
   null, 
   1215486120.0
  ], 
  [
   315593, 
   null, 
   "iangb", 
   "When has this occured?", 
   {}, 
   315588, 
   null, 
   1215486900.0
  ], 
  [
   315602, 
   null, 
   "Omegamon_X", 
   "When has this occured?\n\n \n How's this for an example of the laws not being applied? Or maybe this?", 
   {}, 
   315593, 
   null, 
   1215488340.0
  ], 
  [
   315680, 
   null, 
   "smiley", 
   "And what exactly is the justification when the charges possible under the old law are later dropped and never used against the guilty party? What was the point of even bringing it up in the first place? What's the point in having a law you don't intend to use?\n\n Does this mean that there shouldn't be laws, just becuase the charges are sometimes dropped? If the law didn't exist then the charges could never be made. Would that be preferable in your opinion?\n \n You are just bringing up \"what if\" statements to justify a ludicrous position.\n \n It's like saying \"what if someone is found not-guilty of murder, then what's the point in having a law against it?\" Get real.\n \n Smiley", 
   {}, 
   315588, 
   null, 
   1215524220.0
  ], 
  [
   315683, 
   null, 
   "iangb", 
   "How's this for an example of the laws not being applied? Or maybe this?\nFirst example is a good idea of exact crimes. I don't see anything wrong with it.\n Second example is harder to decipher because it is heavily biased. I would guess that the reason for 'plea bargains' is that they are asked for by criminals who want to get off more lightly, and granted when there is insufficient evidence to prosecute for the full term anyway - it's accepting a 50/50 split rather than gambling and risking either full conviction or 'not guilty'.", 
   {}, 
   315680, 
   null, 
   1215524820.0
  ], 
  [
   315690, 
   null, 
   "DrNo", 
   "Why is it that anybody would believe, even for one second, that criminals will abide by any new laws that might get passed? Criminals, by their very definition, are people who commit crimes by breaking the law.\n \n Passing laws to stop criminals, is like shouting at a deaf person; they don't know you're there and are going to ignore you.\n \n And don't argue that the new laws can be used to get longer sentences for criminals, because most every charge a criminal is brought up on will be plea bargained away just to speed things up.\n \n So, back to the original question: why do we think that criminals will obey new laws when they're not obeying the laws we already have?\n\n \n This is kind of a loaded question. Laws make criminals. People who smoke pot are only criminals because the law says so, not because they are really doing anything morally wrong.\n \n Most people obey laws because they don't want to deal with the consequences, not because they agree with the law itself. It's simple psychology. If your child misbehaves, you punish him to discourage the behavior. The idea is that the child will choose to act appropriately in the future because the fear of consequences. This is the same idea behind laws.\n \n If tomorrow you woke up and it was legal to steal, would you still pay for things at the store? What would stop you from walking into an electronics store and carrying the biggest, nicest TV you could find? Morality? Maybe for some people, but a lot of people who wouldn't have done this when it was illegal would probably do it now because of the lack of consequences.\n \n This is why we cannot abolish laws completely, as some people in this thread have suggested.", 
   {}, 
   314814, 
   null, 
   1215527880.0
  ], 
  [
   336777, 
   null, 
   "Ethmi", 
   "With that argument in mind, why do we not make all laws void? After all, criminals are not going to obey them, they're /criminals/. Keeping laws just wastes police time, when they could be doing productive things like producing guns for the lynch mob to use.\n \n [/sarcasm]\n\n \n Laws do help control those who will follow them. But if you want to do something bad enough to ignore the consequences, no law will stop you.", 
   {}, 
   314827, 
   null, 
   1229372820.0
  ], 
  [
   336778, 
   null, 
   "Ethmi", 
   "Who was being snotty? He pretty much dismissed your argument in one stroke. You ask \"why pass gun laws, since criminals aren't going to obey them?\" Apply that reasoning to every law-\"Why pass laws against murder/theft/rape/etc, since criminals aren't going to obey them?\" It's a poor argument.\n\n \n The answer is simple. Law abiding citizens will follow laws. People who fear the consequences of their actions will not break a law. The problem is, there are people who don't.", 
   {}, 
   314831, 
   null, 
   1229372940.0
  ], 
  [
   336779, 
   null, 
   "chester", 
   "Laws do help control those who will follow them. But if you want to do something bad enough to ignore the consequences, no law will stop you.\n\n \n Which is exactly why laws banning abortion will never be effective.emoticon_xagree\n \n Ever hear of that old right wing theory known as jury nullification?:)", 
   {}, 
   336777, 
   null, 
   1229373540.0
  ], 
  [
   336781, 
   null, 
   "iangb", 
   "Laws do help control those who will follow them. But if you want to do something bad enough to ignore the consequences, no law will stop you.\n\n Hey, wow, I posted that 9 months ago. This practically gives me a nostalgia hit.\n \n I've countered this from you so many times... I'm starting to think about making an 'index to pro-gun arguments' just so I can link you to it instead of having to type it out all over again.\n \n I have never claimed gun laws will stop all gun crime - just as other laws don't prevent other crime. However, they will reduce crime rates - just as other laws reduce other crime rates.\n If theft was legal, do you think theft incidences would be unaffected? Imagine that theft was legal - would you agree that criminalising theft would reduce it?\n Similarly, controlling widespread gun ownership will reduce widespread gun ownership, which will cause (after a brief period of adjustment, which is why such control must be introduce gradually) a reduction in gun crime.", 
   {}, 
   336778, 
   null, 
   1229374260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A question", 
  "url": "http://www.4forums.com/political/crime-debates/11337-question.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 11337, 
  "discussion_files": [
   [
    "22816.html", 
    "http://www.4forums.com/political/crime-debates/11337-question-print.html"
   ], 
   [
    "22817.html", 
    "http://www.4forums.com/political/crime-debates/11337-question-3-print.html"
   ], 
   [
    "22818.html", 
    "http://www.4forums.com/political/crime-debates/11337-question-2-print.html"
   ]
  ], 
  "identifier": 11337
 }
]