[
 [
  [
   315614, 
   null, 
   "GiantOreo", 
   "Saw this on CNN a minute ago, and searched for a story on it to post here (CNN only has it on TV right now and not on their homepage).\n \n Christian Site's Ban on 'G' Word Sends Homosexual to Olympics\n \n Some snippets from this hilarious happening:\n \nThe American Family Association obviously didn't foresee the problems that might arise with its strict policy to always replace the word \"gay\" with \"homosexual\" on the Web site of its Christian news outlet, OneNewsNow. The group's automated system for changing the forbidden word wound up publishing a story about a world-class sprinter named \"Tyson Homosexual\" who qualified this week for the Beijing Olympics.\n \n The problem: Tyson's real last name is Gay. Therefore, OneNewsNow's reliable software changed the Associated Press story about Tyson Gay's amazing Olympic qualifying trial to read this way:\n \n Tyson Homosexual was a blur in blue, sprinting 100 meters faster than anyone ever has. \n His time of 9.68 seconds at the U.S. Olympic trials Sunday doesn't count as a world record, because it was run with the help of a too-strong tailwind. Here's what does matter: Homosexual qualified for his first Summer Games team and served notice he's certainly someone to watch in Beijing.\n \"It means a lot to me,\" the 25-year-old Homosexual said. \"I'm glad my body could do it, because now I know I have it in me.\"\n \n \n You might think it's a joke, until you read the original AP story, which begins this way:\n \n Tyson Gay was a blur in blue, sprinting 100 meters faster than anyone ever has.\n \n His time of 9.68 seconds at the U.S. Olympic trials Sunday doesn't count as a world record, because it was run with the help of a too-strong tailwind. Here's what does matter: Gay qualified for his first Summer Games team and served notice he's certainly someone to watch in Beijing.\n \n \"It means a lot to me,\" the 25-year-old Gay said. \"I'm glad my body could do it, because now I know I have it in me.\"\n\n \n From what they said on CNN, the AFA had talked to AP last week about them starting the filter - apparently they said that they felt that the word \"gay\" in reference to the sexual orientation was too \"positive\" and thus they set it up so that \"gay\" would be replaced with \"homosexual\" (which I guess in their nutso right wing logic is somehow more \"negative\" than \"gay\"emoticon_rolleyes ).", 
   {
    "post_info": {
     "post_title": "Christian Site's Ban on 'G' Word Sends Homosexual to Olympics"
    }
   }, 
   null, 
   null, 
   1215489480.0
  ], 
  [
   315630, 
   null, 
   "electrolyte", 
   "Classic. Nice analysis of the positive/negative bit, too.", 
   {}, 
   315614, 
   null, 
   1215491940.0
  ], 
  [
   315646, 
   null, 
   "Shooterandproud", 
   "I laughed when I saw the \"Tyson Homosexual\" emoticon_smile.\n \n I also laughed when I say that they thought \"Gay\" was too positive. I can't believe that intolerance for gays does not create as much outrage as intolerance for Blacks. Both are prejudicial and wrong. It would be like a site saying \"were filtering the word \"African-American\" and changing it to \"Black\" because \"African-American\" is too positive. :xbanghead", 
   {}, 
   315630, 
   null, 
   1215499620.0
  ], 
  [
   315648, 
   null, 
   "foundit66", 
   "From what they said on CNN, the AFA had talked to AP last week about them starting the filter ...\n\n \n Like a silver lining on a dark cloud, they routinely make me laugh with junk like this...\n They actually take themselves seriously, refusing to realize just how the rest of the world views junk like this. It's like a patron apologizing to the Blockbuster Video store for forgetting to rewind the DVD... emoticon_rolleyes \n \n \n \nI also laughed when I say that they thought \"Gay\" was too positive.\n\n I've talked to some before that put forth the fairy tale that \"homosexuals\" themselves actually created the use of the word \"gay\" to describe homosexuals, and forced the rest of society to use it as well.\n It's amazing how their \"apologetics\" starts to run wild, creating all sorts of excuses for ignoring actual reality...", 
   {}, 
   315614, 
   null, 
   1215500220.0
  ], 
  [
   315652, 
   null, 
   "Archangel", 
   "Christian Site's Ban on 'G' Word Sends Homosexual to Olympics\n \n Would anyone care to explain how this sites typographical error played any part at all in sending this athlete to the olympics? From what I read in the article, he earned his position and this typo played no part at all in him qualifying. emoticon_confused", 
   {}, 
   315648, 
   null, 
   1215501300.0
  ], 
  [
   315655, 
   null, 
   "electrolyte", 
   "Christian Site's Ban on 'G' Word Sends Homosexual to Olympics\n \n Would anyone care to explain how this sites typographical error played any part at all in sending this athlete to the olympics? From what I read in the article, he earned his position and this typo played no part at all in him qualifying. emoticon_confused\n\n It's satire, Holmes. Due to the change, the headline announced that a homosexual is going to the Olympics.\n \n And it's not a \"typographical error.\" It's the result of bigoted censorship.", 
   {}, 
   315652, 
   null, 
   1215503040.0
  ], 
  [
   315666, 
   null, 
   "foundit66", 
   "Christian Site's Ban on 'G' Word Sends Homosexual to Olympics\n \n Would anyone care to explain how this sites typographical error played any part at all in sending this athlete to the olympics? From what I read in the article, he earned his position and this typo played no part at all in him qualifying. emoticon_confused\n\n \n Archie, sweetie, NOBODY is actually saying that this \"typographical error\" \"played any part at all in sending this athlete to the olympics\"...\n \n It's mocking the foolishness of homophobes.\n Some things just fly WAYYYYY over your head...", 
   {}, 
   315652, 
   null, 
   1215511440.0
  ], 
  [
   315692, 
   null, 
   "Archangel", 
   "It's satire, Holmes. Due to the change, the headline announced that a homosexual is going to the Olympics.\n \n And it's not a \"typographical error.\" It's the result of bigoted censorship.\n\n \n Of course it was a typo since ONN inadvertently used homosexual in place of his name which is Gay. And only anti-christian bigots would think that a News source correctly referring to gays as homosexuals is either bigoted, foolish or homophobic. It's just one more example of your need to mock and insult anyone who refuses to define homosexuals with the pet names that the community created in order to soften their appearance for public consumption.\n Why are people called homosexual or gay, and what does it mean?\n \n The terms heterosexual and homosexual are rarely used in everyday speech. More often people use slang words or terms which are abusive. Throughout the last century the terms used to describe gay people and that gay people used to describe themselves, have changed. These changes are important in telling us a lot about how lesbian and gay people lived their lives and felt about themselves as well as social reactions to them. What about the terms, 'straight', 'gay' and 'lesbian' which are commonly used?\n \n The term 'homosexual' is not nowadays sex specific. It was first used by Victorian scientists who regarded same-sex attraction and sexual behaviour as symptoms of mental disorders or moral deficiency. Homosexual men and women decided to use the term 'gay' in order to distance themselves from being labelled as somehow abnormal or ill.In fact, some people find the term 'homosexual' insulting and abusive and object to its use.http://www.avert.org/hsexu5.htm\n \n And just to show that I'm not homophobic, I used pink type, and Avert, a gay friendly source for this info that proves that it was in fact the homosexual community who adopted the term GAY in describing themselves. After all, what motivation would anyone else, such as the straight community have for replacing the term homosexual with the word gay as a pop term for describing this small class of sexual deviants that make up around 4% of the population?", 
   {}, 
   315655, 
   null, 
   1215530640.0
  ], 
  [
   315704, 
   null, 
   "iangb", 
   "So... gay people call themselves gay. How does this challenge the argument that a site whose word filter changes the word 'gay' to 'homosexual' is being bigoted by deliberately trying to use a term with more negative connotations?\n \n Remember, it is 'gay' to 'homosexual', not 'homosexual' to 'gay', as you've been claiming.\n \n Aw, you used pink type. How nice of you to steriotype.", 
   {}, 
   315692, 
   null, 
   1215533340.0
  ], 
  [
   315705, 
   null, 
   "smiley", 
   "\n And just to show that I'm not homophobic, I used pink type, and Avert, a gay friendly source for this info that proves that it was in fact the homosexual community who adopted the term GAY in describing themselves. After all, what motivation would anyone else, such as the straight community have for replacing the term homosexual with the word gay as a pop term for describing this small class of sexual deviants that make up around 4% of the population?\n\n And how does this show that you are not homophobic?", 
   {}, 
   315692, 
   null, 
   1215533400.0
  ], 
  [
   315707, 
   null, 
   "lesz", 
   "That news item was hilarious -- but then, what would one expect of these right-wing Christianist loons?\n \n What does it matter if many homosexual people call themselves \"gay\"? It's as good a word as any and avoids clinical semantic connotations that are irrelevant to being gay. If someone says they are gay, they are embracing their sexuality; if they describe themselves as homosexual, then it sounds as though they are distancing themselves.\n \n What I wonder is why so many self-styled and self-righteous \"Christians\" call themselves Christian, when none of their behaviour reminds me of Christ?", 
   {}, 
   315705, 
   null, 
   1215533940.0
  ], 
  [
   315715, 
   null, 
   "Archangel", 
   "What does it matter if many homosexual people call themselves \"gay\"? It's as good a word as any and avoids clinical semantic connotations that are irrelevant to being gay. \n\n \n \nI've talked to some before that put forth the fairy tale that \"homosexuals\" themselves actually created the use of the word \"gay\" to describe homosexuals, and forced the rest of society to use it as well.\n It's amazing how their \"apologetics\" starts to run wild, creating all sorts of excuses for ignoring actual reality...\n\n \n Because foundit lied about the origin of the term lesz and implied it was a fairy tale. That's why.", 
   {}, 
   315707, 
   null, 
   1215535620.0
  ], 
  [
   315716, 
   null, 
   "MrWriteLA", 
   "What does it matter if many homosexual people call themselves \"gay\"? It's as good a word as any and avoids clinical semantic connotations that are irrelevant to being gay. \nAh, but you see, the term \"gay\" doesn't contain the word \"sex,\" and it's vitally important to these religious reactionaries that they evoke -- even on a subconscious level--what we do in bed (or what they think we do) in the minds of the public whenever we are referred to, the better to hit that ol' \"ick factor\" button... as well as to bolster the impression they constantly attempt to create that sex...not love, not mutual devotion... is what consumes us. (When actually, they're the ones who appear to be obsessed with it.)", 
   {}, 
   315707, 
   null, 
   1215535680.0
  ], 
  [
   315719, 
   null, 
   "Archangel", 
   "Ah, but you see, the term \"gay\" doesn't contain the word \"sex,\" and it's vitally important to these religious reactionaries that they evoke -- even on a subconscious level--what we do in bed (or what they think we do) in the minds of the public whenever we are referred to, the better to hit that ol' \"ick factor\" button... \n\n \n Excellent point LA, you have inadvertently revealed precisely what motivated the homosexual lobby to adopt a public friendly term that took the sex out of what they represent. Thanks for helping me explain the motivation for adopting GAY to describe what you are.", 
   {}, 
   315716, 
   null, 
   1215536400.0
  ], 
  [
   315732, 
   null, 
   "Kronus", 
   "Excellent point LA, you have inadvertently revealed precisely what motivated the homosexual lobby to adopt a public friendly term that took the sex out of what they represent. Thanks for helping me explain the motivation for adopting GAY to describe what you are.\n\n \n His point was that homophobes like you will twist things whenever possible to try to make a point. For example, like you did just now!", 
   {}, 
   315719, 
   null, 
   1215538800.0
  ], 
  [
   315736, 
   null, 
   "lesz", 
   "Because foundit lied about the origin of the term lesz and implied it was a fairy tale. That's why.\n\n \n Sweetie, I don't know the origin of the use of \"gay\" in this context -- it probably goes back to the 19th century. However, the point that you and your legion of darkness like to miss is that being gay is about LOVE -- it's not even principally about sex. But then, love is not a concept homophobes really understand, I suspect because they often have problems with it in their own lives, so they cannot recognise it in the lives of others.\n \n Sex is only one part of love, and not even always the greatest, so calling someone gay \"a homosexual\" implies that the only thing on their mind is sex, and that the only dimension their love has is a sexual one. This is reducing a human being to a caricature, but it's what you people do to us. That is your sin with respect to gays -- your refusal to see us as human beings who love.", 
   {}, 
   315715, 
   null, 
   1215539100.0
  ], 
  [
   315738, 
   null, 
   "Archangel", 
   "Sure it is. You anti-christian hate mongers keep thinking that. See how far it gets in eternity.", 
   {}, 
   315736, 
   null, 
   1215539400.0
  ], 
  [
   315739, 
   null, 
   "lesz", 
   "Ah, but you see, the term \"gay\" doesn't contain the word \"sex,\" and it's vitally important to these religious reactionaries that they evoke -- even on a subconscious level--what we do in bed (or what they think we do) in the minds of the public whenever we are referred to, the better to hit that ol' \"ick factor\" button... as well as to bolster the impression they constantly attempt to create that sex...not love, not mutual devotion... is what consumes us. (When actually, they're the ones who appear to be obsessed with it.)\n\n \n I've always found it curious how religious homophobes obsess about gay sex. Even worse is their crazy notion their god obsesses about it as well. I think it's something to do with their own homoerotic obsessions and desires -- if they don't keep the devil of homosexuality at arms length, they will give way to temptation, so they want us to suffer as much as they suffer.\n \n Scratch the surface of many a religious homophobe and it seems you find a self-hating homosexual, and no, I certainly wouldn't call such a person gay. Were all the right-wing Christian pastors recently unfrocked for their homosexual behaviour while preaching against homosexuality gay? Not in my book -- they were, as they style it, \"homosexual\". It takes more than an obsession with gay sex or even a gay sex act to make someone gay, I think it takes a degree of self-acceptance.", 
   {}, 
   315716, 
   null, 
   1215539520.0
  ], 
  [
   315740, 
   null, 
   "sinjin", 
   "It's just a cute little bigotbot story. What the big deal AA.", 
   {}, 
   315738, 
   null, 
   1215539580.0
  ], 
  [
   315744, 
   null, 
   "Kronus", 
   "And just to show that I'm not homophobic, I used pink type, \n\n \n Ha! 100 irony points there. \"I'll show I'm not a homophobe by doing something homophobic!\" That's our Archie. emoticon_xhoho", 
   {}, 
   315692, 
   null, 
   1215540180.0
  ], 
  [
   315747, 
   null, 
   "Archangel", 
   "It's just a cute little bigotbot story. What the big deal AA.\n\n \n Because it isn't about bigotry at all. That's just the pro-homosexual spin on it. It's a story about a typographical error regarding the use of the word homosexuality to describe this class of people rather than using a slang to describe them. Not one person here can deny that homosexual is both the historic and technical term that has historically described practitioners of same gender sex.", 
   {}, 
   315740, 
   null, 
   1215540780.0
  ], 
  [
   315753, 
   null, 
   "iangb", 
   "And no-one (yourself included) can deny that 'gay' holds less negative connotations than 'homosexual'. Your own pink text confirmed this!\n \n Is censorship with the aim to discriminate to be considered a typo? Sure, in this case, the word filter miss-wrote Gay's name, so it is just about arguable. But in regular usage?", 
   {}, 
   315747, 
   null, 
   1215541800.0
  ], 
  [
   315757, 
   null, 
   "Kronus", 
   "It's a story about a typographical error regarding...\n\n \n You're really not doing yourself any favors by misusing that term over and over. Typos are caused by a slip of the finger; they're accidents. The global search and replace was done on purpose, the brain cases involved just didn't think through the consequences of their actions. If you're going to pretend to know anything about words, you should try to use them correctly.", 
   {}, 
   315747, 
   null, 
   1215544260.0
  ], 
  [
   315759, 
   null, 
   "sinjin", 
   "Because it isn't about bigotry at all. That's just the pro-homosexual spin on it. It's a story about a typographical error regarding the use of the word homosexuality to describe this class of people rather than using a slang to describe them. Not one person here can deny that homosexual is both the historic and technical term that has historically described practitioners of same gender sex.\nNo one is denying that someone who is gay is aka homosexual. The point is that you would deny a group being able to select its own term for itself. Does this extend to ethnic groups? Other groups?", 
   {}, 
   315747, 
   null, 
   1215546420.0
  ], 
  [
   315761, 
   null, 
   "Jo Bennett", 
   "Because it isn't about bigotry at all. That's just the pro-homosexual spin on it. It's a story about a typographical error regarding the use of the word homosexuality to describe this class of people rather than using a slang to describe them. Not one person here can deny that homosexual is both the historic and technical term that has historically described practitioners of same gender sex.\n\n \n The word was invented in the 19th century by those attempting to pathologise sexuality. Hardly historical. I suppose we should be grateful, no doubt you'd have used the same justification for using \"sodomite\" instead.", 
   {}, 
   315747, 
   null, 
   1215547140.0
  ], 
  [
   315764, 
   null, 
   "foundit66", 
   "Of course it was a typo since ONN inadvertently used homosexual in place of his name which is Gay.\n\n Archie.\n Get some honesty.\n There was no \"inadvertent\" about this.\n \n The web-site in question has a PROGRAM that they CHOSE to put in place to replace every use of the word \"gay\" with \"homosexual\".\n This was NOT \"inadvertent\".\n \n \n \nAnd only anti-christian bigots would think that a News source correctly referring to gays as homosexuals is either bigoted, foolish or homophobic.\n\n :xbanghead \n Archie, the REASON that the people who REPEATED the article CHOSE to put that program into effect is part of the reason they ARE seen as \"bigotted\".\n \n This has nothing to do with \"anti-Christian\". Anybody who can't use the word \"gay\" obviously has prejudice issues.\n \n \n \nIt's just one more example of your need to mock and insult anyone who refuses to define homosexuals with the pet names that the community created in order to soften their appearance for public consumption.\n\n Actually, Archie, the fact that the bigotted web-site DECIDED to replace all uses of the word \"gay\" with the word \"homosexual\" WAS BECAUSE they wanted to HARDEN the appearance for public consumption.\n \n I challenge you to address the truth of the situation.\n \n \n Now, on to the article you are misrepresenting...\n \nWhy are people called homosexual or gay, and what does it mean?\n \n The terms heterosexual and homosexual are rarely used in everyday speech. More often people use slang words or terms which are abusive. Throughout the last century the terms used to describe gay people and that gay people used to describe themselves, have changed. These changes are important in telling us a lot about how lesbian and gay people lived their lives and felt about themselves as well as social reactions to them. What about the terms, 'straight', 'gay' and 'lesbian' which are commonly used?\n \n The term 'homosexual' is not nowadays sex specific. It was first used by Victorian scientists who regarded same-sex attraction and sexual behaviour as symptoms of mental disorders or moral deficiency. Homosexual men and women decided to use the term 'gay' in order to distance themselves from being labelled as somehow abnormal or ill.In fact, some people find the term 'homosexual' insulting and abusive and object to its use.\n http://www.avert.org/hsexu5.htm\n\n You were fixating on the wrong sentence.\n The FIRST people to use it were using it as a slur AGAINST GAYS.\n The fact that the meaning has evolved since then doesn't change that fact.\n \n Anybody who thinks the term \"gay\" somehow *softens* the appearance of the homosexual to the public is deluding themselves.\n \n \n \nAnd just to show that I'm not homophobic, I used pink type, and Avert, a gay friendly source for this info that proves that it was in fact the homosexual community who adopted the term GAY in describing themselves.\n\n 1) \"not homophobic\"?\n Archie. Complete this phrase which YOU coined: Bitchy as a ___.\n \n 2) Your article clearly shows it was NOT the homosexual community who STARTED using the term.\n We use the term to describe ourselves in an effort to remove the stigma from the word.\n The word ORIGINATED AS A SLUR against homosexuals.\n And in many ways, it is STILL used as such to this day.\n \n \n \nAfter all, what motivation would anyone else, such as the straight community have for replacing the term homosexual with the word gay as a pop term for describing this small class of sexual deviants that make up around 4% of the population?\n\n Prejudice. Bigotry.\n There are plenty of terms that are derogatorily applied to groups. Slur words for blacks, whites, mexicans, Jews, women, ...\n Plenty of times when another \"community\" took one term for an existing group, and then applied another term instead.\n \n What I find truly hilarious is that while the word \"gay\" started out as a slur, homosexuals have been so successful in their attempts to remove the stigma that the bigots have done a 180 and now are pretending that it's homosexuals who started using the word to describe ourselves.\n That's like saying white people first started using the phrase \"honky\" to describe themselves. emoticon_rolleyes", 
   {}, 
   315692, 
   null, 
   1215548580.0
  ], 
  [
   315765, 
   null, 
   "foundit66", 
   "Sure it is. You anti-christian hate mongers keep thinking that.\n\n The AFA is a group with an EXPLICIT goal to discriminate against gays.\n Yet when gays talk about the AFA in non-glowing terms, suddenly it's the GAYS who are prejudiced against \"Christians\".\n \n That's like having the blacks talk negatively about the KKK, and suddenly the response is that the blacks are being \"anti-Christian\".\n \n \n \n See how far it gets in eternity.\n\n I've come to the conclusion that this phrase is something that keeps you warm and cozy at night...\n Those big bad homosexuals who won't accept being attacked! They'll get theirs someday!\n < end sarcasm <\n emoticon_rolleyes", 
   {}, 
   315738, 
   null, 
   1215548760.0
  ], 
  [
   315766, 
   null, 
   "Archangel", 
   "No one is denying that someone who is gay is aka homosexual. The point is that you would deny a group being able to select its own term for itself. Does this extend to ethnic groups? Other groups?\n\n \n You see, that's the whole point here sinjin, I'm neither endorsing nor promoting that homosexuals don't have the right to refer to themselves any way they want to. This whole issue was raised because foundit called the claim that the creation of the word gay by homosexuals themselves, a fairy tale. I provided evidence from a pro homosexual site that directly refuted his claim. PERIOD!!! All of the rest of this defensive minutia is based on the pro homosexuals need to refute anything I say, no matter how accurate or non-confrontational it is.", 
   {}, 
   315759, 
   null, 
   1215548820.0
  ], 
  [
   315767, 
   null, 
   "Archangel", 
   "The AFA is a group with an EXPLICIT goal to discriminate against gays.\n Yet when gays talk about the AFA in non-glowing terms, suddenly it's the GAYS who are prejudiced against \"Christians\".\n \n That's like having the blacks talk negatively about the KKK, and suddenly the response is that the blacks are being \"anti-Christian\".\n\n \n There's your anti-christian hatred and bigotry talking again foundit. Neither the AFA nor ONN is involved at all in the business of endorsing discrimination against homosexuals. What they are committed to is standing against the immoral lifestyle that community promotes and endorses at every level of its agenda. If they had a wish that they could speak into creation, it would be that all people live their lives in total harmony with our God who created us all in His image for fellowship with Him. They wouldn't make a negative wish against homosexuals or for their destruction, condemnation or damnation. It would simply be for unity through the Holy Spirit of God which exists in and through Christ Jesus, our Lord. Amen...\n \n In your hate and ignorance, you interpret that as endorsing discrimination, but all it really is in reality is standing against the destructive and unnatural sexual promiscuity your lifestyle endorses and represents for this world.", 
   {}, 
   315765, 
   null, 
   1215549420.0
  ], 
  [
   315773, 
   null, 
   "foundit66", 
   "This whole issue was raised because foundit called the claim that the creation of the word gay by homosexuals themselves, a fairy tale\n\n Archie.\n RE-READ YOUR ARTICLE.\n It EXPLICITLY notes that the origin of the word was from \"Victorian scientists\"! :xbanghead \n AFTER the word had already been associated by \"victorian scientists\", DECADES later gays claimed it.\n \n Gays did NOT \"create\" the association. :xbanghead \n \n And in your usual \"style\", you're IGNORING YOUR PREVIOUS LIE that it was a \"typographical error\".\n The AFA PROGRAMMED their web-site to replace all words \"gay\" with \"homosexual\".\n HOW can you claim it was a \"typographical error\" when the AFA DID IT ON PURPOSE???\n \n \n \nThere's your anti-christian hatred and bigotry talking again foundit. Neither the AFA nor ONN is involved at all in the business of endorsing discrimination against homosexuals.\n\n At times, I don't know whether you blindly believe the lies you tell, or whether you just find it convenient to say something and you don't care if it's the truth...\n \n The AFA has organized repeated boycotts of organizations just cause of their association with gays.\n Ford. McDonalds. Disney. Just to name a few.\n They support employers being able to fire gays just cause they are gay.\n They oppose gay adoption. Oppose gay civil unions. Oppose gays in the military.\n \n I could challenge you to name me any significant form of gay discrimination they don't support, but we both know you don't honestly address issues like this.\n \n QUIT LYING and pretending it's about \"anti-christian\".\n The AFA EXPLICITLY attacks gays. THAT is why they are not liked.\n \n \n \nWhat they are committed to is standing against the immoral lifestyle that community promotes and endorses at every level of its agenda. If they had a wish that they could speak into creation, it would be that all people live their lives in total harmony with our God who created us all in His image for fellowship with Him.\n\n If they had that wish, the entire \"creation\" would be straight.\n \n That's what cracks me up about guys like you and the AFA. You pretend you want peace, but it's only the \"peace\" TO BE STRAIGHT that you support.", 
   {}, 
   315767, 
   null, 
   1215551700.0
  ], 
  [
   315776, 
   null, 
   "Archangel", 
   "And in your usual \"style\", you're IGNORING YOUR PREVIOUS LIE that it was a \"typographical error\".\n The AFA PROGRAMMED their web-site to replace all words \"gay\" with \"homosexual\".\n HOW can you claim it was a \"typographical error\" when the AFA DID IT ON PURPOSE???\n \n\n It was a typo because ONN programmed software to replace the slang word GAY with its proper, technical word HOMOSEXUAL. They never intended that software to change a proper name to the word homosexual, so it was a typo, not a purposeful thing at all. But you already knew that, didn't you!\n \n \nThe AFA has organized repeated boycotts of organizations just cause of their association with gays.\n Ford. McDonalds. Disney. Just to name a few.\n They support employers being able to fire gays just cause they are gay.\n They oppose gay adoption. Oppose gay civil unions. Oppose gays in the military.\n \n\n \n To summarize, the stand against the normalization of homosexuality as an excepted lifestyle in our Society. As I said above, they have no personal animosity against you as a homosexual. I'm sure that just as I do, they pray for your salvation on a daily basis. Just because we refuse to tolerate your sinful lifestyle or endorse it, it doesn't mean we hate you personally. Our motivation is to protect traditional moral values. I wish you could understand that and just stop trying to impose your 4%s lifestyle on my 96%s traditional majority.\n \n \nIf they had that wish, the entire \"creation\" would be straight.\n\n \n obviously, and precisely. And so what? Does it offend you that they would wish that the World was as God originally intended it to be? God didn't make you homosexual just as He didn't create any other type of sinner as they are. We are all sinners as a result of the Fall from Grace. I wish it wasn't beyond you to comprehend why things are the way they are and what the true solution is to find total deliverance.", 
   {}, 
   315773, 
   null, 
   1215553140.0
  ], 
  [
   315781, 
   null, 
   "Kronus", 
   "It was a typo because ONN programmed software to replace the slang word GAY with its proper, technical word HOMOSEXUAL. They never intended that software to change a proper name to the word homosexual, so it was a typo, not a purposeful thing at all. But you already knew that, didn't you!\n \n\n \n Again, how can you sit there arguing about about the meanings of words when you have such a huge problem with even simple definitions? A typo, once again, is a mistake made while typing; it's a slip of the finger. They look like htis. What ONN did was an EDITORIAL mistake. They quite deliberately, as a matter of policy, replaced all instances of the word \"gay\" with \"homosexual\". They failed to think about the consequences of said policy, and they apparently also failed to proofread. This wasn't a slip, it was a poorly made editorial policy decision which bit them.", 
   {}, 
   315776, 
   null, 
   1215554940.0
  ], 
  [
   315785, 
   null, 
   "Matthew S", 
   "I wonder if it would replace the gay in Gloria Gaynor to Gloria Homosexualnor?", 
   {}, 
   315781, 
   null, 
   1215557940.0
  ], 
  [
   315786, 
   null, 
   "smiley", 
   "I wonder if it would replace the gay in Gloria Gaynor to Gloria Homosexualnor?\n\n Depends if it's sophisticated enough to only replace whole words, or just replaces strings of characters.\n \n Though why I would even consider that they would be associated with anything sophisticated is very strange indeed.\n \n Smiley", 
   {}, 
   315785, 
   null, 
   1215558180.0
  ], 
  [
   315791, 
   null, 
   "electrolyte", 
   "Of course it was a typo since ONN inadvertently used homosexual in place of his name which is Gay.\n\n \nIt was a typo because ONN programmed software to replace the slang word GAY with its proper, technical word HOMOSEXUAL. They never intended that software to change a proper name to the word homosexual, so it was a typo, not a purposeful thing at all.\n\n I'm late to the party, so foundit and Kronus already grilled you on this. A typo is what happens when there's a typing mistake. There was no typing mistake here; the filter worked exactly as designed, even maintaining the capital letter at the beginning of the word.\n \n But, this isn't nearly the issue that purposely censoring news ticker articles for the explicit purpose of painting a group in a negative light is. Are you defending their rationale?", 
   {}, 
   315692, 
   null, 
   1215559740.0
  ], 
  [
   315796, 
   null, 
   "Archangel", 
   "Again, how can you sit there arguing about about the meanings of words when you have such a huge problem with even simple definitions? A typo, once again, is a mistake made while typing; it's a slip of the finger. They look like htis. What ONN did was an EDITORIAL mistake. They quite deliberately, as a matter of policy, replaced all instances of the word \"gay\" with \"homosexual\". They failed to think about the consequences of said policy, and they apparently also failed to proofread.\n\n \n But since you guys like to get so technical when it suits you, and since this is the 21st century when software can edit stories without a human being even stroking a key, what happened is most definitely a high tech typo. But an editorial oversight is also an applicable description too. And what they failed to consider was the capabilities of the software. Changing a proper name was obviously something they didn't expect the software to do. But I agree with you that not proofing it was their biggest oversight. As for wanting to edit out the slang and only use the adjective homosexual, they have every right to do it.", 
   {}, 
   315781, 
   null, 
   1215561720.0
  ], 
  [
   315797, 
   null, 
   "foundit66", 
   "It was a typo because ONN programmed software to replace the slang word GAY with its proper, technical word HOMOSEXUAL. They never intended that software to change a proper name to the word homosexual, so it was a typo, not a purposeful thing at all.\n\n I am amazed at how you continue this blatant obfuscation.\n 1) It was NOT a \"typo\" or a \"typographical error\".\n definition of \"typo\"\n ** : an error (as of spelling) in typed or typeset material\n \n It was not misspelled.\n \n 2) It WAS \"a purposeful thing\".\n They EXPLICITLY put a program on their system to change every \"gay\" to \"homosexual\".\n To claim that wasn't \"purposeful\" is crazy lying.\n \n \n \nTo summarize...\n\n This Archie speak for \"I'm about to obfuscate the heck out everything you actually said\".\n Reviewing what he's about to say, NONE of it contradicts ANYTHING of what I said...\n \n \n \n... the stand against the normalization of homosexuality as an excepted lifestyle in our Society. As I said above, they have no personal animosity against you as a homosexual.\n\n 1) This does not refute the fact that they are prejudiced and bigotted.\n Your \"spin\" does not preclude them from being prejudiced and bigotted.\n All you did was REPHRASE their prejudice and bigotry into something that sounds more appealing.\n \n 2) I don't care if they have \"personal\" animosity.\n They FIGHT FOR DISCRIMINATION AGAINST GAYS.\n That statement goes unrefuted.\n And the sad part that you will never honestly admit is that you CANNOT refute that by actually talking about the discrimination I listed that they support.\n \n \n \nJust because we refuse to tolerate your sinful lifestyle or endorse it, it doesn't mean we hate you personally.\n\n More obfuscation.\n Bigotry and prejudice do not require \"hate\".\n Slave owners did not typically \"hate\" their slaves. Some even had sex (sometimes consensual) with their slaves.\n But the people were still slaves, and the slave-owners were still bigots.\n \n \n \nOur motivation is to protect traditional moral values.\n\n WHERE is the \"traditional moral value\" in fighting to ensure gays can be fired just for being gay?\n WHERE is the \"traditional moral value\" in fighting to ensure gays can't serve in the military?\n WHERE is the \"traditional moral value\" in fighting to ensure gays can't adopt?\n WHERE is the \"traditional moral value\" in fighting to ensure that gay sex is illegal?\n \n The motivation is to IMPOSE what you CLAIM are \"moral values\", when the real moral value is gross intolerance to the point of subjugation.\n \n \n \nI wish you could understand that and just stop trying to impose your 4%s lifestyle on my 96%s traditional majority.\n\n Archie.\n Do not EVER pretend your views are shared by \"96%\".\n I know you want to be all ridiculously delusional, but that is just so inaccurate it isn't even funny.\n \n A MAJORITY support gay equality and rights on EVERY issue with ONLY one hold-out.\n You ONLY have a slim majority on gay marriage.\n \n You LOSE every other issue in a popularity contest.\n \n \n \nDoes it offend you that they would wish that the World was as God originally intended it to be? God didn't make you homosexual just as He didn't create any other type of sinner as they are.\n\n Gay animals Archie.\n As must as you like to stick your head in the ground, you cannot even try to broach the issue of gay animals.", 
   {}, 
   315776, 
   null, 
   1215561720.0
  ], 
  [
   315799, 
   null, 
   "Kronus", 
   " But since you guys like to get so technical when it suits you, and since this is the 21st century when software can edit stories without a human being even stroking a key, what happened is most definitely a high tech typo.\n\n A typo without a key being hit. That's a good one! Dead wrong, of course, but dead wrong in a very amusing way.\n \n \nAs for wanting to edit out the slang and only use the adjective homosexual, they have every right to do it. \n\n Probably not. Given that they clearly did this with little thought or oversight, I'd say it's a safe bet that they've changed people's copyrighted works and quotes the same way. I know you think it's dandy to change quotes without telling people, but if an online newspaper does it I suspect it's actionable. Certainly it's not something they have any right to do.", 
   {}, 
   315796, 
   null, 
   1215563040.0
  ], 
  [
   315800, 
   null, 
   "Archangel", 
   "Gay animals Archie.\n As must as you like to stick your head in the ground, you cannot even try to broach the issue of gay animals.\n \n\n Sure I can. Since nothing else you posted is even worthy of a response, I'll educate you on this subject. Not that you'll learn anything from what I tell you, but you'll never be able to say you didn't know of the truth anyway.\n \n Animals weren't created in Gods image, or after His likeness foundit, so neither are they held to the standards God has set for us, His children. How incredibly sad it is that you have no concept of this basic truth. You proudly debase yourself and all of humanity to that of the animal kingdom and insist that it is something to be sought after. If it wasn't so sad, it would be pathetic. My hope is that you will someday understand who and what you really are foundit.", 
   {}, 
   315797, 
   null, 
   1215563220.0
  ], 
  [
   315803, 
   null, 
   "iangb", 
   "Just because we refuse to tolerate your sinful lifestyle or endorse it, it doesn't mean we hate you personally.\n\n \n@Jyoshu: You deny a link between your perceptions of someone's actions and your perception of their character. How, then, do you form an impression of someone's character if you cannot use their actions? After all, that is all you have (telepathy aside).\nYou're absolutely right in this assessment iangb.\n\n Am I allowed to use my precedent of awesomeness again?\n \n I'm going to, anyway. You're countering yourself, here.\n \n \nAs for wanting to edit out the slang and only use the adjective homosexual, they have every right to do it. \n\n Probably, yes. However, we have every right to imply that this is homophobic behaviour - even your pink text from earlier in this thread states that there are more negative connotations associated with 'homosexual' than with 'gay'.\n What other reason do they have for doing it?", 
   {}, 
   315800, 
   null, 
   1215564840.0
  ], 
  [
   315805, 
   null, 
   "foundit66", 
   "Sure I can. Since nothing else you posted is even worthy of a response...\n\n Translation: I pointed out too many lies for even Archie to try to dodge.\n So he'll do the next best thing. Ignore it. emoticon_rolleyes \n \n The facts remain:\n 1) AFA IS a bigotted resource.\n 2) AFA's changing of \"gay\" to \"homosexual\" is not a \"typo\". It's something they put into effect purposely. Deliberately. Not a \"typo\".\n 3) Archie's view is NOT shared by 96% of the population.\n Gays have majority support on MOST issues of gay equality, with the ONLY exception being \"gay marriage\".\n Most people DISAPPROVE of what Archie represents.\n \n \n \nNot that you'll learn anything from what I tell you, but you'll never be able to say you didn't know of the truth anyway.\n\n I am eternally bored by how you confuse your apologetic opinion with \"truth\".\n You make up some fantasy in your head which has \"consistency\" with your religion...\n ... or you obfuscate the real point with some apologetic mumbo jumbo, and you declare it as \"truth\", and anybody who disagrees with you is ignorant and hates the truth...\n \n \n \nAnimals weren't created in Gods image, or after His likeness foundit, so neither are they held to the standards God has set for us, His children. How incredibly sad it is that you have no concept of this basic truth.\n\n Archie, I already knew that fundamental claim of your religion.\n But it's not addressing my point. Not in the slightest.\n \n Animals aren't created in Gods image? So what.\n God DID create animals though. And animals LACK the intelligence to make choices, right?\n So while animals aren't created in \"Gods image\", God DID CREATE GAY ANIMALS.\n Can you explain why he would do such a thing?\n Of course you can't...\n \n Gay animals are a demonstration of how nature INHERENTLY has gayness within it.\n Gayness is NATURAL.\n \n \n \nYou proudly debase yourself and all of humanity to that of the animal kingdom and insist that it is something to be sought after.\n\n And this is where discussing with Archie gets REALLY stupid...\n Not only does he start in with the apologetics, he turns his story-weaving into MAKING UP THINGS ABOUT OTHER PEOPLE'S OPINIONS.\n And the real sad part is that no matter how often you tell Archie he is wrong about what he claims your opinion is, he just plain WILL NOT LEARN.\n \n Gayness is not \"something to be sought after\".\n It's like skin color or eye color or hair color. It just IS.\n You are born with certain characteristics. Sexual orientation is one of them.\n A person has no more need to \"seek after\" a specific sexual orientation than they need to change the color of their eyes.\n \n \n \nIf it wasn't so sad, it would be pathetic. My hope is that you will someday understand who and what you really are foundit.\n\n I am as God made me.\n A gay man.\n \n Homosexuality is not a choice. Despite what you think based on the ignorance of people who lived centuries ago who thought slavery, genocide, and misogyny were \"moral\", homosexuality is not a choice.\n \n It's truly amazing how you claim words like \"hope\" while denigrating others with words like \"sad\" and \"pathetic\". And then you complain about others insulting, while you yourself revel in the insults you fling out there...", 
   {}, 
   315800, 
   null, 
   1215565500.0
  ], 
  [
   315814, 
   null, 
   "Shooterandproud", 
   "Sweetie, I don't know the origin of the use of \"gay\" in this context -- it probably goes back to the 19th century. However, the point that you and your legion of darkness like to miss is that being gay is about LOVE -- it's not even principally about sex. But then, love is not a concept homophobes really understand, I suspect because they often have problems with it in their own lives, so they cannot recognise it in the lives of others.\n \n Sex is only one part of love, and not even always the greatest, so calling someone gay \"a homosexual\" implies that the only thing on their mind is sex, and that the only dimension their love has is a sexual one. This is reducing a human being to a caricature, but it's what you people do to us. That is your sin with respect to gays -- your refusal to see us as human beings who love.\n\n \n \nSure it is. You anti-christian hate mongers keep thinking that. See how far it gets in eternity.\n\n \n \n So, is this a \"yes, I know what love is\", or a \"no, I don't know what love is\"? It seems like a no to me.\n \n Its also funny that Archie throws words like \"hate-monger\" are way when he makes comments like:\n \n \n\n \n class of sexual deviants\n pro-homosexual\n immoral lifestyle\n against homosexuals or for their destruction, condemnation or damnation\n destructive and unnatural sexual promiscuity\n stand against the normalization of homosexuality\n we refuse to tolerate your sinful lifestyle\n\n \n Oh yea, we suuuurre are hateful, aren't we? emoticon_xgood", 
   {}, 
   315736, 
   null, 
   1215570660.0
  ], 
  [
   315819, 
   null, 
   "Archangel", 
   "Translation: I pointed out too many lies for even Archie to try to dodge.\n So he'll do the next best thing. Ignore it. emoticon_rolleyes \n \n The facts remain:\n 1) AFA IS a bigotted resource.\n 2) AFA's changing of \"gay\" to \"homosexual\" is not a \"typo\". It's something they put into effect purposely. Deliberately. Not a \"typo\".\n 3) Archie's view is NOT shared by 96% of the population.\n Gays have majority support on MOST issues of gay equality, with the ONLY exception being \"gay marriage\".\n Most people DISAPPROVE of what Archie represents.\n \n I am eternally bored by how you confuse your apologetic opinion with \"truth\".\n You make up some fantasy in your head which has \"consistency\" with your religion...\n ... or you obfuscate the real point with some apologetic mumbo jumbo, and you declare it as \"truth\", and anybody who disagrees with you is ignorant and hates the truth...\n \n Archie, I already knew that fundamental claim of your religion.\n But it's not addressing my point. Not in the slightest.\n \n Animals aren't created in Gods image? So what.\n God DID create animals though. And animals LACK the intelligence to make choices, right?\n So while animals aren't created in \"Gods image\", God DID CREATE GAY ANIMALS.\n Can you explain why he would do such a thing?\n Of course you can't...\n \n Gay animals are a demonstration of how nature INHERENTLY has gayness within it.\n Gayness is NATURAL.\n \n And this is where discussing with Archie gets REALLY stupid...\n Not only does he start in with the apologetics, he turns his story-weaving into MAKING UP THINGS ABOUT OTHER PEOPLE'S OPINIONS.\n And the real sad part is that no matter how often you tell Archie he is wrong about what he claims your opinion is, he just plain WILL NOT LEARN.\n \n Gayness is not \"something to be sought after\".\n It's like skin color or eye color or hair color. It just IS.\n You are born with certain characteristics. Sexual orientation is one of them.\n A person has no more need to \"seek after\" a specific sexual orientation than they need to change the color of their eyes.\n \n I am as God made me.\n A gay man.\n \n Homosexuality is not a choice. Despite what you think based on the ignorance of people who lived centuries ago who thought slavery, genocide, and misogyny were \"moral\", homosexuality is not a choice.\n \n It's truly amazing how you claim words like \"hope\" while denigrating others with words like \"sad\" and \"pathetic\". And then you complain about others insulting, while you yourself revel in the insults you fling out there...\n\n \n In response to this drivel, I repeat for your edification, foundit. [Archangel]\n Not that you'll learn anything from what I tell you, but you'll never be able to say you didn't know of the truth anyway.", 
   {}, 
   315805, 
   null, 
   1215571860.0
  ], 
  [
   315823, 
   null, 
   "iangb", 
   "Not that you'll learn anything from what I tell you, but you'll never be able to say you didn't know of the truth anyway.\n\n You need to learn that 'I predict people will disagree with me' is about as useful a debating tool as 'people have disagreed with me, so I must be right': utterly useless, because both can be used to justify any argument that goes against the majority opinion.\n \n Care to respond to your own precedent of awesomeness yet?", 
   {}, 
   315819, 
   null, 
   1215573120.0
  ], 
  [
   315827, 
   null, 
   "foundit66", 
   "In response to this drivel, I repeat for your edification, foundit. [Archangel]\n Not that you'll learn anything from what I tell you, but you'll never be able to say you didn't know of the truth anyway.\n\n Yup! True zealot behavior.\n Don't address the issues at hand and the arguments raised, but mindlessly parrot meaningless phrases in order to boost the pretense that you're actually doing something... emoticon_xagree \n \n Your mission is accomplished.\n emoticon_xdonno \n \n \n \nYou need to learn that 'I predict people will disagree with me' is about as useful a debating tool as 'people have disagreed with me, so I must be right': utterly useless, because both can be used to justify any argument that goes against the majority opinion.\n Care to respond to your own precedent of awesomeness yet?\n\n He is his own self-fulfilling prophecy.\n \n Some of the \"worst\" of those that can't think for themselves sometimes come up with the stance that Archie has reveled in in the past.\n The ol' \"Jesus said his followers would be persecuted, therefore the fact that I engender opposition must mean I'm doing the right thing!\"\n emoticon_xdonno", 
   {}, 
   315819, 
   null, 
   1215574200.0
  ], 
  [
   315833, 
   null, 
   "Archangel", 
   "You need to learn that 'I predict people will disagree with me' is about as useful a debating tool as 'people have disagreed with me, so I must be right': \n\n \n Predicting that this Godless crowd that hates anything good and righteous will disagree with me is pretty much no brainer. Beside, it's true that every truth we hear, whether we accept it as truth or not, we will be held accountable for at the judgement.", 
   {}, 
   315823, 
   null, 
   1215578520.0
  ], 
  [
   315835, 
   null, 
   "robbie0517", 
   "Beside, it's true that every truth we hear, whether we accept it as truth or not, we will be held accountable for at the judgement.\n\n \n Care to prove this?", 
   {}, 
   315833, 
   null, 
   1215578700.0
  ], 
  [
   315836, 
   null, 
   "Archangel", 
   "Care to prove this?\n\n \n All you have to do is die robbie and the proof will be known to you immediately. You will instantaneously know how wrong your life choices have been. And you will instantaneously know that they were CHOICES that you had, and that you freely made.", 
   {}, 
   315835, 
   null, 
   1215579000.0
  ], 
  [
   315841, 
   null, 
   "jazyjason", 
   "Sure it is. You anti-christian hate mongers keep thinking that. See how far it gets in eternity.\n\n \n \n Wow real Christlike there Archie. Your bigoted hateful views make my stomach churn.", 
   {}, 
   315738, 
   null, 
   1215582420.0
  ], 
  [
   315845, 
   null, 
   "Archangel", 
   "Wow real Christlike there Archie. Your bigoted hateful views make my stomach churn.\n\n \n I'm sorry that you find the truth so offensive jason.", 
   {}, 
   315841, 
   null, 
   1215584400.0
  ], 
  [
   315864, 
   null, 
   "foundit66", 
   "I'm sorry that you find the truth so offensive jason.\n\n \n Okay. Question for the viewing audience...\n \n Is there ANYBODy out there who doesn't think this schtick of Archie's has gone well past \"old\"?\n \n Is there ANYBODY out there who believes him when he accuses others of \"finding truth offensive\"?", 
   {}, 
   315845, 
   null, 
   1215593100.0
  ], 
  [
   315872, 
   null, 
   "lesz", 
   "So, is this a \"yes, I know what love is\", or a \"no, I don't know what love is\"? It seems like a no to me.\n \n Its also funny that Archie throws words like \"hate-monger\" are way when he makes comments like:\n \n Oh yea, we suuuurre are hateful, aren't we? emoticon_xgood\n\n \n No kidding. It's \"my love is godly, but your love is demonic\". I think it stems from a real lack of understanding of the relationship between sex and love. The Archies of the world like to focus exclusively on the sexual dimension, but only in the case of the gays they love to hate. They reduce us to a caricature, and thus commit a serious sin, even in secular terms.\n \n It's no accident that a recent Pew poll found that thanks to the efforts of Archie and his ilk over the last couple of decades, young people tend to see Christianity as a religion of intolerance. They see it as preaching rejection of gay people, rather than love and acceptance. And rejection is not that far from the pure, raw hatred exhibited by some Christian churches, and many Christian priests and pastors.\n \n While it would be an error to confuse abstract Christianity with specific Christian churches, it is true that it is Christian churches that are most successful in defining what constitutes Christianity. Therefore when those churches sin, it's the fault of the religion they espouse.", 
   {}, 
   315814, 
   null, 
   1215607680.0
  ], 
  [
   315873, 
   null, 
   "jazyjason", 
   "No kidding. It's \"my love is godly, but your love is demonic\". I think it stems from a real lack of understanding of the relationship between sex and love. The Archies of the world like to focus exclusively on the sexual dimension, but only in the case of the gays they love to hate. They reduce us to a caricature, and thus commit a serious sin, even in secular terms.\n \n It's no accident that a recent Pew poll found that thanks to the efforts of Archie and his ilk over the last couple of decades, young people tend to see Christianity as a religion of intolerance. They see it as preaching rejection of gay people, rather than love and acceptance. And rejection is not that far from the pure, raw hatred exhibited by some Christian churches, and many Christian priests and pastors.\n \n While it would be an error to confuse abstract Christianity with specific Christian churches, it is true that it is Christian churches that are most successful in defining what constitutes Christianity. Therefore when those churches sin, it's the fault of the religion they espouse.\n\n \n \n How very true your statement is. It's all about environment and upbringing.", 
   {}, 
   315872, 
   null, 
   1215608160.0
  ], 
  [
   315877, 
   null, 
   "lesz", 
   "How very true your statement is. It's all about environment and upbringing.\n\n \n What it boils down to is that \"Christianity\" is whatever any Christian or Christian church says it is. There is no objectively real \"Christianity\" hanging out there to be recognised by anyone with a mind to. It's all filtered through tradition and dogma, picked over, selected, rejected by individuals or churches. No one Christianity is more true than any other.\n \n There are many facets to Christianity, some neutral, some good, and some bad. A lot of what we see when many Christian churches preach about gays are the bad facets, which are just as Christian scripturally and traditionally as the good. So I get a little jaded when a Christian apologist attempts to explain away the sometimes dubious activities of some Christian church or other by saying, \"Oh, but they aren't real Christians!\" They are as real as the Christian apologist.\n \n The late pope, JPII, gave an analogous example in his \"apology\" to the Jews: It wasn't \"the Church\" to blame, it was individual Christians who didn't live up to tradition and doctrine. What he meant, though he'd never admit it, was that he disagreed with the selections his predecessors made, and so tried to gloss over the fact it was the tradition and doctrine that was at fault. Earlier Christians were simply paying attention to different parts of it than JPII would have preferred.\n \n If you buy Christianity as preached by some church, you have to buy the whole thing, good and bad. If you want to excise the bad and keep the good, then what you have left is no longer Christianity, and no longer a church. It's a selection of beliefs drawn from the Christian menu, according to personal wishes and prejudices.\n \n While I think that's the only rational approach to a set of beliefs as odd as Christianity, which encompasses everything from good but mundane daily behaviour to the most incredible supernatural claims, it would be better if more Christians were willing to admit that's what they were doing: choosing some beliefs over others, rather than claiming that those who make a different selection aren't \"real\".", 
   {}, 
   315873, 
   null, 
   1215609660.0
  ], 
  [
   315880, 
   null, 
   "jazyjason", 
   "What it boils down to is that \"Christianity\" is whatever any Christian or Christian church says it is. There is no objectively real \"Christianity\" hanging out there to be recognised by anyone with a mind to. It's all filtered through tradition and dogma, picked over, selected, rejected by individuals or churches. No one Christianity is more true than any other.\n \n There are many facets to Christianity, some neutral, some good, and some bad. A lot of what we see when many Christian churches preach about gays are the bad facets, which are just as Christian scripturally and traditionally as the good. So I get a little jaded when a Christian apologist attempts to explain away the sometimes dubious activities of some Christian church or other by saying, \"Oh, but they aren't real Christians!\" They are as real as the Christian apologist.\n \n The late pope, JPII, gave an analogous example in his \"apology\" to the Jews: It wasn't \"the Church\" to blame, it was individual Christians who didn't live up to tradition and doctrine. What he meant, though he'd never admit it, was that he disagreed with the selections his predecessors made, and so tried to gloss over the fact it was the tradition and doctrine that was at fault. Earlier Christians were simply paying attention to different parts of it than JPII would have preferred.\n \n If you buy Christianity as preached by some church, you have to buy the whole thing, good and bad. If you want to excise the bad and keep the good, then what you have left is no longer Christianity, and no longer a church. It's a selection of beliefs drawn from the Christian menu, according to personal wishes and prejudices.\n \n While I think that's the only rational approach to a set of beliefs as odd as Christianity, which encompasses everything from good but mundane daily behaviour to the most incredible supernatural claims, it would be better if more Christians were willing to admit that's what they were doing: choosing some beliefs over others, rather than claiming that those who make a different selection aren't \"real\".\n\n \n How true. being brought up very christian and baptist I can attest to the all or none type of belief system you speak of. Always a fiery speech on sunday I used to be scared at church when I was little when I heard about hell and eternal damnation. \n \n Also my mom thought of homosexuality as sick and other views as well. I havnt come out to my parents but I think he ropinion has changed and shes very intuative and I think she knows I'm gay. But regardless, Having a complex and guiling yourself and thinking your going to hell cause your gay is so self destructive and horrid, especially whne young gays are kicked out of their homes as teenagers and are thrown into a hellish life. No one should be trated like that and anyone who claims to be christian or any religion and does that to their child is such a hypocrite and horrible they should be shunned by parents everywhere.", 
   {}, 
   315877, 
   null, 
   1215610560.0
  ], 
  [
   315910, 
   null, 
   "iangb", 
   "Predicting that this Godless crowd that hates anything good and righteous will disagree with me is pretty much no brainer.\nFar be it from me to suggest that you have no brain, but I do agree with your statement.\n \n Beside, it's true that every truth we hear, whether we accept it as truth or not, we will be held accountable for at the judgement.\n\n No, you believe that 'every truth we hear... [etc]'. You're missing out on the vital step again - that what you believe isn't necessarily true. You certainly miss the point that what you believe to be true holds no argumentative value over those who disagree with you unless you can persuade them that you are correct. Merely making self-fulfilling prophecies and repeating 'i know this to be true' is just persuasive to yourself, but to no-one else...\n \n You also missed a bit of my post -\n \nCare to respond to your own precedent of awesomeness yet?\n\n \n \nAll you have to do is die robbie and the proof will be known to you immediately. You will instantaneously know how wrong your life choices have been. And you will instantaneously know that they were CHOICES that you had, and that you freely made.\nCare to prove that this is true?\n \n If you keep asking this question, I predict that at some point Archie's responses will loop back upon themselves. Possibly at the point where we get to asking for proof that the bible/god's word is 'true'.", 
   {}, 
   315880, 
   null, 
   1215624180.0
  ], 
  [
   316134, 
   null, 
   "lesz", 
   "How true. being brought up very christian and baptist I can attest to the all or none type of belief system you speak of. Always a fiery speech on sunday I used to be scared at church when I was little when I heard about hell and eternal damnation. \n \n Also my mom thought of homosexuality as sick and other views as well. I havnt come out to my parents but I think he ropinion has changed and shes very intuative and I think she knows I'm gay. But regardless, Having a complex and guiling yourself and thinking your going to hell cause your gay is so self destructive and horrid, especially whne young gays are kicked out of their homes as teenagers and are thrown into a hellish life. No one should be trated like that and anyone who claims to be christian or any religion and does that to their child is such a hypocrite and horrible they should be shunned by parents everywhere.\n\n \n I have no good advice to give anyone about coming out to parents, especially those of the hardcore Christian persuasion. I never came to mine -- I lived on a different continent by the time that became an issue, and it was just easier not to deal with it at all. I'm not saying that was the right thing to do, but it was expedient.\n \n The question is probably most difficult for gays who are still dependent on their parents. Some Christian parents will disown and kick out their gay child, while others wil make their home life even more unbearable. Few will be understanding, let alone welcoming or happily accepting. It is, after all, a potential disappointment for any parent invested in having a grandchild, and as even the best-intentioned of parents know how homophobic society is, they fear for the safety of their gay child.\n \n On the other hand, secrets are corrosive to any close relationship. If you can't tell your parents, staying close to them in the long run is, to say the least, difficult. It has been managed, obviously, and often there exists a don't ask-don't tell detente between parent and offspring. Parents are skilled at not seeing what they don't want to see, even if it's right in front of them. That is hardly close, though.", 
   {}, 
   315880, 
   null, 
   1215695640.0
  ], 
  [
   316137, 
   null, 
   "Matthew S", 
   " Always a fiery speech on sunday I used to be scared at church when I was little when I heard about hell and eternal damnation. \n \n \n\n \n Right there Archangel is living proof that your type of fundamentalist churches teach fear. What would Jeaus say? To scare a little child. You will not find scared children in a lutheran church.", 
   {}, 
   315880, 
   null, 
   1215696120.0
  ], 
  [
   316146, 
   null, 
   "jazyjason", 
   "I have no good advice to give anyone about coming out to parents, especially those of the hardcore Christian persuasion. I never came to mine -- I lived on a different continent by the time that became an issue, and it was just easier not to deal with it at all. I'm not saying that was the right thing to do, but it was expedient.\n \n The question is probably most difficult for gays who are still dependent on their parents. Some Christian parents will disown and kick out their gay child, while others wil make their home life even more unbearable. Few will be understanding, let alone welcoming or happily accepting. It is, after all, a potential disappointment for any parent invested in having a grandchild, and as even the best-intentioned of parents know how homophobic society is, they fear for the safety of their gay child.\n \n On the other hand, secrets are corrosive to any close relationship. If you can't tell your parents, staying close to them in the long run is, to say the least, difficult. It has been managed, obviously, and often there exists a don't ask-don't tell detente between parent and offspring. Parents are skilled at not seeing what they don't want to see, even if it's right in front of them. That is hardly close, though.\n\n \n \n Yeah it's a very scary subject cause I love my parents so much.", 
   {}, 
   316134, 
   null, 
   1215698100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Christian Site's Ban on 'G' Word Sends Homosexual to Olympics", 
  "url": "http://www.4forums.com/political/gay-rights-debates/11355-christian-sites-ban-g-word-sends-homosexual-olympics.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 11355, 
  "discussion_files": [
   [
    "16058.html", 
    "http://www.4forums.com/political/gay-rights-debates/11355-christian-sites-ban-g-word-sends-homosexual-olympics-print.html"
   ], 
   [
    "16059.html", 
    "http://www.4forums.com/political/gay-rights-debates/11355-christian-sites-ban-g-word-sends-homosexual-olympics-4-print.html"
   ], 
   [
    "16060.html", 
    "http://www.4forums.com/political/gay-rights-debates/11355-christian-sites-ban-g-word-sends-homosexual-olympics-3-print.html"
   ], 
   [
    "16061.html", 
    "http://www.4forums.com/political/gay-rights-debates/11355-christian-sites-ban-g-word-sends-homosexual-olympics-2-print.html"
   ]
  ], 
  "identifier": 11355
 }
]