[
 [
  [
   315544, 
   null, 
   "MrWriteLA", 
   "http://www.huffingtonpost.com/2008/07/07/study-military-gays-dont-_n_111296.html \nWASHINGTON - Congress should repeal the \"don't ask, don't tell\" law because the presence of gays in the military is unlikely to undermine the ability to fight and win, according to a new study released by a California-based research center.\n \n The study was conducted by four retired military officers, including the three-star Air Force lieutenant general who in early 1993 was tasked with implementing President Clinton's policy that the military stop questioning recruits on their sexual orientation.\n \n \"Evidence shows that allowing gays and lesbians to serve openly is unlikely to pose any significant risk to morale, good order, discipline or cohesion,\" the officers states.\n \n To support its contention, the panel points to the British and Israeli militaries, where it says gay people serve openly without hurting the effectiveness of combat operations.\n \n Undermining unit cohesion was a determining factor when Congress passed the 1993 law, intended to keep the military from asking recruits their sexual orientation. In turn, service members can't say they are gay or bisexual, engage in homosexual activity or marry a member of the same sex.\n \n Supporters of the ban contend there is still no empirical evidence that allowing gays to serve openly won't hurt combat effectiveness.\n \n \"The issue is trust and confidence\" among members of a unit, said Lt. Col. Robert Maginnis, who retired in 1993 after working on the issue for the Army. When some people with a different sexual orientation are \"in a close combat environment, it results in a lack of trust,\" he said.\n \n The study was sponsored by the Michael D. Palm Center at the University of California at Santa Barbara, which said it picked the panel members to portray a bipartisan representation of the different service branches. According to its Web site, the Palm Center \"is committed to keeping researchers, journalists and the general public informed of the latest developments in the 'don't ask, don't tell' policy debate.\"\n \n Two of the officers on the panel have endorsed Democratic candidates since leaving the military _ Army Lt. Gen. Robert Gard, who supports Barack Obama, and Marine Corps Gen. Hugh Aitken, who backed Clinton in 1996.\n \n Air Force Lt. Gen. Robert Minter Alexander, a Republican, was assigned in 1993 to a high-level panel established by the Defense Department to examine the issue of gays in the military. At one point, he signed an order that prohibited the military from asking a recruit's sexual orientation.\n \n Alexander said at the time he was simply trying to carry out the president's orders and not take a position. But he now believes the law should be repealed because it assumes the existence of gays in the military is disruptive to units even though cultural attitudes are changing.\n \n Further, the Defense Department and not Congress should be in charge of regulating sexual misconduct within the military, he said.\n \n \"Who else can better judge whether it's a threat to good order and discipline?\" Alexander asked.\n \n Navy Vice Adm. Jack Shanahan said he had no opinion on the issue when he joined the panel, having never confronted it in his 35-year military career. A self-described Republican who opposes the Bush administration's handling of the Iraq war, Shanahan said he was struck by the loss of personal integrity required by individuals to carry out \"don't ask, don't tell.\"\n \n \"Everyone was living a big lie _ the homosexuals were trying to hide their sexual orientation and the commanders were looking the other way because they didn't want to disrupt operations by trying to enforce the law,\" he said.\n", 
   {
    "post_info": {
     "post_title": "Study: Military Gays Don't Undermine Unit Cohesion"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1215474840.0
  ], 
  [
   315553, 
   null, 
   "foundit66", 
   "One annoying aspect of all this is the \"self-fulfilling prophecy\" nature of the situation.When some people with a different sexual orientation are \"in a close combat environment, it results in a lack of trust,\" he said.If you stick a black person with a bunch of anti-black racists, and then you walk away, you're probably going to have problems. The solution is not to eliminate the black person.\n But if the problem is gays and not blacks, somehow the solution supposedly is to eliminate the gays...\n \n The military is supposedly priding itself on \"discipline\". Yet the complaint we see here is that people are going to dislike gays in their presence, and the military is going to do nothing to ensure that people do their jobs.\n \n The homophobes don't trust the gays, and therefore they can say \"it results in a lack of trust\".\n The real solution is to tell the military members, \"You've got a bleeping job to do. You're paid to do that job. You're doing it for your country. If you can't put your job ahead of your own personal insecurities, then you don't belong here.\"\n \n Would you allow racists to say \"we don't trust the blacks\", and then perpetuate the black segregation policy? Noooo...\n \n The fact that they so readily repeat the same excuses historically used against blacks (and the same sequence of excuses) demonstrates how artificial and self-serving their complaints truly are.\n \n There is a LONG list of countries which have integrated gays into their militaries.\n There is a LONG list of U.S. military examples of gays who were essentially \"out\". Darren Manzella is one good example of somebody who was \"out\" in the military, and the military didn't care. He wasn't creating \"distrust\" amongst his peers.\n But when he went on 60 minutes and put a face to the problem, EXPOSING the military's facade excuse, THAT is when he got kicked out. Not for problems within the \"unit\", but rather because he embarrassed the military...\n \n In the real world if two people cause a problem at work, you investigate the WHOLE situation and assess the situation regarding BOTH of the individuals. But in the military, the \"gay\" person is kicked out JUST cause he's gay, REGARDLESS of whether or not any problem actually exists.\n \n Excluding gays in the military is just one of many examples of how the anti-gay homophobic members of the right-wing are imposing prejudice without reason.", 
   {}, 
   315544, 
   null, 
   1215478260.0
  ], 
  [
   315898, 
   null, 
   "jazyjason", 
   "I'm gay and in the military and it didnt affect anyone around me. At least in work ethic and morale.", 
   {}, 
   315553, 
   null, 
   1215616260.0
  ], 
  [
   320421, 
   null, 
   "foundit66", 
   "I found this interesting...\n Evidently while we kick out about 60 Arabic military linguists, when we're in wars where we heavily NEED them, and now there's another demonstration of how much we need what our military has willingly thrown away due to prejudice...\n The Army may begin paying a retention bonus of as much as $150,000 to Arabic speaking soldiers in reflection of how critical it has become for the US military to retain native language and cultural know-how in its ranks.\n \n Only one other job in the Army, Special Forces, rates such a super-sized retention bonus. Now, as the military makes a fundamental shift toward rewarding the linguistic expertise it needs the most, it is expanding a program to train and retain native Arabic and other speakers from the same regions in which it is fighting.http://news.yahoo.com/s/csm/20080805/ts_csm/atranslate\n \n But the following guys who were PREVIOUSLY doing the job?\n Evidently not that \"critical\"...\n http://www.nytimes.com/2007/06/08/opinion/08benjamin.html", 
   {}, 
   315898, 
   null, 
   1218836340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Study: Military Gays Don't Undermine Unit Cohesion", 
  "url": "http://www.4forums.com/political/gay-rights-debates/11354-study-military-gays-dont-undermine-unit-cohesion.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 11354, 
  "discussion_files": [
   [
    "13967.html", 
    "http://www.4forums.com/political/gay-rights-debates/11354-study-military-gays-dont-undermine-unit-cohesion-print.html"
   ]
  ], 
  "identifier": 11354
 }
]