[
 [
  [
   315905, 
   null, 
   "jazyjason", 
   "I posted something very sensitive to me and I wanted peoples input. I'm not accusing Archie of anything but I feel that he took what I posted out of context. I am just showing an example of what people go through for who they are, and just how horrible some people can be and why we need to have proper legislature to protect others against this kind of hate\n \n http://www.4forums.com/political/showthread.php?t=11306&page=22\n \n its the 14th post down.", 
   {
    "post_info": {
     "post_title": "Your Thoughts Please"
    }
   }, 
   null, 
   null, 
   1215621420.0
  ], 
  [
   315911, 
   null, 
   "iangb", 
   "Archie's response to this was definitely out of line.\n \nI'm sorry about your attack, truly. But do you think you're the only person that has ever been attacked by a group?\n ...\n Are you sure you didn't want out and created a scenario that allowed you to become a victim and sue the military on your way out?\n\n \n Not good. Not good at all.", 
   {}, 
   315905, 
   null, 
   1215624720.0
  ], 
  [
   315930, 
   null, 
   "JimStPete", 
   "I posted something very sensitive to me and I wanted peoples input. I'm not accusing Archie of anything but I feel that he took what I posted out of context. I am just showing an example of what people go through for who they are, and just how horrible some people can be and why we need to have proper legislature to protect others against this kind of hate\n \n http://www.4forums.com/political/showthread.php?t=11306&page=22\n \n its the 14th post down.\n\n \n Jason, first off, you can bet that Archie is another Republican Chicken Hawk (never served in the armed forces but is gung ho for homos and everyone else to go die in Iraq for oil and people that didn't want our 'help' in the first place). As if comparing a random mugging on the street to what happened to you as being the same thing just shows how bigoted he is when it comes to issues that gays face every day. He even compared what we go through to his being teased for being middle eastern in grade school and totally misses the fact that he could run home to mommy and tell her what happened to him so that he could get some support, UNLIKE US!!!! What you need to do is ignore the poser (that's all he is). This so called Christian that claims to have the so called holy spirit in him is nothing but a nasty hateful person, not a christian at all. I wonder if it is the holy spirit calling Hillary Clinton 'Hillbilly' or Archie? I wonder if it is the holy spirit bragging about his sexual prowess or Archie? You joined the military willingly knowing full well that you will continue to have to lie about who you are in order to risk your life to fight for your country. You're a good man! I haven't heard anyone other than Archie/holy spirit say such nasty ugly things to you on here. Don't let the loon tear you down. Ignore him.", 
   {}, 
   315905, 
   null, 
   1215629160.0
  ], 
  [
   315940, 
   null, 
   "Archangel", 
   "I posted something very sensitive to me and I wanted peoples input. I'm not accusing Archie of anything but I feel that he took what I posted out of context. I am just showing an example of what people go through for who they are, and just how horrible some people can be and why we need to have proper legislature to protect others against this kind of hate\n \n http://www.4forums.com/political/showthread.php?t=11306&page=22\n \n its the 14th post down.\n\n \n So now you're starting a complete bitch thread in order to make yourself a bigger victim? And you're asserting that I have further victimized you by asking for clarifications about your story which you didn't share originally? Am I supposed to understand and believe everything you say just on its face, because you said it? For all I, or any of us know for certain, this whole story could be a complete work of fiction jason, in other words, a LIE. Did you hook up a polygraph when you turned your computer on so that we get proof that what you have said is true? As far as I'm concerned, since you're taking this tack, all you've done is tell a story today. I have no reason to actually believe it's true or that it happened to you.\n \n What evidence have you posted to support what you have said? Would you be the first person on the internet to completely make something up or twist the facts in order to look like a completely innocent victim, when you actually played a key role in causing what happened to happen? If it happened at all?\n \n Post an article, a medical record, or some documented evidence that this attack took place, that it actually happened to you, and that you didn't bring it on yourself, if it did somehow, if you don't want any follow up questions at all. Otherwise, my questions were absolutely valid and all you have proven by once again trying to play the poor little victim is that you're way too big of a sniveling little wimp to actually, really be serving in the armed forces of this great country, so now I completely doubt that claim from your story. You're probably a wannabe who couldn't pass the tests so now you claim it cuz it makes you feel important in your small mind. Grow up jason!!! And realize where you are. This is a debate forum, not a sworn confessional where we must accept whatever is said as absolute truth. So you have your bitch session, I've said my piece on this issue.", 
   {}, 
   315905, 
   null, 
   1215630900.0
  ], 
  [
   315941, 
   null, 
   "Kronus", 
   "My opinion of Archie just sank even lower. I didn't think that was possible, but there you go.", 
   {}, 
   315940, 
   null, 
   1215631620.0
  ], 
  [
   315942, 
   null, 
   "GazzaElliott", 
   "So now you're starting a complete bitch thread in order to make yourself a bigger victim? \n\n \n Jealous that we might actually have someone who's got a reason to feel persecuted?\n \n \nAnd you're asserting that I have further victimized you by asking for clarifications about your story which you didn't share originally? Am I supposed to understand and believe everything you say just on its face, because you said it?\n \n \n You expect us to believe your \"holy spirit\" stories (those a so-called mark rather than a quote mark) on the same basis...\n \n \nI have no reason to actually believe it's true or that it happened to you.\n\n \n What reason does he have to lie? I know you're egocentric enough to believe it's all for your benefit, bu 4-forums is hardly the place to come to gain mass sympathy.\n \n \nIf it happened at all?\n\n \n Where's your empathy? I thought that was a basic tennet of Xian belief?\n \n \nPost an article, a medical record, or some documented evidence that this attack took place, that it actually happened to you, and that you didn't bring it on yourself, if it did somehow, if you don't want any follow up questions at all. \n\n \n So this person claims to have been attacked, and you reckon it didn't happen, and if it did it's all his fault. I'm betting (though you'll deny it) that if Jason was a straight bloke who'd been attacked by 4 gay guys, or if he was an evangelical who'd been attacked by 4 atheists you'd be screaming to high heaven. Both scenarios are however unlikely... Wonder why?\n \n \nOtherwise, my questions were absolutely valid\n\n \n Asking details is fine. Accusations of lieing are not....\n \n \n and all you have proven by once again trying to play the poor little victim is that you're way too big of a sniveling little wimp to actually, really be serving in the armed forces of this great country, so now I completely doubt that claim from your story.\n \n \n a) America is no more a great country than any other....\n b) The fact he volunteered to join up means he's brave. Do you serve?\n \n \nYou're probably a wannabe who couldn't pass the tests so now you claim it cuz it makes you feel important in your small mind. Grow up jason!!! And realize where you are. \n\n \n I reckon people must recognise you in the street because your head is haped like a projector. You do it so much I can only assume morphological similarity....\n \n \nThis is a debate forum, not a sworn confessional where we must accept whatever is said as absolute truth.\n\n \n And yet you scream whenever people don't accept your bullswipe about how good a Xian you are. Most of us are prepared to extend the benefit of the doubt to people. It's just that you have used up all of your credit. \n \n I have to admit Archie that I used to think that you were just a bit zealous, but that buried under it all was a person. I'm now convinced (not just by this) that you're rotten to the core, and should be held up as an example of what happens when religion is taken too far.", 
   {}, 
   315940, 
   null, 
   1215632100.0
  ], 
  [
   315944, 
   null, 
   "sinjin", 
   "So now you're starting a complete bitch thread in order to make yourself a bigger victim? And you're asserting that I have further victimized you by asking for clarifications about your story which you didn't share originally? Am I supposed to understand and believe everything you say just on its face, because you said it? For all I, or any of us know for certain, this whole story could be a complete work of fiction jason, in other words, a LIE. Did you hook up a polygraph when you turned your computer on so that we get proof that what you have said is true? As far as I'm concerned, since you're taking this tack, all you've done is tell a story today. I have no reason to actually believe it's true or that it happened to you.\n \n What evidence have you posted to support what you have said? Would you be the first person on the internet to completely make something up or twist the facts in order to look like a completely innocent victim, when you actually played a key role in causing what happened to happen? If it happened at all?\n \n Post an article, a medical record, or some documented evidence that this attack took place, that it actually happened to you, and that you didn't bring it on yourself, if it did somehow, if you don't want any follow up questions at all. Otherwise, my questions were absolutely valid and all you have proven by once again trying to play the poor little victim is that you're way too big of a sniveling little wimp to actually, really be serving in the armed forces of this great country, so now I completely doubt that claim from your story. You're probably a wannabe who couldn't pass the tests so now you claim it cuz it makes you feel important in your small mind. Grow up jason!!! And realize where you are. This is a debate forum, not a sworn confessional where we must accept whatever is said as absolute truth. So you have your bitch session, I've said my piece on this issue.\nFunny how all your claims of spiritual wisdom are immune to similar scrutiny. You're a disgrace.", 
   {}, 
   315940, 
   null, 
   1215633120.0
  ], 
  [
   315945, 
   null, 
   "foundit66", 
   "jazyjason,\n \n I doubt you need this advice, but DO NOT give any personal information to Archie.\n \n He only believes what he wants to, and disbelieves anything that is inconvenient. The only reason he doubts you is because it's inconvenient for him to face the bigotry that is out there.\n \n I am sorry for your attack. We had a transfer to the boat that was moved from his previous boat due to harassment. The CO did the responsible thing and told the entire boat that harassment would not be tolerated. People were to do their job, and if they couldn't then the appropriate action would be taken against the person who was causing the problem.\n I later found out that people \"suspected\" the guy being transferred of being gay.\n \n I have often wondered how much grief and heart-ache I avoided by being an officer who was gay, instead of enlisted.\n \n People like Archie are ignorant, and they prefer it that way.\n They will scream and shout that people are being \"anti-Christian\" over the most trivial of opinion disputes, but during an actual assault they will bend over backwards to give the assailants the benefit of the doubt.\n As you can see, he's already alleging you're lying, which is hilarious considering how many lies Archie has been busted for.\n \n He was way out of line for his ridiculous speculation, and he continues to lash out cause he doesn't like the implications of what you experienced. It's a completely selfish way of thinking, and THAT is the reason he wants to discredit you.\n \n Regards,\n Foundit66", 
   {}, 
   315942, 
   null, 
   1215633300.0
  ], 
  [
   315946, 
   null, 
   "thelmoose", 
   "Agree with above. \n Archie has slithered to a new low.\n If anything positive is to be gained from this pustule of a person's behavior, it is watching his predictable scrambling from here on, as he struggles to save face while sinking deeper with each pathetic attempt. It is grotesquely humorous. \n Condolences to jazy.", 
   {}, 
   315942, 
   null, 
   1215633480.0
  ], 
  [
   315950, 
   null, 
   "T.Q", 
   "Just when you think your opinion of someone can't sink any lower...\n \n The nice thing about \"debating\" Archie is if you give him enough time, he hangs himself with his own words.\n \n \nIf anything positive is to be gained from this pustule of a person's behavior, it is watching his predictable scrambling from here on, as he struggles to save face while sinking deeper with each pathetic attempt.\n\n You should know better than that by now. Archie will avoid this thread from this point on, and whenever his behaviour here is brought up, he will shout about how we keep making stuff up to make him look bad, and demand we link to it to prove we're not lying. When we've done so, then he'll start trying to scramble before abandoning that thread.", 
   {}, 
   315942, 
   null, 
   1215633900.0
  ], 
  [
   315953, 
   null, 
   "sinjin", 
   "You're all invited to the banning celebration should one be indicated. The Holy Spirit can come too providing it takes a shower.", 
   {}, 
   315950, 
   null, 
   1215634380.0
  ], 
  [
   315976, 
   null, 
   "Archangel", 
   "\n You should know better than that by now. Archie will avoid this thread from this point on, \n\n \n It isn't a matter of avoiding this thread at all tq. I made my point in my post so I see no reason to wallow in the mud with a bunch of anti-christian bigoted hate mongers who wouldn't understand the concept of fair play if their lives depended on it. I'll just let my response to jasons baiting attack thread stand on its own and add only this. Only here with this group of hypocrites would someone be attacked for asking for clarification regarding a story that offers no evidence at all. \n \n And this from the same group that demanded similar evidence from me when I shared spiritual events in my own personal life. Hypocrites, the bunch of you. You wont allow me the same ability to question a poster that you demand for yourselves. emoticon_rolleyes \n \n \nSo now you're starting a complete bitch thread in order to make yourself a bigger victim? And you're asserting that I have further victimized you by asking for clarifications about your story which you didn't share originally? Am I supposed to understand and believe everything you say just on its face, because you said it? For all I, or any of us know for certain, this whole story could be a complete work of fiction jason, in other words, a LIE. Did you hook up a polygraph when you turned your computer on so that we get proof that what you have said is true? As far as I'm concerned, since you're taking this tack, all you've done is tell a story today. I have no reason to actually believe it's true or that it happened to you.\n \n What evidence have you posted to support what you have said? Would you be the first person on the internet to completely make something up or twist the facts in order to look like a completely innocent victim, when you actually played a key role in causing what happened to happen? If it happened at all?\n \n Post an article, a medical record, or some documented evidence that this attack took place, that it actually happened to you, and that you didn't bring it on yourself, if it did somehow, if you don't want any follow up questions at all. Otherwise, my questions were absolutely valid and all you have proven by once again trying to play the poor little victim is that you're way too big of a sniveling little wimp to actually, really be serving in the armed forces of this great country, so now I completely doubt that claim from your story. You're probably a wannabe who couldn't pass the tests so now you claim it cuz it makes you feel important in your small mind. Grow up jason!!! And realize where you are. This is a debate forum, not a sworn confessional where we must accept whatever is said as absolute truth. So you have your bitch session, I've said my piece on this issue.\n", 
   {}, 
   315953, 
   null, 
   1215637020.0
  ], 
  [
   315979, 
   null, 
   "T.Q", 
   "It isn't a matter of avoiding this thread at all tq. I made my point in my post so I see no reason to wallow in the mud with a bunch of anti-christian bigoted hate mongers who wouldn't understand the concept of fair play if their lives depended on it. I'll just let my response to jasons baiting attack thread stand on its own and add only this. Only here with this group of hypocrites would someone be attacked for asking for clarification regarding a story that offers no evidence at all. \n \n And this from the same group that demanded similar evidence from me when I shared spiritual events in my own personal life. Hypocrites, the bunch of you. You wont allow me the same ability to question a poster that you demand for yourselves. emoticon_rolleyes\n\n \n \n Where exactly did you ask for clarification? Was it when you said this:\n \n \nSo now you're starting a complete bitch thread in order to make yourself a bigger victim? \n\n \n or this:\n \n \nAm I supposed to understand and believe everything you say just on its face, because you said it? For all I, or any of us know for certain, this whole story could be a complete work of fiction jason, in other words, a LIE. Did you hook up a polygraph when you turned your computer on so that we get proof that what you have said is true? As far as I'm concerned, since you're taking this tack, all you've done is tell a story today. I have no reason to actually believe it's true or that it happened to you.\n \n\n \n or this:\n \nWould you be the first person on the internet to completely make something up or twist the facts in order to look like a completely innocent victim, when you actually played a key role in causing what happened to happen? If it happened at all?\n\n \n or this:\n \nPost an article, a medical record, or some documented evidence that this attack took place, that it actually happened to you, and that you didn't bring it on yourself, if it did somehow, if you don't want any follow up questions at all.\n\n \n Must have been this part:\n \nall you have proven by once again trying to play the poor little victim is that you're way too big of a sniveling little wimp to actually, really be serving in the armed forces of this great country, so now I completely doubt that claim from your story. You're probably a wannabe who couldn't pass the tests so now you claim it cuz it makes you feel important in your small mind. Grow up jason!!!\n\n \n I don't see any actual questions about anything in there. I see a lot of accusations of lying, I see you saying that if it did happen, he brought it on himself, and I see you calling him a \"sniveling little wimp\", and a \"wannabe\". So take your self-righteous attitude and stick it where the sun don't shine, Sparky.\n \n \nIt isn't a matter of avoiding this thread at all tq. I made my point in my post so I see no reason to wallow in the mud with a bunch of anti-christian bigoted hate mongers who wouldn't understand the concept of fair play if their lives depended on it.\n\n This is a really simple concept-even you should be able to get it. This isn't being \"anti-Christian\". This is being anti-@$$hole. The fact you see that as an attack is telling, isn't it?", 
   {}, 
   315976, 
   null, 
   1215638040.0
  ], 
  [
   315983, 
   null, 
   "MrWriteLA", 
   "What an ugly excuse for a human being.", 
   {}, 
   315976, 
   null, 
   1215638280.0
  ], 
  [
   315992, 
   null, 
   "Archangel", 
   "Where exactly did you ask for clarification?\n\n \n It was here in the original thread .\n \n http://www.4forums.com/political/showpost.php?p=315901&postcount=334\n \n And here's my questions:\n \n [Archangel] The question is jason, with DADT, how did anyone know you are gay? If you had such high SAT scores and such a bright future that you were anticipating in the Military, you would have made sure that you never broke the DADT policy by allowing anyone to know of your sexual proclivities since that policy is enforced, as wrong as that reality is. Are you sure you didn't want out and created a scenario that allowed you to become a victim and sue the military on your way out?\n \n But please, read the linked post as it gives the original conversation in context.", 
   {}, 
   315983, 
   null, 
   1215640140.0
  ], 
  [
   316005, 
   null, 
   "T.Q", 
   "It was here in the original thread .\n \n http://www.4forums.com/political/showpost.php?p=315901&postcount=334\n \n And here's my questions:\n \n [Archangel] The question is jason, with DADT, how did anyone know you are gay? If you had such high SAT scores and such a bright future that you were anticipating in the Military, you would have made sure that you never broke the DADT policy by allowing anyone to know of your sexual proclivities since that policy is enforced, as wrong as that reality is. Are you sure you didn't want out and created a scenario that allowed you to become a victim and sue the military on your way out?\n \n But please, read the linked post as it gives the original conversation in context.\n\n \n Even better-Jason obviously chose to make himself a victim by surreptitously outing himself so he could play the persecution card.\n \n Keep digging Archie.", 
   {}, 
   315992, 
   null, 
   1215641580.0
  ], 
  [
   316007, 
   null, 
   "sinjin", 
   "It was here in the original thread .\n \n http://www.4forums.com/political/showpost.php?p=315901&postcount=334\n \n And here's my questions:\n \n [Archangel] The question is jason, with DADT, how did anyone know you are gay? If you had such high SAT scores and such a bright future that you were anticipating in the Military, you would have made sure that you never broke the DADT policy by allowing anyone to know of your sexual proclivities since that policy is enforced, as wrong as that reality is. Are you sure you didn't want out and created a scenario that allowed you to become a victim and sue the military on your way out?\n \n But please, read the linked post as it gives the original conversation in context.\nhttp://4forums.com/political/showpost.php?p=315935&postcount=338", 
   {}, 
   315992, 
   null, 
   1215641760.0
  ], 
  [
   316052, 
   null, 
   "jazyjason", 
   "So now you're starting a complete bitch thread in order to make yourself a bigger victim? And you're asserting that I have further victimized you by asking for clarifications about your story which you didn't share originally? Am I supposed to understand and believe everything you say just on its face, because you said it? For all I, or any of us know for certain, this whole story could be a complete work of fiction jason, in other words, a LIE. Did you hook up a polygraph when you turned your computer on so that we get proof that what you have said is true? As far as I'm concerned, since you're taking this tack, all you've done is tell a story today. I have no reason to actually believe it's true or that it happened to you.\n \n What evidence have you posted to support what you have said? Would you be the first person on the internet to completely make something up or twist the facts in order to look like a completely innocent victim, when you actually played a key role in causing what happened to happen? If it happened at all?\n \n Post an article, a medical record, or some documented evidence that this attack took place, that it actually happened to you, and that you didn't bring it on yourself, if it did somehow, if you don't want any follow up questions at all. Otherwise, my questions were absolutely valid and all you have proven by once again trying to play the poor little victim is that you're way too big of a sniveling little wimp to actually, really be serving in the armed forces of this great country, so now I completely doubt that claim from your story. You're probably a wannabe who couldn't pass the tests so now you claim it cuz it makes you feel important in your small mind. Grow up jason!!! And realize where you are. This is a debate forum, not a sworn confessional where we must accept whatever is said as absolute truth. So you have your bitch session, I've said my piece on this issue.\n\n \n I'm sorry that you think of me of some sort of liar and just using something to gain sympathy. I'm not. I'm using my own personal experience to voice the injustices of people so that others can take a stand against this kind of hate. Dont you see Archie it's not about gay straight christian jew muslim or anything. It's about the human element. Protecting the rights and freedoms to be human and to express yourself. That is what makes our species so great but its also our greatest fallacy, our achiles heel. We cannot ever hope to gain or to prosper or to have a fellowship of one another if there is this kind of hate.\n \n As for evidence I have my medical record in the car but I dont have a scanner. And I really can't post it because my seperation is still pending and I think it's a little invasion of privacy. I just don't know why you called it a bitch session. I feel really hurt and just alienated now. I'm sorry that I'm gay Archie I'm sorry that because of who I am I forced those 4 people to act because I'm such a threat to national security and to familes everywhere. I guess I am the monster huh? Just be thankful that people are willing to go to such great lengths to protect your freedoms.", 
   {}, 
   315940, 
   null, 
   1215647940.0
  ], 
  [
   316056, 
   null, 
   "sinjin", 
   "Why couldn't you sue the four of them in civil court for violating your civil rights?", 
   {}, 
   316052, 
   null, 
   1215648420.0
  ], 
  [
   316059, 
   null, 
   "jazyjason", 
   "Why couldn't you sue the four of them in civil court for violating your civil rights?\n\n \n Because of the touchiness of the issue and because in the best interest of my safety and mental well being it was deembed by my command to get off the ship and to have no contact with these four individuals ever. The medical reports and eye witness accounts from the MA's who arrested them to the one who saw me with the cuts and bruises were more than enough to court mashall them.", 
   {}, 
   316056, 
   null, 
   1215649020.0
  ], 
  [
   316077, 
   null, 
   "Archangel", 
   "I'm sorry that you think of me of some sort of liar and just using something to gain sympathy. I'm not. I'm using my own personal experience to voice the injustices of people so that others can take a stand against this kind of hate. Dont you see Archie it's not about gay straight christian jew muslim or anything. It's about the human element. Protecting the rights and freedoms to be human and to express yourself. That is what makes our species so great but its also our greatest fallacy, our achiles heel. We cannot ever hope to gain or to prosper or to have a fellowship of one another if there is this kind of hate.\n \n As for evidence I have my medical record in the car but I dont have a scanner. And I really can't post it because my seperation is still pending and I think it's a little invasion of privacy. I just don't know why you called it a bitch session. I feel really hurt and just alienated now. I'm sorry that I'm gay Archie I'm sorry that because of who I am I forced those 4 people to act because I'm such a threat to national security and to familes everywhere. I guess I am the monster huh? Just be thankful that people are willing to go to such great lengths to protect your freedoms.\n\n \n It's nothing more than a bitch session because you felt the need to start a whole thread so you could make an issue of me rather than just respond to me on the thread we were discussing it on. And since you saw the need to demonize me by starting this thread, I saw no reason not to demand evidence that everything you said isn't a blatant lie. That's how it's done on debate forums. People raise issues and post links to support their claims. \n \n You have made your attack about me as this flaming and baiting thread is solid evidence of. I know that there are two sides to every story and would love to know the other half of yours. If your chief looked up your medical records and somehow found out you're gay that way, that still doesn't explain how your crew mates knew for such certainty that you're gay that they came together to attack you like that. There was obviously no doubt in their minds that you are gay.\n \n Now, Im not saying that justifies their attack at all, because it most certainly doesn't. But it begs the question as to how they knew for sure that you are gay. Especially in light of DADT when you know that no one was investigating your back ground to trap you in any way. So all is not as you make it appear, but evidently I'm some kind of insensitive jerk for daring to ask these questions. Well, I'm sorry. But if you can start this baiting, bitch thread and make your attack more about me than about your attack, then i can ask these questions. \n \n And btw, I find your response to sinjin sketchy at best. You have every right to sue them civilly if they have been convicted of this assault, unless there were mitigating circumstances that you didn't want revealed in court that could effect the outcome of course. Only you know that though. But can you tell I'm not feeling very sympathetic for you at this point jason? And until you answer the question as to how these guys knew of your homosexuality with such assurance that they felt justified in attacking you like this, I doubt I will.", 
   {}, 
   316052, 
   null, 
   1215655200.0
  ], 
  [
   316089, 
   null, 
   "Matthew S", 
   "You are wasting your time with Archangel, and fundie type christianists, they either want us in the closet, out of site, or cured. They don't care about us. They say they spread their hatred out of love for us but if they trully cared and loved us the would rejoice in out finding love. They would accept us as children of God. They would be happy that we were gay. If they loved us they would treat us as they want us to treat them.", 
   {}, 
   315905, 
   null, 
   1215658740.0
  ], 
  [
   316096, 
   null, 
   "T.Q", 
   "That's how it's done on debate forums. People raise issues and post links to support their claims. \n\n Great. Post any and all evidence you have that angels have twice protected you. I would expect affadavits from any witnesses, photographic evidence, any physical evidence from the scenes of the encounters, and any polygraph results you have as well.\n \n \nYou have made your attack about me as this flaming and baiting thread is solid evidence of.\n\n Bull. That was you. And the reason you're so angry is you got called on it-by everyone.\n \n \nI know that there are two sides to every story and would love to know the other half of yours. If your chief looked up your medical records and somehow found out you're gay that way, that still doesn't explain how your crew mates knew for such certainty that you're gay that they came together to attack you like that. There was obviously no doubt in their minds that you are gay.\n \n Now, Im not saying that justifies their attack at all, because it most certainly doesn't. But it begs the question as to how they knew for sure that you are gay. Especially in light of DADT when you know that no one was investigating your back ground to trap you in any way.\n\n This has been explained to you about 3-4 times by numerous posters. The fact you're ignoring those posts doesn't help you.\n \n \nBut if you can start this baiting, bitch thread and make your attack more about me than about your attack, then i can ask these questions. \n \n\n Except you never asked any questions, did you? You came here, called Jason a liar, a \"sniveling little wimp\", and a \"wannabe\", and basically stated that even if it did happen, he had it coming. Archie, no matter how much righteous indignation you try and pull out of your XXX, you're in the wrong. Nice try to demonize the guy you attacked though.\n \n \nAnd btw, I find your response to sinjin sketchy at best. You have every right to sue them civilly if they have been convicted of this assault, unless there were mitigating circumstances that you didn't want revealed in court that could effect the outcome of course\n\n Oh, how much did you get when you sued the guys who mugged you?\n You just can't help being an XXX can you? Here you are again insinuating that Jason must be lying or attempting to hide something.\n \n \nBut can you tell I'm not feeling very sympathetic for you at this point jason?\n\n Can you tell what species of pond scum we think you are at this point Archie?\n \n \nAnd until you answer the question as to how these guys knew of your homosexuality with such assurance that they felt justified in attacking you like this, I doubt I will.\n\n Yeah Jason! I mean, it's not like a few good ol' boys with too many drinks under their belt ever went after a guy they thought was gay without proof! Fess up-you were hitting on them, weren't you!? \n \n :xcensored Archie", 
   {}, 
   316089, 
   null, 
   1215660300.0
  ], 
  [
   316124, 
   null, 
   "Archangel", 
   " \n I'm sorry that you think of me of some sort of liar and just using something to gain sympathy. I'm not. I'm using my own personal experience to voice the injustices of people so that others can take a stand against this kind of hate. Dont you see Archie it's not about gay straight christian jew muslim or anything. It's about the human element. Protecting the rights and freedoms to be human and to express yourself. That is what makes our species so great but its also our greatest fallacy, our achiles heel. We cannot ever hope to gain or to prosper or to have a fellowship of one another if there is this kind of hate.\n \n As for evidence I have my medical record in the car but I dont have a scanner. And I really can't post it because my seperation is still pending and I think it's a little invasion of privacy. I just don't know why you called it a bitch session. I feel really hurt and just alienated now. I'm sorry that I'm gay Archie I'm sorry that because of who I am I forced those 4 people to act because I'm such a threat to national security and to familes everywhere. I guess I am the monster huh? Just be thankful that people are willing to go to such great lengths to protect your freedoms.\n\n \n It's nothing more than a bitch session because you felt the need to start a whole thread so you could make an issue of me rather than just respond to me on the thread we were discussing it on. And since you saw the need to demonize me by starting this thread, I saw no reason not to demand evidence that everything you said isn't a blatant lie. That's how it's done on debate forums. People raise issues and post links to support their claims. \n \n You have made your attack about me as this flaming and baiting thread is solid evidence of. I know that there are two sides to every story and would love to know the other half of yours. If your chief looked up your medical records and somehow found out you're gay that way, that still doesn't explain how your crew mates knew for such certainty that you're gay that they came together to attack you like that. There was obviously no doubt in their minds that you are gay.\n \n Now, Im not saying that justifies their attack at all, because it most certainly doesn't. But it begs the question as to how they knew for sure that you are gay. Especially in light of DADT when you know that no one was investigating your back ground to trap you in any way. So all is not as you make it appear, but evidently I'm some kind of insensitive jerk for daring to ask these questions. Well, I'm sorry. But if you can start this baiting, bitch thread and make your attack more about me than about your attack, then i can ask these questions. \n \n And btw, I find your response to sinjin sketchy at best. You have every right to sue them civilly if they have been convicted of this assault, unless there were mitigating circumstances that you didn't want revealed in court that could effect the outcome of course. Only you know that though. But can you tell I'm not feeling very sympathetic for you at this point jason? And until you answer the question as to how these guys knew of your homosexuality with such assurance that they felt justified in attacking you like this, I doubt I will.", 
   {}, 
   316077, 
   null, 
   1215693840.0
  ], 
  [
   316126, 
   null, 
   "jazyjason", 
   "It's nothing more than a bitch session because you felt the need to start a whole thread so you could make an issue of me rather than just respond to me on the thread we were discussing it on. And since you saw the need to demonize me by starting this thread, I saw no reason not to demand evidence that everything you said isn't a blatant lie. That's how it's done on debate forums. People raise issues and post links to support their claims. \n \n You have made your attack about me as this flaming and baiting thread is solid evidence of. I know that there are two sides to every story and would love to know the other half of yours. If your chief looked up your medical records and somehow found out you're gay that way, that still doesn't explain how your crew mates knew for such certainty that you're gay that they came together to attack you like that. There was obviously no doubt in their minds that you are gay.\n \n Now, Im not saying that justifies their attack at all, because it most certainly doesn't. But it begs the question as to how they knew for sure that you are gay. Especially in light of DADT when you know that no one was investigating your back ground to trap you in any way. So all is not as you make it appear, but evidently I'm some kind of insensitive jerk for daring to ask these questions. Well, I'm sorry. But if you can start this baiting, bitch thread and make your attack more about me than about your attack, then i can ask these questions. \n \n And btw, I find your response to sinjin sketchy at best. You have every right to sue them civilly if they have been convicted of this assault, unless there were mitigating circumstances that you didn't want revealed in court that could effect the outcome of course. Only you know that though. But can you tell I'm not feeling very sympathetic for you at this point jason? And until you answer the question as to how these guys knew of your homosexuality with such assurance that they felt justified in attacking you like this, I doubt I will.\n\n \n \n As far as the sueing issue, anything that is dealt with militarily speaking is done through JAG and is either handled at the command level via the commanding Officer and is called a Captain's Mast or under the UCMJ which is in the case of severe crimes are handled under a board at a court marshall. There is no reason for me to have sued them at all because they were already being tried in a military court.\n \n The way they suspected my homosexuality was the way I acted sometimes. And also rumors and such. And I have not attacked you archie I made this thread as a way to get peoples opinion on what happened to me because I knew it would take the other thread off topic. I mentioned you because I questioned if you took my comments out of context. I did not insult you or flame you in any way on this thread but you have insulted me multiple times in this thread and others seeing what you did called you out on it.\n \n And I didnt make this thread to make you look bad at all. I made this thread to gather people's opinions on what happened to me. Your the one with the insults and slanders that created the hole your in.", 
   {}, 
   316077, 
   null, 
   1215694380.0
  ], 
  [
   316140, 
   null, 
   "Archangel", 
   "As far as the sueing issue, anything that is dealt with militarily speaking is done through JAG and is either handled at the command level via the commanding Officer and is called a Captain's Mast or under the UCMJ which is in the case of severe crimes are handled under a board at a court marshall. There is no reason for me to have sued them at all because they were already being tried in a military court.\n \n The way they suspected my homosexuality was the way I acted sometimes. And also rumors and such. And I have not attacked you archie I made this thread as a way to get peoples opinion on what happened to me because I knew it would take the other thread off topic. I mentioned you because I questioned if you took my comments out of context. I did not insult you or flame you in any way on this thread but you have insulted me multiple times in this thread and others seeing what you did called you out on it.\n \n And I didnt make this thread to make you look bad at all. I made this thread to gather people's opinions on what happened to me. Your the one with the insults and slanders that created the hole your in.\n\n \n I'm not in a hole at all jason. The fact that I'm constantly judged and attacked by these atheists and hypocrites is nothing new around here. Since I disagree with all of their shallow and self destructive world views, that is to be expected. But if you were really interested in just getting their thoughts about your attack, then you wouldn't have made it about me at all. So in typical fashion, you are lying in order to appear innocent of creating this attack thread. \n \n And I didn't take your comments out of context at all, I asked probing questions in order to get a more complete picture of what actually happened. Evidently, doing that with a homosexual is considered bad taste in this politically correct setting. And you have just done more harm to the cause of homosexuals than I ever have by saying that they knew you were gay due to the way you acted sometimes. By that do you mean that you're effeminate in your mannerisms? Or that you acted out your homosexuality by making passes at fellow sea men? Do you see how one statement can be interpreted various ways, and require clarification?", 
   {}, 
   316126, 
   null, 
   1215696660.0
  ], 
  [
   316143, 
   null, 
   "JimStPete", 
   "I'm not in a hole at all jason. The fact that I'm constantly judged and attacked by these atheists and hypocrites is nothing new around here. Since I disagree with all of their shallow and self destructive world views, that is to be expected. But if you were really interested in just getting their thoughts about your attack, then you wouldn't have made it about me at all. So in typical fashion, you are lying in order to appear innocent of creating this attack thread. \n \n And I didn't take your comments out of context at all, I asked probing questions in order to get a more complete picture of what actually happened. Evidently, doing that with a homosexual is considered bad taste in this politically correct setting. And you have just done more harm to the cause of homosexuals than I ever have by saying that they knew you were gay due to the way you acted sometimes. By that do you mean that you're effeminate in your mannerisms? Or that you acted out your homosexuality by making passes at fellow sea men? Do you see how one statement can be interpreted various ways, and require clarification?\n\n \n \n You are such a poser!!!! Listen loser, kids in high school that have never had sex are beaten up because they are perceived to be different (i.e. gay). Even though they haven't had sex, they are still beaten up by your little Holy Spirit offspring and the \"Christian\" teachers/administrators stand by and watch and laugh right along with the bullies. You know this full well, so once again, you are a.....here it comes....LIAR! And if he is effeminate, so what? Some straight men are effeminate and get beat up for 'appearing' gay. There is no law against being effeminate which is the way some people just are. And of course you have to project that all gay men have no self control and can not avoid making sexual passes at straight men which is absolutely the dumbest thing I've ever heard (right up there with \"if we allow them to get married, the human race will go extinct because everyone will immediately turn gay!\"). We have no interest in men that are straight because they are straight! Gay men chasing after straight men is as stupid as straight men lusting afer lesbians (they don't want what you have, get over yourself).", 
   {}, 
   316140, 
   null, 
   1215697140.0
  ], 
  [
   316144, 
   null, 
   "jazyjason", 
   "I'm not in a hole at all jason. The fact that I'm constantly judged and attacked by these atheists and hypocrites is nothing new around here. Since I disagree with all of their shallow and self destructive world views, that is to be expected. But if you were really interested in just getting their thoughts about your attack, then you wouldn't have made it about me at all. So in typical fashion, you are lying in order to appear innocent of creating this attack thread. \n \n And I didn't take your comments out of context at all, I asked probing questions in order to get a more complete picture of what actually happened. Evidently, doing that with a homosexual is considered bad taste in this politically correct setting. And you have just done more harm to the cause of homosexuals than I ever have by saying that they knew you were gay due to the way you acted sometimes. By that do you mean that you're effeminate in your mannerisms? Or that you acted out your homosexuality by making passes at fellow sea men? Do you see how one statement can be interpreted various ways, and require clarification?\n\n \n \n I said I was not accusing you of anything I just thought what you said was out of context. The thread is titled your thoughts please. Thoughts about what had happened. So I'm a liar because it's an attack thread? If this were an attack thread the admin would have deleted it and sent a private message rebuking the action. He has not done this so your claim is flase.\n \n How am I cauing harm by stating what happened? I am a finiky person with some effeminate tendancies and being in the macho raw raw raw type environment that the navy is, full of self ego and mascualism on every part, of course my sexuality was questioned because I wasn't going to bars every night getting wasted and chasing tail like everyone else in my division. And of course I never made passes at my shipmates number one because of fratenization policies, two because it is a professional environment and should be treated as such, and three because I had no interest in doing so.", 
   {}, 
   316140, 
   null, 
   1215697140.0
  ], 
  [
   316171, 
   null, 
   "Archangel", 
   "I said I was not accusing you of anything I just thought what you said was out of context. The thread is titled your thoughts please. Thoughts about what had happened. So I'm a liar because it's an attack thread? If this were an attack thread the admin would have deleted it and sent a private message rebuking the action. He has not done this so your claim is flase.\n \n How am I cauing harm by stating what happened? I am a finiky person with some effeminate tendancies and being in the macho raw raw raw type environment that the navy is, full of self ego and mascualism on every part, of course my sexuality was questioned because I wasn't going to bars every night getting wasted and chasing tail like everyone else in my division. And of course I never made passes at my shipmates number one because of fratenization policies, two because it is a professional environment and should be treated as such, and three because I had no interest in doing so.\n\n \n How is this not making this thread about me rather than about your attack by your fellow servicemen? Note the bolded in your OP.\n \n \nI posted something very sensitive to me and I wanted peoples input. I'm not accusing Archie of anything but I feel that he took what I posted out of context. I am just showing an example of what people go through for who they are, and just how horrible some people can be and why we need to have proper legislature to protect others against this kind of hate\n \n http://www.4forums.com/political/showthread.php?t=11306&page=22\n \n its the 14th post down.\n\n \n Do you deny that you're saying that I am why people like you need legislation to protect you from quote, \"horrible people\" like me, and against this kind of hate that you perceive I expressed? So in spite of your lame denials, you made this bitch thread completely about me and about people like me who would dare to question your version of the events that led up to your attack. Not about the attack itself. \n \n And the most obvious evidence of this FACT is that very little has been said on this thread about the attack, yet most every post has been about me. So man up and stop lying for once and admit that you started this thread as a baiting attack thread with no intention of discussing the attack you allegedly suffered. If that were the case in reality you would have, AT LEAST ONCE, asked everyone to get back on track and discuss the issue at hand rather than attack me. But you haven't done that once, have you jason? No, not even once. So stop denying the obvious for once.", 
   {}, 
   316144, 
   null, 
   1215706260.0
  ], 
  [
   316178, 
   null, 
   "jazyjason", 
   "How is this not making this thread about me rather than about your attack by your fellow servicemen? Note the bolded in your OP.\n \n \n \n Do you deny that you're saying that I am why people like you need legislation to protect you from quote, \"horrible people\" like me, and against this kind of hate that you perceive I expressed? So in spite of your lame denials, you made this bitch thread completely about me and about people like me who would dare to question your version of the events that led up to your attack. Not about the attack itself. \n \n And the most obvious evidence of this FACT is that very little has been said on this thread about the attack, yet most every post has been about me. So man up and stop lying for once and admit that you started this thread as a baiting attack thread with no intention of discussing the attack you allegedly suffered. If that were the case in reality you would have, AT LEAST ONCE, asked everyone to get back on track and discuss the issue at hand rather than attack me. But you haven't done that once, have you jason? No, not even once. So stop denying the obvious for once.\n\n \n \n Archie I refered to the attackers as the horrible people because no one should have to go through what I went through. Archie Please your the one who made the thread gravitate toward you with your comments and insults. Like I said if it was a flaming thread towards you the admin would have deleted it. Enough said. Admin sorry for requesting this but could you review the thread to prove to Archie it is not a thread to attack him and if it is, delte it at once. Thank You.", 
   {}, 
   316171, 
   null, 
   1215707520.0
  ], 
  [
   316179, 
   null, 
   "Archangel", 
   "You are such a poser!!!! Listen loser, kids in high school that have never had sex are beaten up because they are perceived to be different (i.e. gay). Even though they haven't had sex, they are still beaten up by your little Holy Spirit offspring and the \"Christian\" teachers/administrators stand by and watch and laugh right along with the bullies. You know this full well, so once again, you are a.....here it comes....LIAR!\n \n \n Hey Jim, feel free to post evidence that born again believers in Jesus attack homosexuals, or even effeminate kids for laughs and that teachers/admins stand by and laugh at it. I would love to see evidence that that happens as a matter of fact. I admit attacks happens of course but I don't believe it's being done by spirit filled kids because I know too many of them, and I know their hearts. And I know they don't hate anyone for being different, or gay or whatever. If you had any understanding of the nature of the indwelling of Gods Holy Spirit, you wouldn't be mocking Him or accusing those whom He indwells as you are. But I must forgive you based on your total and complete ignorance of the nature of God.\n \n \nAnd if he is effeminate, so what? Some straight men are effeminate and get beat up for 'appearing' gay. \n\n \n That's my point jim. They wouldn't have just attacked him for being effeminate. There is a code of military conduct that's drilled into these soldiers from boot camp forward that teaches them to respect each other in spite of their differences. So for these guys to allegedly attack jason completely unprovoked raises valid questions since we aren't privy to both sides of this story. You may be willing to accept his version as complete and 100% true, but I see no reason to since he has every reason to manipulate the facts in his favor.\n \n \n There is no law against being effeminate which is the way some people just are. And of course you have to project that all gay men have no self control and can not avoid making sexual passes at straight men which is absolutely the dumbest thing I've ever heard (right up there with \"if we allow them to get married, the human race will go extinct because everyone will immediately turn gay!\"). We have no interest in men that are straight because they are straight! Gay men chasing after straight men is as stupid as straight men lusting afer lesbians (they don't want what you have, get over yourself).\n\n \n You see, here's where you guys always get it wrong. You attribute things to me which I never even said. Where did I say that there is some law against being effeminate? And where did I say that all gay men have no self control and can't avoid hitting on straight men? Although I have personally been hit on on numerous occasions by gay men in my lifetime, so I know it happens. And as for straight men lusting after lesbians, that's one of the classic fantasies for straight men; to have a threesome with 2 lesbians, so your example leaves much to be desired.\n \n So you see jim, I have every right to have questioned jason regarding the details of his version of what happened to him. He brought it up after all. And you show how incredibly insecure and shallow you are for taking offense and attacking me for asking him to explain himself. And I don't find his explanations credible either, and that too is my right. So if that bothers you then tough.", 
   {}, 
   316143, 
   null, 
   1215708060.0
  ], 
  [
   316184, 
   null, 
   "Archangel", 
   "Archie I refered to the attackers as the horrible people because no one should have to go through what I went through. Archie Please your the one who made the thread gravitate toward you with your comments and insults. Like I said if it was a flaming thread towards you the admin would have deleted it. Enough said. Admin sorry for requesting this but could you review the thread to prove to Archie it is not a thread to attack him and if it is, delte it at once. Thank You.\n\n \n Then why didn't try even once try to get this thread to actually discuss the issue you started it to discuss jason? Doesn't seem credible in the least, does it? But you stick with your lie. I don't care at all.", 
   {}, 
   316178, 
   null, 
   1215708660.0
  ], 
  [
   316185, 
   null, 
   "jazyjason", 
   "\n \n That's my point jim. They wouldn't have just attacked him for being effeminate. There is a code of military conduct that's drilled into these soldiers from boot camp forward that teaches them to respect each other in spite of their differences. So for these guys to allegedly attack jason completely unprovoked raises valid questions since we aren't privy to both sides of this story. You may be willing to accept his version as complete and 100% true, but I see no reason to since he has every reason to manipulate the facts in his favor.\n And I don't find his explanations credible either, and that too is my right. So if that bothers you then tough.\n\n \n Archie you dont understand people are not robots. We being in the military are trained not brainwashed. People carry with them into the military stigmatisms, beliefs, and biased opinions becaus eof how they were raised. Did you also know that in 1944 a sailor was killed by teo other sailords because they thought he was gay? Just because He may or may not have been gay gives the attackers no right to take his life!\n \n And how can you sit here and try to justify or explain and rationalize my attackers thoughts and intentions? Manipulation? Archie I'm sorry but I have been forthright and honest in this delicate and very emotional subject and despite what I have been warned in private messages about sharing personal experiences etc I still felt it was my duty to share this to shed light on this subject no matter how personal or painful. I cannot believe you are so cold.", 
   {}, 
   316179, 
   null, 
   1215708780.0
  ], 
  [
   316186, 
   null, 
   "jazyjason", 
   "Then why didn't try even once try to get this thread to actually discuss the issue you started it to discuss jason? Doesn't seem credible in the least, does it? But you stick with your lie. I don't care at all.\n\n \n ARCHIE I cant force others to post what they do! I asked their opinion on the subject. You gave your opinion, they commented on your opinion. Then it escalated because you didnt like that they were accusing you etc etc etc. That still is no reason to accuse me of setting up some sort of bait thread!", 
   {}, 
   316184, 
   null, 
   1215708900.0
  ], 
  [
   316187, 
   null, 
   "smiley", 
   "Then why didn't try even once try to get this thread to actually discuss the issue you started it to discuss jason? Doesn't seem credible in the least, does it? But you stick with your lie. I don't care at all.\n\n Me thinks the lady doth protest too much.", 
   {}, 
   316184, 
   null, 
   1215708900.0
  ], 
  [
   316380, 
   null, 
   "jitobear", 
   "Archie, your response to this has been pitiful. Thanks for further justification in my choice to steer clear of your damned religion.", 
   {}, 
   316187, 
   null, 
   1215791820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Your Thoughts Please", 
  "url": "http://www.4forums.com/political/gay-rights-debates/11359-your-thoughts-please.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 11359, 
  "discussion_files": [
   [
    "3301.html", 
    "http://www.4forums.com/political/gay-rights-debates/11359-your-thoughts-please-print.html"
   ], 
   [
    "3302.html", 
    "http://www.4forums.com/political/gay-rights-debates/11359-your-thoughts-please-3-print.html"
   ], 
   [
    "3303.html", 
    "http://www.4forums.com/political/gay-rights-debates/11359-your-thoughts-please-2-print.html"
   ]
  ], 
  "identifier": 11359
 }
]