[
 [
  [
   316620, 
   null, 
   "Momento", 
   "I wonder why USA violation of human rights by using of psychoactive weapons is staying unpunished still? I am in the know that Viennese Convention directly forbids using of psychotropic weapons even at convicts! But in Kyrgyzstan there was situation when by American psychoactive weapons (new types of it are being delivered to American military base Manas) a rally of opposition protesters was dispersed! By this way Americans are trying to get full control over independent country to achieve their own geopolitical tasks! I am sure it's time for international community to erect International tribunal to probe thoroughly into American evildoings worldwide not Kyrgyzstan only!", 
   {
    "post_info": {
     "post_title": "I wonder why USA violation of human rights by using of psychoactive weapons is stayin"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1216048500.0
  ], 
  [
   316823, 
   null, 
   "didi", 
   "Hello! I've just got information that makes me think hawks in the Pentagon are right about to dig up the hatchet and start waging a war either against Iran or China. \n The information that makes me think this way is concerning the construction of a most turned-on radar unit in Kyrgyzstan on the territory of U.S. Manas air base. According to what I know, this radar unit is capable of surveying air environment of both Iran and China, as well as other member states of the Shanghai Cooperation Organization. The radar unit is not finished yet. At the current moment it is under construction while its parts come operational one by one and the whole system will be operational in a few months. \n What is especially important to know about the new Manas radar unit, the information it gathers gets promptly delivered to Washington and is used by US experts to adapt actions and foreign policy in regard to the Central Asian countries. And yet, that's not only it. This information is widely used for more effective interference in those counties' domestic affairs, planning and waging a military campaign of the US and its allies against Iran. \n So, now it becomes clear that construction of the Manas radar unit as actually the final stage. Within a few months, there will be war.", 
   {
    "post_info": {
     "post_title": "Washington is sneaking in on China and Iran!"
    }
   }, 
   316620, 
   null, 
   1216222680.0
  ], 
  [
   316828, 
   null, 
   "Archangel", 
   "I wonder why USA violation of human rights by using of psychoactive weapons is staying unpunished still? I am in the know that Viennese Convention directly forbids using of psychotropic weapons even at convicts! But in Kyrgyzstan there was situation when by American psychoactive weapons (new types of it are being delivered to American military base Manas) a rally of opposition protesters was dispersed! By this way Americans are trying to get full control over independent country to achieve their own geopolitical tasks! I am sure it&#8217;s time for international community to erect International tribunal to probe thoroughly into American evildoings worldwide not Kyrgyzstan only!\n\n \n I don't believe you can call this weapon psychoactive as it doesn't attack the brain. It is more like a microwave emitter in that it effects the pain receptors throughout the whole body that is facing it. It forces the crowd to disperse and come no closer to the area being denied them. It will also be effective at a thousand yards distance or more, guaranteeing that escalating violence which results from personal contact with unruly crowds is completely avoided. http://www.sandia.gov/news-center/news-releases/2005/def-nonprolif-sec/active-denial.html I have seen a mounted unit of this device tested and even carrying a 6\" thick mattress didn't prevent the target from being effected by the beam and immediately retreating. And the armored vehicle housing the device was barely visible to the crowd being controlled as it was so far away from them. If you have another type of weapon in mind, feel free to post info on it. But I believe this weapon I have posted on is what you're talking about as it exists and has been completely tested.", 
   {}, 
   316620, 
   null, 
   1216232460.0
  ], 
  [
   316844, 
   null, 
   "Iuris", 
   "Having fun talking to bots, Archie ? emoticon_xgood \n \n I'm rather amazed by the genius and stupidity displayed by their programmers. On one hand, amazing technology, they can maintain whole conversations now. On the other, the writing is still abysmally bad...", 
   {}, 
   316828, 
   null, 
   1216244280.0
  ], 
  [
   316845, 
   null, 
   "Archangel", 
   "Having fun talking to bots, Archie ? emoticon_xgood \n \n I'm rather amazed by the genius and stupidity displayed by their programmers. On one hand, amazing technology, they can maintain whole conversations now. On the other, the writing is still abysmally bad...\n\n \n Do you have any evidence they are bots rather than foreigners with poor english writing skills?", 
   {}, 
   316844, 
   null, 
   1216248360.0
  ], 
  [
   316870, 
   null, 
   "snakespit", 
   "Do you have any evidence they are bots rather than foreigners with poor english writing skills?\n\n \n Right...\n \n Because if it walks like a duck, sounds like a duck, looks like a duck, has feathers like a duck, swims like a duck, lays eggs like a duck, and flies like a duck...obviously it is a gorilla. \n \n But you keep waiting and see how many responses you get.", 
   {}, 
   316845, 
   null, 
   1216264380.0
  ], 
  [
   316871, 
   null, 
   "Penfold", 
   "It certainly has the signs of belonging to the genus Anatidae.", 
   {}, 
   316870, 
   null, 
   1216265940.0
  ], 
  [
   316879, 
   null, 
   "Archangel", 
   "Right...\n \n Because if it walks like a duck, sounds like a duck, looks like a duck, has feathers like a duck, swims like a duck, lays eggs like a duck, and flies like a duck...obviously it is a gorilla. \n \n But you keep waiting and see how many responses you get.\n\n \n All I was asking is if there is any evidence that it's a bot rather than a person with poor english comprehension skills, but now I'd like you to show me how the OP compares at all with a duck? emoticon_frazzled", 
   {}, 
   316870, 
   null, 
   1216285920.0
  ], 
  [
   316881, 
   null, 
   "T.Q", 
   "All I was asking is if there is any evidence that it's a bot rather than a person with poor english comprehension skills, but now I'd like you to show me how the OP compares at all with a duck? emoticon_frazzled\n\n \n Are you sure english is your first language Archie?\n The Duck Test", 
   {}, 
   316879, 
   null, 
   1216291500.0
  ], 
  [
   316883, 
   null, 
   "Another opinion", 
   "Though I am not too familiar with the ways of the bot, it did seem awfully suspicious that Momento has only one post per thread, nearly all of which are opening posts (except for a couple which simply say hello) .... definitely a trend I would attribute to bots. Didi only has one post to his/her/its history. So, I agree that it \"looks like a duck\"...\n \n I am curious to learn more about the ways of bots. In this case, do you think that someone had a message, presumably in another language, and that he then wrote and ran a program to translate the message into a wide variety of languages to then send to a preselected number of web sites as posts? If not, then how do these things work where such forums are concerned? Just curious since I am new to this bot phenomenon.\n \n In the future, AI might get complex enough for bots to actually respond quasi-intelligently to posts. Then, we might find ourselves actually having an argument with a computer...", 
   {}, 
   316881, 
   null, 
   1216306860.0
  ], 
  [
   316885, 
   null, 
   "Penfold", 
   "\n In the future, AI might get complex enough for bots to actually respond quasi-intelligently to posts. Then, we might find ourselves actually having an argument with a computer...\n\n \n Luckily we have the Turing Test to clarify matters. emoticon_xgood", 
   {}, 
   316883, 
   null, 
   1216308180.0
  ], 
  [
   316887, 
   null, 
   "Another opinion", 
   "Luckily we have the Turing Test to clarify matters. emoticon_xgood\n\n Some people's reading comprehension is so poor that it would be hard to tell. :)", 
   {}, 
   316885, 
   null, 
   1216309200.0
  ], 
  [
   316905, 
   null, 
   "Iuris", 
   "Do you have any evidence they are bots rather than foreigners with poor english writing skills?\n\n \n Ye gods... Archie, I just can't believe you... They are bots programmed to disseminate this trash. That's all. All of them freshly created accounts, affirming each other, NEVER answering any actual posts,...", 
   {}, 
   316887, 
   null, 
   1216318800.0
  ], 
  [
   316914, 
   null, 
   "Archangel", 
   "Ye gods... Archie, I just can't believe you... They are bots programmed to disseminate this trash. That's all. All of them freshly created accounts, affirming each other, NEVER answering any actual posts,...\n\n \n He was the 5th poster to this thread. http://www.4forums.com/political/showpost.php?p=235398&postcount=5 Is that normal for a bot? Do you know the answer to that question? You see, my point is that we may think it's a bot, but can you prove it is? You're all acting like it's a no brainer when you have nothing more than your opinions that it is one. And I'm not arguing that it isn't one at all. My question from the beginning has been only if it can be proven.", 
   {}, 
   316905, 
   null, 
   1216321740.0
  ], 
  [
   316917, 
   null, 
   "Another opinion", 
   "He was the 5th poster to this thread. http://www.4forums.com/political/showpost.php?p=235398&postcount=5 Is that normal for a bot? Do you know the answer to that question? You see, my point is that we may think it's a bot, but can you prove it is? You're all acting like it's a no brainer when you have nothing more than your opinions that it is one. And I'm not arguing that it isn't one at all. My question from the beginning has been only if it can be proven.\n\n If you look at the 27 posts that Momento submitted, the great majority of them were first posts. The two posts which were not first posts were simply posts saying hello. Saying hello does not require any response to another post. Bots would have a problem responding to posts. They can just make statements. That seems to be the pattern for Momento, so it strongly supports the idea that he/she/it is a bot.", 
   {}, 
   316914, 
   null, 
   1216323960.0
  ], 
  [
   316930, 
   null, 
   "snakespit", 
   "As far as I'm concerned, it's a BOT until it answers back. \"Momento\" has done nothing to convince me otherwise, which is proof enough for me and most logical people.", 
   {}, 
   316917, 
   null, 
   1216338420.0
  ], 
  [
   316932, 
   null, 
   "Archangel", 
   "If you look at the 27 posts that Momento submitted, the great majority of them were first posts. The two posts which were not first posts were simply posts saying hello. Saying hello does not require any response to another post. Bots would have a problem responding to posts. They can just make statements. That seems to be the pattern for Momento, so it strongly supports the idea that he/she/it is a bot.\n\n \n Well, it's been an interesting discussion about bots if nothing else. And I'll concede that barring any real evidence, it is very possible that Momento is a bot. I must also assume that there is no way for admin to weed these interlopers out and just ban their IP addresses, right?", 
   {}, 
   316917, 
   null, 
   1216339980.0
  ], 
  [
   316960, 
   null, 
   "Iuris", 
   "Problem is: for every bot smashed by the mighty banhammer, another ten take his place. IP banning could work, but not everyone has his own IP, and you can use false IPs, or actually use public computers (schools, libraries,...).\n \n And that's ignoring the zombie computers. The controller cares little for the fate of the zombie computer. That's why one uses bots...", 
   {}, 
   316932, 
   null, 
   1216384560.0
  ], 
  [
   316973, 
   null, 
   "Another opinion", 
   "Well, it's been an interesting discussion about bots if nothing else. And I'll concede that barring any real evidence, it is very possible that Momento is a bot. I must also assume that there is no way for admin to weed these interlopers out and just ban their IP addresses, right?\n\n This has been a learning experience for me as well. I wasn't too familiar with the use of bots in such forums until this thread. I had seen single post posters before but had simply assumed that they were people who liked spouting their opinion with no interest in discussion. It certainly makes sense that such people can distribute their opinion far more widely with bots than by painstakingly sending out each individual post. \n \n As Iuris mentioned in the last post, I can imagine that it would be very difficult to reliably weed out bots. I suppose that, after a pattern is established, then one could more easily recognize a bot and then the administrator could do a test to verify before blocking the bot (example, asking the poster to actually reply to a post or sending him/her/it a message to respond to). Outside of such blocking of established bots, there are mechanisms to limit their use. In this forum, I believe that there was supposed to be a rule that a new poster had to first take part in a few existing threads before starting his/her own thread. For some unknown reason, this rule seems to have been ignored in the case of Momento.", 
   {}, 
   316932, 
   null, 
   1216409580.0
  ], 
  [
   316983, 
   null, 
   "Iuris", 
   "OK, if this really is new:\n \n There's a constant infestation of these things in this forum. They post one post only, usually something along the lines of clumsy russian propaganda (OK, maybe not, but it feels like it. Clumsy accusations, always in the eastern region or pertaining to it, usually the implied viewpoint is that of a Russian (accusations against opponents/competitors, ETC). Often has evil Chechen in it.\n \n Now, they could be alive, paid to disseminate these things, but given their nature, I'd say they are bots. One post, never returns again.\n \n Recently, it seems the algorythms have advanced. The bloody things seem to register several accounts and post a whole thread in collusion.\n \n For examples, take a look at the European forum. I sometimes feel the bloody things' topics outnumber the real ones...", 
   {}, 
   316973, 
   null, 
   1216418700.0
  ], 
  [
   316991, 
   null, 
   "Another opinion", 
   "OK, if this really is new:\n \n There's a constant infestation of these things in this forum. They post one post only, usually something along the lines of clumsy russian propaganda (OK, maybe not, but it feels like it. Clumsy accusations, always in the eastern region or pertaining to it, usually the implied viewpoint is that of a Russian (accusations against opponents/competitors, ETC). Often has evil Chechen in it.\n \n Now, they could be alive, paid to disseminate these things, but given their nature, I'd say they are bots. One post, never returns again.\n \n Recently, it seems the algorythms have advanced. The bloody things seem to register several accounts and post a whole thread in collusion.\n \n For examples, take a look at the European forum. I sometimes feel the bloody things' topics outnumber the real ones...\n\n I took a look at the European forum and, indeed, it is inflitrated with single-post posters - probably bots, as you say. Most of the forums I participate in - abortion, religion, politics, current events, etc. - haven't had much of a bot infestation, if at all, which is why this phenomenon was new to me. It is a pity that there no longer seems to be a rule of new posters posting a few posts within threads before being allowed to post their own thread. It would probably weed out most of the bots.", 
   {}, 
   316983, 
   null, 
   1216423500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I wonder why USA violation of human rights by using of psychoactive weapons is stayin", 
  "url": "http://www.4forums.com/political/politics-debates/11377-i-wonder-why-usa-violation-human-rights-using-psychoactive-weapons-stayin.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 11377, 
  "discussion_files": [
   [
    "12739.html", 
    "http://www.4forums.com/political/politics-debates/11377-i-wonder-why-usa-violation-human-rights-using-psychoactive-weapons-stayin-print.html"
   ], 
   [
    "12740.html", 
    "http://www.4forums.com/political/politics-debates/11377-i-wonder-why-usa-violation-human-rights-using-psychoactive-weapons-stayin-2-print.html"
   ]
  ], 
  "identifier": 11377
 }
]