[
 [
  [
   317281, 
   null, 
   "charlie horse", 
   "At least that's the impression so-called Christianity gives to me. They are alienating themselves en-masse from their own deity, but shout even louder that their own interpretation of scripture is correct.\n \n 1 Cor.1:10 Now I exhort YOU, brothers, through the name of our Lord Jesus Christ that YOU should all speak in agreement, and that there should not be divisions among YOU, but that YOU may be fitly united in the same mind and in the same line of thought... 13 The Christ exists divided...\n \n Matt.12:25, Luke 11:17 A house/kingdom divided cannot stand...\n \n How do Christians reconcile the above scriptures, bearing in mind major issues such as homosexuality, tithing, gay bishops, women clergy, contraception, headship and subjection of wives and households, trinity doctrine, miracles, biblical interpretation/revelation etc?\n \n It seems to me that all Christian demoninations - using evidence from their bible - will be doomed by their own God.", 
   {
    "post_info": {
     "post_title": "God v. Christians"
    }
   }, 
   null, 
   null, 
   1216751160.0
  ], 
  [
   317283, 
   null, 
   "Archangel", 
   "How do Christians reconcile the above scriptures, bearing in mind major issues such as homosexuality, tithing, gay bishops, women clergy, contraception, headship and subjection of wives and households, trinity doctrine, miracles, biblical interpretation/revelation etc?\n \n\n \n It tells me that we are in the end times and many segments of the body of Christ have become corrupted by the lies of this World. But fear not, God has warned us before hand by describing for us the 7 different types of churches that would exist in that time. He first describes their sins, and then describes the penalty for those sins. You can read it here. Revelation 1:19-3:22.", 
   {}, 
   317281, 
   null, 
   1216753980.0
  ], 
  [
   317284, 
   null, 
   "Matthew S", 
   "It tells me that we are in the end times and many segments of the body of Christ have become corrupted by the lies of this World. But fear not, God has warned us before hand by describing for us the 7 different types of churches that would exist in that time. He first describes their sins, and then describes the penalty for those sins. You can read it here. Revelation 1:19-3:22.\n\n \n I say good I would rather burn then have anything to do with those who believe revelation is true.", 
   {}, 
   317283, 
   null, 
   1216754220.0
  ], 
  [
   317285, 
   null, 
   "Archangel", 
   "I say good I would rather burn then have anything to do with those who believe revelation is true.\n\n \n Since you seem to prefer burning to believing almost any part of the bible Matthew, you can pretty much be guaranteed to get your wish. emoticon_cry You have my sincere condolences.", 
   {}, 
   317284, 
   null, 
   1216754700.0
  ], 
  [
   317287, 
   null, 
   "Penfold", 
   "The great one Cthulu will sort them out..... emoticon_xgood", 
   {}, 
   317285, 
   null, 
   1216756920.0
  ], 
  [
   317288, 
   null, 
   "Archangel", 
   "The great one Cthulu will sort them out..... emoticon_xgood\n\n \n It's Cthulhu. You should at least learn how to spell the name of your preferred demon god. http://en.wikipedia.org/wiki/Cthulhu And in case you didn't know it, he is a fictional character. \nCthulhu is a giant fictional being, one of the Great Old Ones in H. P. Lovecraft's Cthulhu Mythos.\n", 
   {}, 
   317287, 
   null, 
   1216758540.0
  ], 
  [
   317289, 
   null, 
   "smiley", 
   "It's Cthulhu. You should at least learn how to spell the name of your preferred demon god. http://en.wikipedia.org/wiki/Cthulhu And in case you didn't know it, he is a fictional character.\n\n A fictional character, you say.\n \n Much like the fictional deity in another book that springs to mind.\n \n Smiley", 
   {}, 
   317288, 
   null, 
   1216758960.0
  ], 
  [
   317293, 
   null, 
   "charlie horse", 
   "You buggers make me laugh. emoticon_xhoho", 
   {}, 
   317289, 
   null, 
   1216760580.0
  ], 
  [
   317297, 
   null, 
   "Penfold", 
   "Woe is me to run up against an expert in the spelling of fictional gods...emoticon_xangel", 
   {}, 
   317293, 
   null, 
   1216762320.0
  ], 
  [
   317313, 
   null, 
   "electrolyte", 
   "It tells me that we are in the end times and many segments of the body of Christ have become corrupted by the lies of this World.\n\n The end has been near for a damn long time now.\n \n \nThe great one Cthulu will sort them out..... emoticon_xgood\nA fictional character, you say.\n \n Much like the fictional deity in another book that springs to mind.\n \n Smiley\n\n emoticon_xhoho emoticon_xagree", 
   {}, 
   317289, 
   null, 
   1216771260.0
  ], 
  [
   317326, 
   null, 
   "Kronus", 
   "It's Cthulhu. You should at least learn how to spell the name of your preferred demon god. http://en.wikipedia.org/wiki/Cthulhu And in case you didn't know it, he is a fictional character.\n\n \n Ok, that's funny on so many different levels I can't even count them! Thanks for the grins, Archie!emoticon_xbye", 
   {}, 
   317288, 
   null, 
   1216774980.0
  ], 
  [
   317330, 
   null, 
   "unkerpaulie", 
   "It tells me that we are in the end times and many segments of the body of Christ have become corrupted by the lies of this World. But fear not, God has warned us before hand by describing for us the 7 different types of churches that would exist in that time. He first describes their sins, and then describes the penalty for those sins. You can read it here. Revelation 1:19-3:22.\n\n So are there any churches left that stick the biblical doctrine 100% and survived the biblical prophecy and haven't been corrupted by lies of the world? If so, how do we find this holy 8th church and sign up?", 
   {}, 
   317283, 
   null, 
   1216776720.0
  ], 
  [
   317333, 
   null, 
   "Shooterandproud", 
   "I don't care what ANY of you say! I have Anubis on my side, and that's all I need! emoticon_xgood.", 
   {}, 
   317330, 
   null, 
   1216777020.0
  ], 
  [
   317376, 
   null, 
   "Ripskar", 
   "Ah yes, the call of Cowthulhu, you'd need to have contracted BSE not be crazy about it. Enjoy your burgers Archie...emoticon_xgood", 
   {}, 
   317333, 
   null, 
   1216812180.0
  ], 
  [
   317419, 
   null, 
   "trebor", 
   "It tells me that we are in the end times and many segments of the body of Christ have become corrupted by the lies of this World. But fear not, God has warned us before hand by describing for us the 7 different types of churches that would exist in that time. He first describes their sins, and then describes the penalty for those sins. You can read it here. Revelation 1:19-3:22.\n\n \n \n \n Yes indeed. I can see the corruption of Christianity RIGHT HERE ON THIS FORUM emoticon_cry Can you imagine that!", 
   {}, 
   317283, 
   null, 
   1216836900.0
  ], 
  [
   317535, 
   null, 
   "Zardoz", 
   " I don't care what ANY of you say! I have Anubis on my side, and that's all I need!\n\n \n I don't need a god.\n \n I AM a god.\n \n \n Zardoz has spoken.\n Obey my words!\n \n \n As to the OP.\n I created such a thread a long while back...'A House Divided'\n Yes, ALL of christianity is damned by it's own stated belief system (as outlined in the bible). It's 100% impossible to follow all of the commands in that book as they are contradictorary.\n Those who self profess a Christian belief...typically just make stuff up and hack the book apart to find the aspects they want their ears tickled with.", 
   {}, 
   317419, 
   null, 
   1216872000.0
  ], 
  [
   317553, 
   null, 
   "Archangel", 
   "So are there any churches left that stick the biblical doctrine 100% and survived the biblical prophecy and haven't been corrupted by lies of the world? If so, how do we find this holy 8th church and sign up?\n\n \n I'm not sure that any denomination exists today that perfectly reflects the original Gospel of Christ, although some full Gospel churches still come close. But if you'll notice, you have never once, ever heard me promote any denomination as the favored church that God would promote. The reason for that is because salvation cannot be found in any church or denomination, but is found only in Christ Himself through a personal relationship. Then He by way of His Holy Spirit which indwells you would guide you to the best church for you according to Gods perfect will for your life. And remember that the church is not a building, but is the body of Christ which is made up of many parts.\n 1Cr 12:11 \n But one and the same Spirit works all these things, distributing to each one individually as He wills.\n 1Cr 12:12 \n For as the body is one and has many members, but all the members of that one body, being many, are one body, so also is Christ.\n 1Cr 12:13 \n For by one Spirit we were all baptized into one body--whether Jews or Greeks, whether slaves or free--and have all been made to drink into[fn3] one Spirit.\n 1Cr 12:14 \n For in fact the body is not one member but many.\n These 7 churches that John wrote about in Revelation are 7 types of churches/major denominations that would exist in these last days. And not just American based churches mind you. The Roman Catholic Church would be one, I'm sure. The Anglican Church and its offshoots would be another. Obviously Churches like the modern Episcopal and Lutheran churches have completely compromised the biblical principles for sound doctrine some years back in favor of stemming off a falling membership. Even the Baptists have abandoned sound doctrine by teaching that the gifts of the spirit as spoken of in Corinthians no longer apply to the church in this generation. \n \n If I was asked what kind of church I would recommend for a new believer, I would say to look for a non denominational church that is full gospel and practices the gifts of the spirit as laid out in the NT. Avoid issues oriented churches as they tend to be led by Pastors who lack good spiritual balance. A church is supposed to lead people to Christ, not convert people to a particular political party or a social agenda such as marching against abortion or homosexuals. It is impossible to draw people to Christ if a church is getting involved in politics and social engineering.", 
   {}, 
   317330, 
   null, 
   1216905840.0
  ], 
  [
   317554, 
   null, 
   "Archangel", 
   "Yes indeed. I can see the corruption of Christianity RIGHT HERE ON THIS FORUM emoticon_cry Can you imagine that!\n\n \n What is so sad trebor is that you, and many like you see wrong as right, and right as wrong, RIGHT HERE ON THIS FORUM. And you aren't even aware of your blindness to the truth. Can you imagine that!", 
   {}, 
   317419, 
   null, 
   1216906260.0
  ], 
  [
   317556, 
   null, 
   "Jo Bennett", 
   "Anglican doctrine is a result of trying to stem falling membership? Really? That's must be why the General Synod of the Church of England voted to ordain women to the episcopate, despite the threats to leave the church from Anglo-Catholics. The church aims to do the right thing. Often that includes following the Biblical encouragement of tolerance of different practice within the church.\n \n If you want to have this discussion, we can clearly number the multitude branches of the baptist and pentecostal movements among the 7, as they have abandoned Christ's church - they abandoned the apostolic succession and hence orthodox Christianity. The church is founded on Christ's promise to Peter - that he would be the rock upon whom the church would be built.", 
   {}, 
   317554, 
   null, 
   1216907760.0
  ], 
  [
   317567, 
   null, 
   "Archangel", 
   "Anglican doctrine is a result of trying to stem falling membership? Really? That's must be why the General Synod of the Church of England voted to ordain women to the episcopate, despite the threats to leave the church from Anglo-Catholics. The church aims to do the right thing. Often that includes following the Biblical encouragement of tolerance of different practice within the church.\n\n \n According to their own link Jo, the anglican church is nothing more than a conglomeration of religious organizations that have very little to do with actually leading anyone to a personal knowledge of Jesus Christ anymore. And since when is it biblical or even Christ like to tolerate activities that are deemed sinful in Gods Word? Or for the church to align itself with cults that have nothing in common with Christ or His teachings at all? \n \n http://www.cofe.anglican.org/about/gensynod/\n \n \nIf you want to have this discussion, we can clearly number the multitude branches of the baptist and pentecostal movements among the 7, as they have abandoned Christ's church - they abandoned the apostolic succession and hence orthodox Christianity. The church is founded on Christ's promise to Peter - that he would be the rock upon whom the church would be built.\n\n \n Didn't I mention the Baptists as having corrupted the doctrines of Christ regarding the gifts of the spirit? You'll not find me defending any denomination in this debate because I believe that most all are flawed to some degree or another in their doctrinal practices today. Again, let me say that the actual and real church of Christ isn't any one denomination or combination of churches at all. But is made up of individual believers who make up the spiritual body of Christ on Earth. God alone knows who are His and who make up His Church. Salvation is found only in Christ, not in any church building anywhere.\n 1Cr 12:12 For as the body is one and has many members, but all the members of that one body, being many, are one body, so also [is] Christ.\n 1Cr 12:27 Now you are the body of Christ, and members individually.", 
   {}, 
   317556, 
   null, 
   1216927740.0
  ], 
  [
   317917, 
   null, 
   "obvious_child", 
   "I don't care what ANY of you say! I have Anubis on my side, and that's all I need! emoticon_xgood.\n\n \n Anubis is a chump. All Hail Enki!", 
   {}, 
   317333, 
   null, 
   1217207280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  God v. Christians", 
  "url": "http://www.4forums.com/political/religion-debates/11399-god-v-christians.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 11399, 
  "discussion_files": [
   [
    "14851.html", 
    "http://www.4forums.com/political/religion-debates/11399-god-v-christians-print.html"
   ], 
   [
    "14852.html", 
    "http://www.4forums.com/political/religion-debates/11399-god-v-christians-2-print.html"
   ]
  ], 
  "identifier": 11399
 }
]