[
 [
  [
   317112, 
   null, 
   "isly ilwott", 
   "http://www.msnbc.msn.com/id/25753541\n \n The recent (and first) time that the SCOTUS ruled on gun control has brought on a move by convicted felons to be given back their right to bear arms.\n \n My opinion is that, just as convicted DUI drivers lose their privilege of driving their potential battering ram, felons that used a gun in commission of the felony for which they were convicted should lose the privilege of bearing a gun. Other felons, such as car thieves, burglars and whomever else can be convicted of felonies without the use of guns might be considered for a reprieve or a complete release from the ownership ban.\n \n The argument of the felons who want their guns back is that they need protection from the criminal element of society just as much now as they did before they were convicted. But I say the convicted DUI driver needs to drive just as much now as he did before getting caught driving under the influence, with that being no excuse to allow him/her back in a car.\n \n I believe the felons who have not used a gun in their felonies should be allowed to have a gun. The ones that did use a gun in their felonies should be told to go pound sand.\n \n What do you believe?\n \n [Please restrict all answers and discussions thereof to the topic of convicted felons and their right to bear arms as citizens of the United States. I do not wish to read of what you think about another poster or his/her opinion, posting habits or chosen philosophies...give me your own.]", 
   {
    "post_info": {
     "post_title": "Felons want their rights back...to carry guns."
    }
   }, 
   null, 
   null, 
   1216576320.0
  ], 
  [
   317113, 
   null, 
   "Omegamon_X", 
   "Criminals can certainly make any claim that they want to, but that doesn't mean they have a snowball's chance in hell of winning a court case or an appeal.", 
   {}, 
   317112, 
   null, 
   1216577640.0
  ], 
  [
   317114, 
   null, 
   "Archangel", 
   "http://www.msnbc.msn.com/id/25753541\n \n The recent (and first) time that the SCOTUS ruled on gun control has brought on a move by convicted felons to be given back their right to bear arms.\n \n My opinion is that, just as convicted DUI drivers lose their privilege of driving their potential battering ram, felons that used a gun in commission of the felony for which they were convicted should lose the privilege of bearing a gun. Other felons, such as car thieves, burglars and whomever else can be convicted of felonies without the use of guns might be considered for a reprieve or a complete release from the ownership ban.\n \n The argument of the felons who want their guns back is that they need protection from the criminal element of society just as much now as they did before they were convicted. But I say the convicted DUI driver needs to drive just as much now as he did before getting caught driving under the influence, with that being no excuse to allow him/her back in a car.\n \n I believe the felons who have not used a gun in their felonies should be allowed to have a gun. The ones that did use a gun in their felonies should be told to go pound sand.\n \n What do you believe?\n \n [Please restrict all answers and discussions thereof to the topic of convicted felons and their right to bear arms as citizens of the United States. I do not wish to read of what you think about another poster or his/her opinion, posting habits or chosen philosophies...give me your own.]\n\n \n I wish they said what Bartons 2 previous felonies were so we could determine if they were violent crimes or not, but just the fact that he's a repeat felon who had the number of weapons he was found with tells me that as a precedent setting case, his chances are probably nill for winning, and rightfully so, in my opinion.", 
   {}, 
   317112, 
   null, 
   1216578540.0
  ], 
  [
   317120, 
   null, 
   "daewoo", 
   "There is supposedly a process in place for felons to have their firearms restriction lifted (at least it is on the books) but the justice department has refused to put it into place in any kind of meaningful manner.\n \n That being the case, I do not think that we should prosecute felons for being in possession of a fire arm. If they put the system in place and then turn down every case put forth for review, then so be it, but IMO the system SHOULD BE in place. \n \n I know this is not a particularly popular viewpoint since \"OMG they are a FELON!!!\" but a lot of things that a decade or two ago were NOT felonies now are...even many victimless crimes can be felonies.", 
   {}, 
   317114, 
   null, 
   1216584420.0
  ], 
  [
   317146, 
   null, 
   "snakespit", 
   "A few thoughts...(without thinking about another poster or his/her opinion, posting habits or chosen philosophies...)\n \n -In all but the most severe cases, DUI drivers get their license back. Usually, DUI carries a penalty of a license suspension, a fine, and the possibility of jail time. While the laws are sure to differ from state to state, it often requires many convictions before a drivers license is revoked for a lifetime. \n \n -Without having actually read the entire supreme court decision, is it possible that SCOTUS meant the ruling to apply to those who are eligible to own guns? \n \n \n...The decision went further than even the Bush administration had sought, but it probably leaves most firearms laws intact. It also struck down Washington's requirement that firearms be equipped with trigger locks or kept disassembled, but it left intact the licensing of guns, and it upheld longstanding prohibitions on the possession of firearms by felons or the mentally ill.\n \n \n \nThe city's attorney general said rules on who could apply for gun licenses would not change - applicants would still be required to be mentally competent adults, and they would still be fingerprinted.\n\n \n \nGun-control advocates, acknowledging the decision as a defeat, pointed to language in the 5-to-4 ruling, written by Justice Antonin Scalia, upholding \"reasonable\" restrictions as their basis for defending gun laws wherever they could. \n\n \n \nBut, Helmke said, \"it's clear that what the court did today is they limited the extremes. You can no longer have near-total prohibitions on guns, but reasonable restrictions on guns.\" \n\n \n -Why would we limit the ban to only those who have used a gun in the commission of a crime? What about those who used a knife, a bomb, or a big pointy stick? The weapon is an irelevent tool. Someone who is willing to stab someone with a knife or blow someone up with a bomb is not someone I want to trust with a gun. \n \n -In my opinion, we need to evaluate individuals on a case by case basis. There is a large difference between someone guilty of forgery and someone guilty of murder.", 
   {
    "unicode_changes_made": true
   }, 
   317120, 
   null, 
   1216594860.0
  ], 
  [
   317149, 
   null, 
   "Penfold", 
   "So redemption is not a possibility? They did their time, paid the penalty, and just want their rights as a citizen returned to them....l", 
   {}, 
   317146, 
   null, 
   1216597260.0
  ], 
  [
   317173, 
   null, 
   "Archangel", 
   "So redemption is not a possibility? They did their time, paid the penalty, and just want their rights as a citizen returned to them....l\n\n \n Here's the legal definition of a felony. http://www.nolo.com/definition.cfm/Term/995A46E4-7FE5-4CEE-8AB42986D38D0F26/alpha/F/\n felony\n \n A serious crime (contrasted with misdemeanors and infractions, less serious crimes), usually punishable by a prison term of more than one year or, in some cases, by death. For example, murder, extortion and kidnapping are felonies; a minor fist fight is usually charged as a misdemeanor, and a speeding ticket is generally an infraction. \n \n The seriousness of a felony is determined to be that because in most all cases they deny other people of their rights, whether it be a robbery, murder or fraud. That's why they forfeit the publics trust to ever own lethal weapons, which guns are.\n \n Maybe some insight into search and seizure law will help us understand since the 4th Amendment was in play regarding the subject of the OP. http://www.nolo.com/article.cfm/catId/3900BEB2-2599-4E9F-B5F09F0DF3E33C7B/objectId/DED24689-ADA8-4785-887A0B4A19A694DE/104/143/ART/", 
   {}, 
   317149, 
   null, 
   1216608420.0
  ], 
  [
   317178, 
   null, 
   "snakespit", 
   "So redemption is not a possibility? They did their time, paid the penalty, and just want their rights as a citizen returned to them....l\n\n \n Sure, redemption is possible and does happen. However, based on recidivism rates throughout the country, I'm not convinced that we should just rubber stamp their right to own or carry a firearm again. \n \n Again, case by case basis.", 
   {}, 
   317149, 
   null, 
   1216615200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Felons want their rights back...to carry guns.", 
  "url": "http://www.4forums.com/political/gun-control-debates/11393-felons-want-their-rights-back-carry-guns.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11393, 
  "discussion_files": [
   [
    "10566.html", 
    "http://www.4forums.com/political/gun-control-debates/11393-felons-want-their-rights-back-carry-guns-print.html"
   ]
  ], 
  "identifier": 11393
 }
]