[
 [
  [
   318569, 
   null, 
   "simone", 
   "And the so-called \"mainstream\" American media is both racist and rightwing.\n \n McCain's little ad featuring Britney Spears (who is Republican) and Paris Hilton (Ditto, her parents gave a bunch of bucks to McCain) and Obama is totally shades of the racist campaign against Harold Ford in Tennessee.\n \n Lily white blonde sexpots. Black man (well, not that black, but black enough). The old irrational hatred of seeing black men with white women.\n \n Remember the Harold Ford thingy?\n \nIn the ad, a young white actress playing the stereotype of a \"dumb blonde\" talks about meeting Ford, a 36-year-old bachelor who is black, \"at the Playboy party.\" At the end of the ad, she winks and says to the camera, \"Harold - call me.\"\n\n http://www.msnbc.msn.com/id/15403071/\n \n John McCain has lined up Terry Nelson to serve as campaign manager. Nelson is the guy who created the anti-Ford ad that provoked racist Tennessee voters to vote for Bob Corker.\n \n Oh, and don't forget about how many times Obama has been called \"arrogant\" after his triumphant travels through Germany and France and England. You know what \"arrogant\" translates into? The old \"uppity N----.\"", 
   {
    "post_info": {
     "post_title": "Yes, Virginia, McCain Is Racist"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1217618760.0
  ], 
  [
   318580, 
   null, 
   "electrolyte", 
   "McCain's little ad featuring Britney Spears (who is Republican) and Paris Hilton (Ditto, her parents gave a bunch of bucks to McCain) and Obama is totally shades of the racist campaign against Harold Ford in Tennessee.\n \n Lily white blonde sexpots. Black man (well, not that black, but black enough). The old irrational hatred of seeing black men with white women.\n\n As much as I hate the XXXXXX running the McCain campaign, I think that regarding this ad as racist is a stretch.", 
   {}, 
   318569, 
   null, 
   1217621220.0
  ], 
  [
   318582, 
   null, 
   "simone", 
   "Have you ever lived or been in the deep South?\n \n And, can you explain how else it was that Harold Ford lost in Tennessee?\n \n McCain's ad was freely splashed over the so-called \"mainstream\" media where millions of racist Americans watched it. Still ready to get het up if they see a black man with white women.\n \n By the way, McCain did not have to spend a dime for all the exposure that ad got.", 
   {}, 
   318580, 
   null, 
   1217622120.0
  ], 
  [
   318593, 
   null, 
   "Archangel", 
   "Have you ever lived or been in the deep South?\n \n And, can you explain how else it was that Harold Ford lost in Tennessee?\n \n\n \n ARE YOU KIDDING ME? Are you lacking all political insight simone, in favor your your knee jerk left wing point of view? Do you actually know anything about Fords standing with his own Tennessee constituency? Not to even mention the black caucus.\n Harold Ford, Jr. put on a spectacle last week for the sake of his own, outsized Senatorial ambitions and to further ingratiate himself to the right wing of the Democratic Party, the same people who have engineered the erosion of progressive politics in the U.S. since the mid-Eighties with their \"new\" and politically bankrupt, warmed-over Republican \"ideas.\" Although Ford's lopsided loss for House Democratic Leader showed that he was never a serious challenger to Nancy Pelosi (CA), who garnered 85% of the vote, the 32 year-old demonstrated that he is a danger to Black political cohesion and a nasty personality, as well.\n \n \"Nancy Pelosi will be a better leader for my candidacy,\" said the graceless grandstander, adding, \"I'm a better person as a result of it.\" Like almost every statement Harold Ford utters, his after-vote remarks were totally devoid of substance.\n \n A chunk of Ford's 29 votes came from his fellow Blue Dogs - southern-based conservative Democrats noteworthy for their similarity to Republicans. However, Ford couldn't even rouse the enthusiasm of a majority of these two and a half dozen good old boys, and the bulk of his corporate-oriented colleagues in the 74-member Democratic Leadership Council faction also took their votes elsewhere. Ford sits on the executive board of the DLC, and apparently took the honorific seriously, initially announcing that he had 63 endorsements in the bag.\n \n That claim also included nine members of the Congressional Black Caucus, which would represent about one-quarter of the CBC's strength. At the last minute, Ford's planned appearance with CBC membership was cancelled, and the final full Democratic Caucus vote was secret. However, it is the Black Caucus and Black political interests in general that were most damaged by Ford's publicity-seeking antics.\n \n The short, sad sideshow\n \n As the tally ultimately demonstrated, Harold Ford's only value to his rightwing friends is to feed the illusion of grave political divisions within Black America. His anemic and insincere leadership gambit - he does not really want to lead House Democrats, but to leave the chamber for the Senate - generated more newsprint than Connecticut liberal Rosa DeLauro's bid to become party caucus chair, the number two elected slot. DeLauro lost out to Rep. Robert Menendez (NJ) by just one vote, the only cliff-hanger of the party reorganization.\n \n Ford captured excessive media attention because he is useful to those who paint pictures of an emerging Black conservative political class. What he really represents is a new class of opportunists who have tapped into historical African American yearnings to see members of the group in high places, no matter how illusory their \"power\" or how faithless their service to Black interests. In this sense, Rep. Ford is an exploiter.\n \n It was no surprise to find Georgia Rep. Denise Majette in front of TV cameras among the clutch of congresspersons seconding Ford's nomination. The press conference was Majette's first major act since defeating Cynthia McKinney with less than 20% of the Black vote, in August - inflicting the Black Caucus with its most non -representative member. But St. Louis Congressman William \"Lacy\" Clay is another, far more disturbing matter. Clay is a member of the Congressional Progressive Caucus as well as the CBC, son of William Clay, Sr., a brilliant and principled Black Caucus founder who served for 32 years in the House. At 36, \"Lacy\" Clay is part of Ford's age cohort, but chronology is not principle. Although Ford's ill-fated sprint toward leadership is characterized in some circles as a \"protest\" against the perceived smothering of youthful legislative aspirations, it is difficult to imagine how such grievances trump Ford's vote for Bush's War and his numerous entanglements with congressional foes of the CBC and PCC. Apparently, \"Lacy\" Clay thinks so.\n \n After the defeat, Ford reported that his father, the House veteran to whom Harold owes his name and his seat, called to say that he was proud of his son. Along with the Hooks family, which spawned former NAACP Executive Director Rev. Benjamin Hooks, the Fords have long been associated with leadership in Black Memphis. Young Harold is not a Trojan Horse, like Denise Majette. He was not lifted from obscurity as a stealth candidate of the rich, white Right, to be hurled as a weapon against established Black leadership. Rather, Ford lays claim to a long legacy - and trashes it, for his own ambitions. People Magazine's choice of Ford as one of the \"50 Most Beautiful People in the World\" notwithstanding, his activities are ugly and dangerous.\n \n It is not the critics of Ford, but his apologists, who fuel division in Black ranks and play into the hands of those who would dismiss African Americans as a splintered and irrelevant political force. Ford's attempts at upward mobility and high visibility are based on outrageous, cynical publicity ploys designed to set him apart from the mainstreams of Black political thought in the eyes of the media. This is the context in which Ford's role in last week's House Democratic reorganization should be understood.http://www.blackcommentator.com/17_commentary.html\n Give It Up, Harold Ford Jr.\n Filed under democrats, election 2006, legislation, state and local by jclifford at 2:10 am\n Things are smelling mighty dirty down in Tennessee, where several Democratic state legislators have been arrested on charges of corruption in relation to a federal sting operation. The politicians, including State Senator John Ford, have been recorded on audiotape and videotape, cooperating with undercover federal agents posing as corporate representatives offering bribes in exchange for pro-business legislation.\n \n John Ford is the uncle and mentor of Congressman Harold Ford Jr., who represents Memphis in the U.S. House of Representatives. Just this week, Harold Ford Jr. announced that he would run to take the place of U.S. Senator Bill Frist when Frist steps down at the end of 2006 in order to prepare for the 2008 presidential election.\n \n Harold Ford Jr. has not been a strong friend of progressives during his tenure in the U.S. House of Representatives. He's flipped and he's flopped, casting votes on issues depending on what way the favored political winds were blowing from. He's said that he supports gay rights, but voted against them on many occasions. Harold Ford Jr. has refused to support H.R. 952, legislation that would make it illegal for the U.S. government to send prisoners held in the United States to foreign countries to be tortured. Congressman Ford has also not supported H.R. 1157, a bill that would revoke sections of the Patriot Act that allow government agents to secretly search through the financial and library records of law-abiding American citizens.\n \n In spite of the fact that he is a Democrat, Congressman Harold Ford Jr. has often stood with George W. Bush. He's provided support to President Bush's attacks on separation of church and state, freedom from cruel and unusual punishment, and protection from unreasonable search and seizure. Harold Ford Jr. has been a shameless self-promoter in the U.S. House of Representatives, trying to make a name for himself by criticizing Democrats for not being Republican enough. Harold Ford Jr. has quickly become the Joseph Lieberman of the U.S. House of Representatives.\n \n No one knows whether Harold Ford Jr. was at all involved in the corrupt activities of his uncle John Ford. So far, no evidence of a direct connection has emerged. However, it's a plain fact that both Congressman Ford and State Senator Ford were part of the same political machine. From a pragmatic standpoint, Harold Ford Jr. is tainted by the ethics scandal that has engulfed John Ford.http://irregulartimes.com/index.php/archives/2005/05/28/harold-ford-junior-scandal/\n \n So the question is, why is a flaming liberal like you not thanking the Republican Party for exposing Ford for the two faced hypocrite that he is as they defeated him in 06? If you had a clue about the truth of the issue being discussed, you wouldn't be complaining at all. \n \n And regarding Barack, he's toast. The American people will never elect an anti American hater who despises what this Country stands for. The Polling numbers show his post primary lead is completely gone and he and Mcain are 1 point apart now.", 
   {
    "unicode_changes_made": true
   }, 
   318582, 
   null, 
   1217624940.0
  ], 
  [
   318594, 
   null, 
   "jim's trucking", 
   "And the so-called \"mainstream\" American media is both racist and rightwing.\n \n McCain's little ad featuring Britney Spears (who is Republican) and Paris Hilton (Ditto, her parents gave a bunch of bucks to McCain) and Obama is totally shades of the racist campaign against Harold Ford in Tennessee.\n \n Lily white blonde sexpots. Black man (well, not that black, but black enough). The old irrational hatred of seeing black men with white women.\n \n Remember the Harold Ford thingy?\n \n http://www.msnbc.msn.com/id/15403071/\n \n John McCain has lined up Terry Nelson to serve as campaign manager. Nelson is the guy who created the anti-Ford ad that provoked racist Tennessee voters to vote for Bob Corker.\n \n Oh, and don't forget about how many times Obama has been called \"arrogant\" after his triumphant travels through Germany and France and England. You know what \"arrogant\" translates into? The old \"uppity N----.\"\n\n \n \nHave you ever lived or been in the deep South?\n \n And, can you explain how else it was that Harold Ford lost in Tennessee?\n \n McCain's ad was freely splashed over the so-called \"mainstream\" media where millions of racist Americans watched it. Still ready to get het up if they see a black man with white women.\n \n By the way, McCain did not have to spend a dime for all the exposure that ad got.\nObama has played the race card already. In this case, it was Obama that turned this issue toward racism.\n \n McCain is not racist. Obama is racist...likely because his preacher/mentor is racist...and his wife is racist. His big supporter, Jesse Jackson is racist. He just can't help it. He comes from a large crowd of racists.\n \n He will be elected because of racism as there are hundreds of thousands who will vote for him just because he's half-black. What an utterly stupid thing to do.\n \n It will likely change the face of the Democratic administration though. Look back at the past administrations and see how many blacks were at key positions when the Dems were in charge. Then look at the blacks in the Repubs cabinet.\n \n Obama's wife will probabaly push for some of her dearest black racist friends to be close to the White House in every way possible...and Louis Farrakhan will be their first guest in the Lincoln bedroom. Talk about RACIST.\n \n We are in for a ride. Hang on.\n \n \n \n I suspect, simone, that you have never really studied the deep south and cannot support your generalization regarding how we treat mixed couples. I am white and was totally raised in the deep south. In mid-life, I was threatened for refusing to join the KKK. One of my dearest friends today, here in the deep-south city of Atlanta is a black man from South Carolina...married to a white woman from South Carolina. So take your stuffy, condescending thoughts and keep them to yourself.\n \n Back in the sixties, my dad mumbled often...when hearing derogatory news casters badmouth the south...that there would be more racial strife in other areas of the country than in the south. He was right. Los Angeles went nuts. Chicago went nuts. That is because we have for a long time in the south accepted blacks on an individual basis, but not as a group. The northerners accepted blacks as a group, but not as individuals. They would scream that the blacks deserve this, that and the other...but would not invite a single black person to their home. Racism is not perculiar to the southern atmosphere...it lives anywhere there are different races existing amongst each other.\n \n Don't condemn the south for what others are more guilty of doing...and don't accuse the wrong guy of being a racist.", 
   {}, 
   318582, 
   null, 
   1217626200.0
  ], 
  [
   319014, 
   null, 
   "simone", 
   "Bob Herbert says it very nicely in the New York Times:\n \nAugust 2, 2008\n Op-Ed Columnist\n Running While Black\n By BOB HERBERT\n Gee, I wonder why, if you have a black man running for high public office &#8212; say, Barack Obama or Harold Ford &#8212; the opposition feels compelled to run low-life political ads featuring tacky, sexually provocative white women who have no connection whatsoever to the black male candidates.....\n \n Now, from the hapless but increasingly venomous McCain campaign, comes the slimy Britney Spears and Paris Hilton ad. The two highly sexualized women (both notorious for displaying themselves to the paparazzi while not wearing underwear) are shown briefly and incongruously at the beginning of a commercial critical of Mr. Obama.\n \n The Republican National Committee targeted Harold Ford with a similarly disgusting ad in 2006 when Mr. Ford, then a congressman, was running a strong race for a U.S. Senate seat in Tennessee. The ad, which the committee described as a parody, showed a scantily clad woman whispering, &#8220;Harold, call me.&#8221;\n \n Both ads were foul, poisonous and emanated from the upper reaches of the Republican Party. (What a surprise.) Both were designed to exploit the hostility, anxiety and resentment of the many white Americans who are still freakishly hung up on the idea of black men rising above their station and becoming sexually involved with white women.\n \n The racial fantasy factor in this presidential campaign is out of control. It was at work in that New Yorker cover that caused such a stir. (Mr. Obama in Muslim garb with the American flag burning in the fireplace.) It&#8217;s driving the idea that Barack Obama is somehow presumptuous, too arrogant, too big for his britches &#8212; a man who obviously does not know his place.\n\n http://www.nytimes.com/2008/08/02/opinion/02herbert.html\n \n Or, translate \"arrogant\" into \"uppity N*****.\"\n \n Or, subtly equate Obama to the anti-Christ for all the \"Left Behind\" fools who believe that crapola.\n \n Racist as Hades.", 
   {}, 
   318594, 
   null, 
   1217883120.0
  ], 
  [
   319029, 
   null, 
   "jim's trucking", 
   "Bob Herbert says it very nicely in the New York Times:\n \n http://www.nytimes.com/2008/08/02/opinion/02herbert.html\n \n Or, translate \"arrogant\" into \"uppity N*****.\"\n \n Or, subtly equate Obama to the anti-Christ for all the \"Left Behind\" fools who believe that crapola.\n \n Racist as Hades.\nThe analogous connection between Obamessiah and the two blonde bimbos is that they are all glitter and no substance...all inexperienced in the important things...all hat and no cattle...vacuum between the ears...(you name it)\n \n It's not racist. It's the truth. Obama is still wet behind the ears and the liberals think he is qualified to run the country.", 
   {}, 
   319014, 
   null, 
   1217886780.0
  ], 
  [
   319047, 
   null, 
   "Truthsayer", 
   "Even though Senator McCain most likely will not be having any African-Americans over to celebrate Thanksgiving dinner, I would hardly call him racist.\n \n So many things are flying hard and fast into both McCain and Obama right now. The have so many \"advisors\" breathing in their ear. Like two race horses rounding the final turn and going for the finish line, their focus is on the win. There is hardly any time to be racist or even keep a grip on your party's propagandists. \n \n I foresee many misquotes, spins, and downright underhanded politics coming down the road these next few months. They both would do well laying low and not giving any opening to the spindoctors.\n \n Obama needs to keep his trap shut as much as he can because there are people working overtime waiting for that one sentence, they can splice to another, to form some resemblance of a smear. He's damned if he does and damned if he don't.\n \n McCain needs to keep his trap shut because, well, you know. Right now, all he's got helping his numbers out are the smear-ads. The more he talks, well, you know.....emoticon_emb", 
   {}, 
   319029, 
   null, 
   1217890500.0
  ], 
  [
   319148, 
   null, 
   "jyoshu", 
   "McCain needs to keep his trap shut because, well, you know. Right now, all he's got helping his numbers out are the smear-ads. The more he talks, well, you know.....emoticon_emb\n\n \n And the fact most Americans seem to be ready to start back up gulf drilling again, which he's been the one pushing for it. Even Obama has shifted to that position some now that he sees it's the popular view.", 
   {}, 
   319047, 
   null, 
   1217948820.0
  ], 
  [
   319167, 
   null, 
   "chester", 
   "And the fact most Americans seem to be ready to start back up gulf drilling again, which he's been the one pushing for it. Even Obama has shifted to that position some now that he sees it's the popular view.\n\n \n Not any more than the elderly gentleman from Arizona has shifted to Obama's POV re. withdrawal from the mad oil war in Iraq.", 
   {}, 
   319148, 
   null, 
   1217953380.0
  ], 
  [
   319186, 
   null, 
   "electrolyte", 
   "And the fact most Americans seem to be ready to start back up gulf drilling again, which he's been the one pushing for it. Even Obama has shifted to that position some now that he sees it's the popular view.\n\n It's sad, really. 80% support offshore drilling, which means that 80% of our populace are XXXXXX.", 
   {}, 
   319148, 
   null, 
   1217958000.0
  ], 
  [
   319215, 
   null, 
   "Archangel", 
   "It's sad, really. 80% support offshore drilling, which means that 80% of our populace are XXXXXX.\n\n \n Do tell, why do you think that our becoming oil independent is idiocy? Do you think that supplying Countries that seek our destruction with the finances to do it with is a good thing? Because that is the end result of continuing to do business with OPEC.", 
   {}, 
   319186, 
   null, 
   1217962980.0
  ], 
  [
   319230, 
   null, 
   "chester", 
   "Do tell, why do you think that our becoming oil independent is idiocy? Do you think that supplying Countries that seek our destruction with the finances to do it with is a good thing? Because that is the end result of continuing to do business with OPEC.\n\n \n False dichotomy.\n \n The other answer is to develop technology that is not dependent on fossil fuels.\n \n I suggest an immediate $2/gal. raise in the gas tax as an incentive for American ingenuity to do just that.", 
   {}, 
   319215, 
   null, 
   1217973720.0
  ], 
  [
   319235, 
   null, 
   "Truthsayer", 
   "Do tell, why do you think that our becoming oil independent is idiocy? Do you think that supplying Countries that seek our destruction with the finances to do it with is a good thing? Because that is the end result of continuing to do business with OPEC.\n\n \n Are you suggesting that an immediate surge in offshore drilling will give us oil independance? The only immediate purpose it will serve would be psychological. It might buy some time and patience from the people at the pump. But even if it were to lend some relief, it would be at least 7 years before you would see it. And even then it would only be a matter of pennies per gallon. What part of the math do some people have a such a hard time understanding?\n \n What if our oil productione doubled? (If that were even possible, but work with me here) We would be providing 6% in the global oil-can then. But we're still using 25% (or more by then?) Hello? Anybody home? You certainly don't believe that our oil companies are going to sell our own oil back to us any cheaper than can sell it to China or India do you?\n \n McCain's push to drill, albeit noble in response to the uninformed masses, is no solution to the immediate needs we have now. Or even 5 years from now. None, whatsoever. It's not an answer for the future either. Not even close. It's just a psychological stroke to get your vote. If you fall for it, that's on you. Vote your conscience. I got no dog in this fight.\n \n Obama's plan would take us in the right direction but it's very risky and elementry in it's planning. I think a compromise might be in order. I am hoping that by the time these new \"oil fields\" come into production, 7-10 years from now, we will have found the oil alternative. McCain won't get us there. Obama will try, but thats a toss of the coin too. This problem should have been handled 5-10 years ago, already. But unless we pacify the GOP and their oil lobbists, they (GOP Politicians) will never compromise enough to allow us to even try to move beyond our oil independance. And you can bet they will fight hard, all the way, to prevent us from taking any money away from the oil industry. They are owned.\n \n If you never change anything, nothing changes.", 
   {}, 
   319215, 
   null, 
   1217975820.0
  ], 
  [
   319238, 
   null, 
   "Archangel", 
   "Are you suggesting that an immediate surge in offshore drilling will give us oil independance? The only immediate purpose it will serve would be psychological. It might buy some time and patience. But even if it were to lend some relief, it would be at least 7 years before you would see it. And even then it would only be a matter of pennies per gallon. What part of the math do some people have a such a hard time understanding?\n \n What if our oil productioned doubled? (If that were even possible, but work with me here) We would be providing 6% in the global oil-can. But we're still using 25%? Hello? Anybody home? You don't believe that our oil companies is going to sell our own oil back to us any cheaper than can sell it to China or India do you?\n \n McCain's push to drill, albeit noble in response to the unwashed masses, is no solution to the immediate needs we have now. None, whatsoever. It's not an answer for the future either. Not even close. It's just a psychological stroke to get your vote. If you fall for it, that's on you. Vote your conscience.\n \n Obama's plan would take us in the right direction but it's very risky and elementry in it's planning. I think a compromise might be in order. I am hoping that by the time these new \"oil fields\" come into production, 7-10 years from now, we will have found the oil alternative. McCain won't get us there. Obama will try, but thats a toss of the coin too. This problem should have been handled 5-10 years ago, already.\n \n If you never change anything, nothing changes.\n\n \n If you're suggesting that I'm implying that the results of our efforts would be immediate, off course not. If we dedicated the capital and manpower and started to drill 4 massive wells simultaneously, starting today, we would draw the first barrel of oil in probably 2 years minimum from now. But so what? One must take that first step before he can start the journey. Another immediate result in taking that action would be OPEC increasing production in order to lower prices in the hope of slowing our resolve.\n \n And I agree with you that this should have been done long ago. I was 17 during the first oil embargo and I remember Congress promising us and committing to oil independence for the US within the next 5 years. But once the embargo ended, so did their resolve and commitment to the issue. It's pathetic really, but let's not do the same thing again.", 
   {}, 
   319235, 
   null, 
   1217976360.0
  ], 
  [
   319253, 
   null, 
   "Steeeeve", 
   "I'd say you have to be fairly ignorant to think this ad was racist and surprisingly, most of America agrees:\n \n http://rasmussenreports.com/public_content/politics/election_20082/2008_presidential_election/only_22_say_mccain_ad_racist_but_over_half_53_see_obama_dollar_bill_comment_that_way\n \n 22% of people found it racist while 53% thought the Obama comment was racist. \n \n Personally, I think either was racist and only one was implying race (Obama's comment). Playing the race card doesn't make you a racist by the way.", 
   {
    "post_info": {
     "post_title": "Not a chance"
    }
   }, 
   319238, 
   null, 
   1217982540.0
  ], 
  [
   319288, 
   null, 
   "electrolyte", 
   "Do tell, why do you think that our becoming oil independent is idiocy?\n\n I never said that our being oil independent is idiotic. You can't read.\n \n \nDo you think that supplying Countries that seek our destruction with the finances to do it with is a good thing?\n\n Nope. Nice to see you're still pulling nonsense out of your XXX and trying to attribute it to me.\n \n \nBecause that is the end result of continuing to do business with OPEC.\n\n Then let's extricate ourselves from this situation of such profound oil dependence. That doesn't mean \"use domestic oil,\" that means \"use very little oil.\" More drilling won't get us there, and the proposed drilling will have minuscule impact only after about a decade.", 
   {}, 
   319215, 
   null, 
   1217989980.0
  ], 
  [
   319303, 
   null, 
   "Archangel", 
   "You said \nIt's sad, really. 80% support offshore drilling, which means that 80% of our populace are XXXXXX.\n\n \n Then I said \n \n Do tell, why do you think that our becoming oil independent is idiocy?\n\n \n Then you this \nI never said that our being oil independent is idiotic. You can't read.\n\n \n So why did you call 80% of Americans who support offshore drilling XXXXXX if you're all for doing it? You're not making any sense at all. Tell me how I misinterpreted what you said?", 
   {}, 
   319186, 
   null, 
   1217993400.0
  ], 
  [
   319306, 
   null, 
   "smiley", 
   "You said \n \n Then I said \n \n Then you this \n \n So why did you call 80% of Americans who support offshore drilling XXXXXX if you're all for doing it? You're not making any sense at all. Tell me how I misinterpreted what you said?\n\n \n Where did he say that to become oil independent requires off shore drilling?\n \n You jumped to this conclusion. It has already been explained why offshore drilling would not, at least on its own, result in oil independence.\n \n Smiley", 
   {}, 
   319303, 
   null, 
   1217994240.0
  ], 
  [
   319307, 
   null, 
   "Steeeeve", 
   "Offshore drilling is no more idiotic than drilling for oil anywhere else. Not only that, it probably will have an impact on prices fairly immediately (meaning a few years at worst). This is because you don't actually have to have the oil for it to drop just like you don't have to have certain events happen for a price to drop. All you need is for the knowledge that something will happen for a price to adjust. \n \n Whether the price will be effected enough to make a difference is another thing. Like all things, prices go up and down and if a price inflates too much it will adjust. This happened to housing recently and it happened to oil in the 70s and early 80s (and in the early 90s to a lesser extent). So it would be surprising if oil didn't adjust to a rate actually deemed fair by the market. This may take awhile or take only a year...who knows...it took housing a decade. \n \n And back to offshore drilling....if someone wants to drill, why not let them? Doesn't hurt anyone and it doesn't cause a huge environmental impact like some seem to think.", 
   {}, 
   319303, 
   null, 
   1217994300.0
  ], 
  [
   319309, 
   null, 
   "electrolyte", 
   "So why did you call 80% of Americans who support offshore drilling XXXXXX if you're all for doing it?\n\n Archie, what have I told you about pulling things out of your XXX and then attributing them to me?\n \n \nYou're not making any sense at all. Tell me how I misinterpreted what you said?\n\n I've already identified the problem as a reading comprehension deficiency; I won't claim to know what -- if it's not simply incurable functional illiteracy -- your particular mental deficiency is.", 
   {}, 
   319303, 
   null, 
   1217995260.0
  ], 
  [
   319311, 
   null, 
   "electrolyte", 
   "Offshore drilling is no more idiotic than drilling for oil anywhere else.\n\n Supporting it because you (generic you, not you Steeeeve) think it will have a profound and speedy effect on gas prices is. It's only been a big issue now because talking heads have decided that they can get attention by talking about gas prices.\n \n Look at the positive effect that this \"crisis\" has had on stimulating energy alternatives. I've never been a anarcho-libertarian who believes that all problems will eventually lead to their own solutions, but history has shown that such impetus is required for this matter, and this is long overdue.", 
   {}, 
   319307, 
   null, 
   1217995680.0
  ], 
  [
   319317, 
   null, 
   "Archangel", 
   "Where did he say that to become oil independent requires off shore drilling?\n\n \n What is interesting is that he has responded to my sincere question like the typical pompous XXX that he is, while still not answering my question at all as to why he responded to jyoshu by calling 80% of America XXXXXX for endorsing offshore drilling? It was me who brought up seeking oil independence, but he had already called 80% of America XXXXXX. \n \n \nYou jumped to this conclusion. It has already been explained why offshore drilling would not, at least on its own, result in oil independence.\n \n Smiley\n\n \n It's been explained by who? And was this a link that explained it because I haven't seen it. But here's a link that say's that 86 BILLION OFFSHORE BARRELS OF OIL represent only 60% of Americas offshore reserves. Granted that doesn't represent permanent oil independence, but it's sure a good start.\n The offshore areas of the United States are estimated to contain significant quantities of resources in yet-to-be-discovered fields. MMS estimates of oil and gas resources in undiscovered fields on the OCS (2006, mean estimates) total 86 billion barrels of oil and 420 trillion cubic feet of gas. These volumes represent about 60 percent of the oil and 40 percent of the natural gas resources estimated to be contained in remaining undiscovered fields in the United States.http://www.mms.gov/offshore/\n \n We must commit to wind and solar as integral parts of our power grid so that oil will only be used to run machinery that must be run on fuel only.I was actually shocked to see that the USA consumes 20,730,000 barrels PER DAY of oil. We must decrease consumption by using Nuclear Power Plants for generating electricity. \n \n Here's the top 10 oil producers per day in the world, and we are #3.\n Energy Statistics < Oil < Production (most recent) by country\n VIEW DATA: Totals Per capita \n Definition Source Printable version \n Bar Graph Pie Chart Map \n \n Showing latest available data.\n Rank Countries Amount (top to bottom) \n #1 Saudi Arabia: 9,475,000 bbl/day \n #2 Russia: 9,400,000 bbl/day \n #3 United States: 7,610,000 bbl/day \n #4 Iran: 3,979,000 bbl/day \n #5 China: 3,631,000 bbl/day \n #6 Mexico: 3,420,000 bbl/day \n #7 Norway: 3,220,000 bbl/day \n #8 Canada: 3,135,000 bbl/day \n #9 Venezuela: 3,081,000 bbl/day \n #10 United Arab Emirates: 2,540,000 bbl/day \n \n that leaves 11,255,000 bbl/day that we need to produce in order to be oil independent. divide that by 86 billion barrels offshore and that = 7, 641.04842 days worth available at current usage levels. divide that by 365 days per year and that gives us more than 20 years of oil independence without even tapping our on shore supplies. But of course we would be drilling on shore also in order to balance our harvesting. \n \n Look at this for some scary numbers.\n ISSUES: OIL & ENERGY\n \n Safe, Strong and Secure: Reducing America's Oil Dependence \n America's rising consumption of oil threatens the economy and national security.\n \n America spends more than $200,000 per minute on foreign oil -- $13 million per hour. More than $25 billion a year goes for Persian Gulf imports alone. This NRDC analysis considers oil demand and supply projections and how our current policy of oil dependence effects our economy and security.\n Back to the America's Oil Policies Index\n TAKE ACTION\n Break the Chain: Help end our dependence on oil.\n America's dependence on oil is a threat to our national security and our economy. Growing demand and shrinking domestic production means America is importing more and more oil each year - much of it from the world's most unfriendly or unstable regions. We spend more than $200,000 per minute -- $13 million per hour -- on foreign oil, and more than $25 billion a year on Persian Gulf imports alone.1 By October 2004, Americans had shelled out $249 per capita to foreign oil-interests.2\n \n With U.S. gasoline consumption accounting for 11 percent of world oil production, the U.S. has been hit hard by our dependence on oil, intensifying our economic and political vulnerability. Of the $54 billion trade deficit reported in August, more than a fifth or $12 billion is from imported crude oil.3 Federal Reserve Chairman Alan Greenspan has called the higher value of imported oil a tax on U.S. citizens that has cost us three quarters of a percent of our economic output in 2004, and warned economic impacts for the U.S. will intensify if current trends in oil demand and prices continue.4\n \n Countries on U.S. oil purchases are spending heavily in Washington to make sure the party doesn't end: Since December 2003, OPEC has spent $13.3 million on federal lobbying, $6.6 million of which from Saudi Arabia alone.5 U.S. energy companies are jumping on the political bandwagon too, spending $59.4 million on lobbying in 2003 and $29 million on campaign contributions in the 2002 and 2004 election cycles.6http://www.nrdc.org/air/transportation/aoilpolicy2.asp", 
   {}, 
   319306, 
   null, 
   1218000840.0
  ], 
  [
   319327, 
   null, 
   "obvious_child", 
   "Couple problems there Arch.\n \n First of all, the vast majority of oil is used as vehicle fuel. Increasing nuclear power plants won't solve that particular problem. What nuclear WILL do is decrease the need for gas fired power plants, and as natural gas is tied to gasoline, we'll be paying less for that. However, we have trillions of cubic feet of natural. \n \n \n\n that leaves 11,255,000 bbl/day that we need to produce in order to be oil independent. divide that by 86 billion barrels offshore and that = 7, 641.04842 days worth available at current usage levels. divide that by 365 days per year and that gives us more than 20 years of oil independence without even tapping our on shore supplies. But of course we would be drilling on shore also in order to balance our harvesting.\n\n \n Big problem there. Largely that you're not including recoverable along with actual production. Just because we have that amount does not mean we are capable of producing that much daily or even extracting that much. You're just doing basic math without incorporating actual logistics.\n \n As for the foreign oil, we need to get off oil period. We'll always be price takers in an oil world. Never a price setter. So we need to get off oil entirely. Even if we pumped a couple million more, we'd still be at the mercy of the international commodity exchanges.", 
   {}, 
   319317, 
   null, 
   1218010620.0
  ], 
  [
   319360, 
   null, 
   "Steeeeve", 
   "Supporting it because you (generic you, not you Steeeeve) think it will have a profound and speedy effect on gas prices is. It's only been a big issue now because talking heads have decided that they can get attention by talking about gas prices.\n \n Look at the positive effect that this \"crisis\" has had on stimulating energy alternatives. I've never been a anarcho-libertarian who believes that all problems will eventually lead to their own solutions, but history has shown that such impetus is required for this matter, and this is long overdue.\n\n \n This is no different than what happened in the late 70s. Furthermore, I am not sure the fact that 80% support offshore drilling equates to those people supporting it only because it will have a profound and speedy effect on gas prices. On the same token, Archie assumed it meant those people only support it for oil independence. \n \n I don't recall seeing a poll about why people support it. I personally think you can drill where you want to.", 
   {}, 
   319311, 
   null, 
   1218041520.0
  ], 
  [
   319361, 
   null, 
   "Steeeeve", 
   "Couple problems there Arch.\n \n First of all, the vast majority of oil is used as vehicle fuel. \n I thought I read it was only 40%. Is this what you are referring to?", 
   {}, 
   319327, 
   null, 
   1218041580.0
  ], 
  [
   319375, 
   null, 
   "Archangel", 
   "Couple problems there Arch.\n \n First of all, the vast majority of oil is used as vehicle fuel. Increasing nuclear power plants won't solve that particular problem. What nuclear WILL do is decrease the need for gas fired power plants, and as natural gas is tied to gasoline, we'll be paying less for that. However, we have trillions of cubic feet of natural.\n \n \n I understand that perfectly. My link gives the numbers for available Gas reserves offshore also. I said we need to increase Nuclear. Wind and Solar in order to decrease the gas fired plants that we now rely on to keep the lights on. I understand that cars are the greatest guzzler of gasoline, so we need to be able to feed that monster in order to fuel our economic machine until we can perfect the fuel cell and electric cars to the extent that they can replace the internal combustion engine.\n \n \nBig problem there. Largely that you're not including recoverable along with actual production. Just because we have that amount does not mean we are capable of producing that much daily or even extracting that much. You're just doing basic math without incorporating actual logistics.\n\n \n Are you suggesting that it's impossible to build the sufficient infrastructure to make oil independence possible? I would disagree with that conclusion. It is possible if we make the commitment. \n \n \nAs for the foreign oil, we need to get off oil period. We'll always be price takers in an oil world. Never a price setter. So we need to get off oil entirely. Even if we pumped a couple million more, we'd still be at the mercy of the international commodity exchanges.\n\n \n Getting off of oil completely is not only completely impractical today, but is virtually impossible and it's illogical to even suggest it. Maybe in 50 or 100 years, MAYBE! But not today, or even soon at all. Consider just the lubricants necessary to grease the machines that run our industrial complex. Check the price of current non oil lubricants such as graphite. It is cost prohibitive as are all synthetic lubricants at this time, compared to oil.", 
   {}, 
   319327, 
   null, 
   1218045600.0
  ], 
  [
   319404, 
   null, 
   "obvious_child", 
   "I thought I read it was only 40%. Is this what you are referring to?\n\n \n Automobiles meaning cars account for something like 20%. When you add in trucks, boats, planes and trains, transportation is by far taking the lion's share.", 
   {}, 
   319361, 
   null, 
   1218063480.0
  ], 
  [
   319405, 
   null, 
   "obvious_child", 
   " I understand that cars are the greatest guzzler of gasoline, so we need to be able to feed that monster in order to fuel our economic machine until we can perfect the fuel cell and electric cars to the extent that they can replace the internal combustion engine.\n\n \n Gasoline is hardly the only product that comes out of crude. Diesel, jet fuel, bunker fuel, the list goes on and on. And replacing the internal combustion engine will take at least two decades. We have something like 230+ million cars on the road, with millions more trucks, planes and boats. Changing over will take decades.\n \n \nAre you suggesting that it's impossible to build the sufficient infrastructure to make oil independence possible? I would disagree with that conclusion. It is possible if we make the commitment.\n\n \n Hardly. I'm saying it is impossible now to produce that much daily. Obviously overtime production will change, but your argument is ignoring the basic logistics. \n \n \nGetting off of oil completely is not only completely impractical today, but is virtually impossible and it's illogical to even suggest it. Maybe in 50 or 100 years, MAYBE! But not today, or even soon at all.\n\n \n True, doesn't mean we shouldn't try. Furthermore the whole distinction between foreign and domestic is retarded. Our primary problem is oil, not where it comes from.", 
   {}, 
   319375, 
   null, 
   1218063720.0
  ], 
  [
   319510, 
   null, 
   "DrNo", 
   "And the so-called \"mainstream\" American media is both racist and rightwing.\n \n McCain's little ad featuring Britney Spears (who is Republican) and Paris Hilton (Ditto, her parents gave a bunch of bucks to McCain) and Obama is totally shades of the racist campaign against Harold Ford in Tennessee.\n \n Lily white blonde sexpots. Black man (well, not that black, but black enough). The old irrational hatred of seeing black men with white women.\n \n Remember the Harold Ford thingy?\n \n http://www.msnbc.msn.com/id/15403071/\n \n John McCain has lined up Terry Nelson to serve as campaign manager. Nelson is the guy who created the anti-Ford ad that provoked racist Tennessee voters to vote for Bob Corker.\n \n Oh, and don't forget about how many times Obama has been called \"arrogant\" after his triumphant travels through Germany and France and England. You know what \"arrogant\" translates into? The old \"uppity N----.\"\n\n \n Wow...I saw this ad and none of the \"old, irrational hatred\" ideas even occurred to me. It sounds to me like you may be the racist one here if you really interpret things this way.\n \n When I see somebody who is not yet president acting as though they have already won the election, I consider that arrogant. It really has nothing to do with race. Are you saying black people can't be arrogant? You probably believe they can't be racist, either.", 
   {}, 
   318569, 
   null, 
   1218133020.0
  ], 
  [
   319682, 
   null, 
   "simone", 
   "McCain is doing the same thing, acting as if he is president with his weekly radio programs. So, why isn't anyone saying that he's arrogant?\n \n Face it. Obama IS presidential. My God, he speaks English well. He is even articulate.\n \n If you believe that shuffling bumbling is presidential, very sorry to learn that.\n \n Hope you recover some day.", 
   {}, 
   319510, 
   null, 
   1218228480.0
  ], 
  [
   319687, 
   null, 
   "isly ilwott", 
   "McCain is doing the same thing, acting as if he is president with his weekly radio programs. So, why isn't anyone saying that he's arrogant?\n \n Face it. Obama IS presidential. My God, he speaks English well. He is even articulate.\n \n If you believe that shuffling bumbling is presidential, very sorry to learn that.\n \n Hope you recover some day.\nIf you think speaking well implies presidential worthiness, you need to modify your requirements. Barack Hussein Obama is nothing more than a slick salesman...with about as much knowledge of foreign affairs as one can can glean from reading the New York Times daily.", 
   {}, 
   319682, 
   null, 
   1218230220.0
  ], 
  [
   319688, 
   null, 
   "Jo Bennett", 
   "If you think speaking well implies presidential worthiness, you need to modify your requirements. Barack Hussein Obama is nothing more than a slick salesman...with about as much knowledge of foreign affairs as one can can glean from reading the New York Times daily.\n\n \n Well, that's a good deal more that Bush had on taking office. Hell, it's a good deal more than he has now.", 
   {}, 
   319687, 
   null, 
   1218230280.0
  ], 
  [
   319692, 
   null, 
   "isly ilwott", 
   "Well, that's a good deal more that Bush had on taking office. Hell, it's a good deal more than he has now.\n\n Nothing bad that you say about Bush makes Barack Hussein Obama worth more than his own salt content.", 
   {}, 
   319688, 
   null, 
   1218231780.0
  ], 
  [
   319694, 
   null, 
   "Jo Bennett", 
   "Sure I'd rather the US elected a genuine socialist, rather than a capitalist with a thin veneer of social responsibility, but the key thing about Obama is that at least he's not Bush or McCain. Or Clinton for that matter.", 
   {}, 
   319692, 
   null, 
   1218232320.0
  ], 
  [
   319696, 
   null, 
   "Archangel", 
   "Sure I'd rather the US elected a genuine socialist, rather than a capitalist with a thin veneer of social responsibility, but the key thing about Obama is that at least he's not Bush or McCain. Or Clinton for that matter.\n\n \n 1) who we elect is none of your business at all, you being a brit and all. \n \n 2) you're in for a big disappointment come November when the silent majority votes at the ballot box. And that's coming from a guy who can't stand McCain. The average American majority hasn't drank the socialist kool-aid yet.", 
   {}, 
   319694, 
   null, 
   1218233280.0
  ], 
  [
   319697, 
   null, 
   "isly ilwott", 
   "Sure I'd rather the US elected a genuine socialist, rather than a capitalist with a thin veneer of social responsibility, but the key thing about Obama is that at least he's not Bush or McCain. Or Clinton for that matter.\nUnless you are a true socialist and think that we should all work for the government, wear drab green uniforms and stand for hours in bread lines, you would be quite disappointed after a few years under Barack's reign. He will lead us into depression and generate a truly pitiful economy based on redistribution of hard earned wealth to the hardly worthy.\n \n Perhaps you just favor the downfall of capitalism in the USA.", 
   {}, 
   319694, 
   null, 
   1218233640.0
  ], 
  [
   319700, 
   null, 
   "Jo Bennett", 
   "Unless you are a true socialist and think that we should all work for the government, wear drab green uniforms and stand for hours in bread lines, you would be quite disappointed after a few years under Barack's reign. He will lead us into depression and generate a truly pitiful economy based on redistribution of hard earned wealth to the hardly worthy.\n \n Perhaps you just favor the downfall of capitalism in the USA.\n\n \n Socialism =/= state capitalism or uniformity. Your crude stereotpyes are irrelevant.\n \n As for it being not my business who the US elects, when the US President only has influence on what happens within the borders of the US, is when it will cease to be my business. I may not get a vote, but that doesn't mean I don't have the right to an opinion.", 
   {}, 
   319697, 
   null, 
   1218234240.0
  ], 
  [
   319721, 
   null, 
   "simone", 
   "1) who we elect is none of your business at all, you being a brit and all. \n \n 2) you're in for a big disappointment come November when the silent majority votes at the ballot box. And that's coming from a guy who can't stand McCain. The average American majority hasn't drank the socialist kool-aid yet.\n\n Here's to corporate socialism!\n \n And their prime most prophet, Archie!", 
   {}, 
   319696, 
   null, 
   1218250200.0
  ], 
  [
   319987, 
   null, 
   "Steeeeve", 
   "People that argue for socialism are beyond repair. The idea that a government can run your life better than yourself is beyond logic and a dangerous mindset. There is a reason socialism always fails and a reason why every major society downfall starts with socialism (just look at the Romans!). \n \n Sad.", 
   {}, 
   319721, 
   null, 
   1218502080.0
  ], 
  [
   319990, 
   null, 
   "Jo Bennett", 
   "People that argue for socialism are beyond repair. The idea that a government can run your life better than yourself is beyond logic and a dangerous mindset. There is a reason socialism always fails and a reason why every major society downfall starts with socialism (just look at the Romans!). \n \n Sad.\n\n \n Socialism isn't about having the government run your life. It's about accepting that working together produces better results than individuals trying to do everything independently, and that the only just way of doing this is democratically, rather than the quadi-feudalism of the capitalist system.\n \n Socialism needs democracy like the human body needs oxygen - Leon Trotsky \n \n I also don't agree that socialism always fails (though it's hard to be precise given that you haven't specified what success or failure mean in this context, or indeed what you consider to be socialist countries). Nor do I agree that every major society downfall can be attributed to socialism. Let's go back to, for example, the Anglo-Saxon society of pre-norman Britain, killed off by the Norman invasion and the introduction of the feudal system. We could go back to the 1980s and look at the use of monetarism that gutted communities in the north of england. Or how about the collapse of the Weimar republic which was a result of the wall street crash and the recall of loans by the US, which led to the rise of Nazism. The collapse of russian society that led to the 1917 revolution was a result of a prolonged war. The collapse of Russian society after 1990 was largely a result of privatisation and the introduction of capitalism. Do I need to go on?", 
   {}, 
   319987, 
   null, 
   1218502980.0
  ], 
  [
   320005, 
   null, 
   "Steeeeve", 
   "Socialism isn't about having the government run your life. It's about accepting that working together produces better results than individuals trying to do everything independently, and that the only just way of doing this is democratically, rather than the quadi-feudalism of the capitalist system.\nSocialism doesn't promote \"working together\"...it promotes not working.\n \n \nI also don't agree that socialism always fails (though it's hard to be precise given that you haven't specified what success or failure mean in this context, or indeed what you consider to be socialist countries).\nWell France is socialist as an example. Failure would be the collapse of a country. \n \n \nNor do I agree that every major society downfall can be attributed to socialism. Let's go back to, for example, the Anglo-Saxon society of pre-norman Britain, killed off by the Norman invasion and the introduction of the feudal system. \nHmm, I'm thinking more major than that..Although I admit I'm not too familiar with that society time. \n \n \nOr how about the collapse of the Weimar republic which was a result of the wall street crash and the recall of loans by the US, which led to the rise of Nazism.\nThis was never a major society. The weimar republic was like 20 years...hardly a Roman Empire or Europe in the 18-19th century. \n \n \nThe collapse of Russian society after 1990 was largely a result of privatisation and the introduction of capitalism. Do I need to go on?\nThat would be a collapse from going from communism to capitalism and not caused my capitalism. \n \n Those non-empire example aside (after all I said major societies) if you look back at what socialism represents, it should be no wonder why it leads to a collapse. It markets the idea that you can micromanage how an economy runs using the government. Naturally that government will want to make things run the way they want it to run which almost always conflicts with normal human behavior. As a result you end up creating a greater and greater welfare state that cannot be sustained and then collapses in on itself. Socialism by its very nature prohibits (impedes) thought, creativity, and advancement. This is not to say a 100% capitalist society can work (and I am not claiming a 100% socialist society can work but any thing considered socialist) because government has its place and that is to keep a country for tearing itself apart. Anything beyond that, such as trying to make a flawed humans view of utopia, is suicide for a country...and that is socialism.", 
   {}, 
   319990, 
   null, 
   1218512400.0
  ], 
  [
   320026, 
   null, 
   "Jo Bennett", 
   "But you say France is socialist, presumably then so is Sweden, Norway, Finland, Germany, Netherlands and quite a few others. The ones doing the best are actually the most socialist - Sweden, Norway, Finland. Sounds like successful socialism to me.", 
   {}, 
   320005, 
   null, 
   1218527460.0
  ], 
  [
   320062, 
   null, 
   "jyoshu", 
   "But you say France is socialist, presumably then so is Sweden, Norway, Finland, Germany, Netherlands and quite a few others. The ones doing the best are actually the most socialist - Sweden, Norway, Finland. Sounds like successful socialism to me.\n\n \n Depends on how one defines 'doing best.' For me, a higher standard of living could never be a substitute for personal freedom and privacy.", 
   {}, 
   320026, 
   null, 
   1218567720.0
  ], 
  [
   320091, 
   null, 
   "Steeeeve", 
   "But you say France is socialist, presumably then so is Sweden, Norway, Finland, Germany, Netherlands and quite a few others. The ones doing the best are actually the most socialist - Sweden, Norway, Finland. Sounds like successful socialism to me.\n\n \n Like you say, it depends on how you define best...furthermore, a destruction caused by limiting freedom takes some time. These countries haven't been around that long remember (in terms of the type of government).", 
   {}, 
   320026, 
   null, 
   1218589200.0
  ], 
  [
   320175, 
   null, 
   "chester", 
   "Like you say, it depends on how you define best...furthermore, a destruction caused by limiting freedom takes some time. These countries haven't been around that long remember (in terms of the type of government).\n\n \n Poor Steeeve, still looking at all those Rambo and Marion Morrison films and thinking they are documentaries.\n \n I live in the Western United States, and I can tell you as a natural fact that the West is built on a combination of lies and Federal subsidies. That cowboy took his herd to market on the government's dime, and now his descendants are screaming about paying their fair share in taxes.\n \n BUSHWA!!!\n \n Were it not for subsidized grazing rights, subsidized roads and railroads, subsidized water projects, subsidized mineral rights, subsidized land, subsidized oil depletion allowances, and so on, the West would still be what the cartographers of the 1840's called it - The Great American Desert.", 
   {}, 
   320091, 
   null, 
   1218651780.0
  ], 
  [
   320181, 
   null, 
   "Steeeeve", 
   "Poor Steeeve, still looking at all those Rambo and Marion Morrison films and thinking they are documentaries.\n \n I live in the Western United States, and I can tell you as a natural fact that the West is built on a combination of lies and Federal subsidies. That cowboy took his herd to market on the government's dime, and now his descendants are screaming about paying their fair share in taxes.\n \n BUSHWA!!!\n \n Were it not for subsidized grazing rights, subsidized roads and railroads, subsidized water projects, subsidized mineral rights, subsidized land, subsidized oil depletion allowances, and so on, the West would still be what the cartographers of the 1840's called it - The Great American Desert.\n\n \n Dear Hypocrite,\n \n I guess it is a good thing investments in infrastructure of a country are not socialist traits.", 
   {}, 
   320175, 
   null, 
   1218653880.0
  ], 
  [
   320766, 
   null, 
   "Jo Bennett", 
   "Like you say, it depends on how you define best...furthermore, a destruction caused by limiting freedom takes some time. These countries haven't been around that long remember (in terms of the type of government).\n\n \n Ah, historical inevitability. I had no idea you were a marxist, Steeeeve! Unfortunately for you the same argument applies to the collapse of capitalism. And once again you conflate capitalism and freedom. Have you never heard of anarcho-syndicalism? And why is someone more free when their life is controlled by corporations than when those corporations are restrained by a democratic government?", 
   {}, 
   320091, 
   null, 
   1219169100.0
  ], 
  [
   320838, 
   null, 
   "Steeeeve", 
   "Ah, historical inevitability. I had no idea you were a marxist, Steeeeve! Unfortunately for you the same argument applies to the collapse of capitalism.\nIndeed! Capitalism fails but first has to go threw socialism.", 
   {}, 
   320766, 
   null, 
   1219201920.0
  ], 
  [
   320842, 
   null, 
   "Jo Bennett", 
   "Indeed! Capitalism fails but first has to go threw socialism.\n\n \n Not quite, capitalism fails, is followed by socialism, which is followed by the withering away of the state to achieve communism. I think we are seeing the end of capitalism, we've reached the point where it can no longer stand under the weight of its own myth.", 
   {}, 
   320838, 
   null, 
   1219204260.0
  ], 
  [
   323469, 
   null, 
   "Archangel", 
   "Not quite, capitalism fails, is followed by socialism, which is followed by the withering away of the state to achieve communism. I think we are seeing the end of capitalism, we've reached the point where it can no longer stand under the weight of its own myth.\n\n \n Oh yeah Jo, capitalism is on its way out. The USSR is dead, only around 250 million out of China's 1.3 billion people live in the 21st century, but capitalism is dying. emoticon_xbye Welcome to la la land Jo. emoticon_frazzled", 
   {}, 
   320842, 
   null, 
   1221205140.0
  ], 
  [
   323470, 
   null, 
   "Jo Bennett", 
   "Oh yeah Jo, capitalism is on its way out. The USSR is dead, only around 250 million out of China's 1.3 billion people live in the 21st century, but capitalism is dying. emoticon_xbye Welcome to la la land Jo. emoticon_frazzled\n\n \n The USSR and China were never communist, according to marxist theory, they never had a capitalist phase - jumping straight from feudalism to an attempt at communism. Communism requires a large proletarian majority. Do you know how much of the population were proletarian in Russia in 1917? 4%.", 
   {}, 
   323469, 
   null, 
   1221205440.0
  ], 
  [
   323471, 
   null, 
   "Archangel", 
   "The USSR and China were never communist, according to marxist theory, they never had a capitalist phase - jumping straight from feudalism to an attempt at communism. Communism requires a large proletarian majority. Do you know how much of the population were proletarian in Russia in 1917? 4%.\n\n \n Name one truly Marxist Society that has ever existed Jo? You can't, because corruption, greed and the quest for individual power has always corrupted what Marx envisioned for his perfect society. The fundamental ingredient that he never allowed for in his recipe for Valhalla was the human condition. \n \n That is why true Marxism has never really been attempted. Because in designing it, the founders always weeded out and erased the truly beneficial aspects of Marxism that created true equality. They built in the sacrificial worker ethic while insuring the elitists continued to run the show and garner the wealth and power. The only byproduct of Marxism for every country that has attempted it has been human misery, corruption and bribery.", 
   {}, 
   323470, 
   null, 
   1221206820.0
  ], 
  [
   323490, 
   null, 
   "jyoshu", 
   "Name one truly Marxist Society that has ever existed Jo? You can't, because corruption, greed and the quest for individual power has always corrupted what Marx envisioned for his perfect society. The fundamental ingredient that he never allowed for in his recipe for Valhalla was the human condition. \n \n That is why true Marxism has never really been attempted. Because in designing it, the founders always weeded out and erased the truly beneficial aspects of Marxism that created true equality. They built in the sacrificial worker ethic while insuring the elitists continued to run the show and garner the wealth and power. The only byproduct of Marxism for every country that has attempted it has been human misery, corruption and bribery.\n\n \n Funny thing is, even in cycles of capitalism -< socialism -< communism, it sometimes goes back around to capitalism, as we saw when the Soviet Union collapsed. It simply ends up going full circle rather than capitalism being dead. Besides, capitalism is, by definition, going to be the default system because it's the system representative of a free market. If it degrades into communism, it's because freedom is taken away from the people. Restore a free society where people are truly free to engage in a market, and ... taa daa! Capitalism is back. emoticon_xgood", 
   {}, 
   323471, 
   null, 
   1221234960.0
  ], 
  [
   323891, 
   null, 
   "Truthsayer", 
   "Even though Senator McCain most likely will not be having any African-Americans over to celebrate Thanksgiving dinner, I would hardly call him racist.\n \n So many things are flying hard and fast into both McCain and Obama right now. The have so many \"advisors\" breathing in their ear. Like two race horses rounding the final turn and going for the finish line, their focus is on the win. There is hardly any time to be racist or even keep a grip on your party's propagandists. \n \n I foresee many misquotes, spins, and downright underhanded politics coming down the road these next few months. They both would do well laying low and not giving any opening to the spindoctors.\n \n Obama needs to keep his trap shut as much as he can because there are people working overtime waiting for that one sentence, they can splice to another, to form some resemblance of a smear. He's damned if he does and damned if he don't.\n \n McCain needs to keep his trap shut because, well, you know. Right now, all he's got helping his numbers out are the smear-ads. The more he talks, well, you know.....emoticon_emb\n\n \n Bump....\n \n I posted this a little over a month ago. Before the lipstick. Before the Palin. Before the McCain hired the same people who smeared him, his last bid at POTUS, to run his propaganda wing in his current campaign.\n \n Obama DIDN'T keep his trap shut. They took that one sentence, sliced and diced it, and smeared him good. He shoulda listened to me. But NOoooooo.... He deserves...uh...what...uh...he gets.\n \n However, McCain is getting better at keeping his trap shut, now that he has someone out front now doing all the talking. His numbers are improving. He still has a ways to go yet. He really needs to stop talking altogether. He does seem to be coming across as the \"rebel without a clue\" as of late. (They both need to avoid interviews that require intellectual content.) He needs to just let his pretty Barbie doll handle all the motivational rhetoric from now on (and stay as far away as they can on the real issues.) All he needs to do is look presidential and be a war hero and I think he has as good of a shot as any to win. People just eat that kind of stuff up.", 
   {}, 
   319047, 
   null, 
   1221580260.0
  ], 
  [
   324377, 
   null, 
   "simone", 
   "Bidey Bye! Sarah!\n \n Your shrill, squeaky cuteness is uck! You've worn out your five-minute bit of fame.", 
   {
    "post_info": {
     "post_title": "As I've said numerous times"
    }
   }, 
   323891, 
   null, 
   1221940800.0
  ], 
  [
   324761, 
   null, 
   "Truthsayer", 
   "Bidey Bye! Sarah!\n \n Your shrill, squeaky cuteness is uck! You've worn out your five-minute bit of fame.\n\n \n So it appears...... emoticon_rolleyes", 
   {}, 
   324377, 
   null, 
   1222134480.0
  ], 
  [
   324767, 
   null, 
   "Archangel", 
   "Bidey Bye! Sarah!\n \n Your shrill, squeaky cuteness is uck! You've worn out your five-minute bit of fame.\n\n \n \nSo it appears...... emoticon_rolleyes\n\n \n Do either of you have any real world sources that justify writing her off as you are? Beside looney lefty sites of course? emoticon_rolleyes I didn't think so. But you keep thinking this way right up until November 4th. The easiest foe to defeat is one who doesn't know you exist. emoticon_xagree", 
   {}, 
   324761, 
   null, 
   1222140180.0
  ], 
  [
   324776, 
   null, 
   "Foxtuba", 
   "Do either of you have any real world sources that justify writing her off as you are? Beside looney lefty sites of course? emoticon_rolleyes I didn't think so. But you keep thinking this way right up until November 4th. The easiest foe to defeat is one who doesn't know you exist. emoticon_xagree\n\n \n \n Ah, the sadness of Christianity..everything is divided up into aggressive dichotomies, as if everything in life is measure by combating opposition...good vs evil, us vs them, blue vs red...why is there such a thrill of that? That's right, it's human nature for a group of people to side on one side, and then the other side simply fights back, until one side conquers the other one....I'm sure that thrills God, as though there is not enough bloodshed for him to get a hard on.....honestly, when I think of a God, he has one twisted mind, for sure.\n \n As for November 4th, America isn't stupid enough to vote for McCain/Palin. They are stupid enough to self-detonate and elect them anyway, but to sincerely have them voted in, you are asking for an apocolyptic situation, then that will be the case...but there will be no Jesus to rescue us. It makes me want to read The Watchmen all the way through.\n \n That's right....I wanted to emphasize a point my misspelling a word up there because there is a lot of alcohol going through my veins....here's the nice thing, I will always be a nuisance, and I will never convert to brainwashed Christianity and corrupt Republicanism....heck, a couple aspects of conservatism is fine, but there is a lot of things messed up with life in general, but the ones who are who they are will not change between now and election, now and death, now and whatever happens with the universe...so, knowing that, your quest is simply over. Christianity is deadwood, it fits in with everything else in human nature, and we will all experience pain, and death, and whatever else happens after that that is a part of earth's gravitational prison..", 
   {}, 
   324767, 
   null, 
   1222145040.0
  ], 
  [
   324778, 
   null, 
   "Archangel", 
   "Ah, the sadness of Christianity..everything is divided up into aggressive dichotomies, as if everything in life is measure by combating opposition...good vs evil, us vs them, blue vs red...why is there such a thrill of that? That's right, it's human nature for a group of people to side on one side, and then the other side simply fights back, until one side conquers the other one....I'm sure that thrills God, as though there is not enough bloodshed for him to get a hard on.....honestly, when I think of a God, he has one twisted mind, for sure.\n \n As for November 4th, America isn't stupid enough to vote for McCain/Palin. They are stupid enough to self-detonate and elect them anyway, but to sincerely have them voted in, you are asking for an apocolyptic situation, then that will be the case...but there will be no Jesus to rescue us. It makes me want to read The Watchmen all the way through.\n \n That's right....I wanted to emphasize a point my misspelling a word up there because there is a lot of alcohol going through my veins....here's the nice thing, I will always be a nuisance, and I will never convert to brainwashed Christianity and corrupt Republicanism....heck, a couple aspects of conservatism is fine, but there is a lot of things messed up with life in general, but the ones who are who they are will not change between now and election, now and death, now and whatever happens with the universe...so, knowing that, your quest is simply over. Christianity is deadwood, it fits in with everything else in human nature, and we will all experience pain, and death, and whatever else happens after that that is a part of earth's gravitational prison..\n\n \n You're rambling again tuba, and you're not making any sense either. Put down the joint and the bottle and get a grip on reality will ya? You're embarrassing emoticon_emb yourself. emoticon_rolleyes", 
   {}, 
   324776, 
   null, 
   1222145580.0
  ], 
  [
   324819, 
   null, 
   "trebor", 
   "You're rambling again tuba, and you're not making any sense either. Put down the joint and the bottle and get a grip on reality will ya? You're embarrassing emoticon_emb yourself. emoticon_rolleyes\n\n \n That is fine advice Archie. I suggest you follow it yourself.. since you're embarrassing yourself.", 
   {}, 
   324778, 
   null, 
   1222182000.0
  ], 
  [
   325125, 
   null, 
   "Truthsayer", 
   "Do either of you have any real world sources that justify writing her off as you are? Beside looney lefty sites of course? emoticon_rolleyes I didn't think so. But you keep thinking this way right up until November 4th. The easiest foe to defeat is one who doesn't know you exist. emoticon_xagree\n\n \n I got no beef with Gov. Palin. However, my wife, (who is a real world source to me) who was all gonzo over Palin's nomination, when she first hit the scene, now says, \"I'm so sick of watching that squeaky bitch\" everytime she sees Palin on TV. That's a pretty good indicator to me.\n \n I'm just sayin'..... emoticon_emb\n \n I am just agreeing that the new has seemed to have worn off. Same thing for Obama. \n \n The same people who put Obama in the commercial with Paris and Brittany seemed to have found their own \"celebrity\" candidate. But somehow, now it's ok. \n \n One problem Palin had was all the overnight media saturation she got. I think that might have hurt her. Kind of like that \"Head-On. Apply directly to the forehead\" commercial. It gets old quick.", 
   {}, 
   324767, 
   null, 
   1222304700.0
  ], 
  [
   325126, 
   null, 
   "Truthsayer", 
   "Bump....\n \n I posted this a little over a month ago. Before the lipstick. Before the Palin. Before the McCain hired the same people who smeared him, his last bid at POTUS, to run his propaganda wing in his current campaign.\n \n Obama DIDN'T keep his trap shut. They took that one sentence, sliced and diced it, and smeared him good. He shoulda listened to me. But NOoooooo.... He deserves...uh...what...uh...he gets.\n \n However, McCain is getting better at keeping his trap shut, now that he has someone out front now doing all the talking. His numbers are improving. He still has a ways to go yet. He really needs to stop talking altogether. He does seem to be coming across as the \"rebel without a clue\" as of late. (They both need to avoid interviews that require intellectual content.) He needs to just let his pretty Barbie doll handle all the motivational rhetoric from now on (and stay as far away as they can on the real issues.) All he needs to do is look presidential and be a war hero and I think he has as good of a shot as any to win. People just eat that kind of stuff up.\n\n \n It seems he has taken my advice. He wants to cancel the debate. His excuse as to why, doesn't really fly with most Americans but whatever. The important thing for him to do, especially right now, is to just lay low and keep his trap shut. Maybe, between now and election day, we'll find out that Obama likes farm animals or something. (The audicity to hope. emoticon_xdonno)", 
   {}, 
   323891, 
   null, 
   1222305000.0
  ], 
  [
   325167, 
   null, 
   "chester", 
   "It seems he has taken my advice. He wants to cancel the debate. His excuse as to why, doesn't really fly with most Americans but whatever. The important thing for him to do, especially right now, is to just lay low and keep his trap shut. Maybe, between now and election day, we'll find out that Obama likes farm animals or something. (The audicity to hope. emoticon_xdonno)\n\n \n Since McSame has declared Palin \"Absolutely\" qualified to be President, perhaps she should substitute for him in tomorrow night's debate.\n \n After all, if she's that qualified, there should be no difference.\n \n OOPS. that's exactly the problem.\n \n If McSame does a 23-Skiddoo, he will have to wear a yellow stripe up the back of his $1000 suit for the next debate.", 
   {}, 
   325126, 
   null, 
   1222353600.0
  ], 
  [
   325181, 
   null, 
   "Truthsayer", 
   "An interesting poll just came out. More than 60% of those polled found Biden to be qualified to be president and less than 40% found Palin to be qualified.\n \n I don't know how much stock people actually put into the VP running mate, and their qualifications, but in the worst case scenerio, an overwhelming majority of the people would prefer Biden over Palin, should the responsibility of POTUS happen to fall on the VP's shoulder's.", 
   {}, 
   325167, 
   null, 
   1222362120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Yes, Virginia, McCain Is Racist", 
  "url": "http://www.4forums.com/political/politics-debates/11434-yes-virginia-mccain-racist.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 11434, 
  "discussion_files": [
   [
    "1084.html", 
    "http://www.4forums.com/political/politics-debates/11434-yes-virginia-mccain-racist-print.html"
   ], 
   [
    "1085.html", 
    "http://www.4forums.com/political/politics-debates/11434-yes-virginia-mccain-racist-5-print.html"
   ], 
   [
    "1086.html", 
    "http://www.4forums.com/political/politics-debates/11434-yes-virginia-mccain-racist-4-print.html"
   ], 
   [
    "1087.html", 
    "http://www.4forums.com/political/politics-debates/11434-yes-virginia-mccain-racist-3-print.html"
   ], 
   [
    "1088.html", 
    "http://www.4forums.com/political/politics-debates/11434-yes-virginia-mccain-racist-2-print.html"
   ]
  ], 
  "identifier": 11434
 }
]