[
 [
  [
   318982, 
   null, 
   "Peeling", 
   "Regarding god's responsibility for our sin:\n \nIn the sense that he gave people freedom of choice (and therefore they can do evil if they want), sure. The only way God could have made people with the inability to sin is to make them robots, to where they were only capable of making one choice. He indeed didn't do that.\n\n Personally, I don't buy this line of argument. First, it implies that there is only one sinless path through life. This is clearly false. Making me incapable of sin is no more a denial of my free will than making me incapable of flight.", 
   {
    "post_info": {
     "post_title": "Free Will musings (derail)"
    }
   }, 
   null, 
   null, 
   1217873580.0
  ], 
  [
   319058, 
   null, 
   "Kronus", 
   "Regarding god's responsibility for our sin:\n \n Personally, I don't buy this line of argument. First, it implies that there is only one sinless path through life. This is clearly false. Making me incapable of sin is no more a denial of my free will than making me incapable of flight.\n\n \n I don't see how the statement implies only one sinless path. I think the \"one choice\" bit simply implys that at any instance where you could choose to sin or not, only the later choice would be a real option. But be that as it may, the meat of your argument is in your second point. I would say that removing your ability to sin would indeed compromise your free will. It might not turn you into a robot, that would be a bit of an overstatement, but it would cut down on the actions you could choose to take. Depending on what God we're talking about and how sin is defined you might find yourself unable to choose to rob a bank, swear, eat a hot dog, eat a hot dog on friday, talk back to your mother, not go to temple, hit someone. A gagillion choices would be taken from you. Granted, you might not notice; that's the thorny issue with free will. But clearly God would know, and appearances seem to indicate that if God exists, he's a fan of free will.", 
   {}, 
   318982, 
   null, 
   1217892360.0
  ], 
  [
   319075, 
   null, 
   "Archangel", 
   "Regarding god's responsibility for our sin:\n \n Personally, I don't buy this line of argument. First, it implies that there is only one sinless path through life. This is clearly false. Making me incapable of sin is no more a denial of my free will than making me incapable of flight.\n\n \n Forgive me Peeling, but I am missing your point. Are you suggesting that some people in this life somehow don't sin at all?", 
   {}, 
   318982, 
   null, 
   1217899980.0
  ], 
  [
   319102, 
   null, 
   "iangb", 
   "No, I think he's suggesting that God could create people that could not sin and still have free will, in the same way that he has created people that cannot fly and have free will.", 
   {}, 
   319075, 
   null, 
   1217906640.0
  ], 
  [
   319123, 
   null, 
   "Peeling", 
   "I don't see how the statement implies only one sinless path.\n\n \nThe only way God could have made people with the inability to sin is to make them robots, to where they were only capable of making one choice.\n\n I think the statement is unambiguous in that respect. 'Robots ... only capable of making one choice'. Clearly neither of us agrees with that; the difference is you're trying to reinterpret it in a way you can agree with.\n \n As it turns out, I don't agree with that version either :)\n \nBut be that as it may, the meat of your argument is in your second point. I would say that removing your ability to sin would indeed compromise your free will. It might not turn you into a robot, that would be a bit of an overstatement, but it would cut down on the actions you could choose to take. Depending on what God we're talking about and how sin is defined you might find yourself unable to choose to rob a bank, swear, eat a hot dog, eat a hot dog on friday, talk back to your mother, not go to temple, hit someone. A gagillion choices would be taken from you. Granted, you might not notice; that's the thorny issue with free will. But clearly God would know, and appearances seem to indicate that if God exists, he's a fan of free will.\n\n By that reasoning he should have made us omnipotent.\n \n I really don't think you can defend freedom to sin on the general principle that the alternative would be a restriction of free will and thus bad. Our free will is already restricted in innumerable ways by our limited capabilities - are those limitations therefore bad decisions on god's part? \n \n Indeed, any argument of the form 'if god had done this instead, it would have been suboptimal or wrong' must perforce be incorrect. By any meaningful definition of divinity, god decides what is right and good. A muslim, for instance, could not say 'if god had permitted us to eat pork that would have been bad', because that would be holding god accountable to a still higher standard, yes?\n \n The only possible reason for god doing something is that god wanted to do it. Any other argument, any other rationale or justification, introduces a standard of correctness above god to which you expect god to adhere. So: if god gave us the specific freedom to sin it was because he wanted to, not because the alternative would have been less perfect.\n \n Religious readers should bear in mind at this stage that my objective here is not to absolve myself of responsibility and blame god for my sins. Quite the reverse. Rather I am elucidating my reasons for concluding that the popular theological vision of an attentive god who defines sin and dispatches us to heaven and hell accordingly is wide of the mark. More of that later, if the discussion heads in that direction.", 
   {}, 
   319058, 
   null, 
   1217934900.0
  ], 
  [
   319160, 
   null, 
   "Kronus", 
   " \n By that reasoning he should have made us omnipotent.\n \n I really don't think you can defend freedom to sin on the general principle that the alternative would be a restriction of free will and thus bad. Our free will is already restricted in innumerable ways by our limited capabilities - are those limitations therefore bad decisions on god's part? \n\n I think we have a problem of definition here. Free will does not mean we can do anything we want. It simply means that we can want to do anything we are capable of doing. If I have free will I can choose to go out running or not; it's up to me. Free will says nothing about my being able to run a 4 minute mile. My inability to do so isn't a constraint on my will, it's a physical constraint.\n \n \n \n Indeed, any argument of the form 'if god had done this instead, it would have been suboptimal or wrong' must perforce be incorrect. By any meaningful definition of divinity, god decides what is right and good. A muslim, for instance, could not say 'if god had permitted us to eat pork that would have been bad', because that would be holding god accountable to a still higher standard, yes? \n\n No, we could hold God to a \"lower\" standard. I tend to feel that, because human standards are the only ones we have a real grasp on, they're the only standards we can trully use to judge things. God may have his own standards, but since our ability to understand the mind of God is by definition lacking we can't really use them to judge things. And, logically speaking, it is possible that by human standards God is evil. We can not discard the possibility that God is some horrendous demon that's been lulling mankind into a false sense of security for the past few thousand years and will inflict unspeakable horror upon us any day now. So no, I can't agree with the assertion that God decides what is good automatically, just as part of the definition of being God. People are capable of defining good and evil without reference to a diety, and we can use those definitions to discuss God.\n \n \n \n The only possible reason for god doing something is that god wanted to do it. Any other argument, any other rationale or justification, introduces a standard of correctness above god to which you expect god to adhere. So: if god gave us the specific freedom to sin it was because he wanted to, not because the alternative would have been less perfect.\n\n But God could surely create his own restritions if he wished, yes? He could decide that lack of free will is bad based on his own standards, not on any \"higher\" standard. He could decide that he wants people to be able to choose to not sin, which would then \"force\" him to give us free will. I can't say what was in God's mind. I don't know if he felt free will was important, and a necessary side effect of free will is the ability to sin, or if he wanted us to be able to choose to sin or not sin, and the mechanism he used to enable us to do that was free will. Either explanation fits the data we have available.\n \n \n \n Rather I am elucidating my reasons for concluding that the popular theological vision of an attentive god who defines sin and dispatches us to heaven and hell accordingly is wide of the mark. More of that later, if the discussion heads in that direction. \n\n I certainly agree with that conclusion, though I got there through a very different line of reasoning.", 
   {}, 
   319123, 
   null, 
   1217952360.0
  ], 
  [
   319340, 
   null, 
   "Peeling", 
   "I think we have a problem of definition here. Free will does not mean we can do anything we want. It simply means that we can want to do anything we are capable of doing.\n\n In which case, making us incapable of sin - or denying us the opportunity - would not infringe upon our free will.\n \nNo, we could hold God to a \"lower\" standard. I tend to feel that, because human standards are the only ones we have a real grasp on, they're the only standards we can trully use to judge things. God may have his own standards, but since our ability to understand the mind of God is by definition lacking we can't really use them to judge things. And, logically speaking, it is possible that by human standards God is evil. We can not discard the possibility that God is some horrendous demon that's been lulling mankind into a false sense of security for the past few thousand years and will inflict unspeakable horror upon us any day now. So no, I can't agree with the assertion that God decides what is good automatically, just as part of the definition of being God.\n\n Scenarios in which god is by our standards evil don't really bear upon the subject in hand, which is the 'free will' defence of a 'good' god's decision to permit sin.\n \n But ok, let's think about it for a moment anyway. First of all, as you noted we can't pretend objectivity when we speak of 'good' and 'evil' because that presupposes the aforementioned overarching standards against which god may be judged. We can speak only of our approval or disapproval. \n \nPeople are capable of defining good and evil without reference to a diety, and we can use those definitions to discuss God.\n\n I wholeheartedly agree that in reality we do define good and evil. But in a theistic context we lose ownership of those concepts - or, if you prefer and to avoid semantic confusion, they play second fiddle to the divine definition of righteousness and sin. A muslim does not get to decide that eating pork is ok. People in the bible were punished for showing mercy where god had commanded none. The theistic line is that we are not here to be good rather than evil, we are here to be righteous rather than sinful.\n \nBut God could surely create his own restritions if he wished, yes? He could decide that lack of free will is bad based on his own standards, not on any \"higher\" standard. He could decide that he wants people to be able to choose to not sin, which would then \"force\" him to give us free will.\n\n God can do what he likes, but he can't have standards; the very idea negates his divine status. Having standards means thinking 'I ought to behave one way rather than another because...', and the because implies the existence of an entity or concept to which he is beholden. God could change his mind every five minutes about the criteria for entering heaven, and he would not be wrong to do so. We might disapprove of that inconsistency, but that disapproval would be as irrelevant as thinking bacon is so tasty that we ought to be allowed to eat it. \n \n The ultimate absurdity, as far as the free will argument goes, is that our supposed reward for avoiding temptation in life is to have that freedom to sin taken away in heaven. How screwed up is that? \"Here you go: sit in front of this mouthwatering cake for seventy years or so. If you eat any, I'll burn you forever. If you manage to abstain, I'll take you somewhere where there's no cake.\"\n \n The whole idea of sin, of testing, of punishment and reward really doesn't make sense when put in a divine context. The nobility and worthiness of facing a test is itself subjective, part of the human condition; a reflection of the tribal rites of passage we employ to test individual commitment to the collective. Why would god, who faced no entrance exam to secure his status and can do as he likes with utter impunity, feel that testing creatures for worthiness is somehow appropriate?\n \nI certainly agree with that conclusion, though I got there through a very different line of reasoning.\n\n Sure. For instance, what kind of mind spins the entire roaring cosmos out of nothing, then bends down to a microscopic mote of dust whirling through the infinite splendour and whispers to one of the infinitesimal, awestruck inhabitants: \"By the way, if you eat those little shrimp guys? I'm gonna torture you for eternity. But I'm only gonna tell you this, so you'd better make sure everyone listens.\"", 
   {}, 
   319160, 
   null, 
   1218028800.0
  ], 
  [
   319346, 
   null, 
   "Kronus", 
   "\"It simply means that we can want to do anything we are capable of doing.\"\n \n In which case, making us incapable of sin - or denying us the opportunity - would not infringe upon our free will. \n\n I guess I wasn't clear enough. The above should have read \"physically capable of doing\". Let's say talking back to your mother is a sin. If God had created us without tounges so that there would be no way we could talk back that would be one thing. But we do have tounges, we can talk back. Now, when you say \"making us incapable of sin\", I am not imagining that He's ripping out everyone's tounges. To change our physical form to the point where we could commit no sins at all would alter us to the point of unrecognizability. No, I'm imagining that he simply alters us so that we can't decide to talk back to our mothers. A mental change, not a physical one. And thus a limit to our free will. Or you thinking that the changes that God would make to render us sin free would be physical?\n \n \n\n Scenarios in which god is by our standards evil don't really bear upon the subject in hand, which is the 'free will' defence of a 'good' god's decision to permit sin. \n\n True enough. I got distracted, sorry. emoticon_xangel \n \n \n\n God can do what he likes, but he can't have standards; the very idea negates his divine status. Having standards means thinking 'I ought to behave one way rather than another because...', and the because implies the existence of an entity or concept to which he is beholden. \n\n I don't see that in the least. Why couldn't a diety choose to follow the concpets of justice and mercy, to pick a couple at random? As you say, he could change his mind later if he wished, he wouldn't be bound for all eternity. He has simply decided that, for now, justice and mercy will be the standards by which he runs things. That wouldn't make him any less omnipotent, as long as he was the one choosing to follow those concepts and he was free to change his mind at will.\n \n \n\n The ultimate absurdity, as far as the free will argument goes, is that our supposed reward for avoiding temptation in life is to have that freedom to sin taken away in heaven. \n\n No, that's the absurdity of one religion's take on things. It has nothing to do with the free will argument per se.\n \n \n\n The whole idea of sin, of testing, of punishment and reward really doesn't make sense when put in a divine context. The nobility and worthiness of facing a test is itself subjective, part of the human condition; a reflection of the tribal rites of passage we employ to test individual commitment to the collective. Why would god, who faced no entrance exam to secure his status and can do as he likes with utter impunity, feel that testing creatures for worthiness is somehow appropriate?\n\n If God is omniscient he would know right off the bat, wouldn't he? That's why I tend to find the idea that life is a learning process, rather than a test, to make more sense.", 
   {}, 
   319340, 
   null, 
   1218033720.0
  ], 
  [
   319369, 
   null, 
   "Peeling", 
   "I guess I wasn't clear enough. The above should have read \"physically capable of doing\". Let's say talking back to your mother is a sin. If God had created us without tounges so that there would be no way we could talk back that would be one thing. But we do have tounges, we can talk back. Now, when you say \"making us incapable of sin\", I am not imagining that He's ripping out everyone's tounges. To change our physical form to the point where we could commit no sins at all would alter us to the point of unrecognizability.\n\n Unrecognisable to us as we are now, perhaps, but entirely normal to our hypothetical peers. It begs the same question: why create creatures capable of doing things you've decided are sinful? Or equivalently, why decide that some things you knew perfectly well those creatures you've made are capable of, even inclined towards, are sinful? \n \nNo, I'm imagining that he simply alters us so that we can't decide to talk back to our mothers. A mental change, not a physical one. And thus a limit to our free will. Or you thinking that the changes that God would make to render us sin free would be physical?\n\n I recall the old maxim: if god hadn't intended us to masturbate, he would have given us shorter arms :)\n \n I think you're making a false distinction. Our moods and attitudes are subject to chemical influence, either imbibed or secreted by our own physical body. Where do you draw the line between a physical restriction and a mental one? In any case, our mental capacity, and thus our ability to imagine things to want to do is not limitless, so why should one more restriction matter so much?\n \nI don't see that in the least. Why couldn't a diety choose to follow the concpets of justice and mercy, to pick a couple at random? \n\n Certainly he could decide to behave in a way we would describe as just and merciful. It's just that they don't count as 'standards'.\n \nAs you say, he could change his mind later if he wished, he wouldn't be bound for all eternity. He has simply decided that, for now, justice and mercy will be the standards by which he runs things. That wouldn't make him any less omnipotent, as long as he was the one choosing to follow those concepts and he was free to change his mind at will.\n\n Consider: if I walk down the street shooting people, am I a law-abiding citizen in the periods of time between shots?\n \n Likewise, if god is truly free to decide to stop being just and merciful at any time, without a backward glance or a stain on his character, then he is not truly following those concepts. Standards are something we adhere to even when they're inconvenient, and if we transgress then we have done something wrong. If one merely plays at being merciful for a time, no strings attached, one is inherently no better than, say, Amon Goth in Schindler's List.\n \nNo, that's the absurdity of one religion's take on things. It has nothing to do with the free will argument per se.\n\n I don't follow that; sorry :) The free will argument is used to defend god's creation of a sin-prone mankind, given that a sinless heaven or an endless hell awaits us after death. Sure, if you remove the heaven and hell part you're free to say that god wanted to give us the freedom to sin - but now the argument has no point upon which to bear. It's reduced to a simple observation.\n \nIf God is omniscient he would know right off the bat, wouldn't he? That's why I tend to find the idea that life is a learning process, rather than a test, to make more sense.\n\n No argument there - but the heaven/hell scenario very much is a test.\n \n Tests like that - putting temptation in someone's way and seeing if they bite - make sense in the context of mankind, where for our collective benefit we must forge a society out of parts that are not all necessarily inclined towards cooperation. Rites of passage, tribal or civilised, are geared towards identifying those who are appreciative of and commited to the group. That's why we find self-sacrifice noble and worthy. I think it's a mistake to assume that we would be somehow less noble and worthy if temptation, or the inclination or ability to succumb to it, were not a part of our nature.", 
   {}, 
   319346, 
   null, 
   1218043860.0
  ], 
  [
   319391, 
   null, 
   "Kronus", 
   " Unrecognisable to us as we are now, perhaps, but entirely normal to our hypothetical peers. It begs the same question: why create creatures capable of doing things you've decided are sinful? Or equivalently, why decide that some things you knew perfectly well those creatures you've made are capable of, even inclined towards, are sinful? \n \n I recall the old maxim: if god hadn't intended us to masturbate, he would have given us shorter arms \n \n I think you're making a false distinction. Our moods and attitudes are subject to chemical influence, either imbibed or secreted by our own physical body. Where do you draw the line between a physical restriction and a mental one? In any case, our mental capacity, and thus our ability to imagine things to want to do is not limitless, so why should one more restriction matter so much?:) \n\n Ok, if God is willing to go the complete teardown and rebuild route on humanity, then he could make us sin free without compromising free will. I was assuming we weren't taking things to quite that extreme when I made my previous statements. We couldn't still be us and sin free without the removal of free will, but if you're willing to turn people into something utterly other then you could pull it off.\n \n \n\n Certainly he could decide to behave in a way we would describe as just and merciful. It's just that they don't count as 'standards'. \n\n Ok, but this is really just playing with semantics. The original point was that God could construct his own rules on how he was going to behave. If you don't like the term \"standards\" then fine, but the point still stands. Though, I confess, I don't recall exactly where the point was supposed to lead. :) Something about possible restrictions on God's choices while still having him be omnipotent, I think.\n \n \n\n I don't follow that; sorry :) The free will argument is used to defend god's creation of a sin-prone mankind, given that a sinless heaven or an endless hell awaits us after death. \n\n I'm trying to make as few unwarranted assumptions as possible. For the sake of argument I'll assume God exists, he has things he wants us not to do which we call sins, and we are capable of sinning. These are assumptions which, I think, can lead to interesting realms of discussion. But if we start taking things like God's motives, heaven, and hell as givens, rather than just one of many possibilities, then we are undully limiting the scope of discussion. As I've already said, I don't think the \"test\" theory works well, so if we take \"testing\" as a given then we're doomed out of the gate.\n \n \n\n Tests like that - putting temptation in someone's way and seeing if they bite - make sense in the context of mankind, where for our collective benefit we must forge a society out of parts that are not all necessarily inclined towards cooperation. Rites of passage, tribal or civilised, are geared towards identifying those who are appreciative of and commited to the group. That's why we find self-sacrifice noble and worthy. I think it's a mistake to assume that we would be somehow less noble and worthy if temptation, or the inclination or ability to succumb to it, were not a part of our nature. \n\n Certainly there are ways of demonstrating nobility and worthiness other than overcoming temptation, but overcoming temptation does demonstrate nobility and worthiness. If you've never had a chance to demonstrate your nobility, then how noble are you? If it's never been put to the test, then it's really just potential nobility, not actual nobility. It's like Schroedinger cat; until you open the box and check you can't say anything about it one way or the other. The more nobility you demonstrate, the more noble you are. So I would argue that without temptation we would be less noble.", 
   {}, 
   319369, 
   null, 
   1218050880.0
  ], 
  [
   319428, 
   null, 
   "unkerpaulie", 
   "Trying to follow the discussion here, it seems as though the only way we could create a scenario where free will exists and everyone can be sinless is to change the definition of sin. Sin would be now defined among things which we are either physically incapable of doing or mentally incapable of conceiving. So everything would be ok. I assume this is where Peeling is heading. The concept of sin would simply cease to exist, and everything would simply be actions. \n \n Kronus, I can't see how a scenario of \"only good choices\" could exist and there could still be free will. Let's say we took away the option of not saying please. Then saying please would be instantaneous and automatic after every request we made. First of all, saying please would have to be hardwired permanently into our language faculties. Second, the word \"please\" as a gesture of courtesy would lose all meaning. The result: robots. As far as saying please would be concerned, we would be completely automonous as far as that is concerned. \n \n I think that even if the concept of sin were to vanish like I said in my first paragraph, everything would be permissible without it being sin, but that wouldn't make everything a good idea. The concept of good and bad would still exist. We'd still prefer certain actions over others. Our basic intincts to seek comfort and avoid pain would still be intact and guide us as it were as to which options would help us acheive our primal goals.", 
   {}, 
   319391, 
   null, 
   1218074400.0
  ], 
  [
   319433, 
   null, 
   "Kronus", 
   " Trying to follow the discussion here, it seems as though the only way we could create a scenario where free will exists and everyone can be sinless is to change the definition of sin.\n\n Or change the definition of \"everyone\"; change humanity into something else for which the previous set of sins simply don't apply.\n \n \n \n Kronus, I can't see how a scenario of \"only good choices\" could exist and there could still be free will. \n\n That was rather my point. The only way people could only make good choices and still be even remotely human is by the removal of free will, at least to some degree. I was just trying to say that we would be something more than mere robots. To my mind a robot is something in which everything is programmed, all actions are preordained. You could trim humanity's free will to the point where we couldn't sin but still leave us enough latitude to decide what shirt to wear or what to eat for lunch.\n \n \n \n I think that even if the concept of sin were to vanish like I said in my first paragraph, everything would be permissible without it being sin, but that wouldn't make everything a good idea. The concept of good and bad would still exist. We'd still prefer certain actions over others. Our basic intincts to seek comfort and avoid pain would still be intact and guide us as it were as to which options would help us acheive our primal goals. \n\n I suspect that it's not a huge coincidence that most things that are considered sins are also considered bad ideas. Theft, murder, assault; these are all things that get in the way of a smoothly running society, regardless of what God might think about them. Even the Jewish dietary laws make sense when applied to a nomadic desert dwelling people with no refrigerators. Not all sins fall into this category of course, some are invented for other, more political, purposes. But I suspect that if God took away our ability to sin as we currently understand it, but other bad ideas were still able to be acted upon, we would shortly conclude that acting upon those bad ideas was sinful.", 
   {}, 
   319428, 
   null, 
   1218075360.0
  ], 
  [
   319512, 
   null, 
   "Peeling", 
   "Ok, if God is willing to go the complete teardown and rebuild route on humanity, then he could make us sin free without compromising free will. I was assuming we weren't taking things to quite that extreme when I made my previous statements. We couldn't still be us and sin free without the removal of free will, but if you're willing to turn people into something utterly other then you could pull it off.\n\n Quite, but that wasn't what I was angling for. The issue is not why doesn't god change us, but why were we made one way rather than another in the first place? The free will argument attempts to answer that question by justifying what is over what could have been. My rebuttal is that:\n \n 1. Eliminating the ability/inclination/opportunity to sin would not impact upon our free will to any greater extent than the multitude of limitations by which we are already bound.\n \n 2. Any argument of the form 'if god had done X instead of Y it would be bad' must be meaningless, because it implies that we can stand in judgement of god's work.\n \n 3. The free will argument is pure after-the-fact rationalisation. Were we all incapable of sin, we would equally readily defend that decision as being far superior to the alternative.\n \n \nOk, but this is really just playing with semantics. The original point was that God could construct his own rules on how he was going to behave. If you don't like the term \"standards\" then fine, but the point still stands.\n\n Again, you can't call them 'rules' if you can break them at any time without a qualm - which is what's required for god to remain omnipotent. There is merely a decision to behave in a certain way for an unspecified time. Standards, rules, should be something that allows us to trust someone, yes? You can't trust someone who reserves the right to do whatever the heck he likes any time he wants - that's not to say we can't 'trust' god, merely that it's inappropriate to think of his behaviour as representing a code of conduct, or set of standards.\n \n \nI'm trying to make as few unwarranted assumptions as possible. For the sake of argument I'll assume God exists, he has things he wants us not to do which we call sins, and we are capable of sinning. These are assumptions which, I think, can lead to interesting realms of discussion. But if we start taking things like God's motives, heaven, and hell as givens, rather than just one of many possibilities, then we are undully limiting the scope of discussion. As I've already said, I don't think the \"test\" theory works well, so if we take \"testing\" as a given then we're doomed out of the gate.\n\n I understand - I ought to have been more clear from the outset. I agree that there's no inherent problem reconciling some sort of god, free will, and freedom to sin. It's the additional caveats of motive, heaven and hell that cause the internal inconsistencies I'm highlighting.\n \nCertainly there are ways of demonstrating nobility and worthiness other than overcoming temptation, but overcoming temptation does demonstrate nobility and worthiness.\n\n Yes, but what is it makes that a good thing? It's like saying that smoking a cigarette does stop the cravings, so smoking a cigarette has some value. \n \nIf you've never had a chance to demonstrate your nobility, then how noble are you?\n\n In terms of what you actually do, you're as noble as the most noble person imaginable! It's just that being that way doesn't make you better than Joe Bloggs next door, because he's also as noble as all get-out. Is it really worth people burning in hell just so nice people have someone to contrast themselves with?\n \nSo I would argue that without temptation we would be less noble.\n\n Certainly we wouldn't make such a song and dance about nobility, but at the same time we would all, in actual fact, be behaving marvellously - so what's the problem? It seems to me that it only matters if you're interested in differentiating yourself from others along that particular axis.", 
   {}, 
   319391, 
   null, 
   1218134040.0
  ], 
  [
   319519, 
   null, 
   "MrWriteLA", 
   "Much as I've been enjoying this conversation... how refreshing it is to listen to two adults conversing... I'm afraid I'm starting to get a bit muddled keeping track of the various points and hypetheses.\n \n However, it does seem to me that bad and good can have no meaning except in relationship to each other. Without the ability to sin, not sinning would be just the norm, unworthy of praise or reward. If all land were the height of Everest, there could be no concept of a mountain or even height, as everything would be a flat plain. Which would be boring, if nothing else.", 
   {}, 
   319512, 
   null, 
   1218137040.0
  ], 
  [
   319532, 
   null, 
   "Kronus", 
   " \n I understand - I ought to have been more clear from the outset. I agree that there's no inherent problem reconciling some sort of god, free will, and freedom to sin. It's the additional caveats of motive, heaven and hell that cause the internal inconsistencies I'm highlighting.\n\n Then we have a problem. We're taking a group of things that don't mesh well: a benevolent God, free will, and eternal damnation. To me hell is the least compatable component there, it's the one I'll vote to discard. You want to keep that bit and use it as a basis for discussion. But I see assuming the existence of hell as being so absurd that any argument based on that assumption is going to be meaningless. Which I suppose is sort of your point; you're trying to show inconsistencies. But I find the basic premise so obviously wrong that the inconsisitencies that arise from it aren't of any real interest to me. If that's the area you're looking to explore than I don't think I can provide you with much in the way of interesting feedback.", 
   {}, 
   319512, 
   null, 
   1218140700.0
  ], 
  [
   319565, 
   null, 
   "unkerpaulie", 
   "\n 1. Eliminating the ability/inclination/opportunity to sin would not impact upon our free will to any greater extent than the multitude of limitations by which we are already bound.\n \n\n There is a difference between what we can be willing to do and what we can be able to do, and they limit us in different ways. Free will suggests that we can be willing to do anything we want, even if we may not be able to do it. My inability to smash bricks with my head does not hinder me from wanting the ability to do so. If, as you suggest, we eliminate the option to sin, then it will be a restriction on our free will, even if our physical abilities remain intact. \n \n \n2. Any argument of the form 'if god had done X instead of Y it would be bad' must be meaningless, because it implies that we can stand in judgement of god's work.\n \n\n This is in accordance to the idea that God shouldn't need standards or any type of code of conduct to adhere to if he is indeed omnipotent and the ultimate authority on all things. But if we assume that God is benevolent to humans, then such a code of conduct must exist. Human survival is contingent on certain environmental factors, and threats to our survival are classified as evil. A benevolent God would at the very least minimise the evil that befalls those he loves. \n \n \n3. The free will argument is pure after-the-fact rationalisation. Were we all incapable of sin, we would equally readily defend that decision as being far superior to the alternative.\n \n\n If we were incapable of sin, then we would not even be aware that alternative decisions exist, and there would be no rationalization because a decision never occured. Remember that sin in thought is just as much a sin as sin in deed. Malicious motivation and creating wicked ideas, even though never put into practice, is still considered sin. That is why a lack of physical ability to do certain things does not hamper with\n free will. \n \n We haven't defined God properly so every single characteristic of God is an assumption. We assume that God is omnipotent and benevolent. We assume that he is incontingent and omniscient. The entire question is based on pleading for premise.", 
   {}, 
   319512, 
   null, 
   1218150720.0
  ], 
  [
   319684, 
   null, 
   "simone", 
   "Why would one wish to be sinless? That doesn't sound like any fun at all.", 
   {}, 
   318982, 
   null, 
   1218228720.0
  ], 
  [
   319768, 
   null, 
   "DrD", 
   "It is NOT inconsistent to have FREE WILL and NOT to sin. Would it be not true that man could have free will about everything except sinning? I think god was toying with us if this is man's argument.", 
   {}, 
   319532, 
   null, 
   1218301860.0
  ], 
  [
   319839, 
   null, 
   "unkerpaulie", 
   "Let's say lying is a sin. If I ask you \"are youbstanding up?\" your answer can either be yes or know (assuming that you know if you're standing or not). Let's say you're sitting. If you answer yes to the question, you're sinning. \n \n Now we're in a situation where we have free will about everything except sinning. Lying is not an option, so you cannot answer yes to the question even if you wanted to. In fact, you cannot even want to answer yes to the question. There is no choice in the matter. If we are taking away choices, we are taking away free will for certain things. \n \n Additionally, if sin wasn't a matter of choice then sin wouldn't exist because there would be no need for biblical commandments. God wouldn't have to tell people what not to do because it would be absurd. If I'm incapable of fornicating then a commandment telling me don't fornicate is pointless.", 
   {}, 
   319768, 
   null, 
   1218358860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Free Will musings (derail)", 
  "url": "http://www.4forums.com/political/religion-debates/11442-free-will-musings-derail.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 11442, 
  "discussion_files": [
   [
    "30036.html", 
    "http://www.4forums.com/political/religion-debates/11442-free-will-musings-derail-print.html"
   ], 
   [
    "30037.html", 
    "http://www.4forums.com/political/religion-debates/11442-free-will-musings-derail-2-print.html"
   ]
  ], 
  "identifier": 11442
 }
]