[
 [
  [
   318937, 
   null, 
   "Galileo", 
   "This is the story of two Marys. Both are in their early 60s, heavyset, with curly reddish hair. But for years they have worked on opposite ends of the same issues. Mary McFate is an advocate of environmental causes and a prominent activist within the gun control movement. For more than a decade, she volunteered for various gun violence prevention organizations, serving on the boards of anti-gun outfits, helping state groups coordinate their activities, lobbying in Washington for gun control legislation, and regularly attending strategy and organizing meetings. \n \n Mary Lou Sapone, by contrast, is a self-described \"research consultant,\" who for decades has covertly infiltrated citizens groups for private security firms hired by corporations that are targeted by activist campaigns. For some time, Sapone also worked for the National Rifle Association. \n \n But these two Marys share a lot in common&#8212;a Mother Jones investigation has found that McFate and Sapone are, in fact, the same person. And this discovery has caused the leaders of gun violence prevention organizations to conclude that for years they have been penetrated&#8212;at the highest levels&#8212;by the NRA or other pro-gun parties. \"It raises the question,\" says Paul Helmke, the president of the Brady Campaign to Prevent Gun Violence, \"of what did she find out and what did they want her to find out.\".....\n \n During Sapone&#8217;s ascent through the ranks of the gun control movement, she worked for the NRA, according to a business associate. In a 2003 deposition, Tim Ward, who had been president of the Maryland-based security firm Beckett Brown International, said that the NRA had been &#8220;a client&#8221; of Sapone&#8217;s. (As a subcontractor for BBI, Sapone had planted an operative within an environmental group in Lake Charles, Louisiana.) According to Ward, at his request Sapone had introduced BBI to the NRA in early 1999. And that introduction quickly paid off. Billing records obtained by Mother Jones indicate that between May 1999 and April 2000, the NRA paid BBI nearly $80,000 for various services&#8230;.\n\n http://www.motherjones.com/news/feature/2008/07/mary-mcfate-sapone-gun-lobby-nra-spy.html\n \n Wow, spying on your rivals to gain political advantage- this is beginning to sound like Watergate. Do pro-gun activists feel so threatened by the Brady Campaign that they feel the need to stoop to such a level? This also reminds of the John Lott fiasco because he also used another name to mislead people and to promote his book, More Guns Less Crime.", 
   {
    "post_info": {
     "post_title": "Watergate All Over Again?"
    }
   }, 
   null, 
   null, 
   1217837340.0
  ], 
  [
   318977, 
   null, 
   "Omegamon_X", 
   "So a member of the Brady Bunch to End Gun Ownership has actually been giving insider information to the NRA. Very interesting.", 
   {}, 
   318937, 
   null, 
   1217869500.0
  ], 
  [
   318979, 
   null, 
   "iangb", 
   "So a member of the Brady Bunch to End Gun Ownership has actually been giving insider information to the NRA. Very interesting.\nYou say it as if she wasn't put there with the intention of giving information to the NRA...", 
   {}, 
   318977, 
   null, 
   1217870880.0
  ], 
  [
   319124, 
   null, 
   "Brady", 
   "such are the lying, two faced, deceitful, and sneaky ways of the NRA and gun nuts..", 
   {}, 
   318979, 
   null, 
   1217936700.0
  ], 
  [
   319147, 
   null, 
   "Omegamon_X", 
   "such are the lying, two faced, deceitful, and sneaky ways of the NRA and gun nuts..\n\n \n So joining the Brady Campaign is deceitful?", 
   {}, 
   319124, 
   null, 
   1217948760.0
  ], 
  [
   319170, 
   null, 
   "Bryan", 
   "such are the lying, two faced, deceitful, and sneaky ways of the NRA and gun nuts..\n\n \n Lott used a fictional female name, \"Mary Rosh,\" to post praise of his book. \n \n I condemned it when it happened even though it was eagerly seized upon as a means to try and deflect the fallout from the implosion of Michael Bellesiles' \"Arming America.\" I have no reason to dispute the posted article which started this thread. If the NRA has engaged in spying on any organization then I also condemn it. And in my opinion others who claim to support gun ownership should condemn it as well. \n \n But this is not the only reason why I post. I find it ironic to see Brady reappear to offer feigned indignation. \n \n I see, Brady, that you have quietly abandoned the lie you started your \"Rise in police deaths because no ban on assault weapons\" thread with. \n \n Is this the method of your posting, Brady-post a lie, and then run from the lie while pretending that criticism of it does not exist? \"Such are the lying, deceitful, and sneaky ways,\" indeed. \n \n I don't post here every day, Brady. But I have not gone away. It will never be \"time to kick gun nut butt\" so long as you continue to run from me (unless, of course I am not included in your definition of \"gun nut\"). \n \n ---\n \n Hypocrisy noun (or the state of being a hypocrite):\n The act of preaching a certain belief or way of life, but not, in fact, holding these same virtues oneself.\n See also linguist and social analyst Noam Chomsky, defining hypocrisy as the refusal to \"...apply to ourselves the same standards we apply to others\"\n See also Brady's complaint (quoted above) of the actions of others as compared to his actions on this web site.", 
   {
    "unicode_changes_made": true
   }, 
   319124, 
   null, 
   1217953680.0
  ], 
  [
   319178, 
   null, 
   "iangb", 
   "So joining the Brady Campaign is deceitful?\nI would say that joining any campaign under a false name with the intention of giving insider information to that campaign's opponents is deceitful, yes.", 
   {}, 
   319170, 
   null, 
   1217955540.0
  ], 
  [
   319841, 
   null, 
   "Galileo", 
   "Some of the reactions of gun control advocates...\n \n \" 'It's surprising that the NRA had nothing better to do but put a mole into an organization such as CeaseFire PA,' said City Councilwoman Donna Reed Miller, who is locked in a legal battle with the state over gun-control legislation she cosponsored with Councilman Darrell Clarke. 'It must mean they're afraid of something.'\n \n \" 'It shows what radical ideologues have to do when they don't have the public or citizens on their side. They cheat,' said Joe Grace, executive director for CeaseFire PA.\"\n http://www.philly.com/inquirer/front_page/20080801_A_trusted_Pa__gun-control_ally_____and_NRA_spy_.html\n \n \"The NRA refused to comment to the magazine and did not respond to calls Tuesday from The Associated Press. Nor did McFate....\n \n \"Bryan Miller, executive director of Ceasefire NJ, said he feels betrayed by McFate. Miller's brother, an FBI agent, was shot to death in 1994.\n \n \" 'To have somebody that I consider a friend, have been with dozens of times, shared meals with, treated as a friend, to have her be an employee, a subcontracted spy for the NRA, is just mind-boggling. It's so venal,' Miller said. 'In the battle of ideas with the gun lobby, we're at a constant disadvantage because we're honest'..... \n \n \" 'I feel flattered that the NRA would feel that they would have to infiltrate Ceasefire of PA. Obviously, they're hearing our footsteps,\" said Phil Goldsmith, the group's president. 'Frankly, I think it's a waste of their money. We don't deal in state secrets.'\"\n http://www.huffingtonpost.com/2008/08/06/nra-refuses-to-comment-on_n_117213.html\n \n By refusing to comment the NRA isn't doing much to make itself appear innocent. If the allegations are true then it seems to me to be clear evidence that the NRA is not above supporting outright lying to advance its own agenda and thus it would seriously damage the NRA's credibility. Gun control organizations would be able to use this against the NRA for years to come. Of course, the extremists and really hard core believers of pro-gun ideology are unlikely to be swayed as so often happens in groups like this.", 
   {}, 
   319178, 
   null, 
   1218365580.0
  ], 
  [
   319848, 
   null, 
   "Omegamon_X", 
   "Just because we haven't found a Brady spy in the NRA doesn't mean that they're above such dirty tactics.\n \n You really have to ask yourself something about this. If this woman was a double agent, why is the Brady Campaign just now finding out? Why did it take them 20 years to learn the truth? Could it be that the Brady Campaign has a habit of not researching anything on any real depth and simply taking anything and everything at face value?", 
   {}, 
   319841, 
   null, 
   1218381780.0
  ], 
  [
   319851, 
   null, 
   "Omegamon_X", 
   "By refusing to comment the NRA isn't doing much to make itself appear innocent.\n\n \n So whenever I shoot you down when you make an erroneous claim, the fact that you don't comment for a long stretch of time means that you're guilty of lying?", 
   {}, 
   319841, 
   null, 
   1218383880.0
  ], 
  [
   319876, 
   null, 
   "DrNo", 
   "The president of the Brady Campaign said this \"raises the question of what did she find out.\" Is he saying there was something to \"find out?\"", 
   {}, 
   319851, 
   null, 
   1218398400.0
  ], 
  [
   319881, 
   null, 
   "Omegamon_X", 
   "By refusing to comment the NRA isn't doing much to make itself appear innocent.\n\n \n Last year after Virginia Tech, the NRA remained silent the entire day as a sign of mourning those that were murdered for senseless purposes. The Brady Bunch, on the other hand, was immediately asking for donations of $32 ($1 for every dead victim) within 10 minutes of the news hitting the airwaves.\n \n Sometimes it's more important to know what not to say and when not to say it, than it is to try and offer a comment of any sort at the wrong time.", 
   {}, 
   319841, 
   null, 
   1218401160.0
  ], 
  [
   319888, 
   null, 
   "Shooterandproud", 
   "Oh boy, more deceptive campaigning from the anti 2nd amendments. First blame the NRA for a bombing, then blame them for spying on the Brady Campaign To Promote Mugging and Robbery.\n \n I notice that the NRA and Second Amendment rights advocates take the high road, instead of accusing the opposite party of such ridiculous things.\n \n In fact, I even found a Gun Rights forum called TheHighRoad.org\n \n Interesting. I wonder what we'll be accused of next, maybe enlisting the help of aliens to support our cause? Maybe the evil NRA will build a giant mind control device to make everyone vote to allow evil guns to be legal. I wouldn't put it past the Brady bunch.\n \n I really wish they would start presenting actual facts instead making uncalled for accusations.", 
   {}, 
   319881, 
   null, 
   1218406380.0
  ], 
  [
   320051, 
   null, 
   "Galileo", 
   "Omegamon X,\n I think you're just grasping at straws and don't have much of an argument.\n \n Shooterandproud,\n I don't think the Brady Campaign is making things up. You might be interested to know that a US Senator has written a letter to the NRA in which he urges the NRA to come clean. From his letter to the NRA:\n \n \n \"In light of these serious charges, I call upon you to immediately:[*]Admit whether these charges are true or false; \n [*]If these charges are true, disclose the precise nature of the NRA&#8217;s relationship with Mary McFate/Mary Lou Sapone, including how much she was paid, the time periods for which she received payment and the services she provided; \n [*]Make public the names (including any aliases) of any other NRA employees, consultants, members, or volunteers who have joined gun violence prevention organizations in order to report to the NRA on their activities; and \n [*]Denounce and discontinue the practice of asking or encouraging NRA employees, consultants, members and volunteers to infiltrate gun violence prevention groups.\"Although the NRA and I certainly have had our disagreements over the years, I hope that we can agree that the gun violence prevention debate should be based upon an open and honest exchange of ideas, not on underhanded tactics.\" \n http://lautenberg.senate.gov/newsroom/record.cfm?id=301911&", 
   {}, 
   319888, 
   null, 
   1218564180.0
  ], 
  [
   320073, 
   null, 
   "Omegamon_X", 
   "Omegamon X,\n I think you're just grasping at straws and don't have much of an argument.\n\n \n I think you're wrong.\n \n \nShooterandproud,\n I don't think the Brady Campaign is making things up.\n\n \n And what of their claims that a single shot from a .50 BMG rifle will blow a plane right out of the sky?", 
   {}, 
   320051, 
   null, 
   1218582600.0
  ], 
  [
   320075, 
   null, 
   "GazzaElliott", 
   "And what of their claims that a single shot from a .50 BMG rifle will blow a plane right out of the sky?\n\n \n Seriously? If they think it does I want some of that ammo! Save me loads on the Stingers....", 
   {}, 
   320073, 
   null, 
   1218583680.0
  ], 
  [
   320080, 
   null, 
   "Shooterandproud", 
   "\n Shooterandproud,\n I don't think the Brady Campaign is making things up. You might be interested to know that a US Senator has\n\n \n They've lost all credibility after this video:\n \n http://www.youtube.com/watch?v=A-U4uOz1_Jo&watch_response\n \n \n If the antis didn't lie and falsify information so much I might believe you.", 
   {}, 
   320051, 
   null, 
   1218586140.0
  ], 
  [
   320272, 
   null, 
   "Brady", 
   "the sh*t has hit the fan and its the begining of the end for gun nuts", 
   {}, 
   320080, 
   null, 
   1218715080.0
  ], 
  [
   320276, 
   null, 
   "Symbiote", 
   "I think it's hilarious that it's so easy to pretend to be in favour of gun control and rise to the top, what's next \"Scientists infiltrates creationist league\"?", 
   {}, 
   320272, 
   null, 
   1218716700.0
  ], 
  [
   320295, 
   null, 
   "Omegamon_X", 
   "the sh*t has hit the fan and its the begining of the end for gun nuts\n\n \n Then how come we're getting more laws passed than your side?\n \n Look around dude, more and more people are speaking out in opposition to gun control and seeing that it isn't the answer. Even the Supreme Court supports us.", 
   {}, 
   320272, 
   null, 
   1218729060.0
  ], 
  [
   320324, 
   null, 
   "Ethmi", 
   "the sh*t has hit the fan and its the begining of the end for gun nuts\n\n \n This post is either indicitive of ignorance of the world around you, or of desperation to make us lose confidence..", 
   {}, 
   320272, 
   null, 
   1218753240.0
  ], 
  [
   320466, 
   null, 
   "obvious_child", 
   "Seriously? If they think it does I want some of that ammo! Save me loads on the Stingers....\n\n \n In theory it is possible. Depends on the plane and where you hit it. Snipers disable vehicles and equipment with barrets.", 
   {}, 
   320075, 
   null, 
   1218858540.0
  ], 
  [
   320479, 
   null, 
   "Omegamon_X", 
   "In theory it is possible. Depends on the plane and where you hit it. Snipers disable vehicles and equipment with barrets.\n\n \n And yet no sniper has ever blown a plane out of the sky with any kind of rifle. Disabling a plane that's sitting on the runway is completely different from skeet shooting it.", 
   {}, 
   320466, 
   null, 
   1218863940.0
  ], 
  [
   320487, 
   null, 
   "Penfold", 
   "Care to provide evidence for that sweeping claim?", 
   {}, 
   320479, 
   null, 
   1218885000.0
  ], 
  [
   320490, 
   null, 
   "Omegamon_X", 
   "Care to provide evidence for that sweeping claim?\n\n \n I would if there was any evidence to present. But there's never been a case of a plane being blown out of the sky by a single hit from a rifle.", 
   {}, 
   320487, 
   null, 
   1218898140.0
  ], 
  [
   320495, 
   null, 
   "Penfold", 
   "By \"blown out of the sky\" do you you mean shot down, or some explosive device launched from a rifle? You also narrowed your definition to exclude machine guns and automatic weapons..Do I detect a wriggle coming on? ;)", 
   {}, 
   320490, 
   null, 
   1218902400.0
  ], 
  [
   320497, 
   null, 
   "Archangel", 
   "the sh*t has hit the fan and its the begining of the end for gun nuts\n\n \n As long as your side lies and makes such obviously ridiculous statements as this video shows, we have nothing to fear about you ever being taken seriously. Here, a woman claims that bullets have heat seeking capabilities as she completely misrepresents the 50 cal. But hey, if the truth wont cut it, then just lie in order to motivate through fear, right?\n \n http://www.youtube.com/watch?v=BRQqieimwLQ&feature=related\n \n And btw, watergate was about political dirty tricks regarding the potential manipulation of a National Presidential Election. A very serious charge. What you are discussing is not even to the level of industrial espionage. Which is why it hasn't even caused a blip on any News cycles.", 
   {}, 
   320272, 
   null, 
   1218903480.0
  ], 
  [
   320501, 
   null, 
   "Omegamon_X", 
   "You also narrowed your definition to exclude machine guns and automatic weapons..Do I detect a wriggle coming on? ;)\n\n \n No, I excluded machineguns because there's no point in leaving them in the discussion. Machineguns and anti-plane weapons are tightly restricted or outright banned and impossible to get from any gun shop, so there's no point in leaving them up for debate here.\n \n The anti-gun nuts aren't making claims about .50 caliber machineguns being able to take planes down, they're saying these single shot rifles are the prime choice of terrorists who're buying them up, taking them back to the middle east and using them to shoot down our aircraft. And all they're doing by promoting these claims are showing that they'll lie about anything just to spread their own hate-filled message, and that they'll disregard basic physics as long as what they say sounds scary enough.", 
   {}, 
   320495, 
   null, 
   1218906420.0
  ], 
  [
   320512, 
   null, 
   "Penfold", 
   "No, I excluded machineguns because there's no point in leaving them in the discussion. Machineguns and anti-plane weapons are tightly restricted or outright banned and impossible to get from any gun shop, so there's no point in leaving them up for debate here.\n \n The anti-gun nuts aren't making claims about .50 caliber machineguns being able to take planes down, they're saying these single shot rifles are the prime choice of terrorists who're buying them up, taking them back to the middle east and using them to shoot down our aircraft. And all they're doing by promoting these claims are showing that they'll lie about anything just to spread their own hate-filled message, and that they'll disregard basic physics as long as what they say sounds scary enough.\n\n \n More backing away from your original statement. Machine guns are freely available on the black market, as are single shot rifles. These (terrorists/criminals) by your own frequent claims are not constrained by any laws, so your reason for excluding them falls.\n Are you now claiming that it is physically impossible to bring down a plane with a weapon of 50cal or less, and that it has never been done?", 
   {}, 
   320501, 
   null, 
   1218912720.0
  ], 
  [
   320515, 
   null, 
   "Omegamon_X", 
   "Machine guns are freely available on the black market,\n \n \n So why's their illegal use so very few and far between if they're as freely available as any common handgun? If you can get a full-auto MAC-10 as easily as you could a 1911, then why aren't criminals choosing the machineguns?\n \n \nAre you now claiming that it is physically impossible to bring down a plane with a weapon of 50cal or less, and that it has never been done?\n\n \n Show me the number of air liners that've been brought down out of the sky and made to crash from a single shot from any model rifle.\n \n And to answer your question, yes it's my claim that it's physically impossible to bring a plane down with a .50 caliber rifle. If such feats were possible then skeet shooters would regularly be using rifles rather than shotguns.", 
   {}, 
   320512, 
   null, 
   1218913680.0
  ], 
  [
   320528, 
   null, 
   "Penfold", 
   "Again with the obfuscation, nobody mentioned airliners.\n \n Mick Mannock was a British WW 1 air ace Many pilots of the time, like he was, were shot down by troops from the trenches with their army issue 303's.\n \n \" ... At first, he flew Nieuports, but eventually Mannock commanded a squadron of the advanced S.E. 5a planes known as the \"Tiger Squadron.\" From January to July 26, 1918, this squadron grew to have the same mastery of the skies that the Flying Circus of Baron von Richthofen had enjoyed a year earlier. \n \n It was said that Mannock's sorties were so well planned that his Tiger Squadron was never surprised, but this may also be testimony to the enfeebled state of the German air defences in the last months of the war. Mick Mannock was killed when a stray bullet, shot up from the trenches, hit his fuel tank and his plane exploded. ... \"\n \n It can be done. \n \n \n \n http://www.century-of-flight.freeola.com/Aviation%20history/airplane%20at%20war/America%20at%20war.htm", 
   {
    "unicode_changes_made": true
   }, 
   320515, 
   null, 
   1218926460.0
  ], 
  [
   320538, 
   null, 
   "Archangel", 
   "Again with the obfuscation, nobody mentioned airliners.\n \n Mick Mannock was a British WW 1 air ace Many pilots of the time, like he was, were shot down by troops from the trenches with their army issue 303's.\n \n \" ... At first, he flew Nieuports, but eventually Mannock commanded a squadron of the advanced S.E. 5a planes known as the \"Tiger Squadron.\" From January to July 26, 1918, this squadron grew to have the same mastery of the skies that the Flying Circus of Baron von Richthofen had enjoyed a year earlier. \n \n It was said that Mannock's sorties were so well planned that his Tiger Squadron was never surprised, but this may also be testimony to the enfeebled state of the German air defences in the last months of the war. Mick Mannock was killed when a stray bullet, shot up from the trenches, hit his fuel tank and his plane exploded. ... \"\n \n It can be done. \n \n \n \n http://www.century-of-flight.freeola.com/Aviation%20history/airplane%20at%20war/America%20at%20war.htm\n\n \n Unbelievable... penfold is using WW1 era planes that were literally made out of balsa wood with fabric wings as evidence of planes being shot out of the air. And how is that relevant to this debate? Those planes flew at 300 feet, that's only a hundred yard shot so of course they were vulnerable to ground fire. The argument above was that 50 cals could take down Airliners. The fact is that even if they could hit one, it would be a mile or less high so that explosive decompression wouldn't even be an issue. If one engine was hit, it would still have one to land with. So I don't believe it's a valid concern.", 
   {
    "unicode_changes_made": true
   }, 
   320528, 
   null, 
   1218934380.0
  ], 
  [
   320539, 
   null, 
   "Penfold", 
   "At least one of the two Japanese planes downed at Pearl Harbour were the result of machine gun and rifle fire. In all probability at least one P40 as well!", 
   {}, 
   320538, 
   null, 
   1218935880.0
  ], 
  [
   320542, 
   null, 
   "Omegamon_X", 
   "At least one of the two Japanese planes downed at Pearl Harbour were the result of machine gun and rifle fire. In all probability at least one P40 as well!\n\n \n Well then how about you prove that something like the Armalite AR-50 rifle can and will bring down a Boeing 747 that's in flight. \n \n Since you absolutely refuse to let this discussion drop then obviously you have some kind of proof to the contrary to back up your position that these rifles are exceptionally dangerous, pose a great threat to all types commercial aircraft and have to be banned from civilian ownership before they cause another September 11th.", 
   {}, 
   320539, 
   null, 
   1218939240.0
  ], 
  [
   320544, 
   null, 
   "Penfold", 
   "Where did I even hint at any of this paranoiac fantasy? All I did was prove another of your unfounded assertions wronger than a very wrong thing.", 
   {}, 
   320542, 
   null, 
   1218940200.0
  ], 
  [
   320546, 
   null, 
   "Archangel", 
   "At least one of the two Japanese planes downed at Pearl Harbour were the result of machine gun and rifle fire. In all probability at least one P40 as well!\n\n \n You mean WW2 era deck mounted Bofors? These were Naval machine guns on every cruiser and battle ship that make a 50 caliber look like a pea shooter. And our men at Pearl Harbor did take down a few zeros with them in response to the sneak attack.\n BOFORS\n \n The Bofors L/60 Gun was a light 40-mm anti-aircraft gun designed by the Bofors company of Sweden in 1929 and used by almost all combatants in the Second World War. They were highly effective against low-flying ground attack aircraft. The original models were entirely hand operated and visually sighted, but in the latter part of the war radar predictors and power control were added, improving the chance of hitting the target. It fired from four-round clips at a rate of 120 rounds-per-minute and had an effective ceiling of 1520 meters and a muzzle velocity of 823 meters-per-second.http://www.probertencyclopaedia.com/F_BOFORS.HTM", 
   {}, 
   320539, 
   null, 
   1218941820.0
  ], 
  [
   320550, 
   null, 
   "Ethmi", 
   "First off, one would have to be pretty insane to go out on his porch with a 50 cal and start shooting at airliners. \n \n Second, one would have to be pretty desperate to imply that the average gun owner would be this insane.\n \n Finally, you literally have better chances of winning the lottery than hitting an airliner with any kind of rifle.", 
   {}, 
   320546, 
   null, 
   1218946680.0
  ], 
  [
   320556, 
   null, 
   "obvious_child", 
   "And yet no sniper has ever blown a plane out of the sky with any kind of rifle.\n\n \n Does the definition of \"in theory\" elude you? \n \n Explain to me how a plane who's engine has been disabled due to a .50 bullet will stay afloat for sometime.", 
   {}, 
   320479, 
   null, 
   1218949560.0
  ], 
  [
   320557, 
   null, 
   "Ethmi", 
   "Does the definition of \"in theory\" elude you? \n \n Explain to me how a plane who's engine has been disabled due to a .50 bullet will stay afloat for sometime.\n\n \n Heh... it's not \"in theory\" that makes a difference. It's \"What chance does the scenario have of happening?\" that does.", 
   {}, 
   320556, 
   null, 
   1218949740.0
  ], 
  [
   320559, 
   null, 
   "obvious_child", 
   "Heh... it's not \"in theory\" that makes a difference. It's \"What chance does the scenario have of happening?\" that does.\n\n \n Irrelevant. Merely because it is unlikely or improbable does not equate to impossible.", 
   {}, 
   320557, 
   null, 
   1218951660.0
  ], 
  [
   320561, 
   null, 
   "Ethmi", 
   "Irrelevant. Merely because it is unlikely or improbable does not equate to impossible.\n\n \n This logic isn't very helpful. You are essentially saying \"If anything can go wrong, then it should be illegal.\"\n \n This is like saying \"If it's possible to kill someone by tearing up a pop can and using it as a knife, then we should ban metal cans.\" \n \n So according to this logic, anything that can be used to kill should be banned, right?\n \n Let's all ban kitchen knives, cars, pools, etc. right? Paper can be used to shove down someone's throat, choking them to death. Pillows can be used to smother. All cloth and wood is flammable, so should we all walk around naked and live in caves? Oh, wait! Caves can collapse, and rocks found within the caves can be used as weapons! Banning guns may be the start, but where does it stop?\n \n You're telling me that we should set the human race back millions of years for supposed safety.", 
   {}, 
   320559, 
   null, 
   1218952260.0
  ], 
  [
   320565, 
   null, 
   "obvious_child", 
   "This logic isn't very helpful. You are essentially saying \"If anything can go wrong, then it should be illegal.\"\n\n \n Helping in what aspect? \n \n \n Your post is a perfect example why a large number of users here think you're an idiot. \n \n I was not commenting at all upon whether or not we should take any action based on the theoretical capacity of such a weapon. I was purely talking about whether it is possible to shoot down an aircraft with a .50 rifle. Merely because it is unlikely is irrelevant to whether or not it is impossible. Nothing in my posts in this thread suggested that I deviated from discussing the theoretical ability to shoot down a place in the slightest. \n \n \nThis is like saying \"If it's possible to kill someone by tearing up a pop can and using it as a knife, then we should ban metal cans.\"\n\n \n Where did I ever discuss the issue of banning anything? Or will you continue to prove why you are a class A XXXXX? \n \n \nSo according to this logic, anything that can be used to kill should be banned, right?\n \n Let's all ban kitchen knives, cars, pools, etc. right? Paper can be used to shove down someone's throat, choking them to death. Pillows can be used to smother. All cloth and wood is flammable, so should we all walk around naked and live in caves? Oh, wait! Caves can collapse, and rocks found within the caves can be used as weapons! Banning guns may be the start, but where does it stop?\n \n You're telling me that we should set the human race back millions of years for supposed safety.\n\n \n Perhaps you need a remedial course in reading comprehension. All I discussed was if a plane could be shot down with a .50 caliber rifle. I discussed how low probability does not equate to impossibility. Nothing in my posts suggested any other subject. Nowhere did I deviate from that. \n \n If you had the ability to actually understand what people wrote, maybe you'd earn a little credibility here?", 
   {}, 
   320561, 
   null, 
   1218957000.0
  ], 
  [
   320575, 
   null, 
   "Omegamon_X", 
   "Does the definition of \"in theory\" elude you? \n \n Explain to me how a plane who's engine has been disabled due to a .50 bullet will stay afloat for sometime.\n\n \n Show me that a .50 BMG round from a .50 caliber rifle can even reach the engine of a plane in flight in the first place, then we'll talk about \"in theory\".", 
   {}, 
   320556, 
   null, 
   1218991200.0
  ], 
  [
   320576, 
   null, 
   "GazzaElliott", 
   "So why's their illegal use so very few and far between if they're as freely available as any common handgun? If you can get a full-auto MAC-10 as easily as you could a 1911, then why aren't criminals choosing the machineguns?\n\n \n Don't you realise that you've just made the argument for gun control? If laws have no effect, then Machine guns would be all over the place. By your own admission, they're not...", 
   {}, 
   320515, 
   null, 
   1218992640.0
  ], 
  [
   320578, 
   null, 
   "GazzaElliott", 
   "In theory it is possible. Depends on the plane and where you hit it. Snipers disable vehicles and equipment with barrets.\n\n Agreed. In the case of airliners you have to take into account whether a .50 cal would have the range to hit an airliner operating in normal flight. I don&#8217;t think most .50 cals have enough power to reach 30,000 ft, and even if they could reach that far, I don&#8217;t think they&#8217;d have enough penetrative power to puncture the aluminium casing of a 747. Take off or landing would be the time they were vulnerable.\n Other aircraft would be vulnerable. I imagine something like a Cessna could suffer damage if the person with the rifle was a good shot.\n \n \nMick Mannock was a British WW 1 air ace Many pilots of the time, like he was, were shot down by troops from the trenches with their army issue 303's. \n\n Yes, but S.E. 5a&#8217;s were vulnerable to that sort of thing due to the position of the fuel tank, their (comparatively) low speed and the fact they were primarily made of fabric. Low flying Mosquito aircraft were vulnerable in WWII for the same reason. Modern aircraft are made of tougher materials, and would thus be more protected. That doesn&#8217;t rule it out though.\n \n \nAt least one of the two Japanese planes downed at Pearl Harbour were the result of machine gun and rifle fire. In all probability at least one P40 as well!\n\n I thought only two Kittyhawks got off the ground, and both were shot down by the Japanese. Not that that&#8217;s very surprising with those odds.\n \n \nShow me that a .50 BMG round from a .50 caliber rifle can even reach the engine of a plane in flight in the first place, then we'll talk about \"in theory\".\n\n Depends on where the plane is flying. A plane flying in a straight line at 1000 feet wouldn't be to hard a shot. Whether the bullet would do any significant damage is another matter. The main threat to the plane is the wing mounted fuel tanks, or the loss of control surfaces if several holes are put in the wings and fins. Don't forget WWII fighters used either .303, .30 or .50 cal machine guns. The bullets must be able to damage aircraft, though the shot would be awkward.", 
   {}, 
   320575, 
   null, 
   1218993780.0
  ], 
  [
   320613, 
   null, 
   "obvious_child", 
   "Show me that a .50 BMG round from a .50 caliber rifle can even reach the engine of a plane in flight in the first place, then we'll talk about \"in theory\".\n\n \n The Barrett M82 has a effective range of over a mile. Are you saying that planes never come within a mile of the ground?\n \n Obviously the notion of \"in theory\" does in fact elude you.", 
   {}, 
   320575, 
   null, 
   1219020600.0
  ], 
  [
   320622, 
   null, 
   "Omegamon_X", 
   "The Barrett M82 has a effective range of over a mile. Are you saying that planes never come within a mile of the ground?\n \n Obviously the notion of \"in theory\" does in fact elude you.\n\n \n Alright you wanna play hardball, then fine.\n \n Get a map of your average airport, one of the big ones, and see exactly where a mile from the tarmac is and how far the shooter would have to be to actually be in range. Then show that security would never be able to spot the shooter long before he ever started firing.", 
   {}, 
   320613, 
   null, 
   1219024620.0
  ], 
  [
   320625, 
   null, 
   "obvious_child", 
   "Alright you wanna play hardball, then fine.\n \n Get a map of your average airport, one of the big ones, and see exactly where a mile from the tarmac is and how far the shooter would have to be to actually be in range. Then show that security would never be able to spot the shooter long before he ever started firing.\n\n \n Nice fallacy there. Instead of admitting that a .50 rifle can in fact hit a plane, you are now arguing that it is unlikely, an obvious fallacy of changing the subject. I never argued the practicality of actually taking down a plane. The only thing I argued was that it was in theory possible based on capabilities of the round and potential weapons. Since you keep refusing to maintain the discussion within capabilities, I have nothing more to say on that subject. However, you may want to take the same remedial reading comprehension course that Ethmi desperately needs to enroll in. \n \n Next time, try not to use such blatantly obvious fallacies.", 
   {}, 
   320622, 
   null, 
   1219027080.0
  ], 
  [
   320626, 
   null, 
   "obvious_child", 
   "Just to humor you, open up Google Earth. And then go to Los Angeles International Airport. Then look at the south Tarmac. Then use the ruler tool. Much of the Tarmac is less then a mile and the Barret has a range over a mile. That's a huge block of residential. Good luck trying to spot a sniper. \n \n Both of O'Hare's tarmacs are about at the effective range of a Barret.\n \n Seatac is even worse. Easily within the effective range.\n \n Residential all around.\n \n Just to be clear, I'm not for banning these weapons or not banning. I'm just against stupid arguments like the ones you are giving.", 
   {}, 
   320625, 
   null, 
   1219027860.0
  ], 
  [
   320629, 
   null, 
   "Archangel", 
   "Nice fallacy there. Instead of admitting that a .50 rifle can in fact hit a plane, you are now arguing that it is unlikely, an obvious fallacy of changing the subject. I never argued the practicality of actually taking down a plane. The only thing I argued was that it was in theory possible based on capabilities of the round and potential weapons. Since you keep refusing to maintain the discussion within capabilities, I have nothing more to say on that subject. However, you may want to take the same remedial reading comprehension course that Ethmi desperately needs to enroll in. \n \n Next time, try not to use such blatantly obvious fallacies.\n\n \n Here's the problem I see with this argument. Let's assume that a shooter could place himself strategically so he could angle a shot and hit an airliner that is less than a mile up and away as it approaches or is taking off with a 50 cal. A mile is 5280 feet, well below the height where explosive decompression would take place from shooting a hole in the fuselage. And if he could actually hit something as small as one engine from that distance, from that position, then I doubt he could hit the other one while the plane is still within range, and the plane could be flown, controlled and safely landed with one engine. \n \n So although under perfect circumstances, and with the right caliber shooter, anything might be possible, the probability is very small imo. We must remember that as large as it is, a Jetliner is flying at least around 250 or more miles per hour, when it is where we are placing it for this shot. It would take an extremely proficient marksman to know how far ahead of such a target he must aim in order to make a precise hit in a specific place on its fuselage. And I believe that a precise hit is what it would take. So how about we stop insulting each other and just put our heads together and see if we can't figure it out. For example, an airline pilot would come in handy for actual landing and takeoff speeds.", 
   {}, 
   320625, 
   null, 
   1219029480.0
  ], 
  [
   320633, 
   null, 
   "obvious_child", 
   "Here's the problem I see with this argument. Let's assume that a shooter could place himself strategically so he could angle a shot and hit an airliner that is less than a mile up and away as it approaches or is taking off with a 50 cal. A mile is 5280 feet, well below the height where explosive decompression would take place from shooting a hole in the fuselage. And if he could actually hit something as small as one engine from that distance, from that position, then I doubt he could hit the other one while the plane is still within range, and the plane could be flown, controlled and safely landed with one engine.\n\n \n That depends on what type of air craft we're talking about. Furthermore, if they could cause a spark in the fuel lines or tank, that plane is toast. But again, you are doing the same thing that Ethmi and Omega are doing. Discussing the likelihood rather then the mere possibility based on capabilities. No one is saying this is likely to happen. What I am contesting is that it is impossible. \n ", 
   {}, 
   320629, 
   null, 
   1219031280.0
  ], 
  [
   320634, 
   null, 
   "Archangel", 
   "That depends on what type of air craft we're talking about. Furthermore, if they could cause a spark in the fuel lines or tank, that plane is toast. But again, you are doing the same thing that Ethmi and Omega are doing. Discussing the likelihood rather then the mere possibility based on capabilities. No one is saying this is likely to happen. What I am contesting is that it is impossible. \n \n\n \n I didn't say it couldn't happen. in fact I said, although under perfect circumstances, and with the right caliber shooter/marksman, anything might be possible, And we are discussing a passenger Jetliner. At least I have been. And what I am doing is assuming the act is going to be attempted, what is the probability of it succeeding? So the point I have been considering and trying to make is that assuming the maximum 1 mile distance shot, the chances are that it wouldn't bring the plane down. \n \n But as you said, if it hit the fuel lines, the plane is toast. That may or may not be true in reality. Are you aware that Jet fuel is less combustible than gasoline? It is kerosene and has a lower flash point. Here's what experts say about different octane's of fuel. \n Airplane Fuel Versus Other Types of Fuel\n \n By Patrick Smith\n Q: How is airplane fuel different from other kinds of fuel?\n \n Jets and turboprops run on jet fuel, while piston-powered airplanes use fuel similar to the gasoline in your car. Jet fuel is kerosene. It is vaporized and injected into the combustion chambers of jets and turboprops. However, it is not as combustible as gasoline; it's more stable and less explosive. You can hold a lit match above a pool of jet fuel and it usually will not ignite. (Neither Patrick Smith nor Salon Media Group shall be responsible for injuries or damage caused in connection to this statement.) Jet fuel comes in different grades. Piston-powered aircraft, like small Pipers and Cessnas, use a high-octane fuel commonly called \"avgas,\" and some small planes can be certified to run on regular automobile gasoline. http://www.bootsnall.com/guides/05-06/airplane-fuel-versus-other-types-of-fuel.html\n \n Does this info change your opinion of how likely it is to take a jet down with a 50 caliber round? And remember, I'm not saying its impossible either. Anything is possible given what we're discussing. It's probabilities we're discussing.", 
   {}, 
   320633, 
   null, 
   1219034820.0
  ], 
  [
   320635, 
   null, 
   "obvious_child", 
   "Remember TWA Flight 800?\n \n http://query.nytimes.com/gst/fullpage.html?res=9A02E4DD143CF93AA35753C1A961958260\n \n Exploding fuel tank caused a spark from faulty wiring igniting vapors. \n \n http://www.ntsb.gov/recs/letters/2000/A00_121_124.pdf\n \n While the size of the debris that caused the explosion was quite large, it does prove that jet fuel is not exactly the safest stuff. \n \n Of course this all changes for piston engine planes given their fuel has a significently lower flash point. \n \n And your source states \"above\" not directly touching it (notice the usually too). Nothing about direct contact with an ignition source. Furthermore, is that pool of fuel evaporating at sufficent rates to create the necessary density? Fuel on the ground and fuel in the air do not behave the same. \n \n Still, the odds of hitting a fuel line or the fuel tank is pretty remote.", 
   {}, 
   320634, 
   null, 
   1219037100.0
  ], 
  [
   320637, 
   null, 
   "Archangel", 
   "Remember TWA Flight 800?\n \n http://query.nytimes.com/gst/fullpage.html?res=9A02E4DD143CF93AA35753C1A961958260\n \n Exploding fuel tank caused a spark from faulty wiring igniting vapors. \n \n http://www.ntsb.gov/recs/letters/2000/A00_121_124.pdf\n \n While the size of the debris that caused the explosion was quite large, it does prove that jet fuel is not exactly the safest stuff. \n \n Of course this all changes for piston engine planes given their fuel has a significently lower flash point. \n \n And your source states \"above\" not directly touching it (notice the usually too). Nothing about direct contact with an ignition source. Furthermore, is that pool of fuel evaporating at sufficent rates to create the necessary density? Fuel on the ground and fuel in the air do not behave the same. \n \n Still, the odds of hitting a fuel line or the fuel tank is pretty remote.\n\n \n I don't doubt that a spark could ignite the fumes at all. I guess in addition to the points already raised, my personal skepticism exists because we know that 50 cals are for sale in America, and if this was a viable option for terrorists, why hasn't it been tried as a less personally lethal way to take down planes than hijacking them and crashing them in person? If radical islamics are anything, they are smart. And they would always take the path of least resistance. I think they know that anything less than a stinger type missile system as shown here is a wasted effort with too little hope of paying off in a big way. http://en.wikipedia.org/wiki/FIM-92_Stinger\n \n Im also reminded of the short lived fad of guys with pen type laser beams that they shined into the pilots eyes of passenger jets as they flew overhead, one in New Jersey I think, and another in a Boston Suburb. And the FAA/authorities tracked them down and convicted them in short order. I always marveled not only how quickly they found them, but that they found them at all. \n \n If I were to even consider attempting what we're discussing with a 50 cal, I would want to be directly downline of of it so the plane was heading directly toward me on takeoff. And even then I would have to time the shot for distance and trajectory as it would be traveling toward me at an ever increasing rate of speed. I believe that attempting a broadside type shot on a Jet liner would for all practical purposes be impossible for anyone other than possibly a professionally trained and war hardened sniper who's at the top of his game.", 
   {}, 
   320635, 
   null, 
   1219042020.0
  ], 
  [
   320641, 
   null, 
   "Galileo", 
   "I think it's hilarious that it's so easy to pretend to be in favour of gun control and rise to the top, what's next \"Scientists infiltrates creationist league\"?\n\n I don't find it that surprising that it's easy. \n \"The infiltration of activist groups is neither new nor difficult, said Craig Dotlow, a former FBI special agent and spokesman for the Society of Former Special Agents of the FBI. \n \n \"The FBI used to do this kind of work a lot in the '60s, infiltrating groups like the Weathermen or the Black Panthers. All you really need to find is a good actor,' he said. 'It is a very unsophisticated but very successful technique. Find someone who can fit into the culture, who can be taught about the group and then make sure they cultivate friendships and work hard. Most of these groups have small budgets, and when they find someone who is dedicated and willing to work for free, they can move up the ranks pretty quickly.' \n \n \"Dotlow added, 'It is mostly about education. You need your candidate to know enough about the group so he can talk intelligently about their issues. Then you create a record of involvement, get your name in paper, write an editorial so it appears you have been committed for a long time.' \" \n http://abcnews.go.com/TheLaw/Story?id=5541490&page=2\n \n It may be hilarious but I don't think the NRA is laughing now. \n \n \"The normally hyperaggressive pro-gun lobby, the National Rifle Association, is remarkably quiet about recent news reports that it used a spy to infiltrate organizations that push for gun control....\"\n http://www.washingtonpost.com/wp-dyn/content/article/2008/08/11/AR2008081102211.html \n \n When asked once again to comment about the issue, an NRA press secretary told CNN, \"I've told you guys repeatedly, I have no comment.\" \n http://edition.cnn.com/video/#/video/politics/2008/08/13/carroll.nra.controversy.cnn?iref=videosearch", 
   {}, 
   320276, 
   null, 
   1219058940.0
  ], 
  [
   320642, 
   null, 
   "Galileo", 
   "So what does this incident tell us about the gun lobby? I think it further confirms a lot of the suspicions people have had about the gun lobby and its true objectives for years and shows that the gun lobby certainly doesn't let honesty get in the way of accomplishing those objectives. \n \n \" 'This reinforces what we have long known, that the gun lobby will go to any lengths, no matter how unethical, to protect the profits of the gun industry in this country, even at the expense of the over 30,000 Americans who lose their lives to gun violence each year,' said McQuilken, whose organization kicked 'McFate' off their board soon after learning her true identity.\"\n http://abcnews.go.com/TheLaw/Story?id=5541490&page=1 \n \n \"It wasn't a surprise to me that the National Rifle Association would do such a thing, because during my two years working for Jim and Sarah Brady, and then a year as a board member of what is now Maryland Ceasefire, I saw the gun lobby's antics up close and in my face. \n \n \"Nearly any time we put on any kind of public event, the NRA would send its hired-gun 'PR firm,' the Mercury Group, to stake out our press conferences, report releases, or fundraisers with their camerapeople. And just like Bill O'Reilly's ambush producers, they would try and disrupt the event by shouting leading questions based on studies from their favorite researchers. Quite often they would yell things like, 'Considering John Lott's study that the availability of guns in the hands of law-abiding citizens reduces crime, why do you . . . ?' And then the president of our organization, at the time a savvy guy named Bob Walker, would have to sidetrack the issue at hand in order to point out how Lott's studies had been discredited by legitimate academic researchers, and that, as Matt Bai of Newsweek once wrote, Lott had 'been shown the door at some of the nation's finest schools.'\n \n \"After a TV appearance, Lott once chased my immediate boss down a hallway, shouting at her that she'd have 'blood on her hands.' He has been famously exposed as his own sock-puppet. He logged onto Amazon.com under a pseudonym, 'Mary Rosh,' and gave his own books five-star ratings, claiming that Lott was 'the best professor I ever had.' But what do you expect from a guy who has published articles that claim that crime goes up when there are more black officers on a city police force, and that allowing teachers to carry concealed handguns in schools will deter school shootings?....\n \n \"When Sapone was found out to be McFate, the NRA, when called for a reaction, had no comment. These are the reactions of an organization that doesn't want to argue its ideas on a level playing field--it always wants the argument conducted on its terms.\"\n http://www.citypaper.com/columns/story.asp?id=16135", 
   {}, 
   320641, 
   null, 
   1219061040.0
  ], 
  [
   320646, 
   null, 
   "Symbiote", 
   "I don't find it that surprising that it's easy. \n \"The infiltration of activist groups is neither new nor difficult, said Craig Dotlow, a former FBI special agent and spokesman for the Society of Former Special Agents of the FBI. \n \n \"The FBI used to do this kind of work a lot in the '60s, infiltrating groups like the Weathermen or the Black Panthers. All you really need to find is a good actor,' \n\n \n \n I still think it's funny, I don't think you'd need a \"good actor\", just someone who could act like a kind of religious simpleton.", 
   {}, 
   320642, 
   null, 
   1219064580.0
  ], 
  [
   320650, 
   null, 
   "Omegamon_X", 
   "Here's something all your anti-.50 caliber nutjobs haven't taken into consideration. The civilian model .50 caliber rifles have been on the market and buyable for over 20 years now. The number of airplanes that have been shot out of the sky by the .50 caliber rifle is ZERO.\n \n Now if the .50 caliber rifle can shoot down planes as easily as a shotgun can skeet plates, and they've been in existence for over 20 years, why has a terrorist never, ever, even once, shot down any of our planes with these rifles if they so obviously had the means and opportunity?", 
   {}, 
   320646, 
   null, 
   1219072080.0
  ], 
  [
   320661, 
   null, 
   "GazzaElliott", 
   "Here's something all your anti-.50 caliber nutjobs haven't taken into consideration. The civilian model .50 caliber rifles have been on the market and buyable for over 20 years now. The number of airplanes that have been shot out of the sky by the .50 caliber rifle is ZERO.\n \n Now if the .50 caliber rifle can shoot down planes as easily as a shotgun can skeet plates, and they've been in existence for over 20 years, why has a terrorist never, ever, even once, shot down any of our planes with these rifles if they so obviously had the means and opportunity?\n\n \n Are you reading the same debate as the rest of us? Archie seems to have understood the point. If I was going to take a plane out, I wouldn't use a .50 cal, however that doesn't say that it'd be impossible to do so. \n \n I agree it'd be a hard thing to do with a .50 cal, but that doesn't mean it's impossible. It's also unlikely, but again, that doesn't mean it's impossible.\n \n The question was \"is it possible?\", and the answer is yes. If the question was \"is it likely?\", then the answer would be no....", 
   {}, 
   320650, 
   null, 
   1219080900.0
  ], 
  [
   320668, 
   null, 
   "Penfold", 
   "To differ slightly in emphasis, Omegami claimed it was impossible, and evidence was presented to show not only that it was possible, but that it had happened, several times over.", 
   {}, 
   320661, 
   null, 
   1219092180.0
  ], 
  [
   320672, 
   null, 
   "Ethmi", 
   "To differ slightly in emphasis, Omegami claimed it was impossible, and evidence was presented to show not only that it was possible, but that it had happened, several times over.\n\n \n There have been quite a few post since I last read here. So I would like (ie, you, Penfold) to show wwhere it has been posted where it has happened.", 
   {}, 
   320668, 
   null, 
   1219092960.0
  ], 
  [
   320673, 
   null, 
   "Ethmi", 
   "Nice fallacy there. Instead of admitting that a .50 rifle can in fact hit a plane, you are now arguing that it is unlikely, an obvious fallacy of changing the subject. I never argued the practicality of actually taking down a plane. The only thing I argued was that it was in theory possible based on capabilities of the round and potential weapons. Since you keep refusing to maintain the discussion within capabilities, I have nothing more to say on that subject. However, you may want to take the same remedial reading comprehension course that Ethmi desperately needs to enroll in. \n \n Next time, try not to use such blatantly obvious fallacies.\n\n \n Obvious child, you are despicable. No matter how respectfully people respond to you, you continually insult them. You have PMed me several times calling me an \"idiot\", and your very signature is an attempt to make Archie look like a jerk. And everyone whines about my rudeness...", 
   {}, 
   320625, 
   null, 
   1219093080.0
  ], 
  [
   320678, 
   null, 
   "Omegamon_X", 
   "To differ slightly in emphasis, Omegami claimed it was impossible, and evidence was presented to show not only that it was possible, but that it had happened, several times over.\n\n \n Show me the proof that planes have been shot down with .50 caliber rifles before in the past.", 
   {}, 
   320668, 
   null, 
   1219095900.0
  ], 
  [
   320704, 
   null, 
   "obvious_child", 
   "Obvious child, you are despicable. No matter how respectfully people respond to you, you continually insult them. You have PMed me several times calling me an \"idiot\", and your very signature is an attempt to make Archie look like a jerk. And everyone whines about my rudeness...\n\n \n You're funny. And a feather weight. Omega is clearly resorting to deception. How you call that 'respectful' I don't know. If you look at the evolution forum, you'll understand the irony of my signature. \n \n The difference between you and I is that I get things right, you don't.", 
   {}, 
   320673, 
   null, 
   1219110660.0
  ], 
  [
   320705, 
   null, 
   "obvious_child", 
   "Show me the proof that planes have been shot down with .50 caliber rifles before in the past.\n\n \n By that logic, if it has never happened, it must be impossible.\n \n Brazil has never gone to war with the US, therefore war with the US must be impossible. For the vast majority of human existence, we've lived our lives within a relatively small range of altitudes. Therefore it is impossible by your logic for mankind to live outside of that range of altitudes for the vast majority of that time. I've never spent over $1,000 at any one transactions. Therefore it must be impossible for me to spend over $1,000 at any one transaction.\n \n Your logic stinks like a skunk.", 
   {}, 
   320678, 
   null, 
   1219110780.0
  ], 
  [
   320706, 
   null, 
   "obvious_child", 
   "I don't doubt that a spark could ignite the fumes at all. I guess in addition to the points already raised, my personal skepticism exists because we know that 50 cals are for sale in America, and if this was a viable option for terrorists, why hasn't it been tried as a less personally lethal way to take down planes than hijacking them and crashing them in person?\n\n \n Because it's ridiculously hard to pull it off. Ak-47s are available for sale and it takes about 15 minutes for a good gunsmith to change it from semi into a full auto. We know terrorists use those. Just because it is available and possible doesn't mean they will do it. We could build hundreds of neutron bombs to add to our nuclear stockpiles. It would be stupid and not useful, but we could do it based purely on the logic of availability. \n \n \nIf radical islamics are anything, they are smart. And they would always take the path of least resistance. I think they know that anything less than a stinger type missile system as shown here is a wasted effort with too little hope of paying off in a big way.\n\n \n Everyone goes the path of least resistance or most bang for buck. \n \n \nIf I were to even consider attempting what we're discussing with a 50 cal, I would want to be directly downline of of it so the plane was heading directly toward me on takeoff.\n\n \n Frankly, I wouldn't even bother unless I had an explosive .50 round. Then I'd just aim for the engine intakes after it was about 50~100 feet up. But last I recall, those are still illegal to own and sell to civilians.", 
   {}, 
   320637, 
   null, 
   1219111200.0
  ], 
  [
   320707, 
   null, 
   "obvious_child", 
   "Are you reading the same debate as the rest of us? Archie seems to have understood the point. If I was going to take a plane out, I wouldn't use a .50 cal, however that doesn't say that it'd be impossible to do so. \n \n I agree it'd be a hard thing to do with a .50 cal, but that doesn't mean it's impossible. It's also unlikely, but again, that doesn't mean it's impossible.\n \n The question was \"is it possible?\", and the answer is yes. If the question was \"is it likely?\", then the answer would be no....\n\n \n I think he is. He just doesn't want to admit he's wrong. His latest argument equates to \"never happen before, therefore impossible.\" \n \n That's scrapping the barrel.", 
   {}, 
   320661, 
   null, 
   1219111320.0
  ], 
  [
   320709, 
   null, 
   "Ethmi", 
   "By that logic, if it has never happened, it must be impossible.\n \n Brazil has never gone to war with the US, therefore war with the US must be impossible. For the vast majority of human existence, we've lived our lives within a relatively small range of altitudes. Therefore it is impossible by your logic for mankind to live outside of that range of altitudes for the vast majority of that time. I've never spent over $1,000 at any one transactions. Therefore it must be impossible for me to spend over $1,000 at any one transaction.\n \n Your logic stinks like a skunk.\n\n \n Once again, I see your overinflated ego and infinite list of insults. This entire argument of yours is a strawman. Nowhere did any of us say that it's impossible to shoot down a plane. We just said it's not likely. You are evidently a rude, arrogant jerk who isn't interested in a civilized debate. Only putting down those who you think are less intelligent than you.", 
   {}, 
   320705, 
   null, 
   1219111380.0
  ], 
  [
   320711, 
   null, 
   "Ethmi", 
   "You're funny. And a feather weight. Omega is clearly resorting to deception. How you call that 'respectful' I don't know. If you look at the evolution forum, you'll understand the irony of my signature. \n\n \n First off, when you mention every time he insulted you and compare it to the number of time you insulted him, then you can talk. Also, there is no excuse for mentioning in your sig. You may think you're intelligent, kid, but you act like a twelve-year-old.\n \n \nThe difference between you and I is that I get things right, you don't.\n\n \n That sure is an arrogant thing to say.", 
   {}, 
   320704, 
   null, 
   1219111680.0
  ], 
  [
   320713, 
   null, 
   "Ethmi", 
   "First off, where did any single one of us say that it is impossible to shoot down a plane with a 50 cal? Unless anyone can show where this was even implied, then that would make your entire argument a strawman. And you, Obvious Child, who keeps irritating me with this \"feather weight\" garbage, well, this would knock you down to a shadow weight :).", 
   {}, 
   320711, 
   null, 
   1219112220.0
  ], 
  [
   320714, 
   null, 
   "obvious_child", 
   "Once again, I see your overinflated ego and infinite list of insults.\n\n \n Care to point out where I insulted him personally in that post you quoted? You can either withdraw that or you can be a liar. \n \n \nThis entire argument of yours is a strawman. Nowhere did any of us say that it's impossible to shoot down a plane.\n\n \n Omega contends that the Brady Campaign's claim is wrong. That a .50 BMG will not blow a plane out of the sky.\n \n http://www.4forums.com/political/showpost.php?p=320073&postcount=15\n \n After I stated it was in theory possible, he again argues this:\n http://www.4forums.com/political/showpost.php?p=320479&postcount=23\n \n And you are of course wrong\n \n \nyes it's my claim that it's physically impossible to bring a plane down with a .50 caliber rifle\n\n \n http://www.4forums.com/political/showpost.php?p=320515&postcount=30\n \n Do you enjoy being constantly wrong? \n \n \nWe just said it's not likely.\n\n \n Post #30 says you are quite wrong. \n \n \nOnly putting down those who you think are less intelligent than you.\n\n \n Poor baby doesn't like loosing all of the time?", 
   {}, 
   320709, 
   null, 
   1219112460.0
  ], 
  [
   320715, 
   null, 
   "obvious_child", 
   "First off, where did any single one of us say that it is impossible to shoot down a plane with a 50 cal? Unless anyone can show where this was even implied, then that would make your entire argument a strawman. And you, Obvious Child, who keeps irritating me with this \"feather weight\" garbage, well, this would knock you down to a shadow weight :).\n\n \n \n\n And to answer your question, yes it's my claim that it's physically impossible to bring a plane down with a .50 caliber rifle. \n\n \n Post #30\n \n Care to eat your words?", 
   {}, 
   320713, 
   null, 
   1219112580.0
  ], 
  [
   320716, 
   null, 
   "obvious_child", 
   "First off, when you mention every time he insulted you and compare it to the number of time you insulted him, then you can talk.\n\n \n Aside from suggesting that he did not understand what 'in theory' meant, where did I actually insult him as a person? Or do you not know the difference between a person and their argument? \n \n \nAlso, there is no excuse for mentioning in your sig. You may think you're intelligent, kid, but you act like a twelve-year-old.\n\n \n I'm old and mature enough to appreciate irony. You clearly are not. \n \n \nThat sure is an arrogant thing to say.\n\n \n So? Does it make is wrong? \n \n I see you refuse to post in the election forum. Why is that feather weight?", 
   {}, 
   320711, 
   null, 
   1219112820.0
  ], 
  [
   320717, 
   null, 
   "Omegamon_X", 
   "Because it's ridiculously hard to pull it off. Ak-47s are available for sale and it takes about 15 minutes for a good gunsmith to change it from semi into a full auto.\n\n \n Prove it. I wanna see some actual evidence than any semi-auto AK-47 on the market is readily convertible to a full-auto machinegun by any gunsmith who has 15 minutes on their hands.", 
   {}, 
   320706, 
   null, 
   1219116180.0
  ], 
  [
   320718, 
   null, 
   "obvious_child", 
   "Prove it. I wanna see some actual evidence than any semi-auto AK-47 on the market is readily convertible to a full-auto machinegun by any gunsmith who has 15 minutes on their hands.\n\n \n I realize circumstantial won't help, so here's a few links.\n \n http://www.hackcanada.com/ice3/misc/ak47mod.txt\n \n http://www.keepshooting.com/booksandvideos/firearmmanuals/ak47_conversion_manual.htm\n You can even buy a manual. \n \n http://www.gunsamerica.com/977003391/Non-Guns/Gun-Parts/Military---Foreign/ak_47_Full_Auto_Conversion_ak.htm\n CD form too!\n \n I'd be real hesitant to buy those. While I believe it is not illegal to sell or own instructions on making semis into full autos, actually doing it is illegal. Therefore who knows who's tracking sales on those websites. \n \n You really need to learn what \"Google\" is. \n \n Furthermore, your \"hasn't happened = impossible\" argument stinks.\n \n And I didn't say any gunsmith. You need to be pretty good at what you do as well as have the capacity to machine some parts to pull this off.\n \n You seem to be operating under the idea that I'm for banning such weapons. I'm not. I do think that weapons like SA-7s, TOW, RPG, PKUs, USAS-12s and similar should be banned, but what I really dislike is bad logic and bad arguments and you seem to have quite a large supply of them in this thread.", 
   {}, 
   320717, 
   null, 
   1219116780.0
  ], 
  [
   320725, 
   null, 
   "Ethmi", 
   "Post #30\n \n Care to eat your words?\n\n \n Where did this claim orignate, little boy?", 
   {}, 
   320715, 
   null, 
   1219120620.0
  ], 
  [
   320727, 
   null, 
   "Ethmi", 
   "Care to point out where I insulted him personally in that post you quoted? You can either withdraw that or you can be a liar. \n\n \n You've missed the Option C, haven't you?\n \n \n\n Private message from obvious child\n \n You are obviously a light weight when it comes to these matters.\n \n Just keep avoiding the threads where you are proven to be an idiot.\n\n \n \n\n Another private message from obvious child (after I asked him not to bother me\n \n If you like being considered a feather weight here, sure.\n \n\n \n \n\n From that jerk who just can\\'t shut his mouth, Obvious child\n \n You are, as predicted, dead wrong.\n\n \n \n\n Guess who? That\\'s right! It\\'s Obvious child!\n \n ...Mr. Feather Weight\n\n \n And now for the posts...\n \n \nYou\\'re funny. And a feather weight.\n\n \n \nThe difference between you and I is that I get things right, you don\\'t.\n\n \n \n\n Care to eat your words?\n\n \n \nWhy is that feather weight?\n\n \n And finally, the insults against Mega...\n \n \nbut what I really dislike is bad logic and bad arguments and you seem to have quite a large supply of them in this thread.\n \n\n \n \nYour logic stinks like a skunk.\n\n \n Almost the only thing you mentioned in one of your responses to mega is fallacy.\n \n The taste of your own words is very bitter, isn\\'t it?\n \n Mega, did this immature brat PM you? If so, please post it!\n \n There are also petty irritations that I will point out throughout this posts with underlining.\n \n \nOmega contends that the Brady Campaign\\'s claim is wrong. That a .50 BMG will not blow a plane out of the sky.\n \n http://www.4forums.com/political/320073-post15.html\n \n After I stated it was in theory possible, he again argues this:\n http://www.4forums.com/political/showpost.php?p=320479&postcount=23\n \n And you are of course wrong\n \n \n \n http://www.4forums.com/political/showpost.php?p=320515&postcount=30\n \n Do you enjoy being constantly wrong? \n\n \n Yeah... nowhere does he directly say that it's impossible, he just asks a question. Will not, also usually means \"Won't usually\", not \"will never\". He never directly claims that it's impossible, and when he says \"not likely\", you accused him of changing the subject.\n \n \nPost #30 says you are quite wrong.\n \n \n Where did this claim originate?\n \n \nPoor baby doesn't like loosing all of the time?\n\n \n Another example of your rudeness and immaturity. All trivial, my point was not addressed (as expected). Show me one debate... just one debate, where you have not insulted anyone, have not continually said \"You're wrong\", and addressed all points, then maybe I'll think you're thirteen rather than twelve.\n \n By the way, your debating style irritates me... by God, you could at least look up some synonyms for \"wrong\".", 
   {}, 
   320714, 
   null, 
   1219122780.0
  ], 
  [
   320728, 
   null, 
   "Omegamon_X", 
   "I realize circumstantial won't help, so here's a few links.\n \n http://www.hackcanada.com/ice3/misc/ak47mod.txt\n \n http://www.keepshooting.com/booksandvideos/firearmmanuals/ak47_conversion_manual.htm\n You can even buy a manual. \n \n http://www.gunsamerica.com/977003391/Non-Guns/Gun-Parts/Military---Foreign/ak_47_Full_Auto_Conversion_ak.htm\n CD form too!\n\n \n No!\n \n I want real and serious proof that a semi-auto AK-47 can easily be converted into a true machinegun and made to fire full-automatic. I want evidence of seized firearms being illegally modified in a way that their internals are exactly the same as their soviet cousins. Simply adding a twist-tie isn't good enough.\n \n Simply showing that there's instructions on \"converting\" isn't proof enough that such a conversion is possible. The same was claimed of the AR-15, but I found more than enough proof to show that this was an outright lie.\n \n How about this, how about you find some pictures of the internals of the soviet AKs and the semi-auto AKs and prove that they're similar enough that they can easily be modified in a way to match each other.", 
   {}, 
   320718, 
   null, 
   1219123440.0
  ], 
  [
   320738, 
   null, 
   "obvious_child", 
   "Where did this claim orignate, little boy?\n\n \n Do you not know what a link is? Is the internet a new thing to you?\n \n I find it immensely amusing that you can't even figure out that Omega stated that on the 2nd page, post #30 after a link to his post was provided.\n \n I take back the feather weight. You're a hydrogen weight. The lightest element on the periodic tables.", 
   {}, 
   320725, 
   null, 
   1219137540.0
  ], 
  [
   320739, 
   null, 
   "obvious_child", 
   "You've missed the Option C, haven't you?\n\n \n And you are a liar. You claimed that I insulted him in that post. I asked you to show me where.\n \n You fail. Therefore you are lying or being willfully ignorant. \n \n \nAlmost the only thing you mentioned in one of your responses to mega is fallacy.\n\n \n You do realize that posting private PMs can get you banned yes? \n \n And your statement is clearly incorrect. My first statement was that it was in theory possible. You yourself do not contest this. Then i asked if he understand what 'in theory' meant along with how a plane was suppose to stay in the air after taking a disabling round. I then added that a certain .50 sniper rifle has sufficent range to hit a plane a mile in the air (in theory at least, wind resistance should decrease that significently if directly up or at a certain angle). I then pointed out HIS FALLACY of changing the subject. The post after that I humored him and proved that three of the largest airports in the US had tarmacs within range of the legal civilian Barret and that all of them had residential areas within range. After that I pointed out that his logic was silly and I gave three examples of why it was silly. \n \n So are you in fact lying again?\n \n \nThe taste of your own words is very bitter, isn't it?\n\n \n And yet you have failed to prove that I am of course, wrong. Typical for a feather weight. \n \n \nMega, did this immature brat PM you? If so, please post it!\n\n \n Please do. I enjoy watching people get themselves banned. \n \n \nThere are also petty irritations that I will point out throughout this posts with underlining.\n\n \n Well, since that's all you can do, to each his own. \n \n \nYeah... nowhere does he directly say that it's impossible, he just asks a question. Will not, also usually means \"Won't usually\", not \"will never\". He never directly claims that it's impossible, and when he says \"not likely\", you accused him of changing the subject.\n\n \n \n\n And to answer your question, yes it's my claim that it's physically impossible to bring a plane down with a .50 caliber rifle. \n\n \n Post #30\n \n Wrong again. How many times do I have to quote Omega stating that he believes that it is \"physically impossible to bring a plane down with a .50 caliber rifle.\" before you will believe it? \n \n \nWhere did this claim originate?\n\n \n I gave you the link. It is not my fault you are unable tp click on it. \n \n \nAnother example of your rudeness and immaturity. All trivial, my point was not addressed (as expected). Show me one debate... just one debate, where you have not insulted anyone, have not continually said \"You're wrong\", and addressed all points, then maybe I'll think you're thirteen rather than twelve.\n\n \n Where did I not address the points? Why would I address points that are irrelevant to what I am talking about? And I can't show you any thread where I don't 'insult anyone' since you consider criticizing arguments as criticizing people. Obviously that's pretty messed up, but not far from what I expect now days. \n \n \nBy the way, your debating style irritates me... by God, you could at least look up some synonyms for \"wrong\".\n\n \n You should be more irritated by your constant failures.", 
   {}, 
   320727, 
   null, 
   1219137960.0
  ], 
  [
   320740, 
   null, 
   "obvious_child", 
   "No!\n \n I want real and serious proof that a semi-auto AK-47 can easily be converted into a true machinegun and made to fire full-automatic.\n\n \n Define \"easily.\" I never said that it could be easily done. I said that a good gunsmith could do it in 15 minutes, I later added that they'd need the ability to machine some parts. That CLEARLY removes a large number of gun owners from the picture. You are creating false arguments and attacking me on thing you fabricated. That is massively dishonest. You clearly ignored what I actually said. \n \n \nI want evidence of seized firearms being illegally modified in a way that their internals are exactly the same as their soviet cousins. Simply adding a twist-tie isn't good enough.\n\n \n Perhaps if you bothered to read the links, you'd be arguing from a position other then of sheer and absolute ignorance. \n \n \nSimply showing that there's instructions on \"converting\" isn't proof enough that such a conversion is possible. The same was claimed of the AR-15, but I found more than enough proof to show that this was an outright lie.\n\n \n Such proof? Care to cite? Read the links and then decide. Don't decide and refuse to read the links. \n \n \nHow about this, how about you find some pictures of the internals of the soviet AKs and the semi-auto AKs and prove that they're similar enough that they can easily be modified in a way to match each other.\n\n \n You really didn't open any of the links given to you did you?\n \n I take it you're abandoning your \"never happened = impossible\" logic?", 
   {}, 
   320728, 
   null, 
   1219138140.0
  ], 
  [
   320756, 
   null, 
   "Omegamon_X", 
   "Define \"easily.\" I never said that it could be easily done. I said that a good gunsmith could do it in 15 minutes, I later added that they'd need the ability to machine some parts.\n\n \n And 15 minutes suggests it's very easy to pull off. Any semi-auto could in theory be converted to full-auto if you have extensive knowledge of machining and a lathe and a machine shop for cutting the parts to exact specification, but your average person won't have this knowledge.\n \n \nYou clearly ignored what I actually said.\n \n \n Then stop being so ambiguous in what you say.\n \n \nPerhaps if you bothered to read the links, you'd be arguing from a position other then of sheer and absolute ignorance.\n\n \n Only one link provides any information. And that technique doesn't qualify as a true machinegun, a true machinegun wouldn't choke on hard primer ammunition.\n \n Bump firing doesn't qualify as a machinegun.\n \n \nSuch proof? Care to cite? Read the links and then decide. Don't decide and refuse to read the links.\n \n \n People have been providing \"proof\" of Bigfoot, the Loch Ness monster, the Chupacabra and various other cryptids and legendary animals for decades, but this \"proof\" doesn't support their existence.\n \n CNN had \"proof\" that the 1994 AWB covered \"real machineguns\" and the NRA was all over their asses the next day for lying to the public.\n \n Kellerman \"proved\" that gun owners are 43 times more likely to kill a friend or loved one than a criminal if they had a gun in the house, but he still got debunked and his study discredited.", 
   {}, 
   320740, 
   null, 
   1219160220.0
  ], 
  [
   320814, 
   null, 
   "obvious_child", 
   "And 15 minutes suggests it's very easy to pull off.\n\n \n Compared to actually making a gun from scratch yes. \n \n \nAny semi-auto could in theory be converted to full-auto if you have extensive knowledge of machining and a lathe and a machine shop for cutting the parts to exact specification, but your average person won't have this knowledge.\n\n \n Hence why you'd go to a good gunsmith. Hence why I stated that in the first place. Why you deliberately chose to ignore it, well, that's something else. A few users can probably comment on that given your responses so far. \n \n \nThen stop being so ambiguous in what you say.\n\n \n It is not my fault you lack reading comprehension. I made it perfectly clear that it would require a good gunsmith with machine milling capabilities. Why you couldn't understand that the first two times, I don't know why.\n \n \nOnly one link provides any information. And that technique doesn't qualify as a true machinegun, a true machinegun wouldn't choke on hard primer ammunition.\n\n \n Um, the issue was whether or not a Ak-47 can be illegally converted into an automatic. Whether or not it fits your definition of a true machine gun is irrelevant. And the US definition of machine gun is rather silly. Seriously, your use of changing the subject and other fallacies is quite dishonest.\n \n \nPeople have been providing \"proof\" of Bigfoot, the Loch Ness monster, the Chupacabra and various other cryptids and legendary animals for decades, but this \"proof\" doesn't support their existence.\n \n CNN had \"proof\" that the 1994 AWB covered \"real machineguns\" and the NRA was all over their asses the next day for lying to the public.\n\n \n lol. Your argument now is that it doesn't qualify as a true machine gun, while you ignore that it does go automatic.\n \n Do you ever stay on your original argument? \n \n I see you won't even talk about the .50 caliber on a plane. \n \n You're more dishonest then Arch. \n \n I take it you're abandoning your \"never happened = impossible\" logic?", 
   {}, 
   320756, 
   null, 
   1219185300.0
  ], 
  [
   321037, 
   null, 
   "Galileo", 
   "I still think it's funny, I don't think you'd need a \"good actor\", just someone who could act like a kind of religious simpleton.\n\n Many of the people who defend guns remind me more of religious simpletons. They reduce the gun control issue to simple statements like \"guns don't kill people, people kill people\" and then expect others to accept these statements as indisputable truths just as many religious people think what they believe are indisputable truths.", 
   {}, 
   320646, 
   null, 
   1219402800.0
  ], 
  [
   321047, 
   null, 
   "Omegamon_X", 
   "Many of the people who defend guns remind me more of religious simpletons. They reduce the gun control issue to simple statements like \"guns don't kill people, people kill people\" and then expect others to accept these statements as indisputable truths just as many religious people think what they believe are indisputable truths.\n\n \n It's awful hard to portray a gun as anything more than an inanimate object that just sits there until somebody picks it up and decides to use it.\n \n So basically anybody that doesn't agree with the \"gun don't kill people, people kill people\" argument must obviously see any potential weapon as something more than an inanimate object that's capable of murdering innocent people on its own without the assistance of an actual user.", 
   {}, 
   321037, 
   null, 
   1219418340.0
  ], 
  [
   321052, 
   null, 
   "iangb", 
   "So basically anybody that doesn't agree with the \"gun don't kill people, people kill people\" argument must obviously see any potential weapon as something more than an inanimate object\n\n (I cut your quote off there because the rest didn't make sense. 'Something more' didn't mix well with the rest of it)\n \n Did you miss out my massive amount of evidence that guns fuel agression? 'Cos that would make a gun more than just an inanimate object...", 
   {}, 
   321047, 
   null, 
   1219420200.0
  ], 
  [
   321057, 
   null, 
   "Omegamon_X", 
   "Did you miss out my massive amount of evidence that guns fuel agression? 'Cos that would make a gun more than just an inanimate object...\n\n \n I've yet to see any credible evidence that guns provide a source of fuel for aggression, or that by somehow making them illegal and removing the ones that're legally known about will somehow make aggression lessen or go away.", 
   {}, 
   321052, 
   null, 
   1219420860.0
  ], 
  [
   321081, 
   null, 
   "sinjin", 
   "I've yet to see any credible evidence that guns provide a source of fuel for aggression, or that by somehow making them illegal and removing the ones that're legally known about will somehow make aggression lessen or go away.\nWhen a woman kills a man it's usually with a gun. Do you think she could have just as confidently chosen aggression without one?", 
   {}, 
   321057, 
   null, 
   1219434660.0
  ], 
  [
   321097, 
   null, 
   "Omegamon_X", 
   "When a woman kills a man it's usually with a gun. Do you think she could have just as confidently chosen aggression without one?\n\n \n ...What exactly is the relevance of this statement?", 
   {}, 
   321081, 
   null, 
   1219439580.0
  ], 
  [
   321104, 
   null, 
   "Penfold", 
   "Duh! It succinctly demolishes your rhetorical argument that guns do not fuel aggression. But anyone with basic comprehension skills should know that.", 
   {}, 
   321097, 
   null, 
   1219443660.0
  ], 
  [
   321111, 
   null, 
   "Omegamon_X", 
   "Duh! It succinctly demolishes your rhetorical argument that guns do not fuel aggression.\n\n \n No it doesn't. How about you show me a woman that's fully capable of beating a man to death in unarmed, hand to hand combat. The average woman is drastically outclassed in terms of height, weight and strength by the average man, you're going to be very hard pressed to find any example of men killed by women when some kind of weapon isn't involved.", 
   {}, 
   321104, 
   null, 
   1219449240.0
  ], 
  [
   321119, 
   null, 
   "sinjin", 
   "No it doesn't. How about you show me a woman that's fully capable of beating a man to death in unarmed, hand to hand combat. The average woman is drastically outclassed in terms of height, weight and strength by the average man, you're going to be very hard pressed to find any example of men killed by women when some kind of weapon isn't involved.\nPrecisely. She needs an edge. Something to allow her to act aggressively with confidence. Something to \"fuel\" her aggression. Works for boys too. KWIM?", 
   {}, 
   321111, 
   null, 
   1219452300.0
  ], 
  [
   321120, 
   null, 
   "Penfold", 
   "[QUOTE=Omegamon_X;321111] .... The average woman is drastically outclassed in terms of height, weight and strength by the average man, .... [QUOTE]\n \n Precisely why your argument fails. A gun fuels her expression of aggression.", 
   {}, 
   321111, 
   null, 
   1219452360.0
  ], 
  [
   321124, 
   null, 
   "Shooterandproud", 
   "[QUOTE=Penfold;321120]\n\n \n Precisely why your argument fails. A gun fuels her expression of aggression.\n\n \n Funny, but generally untrue in my opinion. Contrary to popular belief, women don't want to shoot everyone (usually).", 
   {}, 
   321120, 
   null, 
   1219453920.0
  ], 
  [
   321128, 
   null, 
   "Omegamon_X", 
   "Precisely. She needs an edge. Something to allow her to act aggressively with confidence. Something to \"fuel\" her aggression. Works for boys too. KWIM?\n\n \n \nPrecisely why your argument fails. A gun fuels her expression of aggression.\n\n \n Did either of you two \"geniuses\" ever consider that a gun would better allow a woman to protect herself, that way not having to become yet another nameless, faceless victim of a violent rape because some random guy decided that he wanted a piece of her and wasn't in the mood to ask nicely?\n \n Obviously not, otherwise we wouldn't have the need to be having this conversation. The fact that you immediately jump to the conclusion that a woman with a gun will murder a man in cold blood is proof of just how poorly your view of the world is and how bad your logic really is.\n \n The problem with you and other people like you is that your logic is tilted. In your mind the good guys never, under any circumstances, ever carry guns for any reason. To you there's only the unarmed good guy and the armed bad guys, your world is purely black and white and there's never an inbetween. Well life just don't work that way!", 
   {}, 
   321119, 
   null, 
   1219458900.0
  ], 
  [
   321135, 
   null, 
   "Penfold", 
   "Did either of you two \"geniuses\" ever consider that a gun would better allow a woman to protect herself, that way not having to become yet another nameless, faceless victim of a violent rape because some random guy decided that he wanted a piece of her and wasn't in the mood to ask nicely?\n \n Obviously not, otherwise we wouldn't have the need to be having this conversation. The fact that you immediately jump to the conclusion that a woman with a gun will murder a man in cold blood is proof of just how poorly your view of the world is and how bad your logic really is.\n \n The problem with you and other people like you is that your logic is tilted. In your mind the good guys never, under any circumstances, ever carry guns for any reason. To you there's only the unarmed good guy and the armed bad guys, your world is purely black and white and there's never an inbetween. Well life just don't work that way!\n\n \n \n If sinjin will excuse my speaking for him, we are presenting a rational case deconstructing what passes for argument on your side. You first asserted that guns did not fuel aggression, and we pointed out an obvious situation where they do precisely that thing. \n The rest of this convoluted diatribe is only so much irrelevant goalpost-shifting bollocks", 
   {}, 
   321128, 
   null, 
   1219462920.0
  ], 
  [
   321137, 
   null, 
   "Bryan", 
   "Well now that's an interesting issue.\n \n A firearm certainly gives a degree of confidence in your ability to prevail in a violent encounter. However, if the argument is intended to suggest the presence of a firearm contributes to a motive or desire to commit an act of criminal violence then I would respectfully disagree. Such an argument does not square with my experience.", 
   {
    "post_info": {
     "post_title": "Firearms do not = motive"
    }, 
    "unicode_changes_made": true
   }, 
   321135, 
   null, 
   1219463220.0
  ], 
  [
   321140, 
   null, 
   "Symbiote", 
   "It seems to me the real issue is the meaning of \"fuels aggression\". Omega takes the phrase to mean, \"makes you more likely to attack someone\".\n \n You seem to be taking the phrase to mean, \"makes you more able to kill someone, even if the likelihood of attacking them stays the same or decreases\".\n \n That's why you're talking past one another.", 
   {}, 
   321135, 
   null, 
   1219465680.0
  ], 
  [
   321142, 
   null, 
   "sinjin", 
   "Well now that&#8217;s an interesting issue.\n \n A firearm certainly gives a degree of confidence in your ability to prevail in a violent encounter. However, if the argument is intended to suggest the presence of a firearm contributes to a motive or desire to commit an act of criminal violence then I would respectfully disagree. Such an argument does not square with my experience.\nRespectfully Bryan, I think a gun might give you the confidence to choose a violent/deadly encounter where one might not have taken place otherwise. I never buy the argument often repeated that they could just as well use a fork. Or a hammer or crowbar for that matter.\n \n I personally knew an abused woman who shot her husband to death in front of the kids. His gun btw. Sweet irony.", 
   {}, 
   321137, 
   null, 
   1219466520.0
  ], 
  [
   321145, 
   null, 
   "Omegamon_X", 
   "Respectfully Bryan, I think a gun might give you the confidence to choose a violent/deadly encounter where one might not have taken place otherwise.\n\n \n You think, however you don't KNOW.\n \n \nI personally knew an abused woman who shot her husband to death in front of the kids. His gun btw. Sweet irony.\n\n \n If you knew that she was being abused then why didn't you do anything to help her?", 
   {}, 
   321142, 
   null, 
   1219469160.0
  ], 
  [
   321151, 
   null, 
   "Bryan", 
   "Respectfully Bryan, I think a gun might give you the confidence to choose a violent/deadly encounter where one might not have taken place otherwise. I never buy the argument often repeated that they could just as well use a fork. Or a hammer or crowbar for that matter.\n \n I personally knew an abused woman who shot her husband to death in front of the kids. His gun btw. Sweet irony.\n\n \n \n I don't think we are that far apart on this issue. My statement is merely that in my opinion and experience a gun does not contribute to the motive-the anger, hatred, revenge, greed, etc.-that drives the aggression. \n \n I agree that possessing a gun does give the person greater confidence to engage in an act of violence.\n \n Assuming the husband was unarmed, then in Virginia your woman would have committed the crime of willful, deliberate, and premeditated murder.", 
   {
    "unicode_changes_made": true
   }, 
   321142, 
   null, 
   1219499760.0
  ], 
  [
   321171, 
   null, 
   "sinjin", 
   "If you knew that she was being abused then why didn't you do anything to help her?\nI did not know her at the time. She became my brother's mother-in-law only later. And stop being such a dick.", 
   {}, 
   321145, 
   null, 
   1219524180.0
  ], 
  [
   321173, 
   null, 
   "sinjin", 
   "I don&#8217;t think we are that far apart on this issue. My statement is merely that in my opinion and experience a gun does not contribute to the motive&#8212;the anger, hatred, revenge, greed, etc.&#8212;that drives the aggression. \n \n I agree that possessing a gun does give the person greater confidence to engage in an act of violence.\n \n Assuming the husband was unarmed, then in Virginia your woman would have committed the crime of willful, deliberate, and premeditated murder.\nIn my state as well although in this case the D.A. chose not to file because of the long history of domestic abuse. \"Burning Bed\" defense I believed it's called. Temporary insanity.", 
   {}, 
   321151, 
   null, 
   1219524360.0
  ], 
  [
   321222, 
   null, 
   "Ethmi", 
   "Precisely. She needs an edge. Something to allow her to act aggressively with confidence. Something to \"fuel\" her aggression. Works for boys too. KWIM?\n\n \n What? Would you rather let her get mugged, or raped, or something? Would that be better than letting her defend herself because you don't want her to get \"aggressive\"? \n \n And finally, according to a source I've posted elsewhere, in 91.7% of cases where someone used a gun in self defence, the attacker was not killed or injured. So 91.7% of the time, the attacker would not be shot. \n \n So are you saying that instances of self-defence where nobody was injured are acts of \"aggression\"?", 
   {}, 
   321119, 
   null, 
   1219550280.0
  ], 
  [
   321224, 
   null, 
   "Ethmi", 
   "Respectfully Bryan, I think a gun might give you the confidence to choose a violent/deadly encounter where one might not have taken place otherwise. I never buy the argument often repeated that they could just as well use a fork. Or a hammer or crowbar for that matter.\n \n I personally knew an abused woman who shot her husband to death in front of the kids. His gun btw. Sweet irony.\n\n \n First off, was she about to be attacked before she shot him? I don't think the kids would feel as bad as you make it sound, because if he beat the living hell out of his own wife, could you imagine what he would do to the kids? Maybe he was an abusive parent? \n \n But aside from that, according to a source elsewhere, this incedent is in the 8.3% category.", 
   {}, 
   321142, 
   null, 
   1219550820.0
  ], 
  [
   321246, 
   null, 
   "Penfold", 
   "Maybe he was an origami black belt. :)", 
   {}, 
   321224, 
   null, 
   1219588320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Watergate All Over Again?", 
  "url": "http://www.4forums.com/political/gun-control-debates/11441-watergate-all-over-again.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11441, 
  "discussion_files": [
   [
    "3400.html", 
    "http://www.4forums.com/political/gun-control-debates/11441-watergate-all-over-again-print.html"
   ], 
   [
    "3401.html", 
    "http://www.4forums.com/political/gun-control-debates/11441-watergate-all-over-again-8-print.html"
   ], 
   [
    "3402.html", 
    "http://www.4forums.com/political/gun-control-debates/11441-watergate-all-over-again-6-print.html"
   ], 
   [
    "3403.html", 
    "http://www.4forums.com/political/gun-control-debates/11441-watergate-all-over-again-4-print.html"
   ], 
   [
    "3404.html", 
    "http://www.4forums.com/political/gun-control-debates/11441-watergate-all-over-again-5-print.html"
   ], 
   [
    "3405.html", 
    "http://www.4forums.com/political/gun-control-debates/11441-watergate-all-over-again-7-print.html"
   ], 
   [
    "3406.html", 
    "http://www.4forums.com/political/gun-control-debates/11441-watergate-all-over-again-3-print.html"
   ], 
   [
    "3407.html", 
    "http://www.4forums.com/political/gun-control-debates/11441-watergate-all-over-again-2-print.html"
   ]
  ], 
  "identifier": 11441
 }
]