[
 [
  [
   19950, 
   null, 
   "Parcum", 
   "Although I joined these forums earlier this year, and was a member of the old forums the previous year, I am relatively new to the debates here. I have been debating since 2001, when I joined the pro-life movement. For the longest time I restricted my debating towards abortion, an issue I stood firmly on and knew firmly of. However, by early 2002 I began debating more and more diverse debates; from the 2000 presidential elections to the defense of Catholicism, I debated much. After divorcing a different online forum which I spent two years debating on (I left simply because certain characters in the forum were much closed minded and very childish), I moved to this forum. From here, I have begun debating issues I know best; Abortion, Catholicism, and general conservatism. Hence, I come to defend Roman Catholicism, and attack this new trend of \"Jack Chick Protestantism\", it est, Protestantism with a goal of destroying the Catholic Church (and just to make Montalban's day, the Orthodox Church as well). \n \n Why is there such intolerability? The mere reason of this version of Protestantism's obnoxiousness is obvious though their perverted criticisms of the Catholic Church. They believe that the Church, especially the Pope, is under \"Lucifer['s] insane mission\", and that \"Satan use[d] [Mary's] image to decieve millions\" Further, they cannot seem to resist the temptation to attack the Catholic Church, by using arguments of horrible things the Church did in the past, and making up scandalous lies. They seem to be ignoring many facts. Firstly, the Protestant Churches throughout the recent centuries have had the most power- Germany, England, the Netherlands, all were the most powerful nations around. Hence, they were more prone to corruption. The same corruption they criticized the church had when Christendom was truly alive in Europe happened to them within a century after their founding. Another fact is that Matthew and Acts have clearly stated that there will be \"false prophets\" and \"wolves\" amongst the Church. \n \n  Beware of false prophets, who come to you in the clothing of sheep, but inwardly they are ravening wolves. (Matthew 7:15)\n \n  I know that after my departure ravening wolves will enter in among you, not sparing the flock. (Acts 20:29)\n \n And why shouldn't Lucifer attack the Church? What better place to attack it than the Church that threatens him most, the Church that stands against him, the Church that fully is in line with God's divine plan? Satan wants to attack what is most threatening to him. If the Church wasn't true, why would he bother with it? \n \n Who is Jack Chick? He is, by far, the most scandalous person I have known. This man creates cartoon tracts attacking Catholicism. I will be displaying these tracts and correcting them.\n \n http://www.chick.com/tractimages49160/0071/0071_08.gif\n \n This is by far one of the most biggest lies I have ever seen. \"Transubstantiation\" was a term invented and defined in the Council of Trent, not some sort of ancient polytheistic ritual:\n \n  \"Christ our Saviour said that what he was offering under the species of bread was truly his body. This is why it has always been a dogma of the Church of God, and is now reaffirmed by this Holy Council, that the consecration of the bread and wine converts the whole substance of the bread into the substance of the body of Christ our Lord, and the whole substance of the wine into the substance of his blood. The Holy Catholic Church fittingly and properly calls this conversion 'transubstantiation'. . . .\" (October 10th, 1551, Session XIII, Chapter 4)\n \n http://www.chick.com/tractimages49160/0071/0071_07.gif\n \n Here's another good one. He claims that there was never a time the bible said to have a \"priest\". Acts 16:4, 1 Timothy 5:17, James 5:14-15, Titus 1:5-6, 1 Peter 5:1. \"Elders\" and \"Presbyter\" are synonyms for \"priest\". \n \n Those were just a couple of ones. Oh, here's my favorite- the one that made me laugh the hardest. \n \n http://www.chick.com/tractimages49160/0071/0071_11.gif\n \n LOL. Mere proof of Jack Chick's ignorance. \n \n In conclusion, this Jack Chick Protestantism we see among several protestant members (or perhaps a few... actually only one), is simply an ignorant set of beliefs that does not even welcome Catholicism in consideration, and continues to claim Catholicism as Satan's Church. This article was merely to counterstrike the rumors that have be set by Jack Chick. I assure you this: Jack Chick is a liar. He bases his beliefs by fictional ideas. Perhaps it is legit to call his tracts \"comic books\".", 
   {
    "post_info": {
     "post_title": "Intolerance of the Catholic Church; the thesis of Jack Chick Protestantism"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1066543200.0
  ], 
  [
   19952, 
   null, 
   "montalban", 
   "Really, there is a Jack Chick? I thought you were teasing Rapture with a pun based on the American term \"Jack XXXX\" as in you don't know Jack XXXX.\n \n I had a look at the web-site, albeit briefly.\n \n I'm amazed someone like that exists.", 
   {}, 
   19950, 
   null, 
   1066544040.0
  ], 
  [
   19959, 
   null, 
   "Parcum", 
   "Yes, he's very popular. On World YOuth Day Jack Chick tries to convert the Catholics by passign literature telling them they're going to hell.", 
   {}, 
   19952, 
   null, 
   1066546200.0
  ], 
  [
   19962, 
   null, 
   "montalban", 
   "As you know, I'm not pro-Pope, but when I see people like Mother Therresa, St. Francis of Assisi etc. I'm not as convinced as Jack XXXX - er Jack Chick.", 
   {}, 
   19959, 
   null, 
   1066546380.0
  ], 
  [
   19963, 
   null, 
   "Parcum", 
   "What do you mean? Convinced about what?", 
   {}, 
   19962, 
   null, 
   1066546740.0
  ], 
  [
   19968, 
   null, 
   "montalban", 
   "What do you mean? Convinced about what?\n\n I'm not as convinced at being anti-Pope as Jack Chick", 
   {}, 
   19963, 
   null, 
   1066561740.0
  ], 
  [
   19993, 
   null, 
   "Parcum", 
   "Ah, I see.", 
   {}, 
   19968, 
   null, 
   1066586460.0
  ], 
  [
   20036, 
   null, 
   "montalban", 
   "Ah, I see.\n\n In other words I am against the Pope, to a degree - otherwise I'd be Catholic.\n \n However, as far as degrees go, this is not anywhere near Jack Chick or Rapture.", 
   {}, 
   19993, 
   null, 
   1066641720.0
  ], 
  [
   20059, 
   null, 
   "epaphras_faith", 
   "Although I joined these forums earlier this year, and was a member of the old forums the previous year, I am relatively new to the debates here. I have been debating since 2001, when I joined the pro-life movement. For the longest time I restricted my debating towards abortion, an issue I stood firmly on and knew firmly of. However, by early 2002 I began debating more and more diverse debates; from the 2000 presidential elections to the defense of Catholicism, I debated much. After divorcing a different online forum which I spent two years debating on (I left simply because certain characters in the forum were much closed minded and very childish), I moved to this forum. From here, I have begun debating issues I know best; Abortion, Catholicism, and general conservatism. Hence, I come to defend Roman Catholicism, and attack this new trend of \"Jack Chick Protestantism\", it est, Protestantism with a goal of destroying the Catholic Church (and just to make Montalban's day, the Orthodox Church as well). \n \n Why is there such intolerability? The mere reason of this version of Protestantism's obnoxiousness  is obvious though their perverted criticisms of the Catholic Church. They believe that the Church, especially the Pope, is under \"Lucifer['s] insane mission\", and that \"Satan use[d] [Mary's] image to decieve millions\" Further, they cannot seem to resist the temptation to attack the Catholic Church, by using arguments of horrible things the Church did in the past, and making up scandalous lies.  They seem to be ignoring many facts. Firstly, the Protestant Churches throughout the recent centuries have had the most power- Germany, England, the Netherlands, all were the most powerful nations around. Hence, they were more prone to corruption. The same corruption they criticized the church had when Christendom was truly alive in Europe happened to them within a century after their founding. Another fact is that Matthew and Acts have clearly stated that there will be \"false prophets\" and \"wolves\" amongst the Church. \n \n \n (emphasis mine)\n \n Parcum:\n \n I am assuming you are attacking Jack Chick Protestants and not all. However, your opening leaves much to be desired in form and maturity. I do not appreciate being lumped in with those. By using phrases such as obnoxiousness, and perverted and then that whole garbage about protestants beliefs about the catholic church being of satan, yipes. How dare you lump all believers that are not catholic into that barrell. I am not a catholic but I am not anti-catholic. I disagree with some doctrine. You ARE anti-protestant. I would not lump all catholics into that category. I have had the priveledge to debate maximus and discuss with him. You are far to young to be taking such a position of hatred.\n \n Using the phrases such as They, and them. It is like saying, those people and then throwing in \"protestant\" like everyone who is protestant believes the garbage and drivel that you posted from \"jack\". Please be more cognizant of what you post. You remove from your own credibility by posting such stuff and using emotionally charged phrases. Appeals to emotions with obnoxious, insane, perverted, etc are not descriptive but rather intended to misdirect or attack. They are illogical and have no place in a debate.\n \n I am not this RAPTURE person and neither is the majority of the protestant church.", 
   {
    "unicode_changes_made": true
   }, 
   19950, 
   null, 
   1066670940.0
  ], 
  [
   20084, 
   null, 
   "Parcum", 
   "The mere reason of this version of Protestantism's obnoxiousness\n\n \n Not all protestants; Jack Chick protestants.", 
   {
    "unicode_changes_made": true
   }, 
   20059, 
   null, 
   1066684440.0
  ], 
  [
   20092, 
   null, 
   "epaphras_faith", 
   "Not all protestants; Jack Chick protestants.\n\n \n I appreciate that clarification. It did not seem that way from your first paragraphs. You seemed to lump all protestants in that basket. Frankly, I don't know this fellow and he seems somewhat extreme.\n \n I have been looking at the RCC catechism and will continue to look. So far, I have only found one item that I might differ with but believe it to be mostly an issue of semantics. As I am not familiar with the catechism, I am more inclined to accept it as a semantical difference and not a doctrinal difference.\n \n The thing I liked the most was this:\n \n \"Above All - Charity \n 25 To conclude this Prologue, it is fitting to recall this pastoral principle stated by the Roman Catechism: \n The whole concern of doctrine and its teaching must be directed to the love that never ends. Whether something is proposed for belief, for hope or for action, the love of our Lord must always be made accessible, so that anyone can see that all the works of perfect Christian virtue spring from love and have no other objective than to arrive at love.\"19\"", 
   {
    "unicode_changes_made": true
   }, 
   20084, 
   null, 
   1066689120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Intolerance of the Catholic Church; the thesis of Jack Chick Protestantism", 
  "url": "http://www.4forums.com/political/religion-debates/1145-intolerance-catholic-church-thesis-jack-chick-protestantism.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1145, 
  "discussion_files": [
   [
    "26084.html", 
    "http://www.4forums.com/political/religion-debates/1145-intolerance-catholic-church-thesis-jack-chick-protestantism-print.html"
   ]
  ], 
  "identifier": 1145
 }
]