[
 [
  [
   319639, 
   null, 
   "Ripskar", 
   "Today we've seen reports of Georgian artillery killing Russian soldiers, Georgians shooting down 2 Russian Migs, and Russian Tanks crossing into Georgia. The UN has called for a ceasefire but no-one seems to be taking notice with heavy fighting around the Georgian capital.", 
   {
    "post_info": {
     "post_title": "Russia Invades Georgia"
    }
   }, 
   null, 
   null, 
   1218209940.0
  ], 
  [
   319802, 
   null, 
   "GiantOreo", 
   "Today we've seen reports of Georgian artillery killing Russian soldiers, Georgians shooting down 2 Russian Migs, and Russian Tanks crossing into Georgia. The UN has called for a ceasefire but no-one seems to be taking notice with heavy fighting around the Georgian capital.\n\n \n Hope things end soon before more innocent lives are lost. Personally I think this is a strongarm display of power by Russia.\n \n Heard Bush on CNN, talking about Georgia being a \"sovereign nation\" and calling for an end to hostilities. What a F%^$ing hypocrite. If he cared about \"sovereignty\" we wouldn't be in Iraq right now and would not be spending billions on this \"war\"\n \n I don't think the US will get involved (except maybe attempts at getting a cease-fire). Personally I don't think it would be practical to do so without being flaming hypocrites.", 
   {}, 
   319639, 
   null, 
   1218323880.0
  ], 
  [
   319806, 
   null, 
   "Jo Bennett", 
   "It's hard to know what to make of what's happening. As far as I can gather the residents of the disputed region seem to prefer being Russian to being Georgian, but any mention of self-determination seems to be drowned out by the sophisticated Georgiagood - Russiabad dialectic being touted in much of the media.", 
   {}, 
   319802, 
   null, 
   1218327660.0
  ], 
  [
   319833, 
   null, 
   "Zardoz", 
   "From what I gather, pissy lil provence Ossetia is broken in 2.\n North = governed by Russia.\n South = formerly goverened by Georgia but, pretty much broke away in conflict in 1992ish.\n \n Georgia pres. vows to bring them back into the 'fold'.\n \n The provence has been cozying up to Russia though.\n \n Georgia attacks them to force them to comply with gov't authority.\n \n Russia sends in help to the 'insurgents' or what ever they're called.\n \n \n The situation has little in real terms to bear witness to anything that happpened in Iraq.\n \n Personally, I've been a 'what do I care unless it benefits me' kinda person.\n So, unless it benefits the US to assist Georgia (which it may), I'd just say 'Georgia? Russia? Ossetia? Who the &^%$ cares?\n \n Then sell all sides weapons at a decent profit.\n Let them determine the outcome themselves.", 
   {}, 
   319806, 
   null, 
   1218346320.0
  ], 
  [
   319843, 
   null, 
   "Ripskar", 
   "We might not be able to do anything about Georgia per se, however if you've been following what the (Russian) bots have been bad-mouthing over the past few months, right alongside Georgia is the Ukraine. A Russian invasion of the Ukraine would be a whole different kettle of fish which we couldn't avoid.\n \n Available forces for such a move are:\n Ekatirenburg \n Latitude 56.850, Longitude 60.600\n COMMANDS: \n \u0095 VOLGA-URAL MILITARY DISTRICT VU 31700 pers., 1 A, 2 mot div, 1 tk div, 3 arty bde/rgt, 1 mot bde, 1 airborne bde, 2 msl bde, 1 ad bde, 1 spetznaz bde, 1 mlrs rgt. 530 tanks, 855 IFV/APC, 440 arty, 36 SSM Tochka. 12.2003-01.2004 inspected by Head of GS Anatoly Kvashnin. 02.2004 joint comd -staff exercises with Siberian MD. 04.2004 inspected by MoD commission headed by Land Troops CINC Gen N. Kormiltsev. 07.2004 took part in \"Union Security\" exercises. 03.2005 regional conscript trainings in Udmurtia. 09.2006 took part in \"South Shield-2006\" exercises: mobilized 3,500 conscripts, 20,000 soldiers, 5,200 weapons units; destroyed 5000 targets, shot 1100000 rounds, launched Tochka missiles. 03.2008 regional comd staff exercises. 04.2008 AD trainings.\n \u0095 34 MOT DIV VU 276 (took part in Chechen war, losses: 194 killed/MIA), 295 mot rgts, 29 tk rgt, 739 arty rgt. 12.2003-01.2004 inspected by Head of GS Anatoly Kvashnin. 2004 commander Maj Gen Sergey Surovkin. 06.2004 took part in \"Mobility-2004\" exercises in Far East. 23.11.2005 visited by S. Ivanov (Minister of Defense). 09.2006 took part in \"South Shield-2006\" exercises.\n \u0095 59 INDEP COMMS BDE VU \n \u0095 29 CHEMICAL BDE VU 363,366 bn", 
   {}, 
   319833, 
   null, 
   1218372120.0
  ], 
  [
   319845, 
   null, 
   "Iuris", 
   "I'm still educating myself on the subject, but what I've found so far coincides with my father's evaluation (a history professor, if you wonder): two nationalist movements going at each other for stupid reasons. Noone is going to come out clean...", 
   {}, 
   319843, 
   null, 
   1218372960.0
  ], 
  [
   322092, 
   null, 
   "Mario", 
   "Hello everybody! I have just returned from Georgia (yes-yes, you must have heard much about that country in the recent few weeks) and I have something to tell you about Georgian president Saakashvili in this post. \n As far as I understand reading various forums, Saakashvili is often referred to as a person out of his mind as he gave start to that terrible manslaughter in South Ossetia. Well, from my part, I may say that he is really and totally off the top. As it turns out to be, I am a news cameraman and occasionally had to word at several press conferences of Mr Saakashvili. With cameras on, he's not bad. When a press conference is over and cameras are off, you can see him changing drastically (I remember his eating a tie when he thought the cameras was not working - youtube.com/watch?v=-bHU3-9RsrM&feature=related ). This being so, his abnormality became more noticeable right after Georgia's invasion of South Ossetia. Now every grating noise either makes Saakashvili stunned or uncontrollably panicking. I even heard that he sometimes may #### on himself so he's got to put on pants. Besides, now Saakashvili is affected by paranoid delusion of separative raids by ethnic Armenians, Azerbaijanis and Ajarians living in Georgia. That's is why in Georgia the rumor says that quite soon the military machine of Georgia may turn against national minorities in Samtskhe-Javakh and Kvemo-Kartli. Of course, in reality no one is going to attack Saakashvili, but his anyways his fear-mongering might lead to a new war! First there will be acts of provocation (by force of Ukrainian nationalists who arrived to Georgia earlier this year in May or June and took part in the genocide of Ossetians) and then a full-scale war with the goal to \"suppress separatist moods\" of national minorities of Georgia! Damn it, there certainly will be yet more blood and civil victims!", 
   {
    "post_info": {
     "post_title": "Saakashvili is not OK. Not at all! Georgia's ethnic minorities in peril!"
    }
   }, 
   319639, 
   null, 
   1220278620.0
  ], 
  [
   322234, 
   null, 
   "Born", 
   "Nice wrapper for a big lie.....\n Well, reaction of some European politicians to the Catastrophe in the Caucasus (South Ossetia vs Georgia) reveals lack of any their real interest in the peace there. What's taking place instead is continued gambling with words and concepts to misinform people and push them to false conclusions. The top British politician Gordon offers example of primitive lie. He relates to \"naked Russia's aggression\" while he should rather refer to \"skilful Russia peacekeepers' effort to subdue aggression by Saakashvili\". Believe to the witness been in South Ossetia and seen the Saakashvili's thugs at work! That was real nightmare!! \n \n youtube.com/watch?v=VlsJ5QHcd0c&feature=related\n \n Next goes what I'd qualify as specimen of covert lie. Brown calls to \"alleviate sufferings of the 100,000 Georgian civilians left without homes and.... pledges &#8356;2m for long-term reconstruction in Georgia\". Firstly, Brown should have made it clear to all that these 100,000 civilians were settled in South Ossetia, which has already declared its independence from Georgia. \"Generous\" Brown seems to be hateful of the idea to call things their true names... for he is not actually set to help real victims. All the British money will go to reconstruct the ruined military infrastructure in Georgia. But that news would come too discouraging truth for British taxpayers and other. So Brown has made a try to wrap lie into nice cover. Still it tastes disgusting!", 
   {
    "unicode_changes_made": true
   }, 
   319639, 
   null, 
   1220366580.0
  ], 
  [
   322506, 
   null, 
   "galeleo", 
   "Madcap rules Georgia!\n Save Javakhk!\n \n youtube.com/watch?v=NeahwNMgPFY", 
   {}, 
   319639, 
   null, 
   1220547420.0
  ], 
  [
   323747, 
   null, 
   "Samseshvili", 
   "Hello! I'm from Georgia and I want to tell you what is going on here right now. Some 4000 Georgian soldiers from among those who were taking part in a military conflict between Georgia and South Osetia will have to stand before court-martial for the alleged desertion case. That's unbelievable! These people are absolutely guiltless! They are mainly students, conscripts who got caught up on in the street and sent strait into the battle! They did not want to kill anyone, not Osetians, not Russians! They plainly did not belong there and believed that what's going on was a grand mistake of Georgian authority and Saakashvili in person. Now they have to pay for it - a legal prosecution and a long prison term! You know, all these people turned out to be scapegoats for Saakashvili. By the same token he let all those who disagree with his policy line that every appearance of opposition would be suppressed strictly. Now is that what you like to call 'democracy'?!!", 
   {
    "post_info": {
     "post_title": "Saakashvili puts 4000 soldiers into prison!"
    }, 
    "unicode_changes_made": true
   }, 
   319639, 
   null, 
   1221490440.0
  ], 
  [
   323980, 
   null, 
   "Petro", 
   "Hello every one on this forum! I am one from Ukraine and i'm here becaus I'm unsutisfied with what our president Yushchenko doing! I thank God that the schizophrenic militaristic rhetoric of Yushchenko and Ukrainian military (that support him) did not lead our country to what already happened in Georgia. Even so it lead to yet another expansion in the number of Ukrainian peacekeepers contingent in Afghanistan! Perhaps you already know that in the beginning of this year the government of Ukraine decided for expansion in the number of Ukrainian contingent in Afghanistan in two and a half times! What is especially interesting in this fact, at that time it was only Georgia who answered a call of the USA to send more troops to Afghan. As for such longtime allies of America like Germany and Canada, they refused to send more troops to there! Even that very Georgia is now withdrawing it's troops f rom Afghan under excuse that the situation in Georgia is difficult. At this very moment our commander in Chief Yushchenko hurriedly demonstrated his loyalty to America and offered to fill the gap in NATO troops with Ukrainian soldiers! And that's at the moment when there are more and more large-scale attacks by talibs! I swear Ukraine will be in big trouble if only Yushchenko achieves permission for Ukraine to join NATO. That's when it will be hard days for all of us!", 
   {
    "post_info": {
     "post_title": "Yushchenko is a misfortune of Ukraine!"
    }
   }, 
   319639, 
   null, 
   1221665580.0
  ], 
  [
   324252, 
   null, 
   "Georgiy", 
   "How long will Saakashvili continue to cheat? Now, he is trying to deceive us into the belief that Georgian main ally main, which has given us a hand of help in hard time is the USA. Right, Washington has sent $1 billion for revitalization of normal life in Georgia after conflict in South Ossetia. \n But where is US money, I wonder? I know that refugees from border districts are still cabining in Tbilisi's schools and day-cares because they have no possibility to return home or obtain any employment! Moreover, they are getting the humanitarian aid twice a day! And the food is enough only for shy dinner and frugal supper. \n And at this time it becomes known that 60% of cash transfers are coming to Georgia from Russia! Whereas remittance of money from the USA reduces in 40% now (this is an official information)! It looks like Washington helps only our Georgian powers, presenting Russia as our great enemy! Meanwhile Russia helps our ordinary people to survive in such difficult situation!", 
   {
    "post_info": {
     "post_title": "How long will Saakashvili continue to cheat?"
    }, 
    "unicode_changes_made": true
   }, 
   319639, 
   null, 
   1221839820.0
  ], 
  [
   327885, 
   null, 
   "Arthur", 
   "To all seeming current grape failure in Kakheti (the real pearl of our wine-making) has become final judgement of death for the whole wine industry of Georgia. Just think of it!\n Realizing the fact that it would be very difficult to save Georgian wine branch from business failure, our President began to wage a real war against our vine growers. Now he together with his raving entourage does all possible in order to liquidate our world-famous vineyards! The matter is that due to a crazy project of his Dutch wife we should develop tourist business in our wine-making provinces!\n Maybe, Mr. Saakashvili has forgotten that vine and wine in Georgia is a symbol of hospitality, mutual assistance and longevity of our people. I must remind Saakashvili's supporters that only our enemies have always tried to destroy Georgian vineyards, seeking to undermine the country's economy and spiritual forces of our people!", 
   {
    "unicode_changes_made": true
   }, 
   319639, 
   null, 
   1224004140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Russia Invades Georgia", 
  "url": "http://www.4forums.com/political/european-politics-economics/11462-russia-invades-georgia.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 11462, 
  "discussion_files": [
   [
    "31945.html", 
    "http://www.4forums.com/political/european-politics-economics/11462-russia-invades-georgia-print.html"
   ]
  ], 
  "identifier": 11462
 }
]