[
 [
  [
   320016, 
   null, 
   "EchoR1", 
   "there are tons of people out there who judge people as soon as they find out their orientation and i don't think that's right because it doesn't define who you are.\n \n like i'm bisexual and i'm not afraid to admit that. if you hate me because of that then you might as well not finish reading this post. if you don't hate me because of that, then i'm greatful your willing to find out the kind of person i am.\n \n see i have a friend named mike and i didn't know until like 3 months ago that he was anti-gay; he litterally said that all gay people should die to my face. i came out to him. since then, he's still against gay's but he doesn't think they should die or anything. we're pretty good friends though so that little detail doesn't blind us.\n \n so i personally don't think people should judge other people by that. get to know someone first before you judge them at all.\n \n ...now all i ask is you don't attack me with your opinions. if you have an opinion say it but please dont attack anyone on here. everyone has a right to say or feel what they want so say what you think about this, and i won't judge you and hopefully no one else will either.", 
   {
    "post_info": {
     "post_title": "Judging by Orientation Isn't Right"
    }
   }, 
   null, 
   null, 
   1218518580.0
  ], 
  [
   320021, 
   null, 
   "Archangel", 
   "there are tons of people out there who judge people as soon as they find out their orientation and i don't think that's right because it doesn't define who you are.\n \n like i'm bisexual and i'm not afraid to admit that. if you hate me because of that then you might as well not finish reading this post. if you don't hate me because of that, then i'm greatful your willing to find out the kind of person i am.\n \n see i have a friend named mike and i didn't know until like 3 months ago that he was anti-gay; he litterally said that all gay people should die to my face. i came out to him. since then, he's still against gay's but he doesn't think they should die or anything. we're pretty good friends though so that little detail doesn't blind us.\n \n so i personally don't think people should judge other people by that. get to know someone first before you judge them at all.\n \n ...now all i ask is you don't attack me with your opinions. if you have an opinion say it but please dont attack anyone on here. everyone has a right to say or feel what they want so say what you think about this, and i won't judge you and hopefully no one else will either.\n\n \n I agree with you 100% Echo, nobody should be judged or rejected as a person because they are homosexual, or any sexual preference at all. Every human being is a valuable and unique gem in Gods sight. We all have our own hopes and dreams, pasts and futures that are uniquely ours and that is why we are so valuable and precious as individuals. I can honestly say to you that I love you as a human being and hold no animosity at all toward you because of your claimed bisexuality. We are all sinners after all, and all of us are in need of spiritual deliverance of some predominant sin. Mine just happens not to be homosexuality.\n \n With that said, we are in a debate forum, so if we are in debates in the future and you attempt to defend homosexuality as right and normal, I will most probably be on the other side of that debate opposing your opinion regarding the moral rightness of such a stance. But that wont mean that my love or concern for you as a unique and precious individual has changed at all. I just cannot condone or support what I know to be a sinful act, but that doesn't mean I personally dislike the person. And we are here to debate issues after all, so don't expect me to change my convictions for the sake of a smooth ride. Because that just isn't my style. I hope you plug in and enjoy your stay here. emoticon_xangel", 
   {}, 
   320016, 
   null, 
   1218520500.0
  ], 
  [
   320028, 
   null, 
   "Ohioprof", 
   "I agree with you 100% Echo, nobody should be judged or rejected as a person because they are homosexual, or any sexual preference at all. Every human being is a valuable and unique gem in Gods sight. We all have our own hopes and dreams, pasts and futures that are uniquely ours and that is why we are so valuable and precious as individuals. I can honestly say to you that I love you as a human being and hold no animosity at all toward you because of your claimed bisexuality. We are all sinners after all, and all of us are in need of spiritual deliverance of some predominant sin. Mine just happens not to be homosexuality.\n \n With that said, we are in a debate forum, so if we are in debates in the future and you attempt to defend homosexuality as right and normal, I will most probably be on the other side of that debate opposing your opinion regarding the moral rightness of such a stance. But that wont mean that my love or concern for you as a unique and precious individual has changed at all. I just cannot condone or support what I know to be a sinful act, but that doesn't mean I personally dislike the person. And we are here to debate issues after all, so don't expect me to change my convictions for the sake of a smooth ride. Because that just isn't my style. I hope you plug in and enjoy your stay here. emoticon_xangel\n\n \n No one would expect anyone to change his or her convictions for \"the sake of a smooth ride.\" It might, however, be a good idea to use this opportunity to reevaluate your beliefs about \"homosexuality\" in light of new information that you get and in light of arguments that make sense or that reflect people's real experiences as gay people. You have heard many gay people here talk about our lives, and you appear not to listen to us at all. Putting one's hands over one's ears is not dialogue, nor does it enhance learning. \n \n If you really listen and think about what people here are telling you, you might decide to change your beliefs about gay people, not \"for the sake of a smooth ride\" but for the sake of understanding other people better and for the sake of having a more accurate, truthful awareness of other people's lives.", 
   {}, 
   320021, 
   null, 
   1218547860.0
  ], 
  [
   320033, 
   null, 
   "Archangel", 
   "No one would expect anyone to change his or her convictions for \"the sake of a smooth ride.\" It might, however, be a good idea to use this opportunity to reevaluate your beliefs about \"homosexuality\" in light of new information that you get and in light of arguments that make sense or that reflect people's real experiences as gay people. You have heard many gay people here talk about our lives, and you appear not to listen to us at all. Putting one's hands over one's ears is not dialogue, nor does it enhance learning. \n \n If you really listen and think about what people here are telling you, you might decide to change your beliefs about gay people, not \"for the sake of a smooth ride\" but for the sake of understanding other people better and for the sake of having a more accurate, truthful awareness of other people's lives.\n\n \n You are presuming much about the way I view homosexuals Op. You seem to be thinking that I personally excoriate, disrespect or automatically dislike homosexuals I know or meet in life, when nothing is further from the truth. I neither judge, condemn or offend any homosexuals that I personally know. I personally feel nothing but compassion and affection for homosexuals. You are judging my personal actions in life by my debating style on an impersonal forum which requires honest opinions in response to moral and ethical arguments that reflect principles which people live their lives by. \n \n From a spiritual perspective, it is impossible for me to respond in any other way when someone here is defending what I know to be morally wrong, as right and normal. If we had dozens of serial adulterers who debated fervently that they were proud to cheat on their wives because it was their nature to cheat, and for me to insist that they must stop because the bible say's they must in order to be saved, would evoke the same response from me as I told them that according to the gospel of salvation, we all must repent of our predominant sin, which means turn away from them as we receive Christ as our personal savior in life. \n \n I would explain to them that God loves us all equally just as I have told the homosexuals here, but that He doesn't give adulterers a special dispensation for adultery, just as I have told the homosexuals here. Here's the bottom line Op, just because the homosexuals here don't like my warnings and take offense at being told that they are wrong in their sexual preference, it doesn't mean at all that I am motivated by anything other than a sincere love and concern for you all. My concern for you is eternal though, and not based on being accepted by you now, on this forum. So to assume that I must reconsider my beliefs rather than you all reconsidering your beliefs is very presumptuous indeed.", 
   {}, 
   320028, 
   null, 
   1218554040.0
  ], 
  [
   320038, 
   null, 
   "Ohioprof", 
   "You are presuming much about the way I view homosexuals Op. You seem to be thinking that I personally excoriate, disrespect or automatically dislike homosexuals I know or meet in life, when nothing is further from the truth. I neither judge, condemn or offend any homosexuals that I personally know. I personally feel nothing but compassion and affection for homosexuals. You are judging my personal actions in life by my debating style on an impersonal forum which requires honest opinions in response to moral and ethical arguments that reflect principles which people live their lives by. \n \n From a spiritual perspective, it is impossible for me to respond in any other way when someone here is defending what I know to be morally wrong, as right and normal. If we had dozens of serial adulterers who debated fervently that they were proud to cheat on their wives because it was their nature to cheat, and for me to insist that they must stop because the bible say's they must in order to be saved, would evoke the same response from me as I told them that according to the gospel of salvation, we all must repent of our predominant sin, which means turn away from them as we receive Christ as our personal savior in life. \n \n I would explain to them that God loves us all equally just as I have told the homosexuals here, but that He doesn't give adulterers a special dispensation for adultery, just as I have told the homosexuals here. Here's the bottom line Op, just because the homosexuals here don't like my warnings and take offense at being told that they are wrong in their sexual preference, it doesn't mean at all that I am motivated by anything other than a sincere love and concern for you all. My concern for you is eternal though, and not based on being accepted by you now, on this forum. So to assume that I must reconsider my beliefs rather than you all reconsidering your beliefs is very presumptuous indeed.\n\n \n I did not say that you dislike or disrespect gay people. I said that you close your ears to what the gay people here have said about our own lives. In closing your ears and insisting that YOU know better what is good for us than we do for ourselves, you cut yourself off from growing in knowledge and understanding. You have taken a particular interpretation of the Bible, which many Christians do not agree with, and you have insisted that this is the \"truth.\" But it's just your beliefs about the truth. You never even consider that your beliefs about the issue of same-sex marriage might be wrong. \n \n Adultery is a different issue entirely from same-sex marriage. I think that probably most people, including most Christians, regard adultery as wrong and as immoral. It's clearly and explicitly condemned in the Bible, in both the old and new testaments. That is not true of same-sex marriage, which is nowhere mentioned in the Bible. Adultery does harm; same-sex marriage does no harm. Most people, I suspect, continue to regard adultery as wrong, for good reasons, both religious and secular. I regard adultery as wrong. I do not regard same-sex marriage as wrong. Attitudes regarding same-sex marriage are clearly changing, as more people think about this subject and realize that their previous prejudice against gay people and their opposition to same-sex marriage were wrong.\n \n It is not virtuous to hold rigidly to a particular belief and to refuse to consider the evidence or the possibility that one's belief may be wrong. Reconsidering and possibly changing one's beliefs about same-sex marriage do not mean that one tosses Christianity out the window. Plenty of Christians support same-sex marriage, and many married gay couples are Christian. \n \n My argument in these threads is not that Christianity as a whole is bad or wrong; my argument is that opposition to same-sex marriage is wrong, that it is based on mistaken thinking. I think your beliefs regarding same-sex marriage are wrong.....I think they are mistaken. And those beliefs, when they lead to laws that discriminate against gay people and against our families, do harm to families and to children.", 
   {}, 
   320033, 
   null, 
   1218558840.0
  ], 
  [
   320064, 
   null, 
   "Archangel", 
   "I did not say that you dislike or disrespect gay people. I said that you close your ears to what the gay people here have said about our own lives. In closing your ears and insisting that YOU know better what is good for us than we do for ourselves, you cut yourself off from growing in knowledge and understanding. You have taken a particular interpretation of the Bible, which many Christians do not agree with, and you have insisted that this is the \"truth.\" But it's just your beliefs about the truth. You never even consider that your beliefs about the issue of same-sex marriage might be wrong. \n \n Adultery is a different issue entirely from same-sex marriage. I think that probably most people, including most Christians, regard adultery as wrong and as immoral. It's clearly and explicitly condemned in the Bible, in both the old and new testaments. That is not true of same-sex marriage, which is nowhere mentioned in the Bible. Adultery does harm; same-sex marriage does no harm. Most people, I suspect, continue to regard adultery as wrong, for good reasons, both religious and secular. I regard adultery as wrong. I do not regard same-sex marriage as wrong. Attitudes regarding same-sex marriage are clearly changing, as more people think about this subject and realize that their previous prejudice against gay people and their opposition to same-sex marriage were wrong.\n \n It is not virtuous to hold rigidly to a particular belief and to refuse to consider the evidence or the possibility that one's belief may be wrong. Reconsidering and possibly changing one's beliefs about same-sex marriage do not mean that one tosses Christianity out the window. Plenty of Christians support same-sex marriage, and many married gay couples are Christian. \n \n My argument in these threads is not that Christianity as a whole is bad or wrong; my argument is that opposition to same-sex marriage is wrong, that it is based on mistaken thinking. I think your beliefs regarding same-sex marriage are wrong.....I think they are mistaken. And those beliefs, when they lead to laws that discriminate against gay people and against our families, do harm to families and to children.\n\n \n Hi Op, where in anything I said in my post above, did I mention same sex marriage? We weren't even discussing SSM as far as I knew. I was discussing same gender sex and what the bible say's about that originally, with Echo, and then you. We must first get past that scriptural dilemma before even considering the rightness or wrongness of SSM. My comparison of adultery to homosexuality is applicable as they are both literally mentioned side by side in most passages where homosexuality is mentioned, as dangerous and harmful sins of the flesh in the bible.\n \n Now, if we could agree that the bible does not condemn homosexuality, then, and only then would discussing gay marriage make sense to me. But no matter how you slice it, especially since adultery and homosexuality are referred to as wrong together in most cases, then it is irrational, inconsistent and illogical to then claim that homosexuality is ok while adultery is accepted as wrong. \n \n And let's look at Matthew's recent attempt to imply that Jesus said that God made homosexuals gay by referring to Matthew 19:22 which speaks about Eunuchs. What he never even acknowledged in his argument was that Matthew 19 http://cf.blb.org/Bible.cfm?b=Mat&c=19&v=12&t=NASB#12 is a chapter about divorce and marriage in which Jesus quoted Genesis in his answer in verses 4-6. But if eunuchs being homosexual, and marriage being proper between men is factual, then this was the perfect opportunity for Jesus to use two men as an example of being married, rather than referring only to traditional biblically accepted marriage in His answer. \n \n But here's why homosexual marriage, and the wrongness of homosexuality was never spoken about by Jesus. It's because its wrongness was such a given that it wasn't worthy of discussion. No one questioned the immorality of it, just as in attempting to trap Jesus, the Pharisees never asked Him about murder, rape or incest. These sins were a given in the Torah and they only tried to trap Him in doctrinal areas such as divorce, adultery and life after death which pharisees believed in but sadducees rejected. \n \n I don't know where else to go with this other than to say that nothing that I'm saying or believe regarding this issue has anything to do with my personal preferences or opinion about homosexuals in any way. I must have said a hundred times that I have no personal vested interest in homosexuality being rejected in the bible as an acceptable sexual expression. If I had any theological doubts at all about the veracity and scriptural consistency in homosexuality being unacceptable according to Gods moral standards, then I wouldn't rest until I could prove it. But I did that research decades ago. I know what I know, and that is that if homosexuality was ok, then it would be clearly shown to be in the bible.", 
   {}, 
   320038, 
   null, 
   1218570300.0
  ], 
  [
   320068, 
   null, 
   "Ohioprof", 
   "Hi Op, where in anything I said in my post above, did I mention same sex marriage? We weren't even discussing SSM as far as I knew. I was discussing same gender sex and what the bible say's about that originally, with Echo, and then you. We must first get past that scriptural dilemma before even considering the rightness or wrongness of SSM. My comparison of adultery to homosexuality is applicable as they are both literally mentioned side by side in most passages where homosexuality is mentioned, as dangerous and harmful sins of the flesh in the bible.\n \n Now, if we could agree that the bible does not condemn homosexuality, then, and only then would discussing gay marriage make sense to me. But no matter how you slice it, especially since adultery and homosexuality are referred to as wrong together in most cases, then it is irrational, inconsistent and illogical to then claim that homosexuality is ok while adultery is accepted as wrong. \n \n And let's look at Matthew's recent attempt to imply that Jesus said that God made homosexuals gay by referring to Matthew 19:22 which speaks about Eunuchs. What he never even acknowledged in his argument was that Matthew 19 http://cf.blb.org/Bible.cfm?b=Mat&c=19&v=12&t=NASB#12 is a chapter about divorce and marriage in which Jesus quoted Genesis in his answer in verses 4-6. But if eunuchs being homosexual, and marriage being proper between men is factual, then this was the perfect opportunity for Jesus to use two men as an example of being married, rather than referring only to traditional biblically accepted marriage in His answer. \n \n But here's why homosexual marriage, and the wrongness of homosexuality was never spoken about by Jesus. It's because its wrongness was such a given that it wasn't worthy of discussion. No one questioned the immorality of it, just as in attempting to trap Jesus, the Pharisees never asked Him about murder, rape or incest. These sins were a given in the Torah and they only tried to trap Him in doctrinal areas such as divorce, adultery and life after death which pharisees believed in but sadducees rejected. \n \n I don't know where else to go with this other than to say that nothing that I'm saying or believe regarding this issue has anything to do with my personal preferences or opinion about homosexuals in any way. I must have said a hundred times that I have no personal vested interest in homosexuality being rejected in the bible as an acceptable sexual expression. If I had any theological doubts at all about the veracity and scriptural consistency in homosexuality being unacceptable according to Gods moral standards, then I wouldn't rest until I could prove it. But I did that research decades ago. I know what I know, and that is that if homosexuality was ok, then it would be clearly shown to be in the bible.\n\n \n You may think that the Bible is clear about what you call \"homosexuality,\" but Bible scholars disagree about this question. Nowhere does the Bible refer to \"homosexuality.\" It's not clear that the few passages that some claim refer to same-sex relationships actually do refer to same-sex relationships. The Bible is ambiguous on this question. Some contemporary Christians have chosen to believe that the Bible condemns same-sex relationships, but that is simply their (and apparently your) interpretation. Other Christians do not agree with this interpretation. \n \n Some Bible scholars have argued that if same-sex marriage were a sin in God's eyes, it would be listed among sins in the Bible. But it is not. To argue that Jesus assumed it is a sin is, again, an interpretation of yours. Your interpretation may be wrong. Many Christians think your interpretation is wrong on this question. You are reading into the Bible a meaning that you think it should have. Nowhere does the Bible ever condemn same-sex marriage. \n \n Marriage is the central issue here, not sex. Gay people can already have sex without getting married; this is not an issue facing the wider civil society. It's same-sex civil marriage that some Christians resist so adamantly, and it's same-sex marriage that is the central issue in these threads.", 
   {}, 
   320064, 
   null, 
   1218571620.0
  ], 
  [
   320072, 
   null, 
   "Archangel", 
   "You may think that the Bible is clear about what you call \"homosexuality,\" but Bible scholars disagree about this question. Nowhere does the Bible refer to \"homosexuality.\" It's not clear that the few passages that some claim refer to same-sex relationships actually do refer to same-sex relationships. The Bible is ambiguous on this question. Some contemporary Christians have chosen to believe that the Bible condemns same-sex relationships, but that is simply their (and apparently your) interpretation. Other Christians do not agree with this interpretation.\n \n \n I would welcome any sources that support your views that aren't slanted because they specifically support a pro gay agenda. A true theological source is seeking only the truth of what the bible say's and doesn't support any school of thought at all. And you're an intelligent person Op, so how can you possibly believe that with objective evidence like this? http://www.4forums.com/political/showpost.php?p=312261&postcount=218 \n \n \nSome Bible scholars have argued that if same-sex marriage were a sin in God's eyes, it would be listed among sins in the Bible. But it is not. To argue that Jesus assumed it is a sin is, again, an interpretation of yours. Your interpretation may be wrong. Many Christians think your interpretation is wrong on this question. You are reading into the Bible a meaning that you think it should have. Nowhere does the Bible ever condemn same-sex marriage.\n \n \n I didn't say that Jesus just assumed it was a sin Op, I said that both the pharisees/religious jewish scholars who hated Him and He Himself took it for granted to the extent that it was never worth talking about specifically. And again, I would welcome any christian sources that aren't endorsing a pro gay agenda, as evidence that they are objective, that support what you're saying. I don't believe you can produce an objective theological source that will back you up.\n \n \nMarriage is the central issue here, not sex. Gay people can already have sex without getting married; this is not an issue facing the wider civil society. It's same-sex civil marriage that some Christians resist so adamantly, and it's same-sex marriage that is the central issue in these threads.\n\n \n But homosexuality in the bible is the act of same gender sex Op. That is the sin that was condemned. Same Sex Marriage was never even dealt with as an issue because it was never dreamt of as a possibility in Ancient Israel. So why would they discuss, or warn against something that had no chance to them of ever happening? It went, and still goes without saying to many, that if homosexuality is condemned, then talking about gay marriage is moot. \n \n Echo started this thread about judging by orientation isn't right. He said nothing about same sex marriage in the OP. Granted, it's a valid debate subject, but it wasn't how this thread started at all.", 
   {}, 
   320068, 
   null, 
   1218581820.0
  ], 
  [
   320074, 
   null, 
   "Ohioprof", 
   "Echo started this thread about judging by orientation isn't right. He said nothing about same sex marriage in the OP. Granted, it's a valid debate subject, but it wasn't how this thread started at all.\n\n \n Nor did this thread start with a discussion about sex. You directed the thread to the subject of sex. \n \n Sexual orientation leads gay people like myself to choose a person of the same sex for a spouse. My sexual orientation leads me to wish to marry someone of the same sex. And it's judgment against gay people that leads people to oppose the equal right under civil law to marry a spouse of the same sex.\n \n Prejudice against gay people results directly in our being denied the equal right to marry our spouses under civil law.", 
   {}, 
   320072, 
   null, 
   1218583440.0
  ], 
  [
   320081, 
   null, 
   "MrWriteLA", 
   "It appears that for some people you just can't put the letters S-E-X together, in ANY context,without them instantly salivating at the mental image of what people do in bed. Correction: what people of the same sex--oops! that'll start them off again!--do in bed, which horrifies them to the point of obsession. (Or maybe it should be \"obsesses them to the point of horror.\") \n \n At any rate, for them sex in the sense of \"gender\" just doesn't appear to in the dictionary. Which is why, it seem, they prefer to use the word \"homoSEXual\" rather than \"gay\" or some other alternative. They want to be sure the icky images they love to dwell upon are conjured up by everyone else as well, the better to be disgusted by. Sex and How Their God Hates It -- that's all they think about, all they want to talk about, all they'll admit to these discussions being about. \n \n \"Monogamous love and commitment between same-gendered people?\" You might as well be speaking in tongues as far as they're concerned.", 
   {}, 
   320074, 
   null, 
   1218586140.0
  ], 
  [
   320084, 
   null, 
   "Ohioprof", 
   "It was in his first response to Echo that Archangel turned the subject away from sexual orientation and onto sex. He did it with these words:\n \n \"if we are in debates in the future and you attempt to defend homosexuality as right and normal, I will most probably be on the other side of that debate opposing your opinion regarding the moral rightness of such a stance. But that wont mean that my love or concern for you as a unique and precious individual has changed at all. I just cannot condone or support what I know to be a sinful act...\"\n \n Then when I wrote about same-sex marriage, Archangel told me that my post was off-topic for the thread. But he himself turned the thread away from sexual orientation by starting immediately to talk about sex.", 
   {}, 
   320081, 
   null, 
   1218586860.0
  ], 
  [
   320088, 
   null, 
   "Archangel", 
   "Nor did this thread start with a discussion about sex. You directed the thread to the subject of sex. \n \n Sexual orientation leads gay people like myself to choose a person of the same sex for a spouse. My sexual orientation leads me to wish to marry someone of the same sex. And it's judgment against gay people that leads people to oppose the equal right under civil law to marry a spouse of the same sex.\n \n Prejudice against gay people results directly in our being denied the equal right to marry our spouses under civil law.\n\n \n Let's recap Op. My response to Echo wasn't about same gender sex or gay marriage, but was about the value of human beings no matter what their sexual proclivity is.\n \n \n I agree with you 100% Echo, nobody should be judged or rejected as a person because they are homosexual, or any sexual preference at all. Every human being is a valuable and unique gem in Gods sight. We all have our own hopes and dreams, pasts and futures that are uniquely ours and that is why we are so valuable and precious as individuals. I can honestly say to you that I love you as a human being and hold no animosity at all toward you because of your claimed bisexuality. We are all sinners after all, and all of us are in need of spiritual deliverance of some predominant sin. Mine just happens not to be homosexuality.\n \n With that said, we are in a debate forum, so if we are in debates in the future and you attempt to defend homosexuality as right and normal, I will most probably be on the other side of that debate opposing your opinion regarding the moral rightness of such a stance. But that wont mean that my love or concern for you as a unique and precious individual has changed at all. I just cannot condone or support what I know to be a sinful act, but that doesn't mean I personally dislike the person. And we are here to debate issues after all, so don't expect me to change my convictions for the sake of a smooth ride. Because that just isn't my style. I hope you plug in and enjoy your stay here.\n\n This is your first post, #3 below in response to my first post to Echo. As you can see, I neither brought up homosexual sex or marriage. But in your response you brought up that I should reevaluate my beliefs about homosexuality.\n \nNo one would expect anyone to change his or her convictions for \"the sake of a smooth ride.\" It might, however, be a good idea to use this opportunity to reevaluate your beliefs about \"homosexuality\" in light of new information that you get and in light of arguments that make sense or that reflect people's real experiences as gay people. You have heard many gay people here talk about our lives, and you appear not to listen to us at all. Putting one's hands over one's ears is not dialogue, nor does it enhance learning. \n \n If you really listen and think about what people here are telling you, you might decide to change your beliefs about gay people, not \"for the sake of a smooth ride\" but for the sake of understanding other people better and for the sake of having a more accurate, truthful awareness of other people's lives.\n\n Here I responded to you regarding homosexuality, but not gay marriage at all.\n \nYou are presuming much about the way I view homosexuals Op. You seem to be thinking that I personally excoriate, disrespect or automatically dislike homosexuals I know or meet in life, when nothing is further from the truth. I neither judge, condemn or offend any homosexuals that I personally know. I personally feel nothing but compassion and affection for homosexuals. You are judging my personal actions in life by my debating style on an impersonal forum which requires honest opinions in response to moral and ethical arguments that reflect principles which people live their lives by. \n \n From a spiritual perspective, it is impossible for me to respond in any other way when someone here is defending what I know to be morally wrong, as right and normal. If we had dozens of serial adulterers who debated fervently that they were proud to cheat on their wives because it was their nature to cheat, and for me to insist that they must stop because the bible say's they must in order to be saved, would evoke the same response from me as I told them that according to the gospel of salvation, we all must repent of our predominant sin, which means turn away from them as we receive Christ as our personal savior in life. \n \n I would explain to them that God loves us all equally just as I have told the homosexuals here, but that He doesn't give adulterers a special dispensation for adultery, just as I have told the homosexuals here. Here's the bottom line Op, just because the homosexuals here don't like my warnings and take offense at being told that they are wrong in their sexual preference, it doesn't mean at all that I am motivated by anything other than a sincere love and concern for you all. My concern for you is eternal though, and not based on being accepted by you now, on this forum. So to assume that I must reconsider my beliefs rather than you all reconsidering your beliefs is very presumptuous indeed.\n\n Here we see that rather than actually respond to my post in any depth, you immediately moved the goal posts to homosexual marriage.\n \nI did not say that you dislike or disrespect gay people. I said that you close your ears to what the gay people here have said about our own lives. In closing your ears and insisting that YOU know better what is good for us than we do for ourselves, you cut yourself off from growing in knowledge and understanding. You have taken a particular interpretation of the Bible, which many Christians do not agree with, and you have insisted that this is the \"truth.\" But it's just your beliefs about the truth. You never even consider that your beliefs about the issue of same-sex marriage might be wrong. \n \n Adultery is a different issue entirely from same-sex marriage. I think that probably most people, including most Christians, regard adultery as wrong and as immoral. It's clearly and explicitly condemned in the Bible, in both the old and new testaments. That is not true of same-sex marriage, which is nowhere mentioned in the Bible. Adultery does harm; same-sex marriage does no harm. Most people, I suspect, continue to regard adultery as wrong, for good reasons, both religious and secular. I regard adultery as wrong. I do not regard same-sex marriage as wrong. Attitudes regarding same-sex marriage are clearly changing, as more people think about this subject and realize that their previous prejudice against gay people and their opposition to same-sex marriage were wrong.\n \n It is not virtuous to hold rigidly to a particular belief and to refuse to consider the evidence or the possibility that one's belief may be wrong. Reconsidering and possibly changing one's beliefs about same-sex marriage do not mean that one tosses Christianity out the window. Plenty of Christians support same-sex marriage, and many married gay couples are Christian. \n \n My argument in these threads is not that Christianity as a whole is bad or wrong; my argument is that opposition to same-sex marriage is wrong, that it is based on mistaken thinking. I think your beliefs regarding same-sex marriage are wrong.....I think they are mistaken. And those beliefs, when they lead to laws that discriminate against gay people and against our families, do harm to families and to children.\n\n \n So to say that I started this talk about homosexual sex is disingenuous at best since I started out just commenting on the value of all human beings. Sadly, this happens all the time with debates I'm in around here. ", 
   {}, 
   320081, 
   null, 
   1218588540.0
  ], 
  [
   320089, 
   null, 
   "Archangel", 
   "It was in his first response to Echo that Archangel turned the subject away from sexual orientation and onto sex. He did it with these words:\n \n \"if we are in debates in the future and you attempt to defend homosexuality as right and normal, I will most probably be on the other side of that debate opposing your opinion regarding the moral rightness of such a stance. But that wont mean that my love or concern for you as a unique and precious individual has changed at all. I just cannot condone or support what I know to be a sinful act...\"\n \n Then when I wrote about same-sex marriage, Archangel told me that my post was off-topic for the thread. But he himself turned the thread away from sexual orientation by starting immediately to talk about sex.\n\n \n Actually, my response to Echo was on topic regarding his OP.", 
   {}, 
   320084, 
   null, 
   1218588660.0
  ], 
  [
   320092, 
   null, 
   "Archangel", 
   "It appears that for some people you just can't put the letters S-E-X together, in ANY context,without them instantly salivating at the mental image of what people do in bed. Correction: what people of the same sex--oops! that'll start them off again!--do in bed, which horrifies them to the point of obsession. (Or maybe it should be \"obsesses them to the point of horror.\") \n \n At any rate, for them sex in the sense of \"gender\" just doesn't appear to in the dictionary. Which is why, it seem, they prefer to use the word \"homoSEXual\" rather than \"gay\" or some other alternative. They want to be sure the icky images they love to dwell upon are conjured up by everyone else as well, the better to be disgusted by. Sex and How Their God Hates It -- that's all they think about, all they want to talk about, all they'll admit to these discussions being about. \n \n \"Monogamous love and commitment between same-gendered people?\" You might as well be speaking in tongues as far as they're concerned.\n\n \n Who is this \"they\" and \"them\" you keep referring to LA ? This is really an us vs them thing for you isn't it! You seem to look at straights as a different species yet you accuse us of seeing you as different on every level of comparison. Your perspective is not only condescending, but is bigoted too as you look down your nose at us.\n \n And why does it bother you to be referred to as a homosexual if what you represent sexually is actually, totally normal? Why should that term offend you? You can feel free to refer to me as a hetero, or a heterosexual all day long and I take no offense at all to it. So why the thin skin if being a homosexual is so right and normal? It seems you should embrace the term if you are really what God intended you all to be as you so fervently claim in so many debates.", 
   {}, 
   320081, 
   null, 
   1218589380.0
  ], 
  [
   320095, 
   null, 
   "Ohioprof", 
   "Let's recap Op. My response to Echo wasn't about same gender sex or gay marriage, but was about the value of human beings no matter what their sexual proclivity is.\n \n \n This is your first post, #3 below in response to my first post to Echo. As you can see, I neither brought up homosexual sex or marriage. But in your response you brought up that I should reevaluate my beliefs about homosexuality.\n \n Here I responded to you regarding homosexuality, but not gay marriage at all.\n \n Here we see that rather than actually respond to my post in any depth, you immediately moved the goal posts to homosexual marriage.\n \n \n So to say that I started this talk about homosexual sex is disingenuous at best since I started out just commenting on the value of all human beings. Sadly, this happens all the time with debates I'm in around here. \n\n \n You DID start talking about sex, as I demonstrated in my previous post where I quoted you doing so. You brought up what you called \"a sinful act\" in your first post to Echo. Echo's post was about sexual orientation.\n \n Perhaps your confusion stems from how you think of sexual orientation. Sexual orientation is NOT \"sexual proclivity.\" Sexual orientation refers to the gender of the person to whom one is attracted and with whom one forms marriage partnerships. It's not fundamentally about having sex; it's about the gender of the person we love and choose to marry.", 
   {}, 
   320088, 
   null, 
   1218590400.0
  ], 
  [
   320096, 
   null, 
   "Ohioprof", 
   "Who is this \"they\" and \"them\" you keep referring to LA ? This is really an us vs them thing for you isn't it! You seem to look at straights as a different species yet you accuse us of seeing you as different on every level of comparison. Your perspective is not only condescending, but is bigoted too as you look down your nose at us.\n \n And why does it bother you to be referred to as a homosexual if what you represent sexually is actually, totally normal? Why should that term offend you? You can feel free to refer to me as a hetero, or a heterosexual all day long and I take no offense at all to it. So why the thin skin if being a homosexual is so right and normal? It seems you should embrace the term if you are really what God intended you all to be as you so fervently claim in so many debates.\n\n \n I mostly would not call a gay person a homosexual. I would rather not call a heterosexual a heterosexual either. These terms emphasize sex and refer not at all to love. They also sound overly clinical, in my view. Just as a heterosexual is not necessarily focused on sex, a gay person is not necessarily focused on sex either. Unfortunately, there isn't an alternate term for heterosexual as there is for homosexual.", 
   {}, 
   320092, 
   null, 
   1218590880.0
  ], 
  [
   320098, 
   null, 
   "Ohioprof", 
   "Actually, my response to Echo was on topic regarding his OP.\n\n \n No. Echo's OP was about sexual orientation. You brought up what you called a \"sinful act.\"", 
   {}, 
   320089, 
   null, 
   1218591120.0
  ], 
  [
   320099, 
   null, 
   "Archangel", 
   "You DID start talking about sex, as I demonstrated in my previous post where I quoted you doing so. You began to talk about sex acts in your first post to Echo. Echo's post was about sexual orientation, which is not the same as sex acts. \n \n Perhaps your confusion stems from how you think of sexual orientation. Sexual orientation is NOT \"sexual proclivity.\" Sexual orientation refers to the gender of the person to whom one is attracted and with whom one forms marriage partnerships. It's not fundamentally about having sex; it's about the gender of the person we love and choose to marry.\n\n \n No Op, I didn't start talking about sex in my first post to Echo, and I don't appreciate the loose interpretations of what I say all the time by your side. I really expect more for you especially, because of what you do for a living. Here is my post to Echo in response to his OP:\n  Archangel\n I agree with you 100% Echo, nobody should be judged or rejected as a person because they are homosexual, or any sexual preference at all. Every human being is a valuable and unique gem in Gods sight. We all have our own hopes and dreams, pasts and futures that are uniquely ours and that is why we are so valuable and precious as individuals. I can honestly say to you that I love you as a human being and hold no animosity at all toward you because of your claimed bisexuality. We are all sinners after all, and all of us are in need of spiritual deliverance of some predominant sin. Mine just happens not to be homosexuality.\n \n With that said, we are in a debate forum, so if we are in debates in the future and you attempt to defend homosexuality as right and normal, I will most probably be on the other side of that debate opposing your opinion regarding the moral rightness of such a stance. But that wont mean that my love or concern for you as a unique and precious individual has changed at all. I just cannot condone or support what I know to be a sinful act, but that doesn't mean I personally dislike the person. And we are here to debate issues after all, so don't expect me to change my convictions for the sake of a smooth ride. Because that just isn't my style. I hope you plug in and enjoy your stay here.\n Now please note the bolded and the underlined. I was NOT speaking about sex acts at all, but was simply referring to homosexuality in the most generic way possible while still being able to make my point about which subject we will disagree on. It isn't right that your side must constantly twist and distort what I say Op, and it is frustrating because it happens all the time here.", 
   {}, 
   320095, 
   null, 
   1218591780.0
  ], 
  [
   320101, 
   null, 
   "Matthew S", 
   "May I remind you Archangel that God made us gay or straight just as he made some diamonds blue, some yellow, or some clear. Homosexuality is no more a sin then being left handed, eating bacon, or having blue eyes.", 
   {}, 
   320099, 
   null, 
   1218594360.0
  ], 
  [
   320102, 
   null, 
   "Ohioprof", 
   "No Op, I didn't start talking about sex in my first post to Echo, and I don't appreciate the loose interpretations of what I say all the time by your side. I really expect more for you especially, because of what you do for a living. Here is my post to Echo in response to his OP:\n  Archangel\n I agree with you 100% Echo, nobody should be judged or rejected as a person because they are homosexual, or any sexual preference at all. Every human being is a valuable and unique gem in Gods sight. We all have our own hopes and dreams, pasts and futures that are uniquely ours and that is why we are so valuable and precious as individuals. I can honestly say to you that I love you as a human being and hold no animosity at all toward you because of your claimed bisexuality. We are all sinners after all, and all of us are in need of spiritual deliverance of some predominant sin. Mine just happens not to be homosexuality.\n \n With that said, we are in a debate forum, so if we are in debates in the future and you attempt to defend homosexuality as right and normal, I will most probably be on the other side of that debate opposing your opinion regarding the moral rightness of such a stance. But that wont mean that my love or concern for you as a unique and precious individual has changed at all. I just cannot condone or support what I know to be a sinful act, but that doesn't mean I personally dislike the person. And we are here to debate issues after all, so don't expect me to change my convictions for the sake of a smooth ride. Because that just isn't my style. I hope you plug in and enjoy your stay here.\n Now please note the bolded and the underlined. I was NOT speaking about sex acts at all, but was simply referring to homosexuality in the most generic way possible while still being able to make my point about which subject we will disagree on. It isn't right that your side must constantly twist and distort what I say Op, and it is frustrating because it happens all the time here.\n\n \n So when you wrote \"sinful act\" in this paragraph, you weren't referring to a sex act? What \"sinful act\" were you referring to, then? \n \n And if you were referring to \"homosexuality\" in \"the most generic way possible,\" as you say, what were you objecting to? If you were not objecting to sex, what were you saying was not \"right and normal?\" What were you arguing against?", 
   {}, 
   320099, 
   null, 
   1218594840.0
  ], 
  [
   320106, 
   null, 
   "Archangel", 
   "Op. Homosexuality is seen as sinful in the bible. I was alluding to the sinfulness of homosexuality, but was in no way challenging Echo to a debate regarding it as a universal concept. Just be fair Op, and don't distort my position by turning a very passive statement as I attempted to make one point, into an aggressive statement as if I was making a challenge at that time. I was speaking about future debates and what my position will be under certain circumstances. I couldn't have been any more generic, and in no way was injecting sex into this debate by that statement.", 
   {}, 
   320102, 
   null, 
   1218596400.0
  ], 
  [
   320107, 
   null, 
   "Archangel", 
   "May I remind you Archangel that God made us gay or straight just as he made some diamonds blue, some yellow, or some clear. Homosexuality is no more a sin then being left handed, eating bacon, or having blue eyes.\n\n \n We will continue to disagree here Matt. God didn't create you gay at all. He created you in His image and He isn't a homosexual. Homosexuality is the result of our fallen natures just as every other sin that corrupts humanity is the result of the fall.", 
   {}, 
   320101, 
   null, 
   1218596820.0
  ], 
  [
   320110, 
   null, 
   "Ohioprof", 
   "This discussion is important, I think, because it raises the question of what the opponents of \"homosexuality\" are actually objecting to. It's not always clear. Are they objecting to a person having a gay or bisexual orientation? Are they objecting to a person having sex with someone of the same sex? Are they objecting to someone marrying someone of the same sex? What is it they object to? We need to ask our opponents to clarify what they object to when they speak against what they call \"homosexuality.\"", 
   {}, 
   320102, 
   null, 
   1218597240.0
  ], 
  [
   320111, 
   null, 
   "Ohioprof", 
   "Op. Homosexuality is seen as sinful in the bible. I was alluding to the sinfulness of homosexuality, but was in no way challenging Echo to a debate regarding it as a universal concept. Just be fair Op, and don't distort my position by turning a very passive statement as I attempted to make one point, into an aggressive statement as if I was making a challenge at that time. I was speaking about future debates and what my position will be under certain circumstances. I couldn't have been any more generic, and in no way was injecting sex into this debate by that statement.\n\n \n You have not answered my question. What was the \"sinful act\" that you said you object to, if not sex? Saying \"sinful act\" sounds like you object to something specific, and it sounds like you object to sex. You need to explain this. \n \n In response to this particular post, what do you mean when you say, \"Homosexuality is seen as sinful in the Bible?\" Do you mean that sex between people of the same sex is seen as sinful, or do you mean that having a gay sexual orientation is seen as sinful, or do you mean that marrying someone of the same sex is seen as sinful? You need to clarify what, exactly, you think is presented as sinful by the Bible. The term \"homosexuality\" is vague, and this term was not used by the writers of the Bible, as the term did not exist until relatively modern times.", 
   {}, 
   320106, 
   null, 
   1218597840.0
  ], 
  [
   320113, 
   null, 
   "Ohioprof", 
   "We will continue to disagree here Matt. God didn't create you gay at all. He created you in His image and He isn't a homosexual. Homosexuality is the result of our fallen natures just as every other sin that corrupts humanity is the result of the fall.\n\n \n Again, what do you mean when you say \"homosexuality is the result of our fallen natures?\" Are you saying that being gay is a sin? Or are you saying that having sex with someone of the same sex is a sin? You seem to be suggesting, though you are not clear, that simply being gay is a sin. But if that is true, then what sin has a gay person who is celibate committed? Please clarify. \n \n I don't think God is either heterosexual or homosexual, nor is God bisexual. I don't think God has a sexual orientation.", 
   {}, 
   320107, 
   null, 
   1218598080.0
  ], 
  [
   320115, 
   null, 
   "Ohioprof", 
   "We will continue to disagree here Matt. God didn't create you gay at all. He created you in His image and He isn't a homosexual. Homosexuality is the result of our fallen natures just as every other sin that corrupts humanity is the result of the fall.\n\n \n Let me point out that here you are judging people for their sexual orientation, which is exactly what Echo in the OP called on people NOT to do. Earlier you said you agreed with him, and here you turn around and do exactly what you agreed people should not do. You are judging gay people as being gay because of our \"fallen natures.\" That's judging people for their sexual orientation.", 
   {}, 
   320107, 
   null, 
   1218598500.0
  ], 
  [
   320121, 
   null, 
   "Archangel", 
   "You have not answered my question. What was the \"sinful act\" that you said you object to, if not sex? Saying \"sinful act\" sounds like you object to something specific, and it sounds like you object to sex. You need to explain this. \n \n In response to this particular post, what do you mean when you say, \"Homosexuality is seen as sinful in the Bible?\" Do you mean that sex between people of the same sex is seen as sinful, or do you mean that having a gay sexual orientation is seen as sinful, or do you mean that marrying someone of the same sex is seen as sinful? You need to clarify what, exactly, you think is presented as sinful by the Bible. The term \"homosexuality\" is vague, and this term was not used by the writers of the Bible, as the term did not exist until relatively modern times.\n\n \n Just that Op, what is so hard to understand? The bible condemns it as an unnatural sexual expression that should not be practiced by anyone. It is to defile ones self with another of the same gender. This isn't my creation that I'm sharing here. It's what the bible say's.\n \n \nThis discussion is important, I think, because it raises the question of what the opponents of \"homosexuality\" are actually objecting to. It's not always clear. Are they objecting to a person having a gay or bisexual orientation? Are they objecting to a person having sex with someone of the same sex? Are they objecting to someone marrying someone of the same sex? What is it they object to? We need to ask our opponents to clarify what they object to when they speak against what they call \"homosexuality.\"\n\n \n It is not how we define ourselves that matters to God, but what we do. I personally don't object to anyone for any reason. But I must stand against, on moral grounds what homosexuality represents. \n \n \nAgain, what do you mean when you say \"homosexuality is the result of our fallen natures?\" Are you saying that being gay is a sin? Or are you saying that having sex with someone of the same sex is a sin? You seem to be suggesting, though you are not clear, that simply being gay is a sin. But if that is true, then what sin has a gay person who is celibate committed? Please clarify.\n\n \n Believing you are a homosexual is not a sin. Acting upon homosexual urges is a sin. Just as a married man who thinks about cheating is not actively sinning, although the bible does say that by just thinking lustful thoughts we commit adultery. So we are dealing with degrees here. Let me be clear though in grouping all sinners together in that sin is sin to God. And Jesus died for all of our sins, be they gay or straight in nature. I'm not condemning homosexuals, just the activity of same gender sex.\n \n \n I don't think God is either heterosexual or homosexual, nor is God bisexual. I don't think God has a sexual orientation.\n\n \n God created male and female Op. So He has all of the characteristics and personality traits that each gender possesses. You could say that God is gender neutral I guess because He possesses both male and female attributes. But if your saying that God isn't SEXUAL by nature, I totally agree with that. But He created us with all of the attributes to enjoy sex with our helpmates. all of those attributes came directly from Him.\n \n I believe that all unnatural sexual and fleshly desires are a corruption, or a perversion of Gods originally perfect design. Both hetero and homosexual unnatural desires mind you. You seem intent on backing me into a corner of separating homosexuals from heteros regarding degrees of seriousness in our sexual proclivities. But sin is sin to God. If I'm cheating on my wife, I don't think God cares if it's with another man or a woman, it's a sin either way that I need to be forgiven for.\n \n \nLet me point out that here you are judging people for their sexual orientation, which is exactly what Echo in the OP called on people NOT to do. Earlier you said you agreed with him, and here you turn around and do exactly what you agreed people should not do. You are judging gay people as being gay because of our \"fallen natures.\" That's judging people for their sexual orientation.\n\n \n Op, how is Matthew blatantly claiming that God made homosexuals gay not making a blanket judgement on the sexual identity of the whole human race? And how do you expect me to answer that statement without giving my honest opinion? So tell me clearly how I was judging rather than simply responding honestly to what Matt said. And feel free to type out anything you like in my place that say's what I wanted to say to Matt without being judgmental while getting my point across. Teach me how to say that without being judgmental if that is how you define judgmental if you can.\n \n And regarding the bolded, if I was holding homosexuals to a different moral standard than I was holding all other types of people, then you might have a point. But I'm not doing that at all. I repeatedly say that we are all the same in Gods sight and all of us can be forgiven for our predominant sins if we will just turn away from them and receive what Christ did for us on the Cross. I also know first hand that we can be delivered from our predominant sins of the flesh because I have personally experienced it in my own life. Not with homosexuality, but the physical urges for my personal sins that had me in bondage were beyond me to control or stop doing. I know what sin is Op. I have been there first hand. And I know that spiritual deliverance is more than an empty promise in some ancient book.", 
   {}, 
   320115, 
   null, 
   1218601560.0
  ], 
  [
   320129, 
   null, 
   "Ohioprof", 
   "Just that Op, what is so hard to understand? The bible condemns it as an unnatural sexual expression that should not be practiced by anyone. It is to defile ones self with another of the same gender. This isn't my creation that I'm sharing here. It's what the bible say's.\n \n \n \n It is not how we define ourselves that matters to God, but what we do. I personally don't object to anyone for any reason. But I must stand against, on moral grounds what homosexuality represents. \n \n \n \n Believing you are a homosexual is not a sin. Acting upon homosexual urges is a sin. Just as a married man who thinks about cheating is not actively sinning, although the bible does say that by just thinking lustful thoughts we commit adultery. So we are dealing with degrees here. Let me be clear though in grouping all sinners together in that sin is sin to God. And Jesus died for all of our sins, be they gay or straight in nature. I'm not condemning homosexuals, just the activity of same gender sex.\n \n \n \n God created male and female Op. So He has all of the characteristics and personality traits that each gender possesses. You could say that God is gender neutral I guess because He possesses both male and female attributes. But if your saying that God isn't SEXUAL by nature, I totally agree with that. But He created us with all of the attributes to enjoy sex with our helpmates. all of those attributes came directly from Him.\n \n I believe that all unnatural sexual and fleshly desires are a corruption, or a perversion of Gods originally perfect design. Both hetero and homosexual unnatural desires mind you. You seem intent on backing me into a corner of separating homosexuals from heteros regarding degrees of seriousness in our sexual proclivities. But sin is sin to God. If I'm cheating on my wife, I don't think God cares if it's with another man or a woman, it's a sin either way that I need to be forgiven for.\n \n \n \n Op, how is Matthew blatantly claiming that God made homosexuals gay not making a blanket judgement on the sexual identity of the whole human race? And how do you expect me to answer that statement without giving my honest opinion? So tell me clearly how I was judging rather than simply responding honestly to what Matt said. And feel free to type out anything you like in my place that say's what I wanted to say to Matt without being judgmental while getting my point across. Teach me how to say that without being judgmental if that is how you define judgmental if you can.\n \n And regarding the bolded, if I was holding homosexuals to a different moral standard than I was holding all other types of people, then you might have a point. But I'm not doing that at all. I repeatedly say that we are all the same in Gods sight and all of us can be forgiven for our predominant sins if we will just turn away from them and receive what Christ did for us on the Cross. I also know first hand that we can be delivered from our predominant sins of the flesh because I have personally experienced it in my own life. Not with homosexuality, but the physical urges for my personal sins that had me in bondage were beyond me to control or stop doing. I know what sin is Op. I have been there first hand. And I know that spiritual deliverance is more than an empty promise in some ancient book.\n\n \n So your position, as you explain it here, is that being gay is not a sin; you believe that having sex with someone of the same sex is a sin. And it sounds like the \"sinful act\" to which you were referring in your initial post to Echo meant sex. Which means you did shift the discussion from sexual orientation to sex acts, despite your protestations that you never brought up sex. \n \n Btw, you are holding gay people to a different standard than you hold heterosexuals. You believe that God gives heterosexuals the option to marry the person they love and thus to express the love they feel for a spouse, and you do not label that expression of love a \"sin.\" You insist that God does not give gay people the option to marry the person we love. That's a different standard. You may claim that it's God's standard, but really it's just your beliefs, which you read into the Bible and attribute to God. Attributing your personal prejudices and beliefs to God may make you feel like you are morally correct, but that doesn't make your beliefs either true or moral. In my view, your beliefs about gay people are wrong and immoral.\n \n You have also said that you don't judge people based on their sexual orientation, but in your post to Matthew, you insisted that being gay is a result of \"the fall.\" And that is judging people based on their sexual orientation, not on what they do.", 
   {}, 
   320121, 
   null, 
   1218605220.0
  ], 
  [
   320133, 
   null, 
   "Ohioprof", 
   "Op, how is Matthew blatantly claiming that God made homosexuals gay not making a blanket judgement on the sexual identity of the whole human race? And how do you expect me to answer that statement without giving my honest opinion? So tell me clearly how I was judging rather than simply responding honestly to what Matt said. And feel free to type out anything you like in my place that say's what I wanted to say to Matt without being judgmental while getting my point across. Teach me how to say that without being judgmental if that is how you define judgmental if you can.\n\n \n You said earlier that you do not judge people by their sexual orientation. You said you agreed with the OP that people should not do that. Here, in your response to Matthew, you contradicted your previous statement by judging people by their sexual orientation. Saying that gay people are gay because of \"the fall\" is a judgment of gay people based on our sexual orientation. It's not based on anything that we have done. It's a judgment based entirely on who we are. \n \n Matthew said that God made some of us gay. That's neither a negative nor a positive judgment; it's just a statement of his view about why some people are gay. Your statement, on the other hand, that people are gay because of \"the fall\" and because of sin, is a denigration of people who are gay. It may be what you believe, but your making this claim contradicts your earlier assertion that people should not judge others on the basis of their sexual orientation. You have done precisely that. You are free to judge others negatively on the basis of their sexual orientation if you want to, but when you contradict yourself by claiming that you don't do this, people are going to point out the inconsistency in your argument. Similarly, when you claim that you did not introduce the topic of sex into the thread when you clearly did, people are going to point out the inconsistency in your argument.", 
   {}, 
   320121, 
   null, 
   1218608100.0
  ], 
  [
   320135, 
   null, 
   "Archangel", 
   "So your position, as you explain it here, is that being gay is not a sin; you believe that having sex with someone of the same sex is a sin. And it sounds like the \"sinful act\" to which you were referring in your initial post to Echo meant sex. Which means you did shift the discussion from sexual orientation to sex acts, despite your protestations that you never brought up sex. \n\n \n By its very definition, the word homosexual implies sex acts Op, so just because I used the word in explaining the types of future debates we would have that would place me and Echo on opposing sides, by your standard is bringing up sex. Forget the context I was using the term in, right? Cmon will you? You are way too smart for these cheap theatrics. You know the context in which I used the word and you know I wasn't injecting sex act into the debate in any way, shape or form.\n \n \n Btw, you are holding gay people to a different standard than you hold heterosexuals. You believe that God gives heterosexuals the option to marry the person they love and thus to express the love they feel for a spouse, and you do not label that expression of love a \"sin.\" You insist that God does not give gay people the option to marry the person we love. That's a different standard. \n\n \n The key phrase is \"GOD GIVES HETEROSEXUALS THE OPTION TO MARRY\", Not ME. You are again personalizing this as if it is my will or my design that determines this doctrine. You are fighting God Himself Op. He created Male and female to procreate and become one flesh. I'm sorry that this concept offends you but that is the nature of Gods design for Human Creation. \n \n I even agree with you that on the surface it seems unfair. But God wont put anything on us that He doesn't allow an escape from so as I said earlier which you just completely ignore, is that spiritual deliverance is available for those who first seek Gods truth, then believe Him, then receive the healing that can only come through Him. This is the way past this issue. Not to plow through it stubbornly as you rebel against God, but by receiving His gift of healing as you trust Him to remake you in His image. Here is what He promises us Op, and it is much deeper and more fulfilling than serving the flesh of fallen man.\n 2Cr 5:17 Therefore if anyone is in Christ, {he is} a new creature; the old things passed away; behold, new things have come. \nYou may claim that it's God's standard, but really it's just your beliefs, which you read into the Bible and attribute to God. Attributing your personal prejudices and beliefs to God may make you feel like you are morally correct, but that doesn't make your beliefs either true or moral. In my view, your beliefs about gay people are wrong and immoral.\n\n \n I have no personal prejudices at all Op, I wish what is written wasn't the way it is. I get no joy from knowing the pain this truth causes the homosexual. But I went through the same struggle with SELF as I had to decide if I would sacrifice my own will in favor of trusting a perfect and Holy God with my life. That is what a personal relationship with the living God is about, and every single believer has made that commitment to Him.\n \n \nYou have also said that you don't judge people based on their sexual orientation, but in your post to Matthew, you insisted that being gay is a result of \"the fall.\" And that is judging people based on their sexual orientation, not on what they do.\n\n \n Being homosexual, being a murderer, being a rapist, being someone who thinks hateful thoughts about others, being jealous, being envious, being a liar are all results of the fall of man. So why do you take it so personally when I point it out regarding homosexuals in a debate about that subject. Every conceivable sin ever thought of or committed by Man is a result of the fall of Man Op, so I guess I'm guilty of judging all of humanity, huh? Or am I just stating a spiritual fact. Please get real, will you? What I marvel at is that you boast about being a member of a church and yet you have no spiritual depth what so ever. Now is that another judgement by me? Or more likely an informed observation based on the spiritual insight you have shown in this debate, or should I say the lack of insight you have shown. You are intent on cornering me and punching holes in the gospel rather than accepting the truth which it offers.", 
   {}, 
   320129, 
   null, 
   1218611280.0
  ], 
  [
   320136, 
   null, 
   "Matthew S", 
   "We will continue to disagree here Matt. God didn't create you gay at all. He created you in His image and He isn't a homosexual. Homosexuality is the result of our fallen natures just as every other sin that corrupts humanity is the result of the fall.\n\n \n That is just your opinion. How do you know that God is not both male and female? That when Lilith ran off and refused to submit to Adam that God then removed the female part of Adam to create Eve. That when a gay baby is born God restores the original creation? Yes God created me gay just as He created my blue eyes and blond hair. How do you know that God is not gay? Jesus had a gay lover, in john, and a female lover in mary. Also if as you say, homosexuality is a result of our fallen nature, then so is the dark skin and brown eyes that people posses after all if an innate aspect of a person is sinful.", 
   {}, 
   320107, 
   null, 
   1218631680.0
  ], 
  [
   320137, 
   null, 
   "Matthew S", 
   "This discussion is important, I think, because it raises the question of what the opponents of \"homosexuality\" are actually objecting to. It's not always clear. Are they objecting to a person having a gay or bisexual orientation? Are they objecting to a person having sex with someone of the same sex? Are they objecting to someone marrying someone of the same sex? What is it they object to? We need to ask our opponents to clarify what they object to when they speak against what they call \"homosexuality.\"\n\n \n All of the above. Haven't you realized they do not want us to exist.", 
   {}, 
   320110, 
   null, 
   1218631920.0
  ], 
  [
   320139, 
   null, 
   "Matthew S", 
   "Well then if innate characteristics of a person are sinnful then anyone who has a darker skin color then Adam and Eve, as shown here in this picture, better repent, or you are going to heel for having dark skin.\n \n http://thesituationist.files.wordpress.com/2007/08/adam-eve-snake.jpg\n \n The pictures in my bible clearly show white people. So God, I guess, created all people white in the begining and the races were a result of the fall and sinfull nature. After all the pictures are in the bible and the bible is the inerrant word of God.", 
   {}, 
   320137, 
   null, 
   1218632460.0
  ], 
  [
   320140, 
   null, 
   "Ohioprof", 
   "By its very definition, the word homosexual implies sex acts Op, so just because I used the word in explaining the types of future debates we would have that would place me and Echo on opposing sides, by your standard is bringing up sex. Forget the context I was using the term in, right? Cmon will you? You are way too smart for these cheap theatrics. You know the context in which I used the word and you know I wasn't injecting sex act into the debate in any way, shape or form. \n \n\n \n Of course you injected sex into the thread. You are the one who used the term \"homosexual\" and now tell us that the term \"implies sex acts.\" You are the one who used the term \"sinful act.\" By that you clearly meant sex, as you told us earlier that the sin is not in being gay; the sin is in having sex with someone of the same sex. YOU turned the discussion away from sexual orientation to sex acts. Echo started the thread by calling on people not to judge others by their sexual orientation. Sexual orientation does not mean sex acts, nor does it imply sex acts. You continue to confound sex acts with sexual orientation, despite your statement earlier that you are non-judgmental on the basis of sexual orientation. And you continue to equate being a gay person with sin, even though being a gay person is an identity, not a \"sinful act.\" If I am born gay, how is that a product of \"the fall?\" If I as a gay person never have sex with anyone, how is my being gay a product of \"the fall?\" How have I sinned, in your view? You appear to be confused on this question and you confound sex acts with sexual orientation. You introduced sex acts into the thread apparently because you are confused about the distinction between sexual orientation and sex acts. \n \n If you say you are heterosexual, that to me does not \"imply\" that you engage in sex acts. It tells me your orientation. It says nothing at all about your behavior. The same is true if I tell you that I am gay or bisexual. I am telling you my orientation only. The thread started as a thread about judging people on the basis of their orientation, not as a thread about sex acts, which you brought up.", 
   {}, 
   320135, 
   null, 
   1218634500.0
  ], 
  [
   320142, 
   null, 
   "Ohioprof", 
   "The key phrase is \"GOD GIVES HETEROSEXUALS THE OPTION TO MARRY\", Not ME. You are again personalizing this as if it is my will or my design that determines this doctrine. You are fighting God Himself Op. He created Male and female to procreate and become one flesh. I'm sorry that this concept offends you but that is the nature of Gods design for Human Creation. \n\n \n What I wrote is that YOU BELIEVE that God gives heterosexuals the option to marry but does not give gay people that option. It's just your belief. You insist that what you believe, the way you interpret the Bible, is what God thinks. But it's just your belief about what God thinks. Many Bible scholars and Christians do not agree with your belief about what the Bible says or means or about what God thinks. Indeed, the terms \"homosexual\" and \"homosexuality\" were never in the Bible, as these terms did not exist when the various books of the Bible were written. There has been much debate over the meaning of the passages that some argue refer to \"homosexuality.\" Just as in another thread we have debated the meaning of the constitution, what its writers and framers intended, scholars have debated the meaning of the various books of the Bible, what its writers intended. There is not agreement among scholars about the meaning of the few passages that some argue condemn \"homosexuality.\" \n \n It may seem easy or comforting to you to insist that your beliefs and your prejudices are the will of God. Imagining this may make you feel like you have captured \"truth\" and are assured of salvation. But you can't expect other people to buy into these beliefs of yours just because you claim they are the will of God. Ultimately, the arguments people have with you here come down to people's disagreement with your particular religious beliefs. I am a person of faith, and I reject your beliefs about gay people and about sexual orientation and about sin. They are not my beliefs. Ultimately, we simply must agree to disagree about religious beliefs. \n \n I do urge you to think through and become clear about the difference between sexual orientation and sex acts, so you don't confound them. Also, you should not assume that God intended every person to be heterosexual or to marry someone of the other sex and to procreate. Jesus never married, nor did he procreate. To argue that everyone must be the same because this is \"God's design\" is faulty thinking. God made us diverse, not all the same.", 
   {}, 
   320135, 
   null, 
   1218636120.0
  ], 
  [
   320153, 
   null, 
   "MrWriteLA", 
   "This discussion is important, I think, because it raises the question of what the opponents of \"homosexuality\" are actually objecting to. It's not always clear. Are they objecting to a person having a gay or bisexual orientation? Are they objecting to a person having sex with someone of the same sex? Are they objecting to someone marrying someone of the same sex? What is it they object to? We need to ask our opponents to clarify what they object to when they speak against what they call \"homosexuality.\"\nArchie isn't the first (and I'm sure won't be the last) poster to reduce the definition of \"homosexuality\" to the aspect that grosses him out and dismiss the part about attraction - the primary meaning of the word, the meaning its originators had in mind and that the APAs, AMA, etc. and gay people themselves have when they use the word. Check out the posts in this thread from three years ago, starting at post 50 (it's on screen 4) to see a particularly persistent example:http://www.4forums.com/political/showthread.php?t=5470\n \n The more things change, the more they stay the same, I guess...", 
   {}, 
   320110, 
   null, 
   1218644340.0
  ], 
  [
   320154, 
   null, 
   "Archangel", 
   "That is just your opinion. How do you know that God is not both male and female? That when Lilith ran off and refused to submit to Adam that God then removed the female part of Adam to create Eve. That when a gay baby is born God restores the original creation? Yes God created me gay just as He created my blue eyes and blond hair. How do you know that God is not gay? Jesus had a gay lover, in john, and a female lover in mary. Also if as you say, homosexuality is a result of our fallen nature, then so is the dark skin and brown eyes that people posses after all if an innate aspect of a person is sinful.\n\n \n \nAll of the above. Haven't you realized they do not want us to exist.\n\n \n \nWell then if innate characteristics of a person are sinnful then anyone who has a darker skin color then Adam and Eve, as shown here in this picture, better repent, or you are going to heel for having dark skin.\n \n http://thesituationist.files.wordpress.com/2007/08/adam-eve-snake.jpg\n \n The pictures in my bible clearly show white people. So God, I guess, created all people white in the begining and the races were a result of the fall and sinfull nature. After all the pictures are in the bible and the bible is the inerrant word of God.\n\n \n You're a sick puppy Matthew, and you prove it with every post you write. emoticon_wow", 
   {}, 
   320153, 
   null, 
   1218645420.0
  ], 
  [
   320156, 
   null, 
   "Archangel", 
   "What I wrote is that YOU BELIEVE that God gives heterosexuals the option to marry but does not give gay people that option. It's just your belief. You insist that what you believe, the way you interpret the Bible, is what God thinks. But it's just your belief about what God thinks. Many Bible scholars and Christians do not agree with your belief about what the Bible says or means or about what God thinks. Indeed, the terms \"homosexual\" and \"homosexuality\" were never in the Bible, as these terms did not exist when the various books of the Bible were written. There has been much debate over the meaning of the passages that some argue refer to \"homosexuality.\" Just as in another thread we have debated the meaning of the constitution, what its writers and framers intended, scholars have debated the meaning of the various books of the Bible, what its writers intended. There is not agreement among scholars about the meaning of the few passages that some argue condemn \"homosexuality.\" \n \n It may seem easy or comforting to you to insist that your beliefs and your prejudices are the will of God. Imagining this may make you feel like you have captured \"truth\" and are assured of salvation. But you can't expect other people to buy into these beliefs of yours just because you claim they are the will of God. Ultimately, the arguments people have with you here come down to people's disagreement with your particular religious beliefs. I am a person of faith, and I reject your beliefs about gay people and about sexual orientation and about sin. They are not my beliefs. Ultimately, we simply must agree to disagree about religious beliefs. \n \n I do urge you to think through and become clear about the difference between sexual orientation and sex acts, so you don't confound them. Also, you should not assume that God intended every person to be heterosexual or to marry someone of the other sex and to procreate. Jesus never married, nor did he procreate. To argue that everyone must be the same because this is \"God's design\" is faulty thinking. God made us diverse, not all the same.\n\n \n Pro-Gay Theology: 'Jesus Said Nothing About Homosexuality'\n If the notions of truth and doctrine are becoming unimportant to Christians, can the idea of sin survive?\n \n by Joe Dallas\n To the biblically ignorant, general pro-gay religious arguments can pass for truth. In the light of Scripture, however, they do not hold up under scrutiny.\n \n A recent poll showed 66 percent (two-thirds) of Americans no longer believe there is such a thing as \"absolute truth.\" More disturbing, though, was the fact that 53 percent of those not believing in absolute truth identified themselves as born-again Christians; 75 percent of whom were mainline Protestants.1 If \"absolute truth\" no longer exists, even in the minds of half the \"born-again\" population, it logically follows that doctrine, and the Bible itself, is given less credence. Pollster George Gallup Jr. noticed this in The People's Religion: American Faith in the 90s. \"While religion is highly popular in America,\" he states, \"it is to a large extent superficial. There is a knowledge gap between American's stated faith and the lack of the most basic knowledge about that faith.\"2\n \n In short, self-identified Christians in the twenty-first century are Biblically ignorant. Doctrine has become less important than good feelings; indeed, a USA Today survey found that, of the 56 percent of Americans who attend church, 45% did so because \"it's good for you,\" 26 percent went for peace of mind. Specific doctrines, the pollster noted, seemed unimportant.3\n \n If the notions of \"truth\" and \"doctrine\" are becoming unimportant to Christians, can the idea of \"sin\" hope to survive? Probably not; 25 percent of Christians polled in 1993 believed sin to be \"an outdated concept.\"4 \"The awareness of sin used to be our shadow,\" Cornelius Plantinga writes in Christianity Today. \"Christians hated sin, feared it, flew from it. But now the shadow has faded. Nowadays, the accusation you have sinned is often said with a grin.\"5\n \n But the gospel truth is never so accommodating. John the Baptist was ferocious with the Pharisees (see Matthew 3:7-8), Jesus trounced Peter when he tried to interfere with His mission (see Matthew 16:22-23) and Paul was willing to publicly rebuke hypocrisy -- even when committed by a respected disciple (see Galatians 2:11-14). To be sure, there is a place for gentleness. But never at the expense of truth.\n \n Yet, today the gap between truth and modern practice has been large enough to allow any number of false (albeit \"nice\") ideas to enter the church, creating a mentality that says, \"Let's all get along without conflict, shall we?\" Author J. Stephen Lang attempts to explain this phenomenon: \"Love is understandable -- warm and fuzzy. Doctrine, on the other hand, sounds cold, difficult and demanding.\"6\n \n A desire for \"warm and fuzzy\" without a commitment to truth makes the general religious arguments of the pro-gay theology all the more palatable. Unlike pro-gay social justice arguments, these general \"religious\" arguments appeal to the themes of harmony and goodwill and bypass issues of mankind's fallen nature, sin and obedience. To the biblically ignorant they can pass for truth; in the light of Scripture, though, they have no leg on which to stand.\n \n Since they are more religious in tone than social arguments, these debates can be answered almost exclusively in biblical terms. Remembering that members of the gay Christian movement say they believe in biblical authority, these arguments are best answered with a call to return to the objective truth of the Bible in lieu of the subjective winds of human experience and understanding.\n \n Religious argument #1: \"Jesus Said Nothing About Homosexuality.\"\n \n This argument is a favorite at gay parades. Invariably, when the \"gay Christian\" movement is represented, someone in their group will hold up a sign saying, \"WHAT JESUS SAID ABOUT HOMOSEXUALITY: ________________.\" The idea, of course, is that if Jesus did not specifically forbid a behavior, then the behavior must not have been important to Him. Stretching the point further, this argument assumes if Jesus was not manifestly concerned about something, neither should we.\n \n Troy Perry (along with most gay Christian leaders) makes much of this argument based on silence: \"As for the question, 'What did Jesus say about homosexuality?', the answer is simple. Jesus said nothing. Not one thing. Nothing! Jesus was more interested in love.\"7\n \n So, according to the argument of silence, if Jesus did not talk about it, neither should we.\n \n Response: The argument is misleading and illogical for four reasons:\n \n First, the argument assumes the gospels are more authoritative than the rest of the books in the Bible. The idea of a subject being unimportant just because it was not mentioned by Jesus is foreign to the gospel writers themselves. At no point did Matthew, Mark, Luke or John say their books should be elevated above the Torah or, for that matter, any writings yet to come. In other words, the gospels -- and the teachings they contain -- are not more important than the rest of the Bible. All Scripture is given by inspiration of God. The same Spirit inspiring the authors of the gospels also inspired the men who wrote the rest of the Bible.\n \n Second, the argument assumes the gospels are more comprehensive than they really are. Not only are the gospels no more authoritative than the rest of Scripture, they are not comprehensive either. That is, they do not provide all we need to know by way of doctrine and practical instruction. Some of the Bible's most important teachings, in fact, do not appear in the gospels. The doctrine of man's old and new nature (outlined by Paul in Romans 6); the future of Israel and the mystery of the Gentiles (hinted at by Christ but explained more fully in Romans 9-11); the explanation and management of the spiritual gifts (detailed in 1 Corinthians 12 and 14); the Priesthood of Christ (illustrated in Hebrews) -- all of these appear after the accounts of Christ's life, death and resurrection. (And we have not even mentioned the entire Old Testament.) Would anyone say none of these doctrines are important because they were not mentioned by Jesus?\n \n Or, put another way, are we really to believe that Jesus did not care about wife beating or incest, just because He said nothing about them? Are not the prohibitions against incest in Leviticus and 1 Corinthians, as well as Paul's admonition to husbands to love their wives, enough to instruct us in these matters without being mentioned in the gospels? There are any number of evil behaviors that Christ did not mention by name; surely we don't condone them for that reason alone! Likewise, Jesus' silence on homosexuality in no way negates the very specific prohibitions against it which appear elsewhere, in both Old and New Testaments.\n \n Third, this argument is inaccurate in that it presumes to know all of what Jesus said. The gospels do not profess to be a complete account of Jesus' life or teachings. Whole sections of His early years are omitted; much of what He did and said remains unknown. Luke wrote his gospel so Theophilus would \"know the certainty of those things wherein he had been instructed\" (Luke 1:4). John's motives are broader: \"These are written that ye might believe that Jesus is the Christ, and that believing, ye might have life through His name\" (John 20:31). But none of these authors suggested they were recording all of Christ's words. John, in fact, said that this would have been an impossibility: \"Jesus did many other things as well. If every one of them were written down, I suppose that even the whole world would not have room for the books that would be written\" (John 21:25).\n \n If that is the case, how can we be certain He said nothing about homosexuality? No one can say. But we know there are other equally important subjects left undiscussed in the gospels, but mentioned in detail in other books of the Bible. Homosexuality, while absent from Matthew, Mark, Luke or John, is conspicuously present in both testaments and, just as conspicuously, it is forbidden.\n \n Jesus referred in the most specific of terms to God's created intent for human sexuality: \"But at the beginning of creation God 'made them male and female. ...'\"\n \n Fourth, this argument assumes, because Jesus said nothing specific about homosexuality, that He said nothing about heterosexuality as a standard. Jesus referred in the most specific of terms to God's created intent for human sexuality: \"But at the beginning of creation God 'made them male and female. For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh.' So they are no longer two, but one. Therefore what God has joined together, let man not separate\" (Mark 10:6-9).\n \n In this passage, Jesus was presented with a hypothetical question: Is divorce lawful? Instead of giving a simple yes or no, He referred to Genesis and, more specifically, to created intent as the standard by which to judge sexual matters. By repeating the Genesis account, He emphasizes four elements of the created intent for marriage and sexual relations: independence was one -- a man was to leave his own home to establish his own family with his wife; a \"one flesh\" sexual union was another; and, of course, monogamy. But the first element of created intent Jesus stressed was the complimentary factor: it was to be a union of male and female, man and wife.\n \n In sum, homosexuality may not have been mentioned by Jesus -- many other sexual variations were not, either. But He could not have spelled out the standard for sexual expression more clearly: male to female, joined as God intended them to be. He cannot be assumed to have approved of anything less.\n \n Joe Dallas, founder of Genesis Counseling, is the author of four books on homosexuality.http://www.family.org/socialissues/A000000782.cfm", 
   {
    "unicode_changes_made": true
   }, 
   320142, 
   null, 
   1218646740.0
  ], 
  [
   320160, 
   null, 
   "Ohioprof", 
   "Pro-Gay Theology: 'Jesus Said Nothing About Homosexuality'\n If the notions of truth and doctrine are becoming unimportant to Christians, can the idea of sin survive?\n \n by Joe Dallas\n To the biblically ignorant, general pro-gay religious arguments can pass for truth. In the light of Scripture, however, they do not hold up under scrutiny.\n \n A recent poll showed 66 percent (two-thirds) of Americans no longer believe there is such a thing as \"absolute truth.\" More disturbing, though, was the fact that 53 percent of those not believing in absolute truth identified themselves as born-again Christians; 75 percent of whom were mainline Protestants.1 If \"absolute truth\" no longer exists, even in the minds of half the \"born-again\" population, it logically follows that doctrine, and the Bible itself, is given less credence. Pollster George Gallup Jr. noticed this in The People's Religion: American Faith in the 90s. \"While religion is highly popular in America,\" he states, \"it is to a large extent superficial. There is a knowledge gap between American's stated faith and the lack of the most basic knowledge about that faith.\"2\n \n In short, self-identified Christians in the twenty-first century are Biblically ignorant. Doctrine has become less important than good feelings; indeed, a USA Today survey found that, of the 56 percent of Americans who attend church, 45% did so because \"it's good for you,\" 26 percent went for peace of mind. Specific doctrines, the pollster noted, seemed unimportant.3\n \n If the notions of \"truth\" and \"doctrine\" are becoming unimportant to Christians, can the idea of \"sin\" hope to survive? Probably not; 25 percent of Christians polled in 1993 believed sin to be \"an outdated concept.\"4 \"The awareness of sin used to be our shadow,\" Cornelius Plantinga writes in Christianity Today. \"Christians hated sin, feared it, flew from it. But now the shadow has faded. Nowadays, the accusation you have sinned is often said with a grin.\"5\n \n But the gospel truth is never so accommodating. John the Baptist was ferocious with the Pharisees (see Matthew 3:7-8), Jesus trounced Peter when he tried to interfere with His mission (see Matthew 16:22-23) and Paul was willing to publicly rebuke hypocrisy -- even when committed by a respected disciple (see Galatians 2:11-14). To be sure, there is a place for gentleness. But never at the expense of truth.\n \n Yet, today the gap between truth and modern practice has been large enough to allow any number of false (albeit \"nice\") ideas to enter the church, creating a mentality that says, \"Let's all get along without conflict, shall we?\" Author J. Stephen Lang attempts to explain this phenomenon: \"Love is understandable -- warm and fuzzy. Doctrine, on the other hand, sounds cold, difficult and demanding.\"6\n \n A desire for \"warm and fuzzy\" without a commitment to truth makes the general religious arguments of the pro-gay theology all the more palatable. Unlike pro-gay social justice arguments, these general \"religious\" arguments appeal to the themes of harmony and goodwill and bypass issues of mankind's fallen nature, sin and obedience. To the biblically ignorant they can pass for truth; in the light of Scripture, though, they have no leg on which to stand.\n \n Since they are more religious in tone than social arguments, these debates can be answered almost exclusively in biblical terms. Remembering that members of the gay Christian movement say they believe in biblical authority, these arguments are best answered with a call to return to the objective truth of the Bible in lieu of the subjective winds of human experience and understanding.\n \n Religious argument #1: \"Jesus Said Nothing About Homosexuality.\"\n \n This argument is a favorite at gay parades. Invariably, when the \"gay Christian\" movement is represented, someone in their group will hold up a sign saying, \"WHAT JESUS SAID ABOUT HOMOSEXUALITY: ________________.\" The idea, of course, is that if Jesus did not specifically forbid a behavior, then the behavior must not have been important to Him. Stretching the point further, this argument assumes if Jesus was not manifestly concerned about something, neither should we.\n \n Troy Perry (along with most gay Christian leaders) makes much of this argument based on silence: \"As for the question, 'What did Jesus say about homosexuality?', the answer is simple. Jesus said nothing. Not one thing. Nothing! Jesus was more interested in love.\"7\n \n So, according to the argument of silence, if Jesus did not talk about it, neither should we.\n \n Response: The argument is misleading and illogical for four reasons:\n \n First, the argument assumes the gospels are more authoritative than the rest of the books in the Bible. The idea of a subject being unimportant just because it was not mentioned by Jesus is foreign to the gospel writers themselves. At no point did Matthew, Mark, Luke or John say their books should be elevated above the Torah or, for that matter, any writings yet to come. In other words, the gospels -- and the teachings they contain -- are not more important than the rest of the Bible. All Scripture is given by inspiration of God. The same Spirit inspiring the authors of the gospels also inspired the men who wrote the rest of the Bible.\n \n Second, the argument assumes the gospels are more comprehensive than they really are. Not only are the gospels no more authoritative than the rest of Scripture, they are not comprehensive either. That is, they do not provide all we need to know by way of doctrine and practical instruction. Some of the Bible's most important teachings, in fact, do not appear in the gospels. The doctrine of man's old and new nature (outlined by Paul in Romans 6); the future of Israel and the mystery of the Gentiles (hinted at by Christ but explained more fully in Romans 9-11); the explanation and management of the spiritual gifts (detailed in 1 Corinthians 12 and 14); the Priesthood of Christ (illustrated in Hebrews) -- all of these appear after the accounts of Christ's life, death and resurrection. (And we have not even mentioned the entire Old Testament.) Would anyone say none of these doctrines are important because they were not mentioned by Jesus?\n \n Or, put another way, are we really to believe that Jesus did not care about wife beating or incest, just because He said nothing about them? Are not the prohibitions against incest in Leviticus and 1 Corinthians, as well as Paul's admonition to husbands to love their wives, enough to instruct us in these matters without being mentioned in the gospels? There are any number of evil behaviors that Christ did not mention by name; surely we don't condone them for that reason alone! Likewise, Jesus' silence on homosexuality in no way negates the very specific prohibitions against it which appear elsewhere, in both Old and New Testaments.\n \n Third, this argument is inaccurate in that it presumes to know all of what Jesus said. The gospels do not profess to be a complete account of Jesus' life or teachings. Whole sections of His early years are omitted; much of what He did and said remains unknown. Luke wrote his gospel so Theophilus would \"know the certainty of those things wherein he had been instructed\" (Luke 1:4). John's motives are broader: \"These are written that ye might believe that Jesus is the Christ, and that believing, ye might have life through His name\" (John 20:31). But none of these authors suggested they were recording all of Christ's words. John, in fact, said that this would have been an impossibility: \"Jesus did many other things as well. If every one of them were written down, I suppose that even the whole world would not have room for the books that would be written\" (John 21:25).\n \n If that is the case, how can we be certain He said nothing about homosexuality? No one can say. But we know there are other equally important subjects left undiscussed in the gospels, but mentioned in detail in other books of the Bible. Homosexuality, while absent from Matthew, Mark, Luke or John, is conspicuously present in both testaments and, just as conspicuously, it is forbidden.\n \n Jesus referred in the most specific of terms to God's created intent for human sexuality: \"But at the beginning of creation God 'made them male and female. ...'\"\n \n Fourth, this argument assumes, because Jesus said nothing specific about homosexuality, that He said nothing about heterosexuality as a standard. Jesus referred in the most specific of terms to God's created intent for human sexuality: \"But at the beginning of creation God 'made them male and female. For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh.' So they are no longer two, but one. Therefore what God has joined together, let man not separate\" (Mark 10:6-9).\n \n In this passage, Jesus was presented with a hypothetical question: Is divorce lawful? Instead of giving a simple yes or no, He referred to Genesis and, more specifically, to created intent as the standard by which to judge sexual matters. By repeating the Genesis account, He emphasizes four elements of the created intent for marriage and sexual relations: independence was one -- a man was to leave his own home to establish his own family with his wife; a \"one flesh\" sexual union was another; and, of course, monogamy. But the first element of created intent Jesus stressed was the complimentary factor: it was to be a union of male and female, man and wife.\n \n In sum, homosexuality may not have been mentioned by Jesus -- many other sexual variations were not, either. But He could not have spelled out the standard for sexual expression more clearly: male to female, joined as God intended them to be. He cannot be assumed to have approved of anything less.\n \n Joe Dallas, founder of Genesis Counseling, is the author of four books on homosexuality.\n http://www.family.org/socialissues/A000000782.cfm\n\n \n So now, instead of addressing my points, you present religious arguments from an anti-gay right-wing religious extremist. That's pretty lazy of you. In no way is anything this guy writes either credible or worth addressing. I have been addressing YOUR points. To respond with a long quotation from a right-wing religious website is simply avoiding thinking and answering for yourself. I have no interest in reading or responding to nonsense from extremist, anti-gay websites. If you want to have a discussion with me, you need to write your own posts. Otherwise I will ignore you.", 
   {
    "unicode_changes_made": true
   }, 
   320156, 
   null, 
   1218647340.0
  ], 
  [
   320161, 
   null, 
   "lesz", 
   "Obviously, some religious zealots are obsessed by sex, especially gay sex. Reminds me of Ted Haggard and the rest of the fundie gang.", 
   {}, 
   320156, 
   null, 
   1218647340.0
  ], 
  [
   320162, 
   null, 
   "Archangel", 
   "Pro-Gay Theology: Scriptural and Cultural Arguments\n The pro-gay theology is much like the broader gay rights philosophy, in that it seeks legitimization -- not just tolerance -- of homosexuality.\n \n by Joe Dallas\n Major denominations ordaining homosexuals, priests and clergy presiding over same-sex weddings, sanctuaries invaded by boisterous gay activists, debates over homosexuality ripping congregations apart: Who would have guessed we&#8217;d ever reach such a point in church history?\n \n Responding to these general pro-gay arguments\n \n These arguments (in section 1) do not sit well with most serious Christians. The Scriptures mentioned earlier are so clear and specific they defy interpretation of any sort. &#8220;Thou shalt not lie with a man as with a woman&#8221; requires no more interpretation than &#8220;Thou shalt not kill.&#8221; It is intellectually dishonest to say conservatives &#8220;interpret&#8221; such verses out of prejudice against homosexuals. Those same &#8220;prejudiced&#8221; conservatives (Falwell, Kennedy, Robertson et. al.) also take Scriptures against heterosexual sins quite literally. If they only prohibit homosexuality out of their own prejudice, why on earth do they, as heterosexuals, also condemn heterosexual sins? The argument makes no sense.\n \n Neither does the &#8220;mistranslation&#8221; argument. We can allow some discrepancy in minor areas of translation, but, on something as important as sexual ethics, are we really to believe the Bible translators we rely on got it wrong five different times, in two different testaments? And only on the Scriptures regarding homosexuality? (Pro-gay apologists seem to have no problem with the other Scriptures condemning sins like adultery and child abuse.)\n \n Equally poor is the &#8220;out-of-context&#8221; argument. The fact is, in Leviticus, Romans, 1 Corinthians and 1 Timothy, homosexuality is mentioned in the context of sexual and immoral behavior! The context is quite clear -- a variety of behaviors are prohibited; homosexuality -- along with adultery, fornication and idolatry -- is one of them.\n \n The &#8220;cultural&#8221; argument fares no better. In some cases, a Scripture may seem culturally bound (injunctions against long hair on men, or women speaking to their husbands during church.) But again&#8212;five times? Five different Scriptures, from both testaments, addressed to highly different cultures (from the Hebrew to the Roman) are obviously not culturally bound. The cultures they address are just too different.\n \n All of which leave conservatives highly skeptical of the &#8220;gay Christian&#8221; movement's claim to respect Biblical authority. It takes mental gymnastics to accept these inadequate arguments; those not having a stake in accepting them are unlikely to do so. But those having a personal interest in the pro-gay theology are another matter. Twist the Scriptures hard enough and you can make them appear to say anything you please. Author Paul Morris raises this very issue when he warns: &#8220;But if I were a Christian homosexual, I think this one question would disturb me most: Am I trying to interpret Scripture in the light of my proclivity; or should I interpret my proclivity in the light of Scripture?&#8221;1\n \n &#8220;But if I were a Christian homosexual, I think this one question would disturb me most: Am I trying to interpret Scripture in the light of my proclivity; or should I interpret my proclivity in the light of Scripture?\"\n \n An unfortunate pattern of doing the former can be seen in the &#8220;gay Christian&#8221; movement's testimonials. Rev. Troy Perry writes about having already decided homosexuality was acceptable, then searching the Bible to equip himself to answer conservatives.2 Mel White alludes, in his book, to some earlier studies of the destruction of Sodom;3 however, his turning point seems to have come not from a careful, prayerful study of Scripture, but from a psychologist who encouraged him to accept his homosexuality and find a lover!4 And gospel musician Marsha Stevens (composer of the beloved song &#8220;For Those Tears I Died&#8221; and now openly lesbian) gives a lengthy account of her acceptance of homosexuality without once explaining how she reached the point of believing homosexuality was Scripturally acceptable. (The closest she comes is in telling how she prayed one night for confirmation that lesbianism was OK; the next morning someone gave her a pin saying &#8220;Born Again Lesbian.&#8221;)5 Considering the background and theological training of the above-mentioned believers in pro-gay theology, their acceptance of it is astounding.\n \n Or maybe it is not. Paul predicts an abandonment of truth for the sake of personal fulfillment: &#8220;For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear. They will turn their ears away from the truth and turn aside to myths&#8221; (2 Timothy 4:3-4).\n \n Self over truth; man over God: Can a Christian be so deceived? Evidently. Paul referred to the Galatian church as having been &#8220;bewitched&#8221; (Galatians 3:1), and Jesus warned that a prominent sign of the days before His coming would be an increase in deception (Matthew 24:14).\n \n To confront the pro-gay theology, then, is to confront a deceptive element of our time -- the tendency to subjugate objective truth to subjective experience.\n \n To confront the pro-gay theology, then, is to confront a deceptive element of our time -- the tendency to subjugate objective truth to subjective experience.\n \n That is one reason confrontation is not enough to change a heart. Being knowledgeable enough to dismantle all the &#8220;gay Christian&#8221; movement's claims will not be enough to persuade a homosexual to repent. The heart, having been hardened through deception or rebellion or both, has to be softened. And that is the work of God alone. Ours is to simply speak the truth, trusting Him to quicken it to our hearers.\n \n This article was used by permission from Exodus International, North America. Exodus is a nonprofit, interdenominational Christian organization promoting the message of &#8220;Freedom from homosexuality through the power of Jesus Christ.&#8221; Since 1976, Exodus has grown to include over 100 local ministries in the USA and Canada. They are also linked with other Exodus world regions outside of North America, totaling almost 150 ministries in 17 countries. Within both the Christian and secular communities, Exodus has challenged those who respond to homosexuals with ignorance and fear, and those who uphold homosexuality as a valid orientation. These extremes fail to convey the fullness of redemption found in Jesus Christ, a gift which is available to all who commit their life and their sexuality to Him.\n \n Joe Dallas is a former gay rights activist and staff member of a Metropolitan Community Church, and he has worked with hundreds of men and women struggling with homosexuality and related problems.http://www.family.org/socialissues/A000000781.cfm\n \n Here are testimonies of MANY men and women who have been delivered from homosexuality. There is a cure for homosexuality and His name is Jesus Christ. Not the figure head, but the person. http://exodus.to/stories", 
   {}, 
   320156, 
   null, 
   1218647700.0
  ], 
  [
   320164, 
   null, 
   "lesz", 
   "\"Ex-gay\"? Bunch of liars...", 
   {}, 
   320162, 
   null, 
   1218647820.0
  ], 
  [
   320167, 
   null, 
   "Archangel", 
   "So now, instead of addressing my points, you present religious arguments from an anti-gay right-wing religious extremist. That's pretty lazy of you. In no way is anything this guy writes either credible or worth addressing. I have been addressing YOUR points. To respond with a long quotation from a right-wing religious website is simply avoiding thinking and answering for yourself. I have no interest in reading or responding to nonsense from extremist, anti-gay websites. If you want to have a discussion with me, you need to write your own posts. Otherwise I will ignore you.\n\n \n No Op, you are repeating the same arguments no matter what I say, and you are implying that what I say is my own unfounded personal opinion which is motivated by prejudice. I posted these links to show that I'm not making this stuff up, nor am I alone in my views. And what you call religious extremists are people who interpret the bible honestly and without a predetermined agenda as you have, before you even open the book. \n \n You must insist that any christians who disagree with the rightness of homosexuality are personally prejudiced so you can reject the content of the bibles message where it directly effects your community. Strangely you never question or condemn the sins that the bible speaks of about heterosexuals. You aren't seeking the scriptural truth at all Op, but are simply seeking to justify what you know it condemns. That fact immediately makes any hope for an honest debate impossible as you refuse to honestly interpret the bible. From the link, I challenge you to deny the truth in this quoted statement from the second link I posted. \n Neither does the \"mistranslation\" argument. We can allow some discrepancy in minor areas of translation, but, on something as important as sexual ethics, are we really to believe the Bible translators we rely on got it wrong five different times, in two different testaments? And only on the Scriptures regarding homosexuality? (Pro-gay apologists seem to have no problem with the other Scriptures condemning sins like adultery and child abuse.)\n \n Equally poor is the \"out-of-context\" argument. The fact is, in Leviticus, Romans, 1 Corinthians and 1 Timothy, homosexuality is mentioned in the context of sexual and immoral behavior! The context is quite clear -- a variety of behaviors are prohibited; homosexuality -- along with adultery, fornication and idolatry -- is one of them.\n \n The \"cultural\" argument fares no better. In some cases, a Scripture may seem culturally bound (injunctions against long hair on men, or women speaking to their husbands during church.) But again-five times? Five different Scriptures, from both testaments, addressed to highly different cultures (from the Hebrew to the Roman) are obviously not culturally bound. The cultures they address are just too different.\n \n All of which leave conservatives highly skeptical of the \"gay Christian\" movement's claim to respect Biblical authority. It takes mental gymnastics to accept these inadequate arguments; those not having a stake in accepting them are unlikely to do so. But those having a personal interest in the pro-gay theology are another matter. Twist the Scriptures hard enough and you can make them appear to say anything you please. Author Paul Morris raises this very issue when he warns: \"But if I were a Christian homosexual, I think this one question would disturb me most: Am I trying to interpret Scripture in the light of my proclivity; or should I interpret my proclivity in the light of Scripture?\"1\n \n \"But if I were a Christian homosexual, I think this one question would disturb me most: Am I trying to interpret Scripture in the light of my proclivity; or should I interpret my proclivity in the light of Scripture?\"\n ", 
   {
    "unicode_changes_made": true
   }, 
   320160, 
   null, 
   1218649740.0
  ], 
  [
   320169, 
   null, 
   "Ohioprof", 
   "Pro-Gay Theology: Scriptural and Cultural Arguments\n The pro-gay theology is much like the broader gay rights philosophy, in that it seeks legitimization -- not just tolerance -- of homosexuality.\n \n by Joe Dallas\n Major denominations ordaining homosexuals, priests and clergy presiding over same-sex weddings, sanctuaries invaded by boisterous gay activists, debates over homosexuality ripping congregations apart: Who would have guessed we'd ever reach such a point in church history?\n \n Responding to these general pro-gay arguments\n \n These arguments (in section 1) do not sit well with most serious Christians. The Scriptures mentioned earlier are so clear and specific they defy interpretation of any sort. \"Thou shalt not lie with a man as with a woman\" requires no more interpretation than \"Thou shalt not kill.\" It is intellectually dishonest to say conservatives \"interpret\" such verses out of prejudice against homosexuals. Those same \"prejudiced\" conservatives (Falwell, Kennedy, Robertson et. al.) also take Scriptures against heterosexual sins quite literally. If they only prohibit homosexuality out of their own prejudice, why on earth do they, as heterosexuals, also condemn heterosexual sins? The argument makes no sense.\n \n Neither does the \"mistranslation\" argument. We can allow some discrepancy in minor areas of translation, but, on something as important as sexual ethics, are we really to believe the Bible translators we rely on got it wrong five different times, in two different testaments? And only on the Scriptures regarding homosexuality? (Pro-gay apologists seem to have no problem with the other Scriptures condemning sins like adultery and child abuse.)\n \n Equally poor is the \"out-of-context\" argument. The fact is, in Leviticus, Romans, 1 Corinthians and 1 Timothy, homosexuality is mentioned in the context of sexual and immoral behavior! The context is quite clear -- a variety of behaviors are prohibited; homosexuality -- along with adultery, fornication and idolatry -- is one of them.\n \n The \"cultural\" argument fares no better. In some cases, a Scripture may seem culturally bound (injunctions against long hair on men, or women speaking to their husbands during church.) But again-five times? Five different Scriptures, from both testaments, addressed to highly different cultures (from the Hebrew to the Roman) are obviously not culturally bound. The cultures they address are just too different.\n \n All of which leave conservatives highly skeptical of the \"gay Christian\" movement's claim to respect Biblical authority. It takes mental gymnastics to accept these inadequate arguments; those not having a stake in accepting them are unlikely to do so. But those having a personal interest in the pro-gay theology are another matter. Twist the Scriptures hard enough and you can make them appear to say anything you please. Author Paul Morris raises this very issue when he warns: \"But if I were a Christian homosexual, I think this one question would disturb me most: Am I trying to interpret Scripture in the light of my proclivity; or should I interpret my proclivity in the light of Scripture?\"1\n \n \"But if I were a Christian homosexual, I think this one question would disturb me most: Am I trying to interpret Scripture in the light of my proclivity; or should I interpret my proclivity in the light of Scripture?\"\n \n An unfortunate pattern of doing the former can be seen in the \"gay Christian\" movement's testimonials. Rev. Troy Perry writes about having already decided homosexuality was acceptable, then searching the Bible to equip himself to answer conservatives.2 Mel White alludes, in his book, to some earlier studies of the destruction of Sodom;3 however, his turning point seems to have come not from a careful, prayerful study of Scripture, but from a psychologist who encouraged him to accept his homosexuality and find a lover!4 And gospel musician Marsha Stevens (composer of the beloved song \"For Those Tears I Died\" and now openly lesbian) gives a lengthy account of her acceptance of homosexuality without once explaining how she reached the point of believing homosexuality was Scripturally acceptable. (The closest she comes is in telling how she prayed one night for confirmation that lesbianism was OK; the next morning someone gave her a pin saying \"Born Again Lesbian.\")5 Considering the background and theological training of the above-mentioned believers in pro-gay theology, their acceptance of it is astounding.\n \n Or maybe it is not. Paul predicts an abandonment of truth for the sake of personal fulfillment: \"For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear. They will turn their ears away from the truth and turn aside to myths\" (2 Timothy 4:3-4).\n \n Self over truth; man over God: Can a Christian be so deceived? Evidently. Paul referred to the Galatian church as having been \"bewitched\" (Galatians 3:1), and Jesus warned that a prominent sign of the days before His coming would be an increase in deception (Matthew 24:14).\n \n To confront the pro-gay theology, then, is to confront a deceptive element of our time -- the tendency to subjugate objective truth to subjective experience.\n \n To confront the pro-gay theology, then, is to confront a deceptive element of our time -- the tendency to subjugate objective truth to subjective experience.\n \n That is one reason confrontation is not enough to change a heart. Being knowledgeable enough to dismantle all the \"gay Christian\" movement's claims will not be enough to persuade a homosexual to repent. The heart, having been hardened through deception or rebellion or both, has to be softened. And that is the work of God alone. Ours is to simply speak the truth, trusting Him to quicken it to our hearers.\n \n This article was used by permission from Exodus International, North America. Exodus is a nonprofit, interdenominational Christian organization promoting the message of \"Freedom from homosexuality through the power of Jesus Christ.\" Since 1976, Exodus has grown to include over 100 local ministries in the USA and Canada. They are also linked with other Exodus world regions outside of North America, totaling almost 150 ministries in 17 countries. Within both the Christian and secular communities, Exodus has challenged those who respond to homosexuals with ignorance and fear, and those who uphold homosexuality as a valid orientation. These extremes fail to convey the fullness of redemption found in Jesus Christ, a gift which is available to all who commit their life and their sexuality to Him.\n \n Joe Dallas is a former gay rights activist and staff member of a Metropolitan Community Church, and he has worked with hundreds of men and women struggling with homosexuality and related problems.http://www.family.org/socialissues/A000000781.cfm\n \n Here are testimonies of MANY men and women who have been delivered from homosexuality. There is a cure for homosexuality and His name is Jesus \n \n Christ. Not the figure head, but the person. http://exodus.to/stories\n\n \n You seem now to want to have a battle of the websites instead of writing your own arguments. I'm not writing to Joe Blow Dallas. I've been writing to YOU. \n \n If you like reading testimonies from websites, you can read for yourself the testimonies of the founders of Exodus, who have apologized for misleading people into joining this \"ex-gay ministry.\" They now say they are still gay, and that Exodus (and Jesus) didn't change their sexual orientation or the sexual orientation of the people who joined the group they founded. Check out what they have to say. Here is the apology and the testimony from Michael Bussee, a founder and former leader of Exodus: http://www.beyondexgay.com/article/busseeapology", 
   {
    "unicode_changes_made": true
   }, 
   320162, 
   null, 
   1218649860.0
  ], 
  [
   320170, 
   null, 
   "Archangel", 
   "\"Ex-gay\"? Bunch of liars...\n\n \n Of course you would never consider posting any evidence for this accusation, would you? Just reject and condemn anyone who say's you're wrong and that there is a way out of the bondage that afflicts you. emoticon_confused", 
   {}, 
   320164, 
   null, 
   1218649980.0
  ], 
  [
   320171, 
   null, 
   "Ohioprof", 
   "No Op, you are repeating the same arguments no matter what I say, and you are implying that what I say is my own unfounded personal opinion which is motivated by prejudice. I posted these links to show that I'm not making this stuff up, nor am I alone in my views. And what you call religious extremists are people who interpret the bible honestly and without a predetermined agenda as you have, before you even open the book. \n \n You must insist that any christians who disagree with the rightness of homosexuality are personally prejudiced so you can reject the content of the bibles message where it directly effects your community. Strangely you never question or condemn the sins that the bible speaks of about heterosexuals. You aren't seeking the scriptural truth at all Op, but are simply seeking to justify what you know it condemns. That fact immediately makes any hope for an honest debate impossible as you refuse to honestly interpret the bible. From the link, I challenge you to deny the truth in this quoted statement from the second link I posted. \n Neither does the \"mistranslation\" argument. We can allow some discrepancy in minor areas of translation, but, on something as important as sexual ethics, are we really to believe the Bible translators we rely on got it wrong five different times, in two different testaments? And only on the Scriptures regarding homosexuality? (Pro-gay apologists seem to have no problem with the other Scriptures condemning sins like adultery and child abuse.)\n \n Equally poor is the \"out-of-context\" argument. The fact is, in Leviticus, Romans, 1 Corinthians and 1 Timothy, homosexuality is mentioned in the context of sexual and immoral behavior! The context is quite clear -- a variety of behaviors are prohibited; homosexuality -- along with adultery, fornication and idolatry -- is one of them.\n \n The \"cultural\" argument fares no better. In some cases, a Scripture may seem culturally bound (injunctions against long hair on men, or women speaking to their husbands during church.) But again-five times? Five different Scriptures, from both testaments, addressed to highly different cultures (from the Hebrew to the Roman) are obviously not culturally bound. The cultures they address are just too different.\n \n All of which leave conservatives highly skeptical of the \"gay Christian\" movement's claim to respect Biblical authority. It takes mental gymnastics to accept these inadequate arguments; those not having a stake in accepting them are unlikely to do so. But those having a personal interest in the pro-gay theology are another matter. Twist the Scriptures hard enough and you can make them appear to say anything you please. Author Paul Morris raises this very issue when he warns: \"But if I were a Christian homosexual, I think this one question would disturb me most: Am I trying to interpret Scripture in the light of my proclivity; or should I interpret my proclivity in the light of Scripture?\"1\n \n \"But if I were a Christian homosexual, I think this one question would disturb me most: Am I trying to interpret Scripture in the light of my proclivity; or should I interpret my proclivity in the light of Scripture?\"\n \n\n \n I do not argue with websites. You need to make your own arguments if you want me to answer you, not borrow other people's arguments off websites and present them as yours. Write and think for yourself if you want me to answer you. \n \n I will respond to what YOU have written here. I have never claimed that you are alone in your beliefs. Certainly there are plenty of Christians who interpret the Bible as you do. The fact that plenty of people believe something does not make what they believe true. There are also plenty of Christians who interpret the Bible differently from you. There are plenty of Christians who see your interpretation of the Bible as wrong. \n \n I personally do not care how you interpret the Bible, except to the extent that your religious beliefs may motivate you to push for laws that discriminate against gay people in the wider civil society. That has been happening with a variety of right-wing Christian groups, who have spent a lot of money and time spreading falsehoods about gay people and trying to prevent us from protecting our families through marriage. When Christians or people of any set of beliefs work to deny equal rights to others, then I work to oppose their efforts.", 
   {
    "unicode_changes_made": true
   }, 
   320167, 
   null, 
   1218650820.0
  ], 
  [
   320173, 
   null, 
   "Archangel", 
   "You seem now to want to have a battle of the websites instead of writing your own arguments. I'm not writing to Joe Blow Dallas. I've been writing to YOU. \n \n If you like reading testimonies from websites, you can read for yourself the testimonies of the founders of Exodus, who have apologized for misleading people into joining this \"ex-gay ministry.\" They now say they are still gay, and that Exodus (and Jesus) didn't change their sexual orientation or the sexual orientation of the people who joined the group they founded. Check out what they have to say. Here is the apology and the testimony from Michael Bussee, a founder and former leader of Exodus: http://www.beyondexgay.com/article/busseeapology\n\n \n Here's a link to 20 women and their testimonies of being freed from homosexuality: http://exodus.to/content/blogcategory/25/148/\n \n And a link to 40 men who share their stories of deliverance: http://exodus.to/content/blogcategory/20/149/\n \n Why should Bussee's story negate what all of these people have personally experienced?", 
   {}, 
   320169, 
   null, 
   1218651000.0
  ], 
  [
   320176, 
   null, 
   "Ohioprof", 
   "Of course you would never consider posting any evidence for this accusation, would you? Just reject and condemn anyone who say's you're wrong and that there is a way out of the bondage that afflicts you. emoticon_confused\n\n \n What \"bondage?\" You are making assumptions about other people. Unless someone regards him or herself as in \"bondage,\" it's presumptuous of you or anyone to tell them they are in \"bondage.\" \n \n I don't know, and I don't presume to judge, the experiences of people who claim to be \"ex-gays.\" I have known a number of people who tried to be \"ex-gay\" and who failed in that effort. Most tried to become \"ex-gay\" either through therapy or through religion or both. Embracing Jesus did not make them stop being gay. It just made them stop acting on their orientation for awhile, until they realized they were still gay. This was what happened to Michael Bussee, one of the founders of Exodus, if you read his story. If there are people who really want to stop being gay and who think they can do this somehow, I'm not going to interfere with them. That's their business, and it's not my concern. \n \n My own experience is that people who really are heterosexual don't need therapy or religion to be heterosexual. They simply are heterosexual. There is no effort involved. If someone has to try to become \"ex-gay,\" that's pretty good evidence that they really are gay. And trying to be other than they are is probably futile. But it's not for me to judge what someone else does with his or her life. I don't care what other people's sexual orientation is. People should be who they are and live in ways that make them happy.", 
   {}, 
   320170, 
   null, 
   1218651780.0
  ], 
  [
   320177, 
   null, 
   "Ohioprof", 
   "Here's a link to 20 women and their testimonies of being freed from homosexuality: http://exodus.to/content/blogcategory/25/148/\n \n And a link to 40 men who share their stories of deliverance: http://exodus.to/content/blogcategory/20/149/\n \n Why should Bussee's story negate what all of these people have personally experienced?\n\n \n Bussee's story is one of many stories by people who have experienced the failure of supposed \"ex-gay ministries.\" You can read their testimonies on this website: \n \n http://www.beyondexgay.com\n \n Bussee's story is of particular importance, as are the apologies of the other former leaders of Exodus, because Bussee created this \"ex-gay ministry.\" And he concluded that it doesn't work. The other Exodus leaders who apologized concluded the same thing. Note that Bussee said the ministry did deepen his Christian faith; it just didn't make him \"ex-gay.\" He is still gay, as are the other former leaders and founders of the organization who have since apologized for misleading people with claims that they could beome \"ex-gay.\"", 
   {}, 
   320173, 
   null, 
   1218652260.0
  ], 
  [
   320179, 
   null, 
   "Archangel", 
   "I do not argue with websites. You need to make your own arguments if you want me to answer you, not borrow other people's arguments off websites and present them as yours. Write and think for yourself if you want me to answer you. \n \n I will respond to what YOU have written here. I have never claimed that you are alone in your beliefs. Certainly there are plenty of Christians who interpret the Bible as you do. The fact that plenty of people believe something does not make what they believe true. There are also plenty of Christians who interpret the Bible differently from you. There are plenty of Christians who see your interpretation of the Bible as wrong. \n \n I personally do not care how you interpret the Bible, except to the extent that your religious beliefs may motivate you to push for laws that discriminate against gay people in the wider civil society. That has been happening with a variety of right-wing Christian groups, who have spent a lot of money and time spreading falsehoods about gay people and trying to prevent us from protecting our families through marriage. When Christians or people of any set of beliefs work to deny equal rights to others, then I work to oppose their efforts.\n\n \n What you don't argue with, are reasonable arguments and questions that you know you can't rationally answer Op, I have made these points in past posts and you just ignored them. You are in denial of the truth and are running away from undeniable evidence and questions that are irrefutable in there truth. What you must ask yourself is, Are you trying to interpret Scripture in the light of your sexual proclivity; or should you interpret your sexual proclivity in the light of Scripture?\" By every debate we have ever had, it is obvious to me that you are interpreting scripture in light of your sexual proclivity. So you're not seeking Gods truth Op, you're seeking to justify your rejection of His moral standards and principles. So what is there to discuss? Which of your lies is easiest for me to swallow as a believer? Forget about it, because God doesn't compromise His truths with us, and He doesn't allow us to do it either. \n \n Let this thread be an example of how these debates always degrade into struggles between the lie and the truth, Echo. And how even the best that the homosexual side offers, as Ohioprof is considered to be by the homosexuals, here, can't stand up to the truth and defeat it in open discussion, so they must reject it out of hand and ignore it.", 
   {}, 
   320171, 
   null, 
   1218652680.0
  ], 
  [
   320182, 
   null, 
   "Ohioprof", 
   "What you don't argue with, are reasonable arguments and questions that you know you can't rationally answer Op, I have made these points in past posts and you just ignored them.\n\n \n I had you on ignore for a long time because your posts struck me as mostly efforts to draw attention to yourself by provoking others and then claiming they were persecuting you after you provoked them. Your posts struck me as mostly efforts to get attention, not as serious efforts at dialogue. So I ignored them.", 
   {}, 
   320179, 
   null, 
   1218654780.0
  ], 
  [
   320184, 
   null, 
   "Ohioprof", 
   "What you must ask yourself is, Are you trying to interpret Scripture in the light of your sexual proclivity; or should you interpret your sexual proclivity in the light of Scripture?\" By every debate we have ever had, it is obvious to me that you are interpreting scripture in light of your sexual proclivity.\n\n \n 1. My \"sexual proclivity,\" whatever that means, is not and never has been a subject for discussion here. Nor is your \"sexual proclivity\" a subject for discussion. \n \n 2. I interpret scripture purely out of intellectual interest, to understand the scholarship on the Bible and the role the Bible has played in human history. I am not Christian, and I do not embrace the Bible as my scripture. The Bible is not the basis for my behavior, though I happen to agree with some, but not all, of the moral principles articulated in the Bible. I do not judge my sexual orientation by what is or is not written in the Bible. I do not regard the Bible as the word of God, as many Christians do. \n \n My main point to you has been that different Christians interpret the Bible differently, and not all Christians interpret the Bible as you do. I am not a Christian, and I do not speak as a gay or a liberal Christian on what the Bible says or means. I have, however, read what various gay and liberal Christians have written about the Bible, and so I have some familiarity with these arguments. I also know some of the historical debates among Christians over the Bible. I am certainly no Bible expert by any means.", 
   {}, 
   320179, 
   null, 
   1218655680.0
  ], 
  [
   320194, 
   null, 
   "Archangel", 
   "1. My \"sexual proclivity,\" whatever that means, is not and never has been a subject for discussion here. Nor is your \"sexual proclivity\" a subject for discussion. \n\n \n Sure it has been, and always will be. Don't you dare claim to be above the fray when you constantly defend homosexuality as right and normal as a sexual expression. You can't have it both ways Op. You can't defend homosexuality which by its very definition means same gender sex while then claiming that your sexual proclivity is not a subject for discussion. Because it's the rightness or wrongness of your communities sexual proclivity which we are debating here.\n \n \n2. I interpret scripture purely out of intellectual interest, to understand the scholarship on the Bible and the role the Bible has played in human history. I am not Christian, and I do not embrace the Bible as my scripture. The Bible is not the basis for my behavior, though I happen to agree with some, but not all, of the moral principles articulated in the Bible. I do not judge my sexual orientation by what is or is not written in the Bible. I do not regard the Bible as the word of God, as many Christians do. \n \n My main point to you has been that different Christians interpret the Bible differently, and not all Christians interpret the Bible as you do. I am not a Christian, and I do not speak as a gay or a liberal Christian on what the Bible says or means. I have, however, read what various gay and liberal Christians have written about the Bible, and so I have some familiarity with these arguments. I also know some of the historical debates among Christians over the Bible. I am certainly no Bible expert by any means.\n\n \n Figures, although in past debates you have spoken about your church in very affectionate terms. Of course you also spoke of the pro gay activism that it participated in so I should have deduced that your involvement was based on your pro gay activism and not a spiritual connection or interest in the living God, or His spiritual truths at all.", 
   {}, 
   320184, 
   null, 
   1218659880.0
  ], 
  [
   320195, 
   null, 
   "Ohioprof", 
   "Sure it has been, and always will be. Don't you dare claim to be above the fray when you constantly defend homosexuality as right and normal as a sexual expression. You can't have it both ways Op. You can't defend homosexuality which by its very definition means same gender sex while then claiming that your sexual proclivity is not a subject for discussion. Because it's the rightness or wrongness of your communities sexual proclivity which we are debating here.\n\n \n \"Sexual proclivity\" means what, exactly? \n \n These sub-forums, and this thread specifically, are not about \"sexual proclivity,\" nor are they about \"same gender sex.\" The topic of these sub-forums is equal rights for gay people. The topic of this particular thread is not judging people on the basis of their sexual orientation. Sexual orientation is not the same as \"same gender sex,\" nor is sexual orientation the same as \"sexual proclivity.\" You continue to confound sexual orientation with sex acts. They are not the same. Whether I have sex or not, with whom, and how are none of your business, frankly. That's not the topic of these forums. \n \n You are the one who keeps using the term \"homosexuality\" and then equating it with \"a sexual expression\" and with \"same gender sex.\" The thread is about sexual orientation, and the sub-forums are about gay rights, which are human rights.\n \n These forums are also NOT about the \"rightness or wrongness\" of gay people's \"sexual proclivity.\" That's NOT what we are debating. These forums are about treating gay people equally, with fully equal rights. The topic of these sub-forums is gay rights, not the rightness or wrongness of gay people's sexual expression. This particular thread is about not judging people on the basis of their sexual orientation. The thread has nothing to do with the \"rightness or wrongness\" of anyone's \"sexual proclivity,\" except maybe in your mind.", 
   {}, 
   320194, 
   null, 
   1218661020.0
  ], 
  [
   320199, 
   null, 
   "Ohioprof", 
   "Figures, although in past debates you have spoken about your church in very affectionate terms. Of course you also spoke of the pro gay activism that it participated in so I should have deduced that your involvement was based on your pro gay activism and not a spiritual connection or interest in the living God, or His spiritual truths at all.\n\n \n My church is not a Christian church. I am a Unitarian Universalist. We welcome Christians into our church, as we welcome people of other faiths as well. My church is non-doctrinal, meaning we hold to no theological doctrine. It's up to each individual to come to his or her own theological beliefs, if they choose to do so. The origins of my own congregation are in Universalism, which was a Christian association half a century ago. We are no longer explicitly Christian. \n \n I personally attend and participate actively in my church because of the community it provides and the support it provides for spiritual seeking and spiritual expresssion. My church is a community that is supportive of children and is a good environment for my daughter. The religious education programs are outstanding. My church is active in social justice work, and I am on the social justice committee and am the former chair of that committee. My church is welcoming to gay, lesbian, bisexual, and transgender people, and my church supports same-sex marriage. Our minister is gay. This position by our church is important to me, because our church home is welcoming to us. But it's not the main reason I participate in the church. \n \n I hope that explains my personal affection for my church.", 
   {}, 
   320194, 
   null, 
   1218661740.0
  ], 
  [
   320205, 
   null, 
   "Archangel", 
   "\"Sexual proclivity\" means what, exactly?\n\n \n It means ones inclination or preference, it doesn't mean ones innate nature as Matthew would imply homosexuality is. If you were in fact really a College Professor, I can't imagine for the life of me that you wouldn't know that. Especially since you, yourself used the word earlier in this debate.\n \n \n These sub-forums, and this thread specifically, are not about \"sexual proclivity,\" nor are they about \"same gender sex.\" The topic of these sub-forums is equal rights for gay people. The topic of this particular thread is not judging people on the basis of their sexual orientation. Sexual orientation is not the same as \"same gender sex,\" nor is sexual orientation the same as \"sexual proclivity.\" You continue to confound sexual orientation with sex acts. They are not the same. Whether I have sex or not, with whom, and how are none of your business, frankly. That's not the topic of these forums. \n \n You are the one who keeps using the term \"homosexuality\" and then equating it with \"a sexual expression\" and with \"same gender sex.\" The thread is about sexual orientation, and the sub-forums are about gay rights, which are human rights.\n \n These forums are also NOT about the \"rightness or wrongness\" of gay people's \"sexual proclivity.\" That's NOT what we are debating. These forums are about treating gay people equally, with fully equal rights. The topic of these sub-forums is gay rights, not the rightness or wrongness of gay people's sexual expression. This particular thread is about not judging people on the basis of their sexual orientation. The thread has nothing to do with the \"rightness or wrongness\" of anyone's \"sexual proclivity,\" except maybe in your mind.\n\n \n Boy can you rationalize anything Op. When it suits you we're debating homosexuality, and then just as quickly I'm changing the subject when you're losing the debate. You talk about me interpreting the bible according to my personal prejudices, yet you completely ignore valid evidence I post rather than even trying to honestly refute it. And the reason for that is because you know you can't refute it. So what is there to debate Op? I ask you again. You reject the truth regarding what homosexuality represents and I reject the lies you rely on to rationalize making it appear normal and right! \n \n Answer to these accurate theological translations from the original greek that don't have any agenda to support or defend, and then explain how I am wrong in my theology. http://www.4forums.com/political/showpost.php?p=312261&postcount=218 Then maybe we'll have something to discuss. Other wise, this debate is over because all you seem to want to offer is distortions of the truth and lip service.", 
   {}, 
   320195, 
   null, 
   1218663420.0
  ], 
  [
   320207, 
   null, 
   "Archangel", 
   "My church is not a Christian church. I am a Unitarian Universalist. We welcome Christians into our church, as we welcome people of other faiths as well. My church is non-doctrinal, meaning we hold to no theological doctrine. It's up to each individual to come to his or her own theological beliefs, if they choose to do so. The origins of my own congregation are in Universalism, which was a Christian association half a century ago. We are no longer explicitly Christian.\n\n \n The UU used to claim to respect all religious beliefs. By your description, you simply suffer the idea of using religion as a cover for your social activism.\n \n \n I personally attend and participate actively in my church because of the community it provides and the support it provides for spiritual seeking and spiritual expresssion. My church is a community that is supportive of children and is a good environment for my daughter. The religious education programs are outstanding. My church is active in social justice work, and I am on the social justice committee and am the former chair of that committee. My church is welcoming to gay, lesbian, bisexual, and transgender people, and my church supports same-sex marriage. Our minister is gay. This position by our church is important to me, because our church home is welcoming to us. But it's not the main reason I participate in the church. \n \n I hope that explains my personal affection for my church.\n\n \n It explains why your so called church is a social club of gay activism but in no way represents anything close to Gods truth at all. And I know this because as a child, in light of the fact that our community had no mosque, my parents took us to our local UU church. And at only 10 years old I sat there thinking how that church stood for nothing real regarding a living God, but represented the shallow whims of whatever people wanted to believe was right.", 
   {}, 
   320199, 
   null, 
   1218664440.0
  ], 
  [
   320210, 
   null, 
   "Ohioprof", 
   "It means ones inclination or preference, it doesn't mean ones innate nature as Matthew would imply homosexuality is. If you were in fact really a College Professor, I can't imagine for the life of me that you wouldn't know that. Especially since you, yourself used the word earlier in this debate. \n\n \n Your meaning is still not clear. You are using the expression \"sexual proclivity\" to refer to sexual orientation? \n \n It's up to the writer to be clear; it's not up to the reader to struggle to figure out what the writer means when the writer is not clear. Please don't blame me for not understanding your use of a term that you have not explained clearly. The expression \"sexual proclivity\" sounds to me like someone's favorite sexual practices. That appears now to be not what you meant. But sexual orientation does not appear to be quite the same as a \"sexual proclivity,\" as sexual orientation is not principally about having sex. It refers to the gender of the person we love and with whom we seek to form a partnership and a marriage. \n \n I think a person's sexual orientation is innate. Mine certainly is.", 
   {}, 
   320205, 
   null, 
   1218665280.0
  ], 
  [
   320211, 
   null, 
   "Ohioprof", 
   "The UU used to claim to respect all religious beliefs. By your description, you simply suffer the idea of using religion as a cover for your social activism. It explains why your so called church is a social club of gay activism but in no way represents anything close to Gods truth at all. And I know this because as a child, in light of the fact that our community had no mosque, my parents took us to our local UU church. And at only 10 years old I sat there thinking how that church stood for nothing real regarding a living God, but represented the shallow whims of whatever people wanted to believe was right.\n\n \n That is certainly not my experience of our church or our faith tradition. For me, participation in our UU church has deep meaning, and it is more spiritually fulfilling for me than I have found Christian churches to be. I left the Lutheran Church and embraced Unitarian Universalism. We humans are all different, and different faith traditions suit each of differently. \n \n My church engages in social activism of all kinds. We are not a \"social club of gay activism.\" We engage mostly in activism to address poverty and homelessness and to end the war. We also work against the death penalty. \n \n My primary reason for participating in our church is not to engage in activism, though I see activism as part of the religious life. Many Christians do also. My primary reason for participating in our church is for spiritual expression and growth within a caring community.", 
   {}, 
   320207, 
   null, 
   1218665760.0
  ], 
  [
   320212, 
   null, 
   "Ohioprof", 
   "The UU used to claim to respect all religious beliefs.\n\n \n We respect the right of all people to choose their religious beliefs, based on their individual conscience. That does not mean that we all have to agree with all religious beliefs. UUs are free to agree or to disagree with any and all theological doctrines. We adhere to no theological doctrine as a church body. \n \n Our church association supports the right of same-sex couples to marry. Our congregation voted unanimously to support the right of same-sex couples to marry and to support and welcome gay, lesbian, bisexual, and transgender people into the church, accepting gay and bi and trans people as we are. Individuals in the church are free to disagree with this position, but no one in our church voted against taking this stance. This position is not a theological doctrine; it is a position on a social issue. Similarly, we voted unanimously to oppose the death penalty. Again, this is not a theological doctrine; it is a position on a social issue. \n \n In our congregation, equal treatment and acceptance of gay, bi, and transgender people are simply not issues.", 
   {}, 
   320207, 
   null, 
   1218666720.0
  ], 
  [
   320237, 
   null, 
   "Matthew S", 
   "You're a sick puppy Matthew, and you prove it with every post you write. emoticon_wow\n\n \n So I am a sick puppy for suggesting that any skin color other then white, according to your gay is sinfull, after the fall? Your that one that contends that an innate aspect of a person is sinfull. If I am a sick puppy then what are you. \n \n I think Jesus would make a very considerate, passionate, sexy lover.", 
   {}, 
   320154, 
   null, 
   1218680760.0
  ], 
  [
   320254, 
   null, 
   "Archangel", 
   "So I am a sick puppy for suggesting that any skin color other then white, according to your gay is sinfull, after the fall? Your that one that contends that an innate aspect of a person is sinfull. If I am a sick puppy then what are you. \n\n \n The fact that you're delusional enough to actually post a drawing of a white Adam and Eve and suggest that based on that all christians believe that they were white, and therefore all whites must obviously be superior to blacks? That reason alone is proof enough that you're seriously lacking the common sense and discernment that God gave a gnat. \n \n Making statements like this one below;\n \n \nI think Jesus would make a very considerate, passionate, sexy lover.\n\n \n And these: http://www.4forums.com/political/showpost.php?p=320154&postcount=37\n \n are solid evidence that you are sick. emoticon_xdonno", 
   {}, 
   320237, 
   null, 
   1218687720.0
  ], 
  [
   320256, 
   null, 
   "Matthew S", 
   "The fact that you're delusional enough to actually post a drawing of a white Adam and Eve and suggest that based on that all christians believe that they were white, and therefore all whites must obviously be superior to blacks? That reason alone is proof enough that you're seriously lacking the common sense and discernment that God gave a gnat. \n \n Making statements like this one below;\n \n \n \n And these: http://www.4forums.com/political/showpost.php?p=320154&postcount=37\n \n are solid evidence that you are sick. emoticon_xdonno\n\n \n But the pictures in my KJV and Catholic action bibles show white adam and eve and a white Jesus. Are you saying that something that is in the bible is not the word of God?", 
   {}, 
   320254, 
   null, 
   1218688200.0
  ], 
  [
   320258, 
   null, 
   "Archangel", 
   "But the pictures in my KJV and Catholic action bibles show white adam and eve and a white Jesus. Are you saying that something that is in the bible is not the word of God?\n\n \n Uhhh, yuh Matthew. The publishers of the bible paid an editor and an art staff a weekly salary to search out artists, look at their body of works, decide which one best portrays the image and quality of art that represents the message they want to convey, and they hire that artist, and they pay him to draw pictures. He may be an inspired artist, but in no way are his pictures God breathed or inspired by the holy spirit to reflect actual historical characters. And no where in your bible does it, or the publisher make that assertion. Those drawings are modern representations of biblical characters, nothing more should be made of them than that. \n \n Have you ever been in a black church and seen a portrait of a black Jesus? Should we be offended because black people like to be able to identify with a black Messiah? Does it matter what color key characters were in the bible? And Isn't this whole line of thinking on your part very racist? Think Matthew, think before you speak. You constantly embarrass yourself as you attempt to harshly judge me for my beliefs.", 
   {}, 
   320256, 
   null, 
   1218690480.0
  ], 
  [
   320259, 
   null, 
   "T.Q", 
   "I should bookmark this post for next time you cry \"Fraud!\" when a museum or magazine posts a picture or makes a statue of a dinosaur.", 
   {}, 
   320258, 
   null, 
   1218690840.0
  ], 
  [
   320260, 
   null, 
   "Matthew S", 
   "Uhhh, yuh Matthew. The publishers of the bible paid an editor and an art staff a weekly salary to search out artists, look at their body of works, decide which one best portrays the image and quality of art that represents the message they want to convey, and they hire that artist, and they pay him to draw pictures. He may be an inspired artist, but in no way are his pictures God breathed or inspired by the holy spirit to reflect actual historical characters or events. And no where in your bible does it, or the publisher make that assertion. Those drawings are modern representations of biblical characters, nothing more should be made of it than that. \n \n Have you ever been in a black church and seen a portrait of a black Jesus? Should we be offended because black people like to be able to identify with a black Messiah? Does it matter what color key characters were in the bible? And Isn't this whole line of thinking on your part very racist? Think Matthew, think before you speak. You constantly embarrass yourself as you attempt to harshly judge me for my beliefs.\n\n \n But it is in the bible and you consistantly claim that if it is in the bible it is the word of God. My bibles show white people so God created all people white and it is only their sinful nature after the fall that people became other colors. I am not the one who has a problem. I believe God is both gay and straight, male and female, and He is a rainbow of colors. You are the one who consistantly brings up the bible to prove your points, yet when I do it I am somehow racist. Go figure? BTW take your own advice before you use the bible to condem gay people. \"Think Archangel, think before you speak.\"", 
   {}, 
   320258, 
   null, 
   1218690960.0
  ], 
  [
   320263, 
   null, 
   "Archangel", 
   "But it is in the bible and you consistantly claim that if it is in the bible it is the word of God. My bibles show white people so God created all people white and it is only their sinful nature after the fall that people became other colors. \n\n \n You're right Matthew, thanks for posting an actual portrait of Adam and Eve in Eden, holding an apple with the actual serpent behind them. I was surprised that Adam had a haircut, but hey, I guess either the Lord or Eve did hair too, huh? emoticon_xgood\n \n http://thesituationist.files.wordpress.com/2007/08/adam-eve-snake.jpg", 
   {}, 
   320260, 
   null, 
   1218692160.0
  ], 
  [
   320299, 
   null, 
   "Ohioprof", 
   "There are two broadly different perspectives taken by people debating in this sub-forum on gay rights. The first perspective is taken by the gay and bisexual people here and by heterosexuals who support equal treatment and acceptance for gay people as we are. This first group includes Christians. The second perspective is taken by those who espouse a particular conservative Christian religious viewpoint. \n \n Those who embrace the second broad perspective believe and argue that God did not make anyone gay, that God's plan for humanity is for a man to marry a woman and procreate, and that what they call \"homosexuality\" is a fall into sin. They believe and argue that by faith in Jesus, people can renounce the sin of homosexuality and come to live accord with God's will, which they argue is for all to live as heterosexuals and to marry someone of the opposite sex and to procreate. These folks tend to reject the idea that sexual orientation even exists, as they don't believe that a same-sex orientation is innate. They see being in right relation with God as the way for people to live out their God-given heterosexual nature and renounce the sin of homosexuality.\n \n Those who embrace the first broad perspective generally believe and argue that some people simply are gay or bisexual, that this is part of the diversity of humanity, and that we should accept people whatever their sexual orientation. Those who are religious often argue that God made some people gay. Folks who embrace this broad perspective do not seek to change gay people into heterosexuals; many do try to change laws that discriminate against gay people and which deny gay people the right to marry. \n \n From the perspective of those in the first group, the problem is \"homosexuality,\" which they regard as sin. Their seek to encourage gay people to renounce this \"sin\" by coming to Jesus. \n \n From the perspective of those in the second group, the problem is prejudice and discrimination against gay and bisexual people. They seek to encourage all people to accept gay and bisexual people and to eliminate discriminatory laws.\n \n Because of the different assumptions of people with these two different perspectives, there is little room for agreement, except that both groups generally agree that gay and bisexual people should not be attacked and should be treated with respect as human beings. Beyond that, there is little area of common agreement between folks of these two perspectives.", 
   {}, 
   320263, 
   null, 
   1218729600.0
  ], 
  [
   320304, 
   null, 
   "Archangel", 
   "they don't believe that a same-sex orientation is innate.\n\n \n If homosexuality is innate, then why do you refer to it as an orientation? When I went to my freshman orientation in college, It was a process to indoctrinate the freshmen into the rules, policies and lifestyle of the college. If being freshmen, or homosexual was innate within us, we wouldn't have needed an orientation in order to teach us the rules and practices of being members of the freshman class, or of the homosexual community. You balk at the word proclivity, but it more closely describes your belief that being homosexual is a personal preference rather than a practiced or a learned activity. And regarding this statement.\n \n \nFrom the perspective of those in the second group, the problem is prejudice and discrimination against gay and bisexual people.\n\n \n That is your opinion from your perspective, but when I stand against what homosexuality represents, morally speaking, which is my only beef with it. I have never thought in terms of restricting anyones rights or being prejudice against them in any way. Many years ago, I was at a keg party and 3 guys were making alot of noise, so me and my buddy walked over to see what was up. A guy was on the ground and the three guys were closing in on him to pummel him after already hitting him which forced him to the ground. They were calling him every derogatory word for a gay guy one could imagine and he was about to get kicked if he didn't stand up and fight them. \n \n I broke in and demanded to know what this guy had done to them to deserve this beating that required that 3 guys were needed to give it to him? They said he didn't do anything tonight, but everyone knows he's a XXXXX so he deserves it. I said, so you're saying that just because this guy is different from you, he deserved a beating by a gang? I said tell me something, to the kid who was doing all of the talking for his buddies, and I asked him what color his eyes were, he said they're brown, why do you ask? I said well mine are blue and I don't like that you're different from me. I want everyone here with blue eyes to help me beat the hell out of this guy cuz he's different from us. \n \n Loud murmurs of agreement rose up from the partiers behind me. So I added, do you see how ignorant your reasoning is? If we start beating and attacking each other because we're different from each other, we will live in fear and anarchy. I'm an arab who was born in boston mass I said, is that different enough to be attacked by you christians just because my dad was born in Syria? He said no. So I said leave this guy alone and stop trying to make his life a living hell just because you don't agree with homosexuality. No one is asking you to be a homosexual after all, so put yourself in the other guys place before you gang up on someone.\n \n My friend helped the gay kid up and he hung around with our group of beer drinking pot smokers for the rest of the night. So for you to imply that I have a prejudiced or discriminatory bone in my body is rife with ignorance, and is strong evidence that you don't have a clue about me, my sense of justice, or my sense of fair and equitable treatment for all people. Our disagreement is based on morality, plain and simple. And the practice of homosexuality which the bible condemns, not with homosexuals at all which I've said a hundred times at least by now.", 
   {}, 
   320299, 
   null, 
   1218738060.0
  ], 
  [
   320308, 
   null, 
   "Ohioprof", 
   "If homosexuality is innate, then why do you refer to it as an orientation? When I went to my freshman orientation in college, It was a process to indoctrinate the freshmen into the rules, policies and lifestyle of the college. If being freshmen, or homosexual was innate within us, we wouldn't have needed an orientation in order to teach us the rules and practices of being members of the freshman class, or of the homosexual community. You balk at the word proclivity, but it more closely describes your belief that being homosexual is a personal preference rather than a practiced or a learned activity. And regarding this statement. \n\n \n I'm sure you understand the difference between a first-year orientation to college and a person's sexual orientation. The term \"orientation\" is used differently in these two different contexts. \n \n One problem I have with the expression sexual orientation is that the word \"sexual\" can be confusing. I think that gender orientation would probably be clearer and more accurate. To me, sexual orientation is not about having sex; it's about the sex or gender of the person with whom one forms an intimate partnership or marriage. My sexual orientation is gay because I am attracted to and seek to marry a woman rather than a man. The only thing that makes my sexual orientation different from that of a heterosexual is the gender of my spouse. \n \n But sexual orientation is currently the commonly used expression. It sounds from this like you do use \"sexual proclivity\" to mean sexual orientation.", 
   {}, 
   320304, 
   null, 
   1218739320.0
  ], 
  [
   320330, 
   null, 
   "Ohioprof", 
   "That is your opinion from your perspective, but when I stand against what homosexuality represents, morally speaking, which is my only beef with it. I have never thought in terms of restricting anyones rights or being prejudice against them in any way. Many years ago, I was at a keg party and 3 guys were making alot of noise, so me and my buddy walked over to see what was up. A guy was on the ground and the three guys were closing in on him to pummel him after already hitting him which forced him to the ground. They were calling him every derogatory word for a gay guy one could imagine and he was about to get kicked if he didn't stand up and fight them. \n \n I broke in and demanded to know what this guy had done to them to deserve this beating that required that 3 guys were needed to give it to him? They said he didn't do anything tonight, but everyone knows he's a XXXXX so he deserves it. I said, so you're saying that just because this guy is different from you, he deserved a beating by a gang? I said tell me something, to the kid who was doing all of the talking for his buddies, and I asked him what color his eyes were, he said they're brown, why do you ask? I said well mine are blue and I don't like that you're different from me. I want everyone here with blue eyes to help me beat the hell out of this guy cuz he's different from us. \n \n Loud murmurs of agreement rose up from the partiers behind me. So I added, do you see how ignorant your reasoning is? If we start beating and attacking each other because we're different from each other, we will live in fear and anarchy. I'm an arab who was born in boston mass I said, is that different enough to be attacked by you christians just because my dad was born in Syria? He said no. So I said leave this guy alone and stop trying to make his life a living hell just because you don't agree with homosexuality. No one is asking you to be a homosexual after all, so put yourself in the other guys place before you gang up on someone.\n \n My friend helped the gay kid up and he hung around with our group of beer drinking pot smokers for the rest of the night. So for you to imply that I have a prejudiced or discriminatory bone in my body is rife with ignorance, and is strong evidence that you don't have a clue about me, my sense of justice, or my sense of fair and equitable treatment for all people. Our disagreement is based on morality, plain and simple. And the practice of homosexuality which the bible condemns, not with homosexuals at all which I've said a hundred times at least by now.\n\n \n That's all very nice, but I'm not sure why you are telling me this story. My post to which you responded did not accuse you of discrimination or of being unfair, though you seem to assume it did. My post was not about you. I wrote that from the perspective of one group, the problem that needs to be addressed is prejudice and discrimination against gay people. That was not a statement about you. \n \n Indeed, your story confirms that prejudice is a problem facing gay people, as the men you stopped were about to beat up a gay man.", 
   {}, 
   320304, 
   null, 
   1218754500.0
  ], 
  [
   320338, 
   null, 
   "Archangel", 
   "That's all very nice, but I'm not sure why you are telling me this story. My post to which you responded did not accuse you of discrimination or of being unfair, though you seem to assume it did. My post was not about you. I wrote that from the perspective of one group, the problem that needs to be addressed is prejudice and discrimination against gay people. That was not a statement about you. \n \n Indeed, your story confirms that prejudice is a problem facing gay people, as the men you stopped were about to beat up a gay man.\n\n \n Please don't imply that you weren't imagining me in that group that is prejudiced against, and seeks to discriminate against homosexuals, because you'll lose all credibility if you try that. And I have been in a few situations in my life when I intervened to protect gays and underdogs against getting bullied or beaten unfairly. And in every situation, it was unsaved, non religious type guys who did the abusing. Never did I have to stand against a follower of Christ to stop him from attacking homosexuals.", 
   {}, 
   320330, 
   null, 
   1218761460.0
  ], 
  [
   320344, 
   null, 
   "Matthew S", 
   "Please don't imply that you weren't imagining me in that group that is prejudiced against, and seeks to discriminate against homosexuals, because you'll lose all credibility if you try that. And I have been in a few situations in my life when I intervened to protect gays and underdogs against getting bullied or beaten unfairly. And in every situation, it was unsaved, non religious type guys who did the abusing. Never did I have to stand against a follower of Christ to stop him from attacking homosexuals.\n\n \n Well that is noce to know that you are against us being beaten. It is also disapointing that you hate our love for one another.", 
   {}, 
   320338, 
   null, 
   1218768960.0
  ], 
  [
   320347, 
   null, 
   "chester", 
   "Well that is noce to know that you are against us being beaten. It is also disappointing that you hate our love for one another.\n\n \n Poor Archie can't seem to get past plumbing issues.\n \n If being gay is a choice, I would like to know when he CHOSE to be straight.", 
   {}, 
   320344, 
   null, 
   1218771240.0
  ], 
  [
   320350, 
   null, 
   "Ohioprof", 
   "Please don't imply that you weren't imagining me in that group that is prejudiced against, and seeks to discriminate against homosexuals, because you'll lose all credibility if you try that. And I have been in a few situations in my life when I intervened to protect gays and underdogs against getting bullied or beaten unfairly. And in every situation, it was unsaved, non religious type guys who did the abusing. Never did I have to stand against a follower of Christ to stop him from attacking homosexuals.\n\n \n I did not say that either group seeks to discriminate against gay people. I said that one group views the problem as prejudice and discrimination against gay people. That's what they view as the problem to be addressed. The other group views the problem to be addressed as what they call the \"sin\" of \"homosexuality.\" And if you read my post again, I said that the one area of agreement between the two groups is that gay people should be treated with respect as human beings. \n \n Don't assume that I imagined something that I never said. I was not imagining anything about you. My post was not about you. Not everything is about you.", 
   {}, 
   320338, 
   null, 
   1218772680.0
  ], 
  [
   320353, 
   null, 
   "Matthew S", 
   "Poor Archie can't seem too get past plumbing issues.\n \n If being gay is a choice, I would like to know when he CHOSE to be straight.\n\n \n The answer is when he accepted Jesus as his lord and savior :xbanghead emoticon_xkill", 
   {}, 
   320347, 
   null, 
   1218775980.0
  ], 
  [
   320946, 
   null, 
   "EchoR1", 
   "im glad you guys are debating but its coming off more as an arguement... that's not what i intended emoticon_cry", 
   {
    "post_info": {
     "post_title": ":o"
    }
   }, 
   320353, 
   null, 
   1219298400.0
  ], 
  [
   320948, 
   null, 
   "MrWriteLA", 
   "im glad you guys are debating but its coming off more as an arguement... that's not what i intended emoticon_cry\nSorry, but you can't control the way people are going to debate here. Some posters will contribute rational, well-thought-out responses, others will doggedly and predictably give knee-jerk repetitions of dogma, and still others will attempt to disguise the latter as the former. That's just the way it is on forums like this.", 
   {}, 
   320946, 
   null, 
   1219298880.0
  ], 
  [
   320953, 
   null, 
   "Ohioprof", 
   "im glad you guys are debating but its coming off more as an arguement... that's not what i intended emoticon_cry\n\n \n Thanks for starting the thread. I notice you live in Northeast Ohio, as do I. I am saddened by the sudden passing of Stephanie Tubbs Jones.", 
   {}, 
   320946, 
   null, 
   1219324380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Judging by Orientation Isn't Right", 
  "url": "http://www.4forums.com/political/gay-rights-debates/11479-judging-orientation-isnt-right.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 11479, 
  "discussion_files": [
   [
    "14478.html", 
    "http://www.4forums.com/political/gay-rights-debates/11479-judging-orientation-isnt-right-print.html"
   ], 
   [
    "14479.html", 
    "http://www.4forums.com/political/gay-rights-debates/11479-judging-orientation-isnt-right-6-print.html"
   ], 
   [
    "14480.html", 
    "http://www.4forums.com/political/gay-rights-debates/11479-judging-orientation-isnt-right-4-print.html"
   ], 
   [
    "14481.html", 
    "http://www.4forums.com/political/gay-rights-debates/11479-judging-orientation-isnt-right-5-print.html"
   ], 
   [
    "14482.html", 
    "http://www.4forums.com/political/gay-rights-debates/11479-judging-orientation-isnt-right-3-print.html"
   ], 
   [
    "14483.html", 
    "http://www.4forums.com/political/gay-rights-debates/11479-judging-orientation-isnt-right-2-print.html"
   ]
  ], 
  "identifier": 11479
 }
]