[
 [
  [
   320218, 
   null, 
   "grizzly6626", 
   "Is there truly a systematic assault on the 2nd Amendment? I say Yes! The Government has been implementing gun control of some kind for year's on all level's, Federal, State and Local. First,they ban a specific type or type's of firearm's, while using bogus or misleading information as the reason for the ban. Then, they reclassify other type's of firearm's,thus moving those into the list of banned gun's. So called assault weapon's-These firearm's, as anybody with any knowledge of firearm's know's, they are semi-auto(Unless fully automatic and illegal)!Mechanically no different from a semi-auto hunting rifle other than the cappacity of ammo it will hold. So is a semi-auto hunting rifle also an assault weapon? Not at this time but you see how easily a semi-auto hunting rifle could be added to the list of assault weapon's and then banned by the Government. Now they want to pass law's stating that if a person has a mental disorder that he/she be banned from owning or purchasing a firearm. Now I will agree with that to a point! If a person has been deemed incompetent, been institutionalised for a mental illness, been declared a danger to themselves or other's,or has some form of mental retardation,then no,they should not be allowed to own a gun. But the way the Government want's the law to read is anyone with any kind of mental disorder,weather past or present,would be banned from owning a gun. What does this mean exhactly? Well if you dont pick thing's up as fast at your job as someone else does your age,you have a learning disorder,which now mean's you have a mental dissorder which will ban you from gun ownership.Or your child has ADHD,this is also a mental dissorder which will ban him/her from ever owning a gun.I'm not sure of what they call it, but when a woman is pregnant she suffer's with post-pardum stress dissorder(I think this is right),she now has a mental dissorder and thus is banned from gun ownership.I do not have statistic's or fact sheet's for this info,so i am sure the anti-gun crowd will refute this,but if you do a little reading and research you will find all of this to be fact's if you piece it all togeather. Just like a house infested with termites, the Government and the anti-gun groups are eating away,day after day at the foundation of our 2nd Ammendment Right's,until eventually there won't be a Second Ammendment left.", 
   {
    "post_info": {
     "post_title": "A systematic assault on the 2nd Amendment"
    }
   }, 
   null, 
   null, 
   1218669540.0
  ], 
  [
   320220, 
   null, 
   "Penfold", 
   "Aberrant apostrophes proliferate to the point of plenitude. And then some.", 
   {}, 
   320218, 
   null, 
   1218670800.0
  ], 
  [
   323137, 
   null, 
   "Ethmi", 
   "Aberrant apostrophes proliferate to the point of plenitude. And then some.\n\n \n Ad homenim.", 
   {}, 
   320220, 
   null, 
   1221003180.0
  ], 
  [
   323547, 
   null, 
   "egfx", 
   "whatever, just ban em all", 
   {}, 
   323137, 
   null, 
   1221263340.0
  ], 
  [
   323548, 
   null, 
   "Omegamon_X", 
   "whatever, just ban em all\n\n \n If you're in America, then go back to Britain where people like you belong.", 
   {}, 
   323547, 
   null, 
   1221264420.0
  ], 
  [
   323556, 
   null, 
   "Penfold", 
   "Ad homenim.\n\n \n \n How do you spel that again? ;)", 
   {}, 
   323137, 
   null, 
   1221271200.0
  ], 
  [
   323557, 
   null, 
   "Penfold", 
   "If you're in America, then go back to Britain where people like you belong.\n\n \n \n \"Bang\" goes the First amendment.....emoticon_xgood", 
   {}, 
   323548, 
   null, 
   1221271380.0
  ], 
  [
   323558, 
   null, 
   "smiley", 
   "If you're in America, then go back to Britain where people like you belong.\n\n I think he's referring to intelligent, educated people with a good sense of humour (good looking too emoticon_smile) who aren't paranoid beyond reason, can spell correctly and know what real beer is.\n \n Smiley", 
   {}, 
   323548, 
   null, 
   1221271500.0
  ], 
  [
   323618, 
   null, 
   "Ethmi", 
   "Nobody has even addressed the main point yet! Am I debating among XXXXXX? Of course, I only expect an ad hom in response.", 
   {
    "post_info": {
     "post_title": "This thread sucks"
    }
   }, 
   323558, 
   null, 
   1221360180.0
  ], 
  [
   323619, 
   null, 
   "Ethmi", 
   "whatever, just ban em all\n\n \n If you're going to debate, then debate. If you're going to post this, then just shut up.", 
   {}, 
   323547, 
   null, 
   1221360240.0
  ], 
  [
   323622, 
   null, 
   "Omegamon_X", 
   "\"Bang\" goes the First amendment.....emoticon_xgood\n\n \n \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\"\n --Amendment IX of the United States Constitution", 
   {}, 
   323557, 
   null, 
   1221362760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A systematic assault on the 2nd Amendment", 
  "url": "http://www.4forums.com/political/gun-control-debates/11487-systematic-assault-2nd-amendment.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11487, 
  "discussion_files": [
   [
    "24667.html", 
    "http://www.4forums.com/political/gun-control-debates/11487-systematic-assault-2nd-amendment-print.html"
   ]
  ], 
  "identifier": 11487
 }
]