[
 [
  [
   320498, 
   null, 
   "eanassir", 
   "There is life on Mars in the form of intelligent beings: people (and &#8211; although to this some do not agree: there are also demons or genies like those on Earth), in addition to animals and plants; with rivers, seas, mountains, forests, towns and cities.\n \n The following points give the clew:\n \n &#8226; They have till now found ice on the two poles of Mars, water in frozen form, and cirrus cloud drifted by the wind.\n http://marsrovers.jpl.nasa.gov/spotlight/20080324_Opportunity.html \n \n Such cloud indicates that the atmosphere of Mars is not so thin; so that it bears the ice-bearing cloud at some high altitude and the wind comes to drift it.\n \n \n &#8226; They have taken photos of Mars, either from very high altitudes, or from the ground level; while if they take the images from the level of one hundred or two hundred meters: everything will be obvious. \n \n &#8226; I asked some astronomers at NASA, about the mountains of Mars, they answered:\n \n \"In general the southern hemisphere is the highlands of Mars and the northern hemisphere is the lowlands. \n The Tharsis province is a notable high volcanic chain, and the tallest volcano Olympus mons is nearby (27 km high and 600 km wide at the base). \n Other peaks in decreasing order of height are Ascraeus mons, Arsia mons, Pavonis mons, and Elysium mons--all of these are taller than Mt. Everest. \n You can see maps of the topography of Mars at the following link: http://ssed.gsfc.nasa.gov/tharsis/global_paper.html \"\n \n Therefore, all these mountains are taller than Mt. Everest, which may give an idea that Mars is in fact larger than Earth.\n \n The other thing is that their knowledge about Mars mountains is obviously defective: because where are the mountains less than Mt. Everest?\n \n Moreover, the tops of these mountains are covered by ice, then will not this ice !sublimate! as do they claim, specially if the atmosphere of Mars is allegedly thin? And how does such ice accumulate again?\n \n On Earth, the ice and rain will percolate in the ground and will come out in the form of water-springs on the slopes of the mountains and in the valleys in between them, and the streams of water will form tributaries and these will form the rivers that will flow from the mountains to the lower planes. \n \n Had they searched in the mountainous regions of Mars, they might have found water-springs, water-springs, and rivers in the valleys between these mountains and the plains below such mountains. \n \n But their search has been almost in the desert regions and the polar regions, which are almost without life. That is because their landing on the plain lands is easier than their landing on the mountainous regions.\n \n Moreover, if they use some sound records, they might discover some sounds like the cry of some birds and animals or other sounds. There is some set to record the sounds, but it has not been in use on Phoenix.\n \n &#8226; On Earth, their advanced technology enabled them to view the detailed features of the land and towns and may be people walking in the streets; but on Mars, it seems that such technology has been difficult to apply, and moreover, they descended their tools quickly, and cannot fly on some low or medium height to have better viewing of the surface features.\n \n Now see this link about an image of the Inka City, by Mariner 9\n http://nssdc.gsfc.nasa.gov/image/planetary/mars/mr9_inca_city.jpg \n \n And this is another image of this Inka City by, Viking 2\n http://nssdc.gsfc.nasa.gov/image/planetary/mars/f421b64.jpg\n \n Then they attributed such features to the effect of winds! How can winds do such straight lines as seen from very high altitudes?\n \n &#8226; All this indicates that their knowledge about Mars is defective, and nobody can rule out the possibility of the existence of people on Mars. And the claim, of some that they have viewed all the surface of Mars and drawn some precise maps, such claim is not precisely correct. \n \n http://universeandquran.site.io/#The_planets_Are_Inhabited_\n \n An anticipated meeting between the inhabitants of Earth and the inhabitants of some other planets :\n \n http://universeandquran.site.io/new_page_2.htm#An_Anticipated_Meeting_\n \n \n eanassir\n http://universeandquran.site.io", 
   {
    "post_info": {
     "post_title": "Nobody can rule out the existence of people on Mars."
    }
   }, 
   null, 
   null, 
   1218903660.0
  ], 
  [
   320499, 
   null, 
   "charlie horse", 
   "There is life on Mars in the form of intelligent beings: people (and - although to this some do not agree: there are also demons or genies like those on Earth), in addition to animals and plants; with rivers, seas, mountains, forests, towns and cities.\n\n Your post title is: Nobody can rule out the existence of people on Mars. Then you make the assertion above which means you know that there IS intelligent life on Mars.\n \n But you didn't produce one piece of evidence in support of that assertion.\n \n What planet are YOU on, because it's not Earth?! emoticon_xkill", 
   {
    "unicode_changes_made": true
   }, 
   320498, 
   null, 
   1218905460.0
  ], 
  [
   320500, 
   null, 
   "eanassir", 
   "Your post title is: Nobody can rule out the existence of people on Mars. Then you make the assertion above which means you know that there IS intelligent life on Mars.\n \n But you didn't produce one piece of evidence in support of that assertion.\n \n What planet are YOU on, because it's not Earth?! emoticon_xkill\n\n \n It may be that they have not yet found any evidence of life; but none can say there isn't life there on Mars; many clews and hints and indications [as displayed in the post] point out that life there is more than a possibility; and I believe: yes, there is intelligent life there.\n And in addition, the atmosphere of Mars is clear, no smoke and turbidity as on Vensu, while on Mercury, the atmosphere is lost.", 
   {}, 
   320499, 
   null, 
   1218905880.0
  ], 
  [
   320516, 
   null, 
   "pandion", 
   "...many clews and hints and indications...\nSo they have found evidence that there were sailing ships on Mars at one time? Is that what you are saying?", 
   {}, 
   320500, 
   null, 
   1218913740.0
  ], 
  [
   320517, 
   null, 
   "charlie horse", 
   "It may be that they have not yet found any evidence of life; but none can say there isn't life there on Mars;\n\n Hang on a minute. First you're saying that there is intelligent life on Mars, then you're saying that they may not have found any evidence of life.\n \n Do you really expect to be taken seriously with mixed up posts like that?", 
   {}, 
   320500, 
   null, 
   1218914100.0
  ], 
  [
   320518, 
   null, 
   "GiantOreo", 
   "There is life on Mars in the form of intelligent beings: people (and - although to this some do not agree: there are also demons or genies like those on Earth), in addition to animals and plants; with rivers, seas, mountains, forests, towns and cities.\n \n The following points give the clew:\n \n \u0095 They have till now found ice on the two poles of Mars, water in frozen form, and cirrus cloud drifted by the wind.\n http://marsrovers.jpl.nasa.gov/spotlight/20080324_Opportunity.html \n \n Such cloud indicates that the atmosphere of Mars is not so thin; so that it bears the ice-bearing cloud at some high altitude and the wind comes to drift it.\n \n \n \u0095 They have taken photos of Mars, either from very high altitudes, or from the ground level; while if they take the images from the level of one hundred or two hundred meters: everything will be obvious. \n \n \u0095 I asked some astronomers at NASA, about the mountains of Mars, they answered:\n \n \"In general the southern hemisphere is the highlands of Mars and the northern hemisphere is the lowlands. \n The Tharsis province is a notable high volcanic chain, and the tallest volcano Olympus mons is nearby (27 km high and 600 km wide at the base). \n Other peaks in decreasing order of height are Ascraeus mons, Arsia mons, Pavonis mons, and Elysium mons--all of these are taller than Mt. Everest. \n You can see maps of the topography of Mars at the following link: http://ssed.gsfc.nasa.gov/tharsis/global_paper.html \"\n \n Therefore, all these mountains are taller than Mt. Everest, which may give an idea that Mars is in fact larger than Earth.\n \n The other thing is that their knowledge about Mars mountains is obviously defective: because where are the mountains less than Mt. Everest?\n \n Moreover, the tops of these mountains are covered by ice, then will not this ice !sublimate! as do they claim, specially if the atmosphere of Mars is allegedly thin? And how does such ice accumulate again?\n \n On Earth, the ice and rain will percolate in the ground and will come out in the form of water-springs on the slopes of the mountains and in the valleys in between them, and the streams of water will form tributaries and these will form the rivers that will flow from the mountains to the lower planes. \n \n Had they searched in the mountainous regions of Mars, they might have found water-springs, water-springs, and rivers in the valleys between these mountains and the plains below such mountains. \n \n But their search has been almost in the desert regions and the polar regions, which are almost without life. That is because their landing on the plain lands is easier than their landing on the mountainous regions.\n \n Moreover, if they use some sound records, they might discover some sounds like the cry of some birds and animals or other sounds. There is some set to record the sounds, but it has not been in use on Phoenix.\n \n \u0095 On Earth, their advanced technology enabled them to view the detailed features of the land and towns and may be people walking in the streets; but on Mars, it seems that such technology has been difficult to apply, and moreover, they descended their tools quickly, and cannot fly on some low or medium height to have better viewing of the surface features.\n \n Now see this link about an image of the Inka City, by Mariner 9\n http://nssdc.gsfc.nasa.gov/image/planetary/mars/mr9_inca_city.jpg \n \n And this is another image of this Inka City by, Viking 2\n http://nssdc.gsfc.nasa.gov/image/planetary/mars/f421b64.jpg\n \n Then they attributed such features to the effect of winds! How can winds do such straight lines as seen from very high altitudes?\n \n \u0095 All this indicates that their knowledge about Mars is defective, and nobody can rule out the possibility of the existence of people on Mars. And the claim, of some that they have viewed all the surface of Mars and drawn some precise maps, such claim is not precisely correct. \n \n http://universeandquran.site.io/#The_planets_Are_Inhabited_\n \n An anticipated meeting between the inhabitants of Earth and the inhabitants of some other planets :\n \n http://universeandquran.site.io/new_page_2.htm#An_Anticipated_Meeting_\n \n \n eanassir\n http://universeandquran.site.io\n\n \n And you can't rule out that Zeus or Coyote don't exist rather than your Allah. Get a grip dude.", 
   {
    "unicode_changes_made": true
   }, 
   320498, 
   null, 
   1218915000.0
  ], 
  [
   320562, 
   null, 
   "electrolyte", 
   "Nobody can rule out the existence of people on Mars.\n\n Two words: Russell's teapot.", 
   {}, 
   320498, 
   null, 
   1218953820.0
  ], 
  [
   320596, 
   null, 
   "Kronus", 
   "Two words: Russell's teapot.\n\n \n Not really applicable, is it? The whole point of the teapot is that it's defined as too small to see. Eanassir's \"point\" is that there are whole cities, forests, seas, etc on Mars, but we just haven't seen them because we haven't looked in the right place. An absurd assertion, of course, since we've photographed the entire surface of Mars. We can most definately rule out the existence of city dwelling people on Mars, because we've looked and would have seen them.", 
   {}, 
   320562, 
   null, 
   1219009680.0
  ], 
  [
   320603, 
   null, 
   "Archangel", 
   "Everyone who's in the know understands that the Martians are a subterranean civilization because of the thin atmosphere. You see, they extract oxygen from from the rock and artificially create gravity with a giant gyro in the center of the planet. It isn't powerful enough to effect surface gravity but it holds the Planet together from within. All of this was learned in \"The Three Stooges In Orbit\" .", 
   {}, 
   320596, 
   null, 
   1219014720.0
  ], 
  [
   320605, 
   null, 
   "Kronus", 
   "Obviously the Quran is way behind in understanding these obvious realities. All of this was learned in \"The Three Stooges In Orbit\" but obviously islam isn't up on this history.\n\n \n You just can't resist, can you?", 
   {}, 
   320603, 
   null, 
   1219015800.0
  ], 
  [
   320782, 
   null, 
   "eanassir", 
   "And you can't rule out that Zeus or Coyote don't exist rather than your Allah. Get a grip dude.\n\n \n God is synonym of Allah in Arabic and Yahweh in Hebrew and Khodah in Persian; He is the Most Gracious, the Creator and the All-Knowing; He is the Lord of all nations and worlds.", 
   {}, 
   320518, 
   null, 
   1219173240.0
  ], 
  [
   320783, 
   null, 
   "eanassir", 
   "So they have found evidence that there were sailing ships on Mars at one time? Is that what you are saying?\n\n \n What I am saying is that there are people on Mars, but they have not been yet discovered. There are cities and towns, there are seas and rivers, there are mountains and plains.\n \n Mars is different from our Moon, and different from either of Venus and Mercury.\n \n Moon has no water, no atmosphere and no life thereon.\n http://universeandquran.site.io/new_page_2.htm#The_Journey_to_Moon_\n \n \n Venus has stopped its axial rotation, and has undergone many serious changes concerning its atmosphere which became some thick smoke and mixture of gases, in addition to the increase in the temperature of the day-side that is continuously facing the Sun, and the extreme coldness and freezing of the other night-side; this has led to the extermination of life upon Venus.\n http://universeandquran.site.io/new_page_2.htm#The_Journey_to_Venus_Is_Dangerous_\n \n \n Mercury had stopped its axial rotation, a long time before Venus, and such serious changes in its atmosphere and the temperature extremity occurred before those on Venus. Then Mercury lost most of its atmosphere, because of the weakness of its gravity; then Mercury had been exposed to the falling of large numbers of comets upon it. And all such circumstances had led to the extermination of life upon Mercury.\n http://universeandquran.site.io/new_page_4.htm#Mercury_Has_Stopped_Its_Axial_Rotation \n \n http://universeandquran.site.io/new_page_4.htm#The_Burnt_World \n \n \n But the case is different for Mars: its atmosphere is clear, it includes the cloud drifted by the wind, there is the alternation of the night and day, and seasons, and the polar regions of Mars include water in the form of ice. \n \n Moreover, the high mountains include ice on their tops. And not all the planet is covered by ice. And certainly they have made many mistakes and have not yet discovered the life on Mars, which is expected to be known in the near future. \n http://universeandquran.site.io/new_page_2.htm#The_Journey_to_Mars_Is_Successful_\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   320516, 
   null, 
   1219173960.0
  ], 
  [
   320784, 
   null, 
   "eanassir", 
   "Two words: Russell's teapot.\n\n \n \n You are more worthy of this teapot; because you, and many others, have restricted their minds to some spoonfeeding of some scientific achievements and do not imagine there may be further advances.", 
   {}, 
   320562, 
   null, 
   1219175400.0
  ], 
  [
   320790, 
   null, 
   "eanassir", 
   " An absurd assertion, of course, since we've photographed the entire surface of Mars. We can most definately rule out the existence of city dwelling people on Mars, because we've looked and would have seen them.\n\n \n \n Refer to the first post here, and see this:\n \"On Earth, their advanced technology enabled them to view the detailed features of the land and towns and may be people walking in the streets; but on Mars, it seems that such technology has been difficult to apply, and moreover, they descended their tools quickly, and cannot fly on some low or medium height to have better viewing of the surface features.\"\n \n See also the link below about the cirrus cloud on Mars, which is like the cirrus feathery-like cloud of the Earth which is composed of ice crystals, and usually at very high altitudes in the Earth atmosphere.\n http://marsrovers.jpl.nasa.gov/spotlight/20080324_Opportunity.html\n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   320596, 
   null, 
   1219176660.0
  ], 
  [
   320793, 
   null, 
   "eanassir", 
   "...the Martians are a subterranean civilization because of the thin atmosphere. \n\n \n \n If it was true that the atmosphere of Mars is so thin as do they say, then how could it bear the cirrus cloud (with the ice crystals at some high altitude) there on Mars - like that on Earth? And the wind came to drift it as it is on Earth.\n http://marsrovers.jpl.nasa.gov/spotlight/20080324_Opportunity.html\n \n \n eanassir\n http://universeandquran.site.io", 
   {
    "unicode_changes_made": true
   }, 
   320603, 
   null, 
   1219177260.0
  ], 
  [
   320808, 
   null, 
   "charlie horse", 
   "What I am saying is that there are people on Mars, but they have not been yet discovered. There are cities and towns, there are seas and rivers, there are mountains and plains....\n\n If they haven't been discovered yet, HOW THE BLOODY HELL DO YOU KNOW?\n \n Ten percent more brains and you'd be pondlife. emoticon_xkill", 
   {}, 
   320783, 
   null, 
   1219182060.0
  ], 
  [
   320815, 
   null, 
   "Kronus", 
   "Refer to the first post here, and see this:\n \"On Earth, their advanced technology enabled them to view the detailed features of the land and towns and may be people walking in the streets; but on Mars, it seems that such technology has been difficult to apply, and moreover, they descended their tools quickly, and cannot fly on some low or medium height to have better viewing of the surface features.\"\n \n\n \n I'm sorry, I phrased my response in such a way that you quite reasonably thought I might want to discuss this with you. I don't, not even a little bit. Just letting you know.", 
   {}, 
   320790, 
   null, 
   1219185300.0
  ], 
  [
   320826, 
   null, 
   "Peeling", 
   "What I am saying is that there are people on Mars, but they have not been yet discovered.\n\n You might be right, but nothing you've quoted makes that anything other than a guess.\n \n \nThere are cities and towns\n\n Certainly there are no such things on the surface. Mars has been fairly exhaustively mapped from orbit and any such features would have been clearly visible.\n \nthere are seas and rivers,\n\n There's some evidence of brief eruptions or flows of something, but again, there are no seas or rivers. There may well once have been, but no more.\n \nVenus has stopped its axial rotation, and has undergone many serious changes concerning its atmosphere which became some thick smoke and mixture of gases, in addition to the increase in the temperature of the day-side that is continuously facing the Sun, and the extreme coldness and freezing of the other night-side; this has led to the extermination of life upon Venus.\n\n This is more or less entirely wrong. Venus has not stopped its axial rotation, and the temperature on the night and day sides are pretty much the same.\n \nAnd all such circumstances had led to the extermination of life upon Mercury.\n\n Assuming, of course, life arose there in the first place.\n \nBut the case is different for Mars: its atmosphere is clear, it includes the cloud drifted by the wind, there is the alternation of the night and day, and seasons, and the polar regions of Mars include water in the form of ice. \n\n True, but misleading. The polar regions of Mars also include frozen carbon dioxide, it's that cold. The atmosphere is thin and extremely oxygen-poor. It would not be possible for something with, say, a brain (with all its attendant energy needs) to survive there.\n \nIf it was true that the atmosphere of Mars is so thin as do they say, then how could it bear the cirrus cloud (with the ice crystals at some high altitude) there on Mars - like that on Earth? And the wind came to drift it as it is on Earth.\n\n The question is moot because the atmospheric pressure and composition has been directly measured by martian landers. You're arguing against empirically established fact, which is never a good start :)", 
   {
    "unicode_changes_made": true
   }, 
   320793, 
   null, 
   1219190760.0
  ], 
  [
   321604, 
   null, 
   "eanassir", 
   "If they haven't been discovered yet, HOW THE BLOODY HELL DO YOU KNOW?\n \n Ten percent more brains and you'd be pondlife. emoticon_xkill\n\n \n Certainly, there is some need for ten percent more brain; because my words are clear, but only you want to get some plea. \n \n The meaning is very clear; the life on Mars is almost there; because of the clear atmosphere, the existence of water, the alternation of the day and night, the seasons. The Martian axis is different from that of Earth by 1.7 degrees inclination which may counteract for the more distance of Mars from the sun in comparison to the distance of Earth from the Sun.\n \n In addition, if the temperature of yesterday was -21 in a region that is near the north pole, will this temperature be the same at the equator, or at the intermediate regions?\n \n Moreover, logically such a large planet with all these criteria, and more may be yet unknown; will this vast planet be left without creating life on it, while the earth have been filled with the large number of human beings belonging to the four human races, in addition to the animals and plants? \n \n God created not the planets of the solar system in vain, but to bear the various kinds of living being; I say this in spite of the atheists and their denial; and He created the solar system and will fulfill His promise by destroying this solar system in the next Doomsday.\n \n This is in the Quran 3: 190-191\n &#1573;&#1616;&#1606;&#1617;&#1614; &#1601;&#1616;&#1610; &#1582;&#1614;&#1604;&#1618;&#1602;&#1616; &#1575;&#1604;&#1587;&#1617;&#1614;&#1605;&#1614;&#1575;&#1608;&#1614;&#1575;&#1578;&#1616; &#1608;&#1614;&#1575;&#1604;&#1571;&#1614;&#1585;&#1618;&#1590;&#1616; &#1608;&#1614;&#1575;&#1582;&#1618;&#1578;&#1616;&#1604;&#1575;&#1614;&#1601;&#1616; &#1575;&#1604;&#1604;&#1617;&#1614;&#1610;&#1618;&#1604;&#1616; &#1608;&#1614;&#1575;&#1604;&#1606;&#1617;&#1614;&#1607;&#1614;&#1575;&#1585;&#1616; &#1604;&#1570;&#1610;&#1614;&#1575;&#1578;&#1613; &#1604;&#1617;&#1616;&#1571;&#1615;&#1608;&#1618;&#1604;&#1616;&#1610; &#1575;&#1604;&#1571;&#1604;&#1618;&#1576;&#1614;&#1575;&#1576;&#1616; . &#1610;&#1614;&#1578;&#1614;&#1601;&#1614;&#1603;&#1617;&#1614;&#1585;&#1615;&#1608;&#1606;&#1614; &#1601;&#1616;&#1610; &#1582;&#1614;&#1604;&#1618;&#1602;&#1616; &#1575;&#1604;&#1587;&#1617;&#1614;&#1605;&#1614;&#1575;&#1608;&#1614;&#1575;&#1578;&#1616; &#1608;&#1614;&#1575;&#1604;&#1571;&#1614;&#1585;&#1618;&#1590;&#1616; &#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1605;&#1614;&#1575; &#1582;&#1614;&#1604;&#1614;&#1602;&#1618;&#1578;&#1614; &#1607;&#1614;&#1584;&#1575; &#1576;&#1614;&#1575;&#1591;&#1616;&#1604;&#1575;&#1611; &#1587;&#1615;&#1576;&#1618;&#1581;&#1614;&#1575;&#1606;&#1614;&#1603;&#1614; ...&#1575;&#1604;&#1582;\n The explanation:\n (There &#8211; in the creation of the heavens and the earth [: the planets including the Earth], and the alternation of the night and the day &#8211; are indicative signs [of a Wise Creator Who created them perfectly] to men having discerning hearts.\n \n [Those] who remember God when they stand up, sit down and recline, and contemplate in the creation of the heavens and the earth [: the planets including the Earth], [then say]: \"Our Lord, not in vain have You created this [universe!] Glory be to You!)\n \n \n In addition, all this is confirmed by many ayat of the Glorious Quran indicating the existence of life on the planets: in the form of humans, animals and plants.\n http://universeandquran.site.io/#The_planets_Are_Inhabited_\n http://universeandquran.site.io/new_page_2.htm#An_Anticipated_Meeting_\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   320808, 
   null, 
   1219868940.0
  ], 
  [
   321607, 
   null, 
   "eanassir", 
   "I'm sorry, I phrased my response in such a way that you quite reasonably thought I might want to discuss this with you. I don't, not even a little bit. Just letting you know.\n\n \n \n You will be more sorry in the afterlife. Don't think that I wish to discuss such an idea with you; but because it is said, I should refute it before others.", 
   {}, 
   320815, 
   null, 
   1219870560.0
  ], 
  [
   321610, 
   null, 
   "Kronus", 
   "You will be more sorry in the afterlife. Don't think that I wish to discuss such an idea with you; but because it is said, I should refute it before others.\n\n \n Just to clarify what I think is a misunderstanding. I have no problem with your religion. It's your ideas about life on Mars that I have no desire to discuss with you.", 
   {}, 
   321607, 
   null, 
   1219872840.0
  ], 
  [
   322146, 
   null, 
   "charlie horse", 
   "The meaning is very clear; the life on Mars is almost there; because of the clear atmosphere, the existence of water, the alternation of the day and night, the seasons. The Martian axis is different from that of Earth by 1.7 degrees inclination which may counteract for the more distance of Mars from the sun in comparison to the distance of Earth from the Sun.\n\n You really don't know what you're talking about, do you? First there's life on Mars, then it's almost there. Then it's there but not proven. Why are you so keen to want life on Mars? Long-lost relatives?\n \n \nIn addition, if the temperature of yesterday was -21 in a region that is near the north pole, will this temperature be the same at the equator, or at the intermediate regions?\n\n Probably not. What does it matter? Why do you want to know?\n \n \nMoreover, logically such a large planet with all these criteria, and more may be yet unknown; will this vast planet be left without creating life on it, while the earth have been filled with the large number of human beings belonging to the four human races, in addition to the animals and plants? \n\n You haven't established any criteria suitable for life on Mars. Trying to draw a parallel with Earth is not logical. Who are the four human races?\n \n Don't forget, quoting from your holy book to support what you and your holy book say is invalid.", 
   {}, 
   321604, 
   null, 
   1220293920.0
  ], 
  [
   322170, 
   null, 
   "eanassir", 
   "You really don't know what you're talking about, do you? First there's life on Mars, then it's almost there. Then it's there but not proven. Why are you so keen to want life on Mars? Long-lost relatives?\n \n\n \n I know what I am talking about, and you know, but only you want to wrangle. And why do you want to contradict that?\n \n \n\n Probably not. What does it matter? Why do you want to know?\n \n\n \n What does it matter; it matters in order to disprove the atheist: to see there are people in other parts of the universe, who know God and worship Him; but they do not know Moses, Jesus or Mohammed, and so there is no need to be enthusiastic about Jesus and others; they are not essential part of the universe, but they are only some righteous prophets.\n \n \n\n You haven't established any criteria suitable for life on Mars. Trying to draw a parallel with Earth is not logical. Who are the four human races?\n \n\n \n The four human races are: the Black [:the Africans], the Yellow [the Chinese], the Red [Indians] and the White [Caucasian].\n http://universeandquran.site.io/new_page_2.htm#The_four_human_races\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   322146, 
   null, 
   1220308440.0
  ], 
  [
   322185, 
   null, 
   "charlie horse", 
   "I know what I am talking about, and you know, but only you want to wrangle. And why do you want to contradict that?\n\n Contradict what? Thank you for acknowledging that I know what I'm talking about. I call it questioning. You call it wrangling because you've no coherent thoughts of your own.\n \n \nWhat does it matter; it matters in order to disprove the atheist: to see there are people in other parts of the universe, who know God and worship Him; but they do not know Moses, Jesus or Mohammed, and so there is no need to be enthusiastic about Jesus and others; they are not essential part of the universe, but they are only some righteous prophets.\n\n This is just barking nonsense. You don't have to only disprove atheists - not that the issue of life on Mars has anything to do with atheism - but you need to prove your point against the rest of humanity that has any semblance of common sense. So at the moment you're probably billions to one against.\n \n \nThe four human races are: the Black [:the Africans], the Yellow [the Chinese], the Red [Indians] and the White [Caucasian].\n http://universeandquran.site.io/new_page_2.htm#The_four_human_races\n \n\n Over-simplified and typologically-discredited 19th C. human classifications. And you forgot Esquimaux (Inuits).", 
   {}, 
   322170, 
   null, 
   1220311800.0
  ], 
  [
   322188, 
   null, 
   "eanassir", 
   " Contradict what? Thank you for acknowledging that I know what I'm talking about. I call it questioning. You call it wrangling because you've no coherent thoughts of your own.\n \n \n This is just barking nonsense. You don't have to only disprove atheists - not that the issue of life on Mars has anything to do with atheism - but you need to prove your point against the rest of humanity that has any semblance of common sense. So at the moment you're probably billions to one against.\n \n\n \n To your barking nonsense, I shall not answer.\n \n \n\n Over-simplified and typologically-discredited 19th C. human classifications. And you forgot Esquimaux (Inuits). \n\n \n The Esquimaux belong to the Yellow or Mongolian human race.\n http://universeandquran.site.io/new_page_2.htm#The_four_human_races\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   322185, 
   null, 
   1220314080.0
  ], 
  [
   322238, 
   null, 
   "charlie horse", 
   "To your barking nonsense, I shall not answer.\n\n In other words, without your holy book, you can't answer.\n \n \nThe Esquimaux belong to the Yellow or Mongolian human race.\n http://universeandquran.site.io/new_page_2.htm#The_four_human_races\n\n Your holy book is not valid.\n race\n \n Term sometimes applied to a physically distinctive group of people, on the basis of their difference from other groups in skin colour, head shape, hair type, and physique. Formerly, anthropologists divided the human race into three hypothetical racial groups: Caucasoid, Mongoloid, and Negroid. Others postulated from 6 to 30 races. Scientific studies, however, have produced no proof of definite genetic racial divisions. Race is a cultural, political, and economic concept, not a biological one. Genetic differences do exist between populations but they do not define historical lineages, and are minimal compared to the genetic variation between individuals. Most anthropologists today, therefore, completely reject the concept of race, and social scientists tend to prefer the term 'ethnic group' (see ethnicity).\n \n Notice how race is now defined.", 
   {
    "unicode_changes_made": true
   }, 
   322188, 
   null, 
   1220367900.0
  ], 
  [
   322289, 
   null, 
   "CUNxTime", 
   "There is life on Mars in the form of intelligent beings: people (and - although to this some do not agree: there are also demons or genies like those on Earth), in addition to animals and plants; with rivers, seas, mountains, forests, towns and cities.\n \n The following points give the clew:\n \n \u0095 They have till now found ice on the two poles of Mars, water in frozen form, and cirrus cloud drifted by the wind.\n http://marsrovers.jpl.nasa.gov/spotlight/20080324_Opportunity.html \n \n Such cloud indicates that the atmosphere of Mars is not so thin; so that it bears the ice-bearing cloud at some high altitude and the wind comes to drift it.\n \n \n \u0095 They have taken photos of Mars, either from very high altitudes, or from the ground level; while if they take the images from the level of one hundred or two hundred meters: everything will be obvious. \n \n \u0095 I asked some astronomers at NASA, about the mountains of Mars, they answered:\n \n \"In general the southern hemisphere is the highlands of Mars and the northern hemisphere is the lowlands. \n The Tharsis province is a notable high volcanic chain, and the tallest volcano Olympus mons is nearby (27 km high and 600 km wide at the base). \n Other peaks in decreasing order of height are Ascraeus mons, Arsia mons, Pavonis mons, and Elysium mons--all of these are taller than Mt. Everest. \n You can see maps of the topography of Mars at the following link: http://ssed.gsfc.nasa.gov/tharsis/global_paper.html \"\n \n Therefore, all these mountains are taller than Mt. Everest, which may give an idea that Mars is in fact larger than Earth.\n \n The other thing is that their knowledge about Mars mountains is obviously defective: because where are the mountains less than Mt. Everest?\n \n Moreover, the tops of these mountains are covered by ice, then will not this ice !sublimate! as do they claim, specially if the atmosphere of Mars is allegedly thin? And how does such ice accumulate again?\n \n On Earth, the ice and rain will percolate in the ground and will come out in the form of water-springs on the slopes of the mountains and in the valleys in between them, and the streams of water will form tributaries and these will form the rivers that will flow from the mountains to the lower planes. \n \n Had they searched in the mountainous regions of Mars, they might have found water-springs, water-springs, and rivers in the valleys between these mountains and the plains below such mountains. \n \n But their search has been almost in the desert regions and the polar regions, which are almost without life. That is because their landing on the plain lands is easier than their landing on the mountainous regions.\n \n Moreover, if they use some sound records, they might discover some sounds like the cry of some birds and animals or other sounds. There is some set to record the sounds, but it has not been in use on Phoenix.\n \n \u0095 On Earth, their advanced technology enabled them to view the detailed features of the land and towns and may be people walking in the streets; but on Mars, it seems that such technology has been difficult to apply, and moreover, they descended their tools quickly, and cannot fly on some low or medium height to have better viewing of the surface features.\n \n Now see this link about an image of the Inka City, by Mariner 9\n http://nssdc.gsfc.nasa.gov/image/planetary/mars/mr9_inca_city.jpg \n \n And this is another image of this Inka City by, Viking 2\n http://nssdc.gsfc.nasa.gov/image/planetary/mars/f421b64.jpg\n \n Then they attributed such features to the effect of winds! How can winds do such straight lines as seen from very high altitudes?\n \n \u0095 All this indicates that their knowledge about Mars is defective, and nobody can rule out the possibility of the existence of people on Mars. And the claim, of some that they have viewed all the surface of Mars and drawn some precise maps, such claim is not precisely correct. \n \n http://universeandquran.site.io/#The_planets_Are_Inhabited_\n \n An anticipated meeting between the inhabitants of Earth and the inhabitants of some other planets :\n \n http://universeandquran.site.io/new_page_2.htm#An_Anticipated_Meeting_\n \n \n eanassir\n http://universeandquran.site.io\n\n \n \n Dude, are you for real? Or is this a joke?!?!?!", 
   {
    "unicode_changes_made": true
   }, 
   320498, 
   null, 
   1220381880.0
  ], 
  [
   322301, 
   null, 
   "charlie horse", 
   "That's the $64000 question.", 
   {}, 
   322289, 
   null, 
   1220385180.0
  ], 
  [
   322324, 
   null, 
   "sinjin", 
   "http://www.marsdaily.com/images/nasa-mars-mro-victoria-crater-section-desktop-1280.jpg\n \n \"Victoria Crater is roughly 800 meters (one-half mile) wide\"\n http://commons.wikimedia.org/wiki/Image:Victoria_Crater,_Cape_Verde-Mars.jpg", 
   {}, 
   322301, 
   null, 
   1220395140.0
  ], 
  [
   322345, 
   null, 
   "Peeling", 
   "Therefore, all these mountains are taller than Mt. Everest, which may give an idea that Mars is in fact larger than Earth.\n \n The other thing is that their knowledge about Mars mountains is obviously defective: because where are the mountains less than Mt. Everest?\n\n I missed these the first time around. I find it fascinating how fundamentally different another person's thought processes can be from my own.\n \n Eanassir, I have to ask: why do you think the size of a mountain casts doubt on the established size of the planet upon which it stands? I mean, we've observed mars a zillion times, measured its size, distance, orbit, velocity - everything. If Mars were really bigger than Earth, everything we've put into orbit around it would right now be trying to revolve a thousand kilometres or so under the ground. How in the world do you manage to avoid realising that?\n \n The latter argument is equally bizarre. 'Where are the mountains less than Mt. Everest?' I mean, how many of earth's thousands of mountains can anyone here name? Not a significant percentage, probably - does that mean they haven't been mapped? We hear about the really big ones on mars because they're taller than Everest, not because they're the only ones we've examined. It's just so simple and obvious; it utterly blows my mind that you don't think like that! I stand, in all honesty, agog.", 
   {}, 
   322324, 
   null, 
   1220403060.0
  ], 
  [
   322520, 
   null, 
   "eanassir", 
   "\n Eanassir, I have to ask: why do you think the size of a mountain casts doubt on the established size of the planet upon which it stands? I mean, we've observed mars a zillion times, measured its size, distance, orbit, velocity - everything. If Mars were really bigger than Earth, everything we've put into orbit around it would right now be trying to revolve a thousand kilometres or so under the ground. How in the world do you manage to avoid realising that?\n \n\n \n It can be that a small planet may include the largest mountains; but I think it is generally reasonable that the large planet almost includes the largest mountains (although not necessarily). \n \n A very large planet is usually expected (although not necessarily) to include huge mountainous chains, and here I may expect to find some winged human race; such wings may be essential for such tremendous mountainous planets. They usually used it lest they should be killed when they fall down (like the hen), but they may not be able to fly with such wings because of their heavy material bodies.\n \n This may explain why some  Angels have two wings like the eagle wings; it may be they used such wings on the past planets that were destroyed in the previous Doomsdays. \n http://man-after-death.site.io/1.htm#Angels_\n \n \n \n\n The latter argument is equally bizarre. 'Where are the mountains less than Mt. Everest?' I mean, how many of earth's thousands of mountains can anyone here name? Not a significant percentage, probably - does that mean they haven't been mapped? We hear about the really big ones on mars because they're taller than Everest, not because they're the only ones we've examined. It's just so simple and obvious; it utterly blows my mind that you don't think like that! I stand, in all honesty, agog. \n\n \n I wanted only to display their defective knowledge about Mars; i.e. they don't know completely all the surface geography of Mars.\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   322345, 
   null, 
   1220556180.0
  ], 
  [
   322523, 
   null, 
   "charlie horse", 
   "I honestly don't know how anybody has the resolve to persist with this nonsense. :xbanghead", 
   {}, 
   322520, 
   null, 
   1220556840.0
  ], 
  [
   322524, 
   null, 
   "Kronus", 
   "It can be that a small planet may include the largest mountains; but I think it is generally reasonable that the large planet almost includes the largest mountains (although not necessarily). \n\n \n I know I said I was going to stay out of this, but this is such a perfect example of how off base this whole discussion is. \n \n In point of fact, the exact opposite of what is said here is true. You would get larger mountains on smaller planets. Everest is the biggest possible mountain on earth, it is impossible to get a mountain any larger. The mass of everest is so great that it is melting the rock under its base. If you made everest any bigger it would simply melt more of its base and sink. The only way you could have a larger mountain is to go somewhere where the mountain would weigh less; which is to say a planet with less gravity. In other words, a smaller planet. A planet with bigger mountains than earth will be a smaller planet.\n \n And of course that whole argument only illustrates the ironic way in which the assertion is wrong, not the blatant way. That way being the fact that we've measured mars, we've measured earth, and we know earth is bigger. Mars has a diameter of 6787 kilometers, earth 12756. End of story. This is sort of like saying that a kilometer is longer than a mile because \"kilometer\" has more letters than \"mile\". You can debate about how that argument fails, or you can just point to a kilometer and a mile.", 
   {}, 
   322520, 
   null, 
   1220557980.0
  ], 
  [
   322529, 
   null, 
   "eanassir", 
   "\n In other words, without your holy book, you can't answer.\n Your holy book is not valid.\n \n\n \n The Quran is the word of God; it gives the instruction, guidance and insight:\n God-be exalted- said in the Quran, chapter 5: 15-16\n &#1610;&#1614;&#1575; &#1571;&#1614;&#1607;&#1618;&#1604;&#1614; &#1575;&#1604;&#1618;&#1603;&#1616;&#1578;&#1614;&#1575;&#1576;&#1616; &#1602;&#1614;&#1583;&#1618; &#1580;&#1614;&#1575;&#1569;&#1603;&#1615;&#1605;&#1618; &#1585;&#1614;&#1587;&#1615;&#1608;&#1604;&#1615;&#1606;&#1614;&#1575; &#1610;&#1615;&#1576;&#1614;&#1610;&#1617;&#1616;&#1606;&#1615; &#1604;&#1614;&#1603;&#1615;&#1605;&#1618; &#1603;&#1614;&#1579;&#1616;&#1610;&#1585;&#1611;&#1575; &#1605;&#1617;&#1616;&#1605;&#1617;&#1614;&#1575; &#1603;&#1615;&#1606;&#1578;&#1615;&#1605;&#1618; &#1578;&#1615;&#1582;&#1618;&#1601;&#1615;&#1608;&#1606;&#1614; &#1605;&#1616;&#1606;&#1614; &#1575;&#1604;&#1618;&#1603;&#1616;&#1578;&#1614;&#1575;&#1576;&#1616; &#1608;&#1614;&#1610;&#1614;&#1593;&#1618;&#1601;&#1615;&#1608; &#1593;&#1614;&#1606; &#1603;&#1614;&#1579;&#1616;&#1610;&#1585;&#1613; &#1602;&#1614;&#1583;&#1618; &#1580;&#1614;&#1575;&#1569;&#1603;&#1615;&#1605; &#1605;&#1617;&#1616;&#1606;&#1614; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1606;&#1615;&#1608;&#1585;&#1612; &#1608;&#1614;&#1603;&#1616;&#1578;&#1614;&#1575;&#1576;&#1612; &#1605;&#1617;&#1615;&#1576;&#1616;&#1610;&#1606;&#1612; . &#1610;&#1614;&#1607;&#1618;&#1583;&#1616;&#1610; &#1576;&#1616;&#1607;&#1616; &#1575;&#1604;&#1604;&#1617;&#1607;&#1615; &#1605;&#1614;&#1606;&#1616; &#1575;&#1578;&#1617;&#1614;&#1576;&#1614;&#1593;&#1614; &#1585;&#1616;&#1590;&#1618;&#1608;&#1614;&#1575;&#1606;&#1614;&#1607;&#1615; &#1587;&#1615;&#1576;&#1615;&#1604;&#1614; &#1575;&#1604;&#1587;&#1617;&#1614;&#1604;&#1575;&#1614;&#1605;&#1616; &#1608;&#1614;&#1610;&#1615;&#1582;&#1618;&#1585;&#1616;&#1580;&#1615;&#1607;&#1615;&#1605; &#1605;&#1617;&#1616;&#1606;&#1616; &#1575;&#1604;&#1592;&#1617;&#1615;&#1604;&#1615;&#1605;&#1614;&#1575;&#1578;&#1616; &#1573;&#1616;&#1604;&#1614;&#1609; &#1575;&#1604;&#1606;&#1617;&#1615;&#1608;&#1585;&#1616; &#1576;&#1616;&#1573;&#1616;&#1584;&#1618;&#1606;&#1616;&#1607;&#1616; &#1608;&#1614;&#1610;&#1614;&#1607;&#1618;&#1583;&#1616;&#1610;&#1607;&#1616;&#1605;&#1618; &#1573;&#1616;&#1604;&#1614;&#1609; &#1589;&#1616;&#1585;&#1614;&#1575;&#1591;&#1613; &#1605;&#1617;&#1615;&#1587;&#1618;&#1578;&#1614;&#1602;&#1616;&#1610;&#1605;&#1613;\n The explanation: \n (O people of the Scripture [:Jews and Christians], now has Our messenger[, Mohammed,] come expounding to you many things in the Scripture that you have been hiding, and many things else he disregards. \n There has come to you light from God and a clear 'Book'[: the Quran.]\n \n Whereby God guides him who seeks His good pleasure to the paths of safety, and brings them out of darkness to light with His leave, and guides them to a standard path [of monotheism.] )\n \n http://quranandhebrewbible.t35.com/english2.htm#A_Call_from_God_to_the_People_of_the_Scripture_\n \n \n \n\n Race\n Term sometimes applied to a physically distinctive group of people, on the basis of their difference from other groups in skin colour, head shape, hair type, and physique. \n Formerly, anthropologists divided the human race into three hypothetical racial groups: Caucasoid, Mongoloid, and Negroid. Others postulated from 6 to 30 races. \n Scientific studies, however, have produced no proof of definite genetic racial divisions. \n Race is a cultural, political, and economic concept, not a biological one. Genetic differences do exist between populations but they do not define historical lineages, and are minimal compared to the genetic variation between individuals. \n Most anthropologists today, therefore, completely reject the concept of race, and social scientists tend to prefer the term 'ethnic group' (see ethnicity).\n \n\n \n \n All these four races are human beings with the same chromosomal number; they have their rights and no discrimination between them; only they differ according to their God-fearing and piety.\n \n But each of these human races has distinct features, and has a particular father from whom they descended, then they mixed among them by intermarriage. \n \n http://universeandquran.site.io/new_page_2.htm#The_four_human_races\n \n \n eanassir\n http://universeandquran.site.io\n http://quranandhebrewbible.t35.com", 
   {
    "unicode_changes_made": true
   }, 
   322238, 
   null, 
   1220559540.0
  ], 
  [
   322533, 
   null, 
   "eanassir", 
   "\n In point of fact, the exact opposite of what is said here is true. You would get larger mountains on smaller planets. Everest is the biggest possible mountain on earth, it is impossible to get a mountain any larger. The mass of everest is so great that it is melting the rock under its base. If you made everest any bigger it would simply melt more of its base and sink. The only way you could have a larger mountain is to go somewhere where the mountain would weigh less; which is to say a planet with less gravity. In other words, a smaller planet. A planet with bigger mountains than earth will be a smaller planet.\n \n\n \n Most of the mountains on Earth (and in like manner the mountains on the planets) are not from the Earth in origin; but God &#8211; be glorified &#8211; cast them on Earth (and the other planets) from the outer space; they were the parts of the previous planets that had been destroyed in the previous Doomsday. \n http://universeandquran.site.io/new_page_2.htm#Mountains\n \n The casting of the broken-up parts of the past planets took place after elapsing of two thousand years from the explosion of the past sun with its planets; i.e. in the next four thousand years of the formation of the Earth and the rest of the present planets. The formation of the Earth togethter with the planets and the gaseous layers above them took six thousand years, so that the crust was formed and then the mountains fell down on the earth and the planets.\n \n http://universeandquran.site.io/#Formation_of_the_Planets_\n http://universeandquran.site.io/#Formation_of_the_Earth\n \n \n \n\n That way being the fact that we've measured mars, we've measured earth, and we know earth is bigger. Mars has a diameter of 6787 kilometers, earth 12756. End of story.\n\n \n Is there any rule for the arrangement of the planets in relation to their distances from the Sun, or are the planets arrayed haphazardly?\n In fact the planets are arrayed around the Sun according to their masses: the smaller (: Mercury) will be nearer to the Sun, and the bigger (Neptune) will be the farthest from the Sun. And so on the rest of the planets are arrayed according to their masses.\n See here a simple experiment to prove this idea:\n http://universeandquran.site.io/new_page_2.htm#Why_the_planet_is_near_or_far_from_the_sun\n \n Moreover, the story has not ended; many measurements will prove unrealistic and not correct.\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   322524, 
   null, 
   1220561280.0
  ], 
  [
   322537, 
   null, 
   "Kronus", 
   "And I'm out again! emoticon_xbye", 
   {}, 
   322533, 
   null, 
   1220562660.0
  ], 
  [
   322549, 
   null, 
   "sinjin", 
   "Most of the mountains on Earth (and in like manner the mountains on the planets) are not from the Earth in origin; but God &#8211; be glorified &#8211; cast them on Earth (and the other planets) from the outer space; they were the parts of the previous planets that had been destroyed in the previous Doomsday.\n\n How do you say \"balderdash\" in Arabic?\n \n \nIs there any rule for the arrangement of the planets in relation to their distances from the Sun, or are the planets arrayed haphazardly?\n In fact the planets are arrayed around the Sun according to their masses: the smaller (: Mercury) will be nearer to the Sun, and the bigger (Neptune) will be the farthest from the Sun. And so on the rest of the planets are arrayed according to their masses.\nWhat about Mars? What's the mass of Mars?\n \n \nA very large planet is usually expected (although not necessarily) to include huge mountainous chains, and here I may expect to find some winged human race; such wings may be essential for such tremendous mountainous planets. They usually used it lest they should be killed when they fall down (like the hen), but they may not be able to fly with such wings because of their heavy material bodies.\n \n This may explain why some  Angels have two wings like the eagle wings; it may be they used such wings on the past planets that were destroyed in the previous Doomsdays. \nWinged human races on mountainous planets? Seek psychiatric help immediately.", 
   {}, 
   322533, 
   null, 
   1220568540.0
  ], 
  [
   322558, 
   null, 
   "Peeling", 
   "It can be that a small planet may include the largest mountains; but I think it is generally reasonable that the large planet almost includes the largest mountains (although not necessarily).\n\n As Kronus pointed out, quite the reverse is the case. But that's not really the point.\n \n We know how big mars is, and how massive. Do you really think we'd be able to put landers on its surface and satellites into its orbit across fifty million miles of space if we were wrong about basic stuff like that? I hate to cause offense, but don't you think it says something about your grasp of the subject that the moment someone mentions mars having a bigger mountain, you zoom off on this flight of fancy about the whole planet being bigger? It's all a bit chaotic, you know?\n \nThis may explain why some  Angels have two wings like the eagle wings; it may be they used such wings on the past planets that were destroyed in the previous Doomsdays. \n\n You know, I think there may be a simpler explanation for that.\n \nI wanted only to display their defective knowledge about Mars; i.e. they don't know completely all the surface geography of Mars.\n\n But they do! They've surveyed the entire surface. In the process, they found some mountains that were notable for being taller than the tallest mountain on earth, as well as plenty that weren't. Mountains that aren't as high as Everest aren't newsworthy.\n \nIs there any rule for the arrangement of the planets in relation to their distances from the Sun, or are the planets arrayed haphazardly?\n In fact the planets are arrayed around the Sun according to their masses: the smaller (: Mercury) will be nearer to the Sun, and the bigger (Neptune) will be the farthest from the Sun. And so on the rest of the planets are arrayed according to their masses.\n\n Yes. Well, actually no. Not even slightly.\n \nSee here a simple experiment to prove this idea:\n http://universeandquran.site.io/new_page_2.htm#DIAGRAM_\n\n It's a marvellous read, but it's just so wrong in so many ways.", 
   {}, 
   322533, 
   null, 
   1220572680.0
  ], 
  [
   322628, 
   null, 
   "eanassir", 
   "And I'm out again! emoticon_xbye\n\n \n \n emoticon_xbye\n See you again; I hate to say good-bye. :)", 
   {}, 
   322537, 
   null, 
   1220598900.0
  ], 
  [
   322629, 
   null, 
   "eanassir", 
   "\n What about Mars? What's the mass of Mars?\n \n\n \n Is there any rule for the arrangement of the planets around the sun?\n Or the planets have been arrayed haphazardly? This can't be scientific in any way.\n \n The two factors in causing the distance of a planet away from the sun are:\n 1- the mass of the planet.\n 2- the heat of the planet (the most important is the heat in the core of the planet).\n http://universeandquran.site.io/new_page_2.htm#Why_the_planet_is_near_or_far_from_the_sun\n \n \n \n\n Winged human races on mountainous planets? Seek psychiatric help immediately.\n\n \n Why do you rule out the possibility of such a thing? Don't you see how life has various forms and kinds on our Earth? And see the differences between the four human races in color and shape and some body peculiarities; this is on our Earth, then what about the rest of the planets?\n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   322549, 
   null, 
   1220600400.0
  ], 
  [
   322630, 
   null, 
   "eanassir", 
   "\n Yes. Well, actually no. Not even slightly.\n \n\n \n As I said to sinjin:\n \n Is there any rule for the arrangement of the planets around the sun?\n Or the planets have been arrayed haphazardly? This can't be scientific in any way.\n \n The two factors in causing the distance of a planet away from the sun are:\n 1- the mass of the planet.\n 2- the heat of the planet (the most important is the heat in the core of the planet).\n http://universeandquran.site.io/new_page_2.htm#Why_the_planet_is_near_or_far_from_the_sun \n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   322558, 
   null, 
   1220601060.0
  ], 
  [
   322631, 
   null, 
   "T.Q", 
   "Dude, you're cracked. I'm sorry, but you have yet to post one thing that even approaches correctness on this board.\n \n I suggest everyone stop feeding the loon.", 
   {}, 
   322630, 
   null, 
   1220602740.0
  ], 
  [
   322636, 
   null, 
   "charlie horse", 
   "I suggest everyone stop feeding the loon.\n\n Or troll. :xbanghead", 
   {}, 
   322631, 
   null, 
   1220614140.0
  ], 
  [
   322638, 
   null, 
   "Peeling", 
   "Ok, let's go through the page you keep linking to step by step. Bear with me; this may take a little time.\n \nKnow, then, that the cause of the gravity is the heat, and the cause of the heat is the movement. This may be explained by this test:\n \n Take a large piece of amber or sandarac [or plastic] or other things with similar properties, and start to rub it continuously with a piece of wool, you will find that it has become hot because of the successive movements, then put it on a small piece of straw, you will see that piece attract the straw; because that piece [of amber or plastic] has got a gravitational force, because of the heat obtained from the rubbing.\n\n This can very easily be shown to be false.\n \n First of all, try putting the same amber or plastic in boiling hot water and removing it. You will see that despite the heat of the piece of amber or plastic (which is much greater than you obtain via rubbing), it does not attract other objects.\n \n This is because it is the static electric charge produced by the rubbing, and not the heat, causing the attraction. Try rubbing a balloon on your hair: it will stick to the ceiling or wall for some considerable time, long after the small amount of heat generated has dissipated.\n \n Thus we establish that the founding principle upon which the rest of your model is based is in error.\n \n1- Take a pot, put some water in it and heat it till boiling, then pour the water into another pot containing cold water. Put your hand into it and you will find the hot water rising above the cold water; that is because the gravity [of the earth] influences the cold more than the hot object.\n\n This is incorrect. Hot water is not lighter than cold water, it is merely less dense (the same quantity of mass occupying a larger volume). It is this difference in density that causes the hot water to float above the cold.\n \n Direct proof that you are wrong: take an ice cube and place it in water. You will observe that it floats, contradicting your claim that it should sink because it is colder. Now fill a plastic bottle to the brim with water and place it in the freezer without the cap on. You will see that when it freezes the ice pushes up out of the bottle: it gets larger. Since the amount of water in the bottle has not changed, this shows that ice is less dense than water.\n \n The same explanation holds true for water vapour, rain, and the hot gases rising from a fire. Smoke particles are, like sand in a sandstorm, carried along by the movement of the hot gases as they rise; they are not themselves ever lighter than air.\n \n Again, the observation is that your founding principle is in error.\n \nThe Repelling Force: As much as the attracting object increases its speed of rotation, the more the objects attracted to it will increase their distance from it. And the more this speed of rotation decreases, the more the attracted object will get near to it. Suppose that the attracting object stopped its rotation around its axis, then the attracted object approaches to it until it sticks [and unites] with it, on the condition that it should not be without heat; because the object does not stop its rotation around itself unless its core heat will finish. \n \n In summary, the distance of the planets from the sun is because of the rotation of the sun around its axis.\n\n Once again, this is demonstrably false. Man-made satellites orbit the earth at many different distances and in radically different orbits, despite the earth only having one fixed rotational spin. For instance, at one particular height above the earth, satellites follow a geosynchronous orbit around the equator, orbiting the earth in the same period of time as the earth itself rotates, thus appearing to stand still. At other heights, satellites orbit faster or slower. Many satellites do not have equatorial orbits: some are tilted right up so as to pass over the poles of the earth. Clearly, the rotation of the earth has nothing whatsoever to do with the distance at which objects orbit it.\n \nWhile the second reason for that is that as much as the attracted object is cold, the gravity will affect it more, so it will get near to the attracting object by gravity and vice versa. \n\n Again, clearly false. The aforementioned satellites are not different in temperature. Nor is their size or mass correlated to the distance at which they orbit.\n \n This is an experiment to prove my words: Take three balls of wood, different in volume, and tie each one by an elastic thread, and let the threads be equal in size and elasticity, then tie the other end of each thread to a ring, and put these rings in your index finger, and move your hand in a way that makes the balls revolve around your index finger, and go on moving your hand then you will see the large ball start to get farther from your index finger, while the smaller will be the nearest to your finger, while the medium ball will be middle in its distance, and on this basis the planet will be nearer or farther from the sun.\n\n Your experiment is meaningless, and here's why: \n \n Take a piece of elastic between your fingers and stretch it. You will notice that the effort required increases the further the elastic is stretched. The force of gravity, on the other hand, decreases with distance. Thus your use of elastic bands to simulate gravity is entirely incorrect.\n \nE.g. the human body in which the presence of heat indicates that he is alive; the cause of this heat is the blood circulation inside it. While coldness of the human body indicates his death, and the reason of such coldness is the cessation of the blood circulation. \n\n This simply isn't true. The body's heat comes from chemical reactions, not the circulation of blood.\n \n [ The mistake of Astronomers about Moon ] \n \n About the claim of astronomers that \"it completes its rotation around itself in the same time as it completes its revolution around the Earth\"; this is not correct, and does not rely on a sound base. [See the picture below, of 'a father playing with his child', and its explanation. Moon revolves around Earth, but does not rotate around itself.] \n\n This too is very easily shown to be wrong.\n \n Proof: Imagine what the child sees over her father's shoulder as she is spun around. She sees the whole world spinning around her. Now imagine this takes place on a clear night - now she can see the whole universe spinning around her. For this to be true, either she is spinning, or the entire universe has started to spin. Clearly it is she that is rotating.\n \n Further proof: Take a length of wood or similar item - not a child - and spin around holding on to it, taking care to ensure that it remains always pointing at you. Now let go. You will see the object fly away, continuing to spin about its own axis, until it lands on the ground.\n \nThe appearance of the Earth from the surface of the Moon is just like the appearance of the Moon from the Earth, and no difference between the two. So, as we see the Moon, likewise we shall see the Earth as a crescent one time, and as a full moon another time, but the difference between the two is that the Moon appears to be small in size, while the Earth appears fifty times larger than it. \n\n A small point in the grand scheme of things, but earth does not appear fifty times larger than the moon, only 4 times larger. The moon is 1/50th the volume of earth, not 1/50th the diameter.\n [QUOTE] The volume of Venus was two-thirds that of the Earth, but later it shrunk, so that its volume becomes somewhat smaller. It was completing its rotation around itself in a period of 16 hours, so that its day was 8 hours, so was its night. But Venus stopped its axial rotation, and now it does not rotate around its axis; therefore, the day and night of Venus have become everlasting, and they do not succeed each other, because of the depletion of its internal heat, and because heat is the reason for the rotation of an object around itself.[QUOTE]\n This is observably incorrect. Venus rotates around its own axis once every 243 (earth) days and orbits the sun once every 224 (earth) days.\n \nthe Sun may draw him by its gravity so he will die because or its rays [or heat]; that is because Venus is devoid of gravity, \n\n Demonstrably false: we have put satellites into orbit around Venus, and used it to gravitationally sling-shot other spacecraft out into the solar system. This would not be possible if Venus had no gravity.\n \nand because of being near to the Sun. The traveler to Venus, then, will find towns, houses, clubs and shops, but will not see anyone dwelling therein; he will see furniture and property, but will not see any owner of them; he will see rivers but without water; and trees but they have been burnt by the Sun heat. \n\n No, he really, really won't :) The surface temperature of Venus - day and night - is sufficient to melt lead. What you are describing is a complete fantasy.\n \n Mars is larger than Earth by less than two times; it completes its rotation around itself in a period of about 44 hours. Therefore, its day is 22 hours, and so is its night, and its year equals about two of our years.\n\n Apart from the length of the martian year, all of this is completely wrong.\n \n Mars is considerably smaller than Earth. It rotates in 24 hours 39 minutes, not 44 hours.\n \n Proof that you are wrong about the size of Mars: we know how far away it is, and from that information and its apparent size we can deduce its actual size. We know we've got that information correct because we have successfully delivered landers and orbiters to Mars, something we could not possibly do if we were wrong about its orbit and size.\n \nMars is inhabited and contains plant, trees, animals, human beings, mountains, rivers, seas and other things.\n\n From that list, only 'mountains' and 'other things' are actually true. There are no vegetation, no trees, no human beings, no rivers, no seas. We know this for a fact because we have observed the whole surface of the planet in great detail and measured its atmosphere and temperature.\n \nI say that the Asteroids are not small planets, but are satellites of the terrestrial planets, just like the meteorites and moons. The asteroid, that completes its revolution around the sun in a short period, is a satellite of Mars; whereas that which completes it in a longer period is a satellite of Jupiter. Or they may be some flaming objects just like the comets. If they were some terrestrial planets, then they should be [very] near to the sun; because of their small volumes, according to the rule of the pulling force and the repelling force. [See also \"The mistake of Astronomers about the Asteroids\" just before the subject of 'Formation of the Planets'.] \n\n You can say what you like, but you're clearly wrong. The orbits of many asteroids have been traced, and they go around the sun, not Mars or Jupiter. This is one more indication that your 'rule' about the pulling force is flat-out wrong.\n \nThese meteorites revolve with the Earth from right to left, just like the revolution of the Moon. The big ones among them contain rain water and snow; for they are nearer to the Earth than they are to the Moon. On them there are some plants; and some of the small animals live there which are not much harmed by coldness like frogs, fish and something like that.\n\n Wrong again, unfortunately. No meteorite has an atmosphere, let alone one capable of supporting terrestrial life. Amino acids have been found, but that's a long way from fish and frogs :)\n \nBut most of the mountains are due to falling of meteorites upon the Earth\n\n If you count the rims of the craters they form, then sure, some mountains could be said to result from the falling of meteorites. But it's utterly, utterly false to say that most mountains are the result of meteorites falling. Tectonic movement is responsible for mountain ranges.\n \n I think that more or less covers most of the errors on that page; I'll get to the other pages ASAP.\n \n I understand that you might hold the author of this work in high esteem, but the plain and simple fact is that he was clearly, demonstrably wrong concerning a vast swathe of fundamental physics. It's a terrific read, but its scientific value is negligable.", 
   {
    "unicode_changes_made": true
   }, 
   322631, 
   null, 
   1220617140.0
  ], 
  [
   322645, 
   null, 
   "Kronus", 
   "\n This can very easily be shown to be false.\n \n\n \n Except for one, insurmountable, problem. You're dealing with someone who doesn't believe in empiricism. He clearly doesn't believe that the best way to learn about the universe is to look at the universe. Any observations which contradict his beliefs are simply labled \"incorrect\". In point of fact, it's impossible to show such a person anything that they don't want to see.", 
   {}, 
   322638, 
   null, 
   1220626980.0
  ], 
  [
   322647, 
   null, 
   "Peeling", 
   "Except for one, insurmountable, problem. You're dealing with someone who doesn't believe in empiricism. He clearly doesn't believe that the best way to learn about the universe is to look at the universe. Any observations which contradict his beliefs are simply labled \"incorrect\". In point of fact, it's impossible to show such a person anything that they don't want to see.\n\n I'm not so sure. Reading the page in question, it's clear that it does have its roots in empiricism - just a very sparse, chaotic kind of empiricism from which a riot of wild ideas sprout, denied the pruning clarity of critical thought.\n \n After all, you rub things, they get hot, and then things stick to them. The sun? That's really hot, and everything orbits that, so heat must be the key. And the sun spins, too - in fact, it seems like everything that's in orbit around anything else spins. So long as you never actually check any of these ideas to make sure they're right, you can keep going forever :)", 
   {}, 
   322645, 
   null, 
   1220628240.0
  ], 
  [
   322664, 
   null, 
   "Kronus", 
   "I'm not so sure. Reading the page in question, it's clear that it does have its roots in empiricism - just a very sparse, chaotic kind of empiricism from which a riot of wild ideas sprout, denied the pruning clarity of critical thought.\n\n *chuckle* That's kind of like saying \"It's a kind of water. A dry, pointy water made of rocks.\"\n \n \n So long as you never actually check any of these ideas to make sure they're right, you can keep going forever :) \n\n \n Which is, of course, the key to empiricism. You don't just leap to a conclusion, you check it. You make sure your impressions jibe with reality. You know this guy will never do that.", 
   {}, 
   322647, 
   null, 
   1220636520.0
  ], 
  [
   322696, 
   null, 
   "eanassir", 
   "Dude, you're cracked. I'm sorry, but you have yet to post one thing that even approaches correctness on this board.\n \n I suggest everyone stop feeding the loon.\n\n \n The afterglow of sunset on Mars:\n The afterglow of the sunset reflects many things, other than the dust in the atmosphere; it reflects the high and tremendous atmosphere, which they claim to be thin.\n \n See the link below:\n http://apod.nasa.gov/apod/ap050620.html \n \"Analyses of images like the above photograph show that at least some Martian days are capped by a sunset significantly longer and redder than typical on Earth. For up to two hours after twilight, sunlight continued to reflect off Martian dust high in the atmosphere, casting a diffuse glow.\"\n \n This gives a clew to the size of Mars, whose year is about twice the Earth year and its day is longer than the Earth day, and its afterglow of the sun is longer and redder than typical on Earth, and many of its mountains are higher than the Earth mountains, and it is farther than the Earth from the Sun.\n \n And see also this image of the red afterglow of the sunset on Mars:\n http://apod.nasa.gov/apod/ap970804.html\n \n On Earth, the afterglow of the sunset is of two kinds:\n 1- The eastern redness: this is seen immediately following the sunset, and will last for about 15 minutes (roughly speaking.) This is located at some height above the horizone (It does not extend from the horizone.)\n 2- The western redness: this is seen immediately follwoing the sunset, and will last for more than half an hour (may be up to one hour or more; this is only roughly speaking.) This western redness is more extensive, and extedns from the horizone to some demonstrable height, and may give some indication of the height of some of the atmospheric layers.\n \n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   322631, 
   null, 
   1220648460.0
  ], 
  [
   322699, 
   null, 
   "eanassir", 
   "Or troll. :xbanghead\n\n \n The water cycle on Mars:\n The cloud drifted by the wind is not a new discovery; but the thing I doubt that is all this cloud cirrus!?\n See the link below: \n http://jpl.nasa.gov/images/phoenix/collection_16/15777.gif\n \n And the new thing they have observed these days is \"the water available in the atmosphere\" according to their expression, and the fog, which is some form of water droplets precipitation.\n http://jpl.nasa.gov/news/phoenix/images.php?fileID=15777 \n \"The atmospheric water is available to form into clouds, fog and frost, such as the lander has been observing recently.\"\n \n The fog of course will disprove their postulation of the sublimation; because the fog is a collection of tiny water droplets.\n http://universeandquran.site.io/new_page_2.htm#The_Journey_to_Mars_Is_Successful_\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   322636, 
   null, 
   1220649000.0
  ], 
  [
   322716, 
   null, 
   "eanassir", 
   "\n I understand that you might hold the author of this work in high esteem, but the plain and simple fact is that he was clearly, demonstrably wrong concerning a vast swathe of fundamental physics.\n\n \n \n The author of the Arabic book that I have translated as The Universe and the Quran, which is displayed at the website: http://universeandquran.site.io is Mohammed-Ali Hassan Al-Hilly, the late interpreter of the Quran and the Bible.\n \n He did not graduate at any school, even at any primary school, but only he learnt Arabic reading and writing at some public local teachers, in his childhood in the beginning of the twentieth century.\n \n Therefore, he did not learn physics neither any other science disciplines; even he did not learn the Arabic grammar. In addition, he only learnt reading the Glorious Quran, and did not learn the Islamic law and other fields. \n \n He did not learn at any religious school belonging to any sect. This made him independent of any religious school of any sect. He did not imitate others blindly without reasonable thinking.\n \n At his age of forty years, he was inspired the interpretation of the Glorious Quran and was acquainted about the Holy Bible. \n \n Hence, the man was inspired many ideas and concepts, which are not essentially coincident with the acceptable theories; this does not mean he was wrong. E.g. when you see an observation, you think it is so and so, but you may not be correct.\n \n E.g. seeing the water vapor ascend up, you think because it is less in specific gravity or lighter than the surrounding air; here you may be right, \n \n and another explanation may be also correct: the water vapor is hot; then you say: because it is hot, it has become lighter and so it ascended up. \n \n But explaining it in another way: like the repelling between the hot vapor and the hot Earth may be more correct; I mean it is an observation: you explained it in this way to which you have been familiar because you studied it in your secondary school, college and may be your post-graduate studies until it became like unquestionable, and you think any other explanation is wrong.\n \n Moreover, it may have the same implication; i.e. the water vapor is hot and in the same time is lighter than the surrounding air, and why not it may be that there is the repelling between the Earth gravitation and the hot vapor; while when the water become cold it comes down; so it is an observation that may be explained by many ways, and it is not necessarily that what you have been familiar with is the true one.\n \n In the same way, we may see many other explanations in this book like:\n \n The earth rotates around itself because of the heat in its core; as much as it is hotter, it will spin quicker; and when it becomes colder it will slow down in its movement.\n \n Moon has no water and no life on it; he said this 60 years ago, when astronomers were guessing and many thought there are intelligent beings on Moon.\n \n And so on.\n \n Then when I gave this book to our professor of surgery; I said to him: \"The author of the book can only read and write Arabic.\", he said: \"Give me the book; it is not necessarily; [he may reach to something that specialists may not know.]\"\n \n eanassir \n http://universeandquran.site.io", 
   {}, 
   322638, 
   null, 
   1220654640.0
  ], 
  [
   322735, 
   null, 
   "Penfold", 
   "I suspect these \"Martians\" of yours did not originate there, but were deposited after being plucked from Uranus.", 
   {}, 
   322716, 
   null, 
   1220659920.0
  ], 
  [
   322747, 
   null, 
   "Peeling", 
   "Therefore, he did not learn physics neither any other science disciplines; even he did not learn the Arabic grammar. In addition, he only learnt reading the Glorious Quran <snip<\n Hence, the man was inspired many ideas and concepts, which are not essentially coincident with the acceptable theories;\n\n To put it mildly :)\n \n From reading the page, that's pretty much what I expected: it's clearly the product of a highly enquiring, observant and inventive mind - but also one denied a great deal of information which could have informed his theories.\n \n After all, it is not the case that scientists of today have better or more accurate theories than scientists of long ago because they're smarter. Rather, they benefit from the accretion of information and theories that have withstood rigorous testing. Upon that foundation each generation can reach a little higher than before.\n \n The ideas presented on your webpage are not in any way stupid. But they are wrong. There is no shame in that.\n \n \nE.g. seeing the water vapor ascend up, you think because it is less in specific gravity or lighter than the surrounding air; here you may be right, \n \n and another explanation may be also correct: the water vapor is hot; then you say: because it is hot, it has become lighter and so it ascended up. \n \n But explaining it in another way: like the repelling between the hot vapor and the hot Earth may be more correct; I mean it is an observation: you explained it in this way to which you have been familiar because you studied it in your secondary school, college and may be your post-graduate studies until it became like unquestionable, and you think any other explanation is wrong.\n\n No, I choose one explanation over the other because it accords consistently with reality, while the other does not.\n \n For instance: inflate a balloon and put it in the fridge or freezer. When you lift it out, it will have substantially deflated, and will slowly re-inflate as the air inside warms up. No air is leaving or entering the balloon, but the volume is changing - which means it is becoming less dense. And it is this change in density which explains the rising and falling of liquids and vapour. But a change in temperature also seems to be involved - so is it the temperature, or the density that is really responsible?\n \n Ice provides us with an answer. As water cools to form ice, it expands. The same amount of matter in a larger space = less density. So here we have our decisive test: if ice sinks in water then temperature is consistently linked to the rise and fall of materials, and the link with density is broken. But if ice floats, then density is consistently linked to the rise and fall of materials, and the link with temperature is broken.\n \nMoon has no water and no life on it; he said this 60 years ago, when astronomers were guessing and many thought there are intelligent beings on Moon.\n\n I don't think that's true, but in any case - so what? He was right about the moon, and wrong about Mars.\n \n He is, for instance, absolutely definitely wrong about mars being bigger than earth. Consider:\n \n 1) We know the orbits of the planets accurately enough to allow us to plot complex gravitational slingshot routes through the solar system for our spacecraft. If we were wrong about this, none of them would reach their destinations. Agree?\n \n 2) We therefore know the distance to mars at any given time. And we can directly measure its apparent size (the amount of sky it covers), from which two pieces of information we can calculate its actual size.\n \n 3) If mars were bigger than earth, then the orbit we put our martian satellites into would have smashed them into the surface.\n \n Again, I don't say these things to disparage this man's work. There is no shame in taking a vigorous philosophical interest in the world around you. I don't, for instance, think that Aristotle or Ptolemy were stupid for thinking that the sun and other planets revolved around the earth - that is after all what it looks like is happening. But they were, in the end, wrong - as is much of the material on your site - and for the same reason: they did not have certain vital information at their disposal.\n \n I hope you'll take this critique in the spirit in which it is intended. And thanks for a fascinating read!", 
   {}, 
   322716, 
   null, 
   1220665200.0
  ], 
  [
   322790, 
   null, 
   "eanassir", 
   "I suspect these \"Martians\" of yours did not originate there, but were deposited after being plucked from Uranus.\n\n \n Scientists should be lofty minded; anyhow:\n \n All the planets have water, and so there is life on these planets, with the exception of Mercury and Venus.\n \n Neptune has some rings, which are in fact the dissolution of the light in its atmosphere which is full of water in the form of ice crystals and water droplets, which are included in most of clouds; and these rings are only a rainbow formation.\n \n Saturn also is well-known by its rings, which also indicate the existence of large amount of water on Saturn.\n \n Mars is also known by its two poles with water ice, by the large number of clouds in its atmosphere, and the fog that has been recently discovered.", 
   {}, 
   322735, 
   null, 
   1220730180.0
  ], 
  [
   322830, 
   null, 
   "Penfold", 
   "Why should scientists particularly be \"lofty-minded\", and what in your eyes, is \"lofty-minded\" anyway? Is it similar to \"wooly-minded\"?", 
   {}, 
   322790, 
   null, 
   1220788080.0
  ], 
  [
   322863, 
   null, 
   "eanassir", 
   "\n For instance: inflate a balloon and put it in the fridge or freezer. When you lift it out, it will have substantially deflated, and will slowly re-inflate as the air inside warms up. No air is leaving or entering the balloon, but the volume is changing - which means it is becoming less dense. And it is this change in density which explains the rising and falling of liquids and vapour. But a change in temperature also seems to be involved - so is it the temperature, or the density that is really responsible?\n \n Ice provides us with an answer. As water cools to form ice, it expands. The same amount of matter in a larger space = less density. So here we have our decisive test: if ice sinks in water then temperature is consistently linked to the rise and fall of materials, and the link with density is broken. But if ice floats, then density is consistently linked to the rise and fall of materials, and the link with temperature is broken.\n \n\n \n \"Below 4°C, the bonds between hydrogen atoms in one water molecule and oxygen atoms in adjacent water molecules start to become stronger. This causes the molecules to arrange themselves into the pattern that eventually becomes a six-sided crystal. A water crystal (ice) has, on average, about 9% more space between molecules.\"\n http://www.seed.slb.com/qa2/FAQView.cfm?ID=1218\n \n Here, another factor (other than the density and the temperature) will play which is the Archimedes law or principle, which states that: \"a body immersed in a liquid feels an upward force equal to the weight of the liquid displaced.\"\n \n \n \n\n He is, for instance, absolutely definitely wrong about mars being bigger than earth. Consider:\n \n 1) We know the orbits of the planets accurately enough to allow us to plot complex gravitational slingshot routes through the solar system for our spacecraft. If we were wrong about this, none of them would reach their destinations. Agree?\n \n 2) We therefore know the distance to mars at any given time. And we can directly measure its apparent size (the amount of sky it covers), from which two pieces of information we can calculate its actual size.\n \n 3) If mars were bigger than earth, then the orbit we put our martian satellites into would have smashed them into the surface.\n \n\n \n As regards what you say that they know everything in details; this is not correct; yes they know the distance and many other things, but not everything; the indication of that is the many failures that occurred. \n \n I think if they remeasure the exact volume of Mars, they will discover it is bigger than Earth: its day is longer, its year is longer (of course its distance is farther than that of the Earth from the Sun), its mountains are bigger, its sun afterglow takes longer duration .. and so on. \n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   322747, 
   null, 
   1220821080.0
  ], 
  [
   322881, 
   null, 
   "Kronus", 
   "Any observations which contradict his beliefs are simply labled \"incorrect\". In point of fact, it's impossible to show such a person anything that they don't want to see. \n\n \n \nAs regards what you say that they know everything in details; this is not correct; yes they know the distance and many other things, but not everything; the indication of that is the many failures that occurred. \n \n I think if they remeasure the exact volume of Mars, they will discover it is bigger than Earth \n\n \n Tada!\n \n Do i get a cookie now?", 
   {}, 
   322863, 
   null, 
   1220823900.0
  ], 
  [
   322960, 
   null, 
   "Peeling", 
   "Here, another factor (other than the density and the temperature) will play which is the Archimedes law or principle, which states that: \"a body immersed in a liquid feels an upward force equal to the weight of the liquid displaced.\"\n\n That's not 'another factor', that's density. Density, not temperature, determines relative buoyancy. Hot water is less dense than cold water - thus when a volume of hot water is surrounded by cold water the amount of cold water displaced is greater than the weight of the hot water displacing it. Thus the upward force is greater than the downward force of gravity, and the hot water rises.\n \nI think if they remeasure the exact volume of Mars, they will discover it is bigger than Earth: \n\n Then you think wrong :) I'm really sorry, but there's no magical unknown factor waiting to save you here. We know how far away Mars is, and we can measure its angular span, which together tells us how large it is. We know we got that - and its mass - correct, because when we decided to put a spaceship into a particular orbit around it, it didn't smash into the ground. Mars is without a shadow of a doubt smaller than Earth. Just as Neptune is smaller than Saturn and Saturn is smaller than Jupiter. There is zero possibility of these facts not being true. You may as well say that a football 'may' be bigger than a basketball - it doesn't matter how long you wait or how hard you believe, nobody is ever going to discover some hidden fact that proves a football is bigger than a basketball.\n \n It's a shame you're so determined to present this material as if it were true, because its real value - as a glimpse into the mind of a modern-day philosopher trying to make sense of the world from first principles - is getting buried in an avalanche of derision as a result. If you have any respect for the author's memory you won't persist in subjecting his life's work to ridicule.", 
   {}, 
   322863, 
   null, 
   1220870040.0
  ], 
  [
   323009, 
   null, 
   "eanassir", 
   "That's not 'another factor', that's density. Density, not temperature, determines relative buoyancy. Hot water is less dense than cold water - thus when a volume of hot water is surrounded by cold water the amount of cold water displaced is greater than the weight of the hot water displacing it. Thus the upward force is greater than the downward force of gravity, and the hot water rises.\n \n\n \n As I told you, you interpret it like this; while it can be explained according to Archimedes principle. This lift up is because of the extra volume of the ice. \n \n \n\n its mass - correct, because when we decided to put a spaceship into a particular orbit around it, it didn't smash into the ground. \n\n \n It is not like this; the spaceship will not be smashed at least sometimes due to some practical experiments, and their spaceship will have some orbit around Mars; other times, the spaceships were smashed.\n \n Now see these observations:\n \n http://phoenix.lpl.arizona.edu/index.php \n \"A fork-like conductivity probe has sensed humidity rising and falling beside NASA's Phoenix Mars Lander\", although they say that the ground is still dry!\n What is this humidity? Is it some mild rain or drizzle or like on Earth: some rain will evaporate before reaching the ground ?\n \n \n They have seen fog recently; see my previous reply.\n \n Is all this cloud on Mars, cirrus?\n \n The afterglow of the sunset on Mars lasts longer than that on Earth.\n \n The day of Mars is longer than the day of the Earth.\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   322960, 
   null, 
   1220915280.0
  ], 
  [
   323032, 
   null, 
   "Peeling", 
   "As I told you, you interpret it like this; while it can be explained according to Archimedes principle. This lift up is because of the extra volume of the ice.\n\n I know. I told you that several posts ago. Remember? You were saying it was because of the temperature, and I said it was because of the lower density (same mass, larger volume) of ice compared to water?\n \n All you're doing is repeating back to me what I already said - so thanks for agreeing with me, if in a slightly roundabout way.\n \nIt is not like this; the spaceship will not be smashed at least sometimes due to some practical experiments, and their spaceship will have some orbit around Mars; other times, the spaceships were smashed.\n\n Wrong again, unfortunately. One orbiter was lost because the assembly team used the wrong units of measurement during construction, but the rest successfully attained orbit. The only ones that crashed were actually trying to land, and were doing so from a successful orbital insertion. There is no indication that our understanding of the martian orbit is in error.\n \n I don't think you appreciate just how wrong we'd have to be about Mars's orbit for you to be right. You say Mars is bigger than the Earth, whereas every single measurement we can make shows it to be about half the size, 4217 miles in diameter.\n \n Imagine you're looking at Mars through a telescope during its closest approach to Earth, which according to our understanding of its orbit was about 54,000,000 miles. If you're right and Mars is over twice the size we think it is, it would have to be over twice as far away in order to look the size it does through your telescope. That means anything we tried to put into orbit around mars would miss by at least 60,000,000 miles. Every single spacecraft we ever sent to mars would have missed by over 60,000,000 miles if you were right.\n \n I mentioned orbiters smashing into the surface because - assuming that by blind luck we DID manage to get something into orbit - a double-size Mars would have far more gravity than it does, and our spacecrafts' speed would be too low to stay in orbit.\n \n You need to face up to reality: Mars is smaller than Earth. That is never, ever going to change. Swinging balls around your finger on lengths of elastic proves nothing, because gravity is not like elastic.\n \n\"A fork-like conductivity probe has sensed humidity rising and falling beside NASA's Phoenix Mars Lander\", although they say that the ground is still dry!\n What is this humidity? Is it some mild rain or drizzle or like on Earth: some rain will evaporate before reaching the ground ?\n\n No, it's humidity. Not rain or drizzle. I can't find any details of what the actual levels are, but they're likely to be very low (I think if they were high, that would have been pretty big news).\n \nThe afterglow of the sunset on Mars lasts longer than that on Earth.\n\n So what?\n \nThe day of Mars is longer than the day of the Earth.\n\n So what? It rotates more slowly. What's your point?", 
   {}, 
   323009, 
   null, 
   1220922960.0
  ], 
  [
   323112, 
   null, 
   "eanassir", 
   "\n So what?\n \n\n \n The afterglow of the sunset is manifested in the troposphere: it may be seen extending above the level of the cloud; the cloud is confined to the troposphere; this sunset afterglow indicates the height of the troposphere.\n \n Therefore, the extent of the sunset afterglow on Mars is very valuable in demonstrating the extent of the troposphere which is the lowest layer of the atmosphere on Earth and on Mars.\n \n The duration of the sunset afterglow will also give an indication of the extension of the atmosphere and indirectly of the volume of the planet; on Mars it lasts longer than on Earth; on Earth it lasts about one hour or somewhat longer; on Mars it lasts two hours.\n \n \n \n\n So what? It rotates more slowly. What's your point?\n\n \n Or it may be larger, and its rotation lasts longer around its axis until it completes one rotation around itself, in a period longer than that on Earth.\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   323032, 
   null, 
   1220996280.0
  ], 
  [
   323121, 
   null, 
   "Peeling", 
   "The afterglow of the sunset is manifested in the troposphere: it may be seen extending above the level of the cloud; the cloud is confined to the troposphere; this sunset afterglow indicates the height of the troposphere.\n\n Which is indeed higher than Earth's.\n \n You know why?\n \n Because Mars is - wait for it - smaller than Earth. As a result, its gravity is only 3/8ths that of Earth, so the atmospheric column is less compressed.\n \nOr it may be larger, and its rotation lasts longer around its axis until it completes one rotation around itself, in a period longer than that on Earth.\n\n Its rotation lasts longer until it completes one rotation around itself because it's turning more slowly.\n \n Please, just read what I posted above and think, really think about the implications. According to you, Mars is over twice as far away as Nasa thinks it is. Now, out of you and Nasa, who has put more spacecraft into orbit around Mars? And what does that tell you about who's got the distance to Mars correct?", 
   {}, 
   323112, 
   null, 
   1221000000.0
  ], 
  [
   323207, 
   null, 
   "eanassir", 
   " Which is indeed higher than Earth's.\n You know why?\n Because Mars is - wait for it - smaller than Earth. As a result, its gravity is only 3/8ths that of Earth, so the atmospheric column is less compressed.\n\n \n This is obviously wrong; as much as the planet is bigger, its atmosphere will be bigger, and vice versa.\n \n \n \n Its rotation lasts longer until it completes one rotation around itself because it's turning more slowly.\n\n \n Or it is somewhat more quickly, but the circumference of that planet is larger than that of the Earth; therefore it takes longer duration than the day of the Earth.\n \n \n \n \n Please, just read what I posted above and think, really think about the implications. According to you, Mars is over twice as far away as Nasa thinks it is. Now, out of you and Nasa, who has put more spacecraft into orbit around Mars? And what does that tell you about who's got the distance to Mars correct?\n\n \n This is not a correct way of deduction; such observations need more contemplation, and I did not say NASA is not good and advanced, but they have been misguided to many things cocerning Mars and their selected sites for their landing and exploration. As had the Russians misguided before them (Because the Russians were almost atheists, and they consecrated their efforts towards Venus, which was a failure.)\n http://universeandquran.site.io/new_page_2.htm#The_Journey_to_Venus_Is_Dangerous_\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   323121, 
   null, 
   1221056100.0
  ], 
  [
   323250, 
   null, 
   "sinjin", 
   "Okay, this is just crazy talk.", 
   {}, 
   323207, 
   null, 
   1221074460.0
  ], 
  [
   323335, 
   null, 
   "Peeling", 
   "This is obviously wrong; as much as the planet is bigger, its atmosphere will be bigger, and vice versa.\n\n Incorrect. Higher gravity means a more compressed atmospheric column.\n \nOr it is somewhat more quickly, but the circumference of that planet is larger than that of the Earth; therefore it takes longer duration than the day of the Earth.\n\n I'm talking about angular velocity. For it to take longer to perform a full rotation, its angular velocity must be lower. Size of the planet is irrelevant to how fast it is rotating (angular velocity).\n \nThis is not a correct way of deduction; such observations need more contemplation, and I did not say NASA is not good and advance\n\n If you and I stand together, looking at a ball some distance away, and I say \"That ball is 1 metre in diameter\", and you say \"No, it is over 2 metres in diameter\", you are obliged to estimate its distance as being over twice what I would estimate it to be. After all, it looks the same size to both of us, and there is a rigid relationship between 1) the amount of your view a thing covers, 2) its actual size, and 3) its distance away.\n http://img392.imageshack.us/img392/9201/visiblesizeys7.gif\n Both the balls in the above image look the same size to the observer, since they cover the same angle of view. Rather like the moon and the sun, ball A will exactly eclipse ball B. You insist that Mars is like the larger ball; Nasa says it is like the smaller ball. For you to be right, Mars must be over twice as far away as Nasa thinks it is. Nasa has put a number of spacecraft onto the surface and into the orbit of Mars. You have not. Therefore, all the evidence points to Nasa having the correct estimate of distance (and therefore actual size).\n \n Further empirical evidence of distance (and therefore actual size) comes in the form of the time-lag between radio commands sent to mars landers and the acknowledgement signals arriving back on Earth. If you were right about Mars being twice as far away, light would take twice as long as it does to travel the intervening distance.", 
   {}, 
   323207, 
   null, 
   1221132540.0
  ], 
  [
   323567, 
   null, 
   "eanassir", 
   "Incorrect. Higher gravity means a more compressed atmospheric column.\n \n\n \n This is only a quick reply; I may return to the rest later on.\n \n You are wrong here; the compressed atmosphere comes from the high atmosphere compressing the lower layers below.\n The gravity of the planet has nothing to do directly with the compression of the atmosphere, other than that the strong gravity of a large planet may capture an extensively high atmosphere. \n The gases of the atmosphere of a planet has been formed from the planet itself.\n http://universeandquran.site.io/#The_Gaseous_Heavens\n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   323335, 
   null, 
   1221278700.0
  ], 
  [
   323571, 
   null, 
   "Peeling", 
   "You are wrong here; the compressed atmosphere comes from the high atmosphere compressing the lower layers below.\n\n And compression is due to weight, which is due to... yep, gravity :) Less gravity, less compression. And yes, Mars's lower gravity does mean it has captured less atmosphere: the pressure at ground level is only 1/100th that on Earth. So less atmosphere, more thinly spread.\n \n Mars cannot be twice as big as Nasa thinks it is, because that would mean it is twice as far away as Nasa thinks it is, which is impossible because:\n \n 1) Nasa has landed spacecraft on Mars and put them into orbit around it\n \n 2) The time-lag for communication with Mars is too short for it to be twice as far away as Nasa thinks it is.", 
   {}, 
   323567, 
   null, 
   1221307200.0
  ], 
  [
   323582, 
   null, 
   "eanassir", 
   "And compression is due to weight, which is due to... yep, gravity :) Less gravity, less compression. And yes, Mars's lower gravity does mean it has captured less atmosphere: the pressure at ground level is only 1/100th that on Earth. So less atmosphere, more thinly spread.\n \n Mars cannot be twice as big as Nasa thinks it is, because that would mean it is twice as far away as Nasa thinks it is, which is impossible because:\n \n 1) Nasa has landed spacecraft on Mars and put them into orbit around it\n \n 2) The time-lag for communication with Mars is too short for it to be twice as far away as Nasa thinks it is.\n\n \n Your deduction is not so precize; I say: let them make measurements, from the start, and you will see the results.", 
   {}, 
   323571, 
   null, 
   1221333120.0
  ], 
  [
   323585, 
   null, 
   "T.Q", 
   "Your deduction is not so precize; I say: let them make measurements, from the start, and you will see the results.\n\n \n The measurments have been made, that's what Peeling and others have spent the last six pages telling you. The measurements show you're wrong.", 
   {}, 
   323582, 
   null, 
   1221334620.0
  ], 
  [
   323586, 
   null, 
   "eanassir", 
   "\n I'm talking about angular velocity. For it to take longer to perform a full rotation, its angular velocity must be lower. Size of the planet is irrelevant to how fast it is rotating (angular velocity).\n \n\n \n Not like what you imagine; I say the large planet will have a longer day, and the small will have a shorter day. Taking into consideration that roughly speaking the large planet will have a hotter core and it should spin faster, but eventhough it usually will have a longer day than the small planet; in the same way will the year of the big planet be longer than the small planet which (the small planet) will be nearer to the sun than the big planet to the sun.\n http://universeandquran.site.io/new_page_2.htm#The_Movement_of_Objects_\n \n :)\n NASA is only like a pupil in the first year of the primary school, in comparison to the tremendous knowledge embedded in the universe. Although it is a good pupil; I certainly not qualified like NASA, but eventhough I have some view of the universe with the light of the Quran of God and its interpretation, which will supercede the acquired knowledge of astronomers whatever they be.\n \n I may come to the rest shortly.", 
   {}, 
   323335, 
   null, 
   1221334740.0
  ], 
  [
   323595, 
   null, 
   "eanassir", 
   "Incorrect. Higher gravity means a more compressed atmospheric column.\n \n I'm talking about angular velocity. For it to take longer to perform a full rotation, its angular velocity must be lower. Size of the planet is irrelevant to how fast it is rotating (angular velocity).\n \n If you and I stand together, looking at a ball some distance away, and I say \"That ball is 1 metre in diameter\", and you say \"No, it is over 2 metres in diameter\", you are obliged to estimate its distance as being over twice what I would estimate it to be. After all, it looks the same size to both of us, and there is a rigid relationship between 1) the amount of your view a thing covers, 2) its actual size, and 3) its distance away.\n http://img392.imageshack.us/img392/9201/visiblesizeys7.gif\n Both the balls in the above image look the same size to the observer, since they cover the same angle of view. Rather like the moon and the sun, ball A will exactly eclipse ball B. You insist that Mars is like the larger ball; Nasa says it is like the smaller ball. For you to be right, Mars must be over twice as far away as Nasa thinks it is. Nasa has put a number of spacecraft onto the surface and into the orbit of Mars. You have not. Therefore, all the evidence points to Nasa having the correct estimate of distance (and therefore actual size).\n \n Further empirical evidence of distance (and therefore actual size) comes in the form of the time-lag between radio commands sent to mars landers and the acknowledgement signals arriving back on Earth. If you were right about Mars being twice as far away, light would take twice as long as it does to travel the intervening distance.\n\n \n Mars does not eclipse the Earth. Your excellent explanation is not applicable in this problem. We are not speaking about the distance of Mars from the Earth, neither its distance from the Sun. The distance of Mars from the Sun and from the Earth is correctly estimated. But the difference is the size of Mars.\n Their sending of the space ships to Mars is according to the distance of Mars which is correctly known, not according to the size of Mars which is mistaken.", 
   {}, 
   323335, 
   null, 
   1221342720.0
  ], 
  [
   323600, 
   null, 
   "T.Q", 
   "Mars does not eclipse the Earth. Your excellent explanation is not applicable in this problem. We are not speaking about the distance of Mars from the Earth, neither its distance from the Sun. The distance of Mars from the Sun and from the Earth is correctly estimated. But the difference is the size of Mars.\n Their sending of the space ships to Mars is according to the distance of Mars which is correctly known, not according to the size of Mars which is mistaken.\n\n \n And if we were so far off about the size of Mars, it would require Mars to be much more distant from the earth than it actually is.\n \n Bah, I give up. What you insist is true would require pretty much every single thing we know about basic math, physics, astronomy and every other science (and I'm talking grade school stuff you can confirm at home) to be so completely, hopelessly wrong that we shouldn't be able to find our own asses, let alone send exploration drones throughout the solar system", 
   {}, 
   323595, 
   null, 
   1221345600.0
  ], 
  [
   323610, 
   null, 
   "Kronus", 
   "Bah, I give up. \n\n Not to be too blunt and/or insulting, but about time. I feel that it's been clear that reason is not only a closed book, but burned and the ashes buried, for many many posts now.", 
   {}, 
   323600, 
   null, 
   1221355680.0
  ], 
  [
   323623, 
   null, 
   "Peeling", 
   "Mars does not eclipse the Earth. Your excellent explanation is not applicable in this problem. \n\n I didn't say Mars eclipsed the earth. All I said was that ball A and ball B both look exactly the same size to the observer, just like the moon and the sun look the same size to someone standing on Earth, even though the moon and the sun are very different in size. I apologise for unintentionally confusing the issue. \n The relevant point is that if you make something bigger, you must move it further away in order for it to continue to look the same size.\n \nWe are not speaking about the distance of Mars from the Earth, neither its distance from the Sun. The distance of Mars from the Sun and from the Earth is correctly estimated. But the difference is the size of Mars.\n Their sending of the space ships to Mars is according to the distance of Mars which is correctly known, not according to the size of Mars which is mistaken.\n\n If Mars were as close as NASA thinks, but as big as you think, it would look over twice the size it does. Do you understand that?\n \n Mars at its closest approach covered about 16 arc-seconds (16/3600ths of a degree) of sky. That's an empirical fact. According to NASA, whose estimates you've just said are correct, it was 54,000,000 miles away at that time. Using simple trigonometry, we can calculate that for Mars to be 54,000,000 miles away and cover 16/3600ths of a degree of sky, it would have to be about 4200 miles across - which is almost exactly what NASA estimates the diameter of Mars to be:\n \n 54,000,000 x Sin(16/3600) = 4188\n \n With me so far? Ok. Now, you claim that Mars is over twice as big as NASA thinks. Since the visible size of Mars is not in doubt, the only other variable is the distance. If you think Mars is 9000 miles across, for instance, slightly bigger than Earth, the above equation becomes something like this:\n \n ? x Sin(16/3600) = 9000\n \n And when we do the math, we find the new distance must be around 116,023,953. If you're right about the size of Mars, NASA would miss it by over 60,000,000 miles every time they sent a probe.\n \n You can't have it both ways, eanassir. If NASA is right about the distance - which you've just said they are - they must also be right about the size, because the two values are tied together by the visible size of Mars in the sky above us.", 
   {}, 
   323595, 
   null, 
   1221363720.0
  ], 
  [
   323659, 
   null, 
   "eanassir", 
   "I didn't say Mars eclipsed the earth. All I said was that ball A and ball B both look exactly the same size to the observer, just like the moon and the sun look the same size to someone standing on Earth, even though the moon and the sun are very different in size. I apologise for unintentionally confusing the issue. \n The relevant point is that if you make something bigger, you must move it further away in order for it to continue to look the same size.\n \n If Mars were as close as NASA thinks, but as big as you think, it would look over twice the size it does. Do you understand that?\n \n Mars at its closest approach covered about 16 arc-seconds (16/3600ths of a degree) of sky. That's an empirical fact. According to NASA, whose estimates you've just said are correct, it was 54,000,000 miles away at that time. Using simple trigonometry, we can calculate that for Mars to be 54,000,000 miles away and cover 16/3600ths of a degree of sky, it would have to be about 4200 miles across - which is almost exactly what NASA estimates the diameter of Mars to be:\n \n 54,000,000 x Sin(16/3600) = 4188\n \n With me so far? Ok. Now, you claim that Mars is over twice as big as NASA thinks. Since the visible size of Mars is not in doubt, the only other variable is the distance. If you think Mars is 9000 miles across, for instance, slightly bigger than Earth, the above equation becomes something like this:\n \n ? x Sin(16/3600) = 9000\n \n And when we do the math, we find the new distance must be around 116,023,953. If you're right about the size of Mars, NASA would miss it by over 60,000,000 miles every time they sent a probe.\n \n You can't have it both ways, eanassir. If NASA is right about the distance - which you've just said they are - they must also be right about the size, because the two values are tied together by the visible size of Mars in the sky above us.\n\n \n There is here some variable that does not correlate; anyhow, Peeling, :) this method of measuring is indirect which was used before because they were far away from Mars; \n but now, having gone there to Mars, they should do direct measuring using their orbiters, and should not stick to the classical previous ways. \n This is what I say; because they, being preoccupied by their previous ideas, will miss many new observations and explanations in case they keep up holding with the past ideas about Mars.", 
   {}, 
   323623, 
   null, 
   1221413460.0
  ], 
  [
   323681, 
   null, 
   "smiley", 
   "There is here some variable that does not correlate; anyhow, Peeling, :) this method of measuring is indirect which was used before because they were far away from Mars; \n but now, having gone there to Mars, they should do direct measuring using their orbiters, and should not stick to the classical previous ways. \n This is what I say; because they, being preoccupied by their previous ideas, will miss many new observations and explanations in case they keep up holding with the past ideas about Mars.\n\n Do you honestly think they haven't done this?\n \n I can imagine the scene at NASA . . .\n \n Mars lander is just 1,000,000 miles from Mars, the pictures are coming in, and suddenly someone says, \"Hang on a sec. That planet looks a bit on the big side. Let me get my slide-rule out.\"\n \n \"My god, it's huge. At least twice as big as we thought. Quick, get me the 24 hour news channel NOW!!!!\"\n \n But for some reason, this little scenario didn't happen. Possibly because no-one noticed the size of Mars as being way off that originally calculated. Possibly because it isn't more than twice the size originally calculated. Just think of the scientific reputation someone would receive if they noticed something like that. It is not something you could just cover up.\n \n Perhaps you should rethink this one a bit. Or maybe just think it out properly for the first time.\n \n Smiley", 
   {}, 
   323659, 
   null, 
   1221430500.0
  ], 
  [
   323720, 
   null, 
   "eanassir", 
   "Do you honestly think they haven't done this?\n \n I can imagine the scene at NASA . . .\n \n Mars lander is just 1,000,000 miles from Mars, the pictures are coming in, and suddenly someone says, \"Hang on a sec. That planet looks a bit on the big side. Let me get my slide-rule out.\"\n \n \"My god, it's huge. At least twice as big as we thought. Quick, get me the 24 hour news channel NOW!!!!\"\n \n But for some reason, this little scenario didn't happen. Possibly because no-one noticed the size of Mars as being way off that originally calculated. Possibly because it isn't more than twice the size originally calculated. Just think of the scientific reputation someone would receive if they noticed something like that. It is not something you could just cover up.\n \n Perhaps you should rethink this one a bit. Or maybe just think it out properly for the first time.\n \n Smiley\n\n \n Have they done such measurements with their orbiters, really? Because we have some clues: like the exteded sunset afterglow. \n \n And if someone goes there to Mars in one of such orbiters, then he will see before him the disc of Mars surface below; and he, even in such situation, may not know for certain whether Mars is bigger or smaller unless he will do some practical measurements.", 
   {}, 
   323681, 
   null, 
   1221458640.0
  ], 
  [
   323721, 
   null, 
   "pandion", 
   "Why is this discussion being tolerated in the \"Science and Math\" forum? For God's sake, the question of \"people on Mars\" is no longer a question of science. This thread should be moved to some fantasy forum. Or, maybe, this whole board is nothing more than a sort of spooky laugh. Should I post that after I drop acid I observe that I have six toes and fingers on the \"Science and Math\" forum? Science is science and men on Mars is not. Move this to some fantasy thread.", 
   {}, 
   323720, 
   null, 
   1221461880.0
  ], 
  [
   323729, 
   null, 
   "Peeling", 
   "Major apologies to all for getting my figures mixed up in the previous post. At its most recent closest approach Mars was 55,758,006 kilometres away, and subtended an angle of 25.11 arc-seconds, yielding a calculated diameter of 6788 kilometres, or 4217 miles. Silly me :)\n \nThere is here some variable that does not correlate; anyhow, Peeling, :) this method of measuring is indirect which was used before because they were far away from Mars; \n\n It doesn't matter. Trigonometry works irrespective of distance.\n http://img239.imageshack.us/img239/4112/trigya5.gif\n You can use this method to establish the size of any object. So long as you know how far it is away, if you measure the angle it subtends you can calculate precisely how big it really is. Try it: measure the angle on that image above, measure the distance to the ball in the image, and calculate the diameter using:\n \n diameter = distance x Sin(angle)\n \n When you measure the diameter, you'll find the numbers match. You can do the same with an orange, a building, the moon, the sun, a planet... If Mars were twice as big, it would look twice as big - unless it was also twice as far away. You've already agreed it's not twice as far away, so it can't be twice as big. Them's the rules :)\n \nHave they done such measurements with their orbiters, really?\n\n Yes. The earlier Mariner missions were sent for that very purpose: in addition to photographing the surface their job was to establish the exact size and mass of Mars, in order to make orbital insertion and landing possible. From the data they sent back NASA calculated the trajectories necessary to insert later spacecraft into very specific orbits, which depend absolutely upon a correct understanding of the size and mass of the planet involved.\n \n You cannot be right :)", 
   {}, 
   323720, 
   null, 
   1221478500.0
  ], 
  [
   323732, 
   null, 
   "charlie horse", 
   "Why is this discussion ...\n\n It's hardly a discussion, more a head-banging attempt at trying to educate one individual who clearly doesn't want to know. :xbanghead", 
   {}, 
   323721, 
   null, 
   1221479700.0
  ], 
  [
   323742, 
   null, 
   "CUNxTime", 
   "Yeah, why bother?", 
   {}, 
   323732, 
   null, 
   1221484200.0
  ], 
  [
   323761, 
   null, 
   "eanassir", 
   "\n It doesn't matter. Trigonometry works irrespective of distance.\n http://img239.imageshack.us/img239/4112/trigya5.gif\n You can use this method to establish the size of any object. So long as you know how far it is away, if you measure the angle it subtends you can calculate precisely how big it really is. Try it: measure the angle on that image above, measure the distance to the ball in the image, and calculate the diameter using:\n \n diameter = distance x Sin(angle)\n \n When you measure the diameter, you'll find the numbers match. You can do the same with an orange, a building, the moon, the sun, a planet... If Mars were twice as big, it would look twice as big - unless it was also twice as far away. You've already agreed it's not twice as far away, so it can't be twice as big. Them's the rules :)\n \n\n \n In this case any error in the distance, eventhough it may be little; and any error in the angle - and this is particularly possible - eventhough it is fractional, it will lead to tremendous change in the result of the diameter of Mars.", 
   {}, 
   323729, 
   null, 
   1221498900.0
  ], 
  [
   323768, 
   null, 
   "Peeling", 
   "In this case any error in the distance, eventhough it may be little; and any error in the angle - and this is particularly possible - eventhough it is fractional, it will lead to tremendous change in the result of the diameter of Mars.\n\n Not at all. Look again at the maths:\n \n Diameter = Sin(Angle) x Distance.\n \n To make Mars bigger than Earth you would have to more than double the diameter, which would mean either doubling the distance, doubling the sine of the angle (which for small angles effectively means doubling the angle), or a combination of the two. The smallest error margin that could make mars twice the size would be 41% on both the angle and the distance.\n \n For example, if the measured distance were 10% wrong (which is already impossible because the martian landers and orbiters would never have got there) AND the angle measured from earth were 10% wrong (which is equally absurd since it's a trivial measurement to make, no harder than measuring a piece of paper with a ruler), that would still only make Mars 20% bigger, not the 100%+ bigger you require.\n \n And in any case, as I've already pointed out, the Mariner probes went out there for the express purpose of precisely establishing the size and mass of Mars, in order that subsequent missions could orbit or land upon the planet.\n \n I'm really not kidding; there's no way you can be right about this :)", 
   {}, 
   323761, 
   null, 
   1221502680.0
  ], 
  [
   323802, 
   null, 
   "Kronus", 
   " \n I'm really not kidding; there's no way you can be right about this :)\n\n \n Some would define insanity as the inability to accept reality as it really is. One application of that defintion in this case is obvious, but I must point out that you are still trying to get eanassir to accept reason and common sense.", 
   {}, 
   323768, 
   null, 
   1221515040.0
  ], 
  [
   323810, 
   null, 
   "eanassir", 
   "\n The earlier Mariner missions were sent for that very purpose: in addition to photographing the surface their job was to establish the exact size and mass of Mars, in order to make orbital insertion and landing possible. From the data they sent back NASA calculated the trajectories necessary to insert later spacecraft into very specific orbits, which depend absolutely upon a correct understanding of the size and mass of the planet involved.\n \n\n \n I made Yahoo search, and there was only taking images and mapping of the surface of Mars. There isn't anything about the actual measurement of the size of Mars.", 
   {}, 
   323729, 
   null, 
   1221517200.0
  ], 
  [
   323846, 
   null, 
   "smiley", 
   "I made Yahoo search, and there was only taking images and mapping of the surface of Mars. There isn't anything about the actual measurement of the size of Mars.\n\n Try this page.\n \n Here is the bit about the core of Mars and what it might be composed of.\n \n The current understanding of the interior of Mars suggests that it can be modeled with a thin crust, similar to Earth's, a mantle and a core. Using four parameters, the Martian core size and mass can be determined. However, only three out of the four are known and include the total mass, size of Mars, and the moment of inertia. Mass and size was determined accurately from early missions. The moment of inertia was determined from Viking lander and Pathfinder Doppler data, by measuring the precession rate of Mars. The fourth parameter, needed to complete the interior model, will be obtained from future spacecraft missions. With the three known parameters, the model is significantly constrained. If the Martian core is dense (composed of iron) similar to Earth's or SNC meteorites thought to originate from Mars, then the minimum core radius would be about 1300 kilometers. If the core is made out of less-dense material such as a mixture of sulfur and iron, the maximum radius would probably be less than 2000 kilometers. (Copyright 1998 by Calvin J. Hamilton)\n \n Does this convince you or are you going to continue your hopeless downward spiral into willful ignorance?\n \n Smiley", 
   {}, 
   323810, 
   null, 
   1221526320.0
  ], 
  [
   324025, 
   null, 
   "eanassir", 
   "Try this page.\n \n Here is the bit about the core of Mars and what it might be composed of.\n \n The current understanding of the interior of Mars suggests that it can be modeled with a thin crust, similar to Earth's, a mantle and a core. Using four parameters, the Martian core size and mass can be determined. However, only three out of the four are known and include the total mass, size of Mars, and the moment of inertia. Mass and size was determined accurately from early missions. The moment of inertia was determined from Viking lander and Pathfinder Doppler data, by measuring the precession rate of Mars. The fourth parameter, needed to complete the interior model, will be obtained from future spacecraft missions. With the three known parameters, the model is significantly constrained. If the Martian core is dense (composed of iron) similar to Earth's or SNC meteorites thought to originate from Mars, then the minimum core radius would be about 1300 kilometers. If the core is made out of less-dense material such as a mixture of sulfur and iron, the maximum radius would probably be less than 2000 kilometers. (Copyright 1998 by Calvin J. Hamilton)\n \n Does this convince you or are you going to continue your hopeless downward spiral into willful ignorance?\n \n Smiley\n\n \n \n \n The link that you have given is very useful. :)\n \n Anyhow: where and when was this \"Mass and size determined accurately from early missions\"?\n \n Moreover, we did not speak about the interior of Mars (: the crust, mantle and core); but we said about the total mass and size of Mars, to which we have many hints:\n \n &#8226; The day of Mars is longer than that of the Earth.\n &#8226; Some mountains on Mars are bigger than the tallest mountain on Earth.\n &#8226; The canyon on Mars is much deeper than the Great Canyon on Earth.\n &#8226; The sunset afterglow of Mars lasts longer than that of the Earth.\n \n N.B.\n When we see the images of Mars taken by the Hubble Space Telescope, which is not so far from the Earth, we shall see the image of Mars like that of the Earth: it has continents, oceans and polar caps and many of its clouds.\n On the other hand, the images of Mars taken by the orbiters, the rovers and the Lander on Mars; we shall see Mars as a desolate land, full of craters and devoid of any evidence of water. \n \n It may be then that the images of Mars taken by rovers and orbiters there are not so pricize; because of the far distance or from the programs of taking, transmitting and modifying such images according to their imagination about Mars.\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   323846, 
   null, 
   1221687240.0
  ], 
  [
   324027, 
   null, 
   "Kronus", 
   "I actually thought that Smiley's post might actually have some effect. :(", 
   {}, 
   324025, 
   null, 
   1221688320.0
  ], 
  [
   324029, 
   null, 
   "smiley", 
   "The link that you have given is very useful. :)\n \n Anyhow: where and when was this \"Mass and size determined accurately from early missions\"?\n\n As the article states, the mass and size of Mars were determined accurately by the early missions to Mars.\n \n You were complaining that we had only determined the size of Mars from our observations from Earth and that from your Yahoo search you could find no mention of any other measurement of the planet. I found it for you.\n \n \nMoreover, we did not speak about the interior of Mars (: the crust, mantle and core); but we said about the total mass and size of Mars, to which we have many hints:\n \n \u0095 The day of Mars is longer than that of the Earth.\n \u0095 Some mountains on Mars are bigger than the tallest mountain on Earth.\n \u0095 The canyon on Mars is much deeper than the Great Canyon on Earth.\n \u0095 The sunset afterglow of Mars lasts longer than that of the Earth.\n \n\n I only quoted the bit about the internal structure of Mars because that is where it mentions that the early missions accurately measured the disputed properties. The rest is easy to answer.\n \n Day is longer - This is because Mars is spinning slower, nothing more.\n Mountains are higher - Not due to it having a greater mass. Perhaps the planet's early volcanic period was more violent than that of Earth. Perhaps the lower mass means that such inconsistancies are less likely to level out.\n Deeper Canyons - See above.\n Longer Sunset - Due to dust particles high in the atmosphere. Explained here. Also the slower rotation would make the sunset longer - that's just obvious.\n \n Smiley", 
   {}, 
   324025, 
   null, 
   1221689160.0
  ], 
  [
   324030, 
   null, 
   "smiley", 
   "I actually thought that Smiley's post might actually have some effect. :(\n\n You foolish mortal. emoticon_xdonno", 
   {}, 
   324027, 
   null, 
   1221689220.0
  ], 
  [
   324032, 
   null, 
   "Kronus", 
   " \n Mountains are higher - Not due to it having a greater mass. Perhaps the planet's early volcanic period was more violent than that of Earth. Perhaps the lower mass means that such inconsistancies are less likely to level out.\n Deeper Canyons - See above.\n Longer Sunset - Due to dust particles high in the atmosphere. \n \n Smiley\n\n Actually, these are all direct evidence that Mars is smaller than Earth. Bigger mountains, deeper canyons, and higher atmosphere are all the result of less gravity; that is, a smaller planet.\n \n This guy is clearly beyond hope, he simply will never listen to anything that contradicts his own personal reality.", 
   {}, 
   324029, 
   null, 
   1221689340.0
  ], 
  [
   324040, 
   null, 
   "eanassir", 
   "As the article states, the mass and size of Mars were determined accurately by the early missions to Mars.\n \n\n \n This was a good article, but where and when and how was this estimation made by what earlier missions of Mars?\n \n \n\n Day is longer - This is because Mars is spinning slower, nothing more.\n \n\n \n How can you insist on this? It may be Mars is larger and takes longer duration. This will be more reasonable than supposing Mars is smaller and slower to the extent that its day will be longer than the day of the Earth.\n \n \n\n Mountains are higher - Not due to it having a greater mass. Perhaps the planet's early volcanic period was more violent than that of Earth. Perhaps the lower mass means that such inconsistancies are less likely to level out.\n Deeper Canyons - See above.\n \n\n \n How can you affirm this, with your many perhaps!?\n \n \n\n Longer Sunset - Due to dust particles high in the atmosphere. Explained here. Also the slower rotation would make the sunset longer - that's just obvious.\n \n\n \n Here is also another clue to a more extensive atmosphere of Mars: the dust present at higher altitude than that of Earth dust.\n Moreover, the afterglow has no relation to a longer sunset; the sun has already set, but the sunset afterglow will last longer; because of the dust particles present in its higher troposphere: higher than that of the Earth.\n \n In addition, all these observations, presumptions and evidences altogether should make one think Mars is bigger; but not to try to explain such observations individually by many suppositions and perhaps.\n \n \n eanassir\n http://universeandquran.site.io", 
   {}, 
   324029, 
   null, 
   1221692580.0
  ], 
  [
   324041, 
   null, 
   "sinjin", 
   "\"Maxwell Montes is a mountain massif on the planet Venus, part of which contains the highest point on the planet's surface. Located on Ishtar Terra, the more northern of the planet's two major highlands, it is 11,000 meters high.\"\n http://en.wikipedia.org/wiki/Maxwell_Montes\n \n Now will you tell us that Venus is larger than the Earth as well?\n \n How about Jupiter's moon Io? Must it actually be bigger than the Earth also according to your theory?\n \n Highest Mountains of Io** \n (only above 9 km height) \n \n 18.2 km 271s10 Boösaule Montes \n 13.4 km 335s47 Euboea Montes \n 12.7 km 236n08 Ionian Mons \n 11.2 km 057n42 \n 11.1 km 082s02 Hi'iaka Montes N \n 11 km 087n18 \n 11 km 194n59 \n 10.8 km 046s70 Haemus Montes \n 10.7 km 036n70 \n 10.6 km 238s32 Caucasus Mons \n 10.0 km 258s40 Egypt Mons \n 9.6 km 337n56 \n 9.5 km 121s16 \n 9.5 km 015s14 \n 9.2 km 193s22 Dorian Montes N \n 9.1 km 205n54 \n \n http://planetologia.elte.hu/io/index.phtml?nev=height", 
   {}, 
   324040, 
   null, 
   1221694620.0
  ], 
  [
   324045, 
   null, 
   "Peeling", 
   "The link that you have given is very useful. :)\n \n Anyhow: where and when was this \"Mass and size determined accurately from early missions\"?\n \n Moreover, we did not speak about the interior of Mars (: the crust, mantle and core); but we said about the total mass and size of Mars, to which we have many hints:\n\n Um, the crust, mantle and core ARE the total mass and size of Mars :)\n \n Tell me something: why don't you include in those 'hints' the fact that we know how far away Mars is and how big it looks? It's like you're saying an obviously short person might be tall because he's got a lot of hair and big shoes. There's a perfectly straightforward trigonometric method for knowing the size of Mars, confirmed and refined by the Mariner probes. Not only did they establish the mass and size of Mars so as to make possible later orbital insertions, they measured the very, very thin atmosphere which made it possible to design landers that would descend safely through it. The very, very thin atmosphere which has been subsequently confirmed over and over again from the surface.\n \n Mars has been observed and measured literally millions of times over by professionals and amateurs alike. Not one of them has ever said 'Hey, you know - Mars looks twice as big as it should - what's up with that?'. We've sent probes past it, analysed the composition of the crust and mantle and atmosphere, and still nobody has said 'Hang on, it's over twice as big as we thought. Our probes were out of contact with Earth for twice as long as expected!\" We've put spacecraft into precisely calculated orbits around it, landed machines on it even, without ever bumping up against the inconvenience of it being over twice as big as we thought. We can map images from the whole planet onto a 4200mile scale sphere without having loads left over. Yet you prefer to believe the work of someone who themselves never studied Mars directly at all, who simply thought that the planets ought to be in size order, and satisfied himself to that effect using balls and elastic. Don't you think that's a little... silly?\n \n Now, I have a straightforward balls-related challenge for you. I want you to take two spheres of different size - say a tennis ball and a ping-pong ball - and I want you to position them so that they satisfy the following criteria simultaneously:\n \n 1. They look the same size to you. This represents the fact that Mars looks the same size to you as it does to NASA, yet you believe it to be over twice the actual size.\n 2. They are the same distance away from you. This represents the fact that you agree with NASA how far away Mars is.\n \n You've claimed this is possible, so explain how!", 
   {}, 
   324025, 
   null, 
   1221699360.0
  ], 
  [
   324095, 
   null, 
   "eanassir", 
   "Um, the crust, mantle and core ARE the total mass and size of Mars :)\n \n\n \n We did not speak about the ratio of the crust, mantle and core of Mars; we speak about the actual size and mass of Mars.\n \n \n\n Tell me something: why don't you include in those 'hints' the fact that we know how far away Mars is and how big it looks? It's like you're saying an obviously short person might be tall because he's got a lot of hair and big shoes. There's a perfectly straightforward trigonometric method for knowing the size of Mars, confirmed and refined by the Mariner probes. Not only did they establish the mass and size of Mars so as to make possible later orbital insertions, they measured the very, very thin atmosphere which made it possible to design landers that would descend safely through it. The very, very thin atmosphere which has been subsequently confirmed over and over again from the surface.\n \n\n \n Tell me why you don't consider these points seriously, and many others that are coming every day!\n I asked which Mariner and when and how, but no answer!\n The thin atmosphere that you speak about is carrying the cloud with the dust at more altitude than that of the Earth; for this reason the afterglow lasts longer.\n \n \n \n\n Mars has been observed and measured literally millions of times over by professionals and amateurs alike. Not one of them has ever said 'Hey, you know - Mars looks twice as big as it should - what's up with that?'. We've sent probes past it, analysed the composition of the crust and mantle and atmosphere, and still nobody has said 'Hang on, it's over twice as big as we thought. Our probes were out of contact with Earth for twice as long as expected!\" We've put spacecraft into precisely calculated orbits around it, landed machines on it even, without ever bumping up against the inconvenience of it being over twice as big as we thought. We can map images from the whole planet onto a 4200mile scale sphere without having loads left over. Yet you prefer to believe the work of someone who themselves never studied Mars directly at all, who simply thought that the planets ought to be in size order, and satisfied himself to that effect using balls and elastic. Don't you think that's a little... silly?\n \n\n \n This is not a scientific way of deduction.\n \n \n\n Now, I have a straightforward balls-related challenge for you. I want you to take two spheres of different size - say a tennis ball and a ping-pong ball - and I want you to position them so that they satisfy the following criteria simultaneously:\n \n 1. They look the same size to you. This represents the fact that Mars looks the same size to you as it does to NASA, yet you believe it to be over twice the actual size.\n 2. They are the same distance away from you. This represents the fact that you agree with NASA how far away Mars is.\n \n You've claimed this is possible, so explain how!\n\n \n This experiment is not relevant; to me Mars is bigger, to NASA (till now) it is smaller.:)\n http://universeandquran.741.com/../My%20Webs/new_page_2.htm#Traveling to Mars\n \n http://universeandquran.741.com/../My%20Webs/new_page_2.htm#Emigration to Mars\n \n \n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   324045, 
   null, 
   1221750180.0
  ], 
  [
   324137, 
   null, 
   "Peeling", 
   "We did not speak about the ratio of the crust, mantle and core of Mars; we speak about the actual size and mass of Mars.\n\n Which is what was measured, in order to determine the ratios above. You haven't read the article carefully: in order to determine the core size of Mars they needed four pieces of information, of which they obtained three: the size, mass, and moment of inertia of the planet. The remaining piece of information, the composition of the core, remains indeterminate.\n \n Happy now? They deliberately set out to measure the size and mass of Mars, and later the moment of inertia, in order to estimate core size. \n \nTell me why you don't consider these points seriously, and many others that are coming every day!\n\n I have considered them. I, and others, have patiently explained why smaller planets permit the existence of taller mountains and a taller atmospheric column. All your questions have been answered - unlike the one I have posed you several times now in different ways: if Mars is twice as big, why doesn't it look twice as big?\n \nI asked which Mariner and when and how, but no answer!\n\n Maybe this will help:\n \nFour years later the twin spacecraft Mariner 6 and Mariner 7 flew by Mars again, carrying cameras and spectrometers to measure the temperature of Mars' surface and the composition of its atmosphere. Their photos again showed no canals or other signs of life, but did reveal a volcano, plains without impact craters, and areas of chaotic hills. Mars' mass and density were calculated from spacecraft tracking.\n\n \nThe thin atmosphere that you speak about is carrying the cloud with the dust at more altitude than that of the Earth; for this reason the afterglow lasts longer.\n\n So what? Are you trying to say that the atmosphere isn't thin? Because any number of satellite measurements, backed up by direct lander measurements taken several times a day confirm that it is thin, and virtually oxygen-free. \n \nThis is not a scientific way of deduction.\n\n On the contrary, all these millions of independent observations of mars used science to determine its size. You are the only one here saying that we should ignore every single piece of evidence available to us regarding the size of mars :)\n \nThis experiment is not relevant; to me Mars is bigger, to NASA (till now) it is smaller.:)\n\n The experiment is absolutely relevant. You say mars can be twice as big without looking twice as big and without being any further away. I await your demonstration of how this is possible with some eagerness :)", 
   {}, 
   324095, 
   null, 
   1221762240.0
  ], 
  [
   324156, 
   null, 
   "eanassir", 
   "Which is what was measured, in order to determine the ratios above. You haven't read the article carefully: in order to determine the core size of Mars they needed four pieces of information, of which they obtained three: the size, mass, and moment of inertia of the planet. The remaining piece of information, the composition of the core, remains indeterminate.\n \n\n \n They depended on their past measurement of the size and mass. They did not do a new measuring.\n \n \n \n\n All your questions have been answered - unlike the one I have posed you several times now in different ways: if Mars is twice as big, why doesn't it look twice as big?\n \n\n \n Will it be big as twice compared to what, or in relation to what? Because we see it in such size from faraway, then you say it is small, and I say it is big.\n \n \n\n Maybe this will help:\n So what? Are you trying to say that the atmosphere isn't thin? Because any number of satellite measurements, backed up by direct lander measurements taken several times a day confirm that it is thin, and virtually oxygen-free. \n \n\n \n This is a good link indeed; but read it carefully: they did not do any new measuring of the size and mass of Mars; they depended on their past presumptive figures; they set out with their cameras and spectrometers to photograph its surface and to estimate its atmospheric constituents.\n \n The orbiter will estimate the constituents of the atmosphere using the spectrometer which will give a general idea about the constituents of the column of the atmosphere from above down, and will not discriminate the different layers of the atmosphere and their constituents. The most important is the air of the planet which is at the surface level; i.e. the troposphere; while the orbiter will give a rough idea about the constituents of all the layers in general.\n \n In other words: the atmosphere of Mars (like that of Earth) may include some constituent gases that are toxic and suffocating to living beings, but high up in the upper atmospheric layers, while the troposphere near the surface of the planet may be more suitable for life. \n \n The lander will have more chance to estimate the constituents at the surface level; this we don't know how they will estimate it: will they use the spectrometer or some other method? \n \n \n \n\n The experiment is absolutely relevant. You say mars can be twice as big without looking twice as big and without being any further away. I await your demonstration of how this is possible with some eagerness :)\n\n \n As I said: Will it be big as twice compared to what, or in relation to what? Because we see it in such size from faraway, then you say it is small, and I say it is big. :)", 
   {}, 
   324137, 
   null, 
   1221774420.0
  ], 
  [
   324157, 
   null, 
   "isly ilwott", 
   "This is beyond comical.", 
   {}, 
   324156, 
   null, 
   1221775740.0
  ], 
  [
   324158, 
   null, 
   "Kronus", 
   "This is beyond comical.\n\n \n And not just in terms of what eanassir is saying. I find people's insistance on using logic and reasoning with him just as baffling as his refusal to listen to logic and reason.", 
   {}, 
   324157, 
   null, 
   1221777120.0
  ], 
  [
   324226, 
   null, 
   "eanassir", 
   "This is beyond comical.\n\n \n Let us laugh together, but at me or at you?", 
   {}, 
   324157, 
   null, 
   1221805260.0
  ], 
  [
   324227, 
   null, 
   "eanassir", 
   "And not just in terms of what eanassir is saying. I find people's insistance on using logic and reasoning with him just as baffling as his refusal to listen to logic and reason.\n\n \n Do the logic and reason prevent you from investigating anything?\n \n This is in the Quran 16: 83\n &#1610;&#1614;&#1593;&#1618;&#1585;&#1616;&#1601;&#1615;&#1608;&#1606;&#1614; &#1606;&#1616;&#1593;&#1618;&#1605;&#1614;&#1578;&#1614; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1579;&#1615;&#1605;&#1617;&#1614; &#1610;&#1615;&#1606;&#1603;&#1616;&#1585;&#1615;&#1608;&#1606;&#1614;&#1607;&#1614;&#1575; &#1608;&#1614;&#1571;&#1614;&#1603;&#1618;&#1579;&#1614;&#1585;&#1615;&#1607;&#1615;&#1605;&#1615; &#1575;&#1604;&#1618;&#1603;&#1614;&#1575;&#1601;&#1616;&#1585;&#1615;&#1608;&#1606;&#1614;\n The explanation:\n \n (They recognize the blessing of God, then they deny it, and the most of them are the ungrateful.)\n \n It means: they know that all the blessing which they have is from God, but they attribute all that to their idols [and their associates like the Christ and others]; and nowadays most of them are ungrateful to such blessings of God, and say: \n \"The blessing that we have is [not from God, but] only because of our science and our cleverness at industry and trade.\"", 
   {}, 
   324158, 
   null, 
   1221805560.0
  ], 
  [
   324230, 
   null, 
   "eanassir", 
   "Actually, these are all direct evidence that Mars is smaller than Earth. Bigger mountains, deeper canyons, and higher atmosphere are all the result of less gravity; that is, a smaller planet.\n \n This guy is clearly beyond hope, he simply will never listen to anything that contradicts his own personal reality.\n\n \n Do you expect then that a planet as large as Jupiter includes low mountains and low atmosphere?\n \n Of course, this is obviously wrong, and Jupiter has a tremendous atmosphere attracted to it by its great gravity; which led them to misestimate the nature of Jupiter when they said Jupiter is a gaseous planet, while it is not; only it has a tremendous atmosphere attracted to it by its great gravity. \n \n moreover Jupiter has more chance of having taller and larger mountains; because most of the moutains were not from the planet in origin, but they fell on it and they anchored firmly on its surface, and carried the life seed to the planet. The planet -by its gravity - drew the portions of some destroyed planets, and they fell on it in the ancient past.\n http://universeandquran.741.com/../My%20Webs/new_page_2.htm#Mountains\n \n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   324032, 
   null, 
   1221807720.0
  ], 
  [
   324239, 
   null, 
   "Peeling", 
   "They depended on their past measurement of the size and mass. They did not do a new measuring.\n\n Wrong again; sorry:\n \nMars' mass and density were calculated from spacecraft tracking. \n\n So clearly they did do fresh measurements, using the telemetry from the spacecraft as they passed Mars and were deflected by its gravity.\n \nWill it be big as twice compared to what, or in relation to what? Because we see it in such size from faraway, then you say it is small, and I say it is big.\n\n Which means you must think it to be further away :) \n \nThis is a good link indeed; but read it carefully: they did not do any new measuring of the size and mass of Mars;\n\n I did read it carefully - certainly more carefully than you appeared to do because you missed the part where they used spacecraft telemetry to calculate the mass of Mars :)\n \nThe orbiter will estimate the constituents of the atmosphere using the spectrometer which will give a general idea about the constituents of the column of the atmosphere from above down, and will not discriminate the different layers of the atmosphere and their constituents.\n\n Wrong again. The tests looked through the atmosphere across the horizon of the planet, and were thus able to profile the atmospheric column:\n http://img519.imageshack.us/img519/4143/atmosphererk5.gif\n \nThe lander will have more chance to estimate the constituents at the surface level; this we don't know how they will estimate it: will they use the spectrometer or some other method? \n\n Never mind will, several landers already have. The result? Surface pressure 0.7% (seven thousandths) that of Earth, and 1/30,000th the amount of oxygen.\n \n Atmosphere measured during descent.\n Atmosphere measured on an ongoing basis from the ground.\n \nAs I said: Will it be big as twice compared to what, or in relation to what?\n\n The size it looks now, of course. If you feed its known distance, and known apparent size into the trig equations, you deduce that it is around 4,200 miles across. If it were the same distance away but over 8,000 miles across, the apparent size would be twice what it is. There's nothing magical or even especially complicated about this: if Mars were twice as big it would look twice as big - unless it was also twice as far away, which it clearly isn't because we've been there. :)\n \n You still don't seem to have grasped the rigid relationship between size, apparent size and distance. It's simple trigonometry. Mars's apparent size is the same to both of us, yes? So either it's small and close, or large and far away. It can't be both large and close, because then it would look bigger than it does. Hence the experiment with the ping-pong ball and the tennis ball: I want you to appreciate the impossibility of a big thing looking small without also being further away.\n \n From here, a history of our study of Mars:\n \nHerschel calculated the diameter of Mars to be 0.55 times that of the Earth, and he found its figure to be just as flattened as that of Jupiter---the ratio of the equatorial to the polar diameter he put at 16/15.\n\n \nSchroeter['s]... measures of the diameter of the planet were very close to those of Herschel, though he determined that the equatorial and polar diameters agreed to within 1/81 (in this he was more nearly correct than Herschel; the polar and equatorial diameters are now known to agree to within 1/500).\n\n That's from chapter 3 of 15. I highly recommend you read the entirety of the book, and consider whether it's possible for every single one of these people - not to mention tens of thousands of amateurs - observing and measuring Mars night in and night out for years, to have failed to notice that it looks twice as big as it should. \n \n Add to that the fact we have satellites orbiting Mars right now, and the diameter of their orbit is smaller than you claim the planet to be. According to you, they're orbiting a thousand miles or so underground. Which is a neat trick - how do you think NASA pulled it off? :)", 
   {}, 
   324156, 
   null, 
   1221820380.0
  ], 
  [
   324242, 
   null, 
   "eanassir", 
   "Wrong again; sorry:\n \n So clearly they did do fresh measurements, using the telemetry from the spacecraft as they passed Mars and were deflected by its gravity.\n \n Which means you must think it to be further away :) \n \n I did read it carefully - certainly more carefully than you appeared to do because you missed the part where they used spacecraft telemetry to calculate the mass of Mars :)\n \n Wrong again. The tests looked through the atmosphere across the horizon of the planet, and were thus able to profile the atmospheric column:\n http://img519.imageshack.us/img519/4143/atmosphererk5.gif\n \n Never mind will, several landers already have. The result? Surface pressure 0.7% (seven thousandths) that of Earth, and 1/30,000th the amount of oxygen.\n \n The size it looks now, of course. If you feed its known distance, and known apparent size into the trig equations, you deduce that it is around 4,200 miles across. If it were the same distance away but over 8,000 miles across, the apparent size would be twice what it is. There's nothing magical or even especially complicated about this: if Mars were twice as big it would look twice as big - unless it was also twice as far away, which it clearly isn't because we've been there. :)\n \n You still don't seem to have grasped the rigid relationship between size, apparent size and distance. It's simple trigonometry. Mars's apparent size is the same to both of us, yes? So either it's small and close, or large and far away. It can't be both large and close, because then it would look bigger than it does. Hence the experiment with the ping-pong ball and the tennis ball: I want you to appreciate the impossibility of a big thing looking small without also being further away.\n\n \n Peeling :) thank you for being so patient in trying to explain the things; but eventhough try also to understand the things from the other aspect.\n \n Mars is farther from the Earth in regards to the Sun; its distance from the Sun is almost the same or about that; the Earth distance from the Sun is similarly fixed or about that; but the distance of Mars from the Earth is variable; therefore we see it apparently with different sizes every now and then.\n \n Why (for measuring the size and mass) don't they use their orbiters, rather than a spacecraft that passed by the planet?\n \n About their estimation of the atmosphere, refer to your diagram, the lower ray will show the layers of all the atmosphere and not only surface air constituents. The surface air is the important factor for the living beings on the planet, which is the case also for the Earth.\n \n See also the Hubble images of Mars: how they display the continents, oceans, polar caps and clouds; as if you see the Earth, but in another map. Then why when they go there to Mars, the thing will be different: all the land will be red, everything is desolate and dead; the rivers and seas are there but only look brown and dead??\n \n I here strongly affirm that the planet Mars is different from either Mercury and Venus which are dead and desolate; and that Mars with its clear atmosphere and its polar water ice and its cloud and fog, does certainly include life and intelligent life in the form of people, but some other races may be seen; and this will be fulfilled in the near future; and we shall see.\n \n Moreover, I say clearly that there are people on Mars and many other planets of our solar system (with the exception of Mercury and Venus which have entered the phase of their Last Day with no alternation of the night and day)\n \n The Glorious Quran says clearly about the existence of people on many of the planets, and that there may happen a meeting between the inhabitants of the Earth with the inhabitants of some other planets of our solar system; and Mars, the most known and nearest of these planets to us, is the most expected planet for this incidence.:)\n \n For more information, go to our website \n http://universeandquran.741.com\n then see the list of the contents and click on:\n The planets are inhabited\n An anticipated meeting between the inhabitants of Earth and the inhabitants of some other planets\n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   324239, 
   null, 
   1221824160.0
  ], 
  [
   324243, 
   null, 
   "Peeling", 
   "Mars is farther from the Earth in regards to the Sun; its distance from the Sun is almost the same or about that; the Earth distance from the Sun is similarly fixed or about that; but the distance of Mars from the Earth is variable; therefore we see it with different sizes every now and then.\n\n Quite true, but at any given time we know how far away it is, and from that and its apparent size at that time we can calculate its actual size. And it's always the same result. If you use trigonometry to establish the actual size of a football ten feet away, and then do the same when it is twenty feet away, you will get the same answer: apparent size and distance vary in inverse proportion, with actual size remaining constant.\n \nAbout their estimation of the atmosphere, refer to your diagram, the lower ray will show the layers of all the atmosphere and not only surface air constituents.\n\n True, but again, it doesn't matter: the unimpeded results from the upper layers can be progressively subtracted from those returning from the lower, mixed results so as to reveal the constitution of the lower layers. These results are confirmed by the direct measurement of the atmosphere at all levels via the instrument used during the descent of the Pathfinder probe, and the direct and ongoing measurement of the atmosphere at surface level by the Phoenix lander. Quite simply, you are wrong about the atmosphere of Mars. Every which way we measure it, it is over a hundred times thinner than that of earth with 1/30,000th the amount of oxygen.\n \nSee also the Hubble images of Mars: how they display the continents, oceans, polar caps and clouds; \n\n No, they don't. They show land, polar caps of frozen water and carbon dioxide, and clouds. There are no oceans.\n \nThen why when they go there to Mars, the thing will be different: all the land will be red, everything is desolate and dead; the rivers and seas are there but only look brown and dead??\n\n The rivers and seas are not there. You are looking at clouds and atmospheric haze, which move around from day to day and hour to hour in a way that would be impossible for rivers and seas.\n \nI here strongly affirm that the planet Mars is different from either Mercury and Venus which are dead and desolate;\n\n And I strongly agree. There may even be some kind of life on Mars. But that doesn't make you right about anything else you're saying here :)\n \n and that Mars with its clear atmosphere and its polar water ice and its cloud and fog, does certainly include life and intelligent life in the form of people, but some other races may be seen; and this will be fulfilled in the near future; and we shall see.\n\n No, we will not. It's impossible for people to live at the summit of Everest, let alone on Mars where there is 10,000 times less oxygen at the surface than on top of Everest. The whole surface has been mapped from orbit, and there are no seas, rivers, vegetation, structures - they're just not there.\n \n I recommend to your attention the history of our observations of Mars I linked in my last post. The size of Mars has been repeatedly established and re-established by different people using different equipment. It has been studied for hundreds of years by tens of thousands of people, and it is not bigger than Earth. Why do you continue to believe someone who never studied Mars over the tens of thousands of people who have?", 
   {}, 
   324242, 
   null, 
   1221826920.0
  ], 
  [
   324244, 
   null, 
   "eanassir", 
   "Quite true, but at any given time we know how far away it is, and from that and its apparent size at that time we can calculate its actual size. And it's always the same result. If you use trigonometry to establish the actual size of a football ten feet away, and then do the same when it is twenty feet away, you will get the same answer: apparent size and distance vary in inverse proportion, with actual size remaining constant.\n \n True, but again, it doesn't matter: the unimpeded results from the upper layers can be progressively subtracted from those returning from the lower, mixed results so as to reveal the constitution of the lower layers. These results are confirmed by the direct measurement of the atmosphere at all levels via the instrument used during the descent of the Pathfinder probe, and the direct and ongoing measurement of the atmosphere at surface level by the Phoenix lander. Quite simply, you are wrong about the atmosphere of Mars. Every which way we measure it, it is over a hundred times thinner than that of earth with 1/30,000th the amount of oxygen.\n \n No, they don't. They show land, polar caps of frozen water and carbon dioxide, and clouds. There are no oceans.\n \n The rivers and seas are not there. You are looking at clouds and atmospheric haze, which move around from day to day and hour to hour in a way that would be impossible for rivers and seas.\n \n And I strongly agree. There may even be some kind of life on Mars. But that doesn't make you right about anything else you're saying here :)\n \n No, we will not. It's impossible for people to live at the summit of Everest, let alone on Mars where there is 10,000 times less oxygen at the surface than on top of Everest. The whole surface has been mapped from orbit, and there are no seas, rivers, vegetation, structures - they're just not there.\n \n I recommend to your attention the history of our observations of Mars I linked in my last post. The size of Mars has been repeatedly established and re-established by different people using different equipment. It has been studied for hundreds of years by tens of thousands of people, and it is not bigger than Earth. Why do you continue to believe someone who never studied Mars over the tens of thousands of people who have?\n\n \n Amigo:) some scientists are certainly good :) but they are liable to mistake; the science may do mistake then correct it, and discover the wrong to correct it. So by this way does science progress; you cannot insist on something absolutely and say this is so and it can't be any other way.\n \n It is so obvious that they have inserted and invented many scienitfic sets, and they have made much effort, but that does not mean they have known everything.\n \n E.g. they, as do you say, have precisely measured the constituents of the atmosphere of Mars; but this cannot be absolutely true. I tell you why: in fact they have not precisely known the constituents of the atmosphere of the Earth itself, and to prove this: I ask you what are the constituents and the sublayers of the stratosphere here on Earth? So they should know the srtatosphere layer constituents and sublayers, before they claim having known the layers and constituent gases of the Mars atmsophere! :)", 
   {}, 
   324243, 
   null, 
   1221830820.0
  ], 
  [
   324248, 
   null, 
   "Peeling", 
   "Amigo:) some scientists are certainly good :) but they are liable to mistake; the science may do mistake then correct it, and discover the wrong to correct it. So by this way does science progress; you cannot insist on something absolutely and say this is so and it can't be any other way.\n\n Eanassir, satellites cannot orbit under the ground. The trigonometric method is mathematically proven. These are fundamental, inescapable truths against which you have decided to pit yourself. You aren't going to win :)\n \n I do agree that we should always be open to the possibility of error. But you are misusing that noble principle by claiming that it offers you some hope of being correct. It does not. If you say that your friend is six feet tall, and I - who have never met your friend - say \"no, I have thought about this very carefully and decided that he is twelve feet tall\", does the fact you might well be wrong by half an inch or so make it likely that I'm right? Equally, we might be wrong about the diameter of Mars - by a few miles. It's absolutely impossible for us to be wrong by over 4,000 miles. Nothing we've ever done with regards to orbiting or exploring Mars would have worked if it was.\n \n The 'clues' you keep talking about are nothing of the sort. It's like saying: \"The blue whale eats smaller prey than the dolphin, which is a clue that the blue whale may be smaller.\" It's nonsense.\n \nE.g. they, as do you say, have precisely measured the constituents of the atmosphere of Mars; but this cannot be absolutely true. I tell you why: in fact they have not precisely known the constituents of the atmosphere of the Earth itself, and to prove this: I ask you what are the constituents and the sublayers of the stratosphere here on Earth?\n\n I'm happy to oblige. Not that this is relevant, since it's the surface atmosphere of Mars you keep saying would support life, which direct measurement by Phoenix and other landers disproves.\n \n Any luck with the ping-pong ball and the tennis ball yet?", 
   {}, 
   324244, 
   null, 
   1221836580.0
  ], 
  [
   324266, 
   null, 
   "eanassir", 
   " Eanassir, satellites cannot orbit under the ground. The trigonometric method is mathematically proven... :)\n \n\n \n :)\n No objection.\n \n \n\n I do agree that we should always be open to the possibility of error. But you are misusing that noble principle by claiming that it offers you some hope of being correct. It does not. If you say that your friend is six feet tall, and I - who have never met your friend - say \"no, I have thought about this very carefully and decided that he is twelve feet tall\", does the fact you might well be wrong by half an inch or so make it likely that I'm right?\n \n\n \n These are some of your assertions, to which you give a non-relevant example.\n \n \n\n Equally, we might be wrong about the diameter of Mars - by a few miles. It's absolutely impossible for us to be wrong by over 4,000 miles. Nothing we've ever done with regards to orbiting or exploring Mars would have worked if it was.\n \n\n \n Don't be too optimistic.\n \n \n\n The 'clues' you keep talking about are nothing of the sort. It's like saying: \"The blue whale eats smaller prey than the dolphin, which is a clue that the blue whale may be smaller.\" It's nonsense.\n \n\n \n What's this? And once again we return to your \"nonsense\".\n \n \n\n I'm happy to oblige. \n \n\n \n This is not enough; the stratosphere has some stable sublayers to which it has specific weights of the constituent gases; (about which their knowledge is defective); because no wind there to mix these gases, while in the troposphere below the turbulance will mix the gases and so they will not be separated into distinctive layers (contrary to the layers above: from the stratosphere and above.)\n http://universeandquran.741.com/#Gaseous%20Heavens\n \n \n\n Any luck with the ping-pong ball and the tennis ball yet? \n\n [/QUOTE]\n \n Anticipate my post about the ping-pong ball and the tennis ball. :)", 
   {}, 
   324248, 
   null, 
   1221850200.0
  ], 
  [
   324273, 
   null, 
   "eanassir", 
   "\n True, but again, it doesn't matter: the unimpeded results from the upper layers can be progressively subtracted from those returning from the lower, mixed results so as to reveal the constitution of the lower layers. \n \n\n \n :)\n It is not so correct that by subtraction of the constituents of the upper from the lower that you will reach to some precize results; some constituents are shared between the upper and lower layers as do they claim.\n \n Moreover the spectrometry may to some extent give the idea of what constituents are there, but it does not give anything about their concentration in the atmsophere.\n \n \n\n These results are confirmed by \n the direct measurement of the atmosphere at all levels via the instrument used during the descent of the Pathfinder probe, \n and the direct and ongoing measurement of the atmosphere at surface level by the Phoenix lander. \n \n\n \n During the descent, they try with their intelligence and cleverness to study what gases are there in different layers, but still this cannot be so precize.\n \n While according to the Lander, we don't know about their exact method of estimating the constituents of the air at the surface level; about the pressure they may give good results, but about the constituents of the air, I don't know for certain.\n :)", 
   {}, 
   324243, 
   null, 
   1221851580.0
  ], 
  [
   324567, 
   null, 
   "Peeling", 
   "<trigonometric method proven<No objection.\n\n Then the point is made. You've agreed that we know the correct distance to Mars at any given time, and the visible size may be measured by anyone with a telescope. Thus we know Mars is smaller than Earth.\n \nThese are some of your assertions, to which you give a non-relevant example.\n\n It's perfectly relevant. You are using the error margin in our measurements of Mars to wrongly infer that your belief that it is larger than Earth might be correct.\n \nDon't be too optimistic.\n\n I don't need to be optimistic at all. If spacecraft were only now on their way to Mars to orbit or land upon it for the first time, I would be optimistic that our remote measurements of it were accurate. But the fact is those spacecraft are there right now, both in orbit and safely landed upon the surface, after 1) the trajectories calculated for orbiting a 4,200 mile diameter planet, 2) aerobraking manoeuvres and 3) descent shielding - the latter two designed for the thin Martian atmosphere - all worked. There is no requirement for optimism because all the empirical tests for the size, mass, and atmospheric density of Mars have been passed.\n \nWhat's this? And once again we return to your \"nonsense\".\n\n Precisely: inferring that a blue whale is smaller than a dolphin from the size of the prey it eats is nonsense. Just as it is nonsense to infer that Mars is bigger than Earth because it spins more slowly, has a longer sunset, and a couple of taller mountains.\n \nThis is not enough; the stratosphere has some stable sublayers to which it has specific weights of the constituent gases; (about which their knowledge is defective); because no wind there to mix these gases, while in the troposphere below the turbulance will mix the gases and so they will not be separated into distinctive layers (contrary to the layers above: from the stratosphere and above.)\n\n So what? The layering or trace element composition of the stratosphere - the analysis of which is difficult purely because of its distance from the ground - is not and has never been the issue. The issue is the surface pressure and composition of the Martian atmosphere, directly measured on an ongoing moment-by-moment basis by the landers.\n \nAnticipate my post about the ping-pong ball and the tennis ball. :)\n\n Eagerly :)\n \nIt is not so correct that by subtraction of the constituents of the upper from the lower that you will reach to some precize results; some constituents are shared between the upper and lower layers as do they claim.\n\n Doesn't matter. Referring back to the diagram, the uppermost layer can be directly analysed, yes? Moving downward, the next layer will exhibit a geometrically calculable fraction of the uppermost layer's characteristics, plus its own - and so on down to the surface. The results thus obtained were confirmed by direct measurement during the Pathfinder lander's descent.\n \nWhile according to the Lander, we don't know about their exact method of estimating the constituents of the air at the surface level; about the pressure they may give good results, but about the constituents of the air, I don't know for certain.\n\n If the pressure is a sound result, that alone proves there are no people on Mars. The atmospheric pressure is only 0.7% that at Earth's surface. Even if, in defiance of all spectroscopic measurement, it were pure oxygen, that would be less than a tenth what is necessary to support human life.", 
   {}, 
   324266, 
   null, 
   1222082760.0
  ], 
  [
   324592, 
   null, 
   "gansao", 
   "Maybe the British Beagle explorer crashed because we did not know that Mars was bigger than Earth. Not the fact that it was made out of balsa wood and elastic bands!", 
   {}, 
   324567, 
   null, 
   1222097100.0
  ], 
  [
   324620, 
   null, 
   "smiley", 
   "Maybe the British Beagle explorer crashed because we did not know that Mars was bigger than Earth. Not the fact that it was made out of balsa wood and elastic bands!\n\n Well, if it was trying to explore British Beagles then Mars was the wrong place to go, it should have just explored Britain. :)", 
   {}, 
   324592, 
   null, 
   1222105560.0
  ], 
  [
   324634, 
   null, 
   "gansao", 
   "It's a bit late to tell us now:)", 
   {}, 
   324620, 
   null, 
   1222108080.0
  ], 
  [
   324669, 
   null, 
   "smiley", 
   "It's a bit late to tell us now:)\n\n You never know, though. Maybe there are beagles on the bit of Mars eanassir has recently discovered. If not, maybe Sirius is the next place to look. There are bound to be some there. emoticon_frazzled", 
   {}, 
   324634, 
   null, 
   1222114560.0
  ], 
  [
   324690, 
   null, 
   "gansao", 
   "If Britain going to send a probe to Sirius we will need a bigger catapult!", 
   {}, 
   324669, 
   null, 
   1222117020.0
  ], 
  [
   324711, 
   null, 
   "Penfold", 
   "...and more bubblewrap for the landing! emoticon_xagree", 
   {}, 
   324690, 
   null, 
   1222120800.0
  ], 
  [
   324714, 
   null, 
   "gansao", 
   "...and more bubblewrap for the landing! emoticon_xagree\n\n \n emoticon_xhohoemoticon_xhoho", 
   {}, 
   324711, 
   null, 
   1222121280.0
  ], 
  [
   324985, 
   null, 
   "eanassir", 
   "You never know, though. Maybe there are beagles on the bit of Mars eanassir has recently discovered. If not, maybe Sirius is the next place to look. There are bound to be some there. emoticon_frazzled\n\n \n Sirius is a star which is flaming and extremely hot, and cannot bear life; but Mars is an earth or a planet like our Earth; Mars and the rest of the planets do bear life (with the exception of Mercury and Venus on which life was exterminated following their cessation from rotation around their axes.)\n [url]http://universeandquran.741.com <<< the list of contents <<< then click on:\n The planets are inhabited \n \n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   324669, 
   null, 
   1222268640.0
  ], 
  [
   325005, 
   null, 
   "ServantOfChrist", 
   "Sirius is a star which is flaming and extremely hot, and cannot bear life; but Mars is an earth or a planet like our Earth; Mars and the rest of the planets do bear life (with the exception of Mercury and Venus on which life was exterminated following their cessation from rotation around their axes.)\n [url]http://universeandquran.741.com <<< the list of contents <<< then click on:\n The planets are inhabited \n \n \n eanassir\n http://universeandquran.741.com\n\n \n Venus and Mercury still rotate around their axes. \n \n If they didn't rotate they'd have one side that was scalding hot and another that was frigid cold from lack of sun radiation.\n \n They don't.\n \n In fact Venus is unusual and unique in its clockwise, retrograde rotation (as compared to most of the other planets which rotate counter-clockwise)", 
   {}, 
   324985, 
   null, 
   1222272720.0
  ], 
  [
   325006, 
   null, 
   "eanassir", 
   " Then the point is made. You've agreed that we know the correct distance to Mars at any given time, and the visible size may be measured by anyone with a telescope. Thus we know Mars is smaller than Earth.\n \n\n \n Why shouldn't they re-estimate the measurements from the start? It may reveal something else than what you assert. Moreover, don't over-evaluate their capabilities: See the recent images do not show clearly every foot and every inch as do some claim. However, in the following days God - be glorified - may enable them, if He please, to achieve more advances in this respect.\n \n \n\n So what? The layering or trace element composition of the stratosphere - the analysis of which is difficult purely because of its distance from the ground - is not and has never been the issue. \n \n\n \n Is our distance from our stratosphere farther or is our distacne from Mars? So in case they are unable to estimate precizely such constituents of the Earth atmosphere, then how could they do that on Mars?\n \n In addition, using the spectrometer will not enable us to know the concentration of such gases and sublayers, but only to some extent their existence there in the atmosphere. :)\n \n \n\n Doesn't matter. Referring back to the diagram, the uppermost layer can be directly analysed, yes? Moving downward, the next layer will exhibit a geometrically calculable fraction of the uppermost layer's characteristics, plus its own - and so on down to the surface. The results thus obtained were confirmed by direct measurement during the Pathfinder lander's descent.\n \n\n \n \n\n If the pressure is a sound result, that alone proves there are no people on Mars. The atmospheric pressure is only 0.7% that at Earth's surface. Even if, in defiance of all spectroscopic measurement, it were pure oxygen, that would be less than a tenth what is necessary to support human life. \n\n \n These may easily be proved not correct, in the near future. Moreover, human beings have been adapted to various circumstances: Eskimo living in the frozen regions; the Africans living in the hot forests; the Tibetean living in high altitudes...etc.", 
   {}, 
   324567, 
   null, 
   1222272840.0
  ], 
  [
   325007, 
   null, 
   "Kronus", 
   "Sirius is a star which is flaming and extremely hot, and cannot bear life; \n\n Sirius is the Dog Star. If you want to go looking for beagles, a type of dog, you should look there. It's a joke, see? :)", 
   {}, 
   324985, 
   null, 
   1222273080.0
  ], 
  [
   325010, 
   null, 
   "eanassir", 
   " Venus and Mercury still rotate around their axes. \n \n\n \n \n \n\n If they didn't rotate they'd have one side that was scalding hot and another that was frigid cold from lack of sun radiation.\n They don't.\n \n\n \n See what is there on Mercury and Venus, before asserting such a thing: See their extreme temperatures, the perpetual cloud of Venus atmosphere, and the very thin or lost atmosphere of Mercury.\n \n Venus:\n http://solarsystem.nasa.gov/multimedia/gallery/Venus_Clouds.jpg\n \n Mercury:\n http://www.nasa.gov/images/content/210544main_geo_hist2.jpg \n \n \n \n\n In fact Venus is unusual and unique in its clockwise, retrograde rotation (as compared to most of the other planets which rotate counter-clockwise) \n\n \n This indicates and points out to the same idea of their cessation from rotation around themselves.\n \n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   325005, 
   null, 
   1222274160.0
  ], 
  [
   325037, 
   null, 
   "Peeling", 
   "Why shouldn't they re-estimate the measurements from the start?\n\n They have, many many times over the last hundred years. The apparent size of Mars is readily ascertained by looking at it. The arc it subtends - its visible size - is undoubtedly directly measured hundreds if not thousands of times every year by amateur astronomers alone, who do that sort of thing for fun. What you're saying is that all of them, every single time, are getting it massively wrong - based on the musings of a man who has never performed that measurement himself.\n \n Not only that, but you're saying that the satellites NASA put into 4,500mile diameter orbits around Mars are actually orbiting under the ground through solid rock. That's what must be happening, because you think the planet is bigger than their orbit.\n \nIs our distance from our stratosphere farther or is our distacne from Mars? So in case they are unable to estimate precizely such constituents of the Earth atmosphere, then how could they do that on Mars?\n\n Still not relevant, eanassir. The mars landers descended through the martian atmosphere while measuring it. Their distance to it was zero. And they're still there, day after day, confirming by direct measurement and by their very success as landers, which depended upon us knowing the atmospheric pressure correctly, that you are wrong about the Martian atmosphere's composition.\n \nIn addition, using the spectrometer will not enable us to know the concentration of such gases and sublayers, but only to some extent their existence there in the atmosphere. :)\n\n Incorrect. Wishing that this were true does not make it so.\n \nThese may easily be proved not correct, in the near future. \n\n The instruments are right there, on Mars, taking the measurements day after day. Remote spectrographic analysis agrees with those results. It is deeply, deeply unscientific to cling to a nonexistent hope that one day magic will intervene and make you right.\n \nMoreover, human beings have been adapted to various circumstances: Eskimo living in the frozen regions; the Africans living in the hot forests; the Tibetean living in high altitudes...etc.\n\n Irrelevant again, unfortunately. Humans cannot adapt to the summit of Everest (hence the term 'death zone'), let alone an environment 10,000 times poorer in oxygen at a pressure of 0.008 bar.", 
   {}, 
   325006, 
   null, 
   1222280880.0
  ], 
  [
   325039, 
   null, 
   "Iuris", 
   "Enassir, try this one.\n \n If Mars is smaller than scientists thing, it's gravity is lower. Right?\n In order to get something into a stable orbit around a planet, you have to put its speed and attitude just the right. Or else stuff will fly away of fall down. Right?\n Those Mariner probes what took pictures of the surface and all those measurements did orbit Mars for as long as the scientists wanted them. Right?\n \n Therefore, they must have been quite damn right about the size of the bloody thing! Not to mention that any Martians they missed must have been damn shy, not to let themselves get photographed at all...", 
   {}, 
   325037, 
   null, 
   1222281480.0
  ], 
  [
   325044, 
   null, 
   "gansao", 
   "http://www.4forums.com/political/attachment.php?attachmentid=324&stc=1&d=1222275114\n \n The last photograph from the British Beagle probe before the elastic band broke", 
   {
    "post_info": {
     "attachments": 1
    }
   }, 
   325039, 
   null, 
   1222282380.0
  ], 
  [
   325074, 
   null, 
   "eanassir", 
   "Enassir, try this one.\n \n If Mars is smaller than scientists thing, it's gravity is lower. Right?\n In order to get something into a stable orbit around a planet, you have to put its speed and attitude just the right. Or else stuff will fly away of fall down. Right?\n Those Mariner probes what took pictures of the surface and all those measurements did orbit Mars for as long as the scientists wanted them. Right?\n \n Therefore, they must have been quite damn right about the size of the bloody thing! Not to mention that any Martians they missed must have been damn shy, not to let themselves get photographed at all...\n\n \n Mars is bigger (not smaller) than what they think; as is it farther than the Earth from the Sun.\n \n About their probes; they use their theoretical equations and calculations, in addition to some practical experiences which they acquired from the many failures that faced their journeys to Mars.\n \n Therefore, their arrival to Mars and their landing on it is based on some practical things and not merely on their theories alone, and by this practical part they complemented their theoretical defects in order to reach their goal.", 
   {}, 
   325039, 
   null, 
   1222292100.0
  ], 
  [
   325117, 
   null, 
   "Zardoz", 
   "Enassir, try this one.\n \n ...scientists...\n\n \n Ut-oh!\n \n You said 'scientist'.\n EVERYONE knows that they're atheistic and ungodly. As such, they're also ALL liars.\n \n They have been tricking you with their trickery for far too long.\n \n Now, go drink the kool-aid and pray like a tru believer!", 
   {}, 
   325039, 
   null, 
   1222301220.0
  ], 
  [
   325131, 
   null, 
   "Peeling", 
   "About their probes; they use their theoreticl equations and calculations, in addition to some practical experiences which they acquired from the many failures that faced their journeys to Mars.\n \n Therefore, their arrival to Mars and their landing on it is based on some practical things and not merely on their theories alone, and by this practical part they complemented their theoretical defects in order to reach their goal.\n\n Practical experience does indeed inform the theory (that's why they sent the Mariner craft), and it is the updated theory upon which the next mission is based. If you were right about the size of Mars, NASA's failures would have required them to revise the size and mass of Mars up enormously in order for later missions to succeed. Since they have not done so, and their later missions have succeeded nevertheless, we are forced to conclude that you are not right. NASA can put a spacecraft in orbit around or upon the surface of Mars based on calculations in which Mars is around 4,200 miles in diameter with a thin wisp of an atmosphere - which proves that those figures are correct.\n \n Another way of establishing that their figures are correct is to purchase a telescope, train it upon Mars, measure its apparent size and perform the relevant trigonometric calculations. You will, like everyone else who has ever done so, arrive at a figure of around 4,200 miles. There is no magic here, eanassir; you are merely mistaken.", 
   {}, 
   325074, 
   null, 
   1222305540.0
  ], 
  [
   325199, 
   null, 
   "ServantOfChrist", 
   "\n See what is there on Mercury and Venus, before asserting such a thing: See their extreme temperatures, the perpetual cloud of Venus atmosphere, and the very thin or lost atmosphere of Mercury.\n\n Already have seen - it shows you are wrong.\n \n \n\n Venus:\n http://solarsystem.nasa.gov/multimedia/gallery/Venus_Clouds.jpg\n \n\n And? What does this have to do with rotation?\n \n \n\n Mercury:\n http://www.nasa.gov/images/content/210544main_geo_hist2.jpg \n \n\n And? What does this have to do with rotation?\n \n \n \n\n This indicates and points out to the same idea of their cessation from rotation around themselves.\n \n \n eanassir\n http://universeandquran.741.com\n\n \n How in the heck does rotation indicate a cessation of rotation? It is quite simple to find that both rotate - just go do a simple wikipedia check.", 
   {}, 
   325131, 
   null, 
   1222373040.0
  ], 
  [
   325220, 
   null, 
   "eanassir", 
   "\n And? What does this have to do with rotation?\n \n\n \n The image of NASA about Mercury shows Mercury obviously clear surface, with a large number of craters due to the falling of a large number of comets on Mercury; in addition it shows some fissuring and grooves indicating the shrinking and contraction of its surface, following its cooling and losing of its internal heat.\n \n The image of NASA about the perpetual cloud of Venus which obscures its surface, indicating it is full of thick smoke.\n \n Now, when Mercury stopped its axial rotation, it underwent many serious changes: it started to revolve around the sun without spinning around itself, so that it kept one face towards the sun which became extremely hot, while the opposite side became in continuous night and extremely cold; so life had been exterminated on Mercury.\n \n Then its atmosphere became full of thick smoke (at the start) when its gases of its various layers mixed with each other to become that thick smoke (as is the case now on Venus), but later on Mercury lost its gravity and was unable to keep the atmosphere gases, and they escaped into the outer space, and it became without atmosphere or with a very thin atmosphere.\n \n Then because it became cold, its surface contracted, so that the fissures and grooves appeared on it as it is demonstrated by such NASA images.\n \n Moreover, because it became cold, it became vulnerable to the falling down of a large number of comets on it which made the large number of craters on the surface of Mercury.\n \n So this is the implication of the image that you said what is the correlation?\n \n Mercury had stopped a long time before the stoppage of Venus; therefore Venus now is only in the phase of the thick smoke that filled its atmosphere, and Venus is going to be like Mercury.\n \n Now the image of NASA about Venus shows its perpetual cloud which is the thick smoke resulting from the mixing of the gaseous constituents of its various layers, and the life thereon has been exterminated in the same way as had it been exterminated before on Mercury.\n \n The next turn will be for the Earth to stop its axial rotation, one thousand years following the cessation of Venus from spinning around itself. The Earth will stop its axial rotation because of the depletion of its internal heat by time, due to the eruption of volcanoes and the continous heat loss by radiation, until its core will become cold and it will then stop spinning around itself.\n \n \n \n\n How in the heck does rotation indicate a cessation of rotation? It is quite simple to find that both rotate - just go do a simple wikipedia check. \n\n \n When they observed Mercury and Venus, astronomers found that these two planets have some bizarre way of movement; but they did not realize that these two planets have stopped spinning around themselves, and only kept rotating around the sun. \n \n When Venus was once near to the Earth, astronomers noticed that Venus kept the same face towards the Earth; but they did not know why, and did not realize that it did not rotate around itself.\n \n So this is why the bizarre movement of Venus and Mercury has caused much confusion, and they said it moves in retrograde manner, and its day is very long in comparison to its year.\n \n Refer to our website:\n http://universeandquran.741.com\n Then go the list of the Contents and click on many of these subjects:\n \n The standstill of the earth\n How the terrestrial planets will stand still\n The world that is burning [Mercury and Venus]\n The sky will be upset\n Repentance will not be accepted on that day\n Falling of the comets down upon the earth\n The gaseous layers [on Doomsday]\n \n \n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   325199, 
   null, 
   1222387020.0
  ], 
  [
   325221, 
   null, 
   "sinjin", 
   "Now, when Mercury stopped its axial rotation\n\"In 1965, Pettengill and Dyce determined Mercury's period of rotation to be 59 +- 5 days based upon radar observations. Later in 1971, Goldstein refined the rotation period to be 58.65 +- 0.25 days using radar observations. After close observation by the Mariner 10 spacecraft, the period was determined to be 58.646 +- 0.005 days.\"\n http://www.solarviews.com/eng/mercury.htm", 
   {}, 
   325199, 
   null, 
   1222387140.0
  ], 
  [
   325223, 
   null, 
   "smiley", 
   "MERCURY\n \n Rotation\n \n As Mercury moves around the sun, it rotates on its axis, an imaginary line that runs through its center. The planet rotates once about every 59 Earth days -- a rotation slower than that of any other planet except Venus. As a result of the planet's slow rotation on its axis and rapid movement around the sun, a day on Mercury -- that is, the interval between one sunrise and the next -- lasts 176 Earth days. \n \n Until the mid-1960's, astronomers believed that Mercury rotated once every 88 Earth days, the same time the planet takes to go around the sun. If Mercury did this, one side of the planet would always face the sun, and the other side would always be dark. However, radar studies conducted in 1965 showed that the planet rotates once in about 59 days.\n \n VENUS\n \n Rotation\n \n As Venus travels around the sun, it rotates very slowly on its axis, an imaginary line drawn through its center. Venus's axis is not perpendicular (at an angle of 90¡) to the planet's path around the sun. The axis tilts at an angle of approximately 178¡ from the perpendicular position. Unlike the Earth, Venus does not rotate in the same direction in which it travels around the sun. Rather, Venus rotates in the retrograde (opposite) direction and spins around once every 243 Earth days. \n \n \n Sorry, eanassir, you are just plain wrong.\n \n However, if you feel that you can, in any way, prove your point, I would suggest you contact NASA, talk to them about any evidence you have, and become a world famous astrophysicist. If you can prove that no-one has got it right up until you came along to put them right, then your notoriety will be incredible.\n \n Unfortunately, as it stand, you are just incredible (ie not credible).\n \n Smiley", 
   {}, 
   325199, 
   null, 
   1222387620.0
  ], 
  [
   325225, 
   null, 
   "eanassir", 
   "Practical experience does indeed inform the theory (that's why they sent the Mariner craft), and it is the updated theory upon which the next mission is based. If you were right about the size of Mars, NASA's failures would have required them to revise the size and mass of Mars up enormously in order for later missions to succeed. Since they have not done so, and their later missions have succeeded nevertheless, we are forced to conclude that you are not right. NASA can put a spacecraft in orbit around or upon the surface of Mars based on calculations in which Mars is around 4,200 miles in diameter with a thin wisp of an atmosphere - which proves that those figures are correct.\n \n\n \n \n It is not essential to know the size of Mars in order to send their probe to it; they know the distance, they go there, and when they reach there they jump with their probes on it :) ; the practical experiences will alleviate the need for their defective theories and data. \n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   325131, 
   null, 
   1222388520.0
  ], 
  [
   325226, 
   null, 
   "Kronus", 
   "I have to ask, and if anyone could answer I would be most grateful. Why are people still using logic, reason, and facts when dealing with eanassir? Seriously, I would really like to know people's motivation. How many times do you have to try a key in a lock before you'll believe it doesn't work?", 
   {}, 
   325225, 
   null, 
   1222389120.0
  ], 
  [
   325228, 
   null, 
   "eanassir", 
   "MERCURY\n \n Rotation\n \n As Mercury moves around the sun, it rotates on its axis, an imaginary line that runs through its center. The planet rotates once about every 59 Earth days -- a rotation slower than that of any other planet except Venus. As a result of the planet's slow rotation on its axis and rapid movement around the sun, a day on Mercury -- that is, the interval between one sunrise and the next -- lasts 176 Earth days. \n \n Until the mid-1960's, astronomers believed that Mercury rotated once every 88 Earth days, the same time the planet takes to go around the sun. If Mercury did this, one side of the planet would always face the sun, and the other side would always be dark. However, radar studies conducted in 1965 showed that the planet rotates once in about 59 days.\n \n VENUS\n \n Rotation\n \n As Venus travels around the sun, it rotates very slowly on its axis, an imaginary line drawn through its center. Venus's axis is not perpendicular (at an angle of 90¡) to the planet's path around the sun. The axis tilts at an angle of approximately 178¡ from the perpendicular position. Unlike the Earth, Venus does not rotate in the same direction in which it travels around the sun. Rather, Venus rotates in the retrograde (opposite) direction and spins around once every 243 Earth days. \n \n \n Sorry, eanassir, you are just plain wrong.\n \n However, if you feel that you can, in any way, prove your point, I would suggest you contact NASA, talk to them about any evidence you have, and become a world famous astrophysicist. If you can prove that no-one has got it right up until you came along to put them right, then your notoriety will be incredible.\n \n Unfortunately, as it stand, you are just incredible (ie not credible).\n \n Smiley\n\n \n I know they say so; and you and Sinjin and Peeling and others quote their words. \n \n But the incredible thing is to take such explanations without asking why is this bizarre way of movement of both Mercury and Venus? \n And why are these two planets different from the rest of planets? \n Why is their day so long? \n And why does Venus appear to move in retrograde manner (apparently)?\n And what is the reason behind such serious changes in the atmosphere and the manifestation of the surface and the thick cloud? \n \n Then if you contemplate such findings, you may give preponderance to our words and explanations.\n \n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   325223, 
   null, 
   1222389720.0
  ], 
  [
   325229, 
   null, 
   "eanassir", 
   "I have to ask, and if anyone could answer I would be most grateful. Why are people still using logic, reason, and facts when dealing with eanassir? Seriously, I would really like to know people's motivation. How many times do you have to try a key in a lock before you'll believe it doesn't work?\n\n \n I know what makes you (and some other men here) say such words; it is not the science for sure, and not the love of science.\n \n Truly it may be likened to an old rusted lock that need to be cleaned and oiled; because it has become stiffened, rigid and fixed on one state, and does not accept any reasoning; because of its rust.", 
   {}, 
   325226, 
   null, 
   1222390380.0
  ], 
  [
   325234, 
   null, 
   "smiley", 
   "I know what makes you (and some other men here) say such words; it is not the science for sure, and not the love of science.\n \n Truly it may be likened to an old rusted lock that need to be cleaned and oiled; because it has become stiffened, rigid and fixed on one state, and does not accept any reasoning; because of its rust.\n\n This is quite apt (possibly more than you might like).\n \n Kronus spoke of a key and a lock. The key he was referring to was 'logic'. Now you speak of a rusty lock that is rigid and does not accept any reasoning. So, the lock is a perfect metaphor for you.\n \n Smiley", 
   {}, 
   325229, 
   null, 
   1222396680.0
  ], 
  [
   325256, 
   null, 
   "Peeling", 
   "It is not essential to know the size of Mars in order to send their probe to it; they know the distance, they go there, and when they reach there they jump with their probes on it :) ; the practical experiences will alleviate the need for their defective theories and data. \n\n On the contrary, knowing the size and mass of Mars is vital for a successful orbital insertion and subsequent landing. Do you really think they can just drive up to Mars and stop? You've been watching too much Star Trek :)\n \n The amount of fuel on board, the timing and duration of burns to control velocity and attitude, the scrubbing of speed through aerobraking - all these things are fine-tuned based on an understanding of the planet's characteristics. That's why the Mariner craft were needed to analyse those characteristics and pave the way.\n \n And the spacecraft still in orbit - the orbit the scientists carefully calculated in advance to skim over a 4,200 mile diameter planet? Any idea how they're managing to do that through the solid rock of an 8,000 mile diameter planet?\n \n In any case, once again you assert that NASA do know the correct distance to Mars. Given that, and its apparent size in the sky, we can - and have - determined its actual size. You can do it yourself, with a telescope. Thousands of people have done it, independently.", 
   {}, 
   325225, 
   null, 
   1222430220.0
  ], 
  [
   325304, 
   null, 
   "sinjin", 
   "I have to ask, and if anyone could answer I would be most grateful. Why are people still using logic, reason, and facts when dealing with eanassir? Seriously, I would really like to know people's motivation. How many times do you have to try a key in a lock before you'll believe it doesn't work?\nWhat's the point of riding a stationary bike? That and the fact that crowbars aren't allowed here.emoticon_xbye", 
   {}, 
   325226, 
   null, 
   1222456800.0
  ], 
  [
   325312, 
   null, 
   "Kronus", 
   " What's the point of riding a stationary bike?\n\n Exercise. Are you implying that presenting logic which gets ignored is some sort of useful mental exercise?\n \n Seriously, can any actually explain why they keep trying? Not just come back with rhetorical questions and one liners, but give a full fledged explanation? I'm trully curious.", 
   {}, 
   325304, 
   null, 
   1222459020.0
  ], 
  [
   325623, 
   null, 
   "eanassir", 
   "\n In any case, once again you assert that NASA do know the correct distance to Mars. Given that, and its apparent size in the sky, we can - and have - determined its actual size. You can do it yourself, with a telescope. Thousands of people have done it, independently.\n\n \n Taking the planet through the telescope will change the value of the angle, which in turn will cause error in the value of the diameter of the planet to be estimated.\n \n In other words: if you don't use any telescope, or use a telescope that give you a certain magnification or use another telescope with more magnification will give you different estimations of the diameter of the planet.", 
   {}, 
   325256, 
   null, 
   1222725900.0
  ], 
  [
   325624, 
   null, 
   "smiley", 
   "Taking the planet through the telescope will change the value of the angle, which in turn will cause error in the value of the diameter of the planet to be estimated.\n \n In other words: if you don't use any telescope, or use a telescope that give you a certain magnification or use another telescope with more magnification will give you different estimations of the diameter of the planet.\n\n WRONG!!!!\n \n These figures are part of the calculation.\n \n Smiley", 
   {}, 
   325623, 
   null, 
   1222726080.0
  ], 
  [
   325654, 
   null, 
   "Peeling", 
   "Taking the planet through the telescope will change the value of the angle, which in turn will cause error in the value of the diameter of the planet to be estimated.\n \n In other words: if you don't use any telescope, or use a telescope that give you a certain magnification or use another telescope with more magnification will give you different estimations of the diameter of the planet.\n\n Then why are all the estimations the same, eanassir? :) You've already been given the answer: the magnification of the telescope is trivial to factor in.\n \n I mean, seriously now: do you really think astronomers look up at Mars through a 200 power eyepiece/telescope combo, estimate the diameter, then slot in a 400 power eyepiece and think \"Oops, my mistake, it's actually twice as big as I thought\"?\n \n Right now, I can picture the phrase 'clutching at straws' weeping at having been wasted upon lesser acts of desperation prior to this, its finest hour :)", 
   {}, 
   325623, 
   null, 
   1222735800.0
  ], 
  [
   325685, 
   null, 
   "eanassir", 
   "\n Right now, I can picture the phrase 'clutching at straws' weeping at having been wasted upon lesser acts of desperation prior to this, its finest hour :)\n\n \n Not at all; I am holding fast with the most firm handle; you will be proved wrong; but will you then admit it? :)", 
   {}, 
   325654, 
   null, 
   1222760460.0
  ], 
  [
   325687, 
   null, 
   "eanassir", 
   "WRONG!!!!\n \n These figures are part of the calculation.\n \n Smiley\n\n \n Such calculations using equations, the sine and cosine, the tangent and cotangent ...etc; which is in fact some Arabian invention in the Islamic past. \n \n I say there must be some other factor that is not included here!?\n \n And as did I say [according to the words of the late interpreter of the Quran and the Bible]:\n \n Did these planets take their position around the sun haphazardly without any rule? i.e. each planet came and took its position wherever it be, then the rest of the planets in the same manner: each planet orbited around the sun wherever it liked??\n \n Or logically and reasonably there must be some rules that such planets follow, and obey the laws of God inserted in the nature?\n http://universeandquran.741.com/My%20Webs/new_page_3.htm#A%20Rule%20for%20Objects \n \n In fact: these planets were arranged around the sun: \n 1. According to their masses ( the inspired interpreter of the Quran and Bible: Mohammed-Ali Hassan Al-Hilly, being not graduated at any school: he said according to their sizes) &#8594; the smaller the planet is, the nearest will it be to the sun; \n and vice versa: the largest the planet is, the farthest will it be from the sun.\n \n \n 2. According to their heat specially the internal heat of their cores &#8594; As much as the planet is hot, it will get away from the sun, \n and as much as the planet is cold, it will get nearer to the sun.\n \n Therefore, astronomers are correct concerning the inner planets that are nearer than We are to the sun: Mercury and Venus; but they are wrong concerning the outer planets that are farther from us in relation to the sun:\n \n Some corrections of some of their mistakes:\n \n About Mars: it is bigger than the Earth.\n http://universeandquran.741.com/My%20Webs/new_page_3.htm#Calculations%20concerning%20Mars \n \n About Jupiter: it is not that big; it is only about 12 times bigger than the Earth (while they say it is more than 1300 times bigger than the Earth.)\n See this subject: \n The Wrong Calculations of Astronomers Concerning Jupiter\n just following the subject of:\n http://universeandquran.741.com/My%20Webs/new_page_3.htm#Calculations%20concerning%20Mars\n \n I think this misconception about Jupiter has come from the extensive atmosphere of Jupiter, and they said it is a gaseous planet! But if you watch the impact of the famous comet on Jupiter, and you see the fireballs bouncing after their colliding with the surface of Jupiter, you will know Jupiter has a hard crust and it is not gaseous.\n \n However, astronomers have achieved some great scientific advances, while such mistakes will be corrected by time; and all this will by God's help; as He said in the Quran 41: 53-54\n &#1587;&#1614;&#1606;&#1615;&#1585;&#1616;&#1610;&#1607;&#1616;&#1605;&#1618; &#1570;&#1610;&#1614;&#1575;&#1578;&#1616;&#1606;&#1614;&#1575; &#1601;&#1616;&#1610; &#1575;&#1604;&#1618;&#1570;&#1601;&#1614;&#1575;&#1602;&#1616; &#1608;&#1614;&#1601;&#1616;&#1610; &#1571;&#1614;&#1606;&#1601;&#1615;&#1587;&#1616;&#1607;&#1616;&#1605;&#1618; &#1581;&#1614;&#1578;&#1617;&#1614;&#1609; &#1610;&#1614;&#1578;&#1614;&#1576;&#1614;&#1610;&#1617;&#1614;&#1606;&#1614; &#1604;&#1614;&#1607;&#1615;&#1605;&#1618; &#1571;&#1614;&#1606;&#1617;&#1614;&#1607;&#1615; &#1575;&#1604;&#1618;&#1581;&#1614;&#1602;&#1617;&#1615; &#1571;&#1614;&#1608;&#1614;&#1604;&#1614;&#1605;&#1618; &#1610;&#1614;&#1603;&#1618;&#1601;&#1616; &#1576;&#1616;&#1585;&#1614;&#1576;&#1617;&#1616;&#1603;&#1614; &#1571;&#1614;&#1606;&#1617;&#1614;&#1607;&#1615; &#1593;&#1614;&#1604;&#1614;&#1609; &#1603;&#1615;&#1604;&#1617;&#1616; &#1588;&#1614;&#1610;&#1618;&#1569;&#1613; &#1588;&#1614;&#1607;&#1616;&#1610;&#1583;&#1612; . &#1571;&#1614;&#1604;&#1614;&#1575; &#1573;&#1616;&#1606;&#1617;&#1614;&#1607;&#1615;&#1605;&#1618; &#1601;&#1616;&#1610; &#1605;&#1616;&#1585;&#1618;&#1610;&#1614;&#1577;&#1613; &#1605;&#1617;&#1616;&#1606; &#1604;&#1617;&#1616;&#1602;&#1614;&#1575;&#1569; &#1585;&#1614;&#1576;&#1617;&#1616;&#1607;&#1616;&#1605;&#1618; &#1571;&#1614;&#1604;&#1614;&#1575; &#1573;&#1616;&#1606;&#1617;&#1614;&#1607;&#1615; &#1576;&#1616;&#1603;&#1615;&#1604;&#1617;&#1616; &#1588;&#1614;&#1610;&#1618;&#1569;&#1613; &#1605;&#1617;&#1615;&#1581;&#1616;&#1610;&#1591;&#1612;\n The explanation:\n (We will show them Our portents on the horizons [of the sky] and among themselves until it will become manifest to them that [the Quran] is the truth. \n \n Is it not enough that your Lord [O Mohammed] does witness all things?\n \n In fact they are in doubt about the meeting with their Lord; \n \n but surely, He has full knowledge and ability over everything.)\n \n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   325624, 
   null, 
   1222768620.0
  ], 
  [
   325689, 
   null, 
   "Peeling", 
   "Not at all; I am holding fast with the most firm handle; you will be proved wrong; but will you then admit it? :)\n\n Or will I follow your example and refuse? You have been proved wrong, by inarguable mathematical principles and direct empirical testing by NASA, yet you remain obstinate. If such behaviour is good enough for you, how can you hold me to a higher standard?\n \nI say there must be some other factor that is not included here!?\n\n Well, that's a very easy claim to test:\n \n Use the trigonometric method to estimate the size of something here on earth, and then directly measure that same thing with a tape measure or ruler. If you like, you can print out and use the diagrams I provided earlier in this thread: measure the angle with a protractor, use a calculator to derive the sine, measure the distance to the circle, multiply the distance by the sine of the angle, and then see if that matches the diameter of the sphere.\n \nDid these planets take their position around the sun haphazardly without any rule? i.e. each planet came and took its position wherever it be, then the rest of the planets in the same manner: each planet orbited around the sun wherever it liked??\n \n Or logically and reasonably there must be some rules that such planets follow, and obey the laws of God inserted in the nature?\n\n There are indeed laws of physics that govern the accretion of planetary bodies - they're just not as simple as 'bigger further away from the sun'.\n \nAbout Mars: it is bigger than the Earth.\n\n It really isn't, you know. Or have you come up with a way for satellites to orbit through solid rock?\n \nAbout Jupiter: it is not that big; it is only about 12 times bigger than the Earth (while they say it is more than 1300 times bigger than the Earth.)\n\n Bizarrely, you're right about Jupiter's size; this time you're just wrong about how big 'they' say it is :) It's 11.2 times the diameter, which makes its volume over 1300 times greater.\n \nI think this misconception about Jupiter has come from the extensive atmosphere of Jupiter, and they said it is a gaseous planet! But if you watch the impact of the famous comet on Jupiter, and you see the fireballs bouncing after their colliding with the surface of Jupiter, you will know Jupiter has a hard crust and it is not gaseous.\n\n Bouncing? I can't find any such video. The comet had broken into several pieces before it struck; I think you might be mistaking multiple impacts for one comet 'bouncing'. Nor would a comet 'bounce' if it did hit a solid crust, any more than the meteor that made the crater in Arizona 'bounced'.", 
   {}, 
   325687, 
   null, 
   1222772820.0
  ], 
  [
   325785, 
   null, 
   "eanassir", 
   " \n If such behaviour is good enough for you, how can you hold me to a higher standard? \n \n\n \n I cannot hold any man to a higher standard; it is God -be glorified That do all this; and it is your choice as is it the choice of every individual.\n \n \n\n Use the trigonometric method to estimate the size of something here on earth, and then directly measure that same thing with a tape measure or ruler. If you like, you can print out and use the diagrams I provided earlier in this thread: measure the angle with a protractor, use a calculator to derive the sine, measure the distance to the circle, multiply the distance by the sine of the angle, and then see if that matches the diameter of the sphere.\n \n\n \n These methods, in spite of being good and correct on simple drawing on the paper, such methods are liable to much mistakes, because of the mistakes done by the manual measuring by the astronomer and the amateure.\n \n \n\n There are indeed laws of physics that govern the accretion of planetary bodies - they're just not as simple as 'bigger further away from the sun'.\n \n\n \n The simple expressin is almost better than the complicated one. The late interpreter did not graduate at any school.\n Moreover what are these \"laws of physics that govern the accretion of planetary bodies\"\n \n \n\n It really isn't, you know. Or have you come up with a way for satellites to orbit through solid rock?\n \n\n \n No need to orbit inside the solid rock; the outerspace is very extensive.", 
   {}, 
   325689, 
   null, 
   1222811940.0
  ], 
  [
   325789, 
   null, 
   "sinjin", 
   "Such calculations using equations, the sine and cosine, the tangent and cotangent ...etc; which is in fact some Arabian invention in the Islamic past.\nThe Greeks actually. Arabs preserved the knowledge and are the reason we know these principles today. Thanks.", 
   {}, 
   325687, 
   null, 
   1222812720.0
  ], 
  [
   325796, 
   null, 
   "Peeling", 
   "I cannot hold any man to a higher standard; it is God -be glorified That do all this; and it is your choice as is it the choice of every individual.\n\n Then be so kind as to stop insinuating that should I ever be proved wrong I will behave as you are now.\n \nThese methods, in spite of being good and correct on simple drawing on the paper, such methods are liable to much mistakes, because of the mistakes done by the manual measuring by the astronomer and the amateure.\n\n Why? You can measure the circle on the paper - what makes the measurement of a circle viewed through a telescope so much harder?\n \n here is a simple and straightforward exercise that first uses a simple metre stick a known distance away to determine the callibration of a telescope/eyepiece combination, and then uses this callibrated equipment to estimate the size of Jupiter. Mars can be measured in exactly the same way. It's really, really easy.\n \n You continue to evade the most telling truth: if these trivially simple methods were as liable to mistakes as you claim, the results obtained should differ wildly from one astronomer to another. Why would every single astronomer, viewing Mars through different telescopes at different magnifications, each independently callibrating their equipment, make exactly the same error when measuring Mars? The exact same error that the indescribably thorough scientists at NASA supposedly made, which inexplicably failed to cause the utter failure of all their Mars missions.\n \n When everyone who has ever studied Mars has to be fundamentally wrong about it in almost every respect in order for one man who never studied Mars to be right - doesn't that give you even the slightest pause?\n \nMoreover what are these \"laws of physics that govern the accretion of planetary bodies\"\n\n Gravity, for a start. But since we disagree about how that works, I think there's little point broadening our discussion at this stage.\n \nNo need to orbit inside the solid rock; the outerspace is very extensive.\n\n But they're following an orbit of around 4,500 miles diameter. That is what they were designed to do, that's what they are doing, as their telemetry confirms. You say Mars is 8,000 miles across. Therefore they must be orbiting under the ground. That's a remarkable feat even for NASA, especially considering they weren't even trying.", 
   {}, 
   325785, 
   null, 
   1222816920.0
  ], 
  [
   325808, 
   null, 
   "smiley", 
   "But they're following an orbit of around 4,500 miles diameter. That is what they were designed to do, that's what they are doing, as their telemetry confirms. You say Mars is 8,000 miles across. Therefore they must be orbiting under the ground. That's a remarkable feat even for NASA, especially considering they weren't even trying.\n\n Or perhaps they are in geostationary orbits at an altitude of zero (in lots of little bits of course). Beats me how they manage to keep sending back info though.\n \n Smiley", 
   {}, 
   325796, 
   null, 
   1222823700.0
  ], 
  [
   325832, 
   null, 
   "eanassir", 
   "The Greeks actually. Arabs preserved the knowledge and are the reason we know these principles today. Thanks.\n\n \n All these ancient civilizations mixed with each other, learned from each other and taught each other.\n \n The ancient Chineese -- Sumerians and ancient Iraqis --- Greeks --- Arabs and Mulims -- Europeans (and these latter for the fear of the Inquisition and of being burnt alive, they denied many things that they learnt and translated literally from Muslims, so they attributed that writings to themselves: while the preliminary scientific subject was translated Arabian in essence; they were afraid of being accused with heresy by the Inquisition.)\n \n And till now many words indicate the Arab participation and adding many things (but their adversaries deny that): See some words like Algebra; in addition to many names of the stars in Astronomy that till now bear the Arabic names.", 
   {}, 
   325789, 
   null, 
   1222847400.0
  ], 
  [
   325833, 
   null, 
   "eanassir", 
   "\n here is a simple and straightforward exercise \n \n\n \n This is indeed a good lecture and exercise; your lectures and excercises are excellent; but do not stick to them, but have more horizones of cotemplation; because such restrictions to your lectures and dictating will restrict you and astronomers from seeing many new and valuable things and from discovering many mistakes.\n \n Don't think that they know everything about the atmosphere and other subjects related to Mars; why then do they intend to launch their next space-craft to Mars at 2013 in order to study the atmosphere of Mars, and they say the search about life on Mars is one of our objectives, and they will work their microphone to pick up any sound there, and every day they discover something about clay and the snow falling, and they have seen river beds but as they said they are dry! Then where did all this water go, in spite of that it is still present on the tremendous areas of the two poles and on the mountains in the form of snow.\n This is not logical, and the go after some bizzarre ( as you have expressed) explanations like the CO2 ice, why don't they see the truth before them, but that God has confounded them, because of their sins of homosexuality and adultey in addition to their atheism and associating Jesus with God in their worship.\n So in spite of their scientific achievements, they have not yet reached to proving the existence of life and liquid water there, and they went to improper sites and used wrong programs of taking the images, and they have missed the truth; their confusion is so obvious, like how the first discoverers went here and there bewildered until God guided them.\n \n \n\n When everyone who has ever studied Mars has to be fundamentally wrong about it in almost every respect in order for one man who never studied Mars to be right - doesn't that give you even the slightest pause?\n \n\n \n That man, the inspired interpreter of the Quran and the Bible, did not even graduate at any primary school; he only knew reading and writing Arabic.\n But I did not say they are wrong in every respect about Mars: only some measurements and data and findings and explanations about the size, the existence of water (which only they have discovered it in the ice, cloud and fog and now in clay! also) While he said this 60 years ago, exactly at 1947, and he said there is life on Mars and some other planets, in the form of plant, animal and man (and genies or demons also -living in the gaseous layers of the sky of each planet)\n \n \n\n Gravity, for a start. But since we disagree about how that works, I think there's little point broadening our discussion at this stage.\n \n\n \n Now, this is your evasion: it is difficult for you to say: We don't know; while this sentence is the key of all the science and knowledge; yes they don't know why the planets are arranged around the sun, and what are the rules governing their positions around the sun; and there came this man who only could read and write Arabic to explain to us in his simple, yet reasonable, explanation: why the planets are arranged around the sun in their particular orbits.\n http://universeandquran.741.com/My%20Webs/new_page_3.htm#A%20Rule%20for%20Objects\n A rule for objects\n \n \n\n But they're following an orbit of around 4,500 miles diameter. That is what they were designed to do, that's what they are doing, as their telemetry confirms. You say Mars is 8,000 miles across. Therefore they must be orbiting under the ground. That's a remarkable feat even for NASA, especially considering they weren't even trying. \n\n \n If they orbit at 4,500 miles diameter, then what will the diameter of Mars be then? Two meters?\n \n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   325796, 
   null, 
   1222852740.0
  ], 
  [
   325834, 
   null, 
   "Peeling", 
   "This is indeed a good lecture and exercise; your lectures and excercises are excellent; but do not stick to them, but have more horizones of cotemplation; because such restrictions to your lectures and dictating will restrict you and astronomers from seeing many new and valuable things and from discovering many mistakes.\n\n You keep talking about astronomers 'making mistakes', but where is the potential for error?\n \n In the exercise above, there are a finite number of variables:\n \n 1. The length of the stick used for callibration.\n 2. The distance of the stick used for callibration.\n 3. The distance of the planet being measured.\n \n The magnification of the telescope is irrelevant, because whatever it may be it will equally magnify the stick and the planet, leading to the same result.\n \n 1. and 2. are directly measurable, and you've already agreed that we know 3. So where's the mistake? Which of those three things are thousands of astronomers consistently getting wrong by a factor of 2? Are you saying astronomers can't measure a stick? Are you saying astronomers can't measure the distance to a stick?\n \n Here's an alternative suggestion: one man who never ever studied mars himself made a mistake when he plucked a random number out of thin air and then used elastic, which has the exact opposite properties to gravity, to 'confirm' that random number.\n \nThat man, the inspired interpreter of the Quran and the Bible, did not even graduate at any primary school; he only knew reading and writing Arabic.\n\n And what he did with that knowledge was remarkable. Not right, but remarkable nonetheless. As I said before, your absurd insistence on presenting his work as correct brings shame upon him. The people you talk to, here and elsewhere, will not remember the inspirational story of an uneducated man who tried to make sense of the world around him. They will only remember your folly in repeatedly denying the blatantly obvious. They will remember your name, not his.\n \nNow, this is your evasion: it is difficult for you to say: We don't know; while this sentence is the key of all the science and knowledge; yes they don't know why the planets are arranged around the sun, and what are the rules governing their positions around the sun; and there came this man who only could read and write Arabic to explain to us in his simple, yet reasonable, explanation: why the planets are arranged around the sun in their particular orbits.\n\n And he was wrong. I'm not evading the issue, I just don't think there's any point talking about theories of planet formation when we disagree on the size of the planets that theory has to explain.\n \n \nIf they orbit at 4,500 miles diameter, then what will the diameter of Mars be then? Two meters?\n\n Er, no: 4200 miles. Why in the world would you say two metres? The significance of the 4,500 mile diameter orbit is that you can't fit one around the outside of an 8000 mile planet. Mars must be smaller than the orbit of the spacecraft, or else they're orbiting through solid rock. Take your pick!\n \n Here is some more detailed information. I've highlighted in red the parts that would have gone catastrophically wrong if Mars were 8000 miles across instead of 4200, and in green those that would have gone tits-up if they'd been wrong about the atmospheric pressure:\n \n \nUpon reaching Mars, Surveyor fired its main rocket engine for the 22-minute Mars orbit insertion (MOI) burn. This maneuver slowed the spacecraft and allowed the planet's gravity to capture it into orbit. Initially, Surveyor entered a highly elliptical orbit that took 45 hours to complete. The orbit had a periapsis of 262 km above the northern hemisphere, and an apoapsis of 54,026 km above the southern hemisphere.\n \n After orbit insertion, Surveyor performed a series of orbit changes to lower the periapsis of its orbit into the upper fringes of the Martian atmosphere at an altitude of about 110 kilometers (68 miles). During every atmospheric pass, the spacecraft slowed down by a slight amount because of atmospheric resistance. The density of the Martian atmosphere at such altitudes is comparatively low, allowing this procedure to be performed without damage to the spacecraft. This slowing caused the spacecraft to lose altitude on its next pass through the orbit's apoapsis. Surveyor used this aerobraking technique over a period of four months to lower the high point of its orbit from 54,000 kilometers to altitudes near 450 kilometers.\n \n <snip<\n \n Under the new mission plan, aerobraking occurred with the low point of the orbit at an average altitude of 120 km, as opposed to the original altitude of 110 km. This slightly higher altitude resulted in a decrease of 66 percent in terms of air resistance pressure experienced by the spacecraft. During these six months, aerobraking reduced the orbit period to between 12 and 6 hours.\n \n From May to November 1998, aerobraking was temporarily suspended to allow the orbit to drift into the proper position with respect to the Sun. Without this hiatus, 'Surveyor' would complete aerobraking with its orbit in the wrong solar orientation. In order to maximize the efficiency of the mission, these six months were devoted to collecting as much science data as possible. Data was collected between two to four times per day, at the low point of each orbit.\n \n Finally, from November 1998 to March 1999, aerobraking continued and shrank the high point of the orbit down to 450 km. At this altitude, Surveyor circled Mars once every two hours. Aerobraking was scheduled to terminate at the same time the orbit drifted into its proper position with respect to the Sun.\n\n As you can see, NASA didn't drive up to Mars and stop. You want me to believe that they spent a year and a half fine-tuning the orbit of their spacecraft without ever once noticing that the planet they had chosen to visit was twice as big and eight times as heavy as expected, and you want me to believe this on the strength of a piece of elastic. I'm sorry, but I really don't think it can support both our weight :)", 
   {}, 
   325833, 
   null, 
   1222859760.0
  ], 
  [
   325864, 
   null, 
   "eanassir", 
   "\n You keep talking about astronomers 'making mistakes' ... \n \n Here's an alternative suggestion: one man who never ever studied mars himself made a mistake when he plucked a random number out of thin air and then used elastic, which has the exact opposite properties to gravity, to 'confirm' that random number....\n \n And what he did with that knowledge was remarkable. Not right, but remarkable nonetheless.... \n \n And he was wrong.... \n \n As you can see, NASA didn't drive up to Mars and stop... :)\n\n \n \n Some important points to declare:\n \n \u0095 The interpreter (if you read seriously what he said) did not say Mars is twice the Earth; he said Mars is about 11/2 the size of the Earth [or exactly he said the volume according to his understanding.] \n \n \u0095 This is not intended to belittle NASA, Astronomers or you or anyone else; when we say the mistake of Astronomers, but only to draw attention to many wrong ideas and concepts, which have to be taken into consideration.\n \n \u0095 I am not an astronomer or physicist, neither was the interpreter; but we believe according to the Quran - which is superior to their science and knowledge whatever God has given to them out of His omniscience - that there is life on the planets including Mars. \n \n \u0095 You are certainly more qualified than I am, but eventhough I believe that what the inspired interpreter said, was truthful and his words were correct, and the word of God is the truth and more correct than any other word.\n \n \u0095 I believe certainly that the planets are earths like our Earth, and they include water, plant, animal and man-kind created by God on such planets with the exception of Mercury and Venus whose circumstances have deteriorated.\n \n \u0095 There will be in the near future some mutual meeting between the inhabitants of the Earth and some other planets, and Mars is the most anticipated for such incidence.\n As God - be glorified - said in the Quran 42: 29\n &#1608; &#1605;&#1616;&#1606;&#1618; &#1570;&#1610;&#1575;&#1578;&#1616;&#1607;&#1616; &#1582;&#1614;&#1604;&#1618;&#1602;&#1615; &#1575;&#1604;&#1587;&#1605;&#1575;&#1608;&#1575;&#1578;&#1616; &#1608; &#1575;&#1604;&#1571;&#1585;&#1590;&#1616; &#1608; &#1605;&#1575; &#1576;&#1614;&#1579;&#1617;&#1614; &#1601;&#1610;&#1607;&#1616;&#1605;&#1575; &#1605;&#1616;&#1606;&#1618; &#1583;&#1575;&#1576;&#1617;&#1577;&#1613; &#1608; &#1607;&#1608; &#1593;&#1604;&#1609; &#1580;&#1614;&#1605;&#1593;&#1616;&#1607;&#1605; &#1573;&#1584;&#1575; &#1610;&#1614;&#1588;&#1575;&#1569;&#1615; &#1602;&#1583;&#1610;&#1585;&#1612; \n The explanation: \n (And [one] of His signs is the creation of the heavens and the earth, and what He has spread abroad therein of beasts [: moving creatures]; and He is All-Able to gather them if He wills.)\n \n The interpretation: \n << ( And [one] of His signs is the creation of the heavens and the earth) It means: Among His signs that indicate His existence is the creation of the planets including the earth,\n << ( and what He has spread abroad therein of beasts [: moving creatures] ) i.e. the creatures [:animals and human beings] that move on these planets including the Earth.\n << ( and He is All-Able to gather them if He wills.) \n Here, there is a clear declaration about the possibility of meeting between the inhabitants of some of the planets and the inhabitants of Earth.\n \n For more details see:\n http://universeandquran.741.com/#Planets%20Inhabited\n \n http://universeandquran.741.com/My%20Webs/new_page_2.htm#Meeting%20Between%20Inhabitants\n \n It is better to see our site: http://universeandquran.741.com then go to the list of Contents and click on:\n The planets are inhabited \n \n An anticipated meeting between the inhabitants of Earth and the inhabitants of some other planets\n \n \n eanassir\n http://universeandquran.741.com", 
   {
    "unicode_changes_made": true
   }, 
   325834, 
   null, 
   1222891560.0
  ], 
  [
   325890, 
   null, 
   "eanassir", 
   "\n \"Under the new mission plan, aerobraking occurred with the low point of the orbit at an average altitude of 120 km, as opposed to the original altitude of 110 km. \n This slightly higher altitude resulted in a decrease of 66 percent in terms of air resistance pressure experienced by the spacecraft.\" \n\n \n I say compare this to the atmosphere of the Earth to know that the atmosphere of Mars, exists even at such high altitude, and the increase of 10 km: from 110 km to 120 km resulted in such decrease of air resistance of about 66% .\n Compare and see how thin is the atmosphere of Earth is at such high altitudes, and will such increase of the orbit of the space craft from 110 km to 120 km may cause a similar or more decrease in the air resistance of 66%", 
   {}, 
   325834, 
   null, 
   1222897560.0
  ], 
  [
   325898, 
   null, 
   "smiley", 
   "I say compare this to the atmosphere of the Earth to know that the atmosphere of Mars, exists even at such high altitude, and the decrease of 10 km: from 120 km to 110 km resulted in such decrease of air resistance of about 66% .\n Compare and see how thin is the atmosphere of Earth is at such high altitudes, and will such decrease of the orbit of the space craft from 120 km to 110 km may cause a similar or more decrease in the air resistance of 66%\n\n You obviously just don't get it.\n \n A DECREASE in altitude results in an INCREASE in air pressure, and thus air resistance.\n \n To quote the passage you quoted\n \n \nThis slightly higher altitude resulted in a decrease of 66 percent in terms of air resistance pressure experienced by the spacecraft.\n\n \n See, higher altitude (increased altitude) = lower (decreased) air resistance\n \n Please be more careful when trying to argue something about which you have little or no knowledge.\n \n Smiley", 
   {}, 
   325890, 
   null, 
   1222898100.0
  ], 
  [
   325963, 
   null, 
   "Peeling", 
   "&#8226; The interpreter (if you read seriously what he said) did not say Mars is twice the Earth; he said Mars is about 11/2 the size of the Earth [or exactly he said the volume according to his understanding.] \n\n Perhaps I've been unclear: I have never claimed you think Mars was twice the size of Earth. Rather, you think Mars is more than twice the size everyone else thinks it is.\n \nThis is not intended to belittle NASA, Astronomers or you or anyone else; when we say the mistake of Astronomers, but only to draw attention to many wrong ideas and concepts, which have to be taken into consideration.\n\n But what are these 'wrong ideas and concepts'? As I said in my last post, that method of measuring celestial objects relies upon:\n \n 1. A stick of known length...\n 2. ...a known distance away...\n 3. ... and knowing the distance of the planet.\n \n The rest is simple, inarguable trigonometry. The answer you get will be more or less accurate depending upon the magnification used, but you're talking about every single astronomer being out by a factor of - well, I was being generous before but now you've said Mars is 1.5x bigger than earth, they have to be wrong by a factor of 3!\n \n Clearly NASA isn't wrong by a factor of 3 about the distance of Mars, or the spacecraft sent there would only get 1/3 of the way there. So where is this massive, massive error creeping in?\n \nI am not an astronomer or physicist, neither was the interpreter; but we believe according to the Quran &#8211; which is superior to their science and knowledge whatever God has given to them out of His omniscience &#8211; that there is life on the planets including Mars. \n\n There may well be life of some sort on Mars. But it's still not bigger than Earth :) And nowhere in the Quran does it say Mars is bigger than Earth. That notion was dreamed up out of a philosophical belief that the planets 'ought' to be in size order. They're clearly not, and it's not a contradiction of the Quran to observe that fact.\n \nYou are certainly more qualified than I am, but eventhough I believe that what the inspired interpreter said, was truthful and his words were correct, and the word of God is the truth and more correct than any other word.\n\n How many qualifications does it take to measure a stick? :) Remember: nowhere in the Quran is Mars described as larger than Earth, so even were we both to accept the Quran as an authority on the matter, god is not on your side here.\n \nI believe certainly that the planets are earths like our Earth, and they include water, plant, animal and man-kind created by God on such planets with the exception of Mercury and Venus whose circumstances have deteriorated.\n\n I understand that you believe this to be the case, but the copious evidence gathered thus far is stacked entirely against you.\n \nThere will be in the near future some mutual meeting between the inhabitants of the Earth and some other planets, and Mars is the most anticipated for such incidence.\n\n So long as you stretch your definition of 'inhabitants', sure :)\n \n Consider this: Mars is thought to have been warmer and wetter and far more hospitable in the past. Perhaps complex life did exist there once, but no longer. That scenario does not contradict the Quran, only your personal choice to believe that Mars is inhabited right now. Nor does Mars being smaller than Earth contradict the Quran, so it is false pride to say that you are the messenger of god's word in these matters. The same applies to every other statement on your site about the size and orbit of the planets.\n \n I personally own a telescope which uses the known orbits of the planets to position them in the centre of the eyepiece upon command. It will do this any time of day or night, any day of the year. How could it do this if Pluto really orbited Neptune? How can asteroids orbit Jupiter and Mars when they spend half their time on the other side of the sun from those planets? Not to mention that NASA is visiting asteroids based on their known orbits!\n \n None of the ideas about planets and their orbits on your site emerge from the Quran. They derive from a completely wrong idea of how gravity works. How could Nasa pull off interplanetary trajectories like these if they were so wrong about gravity?", 
   {
    "unicode_changes_made": true
   }, 
   325864, 
   null, 
   1222946700.0
  ], 
  [
   326088, 
   null, 
   "eanassir", 
   "You obviously just don't get it.\n \n A DECREASE in altitude results in an INCREASE in air pressure, and thus air resistance.\n \n To quote the passage you quoted\n \n \n \n See, higher altitude (increased altitude) = lower (decreased) air resistance\n \n Please be more careful when trying to argue something about which you have little or no knowledge.\n \n Smiley\n\n \n It was only an error of expression, then I noticed it and corrected it; but you rushed immediately, so now go once again to my reply, then do answer :)", 
   {}, 
   325898, 
   null, 
   1223005980.0
  ], 
  [
   326090, 
   null, 
   "smiley", 
   "I say compare this to the atmosphere of the Earth to know that the atmosphere of Mars, exists even at such high altitude, and the increase of 10 km: from 110 km to 120 km resulted in such decrease of air resistance of about 66% .\n Compare and see how thin is the atmosphere of Earth is at such high altitudes, and will such increase of the orbit of the space craft from 110 km to 120 km may cause a similar or more decrease in the air resistance of 66%\n\n Okay, here we go again! Your post has gone from being completely wrong to being completely irrelevant.\n \n The initial statement by Peeling was demonstrating that the level of knowledge we have about the Martian atmosphere is sufficient to land things on the surface (getting telemetry in the process).\n \n Why would we need to make any comparison with Earth's atmosphere in order to realise that the information we have received, and are still receiving about Mars's atmosphere it fairly accurate? You are just trying to avoid having to admit that we know a fair deal about Mars (including it's size, mass, orbit, distance from Earth, atmosphere etc). We know far far more about Mars that those who came before us (despite your assertions to the contrary).\n \n Why can't you just admit that you are wrong, and those who have studied Mars in detail know more than you do?\n \n Smiley", 
   {}, 
   325890, 
   null, 
   1223008440.0
  ], 
  [
   326092, 
   null, 
   "eanassir", 
   "\n Perhaps I've been unclear: I have never claimed you think Mars was twice the size of Earth. Rather, you think Mars is more than twice the size everyone else thinks it is.\n \n\n \n Mars is about 11/2 the size of the Earth.\n \n \n\n There may well be life of some sort on Mars. But it's still not bigger than Earth :) And nowhere in the Quran does it say Mars is bigger than Earth. That notion was dreamed up out of a philosophical belief that the planets 'ought' to be in size order. They're clearly not, and it's not a contradiction of the Quran to observe that fact.\n \n\n \n The Quran does not mention anything about Mars being bigger or smaller than Earth; but the inspired interpreter of the Quran and the Bible, the late Mohammed-Ali Hassan Al-Hilly, said that in his book The Universe and the Quran, which is at the website:\n http://universeandquran.741.com\n \n \n \n\n Consider this: Mars is thought to have been warmer and wetter and far more hospitable in the past. Perhaps complex life did exist there once, but no longer. That scenario does not contradict the Quran, only your personal choice to believe that Mars is inhabited right now. Nor does Mars being smaller than Earth contradict the Quran, so it is false pride to say that you are the messenger of god's word in these matters. The same applies to every other statement on your site about the size and orbit of the planets.\n \n\n \n I am with God alone without any associate or son or parents; I hope and pray God to be with us. So be with God, and then God will be with you: Emmanuel: God is with us.\n \n \n \n\n None of the ideas about planets and their orbits on your site emerge from the Quran. They derive from a completely wrong idea of how gravity works. How could Nasa pull off interplanetary trajectories like these if they were so wrong about gravity? \n\n \n NASA and Astronomers have done some great advances by God's grace and favor; but yet they are liable to error and their knowledge is not absolute, although God have given them much knowledge and scientific capability. \n \n There is life on the planets in the form of plant, animal and man, according to many ayat of the Quran; and you will be proved wrong\n http://universeandquran.741.com &#8594; list of the Contents &#8594; The planets are inhabited\n http://universeandquran.741.com &#8594; list of the Contents &#8594; Merckson meteorite ( Murchison meteorite )\n \n \n eanassir\n http://universeandquran.741.com", 
   {
    "unicode_changes_made": true
   }, 
   325963, 
   null, 
   1223009460.0
  ], 
  [
   326111, 
   null, 
   "Peeling", 
   "Mars is about 11/2 the size of the Earth.\n\n It's disappointing to see you retreat behind a simple restatement of belief, eanassir. I understand that you see that as the virtuous thing to do, but I wish you would reconsider, and listen to those parts of you that are crying \"I can find no fault with these methods of measuring Mars. I cannot explain how thousands of astronomers could all get it wrong by the same huge amount over hundreds of years. I cannot explain how NASA could induce a spacecraft to follow a 4,500 mile orbit around a 12,000 mile planet, or could painstakingly adjust that orbit for eighteen months using vastly incorrect calculations, and still achieve the result they desired. I cannot explain how they could be completely wrong about how gravity works, and yet still successfully launch spacecraft on elaborate gravitationally-guided trajectories covering hundreds of millions of miles.\"\n \n Of course, listening to that voice is how I make myself happy. Your mileage may vary :)\n \nThe Quran does not mention anything about Mars being bigger or smaller than Earth;\n\n Then stop invoking god as your advocate!\n \n This is something one man decided ought to be true, and you have decided to agree out of respect for him - that is all. And luckily, your error has no consequences. No spacecraft will go astray or crash because you are determined to be wrong about the size of Mars or the density of its atmosphere. Trigonometry will remain the dependable tool it has always been, impervious to your doubts. Astronomers will continue to use their metre sticks, which will remain one metre long however passionately you believe they must be three times the size (and presumably wielded by stupid giants). You are gloriously free to remain wrong in this matter to any degree you see fit, and the planets and the craft NASA sends to visit them will proceed upon their courses regardless. If you get bored, you could try believing Mars is twice or three times the size of Earth for a while instead - even nine or ten! After all, why stop at 1.5? If none of the measurements we've made can be trusted, the sky's no limit! :)\n \nThere is life on the planets in the form of plant, animal and man, according to many ayat of the Quran; and you will be proved wrong\n\n If that belief brings you contentment in your life, then it serves its purpose. I wish you well with it. And on that note, I leave the thread in your hands.", 
   {
    "unicode_changes_made": true
   }, 
   326092, 
   null, 
   1223032260.0
  ], 
  [
   326226, 
   null, 
   "eanassir", 
   " ...I leave the thread in your hands.\n\n \n On my turn, I put these points as a trust in deputy to remind you later on:\n 1 - Mars is not smaller; it is larger than Earth, but only about 1.5 times.\n 2 - There is life on Mars and some other planets, with the exception of Mercury and Venus.\n \n However, the strange thing that I see is the large number of craters scattered on the surface of Mars; could it be to the explosion of the past planet of the \"Asteroids\" between Mars and Jupiter!!?\n \n Thank you, Peeling :)", 
   {}, 
   326111, 
   null, 
   1223071200.0
  ], 
  [
   326232, 
   null, 
   "eanassir", 
   "\n Why would we need to make any comparison with Earth's atmosphere in order to realise that the information we have received, and are still receiving about Mars's atmosphere it fairly accurate? \n \n Why can't you just admit that you are wrong, and those who have studied Mars in detail know more than you do?\n \n Smiley\n\n \n The comparison of Mars atmosphere to that of the Earth is only to relize that the atmosphere of Mars is not thin as do they think; it may be more than the atmosphere of Earth.\n \n Moreover, I admit that Astronomers know a good deal of knowledge about Mars more than I know, but only there are few points they have been wrong in their calculations which almost they will correct all that in the future.\n \n \n eanassir\n http://universeandquran.741.com", 
   {}, 
   326090, 
   null, 
   1223072460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Nobody can rule out the existence of people on Mars.", 
  "url": "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 11498, 
  "discussion_files": [
   [
    "17414.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-print.html"
   ], 
   [
    "17415.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-13-print.html"
   ], 
   [
    "17416.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-12-print.html"
   ], 
   [
    "17417.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-10-print.html"
   ], 
   [
    "17418.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-8-print.html"
   ], 
   [
    "17419.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-6-print.html"
   ], 
   [
    "17420.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-4-print.html"
   ], 
   [
    "17421.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-5-print.html"
   ], 
   [
    "17422.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-7-print.html"
   ], 
   [
    "17423.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-9-print.html"
   ], 
   [
    "17424.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-11-print.html"
   ], 
   [
    "17425.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-3-print.html"
   ], 
   [
    "17426.html", 
    "http://www.4forums.com/political/science-math-debates/11498-nobody-can-rule-out-existence-people-mars-2-print.html"
   ]
  ], 
  "identifier": 11498
 }
]