[
 [
  [
   20194, 
   null, 
   "epaphras_faith", 
   "My position would be that SUV's are no more harmful than any other vehicle and some of them are worse. Banning would also be an abuse of governmental power as the government has no real authority in this area.", 
   {
    "post_info": {
     "post_title": "Should SUV's be banned?"
    }
   }, 
   null, 
   null, 
   1066773780.0
  ], 
  [
   20199, 
   null, 
   "gilligan8503", 
   "your theory is wrong.\n \n miles per gallon in compairison\n \n why are suvs and other certain gas-guzzling cars needed? to feed the greed of the high-class.", 
   {}, 
   20194, 
   null, 
   1066777800.0
  ], 
  [
   20200, 
   null, 
   "epaphras_faith", 
   "your theory is wrong.\n \n miles per gallon in compairison\n \n why are suvs and other certain gas-guzzling cars needed? to feed the greed of the high-class.\n\n \n Your going to have to give me more of an argument and draw some connections with miles per gallon. So what if they use more gas? Big deal. That does not necessarily destroy more natural resource than windmills put up on forest acreage for instance.\n \n PS. So what if People with money wnat them. Why should they be made to suffer. Do others deserve some special treatment?", 
   {}, 
   20199, 
   null, 
   1066779000.0
  ], 
  [
   20203, 
   null, 
   "gilligan8503", 
   "i will most-definatly research this later, but right now, i have no time.\n \n why should they be made to suffer???!!!\n uh huh. you mean if one has money, they should be able to do anything with it? then why did we, the u.s., go after bin laden. i'm sure he'd suffer without it, right?\n \n because, we americans need the fuel-guzzling machines. anything eco-friendly must not be stylish.\n \n god we sicken me.", 
   {}, 
   20200, 
   null, 
   1066780980.0
  ], 
  [
   20205, 
   null, 
   "epaphras_faith", 
   "i will most-definatly research this later, but right now, i have no time.\n \n why should they be made to suffer???!!!\n uh huh. you mean if one has money, they should be able to do anything with it? then why did we, the u.s., go after bin laden. i'm sure he'd suffer without it, right?\n \n because, we americans need the fuel-guzzling machines. anything eco-friendly must not be stylish.\n \n god we sicken me.\n\n \n It is the fact of a capitalist society, those with the gumption get the stuff.\n \n They shouldn't be allowed to do just anything. They should be free as anybody.", 
   {}, 
   20203, 
   null, 
   1066782300.0
  ], 
  [
   20206, 
   null, 
   "Crim", 
   "It's your right to buy stupid, fuel-inefficient vehicles.", 
   {}, 
   20205, 
   null, 
   1066783860.0
  ], 
  [
   20209, 
   null, 
   "epaphras_faith", 
   "It's your right to buy stupid, fuel-inefficient vehicles.\n\n \n 1) It is my right and the government should not be involved in it.\n \n 2) They are not stupid. My argument is as good as yours\n \n 3) Fuel Inefficient - So what?", 
   {}, 
   20206, 
   null, 
   1066784580.0
  ], 
  [
   20212, 
   null, 
   "AMD4EVER", 
   "3) Fuel Inefficient - So what?\n\n \n Inefficiency leads to more consumption of a limited resource. The limited resource will then increase in price over time. With our economy being sensative to that limited resource it can result in hurting our economy. It may even lead to a quicker elimination of the limited resource.\n \n There are reasons for concern over fuel efficiency and I think you have to recognize that some of the reasons are valid.\n \n \nThat does not necessarily destroy more natural resource than windmills put up on forest acreage for instance.\n\n \n Trying to justify one wrong by comparing it to another wrong doesn't make your argument right. If someone wants to debate that fuel inefficiency is a bad thing then it doesn't matter if you can find worse things than that, the fuel inefficiency will still be a bad thing.\n \n \n P.S. I love my SUV :)", 
   {}, 
   20209, 
   null, 
   1066786200.0
  ], 
  [
   20215, 
   null, 
   "epaphras_faith", 
   "Inefficiency leads to more consumption of a limited resource. The limited resource will then increase in price over time. With our economy being sensative to that limited resource it can result in hurting our economy. It may even lead to a quicker elimination of the limited resource.\n \n There are reasons for concern over fuel efficiency and I think you have to recognize that some of the reasons are valid.\n \n \n \n Trying to justify one wrong by comparing it to another wrong doesn't make your argument right. If someone wants to debate that fuel inefficiency is a bad thing then it doesn't matter if you can find worse things than that, the fuel inefficiency will still be a bad thing.\n \n \n P.S. I love my SUV :)\n\n \n Your logic is good. However, that it leads to a weakened economy does not make sense. You are looking at our current economic condition. Our current condition would be improved by consumer spending. SUV's cost more therefore more money would be poured into the economy strengthening it. Ditto for the expense of owning an SUV, more gas purchased, more repair costs, more for tires etc. So I say, go buy mucho SUV's and our economy will grow stronger.\n \n As for the environmental impact, I just don't see how environmental impact is necessarily a bad thing. We aren't going to run out of the Fuel anytime in the near future. Not even remotely near, say thousands of years. As for other concerns, I just don't see the big deal. It is usually made more of than it is. The sierra club is notorious for exagerating the data.", 
   {}, 
   20212, 
   null, 
   1066786740.0
  ], 
  [
   20219, 
   null, 
   "Crim", 
   "Ep, I'm agreeing with you that they shouldn't be banned.\n \n But how often do you see someone with an SUV who actually NEEDS that size or that power? \n SUVs are a bad fad.", 
   {}, 
   20215, 
   null, 
   1066788360.0
  ], 
  [
   20224, 
   null, 
   "gilligan8503", 
   "i don't believe that they should got o the extent to be banned, but they need to increase the miles per gallon. bush recently (about a year ago) turned down a bill that would force all suv companies to increase fuel efficiency. what a good president.", 
   {}, 
   20219, 
   null, 
   1066793460.0
  ], 
  [
   20239, 
   null, 
   "epaphras_faith", 
   "Ep, I'm agreeing with you that they shouldn't be banned.\n \n But how often do you see someone with an SUV who actually NEEDS that size or that power? \n SUVs are a bad fad.\n\n \n Thank God (or whatever higher power you ascribe to) that we don't live in a utilitarian state. Thank God we can have more than what we need. Otherwise we would eat rice and beans and rutabegas all the time.\n \n Gilligan......I don't think forcing the increase in fuel efficiency is necessary. Let a free market economy do its work.", 
   {}, 
   20219, 
   null, 
   1066806600.0
  ], 
  [
   20257, 
   null, 
   "AMD4EVER", 
   "Your logic is good. However, that it leads to a weakened economy does not make sense. You are looking at our current economic condition. Our current condition would be improved by consumer spending. SUV's cost more therefore more money would be poured into the economy strengthening it. Ditto for the expense of owning an SUV, more gas purchased, more repair costs, more for tires etc. So I say, go buy mucho SUV's and our economy will grow stronger.\n\n \n A lot of the money we spend on oil comes from within our economy and is sent to another countries economy. So the more efficiently we are able to use that resource we purchased the more money we will make per gallon therefore increasing our own efficiency. So yes, the price of oil and the efficiency that our vechicles use it at will affect the economy.", 
   {}, 
   20215, 
   null, 
   1066834860.0
  ], 
  [
   20261, 
   null, 
   "epaphras_faith", 
   "A lot of the money we spend on oil comes from within our economy and is sent to another countries economy. So the more efficiently we are able to use that resource we purchased the more money we will make per gallon therefore increasing our own efficiency. So yes, the price of oil and the efficiency that our vechicles use it at will affect the economy.\n\n \n Agreed. However, the answer is not to restrict the right of others but instead to improve fuel efficiency and to develop our own natural resources. The US has the largest deposit of oil in the world. We should be developing that resource instead of depending on foreign interests to support us.", 
   {}, 
   20257, 
   null, 
   1066842480.0
  ], 
  [
   20439, 
   null, 
   "epaphras_faith", 
   "Not that this has anything to do with the environment but, the media has portrayed SUV's in the worst possible light and they do it intentionally.\n \n Look at this Headline:\n \n Driver Of SUV Backs Over Sunbather In Volusia\n Sand May Have Saved Woman's Life\n http://www.drudgereportarchives.com/goto/?getPage=http%3A%2F%2Fwww%2Elocal6%2Ecom%2Fnews%2F2573348%2Fdetail%2Ehtml&return=http%3A%2F%2Fwww%2Edrudgereportarchives%2Ecom%2Fdsp%2Flinks%5Frecap%2Ehtm\n \n The first few sentences talk about this SUV like it was its own entity. Since when is the actual vehicle responsible for the deed? And when is the Sand intelligently working to save someone's life. The media uses techniques such as personification to fight for their ideals.\n \n Only way down in the article does it even mention the driver of the article. And what relevance is it that it was an SUV? Would a mini-van have done less damage? Would it not have been a problem had a volkswaggon been the culprit? Watch out vehicle owners......they may just turn on you.", 
   {}, 
   20261, 
   null, 
   1067022480.0
  ], 
  [
   21042, 
   null, 
   "theLIBERTARIAN", 
   "I have a full size van so that we have room for our three kids. I have a small Saturn for driving by myself. We move allot of merchandise so we bought a diesel truck. Sometimes you need large vehicles. Why ban anything people might need?", 
   {}, 
   20439, 
   null, 
   1067670720.0
  ], 
  [
   21075, 
   null, 
   "Hank", 
   "Agreed. However, the answer is not to restrict the right of others but instead to improve fuel efficiency and to develop our own natural resources. The US has the largest deposit of oil in the world. We should be developing that resource instead of depending on foreign interests to support us.\n\n \n I think you&#8217;re a little off on the US having the largest deposits of oil in the world.\n \n US &#8211; 22 billion barrels\n South America &#8211; 100 billion barrels\n Russia &#8211; 60 billion barrels\n Middle East &#8211; 700 billion barrels\n Asia &#8211; 40 billion barrels\n \n According to the Oil & Gas Journal.\n \n I agree that SUV&#8217;s should not be banned. What I don&#8217;t agree with is the US artificially depresses the price of oil through Tax subsidies, Program subsidies, Protection subsidies, and environmental subsidies. If the true price of oil was reflected in the economy, we would not be concerned about SUV&#8217;s. No one but the super-rich would be able to afford them.", 
   {}, 
   20261, 
   null, 
   1067740980.0
  ], 
  [
   21085, 
   null, 
   "AMD4EVER", 
   "I think you're a little off on the US having the largest deposits of oil in the world.\n \n US - 22 billion barrels\n South America - 100 billion barrels\n Russia - 60 billion barrels\n Middle East - 700 billion barrels\n Asia - 40 billion barrels\n \n According to the Oil & Gas Journal.\n \n I agree that SUV's should not be banned. What I don't agree with is the US artificially depresses the price of oil through Tax subsidies, Program subsidies, Protection subsidies, and environmental subsidies. If the true price of oil was reflected in the economy, we would not be concerned about SUV's. No one but the super-rich would be able to afford them.\n\n \n The US does have a ton more oil than is shown here I would imagine. The problem is that we do not have the technology to drill it and therefore it isn't considered an actual oil reserve. If we do develop technology that can drill deeper then the amount of oil that the US has will increase. I'm not sure of the amount of oil that is out of our reach but I guess it is possible that the US does have a great deal of it. This amount could be what epaphras_faith was refering to.", 
   {
    "unicode_changes_made": true
   }, 
   21075, 
   null, 
   1067757780.0
  ], 
  [
   21092, 
   null, 
   "Hank", 
   "The US does have a ton more oil than is shown here I would imagine. The problem is that we do not have the technology to drill it and therefore it isn't considered an actual oil reserve. If we do develop technology that can drill deeper then the amount of oil that the US has will increase. I'm not sure of the amount of oil that is out of our reach but I guess it is possible that the US does have a great deal of it. This amount could be what epaphras_faith was refering to.\n\n \n Well you can imagine all you want to but until there is some evidence of this \"ton more oil\" it's basically just wishful thinking. In the meantime, I don&#8217;t believe we should base our energy policy on this possible amount that you seem so confident of that no one else knows about.", 
   {}, 
   21085, 
   null, 
   1067769420.0
  ], 
  [
   21111, 
   null, 
   "AMD4EVER", 
   "Well you can imagine all you want to but until there is some evidence of this \"ton more oil\" it's basically just wishful thinking. In the meantime, I don't believe we should base our energy policy on this possible amount that you seem so confident of that no one else knows about.\n\n \n There is evidence of this oil that we cannot reach. The Oil & Gas stats will not include this oil in their numbers because it is not drillable using todays technology. They will only post proven oil reserves that are accessible.", 
   {
    "unicode_changes_made": true
   }, 
   21092, 
   null, 
   1067792760.0
  ], 
  [
   21112, 
   null, 
   "Hank", 
   "There is evidence of this oil that we cannot reach. The Oil & Gas stats will not include this oil in their numbers because it is not drillable using todays technology. They will only post proven oil reserves that are accessible.\n\n \n I am interested in reading about this. Could you post some websites that have this information?", 
   {}, 
   21111, 
   null, 
   1067793000.0
  ], 
  [
   21116, 
   null, 
   "AMD4EVER", 
   "I am interested in reading about this. Could you post some websites that have this information?\n\n \n I'm searching the web for some information on this. I just came across this and I thought you might be interested in it:\n \n \u0095 1980 -- Remaining proven oil reserves put at 648 billion barrels \n \n \u0095 1993 -- Remaining proven oil reserves put at 999 billion barrels \n \n \u0095 2000 -- Remaining proven oil reserves put at 1016 billion barrels.\n \n Edit:\n \n http://www.bradynet.com/bbs/russia/100228-0.html\n \n To add to this Russia believes it's oil reserves will increase from 48 billion to 120 billion in the next 10 years.", 
   {}, 
   21112, 
   null, 
   1067793780.0
  ], 
  [
   21119, 
   null, 
   "AMD4EVER", 
   "http://planetforlife.com/reserves.htm\n \n This site has an excellent chart displaying the growing oil reserves over the years according to Gas & Oil Journal data.\n \n http://www.thirdworldtraveler.com/Oil_watch/Oil_ReservesProducConsump.html\n \n \"Since the first oil well began pumping in Titusville, Pennsylvania on August 27, 1859, some 900 billion barrels of oil have been sucked out of the earth.\"\n \n \"While all conventional reserves-proven, unproven, and already pumped-amount at upper estimates to 2.5 trillion barrels, it's thought that another 3 trillion barrels can be extracted from unconventional sources.\"", 
   {}, 
   21116, 
   null, 
   1067794380.0
  ], 
  [
   21120, 
   null, 
   "Hank", 
   "I'm searching the web for some information on this. I just came across this and I thought you might be interested in it:\n \n &#8226; 1980 -- Remaining proven oil reserves put at 648 billion barrels \n \n &#8226; 1993 -- Remaining proven oil reserves put at 999 billion barrels \n \n &#8226; 2000 -- Remaining proven oil reserves put at 1016 billion barrels.\n \n Edit:\n \n http://www.bradynet.com/bbs/russia/100228-0.html\n \n To add to this Russia believes it's oil reserves will increase from 48 billion to 120 billion in the next 10 years.\n\n \n I certainly realize that estimating oil reserves around the world is not an exact science. I don't see how Russia have larger oil reserves than previously estimated helps the US. I'll be waiting for information on US oil reserves. But thanks for the info on Russia.", 
   {}, 
   21116, 
   null, 
   1067794500.0
  ], 
  [
   21124, 
   null, 
   "AMD4EVER", 
   "I certainly realize that estimating oil reserves around the world is not an exact science. I don't see how Russia have larger oil reserves than previously estimated helps the US. I'll be waiting for information on US oil reserves. But thanks for the info on Russia.\n\n \n Oh I thought you were looking for info on the increasing amounts of oil in the entire world, not just the US. I'm guessing epaphras_faith will have the info you need on that subject when he responds.", 
   {}, 
   21120, 
   null, 
   1067794860.0
  ], 
  [
   21127, 
   null, 
   "Hank", 
   "Oh I thought you were looking for info on the increasing amounts of oil in the entire world, not just the US. I'm guessing epaphras_faith will have the info you need on that subject when he responds.\n\n \n You stated that you imagined the US had a \"ton more oil\". I thought you knew something about it.\n \n I&#8217;m not worried about the world running out of oil. My comment was about the US subsidizing the price of oil so that it doesn&#8217;t reflect the true price. For a price we can depend on other countries for a long time.", 
   {}, 
   21124, 
   null, 
   1067796000.0
  ], 
  [
   21131, 
   null, 
   "AMD4EVER", 
   "You stated that you imagined the US had a \"ton more oil\". I thought you knew something about it.\n\n \n To quote what you said you had interest in: \"There is evidence of this oil that we cannot reach. The Oil & Gas stats will not include this oil in their numbers because it is not drillable using todays technology. They will only post proven oil reserves that are accessible.\"\n \n Do you understand now why I had no idea what you were refering to? You need to be more specific next time.\n \n \nI'm not worried about the world running out of oil. My comment was about the US subsidizing the price of oil so that it doesn't reflect the true price. For a price we can depend on other countries for a long time.\n\n \n I'd rather just see us focus on alternate fuel alternatives anyways instead of believing that fossil fuels are good enough.", 
   {
    "unicode_changes_made": true
   }, 
   21127, 
   null, 
   1067796960.0
  ], 
  [
   21135, 
   null, 
   "Hank", 
   "To quote what you said you had interest in: \"There is evidence of this oil that we cannot reach. The Oil & Gas stats will not include this oil in their numbers because it is not drillable using todays technology. They will only post proven oil reserves that are accessible.\"\n \n Do you understand now why I had no idea what you were refering to? You need to be more specific next time.\n\n \n No I don&#8217;t understand. Let&#8217;s look at the conversation.\n \n \n Your statement\n \n \nThe US does have a ton more oil than is shown here I would imagine. The problem is that we do not have the technology to drill it and therefore it isn't considered an actual oil reserve. If we do develop technology that can drill deeper then the amount of oil that the US has will increase. I'm not sure of the amount of oil that is out of our reach but I guess it is possible that the US does have a great deal of it. This amount could be what epaphras_faith was refering to.\n\n \n You were talking about US oil.\n \n \nWell you can imagine all you want to but until there is some evidence of this \"ton more oil\" it's basically just wishful thinking. In the meantime, I don&#8217;t believe we should base our energy policy on this possible amount that you seem so confident of that no one else knows about.\n\n \n I was referencing your comment about US oil as I posted your quote and referred to your &#8220;ton more oil&#8221; comment about US oil.\n \n \nThere is evidence of this oil that we cannot reach. The Oil & Gas stats will not include this oil in their numbers because it is not drillable using todays technology. They will only post proven oil reserves that are accessible.\n\n \n At this point, nothing in our conversation had been mentioned about anything other than US oil.\n \n \nI am interested in reading about this. Could you post some websites that have this information?\n\n \n My next reply. Naturally I assumed you were talking about US oil since you brought up the subject and still nothing had been mentioned about anything other than US oil. Maybe you are the one that needs to be more specific next time.\n \n By AMD4EVER\n \n \nI'd rather just see us focus on alternate fuel alternatives anyways instead of believing that fossil fuels are good enough.\n\n \n I&#8217;d rather see us focus on what is of economic and political advantage to the US, reconizing the impact it has on the world. That won&#8217;t happen until the price reflects the cost.", 
   {}, 
   21131, 
   null, 
   1067800800.0
  ], 
  [
   21189, 
   null, 
   "AMD4EVER", 
   "You seem upset by this for some odd reason. Accept my apology for ever bringing this up.", 
   {}, 
   21135, 
   null, 
   1067842200.0
  ], 
  [
   21222, 
   null, 
   "Hank", 
   "You seem upset by this for some odd reason. Accept my apology for ever bringing this up.\n\n \n LOL. You are really trying to snake your way out of the fact that you made a statement you apparently can&#8217;t back up. I didn&#8217;t plan to back you into a corner, I was just interested in what you were talking about and asked you about it. When you couldn&#8217;t produce the evidence, you accused me of not being specific. I was simply pointing out that it was you who was not being specific. I&#8217;m certainly not upset as I&#8217;m not concerned enough about the subject to be upset. And I don&#8217;t need an apology. But if you are going to apologize for something, it should be for not being able to back up what you said, not for bringing it up. Anyway I&#8217;ve gotten a good laugh out of you&#8217;re squirming.\n \n It is amazing to me though that a lot of people can&#8217;t just say &#8220;hey, I made a mistake&#8221; and go on with life.", 
   {}, 
   21189, 
   null, 
   1067866380.0
  ], 
  [
   21231, 
   null, 
   "AMD4EVER", 
   "LOL. You are really trying to snake your way out of the fact that you made a statement you apparently can't back up. I didn't plan to back you into a corner, I was just interested in what you were talking about and asked you about it. When you couldn't produce the evidence, you accused me of not being specific. I was simply pointing out that it was you who was not being specific. I'm certainly not upset as I'm not concerned enough about the subject to be upset. And I don't need an apology. But if you are going to apologize for something, it should be for not being able to back up what you said, not for bringing it up. Anyway I've gotten a good laugh out of you're squirming.\n \n It is amazing to me though that a lot of people can't just say \"hey, I made a mistake\" and go on with life.\n\n \n \"There is evidence of this oil that we cannot reach. The Oil & Gas stats will not include this oil in their numbers because it is not drillable using todays technology. They will only post proven oil reserves that are accessible.\"\n \n Here I showed that the amount of oil listed in the Oil & Gas stats will increase all around the world as technology increases.\n \n \"I am interested in reading about this. Could you post some websites that have this information?\"\n \n Here you asked to hear more about how technology will increase oil reserves in the Oil & Gas stats.\n \n I don't know why you are so perplexed or stuck on how this chain of events turned out. It was a relatively simple miscommunication on both our parts which led to me talking about one subject, the increase of oil reserves as time goes on, and you talking about another subject, the US having the largest oil reserves.\n \n If you are still not convinced of my intentions when I was posting please refer to post #18.\n \n \"I'm not sure of the amount of oil that is out of our reach but I guess it is possible that the US does have a great deal of it. This amount could be what epaphras_faith was refering to.\"\n \n I had already indicated that I wasn't going to debate that the US had the largest oil reserves in the world and as for the US having a \"ton of oil\" I also did make the debate that we do have a ton of oil that is not listed in the Oil & Gas stats. Do you debate that I have made that point especially if you take the question literally?", 
   {
    "unicode_changes_made": true
   }, 
   21222, 
   null, 
   1067877060.0
  ], 
  [
   21295, 
   null, 
   "epaphras_faith", 
   "sorry it has taken me so long to get back. \n \n Hank: Your stats are correct, except they do not include known oil deposits that we are not currently drilling such as ANWR. ANWR is estimated to contain roughly 13 billion barrels of oil. However, we cannot get at it.\n \n http://www.policyalmanac.org/environment/archive/crs_anwr.shtml\n \n Texas also has a huge deposit of oil that is currently not being produced. it is estimated to be about 129 billion barrels not being touched. \n \n http://www.texasep.org/html/nrg/nrg_4non.html\n \n Most of the statistics out there are produced by the media that is against the war in Iraq calling it a war for oil. They try to show that we have to have the Iraqi oil to survive. The truth is (and environmentalists don't want this known) that the US has plenty of oil if we would just go after it.", 
   {}, 
   21231, 
   null, 
   1067903520.0
  ], 
  [
   21321, 
   null, 
   "Hank", 
   "Texas also has a huge deposit of oil that is currently not being produced. it is estimated to be about 129 billion barrels not being touched. \n\n \n I live in Texas and work in the oil field. Yes there is a lot of oil but there is a reason it's not developed. It's called finicial economics. I think you know what I'm talking about.", 
   {}, 
   21295, 
   null, 
   1067909400.0
  ], 
  [
   21433, 
   null, 
   "somemuse", 
   "Over the past 20 years engineers have improved fuel milage of ocean going vessels by 20%. The same improvements have been made to steam turbines generating power. This translates into millions of gallons/tons of fuel.\n \n Computer managed fuel systems have greatly increased milage on cars and more importantly trucks and trains hauling freight, agian millions of gallons saved.\n \n All of these improvments were market driven, and were accomplished while the environmental community berates suvs.\n \n Do the environment a favor and become an engineer.", 
   {}, 
   21321, 
   null, 
   1067990220.0
  ], 
  [
   21434, 
   null, 
   "epaphras_faith", 
   "I live in Texas and work in the oil field. Yes there is a lot of oil but there is a reason it's not developed. It's called finicial economics. I think you know what I'm talking about.\n\n \n I do know what you are talking about, but the point remains that we could support ourselves completely. We could decrease significantly our dependence on foreign oil and then we would find that the OPEC nations have less of a hold on us and our leverage increases world wide. Likewise, I can drive whatever I darn well please.\n \n Somemuse: i like your thought. Either environmentalists can be part of the solution (like becoming engineeers instead of complaining) or they can just finish the race in the cold and dark.", 
   {}, 
   21321, 
   null, 
   1067991240.0
  ], 
  [
   21448, 
   null, 
   "somemuse", 
   "Thanks, and cheers to environmental honesty. \n \n Eviro groups focus of things that garner sympathy from an ignorant public ($$$$) and not on issues that will have a realistic positive impact on the environment.", 
   {}, 
   21434, 
   null, 
   1067996340.0
  ], 
  [
   21465, 
   null, 
   "Morfos", 
   "Cadillac Escalade, Cadillac Escalade EXT\n 12 mpg\n 16 mpg\n \n GMC K1500 Yukon, GMC K1500 Yukon XL,\n 12 mpg\n 16 mpg\n \n Land Rover Discovery Series II\n 12 mpg\n 16 mpg\n \n Chevrolet K1500 Avalanche, Chevrolet K1500 Suburban, GMC K1500 Yukon, GMC K1500 Yukon XL, Chevrolet K1500 Tahoe\n 10 mpg\n 13 mpg\n \n Mercedes-Benz G500\n 13 mpg\n 14 mpg\n \n Ford Expedition 4WD\n 13 mpg\n 17 mpg\n \n Why buy these SUVs if you can buy one of these SUVs?\n \n Toyota RAV4 M/T", 
   {}, 
   20439, 
   null, 
   1068007740.0
  ], 
  [
   21502, 
   null, 
   "epaphras_faith", 
   "Cadillac Escalade, Cadillac Escalade EXT\n 12 mpg\n 16 mpg\n \n GMC K1500 Yukon, GMC K1500 Yukon XL,\n 12 mpg\n 16 mpg\n \n Land Rover Discovery Series II\n 12 mpg\n 16 mpg\n \n Chevrolet K1500 Avalanche, Chevrolet K1500 Suburban, GMC K1500 Yukon, GMC K1500 Yukon XL, Chevrolet K1500 Tahoe\n 10 mpg\n 13 mpg\n \n Mercedes-Benz G500\n 13 mpg\n 14 mpg\n \n Ford Expedition 4WD\n 13 mpg\n 17 mpg\n \n Why buy these SUVs if you can buy one of these SUVs?\n \n Toyota RAV4 M/T\n\n \n Because I like the escalade and I can. Now, what are you doing about the environment. Ever thought about becoming an environmental engineer and doing something instead of trying to limit my rights as a citizen.", 
   {}, 
   21465, 
   null, 
   1068054060.0
  ], 
  [
   21534, 
   null, 
   "somemuse", 
   "Cadillac Escalade, Cadillac Escalade EXT\n 12 mpg\n 16 mpg\n \n GMC K1500 Yukon, GMC K1500 Yukon XL,\n 12 mpg\n 16 mpg\n \n Land Rover Discovery Series II\n 12 mpg\n 16 mpg\n \n Chevrolet K1500 Avalanche, Chevrolet K1500 Suburban, GMC K1500 Yukon, GMC K1500 Yukon XL, Chevrolet K1500 Tahoe\n 10 mpg\n 13 mpg\n \n Mercedes-Benz G500\n 13 mpg\n 14 mpg\n \n Ford Expedition 4WD\n 13 mpg\n 17 mpg\n \n Why buy these SUVs if you can buy one of these SUVs?\n \n Toyota RAV4 M/T\n\n \n Morfos, An empty semitruck gets about 7 MPG. \n The owners and opperators of these trucks hate traveling empty because its a compete waste of time and fuel... but ...due to the lack of a refined system they end up driving empty between loads.\n \n For fun n giggles figure the fuel burned by all the suvs compared to all the trucks on the road.\n \n Why not expend your energys on devizing a way to ensure trucks always have a backhaul? You would save the world millions of gallons of wasted fuel, reduce the number of trucks on the road, be heralded as a hero, and become very wealthy.\n \n Or sit there and complain about something the market has, is and will always dictate. \n \n My suv gets the best milage of all the machines I own!", 
   {}, 
   21465, 
   null, 
   1068068220.0
  ], 
  [
   21891, 
   null, 
   "Hank", 
   "I do know what you are talking about, but the point remains that we could support ourselves completely. We could decrease significantly our dependence on foreign oil and then we would find that the OPEC nations have less of a hold on us and our leverage increases world wide.\n\n \n Yes we could but not at the price for gas that we now enjoy.\n \n \n Likewise, I can drive whatever I darn well please.\n\n \n Well you already know how I feel about personal freedoms. I agree with you 100%. You should be able to drive whatever you darn well please. My point is that if the price of gas reflected the cost of the gas, only the very rich would be driving SUV's. Which is okay by me since there would be so few of them because the price of SUV's and the cost of their operation would be exorbitant. That's means the pollution would be negligible.\n \n That being said, we all know that many companies in the US take air and water from the environment, use it to manufacture products that they make profits from, then return that air and water for the rest of us to use in a polluted state. I feel the argument that companies should not be able to do that is very strong", 
   {
    "unicode_changes_made": true
   }, 
   21434, 
   null, 
   1068253200.0
  ], 
  [
   21898, 
   null, 
   "epaphras_faith", 
   "Yes we could but not at the price for gas that we now enjoy.\n \n \n \n Well you already know how I feel about personal freedoms. I agree with you 100%. You should be able to drive whatever you darn well please. My point is that if the price of gas reflected the cost of the gas, only the very rich would be driving SUV's. Which is okay by me since there would be so few of them because the price of SUV's and the cost of their operation would be exorbitant. That's means the pollution would be negligible.\n \n That being said, we all know that many companies in the US take air and water from the environment, use it to manufacture products that they make profits from, then return that air and water for the rest of us to use in a polluted state. I feel the argument that companies should not be able to do that is very strong\n\n \n Actually Hank: I think it would be cheaper gas because the current foreign market costs us so darned much right now. If we went in on the local stuff, then private companies foot the bill to begin with and reap the profits afterwards as there would not be the tarrifs etc.", 
   {
    "unicode_changes_made": true
   }, 
   21891, 
   null, 
   1068255660.0
  ], 
  [
   21956, 
   null, 
   "Hank", 
   "Actually Hank: I think it would be cheaper gas because the current foreign market costs us so darned much right now. If we went in on the local stuff, then private companies foot the bill to begin with and reap the profits afterwards as there would not be the tarrifs etc.\n\n \n I&#8217;m not sure what you mean. Can you explain why the current foreign market costs us so much?\n \n American companies developed most of the oil fields around the world and American companies reap the profits now. Can you explain what you are mean? Maybe with some actual numbers?", 
   {}, 
   21898, 
   null, 
   1068304020.0
  ], 
  [
   22095, 
   null, 
   "somemuse", 
   "I'm not sure what you mean. Can you explain why the current foreign market costs us so much?\n \n American companies developed most of the oil fields around the world and American companies reap the profits now. Can you explain what you are mean? Maybe with some actual numbers?\n\n \n \n Without actual numbers Hank. The freight has got to be a big factor...fuel, equiptment, and the liability oil tankers assume.\n \n Perhaps mentioned above, self reliance would allow us to avoid some of the political hoops we now have overseas.", 
   {
    "unicode_changes_made": true
   }, 
   21956, 
   null, 
   1068427140.0
  ], 
  [
   22096, 
   null, 
   "Hank", 
   "Without actual numbers Hank. The freight has got to be a big factor...fuel, equiptment, and the liability oil tankers assume.\n\n \n Which just goes to show how much cheaper it is to produce oil overseas. You can't compete with wells that produce tens of thousands of barrels of oil a day with wells that produce hundreds of barrels or less of oil a day.\n \n \nPerhaps mentioned above, self reliance would allow us to avoid some of the political hoops we now have overseas.\n\n \n I agree. But the economics just don't allow it.", 
   {}, 
   22095, 
   null, 
   1068431280.0
  ], 
  [
   22278, 
   null, 
   "AMD4EVER", 
   "Let's face it, the US is going to buy oil from overseas because we would rather preserve our own land and take from someone elses if economics allow for this. This is the same with the logging industry where we pay other countries to chop down their trees and give them to us so that we can maintain our forests.\n \n If we were able to save a great deal of money per gallon by getting all of our oil from here then we might do it but I don't believe that is the case at all. We don't even have to fear that we are depending too much on other countries for our oil supply as they depend even more on us than we do them. There are many sources of oil in the world and we subscribe to many of them in order to balance our amount of risk per country.\n \n Basically I don't think the trade off of cheaper prices and less politics is going to sway our government into choosing US oil over Middle East oil.", 
   {}, 
   22096, 
   null, 
   1068571980.0
  ], 
  [
   22577, 
   null, 
   "10ite", 
   "\n As for the environmental impact, I just don't see how environmental impact is necessarily a bad thing. We aren't going to run out of the Fuel anytime in the near future. Not even remotely near, say thousands of years. As for other concerns, I just don't see the big deal. It is usually made more of than it is. The sierra club is notorious for exagerating the data.\n\n \n Thats the funniest thing I've heard all year...\n \n http://www.hubbertpeak.com/laherrere/Petrotech090103.pdf", 
   {}, 
   20215, 
   null, 
   1068836100.0
  ], 
  [
   23121, 
   null, 
   "somemuse", 
   "Thats the funniest thing I've heard all year...\n \n http://www.hubbertpeak.com/laherrere/Petrotech090103.pdf\n\n \n \n Mighty roar from chicken little?\n \n The stone age did not end for the lack of stones, the days of pumping oil for energy will not end for the lack of oil.\n \n We have an abundance of oil, thousands of years of coal reserves, effectivly unlimited amount of uramium and the technology and braincells to make all the above obsolete.", 
   {}, 
   22577, 
   null, 
   1069203360.0
  ], 
  [
   23922, 
   null, 
   "10ite", 
   "Mighty roar from chicken little?\n \n The stone age did not end for the lack of stones, the days of pumping oil for energy will not end for the lack of oil.\n \n We have an abundance of oil, thousands of years of coal reserves, effectivly unlimited amount of uramium and the technology and braincells to make all the above obsolete.\n\n \n There are obviously some people that haven't left the stone age yet.", 
   {}, 
   23121, 
   null, 
   1069725360.0
  ], 
  [
   23990, 
   null, 
   "AMD4EVER", 
   "Mighty roar from chicken little?\n \n The stone age did not end for the lack of stones, the days of pumping oil for energy will not end for the lack of oil.\n \n We have an abundance of oil, thousands of years of coal reserves, effectivly unlimited amount of uramium and the technology and braincells to make all the above obsolete.\n\n \n An interesting point of view and a valid one at that. Eventually we will find a way to easily extract and take advantage of more power from clean energy than oil can provide and thus will be the end of the oil age.", 
   {}, 
   23121, 
   null, 
   1069782060.0
  ], 
  [
   24009, 
   null, 
   "epaphras_faith", 
   "Thats the funniest thing I've heard all year...\n \n http://www.hubbertpeak.com/laherrere/Petrotech090103.pdf\n\n \n I read your article. Not sure of the relevance given that the article refers almost exclusively to WORLD oil supplies and not US. Plus we were discussing SUV's. I suppose the world supply does impact the US. However, it does not show that we are running out. The data is highly skewed in the lower direction and does not account for individual differences in use between countries.\n \n As far as humor goes..............", 
   {}, 
   22577, 
   null, 
   1069788960.0
  ], 
  [
   24015, 
   null, 
   "somemuse", 
   "An interesting point of view and a valid one at that. Eventually we will find a way to easily extract and take advantage of more power from clean energy than oil can provide and thus will be the end of the oil age.\n\n \n \n Thanks, 10ite had me at a loss for a response. Grunt grunt hiss?", 
   {}, 
   23990, 
   null, 
   1069791840.0
  ], 
  [
   24139, 
   null, 
   "10ite", 
   "Thanks, 10ite had me at a loss for a response. Grunt grunt hiss?\n\n \n Ha ha ha LOL...\n \n UUUGGGG !!", 
   {}, 
   24015, 
   null, 
   1069870920.0
  ], 
  [
   24745, 
   null, 
   "Morfos", 
   "We should spend money to research different fuel. Hydrogen Cell, Solar Power, are all options instead of filthy oil. Gas pollutes our planet, not only that, but we buy it from Arabia, which then uses that money to fund terrorists.", 
   {}, 
   24139, 
   null, 
   1070216160.0
  ], 
  [
   25806, 
   null, 
   "Parcum", 
   "All I know is we just got a brand new Chevy Suburban. I love it.", 
   {}, 
   24745, 
   null, 
   1070705760.0
  ], 
  [
   26433, 
   null, 
   "superbuddhaman", 
   "\n PS. So what if People with money wnat them. Why should they be made to suffer. Do others deserve some special treatment?\n\n \n \n Suffer?!?!?!?!\n To live without some luxury item someone wants is not suffering.\n The only thing that would suffer from someone not getting his new SUV is the ego....something that should not be coddled.\n I think if you want to buy a fancy but inefficient auto and don't care what it does to the environment, then you should be restricted to driving it on the smoggiest roads, to beautiful destinations like clearcuts and polluted streams.", 
   {}, 
   20200, 
   null, 
   1070970360.0
  ], 
  [
   26450, 
   null, 
   "epaphras_faith", 
   "Suffer?!?!?!?!\n To live without some luxury item someone wants is not suffering.\n The only thing that would suffer from someone not getting his new SUV is the ego....something that should not be coddled.\n I think if you want to buy a fancy but inefficient auto and don't care what it does to the environment, then you should be restricted to driving it on the smoggiest roads, to beautiful destinations like clearcuts and polluted streams.\n\n \n And by what laws, actual or moral is it okay for YOU to tell ME what to do?", 
   {}, 
   26433, 
   null, 
   1070990220.0
  ], 
  [
   26601, 
   null, 
   "superbuddhaman", 
   "And by what laws, actual or moral is it okay for YOU to tell ME what to do?\n\n \n awwww, dont get so upset. \n I'm not telling you what to do, I am merely SUGGESTING that you get a little more conscious of the world around you, and a little less conscious of your egotistical desires.\n \n And the constitution goves me that right, its in the first ammendment. And of course, the creators of this site in which to voice my freedom of speech. Moral laws........I dont think any such thing exists, except amongst those who subscribe to a certain version of morality, those that don't subscribe are not obligated to adhere to those same standards.\n \n Try climbing out of your overpriced gluttonous vehicle and take the bus. Or walk... whatsa matter? Never learned to suck it up?", 
   {}, 
   26450, 
   null, 
   1071044460.0
  ], 
  [
   26640, 
   null, 
   "epaphras_faith", 
   "awwww, dont get so upset. \n I'm not telling you what to do, I am merely SUGGESTING that you get a little more conscious of the world around you, and a little less conscious of your egotistical desires.\n \n And the constitution goves me that right, its in the first ammendment. And of course, the creators of this site in which to voice my freedom of speech. Moral laws........I dont think any such thing exists, except amongst those who subscribe to a certain version of morality, those that don't subscribe are not obligated to adhere to those same standards.\n \n Try climbing out of your overpriced gluttonous vehicle and take the bus. Or walk... whatsa matter? Never learned to suck it up?\n\n \n Super states: \"I think if you want to buy a fancy but inefficient auto and don't care what it does to the environment, then you should be restricted to driving it on the smoggiest roads, to beautiful destinations like clearcuts and polluted streams.\"\n \n And then states that putting a restriction on it is not telling me what to do. \n \n Wrong. It is my right to own the vehicle and drive where I want. You have the right to say that you think I should look at the world around me but I have the right to ignore it and do what I want. You cannot put a restriction on just because you don't like it. There is nothing immoral about it.", 
   {}, 
   26601, 
   null, 
   1071068880.0
  ], 
  [
   31681, 
   null, 
   "daewoo", 
   "First off, I think that anybody who buys an SUV and doesn't really need one is an idiot. You go out and spend buchu bucks on something that costs more to operate, costs more in insurance, and is less reliable than a yugo. Where is the thought process here?\n \n Second, I do not think that SUV's are for the wealthy. They are for people who want to buy something more pretentious than a toyota, but can't afford anything really good. I think that if you figure the extra you pay for maintenance, gas, insurance, etc... you could probably afford a nice jag. \n \n Third, I think you should need a special license to operate anything over 8000 lbs. I am tired of soccer moms cutting me off in their suburbans because they are used to driving a honda. SUV's are bigger, stop slower, have blind spots, are harder to park. It is no wonder that people have more accidents in them.", 
   {}, 
   26640, 
   null, 
   1074412680.0
  ], 
  [
   31794, 
   null, 
   "Toxey", 
   "First off, I think that anybody who buys an SUV and doesn't really need one is an idiot. You go out and spend buchu bucks on something that costs more to operate, costs more in insurance, and is less reliable than a yugo. Where is the thought process here?\n \n Second, I do not think that SUV's are for the wealthy. They are for people who want to buy something more pretentious than a toyota, but can't afford anything really good. I think that if you figure the extra you pay for maintenance, gas, insurance, etc... you could probably afford a nice jag. \n \n Third, I think you should need a special license to operate anything over 8000 lbs. I am tired of soccer moms cutting me off in their suburbans because they are used to driving a honda. SUV's are bigger, stop slower, have blind spots, are harder to park. It is no wonder that people have more accidents in them.\n\n \n and is less reliable than a yugo.....Please...Everything is more reliable than a yugo!!!\n \n \n I think that if you figure the extra you pay for maintenance, gas, insurance, etc... Why would a suv cost more on maintenance than any other vehicle??\n \n \n Third, I think you should need a special license to operate anything over 8000 lbs. ....I might be wrong ,but I dont think there is a suv made today that is 8000 lbs.", 
   {}, 
   31681, 
   null, 
   1074486300.0
  ], 
  [
   31823, 
   null, 
   "daewoo", 
   "Sorry, I meant to say maximum rated weight of 8000 lbs (loaded).\n \n This would cover most of the SUV's out there. Also, most of the big SUV's are over 8000 lbs. The curb weight of a 10 yr old F-250 is 8420. That is a full sized truck (right off my door sticker). An SUV is heavier (of course).\n \n Projected maintenance costs on SUV's and newer pickups are MUCH higher than passenger cars. They have more parts, bigger parts (that are more expensive) and they use medium duty suspension components instead of heavy duty to improve the ride.\n \n I was looking at getting a new truck a while back. I contacted my brother who works for Ford, thinking he could get me a deal. The advise he gave me was \"avoid anything made after '96 like the plague unless you are going to buy an F450 or bigger, and Chevy is no better\". \n \n He explained that the trucks and SUV's were being engineered NOT to actually haul stuff with, but so you can look at your neiborh and go \"mine is bigger than yours\". He is the one that clued me into the XXXX suspensions they put under them. The other plae where they cut corners is in the bodies. Body panels on the new trucks and SUV's are HALF as thick as they were 10 yrs ago. This is to improve gas milage (try to lighten them up a bit).\n \n Of course, gas milage on a modern F-250 is 12 city, 16 highway. On an older one it is 18 city, 21 highway. This is because of emissions control. A lot of people confuse \"emmisions control\" with \"gas milage\" or \"power\". Realistically, the trucks and SUV's of today get crappier milage, have less power, and are built like junk.\n \n I had no idea of this until my baby brother clued me in. I figure that the trucks they were turning out today were every bit as good, but more comfortable, than the old ones. If you look at the tow ratingd of the new ones, and the max loads, they are comparable to the older ones. He explained that in order to pull this off, they changed the way that tow/max load ratings are calculated.\n \n Sorry, I got a little off topic there. It just ticks me off that they sucker people into paying $30,000 for trucks that their own engineers stamp as \"yuppie junk\".\n \n The point is, parts are mosre expensive, and designed to fail sooner on the heavier vehicles. That is why maintenance is more, and I know that the trucks and SUV's that ford makes, as well as the ones that chevy makes are considered to be the least reliable vehicles int heri fleet.\n \n I really just don't understand why people buy these if they don't just absolutly have to have them. I would sell my truck in a second if I didn't need it to pull horse trailers and equipment. I have a second car that I usually drive, and that truck stays parked unless it has a trailer behind it. My wife had a blazer that she drives in the winter (we live out in the sticks, you cannot get to town w/o 4 heel drive and good ground clearance when it snows). The rest of the time she drives a toyota.\n \n You SUV guys, ????why???? Regardless of the whole eco thing, why would you buy a gas guzzling, insurace raising, high maintenance, expensive to drive vehicle with an aluminum foil body?", 
   {}, 
   31794, 
   null, 
   1074502140.0
  ], 
  [
   31935, 
   null, 
   "Toxey", 
   "\n \n I really just don't understand why people buy these if they don't just absolutly have to have them. I would sell my truck in a second if I didn't need it to pull horse trailers and equipment. I have a second car that I usually drive, and that truck stays parked unless it has a trailer behind it. My wife had a blazer that she drives in the winter (we live out in the sticks, you cannot get to town w/o 4 heel drive and good ground clearance when it snows). The rest of the time she drives a toyota.\n \n You SUV guys, ????why???? Regardless of the whole eco thing, why would you buy a gas guzzling, insurace raising, high maintenance, expensive to drive vehicle with an aluminum foil body?\n\n \n \n Because many of us are JUST LIKE YOU,We feel like we absolutly have to have them.", 
   {}, 
   31823, 
   null, 
   1074568320.0
  ], 
  [
   31942, 
   null, 
   "daewoo", 
   "Ok, I will explain why I \"Have to have them\"\n \n First off, you cannot pull a backhoe with anythingsmaller thn an f-250. I pull a backhoe about twice a week. \n \n Second, you cannot pull an 8 horse trailer with less than an F-250. I pull one of those about twice a week\n \n Third, there is a low water crossing beteen our house and town that you can absolutly not cross if there is snow or more than 1/2 inch of rain. Last time w had snow, a guy in a semi tried it. It cannot be done.\n \n In order to get to town when we have incliment weather, we go out through the back pasture gate, drive 1/2 mile through our pasture adn then go out a gate at the other end. You go another half mile along a dirt track (no gravel, not even graded) and then drive up a 25 ft road embankment (12% grade) in order to get on a county road. \n \n We both have to make the trip to town EVERY day to work, regardless of weather. In order to make the trip, you MUST HAVE four wheel drive (and often tire chains also) and ground clearance of at least 10\".\n \n That is my definition of \"need\" in regards to one of these vehicles. Without an SUV for my wife, and a pickup for myself, she would loose her job, and I would loose my company.\n \n I fail to see how a lot of the soccer mom types, who live in town, where they plow the streets, have the same type of need. Maybe I am wrong.\n \n Also, a note......No, we did not know that our house would become entirely inaccessible every time it rained or snowed when we bought it. If we had, I assure you we would have passed on it and kept shopping.", 
   {}, 
   31935, 
   null, 
   1074570600.0
  ], 
  [
   31993, 
   null, 
   "epaphras_faith", 
   "Sorry, I meant to say maximum rated weight of 8000 lbs (loaded).\n \n This would cover most of the SUV's out there. Also, most of the big SUV's are over 8000 lbs. The curb weight of a 10 yr old F-250 is 8420. That is a full sized truck (right off my door sticker). An SUV is heavier (of course).\n \n Projected maintenance costs on SUV's and newer pickups are MUCH higher than passenger cars. They have more parts, bigger parts (that are more expensive) and they use medium duty suspension components instead of heavy duty to improve the ride.\n \n I was looking at getting a new truck a while back. I contacted my brother who works for Ford, thinking he could get me a deal. The advise he gave me was \"avoid anything made after '96 like the plague unless you are going to buy an F450 or bigger, and Chevy is no better\". \n \n He explained that the trucks and SUV's were being engineered NOT to actually haul stuff with, but so you can look at your neiborh and go \"mine is bigger than yours\". He is the one that clued me into the XXXX suspensions they put under them. The other plae where they cut corners is in the bodies. Body panels on the new trucks and SUV's are HALF as thick as they were 10 yrs ago. This is to improve gas milage (try to lighten them up a bit).\n \n Of course, gas milage on a modern F-250 is 12 city, 16 highway. On an older one it is 18 city, 21 highway. This is because of emissions control. A lot of people confuse \"emmisions control\" with \"gas milage\" or \"power\". Realistically, the trucks and SUV's of today get crappier milage, have less power, and are built like junk.\n \n I had no idea of this until my baby brother clued me in. I figure that the trucks they were turning out today were every bit as good, but more comfortable, than the old ones. If you look at the tow ratingd of the new ones, and the max loads, they are comparable to the older ones. He explained that in order to pull this off, they changed the way that tow/max load ratings are calculated.\n \n Sorry, I got a little off topic there. It just ticks me off that they sucker people into paying $30,000 for trucks that their own engineers stamp as \"yuppie junk\".\n \n The point is, parts are mosre expensive, and designed to fail sooner on the heavier vehicles. That is why maintenance is more, and I know that the trucks and SUV's that ford makes, as well as the ones that chevy makes are considered to be the least reliable vehicles int heri fleet.\n \n I really just don't understand why people buy these if they don't just absolutly have to have them. I would sell my truck in a second if I didn't need it to pull horse trailers and equipment. I have a second car that I usually drive, and that truck stays parked unless it has a trailer behind it. My wife had a blazer that she drives in the winter (we live out in the sticks, you cannot get to town w/o 4 heel drive and good ground clearance when it snows). The rest of the time she drives a toyota.\n \n You SUV guys, ????why???? Regardless of the whole eco thing, why would you buy a gas guzzling, insurace raising, high maintenance, expensive to drive vehicle with an aluminum foil body?\n\n \n Not all SUV's are as you describe. Your logic is a bit off too. A nice Jag would also have increased maintenance (due to rarity and parts costs) and insurance due to the value of the car. Therefore you actually pay more than for an SUV. Additionally, The Chevy Suburban is the workhorse SUV. Most of my friends who have owned one have owned two. Usually not more than two because the things last 300,000 plus miles. The maintenance costs are higher when they do break down, however, much of the Chevy Suburban can be done by the do it yourselfer. \n \n The Honda SUV and The Nissan Xterra both have escellent maintenance records. The land rover is also a workhorse, but has a problem that is notorious in english vehicles, oil leaks. One has to stay on top of those. \n \n It just depends on what you want it for. Being cut off by soccer moms that aren't used to driving an SUV is a ludicrous statement. You have no way of knowing whether or not they are used to it. You just don't like them for whatever reason and are stretching trying to find something useful for an argument.", 
   {}, 
   31823, 
   null, 
   1074618060.0
  ], 
  [
   32004, 
   null, 
   "somemuse", 
   "\"The Honda SUV and The Nissan Xterra both have escellent maintenance records. The land rover is also a workhorse, but has a problem that is notorious in english vehicles, oil leaks. One has to stay on top of those.\"\n \n The reason the English do not build computers is they could find no way to make them leak oil.\n \n The actual differance between a car and a suv is small. If you look at what is described as a sports utility vehicle vs family car...the needs of the driver, the typical use of both, snow, kids, snowboards, single college student, broke out of work environmental actiist. Why assault such meager differances and prefrences?\n \n At the same time a menopausal wealthy guy drives his maserati.\n \n A motor home cruises down the road at 5 MPG.\n \n We are freighting oil from the middle east ( at huge fuel costs) as opposed to drilling and pumping our own.\n \n QE 2 3 ? just launched from harbor burning how much fuel per mile....purely for fun and giggles.\n \n I know of a case where an heiress had her piolit ( a guy I know) fly a gulfstream from Fallon Nev, to San Diego then back to Seatile with special fertilizer for her garden.\n \n I think the critisisms of suvs are misguided and silly...", 
   {
    "post_info": {
     "post_title": "pooh!"
    }
   }, 
   31993, 
   null, 
   1074625440.0
  ], 
  [
   32005, 
   null, 
   "epaphras_faith", 
   "\"The Honda SUV and The Nissan Xterra both have escellent maintenance records. The land rover is also a workhorse, but has a problem that is notorious in english vehicles, oil leaks. One has to stay on top of those.\"\n \n The reason the English do not build computers is they could find no way to make them leak oil.\n \n The actual differance between a car and a suv is small. If you look at what is described as a sports utility vehicle vs family car...the needs of the driver, the typical use of both, snow, kids, snowboards, single college student, broke out of work environmental actiist. Why assault such meager differances and prefrences?\n \n At the same time a menopausal wealthy guy drives his maserati.\n \n A motor home cruises down the road at 5 MPG.\n \n We are freighting oil from the middle east ( at huge fuel costs) as opposed to drilling and pumping our own.\n \n QE 2 3 ? just launched from harbor burning how much fuel per mile....purely for fun and giggles.\n \n I know of a case where an heiress had her piolit ( a guy I know) fly a gulfstream from Fallon Nev, to San Diego then back to Seatile with special fertilizer for her garden.\n \n I think the critisisms of suvs are misguided and silly...\n\n \n Thank you. My sentements exactly.", 
   {}, 
   32004, 
   null, 
   1074627120.0
  ], 
  [
   34026, 
   null, 
   "daewoo", 
   "A Jag is not running around on a frame/suspension/drive train that utilizes components that are not designed to carry their weight. \n \n I do not question peoples right to drive an SUV, I just don't understand the logic behind it or how it is a status symbol. It seems more arguable that a guy that buys a suburban for bobbing around town is displaying his IQ and decision making skills, or lack thereof.", 
   {}, 
   32005, 
   null, 
   1076060100.0
  ], 
  [
   34031, 
   null, 
   "hvozdany", 
   "\n I agree that SUV's should not be banned. What I don't agree with is the US artificially depresses the price of oil through Tax subsidies, Program subsidies, Protection subsidies, and environmental subsidies. If the true price of oil was reflected in the economy, we would not be concerned about SUV's. No one but the super-rich would be able to afford them.\n\n \n \n I guess this thread has shifted, but since I read thought the entire thing, I thought that I would comment.\n Hank is exactly right. Not many of us tree-hugging libereals (I am calling myself that, not Hank) want to ban SUV's. Our problem is that they are essentially subsidized.\n \n Also, along the same lines of being subsidized, I am suprised that nobody has brought up the fact that suv's have to meet differnt (much less stringent) CAFE standards, etc.\n \n So, I don't think that here are many that would say that SUV's should be banned. But they should not deserve such special treatment, just because they make A LOT of profit for the car indsutry, etc.", 
   {
    "unicode_changes_made": true
   }, 
   21075, 
   null, 
   1076063280.0
  ], 
  [
   34295, 
   null, 
   "somemuse", 
   "The fuel used in SUVs is no more subsidized than the fuel burned in a VW bus or that of an over the road semi truck.\n \n The price of fuel is kept low because a high cost of energy affects almost all aspects of our life. If you raise the price of fuel, you also raise the price of fruits, tampax, tofu, computers, snowboards and evian. \n \n Raising the price of fuel (USA) would also cripple our ability to compete in the world market, fewer jobs...less money in the hands of those who then are confronted with more expensive food.\n \n Condemning SUVs is misguided, doing so using subsidized fuel as an argument is naive.", 
   {}, 
   34031, 
   null, 
   1076267520.0
  ], 
  [
   39119, 
   null, 
   "Ellette", 
   "SUVs shouldnt be banned, but I actually wrote a paper last year on how all cars should be banned as of what they are doing to our air and our environment. I have it somewhere...\n \n To remind you I am only 15, but it has some really good things in here. But SUVS arent the only problem and how much gas they guzzle.\n \n \"As a child I had my own garden. My mother gave me a portion of our graciously sized garden to flower myself. I always used sunflowers to occupy my area. I saw them as beautiful and so stunning to look at. With their heights of twelve feet or more, they made me feel like the world was stopping every time I looked at them. I would sit trying to watch them grow in size, but it was never that easy to see them grow. In this world you can never see things grow in size, you just see the outcomes. The world's growing in size every second of the day, with more and more inhabitants more fuel is needed to carry these humans around. More automobiles are being bought and shipped around the country. Automobiles are the biggest problem in the world, with many hazardous toxins entering the planet; we are doing much damage to it. As the sunflowers, people are not noticing how these toxins are affecting us. Only in future years will we see the damage, but we will not be around to see it. The biggest problem set forth can not be solved unless we take the time to sit down and watch it grow, until all of our deaths, including our earth. \n Henry Ford known to be the 'man of cars,' was not the first to show the world automobiles. Early on steam automobiles were brought by 100,000 of patents and inventors. Though, ideas of motored cars are seen in the works of Leonardo da Vinci and Isaac Newton (http://inventors.about.com). The development of the electric auto was in Scotland by Robert Anderson, who created the first crude electric carriage. France and Britain conveyed the first electric cars on the streets. At the turn of the century is when the knowledge of Henry Ford came in. He made America a pit for cars. The rich and the poor were flocking to all kinds of cars. It was he who brought cars to be what they are today.\n With the people of the world starting to depend more and more on cars then on their old horses and buggies, the world starts to use fuels and other chemicals more and more. By 1960 some of the costs of all of these fuels showed up. Traffic jams and smog, global warming and carbon dioxide build up, all were showing up. Years go by without people even noticing these changes in the world. Until today, were we are suffering immensely from the world's use of cars. \n Combustion Engine Automobiles brought dependency on fossil fuels which brought much hazardous harm. Fossil fuels are important in combustion engine cars because they are what is used for gasoline to power the cars. Fossil fuels are becoming a major reason for photochemical problems (Bernarde, 179).They are the principal source for hydrocarbons in the air, and also unburned fossil fuels are lost through evaporation that is pure fuels mixed into the atmosphere. Not only is this affecting the communities, but also the environmental aspects around us.\n Our demand for fossil fuels creates more problems environmentally than industrial. Fossil Fuels being composed of coal, oil, and natural gases need to be taken from their natural environments and be brought for manufacturing, when doing this; more problems evolve (Newton, 43). Few precautions are being taken to avoid waste when drilling oil. Lakeview, California for example produces 8 million barrels in just a few months, but over half of that amount is drained away into the environment (Newton, 43). Coal is also a cause for air and water pollution. In Environmental Pollution Newton states \"Water passing through a subsurface mine reacts with compounds of iron and sulfur in the earth, forming sulfuric acid. Acidic water, which drains into streams and rivers, produces conditions in which aquatic life cannot survive,\" (44). Some areas near mines \"devoid any semblance of normal aquatic life,\" (Newton, 44) As Fossil Fuels are more and more desired, more chemicals are being put into the air and waters to get a hold of the fuels. Transferring the fuels to the industries is also a big dilemma.\n Fossil Fuels are not found right near where the cars are made and sold, or where gasoline is sold. It needs to be transferred by many ways, train, planes, and barges. As we all know from radio and television reports, transportation is not that safe. Many accidents are prone to happen, but other than human foolishness, caused by the need for speed and intolerance. The well-known oil spill of the last decade was in the western-hemisphere in Prince William Sound in Alaska. Eleven million gallons of oil were lost to the sound and damaged wildlife and plantation life. Farther back in time, a tanker of the coast of England broke apart and over two months the tanker lost over 120,000 tons of oil. English and French sections of the channel were affected immensely. These accidents with dramatic outcomes catch the public's attention, when they only represent a small fraction of all oil lost during transportation of oil. Oil tankers will carry seawater to balance oil in tanks. Then, when they clean out the tanks most tankers will just dump the mixture of oil and water into the ocean before loading up again with crude oil (Newton, 48). The effects on the oceans and wildlife are tremendous, thousands and thousands of fish die each hour due to flawed transportation. More than a million tons of oil was lost in over 3,700 spills in the Western Hemisphere alone (Newton, 48). With that fact you can just imagine how much wildlife and pollution is being situated into the world today.\n Each decade cars are getting more and more advanced, at the local car show there are cars that look as if they came from the Jetsons as if the future is nearer. Makers are making cars have better features, with more speed, power, sport, and design. They are looking over the important things, the engines and exhaust. These two places are where the chemical diffusions take place. The polluted air is transferred back into the atmosphere and built up to create smog and other toxins. Research to rid the air of these bacteria's are not being given money, manufactures are just using it for investment, which is a wrong idea.\n The causes of much harm relate to different topics. Realizing cars are the biggest problem in the world, numerous problems accounted in this world spool off of them. Harms that are causing these problems are getting worse by each day. So many people are using cars and transportation, which not only means pollution is being dumped, but in high numbers. 52% of air pollutants come from carbon monoxide guzzled out by cars (Stwertka, 82). Of about 70,000 chemical compounds used commercially today, roughly half are considered potentially or actually hazardous to health by the US Environmental Protection Agency (Ehrlich, 130). With over half of air pollution coming from cars, it shows how earth friendly automobiles really are. Toxins from our 'stylin' cars are not as good looking as that shining coat of gleaming red paint. Manufactures lead you to believe that their product isn't as bad as that other car on the street, by making their cars beauties, when their car is letting out just as much fuel and hydrocarbons (Ehrlich, 130). With large cities having traffic jams of cars, full of these fuels and exhausts, their pollutants could add up to over a ton of gases. Not only are these cities bringing toxins into the air, but they are creating smog, and bringing the world's attention to Greenhouse effect. \n Everybody in the world has heard of Global Warming and the green house effect, even in third world countries because they are being affected by it. Especially because they are the countries that use oil drilling for their wealth, as John Gribbin explains in The Hole in the Sky (231). The main problem with the green house effect is carbon dioxide emission is being increased due to autos. Even though carbon dioxide is a pollutant increased numbers can cause ice ages or global warming (Zuckermann, 31). As the worry for global warming and the green house effect increases the more and more people are looking into the problems, but aren't looking directly at cars. People in the world are becoming to depend so deeply on cars that they cannot admit that they are the soul cause for all of this. When only they will believe this when either the earth's ozone layer completely vanishes, or they die from the pollutants.\n Smog is in the air, no defiantly not Spring, when the winter airs cool and hotter air is in the atmosphere smog becomes a problem yet again. Smog is dirtied air that affects people and plants. Smog infects soybeans, wheat, tomatoes, peanuts, lettuce, and cotton, and of course humans (Steger and Bowermaster, 53). Smog has dirtied up city after city due to the heavy traffic, which creates heavy pollutants and toxins. Smog has many effects on not just the environment, like ozone layer deflation, but also on humans. All lung activity is affected by smog entering the body, symptoms that are usually shown when having illnesses such as upper respiratory or emphysema are shown in people who have been around high amounts of smog, as Steger and Bowermaster tell the public on page 51 of Saving the Earth. Smog can damage your body as badly as cigarette smokers. The healthiest of people can get cancer and have deflated lung capacity due to just living in a bustling city. With less and less rural areas available to people to live in, the less places to get away from smog and toxins. With so many health problems developing from Smog and other problems in the air due to cars, the unthinkable is happening. People are dying from using their cars to excess. Death from pollution is happening to more wildlife than humans, but slowly the development of cases are starting to show up (Steger and Bowermaster, 53). \n A human being or an animal should not have to worry about dieing because of where they live. All over the world people are showing up on death's door due to cars, the worst cases in England, United States, and Russia (Cozik, 183-186). Something needs to be done about all of this. Getting around to places should not be considered the biggest problem in the world, but because it is, actions need to be taken.\n The only way we are able to get rid of the pollution and harms to the earth is to try and change it. At the moment in time, nobody is trying to solve this enormous problem. Transportation is causing harmful pollutions that lead to disease and death. It is giving the environment we have a lowdown makeover. The Earth is paying considerably for all the cars. The only way to get rid the problem is to get rid of the exhaust that causes the toxins and bacteria. By doing this, the Earth will be able to clean up its atmosphere without the help of humans, but naturally. The natural way for everything is always the better way, because the Earth only uses pure sources.\n It would take many steps to complete the task of ridding the Earth of all the toxins and wasteful bacteria's cars create. To complete the duty it requires many stages and steps. At first it will be made that all cars sold will be either hybrids or electric, if others are sold they will be taken from the owners and they will be made to pay for the moving of the vehicle to a dump. No money will be given back to show how this shall not happen again. After the people of the world get the concept of that, more actions will be taken. Industries that make cars will have to dispose of their waste not into the air, but into compound air safe managements that will filter the toxins out of the air, before it goes back into the air. The only air that will be allowed to be coming from cars will be either hydrogen or oxygen. Everything else needs to be filtered during the production of the new cars. If they aren't, again the businesses will be shut down. \n Not only do you have to set down the rules, but make them be enforced. To make sure companies abide to these rules, the rules will become the law, and if they are broken the companies and the cars will be impounded. This is not going to jail for a few years, and have the problem still existing, but having the punishment severe enough it will give the breaker more pain than jail is. Jail is not a solution for people who abuse their car rights, but a place for murders. If we send car abusers to jail the outside world will just continue on the way it is. No matter what we do people will still break the law, because when something is not available for them, they have a need for the injustices. \n After fifty or more years after this set of new regulation comes into effect the air will be getting more proper filtration and it will be much cleaner. The problem can't be fixed without all cars being taken away, which can not happen in the society we live in, but we can make the problem as small as a president's choking on pretzels yearly. We can make the world a better place and \n My garden full of sunflowers has now died, and is now planted with tiny seeds for the next year. Who knows how big they will get, only will we find out after the sunflower's sprout. Just like the biggest problem in the world will we find out how tall those plants will grow. Automobiles are the biggest problem in the world, because of all the damage they are doing to the Earth. As the sunflowers, we can't see the problem till it grows to a large size. Action needs to be taken as soon as possible, and if we can right now. The world we live on depends on cars, but it also depends on oxygen. If all that oxygen is being taken over by toxins and polluted air, then the mixture will kill us all. Something needs to be done about cars, and only if we try can something happen. The biggest problem can only be diminished if we start to stop watering. Until than, the problem will keep growing just as my childhood garden did.\"", 
   {
    "unicode_changes_made": true
   }, 
   20194, 
   null, 
   1078985340.0
  ], 
  [
   45398, 
   null, 
   "sglaine", 
   "Buy Bis American SUVs support America not those imports I think they should ban Yuppie mobles like Volvos, Saabs, Toyota, BMWs, Audi, Lexus,ECT ECT. This is America darn it live it. Big Fords All The Way... Epaphas_faith how do you perpose that the horse farmers get there horses and riders around to there shows if you outlaw Big SUVs the problem here is that everybody jumps to concluions. About something with out researching it first.If you are that worried about this issue buy a moped. I like SUVs And big ones at that if you dont like them move to another country that does not have them. :xbanghead", 
   {}, 
   39119, 
   null, 
   1082678880.0
  ], 
  [
   45407, 
   null, 
   "Waxy", 
   "[QUOTE=daewoo]Projected maintenance costs on SUV's and newer pickups are MUCH higher than passenger cars. They have more parts, bigger parts (that are more expensive) and they use medium duty suspension components instead of heavy duty to improve the ride.[quote]\n \n Yes and no.\n \n I disagree on maintenance costs, I'm not sure what you're basing your opinion on. Use of the vehicle must also be considered.\n \n As for the suspension components, it depends on just what kind of truck we're talking about.\n \n \nI was looking at getting a new truck a while back. I contacted my brother who works for Ford, thinking he could get me a deal. The advise he gave me was \"avoid anything made after '96 like the plague unless you are going to buy an F450 or bigger, and Chevy is no better\".\n\n \n Your brother isn't much of a salesman. emoticon_smile \n \n I don't know where he gets that info from, seems ludicrous to me. \n \n \nHe explained that the trucks and SUV's were being engineered NOT to actually haul stuff with, but so you can look at your neiborh and go \"mine is bigger than yours\". He is the one that clued me into the **** suspensions they put under them.\n\n \n I think this is BS too. Trucks can ride better and still haul a load. I won't deny that half tons have become more urban, and in the process lost some of their capability, but that's why the 3/4 ton and up market is so strong.\n \n \nThe other plae where they cut corners is in the bodies. Body panels on the new trucks and SUV's are HALF as thick as they were 10 yrs ago. This is to improve gas milage (try to lighten them up a bit).\n\n \n That's dead on, and it Peeves me off.\n \n \nOf course, gas milage on a modern F-250 is 12 city, 16 highway. On an older one it is 18 city, 21 highway. This is because of emissions control. A lot of people confuse \"emmisions control\" with \"gas milage\" or \"power\". Realistically, the trucks and SUV's of today get crappier milage, have less power, and are built like junk.\n\n \n This paragraph is complete and utter BUNK. Go check out some truck sites, maybe try www.ford-trucks.com and try to gain some knowledge on the subject.\n \n \nThe point is, parts are mosre expensive, and designed to fail sooner on the heavier vehicles. That is why maintenance is more, and I know that the trucks and SUV's that ford makes, as well as the ones that chevy makes are considered to be the least reliable vehicles int heri fleet.\n\n \n How do you know this?\n \n Again, this paragraph is baseless.\n \n Waxy", 
   {}, 
   31823, 
   null, 
   1082680500.0
  ], 
  [
   45409, 
   null, 
   "Anastasia", 
   "I live in Los Angeles, 2 kids and I drive a Ford Explorer....\n I need a big car, planning another child this year...\n Tell me' what other vehicle can carry everything you need for 3 kids, 2 adults to do just about anything... We camp just about every weekend during the summer and my truck still is not big enough. Just a trip to the grocery store fills up the back up truck all the way... 2 car seats, a huge teenager....\n Sorry if those of you feel they should be banned but until you have a family maybe you will think differently.\n \n on edit... I have had my explorer for 3 years and not one problem....\n It has been a great vehicle and I have used it to do just about everything!!!!!!", 
   {}, 
   45398, 
   null, 
   1082680620.0
  ], 
  [
   45410, 
   null, 
   "Waxy", 
   "OK folks, on the topic of oil reserves.\n \n Here's a couple sites you should check out.\n \n http://www.opec.com/ (This is not the website of the oil cartel)\n \n http://energy.cr.usgs.gov/oilgas/wep/index.htm - Official USGS numbers\n \n www.cspg.org\n \n www.aapg.org\n \n ***IMPORTANT - Oil reserves are always quoted in bbls, this figure usually also contains NATURAL GAS reserves. Gas is converted to bbls of oil on a 6:1 or 10:1 scale. The volume of reported \"oil\" reserves can be drastically skewed if natural gas reserves are included.\n \n There simply isn't \"tons of oil\" in the US, there's very little remaining undiscovered.\n \n If after checking the sites, anyone has questions, let me know, I'll try to answer them.\n \n Waxy", 
   {}, 
   45407, 
   null, 
   1082680920.0
  ], 
  [
   45432, 
   null, 
   "sglaine", 
   "I do not care for studys on car repair cost because if you take cake care of what ever you drive you can keep the cost down on repairs. My 95 F-250 Ford ony cost us a $100.00 to keep for 5 years and that is not bad for a working class truck. The driver did not driver like a mad man. Like pushy folks that are always late for this and late for that. If it was driven like a mad man that truck would not last like it did. We traded it 3 Months ago for a 99 F250 and it gets better gas milage then the 95 did it gets 15mpg. I think big SUVs and big pickup trucks are safer also it is an American way.We do also have 3 other big Fords and whould not have it any other way. You can see them on FTE. I think that folks as a rule are the most rudist drivers on the road they think cause they are saving gas does not mean drive like a fool. Also lets make our own fuel insted of opec. Lets bring back some good American jobs. emoticon_xagree", 
   {}, 
   45410, 
   null, 
   1082685360.0
  ], 
  [
   69028, 
   null, 
   "Famous Amos", 
   "your theory is wrong.\n \n miles per gallon in compairison\n \n why are suvs and other certain gas-guzzling cars needed? to feed the greed of the high-class.\n\n \n \n As long as emission standards are met, why should people not be allowed to buy the vehicles they want, and use all the gas they want? If you have the money, you can buy all the gas you want. There are no restrictions on how much gas you can buy. The limited resource argument is a joke. Gold, coal, natural gas, etc are all limited resources, but we are not limited to the amounts we can purchase. Feeding the greed? What about obese people who eat too much? Should the government stop their greed?\n \n Look at how much people drive. Most people don't drive large SUVs to work; most people use them to take their kids to soccer practice or take them on vacation. SUVs, in general, aren't the primary car for a family. Most people drive more economical cars to work, probably about 1200-1500 miles a month. Should we limit the amount of gas they can buy? \n \n What about people who buy cars and \"supe\" them up? What if someone buys a Honda Civic, which gets 25mpg, and puts a 454 in it? Puts a supercharger in it? Then it gets 15mpg. How are we going to regulate that?\n \n It also seems that people only want to ban SUVs. How come nobody mentions Lamborghini Gallardos, Diablos, or Murcielagos, or Ferrari Enzos, 360s, or 430s, or Lotus Esprits, or Saleen S7s, or Dodge Vipers, or Maybachs, or Rolls Royces, or Bentleys, or classic sports cars? Many of those cars get worse gas mileage than SUVs. A Lamborghini Murcielago gets 9 in the city and 14 on the highway, much worse than an Excursion or a diesel Hummer. It seems as if people selectively pick which vehicles they want to ban.\n \n What about buses, dump trucks, airplanes, ships, etc that all use large amounts of gas? What are we going to do about them?\n \n I own a 2001 Ford Excursion with a 6.8L V10 that gets about 11 or 12 mpg, and I love it. I hope it makes all of you mad that I buy 44 gallons of gas at a time, and use it all up in a few weeks. And I am going to be getting a Corvette soon too, and hopefully I can buy as much gas as possible for it.\n \n I don't have a problem charging a gas guzzler tax, but I do have a problem with people telling me what I can and cannot drive.", 
   {}, 
   20199, 
   null, 
   1096483380.0
  ], 
  [
   69204, 
   null, 
   "OccamsRazor", 
   "The reason the English do not build computers is they could find no way to make them leak oil.\n\n \n Actually, its because once we had invented them we got on the job of finding the next big thing ;) \n \n I'm surprised that in this whole thread there has been no mention of the laws (and exploitation thereoff) that lead to the current contoversy over SUV's:\n \n http://www.cnie.org/nle/crsreports/RS20298.pdf\n \n Needs Adobe Acrobat Reader.\n \n So SUV's are on an easy ticket as far as emission regulation goes.\n \n \n I don't have any objection to a person owning a 4x4 who has a genuine need for it. What is wrong is people who drive these things for city commuting and the nearest they ever get to their intented purpose (crossing difficult terrain with large loads) is the occasional curb and the weekly shopping trip.\n \n These vehicles consume more resources in every regard- they require more material to manufacture, cost more to transport and consume more petrol when in use. There is no real comparison with performance cars either- such vehicles are subject to standard emission rules that are designed for communting vehicles and their high cost and limited utility limits their numbers and use when they are bought.\n \n Couple that with the fact that a 4x4 is 24 times more likely to cause a fatality in a side collision (which are the common cause of serious injury and death in RTA's) and the effect they have on pedestrians who are unlucky enough to be hit by them and there is a clear need for measures to limit and control their use in areas where they are unnecessary such as city centres.", 
   {}, 
   69028, 
   null, 
   1096560720.0
  ], 
  [
   69208, 
   null, 
   "Famous Amos", 
   "I don't have any objection to a person owning a 4x4 who has a genuine need for it. What is wrong is people who drive these things for city commuting and the nearest they ever get to their intented purpose (crossing difficult terrain with large loads) is the occasional curb and the weekly shopping trip.\n\n \n So now when you go to the Ford dealership to buy an F-350, you have to show pictures of your farm and prove that you tow a boat a few times a week? You seem to a little misguided about SUVs and 4x4s. 99.9% of 4x4 are not full time 4 wheel drive. They have things called hubs on the wheels and devices inside to turn on the 4x4. For instance, you can purchase a 2x4 Excursion and a 4x4 Excursion. Both of them function as 2x4 unless you turn on 4x4 in the 4x4 Excursion. Gas mileage is nearly identical in the two Excursions. People don't use 4x4 to drive down the interstate; it is only made for speeds around 25mph and not on paved roads. The same works for trucks. You can buy 2x4 or 4x4 models, which get nearly identical gas mileage in the 2x4 mode. \n \n \nThese vehicles consume more resources in every regard- they require more material to manufacture, cost more to transport and consume more petrol when in use. There is no real comparison with performance cars either- such vehicles are subject to standard emission rules that are designed for communting vehicles and their high cost and limited utility limits their numbers and use when they are bought.\n\n \n HAHA!! They require more material to build is a reason to limit sales of them? What's next..a limit on how big your house can be? Or the height skyscrapers can be? Or how long bridges can be? Obviously SUVs consumer more gas than cars, but they also carry more people than cars. A Honda Civic and comfortably hold 4 people. A Ford Excursion can comfortably hold 8. Why can't a family of 8 buy an Excursion, rather than 2 Hondas, with both options using the same amount of gas? Well if the costs are so high anf the use is so limited, why do they have gas guzzler taxes? Lamborghinis get driven maybe a 100 or 200 miles a month, yet buyers have to fork over $10,000 in gas guzzler taxes, even though they might not even use up a tank of gas each month?\n \n \nCouple that with the fact that a 4x4 is 24 times more likely to cause a fatality in a side collision (which are the common cause of serious injury and death in RTA's) and the effect they have on pedestrians who are unlucky enough to be hit by them and there is a clear need for measures to limit and control their use in areas where they are unnecessary such as city centres.\n\n \n Where did you get that statistic? 24 times more likely compared to what? To say it is 24 times more likely to result in a fatality means it has to be compared to another vehicle, which you failed to show. And pedestrians? Please tell me that's a joke. What about Mack trucks and semis? Do we get rid of them because if they hit pedestrians they will die?", 
   {}, 
   69204, 
   null, 
   1096562040.0
  ], 
  [
   69220, 
   null, 
   "sinjin", 
   "I'd bet that if we outlawed cruise ships we'd save enough resources to all drive SUV's. What about all those hippies driving inefficient beaters all around the country following \"The Dead\"? Shameful. And movies, what a waste of resources. Oh and ....nevermind. :xbanghead", 
   {}, 
   69208, 
   null, 
   1096564920.0
  ], 
  [
   69230, 
   null, 
   "OccamsRazor", 
   "Famous Amos: Unfortunately as you are now banned you cannot respond, so I hope this gives you some food for constructive thought:\n \n \nSo now when you go to the Ford dealership to buy an F-350, you have to show pictures of your farm and prove that you tow a boat a few times a week? You seem to a little misguided about SUVs and 4x4s. 99.9% of 4x4 are not full time 4 wheel drive. They have things called hubs on the wheels and devices inside to turn on the 4x4. For instance, you can purchase a 2x4 Excursion and a 4x4 Excursion. Both of them function as 2x4 unless you turn on 4x4 in the 4x4 Excursion. Gas mileage is nearly identical in the two Excursions. People don't use 4x4 to drive down the interstate; it is only made for speeds around 25mph and not on paved roads. The same works for trucks. You can buy 2x4 or 4x4 models, which get nearly identical gas mileage in the 2x4 mode.\n\n \n I think you missed the subtley of the point. Why do you need a 4x4 that does not do \"4x4\"? Whats wrong with an Estate car?\n \n \nHAHA!! They require more material to build is a reason to limit sales of them? What's next..a limit on how big your house can be? Or the height skyscrapers can be? Or how long bridges can be? Obviously SUVs consumer more gas than cars, but they also carry more people than cars. A Honda Civic and comfortably hold 4 people. A Ford Excursion can comfortably hold 8. Why can't a family of 8 buy an Excursion, rather than 2 Hondas, with both options using the same amount of gas? Well if the costs are so high anf the use is so limited, why do they have gas guzzler taxes? Lamborghinis get driven maybe a 100 or 200 miles a month, yet buyers have to fork over $10,000 in gas guzzler taxes, even though they might not even use up a tank of gas each month?\n\n \n You are muddying the waters of the debate here- lets not start mixing our civil enginnering (which is generally driven by a need to be frugal with materials these days while being structurally sound) with our consideration of the environmental impact of vehicles balanced aganist the needs of the users. As to your point about the why of gas guzzlers, take a careful look at petroleum prices at the pump in the US compared to those of other large western industrial nations.\n \n \nWhere did you get that statistic? 24 times more likely compared to what? To say it is 24 times more likely to result in a fatality means it has to be compared to another vehicle, which you failed to show. And pedestrians? Please tell me that's a joke. What about Mack trucks and semis? Do we get rid of them because if they hit pedestrians they will die?\n\n \n A collision between 2 five-door hatchbacks 30mph IIRC, a car you would probably refer to as a \"compact\".", 
   {}, 
   69208, 
   null, 
   1096567560.0
  ], 
  [
   69238, 
   null, 
   "Famous Amos", 
   "Famous Amos: Unfortunately as you are now banned you cannot respond, so I hope this gives you some food for constructive thought:\n\n \n Apparently you are mistaken, because I am posting as we speak.\n \n \nI think you missed the subtley of the point. Why do you need a 4x4 that does not do \"4x4\"? Whats wrong with an Estate car?\n\n \n Why do you need an emergency kit in your car? What problem do you have with a car having the option of turning into 4x4, but when not in use, it gets the same gas mileage as a 2x4? Maybe some people like the convenience of being able to use 4x4 if they need it to pull a tree, drive in the snow, or help pull a car out of the ditch? I have a 4x4 Excursion with a 6.8L V10. I have had it for 2 years and used 4x4 about 5 times since I have had it. I had to pull someone's car out of the ditch and have had to drive in the snow. Do you have a problem with me owning a 4x4, and using it 99.99% of the time as a 2x4, but also having the option to use 4x4 when necessary? Why do you have the right to tell someone they can't have that option on their car?\n \n \nYou are muddying the waters of the debate here- lets not start mixing our civil enginnering (which is generally driven by a need to be frugal with materials these days while being structurally sound) with our consideration of the environmental impact of vehicles balanced aganist the needs of the users. As to your point about the why of gas guzzlers, take a careful look at petroleum prices at the pump in the US compared to those of other large western industrial nations.\n\n \n No I'm not. You said it takes much more material to make. The same thing happens when someone builds a 10,000 square foot house. They are using more material than it would take to build a 3000 square foot house. Should they not be allowed to do it because \"it takes more material\"? You used that as one of your reasons to ban SUVs, and it was absolutely pathetic. Here are some gas prices around the world:\n \n UK-$5.64\n Germany-$5.29\n Italy-$4.86\n Japan-$3.84\n United States-$1.91\n Venezuela-$.14\n \n These countries do not have near the amount of SUVs as the US. How come they pay so much more in gas prices than we do? I was watching a segment on Squawkbox the other day. An energy analyst said that if every car, truck, and SUV in the US were a Volkswagen beetle, our gas consumption would only go down by 1%!!! Gas for cars is not the main source of gas usage in the country. Industries (such as manufacturing), power plants, shipping, and the like use the majority of our gas. What do you think about cruise ships and airplanes, that eat up gas and use \"a lot more material to produce\" than cars? Should they be banned?", 
   {}, 
   69230, 
   null, 
   1096568880.0
  ], 
  [
   69247, 
   null, 
   "OccamsRazor", 
   "Apparently you are mistaken, because I am posting as we speak.\n\n \n Apparently you have just had your account reinstated, good for you emoticon_xgood \n \n \nWhy do you need an emergency kit in your car? ..............\n\n \n If you read my previous posts you will see I have answered that point already ;)\n \n \nNo I'm not. You said it takes much more material to make. The same thing happens when someone builds a 10,000 square foot house. They are using more material than it would take to build a 3000 square foot house. Should they not be allowed to do it because \"it takes more material\"? You used that as one of your reasons to ban SUVs, and it was absolutely pathetic. Here are some gas prices around the world:\n \n UK-$5.64\n Germany-$5.29\n Italy-$4.86\n Japan-$3.84\n United States-$1.91\n Venezuela-$.14\n \n These countries do not have near the amount of SUVs as the US. How come they pay so much more in gas prices than we do? I was watching a segment on Squawkbox the other day. An energy analyst said that if every car, truck, and SUV in the US were a Volkswagen beetle, our gas consumption would only go down by 1%!!! Gas for cars is not the main source of gas usage in the country. Industries (such as manufacturing), power plants, shipping, and the like use the majority of our gas. What do you think about cruise ships and airplanes, that eat up gas and use \"a lot more material to produce\" than cars? Should they be banned?\n\n \n I have not debated you before Famous Amos, but I think you should pay more attention to what I write. Where did I say I think SUV's 4x4's etc should be banned?\n \n As to your your err... \"expert\" he takes a car with a 2.0 litre engine as an example of efficiency?\n \n I'd also wonder how impartial he is....... I've read estimates that put the total consumption of fuel in cars for the US at 30-40% of the annual consumption volume. The US is responsible for 22 percent of the worlds total human annual CO2 output, with just 4% of the planets population.\n \n But as you mention fuel consumption in some other areas its a good issue- there is a growing concern with high altitude atmospheric pollution from civil aviation- that needs attention too. Don't you think petroleum consumption is an issue at all?\n \n Oh and by the way, where did I say we should ban SUV's and 4x4's again? emoticon_smile", 
   {}, 
   69238, 
   null, 
   1096571040.0
  ], 
  [
   69270, 
   null, 
   "Famous Amos", 
   "Oh and by the way, where did I say we should ban SUV's and 4x4's again? emoticon_smile\n\n \n \n Here you go...\n \n \n \nI don't have any objection to a person owning a 4x4 who has a genuine need for it. What is wrong is people who drive these things for city commuting and the nearest they ever get to their intented purpose (crossing difficult terrain with large loads) is the occasional curb and the weekly shopping trip.\n\n \n \nI think you missed the subtley of the point. Why do you need a 4x4 that does not do \"4x4\"? Whats wrong with an Estate car?\n\n \n \n Maybe you don't want to completely get rid of them, but you obviously think only certain people should be allowed to purchase them, and they have to provide some sort of evidence why they need them. If someone wants to have the 4x4 option in the car for emergency situations, why do you have a problem with that? They always drive in 2x4, so what's the problem?", 
   {}, 
   69247, 
   null, 
   1096576800.0
  ], 
  [
   69272, 
   null, 
   "OccamsRazor", 
   "Here you go...\n\n \n I don't see the word \"ban\" there. If thats what you read into my words perhaps you should have questioned further to find out what my opinion actually is before leaping to a conclusion.\n \n \nMaybe you don't want to completely get rid of them, but you obviously think only certain people should be allowed to purchase them, and they have to provide some sort of evidence why they need them. If someone wants to have the 4x4 option in the car for emergency situations, why do you have a problem with that? They always drive in 2x4, so what's the problem?\n\n \n I don't advocate a ban, and I don't believe I said I oppose sensible use of such vehicles (\"I don't have any objection to a person owning a 4x4 who has a genuine need for it\") but I do think it is not a sensible choice of vehicle for the purpose of city communiting.\n \n A ban is a notion that is unworkable in Britain so it would be grounds for civil war in the US I imagine. No, a more subtle carrot and stick approach would be in order I think.", 
   {}, 
   69270, 
   null, 
   1096577700.0
  ], 
  [
   69278, 
   null, 
   "Famous Amos", 
   "I don't see the word \"ban\" there. If thats what you read into my words perhaps you should have questioned further to find out what my opinion actually is before leaping to a conclusion.\n \n \n \n I don't advocate a ban, and I don't believe I said I oppose sensible use of such vehicles (\"I don't have any objection to a person owning a 4x4 who has a genuine need for it\") but I do think it is not a sensible choice of vehicle for the purpose of city communiting.\n \n A ban is a notion that is unworkable in Britain so it would be grounds for civil war in the US I imagine. No, a more subtle carrot and stick approach would be in order I think.\n\n \n \n How can people not buy the cars they want to buy, if they can pay for them? What about Lamborghini Diablos? What if someone uses that as his primary car, which gets 9 miles per gallon. Should he not be allowed to drive that? It just seems like people pick and choose and suggest that SUVs be banned, but fail to look at dump trucks, airplanes, fast sports cars, or cruise ships, which all are used just as much as SUVs.", 
   {}, 
   69272, 
   null, 
   1096578960.0
  ], 
  [
   69473, 
   null, 
   "billsco", 
   "I think the SUV market is in steady decline, and it is occuring without government intervention. It appears to me it's becoming a thing of the past, like tailfins of the '50's. It is happening because it is becoming socially passe and unacceptable. I hope no one is going to harp about that.", 
   {}, 
   69278, 
   null, 
   1096661580.0
  ], 
  [
   69479, 
   null, 
   "Famous Amos", 
   "I think the SUV market is in steady decline, and it is occuring without government intervention. It appears to me it's becoming a thing of the past, like tailfins of the '50's. It is happening because it is becoming socially passe and unacceptable. I hope no one is going to harp about that.\n\n \n I agree. Most logical people would rather have a car that gets good gas mileage than a car that sucks down gas. Let people decide on their own whether or not they want to deal with a car that gets 10mpg. Most people won't want to, but if some people do then let them spend their money on it. I have a problem with the government making decisions like that.", 
   {}, 
   69473, 
   null, 
   1096662600.0
  ], 
  [
   70978, 
   null, 
   "OccamsRazor", 
   "How can people not buy the cars they want to buy, if they can pay for them? What about Lamborghini Diablos? What if someone uses that as his primary car, which gets 9 miles per gallon. Should he not be allowed to drive that? It just seems like people pick and choose and suggest that SUVs be banned, but fail to look at dump trucks, airplanes, fast sports cars, or cruise ships, which all are used just as much as SUVs.\n\n \n Hello again Famous Amos.\n \n I believe I have already addressed the point on \"supercars\"- they see very limited sales and have equally limited use. I suppose if you can only visualise this issue in terms of mpg a given vehicle achieves, the Diabalo and its predecessors could present a major problem to you.\n \n As to your others, they serve purposes that are not done so by other forms of transport. They are also generally part of a business and have to be as fuel efficent as possible so that the company using them can be as competetive as possible.\n \n If you can perhaps stop thinking in terms of black and white you might be able to consider the subtlety of the issue here.", 
   {}, 
   69278, 
   null, 
   1097453580.0
  ], 
  [
   72868, 
   null, 
   "sglaine", 
   "American SUVs are cool and they are American pride. Get rid of all of the imports and our troubles will be over. But however they are not made for soccer yuppie mom's emoticon_xbouncer", 
   {}, 
   70978, 
   null, 
   1098405180.0
  ], 
  [
   72872, 
   null, 
   "Dzeron", 
   "I think SUVs will eventually ban themselves, as they are horribly inefficient and, if gas prices rise, they will be unaffordable. So, people, anticipate a rise in gas prices, and sell your SUV before it's too late!", 
   {
    "post_info": {
     "post_title": "I voted No"
    }
   }, 
   20439, 
   null, 
   1098405480.0
  ], 
  [
   73104, 
   null, 
   "GreenMtnBoy", 
   "The big coupe/sedan and station wagon will return. Since 90+ percent of SUV drivers will never haul a very heavy load, tow anything, or go off roading they are wasting their money on a truck they don't need. \n \n The industry will regulate itself just fine as long as we keep pushing for better emissions at a reasonable rate.", 
   {}, 
   72872, 
   null, 
   1098519960.0
  ], 
  [
   73884, 
   null, 
   "sglaine", 
   "My position would be that SUV's are no more harmful than any other vehicle and some of them are worse. Banning would also be an abuse of governmental power as the government has no real authority in this area.\n\n \n Why should this be any different issue that the government abuses.\n I think if anything we should ban imported cars.", 
   {}, 
   20194, 
   null, 
   1098928020.0
  ], 
  [
   171251, 
   null, 
   "Bassman", 
   "There's something else to consider here. Municipalities rely on SUVs for certain applications, such as police and fire departments. The fire department in my city uses them for the Battalion and Division Chiefs, as well as support vehicles.", 
   {}, 
   73884, 
   null, 
   1129475460.0
  ], 
  [
   171307, 
   null, 
   "lord tammerlain", 
   "There's something else to consider here. Municipalities rely on SUVs for certain applications, such as police and fire departments. The fire department in my city uses them for the Battalion and Division Chiefs, as well as support vehicles.\n\n \n \n What did they use 15-20 years ago?", 
   {}, 
   171251, 
   null, 
   1129484880.0
  ], 
  [
   171317, 
   null, 
   "georged", 
   "What did they use 15-20 years ago?\n\n \n Inexpensive sedans for officials, basic vans for transport purposes.\n \n It, commonly a black Chevy Suburban or Tahoe with deeply tinted windows, has become the unofficial US 'Black Maria'. When federal government officials and senior LE members gather, that's the predominant 'status' vehicle. While some justification might be made for group travel in a SUV (though a van would be far more practical), normal occupancy is driver only or driver and passenger, at $40k+ per copy. A police packaged Crown Vic is about $24k.", 
   {}, 
   171307, 
   null, 
   1129486440.0
  ], 
  [
   171354, 
   null, 
   "lord tammerlain", 
   "Exactly why I asked.\n \n 20 + years ago SUV's were very limited, generally only farmers, hunters and other rural living individuals, had a \"need\" for SUV's. Today soccer moms need SUV's just in case it snows. A good front wheel drive car with snow tires has just as much traction in city driving as a SUV.\n \n This so called need for SUV's is just a made up desire for something big and macho.", 
   {}, 
   171317, 
   null, 
   1129492980.0
  ], 
  [
   171357, 
   null, 
   "Bassman", 
   "Inexpensive sedans for officials, basic vans for transport purposes.\n \n It, commonly a black Chevy Suburban or Tahoe with deeply tinted windows, has become the unofficial US 'Black Maria'. When federal government officials and senior LE members gather, that's the predominant 'status' vehicle. While some justification might be made for group travel in a SUV (though a van would be far more practical), normal occupancy is driver only or driver and passenger, at $40k+ per copy. A police packaged Crown Vic is about $24k.\n\n Good point. I almost forgot that during the '90's we used Chevy Caprice wagons. But on the other hand, with the sometimes brutal winters here, a rear-wheel drive Crown Vic would not have the traction, nor the wheelbase of a Tahoe or Expedition.", 
   {}, 
   171317, 
   null, 
   1129493460.0
  ], 
  [
   171589, 
   null, 
   "Alan Ryan", 
   "I'm almost always opposed to \"banning\" things. I know that SUVs waste fuel and probably also waste every material resource from which their hefty structure is manufactured, but this wastefulness is better taxed to the point where people voluntarily abandon these vehicles and buy others that are more economical in every respect.", 
   {}, 
   171357, 
   null, 
   1129557420.0
  ], 
  [
   171595, 
   null, 
   "georged", 
   "I'm almost always opposed to \"banning\" things. I know that SUVs waste fuel and probably also waste every material resource from which their hefty structure is manufactured, but this wastefulness is better taxed to the point where people voluntarily abandon these vehicles and buy others that are more economical in every respect.\n\n \n US apathy makes it difficult to dissuade the public and government from wastefulness of any type, be it image SUVs or abnormal debt. As the USD continues its decline, basic economics of affordability is, IMO, the only workable method to force inevitable austerity. We're seeing the tip of those circumstances with mounting credit card delinquencies resulting from recent gasoline price spikes and new SUV sales plummeting 50-60%. \n \n US 2005/2006 winter heating bills should prove to be a real learning experience for the US public. Even government sources, always using numbers viewed through rose colored glasses due to manipulation, are predicting a 50% increase for heating oil and near the same for natural gas. In a time of stagnated personal wages and ridiculous personal debt, choosing between a warm residence and a gas guzzler will help open a lot of eyes as to the position our government has placed us in, a good deal of that attributed to deficit spending for aggression, further weakening our currency.", 
   {}, 
   171589, 
   null, 
   1129561260.0
  ], 
  [
   171614, 
   null, 
   "Alan Ryan", 
   "US apathy makes it difficult to dissuade the public and government from wastefulness of any type, be it image SUVs or abnormal debt. As the USD continues its decline, basic economics of affordability is, IMO, the only workable method to force inevitable austerity. We're seeing the tip of those circumstances with mounting credit card delinquencies resulting from recent gasoline price spikes and new SUV sales plummeting 50-60%. \n \n US 2005/2006 winter heating bills should prove to be a real learning experience for the US public. Even government sources, always using numbers viewed through rose colored glasses due to manipulation, are predicting a 50% increase for heating oil and near the same for natural gas. In a time of stagnated personal wages and ridiculous personal debt, choosing between a warm residence and a gas guzzler will help open a lot of eyes as to the position our government has placed us in, a good deal of that attributed to deficit spending for aggression, further weakening our currency.\n\n \n No doubt, after the fuel hikes this summer, the sales of SUVs would have fallen through the floor in any case: there is a limit to even American extravagance. \n \n But, what will happen in the SUV market is a kind of metaphor which applies to the entire US economy: it looks like the apathy you speak of - which is a combination of political laziness and economic levity - is about to catch up with the American consumer. I think affluence itself has given most Americans a false sense of security.\n \n To those of us who have grown up thinking of America as a vast emporium with huge natural resources, immensely prosperous, and with a capacity for almost unlimited material success, it comes as a bit of a shock to read, as I did yesterday, that Ford and GM stock is now teetering on the edge of junk status.", 
   {}, 
   171595, 
   null, 
   1129565820.0
  ], 
  [
   171623, 
   null, 
   "georged", 
   "No doubt, after the fuel hikes this summer, the sales of SUVs would have fallen through the floor in any case: there is a limit to even American extravagance. \n \n But, what will happen in the SUV market is a kind of metaphor which applies to the entire US economy: it looks like the apathy you speak of - which is a combination of political laziness and economic levity - is about to catch up with the American consumer. I think affluence itself has given most Americans a false sense of security.\n \n To those of us who have grown up thinking of America as a vast emporium with huge natural resources, immensely prosperous, and with a capacity for almost unlimited material success, it comes as a bit of a shock to read, as I did yesterday, that Ford and GM stock is now teetering on the edge of junk status.\n\n \n A false sense of security especially for lower and middle classes, who live with few actual reserves (uninsured 401ks at the mercy of equity markets are not considered a viable reserve) and obviously thought high prosperity was a never-ending ride. \n \n GM today announced negotiations with their labor unions have been settled prior to contract renewal in 2007. GM did not get benefit or wage reductions of a nature to cure their problem of being uncompetitive due to current cost of goods sold and legacy costs. Rumors are surfacing that GM will have to sell their financial services unit, the most profitable GM Division Kekorian is after, to pay down debt in an attempt to salvage their bond rating. Without a lower cost of production capital from bond issues, they'll be unable to eliminate operating losses from their now uncompetitive position.\n \n I see it as a 'keep our jobs and bonuses' ploy by senior management. No attempts were made to reduce white collar costs, as bloated as union wages and benefits, union workers/retiree costs are still far above market and a major shift of R&D to less expensive offshore subsidiaries and vendors has not been made. Typical head in the sand reactions, they'll **** away the cash, sell the financial unit and be in even worse shape. GM needs reorganization and management skilled in taking actions necessary to provide a balance sheet and operating statements not encumbered by tradition and self-serving lifers.", 
   {}, 
   171614, 
   null, 
   1129568160.0
  ], 
  [
   171654, 
   null, 
   "Ooaman", 
   "I don't think people should have an SUV and I refuse to ever drive one myself. But honestly, if you have an SUV, you are the one who's paying for the extra gas at lesser miles.\n If you ask me, it seems to be a win/win situation to have an economy car, but then again, I don't care to go driving recklessly and off road in icy condition in Winter on purpose.", 
   {}, 
   171623, 
   null, 
   1129571880.0
  ], 
  [
   171707, 
   null, 
   "Jo Bennett", 
   "Neither do many people with SUVs, they drive them on road. The problem is that petrol costs do not cover the full economic cost of their use. The sundry health and environmental problems caused by burning fossil fuels need to be factored into the price of fuel.", 
   {}, 
   171654, 
   null, 
   1129579080.0
  ], 
  [
   172209, 
   null, 
   "Phantos", 
   "I don't think people should have an SUV and I refuse to ever drive one myself. But honestly, if you have an SUV, you are the one who's paying for the extra gas at lesser miles.\n If you ask me, it seems to be a win/win situation to have an economy car, but then again, I don't care to go driving recklessly and off road in icy condition in Winter on purpose.\n\n \n I agree. I've always loved the SUV commercials too, with the huge SUV plowing it's way up a mountain, living up to the title \"Sport Utility Vehicle\". Suddenly, the SUV parks on a precipice at the top of the mountain, a bunch of people pile out, and start doing some sort of extreme sport. I think I've seen maybe one SUV at a park in my area. I usually just see them cruising around town, taking up half the road, and pulling up beside me at stop signs blocking most of my view.\n \n Honestly, what are the benefits of an SUV over a smaller car, or even a small pickup truck?", 
   {}, 
   171654, 
   null, 
   1129739460.0
  ], 
  [
   172215, 
   null, 
   "georged", 
   "I agree. I've always loved the SUV commercials too, with the huge SUV plowing it's way up a mountain, living up to the title \"Sport Utility Vehicle\". Suddenly, the SUV parks on a precipice at the top of the mountain, a bunch of people pile out, and start doing some sort of extreme sport. I think I've seen maybe one SUV at a park in my area. I usually just see them cruising around town, taking up half the road, and pulling up beside me at stop signs blocking most of my view.\n \n Honestly, what are the benefits of an SUV over a smaller car, or even a small pickup truck?\n\n \n While there are some legitimate applications, perceived public image has always been the primary SUV selling point. 'Look at me' mentality.", 
   {}, 
   172209, 
   null, 
   1129740600.0
  ], 
  [
   172229, 
   null, 
   "Phantos", 
   "Yep...same thing with the Hummers that are now cruising the streets.", 
   {}, 
   172215, 
   null, 
   1129743120.0
  ], 
  [
   236729, 
   null, 
   "BeTolerant", 
   "European SUV's have decent mileage. And if you can fit your entire family of perhaps nine+ (well some are) people in to one car, it's better for the environment. If anything should be banned it should be those pickup trucks, hummers etc. which have engines all have engines 6000ccms and more. It's ridiculous. I heard a statement (don't know if it's true, so don't take it for a fact) that averywhere in the world the engine of a normal car is getting smaller smaller, except in the US where it's getting bigger and bigger.", 
   {}, 
   172229, 
   null, 
   1161947580.0
  ], 
  [
   238934, 
   null, 
   "Rekhyt2238", 
   "Uh, why trucks? Our truck can fit 6 people-in other words, my family +1. In fact, if it's diesel, it's even better. Because guess where diesel comes from! The production of gas. Diesel is a byproduct of making gas. They used to just burn it to get rid of it! This is like running your car on nuclear waste!\n \n Another thing for trucks, when was the last time you got stuck in the snow or ice? Did you call someone with a prius to tow you out? When was the last time you tried to take your 5th wheel trailer up in the mountains with that good ol' prius?\n \n PS. I love my 10MPG F250.", 
   {}, 
   236729, 
   null, 
   1163135820.0
  ], 
  [
   239820, 
   null, 
   "JPSartre12", 
   "Uh, why trucks? Our truck can fit 6 people-in other words, my family +1. In fact, if it's diesel, it's even better. Because guess where diesel comes from! The production of gas. Diesel is a byproduct of making gas. They used to just burn it to get rid of it! This is like running your car on nuclear waste!\n\n You might want to rethink that position. It isn't accurate. Very little of the crude isn't used. \n http://science.howstuffworks.com/oil-refining4.htm\n \n\n Another thing for trucks, when was the last time you got stuck in the snow or ice? Did you call someone with a prius to tow you out? When was the last time you tried to take your 5th wheel trailer up in the mountains with that good ol' prius?\n \n PS. I love my 10MPG F250.\n\n \n I can tell you the last time I saw a dozen SUVs and 4WD trucks in the weeds as I passed them in my Neon. Three years ago on my way to the airport at 5:00Am while driving on black ice. People think that trucks and SUVs handle better than cars on ice. emoticon_wow emoticon_wow\n \n BTW, I'd love to have your F250 as a tow vehicle for my car and trailer.", 
   {}, 
   238934, 
   null, 
   1163568240.0
  ], 
  [
   240122, 
   null, 
   "Rekhyt2238", 
   "You might want to rethink that position. It isn't accurate. Very little of the crude isn't used.\n http://science.howstuffworks.com/oil-refining4.htm\n\n \n Sorry, I was partially mislead on that. Still, diesel is a better choice than gasoline. See \"Petroleum Diesel\" here:http://en.wikipedia.org/wiki/Diesel\n \n \nI can tell you the last time I saw a dozen SUVs and 4WD trucks in the weeds as I passed them in my Neon. Three years ago on my way to the airport at 5:00Am while driving on black ice. People think that trucks and SUVs handle better than cars on ice. \n\n \n I never said that they handle better. 4WD, does help though. It all comes down to how you drive them. Really though, nothing handles good in pure ice.", 
   {}, 
   239820, 
   null, 
   1163730960.0
  ], 
  [
   240163, 
   null, 
   "JPSartre12", 
   "Sorry, I was partially mislead on that. Still, diesel is a better choice than gasoline. See \"Petroleum Diesel\" here:http://en.wikipedia.org/wiki/Diesel\n \n\n Diesels typically get better fuel economy and last longer, but they do pollute more...mostly soot. Can't beat them for torque though. emoticon_xgood \n \n\n I never said that they handle better. 4WD, does help though. It all comes down to how you drive them. Really though, nothing handles good in pure ice.\n\n On pure ice, the lower the horsepower, the better.", 
   {}, 
   240122, 
   null, 
   1163740260.0
  ], 
  [
   240166, 
   null, 
   "jitobear", 
   "Diesels typically get better fuel economy and last longer, but they do pollute more...mostly soot. Can't beat them for torque though. emoticon_xgood \n \n On pure ice, the lower the horsepower, the better.\n\n \n I am coming in at the end of what seems to be a long thread here - but shall chim in none the less.\n \n Deisels are too noisy.\n \n As far as ice goes - this Minnesotans experience is that the tires matter more than the vehicle. Snow on the other hand....", 
   {}, 
   240163, 
   null, 
   1163743440.0
  ], 
  [
   240231, 
   null, 
   "JPSartre12", 
   "I am coming in at the end of what seems to be a long thread here - but shall chim in none the less.\n \n Deisels are too noisy.\n\n Not any more. There are some very quite diesel cars today.\n \n\n As far as ice goes - this Minnesotans experience is that the tires matter more than the vehicle. Snow on the other hand....\n\n Are you allowed to use studded tires in MN?", 
   {}, 
   240166, 
   null, 
   1163803140.0
  ], 
  [
   240242, 
   null, 
   "georged", 
   "I am coming in at the end of what seems to be a long thread here - but shall chim in none the less.\n \n Deisels are too noisy.\n \n As far as ice goes - this Minnesotans experience is that the tires matter more than the vehicle. Snow on the other hand....\n\n \n Drive one of the new generation Mercedes - no diesel sound or smell with acceleration equaling the gas engine plus 40mpg.", 
   {}, 
   240166, 
   null, 
   1163806680.0
  ], 
  [
   240251, 
   null, 
   "Rekhyt2238", 
   "Deisels are too noisy.\n\n \n Too noisy? The sound is one of my favorite parts!", 
   {}, 
   240242, 
   null, 
   1163817720.0
  ], 
  [
   240366, 
   null, 
   "zachvac", 
   "\n PS. I love my 10MPG F250.\n\n \n Just wait until you start driving and paying for your own gas. Unless you are rich, gas will be an issue when driving. Gas prices are down for now (funny how now down is considered low to mid $2's range), but I wouldn't be surprised if they go up again. Our Honda Accord gets about 25 MPG I think. That means you're paying 2.5 times the gas money that I am. I agree that gas-guzzlers shouldn't be banned though. If people want to be stupid and spend their money on something just to be macho, let 'em. I'll keep my money thanks.", 
   {}, 
   238934, 
   null, 
   1163907900.0
  ], 
  [
   240372, 
   null, 
   "JPSartre12", 
   "Just wait until you start driving and paying for your own gas. Unless you are rich, gas will be an issue when driving. Gas prices are down for now (funny how now down is considered low to mid $2's range), but I wouldn't be surprised if they go up again. Our Honda Accord gets about 25 MPG I think. That means you're paying 2.5 times the gas money that I am. I agree that gas-guzzlers shouldn't be banned though. If people want to be stupid and spend their money on something just to be macho, let 'em. I'll keep my money thanks.\n\n \n He mentiond towing. What's the maximum towing capability of your Honda Accord, about 10 pounds? ;)", 
   {}, 
   240366, 
   null, 
   1163911320.0
  ], 
  [
   240375, 
   null, 
   "Rekhyt2238", 
   "Just wait until you start driving and paying for your own gas. Unless you are rich, gas will be an issue when driving. Gas prices are down for now (funny how now down is considered low to mid $2's range), but I wouldn't be surprised if they go up again. Our Honda Accord gets about 25 MPG I think. That means you're paying 2.5 times the gas money that I am. I agree that gas-guzzlers shouldn't be banned though. If people want to be stupid and spend their money on something just to be macho, let 'em. I'll keep my money thanks.\n\n \n I never said that paying for gas wasn't an issue. As, in a few months, I will be 16 and driving. Before gas prices started to go up, diesel was quite a bit cheaper than gasoline. I think about 2001ish it was around a dollar a gallon. So, I don't know why right now it is more than premium. \n \n BTW, good one JPS!emoticon_xgood", 
   {}, 
   240366, 
   null, 
   1163911680.0
  ], 
  [
   240395, 
   null, 
   "Jo Bennett", 
   "What on earth do people need to tow that can't be managed by a normal family car with a 1.5 litre engine? Most minibuses and transit vans get better than 10mpg (a fully loaded minibus gets about 15mpg).", 
   {}, 
   240375, 
   null, 
   1163939160.0
  ], 
  [
   240406, 
   null, 
   "Rekhyt2238", 
   "Uh, Jo. Do you plan on towing a 12,000LB 5th Wheel trailer, and about a 3,000LB four wheeler trailer(so total about 7.5 tons), with a van?", 
   {}, 
   240395, 
   null, 
   1163962980.0
  ], 
  [
   240409, 
   null, 
   "georged", 
   "Uh, Jo. Do you plan on towing a 12,000LB 5th Wheel trailer, and about a 3,000LB four wheeler trailer(so total about 7.5 tons), with a van?\n\n \n When those people who submit themselves to temporary relocation from their inner-city residence to a 'vacation' inner-city full of like-minded people with massive vehicles and trailers discover they can save money and enjoy 5-star hotels the US may have reached an enlightenment level that uses common sense. I'm not holding my breath for that change.", 
   {}, 
   240406, 
   null, 
   1163964240.0
  ], 
  [
   240414, 
   null, 
   "Rekhyt2238", 
   "When those people who submit themselves to temporary relocation from their inner-city residence to a 'vacation' inner-city full of like-minded people with massive vehicles and trailers discover they can save money and enjoy 5-star hotels the US may have reached an enlightenment level that uses common sense. I'm not holding my breath for that change.\n\n \n So, just because I have a big truck, and a nice trailer, that automatically means that I live in the inner-city, and go camping with other inner-city people? To tell you the truth gorged, that couldn't be farther from the truth. The people you are refering to, camp in KOA camgrounds(full hookups, ea. power, water, sewer). I can't remember the last time we camped in one of those places. Also, a 5 star hotel, wouldn't even be close to the camping we do. Unless the weather is ######(a blizzard or almost flash flood rains), we sleep in our trailer, and occasionally eat in it. Period. So georged, please stop assuming things about me, because as you may know, when you assume, you make an XXX out of u and me.", 
   {}, 
   240409, 
   null, 
   1163965140.0
  ], 
  [
   240421, 
   null, 
   "georged", 
   "So, just because I have a big truck, and a nice trailer, that automatically means that I live in the inner-city, and go camping with other inner-city people? To tell you the truth gorged, that couldn't be farther from the truth. The people you are refering to, camp in KOA camgrounds(full hookups, ea. power, water, sewer). I can't remember the last time we camped in one of those places. Also, a 5 star hotel, wouldn't even be close to the camping we do. Unless the weather is ######(a blizzard or almost flash flood rains), we sleep in our trailer, and occasionally eat in it. Period. So georged, please stop assuming things about me, because as you may know, when you assume, you make an XXX out of u and me.\n\n \n I don't recall singling you out from the masses, but OK, we'll discuss your role in the mechanization of American vacations. Would you be one of those who spoiled my favorite elk hunting spots by dragging your rig as far into pristine wilderness as you can? Complete with music and ATVs? Or lining the coast to a point where a passer-by can't even see the water? Or clogging summertime roads to scenic spots like a mass migration of slow armadillos? I don't recall ever seeing just one fifth wheel, they seem to congregate where access is available.", 
   {}, 
   240414, 
   null, 
   1163966040.0
  ], 
  [
   240422, 
   null, 
   "Rekhyt2238", 
   "Would you be one of those who spoiled my favorite elk hunting spots by dragging your rig as far into pristine wilderness as you can? Complete with music and ATVs?\n\n \n No, we maybe pull it one or two miles off paved road, into an authorized campground. I acctually agree with you, that it ###### me off when people ruin hunting spots by illegally pulling trailers/trucks clear off road. Our ATV's stay on completely authorized trails, unlike other #######s.\n \n \nOr clogging summertime roads to scenic spots like a mass migration of slow armadillos?\n\n \n You honestly can not expect to have roads entirely to yourself. Unless you are prepared to to buy a few thousand acres for yourself that is.\n \n \nI don't recall ever seeing just one fifth wheel, they seem to congregate where access is available.\n\n \n Well, then you obviously have never seen our camp. It is us, and maybe one other small trailer.", 
   {}, 
   240421, 
   null, 
   1163966940.0
  ], 
  [
   240434, 
   null, 
   "zachvac", 
   "He mentiond towing. What's the maximum towing capability of your Honda Accord, about 10 pounds? ;)\n\n \n \n lol, you've got a point there about towing, but when talking of people using them to take kids to soccer practice before. One of our teachers at school drove a hummer there every day. Why on Earth would someone do that?\n \n P.S.\n I think my Accord could tow at LEAST 15 pounds :)", 
   {}, 
   240372, 
   null, 
   1163969160.0
  ], 
  [
   240448, 
   null, 
   "Rekhyt2238", 
   "lol, you've got a point there about towing, but when talking of people using them to take kids to soccer practice before. One of our teachers at school drove a hummer there every day. Why on Earth would someone do that?\n \n P.S.\n I think my Accord could tow at LEAST 15 pounds :)\n\n \n In response to that, I think one reason is that it's cheaper to pay for the increased gas, than to go out and buy another car.", 
   {}, 
   240434, 
   null, 
   1163973000.0
  ], 
  [
   240481, 
   null, 
   "zachvac", 
   "In response to that, I think one reason is that it's cheaper to pay for the increased gas, than to go out and buy another car.\n\n \n Well obviously, but why buy the SUV/Hummer in the first place unless you need it?", 
   {}, 
   240448, 
   null, 
   1163993160.0
  ], 
  [
   240489, 
   null, 
   "JPSartre12", 
   "What on earth do people need to tow that can't be managed by a normal family car with a 1.5 litre engine? Most minibuses and transit vans get better than 10mpg (a fully loaded minibus gets about 15mpg).\n\n \n Let's see. Race car = 3500 pounds, trailer = 2400 pounds, tools, fuel, etc. 500 pounds plus a pit crew of 4. That's about 8000 pounds or roughly 3X the size of your car. :)", 
   {}, 
   240395, 
   null, 
   1164000420.0
  ], 
  [
   240491, 
   null, 
   "JPSartre12", 
   "I don't recall singling you out from the masses, but OK, we'll discuss your role in the mechanization of American vacations. Would you be one of those who spoiled my favorite elk hunting spots by dragging your rig as far into pristine wilderness as you can? Complete with music and ATVs? Or lining the coast to a point where a passer-by can't even see the water? Or clogging summertime roads to scenic spots like a mass migration of slow armadillos? I don't recall ever seeing just one fifth wheel, they seem to congregate where access is available.\n\n \n You sound more and more uppity every day, georged. Get a life. While towing a trailer to sleep in the woods isn't my cup of tea, I don't knock the fact that it is for others. I'm sure that towing a trailer all night to make 3-5 passes on a dragstrip hundreds of miles away and then driving back home without sleeping for 24-36 hours isn't everybody's cup of tea either but who cares?", 
   {}, 
   240421, 
   null, 
   1164000840.0
  ], 
  [
   240572, 
   null, 
   "Rekhyt2238", 
   "Well obviously, but why buy the SUV/Hummer in the first place unless you need it?\n\n \n We've already determined it's to tow things.", 
   {}, 
   240481, 
   null, 
   1164083880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Should SUV's be banned?", 
  "url": "http://www.4forums.com/political/environmental-debates/1150-should-suvs-banned.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 1150, 
  "discussion_files": [
   [
    "29792.html", 
    "http://www.4forums.com/political/environmental-debates/1150-should-suvs-banned-print.html"
   ], 
   [
    "29793.html", 
    "http://www.4forums.com/political/environmental-debates/1150-should-suvs-banned-9-print.html"
   ], 
   [
    "29794.html", 
    "http://www.4forums.com/political/environmental-debates/1150-should-suvs-banned-7-print.html"
   ], 
   [
    "29795.html", 
    "http://www.4forums.com/political/environmental-debates/1150-should-suvs-banned-5-print.html"
   ], 
   [
    "29796.html", 
    "http://www.4forums.com/political/environmental-debates/1150-should-suvs-banned-4-print.html"
   ], 
   [
    "29797.html", 
    "http://www.4forums.com/political/environmental-debates/1150-should-suvs-banned-6-print.html"
   ], 
   [
    "29798.html", 
    "http://www.4forums.com/political/environmental-debates/1150-should-suvs-banned-8-print.html"
   ], 
   [
    "29799.html", 
    "http://www.4forums.com/political/environmental-debates/1150-should-suvs-banned-3-print.html"
   ], 
   [
    "29800.html", 
    "http://www.4forums.com/political/environmental-debates/1150-should-suvs-banned-2-print.html"
   ]
  ], 
  "identifier": 1150
 }
]