[
 [
  [
   320970, 
   null, 
   "foundit66", 
   "PONCE DE LEON - When a high school senior told her principal that students were taunting her for being a lesbian, he told her homosexuality is wrong, outed her to her parents and ordered her to stay away from children.\n \n He suspended some of her friends who expressed their outrage by wearing gay pride T-shirts and buttons at Ponce de Leon High School, according to court records. And he asked dozens of students whether they were gay or associated with gay students.\n \n The American Civil Liberties Union successfully sued the district on behalf of a girl who protested against Principal David Davis, and a federal judge reprimanded Davis for conducting a \"witch hunt\" against gays. Davis was demoted, and school employees must now go through sensitivity training.\n \n And despite all that, many in this conservative Panhandle community still wonder what, exactly, Davis did wrong.\n \n \"We are a small, rural district in the Bible Belt with strong Christian beliefs and feel like homosexuality is wrong,\" said Steve Griffin, Holmes County's school superintendent, who keeps a Bible on his desk and framed Scriptures on his office walls.http://www.nwfdailynews.com/news/davis_10423___article.html/gay_students.html\n \n People saying, quite explicitly, where their prejudice towards gays comes from...\n \n And while we may \"all\" agree \"this is wrong\", the truth of the matter is that it is NOT GOING TO CHANGE unless people try to change it.\n Otherwise, while \"all\" of us agree that Paul Cameron is \"a bigot and a quack\", the Christian Family groups WILL CONTINUE TO RELY on his research and attempt to use it against gays.\n And instead of correcting that, some people feel it is more important to try and criticize whether a post has a link showing where it came from and whether it came from a poster who has since been banned...\n \n There are at least a couple of ways this all can change.\n 1) People can work together to CHANGE it. And truth be told, fellow Christians are going to have the best luck at changing it. REALLY changing it.\n The ACLU will correct the ACTION that was over the line, but the HEART that was motivated to act in such a way will not be changed.\n Like anti-black prejudice before it, it will just try to get sneakier and find different excuses...\n \n 2) Inevitably, the prejudiced people will die.\n While that's morbid, it's just a fact of societal evolution. The younger generation is not adopting the prejudices of the older generation. And eventually, the older generation will be an embarrassing footnote in history...\n And the really sad part about that is that people on this board HAVE SHOWN HOW the younger generation are seeing \"Christians\" as responsible for this prejudice. The Christian churches numbers, statistics, and percentages are DROPPING for the younger generation.\n The bible tells people to \"go and make disciples of all nations\". Asking Christians to recruit.\n So when their fellow Christians are DRIVING AWAY members, by the Christian dogma, whose work are they REALLY doing? emoticon_wow\n And when others stand by and do nothing, how is that not unlike the \"Good Samaritan\" case where you had church members rushing off to do \"good works\" like feeding the hunger or caring for the homeless, but they bypass any action over helping a suffering gay person, which in turn actually leads to souls being turned away from their God...\n \n I imagine all of this is just \"preaching to the choir\" for some, and \"falling on deaf ears\" for others as posting proof of what I'm talking about, while not really an attack, is just too uncomfortable for some so they perceive it as an attack.\n \n Oh well...\n Unlike some, I will at least try...", 
   {
    "post_info": {
     "post_title": "Many support ex-principal in gay rights case"
    }
   }, 
   null, 
   null, 
   1219339020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Many support ex-principal in gay rights case", 
  "url": "http://www.4forums.com/political/gay-rights-debates/11510-many-support-ex-principal-gay-rights-case.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 11510, 
  "discussion_files": [
   [
    "16923.html", 
    "http://www.4forums.com/political/gay-rights-debates/11510-many-support-ex-principal-gay-rights-case-print.html"
   ]
  ], 
  "identifier": 11510
 }
]