[
 [
  [
   321115, 
   null, 
   "Shooterandproud", 
   "*hypothetical situation*\n \n Hi, my name is John, and here's the thing. I want to get into heaven, but I don't believe in the Christian God, because logically not a lot of his laws make sense. And I can't believe that the same god that gave us logic and reason would intend us to forgo their use (I didn't make that quote, I just forgot who said it). I am however, a compassionate and loving person, and I help whenever possible, and do my best at things. I do believe in some higher power, just not the judging Christian God. You could call me a deist. I also volunteer, and have donated much time and money to helping starving African children. \n \n \n Now, I know a guy named (random name) Mike over here is a devout believer in Jesus Christ, the Holy Spirit, and the Christian God. He goes to church every Sunday with his wife and two kids, and worships. He reads the bible daily, and prays every night. The thing is, Mike is a real d!ck. He is cranky, and never nice to anyone but his family. He never helps and is lazy sometimes. He doesn't commit any crimes, he is just a jerk, overall.\n \n [end hypothetical situation]\n \n So, which of these two people would be more likely to get into heaven, and why? I posed this question to my fourth grade religion teacher, and she said John. She claimed that to get into heaven being compassionate and good comes before believing in God.\n \n So, John or Mike?\n \n EDIT: Please do not point out spiritual or scientific improbabilities in my scenario. It is not meant to be perfect. I am interested in the questions stated above, not your opinion on how well the hypothetical situation was written.", 
   {
    "post_info": {
     "post_title": "I want to get into heaven. Can anyone help?"
    }
   }, 
   null, 
   null, 
   1219451340.0
  ], 
  [
   321121, 
   null, 
   "pandion", 
   "Well, everyone knows that you must acknowledge Jesus as your personal saviour and then you're good to go. Once you have done that, you are saved and live your life as a selfish and abusive son-of-a-gun. It doesn't matter.\n \n On the other hand, no matter how good you are, once you have been informed about Jesus and the necessity to acknowledge him as you personal saviour, unless you do so you are lost. It doesn't matter how good you are or whether you conduct your life by high and unselfish moral standards, without Jesus you are damned.\n \n At least that's what I've been told.", 
   {}, 
   321115, 
   null, 
   1219452540.0
  ], 
  [
   321123, 
   null, 
   "Shooterandproud", 
   "Well, everyone knows that you must acknowledge Jesus as your personal saviour and then you're good to go. Once you have done that, you are saved and live your life as a selfish and abusive son-of-a-gun. It doesn't matter.\n \n On the other hand, no matter how good you are, once you have been informed about Jesus and the necessity to acknowledge him as you personal saviour, unless you do so you are lost. It doesn't matter how good you are or whether you conduct your life by high and unselfish moral standards, without Jesus you are damned.\n \n At least that's what I've been told.\n\n \n Jeez, if that's what God is like then maybe I don't want to spend the rest of eternity with him. You would think that since he has provided no evidence of his existence he would maybe cut you a break, and not damn you for eternity in hell.", 
   {}, 
   321121, 
   null, 
   1219453680.0
  ], 
  [
   321158, 
   null, 
   "Archangel", 
   "*hypothetical situation*\n \n Hi, my name is John, and here's the thing. I want to get into heaven, but I don't believe in the Christian God\n\n \n Then hypothetically speaking, you are toast. But you can rest in the fact that it was by your own choice that you condemned yourself as you rejected God after He personally created the path to unconditional acceptance of you in spite of your fallen nature. But since you prefer to judge Him as if you are a god, rather than submit to Him because He is the only worthy Creator God, you will surely reap what you sow.", 
   {}, 
   321123, 
   null, 
   1219512300.0
  ], 
  [
   321166, 
   null, 
   "pandion", 
   "Then hypothetically speaking, you are toast. But you can rest in the fact that it was by your own choice that you condemned yourself as you rejected God after He personally created the path to unconditional acceptance of you in spite of your fallen nature. But since you prefer to judge Him as if you are a god, rather than submit to Him because He is the only worthy Creator God, you will surely reap what you sow.\nRight. That's just about what I said. Your god is more concerned with punishment than with love and forgiveness. Thank God that your god is a myth.", 
   {}, 
   321158, 
   null, 
   1219518960.0
  ], 
  [
   321168, 
   null, 
   "Kronus", 
   " \n So, which of these two people would be more likely to get into heaven, and why? I posed this question to my fourth grade religion teacher, and she said John. She claimed that to get into heaven being compassionate and good comes before believing in God.\n \n\n \n If God is good and benevolent, then both should get into heaven. If God isn't good, then it's a #### shoot; who knows what's needed.\n \n Simply put, a benevolent diety won't deny heaven to someone for arbitrary reasons. Failure to believe in the \"right\" God, failure to perform such and such a ceremony, even being a jerk; all these would be insufficient for a good diety to cast someone out of heaven.", 
   {}, 
   321115, 
   null, 
   1219521180.0
  ], 
  [
   321175, 
   null, 
   "Penfold", 
   "The scenario sounds like the Eskimo question. When the missionary responds that if he had never heard of Jesus, but had lived a good life there was a place in heaven set aside for him, quite reasonably the Eskimo asks \"Why did you tell me about him then?\"", 
   {}, 
   321168, 
   null, 
   1219526700.0
  ], 
  [
   321178, 
   null, 
   "Archangel", 
   "Right. That's just about what I said. Your god is more concerned with punishment than with love and forgiveness. Thank God that your god is a myth.\n\n \n For someone with an allegedly scientific mind, and who constantly will insist in scientific debates how you recognize that we live in a universe with absolute physical laws whether we have learned enough to fully understand them yet or not. That they still exist, how quickly you forget that those absolute moral and spiritual laws also exist because our Creator God is of such a character and His values permeate His Creation just as His physical Laws do. \n \n Yet you either forget or just disregard the simplest of Gospels that our God delivered to us in order to overcome His absolute spiritual laws that must deny us access to Him based on our fallen natures. Rather than marvel in the love and grace in His plan to save us all, you ignorantly choose to focus on the judgement and condemnation of those who refuse the free gift He has so lovingly offered through His own death and sacrifice that only He was perfect enough to make on our behalf. I mourn for your blindness pandion.", 
   {}, 
   321166, 
   null, 
   1219527360.0
  ], 
  [
   321184, 
   null, 
   "smiley", 
   "For someone with an allegedly scientific mind, and who constantly will insist in scientific debates how you recognize that we live in a universe with absolute physical laws whether we have learned enough to fully understand them yet or not. That they still exist, how quickly you forget that those absolute moral and spiritual laws also exist because our Creator God is of such a character and His values permeate His Creation just as His physical Laws do. \n \n Yet you either forget or just disregard the simplest of Gospels that our God delivered to us in order to overcome His absolute spiritual laws that must deny us access to Him based on our fallen natures. Rather than marvel in the love and grace in His plan to save us all, you ignorantly choose to focus on the judgement and condemnation of those who refuse the free gift He has so lovingly offered through His own death and sacrifice that only He was perfect enough to make on our behalf. I mourn for your blindness pandion.\n\n \n Believing that a single man is the gateway to heaven has nothing to do with morality or spirituality. The Eskimo scenario is a perfect example of the petty nature of the god you believe in.\n \n If the unfortunate, who have not heard the \"TRUTH\" can get into heaven via the side door (by being ritious and good), then those who attempt to spread the \"TRUTH\" do not bring salvation, they bring damnation.\n \n Smiley", 
   {}, 
   321178, 
   null, 
   1219531080.0
  ], 
  [
   321199, 
   null, 
   "marc9000", 
   "*hypothetical situation*\n \n Hi, my name is John, and here's the thing. I want to get into heaven, but I don't believe in the Christian God, because logically not a lot of his laws make sense. And I can't believe that the same god that gave us logic and reason would intend us to forgo their use (I didn't make that quote, I just forgot who said it). I am however, a compassionate and loving person, and I help whenever possible, and do my best at things. I do believe in some higher power, just not the judging Christian God. You could call me a deist. I also volunteer, and have donated much time and money to helping starving African children. \n \n \n Now, I know a guy named (random name) Mike over here is a devout believer in Jesus Christ, the Holy Spirit, and the Christian God. He goes to church every Sunday with his wife and two kids, and worships. He reads the bible daily, and prays every night. The thing is, Mike is a real d!ck. He is cranky, and never nice to anyone but his family. He never helps and is lazy sometimes. He doesn't commit any crimes, he is just a jerk, overall.\n \n [end hypothetical situation]\n \n So, which of these two people would be more likely to get into heaven, and why? I posed this question to my fourth grade religion teacher, and she said John. She claimed that to get into heaven being compassionate and good comes before believing in God.\n \n So, John or Mike? \n\n \n Mike. \n \n Is your fourth grade religion teacher also hypothetical? \n \n \nJohn 14:6 (Jesus is speaking) I am the way and the truth and the life. No one comes to the father except through Me. \n\n \n \nEphesians 2:8 For it is by grace you have been saved through faith - and this not from yourselves, it is the gift of God - not by works, so that no one can boast. \n\n \n \nEDIT: Please do not point out spiritual or scientific improbabilities in my scenario. It is not meant to be perfect. I am interested in the questions stated above, not your opinion on how well the hypothetical situation was written.\n\n \n I suspect the reason you're not interested in how well the hypothetical situation was written is because it is quite flawed, concerning your judgement of Mike. To say that he is \"never nice\", \"never helps\" reeks of a prejudice. Maybe he has a physical condition, is in constant pain, that would make him only seem to be a jerk.", 
   {}, 
   321115, 
   null, 
   1219539720.0
  ], 
  [
   321210, 
   null, 
   "DrD", 
   "Please, please people. . .the bible was never intended to be deconstructed by those who think. It was written to be obeyed without question. Some people just don't get it!", 
   {}, 
   321199, 
   null, 
   1219543380.0
  ], 
  [
   321218, 
   null, 
   "Shooterandproud", 
   "Then hypothetically speaking, you are toast. But you can rest in the fact that it was by your own choice that you condemned yourself as you rejected God after He personally created the path to unconditional acceptance of you in spite of your fallen nature. But since you prefer to judge Him as if you are a god, rather than submit to Him because He is the only worthy Creator God, you will surely reap what you sow.\n\n \n So, the big man cares more about your personal opinion (which he gave you, by the way) rather than your compassionate and truly good actions? I'm liking this God less by the day. Buddhism anyone?", 
   {}, 
   321158, 
   null, 
   1219549560.0
  ], 
  [
   321220, 
   null, 
   "Shooterandproud", 
   "Mike. \n \n Is your fourth grade religion teacher also hypothetical?\n\n \n No.\n \n \n \n \n \n \nI suspect the reason you're not interested in how well the hypothetical situation was written is because it is quite flawed, concerning your judgement of Mike. To say that he is \"never nice\", \"never helps\" reeks of a prejudice. Maybe he has a physical condition, is in constant pain, that would make him only seem to be a jerk.\n\n \n Or maybe hes just a jerk, there are plenty of those you know. And what if John is just intelligent, and a logical thinker? When was that a crime worthy of hell?", 
   {}, 
   321199, 
   null, 
   1219549980.0
  ], 
  [
   321226, 
   null, 
   "marc9000", 
   "No.\n \n \n \n \n \n \n \n Or maybe hes just a jerk, there are plenty of those you know. \n\n \n In reality, there are very few jerks who are \"devout believer[s] in Jesus Christ, the Holy Spirit, and the Christian God. He goes to church every Sunday with his wife and two kids, and worships. He reads the bible daily, and prays every night.\" I suppose some atheists could have strange definitions of what a jerk is, however. \n \n \nAnd what if John is just intelligent, and a logical thinker? When was that a crime worthy of hell?\n\n \n Every human being that has ever lived has committed a crime worthy of hell. The idea is to accept the free gift of forgiveness for it. (the \"grace\" part, in Ephesians that I quoted above) It's not difficult.", 
   {}, 
   321220, 
   null, 
   1219552080.0
  ], 
  [
   321232, 
   null, 
   "trebor", 
   "In reality, there are very few jerks who are \"devout believer[s] in Jesus Christ, the Holy Spirit, and the Christian God. He goes to church every Sunday with his wife and two kids, and worships. He reads the bible daily, and prays every night.\" I suppose some atheists could have strange definitions of what a jerk is, however. \n \n \n \n Every human being that has ever lived has committed a crime worthy of hell. The idea is to accept the free gift of forgiveness for it. (the \"grace\" part, in Ephesians that I quoted above) It's not difficult.\n\n \n I find that many people who proclaim how religious they are and very vocally at that are often the biggest jerks. They hide their bigotry behind bible verses ,and threaten the 'bbq pit\" to anyone who DARES have another opinion about God or politics than they do. Oh.. a key phrase that can point out some of these bigots to you is 'it's not my opinion but God's'", 
   {}, 
   321226, 
   null, 
   1219557300.0
  ], 
  [
   321233, 
   null, 
   "trebor", 
   "In reality, there are very few jerks who are \"devout believer[s] in Jesus Christ, the Holy Spirit, and the Christian God. He goes to church every Sunday with his wife and two kids, and worships. He reads the bible daily, and prays every night.\" I suppose some atheists could have strange definitions of what a jerk is, however. \n \n \n \n Every human being that has ever lived has committed a crime worthy of hell. The idea is to accept the free gift of forgiveness for it. (the \"grace\" part, in Ephesians that I quoted above) It's not difficult.\n\n \n \n That whole claim of a 'free gift' is a bunch of baloney. You see.. the 'price' for me to 'accept that free gift' to to turn my back on everything I believe. It comes with conditions, and therefore is not free.", 
   {}, 
   321226, 
   null, 
   1219557420.0
  ], 
  [
   321235, 
   null, 
   "GazzaElliott", 
   "In reality, there are very few jerks who are \"devout believer[s] in Jesus Christ, the Holy Spirit, and the Christian God. \n\n \n The much discussed \"No Troo Xian\" fallacy. I hate to tell you that you're utterly wrong. Many people who are recognised as Xians are jerks (although I seem to recall you not recognising the Pope as an Xian).\n \n \nHe goes to church every Sunday with his wife and two kids, and worships. He reads the bible daily, and prays every night.\" I suppose some atheists could have strange definitions of what a jerk is, however. \n\n \n Oh please get over yourself! Atheists don't think Xians are jerks because they read the bible. Some atheists think some Xians are jerks because they read nothing but the Bible... Not every atheist does this however, some of us let you damn yourself\n \n \n \nEvery human being that has ever lived has committed a crime worthy of hell. The idea is to accept the free gift of forgiveness for it. (the \"grace\" part, in Ephesians that I quoted above) It's not difficult.\n\n \n And in that one statement you've summed up why Xianity is a doctrine of hate. Well done!", 
   {}, 
   321226, 
   null, 
   1219558920.0
  ], 
  [
   321238, 
   null, 
   "Archangel", 
   "That whole claim of a 'free gift' is a bunch of baloney. You see.. the 'price' for me to 'accept that free gift' to to turn my back on everything I believe. It comes with conditions, and therefore is not free.\n\n \n There in lies the rub trebor. It's virtually impossible to receive Christ unless one does believe in what He represents at every level of His Gospel. That's why I constantly say to seek Him directly rather than trust any man or church. And the bible clearly say's this: Rom 10:9 that if you confess with your mouth Jesus {as} Lord, and believe in your heart that God raised Him from the dead, you will be saved; So there is no great trick, but it also say's that apart from Christ one can't see the truth. So I believe it is the sincere heart that is truly seeking Gods truth that opens the door to ultimately finding it. If one doesn't sincerely seek His truth, then one will never just stumble over it.", 
   {}, 
   321233, 
   null, 
   1219561080.0
  ], 
  [
   321241, 
   null, 
   "Zardoz", 
   "*sigh*\n \n This one is sooo simple.\n \n They're BOTH going to hell.\n \n John because he refuses to accept God/Jesus.\n and\n Mike because he's a fake believer. Someone who merely apes his beliefs and doesn't actually follow them.\n The bible speaks about people like Mike just as much as people like John.\n \n They's gonna burninate!\n \n \n As to the tangental commentary that's developed...'meh, I'm too tired right now.'\n I'm too worn from keeping my mistress from finding out about my girlfriend and from both of them from finding out about my 3 wifes...\n It isn't easy being a pimp. But, I just think WWJD...and all works out in the end.\n \n Ya see, 'A pimps love is different from that of a square.'", 
   {}, 
   321238, 
   null, 
   1219568880.0
  ], 
  [
   321245, 
   null, 
   "Kronus", 
   " \n Every human being that has ever lived has committed a crime worthy of hell. \n\n \n What sort of evil, unjust, horrible religion do you follow?! What have you, for example, done to deserve an eternity of pain and suffering? I'm not asking how you can avoid it, I'm asking why you think you deserve it.", 
   {}, 
   321226, 
   null, 
   1219587720.0
  ], 
  [
   321247, 
   null, 
   "Penfold", 
   "If you know you are doomed to hell for a sin committed, might as well make it a good one, worthy of the punishment. I bet that's what the xtian Hitler thought. emoticon_rolleyes", 
   {}, 
   321245, 
   null, 
   1219588740.0
  ], 
  [
   321251, 
   null, 
   "Archangel", 
   "What sort of evil, unjust, horrible religion do you follow?! What have you, for example, done to deserve an eternity of pain and suffering? I'm not asking how you can avoid it, I'm asking why you think you deserve it.\n\n \n It's useless attempting to explain it to you kronus, because you would have to have a concept of personal sin in order to appreciate the nature of a Holy God. You can't even comprehend that all it takes is THINKING ILL OF ANOTHER to sin against a perfect God. We need redemption because we have all sinned against His Holy Nature, and He supplied the route to that salvation Himself by taking our sins upon Himself. \n \n That defines the greatest possible sacrifice anyone could make for another. Yet our eternal, immortal God did it for us. That is the definition of agape love whether you have the spiritual insight to recognize it or not. It doesn't require that anyone appreciate the truth of what God did for us through Christ, on Calvary's Cross, in order to make it real or true.", 
   {}, 
   321245, 
   null, 
   1219593600.0
  ], 
  [
   321252, 
   null, 
   "Kronus", 
   " It's useless attempting to explain it to you kronus, because you would have to have a concept of personal sin in order to appreciate the nature of a Holy God. You can't even comprehend that all it takes is THINKING ILL OF ANOTHER to sin against a perfect God.\n\n I sure can't comprend how you could possibly call such a god good or just or anything worthy of worship. You are saying, and correct me if I'm wrong, that our default state is \"damned\". How can that be called fair or just? It doesn't matter if he gives us a way out, that's irrelevant to the issue that he has every human being set up to burn right out of the gate. That's simply evil.\n \n \n\n We need redemption because we have all sinned against His Holy Nature, \n\n His holy nature, as you define it, is evil. Anyone who damns you to an eternity of pain for no fault of your own is evil. The fact that you must guess at a path to avoid that fate only makes him more evil. The God you describe is a monster, there is no way such a being is the creator of the universe, and even if he is I want no part of him.", 
   {}, 
   321251, 
   null, 
   1219594200.0
  ], 
  [
   321254, 
   null, 
   "Penfold", 
   "I sure can't comprend how you could possibly call such a god good or just or anything worthy of worship. You are saying, and correct me if I'm wrong, that our default state is \"damned\". How can that be called fair or just? It doesn't matter if he gives us a way out, that's irrelevant to the issue that he has every human being set up to burn right out of the gate. That's simply evil.\n \n \n His holy nature, as you define it, is evil. Anyone who damns you to an eternity of pain for no fault of your own is evil. The fact that you must guess at a path to avoid that fate only makes him more evil. The God you describe is a monster, there is no way such a being is the creator of the universe, and even if he is I want no part of him.\n\n \n I agree, apart from the patrifocal appellation used to descibe this god. \"It\" would be a more appropriate gender neutral term, given that the precedent was set by the actively gynophobic society of herdsmen who spawned it.", 
   {}, 
   321252, 
   null, 
   1219597020.0
  ], 
  [
   321262, 
   null, 
   "Archangel", 
   "I sure can't comprend how you could possibly call such a god good or just or anything worthy of worship. You are saying, and correct me if I'm wrong, that our default state is \"damned\". How can that be called fair or just? It doesn't matter if he gives us a way out, that's irrelevant to the issue that he has every human being set up to burn right out of the gate. That's simply evil.\n \n \n His holy nature, as you define it, is evil. Anyone who damns you to an eternity of pain for no fault of your own is evil. The fact that you must guess at a path to avoid that fate only makes him more evil. The God you describe is a monster, there is no way such a being is the creator of the universe, and even if he is I want no part of him.\n\n \n I told you it was useless explaining it to you. You just don't get it.", 
   {}, 
   321252, 
   null, 
   1219601820.0
  ], 
  [
   321263, 
   null, 
   "Kronus", 
   "I told you it was useless explaining it to you. You just don't get it.\n\n \n Certianly not if you can't bring yourself to explain it. I laid out my views quite plainly, and you've decided to not even bother trying. Try to remember that next time you feel inclined to accuse me of never bothering to debate you. The reason I don't try is I know that this is one of the more likely ways in which you will respond.", 
   {}, 
   321262, 
   null, 
   1219603620.0
  ], 
  [
   321265, 
   null, 
   "Archangel", 
   "Certianly not if you can't bring yourself to explain it. I laid out my views quite plainly, and you've decided to not even bother trying. Try to remember that next time you feel inclined to accuse me of never bothering to debate you. The reason I don't try is I know that this is one of the more likely ways in which you will respond.\n\n \n But I did explain it to you in post 22 which was a response to your attack on christianity and Gods goodness in post 21. Here it is again for you: http://www.4forums.com/political/showpost.php?p=321251&postcount=22 . (Or you can just scroll up and read the exchange.) In your response to post 22 you have basically repeated your previous diatribe of hate against Him. So why should I repeat myself when it's obvious that it doesn't matter how many times I explain the sacrifice our God made to save us, you will respond like a 7 year old who doesn't agree with the decision his parent makes, so he pounds his hands and feet against the floor as he wishes him dead. \n \n That is what you are doing with God kronus. like a rebellious child you're striking out at Him because you don't understand Him, and refuse to try to. But nothing you believe or say will have any impact on the reality that it's His ultimate laws and principles that guide all that is in Time and Space. Beside that, I've been on this forum for a year and a half kronus, so exactly what I said above, I have said hundreds of times before. So as far as I'm concerned, I was showing great patience by repeating myself once again in post 22. Yet you think I should be eternally redundant just so you can continue to repeat your hate filled rejections of Him? My question to you is what's the point? How many times must we go around before I'm allowed to say, it's all been said already, without you accusing me of running away?", 
   {}, 
   321263, 
   null, 
   1219606800.0
  ], 
  [
   321270, 
   null, 
   "Kronus", 
   " But I did explain it to you in post 22 which was a response to your attack on christianity and Gods goodness in post 21. \n\n You make a post, I respond to it, you respond to that. That's called debate. You make a post and then refuse to respond to any critique of it? That's not debate, that's just you doing what you usually do.\n \n \n\n How many times must we go around before I'm allowed to say, it's all been said already, without you accusing me of running away? \n\n How about until you actually defend what you say, rather than just presenting it as truth with no real justification. You know, when you actually engage in debate?", 
   {}, 
   321265, 
   null, 
   1219609500.0
  ], 
  [
   321275, 
   null, 
   "marc9000", 
   "What sort of evil, unjust, horrible religion do you follow?! \n\n \n I'm a Luthuran, but all other protestant religions, and Catholics too as far as I know, go by the most basic of Bible verses;\n \n \"For ALL have sinned, and fall short of the glory of God.\" Not sure where it's at, but it's in there. The word \"all\" means just that. \n \n \n1 John 1:8 If we say we have no sin, we deceive ourselves, and the truth is not in us. \n\n \n \n Romans 3:10 As it is written; There is no one righteous, not even one. \n\n \n and a repeat of this one\n \n Ephesians 2:8 For it is by grace you have been saved through faith - and this not from yourselves, it is the gift of God - not by works, so that no one can boast. \n\n \n There are many others, it is a central theme of Christianity. People are all even in that regard, \"so that no one can boast\". \n \n \n What have you, for example, done to deserve an eternity of pain and suffering? I'm not asking how you can avoid it, I'm asking why you think you deserve it.\n\n \n Mainly, inherited a sinful nature from the first fully formed man, Adam. But Christ's teachings show sin in all of us. \n \n \n Matthew 5:21 You have heard it was said to the people long ago, 'Do not murder, and anyone who murders will be subject to judgement.' But I tell you that anyone who is angry with his brother will be subject to judgement. \n\n \n \n Matthew 5: 27 You have heard that it was said, 'Do not commit adultry.' But I tell you that anyone who looks at a woman lustfully has already committed adultry with her in his heart. \n\n \n I have taken unecessary extra glances at young ladies more than once, I have gotten potty mouth more than once after striking my finger with a hammer, etc. I deserve it plenty, even for things I've done that I'm not even aware of. Just because it's all not pleasant to me doesn't mean I close my eyes and ears to it. I'm quite thankful that I'm forgiven for it. \n \n Do you believe you're perfect? Can you name anyone you believe is perfect? \n \n Some atheists talk about how mean and vengeful the God of the old testament was. Well yeah, I'm thankful that I missed all that, that I wasn't alive back then. There really is a lot for a Christian to be thankful for.", 
   {}, 
   321245, 
   null, 
   1219612380.0
  ], 
  [
   321277, 
   null, 
   "Kronus", 
   "\n \"For ALL have sinned, and fall short of the glory of God.\" Not sure where it's at, but it's in there. The word \"all\" means just that.\n\n I didn't ask about sin per se. I asked what you had done to deserve an eternity of pain and suffering. Are you trully suggesting that any infraction warrants neverending torment? That, as you say, \"potty mouth\" legitimately earns you a place in hell forever? That strikes you as fair and just?\n \n \n\n Mainly, inherited a sinful nature from the first fully formed man, Adam. \n\n So you deserve to be punished for something that you never did? You're ok with that, you find that fair?\n \n \n\n Do you believe you're perfect? Can you name anyone you believe is perfect? \n \n\n Do you believe that perfection ought to be required to get into heaven? Does that really seem fair and just to you? God creates us imperfect, and then damns us for being what he made us to be? How can you call that ok?\n \n \n\n Some atheists talk about how mean and vengeful the God of the old testament was. Well yeah, I'm thankful that I missed all that, that I wasn't alive back then. There really is a lot for a Christian to be thankful for. \n\n The God you describe is no better than the one in the OT. What's an earthly smiting compared to unjust eternal damnation?", 
   {}, 
   321275, 
   null, 
   1219616460.0
  ], 
  [
   321283, 
   null, 
   "jyoshu", 
   "I didn't ask about sin per se. I asked what you had done to deserve an eternity of pain and suffering. Are you trully suggesting that any infraction warrants neverending torment? That, as you say, \"potty mouth\" legitimately earns you a place in hell forever? That strikes you as fair and just?\n \n So you deserve to be punished for something that you never did? You're ok with that, you find that fair?\n \n Do you believe that perfection ought to be required to get into heaven? Does that really seem fair and just to you? God creates us imperfect, and then damns us for being what he made us to be? How can you call that ok?\n\n \n If you hold to the idea that heaven would or should depend on some point of doing good versus bad (as opposed to any evil being enough, as you seem to be taking issue with), then at what point has someone done enough good to get to heaven? Or where is the dividing line to where someone does something bad enough to NOT get to go to heaven? Since you want to argue against the idea that the existence of evil is bad enough for someone to not get into heaven, then it seems only fair that you to explain where the line should be in your view.", 
   {}, 
   321277, 
   null, 
   1219621620.0
  ], 
  [
   321291, 
   null, 
   "Bassman", 
   "I'm a Luthuran, but all other protestant religions, and Catholics too as far as I know, go by the most basic of Bible verses;\n \n \"For ALL have sinned, and fall short of the glory of God.\" Not sure where it's at, but it's in there. The word \"all\" means just that. \nThat would be Romans 6:23\n \n \n \n \n \n \n \n \n \nThere are many others, it is a central theme of Christianity. People are all even in that regard, \"so that no one can boast\". \n \n \n \n Mainly, inherited a sinful nature from the first fully formed man, Adam. But Christ's teachings show sin in all of us. \n \n \n \n \n \n I have taken unecessary extra glances at young ladies more than once, I have gotten potty mouth more than once after striking my finger with a hammer, etc. I deserve it plenty, even for things I've done that I'm not even aware of. Just because it's all not pleasant to me doesn't mean I close my eyes and ears to it. I'm quite thankful that I'm forgiven for it. \n \n Do you believe you're perfect? Can you name anyone you believe is perfect? \n \n Some atheists talk about how mean and vengeful the God of the old testament was. Well yeah, I'm thankful that I missed all that, that I wasn't alive back then. There really is a lot for a Christian to be thankful for.\nWhat this means is that with all of the sins that we get specific about, they are all symptoms of the sin of unbelief. Rejecting G-d and His free gift of salvation through the blood of the cross! That's what will cost man's soul.", 
   {}, 
   321275, 
   null, 
   1219624020.0
  ], 
  [
   321295, 
   null, 
   "Archangel", 
   "You make a post, I respond to it, you respond to that. That's called debate. You make a post and then refuse to respond to any critique of it? That's not debate, that's just you doing what you usually do.\n \n \n How about until you actually defend what you say, rather than just presenting it as truth with no real justification. You know, when you actually engage in debate?\n\n \n You see kronus, I wasn't needed at all here. Between marc, jyoshu and Bassman, they clarified with verses and explanations, perfectly what I said above, here: http://www.4forums.com/political/showpost.php?p=321251&postcount=22", 
   {}, 
   321270, 
   null, 
   1219625220.0
  ], 
  [
   321299, 
   null, 
   "Kronus", 
   "\n Since you want to argue against the idea that the existence of evil is bad enough for someone to not get into heaven, then it seems only fair that you to explain where the line should be in your view. \n\n No Jyoshu, it doesn't. You're simply trying to shift the debate off of those trying to defend ( or trying not to defend :) ) their religious opinions. How about we see if we can get them to actually present some sort of argument, and then we can move on, ok?", 
   {}, 
   321283, 
   null, 
   1219626840.0
  ], 
  [
   321301, 
   null, 
   "Kronus", 
   "You see kronus, I wasn't needed at all here. Between marc, jyoshu and Bassman, they clarified with verses and explanations, perfectly what I said above, here: http://www.4forums.com/political/showpost.php?p=321251&postcount=22\n\n \n Wow, you really think so? Cause Jyoshu didn't support what you said at all, Marc said nothing new, and Bassman didn't expand on much of anything. If you call that perfect explanations, then, well, you aren't much of one for explaining things. emoticon_xgood\n \n Go ahead, shock me. Show that I'm all wrong about you and actually explain yourself, without resulting to insults, mockery, or the like. You'll forgive me if I don't hold my breath though.", 
   {}, 
   321295, 
   null, 
   1219627140.0
  ], 
  [
   321302, 
   null, 
   "Kronus", 
   "How about you bring an argument to the table, for once? As opposed to only ever pretty much trying to get others to put something out there for you to weigh in on.\n\n \n You must have missed it, but I did bring an argument to the table. Thus, the resulting debate. I said that such and such a view can't be right, and others weighed in, and off we went. You, apparently, don't like the direction the debate is going and so are trying to derail it. Do you have anything actually germane to contribute, or are you just here for a meta-debate, despite your protestations that you hate those so much?", 
   {}, 
   321299, 
   null, 
   1219627380.0
  ], 
  [
   321311, 
   null, 
   "marc9000", 
   "I didn't ask about sin per se. I asked what you had done to deserve an eternity of pain and suffering. Are you trully suggesting that any infraction warrants neverending torment? That, as you say, \"potty mouth\" legitimately earns you a place in hell forever? That strikes you as fair and just? \n\n \n It does, if God's standard is perfection (which it is) and if God is fair and just. (which he is)\n \n \n \nSo you deserve to be punished for something that you never did? You're ok with that, you find that fair? \n\n \n I don't really think of it in terms of being fair. It's the way it is. I don't declare something to be non existant just because I don't like it, or don't fully understand it. \n \n \nDo you believe that perfection ought to be required to get into heaven? Does that really seem fair and just to you? God creates us imperfect, and then damns us for being what he made us to be? How can you call that ok? \n\n \n He undamned us with the free gift of salvation. Anyone who wants it can have it - anyone. And this life is easier with it. \n \n \nThe God you describe is no better than the one in the OT. What's an earthly smiting compared to unjust eternal damnation?\n\n \n What all our opinions are of how \"just\" it is really isn't important. Christianity believes in only two possibilities after death; eternity with God, or eternal separation from God. Nothing in the middle. We're not even in the middle now, God loves everyone who is alive, and is constantly with us all. \"In him we live, move and have our being\". I shudder to think of what it must be like to be separated from him, and I wish it on no one.", 
   {}, 
   321277, 
   null, 
   1219629780.0
  ], 
  [
   321313, 
   null, 
   "Archangel", 
   "Wow, you really think so? Cause Jyoshu didn't support what you said at all, Marc said nothing new, and Bassman didn't expand on much of anything. If you call that perfect explanations, then, well, you aren't much of one for explaining things. emoticon_xgood\n \n Go ahead, shock me. Show that I'm all wrong about you and actually explain yourself, without resulting to insults, mockery, or the like. You'll forgive me if I don't hold my breath though.\n\n \n To anyone with half a brain, they perfectly supported my post. Marc even supplied the proper verses as Bassman did with Romans 6:23 which say's: 23) For the wages of sin is death, but the gift of God is eternal life in[a] Christ Jesus our Lord. to show that we are all sinners in need of salvation from a perfect and holy God, and that all we must do to receive salvation is to believe first, and then accept it. If this is beyond you to comprehend then there is nothing more to say to you as you require a special ed teacher to explain plain english to you. And if your problem isn't comprehension, then it is belief. So stop demanding further info because nothing more we say can make you believe what your heart refuses to accept as truth.", 
   {}, 
   321301, 
   null, 
   1219630500.0
  ], 
  [
   321315, 
   null, 
   "Kronus", 
   " It does, if God's standard is perfection (which it is) and if God is fair and just. (which he is) \n\n On what are you basing those conclusions? Everything you've said makes God out to be unjust and unfair, how can you say otherwise? What's that based on, given everything else you've said about him?\n \n \n\n I don't really think of it in terms of being fair. It's the way it is. \n\n That's fine for random events like storms or earthquakes. Doesn't cut it for thinking beings.\n \n \n\n I don't declare something to be non existant just because I don't like it, or don't fully understand it. \n\n Did I say anything about non-existance? No, I didn't. I simply think that your take on what God wants is wrong, I'm not making any assumptions here about if he's real or not. It's utterly possible that he exists, but you're dead wrong about what he wants, right?\n \n \n\n He undamned us with the free gift of salvation. Anyone who wants it can have it - anyone.\n\n Let me risk an analogy. I point a gun at your head, and I will pull the trigger, unless you say \"boo-bee-boo-bee-boop\". I'm even generous enough to tell you plainly and clearly what you need to do to save yourself (which God has not done). Would you say my actions are in any way the actions of a good, just, or kind being? Would any decent person threaten you in such a way, for no reason what so ever?\n \n \n\n We're not even in the middle now, God loves everyone who is alive, and is constantly with us all. \"In him we live, move and have our being\".\n\n There's a description of God that isn't in contradiction to reality. Not your judgemental God ready to cast us into the pit, but a God that's ready to accept us. All of us. No hoops to jump through, no knees to bend, no lip service to pay. A God that trully loves everyone wouldn't set up roadblocks preventing most of humanity from reaching him.", 
   {}, 
   321311, 
   null, 
   1219631340.0
  ], 
  [
   321316, 
   null, 
   "Kronus", 
   "To anyone with half a brain, they perfectly supported my post. \n\n \n Maybe, but I have a whole brain, and so didn't read their posts the way you did.", 
   {}, 
   321313, 
   null, 
   1219631400.0
  ], 
  [
   321317, 
   null, 
   "smiley", 
   "To anyone with half a brain, they perfectly supported my post. Marc even supplied the proper verses as Bassman did with Romans 6:23 which say's: 23) For the wages of sin is death, but the gift of God is eternal life in[a] Christ Jesus our Lord. to show that we are all sinners in need of salvation from a perfect and holy God, and that all we must do to receive salvation is to believe first, and then accept it. If this is beyond you to comprehend then there is nothing more to say to you as you require a special ed teacher to explain plain english to you. And if your problem isn't comprehension, then it is belief. So stop demanding further info because nothing more we say can make you believe what your heart refuses to accept as truth.\n\n Well that explains why you feel they perfectly supported your argument.\n \n But the question should not be why a \"good\" god would damn someone to an eternity of torture (because he/she/it simply would not), but why such a god is worthy of worship, or perhaps even if such a god exists (and is not just the creation of some power-hungry overlord stamping his authority on the uneducated masses).\n \n Certainly, if there is a \"good\" god out there, it would not be one that expects us to jump through petty hoops to earn its favour. If this god demands perfection, then perfection should be attainable (which it is not). If this god has just created the whole lot of us to \"see who does best\" (given that he already knows the results anyway), then the game just isn't worth playing and this god deserves nothing but contempt, rather than praise.\n \n Smiley", 
   {}, 
   321313, 
   null, 
   1219631520.0
  ], 
  [
   321336, 
   null, 
   "DrD", 
   "Deuteronomy 28:53 \n And thou shalt eat the fruit of thine own body, the flesh of thy sons and of thy daughters. \n \n Exodus 12:29-30 The LORD smote all the firstborn in the land of Egypt, from the firstborn of Pharaoh that sat on his throne unto the firstborn of the captive that was in the dungeon.... And there was a great cry in Egypt; for there was not a house where there was not one dead. \n \n Numbers 21:6 \n And the LORD sent fiery serpents among the people, and they bit the people; and much people of Israel died. \n \n 1 Samuel 15:2-3 \n Thus saith the LORD of hosts ... Now go and smite Amalek, and utterly destroy all that they have, and spare them not; but slay both man and woman, infant and suckling, ox and sheep, camel and XXX. \n \n Isaiah 49:26 \n And I will feed them that oppress thee with their own flesh; and they shall be drunken with their own blood, as with sweet wine. \n \n Ezekiel 8:18 \n Therefore will I also deal in fury: mine eye shall not spare, neither will I have pity: and though they cry in mine ears with a loud voice, yet will I not hear them. \n \n Malachi 2:3 \n Behold, I will corrupt your seed, and spread dung upon your faces. \n Well, this is some of what the bible says about god. . .\n \n My kind of god to worship!!!", 
   {}, 
   321317, 
   null, 
   1219638540.0
  ], 
  [
   321340, 
   null, 
   "Iuris", 
   "People, Archie, Marc & co have made their case perfectly clear.\n \n \"I'm God. I'm omnipotent and omniscient. You do as I say and LIKE it, or you burn in hell. Why? Because I said so.\" That's really all. Their belief is not inconsistent. It fully makes sense.\n \n The only problem is: why would you consider this God good? It all comes down to the argument of power.\n \n \n Tell me now, Archie&co. Were God to ask you: \"What shall I do with these people in Hell? You can make it all different.\" What would you answer? Would YOU, given the chance, show mercy? Would you be able to find at least that much good in your soul to ask for an ending?\n \n I wish I could think better of you, Archie&co, but I think you wouldn't ask that the sinners be freed, even after they have realized their error and paid a thousandfold for any suffering they had inflicted. I don't think you'd even be able to say: let them end.\n \n From what I've heard you say here, I'm sorry if I got you wrong, but I don't think you would. I don't think you would. I don't think you would do what Jesus did: SUFFER HIMSELF TO REDEEM THE SINNERS.", 
   {}, 
   321336, 
   null, 
   1219654440.0
  ], 
  [
   321350, 
   null, 
   "jyoshu", 
   "People, Archie, Marc & co have made their case perfectly clear.\n \n \"I'm God. I'm omnipotent and omniscient. You do as I say and LIKE it, or you burn in hell. Why? Because I said so.\" That's really all. Their belief is not inconsistent. It fully makes sense.\n \n The only problem is: why would you consider this God good? It all comes down to the argument of power.\n\n \n Interestingly, we were just discussing this at my church very recently. (Contrary to what seems to be popular belief, religious people are probably the ones who discuss and consider these issues as much or more than anybody! Do people really think this is something religious people haven't already long considered?)\n \n I think the problem is that when you start saying \"God\" (as in the highest being in existence which by definition would effectively define morality) is good or evil, you're holding God to some standard outside of himself. God (if that is to mean anything) has to be understood in terms of omniscience and omnipotence, and so just because God does something, it doesn't mean we're free to do it. In other words--yes--what is wrong for us may in fact not be wrong for God. It is God we're talking about, after all. The closest analogy I can think of at the moment (albeit an imperfect one) is parenting. If a child has a dog, and the parent takes the dog and has it euthanized, that doesn't mean it's ok for the kid to go out and start killing dogs. The parent had reasons the kid probably can't fully understand. (esp. if it's a young child.) If there's an entity such as GOD, what is right or wrong would depend significantly on what that God says is ok, but that doesn't mean that said God itself is bound by those rules. And yes, there are instances in Judeo/Christian history where God did give specific tasks to his chosen people that involved them being instruments of justice or divine action that wiped out other groups. Biblical scholars typically view these as very specific cases that were exceptions.\n \n The bottom line is that when you start holding God to a morality higher than God (meaning he would be beholden to it) it seems to me that at such point said God is no longer really God, so it's moot point if one is going to go that far. IOW, for it to really be God, he has to be transcendent of the rules of what we understand as good and evil. If you say \"your God is evil\", who's standard is that going by? Because if the entity is truly God with a capital \"G\", then he would already operate at whatever highest standard there is, by default. So to say \"God is good or God is evil\" is a non-sequitor to begin with. Anyone who would say that is already essentially reducing said entity to 'non-God' status simply on the basis of the statement.", 
   {}, 
   321340, 
   null, 
   1219678500.0
  ], 
  [
   321352, 
   null, 
   "Penfold", 
   "So don't eff God, 'cos he's ineffable. Riiiight.............", 
   {}, 
   321350, 
   null, 
   1219678860.0
  ], 
  [
   321353, 
   null, 
   "jyoshu", 
   "So don't eff God, 'cos he's ineffable. Riiiight.............\n\n \n If the concept of \"God\" is really going to mean \"God\" to begin with, then yeah. It seems to me that an understanding of the concept of God as a truly transcendent being is one thing that has to be a starting assumption here, even if one views its existence as hypothetical.", 
   {}, 
   321352, 
   null, 
   1219679400.0
  ], 
  [
   321363, 
   null, 
   "foundit66", 
   "... unconditional acceptance ...\n\n I'm sorry, but no.\n If there are \"conditions\" under which the Christian God will damn people to hell, to be tortured for all eternity, that is not \"unconditional acceptance\" emoticon_xdonno\n \n \n \nEvery human being that has ever lived has committed a crime worthy of hell. The idea is to accept the free gift of forgiveness for it. (the \"grace\" part, in Ephesians that I quoted above) It's not difficult.\n\n This is rather disturbing...\n Imagine a parent raising a kid with this mentality. It would be rightfully classified as psychological child abuse.\n But the precepts of the \"damned to hell for not believing\" mentality require such assumptions, even though they fly in the face of rationality.\n You'll find similar approaches in many cults.\n And to be clear (although I think it won't matter for those intent on misrepresenting me), I am not calling Christianity a \"cult\". I am saying this aspect of the religion is cultish.\n \n \n \nPlease do not point out spiritual or scientific improbabilities in my scenario.\n\n I think you realized the inevitable obfuscation and attempts to ignore this aspect of the Christian religion.\n There is nothing wrong with the \"improbabilities\" in the scenario.\n The problems arise in the people who don't want to examine their own faith on the issue. They are too proud to admit that their religion espouses a position that is difficult to hold the \"moral high ground\" on.\n Ergo, the inevitable obfuscation.\n \n \n \nIf you hold to the idea that ...\n\n I swear. It's so predictable it's almost funny...\n One could come to a conclusion that Jyoshu putting this phrase in his post means he REALIZES that what follows is not the argument being put forth... \n \n \n \nInterestingly, we were just discussing this at my church very recently. (Contrary to what seems to be popular belief, religious people are probably the ones who discuss and consider these issues as much or more than anybody! Do people really think this is something religious people haven't already long considered?)\n\n For some, I have no doubts that they have never \"considered\" it.\n There are some that it is a distinct surprise when they are informed that their Hebrew God endorsed slavery, misogyny, genocide, ...\n So for some who didn't know in the first place, I would say that's an obvious conclusion.\n \n As for the other, LOOK at the \"quality\" of discussion on this board.\n They THINK they are \"discussing\" and \"considering\" the issue, but they obviously are not.\n There are the inevitable \"God said it, so this is the way it's gotta be\" discussions.\n There are the inevitable attempts to reframe the issue into something else.\n There are the attacks on the original hypothetical, which I would label as refusing to \"discuss\", but some probably think it is \"discussing\" it.\n \n I think that it is rare for the honest self-reflection in the \"discussion\", free of the usual obfuscation we see.\n This thread is evidence of my point...\n \n \n \nGod (if that is to mean anything) has to be understood in terms of omniscience and omnipotence, and so just because God does something, it doesn't mean we're free to do it.\n\n This, in and of itself, is a double-standard.\n You hold YOURSELF to one standard, that you refuse to hold God to.\n In fact, isn't it more the truth that you refuse to hold God to ANY standard?\n Is there ANYTHING your God could do that would warrant criticism from you?\n \n \n \nThe closest analogy I can think of at the moment (albeit an imperfect one) is parenting. If a child has a dog, and the parent takes the dog and has it euthanized, that doesn't mean it's ok for the kid to go out and start killing dogs.\n\n The argument presumes that justifying the act in ONE specific instance somehow equates to automatic allowance of the act in ANY instance.\n Which is completely different from the case at hand.\n \n We're talking about God damning people to hell in ONE SPECIFIC INSTANCE. A \"good\" person who doesn't believe in God.\n Where's the analogy?\n Do you think the argument is to try and say that Christians can/should/will damn people to hell for any reason?\n Or is this another attempt to change the subject?\n \n We're not kids.\n We see EXACTLY WHY the parent is damning the person to hell. For unbelief.\n The MOTIVATION is the question here.\n \n \n \nIf there's an entity such as GOD, what is right or wrong would depend significantly on what that God says is ok, but that doesn't mean that said God itself is bound by those rules. And yes, there are instances in Judeo/Christian history where God did give specific tasks to his chosen people that involved them being instruments of justice or divine action that wiped out other groups. Biblical scholars typically view these as very specific cases that were exceptions.\n\n How can you claim this is a \"discussion\"???\n All you have REALLY done is sat back, declared \"we're all ignorant of the situation, God knows more than us, therefore we presume that God is doing the right thing\", and leave it at that.\n That isn't a \"discussion\".\n All you've done is provide a \"cover story\"...\n \n You've just created an excuse to NOT discuss it, and then you show that it's not the first time you've established this route.\n In YOUR Bible, it declares that man ate of the fruit from the tree of the knowledge of good and evil.\n \n But then you want to turn around and insist that \"we don't know\" about \"good and evil\" when it comes to God?\n I think a more objective approach would question whether or not God devised this approach (damning dissidents to hell), cause he KNEW that creatures that TRULY USED the knowledge of good and evil would not accept him as he was.\n \n If God were ruling a foreign country, the U.S. would have invaded him by now.", 
   {}, 
   321226, 
   null, 
   1219685640.0
  ], 
  [
   321367, 
   null, 
   "Jo Bennett", 
   "If God were ruling a foreign country, the U.S. would have invaded him by now.\n\n \n I doubt it. The US doesn't generally attack anywhere that might have sufficient power to do it harm. Plus I don't think God has a particularly large oil reserve.", 
   {}, 
   321363, 
   null, 
   1219686600.0
  ], 
  [
   321395, 
   null, 
   "Penfold", 
   "He has plenty oleaginous support.....;)", 
   {}, 
   321367, 
   null, 
   1219701660.0
  ], 
  [
   321402, 
   null, 
   "GazzaElliott", 
   "Jyoshu\n \n All you've done above is justify the scenario, you haven't analysed it in the least. Analysis would be done on evidence without a need to create special conditions...", 
   {}, 
   321395, 
   null, 
   1219703520.0
  ], 
  [
   321405, 
   null, 
   "jyoshu", 
   "All you've done above is justify the scenario, you haven't analysed it in the least. Analysis would be done on evidence without a need to create special conditions...\n\n \n Translation: the only option being left to people is complete non-belief in God", 
   {}, 
   321402, 
   null, 
   1219704720.0
  ], 
  [
   321409, 
   null, 
   "Kronus", 
   "Translation: the only option being left to people is complete non-belief in God\n\n \n Nope, not in the least. Especially not in the light of this discussion. My argument has been, simply, that any being which can be called good, fair, and just in any way which is meaningful to humans wouldn't have man's default state be damned. There's really no reason to look at that and leap to the conclusion \"there's no God\". It would take a much smaller leap to get to, \"man's default state is not damned\".\n \n It's interesting that you're the second religious person in this discussion to think that the non-existence of God was the root of this argument. I thought I was making it pretty clear that it was the disposition of people's souls that was being discussed.", 
   {}, 
   321405, 
   null, 
   1219705620.0
  ], 
  [
   321416, 
   null, 
   "Archangel", 
   "People, Archie, Marc & co have made their case perfectly clear.\n \n \"I'm God. I'm omnipotent and omniscient. You do as I say and LIKE it, or you burn in hell. Why? Because I said so.\" That's really all. Their belief is not inconsistent. It fully makes sense.\n\n \n You couldn't be more wrong in your opinion of Gods love for you Iuris. But how many times must it be stated before that fact will sink in. I fear it never will.\n \n \nThe only problem is: why would you consider this God good? It all comes down to the argument of power.\n\n \n You will most definitely find out someday.\n \n \nTell me now, Archie&co. Were God to ask you: \"What shall I do with these people in Hell? You can make it all different.\" What would you answer? Would YOU, given the chance, show mercy? Would you be able to find at least that much good in your soul to ask for an ending?\n\n \n Do you mean like offering universal salvation to everyone, because from hells perspective they will all be open to Gods love then? If God allowed a vote in heaven, I would definitely vote for universal salvation. Do you actually think that believer like me feel special, worthy or deserving of heaven? That just shows how little you understand the the grace and mercy of Gods Holy Spirit which indwells us.\n \n \nI wish I could think better of you, Archie&co, but I think you wouldn't ask that the sinners be freed, even after they have realized their error and paid a thousandfold for any suffering they had inflicted. I don't think you'd even be able to say: let them end.\n \n From what I've heard you say here, I'm sorry if I got you wrong, but I don't think you would. I don't think you would. I don't think you would do what Jesus did: SUFFER HIMSELF TO REDEEM THE SINNERS.\n\n \n Well I forgive your bitter heart and ignorance Iuris. Would you like to discuss how good and fulfilling it would make you feel if you had the power to condemn me to hell? That is evidence of your dire need of the love that comes only from knowing the living God.", 
   {}, 
   321340, 
   null, 
   1219709220.0
  ], 
  [
   321420, 
   null, 
   "foundit66", 
   "Translation: the only option being left to people is complete non-belief in God\n\n \n Response translation: I refuse to acknowledge that GazzaElliott is accurate in his assessment of my \"discussion\", therefore I throw out a bizarre counter assessment...\n < end translation <\n \n Quite frankly, this \"translation\" reveals more about the original argument than it does the criticism.\n Obviously, there are multiple \"options\" to not accepting Jyoshu's assessment.\n \n For examples, God may not be the \"good\" God some people try to make him out to be.\n Evidently he created \"man\" in his \"image\", and then man failed to keep a rule that an omniscient god should have known would have been broken anyways.\n Maybe man is \"flawed\" because the original \"image\" is flawed. Throughout the bible, God demonstrates himself capable of unspeakable acts of barbarism. \n Doesn't one Old Testament passage have God himself admitting he is a \"jealous God\"?\n \n Maybe God just want sycophants in his kingdom, cause that's the kind of God he is ...", 
   {}, 
   321405, 
   null, 
   1219711260.0
  ], 
  [
   321421, 
   null, 
   "Kronus", 
   " \n Do you actually think that believer like me feel special, worthy or deserving of heaven? \n\n \n In a word, yes. I think a BIG part of the reason people like you subscribe to the religious views you do is that it makes you feel special, better than the rest. You've gotten into God's good books, most people haven't, gee doesn't that make you the spiffy one! It's the most plausible reason why you would worship a being which can only be desribed as unfair and unjust, while steadfastly insisting that he's fair and just.", 
   {}, 
   321416, 
   null, 
   1219711560.0
  ], 
  [
   321424, 
   null, 
   "Archangel", 
   "In a word, yes. I think a BIG part of the reason people like you subscribe to the religious views you do is that it makes you feel special, better than the rest. You've gotten into God's good books, most people haven't, gee doesn't that make you the spiffy one! It's the most plausible reason why you would worship a being which can only be desribed as unfair and unjust, while steadfastly insisting that he's fair and just.\n\n \n Then you would be wrong. It is you who doesn't see the need to humble yourself before God and admit your a sinner in need of redemption, not me as I have done that in my life. It is by grace that I have been saved and not by works so that no man may boast. Nothing a believer can ever do can make us good enough to actually deserve to go to heaven. It is a gift that I don't deserve but have received based on my Gods goodness and mercy, and not on my own merits. But I have done something by an act of my will that you haven't done kronus, and that is I received the free gift God has offered. Nothing more than saying thank you Lord, I acknowledge what you did for me on the Cross and I submit my will to yours is necessary. So in effect I have had to vocally admit how unspecial I am as a fallen sinner, before I could be saved. So tell me, how does that make me special? All it does is make me worthy because of what Jesus did for me. Not because of anything I did for Him. That is what Grace and Mercy means kronus.", 
   {}, 
   321421, 
   null, 
   1219713180.0
  ], 
  [
   321430, 
   null, 
   "jyoshu", 
   "Nope, not in the least. Especially not in the light of this discussion. My argument has been, simply ....\n \n ....... I thought I was making it pretty clear that it was the disposition of people's souls that was being discussed.\n\n \n Goodness, I wasn't even responding to you. Did you not not read the quote attribution? \n \n You must have a guilty conscience. emoticon_xangel", 
   {}, 
   321409, 
   null, 
   1219716300.0
  ], 
  [
   321431, 
   null, 
   "foundit66", 
   "Goodness, I wasn't even responding to you. Did you not not read the quote attribution? \n You must have a guilty conscience. emoticon_xangel\n\n \n You may not have been responding specifically to something we specifically POSTED...\n \n But the statement you did respond to (authored by GazzaElliott) was something I think both Kronus and I have stated, or we recognize the truth in.\n \n Why do you think there is a \"guilty conscience\" in agreeing with another poster or in defending him from your obfuscation? emoticon_wow\n \n You try to hard to misrepresent the statements of others to the point that at times, it's downright irredeemably nonsensical. emoticon_rolleyes", 
   {}, 
   321430, 
   null, 
   1219717800.0
  ], 
  [
   321432, 
   null, 
   "Kronus", 
   " Goodness, I wasn't even responding to you. Did you not not read the quote attribution? \n\n Wrong is wrong. If you don't want people to comment on what you say, use the private message function.\n \n \n\n You must have a guilty conscience. emoticon_xangel \n\n <sarcasm< Yeah, sure, that must be it.</sarcasm<\n I trust you'll stop telling me how awful it is to only hop in to give jabs now, since that seems to be what you're here for. Hypocricy is one of your bug-a-boos after all.", 
   {}, 
   321430, 
   null, 
   1219720620.0
  ], 
  [
   321433, 
   null, 
   "Kronus", 
   "Then you would be wrong. \n\n Just like God, I can only decide about you with the evidence I have available. Everything about the way you act says I'm right; your protestation ring as hollow as a really, really hollow thing. (I never claimed to be a master of metaphor :) ) You never miss a chance to tell everyone that you're going to heaven and they aren't. Sounds like someone boasting about their exclusive country club to me. There's certainly no humility in the way you present yourself.", 
   {}, 
   321424, 
   null, 
   1219720860.0
  ], 
  [
   321435, 
   null, 
   "GazzaElliott", 
   "Translation: the only option being left to people is complete non-belief in God\n\n \n No, you've come at the question saying: \"God is just and fair, how does the text support this?\" This is an exercise in justification or rationalization. The analytical question is \"On the basis of the data in the bible, can this God be judged fair and just?\". Do you get the difference? You can believe that God exists but not worship him. You can believe he exists and that he is not just and fair. Are you implying that if you don't contort yourself in mental knots you can't believe in God?", 
   {}, 
   321405, 
   null, 
   1219721280.0
  ], 
  [
   321438, 
   null, 
   "Archangel", 
   "Just like God, I can only decide about you with the evidence I have available. Everything about the way you act says I'm right; your protestation ring as hollow as a really, really hollow thing. (I never claimed to be a master of metaphor :) ) You never miss a chance to tell everyone that you're going to heaven and they aren't. Sounds like someone boasting about their exclusive country club to me. There's certainly no humility in the way you present yourself.\n\n \n Really? I NEVER MISS THE CHANCE TO TELL EVERYONE THAT I'M GOING TO HEAVEN? I challenge you to quote me ever bragging that I'm going to heaven and you're not. What I have done is promised you mockers and scoffers that the day will come when you will learn the truth about how wrong you are to reject the living God. But never have I boasted that I am going to heaven while you're not. And never has my motivation for promising you that you will ultimately learn the truth been to make such a point. So quote my posts kronus. prove me wrong and defend your lying claim. And I want links to posts in context to the debate and point being made at the time.", 
   {}, 
   321433, 
   null, 
   1219725240.0
  ], 
  [
   321440, 
   null, 
   "T.Q", 
   "You heard him Kronus. Archie wants a list of almost every single post he's ever made, with links. Get to it!", 
   {}, 
   321438, 
   null, 
   1219728120.0
  ], 
  [
   321441, 
   null, 
   "Archangel", 
   "You heard him Kronus. Archie wants a list of almost every single post he's ever made, with links. Get to it!\n\n \n If it's that many posts, it oughta be easy to prove then. I can't wait for the evidence. And if there are so many posts, why didn't you help your buddy out? Just remember what his claim is. He said, quote: You never miss a chance to tell everyone that you're going to heaven.", 
   {}, 
   321440, 
   null, 
   1219730160.0
  ], 
  [
   321442, 
   null, 
   "T.Q", 
   "If it's that many posts, it oughta be easy to prove then.\n\n It is, and it is.\n \n \nI can't wait for the evidence.\n\n Funny, I'm still waiting for the evidence that I'm a pathological liar. How's that coming along?\n \n \nAnd if there are so many posts, why didn't you help your buddy out?\n\n Every other time someone posts in response to you when you address someone else, you jump all over them for butting in, derailing the thread, betraying the weakness of the poster you addressed, etc. Now you want me to answer a challenge issued directly to Kronus? What are you, schizo?\n \n \nJust remember what his claim is. He said, quote: You never miss a chance to tell everyone that you're going to heaven.\n\n I'm well aware of what his claim is. I'm also well aware that you do it on an almost daily basis. I'm even more well aware that no matter how much damning evidence is presented to you, you'll just start flaming away and call us all a bunch of names, accuse us of dishonesty, and storm away.", 
   {}, 
   321441, 
   null, 
   1219739340.0
  ], 
  [
   321446, 
   null, 
   "Kronus", 
   "Really? I NEVER MISS THE CHANCE TO TELL EVERYONE THAT I'M GOING TO HEAVEN? I challenge you to quote me ever bragging that I'm going to heaven and you're not. What I have done is promised you mockers and scoffers that the day will come when you will learn the truth about how wrong you are to reject the living God.\n\n I don't need to provide a link, you did it RIGHT THERE! Yes, you didn't use the phrase \"I'm going to heaven and you're not, nyah-nyah!\", but your intent is more than clear. You know God's truth, everyone else is an idiot, you'll get your reward and they'll get what's coming to them. Plain as day.\n \n Edit: And T.Q. is right, you pull this one out on many (most?) exchanges. I trust you at least realized that?", 
   {}, 
   321438, 
   null, 
   1219758960.0
  ], 
  [
   321449, 
   null, 
   "jyoshu", 
   "Wrong is wrong. If you don't want people to comment on what you say, use the private message function.I trust you'll stop telling me how awful it is to only hop in to give jabs now, since that seems to be what you're here for. Hypocricy is one of your bug-a-boos after all.\n\n \n Kronos I don't care if you comment or not. You responded in a way that implied I was directing the reponse at a post of yours. I wasn't, and directing it at a specific post Gazaelliot made. I don't get the same impression from your posts here, and if I was wrong about GAZA, he can tell me. There's no need to start in with the ad hominems.", 
   {}, 
   321432, 
   null, 
   1219763220.0
  ], 
  [
   321450, 
   null, 
   "jyoshu", 
   "No, you've come at the question saying: \"God is just and fair, how does the text support this?\" This is an exercise in justification or rationalization. The analytical question is \"On the basis of the data in the bible, can this God be judged fair and just?\".\n\n \n And my point was that by even asking that question, you're holding God to some higher standard (of justice and fairness) that you've ascribed to yourself, than God himself. In which case, he's not really God at all, so it's a moot point. You're not starting at the same initial assumptions.\n \n There's no mental knots to that, by the way (Something you alluded to). It's quite simple really.", 
   {}, 
   321435, 
   null, 
   1219763400.0
  ], 
  [
   321451, 
   null, 
   "Iuris", 
   "If God allowed a vote in heaven, I would definitely vote for universal salvation. Do you actually think that believer like me feel special, worthy or deserving of heaven?\n\n Archie, I'd be happy to believe you were indeed different from what your posting style indicates. I really would. \n \n Unfortunately, your posting style does not suggest that type of person. Your posts rather indicate a man that would, upon reawakening in heaven and looking down at the flames of hell, not cry, but feel a silent feeling of vindication. \n \n I may estimate you wrong, and if I do, I do apologize. But you could ask for a vote on this forum and ask people whether, based upon your posts alone, they feel that you would.\n \n Maybe you could look back at your posts and see where you have gone wrong that people would misunderstand you so?\n \n \nWell I forgive your bitter heart and ignorance Iuris. Would you like to discuss how good and fulfilling it would make you feel if you had the power to condemn me to hell? That is evidence of your dire need of the love that comes only from knowing the living God.\n\n \n I certainly wouldn't, Archie. I want not suffering to you or anyone else. Noone deserves hell, not for eternity. Noone has had an infinity of evil to warrant an infinity of hell. I am, as a matter of fact, a firm believer in redemption - evn lacking the supernatural. It shows, when you find me surprisingly idealistic on certain criminological and penological topics.\n \n Of course, I would instantly condemn you to modern science study, until you got it right :) . You could use it, to come up with better arguments.\n \n You see, Archie, I'd love a nice and loving God. But that would not be a god that casts sinners into flames. That would be a god that would need no hell. The god would just ask: you really believed in evolution and look you in the eye until both of you started to laugh at the silliness of it. He would look upon a sinner (including me), and that sinner would see what he had really done , and fall to his knees wracked with regret, asking for penance that his guilt be burned away, because they would be unable to live with themselves.\n \n The problem is, that God would not order slaughter of innocents by his followers. A scientist believing wholly in his work on evolution would have nothing to fear from Him. Much less than an overzealous preacher who kept his \n \n But is that your god, Archie? Is it really? Because that god does not fit in with much of the old testament.", 
   {}, 
   321446, 
   null, 
   1219765020.0
  ], 
  [
   321452, 
   null, 
   "Iuris", 
   "And my point was that by even asking that question, you're holding God to some higher standard (of justice and fairness) that you've ascribed to yourself, than God himself. In which case, he's not really God at all, so it's a moot point. You're not starting at the same initial assumptions.\n\n \n So what you're saying is that god cannot be limited in any way, meaning god cannot be limited even to being good? But from that would follow that the omnipotent and omniscient god wouldn't be good at all!", 
   {}, 
   321451, 
   null, 
   1219765200.0
  ], 
  [
   321453, 
   null, 
   "Archangel", 
   "Funny, I'm still waiting for the evidence that I'm a pathological liar. How's that coming along?\n\n \nI don't need to provide a link, you did it RIGHT THERE! Yes, you didn't use the phrase \"I'm going to heaven and you're not, nyah-nyah!\", but your intent is more than clear. You know God's truth, everyone else is an idiot, you'll get your reward and they'll get what's coming to them. Plain as day.\n\n \n I did? Where? You made the accusation that I \"NEVER\" MISS THE CHANCE TO TELL EVERYONE THAT I'M GOING TO HEAVEN? That means that you can produce posts galore of me doing it in context to the intent you assert. And your buddy tq, piped in and supported your claim saying, and I quote: T.Q[said] You heard him Kronus. Archie wants a list of almost every single post he's ever made, with links. Get to it! Then prove it and post me saying that in a boastful way as if I'm good enough and your not. GO ON KRONUS/TQ BACK UP YOUR ACCUSATION!!!\n \n So, are you now saying that with a list of more than 5000 posts to choose from and with me BRAGGING HOW I'M GOING TO HEAVEN IN MOST ALL OF THEM AS BOTH YOU AND TQ CLAIM, NEITHER OF YOU GUYS CAN PRODUCE EVEN 5 POSTS TO PROVE YOUR ASSERTION? How about if tq accepts this exchange as my SOLID evidence that he's a pathological liar if he sees fit to make this accusation against me without even trying to support it. Of course I understand completely why neither of you has supported your libelous accusation, and that is because I NEVER BRAGGED OR BOASTED THAT I'M GOING TO HEAVEN AND YOUR NOT. OR THAT I, IN ANYWAY IMPLY THAT I'M SPECIAL OR WORTHY OF IT WHILE ANYONE ELSE IS NOT. I CONSTANTLY SAY HOW CHRIST DIED FOR ALL OF US EQUALLY, HOMOSEXUALS INCLUDED, AND ALL ANY OF US MUST DO TO RECEIVE HIS FREE GIFT IS TO ACCEPT IT THROUGH ACCEPTING HIM. So yet again, in typical form you pull a kronus and tq lies in order to support you. You guys are a real matched pair. emoticon_xgood", 
   {}, 
   321446, 
   null, 
   1219765200.0
  ], 
  [
   321454, 
   null, 
   "jyoshu", 
   "So what you're saying is that god cannot be limited in any way, meaning god cannot be limited even to being good? But from that would follow that the omnipotent and omniscient god wouldn't be good at all!\n\n \n I assume you mean by your standard of what is good or bad. If it's truly God, then there is no other standard to hold him to. If he has limits, how can he really be considered GOD? (Maybe its a demigod instead. :) ) It seems to me that God (if that's what it really is) would be the one who sets the rules for morality. It wouldn't be able to exist over and above God (with a capital \"G\").", 
   {}, 
   321452, 
   null, 
   1219766040.0
  ], 
  [
   321455, 
   null, 
   "Kronus", 
   "You can always tell when you've scored a hit on Archie. He starts going nutso with the bold, caps, colors, and font sizes. :)", 
   {}, 
   321453, 
   null, 
   1219766040.0
  ], 
  [
   321457, 
   null, 
   "Iuris", 
   "If he has limits, how can he really be considered GOD? (Maybe its a demigod instead. ) It seems to me that God (if that's what it really is) would be the one who sets the rules for morality. It wouldn't be able to exist over and above God (with a capital \"G\").\n\n \n And what, apart from argument of power, makes that god good?\n \n Don't worry, I get what you are saying. The problem is, that from this, only two arguments follow: the argument of power (I'm the strongest, so you obey) and argument of creation (I made you, so out of obligation/gratitude, you have to obey). A Tyrant god, in other words. A god against whom you search for loopholes in the rules.", 
   {}, 
   321455, 
   null, 
   1219768920.0
  ], 
  [
   321460, 
   null, 
   "Kronus", 
   "And my point was that by even asking that question, you're holding God to some higher standard (of justice and fairness) that you've ascribed to yourself, than God himself. \n\n \n It's not holding God to a higher standard, it's holding God to the only standard we have access to. The human standard. If we're not to be blind robots serving mindlessly then we have to judge, as best we can, what sort of being God is. Or, as I've been trying to emphasize, whether the dogma some people subscribe to is consistent with the image of God they're presenting.", 
   {}, 
   321450, 
   null, 
   1219769100.0
  ], 
  [
   321461, 
   null, 
   "T.Q", 
   "You can always tell when you've scored a hit on Archie. He starts going nutso with the bold, caps, colors, and font sizes. :)\n\n \n Yep. And look at those goalposts flying across the field:\n \n challenge you to quote me ever bragging that I'm going to heaven and you're not. \n\n \n \nNEITHER OF YOU GUYS CAN PRODUCE EVEN 5 POSTS TO PROVE YOUR ASSERTION?\n\n \n So we go from showing where he ever did this to showing where he did it five times. And if five examples are provided? Well, show me ten! And if ten are provided, he'll want at least half of his post count (roughly 2500). Why? The point has been made, the challenge he himself laid out has been met.\n \n Still waiting for the proof I'm lying Archie. Want to head on back to that other thread and show where I lied?", 
   {}, 
   321455, 
   null, 
   1219769100.0
  ], 
  [
   321462, 
   null, 
   "jyoshu", 
   "Don't worry, I get what you are saying. The problem is, that from this, only two arguments follow: the argument of power (I'm the strongest, so you obey) and argument of creation (I made you, so out of obligation/gratitude, you have to obey). A Tyrant god, in other words. A god against whom you search for loopholes in the rules.\n\n \n Well that's true--if he's truly God with a capital \"G\" then he has absolute power. And I think every monotheistic religion out there probably has an expectation of obedience to God.", 
   {}, 
   321457, 
   null, 
   1219769280.0
  ], 
  [
   321470, 
   null, 
   "foundit66", 
   "I assume you mean by your standard of what is good or bad. If it's truly God, then there is no other standard to hold him to. If he has limits, how can he really be considered GOD? (Maybe its a demigod instead. :) ) It seems to me that God (if that's what it really is) would be the one who sets the rules for morality. It wouldn't be able to exist over and above God (with a capital \"G\").\n\n \n While God may \"set the rules for morality\", does that man should be oblivious to them? A drone to only wait to be told by the \"God\" figure whether an action is good or evil?\n \n God said that man ate from the tree of the knowledge of good and evil.\n That's from YOUR bible.\n Man HAS that knowledge.\n Yet here you are bending over backwards to find excuses to ignore your God's plans and actions which are clearly evil.\n \n And it's not a \"discussion\" at all. You just create a scenario whereby you can apologetically proclaim \"we don't know\", and then you essentially leave it at that.\n There is no room for \"discussion\" there.\n You've already shown that for some odd reason, you think that disagreeing with your \"analysis\" somehow means that God doesn't exist, so that's a pretty limited \"discussion\" range.\n \n \n \n It wouldn't be able to exist over and above God (with a capital \"G\").\n\n Why the heck not?\n Where does this line of thinking come from?\n Suppose we have an all powerful God who created the universe.\n And oh yeah. He has negative traits as well as good ones.\n Sometimes he gets cranky and impatient. He admits he is a \"jealous\" God.\n \n Does that mean that God isn't \"all powerful\"? Nope.\n Could that god also be omniscient and still not be perfectly good? Yup!\n \n The fact that God does some pretty nasty stuff doesn't preclude him from being capable of being a God.\n The truth is that it reduces the believability of your story that he is a \"good\" god, always \"loving\" and only doing the \"right thing\".\n But that's it.\n That's all.\n \n He could still obviously be the \"god\"...\n All we're doing is talking about how to DESCRIBE him, and you seem to think (without being able to really question it otherwise the \"existence\" of \"god\" supposedly self-destructs) that he HAS to be only \"good\", when the truth is that is YOUR requirement based on your beliefs.\n Not a real requirement that precludes his existence if not true.", 
   {}, 
   321454, 
   null, 
   1219770840.0
  ], 
  [
   321476, 
   null, 
   "Archangel", 
   "You can always tell when you've scored a hit on Archie. He starts going nutso with the bold, caps, colors, and font sizes. :)\n\n \n And yet you quote no posts of mine that say what you claim I said. How telling. And I use bold, caps, colors and font size in order to accentuate my points just as they are intended to be used for. But of course you would focus on that in order to deflect from your lie about the claim you accuse me of that you can't support with evidence that you're telling the truth. Here's my demand again based on your false accusation. http://www.4forums.com/political/showpost.php?p=321453&postcount=71 NOW PUT UP OR SHUT UP!\n \n \nSo we go from showing where he ever did this to showing where he did it five times. And if five examples are provided? Well, show me ten! And if ten are provided, he'll want at least half of his post count (roughly 2500). Why? The point has been made, the challenge he himself laid out has been met.\n\n \n Hey! tq, you said this: QUOTE tq: You heard him Kronus. Archie wants a list of almost every single post he's ever made, with links. Get to it!\n \n So if I in fact made the statement you accuse of in most every single post I have ever written, it should be easy for you to produce a lousy 5 out of more than 5000 posts. \n \n \nStill waiting for the proof I'm lying Archie. Want to head on back to that other thread and show where I lied?\n\n \n I have shown it, right here again. You insist on defending your lie that I \"NEVER\" MISS THE CHANCE TO TELL EVERYONE THAT I'M GOING TO HEAVEN while obfuscating now by not posting even one example of me ever doing it. That's as clear a lie as need be presented for the sake of this request because everyone can follow this discussion and clearly see how you are supporting kronuses hypocrisy and lie about something I have never done in 5000 posts. Because everyone knows that if I had, you guys would produce the post. So I don't have to produce anymore evidence that you're a liar tq, because you have produced it yourself by supporting a false claim against me that neither of you can prove because, IT IS A LIE!!!", 
   {}, 
   321455, 
   null, 
   1219772580.0
  ], 
  [
   321481, 
   null, 
   "T.Q", 
   "And yet you quote no posts of mine that say what you claim I said. How telling. And I use bold, caps, colors and font size in order to accentuate my points just as they are intended to be used for. But of course you would focus on that in order to deflect from your lie about the claim you accuse me of that you can't support with evidence that you're telling the truth. Here's my demand again based on your false accusation. http://www.4forums.com/political/showpost.php?p=321453&postcount=71 NOW PUT UP OR SHUT UP!\n\n Seriously, are you delusional? It was already done. That's when you asked for more examples of you doing it. Really, it was about 5 posts back...\n And once again you call me a liar. Do you ever get tired of looking like a complete git?\n \n \nHey! tq, you said this: QUOTE tq: You heard him Kronus. Archie wants a list of almost every single post he's ever made, with links. Get to it!\n\n Hey! Archie, I know. I wrote it, remember?\n \n \nSo if I in fact made the statement you accuse of in most every single post I have ever written, it should be easy for you to produce a lousy 5 out of more than 5000 posts. \n\n You do in fact profess the sentiment Kronus accused you of in many, many posts. You asked for an example, one was provided. You asked for five, you were told to take a flying leap. How is this hard to understand?\n \n \n \n \nI have shown it, right here again. You insist on defending your lie that I \"NEVER\" MISS THE CHANCE TO TELL EVERYONE THAT I'M GOING TO HEAVEN\n\n I said that? For someone who calls me a liar all the time, I think you're working on lie #4 in this post alone.\n \n \nwhile obfuscating now by not posting even one example of me ever doing it.\n\n Does this count as a new lie, or just a repeat of the first lie in the post? Hmm...\n \n \nThat's as clear a lie as need be presented for the sake of this request because everyone can follow this discussion and clearly see how you are supporting kronuses hypocrisy and lie about something I have never done in 5000 posts.\n\n Yes, please. Everyone, read this discussion where my dishonesty is laid bare by Archie's incising intellect.\n \n \nBecause everyone knows that if I had, you guys would produce the post.\n\n Which Kronus did (Should this count as a new lie, or a variation on the same? I think I'll let this one slide. I'm starting to lose count of Archie's lies in this post).\n \n \nSo I don't have to produce anymore evidence that you're a liar tq,\n\n In order to not have to produce anymore evidence, you would first have to produce some evidence, which you have never done. Ever.\n \n \nbecause you have produced it yourself by supporting a false claim against me that neither of you can prove because, IT IS A LIE!!!\n\n Yep, we can't prove it, which is why a quote was provided only a few posts ago...\n \n Anyone feel like counting up Archie's lies in this post? It has to be lying, because if it was this much cognitive dissonance, I can't see him being able to function well enough to turn on a computer, let alone type a post.", 
   {}, 
   321476, 
   null, 
   1219774260.0
  ], 
  [
   321483, 
   null, 
   "Kronus", 
   "And yet you quote no posts of mine that say what you claim I said.\n\n \n Of course I did. I bolded it from the very post where you said you never do it. Having ignored me when I did that, do you really expect me to go to the effort of producing more evidence for you to ignore?\n \n Anyway, you've clearly shifted into full on rant mode here, so don't expect me to waste much more time on this. You've proven my point for me quite well, there's not alot more I can say about you that you haven't shown everyone for yourself.", 
   {}, 
   321476, 
   null, 
   1219776180.0
  ], 
  [
   321492, 
   null, 
   "Archangel", 
   "Of course I did. I bolded it from the very post where you said you never do it. Having ignored me when I did that, do you really expect me to go to the effort of producing more evidence for you to ignore?\n \n Anyway, you've clearly shifted into full on rant mode here, so don't expect me to waste much more time on this. You've proven my point for me quite well, there's not alot more I can say about you that you haven't shown everyone for yourself.\n\n \n \nSeriously, are you delusional? It was already done. That's when you asked for more examples of you doing it. Really, it was about 5 posts back...\n And once again you call me a liar. Do you ever get tired of looking like a complete git?\n \n\n \n AND YOU'RE BOTH BLATANT LIARS AND HYPOCRITES. Quote my post about 5 posts back where I was declaring that I'm going to heaven and you're not, as a statement of pride or boasting as you accused me of doing originally, in most every post I have ever written here! Go on, quote that post in this thread where I was doing that! \n \n You are both so dishonest that you will attempt to twist anything I say in order to avoid having to admit that after more than 5000 posts here, none do as you claimed I do in most every post. You are both pathetic liars who can't support your claims at all. So show where I proved your initial claim on this thread just 5 or so posts back. Go on, once again I say AGAIN, PUT UP OR SHUT UP!!! You both insisted that in most every post I have ever written, I have boasted about going to heaven in a prideful way. Prove it. I have 5000 posts that you have complete access to so prove your allegation.", 
   {}, 
   321483, 
   null, 
   1219779660.0
  ], 
  [
   321497, 
   null, 
   "Iuris", 
   "Um, if I may...\n \n I don't remember Archie ever specifically saying he would go to heaven. However, it is strongly implied by the constant \"you are going to hell for that\" and \"this way is the way to heaven\".", 
   {}, 
   321492, 
   null, 
   1219781520.0
  ], 
  [
   321498, 
   null, 
   "Kronus", 
   "Um, if I may...\n \n I don't remember Archie ever specifically saying he would go to heaven. However, it is strongly implied by the constant \"you are going to hell for that\" and \"this way is the way to heaven\".\n\n \n Exactly. Archie's just pulling the old \"imply with a sledge hammer then deny saying anything\" tact here. Number of people fooled? Well, Archie might possibly have convinced himself, but that would be about it.", 
   {}, 
   321497, 
   null, 
   1219782060.0
  ], 
  [
   321500, 
   null, 
   "Archangel", 
   "Um, if I may...\n \n I don't remember Archie ever specifically saying he would go to heaven. However, it is strongly implied by the constant \"you are going to hell for that\" and \"this way is the way to heaven\".\n\n \n Even this is a distortion of my response to mockers and scoffers of the truth that God represents in His word. I have said on numerous occasions that when this life ends, you scoffers will learn the truth about the spiritual matters we discuss. No where is that condemning anyone to hell, it only promises that you will ultimately learn the eternal truths that I offer. Of course to you atheists, being forced to hear Gods truth is equivalent to being condemned to hell emoticon_smile . \n \n But that's beside the point. And so is your excuse for kronus and tq which does nothing to exonerate them for the lie they told about me, and I quote kronus complete statement: You never miss a chance to tell everyone that you're going to heaven and they aren't. Sounds like someone boasting about their exclusive country club to me. There's certainly no humility in the way you present yourself. And his lying buddy tq, who said, and I also quote: You heard him Kronus. Archie wants a list of almost every single post he's ever made, with links. Get to it!\n \n So they have made an absolute provable accusation against me, if true, yet they don't post any one of over 5000 posts of mine to support their accusation. And in addition to that lying hypocrisy, THEY HAVE STATED THAT I PROVED THEIR ACCUSATION EARLIER IN THIS VERY THREAD, YET THEY WONT EVEN QUOTE THE POST, WHAT I SAID, OR EVEN A LINK TO THE POST IN THIS THREAD CONFIRMING THEIR NEWEST LYING AND HYPOCRITICAL OBFUSCATION. With every post they prove what they are as they refuse to either support or withdraw their fallacious claim. So don't even try to make excuses for them of justify their lies unless you want to lose all credibility yourself.", 
   {}, 
   321497, 
   null, 
   1219783500.0
  ], 
  [
   321503, 
   null, 
   "Kronus", 
   " So don't even try to make excuses for them of justify their lies unless you want to lose all credibility yourself.\n\n \n Yeah, be careful there Iuris. I'd feel awful if you lost credibility with Archie on my account! emoticon_rolleyes", 
   {}, 
   321500, 
   null, 
   1219783920.0
  ], 
  [
   321507, 
   null, 
   "Archangel", 
   "Yeah, be careful there Iuris. I'd feel awful if you lost credibility with Archie on my account! emoticon_rolleyes\n\n \n Still no evidence to back up your slanderous lie huh? Nothing but cheap lip service kronus? That's all you and tq have. You wont even produce the post in this thread that you claim proved your point, huh? You're both complete hypocrites, liars and a waste of time kronus. Both you and tq think nothing of slandering me without a shred of evidence to support it. At least you're consistent in your dishonesty and hypocrisy. And btw, Iuris will lose credibility with more members than just me for supporting the likes of you and tq.", 
   {}, 
   321503, 
   null, 
   1219786020.0
  ], 
  [
   321514, 
   null, 
   "T.Q", 
   "Patented Archie tantrum, complete with name calling and baseless accusations of dishonesty\n\n \n Archie, why do you never quit before you make a complete XXX of yourself? You made a challenge, it was met-in the very same post in which you issued the challenge. Now you're throwing a tantrum. And you have the gall to comment on shooter's maturity? You're the biggest child I've ever seen.\n \n \nYou wont even produce the post in this thread that you claim proved your point, huh?\n\n sigh\n Is it really that tough to read before you fire off a rant? It's pretty obvious you didn't.\n \n \nAnd btw, Iuris will lose credibility with more members than just me for supporting the likes of you and tq.\n\n Yeah, but who? No one I consider a loss, I'm willing to bet.\n \n Now are you going to continue being a child and call everyone names before taking your ball and go home? Or do you want to try being a big boy for a change?", 
   {}, 
   321507, 
   null, 
   1219787340.0
  ], 
  [
   321520, 
   null, 
   "Archangel", 
   "Archie, why do you never quit before you make a complete XXX of yourself? You made a challenge, it was met-in the very same post in which you issued the challenge. Now you're throwing a tantrum. And you have the gall to comment on shooter's maturity? You're the biggest child I've ever seen.\n \n \n sigh\n Is it really that tough to read before you fire off a rant? It's pretty obvious you didn't.\n\n \n So this is me boasting that I'm going to heaven and you're not? I quote my own statement from the link you posted and bolded: I promised you mockers and scoffers that the day will come when you will learn the truth about how wrong you are to reject the living God. How is that in any way boasting that I am going to heaven or pridefully saying I am worthy of heaven? Beside that, haven't I said a hundred times at least, that when we all die, we will immediately understand the truth about God and His eternal nature, love, sacrifice for us and power? So that is what I mean when I say at the end of this journey you will know the truth. It is in no way condemning you to hell, and especially is it ever me boasting that I'm going to heaven but you're not.\n \n So just because you ignorantly and hatefully choose to misinterpret what I say, it in no way means I said what you slanderously claim I said. In other words tq, don't blame me for your ignorance and inability to interpret english properly as you make an XXX of yourself. Now are you going to continue being a child and call me names before taking your ball and go home? Or do you want to try being a big boy for a change and apologize for lying and slandering me?", 
   {}, 
   321514, 
   null, 
   1219789560.0
  ], 
  [
   321522, 
   null, 
   "Iuris", 
   "Well, I'll have to admit that it wasn't easy to find. So much clutter in the search engine. However, there is even a direct quote. Now, seriously, do these examples not indicate the general tendency? If they do not, please, take the opportunity to simply restate your views, that they might be shown clearly.\n \n \nYou better keep plenty of chicken on hand then cuz you're gonna burn baby. And to answer your question, if God just prevented all atheists from existing, that would be equivalent to taking free will away, and that isn't how God works. He wants free will agents who choose to be with him freely and without coercion. And besides, many millions of one time atheists have met God through their search for the Truth and been eternally saved because of that. Had God prevented them from living at all because of their unbelief, they never would have come to the knowledge of Him at all.\n\n \n \n\n Nothing at all Penfold. I fully and completely realize that you can't tell the difference between a cult and Gods eternal truth. Here's how the bible explains it.\n \n \n 2Th 2:9\n The coming of the lawless one is according to the working of Satan, with all power, signs, and \"lying\" wonders,\n 2Th 2:10\n and with all unrighteous deception among those who perish, because they did not receive the love of the truth, that they might be saved.\n 2Th 2:11\n And for this reason God will send them strong delusion, that they should believe the lie,\n 2Th 2:12\n that they all may be condemned who did not believe the truth but had pleasure in unrighteousness.\n\n \n \nAnyone else see the absolute maliciousness and depravity present in the quote, or is it just me?\n It's the bible tq, I didn't write it, but I agree, it is a very scary passage since it speaks to the coming destruction of those who reject the truth.\n\n \n \n P.S. I do apologize, but I don't know how you do the direct link to a post, so I have to requote.", 
   {}, 
   321520, 
   null, 
   1219790040.0
  ], 
  [
   321525, 
   null, 
   "Iuris", 
   "P.P.S.\n \n Sorry, accidentally hit post prematurely.\n \n Please understand Archie, I'm a bleemin' lawyer. If we ARE indeed wrong about what you post and believe, please, DO take the opportunity to restate it clearly. Just take care to be clear on the issues that are specific. Same way as you can ask me to come out clean regarding anything I say. Although possibly not the same day, given it's 22:39 here, and I've still got some court orders (or whatever you call them, our English legal terminology was a joke at the uni).\n \n Also, while I would have to admit that I don't think all that highly of you (but that's mostly because of your efforts in the evolution forum, where you regularly demonstrate little understanding of the issues and yet insist on discussing them), Archie, I don't hate you. I certainly won't be calling for anyone to be put in hell. I don't want you hurt or anything. I don't think there is a heaven (a pity), but if there's a heaven, I wish you get there. I must even admit that while I consider you misguided in your efforts, I can't help but admire your zeal. And, I must say that people do tend to pick on you far too much, that's why I posted the post. Maybe starting over woouldn't be a bad idea.", 
   {}, 
   321522, 
   null, 
   1219790580.0
  ], 
  [
   321539, 
   null, 
   "Kronus", 
   "Still no evidence to back up your slanderous lie huh? \n\n Above and beyond that which I supplied, refered to again, and yet you still ignore? Nope. emoticon_smile", 
   {}, 
   321507, 
   null, 
   1219798620.0
  ], 
  [
   321540, 
   null, 
   "Kronus", 
   "In other words tq, don't blame me for your ignorance and inability to interpret english properly as you make an XXX of yourself. \n\n And don't blame other people when you pull an Archie.", 
   {}, 
   321520, 
   null, 
   1219799220.0
  ], 
  [
   321543, 
   null, 
   "GazzaElliott", 
   "And my point was that by even asking that question, you're holding God to some higher standard (of justice and fairness) that you've ascribed to yourself, than God himself. In which case, he's not really God at all, so it's a moot point. You're not starting at the same initial assumptions.\n\n \n I'm trying not to start with any assumptions! You've admitted that you're not really analysing the nature of God, you're merely engaging in some ad hoc rationalization. If that's the case, why dress it up in Bible study? Since your answer appears to be '#### happens', why not just run with that? \n \n Also, why is it that God shouldn't be held to the same standards that he holds us to? You only lead by example, and those who can't rapidly lose thier authority. Why is God any different?\n \n \nThere's no mental knots to that, by the way (Something you alluded to). It's quite simple really.\n\n \n It does seem to be a case that you are in no danger of actually raising a difficult question. You've already decided that God is above our capacity to understand, and thus justify your answers before you attempt to produce them. Seems a bit odd to me...", 
   {}, 
   321450, 
   null, 
   1219800180.0
  ], 
  [
   321545, 
   null, 
   "GazzaElliott", 
   "I assume you mean by your standard of what is good or bad. If it's truly God, then there is no other standard to hold him to. If he has limits, how can he really be considered GOD? (Maybe its a demigod instead. :) ) It seems to me that God (if that's what it really is) would be the one who sets the rules for morality. It wouldn't be able to exist over and above God (with a capital \"G\").\n\n \n We're not questioning whether God is capable of being good or evil, we're asking why he shouldn't live to the same moral code that he sets for others.", 
   {}, 
   321454, 
   null, 
   1219800600.0
  ], 
  [
   321550, 
   null, 
   "Archangel", 
   "Well, I'll have to admit that it wasn't easy to find. So much clutter in the search engine. However, there is even a direct quote. Now, seriously, do these examples not indicate the general tendency? If they do not, please, take the opportunity to simply restate your views, that they might be shown clearly.\n \n P.S. I do apologize, but I don't know how you do the direct link to a post, so I have to requote.\n\n \n Here's the link to this post [ http://www.4forums.com/political/showpost.php?p=321522&postcount=90 ] because you placed the statements in quotes and they don't copy when quoting a post. Now once again Iruis, Here is what Kronus accused me of doing and tq supported by implying that I've done it in almost every post I've ever written here. So I would ask you why you had such problems finding examples of me doing what he accused me of, if you had accomplished the goal at all, If in fact I had boasted about being worthy of heaven in most every post I have ever written here? Here is what Kronus said I did. You never miss a chance to tell everyone that you're going to heaven and they aren't. And here's tq's lying contribution: You heard him Kronus. Archie wants a list of almost every single post he's ever made, with links. Get to it!\n \n Now where in your quotes am I pompously bragging and boasting that I am going to heaven because I am worthy of it and other people aren't? That was the statement after all, and through out our exchange it was made clear that that is what I have done on most of the 5500+ posts I have written here. If his statement was true, it should have been easy to find many examples of it, not the three that you posted that still don't accomplish what he accused me of. But thanks for your dedication, I'm sure finding those took some time. emoticon_xgood\n \n And btw, here's how you copy a link to a post. Lay your cursor over the posts number, Left click on it and when the small pop up page shows cut, copy and paste, click on copy and then transfer the link to the post you want to paste it to. Left click again and paste it. It's as easy as that. Because I would like to see the links to those posts just for the heck of it to see those posts in proper context.", 
   {}, 
   321522, 
   null, 
   1219803600.0
  ], 
  [
   321556, 
   null, 
   "CUNxTime", 
   "*hypothetical situation*\n \n Hi, my name is John, and here's the thing. I want to get into heaven, but I don't believe in the Christian God, because logically not a lot of his laws make sense. And I can't believe that the same god that gave us logic and reason would intend us to forgo their use (I didn't make that quote, I just forgot who said it). I am however, a compassionate and loving person, and I help whenever possible, and do my best at things. I do believe in some higher power, just not the judging Christian God. You could call me a deist. I also volunteer, and have donated much time and money to helping starving African children. \n \n \n Now, I know a guy named (random name) Mike over here is a devout believer in Jesus Christ, the Holy Spirit, and the Christian God. He goes to church every Sunday with his wife and two kids, and worships. He reads the bible daily, and prays every night. The thing is, Mike is a real d!ck. He is cranky, and never nice to anyone but his family. He never helps and is lazy sometimes. He doesn't commit any crimes, he is just a jerk, overall.\n \n [end hypothetical situation]\n \n So, which of these two people would be more likely to get into heaven, and why? I posed this question to my fourth grade religion teacher, and she said John. She claimed that to get into heaven being compassionate and good comes before believing in God.\n \n So, John or Mike?\n \n EDIT: Please do not point out spiritual or scientific improbabilities in my scenario. It is not meant to be perfect. I am interested in the questions stated above, not your opinion on how well the hypothetical situation was written.\n\n \n \n There is no heaven or hell. There is no cosmic justice. You should do the right thing anyway because it is the right thing--not because you may or may not go to hell. There is no God. There is no devil. If you strip away the rituals down to the core beliefs todays \"civilized\" religions aren't any different really than those of tribe still living without contact out in the jungles. They are no different than the beliefs of the cave man. Hell, the x-ians EAT THE BODY AND DRINK THE BLOOD of Christ each week! We are, at heart, all atheists. I only believe in one less God than you...", 
   {}, 
   321115, 
   null, 
   1219806420.0
  ], 
  [
   321561, 
   null, 
   "Iuris", 
   "Now once again Iruis, Here is what Kronus accused me of doing and tq supported by implying that I've done it in almost every thread I've ever written here.\n\n \n I'm neither Kronus nor TQ. I actually half defended you, Archie, by saying that I don't remember you directly saying so. I only said that the implication is present.", 
   {}, 
   321556, 
   null, 
   1219824780.0
  ], 
  [
   321567, 
   null, 
   "Archangel", 
   "I'm neither Kronus nor TQ. I actually half defended you, Archie, by saying that I don't remember you directly saying so. I only said that the implication is present.\n\n \n I realize that you HALF defended me, and I appreciate that HALF of your defense because it shows that you are half way objective at least. But what does that have to do with me pointing out that you missed the mark in the posts you quoted as they don't prove what kronus accused me of doing at all. And don't you agree that between him and tq, they implied that you could almost pick from most any of the 5500+ posts that I've written on this forum and find me boasting about going to heaven while gleefully condemning all unbelievers to a torment in an eternal hell? \n \n Doesn't your extensive search prove their assertions blatantly wrong and even dishonest? And don't you agree after your extensive search that I have never boasted and bragged in a prideful way that I am good enough, or special as a believer in Christ, but have always stated that I was undeservedly saved by Grace, and have only boasted about Gods goodness in saving a wretch like me? \n \n I only stress this issue because it is basic to the concept of the gospel itself. Eph 2:8 say's, For by grace you have been saved through faith; and that not of yourselves, {it is} the gift of God; [Eph 2:9] not as a result of works, so that no one may boast.\n \n So their accusation goes to the very foundation of my faith and the work God did in not only saving my soul, but in saving all of our souls. If I had in fact been bragging and boasting about my salvation while gleefully glorying in the coming destruction of all unbelievers, it would be a terrible example and testimony regarding my relationship with the living God. I say this so you understand why I have demanded evidence that I was guilty of doing what they accused me of doing. \n \n And I trust that since you did the search, you can attest to the FACT that i have never boasted in heaven as if I was worthy of it, but have boasted only in Christ who did all of the work on the Cross necessary to save my soul. And that I, myself have done nothing at all to be worthy of that salvation other than receive the free gift that God so mercifully died for, so that I might have access to eternal life by way of His shed blood. So that is what I expect you to admit to based on your extensive search Iuris, that is the half of your objective defense that I would like you to admit to, and if you do, you must then admit that kronus and tq lied about me spiritually, and slandered me personally and directly. \n \n As an objective truth seeker, which I would hope a lawyer is committed to being emoticon_confused , I would hope you would not defend, excuse or justify their dishonesty in any way but would clearly defend and support me against their defamatory slander. Especially since even they, who made the accusation haven't posted even one example from my 5500+ posts to support their lie.", 
   {}, 
   321561, 
   null, 
   1219838400.0
  ], 
  [
   321570, 
   null, 
   "Penfold", 
   "As an objective truth seeker, he has already been overgenerous in allocating your assertions so much as half, yet you denigrate his support. The most effective lies contain a grain of truth. Your repetitons of the threat hanging over your opponents, (but not you) on \"judgement day\" whilst tiptoeing around the form of words which describes the actual lie you are accused of, amply demonstrates your hubris in the face of your semantic contortions. Guilty as charged.", 
   {}, 
   321567, 
   null, 
   1219842600.0
  ], 
  [
   321583, 
   null, 
   "Iuris", 
   "Whoa, whoa, WHOA, Hold your horses there, Archie! :)\n \n First, a 10 minute search is not extensive enough to exonerate anyone. 5540 posts? Blimey, are you kidding? I'm not your lawyer, although if you want to pay me a lawyer fee for a 5000 post review, please do, I could use the money. To buy something nice, like a new computer :) Especially with such a great proportion of the more recent ones being reply to reply to reply to allegation to....... I just can't be bothered to search them all.\n \n Jokes aside, all it shows is that I have not found any direct boasts or threats in a short search.\n \n But that aside, try this instead:\n \n In my opinion, it is wrong to treat your posts as they are treated. I understand the frustration of all sides involved. I'd much rather see that people adopted the position \"if you don't have anything to say on the topic, keep quiet\".", 
   {}, 
   321570, 
   null, 
   1219859340.0
  ], 
  [
   321592, 
   null, 
   "jyoshu", 
   "We're not questioning whether God is capable of being good or evil, we're asking why he shouldn't live to the same moral code that he sets for others.\n\n \n If a parent tells his 6-year-old he can't operate the riding lawn mower, does that mean the parent shouldn't be able to do it either? If a parent tells his child he can't harm the family dog, does that mean the parent can't have the dog euthanized if it got rabies?\n \n \nYou've already decided that God is above our capacity to understand, and thus justify your answers before you attempt to produce them. Seems a bit odd to me...\n\n \n Well if he's really GOD, how could it be any other way? (That's why I mentioned that the only option you're leaving is for people to not believe in GOD. (as God!)", 
   {}, 
   321545, 
   null, 
   1219867140.0
  ], 
  [
   321596, 
   null, 
   "foundit66", 
   "If a parent tells his 6-year-old he can't operate the riding lawn mower, does that mean the parent shouldn't be able to do it either? If a parent tells his child he can't harm the family dog, does that mean the parent can't have the dog euthanized if it got rabies?\n\n You're not talking about different moral codes. You're talking about existing distinctions creating different conclusions.\n \n The 6-year old lacks the experience, judgment, and perhaps even physical attributes to safely operate the riding lawn mower.\n Old Yeller has a 14-year old Travis kill the family dog that has rabies.\n It's not an issue of \"child\", but rather the REASONING WHY the dog shouldn't be harmed.\n If a child kills a dog that has rabies, would anybody balk?\n \n These excuses assume circumstances that are NOT EVEN HINTED at in justification for God TORTURING PEOPLE FOR ETERNITY.\n Mankind supposedly has, by God's own admission, knowledge of \"good and evil\".\n Yet when our own realization shows that God's actions (for some) are obviously evil, then there is a pretense that we have to be ignorant instead of the obvious conclusion.\n \n \n \nWell if he's really GOD, how could it be any other way? (That's why I mentioned that the only option you're leaving is for people to not believe in GOD. (as God!)\n\n When it comes to something humans think as \"good\", then our judgment must be trusted. God must be good.\n \n When it comes to something humans think as \"evil\", then our judgment must be faulty. God must still be good.\n \n I don't understand how this double-standard can exist.\n Why not simply presume that when we THINK God is doing good, it must have some underlying rationale of evil behind it. Then we can parade out the excuses that we see above for people who insist that it shows God as being good.\n \n It's amusing how the excuses are only applied when it leads to a conclusion you don't feel comfortable in making.", 
   {}, 
   321592, 
   null, 
   1219868100.0
  ], 
  [
   321609, 
   null, 
   "Kronus", 
   "What I'm finding most intriguing about the mental gymnastics that the religious folks here are putting themselves through is that it all seems geared towards giving God an out for damning people. Why is it so critical that God be all set to condemn people to an eternity of suffering? All these contradictions and paradoxes would be much easier to deal with if, at the very least, damnation was something you had to earn, as opposed to it being the default state. Why is that such a hard concept for people to accept?", 
   {}, 
   321596, 
   null, 
   1219872300.0
  ], 
  [
   321611, 
   null, 
   "foundit66", 
   "What I'm finding most intriguing about the mental gymnastics that the religious folks here are putting themselves through is that it all seems geared towards giving God an out for damning people. Why is it so critical that God be all set to condemn people to an eternity of suffering? All these contradictions and paradoxes would be much easier to deal with if, at the very least, damnation was something you had to earn, as opposed to it being the default state. Why is that such a hard concept for people to accept?\n\n \n On the birth of a baby, I've heard plenty of comments about how \"sweet\" or \"innocent\" the kid looks.\n I've never heard comments like, \"Awwww. Doesn't he look like he deserves to go to hell just for being born? And that cute little baby a couple of cribs over that belongs to the Buddhist couple. If he were to die of crib death, some Christian interpretations would hold that he should go to hell. What a gracious and good god...\"\n emoticon_frazzled\n \n Edit: Although I think it should be transparent, the above \"never heard comments\" is partly serious, partly hyperbolic.", 
   {}, 
   321609, 
   null, 
   1219873320.0
  ], 
  [
   321617, 
   null, 
   "Archangel", 
   "Whoa, whoa, WHOA, Hold your horses there, Archie! :)\n \n First, a 10 minute search is not extensive enough to exonerate anyone. 5540 posts? Blimey, are you kidding? I'm not your lawyer, although if you want to pay me a lawyer fee for a 5000 post review, please do, I could use the money. To buy something nice, like a new computer :) Especially with such a great proportion of the more recent ones being reply to reply to reply to allegation to....... I just can't be bothered to search them all.\n \n Jokes aside, all it shows is that I have not found any direct boasts or threats in a short search.\n \n But that aside, try this instead:\n \n In my opinion, it is wrong to treat your posts as they are treated. I understand the frustration of all sides involved. I'd much rather see that people adopted the position \"if you don't have anything to say on the topic, keep quiet\".\n\n \n Based on what you said Iuris, i assumed you spent more than 10 minutes on your search. You said this: [Iuris] Well, I'll have to admit that it wasn't easy to find. Sorry for making the assumption though. Can we agree that both kronus's and tq's claims were slanderous and absolutely untrue based on the fact that they themselves, who made the accusations weren't able to supply even one post that supported their claims? In addition to the limited personal search that you did? \n \n I realize they have run away, but as an attorney wouldn't you refuse to represent their claim since there is no evidence to support their claim that they can produce? I mean, they made the accusation and inferred that most every post I have ever written will support their accusation. You must agree that they have blatantly lied, distorted the truth and slandered me in the process. If you're unable to admit that based on what you have seen transpire in this exchange then you really do represent the reputation that lawyers are famous for.", 
   {}, 
   321583, 
   null, 
   1219879260.0
  ], 
  [
   321621, 
   null, 
   "T.Q", 
   "Can we agree that both kronus's and tq's claims were slanderous and absolutely untrue based on the fact that they themselves, who made the accusations weren't able to supply even one post that supported their claims?\n\n No, we can't make that assumption, because Kronus did provide evidence in support of what he claimed.\n \n \nIn addition to the limited personal search that you did?\n\n Iuris' quote also show your general attitude, which is what Kronus was commenting on as well. No one ever said you used exact words, but your demeanor and attitude show this to be what you mean.\n \n \nI realize they have run away,\n\n Nope, just given up in futility of you ever understanding basic common sense or english.\n \n \nbut as an attorney wouldn't you refuse to represent their claim since there is no evidence to support their claim that they can produce?\n\n There is, and it has been produced.\n \n \nI mean, they made the accusation\n\n Krouns did, not \"they\"\n \n \nand inferred that most every post I have ever written will support their accusation.\n\n Have you ever heard of exagerrating something for humorous purposes? No, not \"most every post you have ever written\" contains an example of your behaviour in this regard, but quite a few do. \n \n \nYou must agree that they have blatantly lied, distorted the truth and slandered me in the process.\n\n I'm not sure whether to be angry or laugh my XXX off at Archie accusing someone of blatantly lying, distorting the truth, and slandering him. These are things you do every day here Archie!\n \n \nIf you're unable to admit that based on what you have seen transpire in this exchange then you really do represent the reputation that lawyers are famous for.\n\n And a veiled insult at the end. You see why it isn't worth it Iuris?", 
   {}, 
   321617, 
   null, 
   1219880460.0
  ], 
  [
   321622, 
   null, 
   "Kronus", 
   "Can we agree that both kronus's and tq's claims were slanderous and absolutely untrue based on the fact that they themselves, who made the accusations weren't able to supply even one post that supported their claims? In addition to the limited personal search that you did? \n\n \n You're trully desperate, aren't you? I will repeat, one last time, that I bolded your typical claim in the very post where you claim never to make such claims. I can't believe how desperately you're trying to cling to the fiction that you've built for yourself! At least have the integrity to stand on your own two feet, and stop trying to rope others into \"supporting\" you. emoticon_xdonno\n \n \n Edit:\n \"If you're unable to admit that based on what you have seen transpire in this exchange then you really do represent the reputation that lawyers are famous for.\"\n And there's one more form of bigotry to attribute to Archie! Making friends wherever you go, eh?", 
   {}, 
   321617, 
   null, 
   1219880460.0
  ], 
  [
   321623, 
   null, 
   "Kronus", 
   " \n Have you ever heard of exagerrating something for humorous purposes? No, not \"most every post you have ever written\" contains an example of your behaviour in this regard, but quite a few do. \n \n\n \n I do have to call you on that one. You really should have known that hyperbole would go right over Archie's head. Using it was a bad call on your part. In my opinion, of course.", 
   {}, 
   321621, 
   null, 
   1219881120.0
  ], 
  [
   321624, 
   null, 
   "T.Q", 
   "I do have to call you on that one. You really should have known that hyperbole would go right over Archie's head. Using it was a bad call on your part. In my opinion, of course.\n\n \n True, that was an error on my part.", 
   {}, 
   321623, 
   null, 
   1219881180.0
  ], 
  [
   321625, 
   null, 
   "unkerpaulie", 
   "You must have missed it, but I did bring an argument to the table. Thus, the resulting debate. I said that such and such a view can't be right, and others weighed in, and off we went. You, apparently, don't like the direction the debate is going and so are trying to derail it. Do you have anything actually germane to contribute, or are you just here for a meta-debate, despite your protestations that you hate those so much?\n\n Sorry I didn't get in on this discussion earlier before it digressed into a quote accusation race, but I think this post is worth responding to. Kronus, you're actually agreeing with joshyu's assessment of your debating tactic. You say that such and such statement can't be right. The statement of such and such in this case wasn't yours to begin with, you just came in and disagreed with it, as jyoshu said. So really this would be an example where you haven't brought anything to the table.", 
   {}, 
   321302, 
   null, 
   1219881540.0
  ], 
  [
   321626, 
   null, 
   "Kronus", 
   "Sorry I didn't get in on this discussion earlier before it digressed into a quote accusation race, but I think this post is worth responding to. Kronus, you're actually agreeing with joshyu's assessment of your debating tactic. You say that such and such statement can't be right. The statement of such and such in this case wasn't yours to begin with, you just came in and disagreed with it, as jyoshu said. So really this would be an example where you haven't brought anything to the table.\n\n \n Eh, not really. If you go back to the beginning, you will see that I wasn't simply negating the point of view raised by someone else. I was bringing a popularly held view to the table and discussing it. That's certianly a legitimate thing to do. What Jyoshu really was saying is that he wanted me to invent my own theory about what it takes to get into heaven so he could attack it, as opposed to discussing the critique of the popularly held view.", 
   {}, 
   321625, 
   null, 
   1219882200.0
  ], 
  [
   321629, 
   null, 
   "unkerpaulie", 
   "I'm trying not to start with any assumptions! You've admitted that you're not really analysing the nature of God, you're merely engaging in some ad hoc rationalization. If that's the case, why dress it up in Bible study? Since your answer appears to be '#### happens', why not just run with that? \n \n Also, why is it that God shouldn't be held to the same standards that he holds us to? You only lead by example, and those who can't rapidly lose thier authority. Why is God any different?\n \n\n At least one of the assumptions made in this discussion is that God is benevolent. Another is that he has the power to assign you to heaven or hell when you die. Without these assumptions we'd have no discussion. \n \n As for whether God is subject to moral scrutiny, jyoshu argues that if God being good or evil is contingent on our opinions, then is he subject to our standards of morality? And if he is, then wouldn't that make us more God than him?\n \n Kronus made a very good counter-argument\n : we are qualified to judge good and evil because we have the knowlegde of good and evil within us since adam ate the fruit. Jyoshu hasn't responded to this yet. \n \n Basically, if we have knowledge of good and evil, we should be able to determine if God is good or evil, shouldn't we?", 
   {}, 
   321543, 
   null, 
   1219882920.0
  ], 
  [
   321631, 
   null, 
   "Kronus", 
   " \n As for whether God is subject to moral scrutiny, jyoshu argues that if God being good or evil is contingent on our opinions, then is he subject to our standards of morality? And if he is, then wouldn't that make us more God than him?\n\n Is dropping trash on the ground good or evil? From a human point of view, it's evil (at least it isn't good). But from the point of view of the ants that will feast on the garbage, it's good. If God is so much a higher being that we can't comprehend his morality, then using His definitions is pointless; we can only describe him using terms that make sense to us. Those terms aren't binding. The fact that we think God is good or evil doesn't make him any different in terms that would apply to him, any more than the ants thinking the mana from \"heaven\" was good would actually make littering ok.\n \n \n\n Kronus made a very good counter-argument\n : we are qualified to judge good and evil because we have the knowlegde of good and evil within us since adam ate the fruit. Jyoshu hasn't responded to this yet. \n\n I don't think I said that. I certainly believe that we have the ability to discern good from evil, at least in terms that make sense to us mere mortals, but I don't think I ever attributted that skill to Adam and the fruit.", 
   {}, 
   321629, 
   null, 
   1219883820.0
  ], 
  [
   321633, 
   null, 
   "unkerpaulie", 
   "\n Mainly, inherited a sinful nature from the first fully formed man, Adam. But Christ's teachings show sin in all of us. \n \n \n I have taken unecessary extra glances at young ladies more than once, I have gotten potty mouth more than once after striking my finger with a hammer, etc. I deserve it plenty, even for things I've done that I'm not even aware of. Just because it's all not pleasant to me doesn't mean I close my eyes and ears to it. I'm quite thankful that I'm forgiven for it. \n \n Do you believe you're perfect? Can you name anyone you believe is perfect? \n \n Some atheists talk about how mean and vengeful the God of the old testament was. Well yeah, I'm thankful that I missed all that, that I wasn't alive back then. There really is a lot for a Christian to be thankful for.\n\n Let me get something clear. Is it our sinful nature that separates us from God and makes us deserve to go to hell? Because by default, even as babies that haven't done anything, good or bad, we have this sinful nature, and that is the one justification why babies should go to hell if they die. So I just want to make sure I'm clear on that.", 
   {}, 
   321275, 
   null, 
   1219884180.0
  ], 
  [
   321635, 
   null, 
   "unkerpaulie", 
   "*hypothetical situation*\n \n Hi, my name is John, and here's the thing. I want to get into heaven, but I don't believe in the Christian God, because logically not a lot of his laws make sense. And I can't believe that the same god that gave us logic and reason would intend us to forgo their use (I didn't make that quote, I just forgot who said it). I am however, a compassionate and loving person, and I help whenever possible, and do my best at things. I do believe in some higher power, just not the judging Christian God. You could call me a deist. I also volunteer, and have donated much time and money to helping starving African children. \n \n \n Now, I know a guy named (random name) Mike over here is a devout believer in Jesus Christ, the Holy Spirit, and the Christian God. He goes to church every Sunday with his wife and two kids, and worships. He reads the bible daily, and prays every night. The thing is, Mike is a real d!ck. He is cranky, and never nice to anyone but his family. He never helps and is lazy sometimes. He doesn't commit any crimes, he is just a jerk, overall.\n \n [end hypothetical situation]\n \n So, which of these two people would be more likely to get into heaven, and why? I posed this question to my fourth grade religion teacher, and she said John. She claimed that to get into heaven being compassionate and good comes before believing in God.\n \n So, John or Mike?\n \n EDIT: Please do not point out spiritual or scientific improbabilities in my scenario. It is not meant to be perfect. I am interested in the questions stated above, not your opinion on how well the hypothetical situation was written.\n\n Getting into heaven is an easy 2 step process that is 100% guaranteed to work regardless of whether you're mike, john, me or you. \n Step 1: die\n Step 2: don't get into heaven\n \n Every single person who dies, regardless of religious belief, personal philosophy or human contribution, is randomly selected to get the same results when they die. Lay up your treasures where moths and dust might corrupt, but you actually have the possibility to enjoy them, rather than lay up treasures in heaven that you can never ever get to.", 
   {}, 
   321115, 
   null, 
   1219884840.0
  ], 
  [
   321646, 
   null, 
   "GazzaElliott", 
   "If a parent tells his 6-year-old he can't operate the riding lawn mower, does that mean the parent shouldn't be able to do it either? If a parent tells his child he can't harm the family dog, does that mean the parent can't have the dog euthanized if it got rabies?\n\n \n That's not the same question. An appropriate analogy would be: \"If a parent teaches his kid not to kill animals wantonly, is the parent not allowed to kill wantonly either?\". The answer to that is no. If you're trying to teach someone not to kill, then you have to set the example for them to follow. As fondit said, the question you're raising is one of responsibility and knowledge, not of basic moral codes.\n \n \nWell if he's really GOD, how could it be any other way? (That's why I mentioned that the only option you're leaving is for people to not believe in GOD. (as God!) \n\n \n That totally depends on your belief. Some people believe in the concept of a God you can fully know, and thus you can fully understand. All this seems to be is a bit of rationalization to justify the Biblically evidenced vindictive side of the Judeo-Christian God.", 
   {}, 
   321592, 
   null, 
   1219893780.0
  ], 
  [
   321648, 
   null, 
   "GazzaElliott", 
   "At least one of the assumptions made in this discussion is that God is benevolent. Another is that he has the power to assign you to heaven or hell when you die. Without these assumptions we'd have no discussion. \n \n As for whether God is subject to moral scrutiny, jyoshu argues that if God being good or evil is contingent on our opinions, then is he subject to our standards of morality? And if he is, then wouldn't that make us more God than him?\n \n Kronus made a very good counter-argument\n : we are qualified to judge good and evil because we have the knowlegde of good and evil within us since adam ate the fruit. Jyoshu hasn't responded to this yet. \n \n Basically, if we have knowledge of good and evil, we should be able to determine if God is good or evil, shouldn't we?\n\n \n I'm not assuming God is benevolent. I'm accepting the possibility that the Biblical God exists, but I'm trying not to assume anything beyond that. We have been given a moral code by God, and I'm asking why we should expect that God should not follow that code. Humans have the knowledge of good and evil, and we also have a \"God-given\" moral code. Why should God not stick to these rules if they are the way that God wants people to behave? We're not imposing our morality on God, we're imposing God's morality on God.", 
   {}, 
   321629, 
   null, 
   1219895520.0
  ], 
  [
   321651, 
   null, 
   "smiley", 
   "I'm not assuming God is benevolent. I'm accepting the possibility that the Biblical God exists, but I'm trying not to assume anything beyond that. We have been given a moral code by God, and I'm asking why we should expect that God should not follow that code. Humans have the knowledge of good and evil, and we also have a \"God-given\" moral code. Why should God not stick to these rules if they are the way that God wants people to behave? We're not imposing our morality on God, we're imposing God's morality on God.\n\n If we are not assuming that God is benevolent, then we also cannot assume that a god-given moral code would demand that we be \"good\" (unless, of course, god is saying 'do as I say, not as I do').\n \n If we are going to believe that we have been given a moral code, and that god should also be following this code, then evidence would tend to suggest that either this god-given code is far from \"good\", or that we simply have not understood it.\n \n This would tend to suggest that the \"good\" moral code that we aspire to is man-made rather than god-given.\n \n However, if we just accept that god has no need to follow the code that he/she/it handed down to us (or that we are simply to stupid to understand what's really going on) then we are just wasting our time here.\n \n Smiley", 
   {}, 
   321648, 
   null, 
   1219897380.0
  ], 
  [
   321652, 
   null, 
   "GazzaElliott", 
   "If we are not assuming that God is benevolent, then we also cannot assume that a god-given moral code would demand that we be \"good\" (unless, of course, god is saying 'do as I say, not as I do').\n\n \n A God doesn't have to be benevolent to give a 'good' moral code. He amy do it so he specifically can send people to hell for not matching his standards. That'd be a pretty harsh reason to give a 'good' code of morals\n \n \nIf we are going to believe that we have been given a moral code, and that god should also be following this code, then evidence would tend to suggest that either this god-given code is far from \"good\", or that we simply have not understood it.\n\n \n That's the point I was trying to make....\n \n \nThis would tend to suggest that the \"good\" moral code that we aspire to is man-made rather than god-given.\n\n \n Exactly...\n \n \nHowever, if we just accept that god has no need to follow the code that he/she/it handed down to us (or that we are simply to stupid to understand what's really going on) then we are just wasting our time here.\n\n \n I'm trying to understand why God can't be held to his own standard by his believers....", 
   {}, 
   321651, 
   null, 
   1219898100.0
  ], 
  [
   321665, 
   null, 
   "jyoshu", 
   "That's not the same question. An appropriate analogy would be: \"If a parent teaches his kid not to kill animals wantonly, is the parent not allowed to kill wantonly either?\".\n\n \n But that's just it--it's quite a tall assumption to make that God does his killing wantonly. Particularly since we're talking about GOD here--the omniscient being. By default, he's going to have a lot more insight into ea and every situation than we mere mortals can have. You're jumping to the assumption that just because a human may kill wantonly, that if God does it, it's 'wantonly' as well.\n \n \nAs fondit said, the question you're raising is one of responsibility and knowledge, not of basic moral codes.\n\n \n I don't read Foundit's posts as he's on my ignore list. But by making the assumptions you are, you're like the child who assumes the parent doesn't have any real reason to euthanize the dog, when in fact the parent knows far more about the situation and any related implications than the child does.", 
   {}, 
   321646, 
   null, 
   1219938360.0
  ], 
  [
   321666, 
   null, 
   "unkerpaulie", 
   "Is dropping trash on the ground good or evil? From a human point of view, it's evil (at least it isn't good). But from the point of view of the ants that will feast on the garbage, it's good. If God is so much a higher being that we can't comprehend his morality, then using His definitions is pointless; we can only describe him using terms that make sense to us. Those terms aren't binding. The fact that we think God is good or evil doesn't make him any different in terms that would apply to him, any more than the ants thinking the mana from \"heaven\" was good would actually make littering ok.\n \n\n This is actually a good analogy that makes the point jyoshu is making. Who are ants to judge us for vacuuming our carpets and spraying our pesticide around our houses? How could they understand the development of our environmentally responsible industrial policies that ensure the survival of ants on a global scale? From their tiny perspectives we may seem evil to them, but that doesn't make us wrong or bad by our standards. \n \n The major difference in this scenario is that we don't owe ants benevolent favor. Quite frankly we don't care specifically about the welfare of insects in our daily operations. On the other hand, God is assumed to be benevolent to humans, so his actions towards us must align with this assumption. If God acts in a way that is evil to us, then he is not benevolent. \n \n \nI don't think I said that. I certainly believe that we have the ability to discern good from evil, at least in terms that make sense to us mere mortals, but I don't think I ever attributted that skill to Adam and the fruit.\n\n Actually I think it was foundit's point. My bad", 
   {}, 
   321631, 
   null, 
   1219938540.0
  ], 
  [
   321671, 
   null, 
   "GazzaElliott", 
   "But that's just it--it's quite a tall assumption to make that God does his killing wantonly. Particularly since we're talking about GOD here--the omniscient being. By default, he's going to have a lot more insight into ea and every situation than we mere mortals can have. You're jumping to the assumption that just because a human may kill wantonly, that if God does it, it's 'wantonly' as well.\n\n \n Ah, so we should accept whatever God does because he know more? AS I say, that's just an atttempt at rationalization. If God smites an entire nation, how can that not be considered wanton? Why does God get a free pass to commit unspeakable acts? It's the same mindset that agreed to the Iraq war, because the governement must know more than we do. The point here is that God has created a moral code, and blatantly doesn't follow it. Why is he not expected to follow his own code?\n \n \nI don't read Foundit's posts as he's on my ignore list.\n\n \n I don't get this whole ignore thing. I don't particularly like some posters on here, but they still have things to contribute. Seems that the ignore thing is merely a way of shutting out things you don't want to listen to. (That's a universal comment btw.)\n \n \nBut by making the assumptions you are, you're like the child who assumes the parent doesn't have any real reason to euthanize the dog, when in fact the parent knows far more about the situation and any related implications than the child does. \n\n \n I'm not making assumptions. I'm asking a question that I want a proper answer to. Why is God not following the moral code he's set for everyone? Your answer thus far boils down to 'He moves in mysterious ways', which is a non-answer. \n \n As you didn't read what foundit said, I'll repost it here: \n \n \nWhile God may \"set the rules for morality\", does that mean man should be oblivious to them? A drone to only wait to be told by the \"God\" figure whether an action is good or evil?\n \n God said that man ate from the tree of the knowledge of good and evil.\n That's from YOUR bible.\n Man HAS that knowledge.\n Yet here you are bending over backwards to find excuses to ignore your God's plans and actions which are clearly evil.\n \n And it's not a \"discussion\" at all. You just create a scenario whereby you can apologetically proclaim \"we don't know\", and then you essentially leave it at that.\n There is no room for \"discussion\" there.\n You've already shown that for some odd reason, you think that disagreeing with your \"analysis\" somehow means that God doesn't exist, so that's a pretty limited \"discussion\" range.\n\n \n And I agree with what he says. You're basically excusing God's actions based on the concept that he knows more than you. The point is that to expect people to follow a code you create you must follow it yourself.Why does God not do this?\n \n \n In response to your comment about morals not existing above God\n \n \nWhy the heck not?\n Where does this line of thinking come from?\n Suppose we have an all powerful God who created the universe.\n And oh yeah. He has negative traits as well as good ones.\n Sometimes he gets cranky and impatient. He admits he is a \"jealous\" God.\n \n Does that mean that God isn't \"all powerful\"? Nope.\n Could that god also be omniscient and still not be perfectly good? Yup!\n \n The fact that God does some pretty nasty stuff doesn't preclude him from being capable of being a God.\n The truth is that it reduces the believability of your story that he is a \"good\" god, always \"loving\" and only doing the \"right thing\".\n But that's it.\n That's all.\n \n He could still obviously be the \"god\"...\n All we're doing is talking about how to DESCRIBE him, and you seem to think (without being able to really question it otherwise the \"existence\" of \"god\" supposedly self-destructs) that he HAS to be only \"good\", when the truth is that is YOUR requirement based on your beliefs.\n Not a real requirement that precludes his existence if not true.\n\n \n Which is basically what I said...", 
   {}, 
   321665, 
   null, 
   1219941120.0
  ], 
  [
   321674, 
   null, 
   "foundit66", 
   "But that's just it--it's quite a tall assumption to make that God does his killing wantonly.\n\n What other conclusion is there, beyond \"I think I'll believe in the thing that's not on the menu\"...\n He's omniscient and omnipotent.\n He sets up a situation where people who don't believe in him go to hell, tortured for all eternity.\n \n Are you telling me that you honestly can't comprehend that an omniscient and omnipotent God couldn't come up with an alternative other than torturing unbelievers for eternity???\n \n \n \nI don't read Foundit's posts as he's on my ignore list. But by making the assumptions you are, you're like the child who assumes the parent doesn't have any real reason to euthanize the dog, when in fact the parent knows far more about the situation and any related implications than the child does.\n\n This claim is blatantly false.\n God SAID that humans have knowledge of good and evil. Period.\n God SAID we have that knowledge.\n Yet you want to ignore that knowledge.\n \n You talk about us wanting to \"assume\", but it's YOU who is doing the assuming.\n We are working off the facts at hand. That's not an assumption.\n YOU are the one who is relying on things that you want to BELIEVE in, ignoring the facts at hand. THAT is an assumption.", 
   {}, 
   321665, 
   null, 
   1219942740.0
  ], 
  [
   321676, 
   null, 
   "foundit66", 
   "I don't get this whole ignore thing. I don't particularly like some posters on here, but they still have things to contribute. Seems that the ignore thing is merely a way of shutting out things you don't want to listen to. (That's a universal comment btw.)\n\n You hit the nail on the head.\n In another area, Jyoshu put forth the statement that he felt I should be banned.\n \n He's made a point of sticking his hands over his ears when it comes to me and yelling \"Nyah, nyah, nyah, I can't hear you\"\n \n There is another poster (Steeeeve) who pops onto threads with the SOLE PURPOSE of insulting me and encouraging people not to talk to me, while he ignores the topic that is being discussed.\n \n It's all rather juvenile, and they act worse than what they actually accuse me of... emoticon_frazzled", 
   {}, 
   321674, 
   null, 
   1219942980.0
  ], 
  [
   321678, 
   null, 
   "Archangel", 
   "No, we can't make that assumption, because Kronus did provide evidence in support of what he claimed.\n\n \n Again you maintain a lie that is not only inaccurate but deceptive in that you're saying I said something in the course of this debate when I was responding to kronus's original accusation. So LIAR, I was clarifying what I meant in prior posts, not boasting about me going to heaven or being worthy of it at all. And I will prove you're perpetuating a lie in my response to kronus below. Beside LIAR, you made this very clear assertion in response to kronus's slanderous lie: [tq] You heard him Kronus. Archie wants a list of almost every single post he's ever made, with links. Get to it!\n \n So kronus, er, I mean tq, you lying hypocrite, if I have done as you say in almost every single post I've ever made, why haven't you posted just ONE, or better still FIVE in order to prove your point? If you're not lying, they why are you trying to rely on a statement I made on this thread that doesn't even say what I was accused of doing on most every post I have written? \n \n \nYou're trully desperate, aren't you? I will repeat, one last time, that I bolded your typical claim in the very post where you claim never to make such claims. I can't believe how desperately you're trying to cling to the fiction that you've built for yourself! At least have the integrity to stand on your own two feet, and stop trying to rope others into \"supporting\" you. emoticon_xdonno\n\n \n I'm not desperate at all liar. The two guys lying and attempting to maintain their childish and slanderous lie is who's desperate. And here's the evidence of how hypocritical and dishonest both you and tq are to continue this weak claim that I have proven your point on this very thread. Your original accusation is here: [kronus:] You never miss a chance to tell everyone that you're going to heaven and they aren't: Your specific claim is that I always tell people that I'm going to heaven and they're NOT. That is your slanderous lie about me in a nutshell. Now here is my statement from this thread that both you and tq insists supports your original accusation.\n [Archangel] So this is me boasting that I'm going to heaven and you're not? I quote my own statement from the link you posted and bolded: I promised you mockers and scoffers that the day will come when you will learn the truth about how wrong you are to reject the living God. How is that in any way boasting that I am going to heaven or pridefully saying I am worthy of heaven? Beside that, haven't I said a hundred times at least, that when we all die, we will immediately understand the truth about God and His eternal nature, love, sacrifice for us and His power? So that is what I meant when I say at the end of this journey you will know the truth. It is in no way condemning you to hell, and especially, it is NEVER me boasting that I'm going to heaven but you're not.\n Here's the link to the original post in question where YOU claim I am boasting that I will go to heaven while you wont. http://www.4forums.com/political/showpost.php?p=321446&postcount=66 So tell me liar, how is me warning you godless, atheist scoffers of all that is good and holy, that at the end of this life we will all learn the truth about what exists in eternity, boasting in any way that I am going to heaven and you're not? \n \n And the simple question still begs to be asked, if as you say that I never miss the chance to tell everyone that I'm going to heaven and they aren't. Then why haven't you simply picked one, or better still, FIVE of the numerous posts that you claim I did it on in order to make your point and shut me up? Rather than relying on a statement I made on this thread in the course of challenging you to prove your slanderous accusation, that doesn't make the claim you say it does at all as I've PROVEN by quoting the statements in question, and posting your own link that proves that you were lying then about what I said, and are still lying about, NOW? \n \n As long as you and tq attempt to defend your slanderous lie kronus, I will continue to point it out with this evidence that proves THAT YOU'RE BOTH LYING. The next move is yours hypocrites, I mean kronus and tq. But don't think that the truth of what I have posted regarding your slanderous lie about me isn't obvious to everyone reading this evidence, which unlike your salacious accusation, is true, because your own words condemn both you and tq.", 
   {}, 
   321622, 
   null, 
   1219944180.0
  ], 
  [
   321679, 
   null, 
   "jyoshu", 
   "Ah, so we should accept whatever God does because he know more? AS I say, that's just an atttempt at rationalization. If God smites an entire nation, how can that not be considered wanton? Why does God get a free pass to commit unspeakable acts?\n\n \n Well, again, because it's GOD we're talking about here, those actions have to be considered in light of said God's omniscience. (or at least they should, if we're really talking about GOD here (with a capital 'G'). I don't see how you can reconcile the idea of 'GOD' without that being a factor. If what we're calling 'GOD' doesn't have an omniscient perspective, he's not really God, then.\n \n \nI don't get this whole ignore thing. I don't particularly like some posters on here, but they still have things to contribute. Seems that the ignore thing is merely a way of shutting out things you don't want to listen to. (That's a universal comment btw.)\n\n \n I used to feel the same way, but there are some posters here for which belligerence seems more important than contribution, and frankly, it's just not worth my time. I figure for posters that I'm going to scroll on past anyway, I might as well just add them to the list so it's less scrolling. Believe me, I don't use the ignore list lightly. It takes a LOT to get on my ignore list. But there's just no reason to accommodate consistent incivility.\n \n \nWhy is God not following the moral code he's set for everyone? Your answer thus far boils down to 'He moves in mysterious ways', which is a non-answer.\n\n \n Why isn't that an answer? It's a moral code for people to follow. He's God and can do what he wants. But given that he's all-knowing (since we're talking about GOD, after all), it seems reasonable to at least consider that he has reasons our relatively limited perspective makes us privy to. I see no reason why that's a \"non-answer.\" It just isn't the answer you're wanting. However, even if that's not the reason for his actions, if He's truly GOD, does it really matter? It's not like it's going to hurt GOD or take away from Him if you choose not to be a follower. He's no worse off without you. It's not like your mental judgments on God--even condemnations--would effect him unless he chooses it them to.", 
   {}, 
   321671, 
   null, 
   1219944420.0
  ], 
  [
   321683, 
   null, 
   "Iuris", 
   "Sorry to disappoint, Archie, but Lawyer, not attorney. That's one HUUUUGE exam further up, which also is a prerequisite for judges, prosecutors and notaries, and it's an exam that's really weighting me down. Lore has it you need to study for 6 months for it. I'm currently doing the apprenticeship that is the prerequisite for attempting it. (BTW, I AM a graduate from a law school, this is an upgrade, a state test every lawyer that wants to do certain jobs has to pass)\n \n Anyway, on topic.\n \n -Talking of slander on this board is a bit difficult. It's a message board intended for discussions of hot topics. We are warned to expect heated discussion. While one may take offense, drawing real life consequences, like slander or insult would not fit in with the concept of the board. On the board, you are under \"volenti non fit iniuria\".\n \n -I don't think that you have ever directly said \"I'm going to heaven\". You show a certain \"humility\" in front of your god, and that prevents you from making such a statement. Accusing you of making that specific claim would require some proof. The \"You'll burn in hell\" is a bit different, given I actually found a quote. The quote I provided above is perhaps more lighthearted, however, I feel some quite strong statements have been made in topics that hit closer to your core (homosexuality and satanism).\n \n -However, your detractors have already shown that they don't really accuse you of a direct statement, but of statements implying this.\n \n Now, what you imply is a lot more than what you say. I have seen you profess belief that you do know how to go to heaven and that those who do not are condemned to hell. In your posts, you consistently imply both.\n \n Of course, I could also ask: do you deny those two beliefs.\n \n -Lastly, I don't like these accusations from both ends. It's all just \"Did not! Did too!\" childishness. Just... drop it. It gets us nowhere, get back on topic.\n \n \n \n On the topic:\n -some religions espouse the belief that only strict adherence to their dogma allows salvation. Those would have me, my father, my mother, my grandfather and a host of good people suffer eternally. If those religions are true, or rather, if ONE of them is true, then I'm having trouble seeing that god as good. People would only submit out of fear. I would expect those with a stronger will than mine to actively search for any weakness of such a god, that they might overthrow him. I would also question the goodness of those who are content with such a god at heart.\n \n -some religions allow a golden rule. One may lead a good life without being of the religion and yet not be damned. Those religions, I'd at least call acceptable. The god is not psychotic.\n \n -of course, there are no actualy indications that any religion is true. Which is both calming and depressing. No heaven, no hell, just the end.", 
   {}, 
   321679, 
   null, 
   1219948200.0
  ], 
  [
   321686, 
   null, 
   "Archangel", 
   "Sorry to disappoint, Archie,\n Anyway, on topic.\n \n -Talking of slander on this board is a bit difficult. It's a message board intended for discussions of hot topics. We are warned to expect heated discussion. While one may take offense, drawing real life consequences, like slander or insult would not fit in with the concept of the board. On the board, you are under \"volenti non fit iniuria\".\n \n -I don't think that you have ever directly said \"I'm going to heaven\". You show a certain \"humility\" in front of your god, and that prevents you from making such a statement. Accusing you of making that specific claim would require some proof. The \"You'll burn in hell\" is a bit different, given I actually found a quote. The quote I provided above is perhaps more lighthearted, however, I feel some quite strong statements have been made in topics that hit closer to your core (homosexuality and satanism).\n \n -However, your detractors have already shown that they don't really accuse you of a direct statement, but of statements implying this.\n YES THEY DO ACCUSE ME OF A DIRECT STATEMENT! AND THEY IMPLIED I DO IT IN MOST EVERY POST I WRITE.\n Now, what you imply is a lot more than what you say. I have seen you profess belief that you do know how to go to heaven and that those who do not are condemned to hell. In your posts, you consistently imply both.\n \n Of course, I could also ask: do you deny those two beliefs.\n \n -Lastly, I don't like these accusations from both ends. It's all just \"Did not! Did too!\" childishness. Just... drop it. It gets us nowhere, get back on topic.\n ALL YOU NEED DO IS READ THE LINK BELOW AND IT IS CLEAR REGARDING THE ACCUSATION AND THEIR INABILITY TO SUPPORT IT. STOP BEING DISINGENUOUS. \n On the topic:\n -some religions espouse the belief that only strict adherence to their dogma allows salvation. Those would have me, my father, my mother, my grandfather and a host of good people suffer eternally. If those religions are true, or rather, if ONE of them is true, then I'm having trouble seeing that god as good. People would only submit out of fear. I would expect those with a stronger will than mine to actively search for any weakness of such a god, that they might overthrow him. I would also question the goodness of those who are content with such a god at heart.\n \n -some religions allow a golden rule. One may lead a good life without being of the religion and yet not be damned. Those religions, I'd at least call acceptable. The god is not psychotic.\n \n -of course, there are no actualy indications that any religion is true. Which is both calming and depressing. No heaven, no hell, just the end.\n\n \n Look, Iruis, cut out the convoluted legalese. These liars accused me very clearly of making very specific claims on most every post I have ever written here, and then can't find one post where I have said what they are accusing me of having said. And that is that I'm going to heaven and they aren't in a boastful and prideful manner. So stop playing lawyer and attempting to justify OR EXCUSE their lies. Either they can support their very clear accusations that I have boasted pridefully that I am good enough to go to heaven while they are NOT, or they can't. If they can't then they have slandered me as they both implied that I have done it consistently as a member here. So with 5500+ posts under my belt, it should be easy to support their contentions if they are true. My post above stands, as written: http://www.4forums.com/political/showpost.php?p=321678&postcount=126", 
   {}, 
   321683, 
   null, 
   1219949820.0
  ], 
  [
   321687, 
   null, 
   "foundit66", 
   "Well, again, because it's GOD we're talking about here, those actions have to be considered in light of said God's omniscience. (or at least they should, if we're really talking about GOD here (with a capital 'G'). I don't see how you can reconcile the idea of 'GOD' without that being a factor. If what we're calling 'GOD' doesn't have an omniscient perspective, he's not really God, then.\n\n I think you're missing the point.\n \n Suppose you have a situation on magical ethics. The situation is described, but you don't have the background in \"magic\" or \"magical ethics\" to really establish a \"right or wrong\".\n If you lack the knowledge to make a conclusion, you CANNOT MAKE a conclusion. Pure and simple.\n \n But with YOUR approach, you take situations on \"magical ethics\" whereby it looks GOOD and automatically conclude \"God is good!\".\n If there are other situations on \"magical ethics\" whereby it looks BAD, you automatically claim \"we don't have enough information\".\n It's a two-faced approach to reach the conclusion you ALREADY HAD.\n \n What you are doing is JUST AS VALID as another person assuming God is evil, and if something \"good\" happens then it must be something we \"just don't know enough about cause it's God\".\n And if something evil happens, then that person presumes it proof that God is evil...\n \n A REAL approach, that is even-handed, is to openly state \"I don't have enough information to make ANY conclusion about the nature of God, cause I don't have the *God perspective* of the situation.\" whether the evidence is good or bad.\n \n \n \nI used to feel the same way, but there are some posters here for which belligerence seems more important than contribution, and frankly, it's just not worth my time. I figure for posters that I'm going to scroll on past anyway, I might as well just add them to the list so it's less scrolling. Believe me, I don't use the ignore list lightly. It takes a LOT to get on my ignore list. But there's just no reason to accommodate consistent incivility.\n\n Jyoshu, other posters can judge for themselves.\n I can link them to our last encounter where you claimed \"incivility\" based on the fact that you didn't like me talking about your POST COUNT.\n The truth of the matter, which other posters can judge for themselves, is that you DO use the \"ignore\" feature out of convenience.\n It has nothing to do with \"civility\" or \"beligerence\".\n \n And the funny part of it is that the REAL PROOF of my statements is in YOUR INTERACTION with OTHER PEOPLE who are on YOUR SIDE that are \"beligerent\".\n Steeeeve has made a habitual point of jumping onto threads for the EXCLUSIVE purpose of attacking me.\n You actually stuck up for me (eventually), but then you RESCINDED that.\n If you were really interested in \"civility\", you would tell Steeeeve to knock off the attacks BECAUSE THEY ARE ATTACKS, instead of trying to tell him that you simply disagree with the CONTENT of the attacks...\n And then you turn around (later) and AGREE with the CONTENT of the ATTACKS...\n \n Steeeeve's attacks are PURE ad hominem, with no attempt to discuss the topic.\n And you join in with him in his attacks.\n And you complain about my \"civility\"?\n \n It's funny how the people who \"agree\" with you are the people like \"Steeeeve\", \"Archie\", and Ethmi...\n The people who have SERIOUS problems with the concept of civility...\n \n \n \nWhy isn't that an answer? It's a moral code for people to follow. He's God and can do what he wants.\n\n Quite frankly, if you TRULY hold that position, then you can NEVER claim \"God is good\".\n You can NEVER claim that he has our best interests at heart.\n Cause to do so, you have to use a MORAL CODE to come to a positive moral conclusion.\n \n Again, it's a double-standard...\n \n \n \nHowever, even if that's not the reason for his actions, if He's truly GOD, does it really matter? It's not like it's going to hurt GOD or take away from Him if you choose not to be a follower. He's no worse off without you. It's not like your mental judgments on God--even condemnations--would effect him unless he chooses it them to.\n\n ????\n I really don't see anybody as even hinting at what you're talking about...\n Nobody is trying to bring forth an argument that our \"mental judgments\" will harm God.\n \n And furthermore, we're back to the double-standard.\n You're complaining about others making negative comments about God for reasons that you IGNORE when you have positive beliefs on God.\n If you truly believed what you say, and it's not just an excuse to allow you to ignore the bad, you would apply it EVEN-HANDEDLY and come away with NO moral opinion on God.\n But that's not what you do, is it....", 
   {}, 
   321679, 
   null, 
   1219951260.0
  ], 
  [
   321693, 
   null, 
   "unkerpaulie", 
   "Well, again, because it's GOD we're talking about here, those actions have to be considered in light of said God's omniscience. (or at least they should, if we're really talking about GOD here (with a capital 'G'). I don't see how you can reconcile the idea of 'GOD' without that being a factor. If what we're calling 'GOD' doesn't have an omniscient perspective, he's not really God, then.\n \n \n Why isn't that an answer? It's a moral code for people to follow. He's God and can do what he wants. But given that he's all-knowing (since we're talking about GOD, after all), it seems reasonable to at least consider that he has reasons our relatively limited perspective makes us privy to. I see no reason why that's a \"non-answer.\" It just isn't the answer you're wanting. However, even if that's not the reason for his actions, if He's truly GOD, does it really matter? It's not like it's going to hurt GOD or take away from Him if you choose not to be a follower. He's no worse off without you. It's not like your mental judgments on God--even condemnations--would effect him unless he chooses it them to.\n\n We start off with the assumption that God is both benevolent and omniscient. So you say that his actions, no matter how henious they may seem to us, are ultimately for our good. But where do we draw the line? God doesn't get to say he loves us in words and contradict those statements with his actions. That would make God a liar, which would make him not God by definition. So the issue is whether the actions God take are those of a loving God. We could look at genesis, both in the way he dealt with adam and with the people in noah's time. Were those what we would call actions of a loving God? Did they ultimately bring a greater good to mankind? Do the actions that never bring about any greater good ultimately get swept under the rug and shrugged off as something we never understood the ultimate purpose of? Can something really be for our good if we are never allowed to get the benefit of it?\n \n We could also argue that any action, whether of God or of me and you, are ultimately for some good purpose. A serial rapist's actions may bring about some ultimate good to mankind far above what we could ever comprehend, but since we don't understand the long term beneficial plan of the rapist, does that mean that we get to judge his actions as malicious? How could we?\n \n At the end of your post you say that even if there really isn't any long-term beneficial plan, and even if the motive behind God's actions are truly malicious, since he's God and is omnipotent, he reserves the right to do what he wants without having his actions or intentions questioned. That may be so, but it shatters the starting assumption that God is benevolent. It just tells us that God is selfish and inconsiderate, or simply that God hates us.", 
   {}, 
   321679, 
   null, 
   1219954860.0
  ], 
  [
   321694, 
   null, 
   "Kronus", 
   " On the topic:\n -some religions espouse the belief that only strict adherence to their dogma allows salvation. Those would have me, my father, my mother, my grandfather and a host of good people suffer eternally. If those religions are true, or rather, if ONE of them is true, then I'm having trouble seeing that god as good. People would only submit out of fear. I would expect those with a stronger will than mine to actively search for any weakness of such a god, that they might overthrow him. I would also question the goodness of those who are content with such a god at heart.\n\n Right there with you on that analysis.\n \n \n\n -of course, there are no actualy indications that any religion is true. Which is both calming and depressing. No heaven, no hell, just the end. \n\n I would say this point supports your first point even more strongly. Having the practice of the \"one true religion\" be the only way to heaven would be bad enough. But there is no indication of which religion, if any, is \"right\". Forcing people to jump through hoops to prevent eternal damnation is bad enough, but failing to give clear guidance as to which, if any, hoop is the right one? There is simply no way a good or just God could set things up that way.", 
   {}, 
   321683, 
   null, 
   1219955460.0
  ], 
  [
   321697, 
   null, 
   "jyoshu", 
   "We start off with the assumption that God is both benevolent and omniscient. So you say that his actions, no matter how henious they may seem to us, are ultimately for our good.\n \n At the end of your post you say that even if there really isn't any long-term beneficial plan, and even if the motive behind God's actions are truly malicious, since he's God and is omnipotent, he reserves the right to do what he wants without having his actions or intentions questioned. That may be so, but it shatters the starting assumption that God is benevolent. It just tells us that God is selfish and inconsiderate, or simply that God hates us.\n\n \n For our good? God being benevolent or selfish? I said he has his reasons. It seems to me that when one starts speaking of things at the level of GOD, then the concepts of good and evil no longer apply except that which He himself sets up for us. Otherwise God is being expected to abide by a standard outside himself which violates the whole Godhood thing to begin with.", 
   {}, 
   321693, 
   null, 
   1219958160.0
  ], 
  [
   321698, 
   null, 
   "jyoshu", 
   "I would expect those with a stronger will than mine to actively search for any weakness of such a god, that they might overthrow him.\n\n \n How does someone 'overthrow' God???", 
   {}, 
   321683, 
   null, 
   1219958280.0
  ], 
  [
   321702, 
   null, 
   "Kronus", 
   "For our good? God being benevolent or selfish? I said he has his reasons. It seems to me that when one starts speaking of things at the level of GOD, then the concepts of good and evil no longer apply except that which He himself sets up for us. Otherwise God is being expected to abide by a standard outside himself which violates the whole Godhood thing to begin with.\n\n \n Obviously God doesn't have to abide by human standards of good or evil, but IF by human standards God could only be described as evil THEN people shouldn't be following him, right? I emphasize the logical constuction there to highlight the fact that I'm not making any assertions about the nature of God at this point, I'm just pointing out that human perceptions of God's morality do have a relevance to the discussion. Even if our moral judgements of God don't matter to him, they still matter to us.", 
   {}, 
   321697, 
   null, 
   1219961520.0
  ], 
  [
   321704, 
   null, 
   "Archangel", 
   "Obviously God doesn't have to abide by human standards of good or evil, but IF by human standards God could \"only\" be described as evil THEN people shouldn't be following him, right? I emphasize the logical constuction there to highlight the fact that I'm not making any assertions about the nature of God at this point, I'm just pointing out that human perceptions of God's morality do have a relevance to the discussion. Even if our moral judgements of God don't matter to him, they still matter to us.\n\n \n But it is in no way true or accurate at all to say that by human standards God could ONLY be described as evil. That would imply that every human being alive believes such drivel and that is in no way close to being true. You needn't make a personal assertion in order to forward a false perception that has no basis in fact at all. What is factual is that most people on Earth of whatever religious beliefs believe that God is good while satan is the sole promoter of evil.", 
   {}, 
   321702, 
   null, 
   1219963140.0
  ], 
  [
   321706, 
   null, 
   "Kronus", 
   "But it is in no way true or accurate at all to say that by human standards God could ONLY be described as evil. \n\n And thus the caveat that I went to specific efforts to highlight. But at least you're trying to make a real contribution to the discussion.", 
   {}, 
   321704, 
   null, 
   1219966500.0
  ], 
  [
   321714, 
   null, 
   "foundit66", 
   "But it is in no way true or accurate at all to say that by human standards God could ONLY be described as evil.\n\n It's funny you say that, cause Christianity presumes to claim that it is \"true and accurate\" that God can ONLY be described as good.\n Do you want me to quote you bible passages?\n \n \n \nThat would imply that every human being alive believes such drivel and that is in no way close to being true. You needn't make a personal assertion in order to forward a false perception that has no basis in fact at all. What is factual is that most people on Earth of whatever religious beliefs believe that God is good while satan is the sole promoter of evil.\n\n Quite frankly, I see this as a flaw in the mythology cause it helps promote an ideal extrapolation onto humans.\n \"Believers\" start to classify people who do NOT believe in similar absolutes.\n Like you for example, categorizing people who don't agree with you as \"hating the truth\".\n Such attempts to polarize are inane and pointless.\n \n But nevertheless, some people revel in such separation and alienation ...", 
   {}, 
   321704, 
   null, 
   1219970400.0
  ], 
  [
   321720, 
   null, 
   "Archangel", 
   "It's funny you say that, cause Christianity presumes to claim that it is \"true and accurate\" that God can ONLY be described as good.\n Do you want me to quote you bible passages?\n\n \n No need to, because He is the definition of all that is good.\n \n \nQuite frankly, I see this as a flaw in the mythology cause it helps promote an ideal extrapolation onto humans.\n \"Believers\" start to classify people who do NOT believe in similar absolutes.\n Like you for example, categorizing people who don't agree with you as \"hating the truth\".\n Such attempts to polarize are inane and pointless.\n \n But nevertheless, some people revel in such separation and alienation ...\n\n \n You lost me when you used the word mythology in reference to christianity, and you also proved that discussing anything spiritual with you is a waste of time as you have no concept of its truths.", 
   {}, 
   321714, 
   null, 
   1219973040.0
  ], 
  [
   321722, 
   null, 
   "GazzaElliott", 
   "Well, again, because it's GOD we're talking about here, those actions have to be considered in light of said God's omniscience. (or at least they should, if we're really talking about GOD here (with a capital 'G'). I don't see how you can reconcile the idea of 'GOD' without that being a factor. If what we're calling 'GOD' doesn't have an omniscient perspective, he's not really God, then. \n\n And you're still avoiding giving an answer, or you are seriously saying that everything God does is beneficial in the long run? As to the omniscient bit, one can be omniscient and petty. You can know everything that could/will happen, and still be vindictive and petty. The two are far from mutually exclusive.\n \n I used to feel the same way, but there are some posters here for which belligerence seems more important than contribution, and frankly, it's just not worth my time. I figure for posters that I'm going to scroll on past anyway, I might as well just add them to the list so it's less scrolling. Believe me, I don't use the ignore list lightly. It takes a LOT to get on my ignore list. But there's just no reason to accommodate consistent incivility.\n\n However it means you miss their contribution, which may be interesting, and it means that lots of these posts end up being almost repeats. I must admit, I posted on the thread where you finally blocked him, and I never understood why you went so nuts about the whole post count thing. It's your business however. I'd say foundit's posts on this issue have been interesting and not insulting, but there you go.\n \nWhy isn't that an answer? It's a moral code for people to follow. He's God and can do what he wants. \n\n So he's a do as I say sort of entity? Do you not follow the idea that to establish the authority of a morality it has to be followed by those at the top, regardless of their amount of power? There's a word for a system where the people at the bottom follow a code of decent morality, while those at the top don't. That word is corrupt.\n \n But given that he's all-knowing (since we're talking about GOD, after all), it seems reasonable to at least consider that he has reasons our relatively limited perspective makes us privy to. I see no reason why that's a \"non-answer.\" It just isn't the answer you're wanting. \n\n No, it's avoiding the question. You're answering my question by saying we can't know the answer and it's not worth trying because God knows more than us. That's not an answer; it's a reason to avoid further analysis. The events related in the bible don't illustrate that God is benevolent to humanity over the long term, even with his infinite knowledge, yet you're attributing benevolent motivations because you believe God to be benevolent.\n \n However, even if that's not the reason for his actions, if He's truly GOD, does it really matter? \n\n It does when his followers try to justify their actions based on the morality of an immoral being.\n \n It's not like it's going to hurt GOD or take away from Him if you choose not to be a follower. He's no worse off without you. It's not like your mental judgments on God--even condemnations--would effect him unless he chooses it them to. \n\n If that's the case then why does he get so bent out of shape if people don't accept him?", 
   {
    "unicode_changes_made": true
   }, 
   321698, 
   null, 
   1219974000.0
  ], 
  [
   321732, 
   null, 
   "jyoshu", 
   "And you&#8217;re still avoiding giving an answer, or you are seriously saying that everything God does is beneficial in the long run?\n\n \n *I* think that's his reasons, but I certainly understand there's no way to know that until 'the long run' plays out. And since there's not a darn thing we mere mortals could do if it turns out he *is* malevolent and evil, then it seems like a moot point to me.\n \n \nHowever it means you miss their contribution, which may be interesting, and it means that lots of these posts end up being almost repeats. I must admit, I posted on the thread where you finally blocked him, and I never understood why you went so nuts about the whole post count thing.\n\n \n I'm not interested in debating about a particular poster. Suffice it to say the ignore-list decision was certainly not based on just one thread.\n \n \nSo he&#8217;s a do as I say sort of entity? Do you not follow the idea that to establish the authority of a morality it has to be followed by those at the top, regardless of their amount of power? There&#8217;s a word for a system where the people at the bottom follow a code of decent morality, while those at the top don&#8217;t. That word is corrupt.\n\n \n But that's just it--if he's God, he doesn't need to 'establish' any authority. He has it by default. His godhood is secure no matter if the mere mortals follow him or not. The sort of analogy where human leaders such as government officials, presidents, or kings DO lead by example (because they DO have to do that in order to secure authority) completely breaks down in such a case as this where we're talking about GOD and mere mortals who cannot possibly effect God. Look, if it helps you to think of God in such terms as you would a human leader, that's up to you. To me, that throws out the whole GODhood thing, so I think we're again back to different starting assumptions. (Though I'm not sure you really realize it.) We're not talking about a king that needs to pitch bread to the masses here. His Godhood is secure, regardless. So if he DOES pitch bread to the masses, it's all the more indicative that he doesn't have self-serving reasons for doing so.\n \n \nThe events related in the bible don&#8217;t illustrate that God is benevolent to humanity over the long term, even with his infinite knowledge, yet you&#8217;re attributing benevolent motivations because you believe God to be benevolent.\n\n \n No, what I'm really saying here is that the concepts of benevolence and malevolence as you're using them can't really be attributed when you're talking about something on the order of what we're talking about<b></b>: GOD. Because you're completely ignoring the 1000 lb elephant of said GOD's omniscience. You're making a judgment ignoring what could very well be the most important factor of all, and therefore it's actually you who is avoiding something here because you don't want to possibly attribute benevolence to the Judeo-Christian God.\n \n Plus, I think your comments here are an over-simplification in light of theology. In my opinion someone can look at the same scriptures and come away with different conclusions than you are when taking them as a whole--indeed that's exactly WHY some believe God is good as opposed to evil. Those scriptures indicate that God has offered a way to AVOID the eternal consequences for evil: not exactly something an evil and malevolent God would do.\n \n \nIf that&#8217;s the case then why does he get so bent out of shape if people don&#8217;t accept him?\n\n \n I don't really think he does. Where in the scriptural texts of the Judeo-Christian God does he get all bend out of shape over people not accepting him? But I find it interesting that you ask that question; if he gets bent out of shape that someone won't accept him, then that would indicate (to some extent at least) he DOES want our acceptance, and therefore does care about us. Doesn't exactly fit your idea of the malevolent vindictive God.", 
   {}, 
   321722, 
   null, 
   1219981320.0
  ], 
  [
   321735, 
   null, 
   "Archangel", 
   " you are seriously saying that everything God does is beneficial in the long run? As to the omniscient bit, one can be omniscient and petty. You can know everything that could/will happen, and still be vindictive and petty. The two are far from mutually exclusive.\n\n \n I am seriously saying that everything God does is beneficial in the long run. And their is no doubt about that. God is incapable of doing evil, even if what he does appears to be evil from our perspective. Our ignorance and lack of an eternal perspective which He has is no excuse for us to start judging His morality or any decisions He makes regarding us or this World which He created. It is up to us to trust Him because He is God and He is worthy of our trust. And I, an American born Arab who was born a moslem, am telling you that the God I'm referring to is Called Yahweh, Adonai, El-Shadai and the Great I Am. Us being half brothers as sons of Abraham and all. It would be my hope that you would embrace that heritage through which salvation came into the world through. emoticon_xangel", 
   {}, 
   321732, 
   null, 
   1219983600.0
  ], 
  [
   321736, 
   null, 
   "Kronus", 
   "*I* think that's his reasons, but I certainly understand there's no way to know that until 'the long run' plays out. And since there's not a darn thing we mere mortals could do if it turns out he *is* malevolent and evil, then it seems like a moot point to me.\n \n\n \n Not true. If our considered analysis shows that God is evil, we can at the very least stop worshiping him, and more importantly stop saying that we should do \"such and such\" simply because God says to. God's being evil is not without consequence, it should influence what how we act, particularly amongst those who allow their action to be influenced by what they think God wants, and most definately should not be tossed off as being moot.", 
   {}, 
   321732, 
   null, 
   1219985700.0
  ], 
  [
   321737, 
   null, 
   "Kronus", 
   "I am seriously saying that everything God does is beneficial in the long run. And their is no doubt about that.\n\n Then feel free to be the first person in this thread to explain how relegating someone to an eternity of suffering for the mere act of being born is beneficial in the long run.\n \n Seriously though, you needn't bother, I know you can't actually do it. I'm simply using your post to emphasize my point. \"Eternal damnation\" and \"long term benefit\" are sufficiently contradictory phrases that I think any rational person can see the fault in your assertion.", 
   {}, 
   321735, 
   null, 
   1219986960.0
  ], 
  [
   321740, 
   null, 
   "smiley", 
   "I am seriously saying that everything God does is beneficial in the long run. And their is no doubt about that.\n\n \"Their(sic) is no doubt about that\"?????\n \n Have you not been taking in anything in this thread?\n \n There is a great deal of doubt about it. I realise that you don't doubt it, but I need not go there.\n \n \nGod is incapable of doing evil, even if what he does appears to be evil from our perspective.\n\n Surely an omnipotent being would be capable of anything. You can't be saying that he/she/it has limits to their powers. Can you?\n \n \nOur ignorance and lack of an eternal perspective which He has is no excuse for us to start judging His morality or any decisions He makes regarding us or this World which He created. It is up to us to trust Him because He is God and He is worthy of our trust. And I, an American born Arab who was born a moslem, am telling you that the God I'm referring to is Called Yahweh, Adonai, El-Shadai and the Great I Am. Us being half brothers as sons of Abraham and all. It would be my hope that you would embrace that heritage through which salvation came into the world through. emoticon_xangel\n\n This is where you are completely wrong. We are intelligent beings (okay maybe not up to omnipotent being standards). This is a talent that has been given to us (so you believe anyway). Remember the parable of the talents? It is absolutely wrong for us to waste this talent. We should ask questions, we should search for the truth, we should not say, 'oh, but let's not look for the truth in that particular direction just because some power-crazy theogarch told us we'd be in BIIIIG trouble if we did'.\n \n Whenever someone says (and that is how to spell it, Archie) they are doing something in the name of god, questions should be asked. Whenever a great evil is perpitrated either by god or in the name of god, questions should be asked.\n \n We should not just sit back and say, \"But it's okay, cause god did it and we are too stupid to understand his great purpose\". That is how XXXXXX like Bush get away with killing 100s of thousands of people without being locked up.\n \n We must ask questions, all the time, of anyone we feel is deserving of it.\n \n Smiley", 
   {}, 
   321735, 
   null, 
   1219988220.0
  ], 
  [
   321753, 
   null, 
   "Iuris", 
   "So stop playing lawyer and attempting to justify OR EXCUSE their lies.\n\n Archie... you do remember I was actually defending you, don't you? Not anyone else? Now hush, this is getting interesting...\n \n \nHow does someone 'overthrow' God???\n\n \n Good point. By the definitions of the O&O God, that's theoretically impossible. However, there is possibly one precedent that could point a way: Jesus. Possibly, God can be reasoned with and convinced to change his mind of his own will.\n \n While this would conflict with the idea of the omniscient God, an omniscient god has a bit of an issue regarding the crucifiction.\n \n Opinions?", 
   {}, 
   321740, 
   null, 
   1220022120.0
  ], 
  [
   321755, 
   null, 
   "jyoshu", 
   "Not true. If our considered analysis shows that God is evil, we can at the very least stop worshiping him, and more importantly stop saying that we should do \"such and such\" simply because God says to. God's being evil is not without consequence, it should influence what how we act, particularly amongst those who allow their action to be influenced by what they think God wants, and most definately should not be tossed off as being moot.\n\n \n Well sure, I don't anyone here is saying coming to such a view can't affect the actions of the person who comes to that view. You are free to reject or follow God, either way, but if it's truly GOD we're talking about, it's not going to affect him. Do you mean consequence in the sense of simple personal action as a result of coming to that view, or in the sense of consequences GOD faces for his actions? Because it's not like he's going to be any worse the wear for it if you don't obey what he says. To a being on the order of THE ALMIGHTY, that's no real 'consequence' at all. You use words like 'consequence' as if you're somehow punishing God for his actions (and maybe that's not what you mean). Frankly it's hard for me to think of any action that's truly a 'consequence' on a being that could pretty much wish you right out of existence if he really wanted to. Regardless, no one here is saying you can't decide not to follow God if that's what you prefer, for whatever reason. But for a being on the order of GOD, it wouldn't be any 'skin off his back', for sure.", 
   {}, 
   321736, 
   null, 
   1220023560.0
  ], 
  [
   321760, 
   null, 
   "Kronus", 
   "Well sure, I don't anyone here is saying coming to such a view can't affect the actions of the person who comes to that view. \n\n So you agree that how we percieve God isn't a moot point, at least from our point of view. Great, that's all I was trying to say.", 
   {}, 
   321755, 
   null, 
   1220025720.0
  ], 
  [
   321765, 
   null, 
   "Archangel", 
   "Then feel free to be the first person in this thread to explain how relegating someone to an eternity of suffering for the mere act of being born is beneficial in the long run.\n \n Seriously though, you needn't bother, I know you can't actually do it. I'm simply using your post to emphasize my point. \"Eternal damnation\" and \"long term benefit\" are sufficiently contradictory phrases that I think any rational person can see the fault in your assertion.\n\n \n Sure I can. First of all, Life is a gift that God gives each of us, not a curse to be hated or scoffed at as a bad thing. Secondly, Hell was never created for us at all. We, as free will agents will purposely and freely choose by our own volition to spend eternity apart from our loving Father who created us not only with free will, but so that we will freely choose to love and fellowship with Him in life. \n \n The bible clearly say's that Hell was created for the devil and his angels.\n Mat 25:41 \"Then He will also say to those on His left, 'Depart from Me, accursed ones, into the eternal fire which has been prepared for the devil and his angels;The relevant point is that you are attempting to blame God for everyone who ends up eternally separated from Him when in fact it is you who has the choice to spend eternity either with or apart from Him yourself. And you needn't do ONE thing even to earn your way into heaven.\n \n Do you know why that is? Because there is nothing \"ANY OF US\" can do on our own merits to be good enough to ever stand in a perfectly holy Gods presence. The only way to become worthy is to accept the redemptive work that Jesus accomplished on the Cross that bridges the gap between our fallen natures and Gods perfectly holy nature. In summation kronus, every human being who finds themselves in outer darkness will curse themselves, not God for being there. Because they will then see clearly all the times God reached out to them and got His message to them as the rejected Him in favor of self governing their earthy lives and their eternal existence.\n Rom 3:23 for all have sinned and fall short of the glory of God,\n Rom 3:24 being justified as a gift by His grace through the redemption which is in Christ Jesus;", 
   {}, 
   321737, 
   null, 
   1220030280.0
  ], 
  [
   321773, 
   null, 
   "jyoshu", 
   "So you agree that how we percieve God isn't a moot point, at least from our point of view\n\n \n to the extent that only the person perceiving is the one affected by it, sure.", 
   {}, 
   321760, 
   null, 
   1220039160.0
  ], 
  [
   321781, 
   null, 
   "unkerpaulie", 
   "For our good? God being benevolent or selfish? I said he has his reasons. It seems to me that when one starts speaking of things at the level of GOD, then the concepts of good and evil no longer apply except that which He himself sets up for us. Otherwise God is being expected to abide by a standard outside himself which violates the whole Godhood thing to begin with.\n\n Is God benevolent? Does God reserve the right to be malicious to humans?", 
   {}, 
   321697, 
   null, 
   1220043300.0
  ], 
  [
   321783, 
   null, 
   "unkerpaulie", 
   "*I* think that's his reasons, but I certainly understand there's no way to know that until 'the long run' plays out. And since there's not a darn thing we mere mortals could do if it turns out he *is* malevolent and evil, then it seems like a moot point to me.\n \n \n No, what I'm really saying here is that the concepts of benevolence and malevolence as you're using them can't really be attributed when you're talking about something on the order of what we're talking about<b></b>: GOD. Because you're completely ignoring the 1000 lb elephant of said GOD's omniscience. You're making a judgment ignoring what could very well be the most important factor of all, and therefore it's actually you who is avoiding something here because you don't want to possibly attribute benevolence to the Judeo-Christian God.\n \n Plus, I think your comments here are an over-simplification in light of theology. In my opinion someone can look at the same scriptures and come away with different conclusions than you are when taking them as a whole--indeed that's exactly WHY some believe God is good as opposed to evil. Those scriptures indicate that God has offered a way to AVOID the eternal consequences for evil: not exactly something an evil and malevolent God would do.\n\n So why would one desire to serve God if they do not believe that God is good? Do christians serve God out of fear of damnation rather than out of love? And if it is love, why and how could you love an omnipotent being that clearly doesn't reciprocate? Besides, doesn't the bible says repetitively and emphatically that God loves us? Were the bible writers all wrong about that? And finally, if God is truly malevolent or even indifferent to humans, what makes you think that the biblical method to obtaining salvation can be trusted? You could be all blindly following the recommendation of a twisted deity with a sick sense of humor just so he can watch you oppress each other in his name, which is exactly what religion does. And in the end he may very well still send you to hell, since he lied about salvation to begin with, which he reserves the right to do, being that he's God. \n \n \n \nI don't really think he does. Where in the scriptural texts of the Judeo-Christian God does he get all bend out of shape over people not accepting him? But I find it interesting that you ask that question; if he gets bent out of shape that someone won't accept him, then that would indicate (to some extent at least) he DOES want our acceptance, and therefore does care about us. Doesn't exactly fit your idea of the malevolent vindictive God.\n\n A spoilt child gets bent out of shape when his playmates won't let him win the game. It doesn't indicate that he cares about the other children or the game for that matter. Its just a lack of manners", 
   {}, 
   321732, 
   null, 
   1220044560.0
  ], 
  [
   321787, 
   null, 
   "jyoshu", 
   "So why would one desire to serve God if they do not believe that God is good?\n\n \n If they don't believe he's acting on their behalf (I assume that's what you mean by 'good') then they may not serve him. People may come to different opinions on that, I suppose.\n \n \nDo christians serve God out of fear of damnation rather than out of love? And if it is love, why and how could you love an omnipotent being that clearly doesn't reciprocate? Besides, doesn't the bible says repetitively and emphatically that God loves us? Were the bible writers all wrong about that? And finally, if God is truly malevolent or even indifferent to humans, what makes you think that the biblical method to obtaining salvation can be trusted?\n\n \n Well, if it turns out that it can't be trusted, is there really anything you're going to be able to do about it in the end? This is one case where Pascal's wager is all that's really left.\n \n \nA spoilt child gets bent out of shape when his playmates won't let him win the game. It doesn't indicate that he cares about the other children or the game for that matter. Its just a lack of manners\n\n \n Except, again, in this case we're talking about someone who doesn't need to assert authority at all--no loss if he doesn't get to play. It's not so much one of the playground kids as it is the owner of the playground.", 
   {}, 
   321783, 
   null, 
   1220045700.0
  ], 
  [
   321790, 
   null, 
   "unkerpaulie", 
   "Sure I can. First of all, Life is a gift that God gives each of us, not a curse to be hated or scoffed at as a bad thing. Secondly, Hell was never created for us at all. We, as free will agents will purposely and freely choose by our own volition to spend eternity apart from our loving Father who created us not only with free will, but so that we will freely choose to love and fellowship with Him in life. \n \n The bible clearly say's that Hell was created for the devil and his angels.\n Mat 25:41 \"Then He will also say to those on His left, 'Depart from Me, accursed ones, into the eternal fire which has been prepared for the devil and his angels;The relevant point is that you are attempting to blame God for everyone who ends up eternally separated from Him when in fact it is you who has the choice to spend eternity either with or apart from Him yourself. And you needn't do ONE thing even to earn your way into heaven.\n \n Do you know why that is? Because there is nothing \"ANY OF US\" can do on our own merits to be good enough to ever stand in a perfectly holy Gods presence. The only way to become worthy is to accept the redemptive work that Jesus accomplished on the Cross that bridges the gap between our fallen natures and Gods perfectly holy nature. In summation kronus, every human being who finds themselves in outer darkness will curse themselves, not God for being there. Because they will then see clearly all the times God reached out to them and got His message to them as the rejected Him in favor of self governing their earthy lives and their eternal existence.\n Rom 3:23 for all have sinned and fall short of the glory of God,\n Rom 3:24 being justified as a gift by His grace through the redemption which is in Christ Jesus;\n\n Salvation is God's way of trying to fix a problem he created in the first place. He damned adam, mankind and his entire creation that took him six days to make, in a single instant because adam wasn't created perfect. This imperfection and sin-prone nature wasn't adam's fault, but God's. God built adam with the tendency to be gullible, a feature which backfired on God and caused him to scrap his entire project. \n \n 4000-8000 years later, God decides to fix the problem he created. He sends his son to die in order for mankind to have the possibility of redeeming themselves back to him. Kudos to God for owning up to his muck up, but what took him so long? \n \n The thing is, salvation doesn't fix the problem at all. It doesn't restore man to the status of adam: saved people die anyway. It doesn't change our natural tendency to sin, which is the very thing that separates us from God in the first place. And it doesn't guarantee God's favor, since there's the problem of backsliding, holding on to old habits, inconsistent doctrine and the countless flaws in religion as a whole. \n \n What God did essentially is no different from a shady car salesman who gets you into a lemon which breaks down half-mile away from the dealership. You can't take the car back, you still must make the monthly payments, and you've just got to go about with your life as best as you can. Then 6 months later he hands you a toolbox and a manual and tells you to fix the car yourself. The toolbox and manual were free, and you have the free choice of learning how to fix you car and maintain it yourself. From this point on, if you suffer from breakdowns or the car doesn't run, that's because of your choice not to accept the salesman's free gift. Oh, and if you don't fix your car to pass inspection, you stop making your monthly car payments, or you insist that the carsalesman get your car fixed himself, you lose your car and get thrown in jail. Remember, jail wasn't created for deliquent car buyers, but if you end up there it was your choice for not accepting the gift and fixing the car yourself. \n \n Can you feel the love?", 
   {}, 
   321765, 
   null, 
   1220047200.0
  ], 
  [
   321795, 
   null, 
   "unkerpaulie", 
   "If they don't believe he's acting on their behalf (I assume that's what you mean by 'good') then they may not serve him. People may come to different opinions on that, I suppose.\n \n \n Well, if it turns out that it can't be trusted, is there really anything you're going to be able to do about it in the end? This is one case where Pascal's wager is all that's really left.\n \n\n Pascal's wager actually has a lot more odds against it. Besides the fact that there could be no God and there's no afterlife anyway, there's also that God could exist and be evil and is going to send you to hell for following the bible anyway. I like to wager where the odds are in my favor. \n \n \n \nExcept, again, in this case we're talking about someone who doesn't need to assert authority at all--no loss if he doesn't get to play. It's not so much one of the playground kids as it is the owner of the playground.\n\n That's right, the owner of the playground could well get bent out of shape when the other guys beat his team at basketball. He may well take away the ball and lock up the playground. His tendemcy to get bent out of shape doesn't make him less malevolent, nor does it demonstrate that he cares about the other players. It just shows he has bad manners and other immaturity traits. Sure, he reserves the right to do what he wants with his playground, but I wouldn't play there.", 
   {}, 
   321787, 
   null, 
   1220048940.0
  ], 
  [
   321812, 
   null, 
   "Archangel", 
   "Salvation is God's way of trying to fix a problem he created in the first place. He damned adam, mankind and his entire creation that took him six days to make, in a single instant because adam wasn't created perfect. This imperfection and sin-prone nature wasn't adam's fault, but God's. God built adam with the tendency to be gullible, a feature which backfired on God and caused him to scrap his entire project.\n\n \n You're absolutely right about salvation being a way to fix the problem of Gods Creation being separated because of sin. But what if we find that this whole experiment with the sinful nature and Mans struggle to choose between good and evil was necessary in order for God to determine which of us would choose to follow Him freely, when given a clear choice to follow the evil tempter who basically buys our allegiance by offering us everything we want here in this flesh? While God offers us an eternal future with Him.\n \n \n4000-8000 years later, God decides to fix the problem he created. He sends his son to die in order for mankind to have the possibility of redeeming themselves back to him. Kudos to God for owning up to his muck up, but what took him so long?\n \n \n You kind of have it, but first He met a righteous man named Abraham in a world that had forgotten about Him. From that one righteous man came the Jewish people through whom salvation came into the World. And again, God didn't cause Eve to eat the forbidden fruit, in fact he warned them that if they did they would die. I really wish they would have listened to Him. But such is the risk of allowing true free will to exist.\n \n \nThe thing is, salvation doesn't fix the problem at all. It doesn't restore man to the status of adam: saved people die anyway. It doesn't change our natural tendency to sin, which is the very thing that separates us from God in the first place. And it doesn't guarantee God's favor, since there's the problem of backsliding, holding on to old habits, inconsistent doctrine and the countless flaws in religion as a whole.\n \n \n Sure it fixes the problem. It reunites us with God in a supernatural way that unbelievers can neither experience or even relate to by allowing God to indwell believers by way of His Holy Spirit and fellowship with us in a totally intimate and personal way. Yes we still die in this flesh, and we still struggle with our human nature which is flawed. But we are no longer alone as we were in our pre-salvation days. \n \n \nWhat God did essentially is no different from a shady car salesman who gets you into a lemon which breaks down half-mile away from the dealership. You can't take the car back, you still must make the monthly payments, and you've just got to go about with your life as best as you can. Then 6 months later he hands you a toolbox and a manual and tells you to fix the car yourself. The toolbox and manual were free, and you have the free choice of learning how to fix you car and maintain it yourself. From this point on, if you suffer from breakdowns or the car doesn't run, that's because of your choice not to accept the salesman's free gift. Oh, and if you don't fix your car to pass inspection, you stop making your monthly car payments, or you insist that the carsalesman get your car fixed himself, you lose your car and get thrown in jail. Remember, jail wasn't created for deliquent car buyers, but if you end up there it was your choice for not accepting the gift and fixing the car yourself. \n \n Can you feel the love?\n\n \n Yeah, I feel the love, but I don't think God does emoticon_cry . And what is so sad is that you don't even realize how wrong you are. You're asserting that after God has screwed up by allowing us the freedom to choose, and we freely chose to sin/disobey Him after he placed us in a magnificent Garden where all of our needs were met, and we were the pinnacle species of life, He specifically warned us not to eat of that fruit of we would surely die. And you are blaming Him for our own willfulness. \n \n Then you use this lousy analogy about a used car like that's all you think of us as Gods Creation. How sad is that. And you claim that now that He has sold us broken down lives He forces us to fix them ourselves. But you have forgotten that with our fall from grace came our complete inability to redeem ourselves which the OT Laws proved. In order for OT Jews to be able to enter heaven by their own merits, they would have had to follow every single jot and diddle of the Law without even breaking the spirit of one of the laws of Moses. \n \n But understanding this failing in us, God sent His only begotten Son to die for our sins so that we might have life, and have it more abundantly. So you can't fix yourself paulie, just as I couldn't fix myself, and no man can. Unless you think we can work our way into heaven as the cults teach. But if that were true then we wouldn't need Jesus now, would we.", 
   {}, 
   321790, 
   null, 
   1220055480.0
  ], 
  [
   321829, 
   null, 
   "smiley", 
   "You're absolutely right about salvation being a way to fix the problem of Gods Creation being separated because of sin. But what if we find that this whole experiment with the sinful nature and Mans struggle to choose between good and evil was necessary in order for God to determine which of us would choose to follow Him freely, when given a clear choice to follow the evil tempter who basically buys our allegiance by offering us everything we want here in this flesh? While God offers us an eternal future with Him.\n\n Why do you hype it as a choice between good and evil, when in actuality it is a choice between believing that Jesus is the saviour and not? Why does a choice not to follow your god automatically mean a choice to follow the 'evil tempter'?\n \n There are plenty of people who choose 'good' but still don't believe in your petty jealous god. Shame you can't acknowledge that.\n \n Smiley", 
   {}, 
   321812, 
   null, 
   1220066640.0
  ], 
  [
   321836, 
   null, 
   "Archangel", 
   "Why do you hype it as a choice between good and evil, when in actuality it is a choice between believing that Jesus is the saviour and not? \n\n \n Because one is an extension of the other smiley. Before one can ever accept Jesus as their personal Savior, they must be personally cognizant of not only their personal sin nature, but that they are in dire need of redemption and that they can't ever stand before a holy God in their sinful state. In other words, they must be aware of the personal struggle between the good and the evil that we all struggle with. It's just that some of us, like those who scoff at people like me who recognize our spiritual needs, just overlook their sins as either ok, because everyone does it, or they tell themselves that this whole sin thing is foolishness so they just deny that what they do is morally or spiritually wrong.\n \n \n Why does a choice not to follow your god automatically mean a choice to follow the 'evil tempter'?\n\n \n Because the bible say's you either love me or you hate me, you're either for me or against me. There is no part way with God. We either belong to Him when we get to the other side, or we belong to the enemy of truth and the father of lies. There is no compromise with God.\n \n \nThere are plenty of people who choose 'good' but still don't believe in your petty jealous god. Shame you can't acknowledge that.\n\n \n Yes smiley, sadly for them though, when dealing with a perfectly holy God, being good according to the opinion of a sinful humanity isn't going to hold much water at the Judgement Seat of Christ.", 
   {}, 
   321829, 
   null, 
   1220068800.0
  ], 
  [
   321890, 
   null, 
   "unkerpaulie", 
   "You're absolutely right about salvation being a way to fix the problem of Gods Creation being separated because of sin. But what if we find that this whole experiment with the sinful nature and Mans struggle to choose between good and evil was necessary in order for God to determine which of us would choose to follow Him freely, when given a clear choice to follow the evil tempter who basically buys our allegiance by offering us everything we want here in this flesh? While God offers us an eternal future with Him.\n \n\n Well, it still doesn't fix the problem. Our sinfull nature doesn't go away. In fact, the only thing that this salvation plan is interested in is what one believes in, not whether they sin or not. A non-believer that doesn't sin is still going to hell, while a believer who continues to sin still gets to go to heaven. So the issue isn't about sin at all, if you really look at it. \n \n \n \nYou kind of have it, but first He met a righteous man named Abraham in a world that had forgotten about Him. From that one righteous man came the Jewish people through whom salvation came into the World. And again, God didn't cause Eve to eat the forbidden fruit, in fact he warned them that if they did they would die. I really wish they would have listened to Him. But such is the risk of allowing true free will to exist.\n \n\n Well, to be fair, the world hadn't forgotten about God at all. Every nation at the time worshipped God in some form, and abraham's god was one of the many deities that one could believe in. Unfortunately for the rest of the world, they just happened to be believing in the wrong god, and as long as they weren't one of abraham's descendents, it was tough luck, they had no chance of God's favor.\n \n \n \nSure it fixes the problem. It reunites us with God in a supernatural way that unbelievers can neither experience or even relate to by allowing God to indwell believers by way of His Holy Spirit and fellowship with us in a totally intimate and personal way. Yes we still die in this flesh, and we still struggle with our human nature which is flawed. But we are no longer alone as we were in our pre-salvation days. \n \n\n See my response to the first paragraph. \n \n \n \nYeah, I feel the love, but I don't think God does emoticon_cry . And what is so sad is that you don't even realize how wrong you are. You're asserting that after God has screwed up by allowing us the freedom to choose, and we freely chose to sin/disobey Him after he placed us in a magnificent Garden where all of our needs were met, and we were the pinnacle species of life, He specifically warned us not to eat of that fruit of we would surely die. And you are blaming Him for our own willfulness. \n \n Then you use this lousy analogy about a used car like that's all you think of us as Gods Creation. How sad is that. And you claim that now that He has sold us broken down lives He forces us to fix them ourselves. But you have forgotten that with our fall from grace came our complete inability to redeem ourselves which the OT Laws proved. In order for OT Jews to be able to enter heaven by their own merits, they would have had to follow every single jot and diddle of the Law without even breaking the spirit of one of the laws of Moses. \n \n But understanding this failing in us, God sent His only begotten Son to die for our sins so that we might have life, and have it more abundantly. So you can't fix yourself paulie, just as I couldn't fix myself, and no man can. Unless you think we can work our way into heaven as the cults teach. But if that were true then we wouldn't need Jesus now, would we.\n\n Jesus is the gift, along with forgiveness, grace, the holy spirit, and all the other religious gadgets and tools that must be applied to our broken down lives in order to fix it. Its up to us to understand how to apply these gifts and fix our lives. God doesn't fix it for us, he just gives us the tools and the manual. \n \n And the choice is to fix the lemon we've been given, or to not fix it and take the train or walk. We can freely choose, and we know the consequences of the choices. But the default is a broken car. And even if we choose to fix it, it requires constant maintainence. Every half-mile we have to get out and fix it again. \n \n As if that isn't bad enough, the salesman is consistently unreliable when it comes to the promises he made at the offer table. He makes you believe that fixing the car is easy and anyone can do it, and that once you fix it you'll never have to worry about problems again. He promises to reward those that do their best to keep their cars in working conditions with vague \"blessings\", \"bonuses\" and \"cool stuff\" without ever specifying what these blessings and cool stuff will be. And of course, when you don't get them, you can confidently blame yourself for doing a poor job fixing your car. \n \n And to make matters even worse, the manual is hard to understand, contradicts itself, and creates huge rifts among other car owners who believe they can somehow salvage their hoopties if they follow the instructions correctly. Of course, for the few lucky ones that get their car running for more than half-mile, they capitalize on the rest of the owners by opening fix-it schools where their followers must donate money and keep coming back for their weekly tune-ups. And they get to ridicule the other fix-it schools who they believe aren't reading the manual the right way.", 
   {}, 
   321812, 
   null, 
   1220121180.0
  ], 
  [
   321898, 
   null, 
   "smiley", 
   "Because one is an extension of the other smiley. Before one can ever accept Jesus as their personal Savior, they must be personally cognizant of not only their personal sin nature, but that they are in dire need of redemption and that they can't ever stand before a holy God in their sinful state. In other words, they must be aware of the personal struggle between the good and the evil that we all struggle with. It's just that some of us, like those who scoff at people like me who recognize our spiritual needs, just overlook their sins as either ok, because everyone does it, or they tell themselves that this whole sin thing is foolishness so they just deny that what they do is morally or spiritually wrong.\n\n I'm perfectly aware of my personal struggle between good and evil (if that's what you want to call it), but I do not need an invisible sky fairy to help. It is a matter of doing good (to the best of your ability) just because it is the right thing to do, not because you are to be either rewarded or punished by some nonevident superior being.\n \n \nBecause the bible say's you either love me or you hate me, you're either for me or against me. There is no part way with God. We either belong to Him when we get to the other side, or we belong to the enemy of truth and the father of lies. There is no compromise with God.\n\n Then the bible is a pile of poo. If someone does not believe in god then they neither love nor hate it. (and the word is says for the umpteenth time)\n \n \nYes smiley, sadly for them though, when dealing with a perfectly holy God, being good according to the opinion of a sinful humanity isn't going to hold much water at the Judgement Seat of Christ.\n\n Given the reported actions of your perfectly holy (nonevident) god, I doubt it has any idea of morality. Your words reflect this all too well.\n \n Smiley", 
   {}, 
   321836, 
   null, 
   1220123820.0
  ], 
  [
   321989, 
   null, 
   "GazzaElliott", 
   "*I* think that's his reasons, but I certainly understand there's no way to know that until 'the long run' plays out. And since there's not a darn thing we mere mortals could do if it turns out he *is* malevolent and evil, then it seems like a moot point to me.\n\n Given that people are basing their lives on the dictates and whims of this God, I'd say it's far from moot!\n \nBut that's just it--if he's God, he doesn't need to 'establish' any authority. He has it by default. His godhood is secure no matter if the mere mortals follow him or not. The sort of analogy where human leaders such as government officials, presidents, or kings DO lead by example (because they DO have to do that in order to secure authority) completely breaks down in such a case as this where we're talking about GOD and mere mortals who cannot possibly effect God. \n\n Again, the point is that God seems to want to mess with humans. He may be omnipotent, and omniscient, but he also seems to be incredibly caught up with what people on this rock think of him! Thus he needs to establish his authority over us.\n \n Look, if it helps you to think of God in such terms as you would a human leader, that's up to you. To me, that throws out the whole GODhood thing, so I think we're again back to different starting assumptions. (Though I'm not sure you really realize it.) We're not talking about a king that needs to pitch bread to the masses here. His Godhood is secure, regardless. So if he DOES pitch bread to the masses, it's all the more indicative that he doesn't have self-serving reasons for doing so. \n\n We are starting with different assumtions. You're starting with the belief that God is inherently good, where I'm not assuming benevolent intentions. You're again answering the question by saying we can't understand it, and if that's what you're happy with, then have fun. I'll carry on looking at the evidence. Have you considered that God might just 'pitch bread' because it amuses him? Have you also considered that God isn't chucking bread, he's just convinced some people that he did once?\n \nNo, what I'm really saying here is that the concepts of benevolence and malevolence as you're using them can't really be attributed when you're talking about something on the order of what we're talking about<b></b>: GOD. Because you're completely ignoring the 1000 lb elephant of said GOD's omniscience. You're making a judgment ignoring what could very well be the most important factor of all, and therefore it's actually you who is avoiding something here because you don't want to possibly attribute benevolence to the Judeo-Christian God.\n\n I'd like a God figure to be benevolent, because the consequences of a malicious entity with that sort of power are terrifying. However, as I've said before omniscience does not mean that you're a good guy. I'm not ignoring the fact he knows all, I'm saying it's irrelevant to God's nature. Unless you're trying to state that all the massacres that God has commited (or caused) are a good thing because God knew what would happen in the future...\n \nPlus, I think your comments here are an over-simplification in light of theology. In my opinion someone can look at the same scriptures and come away with different conclusions than you are when taking them as a whole--indeed that's exactly WHY some believe God is good as opposed to evil. Those scriptures indicate that God has offered a way to AVOID the eternal consequences for evil: not exactly something an evil and malevolent God would do.\n\n Your point? Plenty of people read the scriptures and come away with a negative view of God. A benevolent God wouldn't have created hell in the first place. What you describe there is a God who sits in the corner and giggles at the tricks he forces his creations to perform in order to gain his favour. \n \nI don't really think he does. Where in the scriptural texts of the Judeo-Christian God does he get all bend out of shape over people not accepting him? \n\n Does Hell ring any bells?\n \nBut I find it interesting that you ask that question; if he gets bent out of shape that someone won't accept him, then that would indicate (to some extent at least) he DOES want our acceptance, and therefore does care about us. Doesn't exactly fit your idea of the malevolent vindictive God. \n\n Wanting acceptance again does not mean benevolence. Charles Manson probably wanted acceptance from his peers, but that doesn't make him benevolent. Personally I would suggest that for an omnipotent being to spend all his time worrying about the actions of some big brained apes on this particular rock is a bit pathetic. And please stop trying to attribute my views to me. I'm arguing over the evidence, not over a personal crusade.", 
   {
    "unicode_changes_made": true
   }, 
   321898, 
   null, 
   1220200560.0
  ], 
  [
   322020, 
   null, 
   "Penfold", 
   "Does the owner of an ant farm know or care how individual ants behave or think? This would approximate the relationship between a god and it's believers, yet the believers cling desperately to the notion that they matter to it.", 
   {}, 
   321989, 
   null, 
   1220217000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I want to get into heaven. Can anyone help?", 
  "url": "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 11517, 
  "discussion_files": [
   [
    "19135.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-print.html"
   ], 
   [
    "19136.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-11-print.html"
   ], 
   [
    "19137.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-9-print.html"
   ], 
   [
    "19138.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-7-print.html"
   ], 
   [
    "19139.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-5-print.html"
   ], 
   [
    "19140.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-4-print.html"
   ], 
   [
    "19141.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-6-print.html"
   ], 
   [
    "19142.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-8-print.html"
   ], 
   [
    "19143.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-10-print.html"
   ], 
   [
    "19144.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-3-print.html"
   ], 
   [
    "19145.html", 
    "http://www.4forums.com/political/religion-debates/11517-i-want-get-into-heaven-can-anyone-help-2-print.html"
   ]
  ], 
  "identifier": 11517
 }
]