[
 [
  [
   321204, 
   null, 
   "antonia", 
   "Discuss pros and cons of merit pay for teachers. Consider, in discussion, how teachers get salary increases for completing coursework.", 
   {
    "post_info": {
     "post_title": "Merit Pay"
    }
   }, 
   null, 
   null, 
   1219540260.0
  ], 
  [
   321206, 
   null, 
   "chester", 
   "Discuss pros and cons of merit pay for teachers. Consider, in discussion, how teachers get salary increases for completing coursework.\n\n \n Sweetie, enjoy your soliloquy.\n \n Thinking people left long ago.", 
   {}, 
   321204, 
   null, 
   1219540680.0
  ], 
  [
   321209, 
   null, 
   "antonia", 
   "Sweetie, enjoy your soliloquy.\n \n Thinking people left long ago.\n\n \n First argument pro merit pay.", 
   {}, 
   321206, 
   null, 
   1219542240.0
  ], 
  [
   321243, 
   null, 
   "Jo Bennett", 
   "The problem is assessment - do you rely on subjective assessment of teaching quality, or do you pay be results? Either way is unfair and the second is highly detrimental to education.", 
   {}, 
   321209, 
   null, 
   1219573680.0
  ], 
  [
   321244, 
   null, 
   "Symbiote", 
   "As a non-market institution, the state education system has no rational mechanism telling it what it should be doing.\n \n You can employ an army of technocrats and econometricians, but the endeavour is completely futile.\n \n At best it can ape the private sector, importing the same methods employed there, but unable to adapt them to its own clientele and conditions. And conditions across the private sector will differ from firm to firm and place to place, so which should it steal from? It has no way to know.\n \n See Mises' classic work, \"Economic Calculation in the Socialist Commonwealth\"\n \n http://mises.org/econcalc/intro.asp\n \n or for a synopsis of it and the ongoing debate around it that came to a close with the collapse of the soviet union, Rothbard's 1991 revisitation\n \n http://mises.org/story/2401", 
   {}, 
   321243, 
   null, 
   1219580880.0
  ], 
  [
   321354, 
   null, 
   "Galactababe", 
   "Antonia:\n \n I would support merit pay for excellent teachers, however the ultra-Liberal teacher unions would never go for it. \n \n Public school teacher salaries are public information. The taxpayers pay their salaries through their property taxes. In addition to achieving excellent standardized testing results, a student/parent vote (survey) of which teachers they feel are most deserving of being rewarded financially for going above and beyond their basic contract duties would add a perspective that might be very different from that of an administrator who might be biased against a particular teacher.", 
   {}, 
   321244, 
   null, 
   1219679700.0
  ], 
  [
   321513, 
   null, 
   "CUNxTime", 
   "Merit Pay would be GREAT for the education of American children. It will NEVER happen. Furthermore, the entire new directive of 'teaching to pass the test' to the exclusion of everything else that used to qualify as education is going to cause Massive damage to our future generations.", 
   {}, 
   321354, 
   null, 
   1219786980.0
  ], 
  [
   321542, 
   null, 
   "chester", 
   "Merit Pay would be GREAT for the education of American children. It will NEVER happen. Furthermore, the entire new directive of 'teaching to pass the test' to the exclusion of everything else that used to qualify as education is going to cause Massive damage to our future generations.\n\n \n Will wonders never cease??!!emoticon_xlove\n \n We actually agree that the current obscene emphasis on standardized pencil and paper tests and teaching to them deprives school children of their chance at a real education.", 
   {}, 
   321513, 
   null, 
   1219800120.0
  ], 
  [
   321649, 
   null, 
   "CUNxTime", 
   "Will wonders never cease??!!emoticon_xlove\n \n We actually agree that the current obscene emphasis on standardized pencil and paper tests and teaching to them deprives school children of their chance at a real education.\n\n \n Of course I do. My major was education. Spending HOURS a day drilling kids to make \"educated guesses\" or pick C is horrid and is costing us big time in future productivity.", 
   {}, 
   321542, 
   null, 
   1219896660.0
  ], 
  [
   321658, 
   null, 
   "Shooterandproud", 
   "Teachers should be paid by merit, but there's no way to tell. Tests tell you absolutely nothing about what someone has learned in school. They only tell you how good the test taker's memorization and regurgitation skills are.\n \n And I agree that standardized test training is damaging our kid's education. I really miss the charismatic teachers who used to make the subjects interesting. Now it is mostly test taking skills, which will really get you nowhere in the real world.\n \n This can be blamed on this \"no child left behind\" ####. The teachers and schools are not so scared that they're students may score low, they no longer care about how smart or prepared a student is for real life, its all about the school's average score.", 
   {}, 
   321649, 
   null, 
   1219904820.0
  ], 
  [
   321734, 
   null, 
   "CUNxTime", 
   "The NEA is probably the biggest impediment to public education. However, I would agree that the emphasis put on standardized test scores runs a close second!", 
   {}, 
   321658, 
   null, 
   1219983600.0
  ], 
  [
   321739, 
   null, 
   "Shooterandproud", 
   "Whats the NEA?", 
   {}, 
   321734, 
   null, 
   1219988160.0
  ], 
  [
   321840, 
   null, 
   "CUNxTime", 
   "The biggest teachers union in the world!", 
   {}, 
   321739, 
   null, 
   1220070360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Merit Pay", 
  "url": "http://www.4forums.com/political/education-debates/11521-merit-pay.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 11521, 
  "discussion_files": [
   [
    "15104.html", 
    "http://www.4forums.com/political/education-debates/11521-merit-pay-print.html"
   ]
  ], 
  "identifier": 11521
 }
]