[
 [
  [
   20236, 
   null, 
   "maximus", 
   "Do atheists believe in the act of sacrifice? (sacrifice: to suffer loss of, give up, renounce, injure, or destroy especially for an ideal, belief, or end) \n \n Particularly, in the case of sacrificing for another person...what motivates this act in an atheist, what is the purpose of sacrifice, benefits, etc. (elaborate as you choose)\n \n Finally, are there examples of personal sacrifice for others in the atheist population...something along the lines of a type of Mother Theresa, Saint Francis, St. Maximilian Kolbe", 
   {
    "post_info": {
     "post_title": "Atheists and sacrifice"
    }
   }, 
   null, 
   null, 
   1066803060.0
  ], 
  [
   20275, 
   null, 
   "epaphras_faith", 
   "Do atheists believe in the act of sacrifice? (sacrifice: to suffer loss of, give up, renounce, injure, or destroy especially for an ideal, belief, or end) \n \n Particularly, in the case of sacrificing for another person...what motivates this act in an atheist, what is the purpose of sacrifice, benefits, etc. (elaborate as you choose)\n \n Finally, are there examples of personal sacrifice for others in the atheist population...something along the lines of a type of Mother Theresa, Saint Francis, St. Maximilian Kolbe\n\n \n Hmmmmmmmmmmmmmmmmmm..................................\n \n emoticon_cool", 
   {}, 
   20236, 
   null, 
   1066857120.0
  ], 
  [
   20276, 
   null, 
   "gilligan8503", 
   "now, first off, i'd like to say that most sacrifices done, in the name of religion, is for personal gain. these martyrs know/think they will gain eternal happiness with the 'creator of the universe' and see their sacrifice as a means to get there (who wouldn't want 70 virgins to use as you please?).\n \n the question on importance is: would i, and atheist, sacrifice myself for the greater good (whatever that is)? well, it all depends. i can most-definately see myself sacrificing my life for the many i love. people say this, as i do, but they do not mean it. i will say, even if you don't believe me, i have a good 10 people on my list i would die for. my purpose would be, because of my deep love for the other. although i believe in no afterlife, and i see others as going to 'nowhere', i would sacrifice myself for the other, whom i love, to continue living his or her attachment to life. in that time this person lives, they will be grateful and, even though i won't be around to know, i know at the point i decide this sacrifice, i would be happy to know this person is continuing to live.\n \n now, when it comes to ideals, beliefs, etc., that is a different story. i can see myself becoming very scared (as would anyone) that my sacrifice may go unknown. the point of a political sacrifice is to be known, but at the same time, i would not want this sarifice to be in the way of children's eyes, for i would not want to damage the fragile youth. i cannot see myself dying for an ideal because there is nothing for me to die for, at this point. if one arises i feel deeply about, i will consider death as a statement, testimony, etc. i say this, but for an idea, it would be far-fetched if i do so kill myself for this reason.\n \n giordano bruno was a martyr of freethought. he did not kill himself as a statement, but he did good through and spread the idea of 'freethought'. he was burned at the stake for his radical ideas. i can also say the same for socrates; he was killed for his ideas which shaped the world we live in today.\n \n i am a humanitarian. we are those who do good, expecting no reward in return. that's more than christians can say. deep down, i believe most are frightened and worship for the sake of worshiping, almost for show; for show to the 'could-be god'.\n \"hey, you know what?\", says the everyday christian (not all), \"if we appear to truly believe in god, and he sees this, our sinning selves will steal our way into heaven's gate! better be safe than sorry, i say!\"\n \n i believe most religious people are hypocrites, but this is beside the point. a humanitarian/atheist martyr is as good and moral as it gets.", 
   {}, 
   20236, 
   null, 
   1066858560.0
  ], 
  [
   20331, 
   null, 
   "maximus", 
   "i am a humanitarian. we are those who do good, expecting no reward in return. that's more than christians can say. deep down, i believe most are frightened and worship for the sake of worshiping, almost for show; for show to the 'could-be god'.\n \"hey, you know what?\", says the everyday christian (not all), \"if we appear to truly believe in god, and he sees this, our sinning selves will steal our way into heaven's gate! better be safe than sorry, i say!\"\n \n i believe most religious people are hypocrites, but this is beside the point. a humanitarian/atheist martyr is as good and moral as it gets.\n\n \n Gilligan,\n Thank you for sharing your ideas. \n \n Humanitarian or humanist? How do you define humanitarian? What type of bounds would a humanitarian put on defending the dignity and life of a human? Would he oppose abortion? Would he oppose euthanasia?\n \n You mentioned that you would sacrifice due to love. What is the genesis of the idea of love in the atheist framwork? (I am being sincere with this question)\n \n Peace.", 
   {}, 
   20276, 
   null, 
   1066886520.0
  ], 
  [
   20336, 
   null, 
   "gilligan8503", 
   "Humanitarian or humanist?\n\n sorry, humanist. i was lost in the moment.\n \nHow do you define humanitarian (humanist)?\n\n sorry, even though i mislead you, i will answer the question anyway. i define it as i stated above:\n \n...are those who do good, expecting no reward in return.\n\n (good defined as: a system of thought that centers on humans and their values, capacities, and worth; concern with the interests, needs, and welfare of humans.)\n \nWhat type of bounds would a humanitarian put on defending the dignity and life of a human?\n\n \nYou mentioned that you would sacrifice due to love. What is the genesis of the idea of love in the atheist framwork?\n\n as a stated before, i can only see myself dying for another due to love. how do atheists define love? like every othe rhuman being on the planet. we are humans, as you are, and everyone else in this forum. we experience certain emotions, such as love. love is, as i stated in another thread:\n \nyou have a queezy feeling when you see that person. you take every chanse you get to be with this person, whether just by sight or conversation. you catch yourself thinking of this person before yourself. you want no harm to come to this person and can see yourself taking your life for his/hers.\n\n one does not have to believe in a god to love another human.\n \nWould he oppose abortion?\n\n personally, i don't, because i believe that fetus's are not considered human beings. i see it as a potential life. i opose capital punishment though, because this person has an attachment to life. fetus's have not developed memories of past experiences. these past experiences make that person. it is not the person one misses when someone dies, it is the memory of that person and knowing one cannot talk to the person, and create more memories, again.\n \nWould he oppose euthanasia?\n\n no...\n ...\n oh, you want a reason?\n mercy. would you let a dog suffer? no, it is common sight. let's do the same for humans. or, you know, at leat legalize pot. :)", 
   {}, 
   20331, 
   null, 
   1066891200.0
  ], 
  [
   20493, 
   null, 
   "maximus", 
   "sorry, humanist. i was lost in the moment.\n \n sorry, even though i mislead you, i will answer the question anyway. i define it as i stated above:\n \n (good defined as: a system of thought that centers on humans and their values, capacities, and worth; concern with the interests, needs, and welfare of humans.)\n\n \n Gilligan,\n Humanism centers on humans and their worth, as you declared above. How has a human in the atheist humanist mindset become more valuable than another animal? There seems to be a bit of a contradiction. An atheist sees all beings as animals with no divine nobility assigned to one over the other. Yet a humanist raises the human above the animals and promotes his value and worth. Can there be an atheist humanist?\n \n \nas a stated before, i can only see myself dying for another due to love. how do atheists define love? like every othe rhuman being on the planet. we are humans, as you are, and everyone else in this forum. we experience certain emotions, such as love. love is, as i stated in another thread:\n \n you have a queezy feeling when you see that person. you take every chanse you get to be with this person, whether just by sight or conversation. you catch yourself thinking of this person before yourself. you want no harm to come to this person and can see yourself taking your life for his/hers.\n \n one does not have to believe in a god to love another human.\n\n \n I appreciate that you have shared your definition of love. It gives me further insight. However, I did not ask for the definition of love but for your view on the genesis of love. From whence does it come? Are other animals besides humans capable of it? (I agree that one need not believe in God for him to love another).\n \n \npersonally, i don't, because i believe that fetus's are not considered human beings. i see it as a potential life. i opose capital punishment though, because this person has an attachment to life. fetus's have not developed memories of past experiences. these past experiences make that person. it is not the person one misses when someone dies, it is the memory of that person and knowing one cannot talk to the person, and create more memories, again.\n\n \n And if someon develops amnesia? What is their fate as a member of the human race?", 
   {}, 
   20336, 
   null, 
   1067067420.0
  ], 
  [
   20528, 
   null, 
   "gilligan8503", 
   "Gilligan,\n Humanism centers on humans and their worth, as you declared above. How has a human in the atheist humanist mindset become more valuable than another animal? There seems to be a bit of a contradiction. An atheist sees all beings as animals with no divine nobility assigned to one over the other. Yet a humanist raises the human above the animals and promotes his value and worth. Can there be an atheist humanist?\n\n i would say humans are 'more valuable' in the sense that people also view those of their family with 'more value' than some random person. i could not die for a slug. this is just how humans are: the want to live and the need to associate with others of the same species. you are saying (or asking) that because i don't believe in a higher power, than animals are equal to me. that's weird, because in the bible, it says in one passage or another that animals go to heaven...\n by the way, i am an atheist humanist.\n [/quote=maximus]I appreciate that you have shared your definition of love. It gives me further insight. However, I did not ask for the definition of love but for your view on the genesis of love. From whence does it come? Are other animals besides humans capable of it? (I agree that one need not believe in God for him to love another).[/quote]\n what do you mean from where does it come?\n yes, animals can feel love, hate, etc.:\n http://www.bbc.co.uk/nature/animals/features/246index.shtml\n there was also a study being done on the brain patterns... they discovered, without a doubt, that animals have emotions:\n http://stacks.msnbc.com/news/937679.asp?cp1=1\n \nAnd if someon develops amnesia? What is their fate as a member of the human race?\n\n clarify please? it seems that you are asking me if a human has an illness, then they should be killed? what does that have to do with anything?", 
   {}, 
   20493, 
   null, 
   1067114100.0
  ], 
  [
   20620, 
   null, 
   "maximus", 
   "clarify please? it seems that you are asking me if a human has an illness, then they should be killed? what does that have to do with anything?\n\n \n Gilligan,\n You said this in an earlier post:\n \n \nfetus's have not developed memories of past experiences. these past experiences make that person. it is not the person one misses when someone dies, it is the memory of that person and knowing one cannot talk to the person, and create more memories, again.\n\n \n So, if someone suffers amnesia then do they cease to be human because they don't have the \"memories of past experiences\" that \"make that person.\" That is, do they lose their value as a human and become subject to other \"humans?\"\n \n On the genesis of love... I was simply curious on your idea of its origin and development.\n \n Two more questions:\n \n 1. Do your prior statemtents indicate that you would not be willing to risk your life to attempt to save someone you didn't know?\n \n 2. In the humanist perspective do mentally retarded and severely handicapped humans maintain as much value as other intelligent and able-bodied humans?", 
   {}, 
   20528, 
   null, 
   1067212980.0
  ], 
  [
   20639, 
   null, 
   "gilligan8503", 
   "So, if someone suffers amnesia then do they cease to be human because they don't have the \"memories of past experiences\" that \"make that person.\" That is, do they lose their value as a human and become subject to other \"humans?\"\n\n no only does the experiences one has make that person, but so does their effect on others. i didn't mean that ONLY this and NOTHING else define a human being, i just used this on thing to justify abortion.\n \n1. Do your prior statemtents indicate that you would not be willing to risk your life to attempt to save someone you didn't know?\n\n this is an odd question, i mean, i can see myself saving someone's life if my stakes were relativly low, but to kill myself completely to save someone i don't know? i don't think so. would you, because i doubt it.\n \n2. In the humanist perspective do mentally retarded and severely handicapped humans maintain as much value as other intelligent and able-bodied humans?\n\n of course they do.", 
   {}, 
   20620, 
   null, 
   1067223060.0
  ], 
  [
   20642, 
   null, 
   "AMD4EVER", 
   "of course they do.\n\n \n For someone who puts importance on the ability to think I'm surprised that you believe mentally handicapped people are as valuable as the average person. Value is of course the key word here. Value can be interpreted to mean many different things including value to the human society. Even the humanistic perspective has to take into account that the human society as a whole even if it is only a small portion. I don't think the handicapped can hold a great deal of value in the human society when compared to the avereage \"intelligent and able-bodied humans\", wouldn't you agree? If so then where do they make up for this imperfection to increase their 'value' to be equal to that of an able-bodied human?", 
   {}, 
   20639, 
   null, 
   1067225880.0
  ], 
  [
   20647, 
   null, 
   "maximus", 
   "no only does the experiences one has make that person, but so does their effect on others. i didn't mean that ONLY this and NOTHING else define a human being, i just used this on thing to justify abortion.\n \n this is an odd question, i mean, i can see myself saving someone's life if my stakes were relativly low, but to kill myself completely to save someone i don't know? i don't think so. would you, because i doubt it.\n \n of course they do.\n\n \n What else defines a human being in the atheistic humanist view (if this question is not too time consuming)?\n \n Would I give my life for someone I didn't know? \n \n Speaking from the Christian perspective, I view this as somewhat of a duty. I'm not saying that all Christians do. My basic foundation are the words of Jesus (paraphrased), \"to find your life you must lose it\" and \"there is no greater love than to give one's life for another.\" Then there was his example of giving his own life. He was not speaking strictly in an earthly context but I believe it can be applied in that sense. There are also other ways one can \"give their life\" to save others although my question's wording restricted the context for your answer. \n \n Now, would I be able to carry out this ideal if faced with the task in real life? I cannot say. I hope that I would have the courage and faith to do it. But in pondering the question myself, I realize that it might not be a good one. For we can never put ourselves in that position until we are in the moment--the emotion, the love, the faith, the fear, the courage. Something to think about.", 
   {}, 
   20639, 
   null, 
   1067229180.0
  ], 
  [
   20648, 
   null, 
   "gilligan8503", 
   "For someone who puts importance on the ability to think I'm surprised that you believe mentally handicapped people are as valuable as the average person. Value is of course the key word here. Value can be interpreted to mean many different things including value to the human society. Even the humanistic perspective has to take into account that the human society as a whole even if it is only a small portion. I don't think the handicapped can hold a great deal of value in the human society when compared to the avereage \"intelligent and able-bodied humans\", wouldn't you agree? If so then where do they make up for this imperfection to increase their 'value' to be equal to that of an able-bodied human?\n\n everyone has a right to live, rather they are clueless or not. i am not a nazi, in fact, i am probably the complete opposite.\n \n who says humanists have to take into account value in society? i could care less. we have special homes, school, and institutions for the mentally ill. everyone has the right to live, regardless of how they are different.\n \n what do you think humanism is? everyone has to be 100% equal or the same to be valuable in society? i'm not following. totally equality is ignorant. read \"harrison bergeron\" by kurt vonnegut; it's very short and describes how equality can get out of hand:\n http://penguinppc.org/~hollis/personal/bergeron.shtml", 
   {}, 
   20642, 
   null, 
   1067229360.0
  ], 
  [
   20650, 
   null, 
   "gilligan8503", 
   "Now, would I be able to carry out this ideal if faced with the task in real life? I cannot say. I hope that I would have the courage and faith to do it. But in pondering the question myself, I realize that it might not be a good one. For we can never put ourselves in that position until we are in the moment--the emotion, the love, the faith, the fear, the courage. Something to think about.\n\n i agree completely, i have never been in this situation and, like you, i cannot answer the question you posed for me. take into account human nature... i say the odds are high one will not risk their life for a stranger unless their job depicted this (such as firemen, policemen, stunt men, etc.) <-- of course, they are protected, in a sense --<\n \n as for the question on \"the value of human life\", i will get to this after i have finished my english paper (i am procrastinating on this site). :)", 
   {}, 
   20648, 
   null, 
   1067229840.0
  ], 
  [
   20655, 
   null, 
   "AMD4EVER", 
   "everyone has a right to live, rather they are clueless or not. i am not a nazi, in fact, i am probably the complete opposite.\n\n \n I think you are misunderstanding the question that was presented to you. The question didn't deal with whether someone has a right to live or not. The question dealt with the value of the person based on a humanistic perspective. I simply suggested that perhaps the value of a person is going to be connected to their intellegence in some way regardless of how small or large that difference is.\n \n \nwho says humanists have to take into account value in society? i could care less. we have special homes, school, and institutions for the mentally ill. everyone has the right to live, regardless of how they are different.\n\n \n No one ever said humanist have to take into account value in society. I did propose it however. To go more into detail, isn't the quality of life in a human society going to be somewhat based on the quality of the humans in it?\n \n \nwhat do you think humanism is? everyone has to be 100% equal or the same to be valuable in society? i'm not following. totally equality is ignorant. read \"harrison bergeron\" by kurt vonnegut; it's very short and describes how equality can get out of hand:\n http://penguinppc.org/~hollis/personal/bergeron.shtml\n\n \n I think humanism deals with human welfare and caring for others. A humanistic approach in a vaccum will believe that intellegence doesn't matter. However, realistically I believe it is necessary to take into account the humans in a society because the humans in the society will play an affect in how much human welfare the soceity can handle. For instance, if all humans in one society are retards they will not be able to provide as much human welfare as our society is able to. This leads me to the conclusion that human welfare is going to be in some small way affected by the intellegence of the humans in a society and therefore intellegence is going to be linked with how intellegence is valued in a humanistic perspective. You can agree or disagree. You seem to believe that I am trying to state a fact when it is the complete opposite and I'm just stating an opinion, just as you have been doing.", 
   {}, 
   20648, 
   null, 
   1067231880.0
  ], 
  [
   20657, 
   null, 
   "maximus", 
   " everyone has the right to live, regardless of how they are different.\n\n \n Gilligan,\n a simple remark that does not require the favor of a reply...one without judgment\n \n I kindly ask that you ponder your statement in relation to the \"living\" \"thing\" in the womb that is just a bit \"different\" from us.", 
   {}, 
   20648, 
   null, 
   1067232600.0
  ], 
  [
   20660, 
   null, 
   "gilligan8503", 
   "I kindly ask that you ponder your statement in relation to the \"living\" \"thing\" in the womb that is just a bit \"different\" from us.\n\n i hope you see the flaw in your statement, so that i will not have to say anythign else.", 
   {}, 
   20657, 
   null, 
   1067234160.0
  ], 
  [
   20729, 
   null, 
   "maximus", 
   "i hope you see the flaw in your statement, so that i will not have to say anythign else.\n\n \n You will have to say something. I do not see it.", 
   {}, 
   20660, 
   null, 
   1067312040.0
  ], 
  [
   20731, 
   null, 
   "SilentPoet", 
   "Gilligan,\n \n \neveryone has a right to live, rather they are clueless or not.\n\n \n \n Who or what gives everyone this right?", 
   {}, 
   20657, 
   null, 
   1067313060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Atheists and sacrifice", 
  "url": "http://www.4forums.com/political/religion-debates/1152-atheists-sacrifice.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1152, 
  "discussion_files": [
   [
    "24239.html", 
    "http://www.4forums.com/political/religion-debates/1152-atheists-sacrifice-print.html"
   ], 
   [
    "24240.html", 
    "http://www.4forums.com/political/religion-debates/1152-atheists-sacrifice-2-print.html"
   ]
  ], 
  "identifier": 1152
 }
]