[
 [
  [
   321767, 
   null, 
   "Archangel", 
   "Sarah Palin, Republican Governor from Alaska is McCains VP nominee and will be the next Vice President of this Country. McCain has effectively fulfilled every promise that Obama ever made in what he promised he would represent throughout his campaign. She is a Washington outsider while Biden is a 35 year insider. She has executive experience over a State while Biden has only been a legislator. She truly represents small town working class America where as Biden represents the epitome of elitist insider politics that Washington is known and hated for. \n \n Although I can't stand so many things about the conservatism McCain doesn't represent, he just guaranteed a victory in November while simultaneously wiping Obama off the public air waves in one fell swoop. I couldn't be happier with Palin as his choice. She is the perfect pick and will add a dimension to this race that only a responsible and qualified woman could bring to this political season. Comments? Does anyone see problems with her nomination that isn't obvious on the surface?", 
   {
    "post_info": {
     "post_title": "The Next American VP Has Been Chosen, And She's A Woman:"
    }
   }, 
   null, 
   null, 
   1220036040.0
  ], 
  [
   321777, 
   null, 
   "Archangel", 
   "emoticon_xgood I can tell McCain hit a nerve when the loony lefty's are so quiet. I guess my point has been effectively made, and so has McCains by choosing this excellent common sense woman. emoticon_smile ;)", 
   {}, 
   321767, 
   null, 
   1220041380.0
  ], 
  [
   321780, 
   null, 
   "GiantOreo", 
   "I find myself in the rare place of agreeing with Archangel. \n \n I personally think Palin was an excllent choice for McCain and will pick him up not only a lot of the conservative votes he might have been worried about, but may just pick him up some of the PUMAs, especially the female PUMAs (at least those that aren't feminist who would dislike her being a mother with five kids, etc.).\n \n Now, I am typically a Democrat, but this year I am voting for McCain - Obama is an elitist snob who attended a church and nodded along in agreement each Sunday for over 20 years that had a racist pastor who hates america. No way should someone like that be put in the commander in chief position.\n \n Now, I already have seen Obamaites on otehr forums complaining about Palin's inexperience. Obama's campaign itself said that the choice of Palin takes the question of experience \"off the table.\"\n \n \"Experience is being taken off the table considering you're putting someone within a heartbeat of the presidency with the thinnest foreign policy experience in history.\" \n \n My immediate first thought was - \"wait, you are complaining that someone with little experience wil be withing a 'heartbeat' of the presidency, AND YET YOU WANT TO PUT SOMEONE WITH JUST AS LITTLE OR EVEN LESS IN THE PRESIDENCY?\"\n \n And as to experience, I will note that she has been in public office (as governor) for about the same amount of time as Obama (even longer if you count her years as mayor). The difference is Obama has been a senator, while she has been a governor. I'd say that her experience (administarative, etc.) is far more applicable to the job than Obama's.\n \n So enjoy this rare agreement while it lasts Archie! emoticon_xgood", 
   {}, 
   321777, 
   null, 
   1220043060.0
  ], 
  [
   321782, 
   null, 
   "jyoshu", 
   "I find myself in the rare place of agreeing with Archangel. \n \n I personally think Palin was an excllent choice for McCain and will pick him up not only a lot of the conservative votes he might have been worried about, but may just pick him up some of the PUMAs, especially the female PUMAs (at least those that aren't feminist who would dislike her being a mother with five kids, etc.).\n \n Now, I am typically a Democrat, but this year I am voting for McCain - Obama is an elitist snob who attended a church and nodded along in agreement each Sunday for over 20 years that had a racist pastor who hates america. No way should someone like that be put in the commander in chief position.\n \n Now, I already have seen Obamaites on otehr forums complaining about Palin's inexperience. Obama's campaign itself said that the choice of Palin takes the question of experience \"[I]off the table.\" My immediate first thought was - \"wait, you are complaining that someone with little experience wil be withing a 'heartbeat' of the presidency, AND YET YOU WANT TO PUT SOMEONE WITH JUST AS LITTLE OR EVEN LESS IN THE PRESIDENCY?\"\n\n \n Yep. The experience thing works more against Democrats now than R's: lest they indicate a younger inexperienced man is good enough to be president but not a young inexperienced woman to be VP. It think they were just trying to make a pretty vain attempt to play the 'experience' card first.", 
   {}, 
   321780, 
   null, 
   1220044020.0
  ], 
  [
   321784, 
   null, 
   "Penfold", 
   "I would imagine that the American peoples' experience of the last eight years would lead to their voting for anything excepting four more years of the same.", 
   {}, 
   321782, 
   null, 
   1220045160.0
  ], 
  [
   321789, 
   null, 
   "Archangel", 
   "What will be most interesting to see in the coming months is the extreme left which claims to be so concerned about equality for women and homosexuals as those very groups of homosexual feminists attack this woman as too inexperienced to do the job. After all, she is the only one of the three candidates in the running that has executive experience in both running a City and a State. She is also a common sense feminist who's first veto as Governor was used to block legislation that would have barred the state from granting benefits to the partners of gay state employees. In effect, her veto granted State of Alaska benefits to same-sex couples. The veto occurred after Palin consulted with Alaska's attorney general on the constitutionality of the legislation.\n \n Her Energy and environmental Policies are common sense and impeccable as they are right in line with the majority of the American people on both sides of the political aisle.\n Energy policies\n Palin has strongly promoted oil resource development in Alaska, but also helped pass a tax increase on oil company profits.[13][15] Palin has announced plans to create a new sub-cabinet group of advisors, to address climate change and reduce greenhouse gas emissions within Alaska.[18]\n Shortly after taking office, Palin rescinded thirty-five appointments made by Murkowski in the last hours of his administration, including the appointment by Murkowski of his former chief of staff James \"Jim\" Clark to the Alaska Natural Gas Development Authority.[19][20] Clark later pled guilty to conspiring with a defunct oil-field-services company to channel money into Frank Murkowski's re-election campaign.[21]\n In March 2007, Palin presented the Alaska Gasline Inducement Act (AGIA) as the new legal vehicle for building a natural gas pipeline from the state's North Slope. [22] This nixed a deal by the previous governor to grant the contract to a coalition including BP (her husband's seasonal employer). Only one legislator, Representative Ralph Samuels, voted against the measure,[23] and in June Palin signed it into law.[24][25] On January 5, 2008, Palin announced that a Canadian company, TransCanada Corp., was the sole AGIA-compliant applicant.[26][27] In August of 2008 Palin signed a bill into law giving the state of Alaska authority to award TransCanada Pipelines a license to build and operate the $26-billion-dollar pipeline to ship natural gas from the North Slope to the Lower 48, through Canada. [28]\n In response to high oil and gas prices, and in response to the resulting state government budget surplus, Palin proposed giving Alaskans $100-a-month energy debit cards. She also proposed providing grants to electrical utilities so that they would reduce customers' rates.[29] She subsequently dropped the debit card proposal, and in its place she proposed to send Alaskans $1,200 directly and eliminate the gas tax.[30][31]http://en.wikipedia.org/wiki/Sarah_Palin\n \n This truly changes the whole flavor of this race in ways that I never imagined possible. With the insignificant bump that Obama got after dominating the Press this past week with the pick of Biden and the Dems Convention, I already believed that this was McCains to lose, but with the quality of this VP choice, the complete dynamic of the race has turned completely in McCains favor. Can you imagine the Biden attack dog going after her in debate in his ruthless manner and turning every voting woman, and many men in America off as they see these allegedly pro feminist liberals beating up this woman? It can only work against them in the end.\n \n Oh, and one more thing. This choice is solid evidence that in McCain, the American people wont be getting 4 or 8 more years of the same, penfold. :)", 
   {}, 
   321784, 
   null, 
   1220046480.0
  ], 
  [
   321797, 
   null, 
   "numbertengi", 
   "All I can say is Hooray ! Sarah Palin for VP and Congratulations President McCainemoticon_smile", 
   {
    "post_info": {
     "post_title": "All I can say"
    }
   }, 
   321767, 
   null, 
   1220049360.0
  ], 
  [
   321805, 
   null, 
   "DrD", 
   "My wife and I watched with great anticipation the announcement of McCain's VEEP. It was the greatest surprise in the world to see this particular person stand beside Mr. McCain. As two democrats we could not be more pleased with his choice. We look forward to the debates and the election.\n \n It will be no surprise to us how the right will attempt to denegrate the left during this convention next week if they choose to use their \"Rove\" techniques. We will be looking for plans, goals and \"Americanism\" from the convention. The Limbaughs and the O'Riellys keep a divide among the citizens of this country while they enrich themselves beyond belief. \n \n Wouldn't it be great if we ALL could rise above the hate mongering and use our REAL brains to elect a president and VP rather than being spoon fed hatred to weaken our resolve to work together. Of course, politics run deeply through the souls of men just like religion. After a point of view is engrained it's all but impossible to remove it. \n \n If you ever have the chance, Steve Allen, wrote a book back in the '90's entitled Dumbth. He uses examples of how individuals have literally stopped thinking. . . .(It wasn't about politics.) He gives many examples of just plan duh. A good read.", 
   {}, 
   321797, 
   null, 
   1220053860.0
  ], 
  [
   321809, 
   null, 
   "Foxtuba", 
   "My God, there are going to be some severely disappointed people after November. Let's just say that with the ratio of people excited about Obama versus those not so enthralled about McCain's nomination, Archangel is going to be praying everyday for the rapture (and is much more likely to receive WWIII)...or maybe another cheating scheme in the voting system by the Karl Rove machine (hanging chads in 2000, electronic machines in 2004...switching total votes for Obama with McCain's total votes to allow McCain to win???)\n \n The argument I cannot seem to comprehend is all about experience. How does experience always regard a good trait? Last time I checked, there are experienced slanderer, experienced child molesters, and experienced political manipulators. McCain sure has been in the senate for a long time, and he has produced very little, mostly because it's nearly impossible for anything to get passed in a dichotomy like the US Senate. Obama is trying to adapt a different agenda, which is, \"I don't know what the mutual solution will be, but we need to come together and figure this out.\" Unfortunately, people find it more important to insult Obama's name, or McCain's age (who cares if he's old, but does he have the endurance for the presidential position, and does he have the mental capacity that he once had to go for his own convictions instead of constantly pandering to the conservatives?) and even talk about about Palin's familial situation than talk about their issues and potential efficiency in the white house. It makes me sick to the stomach. \n \n Oh well, a lot is screwed up in this world...That's why I get a kick out of reading Sam Harris' Letter to a Christian Nation...there is so much to learn from that book, like if humans were really created by God, he must really have an asinine personality. Just look at a map of where all religions still exist in the world, and then listen to Sean Hannity for about 30 seconds, and then you'll understand the incredulity of both evolution and creation and accept that the universe is pretty messed up.", 
   {}, 
   321797, 
   null, 
   1220054460.0
  ], 
  [
   321810, 
   null, 
   "Foxtuba", 
   "My wife and I watched with great anticipation the announcement of McCain's VEEP. It was the greatest surprise in the world to see this particular person stand beside Mr. McCain. As two democrats we could not be more pleased with his choice. We look forward to the debates and the election.\n \n It will be no surprise to us how the right will attempt to denegrate the left during this convention next week if they choose to use their \"Rove\" techniques. We will be looking for plans, goals and \"Americanism\" from the convention. The Limbaughs and the O'Riellys keep a divide among the citizens of this country while they enrich themselves beyond belief. \n \n Wouldn't it be great if we ALL could rise above the hate mongering and use our REAL brains to elect a president and VP rather than being spoon fed hatred to weaken our resolve to work together. Of course, politics run deeply through the souls of men just like religion. After a point of view is engrained it's all but impossible to remove it. \n \n If you ever have the chance, Steve Allen, wrote a book back in the '90's entitled Dumbth. He uses examples of how individuals have literally stopped thinking. . . .(It wasn't about politics.) He gives many examples of just plan duh. A good read.\n\n \n A sound response! Funny how we both wrote a fair amount and posted at the same time....as for the book by Steve Allen, I definitely want to check it out. Thanks for the recommendation!", 
   {}, 
   321805, 
   null, 
   1220054580.0
  ], 
  [
   321819, 
   null, 
   "DrD", 
   "A sound response! Funny how we both wrote a fair amount and posted at the same time....as for the book by Steve Allen, I definitely want to check it out. Thanks for the recommendation!\nWell, I can add that like they say about great minds. . . . . \n \n It's time this political disdain for each other STOPS! Are we so damn dumb as to listen to these war mongers just to keep the hate fires burning? Someone please, for god's sake, tell me how these manipulators of truth and media liars help this country? How does Hannity help anyone other than himself? Or Limbaugh? They don't help, they divide, they get richer off the masses who simply want to be \"entertained\"......I mention the right because they own the airwaves. \n \n I'm convinced that due to the laziness or inability to think for ourselves, the media elects presidents. Has anyone noticed how CNN has tried to maintain controversy between the Clinton and Obama camps? They made-up problems between the two just to keep people tuned in. How desperate is this? I too am a democrat but I refuse to be sucked in to non-existent problems. It will be interesting to watch how many uprisings CNN & Fox can sustain for the next 66 days.", 
   {}, 
   321810, 
   null, 
   1220060100.0
  ], 
  [
   321825, 
   null, 
   "Archangel", 
   "Well, I can add that like they say about great minds. . . . . \n \n It's time this political disdain for each other STOPS! Are we so damn dumb as to listen to these war mongers just to keep the hate fires burning? Someone please, for god's sake, tell me how these manipulators of truth and media liars help this country? How does Hannity help anyone other than himself? Or Limbaugh? They don't help, they divide, they get richer off the masses who simply want to be \"entertained\"......I mention the right because they own the airwaves. \n \n I'm convinced that due to the laziness or inability to think for ourselves, the media elects presidents. Has anyone noticed how CNN has tried to maintain controversy between the Clinton and Obama camps? They made-up problems between the two just to keep people tuned in. How desperate is this? I too am a democrat but I refuse to be sucked in to non-existent problems. It will be interesting to watch how many uprisings CNN & Fox can sustain for the next 66 days.\n\n \n I guess it's beyond you to recognize from your own words, that as you call for this political disdain for each others political party to STOP, You proceed to trash the political opposition. Shouldn't the end to the insults and personal attacks start with you, if it is you who is so enlightened as to recognize the need for change?\n \n And as for how Hannity and Limbaugh helps people other than themselves, it's by exposing the lies and hypocrisy of the tax and spend liberals who will become the problem rather than the solution if they gain control of the Whitehouse. The dems love to point out that Bush has a 39% approval rating, while hoping that nobody notices that the Democratically controlled Congress has only a 12% approval rating. So much for personal introspection, huh!", 
   {}, 
   321819, 
   null, 
   1220063100.0
  ], 
  [
   321826, 
   null, 
   "Archangel", 
   "My God, there are going to be some severely disappointed people after November. \n\n \n Uh yuhhh, there sure are going to be, and their gonna be Obamanuts. Your messiah is goin down now that the teams have been picked and the game has started. Just wait and see the poll numbers based on McCain's announcement of Palin compared to Obama's poll numbers after nominating Biden. The only sounds you heard after Bidens announcement were YAWNS, and crickets chirping.", 
   {}, 
   321825, 
   null, 
   1220063700.0
  ], 
  [
   321832, 
   null, 
   "Foxtuba", 
   "I guess it's beyond you to recognize from your own words, that as you call for this political disdain for each others political party to STOP, You proceed to trash the political opposition. Shouldn't the end to the insults and personal attacks start with you, if it is you who is so enlightened as to recognize the need for change?\n \n And as for how Hannity and Limbaugh helps people other than themselves, it's by exposing the lies and hypocrisy of the tax and spend liberals who will become the problem rather than the solution if they gain control of the Whitehouse. The dems love to point out that Bush has a 39% approval rating, while hoping that nobody notices that the Democratically controlled Congress has only a 12% approval rating. So much for personal introspection, huh!\n\n \n The Congress is not controlled by Democrats. Get yer facts straight.", 
   {}, 
   321825, 
   null, 
   1220068020.0
  ], 
  [
   321835, 
   null, 
   "Foxtuba", 
   "Uh yuhhh, there sure are going to be, and their gonna be Obamanuts. Your messiah is goin down now that the teams have been picked and the game has started. Just wait and see the poll numbers based on McCain's announcement of Palin compared to Obama's poll numbers after nominating Biden. The only sounds you heard after Bidens announcement were YAWNS, and crickets chirping.\n\n \n A substantial ouch for you're(HAHA DELIBERATE GRAMMAR MISTAKE) wrong use of they're. Secondly, he is not my messiah, just a much, much more viable candidate than McCain. It's like Bush, only older and more senile. Thirdly, polls mean naught. It's fun to say that I get excited when my preferred candidate moves ahead, or I get infuriated when the opposing candidate does likewise, but the only numbers that matter are the ones tallied after election day. I was devastated when Gore lost, disgruntled when Kerry was chosen to run against Bush, but if McCain and his subservient lady are elected, then....oh, whatever, this world is screwed up as is. \n \n Alright, so instead of using Hannity or Limburger or Bill O'Really's talking points, would you like to share your own thoughts?", 
   {}, 
   321826, 
   null, 
   1220068440.0
  ], 
  [
   321838, 
   null, 
   "Archangel", 
   "The Congress is not controlled by Democrats. Get yer facts straight.\n\n \n Sorry tuba, but it's you who needs to get your facts straight. You see, politics 101 teaches you that the majority party leads the House and the majority party leads the Senate. Nancy Pelosi, a Democrat, is the Speaker of the House, and Harry Reid, a Democrat, is the Senate Majority Leader. The only reason they hold the top jobs is because for another couple of months, they control those institutions.\n \n http://speaker.house.gov/\n \n http://reid.senate.gov/", 
   {}, 
   321832, 
   null, 
   1220069640.0
  ], 
  [
   321847, 
   null, 
   "Foxtuba", 
   "Sorry tuba, but it's you who needs to get your facts straight. You see, politics 101 teaches you that the majority party leads the House and the majority party leads the Senate. Nancy Pelosi, a Democrat, is the Speaker of the House, and Harry Reid, a Democrat, is the Senate Majority Leader. The only reason they hold the top jobs is because for another couple of months, they control those institutions.\n \n http://speaker.house.gov/\n \n http://reid.senate.gov/\n\n \n Alright, apparently you haven't taken Logic 101. Harry Reid and Nancy Pelosi have fallen into the shackles of Bush's regime. They do not have the confidence to do anything right. The reason being is in fact the Democrats do not have control of the senate. If you include Libermann as a Republican (because he is not a Democrat, and I wish he was at least an independent), and you leave Bernie Sanders as an independent, you have 49 D, 50 R, and 1 independent. Not only is that not majority, but that is obviously not evidence of control for the democrats (anyone in 8th grade history can see that, so you may have to start over). \n \n \n Ergo, Congress has a low rating not because of the Democrats, but because of the ridiculous dichotomy between Republicans and Democrats that God would be shamed of, except that if there was a God, he would be kicking back with a martini and laughing his head off while humans bicker in his universe monitor. \n \n Game, set, and match. You can take care of the manicure that my nails so desperately need.", 
   {}, 
   321838, 
   null, 
   1220076840.0
  ], 
  [
   321850, 
   null, 
   "Archangel", 
   "Alright, apparently you haven't taken Logic 101. Harry Reid and Nancy Pelosi have fallen into the shackles of Bush's regime. They do not have the confidence to do anything right. The reason being is in fact the Democrats do not have control of the senate. If you include Libermann as a Republican (because he is not a Democrat, and I wish he was at least an independent), and you leave Bernie Sanders as an independent, you have 49 D, 50 R, and 1 independent. Not only is that not majority, but that is obviously not evidence of control for the democrats (anyone in 8th grade history can see that, so you may have to start over). \n \n \n Ergo, Congress has a low rating not because of the Democrats, but because of the ridiculous dichotomy between Republicans and Democrats that God would be shamed of, except that if there was a God, he would be kicking back with a martini and laughing his head off while humans bicker in his universe monitor. \n \n Game, set, and match. You can take care of the manicure that my nails so desperately need.\n\n \n With all do respect tuba, you are full of crapola. I'm actually shocked that you would see the current links that proclaim that the Speaker of the House and the Senate Majority Leader are both democrats in my post above and would continue to argue this issue. You are even less informed than I imagined. Not only is Lieberman a registered INDEPENDENT, but he is registered as an I/D INDEPENDENT DEMOCRAT in the Senate Registry below which gives the democrats the legal majority and therefore control of the Senate. How you could refer to him as a republican, is beyond me. The fact is undeniable that if the Republicans had the numerical majority there is absolutely no way they would just sit by and allow Harry Reid, an avowed enemy of conservatism to call himself the Senate Majority Leader, nor would they allow him to exercise the authority or the responsibilities of the Senate Majority Leader. Now stop attempting to manipulate the facts just to cover the fact that you don't know which political party controls the house and senate. As you say, GAME, SET AND MATCH. \n \n In the House of Representatives: 435 Incumbent Representatives\n 235 Democratic\n 199 Republican\n 1 Vacant House Seat\n And here's another link to support what I'm saying.\n http://www.thegreenpapers.com/G08/House.phtml?v=c&p=NPA\n \n In the Senate: \n 49 Democrats\n 1 Independent Democrat\n 1 Independant\n 49 Republicans\n But here's the rub. Joseph Lieberman, who had a falling out with the democratic party in 2006 over his support for the War, ran as an independent and won. So although He's an Independent by Party affiliation, he identifies and is counted as an Independent Democrat. So the totals are 50/49/1 in favor of the Democrats which gives them the majority.\n In 2006, Senator Lieberman was elected to a fourth term as an Independent, because of the strength of his record and his accomplishments for the state. He won the general election by more than 100,000 votes. He remains committed to caucusing with Senate Democrats, but will be identified as an Independent Democrat (ID-CT).See Lieberman biography, top left side of page under his name: http://lieberman.senate.gov/\n \n Link to Senate members and party affiliation: http://www.senate.gov/general/contact_information/senators_cfm.cfm?OrderBy=party&Sort=ASC", 
   {}, 
   321847, 
   null, 
   1220084940.0
  ], 
  [
   321896, 
   null, 
   "T.Q", 
   "She seems like the perfect running mate for McCain:\n Denies global warming could be man made\n Thinks ID/creationism should be taught in schools\n supports drilling in the ANWR rather than alternative energy R & D\n wants to overturn Roe v Wade\n \n All in all, a typical neo con candidate. What happened to real Republicans? Are they extinct?", 
   {}, 
   321850, 
   null, 
   1220122740.0
  ], 
  [
   321909, 
   null, 
   "jyoshu", 
   "She seems like the perfect running mate for McCain:\n Denies global warming could be man made\n Thinks ID/creationism should be taught in schools\n supports drilling in the ANWR rather than alternative energy R & D\n wants to overturn Roe v Wade\n \n All in all, a typical neo con candidate. What happened to real Republicans? Are they extinct?\n\n \n At least she's in a party that makes room for pro-lifers AND pro-choicers, isn't bought off by the global warming industry, and willing to even consider drilling the tiny dot of land relatively speaking that ANWR is. Republicans let pro-choicers speak at their conventions; Dems NEVER let pro-lifers speak at theirs.", 
   {}, 
   321896, 
   null, 
   1220126700.0
  ], 
  [
   321919, 
   null, 
   "T.Q", 
   "At least she's in a party that makes room for pro-lifers AND pro-choicers,\n\n It's also the party that makes room for creationism. Options are not neccesarily a good thing. Pro-choice pretty much covers the options, doesn't it?\n \n \nisn't bought off by the global warming industry,\n\n Global warming is an industry now? And how is it a bad thing to try and minimize the footprint of the human race?\n \n \nand willing to even consider drilling the tiny dot of land relatively speaking that ANWR is.\n\n And once again, how is it a good thing to drill in a nature preserve for oil which will have little to no effect on supply and demand instead of concentrating on getting off the oil teat? Is it better to just ignore the problem?", 
   {}, 
   321909, 
   null, 
   1220131920.0
  ], 
  [
   321924, 
   null, 
   "DrD", 
   "She seems like the perfect running mate for McCain:\n Denies global warming could be man made\n Thinks ID/creationism should be taught in schools\n supports drilling in the ANWR rather than alternative energy R & D\n wants to overturn Roe v Wade\n \n All in all, a typical neo con candidate. What happened to real Republicans? Are they extinct?\nYou're right! Between 8 years of Bush and the \"idea\" of another 4 years of McCain and what's her name, we're going back a couple of thousand years to satisfy the gov-mint. This is sooooo sad! Guess the world is beginning to laugh at us one more time. The neo-cons got rid of the real republicans. . . .like they're going to get rid of science.", 
   {}, 
   321896, 
   null, 
   1220135340.0
  ], 
  [
   321925, 
   null, 
   "jyoshu", 
   "It's also the party that makes room for creationism. Options are not neccesarily a good thing. Pro-choice pretty much covers the options, doesn't it?\n\n \n Apparently not, since they don't give speaking time to pro-life democrats. And yes, Republicans are not intolerant toward those who believe the universe was created. On the other hand, there are plenty of Republicans who hold to the view of evolution.\n \n \nAnd how is it a bad thing to try and minimize the footprint of the human race?\n\n \n But you said they didn't hold to the idea of MAN-MADE global warming earlier. That doesn't mean they don't believe the human race should try and minimize the footprint. On the other hand, all those private jets and high-carbon foot-print homes of people like Gore and others who make speak out against global warming is interesting. (Though Gore did change his home some when people started bringing his hypocrisy to light over it.) I'm not sure which is worse: not speaking out against global warming, or doing so and not really meaning it. (Perhaps for the purpose of politics?)\n \n \nAnd once again, how is it a good thing to drill in a nature preserve for oil which will have little to no effect on supply and demand instead of concentrating on getting off the oil teat? Is it better to just ignore the problem?\n\n \n The point is that it will affect prices, and that will, in turn, help the economy, which will, in turn, give more opportunity to help the energy crisis. Remember, gas prices started going down at the just the TALKING about drilling; we can't get off oil instantly--we still need oil as we achieve energy independence. And importing so much of it obviously isn't working out so well.", 
   {}, 
   321919, 
   null, 
   1220136000.0
  ], 
  [
   321926, 
   null, 
   "DrD", 
   "At least she's in a party that makes room for pro-lifers AND pro-choicers, isn't bought off by the global warming industry, and willing to even consider drilling the tiny dot of land relatively speaking that ANWR is. Republicans let pro-choicers speak at their conventions; Dems NEVER let pro-lifers speak at theirs.\nYou know Jyoshu, if pro-life AND pro-choice decisions were the most important issues then I'd agree with you. What the neo-cons want to do is ignore ALL OF THE BIG ISSUES and focus on the \"smaller issues\" or political non-issues. \n \n It's as though Clinton's personal life trumped everything he did politically. However for the past eight years we had a (ahem) moral type in the WH and the country is down the tubes. . unnecessary war, economy down the tubes, gas at $4, forclosures at an all time high, bankrupties at 1.85 million this year. But let's forget all of that. We need another one just like him for another 4 years. That damn Clinton in all his personal problems. . . . .what a friggen joke. Religious belief has been taken to the streets of America as though we lived in Iraq or Iran. Afterall, that's all thats important. God almighty, 1/2 of the US has absolutely lost their minds.\n \n You know, if I had a choice I'd take a president with his own personal demons rhather than one who is a stubborn idiot and has put us in ruin!", 
   {}, 
   321909, 
   null, 
   1220136000.0
  ], 
  [
   321940, 
   null, 
   "T.Q", 
   "Apparently not, since they don't give speaking time to pro-life democrats. And yes, Republicans are not intolerant toward those who believe the universe was created. On the other hand, there are plenty of Republicans who hold to the view of evolution.\n\n Doe pro-choice mean \"you must have an abortion\"? No, it means the option is there-you have the choice between having or not having an abortion. What other options are available that the pro-life option covers that aren't covered by pro-choice? (I thought this was pretty straight-forward the first time I asked the question)\n \n \n \n \nBut you said they didn't hold to the idea of MAN-MADE global warming earlier.\n\n I did. How does this alter my question at all? Either it's man made and it's imperative we change our behaviour before it's too late, or it's not man made, but we should still change our behaviour to minimize our impact. How does this invalidate my question of \"how is it a bad thing to try and minimize the footprint of the human race?\"\n \n \nOn the other hand, all those private jets and high-carbon foot-print homes of people like Gore and others who make speak out against global warming is interesting. (Though Gore did change his home some when people started bringing his hypocrisy to light over it.) I'm not sure which is worse: not speaking out against global warming, or doing so and not really meaning it. (Perhaps for the purpose of politics?)\n\n Is Gore running for office? Nope, which means this is a pretty poor attempt at deflecting a very straight-forward question.\n \n \n \n \nThe point is that it will affect prices, and that will, in turn, help the economy, which will, in turn, give more opportunity to help the energy crisis.\n\n Estimates I've seen put any oil coming out of ANWR about 5-7 years down the road, and it would be a paltry amount of oil at that.\n \n \nRemember, gas prices started going down at the just the TALKING about drilling;\n\n Remember, oil prices are being driven primarily by speculators.\n \n \nwe can't get off oil instantly--we still need oil as we achieve energy independence. And importing so much of it obviously isn't working out so well.\n\n And you don't have enough oil, or enough time to develop the oil, to become energy independent. So why concentrate on further developing paltry oil fields in areas which are designated preserves instead of concentrating on economically and environmentally feasible alternative energy solutions?", 
   {}, 
   321925, 
   null, 
   1220145840.0
  ], 
  [
   321941, 
   null, 
   "Shooterandproud", 
   "Personally, I don't care for Mccain's new VP. On the surface, it seems good. McCain picked an inexperienced woman, something different for a change. However, when I looked at the views of his new VP, I changed my mind. Creationist? Anti-Abortionist? No thank you. Being Pro-life and especially a creationist is not such a great way to prove your intelligence. At least Obama didn't pick a VP with such crazy views. What's next, a Pro-Tooth Fairy VP?", 
   {}, 
   321940, 
   null, 
   1220146260.0
  ], 
  [
   322013, 
   null, 
   "jyoshu", 
   "Personally, I don't care for Mccain's new VP. On the surface, it seems good. McCain picked an inexperienced woman, something different for a change. However, when I looked at the views of his new VP, I changed my mind. Creationist? Anti-Abortionist? No thank you. Being Pro-life and especially a creationist is not such a great way to prove your intelligence. At least Obama didn't pick a VP with such crazy views. What's next, a Pro-Tooth Fairy VP?\n\n \n She's also pro-gun rights, something you have made pretty clear that you champion.", 
   {}, 
   321941, 
   null, 
   1220214120.0
  ], 
  [
   322014, 
   null, 
   "jyoshu", 
   "Doe pro-choice mean \"you must have an abortion\"? No, it means the option is there-you have the choice between having or not having an abortion. What other options are available that the pro-life option covers that aren't covered by pro-choice? (I thought this was pretty straight-forward the first time I asked the question)\n\n \n It's not a question of options, but of emphasis. Republicans have speakers who emphasize the importance of choice, but Democrats won't have speakers who emphasize the importance of life, when both are part of the issue. In other words, Republicans, at least in terms of having speakers, are more tolerant in this case of other ways of looking at the issue than Democrats are being. I don't think allowing pro-life speakers at conventions would be such an awful thing.\n \n \nI did. How does this alter my question at all? Either it's man made and it's imperative we change our behaviour before it's too late, or it's not man made, but we should still change our behaviour to minimize our impact.\n\n \n Right, so if behavior should be changed REGARDLESS, then whether or not someone thinks MAN caused the problem to begin with isn't important. That's why I took issue with you using that distinction.\n \n \nEstimates I've seen put any oil coming out of ANWR about 5-7 years down the road, and it would be a paltry amount of oil at that.\n\n \n And so if we'd started 5-7 years ago, we'd be seeing the results now. But it's not just about ANWR. ANWR is only one piece of a much larger puzzle; it's been estimated there are hundreds of years worth (at least) of oil to be drilled off the coast and in other places; we need to open all these up to oil exploration. \n \n \nSo why concentrate on further developing paltry oil fields in areas which are designated preserves instead of concentrating on economically and environmentally feasible alternative energy solutions?\n\n \n Because we're still going to be on oil for a long time, even if we put our best efforts into energy alternatives. It's just being realistic. Changing is going to take a lot of time; it's not like throwing a switch.", 
   {}, 
   321940, 
   null, 
   1220215020.0
  ], 
  [
   322039, 
   null, 
   "DrD", 
   "If, and I mean IF, abortion is a sin and murder, then god did NOT indicate it as such in the bible. And IF it is a sin, it is an individual matter not a matter to be regulated by the governemt because of a \"belief\". I would think what the bible (god) says about abortion would trump the fundies today. \n \n Guess not.", 
   {}, 
   322014, 
   null, 
   1220231040.0
  ], 
  [
   322054, 
   null, 
   "Archangel", 
   "If, and I mean IF, abortion is a sin and murder, then god did NOT indicate it as such in the bible. \n\n \n I'll let this biblical study on abortion speak for me as it clarifies what I believe to be scripturally true. And it shows that you have no idea what God indicated in His word regarding the murder of the unborn. http://www.dougbrittonbooks.com/onlinebiblestudies-cultureandsocietyinfluences/abortionoflifeinthewomb-sinandgodsforgiveness.asp", 
   {}, 
   322039, 
   null, 
   1220238300.0
  ], 
  [
   322055, 
   null, 
   "Archangel", 
   "She's also pro-gun rights, something you have made pretty clear that you champion.\n\n \n She's a life long member of the NRA and a serious Moose hunter. She's a dedicated right to bear arms advocate while Obama is just the opposite, other than offering lip service for the sake of garnering votes that is. But anyone who believes he would maintain a pro-gun stance if elected is just too young and inexperienced to understand that liberals will say or do anything to get elected, only to then fulfill their original and real agenda that is nothing like the political promises they made with a straight face to naive and gullible voters who were dumb enough to trust them.", 
   {}, 
   322013, 
   null, 
   1220238780.0
  ], 
  [
   322056, 
   null, 
   "GiantOreo", 
   "I'll let this biblical study on abortion speak for me as it clarifies what I believe to be scripturally true. And it shows that you have no idea what God indicated in His word regarding the murder of the unborn. http://www.dougbrittonbooks.com/onlinebiblestudies-cultureandsocietyinfluences/abortionoflifeinthewomb-sinandgodsforgiveness.asp\n\n God (if the OT is to be considered truth) didn't even consider infants under the age of one month to be human, dude. What do you think he thinks of blastulas and zygotes if he doesn't think month old CHILDREN are human?", 
   {}, 
   322054, 
   null, 
   1220239020.0
  ], 
  [
   322058, 
   null, 
   "CUNxTime", 
   "I'll let this biblical study on abortion speak for me as it clarifies what I believe to be scripturally true. And it shows that you have no idea what God indicated in His word regarding the murder of the unborn. http://www.dougbrittonbooks.com/onlinebiblestudies-cultureandsocietyinfluences/abortionoflifeinthewomb-sinandgodsforgiveness.asp\n\n \n Wasn't HE the one who killed everyone on earth (including Children and the Unborn) except Noah with the flood? (That is if one believes in the bible)", 
   {}, 
   322054, 
   null, 
   1220239620.0
  ], 
  [
   322059, 
   null, 
   "CUNxTime", 
   "But I am absolutely GIDDY with the fact that McCain will be the next pres. of the US!!! He's sealed the deal with his pick. McCain wasn't my first choice for pres. but against his competition, I'll take him every day of the week.", 
   {}, 
   322058, 
   null, 
   1220239680.0
  ], 
  [
   322061, 
   null, 
   "DrD", 
   "God (if the OT is to be considered truth) didn't even consider infants under the age of one month to be human, dude. What do you think he thinks of blastulas and zygotes if he doesn't think month old CHILDREN are human?\nExactly. The reference given certainly highlights specific parts regarding life but in no way justifies the old testiment's view of god and killing the innocent. As always, we read and believe what agrees with us. The rest we through away. = convenient religion, not REAL religion. Real religion is something no one would want.", 
   {}, 
   322056, 
   null, 
   1220241960.0
  ], 
  [
   322062, 
   null, 
   "jyoshu", 
   "She's a life long member of the NRA and a serious Moose hunter. She's a dedicated right to bear arms advocate while Obama is just the opposite, other than offering lip service for the sake of garnering votes that is. But anyone who believes he would maintain a pro-gun stance if elected is just too young and inexperienced to understand that liberals will say or do anything to get elected, only to then fulfill their original and real agenda that is nothing like the political promises they made with a straight face to naive and gullible voters who were dumb enough to trust them.\n\n \n In past elections, opposing the right to adequately defend oneself has been devastating for Democrats. Most people are naturally going to want to fall on the side of liberty, particularly when it comes to people having the liberty to defend themselves. Obama has been very careful so far to avoid this issue as much as possible; it will be interesting to see how he responds in debate when pressed to give a straightforward and frank answer.", 
   {}, 
   322055, 
   null, 
   1220242320.0
  ], 
  [
   322073, 
   null, 
   "Archangel", 
   "God (if the OT is to be considered truth) didn't even consider infants under the age of one month to be human, dude. What do you think he thinks of blastulas and zygotes if he doesn't think month old CHILDREN are human?\n\n \n \nWasn't HE the one who killed everyone on earth (including Children and the Unborn) except Noah with the flood? (That is if one believes in the bible)\n\n \n \nExactly. The reference given certainly highlights specific parts regarding life but in no way justifies the old testiment's view of god and killing the innocent. As always, we read and believe what agrees with us. The rest we through away. = convenient religion, not REAL religion. Real religion is something no one would want.\n\n \n The link/bible study I posted gives adequate passages and explanations to explain the scriptural view on abortion. I know it wont mean much to the natural mind, but it is true none the less. Here it is once again in case you want to actually read it. It isn't lengthy at all. http://www.dougbrittonbooks.com/onlinebiblestudies-cultureandsocietyinfluences/abortionoflifeinthewomb-sinandgodsforgiveness.asp", 
   {}, 
   322062, 
   null, 
   1220248080.0
  ], 
  [
   322074, 
   null, 
   "GiantOreo", 
   "The link/bible study I posted gives adequate passages and explanations to explain the scriptural view on abortion. I know it wont mean much to the natural mind, but it is true none the less. Here it is once again in case you want to actually read it. It isn't lengthy at all. http://www.dougbrittonbooks.com/onlinebiblestudies-cultureandsocietyinfluences/abortionoflifeinthewomb-sinandgodsforgiveness.asp\n\n \n Funny how it makes no mention of the verses where God does not consider any infant under the age of one month to be worth anything.......................", 
   {}, 
   322073, 
   null, 
   1220248440.0
  ], 
  [
   322078, 
   null, 
   "Archangel", 
   "Funny how it makes no mention of the verses where God does not consider any infant under the age of one month to be worth anything.......................\n\n \n Why would it? Believers don't rip passages out of context in order to use them against God improperly, or unfairly. That is your forte. emoticon_rolleyes", 
   {}, 
   322074, 
   null, 
   1220249880.0
  ], 
  [
   322079, 
   null, 
   "GiantOreo", 
   "Why would it? \n Er, so it doesn't \"rip passages out of context\"? Durrrr. Get a clue Arch.\n \n \nBelievers don't rip passages out of context in order to use them against God improperly, or unfairly. That is your forte. emoticon_rolleyes\n\n \n Then what do you call your little article there? It ripped out every verse that agreed with its views while ignoring the verses (like the one I referred to) that disagree with their views. Seems like it is THEIR forte.", 
   {}, 
   322078, 
   null, 
   1220250000.0
  ], 
  [
   322081, 
   null, 
   "Archangel", 
   "Er, so it doesn't \"rip passages out of context\"? Durrrr. Get a clue Arch.\n \n Then what do you call your little article there? It ripped out every verse that agreed with its views while ignoring the verses (like the one I referred to) that disagree with their views. Seems like it is THEIR forte.\n\n \n No cookie, they speak within the parameters of Gods character/nature and refer to the proper context which they are speaking to.\n \n But let me ask you this; you will argue ad infinitum that God doesn't even exist, so why is it so important that you make an imaginary God seem evil too? Isn't killing Him enough for you? Must you slander and defame His character also? And isn't that the true definition of an evil nature Oreo? As you yourself encompass it?", 
   {}, 
   322079, 
   null, 
   1220251140.0
  ], 
  [
   322082, 
   null, 
   "GiantOreo", 
   "No cookie, they speak within the parameters of Gods character/nature and refer to the proper context which they are speaking to.\n And instances where God DOESN'T give any sort of value to even infants that are under a month old has NOTHING to do with God's character in the context of abortion? Riiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiggggggggggggggggggggggggggggghhhhhhhhhhhhhhhhhhhhhttttttttttttttttttttt.............................................................\n \n Get a clue dude.\n \n \n\n But let me ask you this; you will argue ad infinitum that God doesn't even exist, so why is it so important that you make an imaginary God seem evil too? Isn't killing Him enough for you? Must you slander and defame His character also? And isn't that the true definition of an evil nature Oreo? As you yourself encompass it?\n\n \n Er, so that others see what a d-bag fairy tale character they seem intent on worshiping as \"perfect\" and as their \"Father\" and \"Saviour\", etc.?", 
   {}, 
   322081, 
   null, 
   1220251920.0
  ], 
  [
   322083, 
   null, 
   "Archangel", 
   "And instances where God DOESN'T give any sort of value to even infants that are under a month old has NOTHING to do with God's character in the context of abortion? Riiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiggggggggggggggggggggggggggggghhhhhhhhhhhhhhhhhhhhhttttttttttttttttttttt.............................................................\n \n Get a clue dude.\n \n Er, so that others see what a d-bag fairy tale character they seem intent on worshiping as \"perfect\" and as their \"Father\" and \"Saviour\", etc.?\n\n \n I truly mourn for you cookie. I pity the emptiness and shallowness of your soul. emoticon_cry", 
   {}, 
   322082, 
   null, 
   1220252520.0
  ], 
  [
   324369, 
   null, 
   "simone", 
   "Bye! Bye! Palin!\n \n Her shrill cuteness has worn off and Americans are tired of her endless lying.\n \n Can the woman not utter one word of truth?", 
   {
    "post_info": {
     "post_title": "As I Said Under Another Topic"
    }
   }, 
   321767, 
   null, 
   1221939840.0
  ], 
  [
   324419, 
   null, 
   "DrD", 
   "Bye! Bye! Palin!\n \n Her shrill cuteness has worn off and Americans are tired of her endless lying.\n \n Can the woman not utter one word of truth?\nWell, she is a fundamental, bible-thumping holy-roller.", 
   {}, 
   324369, 
   null, 
   1221963240.0
  ], 
  [
   324456, 
   null, 
   "CUNxTime", 
   "I'll take Sara's outdated, religious lunacy over Obama's ridiculous, outdated socio-economic lunacy since HIS will affect our pockets and our way of life! Her may be silly, but its relatively harmless inasmuch as it can't effect us nearly as much as the socialization of our country.", 
   {}, 
   324419, 
   null, 
   1222009080.0
  ], 
  [
   324465, 
   null, 
   "Archangel", 
   "Bye! Bye! Palin!\n \n Her shrill cuteness has worn off and Americans are tired of her endless lying.\n \n Can the woman not utter one word of truth?\n\n \n Got a link for this claim as you attempt to speak for all of America?", 
   {}, 
   324369, 
   null, 
   1222011840.0
  ], 
  [
   324479, 
   null, 
   "simone", 
   "Just check the latest polls, Archie. Ongoing downward trend.\n \n Bidey Bye! Sarah, She Wolf.", 
   {}, 
   324465, 
   null, 
   1222019160.0
  ], 
  [
   324500, 
   null, 
   "ServantOfChrist", 
   "Just check the latest polls, Archie. Ongoing downward trend.\n \n Bidey Bye! Sarah, She Wolf.\n\n \n I'm not suprised you (and other feminists) dislike her, Simone. She is able to be respected in politics while maintaining a family (in other words is able to both be successful as well as be a woman with a husband and kids), and that is the very thing you feminists argue against in pounding on about how women shouldn't be \"tied down\" by families and how they need to be treated equally in the business/political world. Sarah Palin represents what you Feminists deny to be possible. Sucks for you.", 
   {}, 
   324479, 
   null, 
   1222028100.0
  ], 
  [
   324510, 
   null, 
   "chester", 
   "I'll take Sara's outdated, religious lunacy over Obama's ridiculous, outdated socio-economic lunacy since HIS will affect our pockets and our way of life! Her may be silly, but its relatively harmless inasmuch as it can't effect us nearly as much as the socialization of our country.\n\n \n You must be kidding, right?\n \n GWB has already turned this country socialist.\n \n Think about it. We the people own the banks, own the mortgages, own the insurance companies....\n \n And our kids and grandkids will be paying off his debts.\n \n This past week has seen the greatest expansion of government power since the New Deal.", 
   {}, 
   324456, 
   null, 
   1222030680.0
  ], 
  [
   324522, 
   null, 
   "jitobear", 
   "I don't think any of our candidates are anything to write home about - however McCain, Palin and the Republican party are foolishly ignoring a huge voting block that is likely to support Obama. Inner-city urban voters - - she blew them and their issues off in her speach at tne RNC. Damned fool thing to do.", 
   {}, 
   324510, 
   null, 
   1222033200.0
  ], 
  [
   324523, 
   null, 
   "isly ilwott", 
   "I don't think any of our candidates are anything to write home about - however McCain, Palin and the Republican party are foolishly ignoring a huge voting block that is likely to support Obama. Inner-city urban voters - - she blew them and their issues off in her speach at tne RNC. Damned fool thing to do.\nI don't recall her entire speech. Can you post the portion(s) of the speech that backs your claim?", 
   {}, 
   324522, 
   null, 
   1222033620.0
  ], 
  [
   324529, 
   null, 
   "chester", 
   "Just who do our pols think will pay the debt the country is taking on in order to rescue the banks, the brokers, the mortgage backers, the insurance companies, etc.\n \n To take on this debt while proclaiming they will simultaneously cut taxes is lunacy!emoticon_mad", 
   {}, 
   324523, 
   null, 
   1222034820.0
  ], 
  [
   324532, 
   null, 
   "Archangel", 
   "Just who do our pols think will pay the debt the country is taking on in order to rescue the banks, the brokers, the mortgage backers, the insurance companies, etc.\n \n To take on this debt while proclaiming they will simultaneously cut taxes is lunacy!emoticon_mad\n\n \n Speaking for your personal messiah, Barack Obama, it is YOU who will pay that bill. emoticon_xagree", 
   {}, 
   324529, 
   null, 
   1222035720.0
  ], 
  [
   324545, 
   null, 
   "Foxtuba", 
   "Speaking for your personal messiah, Barack Obama, it is YOU who will pay that bill. emoticon_xagree\n\n \n Helps when one's personal messiah lives in the twenty-first century.", 
   {}, 
   324532, 
   null, 
   1222046160.0
  ], 
  [
   324546, 
   null, 
   "Archangel", 
   "Helps when one's personal messiah lives in the twenty-first century.\n\n \n You constantly show your ignorance regarding spiritual truths tuba. Do you think hundreds of millions of believers in Jesus Christ follow and worship a dead Messiah. Well, sure you do because that's what you said above, but you couldn't be more wrong if you tried to be. My God is alive and well today and is still the Lord of all Time and Space, whether you're smart enough to recognize it or not. emoticon_rolleyes", 
   {}, 
   324545, 
   null, 
   1222047480.0
  ], 
  [
   324548, 
   null, 
   "T.Q", 
   "Speaking for your personal messiah, Barack Obama, it is YOU who will pay that bill. emoticon_xagree\n\n \n No Archie, you already have paid that bill", 
   {}, 
   324532, 
   null, 
   1222050360.0
  ], 
  [
   324749, 
   null, 
   "jitobear", 
   "I don't recall her entire speech. Can you post the portion(s) of the speech that backs your claim?\n\n \n The bit where she inderectly mocked Obama's efforts as a community organizer on the south side of Chicago.", 
   {}, 
   324523, 
   null, 
   1222130280.0
  ], 
  [
   324753, 
   null, 
   "chester", 
   "Speaking for your personal messiah, Barack Obama, it is YOU who will pay that bill. emoticon_xagree\n\n \n And you, and our children, and their children.\n \n The total for GWB's move to socialize the USA will total over $1T.", 
   {}, 
   324532, 
   null, 
   1222130760.0
  ], 
  [
   324835, 
   null, 
   "isly ilwott", 
   "The bit where she inderectly mocked Obama's efforts as a community organizer on the south side of Chicago.\nI did not infer that she was disrespecting the communities Obama may have organized. She was correctly dismissing the experience he had as insignificant when compared to actually serving as an executive administrator and taking on responsibility. Community Organizers have little else to do but shake hands, motivate people behind some social cause and move on to the next community. They don't actually make decisions or deal with crises. The have no responsibilities.\n \n I cannot interpret this as blowing off the entire south side. She was mocking his chest pounding and his claim to significant experience based on his skills as a non-executive.\n \n It is possible that Palin actually cares more for the people of the south side than does Obama.", 
   {}, 
   324749, 
   null, 
   1222189260.0
  ], 
  [
   324838, 
   null, 
   "Archangel", 
   "I did not infer that she was disrespecting the communities Obama may have organized. She was correctly dismissing the experience he had as insignificant when compared to actually serving as an executive administrator and taking on responsibility. Community Organizers have little else to do but shake hands, motivate people behind some social cause and move on to the next community. They don't actually make decisions or deal with crises. The have no responsibilities.\n \n I cannot interpret this as blowing off the entire south side. She was mocking his chest pounding and his claim to significant experience based on his skills as a non-executive.\n \n It is possible that Palin actually cares more for the people of the south side than does Obama.\n\n \n Regarding the bolded, based on the lasting positive impact Obamas community organizing had on Chicago's south side, it is very probable that your statement is 100% spot on correct.", 
   {}, 
   324835, 
   null, 
   1222190280.0
  ], 
  [
   324843, 
   null, 
   "DrD", 
   "It is possible that Palin actually cares more for the people of the south side than does Obama.\nAnything is possible but highly unlikely. It's amazing that no one would have heard the name \"Palin\" if McCain hadn't picked her as his VP. . . . .no one. Now that he's done that, just that, she is the greatest thing since sliced bread. Anything mentioned about her on the right has got to be true. . . .likewise anything on the left has got to be a lie. \n \n A mind is a terrible thing to waste.", 
   {}, 
   324835, 
   null, 
   1222191840.0
  ], 
  [
   324846, 
   null, 
   "Foxtuba", 
   "Anything is possible but highly unlikely. It's amazing that no one would have heard the name \"Palin\" if McCain hadn't picked her as his VP. . . . .no one. Now that he's done that, just that, she is the greatest thing since sliced bread. Anything mentioned about her on the right has got to be true. . . .likewise anything on the left has got to be a lie. \n \n A mind is a terrible thing to waste.\n\n \n If you want to hear an answer with absolutely no substance and thought, just listen to Palin's response to Charles Gibson's question on the Bush Doctrine. AA can't claim that Palin cares more for a group of people than does Obama when Palin doesn't know who she is caring for! I suppose she could be like Miss South Carolina and care for the world by sending them maps, such as South Africa and Iraq, such as bringing peace to the world, through maps.", 
   {}, 
   324843, 
   null, 
   1222192200.0
  ], 
  [
   324857, 
   null, 
   "isly ilwott", 
   "If you want to hear an answer with absolutely no substance and thought, just listen to Palin's response to Charles Gibson's question on the Bush Doctrine. AA can't claim that Palin cares more for a group of people than does Obama when Palin doesn't know who she is caring for! I suppose she could be like Miss South Carolina and care for the world by sending them maps, such as South Africa and Iraq, such as bringing peace to the world, through maps.\nIf you want to read the entire transcript of the interview rather than the edited version presented by ABC, you'll have to find it elsewhere. I could tell when watching it that it was a cut and paste production. If you would read of the recent clarifications of \"the Bush Doctrine\" on Wikipedia, you would understand that few people shared the same definition of it until recently. I wouldn't have expected anyone to be able to quote a definitive explaination of it.\n \n http://www.newsbusters.org/blogs/p-j-gladnick/2008/09/13/abc-news-edited-out-key-parts-sarah-palin-interview\n \n Here is the portion concerning the Bush Doctrine.\n \n \nGIBSON: Do you agree with the Bush doctrine?\n \n PALIN: In what respect, Charlie?\n \n GIBSON: The Bush &#8212; well, what do you interpret it to be?\n \n PALIN: His world view?\n \n GIBSON: No, the Bush doctrine, annunciated September 2002, before the Iraq War.\n \n PALIN: I believe that what President Bush has attempted to do is rid this world of Islamic extremism, terrorists who are hell-bent on destroying our nation. There have been blunders along the way, though. There have been mistakes made, and with new leadership, and that&#8217;s the beauty of American elections, of course, and democracy, is with new leadership comes opportunity to do things better.\n \n GIBSON: The Bush doctrine as I understand it is that we have the right of anticipatory self-defense, that we have the right to a preemptive strike against any country that we think is going to attack us. Do you agree with us?\n \n PALIN: Charlie, if there is legitimate and enough intelligent and legitimate evidence that tells us that a strike is imminent against American people, we have every right to defend our country.\n \n GIBSON: Do we have the right to be making cross-border attacks into Pakistan, from Afghanistan, with or without the approval of the Pakistani government?\n \n PALIN: As for our right to invade, we&#8217;re going to work with these countries, building new relationships, working with existing allies, but forging new also, in order to, Charlie, get to a point in this world, where war is not going to be a first option. In fact, war has got to be and military strike a last option.\n \n GIBSON: But governor, I am asking you, do we have the right, in your mind, to go across the border, with or without the approval of the Pakistani government?\n \n PALIN: In order to stop Islamic extremists, those terrorists who would seek to destroy America, and our allies, we must do whatever it takes, and we must not blink, Charlie. In making those tough decisions of where we go, and even who we target.\n \n GIBSON: And let me finish with this. I got lost in a blizzard of words there. Is that a yes, that you think we have the right to go across the border, with or without the approval of the Pakistani government? To go after terrorists who are in the Waziristan area?\n \n PALIN: I believe that America has to exercise all options in order to stop the terrorists who are hell-bent on destroying America, and our allies. We have got to have all options out there on the table.\n \nPlease explain why you think her response has \"abosolutely no substance and thought\".", 
   {}, 
   324846, 
   null, 
   1222195620.0
  ], 
  [
   324865, 
   null, 
   "simone", 
   "Palin didn't know what the damnable doctrine was at that point. If she's running for VP, she SHOULD have known. Hopefully she knows now.\n \n The Bush Doctrine: Hit People Before They Even Think About Hitting You\n \n The Bully doctrine. Palin has got to love that!", 
   {}, 
   324857, 
   null, 
   1222197360.0
  ], 
  [
   324869, 
   null, 
   "isly ilwott", 
   "If you want to hear an answer with absolutely no substance and thought, just listen to Palin's response to Charles Gibson's question on the Bush Doctrine. AA can't claim that Palin cares more for a group of people than does Obama when Palin doesn't know who she is caring for! I suppose she could be like Miss South Carolina and care for the world by sending them maps, such as South Africa and Iraq, such as bringing peace to the world, through maps.\nIt was I that claimed Palin may care more for the southsiders than does Obama. I claim that it is a possibility. I have not seen any evidence that Obama really cares for anyone. He appears to want nothing more than their votes.\n \n If he and Michelle care so much for other people, why is there no record of their actually helping other people? Compare the Obama's works with the McCain's work toward helping the poor and oppressed. Cindy McCain has apparently done more by herself to help poor people than the elite Obamas have done together. Show me some evidence that the Obamas actually spend personal time and personal money helping people.", 
   {}, 
   324846, 
   null, 
   1222197780.0
  ], 
  [
   324872, 
   null, 
   "isly ilwott", 
   "Palin didn't know what the damnable doctrine was at that point. If she's running for VP, she SHOULD have known. Hopefully she knows now.\n \n The Bush Doctrine: Hit People Before They Even Think About Hitting You\n \n The Bully doctrine. Palin has got to love that!\nApparently, she's not alone. I couldn't have quoted the Bush Doctrine off the cuff either prior to the recent hooplah. I know hundreds of others who couldn't have either.\n \n Additionally, by your paraphrasal of it, you have introduced yet another definition of it. I suppose anyone who runs for VP should be aware of every variation of it. \n \n Of course, in hindsight, now that we all know what it is and we should definitely call Palin an idiot for not knowing.emoticon_rolleyes\n \n After Gibson clarified and asked additional questions, it became obvious to me that she supports the doctrine of defending the US and she supports the idea of military actions being taken to do so.", 
   {}, 
   324865, 
   null, 
   1222198320.0
  ], 
  [
   324873, 
   null, 
   "DrD", 
   "I have not seen any evidence that Obama really cares for anyone.\nI'll bet you haven't looked too far have you?\n \n WORTH REPEATING: \n \nIt's amazing that no one would have heard the name \"Palin\" if McCain hadn't picked her as his VP. . . . .no one. Now that he's done that, just that, she is the greatest thing since sliced bread. Anything mentioned about her on the right has got to be true. . . .likewise anything on the left has got to be a lie. \n \n A mind is a terrible thing to waste. \n", 
   {}, 
   324872, 
   null, 
   1222198620.0
  ], 
  [
   324875, 
   null, 
   "isly ilwott", 
   "I'll bet you haven't looked too far have you?\n \n WORTH REPEATING:\nI shouldn't have to look for it. It should be evident in the record he presents to us...the record of his accomplishments...the record of his wife's accomplishments. I have seen nothing from either one of them.\n \n Contrast this to the record of Cindy McCain and the McCain's adopting children and it's easy to discern who actually cares for people.\n \n I don't know that Palin actually cares more for the people of the southside, but I also do not know that Obama cares for anyone except his own family.", 
   {}, 
   324873, 
   null, 
   1222198980.0
  ], 
  [
   324879, 
   null, 
   "simone", 
   "Apparently, she's not alone. I couldn't have quoted the Bush Doctrine off the cuff either prior to the recent hooplah. I know hundreds of others who couldn't have either.\n \n Additionally, by your paraphrasal of it, you have introduced yet another definition of it. I suppose anyone who runs for VP should be aware of every variation of it. \n \n Of course, in hindsight, now that we all know what it is and we should definitely call Palin an idiot for not knowing.emoticon_rolleyes\n \n After Gibson clarified and asked additional questions, it became obvious to me that she supports the doctrine of defending the US and she supports the idea of military actions being taken to do so.\n\n Neither could I, but....\n \n I am not a candidate for the post of Vice President of the United States of America!\n And, if I were, I would know the positions of my party internationally, domestically, et al.", 
   {}, 
   324872, 
   null, 
   1222200780.0
  ], 
  [
   324882, 
   null, 
   "DrD", 
   "Look, you obviously believe what you believe. Fine. If you want to vote for a governor who signs bills to offer bounty on wolves ($150 for a left front paw) go right ahead. Did you know hunters use helicopters and small planes to fly over wolves and shoot them? Did you know they leave the wolves to lie there and suffer until they die and then go back and pick them up? And she's not a pig? No, she's lower than a pig to actually endorse this by signing legistation for this. http://www.youtube.com/results?search_query=shooting+wolves+in+alaska&search_type=&aq=-1&oq= Here's your heroin at her best. You gotta be proud.\n \n If you want to vote for someone who really believes the earth was created 5000 years ago despite MOUNTAINS scientific EVIDENCE to the contrary, go right ahead. She'll lead this country right into the dark ages.\n \n So, if you want to vote for a redneck nose-picker, the booths will be open in November. Vote away.\n \n You admit knowing nothing about Obama. But you know little about Palin. To do and believe the things she does in 2008 is barbaric, antiquated and disguisting to civilized people. \n \n I don't intend to change your mind or anyone else's mind. But I will expose atrocious acts of cruelty which is fundamentally a part of the person's personality and from where her decisions come.", 
   {}, 
   324875, 
   null, 
   1222201200.0
  ], 
  [
   324883, 
   null, 
   "DrD", 
   "I am not a candidate for the post of Vice President of the United States of America![/COLOR][/SIZE][/B]\n And, if I were, I would know the positions of my party internationally, domestically, et al.\nWell, you would if you were a democrat.", 
   {}, 
   324879, 
   null, 
   1222201320.0
  ], 
  [
   324885, 
   null, 
   "isly ilwott", 
   "Neither could I, but....\n \n I am not a candidate for the post of Vice President of the United States of America!\n And, if I were, I would know the positions of my party internationally, domestically, et al.\nYou sound as if you think she should have known every version of it. Bullfeathers!\n \n She did respond to Gibson's questions in such a manner as to let me know that she does agree with \"the Bush Doctrine\" whether she can quote Gibson's definition of it or not. Your nitpicking is understandable though...you're seemingly against anything Republican.", 
   {}, 
   324879, 
   null, 
   1222201500.0
  ], 
  [
   324887, 
   null, 
   "isly ilwott", 
   "Look, you obviously believe what you believe. Fine. If you want to vote for a governor who signs bills to offer bounty on wolves ($150 for a left front paw) go right ahead. Did you know hunters use helicopters and small planes to fly over wolves and shoot them? Did you know they leave the wolves to lie there and suffer until they die and then go back and pick them up? And she's not a pig? No, she's lower than a pig to actually endorse this by signing legistation for this. http://www.youtube.com/results?search_query=shooting+wolves+in+alaska&search_type=&aq=-1&oq= Here's your heroin at her best. You gotta be proud.\nIf the wolves need culling, they need culling. Hunting and shooting them is very effective. The same happens to deer populations every year when hunters are issued tags (permits) to kill them. That you may be against hunting or guns or anything Republican doesn't make your argument any more valid than that of the other side. Maybe you should join PETA.\n \n \n \n\n If you want to vote for someone who really believes the earth was created 5000 years ago despite MOUNTAINS scientific EVIDENCE to the contrary, go right ahead. She'll lead this country right into the dark ages.\nHer religious beliefs have no bearing on my vote...either way.\n \n \n\n So, if you want to vote for a redneck nose-picker, the booths will be open in November. Vote away.\nYour characterization is childish.\n \n \n \n\n You admit knowing nothing about Obama. \nYou should pay attention more often. I admit to knowing NOTHING about the Obama's charity WORK. I know a lot about the Obamas. I know Obama is a Marxist. I know Obama hangs with a lot of people who hate the USA and what it stands for. I know Obama will ruin our economy for years to come with his socialistic push.\n \n \n \n But you know little about Palin. To do and believe the things she does in 2008 is barbaric, antiquated and disgusting to civilized people. \nI'm learning more each day. I already like her principles...and nobody's perfect. She's certainly not barbaric just because she kills moose and wolves. She may be antiquated in some ways. She is certainly not disgusting to all civilized people...just to the obstinate ones.\n \n \n \n\n I don't intend to change your mind or anyone else's mind. But I will expose atrocious acts of cruelty which is fundamentally a part of the person's personality and from where her decisions come.\nYes you do. That's why you present your hyperbole here. That an act is \"atrocious\" is subject to judgement. Unless you are a total vegetarian, you should not be bothered with the killing of animals", 
   {}, 
   324882, 
   null, 
   1222202940.0
  ], 
  [
   324892, 
   null, 
   "isly ilwott", 
   "Alaska has had wolf control measures since 1948. This is not a new plan by the evil Sarah Palin. \n \n http://www.wildlifenews.alaska.gov/index.cfm?adfg=wolf.control\n \n http://www.wildlifenews.alaska.gov/index.cfm?adfg=wolf.wolf_mgt\n \n If the wolves were left alone, the moose would disappear, then the wolves would disappear.\n \n \n Gov. Frank Murkowski previously signed a bill authorizing aerial hunting. Don't blame it blindly on Palin.\n http://query.nytimes.com/gst/fullpage.html?res=9801E7D7113EF937A25750C0A9629C8B63", 
   {
    "post_info": {
     "post_title": "Wolf control in Alaska"
    }
   }, 
   324887, 
   null, 
   1222203900.0
  ], 
  [
   324936, 
   null, 
   "Archangel", 
   "Look, you obviously believe what you believe. Fine. If you want to vote for a governor who signs bills to offer bounty on wolves ($150 for a left front paw) go right ahead. Did you know hunters use helicopters and small planes to fly over wolves and shoot them? Did you know they leave the wolves to lie there and suffer until they die and then go back and pick them up? And she's not a pig? No, she's lower than a pig to actually endorse this by signing legistation for this. http://www.youtube.com/results?search_query=shooting+wolves+in+alaska&search_type=&aq=-1&oq= Here's your heroin at her best. You gotta be proud.\n \n If you want to vote for someone who really believes the earth was created 5000 years ago despite MOUNTAINS scientific EVIDENCE to the contrary, go right ahead. She'll lead this country right into the dark ages.\n \n So, if you want to vote for a redneck nose-picker, the booths will be open in November. Vote away.\n \n You admit knowing nothing about Obama. But you know little about Palin. To do and believe the things she does in 2008 is barbaric, antiquated and disguisting to civilized people. \n \n I don't intend to change your mind or anyone else's mind. But I will expose atrocious acts of cruelty which is fundamentally a part of the person's personality and from where her decisions come.\n\n \n Here we go folks! Welcome to the world of Liberal Hypocrisy. You're the same people who will waste massive bandwidth defending the outright killing of innocent human babies in the womb as you finally show righteous indignation that wolf populations must be controlled in order to maintain a balanced wildlife population. \n \n And regarding the bolded, I don't know if you're joking or if you just really don't have a clue. What would you have them do, wound a wild carnivorous animal like a wolf, then rush up to it while it's still alive and attempt to carry it back that way? \n \n By culling a herd or a wolf pack, they are insuring the survival of the larger ecosystem of interdependent wild life. Why are liberals so blinded by feel good sensibilities that you sacrifice all common sense in favor of the irrational? All the while fighting for abortion and against the execution of mass murderers? Yet you can't even see how backwards and upside down your world view is!\n \n And just one more thing D, to answer your question directly. NO, she isn't a pig. She's what a rational person would call a \"realist\". Something that is a foreign concept to the looney leftists. emoticon_xdonno\n Wolves and bears are very effective and efficient predators on caribou, moose, deer and other wildlife. In most of Alaska, humans also rely on the same species for food. In Alaska's Interior, predators kill more than 80 percent of the moose and caribou that die during an average year, while humans kill less than 10 percent. In most of the state, predation holds prey populations at levels far below what could be supported by the habitat in the area. Predation is an important part of the ecosystem, and all ADF&G wolf management programs, including control programs, are designed to sustain wolf populations in the future.\n \n The Alaska Board of Game approves wildlife regulations through a public participation process. When the Board determines that people need more moose and/or caribou in a particular area, and restrictions on hunting aren't enough to allow prey populations to increase, predator control programs may be needed. Wolf hunting and trapping rarely reduces wolf numbers enough to increase prey numbers or harvests.\n \n Currently, five wolf control programs are underway that comprises about 9.4% of Alaska's land area. The programs use a closely controlled permit system allowing aerial or same day airborne methods to remove wolves in designated areas. In these areas, wolf numbers will be temporarily reduced, but wolves will not be permanently eliminated from any area. Successful programs allow humans to take more moose, and healthy populations of wolves to continue to thrive in Alaska.From isly's link http://www.wildlifenews.alaska.gov/index.cfm?adfg=wolf.control\n \n So to put this issue to rest once and for all, it isn't even the Governor who promotes this program, it's the Alaska Board of Game who's responsible for maintaining healthy wild life populations.", 
   {}, 
   324882, 
   null, 
   1222226820.0
  ], 
  [
   324944, 
   null, 
   "ServantOfChrist", 
   "Look, you obviously believe what you believe. Fine. If you want to vote for a governor who signs bills to offer bounty on wolves ($150 for a left front paw) go right ahead. Did you know hunters use helicopters and small planes to fly over wolves and shoot them? Did you know they leave the wolves to lie there and suffer until they die and then go back and pick them up? \n Would you like to know exactly what happens to the children you murder during abortions? You care more about animals than you do baby human beings. It's sick.\n \n \n \n \nAnd she's not a pig? No, she's lower than a pig to actually endorse this by signing legistation for this. http://www.youtube.com/results?search_query=shooting+wolves+in+alaska&search_type=&aq=-1&oq= Here's your heroin at her best. You gotta be proud.\n Obama is lower than a snake to vote against providing care for children - HUMAN BEINGS! - that survive abortions. He's lower than a snake for supporting the slaughter of unborn infants that rivals the Holocaust in the killing of innocent humans. He is absolutely disgusting.\n \n \n \nIf you want to vote for someone who really believes the earth was created 5000 years ago despite MOUNTAINS scientific EVIDENCE to the contrary, go right ahead. She'll lead this country right into the dark ages.\n \n So, if you want to vote for a redneck nose-picker, the booths will be open in November. Vote away.\n \n You admit knowing nothing about Obama. But you know little about Palin. To do and believe the things she does in 2008 is barbaric, antiquated and disguisting to civilized people. \n \n I don't intend to change your mind or anyone else's mind. But I will expose atrocious acts of cruelty which is fundamentally a part of the person's personality and from where her decisions come.\n\n \n Fearmongering.", 
   {}, 
   324882, 
   null, 
   1222230720.0
  ], 
  [
   324948, 
   null, 
   "Penfold", 
   "Would you like to know exactly what happens to the children you murder during abortions? You care more about animals than you do baby human beings. It's sick.\n \n \n \n Obama is lower than a snake to vote against providing care for children - HUMAN BEINGS! - that survive abortions. He's lower than a snake for supporting the slaughter of unborn infants that rivals the Holocaust in the killing of innocent humans. He is absolutely disgusting.\n \n \n \n \n Fearmongering.\n\n \n \n It isn't a baby or a child until it is born.\n \n Obama did no such thing.\n \n She's a lying whackjob.", 
   {}, 
   324944, 
   null, 
   1222232580.0
  ], 
  [
   324960, 
   null, 
   "gansao", 
   "It isn't a baby or a child until it is born. PENFOLD\n \n So until the baby is delivered, smacked by the midwife and nestled into the arms of mother it has no protection from these fates.\n \n \n Dilation and evacuation (D&E)\n \n This procedure is used later in pregnancy (usually after 20 weeks) when the baby's skeleton and nervous system are well developed. After dilation, forceps are inserted to crush the body and remove it, piece by piece, from the womb.\n \n Prostaglandins\n \n The use of prostaglandins is the most common form of late abortion in the UK. Prostaglandins are hormone-like substances administered to the pregnant woman through an intravenous drip or directly into the womb. Between 12 and 24 hours later, contractions occur, causing the premature birth of the baby. To make sure that the baby is not born alive, abortion doctors may poison the baby by injecting potassium chloride into the baby's heart or urea or salt solution into the amniotic sac.\n \n Brave new world!", 
   {}, 
   324948, 
   null, 
   1222253160.0
  ], 
  [
   324970, 
   null, 
   "chester", 
   "The above discussion properly belongs on another forum.", 
   {}, 
   324960, 
   null, 
   1222264680.0
  ], 
  [
   324971, 
   null, 
   "gansao", 
   "The above discussion properly belongs on another forum.\n\n \n Would that be another forum that you can avoid?\n You bang on about the rights of the individual woman to abort thier child but run away from the reality of what it means!\n \n If you deem it to be off topic. I refute that too . Maybe Governor Palin is pro life not because she is a religious nut but because she realises the real implications of abortions on demand. There back on topic!", 
   {}, 
   324970, 
   null, 
   1222264920.0
  ], 
  [
   324976, 
   null, 
   "Archangel", 
   "The above discussion properly belongs on another forum.\n\n \n \nWould that be another forum that you can avoid?\n You bang on about the rights of the individual woman to abort thier child but run away from the reality of what it means!\n\n \n You see gansao, like a typical leftist, chester doesn't want to actually have to face the reality of what his promotion of abortion represents. He loves to insist that a woman has the right to control her own body at the expense of her child's life, but any discussion of the process doesn't belong on these forums because he hates it when that is looked at or the evil of the techniques are exposed to the light of day. emoticon_frazzled", 
   {}, 
   324971, 
   null, 
   1222266300.0
  ], 
  [
   324978, 
   null, 
   "gansao", 
   "It doesnt take much digging to find out what a disgustingly violent procedure\n abortion is!\n I think these people must think the abortionist waves a magic wand and the child dissappears!", 
   {}, 
   324976, 
   null, 
   1222266720.0
  ], 
  [
   324999, 
   null, 
   "Archangel", 
   "It doesnt take much digging to find out what a disgustingly violent procedure\n abortion is!\n I think these people must think the abortionist waves a magic wand and the child dissappears!\n\n \n On the contrary, they know the truth. But being looney lefties, they prefer denial over reality. That's why chester suggested your description had no place here, because he doesn't like to be forced to consider what his doctrine of death actually represents in the real world. He prefers the delusion that all he is endorsing is a woman's right to control her own body. Self delusion is the friend of Liberalism. :(", 
   {}, 
   324978, 
   null, 
   1222271040.0
  ], 
  [
   325015, 
   null, 
   "gansao", 
   "\n If you want to vote for someone who really believes the earth was created 5000 years ago despite MOUNTAINS scientific EVIDENCE to the contrary, go right ahead. She'll lead this country right into the dark ages.\n \n \n \n \n \n .\n\n \n I find this comment quite interesting...modern science will lead us to believe that all of the universe can be squeezed into a point of infinitesimal size ie nothing!\n Some scientists explain the fact that we have a living Earth despite the odds of this occuring at, lets say billions to one( I dont think anyone has calculated the odds) is that there are an infinite number of universes!", 
   {}, 
   324882, 
   null, 
   1222276920.0
  ], 
  [
   325017, 
   null, 
   "Archangel", 
   "I find this comment quite interesting...modern science will lead us to believe that all of the universe can be squeezed into a point of infinitesimal size ie nothing!\n Some scientists explain the fact that we have a living Earth despite the odds of this occuring at, lets say billions to one( I dont think anyone has calculated the odds) is that there are an infinite number of universes!\n\n \n Add to that the fact that the big bang event defies all of the physical laws known to exist in this universe, yet they accept the proposition that from that infinitesimal point of matter, in a fraction of a milisecond, from the resulting expansion came the Universe we inhabit.", 
   {}, 
   325015, 
   null, 
   1222277400.0
  ], 
  [
   325021, 
   null, 
   "Foxtuba", 
   "On the contrary, they know the truth. But being looney lefties, they prefer denial over reality. That's why chester suggested your description had no place here, because he doesn't like to be forced to consider what his doctrine of death actually represents in the real world. He prefers the delusion that all he is endorsing is a woman's right to control her own body. Self delusion is the friend of Liberalism. :(\n\n \n It\\'s been documented that, before he betrayed Jesus, Judas called him a looney lefty because Jesus offered to pass him the mashed potatoes, and Judas saw this as a sign of socialism and ran off to conspire against him. During the meal, Jesus and his apostles came up with the term \"right-wing whackos\"....the depressing part of the story is that there were some mashed potatoes left over after the meal.", 
   {}, 
   324999, 
   null, 
   1222278120.0
  ], 
  [
   325027, 
   null, 
   "gansao", 
   "Add to that the fact that the big bang event defies all of the physical laws known to exist in this universe, yet they accept the proposition that from that infinitesimal point of matter, in a fraction of a milisecond, from the resulting expansion came the Universe we inhabit.\n\n \n \n Exactly..There are no truths in science it is a philosophy of theories that are \\'proved\\' when they fit into the frame, then disgarded when a later theory \\'proves they are wrong or semi disgarded when a new evidence comes to light.\n We all owe a great debt to science and technology but the modern scientists are becoming latter day high priests.\n Governor Palins beliefs does not mean that she does not believe in science, it means that she disagrees with that particular branch of science.", 
   {}, 
   325017, 
   null, 
   1222279080.0
  ], 
  [
   325028, 
   null, 
   "sinjin", 
   "Maybe Governor Palin is pro life not because she is a religious nut but because she realises the real implications of abortions on demand.\nTry getting an abortion \"on demand\" at 20 weeks. \n \n You guys crack me up. Keep it coming. We need to be reminded how your minds work. Science is questionable but all this superstitious nonsense represents the only plausible explanation. Oh, the irony. Classic comedy.", 
   {}, 
   324971, 
   null, 
   1222279140.0
  ], 
  [
   325029, 
   null, 
   "sinjin", 
   "Exactly..There are no truths in science it is a philosophy of theories that are \\'proved\\' when they fit into the frame, then disgarded when a later theory \\'proves they are wrong or semi disgarded when a new evidence comes to light.\n We all owe a great debt to science and technology but the modern scientists are becoming latter day high priests.\n \nKnowledge accumulates. Theories are revised, abandoned and replaced. Growth my friend. Something religion does only begrudgingly. Latter day priests indeed. Are you familiar with the excesses of the \"former day\" ones? If we know any \"truth\" at all it\\'s because of science not religion. You bet your life you owe science. \n \nGovernor Palins beliefs does not mean that she does not believe in science, it means that she disagrees with that particular branch of science.\nThe one well-supported by the others. You mean that one?\n \n Oh and why don\\'t they let the hunters shoot the moose and caribou from helicopters instead? Wounding wolves and letting them suffer so hunting will improve is just mean.", 
   {}, 
   325027, 
   null, 
   1222279380.0
  ], 
  [
   325030, 
   null, 
   "gansao", 
   "It's been documented that, before he betrayed Jesus, Judas called him a looney lefty because Jesus offered to pass him the mashed potatoes, and Judas saw this as a sign of socialism and ran off to conspire against him. During the meal, Jesus and his apostles came up with the term \"right-wing whackos\"....the depressing part of the story is that there were some mashed potatoes left over after the meal.\n\n \n \n I know that what you say is untrue because potato mashers were not available in Jerusalem until potatoes came to Jerusalem with the crusaders:)", 
   {}, 
   325021, 
   null, 
   1222279440.0
  ], 
  [
   325031, 
   null, 
   "sinjin", 
   "I know that what you say is untrue because potato mashers were not available in Jerusalem until potatoes came to Jerusalem with the crusaders:)\nNot true. Noah must have had potatoes on the ark. Right next to the Tasmanian tigers.", 
   {}, 
   325030, 
   null, 
   1222279860.0
  ], 
  [
   325033, 
   null, 
   "gansao", 
   "Try getting an abortion \"on demand\" at 20 weeks. \n \n .\n\n \n Abortion are available up to and beyond 20 weeks Whether it was easy or difficult to obtain makes no difference to the gruesome procedure", 
   {}, 
   325028, 
   null, 
   1222280160.0
  ], 
  [
   325035, 
   null, 
   "Foxtuba", 
   "I know that what you say is untrue because potato mashers were not available in Jerusalem until potatoes came to Jerusalem with the crusaders:)\n\n \n touche....you and your anachronistic observations!", 
   {}, 
   325030, 
   null, 
   1222280160.0
  ], 
  [
   325036, 
   null, 
   "gansao", 
   "Not true. Noah must have had potatoes on the ark. Right next to the Tasmanian tigers.\n\n \n Tasmanian tiger..they dont make marsupials like that anymore!", 
   {}, 
   325031, 
   null, 
   1222280220.0
  ], 
  [
   325041, 
   null, 
   "gansao", 
   "Knowledge accumulates. Theories are revised, abandoned and replaced. Growth my friend. Something religion does only begrudgingly. Latter day priests indeed. Are you familiar with the excesses of the \"former day\" ones? If we know any \"truth\" at all it's because of science not religion. You bet your life you owe science. .\n \n \n Cant really argue with that!When a scientific theory becomes a metaphysical postulate such as the big bang theory it somtimes requires us to believe something that is not only illogical but seemingly ridiculous. The scientist that promote these theories seem unaware of this and take themselves so seriously I would compare them to the high priests ! \n \nThe one well-supported by the others. You mean that one?.\n\n Sorry, sloppy writing. I mean that Governor Palins belief in the new world theory!\n \n \nOh and why don't they let the hunters shoot the moose and caribou from helicopters instead? Wounding wolves and letting them suffer so hunting will improve is just mean.\n\n \n Your right it is mean!", 
   {}, 
   325029, 
   null, 
   1222281840.0
  ], 
  [
   325046, 
   null, 
   "sinjin", 
   "Abortion are available up to and beyond 20 weeks Whether it was easy or difficult to obtain makes no difference to the gruesome procedure\nDying in childbirth is gruesome as well. Well over 90% of all abortions are performed in the first trimester. Most late term abortions are performed to avoid the risk of death to the mother.", 
   {}, 
   325033, 
   null, 
   1222282560.0
  ], 
  [
   325050, 
   null, 
   "jyoshu", 
   "Knowledge accumulates. Theories are revised, abandoned and replaced. Growth my friend. Something religion does only begrudgingly. Latter day priests indeed. Are you familiar with the excesses of the \"former day\" ones? If we know any \"truth\" at all it's because of science not religion. You bet your life you owe science.\n\n \n It may be the purpose of science to do that, but IMO religion has a different role which is perfectly acceptable. Its role is to hold onto the sacred things so they are there when people want them; things people DON'T want changed, and there's nothing wrong with that in most cases. It's that one bastion that isn't \"growing\"--thank goodness--and maintaining that sense of stability and grounding. I don't think most religious people WANT religion be like science and constantly changing; the fact it stays consistent and often unchanging is exactly one of the things that people like about religion. It should only be expected to change where it's harmful for it not to. \"truth\" in the sense of science and \"truth\" in the sense of religion are very different things. This is apples and oranges. Think of it in the same sense you would family traditions--it may not make a lot of sense to do a family tradition of having a holiday meal together every Thanksgiving. There's nothing particularly rational about having a big turkey dinner and breaking out the cranberry sauce on that day of year. Could we \"change\" and start doing it on a different date instead? Sure. Do we necessarily WANT to change there? Um, no.", 
   {}, 
   325029, 
   null, 
   1222283760.0
  ], 
  [
   325052, 
   null, 
   "gansao", 
   "Dying in childbirth is gruesome as well. Well over 90% of all abortions are performed in the first trimester. Most late term abortions are performed to avoid the risk of death to the mother.\n\n \n \n Much of the delay occurs prior to women requesting an abortion: half the women questioned were more than 13 weeks pregnant by the time they requested an abortion..\n http://www.soton.ac.uk/mediacentre/news/2007/apr/07_54.shtml\n \n \n Around 11% of abortions take place after the 12th week of pregnancy. Just over 1% of those occur after a woman is 20 weeks pregnant. \n \n Most abortions are permitted until the 24th week, although they can be carried out later if doctors believe the baby has a severe disability or if the mother's life is at risk \n \n The time-limit for abortions is proving increasingly controversial, as medical advances mean even very premature babies can survive. \n \n About 190,000 abortions take place in England and Wales annually. \n \n http://news.bbc.co.uk/1/hi/health/6560827.stm\n \n \n Not so Sinjin! I know it is Britain but I am British.", 
   {}, 
   325046, 
   null, 
   1222284840.0
  ], 
  [
   325054, 
   null, 
   "Penfold", 
   "Science operates on the premise that it is not so arrogant as to presume that anything is \"sacred\" in terms of knowledge. In fact, it could be argued that science alone advances by the disproof of its hypotheses.\n I think it was Richard Dawkins who recollected as a student, witnessing a presentation by a visiting lecturer which comprehensively demolished the evidence supporting the pet theory of one of his professors. At the end, the professor in question stood up and profusely thanked the speaker, welcomed his contribution, and ended with the declaration \"I have been wrong for fifteen years\".", 
   {}, 
   325050, 
   null, 
   1222285440.0
  ], 
  [
   325058, 
   null, 
   "gansao", 
   "Science operates on the premise that it is not so arrogant as to presume that anything is \"sacred\" in terms of knowledge. In fact, it could be argued that science alone advances by the disproof of its hypotheses.\n I think it was Richard Dawkins who recollected as a student, witnessing a presentation by a visiting lecturer which comprehensively demolished the evidence supporting the pet theory of one of his professors. At the end, the professor in question stood up and profusely thanked the speaker, welcomed his contribution, and ended with the declaration \"I have been wrong for fifteen years\".\n\n \n If you can believe a university professor can have his pet theory trashed by a visiting lecturer and immediatly thank him for it then you can stand next to Sarah Palin!\n Science is strewn with careers and even lives being ruined by scientists sqaubbling about their pet theories.\n Maybe if professor Dawkins says it then it must be true!", 
   {}, 
   325054, 
   null, 
   1222286520.0
  ], 
  [
   325060, 
   null, 
   "sinjin", 
   "Much of the delay occurs prior to women requesting an abortion: half the women questioned were more than 13 weeks pregnant by the time they requested an abortion..\nNot half of all women, half of the 883 that had second trimester abortion.\n \n \nAround 11% of abortions take place after the 12th week of pregnancy. Just over 1% of those occur after a woman is 20 weeks pregnant. \nPardon me. 89% in the first trimester according to your source.\n \n \nMost abortions are permitted until the 24th week, although they can be carried out later if doctors believe the baby has a severe disability or if the mother's life is at risk.\nIs that most abortions are allowed \"on demand\" or are allowed when there's problems? Not clear. Nor does it address whether you'll find a doctor willing to do it \"on demand\". \n \n \nNot so Sinjin! I know it is Britain but I am British. \nNot so to which part?", 
   {}, 
   325052, 
   null, 
   1222286940.0
  ], 
  [
   325061, 
   null, 
   "sinjin", 
   "If you can believe a university professor can have his pet theory trashed by a visiting lecturer and immediatly thank him for it then you can stand next to Sarah Palin!\n Science is strewn with careers and even lives being ruined by scientists sqaubbling about their pet theories.\n Maybe if professor Dawkins says it then it must be true!\nWhereas history is strewn with the bones of those who challenged religious dogma.", 
   {}, 
   325058, 
   null, 
   1222287120.0
  ], 
  [
   325067, 
   null, 
   "sinjin", 
   "It may be the purpose of science to do that, but IMO religion has a different role which is perfectly acceptable.\nAs long as it's voluntary. Obeying laws is not exactly voluntary.\n \n \nIts role is to hold onto the sacred things so they are there when people want them; things people DON'T want changed, and there's nothing wrong with that in most cases.\nExcept when what's sacred to you is discriminating to me.\n \n \n It's that one bastion that isn't \"growing\"--thank goodness--and maintaining that sense of stability and grounding. I don't think most religious people WANT religion be like science and constantly changing; the fact it stays consistent and often unchanging is exactly one of the things that people like about religion.\nExcept it's \"grounded\" in thin air. \n \n \n \nIt should only be expected to change where it's harmful for it not to.\nHow harmful before we can expect it to go away entirely?\n \n \n\"Truth\" in the sense of science and \"truth\" in the sense of religion are very different things.\nRight. There is no \"truth\" in the religious sense at all.", 
   {}, 
   325050, 
   null, 
   1222288260.0
  ], 
  [
   325071, 
   null, 
   "gansao", 
   "Not half of all women, half of the 883 that had second trimester abortion.\n\n Not not half of all women , I would think that more than half of ALL women have not had an abortion!\n \n \nPardon me. 89% in the first trimester according to your source.?\n\n \n You missed out the important bit , that 1% or more occur when the woman is 20 weeks pregnant.It is also stated that abortions are allowed up to 24 weeks if the fetus has a severe disability or the mothers life is risk. Ok the woman threatens to kill herself..shes got her termination. Please do not say that is not going to happen.\n \n \n Is that most abortions are allowed \"on demand\" or are allowed when there's problems? Not clear. Nor does it address whether you'll find a doctor willing to do it \"on demand\". \n\n \n If you think that you will not find a doctor to do it then you should stand on the other side of governor Palin to Penfold!", 
   {}, 
   325060, 
   null, 
   1222290360.0
  ], 
  [
   325084, 
   null, 
   "sinjin", 
   "Not not half of all women , I would think that more than half of ALL women have not had an abortion!\nVery likely. So? Of those that have, 89% did so in the first trimester before the fetus came to consciousness. \n \n \nYou missed out the important bit , that 1% or more occur when the woman is 20 weeks pregnant.It is also stated that abortions are allowed up to 24 weeks if the fetus has a severe disability or the mothers life is risk. Ok the woman threatens to kill herself..shes got her termination. Please do not say that is not going to happen.\nThat 1% is the high risk cases previously mentioned, not \"on demand\". I don't know if being suicidal counts as risk to mother. Maybe so, maybe not. Should you or I or the gov't decide? How about we leave that one to the doctors?\n \n \nIf you think that you will not find a doctor to do it then you should stand on the other side of governor Palin to Penfold! \nI know from personal experience that if you wait past 12 weeks you won't be able to have it done just about anywhere.", 
   {}, 
   325071, 
   null, 
   1222294320.0
  ], 
  [
   325093, 
   null, 
   "gansao", 
   "Very likely. So? Of those that have, 89% did so in the first trimester before the fetus came to consciousness. \n\n \n And more than 1 in 10 had it after and 1 in 100 at 20 weeks or more\n \n \nThat 1% is the high risk cases previously mentioned, not \"on demand\". I don't know if being suicidal counts as risk to mother. Maybe so, maybe not. Should you or I or the gov't decide? How about we leave that one to the doctors?\n\n Depression and suicidal tendancies do count..not maybe.\n Doctors need to have a framework to work to, there are lazy and even dishonest doctors.\n \n \nI know from personal experience that if you wait past 12 weeks you won't be able to have it done just about anywhere.\n\n \n That simply is not the case. If it were the question would not arise!", 
   {}, 
   325084, 
   null, 
   1222295760.0
  ], 
  [
   325096, 
   null, 
   "sinjin", 
   "And more than 1 in 10 had it after and 1 in 100 at 20 weeks or more\nThat 1 in 100 are those mothers who hung on hoping to be able to keep it and ultimately had to abort for medical reason. Don't misconstrue.\n \n \nDepression and suicidal tendancies do count..not maybe.\n Doctors need to have a framework to work to, there are lazy and even dishonest doctors.\nShow so evidence please. You want other than doctors to design the framework? Preachers maybe?\n \n \nThat simply is not the case. If it were the question would not arise! \nAre you calling me a liar? I told you I know from personal experience. Many doctors will not terminate second trimester fetuses without medical grounds, for moral reasons, despite the pro-life claim to an exclusive on morality.", 
   {}, 
   325093, 
   null, 
   1222296300.0
  ], 
  [
   325102, 
   null, 
   "gansao", 
   "That 1 in 100 are those mothers who hung on hoping to be able to keep it and ultimately had to abort for medical reason. Don't misconstrue..\n\n Now you are painting a scenario to suit your argument. That may occur, there may also be cases of feckless or wicked people , there may be cases in between. there may indeed be cases where an abortion IS the right thing to do but if it is only yes or no then I believe we must say no\n \n \nShow so evidence please. You want other than doctors to design the framework? Preachers maybe?.\n\n \n I ask you the same question as you ask me below.\n The framework should be formed after a great deal of public debate as is happening!\n Doctors should be given strict guidelines and should adhere to them!\n \n \nAre you calling me a liar? I told you I know from personal experience. Many doctors will not terminate second trimester fetuses without medical grounds, for moral reasons, despite the pro-life claim to an exclusive on morality.\n\n I am not calling you a liar , I do not know you so I cannot know if you are a liar or not but I do know that what you claim is not an actuality.\n sorry if that offends you!", 
   {}, 
   325096, 
   null, 
   1222297320.0
  ], 
  [
   325168, 
   null, 
   "jyoshu", 
   "Science operates on the premise that it is not so arrogant as to presume that anything is \"sacred\" in terms of knowledge. In fact, it could be argued that science alone advances by the disproof of its hypotheses.\n\n \n If that's true, then its very premise is making the wrong assumptions to begin with. There's nothing \"arrogant\" about what we're referring to as religious knowledge (even if it's not knowledge in the sense that you think of it) except that which you personally read into the situation even though it's not there to begin with. It's a much different kind 'truth' and knowledge that seeks to know how to live and do things like know the will of God than it is to know something gleaned from scientific observations such as planet orbits and so forth. Apples and oranges.", 
   {}, 
   325054, 
   null, 
   1222355640.0
  ], 
  [
   325170, 
   null, 
   "trebor", 
   "If that's true, then its very premise is making the wrong assumptions to begin with. There's nothing \"arrogant\" about what we're referring to as religious knowledge (even if it's not knowledge in the sense that you think of it) except that which you personally read into the situation even though it's not there to begin with. It's a much different kind 'truth' and knowledge that seeks to know how to live and do things like know the will of God than it is to know something gleaned from scientific observations such as planet orbits and so forth. Apples and oranges.\n\n \n Yes, it is. It is also delusional, and dangerous.", 
   {}, 
   325168, 
   null, 
   1222357080.0
  ], 
  [
   325174, 
   null, 
   "jyoshu", 
   "Yes, it is. It is also delusional, and dangerous.\n\n \n Nope; nothing arrogant about that. It doesn't even have anything to do with you OR science, to begin with. There are people who do that arrogantly, just like your approach toward religion is arrogant, but it's not arrogant by default. \n \n Also, how is it dangerous to, say, forgive others or love one's neighbor? And there's nothing dangerous about wondering what the will of God is. That's prejudice talking on your part. You taking it a step too far and ascribing 'dangerousness' to merely doing something like that is more dangerous.", 
   {}, 
   325170, 
   null, 
   1222357920.0
  ], 
  [
   325175, 
   null, 
   "Archangel", 
   "Try getting an abortion \"on demand\" at 20 weeks. \n\n \n Don't kid yourself, or us sinjin, all one need do after 20 weeks is fill out a form that states that to continue on with the pregnancy would do severe and permanent psychological damage to the woman. And the abortionist signs off on it, not an objective or disinterested doctor or psychiatrist even. Just the abortionist who is there, on the spot and prepared to do the abortion 10 minutes later. Is that your idea of a difficult process? emoticon_xdonno", 
   {}, 
   325028, 
   null, 
   1222358400.0
  ], 
  [
   325180, 
   null, 
   "chester", 
   "Don't kid yourself, or us sinjin, all one need do after 20 weeks is fill out a form that states that to continue on with the pregnancy would do severe and permanent psychological damage to the woman. And the abortionist signs off on it, not an objective or disinterested doctor or psychiatrist even. Just the abortionist who is there, on the spot and prepared to do the abortion 10 minutes later. Is that your idea of a difficult process? emoticon_xdonno\n\n \n Once again, so what?\n \n What a woman chooses to do vis a vis her pregnancy is none of my, your, or the law's business.", 
   {}, 
   325175, 
   null, 
   1222362120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Next American VP Has Been Chosen, And She's A Woman:", 
  "url": "http://www.4forums.com/political/politics-debates/11536-next-american-vp-has-been-chosen-shes-woman.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 11536, 
  "discussion_files": [
   [
    "23229.html", 
    "http://www.4forums.com/political/politics-debates/11536-next-american-vp-has-been-chosen-shes-woman-print.html"
   ], 
   [
    "23230.html", 
    "http://www.4forums.com/political/politics-debates/11536-next-american-vp-has-been-chosen-shes-woman-8-print.html"
   ], 
   [
    "23231.html", 
    "http://www.4forums.com/political/politics-debates/11536-next-american-vp-has-been-chosen-shes-woman-6-print.html"
   ], 
   [
    "23232.html", 
    "http://www.4forums.com/political/politics-debates/11536-next-american-vp-has-been-chosen-shes-woman-4-print.html"
   ], 
   [
    "23233.html", 
    "http://www.4forums.com/political/politics-debates/11536-next-american-vp-has-been-chosen-shes-woman-5-print.html"
   ], 
   [
    "23234.html", 
    "http://www.4forums.com/political/politics-debates/11536-next-american-vp-has-been-chosen-shes-woman-7-print.html"
   ], 
   [
    "23235.html", 
    "http://www.4forums.com/political/politics-debates/11536-next-american-vp-has-been-chosen-shes-woman-3-print.html"
   ], 
   [
    "23236.html", 
    "http://www.4forums.com/political/politics-debates/11536-next-american-vp-has-been-chosen-shes-woman-2-print.html"
   ]
  ], 
  "identifier": 11536
 }
]