[
 [
  [
   322746, 
   null, 
   "Shooterandproud", 
   "Why did God make sin and what is its purpose? I first assumed that it was for the good of his creation, and so that all men can live happily and without fear \"Thou shalt not kill, Thou shalt not covet\". However, this bring me to homosexuality and witchcraft. Some Christians truly believe that God considers these sinful. Why? They don't hurt anyone.", 
   {
    "post_info": {
     "post_title": "What is the purpose of sin?"
    }
   }, 
   null, 
   null, 
   1220664900.0
  ], 
  [
   322756, 
   null, 
   "trebor", 
   "Why did God make sin and what is its purpose? I first assumed that it was for the good of his creation, and so that all men can live happily and without fear \"Thou shalt not kill, Thou shalt not covet\". However, this bring me to homosexuality and witchcraft. Some Christians truly believe that God considers these sinful. Why? They don't hurt anyone.\n\n \n It all depends on what you think 'sin' is. The concept of 'sin' is literally from a Hebrew stand point 'missing the mark'.. or not doing as well as you might. The purpose of having bad choices is to allow the person to be able to reject the bad choices, and make GOOD choices.. to become closer to god and lead a more sanctified life.\n \n When the roll of satan is to provide bad choices to let you make good choices to come closer to God, it certianly takes the bit out of the 'evil being' .. and make him more of an 'imp of the perverse' than an evil demi-god'.", 
   {}, 
   322746, 
   null, 
   1220675040.0
  ], 
  [
   322765, 
   null, 
   "unkerpaulie", 
   "Why did God make sin and what is its purpose? I first assumed that it was for the good of his creation, and so that all men can live happily and without fear \"Thou shalt not kill, Thou shalt not covet\". However, this bring me to homosexuality and witchcraft. Some Christians truly believe that God considers these sinful. Why? They don't hurt anyone.\n\n I think your question should be \"why did God make commandments?\" Because that's what \"thou shalt not kill, thou shalt not covet\" are? And no, commandments are not designed to help you live happily and without fear. Its actually the exact opposite: commandments serve the purpose of keeping people under control through the use of fear. \n \n Sin means diobeying the commandments. As for homosexuality and witchcraft, they are sins because there are commandments against them.", 
   {}, 
   322746, 
   null, 
   1220681940.0
  ], 
  [
   322769, 
   null, 
   "Shooterandproud", 
   "I think your question should be \"why did God make commandments?\" Because that's what \"thou shalt not kill, thou shalt not covet\" are? And no, commandments are not designed to help you live happily and without fear. Its actually the exact opposite: commandments serve the purpose of keeping people under control through the use of fear. \n \n Sin means diobeying the commandments. As for homosexuality and witchcraft, they are sins because there are commandments against them.\n\n \n I think you're missing the point. Why would you want to keep people under control? To prevent them from harming other people. The men who created the commandments and the bible I believe had good intentions. They wanted to give people a reason to live their lives well, and the bible was the best and most intelligent thinking of the time (not modern, ancient). It was a good idea, however people started looking past the \"love thy neighbor\" stuff and started focusing on unimportant things like homosexuality and abortion.\n \n So, my question is why is homosexuality a sin?", 
   {}, 
   322765, 
   null, 
   1220685420.0
  ], 
  [
   322828, 
   null, 
   "unkerpaulie", 
   "I think you're missing the point. Why would you want to keep people under control? To prevent them from harming other people. The men who created the commandments and the bible I believe had good intentions. They wanted to give people a reason to live their lives well, and the bible was the best and most intelligent thinking of the time (not modern, ancient). It was a good idea, however people started looking past the \"love thy neighbor\" stuff and started focusing on unimportant things like homosexuality and abortion.\n \n So, my question is why is homosexuality a sin?\n\n I think the main purpose of the commandments (and there are hundreds of them throughout exodus, leviticus and deuteronomy) was to keep the population under the soveriegn authority of the religious leaders at the time, then later under the kings that stuck to the commandment formula. And yes, the basic commandments cover stuff to stop people from harming others, but \"do unto others as you'd have done unto you\" wasn't what the religious law was all about. It was about power. \n \n I agree with you that I think the law makers had noble intentions. They truly conceived that God was a being of order and rules and had a terrible wrath that could smite the heathen at any given time. They believed that their very survival (crop harvests, natural disasters, war conquests, etc) depended on God being in a good mood. So it was detrimental that everybody be on their best behavior, since one sinner in the midst could jeapordize the entire country. Also, I think that the lawmakers believed that God would ultimately reward them for obeying the law, and had noble reasons for encouraging others to do the same. \n \n So why is homosexuality a sin? Because it was believed to be an unpure act. So were adulters, menstruating women, and lepers, to name a few. They were all considered abominations as far as the old testament law was concerned, and were shunned, kicked out of the city, or killed. There was zero tolerance for sin.", 
   {}, 
   322769, 
   null, 
   1220780100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is the purpose of sin?", 
  "url": "http://www.4forums.com/political/religion-debates/11571-what-purpose-sin.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 11571, 
  "discussion_files": [
   [
    "19721.html", 
    "http://www.4forums.com/political/religion-debates/11571-what-purpose-sin-print.html"
   ]
  ], 
  "identifier": 11571
 }
]