[
 [
  [
   322898, 
   null, 
   "Ethmi", 
   "This news may be ancient by now, but I don't really care. Obama's pastor has been spewing that filth about white people for decades, in alot of that time Barry Obama has been absorbing the dung spewing from that man's mouth. Doesn't it seem a little suspicious that he didn't leave that church until the presidential elections... at all?", 
   {
    "post_info": {
     "post_title": "Obama's Pastor"
    }
   }, 
   null, 
   null, 
   1220829240.0
  ], 
  [
   322905, 
   null, 
   "chester", 
   "This news may be ancient by now, but I don't really care. Obama's pastor has been spewing that filth about white people for decades, in alot of that time Barry Obama has been absorbing the dung spewing from that man's mouth. Doesn't it seem a little suspicious that he didn't leave that church until the presidential elections... at all?\n\n \n Don't you find it strange that the same folks who are peddling this canard are the same ones who are saying thatr Senator Obama is a Muslim?\n \n The hard right religious lunatic fringe will stop at nothing to bring this good man down.\n \n If a person is known by the company (s)he keeps, what does it say about those who spread such stories?", 
   {}, 
   322898, 
   null, 
   1220832180.0
  ], 
  [
   322908, 
   null, 
   "Ethmi", 
   "Don't you find it strange that the same folks who are peddling this canard are the same ones who are saying thatr Senator Obama is a Muslim?\n \n The hard right religious lunatic fringe will stop at nothing to bring this good man down.\n \n If a person is known by the company (s)he keeps, what does it say about those who spread such stories?\n\n \n We have a term for that. It's called a strawman. If you continually take inches to miles, then just get off here.", 
   {}, 
   322905, 
   null, 
   1220833440.0
  ], 
  [
   322941, 
   null, 
   "Archangel", 
   "This news may be ancient by now, but I don't really care. Obama's pastor has been spewing that filth about white people for decades, in alot of that time Barry Obama has been absorbing the dung spewing from that man's mouth. Doesn't it seem a little suspicious that he didn't leave that church until the presidential elections... at all?\n\n \n The only reason BHO spent so many years in that church was because it was politically expedient for him at the time. Wright's church was plugged into the liberal activism in Chicago. He doesn't have a spiritual bone in his body, at least for Jesus or Christianity anyway. He proved that at the Saddleback Forum when he said that determining at what point an unborn baby is alive, is above his pay grade. He told every believer who heard him say that everything they needed to know regarding his spiritual depth. \n \n And here is the latest (an excerpt) on his islamic heritage.\n Obama's Ties to Islam\n \n Obama's ties to Islam are hereditary. His father was a Muslim, though Obama claims he was nonpracticing. According to Islamic law, Obama was born a Muslim, as religion is passed paternally. (Judaism, for example, passes religious identification maternally.)\n \n Apparently in deference to his father, his full name, Barack Hussein Obama, is an Arabic name. The name Barack is a derivation of \"Barak\" -- the horse that took the prophet Muhammad on his flight into heaven.\n \n Though Obama&#8217;s biological father disappeared from his son&#8217;s life soon after he was born and returned to his native Kenya, he was raised by his Kansas-born mother and her second husband, an Indonesian who was also a Muslim.\n \n Obama has described his mother as a Christian, but Newsweek recently noted she had eschewed her parents&#8217; faith in favor of secular humanism.\n \n Obama&#8217;s mother and her Indonesian husband moved with young Barack from Hawaii to Jakarta, Indonesia&#8217;s capital, in 1967. Obama lived there from ages 6 to 10.\n \n Reports dating back as far as early 2007 held that Obama was educated at a radical Islamic school in Indonesia. Such reports are false. He never attended such a school.\n \n In fact, Obama first attended a Catholic school for almost three years. However, his mother registered him in the school as a Muslim. As such, he was required to spending time each week praying with Muslim students and studying the Koran.\n \n In the wake of the controversy over Obama's Muslim upbringing, The Los Angeles Times sent a reporter to Jakarta to ferret out the truth.\n \n The Times report, published on March 16, 2008, revealed:\n \n A close boyhood friend of Obama, Zulfin Adi, said Obama \"was a Muslim. He went to the mosque.\"\n Obama's first-grade teacher at a Catholic school, Israella Dharmawan, said: \"Barry (Barack's nickname) was Muslim. He was registered as a Muslim because his father was Muslim.\"\n In the third grade, Obama transferred to a public school, where he was also registered as a Muslim. At the school, Muslim students attended weekly religion lessons about Islam.\n Some of these details have been confirmed by Obama himself. In his autobiography, \"Dreams From My Father,\" Obama mentions studying the Koran and describes the public school as \"a Muslim school.\"http://www.newsmax.com/headlines/obama_muslim_mccain/2008/09/07/128559.html\n \n And here's more on Obama's buddy Khalid Mansour and his islamic connections. http://www.newsmax.com/newsfront/khalid_al_mansour/2008/09/04/127844.html", 
   {}, 
   322898, 
   null, 
   1220846640.0
  ], 
  [
   322946, 
   null, 
   "Charliegone", 
   "I'm not really concerned about Obama's religion, I'm more concerned about his policies and \"acquaintances\" a few of who have been indicted for fraud and the such.", 
   {}, 
   322941, 
   null, 
   1220852880.0
  ], 
  [
   322947, 
   null, 
   "Archangel", 
   "I'm not really concerned about Obama's religion, I'm more concerned about his policies and \"acquaintances\" a few of who have been indicted for fraud and the such.\n\n \n If Obama was actually non religious in any way charlie, I totally agree with you. I don't have a religious litmus test for politicians. But if he's lying about being a committed christian, which he is doing, and is in reality a closet Muslim, Now that scares the life out of me. It's very important that my president be loyal to our Country and not some foreign ideology.", 
   {}, 
   322946, 
   null, 
   1220853180.0
  ], 
  [
   322948, 
   null, 
   "Jo Bennett", 
   "Christianity is just as \"foreign\" as Islam, they come from pretty well the same place in the world.\n \n Obama's comment about the question of when life starts is entirely appropriate. It is actually the height of arrogance to assume we know when life begins, the thing it tells believers who heard him is that this is a man who thinks about what he says, rather than just regurgitating what was programmed from the pulpit. That makes him a Christian rather than an automaton. I notice you're back to defining believers as \"people who agree with you\".\n \n In any case, actions speak louder than words, and McCain is a divorcee.", 
   {}, 
   322947, 
   null, 
   1220854140.0
  ], 
  [
   322950, 
   null, 
   "ServantOfChrist", 
   "If Obama was actually non religious in any way charlie, I totally agree with you. I don't have a religious litmus test for politicians. But if he's lying about being a committed christian, which he is doing, and is in reality a closet Muslim, Now that scares the life out of me. It's very important that my president be loyal to our Country and not some foreign ideology.\n\n \n And the fact that he was quite willing ang happy to sit through well over twenty years of American-hating sermons of Wright only adds to the idea that he is a closet Muslim. Oh, and he's definitely a liar about being a commited christian. He's not a christian - he's a believer in \"black liberaton theology\", which is a cult.\n \n And lets not forget that the media and even some of the leaders (Qadaffi, etc.) in the Islamic world call him a Muslim. They seem to think that Obama is playing the US for fools and practicing taqqiya and they can't wait for him to gets elected and deliver the USA to the Muslim world on a platter.\n \n And we need only mention the fact that Hamas has given him their endorsement - I think that says all we need to hear.", 
   {}, 
   322947, 
   null, 
   1220854680.0
  ], 
  [
   322951, 
   null, 
   "Archangel", 
   "And the fact that he was quite willing ang happy to sit through well over twenty years of American-hating sermons of Wright only adds to the idea that he is a closet Muslim. Oh, and he's definitely a liar about being a commited christian. He's not a christian - he's a believer in \"black liberaton theology\", which is a cult.\n \n And lets not forget that the media and even some of the leaders (Qadaffi, etc.) in the Islamic world call him a Muslim. They seem to think that Obama is playing the US for fools and practicing taqqiya and they can't wait for him to gets elected and deliver the USA to the Muslim world on a platter.\n \n And we need only mention the fact that Hamas has given him their endorsement - I think that says all we need to hear.\n\n \n Amen squared... And don't forget that Reverend Wright whom he originally called his spiritual mentor and a second father, took his trip to visit Qadaffi in Libya with Louis Faraquan. They called it a spiritual journey of reconciliation. If Americans are ignorant enough to actually entrust America's top job to Obama, then we deserve whatever we get as a result. http://mediamatters.org/items/200802270006\n Following Obama's answer, Russert asked, \"Do you reject his support?\" Obama then replied, \"Well, Tim, you know, I can't say to somebody that he can't say that he thinks I'm a good guy,\" adding: \"I have been very clear in my denunciations of him and his past statements, and I think that indicates to the American people what my stance is on those comments.\" Russert continued, stating: \"The problem some voters may have is, as you know, Reverend Farrakhan called Judaism 'gutter religion.' \" Obama replied, \"I am very familiar with his record, as are the American people. That's why I have consistently denounced it.\" Indeed, in his answer to Russert's initial question, the first thing Obama said was, \"You know, I have been very clear in my denunciation of Minister Farrakhan's anti-Semitic comments,\" calling them \"unacceptable and reprehensible.\"\n \n Russert persisted, stating, \"The title of one of your books, Audacity of Hope [Crown, 2006], you acknowledge you got from a sermon from Reverend Jeremiah Wright, the head of the Trinity United Church. He said that Louis Farrakhan 'epitomizes greatness,' \" before asking Obama, \"What do you do to assure Jewish Americans that, whether it's Farrakhan's support or the activities of Reverend Jeremiah Wright, your pastor, you are consistent with issues regarding Israel and not in any way suggesting that Farrakhan epitomizes greatness?\" Trumpet Newsmagazine, a publication founded by Chicago's Trinity United Church of Christ, where Obama is a parishioner and Wright was a minister, awarded Farrakhan the \"Lifetime Achievement 'Dr. Jeremiah A. Wright, Jr. Trumpeter Award' \" in 2007. Washington Post columnist Richard Cohen reported that Trumpet said Farrakhan \"truly epitomized greatness.", 
   {}, 
   322950, 
   null, 
   1220855160.0
  ], 
  [
   322959, 
   null, 
   "T.Q", 
   "I find it more interesting that Palin was a member of a political party which supported the secession of Alaska from the US, don't you?", 
   {}, 
   322951, 
   null, 
   1220863800.0
  ], 
  [
   322967, 
   null, 
   "chester", 
   "I find it more interesting that Palin was a member of a political party which supported the secession of Alaska from the US, don't you?\n\n \n I also find it far more interesting that Palin's pastor calls the Iraq debacle a mission from God.\n \n Why not resurrect the Crusades while we are at it.\n \n That bothers me more than Rev. Wright speaking truth to power.", 
   {}, 
   322959, 
   null, 
   1220879460.0
  ], 
  [
   322969, 
   null, 
   "Phyllis", 
   "I find it more interesting that Palin was a member of a political party which supported the secession of Alaska from the US, don't you?\n\n \n \nI also find it far more interesting that Palin's pastor calls the Iraq debacle a mission from God.\n\n Of course, neither of these things is true.", 
   {}, 
   322967, 
   null, 
   1220883540.0
  ], 
  [
   322973, 
   null, 
   "Archangel", 
   "I find it more interesting that Palin was a member of a political party which supported the secession of Alaska from the US, don't you?\n\n \n \nI also find it far more interesting that Palin's pastor calls the Iraq debacle a mission from God.\n \n\n \n \nOf course, neither of these things is true.\n\n \n You know that all you can expect from the left are unsubstantiated accusations and attacks Phyllis. emoticon_xdonno emoticon_wow", 
   {}, 
   322969, 
   null, 
   1220886240.0
  ], 
  [
   322974, 
   null, 
   "chester", 
   "Well, well, for once you right wingnuts were right. It was not Palin's pastor; it was Palin herself who said it.\n \n http://www.startribune.com/politics/national/president/27958514.html?elr=KArks7PYDiaK7DU2EkP7K_V_GD7EaPc:iLP8iUiD3aPc:_Yyc:aULPQL7PQLanchO7DiU\n \n Onward, Christian soldiers!!\n \n Disgusting!!", 
   {}, 
   322973, 
   null, 
   1220886900.0
  ], 
  [
   322980, 
   null, 
   "Archangel", 
   "Well, well, for once you right wingnuts were right. It was not Palin's pastor; it was Palin herself who said it.\n \n http://www.startribune.com/politics/national/president/27958514.html?elr=KArks7PYDiaK7DU2EkP7K_V_GD7EaPc:iLP8iUiD3aPc:_Yyc:aULPQL7PQLanchO7DiU\n \n Onward, Christian soldiers!!\n \n Disgusting!!\n\n \n Poor cap0, you just refuse to get it right don't you! It is in your nature to lie, obfuscate and purposely misinterpret anyone you aim at to demonize. Here is the actual quote from YOUR LINK:\n Pray for the construction of the $30 billion natural gas pipeline, Palin told them. Pray for the military men and women overseas, \"that our leaders, our national leaders, are sending [U.S. soldiers] out on a task that is from God. That's what we have to make sure that we're praying for -- that there is a plan and that that plan is God's plan.\"\n So you see? She wasn't saying that fighting the war in Iraq was Gods will at all. She was telling the audience to pray that our National Leaders were acting within Gods will. They are totally different things which you are obviously oblivious to. emoticon_xdonno emoticon_frazzled emoticon_wow :(\n \n What is truly disgusting is people like you who feed on lying and slandering people because they stand for what is right and good in this world of darkness which you love so much.", 
   {}, 
   322974, 
   null, 
   1220889060.0
  ], 
  [
   322982, 
   null, 
   "Foxtuba", 
   "Poor cap0, you just refuse to get it right don't you! It is in your nature to lie, obfuscate and purposely misinterpret anyone you aim at to demonize. Here is the actual quote from YOUR LINK:\n Pray for the construction of the $30 billion natural gas pipeline, Palin told them. Pray for the military men and women overseas, \"that our leaders, our national leaders, are sending [U.S. soldiers] out on a task that is from God. That's what we have to make sure that we're praying for -- that there is a plan and that that plan is God's plan.\"\n So you see? She wasn't saying that fighting the war in Iraq was Gods will at all. She was telling the audience to pray that our National Leaders were acting within Gods will. They are totally different things which you are obviously oblivious to. emoticon_xdonno emoticon_frazzled emoticon_wow :(\n \n What is truly disgusting is people like you who feed on lying and slandering people because they stand for what is right and good in this world of darkness which you love so much.\n\n \n World of darkness!? Puh-leeze. That sort of stuff was an anachronistic mindset during the medieval times, but there are plenty of people now who know better...either that, or you'll find that as a common theme in fantasy fiction novels (you have invoked those types of devlish books??? God says shunnnn to you!) Thing is, there has been enough light and darkness since the dawn of time, and nothing we can do will exorcise any form of chaos (unless you were able to send a rocket filled with Al-Qaeda and evangelists to Mars....talk about your coup of extremism!) from this world. \n \n And Sarah Palin is the only one out of McCain, Obama, and Biden who keeps stridently pushing her Christian principles into the forefront, thus causing deliberate tension amongst Americans who are, you know, not Christians.....the Jews, agnostics, Buddhists, atheists, Hinduists, and even Muslims (e.g. Keith Ellison) will be able to reject her and prevent her from destroying our nation. Yes we can! Yes we can! emoticon_xhoho", 
   {}, 
   322980, 
   null, 
   1220890740.0
  ], 
  [
   322985, 
   null, 
   "chester", 
   "\n And Sarah Palin is the only one out of McCain, Obama, and Biden who keeps stridently pushing her Christian principles into the forefront, thus causing deliberate tension amongst Americans who are, you know, not Christians.....the Jews, agnostics, Buddhists, atheists, Hinduists, and even Muslims (e.g. Keith Ellison) will be able to reject her and prevent her from destroying our nation. Yes we can! Yes we can! emoticon_xhoho\n\n \n Don't you get it?\n \n In Archieworld they don't count!emoticon_angry", 
   {}, 
   322982, 
   null, 
   1220896560.0
  ], 
  [
   322989, 
   null, 
   "Foxtuba", 
   "Don't you get it?\n \n In Archieworld they don't count!emoticon_angry\n\n \n It does appear so...but a brick wall can't stand forever.", 
   {}, 
   322985, 
   null, 
   1220898300.0
  ], 
  [
   322994, 
   null, 
   "Archangel", 
   "World of darkness!? Puh-leeze. That sort of stuff was an anachronistic mindset during the medieval times, but there are plenty of people now who know better...either that, or you'll find that as a common theme in fantasy fiction novels (you have invoked those types of devlish books??? God says shunnnn to you!) Thing is, there has been enough light and darkness since the dawn of time, and nothing we can do will exorcise any form of chaos (unless you were able to send a rocket filled with Al-Qaeda and evangelists to Mars....talk about your coup of extremism!) from this world. \n \n And Sarah Palin is the only one out of McCain, Obama, and Biden who keeps stridently pushing her Christian principles into the forefront, thus causing deliberate tension amongst Americans who are, you know, not Christians.....the Jews, agnostics, Buddhists, atheists, Hinduists, and even Muslims (e.g. Keith Ellison) will be able to reject her and prevent her from destroying our nation. Yes we can! Yes we can! emoticon_xhoho\n\n \n Care to post one iota of evidence that Sarah has called for the institution of any pro christian laws at all to support this blatant lie? Cmon tuba and chester the molester, give us a source, just one. I dare ya. emoticon_ic", 
   {}, 
   322982, 
   null, 
   1220901300.0
  ], 
  [
   322999, 
   null, 
   "T.Q", 
   "Of course, neither of these things is true.\n\n \nYou know that all you can expect from the left are unsubstantiated accusations and attacks Phyllis.\n\n \n LA Times editorial\n \n \"Over the years, Palin has actively courted the Alaska Independence Party, or AIP, an organization that supports Alaskan secession from the U.S. To be clear, we're not necessarily talking about friendly secession either: As the AIP's founder, Joe Vogler, told an interviewer in 1991: \"The fires of hell are frozen glaciers compared to my hatred for the American government. ... And I won't be buried under their damn flag.\" \"\n \n \"The McCain campaign denies that Palin ever joined the AIP. But while it is in dispute whether she attended its 1994 convention, she did visit the 2000 one and addressed AIP conventions in 2006 and 2008. Her husband, Todd, was a registered AIP member from 1995 to 2002, and the AIP leadership certainly considers her one of their own.\n \n Video footage shows AIP Vice Chairman Dexter Clark describing Palin at the 2007 North American Secessionist Convention as an \"AIP member before she got the job as a mayor of a small town -- that was a nonpartisan job. But you get along to go along. She eventually joined the Republican Party, where she had all kinds of problems with their ethics, and well, I won't go into that.\" (No need to. The Alaska Legislature's ethics investigators are on the case.) Apparently with Palin in mind, Clark then went on to urge AIP members to \"infiltrate\" the major parties.\n \n So what does Palin currently think of the AIP? Hard to know -- she's been keeping mum -- but this year she told AIP members: \"I'm delighted to welcome you to the 2008 Alaska Independence Party Convention. ... Keep up the good work!\"\"", 
   {}, 
   322980, 
   null, 
   1220905920.0
  ], 
  [
   323007, 
   null, 
   "Phyllis", 
   "Well, well, for once you right wingnuts were right. It was not Palin's pastor; it was Palin herself who said it.\n\n This is, of course, untrue.\n \n \n\"The McCain campaign denies that Palin ever joined the AIP. But while it is in dispute whether she attended its 1994 convention, she did visit the 2000 one and addressed AIP conventions in 2006 and 2008. Her husband, Todd, was a registered AIP member from 1995 to 2002, and the AIP leadership certainly considers her one of their own.\n\n So, contrary to your earlier claim, Governor Palin was not a member of a political party which supported the secession of Alaska from the US.\n \n In other words, your earlier statement was not true. It's pretty sad when you can't even get a LA Times opinion piece to back your claim.", 
   {}, 
   322974, 
   null, 
   1220913240.0
  ], 
  [
   323008, 
   null, 
   "sinjin", 
   "Now that scares the life out of me. It's very important that my president be loyal to our Country and not some foreign ideology.\nSame thing Kennedy was subjected to as a Catholic.", 
   {}, 
   322947, 
   null, 
   1220914200.0
  ], 
  [
   323017, 
   null, 
   "T.Q", 
   "This is, of course, untrue.\n \n \n So, contrary to your earlier claim, Governor Palin was not a member of a political party which supported the secession of Alaska from the US.\n \n In other words, your earlier statement was not true. It's pretty sad when you can't even get a LA Times opinion piece to back your claim.\n\n \n \n Yep, look at that. The AIP states she's a member, her husband was a registered member, and she's attended three of their conventions and spoken at two of them.\n \n What was I thinking?", 
   {}, 
   323007, 
   null, 
   1220919180.0
  ], 
  [
   323020, 
   null, 
   "Archangel", 
   "LA Times editorial\n \n \"Over the years, Palin has actively courted the Alaska Independence Party, or AIP, an organization that supports Alaskan secession from the U.S. To be clear, we're not necessarily talking about friendly secession either: As the AIP's founder, Joe Vogler, told an interviewer in 1991: \"The fires of hell are frozen glaciers compared to my hatred for the American government. ... And I won't be buried under their damn flag.\" \"\n \n \"The McCain campaign denies that Palin ever joined the AIP. But while it is in dispute whether she attended its 1994 convention, she did visit the 2000 one and addressed AIP conventions in 2006 and 2008. Her husband, Todd, was a registered AIP member from 1995 to 2002, and the AIP leadership certainly considers her one of their own.\n \n Video footage shows AIP Vice Chairman Dexter Clark describing Palin at the 2007 North American Secessionist Convention as an \"AIP member before she got the job as a mayor of a small town -- that was a nonpartisan job. But you get along to go along. She eventually joined the Republican Party, where she had all kinds of problems with their ethics, and well, I won't go into that.\" (No need to. The Alaska Legislature's ethics investigators are on the case.) Apparently with Palin in mind, Clark then went on to urge AIP members to \"infiltrate\" the major parties.\n \n So what does Palin currently think of the AIP? Hard to know -- she's been keeping mum -- but this year she told AIP members: \"I'm delighted to welcome you to the 2008 Alaska Independence Party Convention. ... Keep up the good work!\"\"\n\n \n So what? emoticon_confused What precisely is your problem with Palin being a member of the independence party before she became a republican? Is it because members of that party talked about succession? Can you show me where it say's that talking about it is illegal? And what do you propose we do with Texas and Vermont, 2 other States which have fairly strong succession movements?", 
   {}, 
   322999, 
   null, 
   1220919600.0
  ], 
  [
   323023, 
   null, 
   "T.Q", 
   "So what? emoticon_confused What precisely is your problem with Palin being a member of the independence party before she became a republican? Is it because members of that party talked about succession? Can you show me where it say's that talking about it is illegal? And what do you propose we do with Texas and Vermont, 2 other States which have fairly strong succession movements?\n\n \n Holy...\n \n The possible VP of the US supports, or has shown support for the secession of her home state from the Union. The goal of the party is to seperate from the US and become either a territory or a sovereign nation. It's not \"members of the party talking about secession\", it's the whole point of the party. And you don't see a problem with this?\n \n \nAnd what do you propose we do with Texas and Vermont, 2 other States which have fairly strong succession movements?\n\n Well, judging from your response here, I'd nominate a couple of powerful up and comers in the ranks of the secession parties for national political posts, the higher the better.", 
   {}, 
   323020, 
   null, 
   1220920320.0
  ], 
  [
   323026, 
   null, 
   "Phyllis", 
   "Yep, look at that. The AIP states she's a member, her husband was a registered member, and she's attended three of their conventions and spoken at two of them.\n \n What was I thinking?\n\n Problem is that the documented evidence shows that Governor Palin has been a member of the Republican party since 1982. Additionally, Alaska officials have confirmed that Governor Palin \"was never a member of the [AIP] party.\" And, as it turns out, the AIP admits that it was wrong to say she was a member.\n \n Whoa, her husband was a member? That means she is, or has been in the past? That's an interesting bit of logic. Let's see how that works. Bill Clinton has been President in the past. That must mean that Hillary Clinton has too.\n \n Speaking to groups now means you are a member? That's an interesting bit of logic. Let's see how that works. Barak Obama spoke to and at Saddleback church. That must mean that he is a member, right?\n \n You claimed that Governor Palin was a member of a party \"which supported the secession of Alaska from the US.\" The documented evidence shows that you were wrong. Your credibility would improve leaps and bounds if you were to simply admit the mistake rather than trying to spin the facts.\n \n \nWhat precisely is your problem with Palin being a member of the independence party before she became a republican?\n\n One should not concede to a point when it is a factual error. Governor Palin was never a member of the AIP.", 
   {}, 
   323017, 
   null, 
   1220921760.0
  ], 
  [
   323031, 
   null, 
   "Archangel", 
   "One should not concede to a point when it is a factual error. Governor Palin was never a member of the AIP.\n\n \n Good point, I stand corrected. By conceding the point we just feed the unfounded attack. emoticon_smile", 
   {}, 
   323026, 
   null, 
   1220922900.0
  ], 
  [
   323035, 
   null, 
   "T.Q", 
   "Problem is that the documented evidence shows that Governor Palin has been a member of the Republican party since 1982. Additionally, Alaska officials have confirmed that Governor Palin \"was never a member of the [AIP] party.\" And, as it turns out, the AIP admits that it was wrong to say she was a member.\n \n Whoa, her husband was a member? That means she is, or has been in the past? That's an interesting bit of logic. Let's see how that works. Bill Clinton has been President in the past. That must mean that Hillary Clinton has too.\n \n Speaking to groups now means you are a member? That's an interesting bit of logic. Let's see how that works. Barak Obama spoke to and at Saddleback church. That must mean that he is a member, right?\n \n You claimed that Governor Palin was a member of a party \"which supported the secession of Alaska from the US.\" The documented evidence shows that you were wrong. Your credibility would improve leaps and bounds if you were to simply admit the mistake rather than trying to spin the facts.\n \n \n One should not concede to a point when it is a factual error. Governor Palin was never a member of the AIP.\n\n \n Looks like I was in error when I said she was a member-that was what I had previously read. What I should have said was she supported the party.\n \n Speaking of spin, how dizzy are you after that little effort above?", 
   {}, 
   323026, 
   null, 
   1220923260.0
  ], 
  [
   323037, 
   null, 
   "Phyllis", 
   "What I should have said was she supported the party.\n\n I'm not sure the facts support this claim either.", 
   {}, 
   323035, 
   null, 
   1220924400.0
  ], 
  [
   323038, 
   null, 
   "Shooterandproud", 
   "If Obama was actually non religious in any way charlie, I totally agree with you. I don't have a religious litmus test for politicians. But if he's lying about being a committed christian, which he is doing, and is in reality a closet Muslim, Now that scares the life out of me. It's very important that my president be loyal to our Country and not some foreign ideology.\n\n \n emoticon_rolleyes\n \n Do you believe that 9/11 was an inside job too?", 
   {}, 
   322947, 
   null, 
   1220924460.0
  ], 
  [
   323039, 
   null, 
   "T.Q", 
   "I'm not sure the facts support this claim either.\n\n \n \"So what does Palin currently think of the AIP? Hard to know -- she's been keeping mum -- but this year she told AIP members: \"I'm delighted to welcome you to the 2008 Alaska Independence Party Convention. ... Keep up the good work!\"\"", 
   {}, 
   323037, 
   null, 
   1220926500.0
  ], 
  [
   323138, 
   null, 
   "Ethmi", 
   "I find it more interesting that Palin was a member of a political party which supported the secession of Alaska from the US, don't you?\n\n \n Why would that be interesting? Because it supports you? Because it's a convinient (but obvious) way to change the subject? And finally, does that mean that she as an individual supported this? It's not reasonable for me to say \"Some democrats burned down buildings and spraypainted 'TREEKILLERS!!' everywhere, so it's interesting that Obama belongs to this party.\" I could only imagine what would happen if I said that...", 
   {}, 
   322959, 
   null, 
   1221003420.0
  ], 
  [
   323141, 
   null, 
   "Ethmi", 
   "\"So what does Palin currently think of the AIP? Hard to know -- she's been keeping mum -- but this year she told AIP members: \"I'm delighted to welcome you to the 2008 Alaska Independence Party Convention. ... Keep up the good work!\"\"\n\n \n Source? Common knowledge is just as valid for you as it was for me...", 
   {}, 
   323039, 
   null, 
   1221003480.0
  ], 
  [
   323142, 
   null, 
   "Ethmi", 
   "Well, well, for once you right wingnuts were right. It was not Palin's pastor; it was Palin herself who said it.\n \n http://www.startribune.com/politics/national/president/27958514.html?elr=KArks7PYDiaK7DU2EkP7K_V_GD7EaPc:iLP8iUiD3aPc:_Yyc:aULPQL7PQLanchO7DiU\n \n Onward, Christian soldiers!!\n \n Disgusting!!\n\n \n First off, find a primary source... it looks like whoever wrote this had their own agenda. \n \n Second off, is it possible for you to interpret something correctly? I'll just paraphrase: \n \n \n\n Palin: Pray that God wants us to win.\n Chester's interpretation: God wants us to kill people.\n \n\n \n See the difference?", 
   {}, 
   322974, 
   null, 
   1221003780.0
  ], 
  [
   323143, 
   null, 
   "Ethmi", 
   "LA Times editorial\n \n \"Over the years, Palin has actively courted the Alaska Independence Party, or AIP, an organization that supports Alaskan secession from the U.S. To be clear, we're not necessarily talking about friendly secession either: As the AIP's founder, Joe Vogler, told an interviewer in 1991: \"The fires of hell are frozen glaciers compared to my hatred for the American government. ... And I won't be buried under their damn flag.\" \"\n \n \"The McCain campaign denies that Palin ever joined the AIP. But while it is in dispute whether she attended its 1994 convention, she did visit the 2000 one and addressed AIP conventions in 2006 and 2008. Her husband, Todd, was a registered AIP member from 1995 to 2002, and the AIP leadership certainly considers her one of their own.\n \n Video footage shows AIP Vice Chairman Dexter Clark describing Palin at the 2007 North American Secessionist Convention as an \"AIP member before she got the job as a mayor of a small town -- that was a nonpartisan job. But you get along to go along. She eventually joined the Republican Party, where she had all kinds of problems with their ethics, and well, I won't go into that.\" (No need to. The Alaska Legislature's ethics investigators are on the case.) Apparently with Palin in mind, Clark then went on to urge AIP members to \"infiltrate\" the major parties.\n \n So what does Palin currently think of the AIP? Hard to know -- she's been keeping mum -- but this year she told AIP members: \"I'm delighted to welcome you to the 2008 Alaska Independence Party Convention. ... Keep up the good work!\"\"\n\n \n You only have to read the first sentence (which you omitted), and it becomes obvious that the LA times has its own agenda. Don't even bother lifting your pinky finger to tell me that they're not biased, because this isn't the first incedent either.", 
   {}, 
   322999, 
   null, 
   1221004080.0
  ], 
  [
   323151, 
   null, 
   "T.Q", 
   "So I see no one has a valid response?\n \n You all are more worried about the words of a pastor speaking against race oppression than you are about your possible VP supporting the idea of splitting states off from the Union?", 
   {}, 
   323143, 
   null, 
   1221008820.0
  ], 
  [
   323154, 
   null, 
   "jyoshu", 
   ".... than you are about your possible VP supporting the idea of splitting states off from the Union?\n\n \n Sorry, but you've already been soundly refuted on this by another poster. So, do you just think if you repeat the falsehood enough times it will somehow become true? Re. Obama's pastor, you should to take up your defense of Wright with Obama himself.", 
   {}, 
   323151, 
   null, 
   1221009600.0
  ], 
  [
   323155, 
   null, 
   "chester", 
   "First off, find a primary source... it looks like whoever wrote this had their own agenda. \n \n Second off, is it possible for you to interpret something correctly? I'll just paraphrase: \n \n \n\n Palin: Pray that God wants us to win.\n Chester's interpretation: God wants us to kill people.\n \n\n \n See the difference?\n\n \n There is no difference.\n \n First of all, no one has ever defined just what \"winning\" will look like.\n \n Second, \"winning\" will inevitably lead to the death of innocents. Maybe the hard right radical fringe wingnuts can dismiss this as \"collateral damage\", but it is someone's father, mother, sister, brother, husband, or wife.\n \n By your standard, the \"terrorists\" can look at those who died on 9/11 as \"collateral damage\" in the war against the USA.\n \n Fair is fair, right?", 
   {}, 
   323142, 
   null, 
   1221010440.0
  ], 
  [
   323159, 
   null, 
   "T.Q", 
   "Sorry, but you've already been soundly refuted on this by another poster.\n\n No, I wasn't. Her own words show she agrees with them \n \"this year she told AIP members: \"I'm delighted to welcome you to the 2008 Alaska Independence Party Convention. ... Keep up the good work!\"\"\"\n And do you honestly think if she was so ideologically opposed to what they stand for that she would have appeared at three of their conventions and addressed two of them? Please.\n \n \nSo, do you just think if you repeat the falsehood enough times it will somehow become true?\n\n I'm getting pretty tired of you accusing me of lying because you don't agree with what I said.\n \n \n Re. Obama's pastor, you should to take up your defense of Wright with Obama himself.\n\n \n\"I am outraged by the comments that were made and saddened by the spectacle that we saw yesterday,\" Obama told reporters at a news conference.\n \n ...\"The person I saw yesterday was not the person that I met 20 years ago,\" ...\n \n In a highly publicized speech last month, Obama sharply condemned Wright's remarks. But he did not leave the church or repudiate the minister himself, who he said was like a family member.\n\n \n So what does your source show us? That he condemns Wright's outburst. He did not distance himself overly from Wright until he went off the deep end, nearly a month after this all started.\n \n Looks like it's mission accomplished for you though, right? Why worry about the economy, war, energy shortages, food shortages, market collapses, etc? After all, Obama's pastor said some mean things about America! Never mind that a lot of them are true...", 
   {}, 
   323154, 
   null, 
   1221010920.0
  ], 
  [
   323165, 
   null, 
   "Steeeeve", 
   "No, I wasn't. Her own words show she agrees with them \n \"this year she told AIP members: \"I'm delighted to welcome you to the 2008 Alaska Independence Party Convention. ... Keep up the good work!\"\"\"\n And do you honestly think if she was so ideologically opposed to what they stand for that she would have appeared at three of their conventions and addressed two of them? Please.\n\n \n Actually this has been refuted: http://www.factcheck.org/elections-2008/sliming_palin.html\n \nShe was never a member of the Alaskan Independence Party, a group that wants Alaskans to vote on whether they wish to secede from the United States. She&#8217;s been registered as a Republican since May 1982.\n\n \n She appeared at one convention that we know of and that was because she was the mayor. Those words were from a video to the convention anyway.", 
   {}, 
   323159, 
   null, 
   1221012780.0
  ], 
  [
   323174, 
   null, 
   "jyoshu", 
   "I'm getting pretty tired of you accusing me of lying because you don't agree with what I said.\n\n \n I didn't accuse you of lying. I said it was a falsehood. To lie requires intent on the part of the perpetrator, and I don't think you necessarily have such intent to deceive. I think you're just partisan to the point of even ignoring evidence when it's been given to you, as it was in the post I linked to, and so you refuse to consider it. And now Steeeeve has given you more evidence.\n \n \nAfter all, Obama's pastor said some mean things about America! Never mind that a lot of them are true...\n\n \n Hey, even a broken clock is right twice a day. :)", 
   {}, 
   323159, 
   null, 
   1221020460.0
  ], 
  [
   323178, 
   null, 
   "Archangel", 
   "A couple of News issues you'll be hearing about soon is that in a stump speech Obama gave today, he actually made this statement. \"You can put lipstick on a pig, but it's still a pig\". It's a reference to Palin's statement about the difference between a pit bull and a hockey mom, LIPSTICK. So Obama just effectively called every hockey mom in America a PIG today. And how do you think soccer moms will view that statement?\n \n And the wrong Reverend Wright has just been outed as having a sexual affair with, I believe, a 25 or 30 year old white woman who worked in a sister church to his. When the affair was exposed, she lost her job, but of course nothing has happened to him.", 
   {}, 
   323174, 
   null, 
   1221022200.0
  ], 
  [
   323185, 
   null, 
   "Phyllis", 
   "And the wrong Reverend Wright has just been outed as having a sexual affair with, I believe, a 25 or 30 year old white woman who worked in a sister church to his. When the affair was exposed, she lost her job, but of course nothing has happened to him.\n\n I'm going to kindly request of you the same as I have requested others: where's the documented evidence. Otherwise it's just gossip.\n \n We should so value the truth that we are reluctant to repeat things which may not even be true. And we should apply this principle whether we like the person about whom the things are rumored or not; whether we like their political affiliations or not.", 
   {}, 
   323178, 
   null, 
   1221024600.0
  ], 
  [
   323186, 
   null, 
   "T.Q", 
   "I didn't accuse you of lying. I said it was a falsehood. To lie requires intent on the part of the perpetrator, and I don't think you necessarily have such intent to deceive. I think you're just partisan to the point of even ignoring evidence when it's been given to you, as it was in the post I linked to, and so you refuse to consider it. And now Steeeeve has given you more evidence.\n\n Partisan? I was rooting for McCain 8 years ago. Why is it that anyone who questions Palin is \"partisan\". Should this not be what is done with anyone running with office?\n As for what was refuted, it was that she was a member of the AIP. You somehow managed to skip this post of mine where I admitted that I was in error. Steeeve and Phyllis in no way address whether or not she supports the AIP, which it seems clear to me she does.", 
   {}, 
   323174, 
   null, 
   1221025620.0
  ], 
  [
   323191, 
   null, 
   "Archangel", 
   "I'm going to kindly request of you the same as I have requested others: where's the documented evidence. Otherwise it's just gossip.\n \n We should so value the truth that we are reluctant to repeat things which may not even be true. And we should apply this principle whether we like the person about whom the things are rumored or not; whether we like their political affiliations or not.\n\n \n Here's what I could find on the Obama Lipstick/PIG statement. I'll find the Wright story and post it also. I just heard these stories tonight, so they are very fresh.\n \n http://embeds.blogs.foxnews.com/2008/09/09/lipstick-pigs-and-a-squad-for-truth/\n \n And here we have the Reverend's sex scandal exposed here. http://showhype.com/story/o_pastor_in_sex_scandal/\n \n With photo of the woman: http://www.nypost.com/seven/09092008/news/nationalnews/o_pastor_in_sex_scandal_128142.htm", 
   {}, 
   323185, 
   null, 
   1221026880.0
  ], 
  [
   323195, 
   null, 
   "Phyllis", 
   "And here we have the Reverend's sex scandal exposed here. http://showhype.com/story/o_pastor_in_sex_scandal/\n \n With photo of the woman: http://www.nypost.com/seven/09092008...dal_128142.htm\n\n Seems like thus far there is only an unsubstantiated accusation. This is similar to the types of things that I have objected to as to Governor Palin, and I also object to them as to Jeremiah Wright. So long as this is merely an accusation, it really shouldn't be circulated any more than should some of the ridiculous and unsubstantiated accusations against Governor Palin be circulated.", 
   {}, 
   323191, 
   null, 
   1221029220.0
  ], 
  [
   323196, 
   null, 
   "Penfold", 
   ":xbanghead I bet McCain's use of he \"lipstick on a pig\" phrase would be acceptable....", 
   {}, 
   323191, 
   null, 
   1221029460.0
  ], 
  [
   323197, 
   null, 
   "Archangel", 
   "Seems like thus far there is only an unsubstantiated accusation. This is similar to the types of things that I have objected to as to Governor Palin, and I also object to them as to Jeremiah Wright. So long as this is merely an accusation, it really shouldn't be circulated any more than should some of the ridiculous and unsubstantiated accusations against Governor Palin be circulated.\n\n \n What more do you want Phyllis? The woman herself has been fired from her job at the church which means that the affair is known of, confirmed that it happened by the powers that be, and accepted as true. How can you say it's unsubstantiated?", 
   {}, 
   323195, 
   null, 
   1221029520.0
  ], 
  [
   323198, 
   null, 
   "T.Q", 
   "Here's what I could find on the Obama Lipstick/PIG statement. I'll find the Wright story and post it also. I just heard these stories tonight, so they are very fresh.\n \n http://embeds.blogs.foxnews.com/2008...uad-for-truth/\n\n Oh, a Fox news blog. At least it's a \"fair and balanced\" source...\n and your link is dead\n We'll just forget the fact that \"lipstick on a pig\" is a very old, common saying and assume it was meant as an insult to Palin.\n \n I can post many links that states Palin said \"So Sambo beat the bitch\", when told who had won the Democratic primaries. This is about as substantiated as what you posted above, but not in any major papers. Therefore, it's not substantiated, and not to be taken as truthful until properly confirmed (which I'd be surprised if it was). Go ahead, just google it and see what you get. \n \n Also, just so we're clear here Archie:\n \n Rev Wright, who Obama admits is a close personal friend, someone he (once?) considered a mentor may have had an affair, so that makes Obama unfit for the presidency by association?\n \n But McCain himself is accused of having an affair, but that doesn't affect his ability or standing?\n \n Someone mind telling me how this isn't double-standard partisanship bull #### of the highest order?", 
   {}, 
   323197, 
   null, 
   1221030840.0
  ], 
  [
   323205, 
   null, 
   "Archangel", 
   "Oh, a Fox news blog. At least it's a \"fair and balanced\" source...\n and your link is dead\n We'll just forget the fact that \"lipstick on a pig\" is a very old, common saying and assume it was meant as an insult to Palin.\n\n \n Your protests ring hollow in light of Sarah's comparison that only lipstick separates pitbull dogs from hockey moms. And once again, you know that all too well. And based on that democratic audiences response to the statement, it's obvious that they made the connection.\n \n \nI can post many links that states Palin said \"So Sambo beat the bitch\", when told who had won the Democratic primaries. This is about as substantiated as what you posted above, but not in any major papers. Therefore, it's not substantiated, and not to be taken as truthful until properly confirmed (which I'd be surprised if it was). Go ahead, just google it and see what you get. \n\n \n You want substantiation? How about from the horses own mouth? http://www.stoptheaclu.com/archives/2008/09/09/im-sure-hell-try-to-deny-it-obama-refers-to-gov-palin-as-a-pig/ And as to the bolded, regarding your blatant lie that Palin said \"So Sambo beat the bitch\", please support that claim with direct evidence as I did with the video clip in my link above.\n \n \nAlso, just so we're clear here Archie:\n \n Rev Wright, who Obama admits is a close personal friend, someone he (once?) considered a mentor may have had an affair, so that makes Obama unfit for the presidency by association?\n \n But McCain himself is accused of having an affair, but that doesn't affect his ability or standing?\n \n Someone mind telling me how this isn't double-standard partisanship bull #### of the highest order?\n\n \n First off, can you quote where I said Wrights affair reflected badly on Obama at all? I posted that diddy as the newest dirt on Wright as an alleged christian. It surely reflects on his moral compass as a spiritual leader. It just proves what many of us have been saying all along, that Obama hasn't spent 20 years in a spiritually based church which focussed on doing the work of Christ, but worked out of a social activism community that had a religious label on it for the purpose of tax shelter.\n \n \n And can you post where McCain is accused of having an affair? Are you saying he has cheated on Cindy? I'd like to see that and yes, I would hold it against him in a big way.", 
   {}, 
   323198, 
   null, 
   1221054900.0
  ], 
  [
   323208, 
   null, 
   "chester", 
   "\n First off, can you quote where I said Wrights affair reflected badly on Obama at all? I posted that diddy as the newest dirt on Wright as an alleged christian.(emphasis added) It surely reflects on his moral compass as a spiritual leader. It just proves what many of us have been saying all along, that Obama hasn't spent 20 years in a spiritually based church which focussed on doing the work of Christ, but worked out of a social activism community that had a religious label on it for the purpose of tax shelter.\n \n\n \n Get real, Baron vonMunchausen.\n \n If all you wanted to do was to cast aspersions on Rev. Wright, you would not have posted what you did on the \"Elections\" forum.\n \n Sorry, but your comment fails the straight-face test. No one can read your post and keep a straight face.", 
   {}, 
   323205, 
   null, 
   1221056340.0
  ], 
  [
   323209, 
   null, 
   "Penfold", 
   "Whatever happened to anti-catholic anti-semitic televangelist Hagee? Such a pillar of the evangelical community.... One would think that MCain would be \"Proud of his support\".....", 
   {}, 
   323208, 
   null, 
   1221057240.0
  ], 
  [
   323212, 
   null, 
   "Archangel", 
   "Get real, Baron vonMunchausen.\n \n If all you wanted to do was to cast aspersions on Rev. Wright, you would not have posted what you did on the \"Elections\" forum.\n \n Sorry, but your comment fails the straight-face test. No one can read your post and keep a straight face.\n\n \n Hey schmuck, did you notice the title of this thread? It's called \"Obama's Pastor.\"\n \n schmuck| sh m&#601;k| (also shmuck)\n noun informal\n a foolish or contemptible person.\n ORIGIN late 19th cent.: from Yiddish shmok\n \n Here's a neat video. http://www.youtube.com/watch?v=6vTfgbIbhyE", 
   {}, 
   323208, 
   null, 
   1221058080.0
  ], 
  [
   323219, 
   null, 
   "T.Q", 
   "Your protests ring hollow in light of Sarah's comparison that only lipstick separates pitbull dogs from hockey moms. And once again, you know that all too well. And based on that democratic audiences response to the statement, it's obvious that they made the connection.\n\n I wouldn't know how it was taken or what the response was because your link is dead. And none of that changes the fact that it is a very old and very common saying.\n \n \n \n \nYou want substantiation? How about from the horses own mouth? http://www.stoptheaclu.com/archives/2008/09/09/im-sure-hell-try-to-deny-it-obama-refers-to-gov-palin-as-a-pig/\n\n Wait, this stream of conciousness blog rant is your proof? That site is so hate filled it's incoherent, and the quotes on there are so taken out of context (if they're provided at all), that you can't even tell what they're discussing.\n \n \nAnd as to the bolded, regarding your blatant lie that Palin said \"So Sambo beat the bitch\", please support that claim with direct evidence as I did with the video clip in my link above.\n\n I already said this hasn't been substantiated to my liking, but OK.\n Link Archie requested\n \n \n \n \nFirst off, can you quote where I said Wrights affair reflected badly on Obama at all?\n\n Wait, you're unwilling to accept the idea that \"lipstick on a pig\" did not specifically refer to Palin, but I'm supposed to buy the idea that you posted this with no intention of having it speak to Obama's character? Yeah, sure Archie\n \n \nI posted that diddy as the newest dirt on Wright as an alleged christian. It surely reflects on his moral compass as a spiritual leader.\n\n As do your actions towards others on your status as an alleged Christian.\n \n \nIt just proves what many of us have been saying all along, that Obama hasn't spent 20 years in a spiritually based church which focussed on doing the work of Christ, but worked out of a social activism community that had a religious label on it for the purpose of tax shelter.\n\n Oh, look at that! It only took you two sentences to get caught in your lie! First sentence-claim that you did not post this as a slur against Obama\n Third sentence-claim this proves Obama is a no good so and so.\n \n \n \nAnd can you post where McCain is accused of having an affair? Are you saying he has cheated on Cindy? I'd like to see that and yes, I would hold it against him in a big way.\n\n Wow, head in the sand much? This was big news a few months ago\n McCain alleged affair", 
   {}, 
   323205, 
   null, 
   1221064140.0
  ], 
  [
   323226, 
   null, 
   "ServantOfChrist", 
   ":xbanghead I bet McCain's use of he \"lipstick on a pig\" phrase would be acceptable....\n\n \n Yes, as it was used in the correct context such that it made sense (referring to a bill/legislation that was being passed. \n \n Obama did not use it correctly and it was quite clear he was using it to insult Palin. Especially when another of his buddies in Missouri ON THE SAME DAY made a DIRECT mention of Palin and used \"lipstick\" in a same manner (said McCain was trying to cover up his \"deficiencies\" but even his VP pick couldn't do it no matter how much lipstick they covered it with).\n \n Hardly a coincidence, wouldn't you say?\n \n Personally I see Obama coming down from that high horse he has claimed to be on and has started getting dirty now that for the first time he is BEHIND in the national polls.", 
   {}, 
   323196, 
   null, 
   1221067560.0
  ], 
  [
   323229, 
   null, 
   "Baron", 
   "Get real, Baron vonMunchausen.\n \n If all you wanted to do was to cast aspersions on Rev. Wright, you would not have posted what you did on the \"Elections\" forum.\n \n Sorry, but your comment fails the straight-face test. No one can read your post and keep a straight face.\n\n \n Easy now chester, I am the Baron von Münchhausen not Archie. It seems to me that Barack Obama has thrown many of his old friends and buddies, including Pastor Wright, under the bus and try to explain away the relationships with glib words. \n \n Having just listened to Obama's comments regarding his careless 'lipstick' comment leads me to believe that the democrats are getting scared, very scared. Very soon they will be seeing a Sarah Palin in every nook and cranny.\n \n What's the other VP candidate's name again? Oh yeah, Biden. A rather sorry state of affairs when the entire Obama campaign apparatus has to run around in circles trying to figure out how to get at Palin. \n \n Have a nice day.\n \n The Red Baron von Münchhausen", 
   {}, 
   323208, 
   null, 
   1221067800.0
  ], 
  [
   323230, 
   null, 
   "chester", 
   "\n Personally I see Obama coming down from that high horse he has claimed to be on and has started getting dirty now that for the first time he is BEHIND in the national polls.\n\n \n And not a minute too soon. He's not about to let himself get swiftboated any longer.\n \n Off comes the Ivy League veneer and out comes the South Sider. \n \n It's really not hard; I was a scholarship student who went from the slums to an Ivy League college, and it's very easy for me to play it either way.\n \n Go, Barry, go!!", 
   {}, 
   323226, 
   null, 
   1221067980.0
  ], 
  [
   323236, 
   null, 
   "trebor", 
   ":xbanghead I bet McCain's use of he \"lipstick on a pig\" phrase would be acceptable....\n\n \n \n Why, yes it was when he was referring to Hillary's health plan.\n \n http://www.nytimes.com/2007/10/12/us/politics/12health.html?_r=2&ref=politics&oref=slogin&oref=slogin", 
   {}, 
   323196, 
   null, 
   1221069480.0
  ], 
  [
   323238, 
   null, 
   "T.Q", 
   "This \"lipstick on a pig\" thing is pretty sad:\n \n \"You can put lipstick on a pig,\" he said as the crowd cheered. \"It's still a pig.\"\n \n \"You can wrap an old fish in a piece of paper called change. It's still gonna stink.\"\n \n \"We've had enough of the same old thing.\"\n \n It's pretty obvious how he means it-dressing up the same old garbage to look differently doesn't change the fact that it's the same old garbage.\n \n You're outraged by this but not the idea that Palin called all women dogs?\n What's the difference between a pit bull and a hockey mom?-lipstick\n \n Seems pretty obvious to me she was calling all women who aren't hockey moms dogs emoticon_rolleyes", 
   {}, 
   323236, 
   null, 
   1221070500.0
  ], 
  [
   323239, 
   null, 
   "jyoshu", 
   "This \"lipstick on a pig\" thing is pretty sad:\n \n \"You can put lipstick on a pig,\" he said as the crowd cheered. \"It's still a pig.\"\n \n \"You can wrap an old fish in a piece of paper called change. It's still gonna stink.\"\n \n \"We've had enough of the same old thing.\"\n \n It's pretty obvious how he means it-dressing up the same old garbage to look differently doesn't change the fact that it's the same old garbage.\n\n \n That may be, but Obama didn't seem to complain when the media played up Bill's comments as racist, and for that matter Obama's campaign took McCain's comments out of context too by playing up the 100-years in Iraq thing.", 
   {}, 
   323238, 
   null, 
   1221071400.0
  ], 
  [
   323241, 
   null, 
   "T.Q", 
   "That may be, but Obama didn't seem to complain when the media played up Bill's comments as racist, and for that matter Obama's campaign took McCain's comments out of context too by playing up the 100-years in Iraq thing.\n\n \n I have no idea who Bill is or what \"100-years in Iraq thing\" you're talking about.", 
   {}, 
   323239, 
   null, 
   1221072300.0
  ], 
  [
   323245, 
   null, 
   "isly ilwott", 
   "This \"lipstick on a pig\" thing is pretty sad:\n \n \"You can put lipstick on a pig,\" he said as the crowd cheered. \"It's still a pig.\"\n \n \"You can wrap an old fish in a piece of paper called change. It's still gonna stink.\"\n \n \"We've had enough of the same old thing.\"\n \n It's pretty obvious how he means it-dressing up the same old garbage to look differently doesn't change the fact that it's the same old garbage.\n \n You're outraged by this but not the idea that Palin called all women dogs?\n What's the difference between a pit bull and a hockey mom?-lipstick\n \n Seems pretty obvious to me she was calling all women who aren't hockey moms dogs emoticon_rolleyes\nI inferred that she was bragging of their (hockey moms') tenacity and determination...in a complimentary manner. Comparisons of analogous traits do not imply completely identical descriptions of the parties compared. Her comment was not meant to portray hockey moms as dogs...of any kind.", 
   {}, 
   323238, 
   null, 
   1221073680.0
  ], 
  [
   323247, 
   null, 
   "isly ilwott", 
   "I have no idea who Bill is or what \"100-years in Iraq thing\" you're talking about.\nI think it's Bill Clinton. I think the \"100-years in Iraq thing\" refers to John McCain's saying that we would be in Iraq as long as necessary...a hundred years if it takes that long. It was misrepresented by the Obama backers to promote the silly idea that McCain wants to be there for another hundred years. This is clearly not what McCain said. It's Obama's strawman argument.\n \n Obama and company will have to 'convince' a lot of voters with lies about McCain/Palin to beat them. McCain/Palin plainly has the best interests of this country in mind. Obama/Biden is pulling for the Democratic Party.", 
   {}, 
   323241, 
   null, 
   1221074160.0
  ], 
  [
   323249, 
   null, 
   "T.Q", 
   "I inferred that she was bragging of their (hockey moms') tenacity and determination.\n\n \n Exactly, but if we put the same spin on it as is being put on Obama's comments, then it's obvious she called all women but hockey mom's dogs, isn't it?\n \n \nObama and company will have to 'convince' a lot of voters with lies about McCain/Palin to beat them. McCain/Palin plainly has the best interests of this country in mind. Obama/Biden is pulling for the Democratic Party. \n\n I'm really not seeing that. McCain has all but promised to continue what Bush et al started, and I think we've all seen how good that is for the US. And I don't see where you get Obama/Biden are in it for the party only.", 
   {}, 
   323245, 
   null, 
   1221074460.0
  ], 
  [
   323251, 
   null, 
   "isly ilwott", 
   "Exactly, but if we put the same spin on it as is being put on Obama's comments, then it's obvious she called all women but hockey mom's dogs, isn't it? \nIt seems you misspoke there. She said that the difference between a hockey mom and a pit bull was lipstick, thus equating hockey moms to pit bulls in regard to tenacity and determination. She did not address \"all women but hockey moms\".\n \n I haven't analyzed Obama's comments in detail. I'd rather wait 'til I see verbatum records of his comments leading up to his \"pig\" statement before comparing their apparent intents. I don't know that there's been any \"spin\" on his comment. He does seem to have miffed a lot of people with it.\n \n \n\n I'm really not seeing that. McCain has all but promised to continue what Bush et al started, and I think we've all seen how good that is for the US. And I don't see where you get Obama/Biden are in it for the party only.\nMcCain has done nothing of the sort. He clearly stated in his acceptance speech that the good old boys from both sides of the aisle can look forward to reform. The facts...that he wants to continue the tax rate cuts, successfully finish the war, work toward energy independence, reform that tax structure, end pork barrel spending...mirror only parts of the Bush/Cheney behavior. McCain is not \"the same old thing\". McCain has never been the same as George Bush. He's been the \"maverick\" of the Senate for years. He's been criticized for being too liberal and for siding with the Democrats...even sponsoring bills with them.\n \n I do not understand HOW (I do know WHY) the Obama backers justify saying that McCain is the same as Bush. It would not be \"4 more years of the same\" as described by the liars from the Obamania faction. You can look at McCain's voting record (and Palin's accomplishments in reforming her state government) and see that change is on the way. McCain is not stealing Obama's thunder by suggesting that...he's telling the truth. Obama and company lie to you when they say otherwise. They are running scared...rightfully so.\n \n With few exceptions (such as John Kennedy, Joe Lieberman, Zell Miller and some others) Democrats appear to be \"in it for the good of the party\". Ted Kennedy, Nancy Pelosi and others in the Democratic Party have sabotaged the good work of Republicans in an effort to make the Republicans fail at their task. This is an effort for the party rather than for the good of the nation. Obama promises CHANGE. I'm sure he could deliver that. However, the change should be for the betterment of our condition, not for total collapse of the American economy and our dissolution into a one-world, socialistic government.", 
   {}, 
   323249, 
   null, 
   1221075660.0
  ], 
  [
   323254, 
   null, 
   "trebor", 
   "It seems you misspoke there. She said that the difference between a hockey mom and a pit bull was lipstick, thus equating hockey moms to pit bulls in regard to tenacity and determination. She did not address \"all women but hockey moms\".\n \n I haven't analyzed Obama's comments in detail. I'd rather wait 'til I see verbatum records of his comments leading up to his \"pig\" statement before comparing their apparent intents. I don't know that there's been any \"spin\" on his comment. He does seem to have miffed a lot of people with it.\n \n McCain has done nothing of the sort. He clearly stated in his acceptance speech that the good old boys from both sides of the aisle can look forward to reform. The facts...that he wants to continue the tax rate cuts, successfully finish the war, work toward energy independence, reform that tax structure, end pork barrel spending...mirror only parts of the Bush/Cheney behavior. McCain is not \"the same old thing\". McCain has never been the same as George Bush. He's been the \"maverick\" of the Senate for years. He's been criticized for being too liberal and for siding with the Democrats...even sponsoring bills with them.\n \n I do not understand HOW (I do know WHY) the Obama backers justify saying that McCain is the same as Bush. It would not be \"4 more years of the same\" as described by the liars from the Obamania faction. You can look at McCain's voting record (and Palin's accomplishments in reforming her state government) and see that change is on the way. McCain is not stealing Obama's thunder by suggesting that...he's telling the truth. Obama and company lie to you when they say otherwise. They are running scared...rightfully so.\n\n \n \n I did look at McCain's voting record for the last 7 years. That is why I decieded against him. For that matter, when it comes to the polices I am rejecting McCain for are the exact same things I reject Hillary for. When it comes to the war, McCain was close to Bush that McCain could see what Bush's last meal was... \n \n From the inside at that.", 
   {}, 
   323251, 
   null, 
   1221076620.0
  ], 
  [
   323255, 
   null, 
   "T.Q", 
   "I did look at McCain's voting record for the last 7 years. That is why I decieded against him. For that matter, when it comes to the polices I am rejecting McCain for are the exact same things I reject Hillary for. When it comes to the war, McCain was close to Bush that McCain could see what Bush's last meal was... \n \n From the inside at that.\n\n \n Which is pretty much what I've said on a few threads now. The McCain of 8 years ago would have made a great president-he should have been nominated instead of Bush. The McCain of the last seven years has been almost Bush's shadow.\n \n What happened to the McCain of 8 years ago?\n \n \nIt seems you misspoke there. She said that the difference between a hockey mom and a pit bull was lipstick, thus equating hockey moms to pit bulls in regard to tenacity and determination. She did not address \"all women but hockey moms\".\n \n\n Correct, my mistake (it somehow made sense when I typed it, but it sure doesn't on second glance)-What I should have said is if we apply the same spin to this comment, then she is calling all hockey mom's dogs. The other alternative spin we can put on it is that all women who aren't hockey mom's are weak and wishy-washy. Of course, she wasn't saying either of those things, just like Obama wasn't calling Palin a pig or saying that she stinks.", 
   {}, 
   323254, 
   null, 
   1221077700.0
  ], 
  [
   323261, 
   null, 
   "Archangel", 
   "That may be, but Obama didn't seem to complain when the media played up Bill's comments as racist, and for that matter Obama's campaign took McCain's comments out of context too by playing up the 100-years in Iraq thing.\n\n \n Turn around is fair play in Politics, but the dems don't like it when what they say comes back to haunt them.\n \n \nI have no idea who Bill is or what \"100-years in Iraq thing\" you're talking about.\n\n \n Why should you! You don't even have a dog in this race. emoticon_xgood", 
   {}, 
   323241, 
   null, 
   1221079380.0
  ], 
  [
   323266, 
   null, 
   "isly ilwott", 
   "...\n \n \n Why should you! You don't even have a dog in this race. emoticon_xgood\nThat doesn't mean he's not permitted to discuss this.", 
   {}, 
   323261, 
   null, 
   1221081480.0
  ], 
  [
   323271, 
   null, 
   "T.Q", 
   "That doesn't mean he's not permitted to discuss this.\n\n \n Thank you Isly", 
   {}, 
   323266, 
   null, 
   1221081960.0
  ], 
  [
   323283, 
   null, 
   "isly ilwott", 
   "...\n \n I haven't analyzed Obama's comments in detail. I'd rather wait 'til I see verbatum records of his comments leading up to his \"pig\" statement before comparing their apparent intents. I don't know that there's been any \"spin\" on his comment. He does seem to have miffed a lot of people with it.\n \n \n ....\nIf the video I viewed was not edited, then Obama's comment is perfectly acceptable. McCain's previous use of the same adage (lipstick on a pig) is also acceptable as it was used to describe Hillary's plan for healthcare reform.\n \n Palin's use of \"lipstick\" as being the major difference between a hockey mom and a pit bull is also acceptable.", 
   {}, 
   323251, 
   null, 
   1221086940.0
  ], 
  [
   323284, 
   null, 
   "Archangel", 
   "That doesn't mean he's not permitted to discuss this.\n\n \n I understand that isly, but he goes from thread to thread promoting the socialists as a he attacks the conservatives as if he is, first off, an informed citizen, and secondly as if he has a personal stake in the outcome. Discussing the political issues of America is one thing. I can respect that. But he's spreading propaganda and is doing way more than just discussing it. And beside that he aggravates and attacks me every single chance he gets so we don't exactly get along. emoticon_frazzled", 
   {}, 
   323266, 
   null, 
   1221087240.0
  ], 
  [
   323286, 
   null, 
   "T.Q", 
   "I understand that isly, but he goes from thread to thread promoting the socialists as a he attacks the conservatives\n\n I do? Where have I done this? In pretty much every thread I've posted on re: the election, I've stated that if McCain had stuck to his guns and was the man he was 7 years ago, he'd be my pick. \n \n Or were you just trying to imply that because I'm Canadian, I'm a no-good dirty commie socialist?\n \n \n as if he is, first off, an informed citizen,\n\n You're record for informed/uninformed ain't lookin' too good on pretty much any subject pal o' mine.\n \n \nand secondly as if he has a personal stake in the outcome.\n\n The US is the one superpower in the world (for the time being). Whether you succeed or fail, the outcome will affect me too. So guess what my myopic little friend, I do have a personal stake in the outcome.\n \n \nBut he's spreading propaganda and is doing way more than just discussing it.\n\n I am? Where? Specific posts and quotes please. Should be easy to find if I'm \"spreading propaganda\" all over. Or do you see me disagreeing with you and sharing my opinion as \"spreading propoganda\"?\n \n \nAnd beside that he aggravates and attacks me every single chance he gets so we don't exactly get along. emoticon_frazzled\n\n No, I point out your mistakes every chance I get. I see how that could be aggravating though. \n \n And once again Archie, if you make an XXX of yourself and someone points it out, it's not an \"attack\".", 
   {}, 
   323284, 
   null, 
   1221089460.0
  ], 
  [
   323287, 
   null, 
   "T.Q", 
   "If the video I viewed was not edited, then Obama's comment is perfectly acceptable. McCain's previous use of the same adage (lipstick on a pig) is also acceptable as it was used to describe Hillary's plan for healthcare reform.\n \n Palin's use of \"lipstick\" as being the major difference between a hockey mom and a pit bull is also acceptable.\n\n \n Agreed on both counts. I can't see how Obama's comments could be misconstrued unless you intentionally ignored any and all semblance of context and were bound and determined to be blind to anything but the possibility it was an insult aimed at Palin.\n \n (The Palin and pitbull thing was an example of how ridiculous the \"lipstick on a pig\" uproar is-again, no way offense could be taken)", 
   {}, 
   323283, 
   null, 
   1221089640.0
  ], 
  [
   323354, 
   null, 
   "isly ilwott", 
   "I understand that isly, but he goes from thread to thread promoting the socialists as a he attacks the conservatives as if he is, first off, an informed citizen, and secondly as if he has a personal stake in the outcome. Discussing the political issues of America is one thing. I can respect that. But he's spreading propaganda and is doing way more than just discussing it. And beside that he aggravates and attacks me every single chance he gets so we don't exactly get along. emoticon_frazzled\nHuman nature dictates that there will always be 'those on attack' representing just about any philosophy known. That a socialist would constantly attack a conservative is not an abnormal thought. Just as religious zealots constantly attack those with whom they disagree, Democrats constantly attack Republicans (and vice versa), socialists constantly attack capitalists (and vice versa), doves constantly attack hawks (and vice versa), women attack men (and vice versa), gays attack straights (and vice versa), blacks attack whites (and vice versa)...it is in our nature to use language as a weapon against ideas to which we object or disagree with regarding the solutions of our woes.\n \n T.Q lives in a socialist country. What do you expect from him? He may be one of those that touts socialized medicine yet travels to the United States for actual medical care.\n \n We've drifted away from discussing Obama's Pastor. However, the tangent toward socialism is not far off topic. The true topic is Barack Obama...a Marxist if there ever was one.\n \n My true regret regarding Marx and Marxism is that Marx did not live longer to see the miserable failure of his dream society.", 
   {}, 
   323284, 
   null, 
   1221152640.0
  ], 
  [
   323414, 
   null, 
   "T.Q", 
   "But he's spreading propaganda and is doing way more than just discussing it.\n\n Just so everyone is aware, after asking Archie to support his claims that I am \"spreading propoganda\", there has been no evidence presented. In fact, Archie said in this post that he has absolutely no intention of even attempting to support this accusation.\n \n Admin, how long are you going to let him get away with this? He slanders anyone who disagrees with him, then when he's asked to support his accusations, he refuses. This is not only dishonest, it's despicable behaviour.", 
   {}, 
   323354, 
   null, 
   1221180000.0
  ], 
  [
   323420, 
   null, 
   "Archangel", 
   "Human nature dictates that there will always be 'those on attack' representing just about any philosophy known. That a socialist would constantly attack a conservative is not an abnormal thought. Just as religious zealots constantly attack those with whom they disagree, Democrats constantly attack Republicans (and vice versa), socialists constantly attack capitalists (and vice versa), doves constantly attack hawks (and vice versa), women attack men (and vice versa), gays attack straights (and vice versa), blacks attack whites (and vice versa)...it is in our nature to use language as a weapon against ideas to which we object or disagree with regarding the solutions of our woes.\n \n T.Q lives in a socialist country. What do you expect from him? He may be one of those that touts socialized medicine yet travels to the United States for actual medical care.\n \n We've drifted away from discussing Obama's Pastor. However, the tangent toward socialism is not far off topic. The true topic is Barack Obama...a Marxist if there ever was one.\n \n My true regret regarding Marx and Marxism is that Marx did not live longer to see the miserable failure of his dream society.\n\n \n All good points. I would even argue that if Marxism could be carried out as Marx envisioned it, it could be a wonderful political system. What Marx never understood, or was naive in not realizing, was that Marxism would never succeed due to the human nature of greed, and the desire for individual power. These universal character flaws meant that Marxism could never succeed unless its leaders are truly righteous men. And based on the totalitarian principles upon which Marxism/Communism has evolved, and the oppression and human misery it has fomented, we have seen how impossible it is to manage such a system for the benefit of all the people under its banner.", 
   {}, 
   323414, 
   null, 
   1221181260.0
  ], 
  [
   323433, 
   null, 
   "Penfold", 
   " ......... Marxism would never succeed due to the human nature of greed, and the desire for individual power. These universal character flaws ........ \n\n \n \n \"The Christian resolve to find the world evil and ugly, has made the world evil and ugly.\"\n (Friedrich Nietzsche / 1844-1900)", 
   {}, 
   323420, 
   null, 
   1221184920.0
  ], 
  [
   323439, 
   null, 
   "Archangel", 
   "\"The Christian resolve to find the world evil and ugly, has made the world evil and ugly.\"\n (Friedrich Nietzsche / 1844-1900)\n\n \n If there were no God, there would be no atheists.-Gilbert K. Chesterton emoticon_xgood", 
   {}, 
   323433, 
   null, 
   1221186780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Obama's Pastor", 
  "url": "http://www.4forums.com/political/elections-debates/11575-obamas-pastor.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11575, 
  "discussion_files": [
   [
    "30214.html", 
    "http://www.4forums.com/political/elections-debates/11575-obamas-pastor-print.html"
   ], 
   [
    "30215.html", 
    "http://www.4forums.com/political/elections-debates/11575-obamas-pastor-6-print.html"
   ], 
   [
    "30216.html", 
    "http://www.4forums.com/political/elections-debates/11575-obamas-pastor-4-print.html"
   ], 
   [
    "30217.html", 
    "http://www.4forums.com/political/elections-debates/11575-obamas-pastor-5-print.html"
   ], 
   [
    "30218.html", 
    "http://www.4forums.com/political/elections-debates/11575-obamas-pastor-3-print.html"
   ], 
   [
    "30219.html", 
    "http://www.4forums.com/political/elections-debates/11575-obamas-pastor-2-print.html"
   ]
  ], 
  "identifier": 11575
 }
]