[
 [
  [
   323887, 
   null, 
   "jyoshu", 
   "The Obama campaign is preparing rolling out a new line of &#8220;faith merchandise&#8221; &#8211; the latest move in an ambitious effort to win over religious voters.\n \n &#8220;Check out the Believers for Barack, Pro-Family Pro-Obama, and Catholics for Obama buttons, bumper stickers and signs&#8230;.&#8221; says Obama Deputy Director of Religious Affairs Paul Monteiro in an e-mail obtained by the Beliefnet Web site.\n \n &#8220;Believers for Barack rally signs and bumper stickers, along with all Pro-Family Pro-Obama merchandise, are appropriate for people of all faith backgrounds. We'll soon be rolling out merchandise for other religious groups and denominations, but I wanted to get this out to you without delay,&#8221; he adds.\n \n http://politicalticker.blogs.cnn.com/2008/09/15/obama-campaign-rolls-out-new-faith-merchandise/\n \n 'Course, we all just know that many of his supporters are going to take issue with this sort of thing and condemn the obvious mixing of religion and politics amd voting over religion that they made such a big deal of last election ... emoticon_xangel", 
   {
    "post_info": {
     "post_title": "Obama Faith Merchandise"
    }
   }, 
   null, 
   null, 
   1221578340.0
  ], 
  [
   323892, 
   null, 
   "Archangel", 
   "The Obama campaign is preparing rolling out a new line of \"faith merchandise\" - the latest move in an ambitious effort to win over religious voters.\n \n \"Check out the Believers for Barack, Pro-Family Pro-Obama, and Catholics for Obama buttons, bumper stickers and signs....\" says Obama Deputy Director of Religious Affairs Paul Monteiro in an e-mail obtained by the Beliefnet Web site.\n \n \"Believers for Barack rally signs and bumper stickers, along with all Pro-Family Pro-Obama merchandise, are appropriate for people of all faith backgrounds. We'll soon be rolling out merchandise for other religious groups and denominations, but I wanted to get this out to you without delay,\" he adds.\n \n http://politicalticker.blogs.cnn.com/2008/09/15/obama-campaign-rolls-out-new-faith-merchandise/\n \n 'Course, we all just know that many of his supporters are going to take issue with this sort of thing and condemn the obvious mixing of religion and politics amd voting over religion that they made such a big deal of last election ... emoticon_xangel\n\n \n He's not only wasting his time, money and energy reaching out to the religious Right and the bible believing Catholic vote, he's further revealing what a huge poser he is by focussing attention on that aspect of his hypocrisy. He lost any hope of gaining the support of true believers the night he spoke at the saddleback forum. Because his answers revealed clearly that he doesn't know the spiritual truth from the christian perspective at all. \n \n He has insulted the intelligence of believers everywhere by thinking that he could con us into believing he actually knows God personally, or has accepted Jesus Christ as his personal Saviour. Because if he truly possessed the Holy Spirit of God within him, he never would have said that knowing when a BABY gets human rights was above his pay grade. Only a religious poser would answer as he did. And every believer clearly saw that for themselves, first hand, right from the horses own mouth. A SADDLEBACK FORUM/LOONEY TUNES SPECIAL emoticon_xbouncer", 
   {
    "unicode_changes_made": true
   }, 
   323887, 
   null, 
   1221580680.0
  ], 
  [
   323893, 
   null, 
   "T.Q", 
   "he never would have said that knowing when a BABY gets human rights was above his pay grade.\n\n Are you for real? He's stating that such questions, which are debated endlessly among theologians who devote their lives to such studies, are ones he does not have a definitive answer to. Saying this is a spiritual question which he does not have a definitive answer to shows him to be a poser?", 
   {}, 
   323892, 
   null, 
   1221580920.0
  ], 
  [
   323898, 
   null, 
   "Archangel", 
   "Are you for real? He's stating that such questions, which are debated endlessly among theologians who devote their lives to such studies, are ones he does not have a definitive answer to. Saying this is a spiritual question which he does not have a definitive answer to shows him to be a poser?\n\n \n No TQ, the debate is not between Theologians. It's between Theologians and secular humanists who disagree with bible believers regarding when life begins. Even the RCC which I disagree with on so many scriptural and doctrinal issues agrees that life begins at conception. So this isn't a question for TRUE Christians at all. Only secular humanists struggle with this question, and atheists also, of course.", 
   {}, 
   323893, 
   null, 
   1221584940.0
  ], 
  [
   323960, 
   null, 
   "Jo Bennett", 
   "Since when did views about abortion become the litmus test of who is a True Christian (TM)? I don't recall abortion featuring in any statement of belief by any Church I have ever seen. In any case, just because someone thinks abortion should be legal (like, maybe, they think adultery should be legal), doesn't mean they think it is right or good.\n \n Plenty of Christians will support Obama, apart from anything else he sets a better example of Christian living than the divorced adulterer McCain. In addition his economic, environmental and social policies are (marginally) more in accordance with Christian teaching.", 
   {}, 
   323898, 
   null, 
   1221633000.0
  ], 
  [
   323971, 
   null, 
   "Penfold", 
   " .... He has insulted the intelligence of believers everywhere by thinking that he could con us ..... \n\n \n \n Those who believe in an invisible man in the sky who knows the inner workings of the minds and future intentions of every inhabitant of his ant farm would be so hard to fool. Nobody's gonna pull the wool over their eyes!", 
   {}, 
   323892, 
   null, 
   1221656580.0
  ], 
  [
   323985, 
   null, 
   "Archangel", 
   "Since when did views about abortion become the litmus test of who is a True Christian (TM)? I don't recall abortion featuring in any statement of belief by any Church I have ever seen. In any case, just because someone thinks abortion should be legal (like, maybe, they think adultery should be legal), doesn't mean they think it is right or good.\n \n Plenty of Christians will support Obama, apart from anything else he sets a better example of Christian living than the divorced adulterer McCain. In addition his economic, environmental and social policies are (marginally) more in accordance with Christian teaching.\n\n \n How was him being asked about when a baby gets human rights anything like asking about his personal beliefs regarding abortion? As usual, you completely missed the point.", 
   {}, 
   323960, 
   null, 
   1221666360.0
  ], 
  [
   323986, 
   null, 
   "jyoshu", 
   "Plenty of Christians will support Obama, apart from anything else he sets a better example of Christian living than the divorced adulterer McCain.\n\n \n After reading this statement, I don't think you really have a good sense of the way American Christian culture is. It's not going to matter to much of anyone that McCain has been through a divorce. Perhaps it should, but it won't. Maybe you were being facetious.", 
   {}, 
   323960, 
   null, 
   1221666480.0
  ], 
  [
   324016, 
   null, 
   "Jo Bennett", 
   "After reading this statement, I don't think you really have a good sense of the way American Christian culture is. It's not going to matter to much of anyone that McCain has been through a divorce. Perhaps it should, but it won't. Maybe you were being facetious.\n\n \n I have a pretty good idea of how flexible the \"religious\" right's morals are when it comes to people like them (i.e. WASP republicans). I wasn't so much being facetious as engaging in some wishful thinking.", 
   {}, 
   323986, 
   null, 
   1221682440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Obama Faith Merchandise", 
  "url": "http://www.4forums.com/political/elections-debates/11598-obama-faith-merchandise.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11598, 
  "discussion_files": [
   [
    "7704.html", 
    "http://www.4forums.com/political/elections-debates/11598-obama-faith-merchandise-print.html"
   ]
  ], 
  "identifier": 11598
 }
]