[
 [
  [
   323966, 
   null, 
   "applemacin", 
   "House Passes Bill To Expand Drilling, Fund Renewables. Asserted that present measures aren't enough. \n \n\n The House approved a package of energy initiatives yesterday, including measures that would allow oil drilling as close as 50 miles off the Atlantic and Pacific coasts and finance the long-term development of alternative energy sources.\n \n In the first substantive votes since gasoline prices rose above $4 a gallon this summer, the House divided largely along party lines, 236 to 189, with most Republicans rejecting the Democratic-sponsored legislation because it would prohibit exploration of much of the known oil reserves closer to the coasts and in the Gulf of Mexico.\n \n As they reversed their long-held opposition to more offshore oil exploration, Democrats said the increased taxes on oil companies in the bill and the collection of royalty payments from the drilling would yield billions of dollars to help finance the development of cleaner, renewable energy sources.\n \n \"We're not trying to give incentives to drill, we're giving incentives to invest in renewables and natural gas that will take us where we need to go,\" House Speaker Nancy Pelosi (Calif.) told reporters before the vote.\n \n The legislation now moves to the Senate, where it will compete with three alternative proposals, each of which faces a difficult road to securing the 60 votes needed for passage.\n \n If Congress does not act on the measures by Sept. 30, the current ban on offshore oil drilling will expire, and exploration will be allowed as close as three miles off all U.S. coastlines. In July, President Bush lifted an executive order that had blocked drilling on the outer continental shelf.\n \n Yesterday's action came two months after the average price of gas peaked at more than $4.10 a gallon, prompting Republicans to make offshore drilling one of their central political planks as they headed into the party conventions and the fall elections. But as Democrats buckled under the political pressure for more drilling and began assembling the legislation, oil prices began falling. The cost of a barrel of oil has dropped about $55, or about a third, from its peak this summer.\n \n The unexpected boon of falling oil prices did little to change the tenor of the political debate yesterday. Pelosi brushed aside suggestions that lower prices would discourage more domestic drilling, in turn reducing the amount of money available for renewable resources.\n \n \"I think once you go past $35 a barrel, there's incentive for them to drill. It's not just about the drilling revenues, it's about ending the subsidies\" and securing greater royalties, she said.\n \n Republicans vowed to continue their push right up to Election Day for a more expansive drilling program and more funding for nuclear power, which was not included in the Pelosi bill.\n \n \"The American people understand that we need an 'all of the above' approach to securing our energy future -- including drilling offshore, nuclear power, conservation and renewable energy,\" said Brian Rogers, spokesman for Sen. John McCain's presidential campaign.\n \n Sen. Richard Burr (R-N.C.), a McCain supporter who favors more drilling, said the summer price spike was such a shock to consumers that they will demand increased domestic production to protect against future run-ups.\n \n \"The impact was so great this time, the American people said, 'Enough's enough, let's take back control,' \" Burr said.\n \n The legislation calls for drilling 100 miles off the Atlantic and Pacific coasts, or beyond 50 miles if governors and state legislatures approve. It would repeal tax breaks given to major oil companies in a 2004 bill and would force companies to pay for leases given to them in the late 1990s for drilling in the Gulf of Mexico, a move that has saved them $15 billion over the past decade, according to Democratic estimates.\n \n The bill requires 10 percent of the Strategic Petroleum Reserve to be released into the marketplace and increases funding for home-heating assistance for the poor.\n \n One piece of the legislation was added this week when Democrats agreed to allow new exploration of oil shale in the Mountain West if states agree to it.\n \n Republicans and some industry experts contend that little new energy production would result from the legislation, because federal studies have shown that more than 85 percent of known offshore oil reserves are inside the 50-mile mark.\n \n The bill would not allow the sharing of royalties from leases with states, something that could decrease the incentive for state governments to allow drilling closer to their coasts. Pelosi indicated some willingness yesterday to consider a compromise on that issue.\n \n Calling the process \"rigged,\" House Minority Leader John A. Boehner (R-Ohio) protested the less-than-24-hour period between the legislation's unveiling and yesterday's vote, during which Republicans could not offer amendments.\n \n \"The bill that's coming to the floor is nothing more than a hoax on the American people, and they will not buy it,\" Boehner said.\n\n \n What's your take on this?", 
   {
    "post_info": {
     "post_title": "Lawmakers vote to end 26-year ban on offshore drilling"
    }
   }, 
   null, 
   null, 
   1221645660.0
  ], 
  [
   323981, 
   null, 
   "chester", 
   "House Passes Bill To Expand Drilling, Fund Renewables. Asserted that present measures aren't enough. \n \n What's your take on this?\n\n \n Wrong approach by 180 degrees.\n \n If the nation is really serious about conserving energy and developing clean sources, the Congress should immediately pass a tax hike of $2/gal on all petroleum products, with the proceeds to benefit a Manhattan Project style research program into alternative fuels.\n \n Making more petroleum available only delays the ultimate day of reckoning.", 
   {}, 
   323966, 
   null, 
   1221665880.0
  ], 
  [
   323998, 
   null, 
   "Archangel", 
   "House Passes Bill To Expand Drilling, Fund Renewables. Asserted that present measures aren't enough. \n \n \n What's your take on this?\n\n \n My take on this is the only rational one, and that is that in typical fashion these lying, deceitful radical Leftists in the Democratic Party wrote a useless bill that allowed drilling FIFTY MILES OFFSHORE when they know very well that the Oil reserves are all located well inside that distance. So they have appeared to create a solution when they have accomplished nothing at all because they know that Oil Companies will never invest the billions needed to harvest where there is no oil to harvest. So the net result of thi bill is a lot of cheap lip service which amounts to nothing real for the American people.\n \n The good news is that this political con job by the dems should effectively guarantee that the voters will kick these lying leftists out of power on their keisters in November. There is nothing more despicable than for these politicians to write legislation that their passing off as a solution for a serious problem, when they know very well that it's NO SOLUTION AT ALL IN REALITY EVEN IF IT WAS PASSED IN THE DEMOCRATICALLY CONTROLLED SENATE!!!\n \n PS Apple, welcome to the forum, I'm not yelling at you, I'm yelling at the lying politicians. emoticon_frazzled", 
   {}, 
   323966, 
   null, 
   1221671580.0
  ], 
  [
   324014, 
   null, 
   "Jo Bennett", 
   "Promoting renewables is a good thing, but increasing the supply of oil in counter productive in helping renewables to reach the critical mass needed to survive economically.", 
   {}, 
   323998, 
   null, 
   1221682140.0
  ], 
  [
   324059, 
   null, 
   "Archangel", 
   "Promoting renewables is a good thing, but increasing the supply of oil in counter productive in helping renewables to reach the critical mass needed to survive economically.\n\n \n If we could rub a brass lamp, make three wishes and fix our energy problems immediately, I'd agree with you. But since we live in the REAL WORLD, we must become OIL INDEPENDENT while we are perfecting and building an infrastructure of renewable energy sources.", 
   {}, 
   324014, 
   null, 
   1221709380.0
  ], 
  [
   324072, 
   null, 
   "Penfold", 
   "Oil independence is a pipe dream. What are you smoking in yours?;)", 
   {}, 
   324059, 
   null, 
   1221712320.0
  ], 
  [
   324075, 
   null, 
   "Archangel", 
   "Oil independence is a pipe dream. What are you smoking in yours?;)\n\n \n Can you prove that defeatist claim or are we to just take your word for it once again?", 
   {}, 
   324072, 
   null, 
   1221717300.0
  ], 
  [
   324077, 
   null, 
   "Jo Bennett", 
   "Can you prove that defeatist claim or are we to just take your word for it once again?\n\n \n Ths US currently imports about 70% of its oil (if memory serves). The only way to raise that to 100% is to cut the use of oil.", 
   {}, 
   324075, 
   null, 
   1221719880.0
  ], 
  [
   324085, 
   null, 
   "Penfold", 
   "Can you prove that defeatist claim or are we to just take your word for it once again?\n\n \n You obviously have no clue as to the amount available AND recoverable compared to the current demand. There is a clue in the phrase \"A drop in the ocean.\" .....emoticon_rolleyes", 
   {}, 
   324075, 
   null, 
   1221738240.0
  ], 
  [
   324088, 
   null, 
   "Archangel", 
   "Ths US currently imports about 70% of its oil (if memory serves). The only way to raise that to 100% is to cut the use of oil.\n\n I have no idea what you are saying here. I think you're reversing what you intended to say. The last thing I want to do is increase the amount we import. I want to increase our oil independence from foreign sources like OPEC.\n \nYou obviously have no clue as to the amount available AND recoverable compared to the current demand. There is a clue in the phrase \"A drop in the ocean.\" .....emoticon_rolleyes\n\n Beside that just not being true at all, by Oil Independent, I'm not saying that the US must produce every bit of our daily needs from within our own borders. We have friends we buy Oil from which we would continue to trade with. Countries like Canada whom we currently buy our largest supply from, and Mexico also, which is our second largest supplier. Here's a breakdown of how much we import just to inject some realistic perspective to this discussion. http://www.gravmag.com/oil5q.gif Add up the friendly Countries we currently buy from and they supply 46.9% of our daily needs. Add to that what we ourselves supply currently, which is 40% shown here.\n \n So in reality, we currently access 86.9% of our oil needs either domestically or from solid friendly sources. So if we could increase domestic production by only 13.1%, we could be free of OPEC and sending money to the Middle East. And that is a good thing, as Martha would say. http://www.gravmag.com/oil.html", 
   {}, 
   324085, 
   null, 
   1221743040.0
  ], 
  [
   324126, 
   null, 
   "CUNxTime", 
   "Its going to require a comprehensive approach to keep the US economy steaming ahead into the next century. We must develop and use our natural resources to the greatest extent possible while all the while developing nuclear, CNG, wind, solar, and etc... The argument that new drilling won't help us for 10 years is senseless because\n 1. even the threat of increased supply will decrease speculation prices \n \n and\n \n 2. I (we) plan on being here in 10 years when that oil does begin to flow.\n \n Drill, Drill, and Drill and all the while use R & D to position us for the next phase of energy production. Companies, Scientists, and Etc... will continue to develop alternate sources whether or not there is oil flowing because the money they stand to make is huge... I for one would rather have gas in the meantime while they develop the next generation of solar panels or whatever is going to get me around...", 
   {}, 
   324088, 
   null, 
   1221758580.0
  ], 
  [
   324128, 
   null, 
   "Archangel", 
   "Its going to require a comprehensive approach to keep the US economy steaming ahead into the next century. We must develop and use our natural resources to the greatest extent possible while all the while developing nuclear, CNG, wind, solar, and etc... The argument that new drilling won't help us for 10 years is senseless because\n 1. even the threat of increased supply will decrease speculation prices \n \n and\n \n 2. I (we) plan on being here in 10 years when that oil does begin to flow.\n \n Drill, Drill, and Drill and all the while use R & D to position us for the next phase of energy production. Companies, Scientists, and Etc... will continue to develop alternate sources whether or not there is oil flowing because the money they stand to make is huge... I for one would rather have gas in the meantime while they develop the next generation of solar panels or whatever is going to get me around...\n\n \n And just think of the NEW JOBS these emerging energy industries will create for AMERICANS in R&D Manufacturing, in Wholesale and then in Retail as then end products are sold to the public. And let's not forget the service and maintenance of the end products. \n \n And as these new energy sources dominate the market, our addiction to Oil will steadily decrease incrementally to the growth of the new technologies.", 
   {}, 
   324126, 
   null, 
   1221759240.0
  ], 
  [
   324146, 
   null, 
   "Jo Bennett", 
   "I have no idea what you are saying here. I think you're reversing what you intended to say. The last thing I want to do is increase the amount we import. I want to increase our oil independence from foreign sources like OPEC.\n\n \n Sorry, you're right, I meant cut it to 0%. Thanks :p\n \n The problem with drilling for more oil is that it results in dropping the price, which makes renewables less competitive, which in turn reduces investment in them, which results in depending on oil for even longer.", 
   {}, 
   324088, 
   null, 
   1221766740.0
  ], 
  [
   324149, 
   null, 
   "isly ilwott", 
   "Being in favor of off-shore drilling does not preclude being in favor of alternative fuels. We need to do both. All this BS about waiting to make a decision on drilling in a comprehensive energy package is just as stupid as waiting on a comprehensive illegal-alien bill to close the border. Close the border today. Figure out what to do with the current illegal occupants later. Drill today. Build nuclear plants today. Search for alternative fuels today. Decrease imports of oil today. Tell the ME to drink their oil and eat their sand. The OPEC countries manipulate the price of oil to their own benefit by limiting production. We should make haste in all areas to get out from under their control.", 
   {}, 
   324146, 
   null, 
   1221769080.0
  ], 
  [
   324152, 
   null, 
   "Archangel", 
   "Sorry, you're right, I meant cut it to 0%. Thanks :p\n \n The problem with drilling for more oil is that it results in dropping the price, which makes renewables less competitive, which in turn reduces investment in them, which results in depending on oil for even longer.\n\n \n This rationale is ridiculous. We understand that no matter what the cost of a barrel of oil, we must invest billions into alternative energy sources over the next decade or two before establishing them in any viable or major way. And by not only commiting to oil independence, but Wind, Solar, Fuel Cell, thermal and hydro, we will create enough jobs to power the next generation of the 21st centuries version of the Industrial revolution.\n \n Your view that we must torture ourselves into doing the right thing by working against high oil prices is the typical defeatist perspective that drives the socialist way of thinking. But that isn't what made America the greatest Country on Earth. Inovation, imagination and the boldness to do the right thing even when we didn't have to is. \n \n Just like when we created the most comprehensive anti-polution regulations for the USA that the world had ever seen starting back in 1955. The US lead, we didn't follow. This culminated in creating complete industries which invented scrubber technology that led to the upgrading of all of America's factories and power plants which reversed the dangerous levels of pollutants within a decade of instituting the policies to clean up the environment. Here's a LINK that shows America's leadership in this area. \n \n It is 2008 and most Countries in the World are still in the dark ages regarding this issue for the very reason that they are waitung for it to cost too much before they will react. My point is that COST shouldn't be the determining factor for doing the right thing. That is my reason for bringing up the pollution issue.", 
   {}, 
   324146, 
   null, 
   1221770640.0
  ], 
  [
   324196, 
   null, 
   "TRIGGER", 
   "Sorry, you're right, I meant cut it to 0%. Thanks :p\n \n The problem with drilling for more oil is that it results in dropping the price, which makes renewables less competitive, which in turn reduces investment in them, which results in depending on oil for even longer.\n\n \n If this is true then renewable as they are to day, are also less efficient and economical. We probably need another 10 to 20 years of R&D to get renewables to where they become more efficient and economical then oil. It is irresponsible to artificially hold oil at an unsustainable high price this wreaks havoc on the economy causing inflation in every sector of the economy. People are paying more than twice what the used to fuel up their cars. So instead of having 3 to 5 hundred in disposable income a month you are reduced to either just surviving or sinking.", 
   {}, 
   324146, 
   null, 
   1221791220.0
  ], 
  [
   324225, 
   null, 
   "Jo Bennett", 
   "The only thing that will speed up the development of renewables is economic necessity. We could have efficient, economic renewables within 5 years, rather than 10 or 20 (or even longer if oil prices fall a long way), if oil prices stay where they are. There will be some short term pain, but the long term benefits are far greater.", 
   {}, 
   324196, 
   null, 
   1221805020.0
  ], 
  [
   324321, 
   null, 
   "CUNxTime", 
   "Sorry, you're right, I meant cut it to 0%. Thanks :p\n \n The problem with drilling for more oil is that it results in dropping the price, which makes renewables less competitive, which in turn reduces investment in them, which results in depending on oil for even longer.\n\n \n \n We are going to keep using oil until it is gone. No matter what technologies they come up with there will be people driving older cars and etc... In fact, if lots of people start using other forms of power, it'll just make oil cheaper (supply and demand) for people and places without the new technology, i.e. 3rd world, China, and the elsewhere...", 
   {}, 
   324146, 
   null, 
   1221875460.0
  ], 
  [
   324351, 
   null, 
   "Jo Bennett", 
   "We are going to keep using oil until it is gone. No matter what technologies they come up with there will be people driving older cars and etc... In fact, if lots of people start using other forms of power, it'll just make oil cheaper (supply and demand) for people and places without the new technology, i.e. 3rd world, China, and the elsewhere...\n\n \n But once renewables reach a certain critical mass the price will drop, and likely drop past that of extracting oil in more and more remote locations. A lot of third world countries already by pass non-renewables for power generation, in remote areas solar pannels and wind turbines are a better bet than grid or generator power.", 
   {}, 
   324321, 
   null, 
   1221904200.0
  ], 
  [
   324402, 
   null, 
   "TRIGGER", 
   "But once renewables reach a certain critical mass the price will drop, and likely drop past that of extracting oil in more and more remote locations. A lot of third world countries already by pass non-renewables for power generation, in remote areas solar pannels and wind turbines are a better bet than grid or generator power.\n\n \n There are inherent problems with wind and solar if the sun isn't shining and the wind doesn't blow no power. The only choice for a reliable clean power source is nuclear. If the congress would allow that we could change our power capabilities to and eco friendly source in about 50 years. The switch to nuclear would conserve oil you wouldn't need to move millions of tons of coal to generating plants by rail and truck, it could also be used for heating our homes instead of heating by oil, also our rail systems could be converted to electric not to mention saving lives men need not go hundreds of feet under the ground to mine it. Though oil will never be done away with. For trucking and shipping, diesel is the only source that can be used at this time our technology hasn't come up with an alternative to the diesel engine yet. One of the reasons third world countries are doing as you said is they don't have the financing or infrastructure to be able to build large scale power systems.", 
   {
    "unicode_changes_made": true
   }, 
   324351, 
   null, 
   1221951120.0
  ], 
  [
   324426, 
   null, 
   "CUNxTime", 
   "GO NUCLEAR!!!! We should be building hundreds of nuclear power plants!!!", 
   {}, 
   324402, 
   null, 
   1221967020.0
  ], 
  [
   324447, 
   null, 
   "Jo Bennett", 
   "There are inherent problems with wind and solar if the sun isn't shining and the wind doesn&#8217;t blow no power. The only choice for a reliable clean power source is nuclear. If the congress would allow that we could change our power capabilities to and eco friendly source in about 50 years. The switch to nuclear would conserve oil you wouldn't need to move millions of tons of coal to generating plants by rail and truck, it could also be used for heating our homes instead of heating by oil, also our rail systems could be converted to electric not to mention saving lives men need not go hundreds of feet under the ground to mine it. Though oil will never be done away with. For trucking and shipping, diesel is the only source that can be used at this time our technology hasn't come up with an alternative to the diesel engine yet. One of the reasons third world countries are doing as you said is they don't have the financing or infrastructure to be able to build large scale power systems.\n\n \n Actually solar still works fairly well on cloudy days, not perfectly but pretty well, and the big thing is going to be setting up reflectors to concentrate light, and placing these setups in desert areas where sunlight is more constant. Wind, while variable, is predictable fairly precisely up to 3 hours in advance. You also miss out the very reliable tidal power already starting to come on stream, and wave power which is more predictable than wind.\n \n Battery technology and wider scale power distribution (probably using DC over long distances and then converting to AC closer to POU) are going to be key as well. variability isn't going to matter much if the main purpose is to recharge vehicle batteries.\n \n Nuclear is pretty dangerous and for all the claims that France and others do it safely there have been horrendous leaks of nuclear material in France recently, and in the UK there have been numerous accidents within living memory, particularly at Sellafield, which led to entire generations of sheep being written off as unfit for human consumption due to the contamination.", 
   {}, 
   324402, 
   null, 
   1221986760.0
  ], 
  [
   324458, 
   null, 
   "CUNxTime", 
   "\"Within Living Memory\"? There are lots of things 'within living memory' such as the pre-vaccine polio era. But things have changed a lot since then. Likewise, the Nuclear power industry has made similar strides. Just because accidents happened at one point in time doesn't mean that we are forever doomed to that failure. The Germans were an enemy of western democracy 'within living memory' does that mean we can't count on them now as allies? GO NUCLEAR!!! Save the planet!", 
   {}, 
   324447, 
   null, 
   1222010160.0
  ], 
  [
   324611, 
   null, 
   "jyoshu", 
   "\"Within Living Memory\"? There are lots of things 'within living memory' such as the pre-vaccine polio era. But things have changed a lot since then. Likewise, the Nuclear power industry has made similar strides. Just because accidents happened at one point in time doesn't mean that we are forever doomed to that failure. The Germans were an enemy of western democracy 'within living memory' does that mean we can't count on them now as allies? GO NUCLEAR!!! Save the planet!\n\n \n I agree ... there was a time that using simple electricity wouldn't have been safe either. We have to get into the 21st century at some point.", 
   {}, 
   324458, 
   null, 
   1222102500.0
  ], 
  [
   324666, 
   null, 
   "Jo Bennett", 
   "I agree ... there was a time that using simple electricity wouldn't have been safe either. We have to get into the 21st century at some point.\n\n \n Some technologies we decide are not worth the effort and risks involved when there are better and cheaper alternatives available. I'm suggesting that this is one such situation (this is something that hasn't been brought up yet, wind power is far cheaper than nuclear per unit of electricity, even at this fairly early stage).", 
   {}, 
   324611, 
   null, 
   1222113660.0
  ], 
  [
   324698, 
   null, 
   "gansao", 
   "Some technologies we decide are not worth the effort and risks involved when there are better and cheaper alternatives available. I'm suggesting that this is one such situation (this is something that hasn't been brought up yet, wind power is far cheaper than nuclear per unit of electricity, even at this fairly early stage).\n\n \n I doubt this is true.", 
   {}, 
   324666, 
   null, 
   1222119360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Lawmakers vote to end 26-year ban on offshore drilling", 
  "url": "http://www.4forums.com/political/current-events-debates/11606-lawmakers-vote-end-26-year-ban-offshore-drilling.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 11606, 
  "discussion_files": [
   [
    "11494.html", 
    "http://www.4forums.com/political/current-events-debates/11606-lawmakers-vote-end-26-year-ban-offshore-drilling-print.html"
   ], 
   [
    "11495.html", 
    "http://www.4forums.com/political/current-events-debates/11606-lawmakers-vote-end-26-year-ban-offshore-drilling-2-print.html"
   ]
  ], 
  "identifier": 11606
 }
]