[
 [
  [
   323972, 
   null, 
   "Brady", 
   "\"Pro-Gun\" States Lead the Nation in Per Capita Firearm Death Rates \n Violence Policy Center Analysis of New Data Reveals: Louisiana, Alaska, Montana, Tennessee, and Alabama Top List of Deadliest States in the Nation \n \n Blind Allegiance to the Second Amendment Takes Deadly Toll \n \n Washington, DC&#8212;States in the South and West with weak gun laws and high rates of gun ownership lead the nation in overall firearm death rates according to a new analysis issued today by the Violence Policy Center (VPC) of Centers for Disease Control and Prevention (CDC) data. \n \n The new VPC analysis uses 2005 data (the most recent available) from the CDC's National Center for Injury Prevention and Control. The analysis reveals that the five states with the highest per capita gun death rates were Louisiana, Alaska, Montana, Tennessee and Alabama. Each of these states had a per capita gun death rate far exceeding the national per capita gun death rate of 10.32 per 100,000. \n \n By contrast, states with strong gun laws and low rates of gun ownership had far lower rates of firearm-related death. Ranking last in the nation for gun death was Hawaii, followed by Massachusetts, Rhode Island, New Jersey and New York. (See chart below for top and bottom five states. See http://www.vpc.org/fadeathchart.htm for a ranking of all 50 states.) \n http://vpc.org/press/0804gundeath.htm\n \n So how do the people who claim guns save lives explain this?", 
   {
    "post_info": {
     "post_title": "&quot;Pro-Gun&quot; States Lead the Nation in Per Capita Firearm Death Rates"
    }
   }, 
   null, 
   null, 
   1221662280.0
  ], 
  [
   323977, 
   null, 
   "Omegamon_X", 
   "So how do the people who claim guns save lives explain this?\n\n \n Simple. We've explained countless times that the Violence Policy Center is NOT A RELIABLE SOURCE TO CITE, but you keep doing it anyway and you're just proving your own foolishness in doing so.\n \n And another thing, why weren't states like Texas, Florida, Vermont, or any of the other states with concealed carry listed? Why wasn't Vermont among them, especially when they don't require you to get a permit before you carry a hidden and loaded firearm? Can you explain that?", 
   {}, 
   323972, 
   null, 
   1221663300.0
  ], 
  [
   323979, 
   null, 
   "Symbiote", 
   "If you want to see whether guns save lives, you need to look at their impact on total killing rates, not only their impact on gun-killing rates.\n \n The fact you choose to examine a misleading statistic indicates to me you are aware that you are wrong.", 
   {}, 
   323977, 
   null, 
   1221665400.0
  ], 
  [
   323992, 
   null, 
   "Brady", 
   "If you want to see whether guns save lives, you need to look at their impact on total killing rates, not only their impact on gun-killing rates.\n \n The fact you choose to examine a misleading statistic indicates to me you are aware that you are wrong.\n\n but they only effect gun killing rates just like traffic laws only effect car accidents and not other kinds of accidents", 
   {}, 
   323979, 
   null, 
   1221668280.0
  ], 
  [
   324096, 
   null, 
   "Omegamon_X", 
   "but they only effect gun killing rates just like traffic laws only effect car accidents and not other kinds of accidents\n\n \n That's not a good enough argument from you, Brady. You're held to a higher standard of scrutiny than anyone here because you continually site the VPC and the Brady Bunch. Hell, you're the guy who claimed that the Founding Fathers wanted extreme levels of gun control to be law and that's why they included \"well regulated\" in the Second Amendment.", 
   {}, 
   323992, 
   null, 
   1221750660.0
  ], 
  [
   324099, 
   null, 
   "chester", 
   "That's not a good enough argument from you, Brady. You're held to a higher standard of scrutiny than anyone here because you continually site the VPC and the Brady Bunch. Hell, you're the guy who claimed that the Founding Fathers wanted extreme levels of gun control to be law and that's why they included \"well regulated\" in the Second Amendment.\n\n \n Why not tell us then just why the Framers DID insert the phrase.\n \n You seem to know it all.", 
   {}, 
   324096, 
   null, 
   1221751200.0
  ], 
  [
   324116, 
   null, 
   "iangb", 
   "If you want to see whether guns save lives, you need to look at their impact on total killing rates, not only their impact on gun-killing rates.\n\n The point of this thread (as I see it, at least) is not that guns laws are saving lives but that gun laws are successfully reducing gun crime. Of course, if criminals just commit the crime without the gun then that is a problem, but it's been a long-standing position of the pro-gunners that gun laws will have no effect on criminal gun use, because 'criminals don't obey the law'. The 'saving lives' bit is another issue for another place, and I agree that it is the more important of the two.\n \n Of course, I'm still waiting for someone to actually rank states in order of 'gun law strength' so that a decent comparison can actually be statistically made. I might do it myself, if I get time, but that's looking unlikely for a while...", 
   {}, 
   324099, 
   null, 
   1221756480.0
  ], 
  [
   324125, 
   null, 
   "Flyboy_451", 
   "The Second Amendment is split by commas into four phrases, the last of which is a verbal phrase starting with the verb \"shall\":\n \n * \"A well regulated Militia,\n * being necessary to the security of a free state,\n * the right of the people to keep and bear Arms,\n * shall not be infringed.\" \n \n The first two phrases are related to each other. The fact that the third phrase is separated from the verbal phrase by a comma indicates that the verbal phrase has more than the third phrase as its subject. The abbreviated grammatical construction actually renders the meaning of the Second Amendment as: \"Neither a well regulated Militia, being necessary to the security of a free state, nor the right of the people to keep and bear Arms shall be infringed.\"\n \n The forum will not allow me to post a link because I have made less than ten posts... I will edit later to include link to site. It is a grammatical evaluation of the 2nd amendment by a law professor.\n \n \n JW", 
   {}, 
   324116, 
   null, 
   1221758340.0
  ], 
  [
   324303, 
   null, 
   "Ethmi", 
   "Why not tell us then just why the Framers DID insert the phrase.\n \n You seem to know it all.\n\n \n As if you know? Well-regulated means organized, not strictly controlled and monitored 24/7 and displayed on national TV every time a gun is used irresponsibly to make it look like they're a bunch of cold-hearted murderers.", 
   {}, 
   324099, 
   null, 
   1221869820.0
  ], 
  [
   324323, 
   null, 
   "grizzly6626", 
   "Mr. Brady, I would just like you to give me an honest answer to this question, do you and other freedom opposers like yourself, consider gun owners to be criminals just because we own gun's. If your answer is yes, why! If your answer is no, then leave us alone and start making the live's of criminal's a living hell for a change. Honest gun owners are not the problem, gun's are not even the problem, the problem is the bad people who wield gun's.", 
   {}, 
   324303, 
   null, 
   1221875820.0
  ], 
  [
   324464, 
   null, 
   "iangb", 
   "Grizzly: Again, you're making the false assumption that criminals will be affected by gun control. This patently is not the case.", 
   {}, 
   324323, 
   null, 
   1222011600.0
  ], 
  [
   324469, 
   null, 
   "Omegamon_X", 
   "Grizzly: Again, you're making the false assumption that criminals will be affected by gun control. This patently is not the case.\n\n \n All the more reason to not press for anymore gun control. Since you've stated it, you know that it won't have deterrence against criminal individuals.", 
   {}, 
   324464, 
   null, 
   1222013100.0
  ], 
  [
   324483, 
   null, 
   "iangb", 
   "Uh, no. Completely incorrect, sorry. Am I going to have to state it again?\n \n Prohibition of any item reduces availability of said item - both legal and illegal. The results of this are arguable, but the initial reduction is definite. As we've gone over countless times now.", 
   {}, 
   324469, 
   null, 
   1222020060.0
  ], 
  [
   324488, 
   null, 
   "Shooterandproud", 
   "\"Pro-Gun\" States Lead the Nation in Per Capita Firearm Death Rates \n Violence Policy Center Analysis of New Data Reveals: Louisiana, Alaska, Montana, Tennessee, and Alabama Top List of Deadliest States in the Nation \n \n Blind Allegiance to the Second Amendment Takes Deadly Toll \n \n Washington, DC&#8212;States in the South and West with weak gun laws and high rates of gun ownership lead the nation in overall firearm death rates according to a new analysis issued today by the Violence Policy Center (VPC) of Centers for Disease Control and Prevention (CDC) data. \n \n The new VPC analysis uses 2005 data (the most recent available) from the CDC's National Center for Injury Prevention and Control. The analysis reveals that the five states with the highest per capita gun death rates were Louisiana, Alaska, Montana, Tennessee and Alabama. Each of these states had a per capita gun death rate far exceeding the national per capita gun death rate of 10.32 per 100,000. \n \n By contrast, states with strong gun laws and low rates of gun ownership had far lower rates of firearm-related death. Ranking last in the nation for gun death was Hawaii, followed by Massachusetts, Rhode Island, New Jersey and New York. (See chart below for top and bottom five states. See http://www.vpc.org/fadeathchart.htm for a ranking of all 50 states.) \n http://vpc.org/press/0804gundeath.htm\n \n So how do the people who claim guns save lives explain this?\n\n \n Really, so California is just a peachy crime free place because of its strict firearms laws? What about New York? But wait! Don't forget good ol Washington DC! Their crime rate is lower than Bush's approval rating because of their strict firearm laws!\n \n Of course they are going to have a higher rate of firearms death, but they're obviously going to have a lower rate of everything else (criminal related) death. In the end, Its lower.", 
   {}, 
   323972, 
   null, 
   1222021500.0
  ], 
  [
   324489, 
   null, 
   "Shooterandproud", 
   "Uh, no. Completely incorrect, sorry. Am I going to have to state it again?\n \n Prohibition of any item reduces availability of said item - both legal and illegal. The results of this are arguable, but the initial reduction is definite. As we've gone over countless times now.\n\n \n The argument though, is whether it is a good idea for that item to be less available. The prohibition reduced the availability of alchohol, however it didn't work out quite well in the end. Same with the war on drugs.", 
   {}, 
   324483, 
   null, 
   1222022100.0
  ], 
  [
   324490, 
   null, 
   "Omegamon_X", 
   "Prohibition of any item reduces availability of said item - both legal and illegal. The results of this are arguable, but the initial reduction is definite. As we've gone over countless times now.\n\n \n Reduced availability and access has never diminished the incidents of a crime being committed. We've still got people getting rich off the drug trade despite the total prohibition on crack cocaine. And obviously the total prohibition on child pornography isn't working, because you keep hearing about people getting arrested on possession or yet another ring being broken up.", 
   {}, 
   324483, 
   null, 
   1222022100.0
  ], 
  [
   324492, 
   null, 
   "iangb", 
   "Reduced availability and access has never diminished the incidents of a crime being committed. We've still got people getting rich off the drug trade despite the total prohibition on crack cocaine. And obviously the total prohibition on child pornography isn't working, because you keep hearing about people getting arrested on possession or yet another ring being broken up.\n\n ...and the countless responses continue. To restate again, I have never claimed that a black market for guns would be completely wiped out by gun control. But making child porn illegal has diminished it, and a simple comparison between alcohol, nicotine and the 'illegal drugs' shows that prohibition of them has reduced availability of them.\n \n At this point, you traditionally go back to the 'but it's a right!' argument, or the 'but criminals won't obey the law' argument, thus completing the circle. Care to try for something new? \n \n \nThe argument though, is whether it is a good idea for that item to be less available. The prohibition reduced the availability of alchohol, however it didn't work out quite well in the end. Same with the war on drugs. \n\n Indeed, as I said. I don't think many people have gone into this argument yet however - DC has shown that it doesn't work in a single (city) state, and my study from elsewhere showed that it does work if rigorously enforced - we kinda stagnated after that.", 
   {}, 
   324490, 
   null, 
   1222023840.0
  ], 
  [
   324497, 
   null, 
   "Omegamon_X", 
   "At this point, you traditionally go back to the 'but it's a right!' argument, or the 'but criminals won't obey the law' argument, thus completing the circle. Care to try for something new?\n\n \n Well if you wanna try a new argument I'm up for that. In all cases of something being prohibited from ownership, there's been no conclusive evidence to support the belief that criminals face any difficulties in obtaining what they want, regardless of it's legal status. So if the purpose of outlawing something is to try and keep it away from criminals, then it's a plan doomed to failure even before it's implementation.\n \n \nIndeed, as I said. I don't think many people have gone into this argument yet however - DC has shown that it doesn't work in a single (city) state, and my study from elsewhere showed that it does work if rigorously enforced - we kinda stagnated after that.\n\n \n For all practical purposes DC was an island that was essentially cut off from the rest of America, and their laws were and still are vigorously enforced, without any success.", 
   {}, 
   324492, 
   null, 
   1222026840.0
  ], 
  [
   324516, 
   null, 
   "grizzly6626", 
   "Can someone please tell me how anything I have posted has stated that gun-control affects criminals, because I dont recall ever posting anything to that effect. I simply wanted a yes or no answer to the question presented to the anti-gun people. That question again was, do you believe gun owners are criminals just because we own guns, if yes, then why. Nothing in this post states nor implies that, somehow I believe that gun control has any kind of effect on criminals.", 
   {}, 
   324497, 
   null, 
   1222031580.0
  ], 
  [
   324521, 
   null, 
   "Ethmi", 
   "...and the countless responses continue. To restate again, I have never claimed that a black market for guns would be completely wiped out by gun control. But making child porn illegal has diminished it, and a simple comparison between alcohol, nicotine and the 'illegal drugs' shows that prohibition of them has reduced availability of them.\n\n \n Child porn hasn't been a primary tool by criminals. Though it is interesting that Italy has a low rate of alcoholism; even though alcohol can be purchased by anyone there.\n \n \nAt this point, you traditionally go back to the 'but it's a right!' argument, or the 'but criminals won't obey the law' argument, thus completing the circle. Care to try for something new? \n\n \n Yeah... how's this? All anti-gun sources that I've seen have never ceased to be amazed by the tip of the iceberg.\n \n \n]Indeed, as I said. I don't think many people have gone into this argument yet however - DC has shown that it doesn't work in a single (city) state, and my study from elsewhere showed that it does work if rigorously enforced - we kinda stagnated after that.\n\n \n How would you go about enforcing such laws?", 
   {}, 
   324492, 
   null, 
   1222032900.0
  ], 
  [
   324784, 
   null, 
   "grizzly6626", 
   "We are never going to get the anti-gun crowd to admit to the truth. Either the truth hurts them or they lack the inteligence to see things as they really are, I personally think that they are all still trying to figure out why the square peg wont fit in the round hole. We have heard every excuse on earth from the anti-gun crowd, and none of those excuses holds water. None of them truly debate, because to truly debate, you must reside yourself to the idea that whom ever you debate against might be right. We provide them with facts from reliable, un-biased sources, and they provide us with facts from biased sources such as the Brady Campaigne for the prevention of gun violence, like gun owners are to stupid to realize that anti-gun people get their facts from anti-gun sources, who gather information with anti-gun reaserchers. Seems to me anti-gun groups pick and choose the information they provide us with. As I said, they dont debate, they argue, and argueing with anti-gun people is like wrestling a pig in the mud, after a while you figure out the pig enjoys it. Anti-gun folks are not American in my opinion, if they were they would never give up any of their rights, rights that others have fought and died for, so we could all be free. God bless the soldiers, the Patriots, and Gun owners. I guess while the anti-gun folks are still working on that square peg- round hole problem that torments them so, us gun owners will continue the fight for freedom here in America. By the way, I just thought yall might want to know that Barack Obama has teamed up with the Brady Camp, they are trying to figure out how to get two square pegs to fit into the one round hole at the same time, but so far the solution elludes them. Obama thinks he has the solution though, he said he wants to enter into direct negotiations with the round hole and square pegs.:xbanghead", 
   {}, 
   324521, 
   null, 
   1222151220.0
  ], 
  [
   324806, 
   null, 
   "Brady", 
   "We are never going to get the anti-gun crowd to admit to the truth. Either the truth hurts them or they lack the inteligence to see things as they really are, I personally think that they are all still trying to figure out why the square peg wont fit in the round hole. We have heard every excuse on earth from the anti-gun crowd, and none of those excuses holds water. None of them truly debate, because to truly debate, you must reside yourself to the idea that whom ever you debate against might be right. We provide them with facts from reliable, un-biased sources, and they provide us with facts from biased sources such as the Brady Campaigne for the prevention of gun violence, like gun owners are to stupid to realize that anti-gun people get their facts from anti-gun sources, who gather information with anti-gun reaserchers. Seems to me anti-gun groups pick and choose the information they provide us with.\n\n progun people get their factoids from pro-gun sources who gather information from progun researchers. Seems to me progun people pick and choose the information they provide us with. \n \n \n\n Anti-gun folks are not American in my opinion, if they were they would never give up any of their rights, rights that others have fought and died for, so we could all be free.\n\n But progunners dont want to be responsible for their rights. Progunners would rather watch the streets run with the blood of innocent Americans including children than give up a little bit of convenience to follow some gun law that could save the life of a child so progunners are the real traitors to their country and dont deserve to be Americans.", 
   {}, 
   324784, 
   null, 
   1222173420.0
  ], 
  [
   324808, 
   null, 
   "Brady", 
   "Really, so California is just a peachy crime free place because of its strict firearms laws? What about New York? But wait! Don't forget good ol Washington DC! Their crime rate is lower than Bush's approval rating because of their strict firearm laws!\n \n Of course they are going to have a higher rate of firearms death, but they're obviously going to have a lower rate of everything else (criminal related) death. In the end, Its lower.\n\n You obviously dont know what your talking about. Ever since Florida became the first state to allow people to carry guns around Florida has been number 1 or 2 in violent crime each year according to the FBI!", 
   {}, 
   324488, 
   null, 
   1222174140.0
  ], 
  [
   324815, 
   null, 
   "Omegamon_X", 
   "progun people get their factoids from pro-gun sources who gather information from progun researchers. Seems to me progun people pick and choose the information they provide us with.\n\n \n Gun owners don't deceive others and use fear mongering to scare them into compliance. You people, on the other hand, have use terrorism tactics for years to get people to side with you.\n \n \nBut progunners dont want to be responsible for their rights.\n\n \n Prove it.\n \n \nProgunners would rather watch the streets run with the blood of innocent Americans including children\n\n \n By \"innocent Americans including children\" do you mean \"known criminals and gang members\"?\n \n \nthan give up a little bit of convenience to follow some gun law that could save the life of a child so progunners are the real traitors to their country and dont deserve to be Americans.\n\n \n Oh really? The \"Assault Weapons Ban\" of 1994 didn't save the lives of the children killed at Columbine. The \"Gun Free School Zones Act\" of 1990 didn't save the lives of the 32 killed at Virginia Tech. So tell me Brady, exactly what gun control laws HAVE saved lives. Point out to me one single shooting that didn't take place because it was stopped by gun control laws.", 
   {}, 
   324806, 
   null, 
   1222180140.0
  ], 
  [
   324816, 
   null, 
   "Omegamon_X", 
   "You obviously dont know what your talking about. Ever since Florida became the first state to allow people to carry guns around Florida has been number 1 or 2 in violent crime each year according to the FBI!\n\n \n If this is true (and I stress the word IF) then how come the North Hollywood Shootout occurred in California rather than Florida? If Florida is so dangerous and deadly that you can be murdered in cold blood for the slightest little provocation, then how come these two armed and armored bandits were able to commit numerous crimes in California?\n \n Furthermore, if California is so much safer than Florida, how come the two responsible for the North Hollywood Shootout, who were arrested previously on felony charges of possessing prohibited weapons and explosive devices, only served three months in jail and even managed to petition the courts to return their illegal weapons?", 
   {}, 
   324808, 
   null, 
   1222180440.0
  ], 
  [
   324914, 
   null, 
   "Ethmi", 
   "progun people get their factoids from pro-gun sources who gather information from progun researchers. Seems to me progun people pick and choose the information they provide us with. \n\n \n Brady... there is no way that you said that. There is no way in hell that someone who exclusively cites the Brady Campaign and VPC as his \"sources\" could work up the audacity to say this. I must be hallucinating; oh, wait, no... no... Oh my God... OH MY GOD! YOU REALLY SAID THAT, DIDN'T YOU?! Don't you know anything at all about your sources? You know nothing at all about them do you? The Brady Campaigns primary goal, in case you haven't noticed, is to wipe gun ownership of the face of the US; which is not only next to, but hugging and making out with impossible, and the VPC aren't much better. You have just proved to me that you don't listen with your ears; rather that thing below your nose and above your chin.\n \n \nbut progunners dont want to be responsible for their rights.\n\n \n This is pretty indefensible; your classic Brady judgement clouding emotion and preposterous logic won't save you this time (or should I say \"as usual\"?)\n \n \nProgunners would rather watch the streets run with the blood of innocent Americans including children than give up a little bit of convenience to follow some gun law that could save the life of a child so progunners are the real traitors to their country and dont deserve to be Americans.\n\n \n Once again, you refuse to post facts; only your Brady emotion that clouds knowledge. Guns are used in self-defence about 2/3 of the time, and your Brady emotion won't do anything against that. Therefore, most of your \"innocent people\" means home invaders, muggers, rapists, etc. Also, 91.7% of the time, nobody is shot by a gun used in self-defence.\n \n So, Brady, here's the difference between us and you; we use facts to debate, which gets us far. You use emotion and propaganda, which renders you a Shadow weight on here.\n \n Oooh! Palpatine takes interest in you, Brady! Let's see what he has to say!\n \n Palpatine: Good, good! Feel the hatred flowing through you, Brady! *cackle* Use the dark side to strike down your enemy; oh wait, you don't have a lightsaber, just propaganda. Never mind, then. I'll find someone else, I guess...\n \n ----------------------------------------------------------------------------------------------------------------------------------\n \n Ummm, thanks, I guess. But you see my point (I hope).", 
   {}, 
   324806, 
   null, 
   1222210500.0
  ], 
  [
   324935, 
   null, 
   "Ethmi", 
   "Brady, do you have a personal grudge against gun owners?", 
   {
    "post_info": {
     "post_title": "A Question for Brady"
    }
   }, 
   324914, 
   null, 
   1222226520.0
  ], 
  [
   324958, 
   null, 
   "grizzly6626", 
   "Now yall play nice with Brady, he has had a rough day, you know, trying to get the square peg to go in the round hole, trying to figure out why adding two and two togeather wont come out to equal five. Hey Brady, last time I checked, the FBI, the CDC, and other organizations like these were neither pro-gun nor anti-gun, so how did you come to the opinion that any of these orginizations could be construed as pro-gun. Hey Brady, I have discovered something that you just aint going to believe, I live with my family just outside of Ft. Worth Tx. For the last four months I have kept all my guns loaded, and one of them right by my bed, do you know that not one of those guns has ever grown legs or a mind of its own, and none of them have gone around the house or the neighborhood shooting people, and the one beside my bed has never even made an attempt to attack me, even when I was asleep, maybe it figured I was always watching it so it behaved itself. I have carried the same gun in my truck nearly everywhere I go, and would you believe that that gun has never got out of the truck and walked into a school or a bar or anywhere else and started shooting people. Do you think my guns might be on drugs or something, maybe they are depressed, because they never move, they just sit there motionless. One time I got into a car accident and that gun just sat in the truck, I guess maybe it just didnt want to get involved. Well I will let you get back to your peg and math dillima, get back to me when you get some more of those solid reliable facts you keep coming up with all the time, there so entertaining, and remember what confuscious says- It is better to let people think you are ignorant than to open your mouth and remove all doubt, chow.", 
   {}, 
   324935, 
   null, 
   1222243980.0
  ], 
  [
   324961, 
   null, 
   "Brady", 
   "Now yall play nice with Brady, he has had a rough day, you know, trying to get the square peg to go in the round hole, trying to figure out why adding two and two togeather wont come out to equal five. Hey Brady, last time I checked, the FBI, the CDC, and other organizations like these were neither pro-gun nor anti-gun, so how did you come to the opinion that any of these orginizations could be construed as pro-gun. Hey Brady, I have discovered something that you just aint going to believe, I live with my family just outside of Ft. Worth Tx. For the last four months I have kept all my guns loaded, and one of them right by my bed, do you know that not one of those guns has ever grown legs or a mind of its own, and none of them have gone around the house or the neighborhood shooting people, and the one beside my bed has never even made an attempt to attack me, even when I was asleep, maybe it figured I was always watching it so it behaved itself. I have carried the same gun in my truck nearly everywhere I go, and would you believe that that gun has never got out of the truck and walked into a school or a bar or anywhere else and started shooting people. Do you think my guns might be on drugs or something, maybe they are depressed, because they never move, they just sit there motionless. One time I got into a car accident and that gun just sat in the truck, I guess maybe it just didnt want to get involved. Well I will let you get back to your peg and math dillima, get back to me when you get some more of those solid reliable facts you keep coming up with all the time, there so entertaining, and remember what confuscious says- It is better to let people think you are ignorant than to open your mouth and remove all doubt, chow.\n\n I didnt say that guns grow legs and walk around but you pretend I did because you cant shoot down my real argument.Pretty sad when you have to stoop to that level but people on your side do it all the time.", 
   {}, 
   324958, 
   null, 
   1222259460.0
  ], 
  [
   324962, 
   null, 
   "Brady", 
   "Brady... there is no way that you said that. There is no way in hell that someone who exclusively cites the Brady Campaign and VPC as his \"sources\" could work up the audacity to say this.\n\n that just shows how biased you are because you only get all hot and bothered about me using those sources but not about progun people using progun sources", 
   {}, 
   324914, 
   null, 
   1222259940.0
  ], 
  [
   324981, 
   null, 
   "Omegamon_X", 
   "I didnt say that guns grow legs and walk around but you pretend I did because you cant shoot down my real argument.\n\n \n You can't shoot down what isn't there...", 
   {}, 
   324961, 
   null, 
   1222267800.0
  ], 
  [
   324982, 
   null, 
   "Omegamon_X", 
   "that just shows how biased you are because you only get all hot and bothered about me using those sources but not about progun people using progun sources\n\n \n At least we don't have the need to lie with every single post we make. You on the other hand, can't seem to use a word of truth to make an argument.", 
   {}, 
   324962, 
   null, 
   1222267920.0
  ], 
  [
   325019, 
   null, 
   "grizzly6626", 
   "Brady, if you notice I never state facts, because facts on either side are gathered by people who can influence those facts to say whatever they want them to say. But I have more faith in reports from the FBI,CIA, and the CDC. All my posts come from either personal experience or common sense. The way you make gun ownership sound, its like you believe that the gun itself is responsible for gun violence. A gun is an inanimate object, incapable of acting on its own. And therefore you target all gun owners, good and bad ones alike. Gun control is just that, gun control. It does not make a distinction between good and bad. You only look at the bad when you state your side of this issue, you never say anything in support of those who are not breaking any laws. You never say anything like yesterday 100 people used a gun to break the law,but a thousand people who own guns obeyed the law. If you want to get more support in your efforts to prevent gun violence in America, quit targeting lawfull gun owners and start going after the bad guys, pass laws that distinguish the difference between good people and bad people. When you do this, most gun owners would support you. But as long as you target lawfull gun owners, you will never get any support from us on this issue.", 
   {}, 
   324982, 
   null, 
   1222277760.0
  ], 
  [
   325080, 
   null, 
   "Ethmi", 
   "that just shows how biased you are because you only get all hot and bothered about me using those sources but not about progun people using progun sources\n\n \n Yea... I was just pointing out the facts. And you aren't bothered? You aren't bothered by your own exclusive use of the VPC and Brady Campaign as sources? I was just telling you not to call the kettle black. \n \n Also, would you say that any source at all that doesn't support you is biased?\n \n With the acting you pull on here, you'd make it to Hollywood. But being an actor won't get you any cred unless you've got some facts.", 
   {}, 
   324962, 
   null, 
   1222293720.0
  ], 
  [
   325081, 
   null, 
   "Ethmi", 
   "I didnt say that guns grow legs and walk around but you pretend I did because you cant shoot down my real argument.Pretty sad when you have to stoop to that level but people on your side do it all the time.\n\n \n You prove to me more and more that you have a personal grudge against gun owners; you stoop to the emotional strawman level exclusively. Who are you to talk?", 
   {}, 
   324961, 
   null, 
   1222293900.0
  ], 
  [
   325237, 
   null, 
   "Ethmi", 
   "Brady, I'm getting bored now, so I'll just refute you and get this over with.\n \n \n North Dakota seems to be a state of lax laws, and it's number 51 on my list. \n \n Vermont is pretty loose, and it's number 49. \n \n DC was numero uno on the list, because not one single person was permitted to own a firearm until Heller vs. DC.\n \n Your retort?", 
   {
    "post_info": {
     "post_title": "Refutation of Brady's Point"
    }
   }, 
   325081, 
   null, 
   1222398720.0
  ], 
  [
   325243, 
   null, 
   "shatnerpossum", 
   "I'm not buying this claim. Last time I checked DC had a higher crime rate than South Dakota.", 
   {}, 
   324981, 
   null, 
   1222402860.0
  ], 
  [
   326358, 
   null, 
   "grizzly6626", 
   "You obviously dont know what your talking about. Ever since Florida became the first state to allow people to carry guns around Florida has been number 1 or 2 in violent crime each year according to the FBI!\n\n \n Brady, you are a genius, I have never seen anybody make #### up on the fly as well as you, you are just a natural. I saw the FBI report and it sure didnt say what your saying it said. Please, in the future dont treat us as if we were born late last night, all nieve and ignorant.", 
   {}, 
   324808, 
   null, 
   1223179020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  \"Pro-Gun\" States Lead the Nation in Per Capita Firearm Death Rates", 
  "url": "http://www.4forums.com/political/gun-control-debates/11607-pro-gun-states-lead-nation-per-capita-firearm-death-rates.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11607, 
  "discussion_files": [
   [
    "16847.html", 
    "http://www.4forums.com/political/gun-control-debates/11607-pro-gun-states-lead-nation-per-capita-firearm-death-rates-print.html"
   ], 
   [
    "16848.html", 
    "http://www.4forums.com/political/gun-control-debates/11607-pro-gun-states-lead-nation-per-capita-firearm-death-rates-3-print.html"
   ], 
   [
    "16849.html", 
    "http://www.4forums.com/political/gun-control-debates/11607-pro-gun-states-lead-nation-per-capita-firearm-death-rates-2-print.html"
   ]
  ], 
  "identifier": 11607
 }
]