[
 [
  [
   324945, 
   null, 
   "Archangel", 
   "The best examples of Obama's lies come straight from him in living color.\n \n http://www.youtube.com/watch?v=H64yKJhB528\n \n What this video proves is that Obama had such an awareness of what the bad Reverend Wright represented for that 20 years he was a member of his church, that when confronted with the release of the videos, he felt comelled to lie about being aware of his beliefs rather than admit what he truly has supported for so long by calling that man his religious mentor in his biography.\n \n Unfortunately for barry though, he can't keep his lies straight so he gave two different and opposing accounts of his story and what he knew and didn't know about Wright's beliefs.", 
   {
    "post_info": {
     "post_title": "And Speaking of Obama's LIES..."
    }
   }, 
   null, 
   null, 
   1222231380.0
  ], 
  [
   324946, 
   null, 
   "Archangel", 
   "And by the drive by media no less. \n \n http://www.youtube.com/watch?v=EY5CQnOn75c", 
   {
    "post_info": {
     "post_title": "Here, he lies about NAFTA, and he gets caught big time!"
    }
   }, 
   324945, 
   null, 
   1222231680.0
  ], 
  [
   324947, 
   null, 
   "Archangel", 
   "And here from Factcheck.org is the rundown on how Obama so expertly can manipulate the truth so that he can even claim that he isn't taking money from certain groups as he does exactly that. He is a true politician as he has become so proficient in his ability to lie and deceive those who's support he seeks.\n \n http://www.youtube.com/watch?v=NgEHcDj2oPo", 
   {}, 
   324946, 
   null, 
   1222232160.0
  ], 
  [
   324949, 
   null, 
   "Archangel", 
   "This represents more lies from the Democratic machine that specializes in the politics of personal destruction. Even if they, the pro feminist party must attempt to destroy a woman.\n \n http://www.factcheck.org/elections-2008/sliming_palin.html", 
   {
    "post_info": {
     "post_title": "And speaking of smearing Sarah Palin!"
    }
   }, 
   324947, 
   null, 
   1222232580.0
  ], 
  [
   324996, 
   null, 
   "Archangel", 
   "If Obama is proud of his relationship with people like bill Ayers, why cover up details of their relationship? Here's a LINK and excerpt to the full story.\n Chicago Annenberg Challenge Shutdown?\n A cover-up in the making?\n \n By Stanley Kurtz\n \n The problem of Barack Obama's relationship with Bill Ayers will not go away. Ayers and his wife, Bernardine Dohrn were terrorists for the notorious Weather Underground during the turbulent 1960s, turning fugitive when a bomb - designed to kill army officers in New Jersey - accidentally exploded in a New York townhouse. Prior to that, Ayers and his cohorts succeeded in bombing the Pentagon. Ayers and Dohrn remain unrepentant for their terrorist past. Ayers was pictured in a 2001 article for Chicago magazine, stomping on an American flag, and told the New York Times just before 9/11 that the notion of the United States as a just and fair and decent place \"makes me want to puke.\" Although Obama actually launched his political career at an event at Ayers's and Dohrn's home, Obama has dismissed Ayers as just \"a guy who lives in my neighborhood,\" and \"not somebody who I exchange ideas from on a regular basis.\" For his part, Ayers refuses to discuss his relationship with Obama.\n \n Although the press has been notably lax about pursuing the matter, the full story of the Obama-Ayers relationship calls the truth of Obama's account seriously into question. When Obama made his first run for political office, articles in both the Chicago Defender and the Hyde Park Herald featured among his qualifications his position as chairman of the board of the Chicago Annenberg Challenge, a foundation where Ayers was a founder and guiding force. Obama assumed the Annenberg board chairmanship only months before his first run for office, and almost certainly received the job at the behest of Bill Ayers. During Obama's time as Annenberg board chairman, Ayers's own education projects received substantial funding. Indeed, during its first year, the Chicago Annenberg Challenge struggled with significant concerns about possible conflicts of interest. With a writ to aid Chicago's public schools, the Annenberg challenge played a deeply political role in Chicago's education wars, and as Annenberg board chairman, Obama clearly aligned himself with Ayers's radical views on education issues. With Obama heading up the board and Ayers heading up the other key operating body of the Annenberg Challenge, the two would necessarily have had a close working relationship for years (therefore \"exchanging ideas on a regular basis\"). So when Ayers and Dorhn hosted that kickoff for the first Obama campaign, it was not a random happenstance, but merely further evidence of a close and ongoing political partnership. Of course, all of this clearly contradicts Obama's dismissal of the significance of his relationship with Ayers.\n \n This much we know from the public record, but a large cache of documents housed in the Richard J. Daley Library at the University of Illinois at Chicago (UIC), is likely to flesh out the story. That document cache contains the internal files of the Chicago Annenberg Challenge. The records in question are extensive, consisting of 132 boxes, containing 947 file folders, a total of about 70 linear feet of material. Not only would these files illuminate the working relationship between Obama and Bill Ayers, they would also provide significant insight into a web of ties linking Obama to various radical organizations, including Obama-approved foundation gifts to political allies. Obama's leadership style and abilities are also sure to be illuminated by the documents in question.\n \n COVER-UP?\n Unfortunately, I don't yet have access to the documents. The Special Collections section of the Richard J. Daley Library agreed to let me read them, but just before I boarded my flight to Chicago, the top library officials mysteriously intervened to bar access. Circumstances strongly suggest the likelihood that Bill Ayers himself may have played a pivotal role in this denial. Ayers has long taught at UIC, where the Chicago Annenberg Challenge offices were housed, rent-free. Ayers likely arranged for the files of the Chicago Annenberg Challenge to be housed in the UIC library, and may well have been consulted during my unsuccessful struggle to gain access to the documents. Let me, then, explain in greater detail what the Chicago Annenberg Challenge (CAC) records are, and how I have been blocked from seeing them.\n \n Initially, as I said, library officials said that I could examine the CAC records. I received this permission both over the phone and in writing. The subsequent denial of access came with a series of evolving explanations. Is this a politically motivated cover-up? Although at this stage it is impossible to know, it is hard to avoid the suspicion. I also have some concerns for the security of the documents, although I have no specific evidence that their security is endangered. In any case, given the relative dearth of information about Barack Obama's political past, there is a powerful public interest in the swift release of these documents.\n \n ACCESS APPROVED\n When I learned that the CAC records were housed at UIC Library, I phoned and was assured by a reference librarian that, although I have no UIC affiliation, I would be permitted to examine the records. He suggested I phone the Special Collections section of the library and set up an appointment with a special collections librarian. This reference librarian also ran a search for me and discovered that, in addition to the CAC records, one file folder in the UIC Chancellor's Office of Community Relations archive contains information on CAC from 1995.\n \n I then spoke with a special-collections librarian and was again assured that I would have access to the CAC records. I was told that, while I could not personally make copies of the material, I could identify documents of interest and have copies made by the library, for a fee. I set up an appointment to meet with the special-collections librarian, and she suggested that I e-mail her the information on the CAC-related chancellor's documents the reference librarian had discovered, and confirm my appointment time. After I did so, this special-collections librarian forwarded my message to a graduate assistant.\n \n The graduate assistant then e-mailed to let me know that, while the CAC collection had been \"processed,\" the \"finding aid\" had not yet been put online. (The \"finding aid\" is a detailed document of over 60 pages specifying the topics covered by each of the 947 folders in the collection, and showing which boxes hold which folders.) Because the finding aid was not yet online, the graduate assistant attached a copy to her e-mail, inviting me to browse it and identify documents of particular interest, so that the library could have some of the CAC material out and ready for me immediately upon my arrival. I wrote back indicating that I would like to see the single CAC-related folder from the chancellor's archive, and further identifying 14 boxes from the main body of CAC records containing folders of special interest. Having received clear and repeated representations from the UIC library staff that I would be granted access to the CAC records, I arranged a trip to Chicago.\n \n ACCESS DENIED\n What follows is more detail than some readers may want to know, but it seems important to get it on record. If a body of material potentially damaging to Barack Obama is being improperly embargoed by a library, the details matter.\n \n \n Just before my plane took off, I received an e-mail from the special-collections librarian informing me that she had \"checked our collection file\" and determined that \"access to the collection is closed.\" I would be permitted to view the single CAC-related file from the Office of the Chancellor records, but nothing from the CAC records proper. I quickly wrote back, expressing surprise and disappointment. I noted that I had arranged my trip based on the library's assurances of access, and followed up with questions about whether access was being denied because I was unaffiliated with UIC. I also asked who had authority over access to the collection, suggesting that I might be able to contact them and request permission to view it.\n \n After arriving in Chicago, I found a message, not from the special-collections librarian, but from Ann C. Weller, professor and head, Special Collections Department. In answer to my question of who had authority over access to the collection, Weller said, that \"the decision was made by me\" in consultation with the library director. Weller stated that no one currently has access to the collection and added that: \"The Collection is closed because it has come to our attention that there is restricted material in the collection. Once the collection has been processed it will be open to any patron interested in viewing it.\"\n \n I responded to Weller by recounting the clear and repeated representations I had received from library staff that I would be granted access to the collection, adding that I had arranged my trip in large part because of these assurances. I then noted that I had studied the CAC finding aid with considerable care. It was clear from that finding aid, I said, that only five out of the 947 folders were in any way restricted. Four folders, containing auditor's reports, where clearly marked, in bold type, \"THESE FOLDERS ARE RESTRICTED VIA ANNENBERG CHALLENGE until further notice.\" A fifth folder, containing records of eight CAC Board of Directors meetings in 1995, when CAC was first set up, had a notation nearby with the word, \"Consent.\" It would be a simple matter, I said, to pull these five folders, allow me access to the remaining 942 folders, and contact the relevant authority for consent to view the records of the 1995 board meetings. After all, I added, Weller herself had said that, other than the restricted folders, the collection ought to be open to all patrons. \n \n I also pointed out to Weller that she had not quite entirely answered my earlier question about who has authority over access to the collection. So I asked who, precisely, holds the authority to bar or permit access to the restricted folders. I added the following thought: \"Libraries, of course, exist, not to restrict information, but to make it available to the public. I would hate to think that UIC library was doing anything less than all it could to permit public access to these important materials.\"\n \n Weller replied to this message by dropping the restricted documents issue and saying instead that the donor of the CAC records \"has alerted us to the fact that we do not have a signed deed of gift.\" According to Weller, this means that UIC's library has no legal right to make the material available. The donor, said Weller, is now working with UIC library to resolve the problem, and \"we hope to be able to provide access within the next few weeks.\"\n \n Replying to Weller, I briefly noted some elements of her account that I found puzzling. I added that Weller had still not answered my question about who the donor is, and/or who holds controlling authority over the collection. I closed by alerting the library to my intention to come in that day to examine the single CAC-related folder from the chancellor's records that I did have permission to see. Later that day, I examined that one folder, took notes, and asked for the entire folder's contents to be copied and mailed to me. I have received no further reply to my reiterated question about the identity of the donor.\n ", 
   {
    "post_info": {
     "post_title": "Stanley Kurthz exposes a coverup:"
    }, 
    "unicode_changes_made": true
   }, 
   324949, 
   null, 
   1222270680.0
  ], 
  [
   325104, 
   null, 
   "isly ilwott", 
   "I suppose it's difficult for the Obama supporters to rebut something that is on a video of their saviour...in his own words. The silence is deafening.\n \n I note too that there are some links to similar videos that include John Kerry's admitting that Obama is a liar and a fraud.\n \n It's strange how these people change from hating a fellow Democrat during the primaries to praising his XXX after he's chosen to represent them.\n \n When a car salesman works for Ford, Chevys are no good. When he switches to GM, Chevys are better than anything else. Politicians work under the same sense of falsely touted values.\n \n Obama is a liar. Obama is a Marxist. Obama is not worth two dead flies. Yet the sheeple will vote for his socialism and unscrupulous plan because it represents 'change' while things are going badly. His faithful followers are evidently unaware that his form of change will be good for a while and catastrophic in the long run, but that is no matter for serious concern to them. They are concerned only with what they can get out of the government.", 
   {}, 
   324996, 
   null, 
   1222297860.0
  ], 
  [
   325149, 
   null, 
   "chester", 
   "Now that McSame is doing his best to duck out of his scheduled debate, I suggest that a reward be given for his sighting.\n \n Oh, since McSame declared on 60 minutes that Palin is \"absolutely\" prepared to be President, maybe she can stand in for him this Friday - that is if she can locate Mississippi. After all, it doesn't border Russia.", 
   {}, 
   325104, 
   null, 
   1222313580.0
  ], 
  [
   325267, 
   null, 
   "isly ilwott", 
   "Now that McSame is doing his best to duck out of his scheduled ddbate, I suggest that a reward be given for his sighting.\n \n Oh, since McSame declared on 60 minutes that Palin is \"absolutely\" prepared to be President, maybe she can stand in for him this Friday - that is if she can locate Mississippi. After all, it doesn't border Russia.\nI see you can't stick to the topic. Defend your saviour, Obama...if you can. Show us all that he didn't really lie.\n \n McCain will likely not duck the debate. McCain has already challenged Obama to a series of town hall discussions but the inexperienced one declined. He'd (Obama that is) rather opt for the favoritism afforded him by the moderators of today's biased venues. When the questions come from the real world, Obama shakes in his boots.\n \n BTW, Palin would likely tear Obama a new arsehole at a well run debate.", 
   {}, 
   325149, 
   null, 
   1222441920.0
  ], 
  [
   325268, 
   null, 
   "Archangel", 
   "I see you can't stick to the topic. Defend your saviour, Obama...if you can. Show us all that he didn't really lie.\n \n McCain will likely not duck the debate. McCain has already challenged Obama to a series of town hall discussions but the inexperienced one declined. He'd (Obama that is) rather opt for the favoritism afforded him by the moderators of today's biased venues. When the questions come from the real world, Obama shakes in his boots.\n \n BTW, Palin would likely tear Obama a new arsehole at a well run debate.\n\n \n Well said, and so true. emoticon_xgood", 
   {}, 
   325267, 
   null, 
   1222442460.0
  ], 
  [
   325297, 
   null, 
   "T.Q", 
   "You two are delusional. Have you been reading any papers, or any political analysis other than on Fox News?", 
   {}, 
   325268, 
   null, 
   1222451580.0
  ], 
  [
   325305, 
   null, 
   "isly ilwott", 
   "You two are delusional. Have you been reading any papers, or any political analysis other than on Fox News?\nI read few papers. The internet works a lot faster and I don't generate any trash to throw away.\n \n Rumor has it that McCain is already in Mississippi, waiting to debate the inexperienced one.\n \n Can you defend the lies told by Obama in the OP or are you just gonna stand there and whistle Dixie?", 
   {}, 
   325297, 
   null, 
   1222457700.0
  ], 
  [
   325308, 
   null, 
   "Archangel", 
   "You two are delusional. Have you been reading any papers, or any political analysis other than on Fox News?\n\n \n Sure we have. But we're trying to avoid the Leftist Propaganda that the dems are spewing. Here's an accurate account of what's happening. Chris Dodd even had the nerve to attempt to build 2.8 BILLION dollars into an account from the 700 billion which guaranteed the multi million dollar executive bonus packages for the CEOs of these failed Companies, effectively rewarding these CEOs for driving their companies into financial ruin for the sake of personal bonuses. The level of corruption the dems represent is mind boggling. Here's an excerpt.\n While Democrats today roll all over themselves trying to hysterically stop McCain's momentum, created primarily out of his bold move to suspend his campaign to do his job as a Senate leader by participating in getting our economic situation resolved, the truth about why the bailout has not been approved yet is starting to come out.\n \n Yesterday, the Democrats tried to convince the Media that somehow a \"deal\" had been already reached on this bailout proposal, even though nobody from the Republican caucus in the House had approved of it. John McCain himself has gone to Washington specifically for two reasons: to get the deal through with bipartisan support and to make sure that the bill was NOT full of nasty earmarks and trap holes for taxpayers. When the meeting with George W. Bush got underway, you could automatically see that almost all of the fiscal conservatives in the meeting were NOT included in the negotiations and that this deal was in fact a creation of the two entities in the United States with the lowest approval ratings in history; the Democratic Congress and the Bush Administration.\n \n What is in that bill that has led most House Republicans and John McCain himself to oppose it? PORK.\n \n But not any pork, the Democrats have actually earmarked the bill with 100 million dollars for left wing organizers left-wing housing entitlement mobsters and heavily tax-subsidized fraudsters at ACORN. As some of you may already know, ACORN is already under federal investigation for election FRAUD and other unwholesome acts.\n \n When you read the Democrat earmark, specifically Section 5 of the Chris Dodd counter-proposal to the Paulson Plan, a large portion of any repayment of the $700 billion would go to the 'uber community organizers' of ACORN, with a smaller allocation to debt repayment. It specifically promises a minimum 20% of the 'profits' from the Treasury's sale of assets to The Housing Trust Fund and the Capital Magnet Fund. (CLICK HERE TO READ THIS SECTION OF THE BAILOUT)\n \n So what do we want from our lawmakers in Washington? TO STOP THIS PLAN FROM GOING FORWARD UNTIL EVERY SINGLE EARMARK IS REMOVED. We want John McCain and the few sane individuals in Washington to never allow the Bush Administration and the Democratic Congress to slip us (and our children) a billion dollar bill until it is tweaked in such a way that it does not ruin our future.\n \n Although many will love to blame somebody for the failure of this compromise, and John McCain will get the blunt of it from the corrupt Democratic Congress, we all have to make sure to let everyone know that if McCain hadn't taken the public spotlight to Washington, we would ALL have lost plenty of money and the stability of our Nation would have been put in serious jeopardy.\n \n As an example of this, read this small excerpt from a story that was breaking yesterday, a few minutes before the meeting in the White House began (from The Hill):\n \n Senate Democratic leaders unveiled their $56 billion economic stimulus package on Thursday, less than an hour before leaving to meet President Bush at the White House to continue the fragile negotiations on the financial rescue bill.\n \n Calling it \"an economic recovery package that will help middle-class families struggling in the weakening Bush-McCain economy,\" Majority Leader Harry Reid (D-Nev.) and Appropriations Committee Chairman Robert Byrd (D-W.Va.) pitched the plan with the familiar mantra of \"not forgetting Main Street.\" The plan includes a $7.5 billion down payment on $25 billion in loans for the struggling auto industry.\n \n \"Democrats believe that we must urgently pass another economic recovery package that will create hundreds of thousands of good-paying American jobs and prevent cuts in critical services for millions of Americans,\" Reid said in a statement. \"With the economic news only getting worse each day, I call on the president, Sen. McCain and congressional Republicans to join us to quickly get this done for American families.\"\n \n Byrd said the plan compensates for \"failing to invest in America ... the Bush administration has fiddled while Rome has burned.\"\n \n After working to strike a deal on an economic stimulus earlier this year, the Bush administration and congressional Republicans have expressed opposition to the Democrats' new proposal, citing its price tag and the contents of the plan.\n \n At press time Sen. Barack Obama (D-Ill.) said attaching the economic stimulus bill to the bailout package would be a mistake because it would slow down the financial rescue bill.\n \n The proposal was released at 3:13 p.m., just ahead of a scheduled 4 p.m. meeting between Bush and members of Congress. Democrats have been talking about a second stimulus bill for months.\n \n Senior Democratic aides downplayed the significance of the timing, however. One said it was merely \"coincidental,\" while another emphasized that a stimulus plan has always been part of Democratic demands and Thursday's proposal was nothing new.\n \n Democratic sources did indicate openness to how the bill is presented - either as an amendment to the continuing resolution that is pending before the chamber, or as a standalone bill.\n \n This is why they are all angry at McCain today in Washington. They wanted all of this to go on behind closed doors and under the table, now they have to work with the entire Nation breathing down their necks, and they simply don't like it.\n \n What is ironic about all of this is that the Democrats and Barack Obama, are now deeply aligned with the Bush Administration to get this bill passed, AS IS. While John McCain and the House Republicans are trying to somehow modify it, so that the American Taxpayer is NOT bamboozled again. After all of their talk about \"Bush's 3rd Term\", it is now quite clear that only Obama's presidency would mean the re-election of Bush, and McCain's election will mean REAL CHANGE.\n \n Don't give in Mr. McCain, don't listen to the pundits, forget about the polls, PLEASE keep that spotlight over these sleazy politicians throughout this process (at least until they agree), we can all afford to watch you debate Obama on a later date.", 
   {
    "unicode_changes_made": true
   }, 
   325297, 
   null, 
   1222457880.0
  ], 
  [
   325309, 
   null, 
   "Archangel", 
   "I read few papers. The internet works a lot faster and I don't generate any trash to throw away.\n \n Rumor has it that McCain is already in Mississippi, waiting to debate the inexperienced one.\n \n Can you defend the lies told by Obama in the OP or are you just gonna stand there and whistle Dixie?\n\n \n He's gonna whistle dixie, cuz that's all he's got. emoticon_icemoticon_frazzled:(", 
   {}, 
   325305, 
   null, 
   1222458000.0
  ], 
  [
   325393, 
   null, 
   "T.Q", 
   "I read few papers. The internet works a lot faster and I don\\'t generate any trash to throw away.\n\n Strangely enough, most papers have online editions now...\n \n \nCan you defend the lies told by Obama in the OP or are you just gonna stand there and whistle Dixie?\n\n A youtube video...\n \n \nHere\\'s an accurate account of what\\'s happening.\n\n Oh, my mistake, that site is definitely unbiased. Let\\'s see what links are on there:\n Sarah: How a Hockey Mom Turned Alaska\\'s Political Establishment Upside Down\n The Case Against Barack Obama: The Unlikely Rise and Unexamined Agenda of the Media\\'s Favorite Candidate\n Donate to McCain\\'s Campaign\n Racist and insulting cartoons of Barack and Michelle Obama\n It\\'s nothing but an anti-Obama attack site. Why am I not surprised you would find it accurate?", 
   {}, 
   325305, 
   null, 
   1222508520.0
  ], 
  [
   325397, 
   null, 
   "Archangel", 
   "Strangely enough, most papers have online editions now...\n \n \n A youtube video...\n \n \n Oh, my mistake, that site is definitely unbiased. Let\\'s see what links are on there:\n Sarah: How a Hockey Mom Turned Alaska\\'s Political Establishment Upside Down\n The Case Against Barack Obama: The Unlikely Rise and Unexamined Agenda of the Media\\'s Favorite Candidate\n Donate to McCain\\'s Campaign\n Racist and insulting cartoons of Barack and Michelle Obama\n It\\'s nothing but an anti-Obama attack site. Why am I not surprised you would find it accurate?\n\n Here ya go tq, something to keep you warm and close to your messiah on those cold canadian nights. emoticon_xlove emoticon_xbouncer emoticon_xbye\n http://savagepolitics.com/wp-content/uploads/2008/08/2k9e70e563df.jpg", 
   {}, 
   325393, 
   null, 
   1222512360.0
  ], 
  [
   325399, 
   null, 
   "Archangel", 
   "And here's yet another Biden Gaffe for a change of pace, HERE.", 
   {}, 
   325397, 
   null, 
   1222513860.0
  ], 
  [
   325419, 
   null, 
   "TRIGGER", 
   "This video I posted on a diffrent thread here but it also speaks to Obamas lies and this one is the whopper.\n \n http://www.youtube.com/watch?v=H5tZc8oH--o", 
   {}, 
   325399, 
   null, 
   1222542660.0
  ], 
  [
   325420, 
   null, 
   "Archangel", 
   "This video I posted on a diffrent thread here but it also speaks to Obamas lies and this one is the whopper.\n \n http://www.youtube.com/watch?v=H5tZc8oH--o\n\n \n Thanks for posting this Trigger, it's the most concise yet complete explanation of this crisis yet. I e-mailed it to my daughter who's trying to wrap her brain around the detailed causes of this debacle. emoticon_xagree", 
   {}, 
   325419, 
   null, 
   1222545180.0
  ], 
  [
   325439, 
   null, 
   "TRIGGER", 
   "As in most problems when the government is involved they are usualy the cause and not the solution. I'm hopeing that this gets out. The further it goes, the better off we will be. Hopefully this bail out will be killed in congress. And if they are smart they will listen to the economists by lowering the capitol gains tax and suspend all corporate and bussiness taxes in this way our economy would grow it's self out of this crisis with out the peoples money bailing them out.", 
   {}, 
   325420, 
   null, 
   1222571340.0
  ], 
  [
   325444, 
   null, 
   "Archangel", 
   "Here's another video that actually documents Bush and McCain warning of this crisis, and the dems such as Barney Frank and Chuck Schumer insisting there wasn't a problem. And the dems voted as a block against any attempts to build in safeguards. emoticon_xdonnoemoticon_frazzled E-mail this to your complete address book. \n \n http://www.youtube.com/watch?v=cMnSp4qEXNM", 
   {}, 
   325439, 
   null, 
   1222574760.0
  ], 
  [
   326249, 
   null, 
   "TRIGGER", 
   "It wasn't just Frank and Shumer here is some more. Video documentation Of the mess the Dems saddled the American public with.\n \n http://www.youtube.com/watch?v=_MGT_cSi7Rs&eurl=http://pajamasmedia.com/instapundit/\n \n http://www.youtube.com/watch?v=AiEWCnpNnBQ&feature=related", 
   {}, 
   325444, 
   null, 
   1223077260.0
  ], 
  [
   326417, 
   null, 
   "isly ilwott", 
   "This video I posted on a diffrent thread here but it also speaks to Obamas lies and this one is the whopper.\n \n http://www.youtube.com/watch?v=H5tZc8oH--o\nThis one has been removed due to a copyright claim. I wonder if Warner is backing Obama.\n \n \nIt wasn't just Frank and Shumer here is some more. Video documentation Of the mess the Dems saddled the American public with.\n \n http://www.youtube.com/watch?v=_MGT_cSi7Rs&eurl=http://pajamasmedia.com/instapundit/\n \n http://www.youtube.com/watch?v=AiEWCnpNnBQ&feature=related\nThese are representative of the deception and lies told by all that defend the Democrats in their contribution to this mess. Another thread here regarding fault soon became replete with venomous posts from those in denial of the Dems manipulations, despite clear evidence of same.\n \n I wonder if the backers of the Marxist Obama can refute these videos or explain away (spin) the words uttered by either side.\n \n I have noticed that not too many defenders of the Marxist are participating in this thread. Perhaps they have nothing to stand on. There's great difficulty involved in denying a legitimate video. Surely, they can collectively come up with something like \"You're just a bunch of stupid, partisan, political hacks, marching in lock step with today's Nazis!\"\n \n That the Democrats have enabled, promoted and forced the actions and bad practices that have caused this latest financial catastrophy is quite evident.\n \n That Bush, McCain, Palin and others have long been in favor of cleaning up the corruption is also quite evident.\n \n That the Democrats see no problem with the corruption is evidenced by their participation in it. Name after name of those that made off with huge amounts of money come from the roster of Democrats. Some of them have resigned in shame, yet were permitted (at least so far) to keep their millions. These are the kinds of crooks that Marxist Obama has surrounded himself with as advisors...as he continually points his finger at Bush.\n \n It is quite easy to blame those in office when a calamity hits. (Obama knows this.) It is not see easy to cover lies when the true record is exposed.\n \n Americans need to wake up and study the people they are about to vote into office. This is by far the most important election of our next few generations. We will either continue to grow as a powerful, capitalistic, democratic republic or we will take a giant step toward becoming a weak socialist state with a tremendous scaling down of our standards of living...except for those lucky enough to get appointed as government \"advisors\".", 
   {}, 
   326249, 
   null, 
   1223236320.0
  ], 
  [
   326436, 
   null, 
   "Ethmi", 
   "If we cured the common cold before the Aliens from War of the Worlds invaded, Obama would be just the guy we need! He'd PWN the aliens! Man, he'd flatten them with his negotiations, wouldn't he? Oh, he wouldn't give them room to breathe! He'd be begging them to death every second of every minute of every hour of every day of every week of every month of every year of every decade of every century of every millenium and so on... emoticon_rolleyes", 
   {}, 
   326417, 
   null, 
   1223246700.0
  ], 
  [
   326440, 
   null, 
   "TRIGGER", 
   "By the way it may not have been so much about copy writes. There were 2 more that were working yesterday and have disapeared. Heres the dead links. Looks like freedom of information is no longer that important. Especialy since warner is a contributer to the Obama campain. Looks like the fix is in.\n \n \n http://boortz.com/more/video/burning...the_house.html\n \n and version #2\n \n http://www.youtube.com/watch?v=NU6fu...eature=related\n \n I just found this we shall see how long this works. I'll try to be dilligent in keeping this up.\n \n http://www.youtube.com/watch?v=1RZVw3no2A4&feature=related", 
   {}, 
   326436, 
   null, 
   1223248800.0
  ], 
  [
   326447, 
   null, 
   "chester", 
   "The fix is in, righties?\n \n How paranoid are you going to get before we swear in President Obama on 1/20/09?", 
   {}, 
   326440, 
   null, 
   1223253960.0
  ], 
  [
   326449, 
   null, 
   "Ethmi", 
   "The fix is in, righties?\n \n How paranoid are you going to get before we swear in President Obama on 1/20/09?\n\n \n We call that trolling.", 
   {}, 
   326447, 
   null, 
   1223254800.0
  ], 
  [
   326451, 
   null, 
   "chester", 
   "We call that trolling.\n\n \n You call it that; I call it the truth.\n \n Get used to it.", 
   {}, 
   326449, 
   null, 
   1223256240.0
  ], 
  [
   326454, 
   null, 
   "Ethmi", 
   "You call it that; I call it the truth.\n \n Get used to it.\n\n \n Truth? You want truth? Well here's the truth: You're still not addressing a single one of the points we make, as usual. You're just trying to change the subject and add in your two-cents-worth that contributes nothing useful to the debate. You're not even helping your side, you're just a burden your buddies have to carry. You're a weight that slows them down. You try to push them forward, but you drag them back. Look around you. Nobody on here - not even your own side - has any respect for you. You are leech on this forum, and if it were my decision, I would ban you. You have not yet contributed a single point to your side, at least nothing on-topic. You have never posted without trying to change the subject, and when we point this out to you, you ignore us. None of us view you as a formidable opponent. You're just the tiny little bug that has to be crushed. You don't contribute any thing to the issue at hand. Whatever you want to say, you say, you don't seem to give a rat's XXX if it's on-topic, relevant, truthful, or even logical. You once claimed to have 42 years of teaching experience. But with your extremely low maturity level, if you only had 4.2 years of life experience, I wouldn't be surprised. That is the truth, Chester.", 
   {}, 
   326451, 
   null, 
   1223258820.0
  ], 
  [
   326455, 
   null, 
   "Archangel", 
   "Truth? You want truth? Well here's the truth: You're still not addressing a single one of the points we make, as usual. You're just trying to change the subject and add in your two-cents-worth that contributes nothing useful to the debate. You're not even helping your side, you're just a burden your buddies have to carry. You're a weight that slows them down. You try to push them forward, but you drag them back. Look around you. Nobody on here - not even your own side - has any respect for you. You are leech on this forum, and if it were my decision, I would ban you. You have not yet contributed a single point to your side, at least nothing on-topic. You have never posted without trying to change the subject, and when we point this out to you, you ignore us. None of us view you as a formidable opponent. You're just the tiny little bug that has to be crushed. You don't contribute any thing to the issue at hand. Whatever you want to say, you say, you don't seem to give a rat's XXX if it's on-topic, relevant, truthful, or even logical. You once claimed to have 42 years of teaching experience. But with your extremely low maturity level, if you only had 4.2 years of life experience, I wouldn't be surprised. That is the truth, Chester.\n\n \n Now there's some truth I can get on board with. I couldn't have defined \"chester the thread molester\" better if I took a month to try. emoticon_smileemoticon_xgoodemoticon_xhoho", 
   {}, 
   326454, 
   null, 
   1223260860.0
  ], 
  [
   327227, 
   null, 
   "Archangel", 
   "HERE is the best reason to fear what Obama represents. But we all know that the Leftists will embrace him all the more. Here we have Louis Farrakhan actually referring to him as the Messiah to the Nation of islam as he rallies support for him. I wonder why his tax exempt status isn't being questioned or placed in jeopardy for openly endorsing a political candidate at a religious rally? And why do these young people give the sign of revolution as they support this peace loving messiah who claims to what to unify the Country and bring all people together?", 
   {
    "post_info": {
     "post_title": "Obama Proclaimed Messiah by Racist Louis Farrakhan"
    }
   }, 
   326455, 
   null, 
   1223664480.0
  ], 
  [
   327241, 
   null, 
   "simone", 
   "We call that trolling.\n\n What I call trolling are the miles and miles of utter falsehood and total twaddle spewed out by Archie, Idly and EthicallyChallenged.", 
   {}, 
   326449, 
   null, 
   1223666820.0
  ], 
  [
   327248, 
   null, 
   "Archangel", 
   "What I call trolling are the miles and miles of utter falsehood and total twaddle spewed out by Archie, Idly and EthicallyChallenged.\n\n \n Are you saying that what you saw and heard coming out of calypso Louis own mouth is false? And the black kids wearing camoflage uniforms and giving the sign of revolution as they spews pro Obama rhetoric is contrived or falsely created? Is that what you're saying here simone? Or are you admitting that you're in total denial of the facts as you run toward destruction with your fingers in your ears! Yeah, that's it!!! Here, look at it again if the truth isn't too painful for you. http://www.youtube.com/watch?v=3paLqu7BrxU&feature=related", 
   {}, 
   327241, 
   null, 
   1223667540.0
  ], 
  [
   327250, 
   null, 
   "Steeeeve", 
   "You once claimed to have 42 years of teaching experience. But with your extremely low maturity level, if you only had 4.2 years of life experience, I wouldn't be surprised. That is the truth, Chester.\nChester has been banned from this forum countless times. I seriously doubt this person is a teacher much less one of 42yrs. Don't even bother with this poster.\n \n Simone is not much better but I do believe she is who she says she is.", 
   {}, 
   326454, 
   null, 
   1223667840.0
  ], 
  [
   327259, 
   null, 
   "isly ilwott", 
   "One can easily recognize when there is no logical rebuttal of an argument or a point therein. The opposition stoops to name-calling, catty remarks and asinine nicknames, all lacking in significant substance. It is then that they prove their own inadequacy and mental adolescence.", 
   {}, 
   327248, 
   null, 
   1223668980.0
  ], 
  [
   327262, 
   null, 
   "Ethmi", 
   "What I call trolling are the miles and miles of utter falsehood and total twaddle spewed out by Archie, Idly and EthicallyChallenged.\n\n \n Provide such utter falsehood, troll. If I have any comment, it's that I'm still laughing about the time when you concluded that the NRA is against women. There are female officers of the NRA.", 
   {}, 
   327241, 
   null, 
   1223669580.0
  ], 
  [
   327265, 
   null, 
   "Archangel", 
   "One can easily recognize when there is no logical rebuttal of an argument or a point therein. The opposition stoops to name-calling, catty remarks and asinine nicknames, all lacking in significant substance. It is then that they prove their own inadequacy and mental adolescence.\n\n \n Yes, but I am shell shocked at their ability to remain in denial of what stares them right in the face with convincing evidence from so many directions at the same time. To ignore the associations Barry has had that got him to this place and not be afraid of what he truly represents just boggles my mind.", 
   {}, 
   327259, 
   null, 
   1223669880.0
  ], 
  [
   327283, 
   null, 
   "Penfold", 
   "Speaking of denial, McCain and his pitbull are toast. By any measure. All they have is mindless baseless smears and innuendo as perpetrated in this thread and others by the lockstep dittoheads.", 
   {}, 
   327265, 
   null, 
   1223672160.0
  ], 
  [
   327309, 
   null, 
   "Archangel", 
   "Speaking of denial, McCain and his pitbull are toast. By any measure. All they have is mindless baseless smears and innuendo as perpetrated in this thread and others by the lockstep dittoheads.\n\n \n Just wait for the silent majority to have their say in the voting booth before claiming victory penfold.", 
   {}, 
   327283, 
   null, 
   1223677200.0
  ], 
  [
   327313, 
   null, 
   "Penfold", 
   "They surely will, but you and your ilk will not be happy with the outcome.", 
   {}, 
   327309, 
   null, 
   1223677860.0
  ], 
  [
   327547, 
   null, 
   "Archangel", 
   "I realize this wont effect some here because it's dealing with issues of character, but for the rest of you rational observers, see what he truly represents. HERE!\n \n And here is Michele Obama's whitey Thesis. I recommend you pause the video in order to read each section for the full impact of what this family represents at its very core.\n \n And here's more about this new messiah who claims to represent unity and positive change.", 
   {}, 
   327313, 
   null, 
   1223834700.0
  ], 
  [
   327554, 
   null, 
   "Penfold", 
   "Speaking of character, where did Todd and Mrs Mayor get the funds to build their third house, close by the dubious development on land that Wasilla didn't have title to? Who were the \"buddies\" who helped build it?", 
   {}, 
   325297, 
   null, 
   1223837940.0
  ], 
  [
   327558, 
   null, 
   "Archangel", 
   "Speaking of character, where did Todd and Mrs Mayor get the funds to build their third house, close by the dubious development on land that Wasilla didn't have title to? Who were the \"buddies\" who helped build it?\n\n \n I don't know, can you prove they did anything wrong, or are you just here to make more unfounded allegations?", 
   {}, 
   327554, 
   null, 
   1223838720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  And Speaking of Obama's LIES...", 
  "url": "http://www.4forums.com/political/elections-debates/11639-speaking-obamas-lies.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11639, 
  "discussion_files": [
   [
    "3789.html", 
    "http://www.4forums.com/political/elections-debates/11639-speaking-obamas-lies-print.html"
   ], 
   [
    "3790.html", 
    "http://www.4forums.com/political/elections-debates/11639-speaking-obamas-lies-3-print.html"
   ], 
   [
    "3791.html", 
    "http://www.4forums.com/political/elections-debates/11639-speaking-obamas-lies-2-print.html"
   ]
  ], 
  "identifier": 11639
 }
]