[
 [
  [
   324727, 
   null, 
   "Ethmi", 
   "Ian continually whines about \"valid reasons for owning guns\", claiming that self-defence is not one of them on the grounds that it is rare compared to crime (despite the things I've pointed out about his sources; but until he presents them here, let's keep that issue on that thread, shall we?). So I'd like to know what he thinks is a valid reason. Anyone else is welcome to post their views.", 
   {
    "post_info": {
     "post_title": "Valid Reasons for Gun Ownership"
    }
   }, 
   null, 
   null, 
   1222123800.0
  ], 
  [
   324766, 
   null, 
   "Star King", 
   "At this time I seem to be the only vote for \"other\", which is for the purposes of my answer: Any lawful purpose not listed above. \n \n -\"People who live protected lives should not make rules for those who don't\"", 
   {
    "post_info": {
     "post_title": "Explaining &quot;other&quot;"
    }
   }, 
   324727, 
   null, 
   1222139940.0
  ], 
  [
   324770, 
   null, 
   "thelmoose", 
   "Any reason you want. As long as it's legal to possess a firearm, you needn't specify your reason.", 
   {}, 
   324766, 
   null, 
   1222141740.0
  ], 
  [
   324773, 
   null, 
   "snakespit", 
   "The second amendment. That is a valid reason that needs no further explanation. Abolish it or deal with it.", 
   {}, 
   324770, 
   null, 
   1222143000.0
  ], 
  [
   325000, 
   null, 
   "Bryan", 
   "The second amendment. That is a valid reason that needs no further explanation. Abolish it or deal with it.\n\n \n Amen.\n \n I have reasons for needing a firearm, but I have no obligation to reveal them.\n \n I don't have to justify the necessity of having a right to be free from unreasonable search and seizure; my right to free speech, press, and assembly; my right to attend (or not attend) a church of my choice; my right to remain silent and to have the protection of a citizen composed grand jury before being made to stand trial for a felony offense; to have a trial by jury, to be free from cruel and unusual punishments; or my right not to be a slave. These rights are recognized by my Constitution, and need no further justification. The RKBA is likewise a part of that great charter, and it requires no further justification. \n \n ---\n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, Lecture II, 1921.", 
   {
    "post_info": {
     "post_title": "No justification required"
    }, 
    "unicode_changes_made": true
   }, 
   324773, 
   null, 
   1222272000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Valid Reasons for Gun Ownership", 
  "url": "http://www.4forums.com/political/gun-control-debates/11632-valid-reasons-gun-ownership.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11632, 
  "discussion_files": [
   [
    "3746.html", 
    "http://www.4forums.com/political/gun-control-debates/11632-valid-reasons-gun-ownership-print.html"
   ]
  ], 
  "identifier": 11632
 }
]