[
 [
  [
   325022, 
   null, 
   "isly ilwott", 
   "With the economy being the main issue to determine the next party in power here in the United States, it is important to study the history of the institutions and practices that have culminated in the current economic crisis. Voting against a political party based upon rhetoric that another uses to blame the incumbent party for current financial woes that required years to develop based on some errant moves made decades prior is to ignore history.\n \n So comes Barack Obama and the Democrats to blame George Bush and the Republicans for the Fannie Mae/Freddie Mac debacle. It has actually been years in the making.\n \n If one heeds Obama's words, one will vote for more of the same policies, programs and corruption that caused this in the first place.\n \n If one studies the history of Fannie Mae/Freddie Mac and similar programs, one sees that Jimmy Carter (D) set the ball rolling in his Community Redevelopment Act. One would see that Bill Clinton (D) expanded the program.\n \n One would also see that John McCain sponsored a bill to reform FM/FM in 2005, a bill that was defeated by partisan Democrats voting against it.\n \n One would learn that FM/FM have made significant contributions to the campaigns of many politicians. One would see that topping this list are 4 Democrats, BO being third behind Chris Dodd and John Kerry, with Hillary following in fourth.\n \n Why would not one learn from history that the problems we see today in the housing market were created by, sustained by and used by Democrats to gain votes as well as line their own pockets?\n \n Why would not one learn that John McCain has actually tried to reform the system already and been opposed by the same liberals that benefitted not only from the votes gained in the give-away programs but from the corruption that manifests itself in the salaries and contributions passed out?\n \n Why would not one learn that the Democrats are merely seizing the opportunity to blame the incumbent when the problem was born of and exacerbated by their own liberalism and corruption within 'legal' institutions?\n \n It can't be that hard to figure out. After all, I did...all by myself.", 
   {
    "post_info": {
     "post_title": "History matters."
    }
   }, 
   null, 
   null, 
   1222278120.0
  ], 
  [
   325106, 
   null, 
   "T.Q", 
   "Odd how you missed listing Reagan, H.W. Bush, and W. Bush in your history of presidents who had the opportunity to fix this before it all melted down. You list Carter (1 term) and Clinton (2 terms) as the ones at fault for the current crisis, yet they only served a combined 12 years, whereas the Republicans listed above were in charge for a combined 20.\n \n Carter may have started it, but why didn't Reagan or Bush 1 fix it? Clinton may have expanded it, but why didn't Bush 2 fix it? You're putting the blame on one party and giving the other a free pass.", 
   {}, 
   325022, 
   null, 
   1222298280.0
  ], 
  [
   325110, 
   null, 
   "isly ilwott", 
   "Odd how you missed listing Reagan, H.W. Bush, and W. Bush in your history of presidents who had the opportunity to fix this before it all melted down. You list Carter (1 term) and Clinton (2 terms) as the ones at fault for the current crisis, yet they only served a combined 12 years, whereas the Republicans listed above were in charge for a combined 20.\n \n Carter may have started it, but why didn't Reagan or Bush 1 fix it? Clinton may have expanded it, but why didn't Bush 2 fix it? You're putting the blame on one party and giving the other a free pass.\nI give the Republicans no free pass. They have misused the system also...apparently not to the degree the Dems have, but neither side is lilly white concerning unearned profits from the system.\n \n I don't know that any president since Carter has recognized the potential for a devastating failure. The system was just growing under Reagan. Perhaps the corruption wasn't rampant yet when Ronnie was in charge. Clinton could have left it alone, but he chose to grease the slide. perhaps he made it easier to extract funds from and added to the corruption factor. It did grow worse and worse, lining pockets on both sides of the aisle as years went by until someone decided to try to reform it. It will be interesting to see where the millions of dollars in salaries and campaign contributions went since the beginning of the 'program for the less fortunate' began. It's been a cash cow for a lot of politicians.\n \n At least John McCain supported some reform of the system several years ago. The reform bill was nixed by the Dems in a partisan vote. For that, I praise the Republicans and scorn the Democrats. Their social giveaway programs do nothing but cost us money and reward laziness, encouraging dependancy of the government to provide income and freebies to all. That's socialism.\n \n To blame Bush 43 for the housing debacle is pure hogwash. It started with Jimmy Carter, was enabled further by Bill Clinton and was protected from reform by Democratics. The Democrats are at fault here.", 
   {}, 
   325106, 
   null, 
   1222299420.0
  ], 
  [
   325118, 
   null, 
   "T.Q", 
   "It started with Jimmy Carter, was enabled further by Bill Clinton and was protected from reform by Democratics. The Democrats are at fault here. \n\n Yes, you've said that numerous times, both on this thread and others. But you have never yet supported it. And, as I stated above, even if you are correct-that Carter began it and Clinton excaberated it-there were still 3 Republicans presidents who dropped the ball, either by not recognizing the issue, or by ignoring it.", 
   {}, 
   325110, 
   null, 
   1222301940.0
  ], 
  [
   325270, 
   null, 
   "isly ilwott", 
   "Yes, you've said that numerous times, both on this thread and others. But you have never yet supported it. And, as I stated above, even if you are correct-that Carter began it and Clinton excaberated it-there were still 3 Republicans presidents who dropped the ball, either by not recognizing the issue, or by ignoring it.\n\n If you keep up with history enough to read that of the housing mortgage market, you will find that all three assertions I make;[*]Carter started it[*]Clinton modified it (to make it easier to get a loan to an unqualified borrower)[*]the Democrats defeated a reform bill to add regulations to it (one co-sponsored by John McCain)\n ...are quite true.\n \n History backs me up. I shouldn't have to lead you to the feed trough. You can read the facts for yourself.", 
   {}, 
   325118, 
   null, 
   1222443120.0
  ], 
  [
   325296, 
   null, 
   "T.Q", 
   "If you keep up with history enough to read that of the housing mortgage market, you will find that all three assertions I make;[*]Carter started it[*]Clinton modified it (to make it easier to get a loan to an unqualified borrower)[*]the Democrats defeated a reform bill to add regulations to it (one co-sponsored by John McCain)\n ...are quite true.\n \n History backs me up. I shouldn't have to lead you to the feed trough. You can read the facts for yourself.\n\n \n Wait a minute. You make the claim that the reason the US is becoming a third world country is solely on the shoulders of two people-Carter and Clinton. I ask you to support this, and ask you if that is true then why did the Republicans (who were in power nearly 20 of the last 32 years) do nothing to fix/stop it, and your response is \"I shouldn't have to lead you to the feed trough. You can read the facts for yourself.\"?\n \n That is not the way it works, and you should know better. You made the claim, you provide the proof. I do not go digging for evidence to support your assertion, and you completely ignored my question to you", 
   {}, 
   325270, 
   null, 
   1222451460.0
  ], 
  [
   325311, 
   null, 
   "isly ilwott", 
   "Wait a minute. You make the claim that the reason the US is becoming a third world country is solely on the shoulders of two people-Carter and Clinton. I ask you to support this, and ask you if that is true then why did the Republicans (who were in power nearly 20 of the last 32 years) do nothing to fix/stop it, and your response is \"I shouldn't have to lead you to the feed trough. You can read the facts for yourself.\"?\n \n That is not the way it works, and you should know better. You made the claim, you provide the proof. I do not go digging for evidence to support your assertion, and you completely ignored my question to you\nI have posted already, several times on this site, that Jimmy Carter is responsible for the original program and that Bill Clinton further eased restrictions on those who could not afford the mortgages. You have yet to refute those two main points. If you have evidence of the program getting started by other than Carter, please present it. If you can show evidence that someone other than Clinton made the major push to reduce the already inadequate requirements for FM/FM loans, please do so.\n \n Do those two things and then we can talk more about the difficulty in recognizing that the problem could explode into a crisis, seemingly overnight (to a lot of people).\n \n Then we can talk about the FACT that John McCain and a few others recognized a potential problem and tried to have it alleviated in 2006...when the Democrats defeated the attempt in a partisan vote. (or do I need to prove that to you also?)\n \n Don't you read the papers or watch something besides Entertainment Tonight?\n \n My three bullets stand unrefuted.\n \n \n ...and I have not said that the blame is solely Carter's and Clinton's. I attribute the bulk of the blame to the Democrats. They are to blame for not inacting reform several years ago after other people recognized the dangers of continuing the status quo in that area. The Dems wanted to continue to milk the cash cow with extractions of campaign contributions. (The top 4 recipients are Democrats.) At least John McCain had sense enough to see a need for reform and to stand up for it.", 
   {}, 
   325296, 
   null, 
   1222458900.0
  ], 
  [
   325392, 
   null, 
   "T.Q", 
   "I have posted already, several times on this site, that Jimmy Carter is responsible for the original program and that Bill Clinton further eased restrictions on those who could not afford the mortgages.\n\n That's right, you have posted the above several times. What you have failed to do is provide evidence that the above posted is in any way correct.\n \n \nYou have yet to refute those two main points.\n\n And you have yet to support them.\n \n \n If you have evidence of the program getting started by other than Carter, please present it. If you can show evidence that someone other than Clinton made the major push to reduce the already inadequate requirements for FM/FM loans, please do so.\n\n I would rather you actually support the points before I bother trying to refute them.\n \n \nDon't you read the papers or watch something besides Entertainment Tonight?\n\n Oh, so because I want you to support statements that you have made, I have a short attention span and no knowledge of events? I see you have no actual interest in the discussion, you just want to slam Democrats.\n \n \nMy three bullets stand unrefuted.\n\n Let me correct that for you:\n \"My three bullets stand unsupported.\"\n \n \n \n...and I have not said that the blame is solely Carter's and Clinton's.\n\n That's right, you've just stated that they are to blame. Wait, that's the same thing...\n \n \nI attribute the bulk of the blame to the Democrats.\n\n No, you attribute all the blame to Democrats.\n \n \nThey are to blame for not inacting reform several years ago after other people recognized the dangers of continuing the status quo in that area.\n\n Carter-4 year term.\n Reagan-8 years\n H.W. Bush-4 years\n \n So, 12 years, no corrections made\n \n Clinton-8 years\n W. Bush-8 years\n \n So, another 8 years after Clinton, and again, no corrections made.\n \n \nAt least John McCain had sense enough to see a need for reform and to stand up for it.\n\n The Washington Post\n \"A decade ago, Sen. John McCain embraced legislation to broadly deregulate the banking and insurance industries, helping to sweep aside a thicket of rules established over decades in favor of a less restricted financial marketplace that proponents said would result in greater economic growth. \n \n Now, as the Bush administration scrambles to prevent the collapse of the American International Group (AIG), the nation's largest insurance company, and stabilize a tumultuous Wall Street, the Republican presidential nominee is scrambling to recast himself as a champion of regulation to end \"reckless conduct, corruption and unbridled greed\" on Wall Street.\n ...\n In 2002, McCain introduced a bill to deregulate the broadband Internet market, warning that \"the potential for government interference with market forces is not limited to federal regulation.\" Three years earlier, McCain had joined with other Republicans to push through landmark legislation sponsored by then-Sen. Phil Gramm (Tex.), who is now an economic adviser to his campaign. The Gramm-Leach-Bliley Act aimed to make the country's financial institutions competitive by removing the Depression-era walls between banking, investment and insurance companies. \n \n \n \n That bill allowed AIG to participate in the gold rush of a rapidly expanding global banking and investment market. But the legislation also helped pave the way for companies such as AIG and Lehman Brothers to become behemoths laden with bad loans and investments.\n ...\n In 2007, he told a group of bloggers on a conference call that he regretted his vote on the Sarbanes-Oxley bill, which has been castigated by many executives as too heavy-handed. \n \n In the 1990s, he backed an unsuccessful effort to create a moratorium on all new government regulation. And in 1996, he was one of only five senators to oppose a comprehensive telecommunications act, saying it did not go far enough in deregulating the industry.\n ...\n \"I'm always for less regulation,\" he told the Wall Street Journal in March. He added: \"I'd like to see a lot of the unnecessary government regulations eliminated.\"\"", 
   {}, 
   325311, 
   null, 
   1222507680.0
  ], 
  [
   325491, 
   null, 
   "isly ilwott", 
   "That's right, you have posted the above several times. What you have failed to do is provide evidence that the above posted is in any way correct.\n \n \n And you have yet to support them.\n \n \n I would rather you actually support the points before I bother trying to refute them.\n \n \n Oh, so because I want you to support statements that you have made, I have a short attention span and no knowledge of events? I see you have no actual interest in the discussion, you just want to slam Democrats.\n \n \n Let me correct that for you:\n \"My three bullets stand unsupported.\"\n \n \n \n That's right, you've just stated that they are to blame. Wait, that's the same thing...\n \n \n No, you attribute all the blame to Democrats.\n \n \n Carter-4 year term.\n Reagan-8 years\n H.W. Bush-4 years\n \n So, 12 years, no corrections made\n \n Clinton-8 years\n W. Bush-8 years\n \n So, another 8 years after Clinton, and again, no corrections made.\n \n \n The Washington Post\n \"A decade ago, Sen. John McCain embraced legislation to broadly deregulate the banking and insurance industries, helping to sweep aside a thicket of rules established over decades in favor of a less restricted financial marketplace that proponents said would result in greater economic growth. \n \n Now, as the Bush administration scrambles to prevent the collapse of the American International Group (AIG), the nation's largest insurance company, and stabilize a tumultuous Wall Street, the Republican presidential nominee is scrambling to recast himself as a champion of regulation to end \"reckless conduct, corruption and unbridled greed\" on Wall Street.\n ...\n In 2002, McCain introduced a bill to deregulate the broadband Internet market, warning that \"the potential for government interference with market forces is not limited to federal regulation.\" Three years earlier, McCain had joined with other Republicans to push through landmark legislation sponsored by then-Sen. Phil Gramm (Tex.), who is now an economic adviser to his campaign. The Gramm-Leach-Bliley Act aimed to make the country's financial institutions competitive by removing the Depression-era walls between banking, investment and insurance companies. \n \n \n \n That bill allowed AIG to participate in the gold rush of a rapidly expanding global banking and investment market. But the legislation also helped pave the way for companies such as AIG and Lehman Brothers to become behemoths laden with bad loans and investments.\n ...\n In 2007, he told a group of bloggers on a conference call that he regretted his vote on the Sarbanes-Oxley bill, which has been castigated by many executives as too heavy-handed. \n \n In the 1990s, he backed an unsuccessful effort to create a moratorium on all new government regulation. And in 1996, he was one of only five senators to oppose a comprehensive telecommunications act, saying it did not go far enough in deregulating the industry.\n ...\n \"I'm always for less regulation,\" he told the Wall Street Journal in March. He added: \"I'd like to see a lot of the unnecessary government regulations eliminated.\"\"\n\n http://ibdeditorial.com/IBDArticles.aspx?id=306370789279709\n \n The untold story in this whole national crisis is that President Clinton put on steroids the Community Reinvestment Act*, a well-intended Carter-era law designed to encourage minority homeownership. And in so doing, he helped create the market for the risky subprime loans that he and Democrats now decry as not only greedy but \"predatory.\"\n Yes, the market was fueled by greed and overleveraging in the secondary market for subprimes, vis-a-vis mortgaged-backed securities traded on Wall Street. But the seed was planted in the '90s by Clinton and his social engineers. They were the political catalyst behind this slow-motion financial train wreck.\n \n I'm betting that won't be enough for you, though it clearly substantiates my initial argument...that Carter started the plan, Clinton modified it to help produce the catastrophy we see today.\n \n The Republicans have seen a need for regulation of Fannie Mae and Freddie Mac since 2001. The Democrats wouldn't allow it because FM and FM were cash cows to them.\n \n http://www.youtube.com/watch?v=cMnSp4qEXNM\n \n What you need to do is refute that the Carter admin generated and signed the Community Reinvestment Act of 1977 or that Clinton signed bills making it even easier for unqualified people to get mortages. It was all a Democratic giveaway program that has backfired tremendously and the Dems now want to blame it on \"Bush's failed economic policies\" because it's convenient and easy to do so.\n \n There was some numbnut Democrat on a morning talk show this very morning, sitting next to a Republican that read aloud the voting record of the numbnut sitting next to him, showing clearly that this numbnut had voted against regulations on FM/FM and the numbnut still replies, \"The problem resulted from Bush's failed economic policies.\" \n \n That appears to be the catch-all, defend-all statement to excuse this man's errant votes and contribution to the problem.\n \n Bush and McCain both saw a need to regulate Fannie and Freddie but the Dems refused to do it. \n \n \n \n Here's another tidbit of information about Fannie and Freddie.\n \n http://hnn.us/articles/1849.html\n \n You'll note (if you bother to read it) that Fannie may was privatized by none other than LBJ, in 1968. He did that to remove it from his budget. It became the privatized, unregulated big dog in the mortgage industry. The lack of regulation made it a cash cow.", 
   {}, 
   325392, 
   null, 
   1222630200.0
  ], 
  [
   325588, 
   null, 
   "isly ilwott", 
   "September 30, 1999\n \n Fannie Mae Eases Credit To Aid Mortgage Lending\n By STEVEN A. HOLMES\n \n In a move that could help increase home ownership rates among minorities and low-income consumers, the Fannie Mae Corporation is\n easing the credit requirements on loans that it will purchase from banks and other lenders.\n \n The action, which will begin as a pilot program involving 24 banks in 15 markets -- including the New York metropolitan region -- will\n encourage those banks to extend home mortgages to individuals whose credit is generally not good enough to qualify for conventional\n loans. Fannie Mae officials say they hope to make it a nationwide program by next spring.\n \n Fannie Mae, the nation's biggest underwriter of home mortgages, has been under increasing pressure from the Clinton Administration to\n expand mortgage loans among low and moderate income people and felt pressure from stock holders to maintain its phenomenal growth in\n profits.\n \n In addition, banks, thrift institutions and mortgage companies have been pressing Fannie Mae to help them make more loans to so-called\n subprime borrowers. These borrowers whose incomes, credit ratings and savings are not good enough to qualify for conventional loans,\n can only get loans from finance companies that charge much higher interest rates -- anywhere from three to four percentage points higher\n than conventional loans.\n \n ''Fannie Mae has expanded home ownership for millions of families in the 1990's by reducing down payment requirements,'' said Franklin\n D. Raines, Fannie Mae's chairman and chief executive officer. ''Yet there remain too many borrowers whose credit is just a notch below\n what our underwriting has required who have been relegated to paying significantly higher mortgage rates in the so-called subprime\n market.''\n \n Demographic information on these borrowers is sketchy. But at least one study indicates that 18 percent of the loans in the subprime\n market went to black borrowers, compared to 5 per cent of loans in the conventional loan market.\n \n In moving, even tentatively, into this new area of lending, Fannie Mae is taking on significantly more risk, which may not pose any\n difficulties during flush economic times. But the government-subsidized corporation may run into trouble in an economic downturn,\n prompting a government rescue similar to that of the savings and loan industry in the 1980's.\n \n ''From the perspective of many people, including me, this is another thrift industry growing up around us,'' said Peter Wallison a resident\n fellow at the American Enterprise Institute. ''If they fail, the government will have to step up and bail them out the way it stepped up and\n bailed out the thrift industry.''\n \n Under Fannie Mae's pilot program, consumers who qualify can secure a mortgage with an interest rate one percentage point above that of a\n conventional, 30-year fixed rate mortgage of less than $240,000 -- a rate that currently averages about 7.76 per cent. If the borrower makes\n his or her monthly payments on time for two years, the one percentage point premium is dropped.\n \n Fannie Mae, the nation's biggest underwriter of home mortgages, does not lend money directly to consumers. Instead, it purchases loans\n that banks make on what is called the secondary market. By expanding the type of loans that it will buy, Fannie Mae is hoping to spur\n banks to make more loans to people with less-than-stellar credit ratings.Fannie Mae officials stress that the new mortgages will be extended to all potential borrowers who can qualify for a mortgage. But they add that the move is intended in part to increase the number of minority and low income home owners who tend to have worse credit ratings than non-Hispanic whites.\n \n Home ownership has, in fact, exploded among minorities during the economic boom of the 1990's. The number of mortgages extended to\n Hispanic applicants jumped by 87.2 per cent from 1993 to 1998, according to Harvard University's Joint Center for Housing Studies.\n During that same period the number of African Americans who got mortgages to buy a home increased by 71.9 per cent and the number of\n Asian Americans by 46.3 per cent.\n \n In contrast, the number of non-Hispanic whites who received loans for homes increased by 31.2 per cent.\n \n Despite these gains, home ownership rates for minorities continue to lag behind non-Hispanic whites, in part because blacks and Hispanics\n in particular tend to have on average worse credit ratings.\n \n In July, the Department of Housing and Urban Development proposed that by the year 2001, 50 percent of Fannie Mae's and Freddie Mac's\n portfolio be made up of loans to low and moderate-income borrowers. Last year, 44 percent of the loans Fannie Mae purchased were from\n these groups.\n \n The change in policy also comes at the same time that HUD is investigating allegations of racial discrimination in the automated\n underwriting systems used by Fannie Mae and Freddie Mac to determine the credit-worthiness of credit applicants.", 
   {
    "post_info": {
     "post_title": "NYT article from 1999...the Clinton factor revealed for you obstinate liberals."
    }
   }, 
   325491, 
   null, 
   1222713000.0
  ], 
  [
   325636, 
   null, 
   "Another opinion", 
   "Though I am not an economic expert, so I will not be willing to go into too detailed a discussion, I did feel the need to bring up one important point. Namely, managing sub-prime morgages didn't need to automatically lead to massive defaults and this financial crisis. The problem, as I understand it, is with how those loans were handled in a financial industry far more interested in short term profits than long term stability.\n \n From an article in the Boston Globe: http://www.boston.com/bostonglobe/editorial_opinion/oped/articles/2008/09/24/bailout_must_address_the_foreclosure_crisis/ \n \nThe reason for this financial meltdown is greed. Wall Street and all the affiliated entities made massive amounts of money, but created a \"toxic\" hangover.\n \n Mortgage lending didn't have to be done this way and the Neighborhood Assistance Corporation of America is the best example. We have been lending to the people the industry considers \"subprime\" borrowers for more than 20 years with a $10 billion commitment. Because NACA did it the right way, by providing true homeownership with a fixed-rate mortgage, no down payment and no closing costs, our performance has been one of the best and not touched by this crisis. We have destroyed the myth that in order to compensate for the \"risk\" of lending to subprime borrowers, you need to get a higher return.\n \n NACA is also demonstrating the solution to this mortgage crisis. We are in the forefront of providing real solutions for at-risk borrowers by restructuring their mortgage to what they can afford. The interest rate and/or outstanding mortgage amount is reduced to achieve this affordable mortgage payment.\n \n This can be accomplished for millions of at-risk homeowners if the government utilizes its power of regulation and, if necessary, provides incentives (tax incentives, bond returns, or other economic benefits) to make the mortgages affordable.\n", 
   {}, 
   325588, 
   null, 
   1222732140.0
  ], 
  [
   325638, 
   null, 
   "isly ilwott", 
   "Though I am not an economic expert, so I will not be willing to go into too detailed a discussion, I did feel the need to bring up one important point. Namely, managing sub-prime morgages didn't need to automatically lead to massive defaults and this financial crisis. The problem, as I understand it, is with how those loans were handled in a financial industry far more interested in short term profits than long term stability.\n \n From an article in the Boston Globe: http://www.boston.com/bostonglobe/editorial_opinion/oped/articles/2008/09/24/bailout_must_address_the_foreclosure_crisis/\nI am far from knowledgeable regarding economics also. However, it should not take much understanding of economics to realize that giving mortgages in mass to people that cannot afford to pay them off will lead to economic woes, bad debts and someone being on the hook. Somebody's got to go broke servicing bad debts. Clinton made it easy.", 
   {}, 
   325636, 
   null, 
   1222732860.0
  ], 
  [
   325656, 
   null, 
   "Another opinion", 
   "I am far from knowledgeable regarding economics also. However, it should not take much understanding of economics to realize that giving mortgages in mass to people that cannot afford to pay them off will lead to economic woes, bad debts and someone being on the hook. Somebody's got to go broke servicing bad debts. Clinton made it easy.\n\n I agree that it is certainly easier for debts to go bad when given to sub-prime borrowers. However, as with the example of NACA, that doesn't need to be the case. I would attribute the crisis to a combination of (1) increase in number of mortgages to sub-prime borrowers, coupled with (2) a deregulated industry that valued short term profits over long term stability and was allowed to follow practices that essentially guaranteed that such debts would go bad.\n \n The first point may well have been pushed more by Democrats out of good intentions, so I would agree that they are more to blame about the first point. However, deregulation is far more a montra of the Republican party than of the Democratic party, so I would blame the second point more on the Republicans. In other words, I would see both parties to blame for this crisis but, most of all, I would blame an industry that has shown time and again that it cannot be trusted with complete freedom of action but needs to be regulated, while simultaneously not being politically pushed in financially risky directions.", 
   {}, 
   325638, 
   null, 
   1222736760.0
  ], 
  [
   325717, 
   null, 
   "isly ilwott", 
   "I agree that it is certainly easier for debts to go bad when given to sub-prime borrowers. However, as with the example of NACA, that doesn't need to be the case. I would attribute the crisis to a combination of (1) increase in number of mortgages to sub-prime borrowers, coupled with (2) a deregulated industry that valued short term profits over long term stability and was allowed to follow practices that essentially guaranteed that such debts would go bad.\n \n The first point may well have been pushed more by Democrats out of good intentions, so I would agree that they are more to blame about the first point. However, deregulation is far more a montra of the Republican party than of the Democratic party, so I would blame the second point more on the Republicans. In other words, I would see both parties to blame for this crisis but, most of all, I would blame an industry that has shown time and again that it cannot be trusted with complete freedom of action but needs to be regulated, while simultaneously not being politically pushed in financially risky directions.\n\n Who recognized a need to reform the mortgage give-away system?\n \n Who defeated efforts to reform (regulate) Fannie Mae/Freddie Mac?", 
   {}, 
   325656, 
   null, 
   1222801380.0
  ], 
  [
   325738, 
   null, 
   "Another opinion", 
   "Who recognized a need to reform the mortgage give-away system?\n \n Who defeated efforts to reform (regulate) Fannie Mae/Freddie Mac?\n\n Though McCain did support such a bill, there are a few things that are unclear. Mainly, the reform bill (The Federal Housing Enterprise Regulatory Reform Act of 2005) died in the Senate Committee on Banking, Housing, and Urban Affairs which, at the time, was dominated by Republicans. Also, I haven't yet found any site explaining the reasons behind the opposition of those Democrats that did oppose it. I will reserve judgement on this until I get more information. Certainly, I do not trust the spin put on it by Fox News or the McCain campaign...\n \n ---on edit---\n In following a thread in another newsgroup discussing this issue, I found an interesting article from the Financial Times: http://www.ft.com/cms/s/0/8780c35e-7e91-11dd-b1af-000077b07658.html?nclick_check=1 :\n \nIn the aftermath of the US Treasury's decision to seize control of Fannie Mae and Freddie Mac, critics have hit at lax oversight of the mortgage companies.\n \n The dominant theme has been that Congress let the two government-sponsored enterprises morph into a creature that eventually threatened the US financial system. Mike Oxley will have none of it.\n \n Instead, the Ohio Republican who headed the House financial services committee until his retirement after mid-term elections last year, blames the mess on ideologues within the White House as well as Alan Greenspan, former chairman of the Federal Reserve.\n \n The critics have forgotten that the House passed a GSE reform bill in 2005 that could well have prevented the current crisis, says Mr Oxley, now vice-chairman of Nasdaq.\n \n He fumes about the criticism of his House colleagues. \"All the handwringing and bedwetting is going on without remembering how the House stepped up on this,\" he says. \"What did we get from the White House? We got a one-finger salute.\"\n \n The House bill, the 2005 Federal Housing Finance Reform Act, would have created a stronger regulator with new powers to increase capital at Fannie and Freddie, to limit their portfolios and to deal with the possibility of receivership.\n \n Mr Oxley reached out to Barney Frank, then the ranking Democrat on the committee and now its chairman, to secure support on the other side of the aisle. But after winning bipartisan support in the House, where the bill passed by 331 to 90 votes, the legislation lacked a champion in the Senate and faced hostility from the Bush administration.\n \n Adamant that the only solution to the problems posed by Fannie and Freddie was their privatisation, the White House attacked the bill. Mr Greenspan also weighed in, saying that the House legislation was worse than no bill at all.\n \n \"We missed a golden opportunity that would have avoided a lot of the problems we're facing now, if we hadn't had such a firm ideological position at the White House and the Treasury and the Fed,\" Mr Oxley says.\n \n When Hank Paulson joined the administration as Treasury secretary in 2006 he sent emissaries to Capitol Hill to explore the possibility of reaching a compromise, but to no avail. \n\n So, it actually did pass both the Senate Committee on Banking, Housing, and Urban Affairs, and the House, but was stalled in the Senate due to lack of support and due to opposition by Bush - where it is significant that this information comes from a House Republican. Anyway, it is far from clear that it was the Democrats fault that this bill stalled. Note the section I bolded about the bipartisan support in the House on this bill. The Bush administration seems to be the culprit in killing this bill - why am I not surprised.", 
   {
    "post_info": {
     "post_title": "Bush administration at fault for killing reform bill"
    }
   }, 
   325717, 
   null, 
   1222807920.0
  ], 
  [
   325756, 
   null, 
   "isly ilwott", 
   "Though McCain did support such a bill, there are a few things that are unclear. Mainly, the reform bill (The Federal Housing Enterprise Regulatory Reform Act of 2005) died in the Senate Committee on Banking, Housing, and Urban Affairs which, at the time, was dominated by Republicans. Also, I haven't yet found any site explaining the reasons behind the opposition of those Democrats that did oppose it. I will reserve judgement on this until I get more information. Certainly, I do not trust the spin put on it by Fox News or the McCain campaign...\nIt may have died in committee because of knowledge of insufficient backing on the floor. I would like to see a roll call vote on the matter.", 
   {}, 
   325738, 
   null, 
   1222809420.0
  ], 
  [
   325781, 
   null, 
   "Another opinion", 
   "It may have died in committee because of knowledge of insufficient backing on the floor. I would like to see a roll call vote on the matter.\n\n I found out more information on the killing of this bill, which I added on edit to my previous post and will repeat here:\n \n In following a thread in another newsgroup discussing this issue, I found an interesting article from the Financial Times: http://www.ft.com/cms/s/0/8780c35e-7e91-11dd-b1af-000077b07658.html?nclick_check=1 :\n \nIn the aftermath of the US Treasury's decision to seize control of Fannie Mae and Freddie Mac, critics have hit at lax oversight of the mortgage companies.\n \n The dominant theme has been that Congress let the two government-sponsored enterprises morph into a creature that eventually threatened the US financial system. Mike Oxley will have none of it.\n \n Instead, the Ohio Republican who headed the House financial services committee until his retirement after mid-term elections last year, blames the mess on ideologues within the White House as well as Alan Greenspan, former chairman of the Federal Reserve.\n \n The critics have forgotten that the House passed a GSE reform bill in 2005 that could well have prevented the current crisis, says Mr Oxley, now vice-chairman of Nasdaq.\n \n He fumes about the criticism of his House colleagues. \"All the handwringing and bedwetting is going on without remembering how the House stepped up on this,\" he says. \"What did we get from the White House? We got a one-finger salute.\"\n \n The House bill, the 2005 Federal Housing Finance Reform Act, would have created a stronger regulator with new powers to increase capital at Fannie and Freddie, to limit their portfolios and to deal with the possibility of receivership.\n \n Mr Oxley reached out to Barney Frank, then the ranking Democrat on the committee and now its chairman, to secure support on the other side of the aisle. But after winning bipartisan support in the House, where the bill passed by 331 to 90 votes, the legislation lacked a champion in the Senate and faced hostility from the Bush administration.\n \n Adamant that the only solution to the problems posed by Fannie and Freddie was their privatisation, the White House attacked the bill. Mr Greenspan also weighed in, saying that the House legislation was worse than no bill at all.\n \n \"We missed a golden opportunity that would have avoided a lot of the problems we're facing now, if we hadn't had such a firm ideological position at the White House and the Treasury and the Fed,\" Mr Oxley says.\n \n When Hank Paulson joined the administration as Treasury secretary in 2006 he sent emissaries to Capitol Hill to explore the possibility of reaching a compromise, but to no avail. \n\n So, it actually did pass both the Senate Committee on Banking, Housing, and Urban Affairs, and the House, but was stalled in the Senate due to lack of support and due to opposition by Bush - where it is significant that this information comes from a House Republican. Anyway, it is far from clear that it was the Democrats fault that this bill stalled. Note the section I bolded about the bipartisan support in the House on this bill. The Bush administration seems to be the culprit in killing this bill - why am I not surprised.", 
   {
    "post_info": {
     "post_title": "Bush administration at fault for killing reform bill"
    }
   }, 
   325756, 
   null, 
   1222811100.0
  ], 
  [
   325786, 
   null, 
   "isly ilwott", 
   "I found out more information on the killing of this bill, which I added on edit to my previous post and will repeat here:\n \n In following a thread in another newsgroup discussing this issue, I found an interesting article from the Financial Times: http://www.ft.com/cms/s/0/8780c35e-7e91-11dd-b1af-000077b07658.html?nclick_check=1 :\n \n So, it actually did pass both the Senate Committee on Banking, Housing, and Urban Affairs, and the House, but was stalled in the Senate due to lack of support and due to opposition by Bush - where it is significant that this information comes from a House Republican. Anyway, it is far from clear that it was the Democrats fault that this bill stalled. Note the section I bolded about the bipartisan support in the House on this bill. The Bush administration seems to be the culprit in killing this bill - why am I not surprised.\nNot that I don't believe you, but we could be talking about different bills. It could be that Bush objected to some attachments to the bill rather than the bill itself. I haven't read enough of it yet.\n \n http://hotair.com/archives/2008/09/17/mccains-attempt-to-fix-fannie-mae-freddie-mac-in-2005/\n \n http://www.bloomberg.com/apps/news?pid=newsarchive&sid=aSKSoiNbnQY0\n \n These links do not agree with your evaluation. The Dems killed the bill, not George Bush.", 
   {}, 
   325781, 
   null, 
   1222812060.0
  ], 
  [
   325788, 
   null, 
   "Another opinion", 
   "Not that I don't believe you, but we could be talking about different bills. It could be that Bush objected to some attachments to the bill rather than the bill itself. I haven't read enough of it yet.\n\n This was indeed the bill that was co-sponsored by McCain. The details of the bill (which I personally haven't read) can be found at http://www.govtrack.us/congress/bill.xpd?bill=s109-190 .\n \n I am not at all surprised that the Bush administration would have killed this bill, since his administration has been driven by ideology - whether or not it conforms to reality. I will admit, though, that we Democrats do often assume that the attitude of the Bush administration is shared by all Republicans - which it is not. Here, I do give kudos to the Republicans for starting this bill. Democrats also deserve praise for apparently supporting it (a vote of 331 to 90 in favor shows clear Democratic support as well). I don't know the details of what transpired in the Senate but I have heard that the Bush administration can be very nasty in its tactics in keeping its own Republicans in line (threatening withdrawal of campaign financial support or threatening to sponsor alternative candidates against those that oppose the administration's view, etc.). So, given the Bush administrations adamant opposition, I am not too surprised that Senate Republicans would have caved in while Democrats may have had their own political reasons for not being the main push on the bill. Anyway, that is just conjecture.", 
   {}, 
   325786, 
   null, 
   1222812660.0
  ], 
  [
   325790, 
   null, 
   "isly ilwott", 
   "This was indeed the bill that was co-sponsored by McCain. The details of the bill (which I personally haven't read) can be found at http://www.govtrack.us/congress/bill.xpd?bill=s109-190 .\n \n I am not at all surprised that the Bush administration would have killed this bill, since his administration has been driven by ideology - whether or not it conforms to reality. I will admit, though, that we Democrats do often assume that the attitude of the Bush administration is shared by all Republicans - which it is not. Here, I do give kudos to the Republicans for starting this bill. Democrats also deserve praise for apparently supporting it (a vote of 331 to 90 in favor shows clear Democratic support as well). I don't know the details of what transpired in the Senate but I have heard that the Bush administration can be very nasty in its tactics in keeping its own Republicans in line (threatening withdrawal of campaign financial support or threatening to sponsor alternative candidates against those that oppose the administration's view, etc.). So, given the Bush administrations adamant opposition, I am not too surprised that Senate Republicans would have caved in while Democrats may have had their own political reasons for not being the main push on the bill. Anyway, that is just conjecture.\nWe seem to have conflicting views on who killed the bill. Can you find evidence that Bush opposed the bill rather than some attachments? I've read one article that says that Bush thought the only workable solution was complete privatization. (I thought LBJ had privatized them earlier...to get them out of his budget.) Maybe Bush wanted to give them over totally to private administration, leaving government control and appointments to easily corruptable people out of the picture.\n \n I find more articles that say the Dems killed the reform than I do articles that say Bush was against reform. He may have been against that particular bill, but he pointed out the need for reform in 2001.", 
   {}, 
   325788, 
   null, 
   1222813320.0
  ], 
  [
   325792, 
   null, 
   "Another opinion", 
   "We seem to have conflicting views on who killed the bill. Can you find evidence that Bush opposed the bill rather than some attachments?\n\n Besides the first bill (numbered S.190), there was apparently another bill introduced the next year which McCain didn't sponsor (S.1100). Perhaps there is some confusion between those two bills. \n \n I think we both need to search out more information on these bills since our sources do seem to give conflicting answers. Anyway, I will get back to this when I have more time to search.\n \n ----on edit---\n Note: I took a look at your Bloomberg link and found something that just didn't make sense. \"But the bill didn't become law, for a simple reason: Democrats opposed it on a party-line vote in the committee, signaling that this would be a partisan issue. Republicans, tied in knots by the tight Democratic opposition, couldn't even get the Senate to vote on the matter. \" First, earlier in the same link, it said that \"For the first time in history, a serious Fannie and Freddie reform bill was passed by the Senate Banking Committee\" so which was it - passed or not passed? Secondly, bills get passed by the House before they can come up for vote in the Senate so how could the article say \"couldn't even get the Senate to vote on the matter.\" when it claimed that it never even got out of committe. Something is quite fishy about that article. I would not trust its logic. Besides, how could Democrats block it in committe if the committee was dominated by Republicans? Committees don't allow for filibusters, as would be allowed on the Senate floor.\n \n --more edit---\n There seems to be another bill related to these mortgage agencies, house bill H.R. 1461, that was co-sponsored by Rep. Oxley but not by McCain that seemed to die in committee. Perhaps this is the House version of the Bill that McCain sponsored. Anyway, the plot thickens. Perhaps there indeed were numerous bills that came up to address this issue - some being blocked by Democrats, some by Republicans and some by the Bush administration. Anyway, we clearly need more information.\n \n ---even more edits---\n More on this H.R. 1461: A statement of policy on this bill from the Bush administration is shown in link http://www.presidency.ucsb.edu/ws/index.php?pid=24851 : \n \nThe Administration has long called for legislation to create a stronger, more effective regulatory regime to improve oversight of Fannie Mae, Freddie Mac, and the Federal Home Loan Banks (\"housing government-sponsored enterprises\" or \"housing GSEs\") and appreciates the considerable efforts of Chairman Oxley and Chairman Baker in crafting H.R. 1461. However, \n \n H.R. 1461 fails to include key elements that are essential to protect the safety and soundness of the housing finance system and the broader financial \n system at large. As a result, the Administration opposes the bill.\n\n \n Also, here is a link about this bill, stating that it did indeed pass the house but was not voted on in the Senate: http://www.govtrack.us/congress/bill.xpd?bill=h109-1461 . Its name, according to the government link, is indeed \"Federal Housing Finance Reform Act of 2005\". Note that 122 Democrats supported it while 74 Democrats opposed it; and a larger majority of Republicans supported it (209 Ayes over 15 Nayes). All of this, from government websites, does confirm the validity of the Financial Times article I quoted. \n \n The McCain sponsored bill, S.190, was called the \"Federal Housing Enterprise Regulatory Reform Act of 2005\" - a different bill that never even got the support of the H.R. 1461 bill, since it seems to have died in committee without even getting a House vote, as had the bipartisan supported H.R. 1461.\n \n So, once again, it seems that ther might have been various bills proposed to address the same instability of Fannie Mae and Freddie Mac. Though it is not yet clear who killed the McCain sponsored bill (given that the committee was dominated by Republicans), this particular different bill was at least partly killed by Bush. I suspect that the bottom line will be that many politicians on both sides agreed that something needed to be done but that they couldn't agree on how well enough to pass a bill through both houses of Congress and have it signed by the president.\n \n Either way, I would still place the main blame on Bush. It is clear that even the large majority of House Republicans supported the Oxley sponsored H.R. 1461, and that this was a very promising bill since it had strong bipartisan support. The statement of policy from the Bush administration about this bill clearly shows his opposition - which supports Oxley's claims that it was the administration that killed it. The other bill, the McCain sponsored S.190, had much less support. Perhaps even the Republicans on the Senate committee were not as committed to it, given that H.R. 1461 existed. Either way, the McCain sponsored bill was a failure compared to the Oxley sponsored H.R. 1461. Bush killed the only bill that had a chance of succeeding.", 
   {}, 
   325790, 
   null, 
   1222813920.0
  ], 
  [
   325869, 
   null, 
   "Another opinion", 
   "Though I am not usually in the habit of quoting other internet posters, I found this interesting answer from a \"robmaan\" on a thread with link: http://digg.com/2008_us_elections/CNN_Poll_Republicans_blamed_for_financial_crisis_Obama_up?t=19044539 . It addresses some of the reasons behind the failure of the McCain sponsored S.190 bill.\n \nSenator McCain's supporters have made much of his co-sponsorship of S. 190, an attempt to reform Fannie and Freddie during the 109th Congress. However, it may well be worth remembering that this was initially Senator Charles Hagel's bill, and secondly that its provisions met with significant opposition from conservative quarters. The real \"maverick\" in this tale certainly could be the Man Not Running, Senator Charles Hagel (R-NE). Neither have the other two co-sponsors assumed the Maverick Label - Senators Dole and Sununu.\n \n Senator McCain signed on as co-sponsor of Hagel's Federal Housing Enterprise Regulatory Reform Act of 2005, urging its quick passage, [GovTrak] and this vocal support appears to be the totality of his exertions. S.190 promptly ran into controversies over policy differences between the House version (H.R. 1461, 109th) and the Senate edition in terms of housing requirements, portfolio limits, and program/product approval. [NAHB] From the National Association of Home Builder's perspective S. 190 had some serious flaws: \"In contrast, (to the House version) the Senate bill, S. 190, contained many restrictive provisions that could harm the nation's housing finance system, including: restrictions on asset holdings, discretion to raise minimum capital, burdensome program approval process, and a regulatory structure tilted away from housing. In addition, S. 190 did not require Fannie Mae and Freddie Mac to set aside monies to fund affordable housing initiatives, as provided in the House-passed bill.\" [NAHB] S. 190 died quietly in the Republican controlled Senate Banking Committee at the end of the 109th Congress. The stronger of the two pieces of legislation, H.R. 1461, didn't draw rave reviews either. \n\n Though I cannot verify any of the accuracy of this poster's quote, it did seem as if he knew what he was talking about and does give more bits of information that one can go on in searching for an answer to this puzzle.", 
   {
    "unicode_changes_made": true
   }, 
   325792, 
   null, 
   1222892280.0
  ], 
  [
   325897, 
   null, 
   "Another opinion", 
   "More interesting news. In 2007, with a now Democratically controlled Congress, Democrats introduced a new bill proposing to reform Fannie Mae and Freddie Mac, based on the 2005 H.R. 1461 bill that had successfully passed the house but was killed by the Bush administration. The details of the bill, named \"the Federal Housing Finance Reform Act of 2007\" can be found at http://www.govtrack.us/congress/bill.xpd?bill=h110-1427 . Once again, it passed the house and was stalled in the Senate. This time, the House voting record was Democrats (223 Ayes, 0 Nayes) and Republicans (90 Ayes, 104 Nayes) - with a total count of 313 to 104, which allowed the bill to pass the House in May 2007. It then went to the Committee on Banking, Housing, and Urban Affairs and seemed to stall there, though the govtrack website did say \"Keep in mind that debate may be taking place on a companion bill in the Senate, rather than on this particular bill. [Last Updated: Sep 26, 2008]\". It appears that this bill, or a Senate-edited version of it, might still be alive and has been re-energized by the current financial crisis.\n \n Anyway, it is interesting to note that, though many Republicans supported this bill, a far smaller percentage supported it than in 2005. This bill was sponsored by a combination of Democrats and Republicans - \n started by Rep. Barney Frank [D-MA]; Cosponsors [as of 2008-09-27]\n Rep. Richard Baker [R-LA], Rep. Carolyn Maloney [D-NY], Rep. Gary Miller [R-CA], Rep. Lee Terry [R-NE], Rep. Melvin Watt [D-NC]. The web site doesn't say when particular cosponsors joined.\n \n Also, this was a bill that was supported by the National Association of Home Builders, who had this to say about the history of reform of Fannie Mae and Freddie Mac: from http://www.nahb.org/generic.aspx?genericContentID=9016 : \nIn recent years, several legislative proposals have been introduced that would restructure the present regulatory structure for Fannie Mae, Freddie Mac, and the FHLBanks. Congressional scrutiny of the GSEs was heightened following revelations in 2003 and 2004 of improper management decisions, accounting practices, and earnings smoothing at Freddie Mac and Fannie Mae.\n \n NAHB supports congressional efforts to strengthen the financial safety and soundness and the housing mission regulation of the GSEs. The building industry believes oversight of these two areas must be balanced. Unfortunately, there are many who would like to take this opportunity to diminish or eliminate the advantages of the GSEs, treating them more as banking organizations. NAHB is concerned that changes to the GSE regulatory framework could harm these entities&#8217; critical role in housing finance and, ultimately, raise mortgage borrowing costs.\n \n Legislation reforming the regulatory oversight of the housing GSEs was considered by the 109th Congress, but ultimately died due to policy differences between the House and Senate reform packages, in many key areas, most notably: affordable housing requirements, portfolio limits, and program/product approval. NAHB supported the House-passed bill H.R. 1461, which was a balanced bill that included many of NAHB&#8217;s priorities in key areas and did not include several adverse provisions sought by those seeking to restrict GSE activities. In contrast, the Senate bill, S. 190, contained many restrictive provisions that could harm the nation&#8217;s housing finance system, including: restrictions on asset holdings, discretion to raise minimum capital, burdensome program approval process, and a regulatory structure tilted away from housing. In addition, S. 190 did not require Fannie Mae and Freddie Mac to set aside monies to fund affordable housing initiatives, as provided in the House-passed bill.\n \n Debate on GSE reform has resumed in the 110th Congress. However, with a change in party control in both the House and Senate, the dynamic for consensus has changed significantly. Indeed, the House Financial Services Committee considered and passed a bipartisan GSE reform bill in early 2007 based on the House-passed bill from the 109th Congress and negotiations with the Department of the Treasury during year-end negotiations in 2006. The bill, the Federal Housing Finance Reform Act of 2007 (H.R. 1427), creates a strong independent regulator with oversight for the three housing GSEs &#8211; Fannie Mae, Freddie Mac, and the Federal Home Loan Banks. It also establishes an Affordable Housing Fund (AHF) that will, in its first year, disburse grants for the construction of affordable housing in areas affected by Hurricane Katrina. In the second through fifth years (after which the fund terminates), the fund will be used for affordable housing projects nationwide. Significantly, the bill ensures a level playing field for both for-profit and not-for-profit entities in the allocation of AHF funds. The bill also does not contain restrictive portfolio and capital provisions, such as those in the 109th Congress&#8217; Senate bill.\n \n Companion legislation has not been introduced in the Senate, but the Democrat-led Senate Banking Committee is expected to consider GSE reform legislation, similar to that moving in the House. Thus, any GSE legislation passed in the 110th Congress is more likely to be similar to the House bills and would not include strict portfolio caps, but would include an affordable housing fund component &#8211; a significant departure from previous Senate versions.\n\n The bottom line is that the Democrats didn't drop the ball. Indeed, majority of House Democrats voted for the 2005 H.R. 1461 bill, along with a majority of Republicans. However, Republican support decreased for the similar 2007 bill - perhaps because they weren't the main ones starting it, Democrats did, or because of their experience in 2005.", 
   {
    "post_info": {
     "post_title": "the Federal Housing Finance Reform Act of 2007"
    }
   }, 
   325869, 
   null, 
   1222897980.0
  ], 
  [
   325903, 
   null, 
   "isly ilwott", 
   "More interesting news. In 2007, with a now Democratically controlled Congress, Democrats introduced a new bill proposing to reform Fannie Mae and Freddie Mac, based on the 2005 H.R. 1461 bill that had successfully passed the house but was killed by the Bush administration. The details of the bill, named \"the Federal Housing Finance Reform Act of 2007\" can be found at http://www.govtrack.us/congress/bill.xpd?bill=h110-1427 . Once again, it passed the house and was stalled in the Senate. This time, the House voting record was Democrats (223 Ayes, 0 Nayes) and Republicans (90 Ayes, 104 Nayes) - with a total count of 313 to 104, which allowed the bill to pass the House in May 2007. It then went to the Committee on Banking, Housing, and Urban Affairs and seemed to stall there, though the govtrack website did say \"Keep in mind that debate may be taking place on a companion bill in the Senate, rather than on this particular bill. [Last Updated: Sep 26, 2008]\". It appears that this bill, or a Senate-edited version of it, might still be alive and has been re-energized by the current financial crisis.\n \n Anyway, it is interesting to note that, though many Republicans supported this bill, a far smaller percentage supported it than in 2005. This bill was sponsored by a combination of Democrats and Republicans - \n started by Rep. Barney Frank [D-MA]; Cosponsors [as of 2008-09-27]\n Rep. Richard Baker [R-LA], Rep. Carolyn Maloney [D-NY], Rep. Gary Miller [R-CA], Rep. Lee Terry [R-NE], Rep. Melvin Watt [D-NC]. The web site doesn't say when particular cosponsors joined.\n \n Also, this was a bill that was supported by the National Association of Home Builders, who had this to say about the history of reform of Fannie Mae and Freddie Mac: from http://www.nahb.org/generic.aspx?genericContentID=9016 : \n The bottom line is that the Democrats didn't drop the ball. Indeed, majority of House Democrats voted for the 2005 H.R. 1461 bill, along with a majority of Republicans. However, Republican support decreased for the similar 2007 bill - perhaps because they weren't the main ones starting it, Democrats did, or because of their experience in 2005.\nI haven't finished reding the entire bill. I am not convinced that the regulation intended by Barney Franks is something to be desired.\n \n I did note a crucial section:\n \n SEC. 126. DUTY TO SERVE UNDERSERVED MARKETS.\n (a) Establishment and Evaluation of Performance- Section 1335 of the Housing and Community Development Act of 1992 (12 U.S.C. 4565) is amended--\n (1) in the section heading, by inserting `duty to serve underserved markets and' before `other';\n (2) by striking subsection (b);\n (3) in subsection (a)--\n (A) in the matter preceding paragraph (1), by inserting `and to carry out the duty under subsection (a) of this section' before `, each enterprise shall';\n (B) in paragraph (3), by inserting `and' after the semicolon at the end;\n (C) in paragraph (4), by striking `; and' and inserting a period;\n (D) by striking paragraph (5); and\n (E) by redesignating such subsection as subsection (b);\n (4) by inserting before subsection (b) (as so redesignated by paragraph (3)(E) of this subsection) the following new subsection:\n `(a) Duty To Serve Underserved Markets-\n `(1) DUTY- In accordance with the purpose of the enterprises under section 301(3) of the Federal National Mortgage Association Charter Act (12 U.S.C. 1716) and section 301(b)(3) of the Federal Home Loan Mortgage Corporation Act (12 U.S.C. 1451 note) to undertake activities relating to mortgages on housing for very low-, low-, and moderate-income families involving a reasonable economic return that may be less than the return earned on other activities, each enterprise shall have the duty to increase the liquidity of mortgage investments and improve the distribution of investment capital available for mortgage financing for underserved markets.\n `(2) UNDERSERVED MARKETS- To meet its duty under paragraph (1), each enterprise shall comply with the following requirements with respect to the following underserved markets:\n `(A) MANUFACTURED HOUSING- The enterprise shall lead the industry in developing loan products and flexible underwriting guidelines to facilitate a secondary market for mortgages on manufactured homes for very low-, low-, and moderate-income families.\n `(B) AFFORDABLE HOUSING PRESERVATION- The enterprise shall lead the industry in developing loan products and flexible underwriting guidelines to facilitate a secondary market to preserve housing affordable to very low-, low-, and moderate-income families, including housing projects subsidized under--\n `(i) the project-based and tenant-based rental assistance programs under section 8 of the United States Housing Act of 1937;\n `(ii) the program under section 236 of the National Housing Act;\n `(iii) the below-market interest rate mortgage program under section 221(d)(4) of the National Housing Act;\n `(iv) the supportive housing for the elderly program under section 202 of the Housing Act of 1959;\n `(v) the supportive housing program for persons with disabilities under section 811 of the Cranston-Gonzalez National Affordable Housing Act; and\n `(vi) the rural rental housing program under section 515 of the Housing Act of 1949.\n `(C) RURAL AND OTHER UNDERSERVED MARKETS- The enterprise shall lead the industry in developing loan products and flexible underwriting guidelines to facilitate a secondary market for mortgages on housing for very low-, low-, and moderate-income families in rural areas, and for mortgages for housing for any other underserved market for very low-, low-, and moderate-income families that the Secretary identifies as lacking adequate credit through conventional lending sources. Such underserved markets may be identified by borrower type, market segment, or geographic area.'; and\n (5) by adding at the end the following new subsection:\n `(c) Evaluation and Reporting of Compliance-\n `(1) IN GENERAL- Not later than 6 months after the effective date under section 185 of the Federal Housing Finance Reform Act of 2007, the Director shall establish a manner for evaluating whether, and the extent to which, the enterprises have complied with the duty under subsection (a) to serve underserved markets and for rating the extent of such compliance. Using such method, the Director shall, for each year, evaluate such compliance and rate the performance of each enterprise as to extent of compliance. The Director shall include such evaluation and rating for each enterprise for a year in the report for that year submitted pursuant to section 1319B(a).\n `(2) SEPARATE EVALUATIONS- In determining whether an enterprise has complied with the duty referred to in paragraph (1), the Director shall separately evaluate whether the enterprise has complied with such duty with respect to each of the underserved markets identified in subsection (a), taking into consideration--\n `(A) the development of loan products and more flexible underwriting guidelines;\n `(B) the extent of outreach to qualified loan sellers in each of such underserved markets; and\n `(C) the volume of loans purchased in each of such underserved markets.\n `(3) MANUFACTURED HOUSING MARKET- In determining whether an enterprise has complied with the duty under subparagraph (A) of subsection (a)(2), the Director may consider loans secured by both real and personal property.'.\n (b) Enforcement- Subsection (a) of section 1336 of the Housing and Community Development Act of 1992 (12 U.S.C. 4566(a)) is amended--\n (1) in paragraph (1), by inserting `and with the duty under section 1335A of each enterprise with respect to underserved markets,' before `as provided in this section,'; and\n (2) by adding at the end of such subsection, as amended by the preceding provisions of this title, the following new paragraph:\n `(4) ENFORCEMENT OF DUTY TO PROVIDE MORTGAGE CREDIT TO UNDERSERVED MARKETS- The duty under section 1335(a) of each enterprise to serve underserved markets (as determined in accordance with section 1335(c)) shall be enforceable under this section to the same extent and under the same provisions that the housing goals established under this subpart are enforceable. Such duty shall not be enforceable under any other provision of this title (including subpart C of this part) other than this section or under any provision of the Federal National Mortgage Association Charter Act or the Federal Home Loan Mortgage Corporation Act.'.\n \n *************************\n This appears to force loans to be given to other unqualified people...similar to what Bill Clinton did in 1995.\n \n You have not obsolved the Dems of fault here...only thrown out another smoke screen.", 
   {}, 
   325897, 
   null, 
   1222899600.0
  ], 
  [
   325911, 
   null, 
   "Another opinion", 
   "I haven't finished reding the entire bill. I am not convinced that the regulation intended by Barney Franks is something to be desired.\n \n I did note a crucial section:\n \n SEC. 126. DUTY TO SERVE UNDERSERVED MARKETS.\n (a) Establishment and Evaluation of Performance- Section 1335 of the Housing and Community Development Act of 1992 (12 U.S.C. 4565) is amended.......\n ....... Such duty shall not be enforceable under any other provision of this title (including subpart C of this part) other than this section or under any provision of the Federal National Mortgage Association Charter Act or the Federal Home Loan Mortgage Corporation Act.'.\n \n *************************\n This appears to force loans to be given to other unqualified people...similar to what Bill Clinton did in 1995.\n \n You have not obsolved the Dems of fault here...only thrown out another smoke screen.\n\n First of all, the first 2005 H.R. 1461 bill, that was started by Republicans and which received over 90% of the House Republican vote, also had provisions for these financial entities to serve underserved markets: from Section 126 of H.R. 1461\n \n`(a) Duty to Serve Underserved Markets-\n `(1) DUTY- In accordance with the purpose of the enterprises under section 301(3) of the Federal National Mortgage Association Charter Act (12 U.S.C. 1716) and section 301(b)(3) of the Federal Home Loan Mortgage Corporation Act (12 U.S.C. 1451 note) to undertake activities relating to mortgages on housing for very low-, low-, and moderate-income families involving a reasonable economic return that may be less than the return earned on other activities, each enterprise shall have the duty to increase the liquidity of mortgage investments and improve the distribution of investment capital available for mortgage financing for underserved markets.\n `(2) UNDERSERVED MARKETS- To meet its duty under paragraph (1), each enterprise shall comply with the following requirements with respect to the following underserved markets:\n `(A) MANUFACTURED HOUSING- The enterprise shall lead the industry in developing loan products and flexible underwriting guidelines to facilitate a secondary market for mortgages on manufactured homes for very low-, low-, and moderate-income families.\n `(B) AFFORDABLE HOUSING PRESERVATION- The enterprise shall lead the industry in developing loan products and flexible underwriting guidelines to facilitate a secondary market to preserve housing affordable to very low-, low-, and moderate-income families, including housing projects subsidized under--\n `(i) the project-based and tenant-based rental assistance programs under section 8 of the United States Housing Act of 1937;\n `(ii) the program under section 236 of the National Housing Act;\n `(iii) the below-market interest rate mortgage program under section 221(d)(4) of the National Housing Act;\n `(iv) the supportive housing for the elderly program under section 202 of the Housing Act of 1959;\n `(v) the supportive housing program for persons with disabilities under section 811 of the Cranston-Gonzalez National Affordable Housing Act; and\n `(vi) the rural rental housing program under section 515 of the Housing Act of 1949.\n `(C) RURAL AND OTHER UNDERSERVED MARKETS- The enterprise shall lead the industry in developing loan products and flexible underwriting guidelines to facilitate a secondary market for mortgages on housing for very low-, low-, and moderate-income families in rural areas, and for mortgages for housing for any other underserved market for very low-, low-, and moderate-income families that the Secretary identifies as lacking adequate credit through conventional lending sources. Such underserved markets may be identified by borrower type, market segment, or geographic area.'; .....\n\n This reflects the desire on both sides of the isle, both Republican and Democrat, to expand the possibility of home ownership to the poor. Indeed, Bush also mentions this goal in the very Statement of Policy that killed the H.R. 1461 bill: \"The Administration strongly believes that the housing GSEs should be focused on their core housing mission, particularly with respect to low-income Americans and first-time homebuyers.\"\n \n The problem is not in itself giving mortgages to the poor. The problem lies mainly in HOW you do it. Though there are those people who are poor simply because they are irresponsible (and I would also deny them mortgages), many people are poor because of circumstances in their lives leaving them with poor job prospects so they might be juggling multiple part-time jobs, etc. Many of these poor are responsible but they are on a tight budget that cannot afford a sudden jump in interest rates if they are one month late on their mortgage, or if the interest rate changes in a predatory fashion. As I had quoted earlier about NACA, there are many ways to lend money to the poor which can result in very limited number of defaults and result in a long term stable lending agency. However, such ways of lending money don't typically lead to high short term profits, which is why they probably weren't often practiced. That is where regulation can help. These two bills (H.R. 1461 from 2005, and H.R. 1427 from 2007) try to improve on oversight in how these lending agencies address mortgages to low-income families.", 
   {}, 
   325903, 
   null, 
   1222903440.0
  ], 
  [
   326032, 
   null, 
   "isly ilwott", 
   "First of all, the first 2005 H.R. 1461 bill, that was started by Republicans and which received over 90% of the House Republican vote, also had provisions for these financial entities to serve underserved markets: from Section 126 of H.R. 1461\n \n This reflects the desire on both sides of the isle, both Republican and Democrat, to expand the possibility of home ownership to the poor. Indeed, Bush also mentions this goal in the very Statement of Policy that killed the H.R. 1461 bill: \"The Administration strongly believes that the housing GSEs should be focused on their core housing mission, particularly with respect to low-income Americans and first-time homebuyers.\"\n \n The problem is not in itself giving mortgages to the poor. The problem lies mainly in HOW you do it. Though there are those people who are poor simply because they are irresponsible (and I would also deny them mortgages), many people are poor because of circumstances in their lives leaving them with poor job prospects so they might be juggling multiple part-time jobs, etc. Many of these poor are responsible but they are on a tight budget that cannot afford a sudden jump in interest rates if they are one month late on their mortgage, or if the interest rate changes in a predatory fashion. As I had quoted earlier about NACA, there are many ways to lend money to the poor which can result in very limited number of defaults and result in a long term stable lending agency. However, such ways of lending money don't typically lead to high short term profits, which is why they probably weren't often practiced. That is where regulation can help. These two bills (H.R. 1461 from 2005, and H.R. 1427 from 2007) try to improve on oversight in how these lending agencies address mortgages to low-income families.\nI have no doubt that Jimmy Carter had the best of intentions when he pushed the CRA of 1977. I doubt he knew that it might cause a problem when the bad mortgages became part of the trading scheme amongst bankers and Fannie Mae. He likely was truly concerned about the inability of these poor voters to get home loans.\n \n I don't know that Bill Clinton knew that his changes to the requirements would result in the catastrophy that has occurred. He likely had (along with visions of millions of new liberal voters) high hopes for the mortgage market in dealing with these unqualified buyers.\n \n The fact that neither one of them knew what would happen does NOT change the fact that they contributed to the problem. Greed in the banking industry and greed in the investments markets were the vehicles that drove along the Carter/Clinton-created highway to bankruptcy.\n \n If CRA had never been passed or possibly if Clinton had never screwed with it, we might not be in this mess today.", 
   {}, 
   325911, 
   null, 
   1222982220.0
  ], 
  [
   326041, 
   null, 
   "Another opinion", 
   "I have no doubt that Jimmy Carter had the best of intentions when he pushed the CRA of 1977. I doubt he knew that it might cause a problem when the bad mortgages became part of the trading scheme amongst bankers and Fannie Mae. He likely was truly concerned about the inability of these poor voters to get home loans.\n \n I don't know that Bill Clinton knew that his changes to the requirements would result in the catastrophy that has occurred. He likely had (along with visions of millions of new liberal voters) high hopes for the mortgage market in dealing with these unqualified buyers.\n \n The fact that neither one of them knew what would happen does NOT change the fact that they contributed to the problem. Greed in the banking industry and greed in the investments markets were the vehicles that drove along the Carter/Clinton-created highway to bankruptcy.\n \n If CRA had never been passed or possibly if Clinton had never screwed with it, we might not be in this mess today.\n\n I fail to see the logic in mainly blaming someone who started a program for the problems that a program has THIRTY YEARS down the road. I know that, given your strong anti-Democratic bias, you are very motivated to blame this on Democrats. However, I have already shown through my government references that BOTH Democrats and Republicans supported trying to aid the poor in getting mortgages via these financial entities. This has been demonstrated both by the sections that I quoted from the Republican-started (and Democrat supported) H.R. 1461, and by the quote from President Bush. \n \n Since BOTH parties supported getting loans to poor families, the question remains about which parties supported the types of regulations necessary to properly regulate the entities - which would have stopped the type of abuses that have led to this crisis. Though the Republican party, including McCain, had often made general statements against government regulation in the 1990s, I agree that most Republicans (at least House Republicans), along with Democrats, did see the need for reform of these entities after their financial debaucles in ~2004. At that point, both parties seemed committed to strengthening government oversight - all except, apparently, President Bush - where I have read in a few blogs (and you yourself had noted) that he was much more adamant about PRIVATE oversight, not government oversight. The 2005 bipartisan, Republican-started H.R. 1461 was the most promising reform bill that emerged from these concerns and, if it had been implimented, then it could well have stopped this crisis. It was Bush's opposition (probably fueled by this insistence on privatizing regulation) that stopped this most promising bill.\n \n Are you contesting any of these conclusions? If so, then please provide references from government sites (as I had) to support your objection.", 
   {}, 
   326032, 
   null, 
   1222987860.0
  ], 
  [
   326055, 
   null, 
   "Another opinion", 
   "I found an interesting article about how, as late as 2004 (during the Bush administration), Fannie Mae and Freddy Mac were made even more financially unstable with a significant increase in the numbers of loans to poor markets. From the Washington Post: http://www.washingtonpost.com/wp-dyn/content/article/2008/06/09/AR2008060902626.html\n \nIn 2004, as regulators warned that subprime lenders were saddling borrowers with mortgages they could not afford, the U.S. Department of Housing and Urban Development helped fuel more of that risky lending. \n \n Eager to put more low-income and minority families into their own homes, the agency required that two government-chartered mortgage finance firms purchase far more \"affordable\" loans made to these borrowers. HUD stuck with an outdated policy that allowed Freddie Mac and Fannie Mae to count billions of dollars they invested in subprime loans as a public good that would foster affordable housing. \n \n Housing experts and some congressional leaders now view those decisions as mistakes that contributed to an escalation of subprime lending that is roiling the U.S. economy. \n ...\n In 2001, HUD researchers warned of high foreclosure rates among subprime loans. \n \n \"Given the very high concentration of these loans in low-income and African American neighborhoods, the growth in subprime lending and resulting very high levels of foreclosure is a real cause for concern,\" an agency report said. \n \n But by 2004, when HUD next revised the goals, Freddie and Fannie's purchases of subprime-backed securities had risen tenfold. Foreclosure rates also were rising. \n \n That year, President Bush's HUD ratcheted up the main affordable-housing goal over the next four years, from 50 percent to 56 percent. John C. Weicher, then an assistant HUD secretary, said the institutions lagged behind even the private market and \"must do more.\" \n \n For Wall Street, high profits could be made from securities backed by subprime loans. Fannie and Freddie targeted the least-risky loans. Still, their purchases provided more cash for a larger subprime market. \n \n \"That was a huge, huge mistake,\" said Patricia McCoy, who teaches securities law at the University of Connecticut. \"That just pumped more capital into a very unregulated market that has turned out to be a disaster.\" \n \n In 2003, the two bought $81 billion in subprime securities. In 2004, they purchased $175 billion -- 44 percent of the market. In 2005, they bought $169 billion, or 33 percent. In 2006, they cut back to $90 billion, or 20 percent. Generally, Freddie purchased more than Fannie and relied more heavily on the securities to meet goals. \n \n \"The market knew we needed those loans,\" said Sharon McHale, a spokeswoman for Freddie Mac. The higher goals \"forced us to go into that market to serve the targeted populations that HUD wanted us to serve,\" she said. \n\n Clinton may well have pushed for more subprime loans in the 1990s, but that was before the escalation of poor lending practices by these agencies and while the number of subprime loans and the number of foreclosures was much lower. What is surprising, outside of the lack of oversight itself, is that the Bush administration, through HUD (which is administered by the Executive branch which Bush heads), should push for MORE of such loans, just at a time when they were getting risky, while at the same time not pushing for more oversight. THAT is irresponsible - i.e. making the problem worse when the signs of a problem are already visible.", 
   {
    "post_info": {
     "post_title": "Another culprit behind the financial debaucle"
    }
   }, 
   326041, 
   null, 
   1222991340.0
  ], 
  [
   326084, 
   null, 
   "daewoo", 
   "The problem here is that you are both assuming that the housing meltdown is the problem. It is not. The housing meltdown is a symptom of the problem. \n \n The problem started way back in the 60's. US manufacturing started to slow down and we started shifting more to a service based economy. The further the gap grew between manufacturing and services, the more problems we had and at a time when we should have been cutting back on government spending we were increasing it.\n \n Finally things kind of came to a head. The bank of england showed up with a bunch of dollars and wanted to exchange it for gold. We had over run our printing presses by a WIDER margin and could not redeem those bills, so Nixon chose to take us off the gold standard rather than throw us into a nasty recession. That was the first time in the current long range cycle that a president basically chose to put off the correction.\n \n He did not kill the correction, though, he just threw us into a stagflationary situation that lasted for a decade. \n \n When Reagan was elected, he was looking for a way to bolster the economy...real or not. The Reagan administration basically opted for tax cuts and MASSIVE government spending increases. IT worked....the massive government spending gave us an entire decade of false economic growth and we were into the bubble economy. The bubbles actually served a necessary function since they helped soak up some of the MASSIVE amounts of money that was being printed and provided, to some extent, a rational for the wealth.\n \n Bush sr actually tried to get us on the right track. Unlike Reagan who talked about the evils of big government and talked about how \"I am from the government and am here to help\" was a scary phrase and then increased the size and spending of the government at unprecedented levels, Bush actually was trying to look out for our economic well being. When the Bush (1) administration saw bubbles forming, they moved in to pop them.\n \n Unfortunately economic decline is a bad platform to run on so he lost. Clinton encouraged economic bubbles and we built progressively larger bubbles in different sectors until we built what was then the mother of all bubbles...the dot com bubble. When the dot com bubble popped we had a real problem. We had a small bubble in real estate, but nothing near enough to provide the false growth we needed to continue pretending we were in OK shape.\n \n Greenspan had the answer. We crash interest rates well into negative territory and blow the RE bubble up. This was not an accident. This was not a matter of unintended consequences. We were on the brink of economic disaster and it was either take our medicine then or fake it for a while longer. The idea/fact that the low rates would lead to the mother of all bubbles in the RE sector was widely discussed...including in FOMC meetings. They opted to put the pain of the needed correction off a little while longer. \n \n Did they make the right choice then? I dont know. Looking at the following years there is no question that if they had not crashed interest rates and pushed us into a RE bubble we would have entered a DEPRESSION early in 2001 and would still be in it today. \n \n The problem with putting it off is that in order to keep the game going, every time we put it off we make it bigger and worse. Now we are looking at a bursting bubble that is several orders of magnitude bigger than the dot com bubble. It is impossible to build a new, bigger bubble to replace the RE bubble because our RE market is our biggest market. \n \n Currently our economy is roughly 80% services and government and 20% manufacturing and production. You cannot run an economy like that. It simply does not work. It is not possible to keep it up. \n \n So, now we are facing the mother of all corrections. If history is any guide (and it usually is) we will end up seeing up to 70% of our jobs vanishing. Economists have started arguing which order the deflation and inflation is going to occur. There is no longer discussion about whether we are in a recession or not, the question is when the depression will start and whether or not we will survive it as a cohesive nation.\n \n None of this is the result of the housing bubble. It it just the latest link in the chain.", 
   {}, 
   326055, 
   null, 
   1223002200.0
  ], 
  [
   326144, 
   null, 
   "Another opinion", 
   "The problem here is that you are both assuming that the housing meltdown is the problem. It is not. The housing meltdown is a symptom of the problem. \n \n The problem started way back in the 60's. US manufacturing started to slow down and we started shifting more to a service based economy. The further the gap grew between manufacturing and services, the more problems we had and at a time when we should have been cutting back on government spending we were increasing it.\n \n Finally things kind of came to a head. The bank of england showed up with a bunch of dollars and wanted to exchange it for gold. We had over run our printing presses by a WIDER margin and could not redeem those bills, so Nixon chose to take us off the gold standard rather than throw us into a nasty recession. That was the first time in the current long range cycle that a president basically chose to put off the correction.\n \n He did not kill the correction, though, he just threw us into a stagflationary situation that lasted for a decade. \n \n When Reagan was elected, he was looking for a way to bolster the economy...real or not. The Reagan administration basically opted for tax cuts and MASSIVE government spending increases. IT worked....the massive government spending gave us an entire decade of false economic growth and we were into the bubble economy. The bubbles actually served a necessary function since they helped soak up some of the MASSIVE amounts of money that was being printed and provided, to some extent, a rational for the wealth.\n \n Bush sr actually tried to get us on the right track. Unlike Reagan who talked about the evils of big government and talked about how \"I am from the government and am here to help\" was a scary phrase and then increased the size and spending of the government at unprecedented levels, Bush actually was trying to look out for our economic well being. When the Bush (1) administration saw bubbles forming, they moved in to pop them.\n \n Unfortunately economic decline is a bad platform to run on so he lost. Clinton encouraged economic bubbles and we built progressively larger bubbles in different sectors until we built what was then the mother of all bubbles...the dot com bubble. When the dot com bubble popped we had a real problem. We had a small bubble in real estate, but nothing near enough to provide the false growth we needed to continue pretending we were in OK shape.\n \n Greenspan had the answer. We crash interest rates well into negative territory and blow the RE bubble up. This was not an accident. This was not a matter of unintended consequences. We were on the brink of economic disaster and it was either take our medicine then or fake it for a while longer. The idea/fact that the low rates would lead to the mother of all bubbles in the RE sector was widely discussed...including in FOMC meetings. They opted to put the pain of the needed correction off a little while longer. \n \n Did they make the right choice then? I dont know. Looking at the following years there is no question that if they had not crashed interest rates and pushed us into a RE bubble we would have entered a DEPRESSION early in 2001 and would still be in it today. \n \n The problem with putting it off is that in order to keep the game going, every time we put it off we make it bigger and worse. Now we are looking at a bursting bubble that is several orders of magnitude bigger than the dot com bubble. It is impossible to build a new, bigger bubble to replace the RE bubble because our RE market is our biggest market. \n \n Currently our economy is roughly 80% services and government and 20% manufacturing and production. You cannot run an economy like that. It simply does not work. It is not possible to keep it up. \n \n So, now we are facing the mother of all corrections. If history is any guide (and it usually is) we will end up seeing up to 70% of our jobs vanishing. Economists have started arguing which order the deflation and inflation is going to occur. There is no longer discussion about whether we are in a recession or not, the question is when the depression will start and whether or not we will survive it as a cohesive nation.\n \n None of this is the result of the housing bubble. It it just the latest link in the chain.\n\n I agree with you that our economy has often been temporarily accelerated by false bubbles that subsequently burst for a variety of reasons (overestimation of future markets, bubbles that are dependent on government spending that later dries up, etc.). The housing bubble may be similar. However, don't you agree that regulation could have prevented this bubble from bursting as badly? After all, people generally only default on mortgages if they can no longer afford them. Predatory lending practices were highly responsible for so many of these loans going bad - at least that seems to be the general conclusion that I am reading in the press, both from economists and politicians.\n \n By the way, can you provide any links from reputable economic sources that support some of the most dire predictions you mention?", 
   {}, 
   326084, 
   null, 
   1223050680.0
  ], 
  [
   327905, 
   null, 
   "CUNxTime", 
   "Odd how you missed listing Reagan, H.W. Bush, and W. Bush in your history of presidents who had the opportunity to fix this before it all melted down. You list Carter (1 term) and Clinton (2 terms) as the ones at fault for the current crisis, yet they only served a combined 12 years, whereas the Republicans listed above were in charge for a combined 20.\n \n Carter may have started it, but why didn't Reagan or Bush 1 fix it? Clinton may have expanded it, but why didn't Bush 2 fix it? You're putting the blame on one party and giving the other a free pass.\n\n \n Let me take this one...\n \n When Reagan and H.w. Bush were Pres. the legislature was Dem. When the Legislation was Pub. the Pres. was Clinton.\n \n The crisis was caused by people buying homes they couldn't afford. Who claims to be the champion of people without money? The Dems.!!! I don't see how anyone could not see that this is a Democrat/Acorn caused problem right from the start!!!", 
   {}, 
   325106, 
   null, 
   1224009660.0
  ], 
  [
   327957, 
   null, 
   "Another opinion", 
   "Let me take this one...\n \n When Reagan and H.w. Bush were Pres. the legislature was Dem. When the Legislation was Pub. the Pres. was Clinton.\n \n The crisis was caused by people buying homes they couldn't afford. Who claims to be the champion of people without money? The Dems.!!! I don't see how anyone could not see that this is a Democrat/Acorn caused problem right from the start!!!\n\n There are a few points that need to be made:\n \n 1) I have shown in various posts in this thread that BOTH Democrats and Republicans supported low-income home buying. This is supported on the Republican side at least by the Republican-started H.R. 1461 bill that supported the push for loans to low-income families, and by the statements I quoted from Bush in support of loans to low-income families.\n \n 2) The Reagan, H.W.Bush and Clinton years, as well as the later part of the W. Bush years all had mixed party affiliations between congress vs president. However, under most of W.Bush's presidency, both the presidency and congress were Republican, yet reform was not evident. \n \n 3) W. Bush not only did not help limit the number of bad loans or how they were regulated during his administration, he INCREASED the number of such unstable loans, while neglecting to exercise proper oversight. Indeed, according to the Washington Post article I referenced earlier in this thread, the number of such purchased sub-prime loans increased TEN-FOLD under the early years of his administration (from 2001 to 2004). So, under his presidency, and under a Republican Congress, the problem got TEN TIMES worse. That is quite significant. The problem wasn't nearly as large or evident in earlier years (Clinton and before). The housing bubble didn't start seriously growing until the Bush years - which was apparently convenient for his administration since it showed a growing economy, despite the fact that the growth was fueled by an unsustainable bubble. He probably hoped that the bubble would not burst until he was out of office so that it would be his successor that would be blamed, not him. \n \n 4) Both Republicans and Democrats tried to reform the system in a strong bipartisan house bill in 2005 but, according to the government records and to the Republican congressman Oxley who started the bill, Bush squashed the reforms since he was generally against government regulation and expected private regulation to work (we see how well that worked).", 
   {}, 
   327905, 
   null, 
   1224018600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  History matters.", 
  "url": "http://www.4forums.com/political/formal-open-debate/11641-history-matters.html", 
  "breadcrumbs": [
   "Formal Open Debate"
  ], 
  "id_number": 11641, 
  "discussion_files": [
   [
    "27858.html", 
    "http://www.4forums.com/political/formal-open-debate/11641-history-matters-print.html"
   ], 
   [
    "27859.html", 
    "http://www.4forums.com/political/formal-open-debate/11641-history-matters-3-print.html"
   ], 
   [
    "27860.html", 
    "http://www.4forums.com/political/formal-open-debate/11641-history-matters-2-print.html"
   ]
  ], 
  "identifier": 11641
 }
]