[
 [
  [
   325318, 
   null, 
   "GiantOreo", 
   "Recently saw this story on CNN who used a story from thier associates in Missouri (good old local abc news station back in Kansas City where I used to live): http://www.kmbc.com/health/17558129/detail.html\n \n \n \n \nDoctors said an 8-year-old girl would never see more than light and dark, but a Missouri family said seeing is believing. \n \n \n \n The family of Savannah Watring decided to take a chance on an experimental stem-cell procedure in China. \n \n \n \n \"I kept wondering if I'm doing the right thing. Being blind was her world. And I kept thinking, 'What if I'm doing wrong by taking her world from her?'\" grandmother Ravana Watring told KMBC's Bev Chapman. Savannah's grandmother, father and aunt took the 8-year-old for seven stem-cell infusions at a hospital in Quingdoa, China. \n \n The result is that Savannah can see. \n \n Doctors said it would take three to six months before they would see any change, but after Savannah's fourth treatment, something amazing happened in an elevator -- she saw herself for the first time. \n \n \"When Savannah was facing the mirror, she said, 'Hi.' Brent looked at me, and I looked at Brent. I didn't know whether to laugh or cry,\" Ravana Watring said. \n \n Now, Savannah is learning shapes, numbers and letters.\n\n \n \n \n and \nDoctors said Savannah's blindness was caused by a condition known as optic nerve hypoplasia. \n \n \n \n Insurance wouldn't pay for the experimental treatment, but the family received more than $50,000 from fundraisers to pay for the medical bills. \n \n \n \n Savannah will soon visit her eye doctor to measure her vision.\n\n \n \n \n It's wonderful that we as humans can do to help others through procedures like this. Very happy for this little girl.\n \n \n \n \n \n I am, however, astonished and outraged that our CITIZENS in the UNITED STATES have to go to CHINA to get a treatement like this to help them.\n \n \n \n It is absolutely disgusting what is happening to our country due to religious nuts/fundies who oppose stem cell research and various other advances in science. Sometimes I think they won't be happy until this country becomes a third world country at least techologically and scientifically.", 
   {
    "post_info": {
     "post_title": "Stem Cells Give a Young Blind Girl Sight"
    }
   }, 
   null, 
   null, 
   1222461720.0
  ], 
  [
   325324, 
   null, 
   "Colonel Ingus", 
   "Yep, all of those pompous self righteous anti-American right wingers would rather that she were suffering and blind. \n \n Once we get rid of bush and his nonsensical administration, maybe we can start to really help the handicapped in this country.", 
   {}, 
   325318, 
   null, 
   1222462200.0
  ], 
  [
   327893, 
   null, 
   "Ryuuichi", 
   "Yep. This is a good thing, might as well make use of a dead person. Too bad we can't experiment on dead human bodies w/o permission. It would benefit society a lot more if we could.", 
   {}, 
   325324, 
   null, 
   1224008700.0
  ], 
  [
   327910, 
   null, 
   "Lurch907", 
   "If you follow the link to the first article you will see that umbilical stem cells were used in the proceedure. Its very possible no abortion took place, although in China its hard to say. If there was an abortion there was not likely to be a \"choice\" involved.", 
   {}, 
   327893, 
   null, 
   1224010200.0
  ], 
  [
   333649, 
   null, 
   "Darn Republican", 
   "Where would you find such a preposterous abuse of objectivity in the name of \"science\" - and your point is? Fact is grant money isn't going to embryonic stem cell research because it hasn't yielded results favorable to the investment... now scientism on the other hand has an agenda in supporting the pro-choice contingent they don't care about objectivity, truth, right... wrong... evidence, fact, reason, common sense, clinical trials. All they care about is their agenda, abortion on demand. Thought I'd poke a hole the glass of Kool-Aid you folks are guzzling here:\n \n http://www.scienceblog.com/cms/blog/6934-stem-cell-research-the-next-four-years-under-barack-obama-17775.html\n \n http://www.lipinski.house.gov/index.php?option=com_content&task=view&id=611&Itemid=87", 
   {
    "post_info": {
     "post_title": "Of Course You Saw  A Story On CNN..."
    }
   }, 
   327910, 
   null, 
   1227242040.0
  ], 
  [
   333658, 
   null, 
   "Shooterandproud", 
   "Where would you find such a preposterous abuse of objectivity in the name of \"science\" - and your point is? Fact is grant money isn't going to embryonic stem cell research because it hasn't yielded results favorable to the investment... now scientism on the other hand has an agenda in supporting the pro-choice contingent they don't care about objectivity, truth, right... wrong... evidence, fact, reason, common sense, clinical trials. All they care about is their agenda, abortion on demand. Thought I'd poke a hole the glass of Kool-Aid you folks are guzzling here:\n \n Stem Cell Research - The Next Four Years Under Barack Obama | Science Blog\n \n Congressman Daniel Lipinski - (July 30, 2007) Adult Stem Cell Research Puts Patients First, Proponents Say\n\n \n Attending church cuts risk of death?\n \n Methinks your little website is biased.\n \n As for stem cell research, I am for whatever works best. We should not compromise on something worse than stem cells because of a moral issue. Stem cells are simply cells, nothing more. To suggest otherwise is ridiculous.\n \n However, if adult stem cells hold the key, and are more promising than embryotic stem cells, fine. Whatever works best, but this is not a moral debate. This is a science debate. To suggest this has something to do with advocating for a woman's right to abortion is absurd. This is about helping people only, born people. Real people.", 
   {}, 
   333649, 
   null, 
   1227249000.0
  ], 
  [
   333659, 
   null, 
   "Colonel Ingus", 
   "Fact is grant money isn't going to embryonic stem cell research because it hasn't yielded results favorable to the investment.\n\n That's only true because of the bonehead in the whitehouse. Once bush leaves you will see a lot of great things becoming reality through embryonic stem cell research emoticon_xgood", 
   {}, 
   333649, 
   null, 
   1227249180.0
  ], 
  [
   333660, 
   null, 
   "Darn Republican", 
   "Whatever works best, but this is not a moral debate. This is a science debate. To suggest this has something to do with advocating for a woman's right to abortion is absurd. This is about helping people only, born people. Real people.[/QUOTE]", 
   {}, 
   333658, 
   null, 
   1227249540.0
  ], 
  [
   333661, 
   null, 
   "Darn Republican", 
   "Whatever works best, but this is not a moral debate. This is a science debate. \n\n \n That's right... and embryonic stem cell research is not getting funded. It is adult stem cell research that is garnering the funding. The only one's with their hands still stuck out looking for money are the fringe elements still thinking they are going to get public support for it. They are decieved... it is only adult stems cell research that has proved to work the best for humans. But you are wrong in thing you can rinse everyone off with the \"science\" aregument... true science shuts you down. Pseudo science is the only one trying to cajole people into thinking that they are actually true objective science, when it is nothing but scientism.\n \n \n \nTo suggest this has something to do with advocating for a woman's right to abortion is absurd.\n \n \n \n That is exactly what it is... to deny it is blind. True science would have an opinion because that is not what science is for - for your \"science\" to suddenly weigh in reveals its agenda.\n \n \n \n \nThis is about helping people only, born people. Real people.\n\n \n \n Sure, I'll buy that... along with same-sex marriage being healthy for America, and assisted suicide, along with the so-called \"separation of church and state\" being factual. \n \n Not. all embryonic stem cell research is scienctism coming to chime in the abortion argument and nothing more. The insidous aspect to it is.. they expect to just bend a knee to their \"findings\" as \"fact\"... when this is a very tough issue and clearly some bioethical guidelines need to be established. But the ones set so far seem to be working... without embryonic stem cells", 
   {}, 
   333658, 
   null, 
   1227250440.0
  ], 
  [
   333662, 
   null, 
   "Darn Republican", 
   "That's only true because of the bonehead in the whitehouse. Once bush leaves you will see a lot of great things becoming reality through embryonic stem cell research emoticon_xgood\n\n \n \n No we won't... we'll see the new bonehead you elected will attempt to overturn Bush's veto. I doubt that will happen - Good things are happening with adult stem cell research, not embryonic stem cells... so nice try.", 
   {}, 
   333659, 
   null, 
   1227250680.0
  ], 
  [
   333666, 
   null, 
   "Shooterandproud", 
   "That's right... and embryonic stem cell research is not getting funded. It is adult stem cell research that is garnering the funding. The only one's with their hands still stuck out looking for money are the fringe elements still thinking they are going to get public support for it. They are decieved... it is only adult stems cell research that has proved to work the best for humans.\n\n \n Fine.\n \n \nBut you are wrong in thing you can rinse everyone off with the \"science\" aregument... true science shuts you down. Pseudo science is the only one trying to cajole people into thinking that they are actually true objective science, when it is nothing but scientism.\n\n \n Who are you to determine which science is good enough and which isn't?\n \n \n \n \nThat is exactly what it is... to deny it is blind. True science would have an opinion because that is not what science is for - for your \"science\" to suddenly weigh in reveals its agenda.\n\n \n Lol, I got a kick out of this one. So because a certain type of science does not conform to your Conservative morals its a front for an unrelated political agenda? Wow.\n \n \n \n \n \nSure, I'll buy that... along with same-sex marriage being healthy for America, and assisted suicide, along with the so-called \"separation of church and state\" being factual.\n \n \n Yup, that's pretty much it. Studies show nothing wrong with same sex marriage, and assisted suicide is the moral thing to do in cases of extreme pain. And to deny separation of church and state is like denying free speech, although I shouldn't speak too soon. I don't even think some of our most fundamental amendments are safe from the Conservative fundies.\n \n \nNot. all embryonic stem cell research is scienctism coming to chime in the abortion argument and nothing more. The insidous aspect to it is.. they expect to just bend a knee to their \"findings\" as \"fact\"... when this is a very tough issue and clearly some bioethical guidelines need to be established. But the ones set so far seem to be working... without embryonic stem cells\n\n \n Ooo, this is a tough one. Who to believe, a Christian right-winger or people who have degrees in science. Jeez I dunno. You got me.", 
   {}, 
   333661, 
   null, 
   1227252900.0
  ], 
  [
   333671, 
   null, 
   "Archangel", 
   "That's only true because of the bonehead in the whitehouse. Once bush leaves you will see a lot of great things becoming reality through embryonic stem cell research emoticon_xgood\n\n \n This process doesn't use embryonic stem cells, the procedure uses umbilical cord-blood stem cells. Stem cells are harvested from the umbilical cord of a newborn, and transplanted into the patient.\" I personally don't see that as a moral issue or problem at all. This link also has a video so you can meet the little girl and her family. I hope her vision continues to improve beyond what it currently is which you'll get a feel for from the video. \n \n purple medical blog: VIDEO CAN STEM CELL THERAPY IN CHINA PARTIALLY RESTORE VISION TO BLIND CHILDREN SOME FAMILIES SAY MAYBE BUT SOME AMERICAN DOCTORS QUESTION HOW AND WHY", 
   {}, 
   333659, 
   null, 
   1227256200.0
  ], 
  [
   333680, 
   null, 
   "Darn Republican", 
   "Who are you to determine which science is good enough and which isn't?\n\n \n \n funny you should ask... you'd be foolish enough to cower under the letters behind someones name without taking them to task over the impact of their so called finding. Science doen't run our government, science doesn't run our lives. I have all the authority to dismiss what I know is riddled with partisan rhetoric and which ones may have a positive effect for society as a whole, that's who has the authoruty. \n \n \n \n \n \n \nLol, I got a kick out of this one. So because a certain type of science does not conform to your Conservative morals its a front for an unrelated political agenda? Wow.\n\n \n \n I didn't know if you were aware of those because you are so incredibly and deeply blinded by your lifestyle choices but true science unvarnished tends to affirm the Christian's claim of the accuracy of the Bibles claim if God in nature and the overwhelming evidence in nature that exists, but I wasn't speaking on matters of personal spiritual choice so here we go again with you trying to leverage the conversation to your fundamental angst toward religiosity of any type - not considering your talking point to a religious argument themselves, yes... disbelief is a faith to, you put all your faith in disbelieving but that is another topic.\n \n \n \n \n \nYup, that's pretty much it. Studies show nothing wrong with same sex marriage, and assisted suicide is the moral thing to do in cases of extreme pain. And to deny separation of church and state is like denying free speech, although I shouldn't speak too soon. I don't even think some of our most fundamental amendments are safe from the Conservative fundies.\n\n \n \n Well, that's pretty much it, to you. Studies that claim there is no negative effect on society are incredulous to start... and rail against known studies [many I have posted and well as others] that came from not only credible studies... have been going on for some time. For you to advocate something is constitutional when the language doesn't exit is enough to conversationally dismiss you right there. Your ignorance is stunning but not suprising... you cower behind what you believe of the 1st. amendment to say and project any behavior you wish... you are wrong there too. Free speech doesn't even grant you the license you claim. I guess you aren't liberals for nothing huh? No laws are safe with a liberal mind... because the liberal mind in not bound by principle and reason... by what is convenient for it.\n \n \n \n \nOoo, this is a tough one. Who to believe, a Christian right-winger or people who have degrees in science. Jeez I dunno. You got me.\n\n \n \n That is your problem, if all a liberal scientists degree can produce is a blind advocation of lifestyle in the name of science... it is science I ignore, and is nothing more than a nutter pedigree. I could care less because it has been revealed what he advocates... \"in the name of science\" - wow, minds like your are so easy to your with. All I have to say \"science said it huh? and you believe it... so let me go figure here, trust objective conclusions based on objectivity and reasonable conclusions, or because George Sorus was going to fund it, and there's a judge on a bench that will swing my way if need be?\n \n Surely.. you jest...", 
   {}, 
   333666, 
   null, 
   1227284040.0
  ], 
  [
   333682, 
   null, 
   "Darn Republican", 
   "The problem is how the left brings the subject up, you never hear them present which type of \"stem cell\" research they want to advocate... it is this undermined co-opting of the title as cover what what most have denounced in the perpetuation of the ESC research, over what has actually been working. ESC is nothing more than a shameless advocation of abortion... and nothing more, but id they can blur the lines [so to speak] they can get in into the argument that way even as intensionally divisive as that is - that is how their minds work.", 
   {
    "post_info": {
     "post_title": "Archie..."
    }
   }, 
   333680, 
   null, 
   1227284400.0
  ], 
  [
   333892, 
   null, 
   "Shooterandproud", 
   "funny you should ask... you'd be foolish enough to cower under the letters behind someones name without taking them to task over the impact of their so called finding. Science doen't run our government, science doesn't run our lives. I have all the authority to dismiss what I know is riddled with partisan rhetoric and which ones may have a positive effect for society as a whole, that's who has the authoruty.\n\n \n You have the right to dismiss anything. I have the right to laugh at your stupidity of dismissing the truth simply because it makes you uncomfortable.\n \n \n \n \nI didn't know if you were aware of those because you are so incredibly and deeply blinded by your lifestyle choices\n\n \n What \"lifestyle choices\"?\n \n \nbut true science unvarnished tends to affirm the Christian's claim of the accuracy of the Bibles claim if God in nature and the overwhelming evidence in nature that exists,\n\n \n You should do stand up. Really, this is just too funny.\n \n \nbut I wasn't speaking on matters of personal spiritual choice so here we go again with you trying to leverage the conversation to your fundamental angst toward religiosity of any type - not considering your talking point to a religious argument themselves, yes... disbelief is a faith to, you put all your faith in disbelieving but that is another topic.\n\n \n Oh here we go with the \"my religion is better than yours\". I have heard that so many times, yet not one shred of evidence has been provided to support it.\n \n \n \n \n \n \nWell, that's pretty much it, to you. Studies that claim there is no negative effect on society are incredulous to start... and rail against known studies [many I have posted and well as others] that came from not only credible studies... have been going on for some time.\n\n \n Again, just because some truths make you uncomfortable does not automatically make them false.\n \n \nFor you to advocate something is constitutional when the language doesn't exit is enough to conversationally dismiss you right there. Your ignorance is stunning but not suprising... you cower behind what you believe of the 1st. amendment to say and project any behavior you wish... you are wrong there too. Free speech doesn't even grant you the license you claim. I guess you aren't liberals for nothing huh? No laws are safe with a liberal mind... because the liberal mind in not bound by principle and reason... by what is convenient for it.\n\n \n Jeez, I though you were just your garden variety republican, not an anti-American totalitarian. Not even the most foolish of the foolish would claim that free speech only applies when the government feels like it, or even worse, denial of the separation of church and state. I'm surprised.\n \n \n \n \n \nThat is your problem, if all a liberal scientists degree can produce is a blind advocation of lifestyle in the name of science... it is science I ignore, and is nothing more than a nutter pedigree. I could care less because it has been revealed what he advocates... \"in the name of science\" - wow, minds like your are so easy to your with. All I have to say \"science said it huh? and you believe it... so let me go figure here, trust objective conclusions based on objectivity and reasonable conclusions, or because George Sorus was going to fund it, and there's a judge on a bench that will swing my way if need be?\n\n \n Lol, so let me get this straight. You think that because something (science) has been tested and proven, it is automatically false. But something like the bible which has next to no evidence to support it must be true. You never cease to entertain me.\n \n \n \nSurely.. you jest...\n\n \n Again, bravo! Great retort!", 
   {}, 
   333680, 
   null, 
   1227429420.0
  ], 
  [
   333911, 
   null, 
   "simone", 
   "Where would you find such a preposterous abuse of objectivity in the name of \"science\" - and your point is? Fact is grant money isn't going to embryonic stem cell research because it hasn't yielded results favorable to the investment... now scientism on the other hand has an agenda in supporting the pro-choice contingent they don't care about objectivity, truth, right... wrong... evidence, fact, reason, common sense, clinical trials. All they care about is their agenda, abortion on demand. Thought I'd poke a hole the glass of Kool-Aid you folks are guzzling here:\n \n Stem Cell Research - The Next Four Years Under Barack Obama | Science Blog\n \n Congressman Daniel Lipinski - (July 30, 2007) Adult Stem Cell Research Puts Patients First, Proponents Say\n\n Hmm, I wonder why Asian scientists and businesses are going so great guns into emryonic stem cell research?\n \n Those folks in Asia seem to be lots smarter in business than we Americans -- as witnessed by the number of Asian-made cars and other products that are purchased all over the world.", 
   {}, 
   333649, 
   null, 
   1227462000.0
  ], 
  [
   333913, 
   null, 
   "Darn Republican", 
   "Hmm, I wonder why Asian scientists and businesses are going so great guns into emryonic stem cell research?\n \n Those folks in Asia seem to be lots smarter in business than we Americans -- as witnessed by the number of Asian-made cars and other products that are purchased all over the world.\n\n \n \n Isn't it a little early to be dissident? Besides being completely irrelevant to the thread... you of course realize they aren't governed by our laws, conversely - we are not governed by theirs. Secondly, don't make intelligence arguments based political and economic arguments you are probably clueless on. It is minds like yours in the unions and in congress that have made it virtually impossible to compete. The Japanese don't have unions, the Germans don't have unions driving the cost of our cars up an average of $1400.00 per vehicle... that makes all the difference, especially in a tightening economy bought on by the same stupidity. You know those old adage's like \"look before you leap\" ? You might consider them before you run your mouth.", 
   {
    "post_info": {
     "post_title": "Simone...."
    }
   }, 
   333911, 
   null, 
   1227462540.0
  ], 
  [
   333918, 
   null, 
   "Archangel", 
   "Hmm, I wonder why Asian scientists and businesses are going so great guns into emryonic stem cell research?\n \n Those folks in Asia seem to be lots smarter in business than we Americans -- as witnessed by the number of Asian-made cars and other products that are purchased all over the world.\n\n \n Are you aware that Unions are illegal in Japan? They keep costs down by limiting what they pay their auto makers. Even the executives make a pittance compared to American CEOs. And as for China, do you want our Government arresting people who disagree with human slavery and placing them in work camps/factories for years in order to make products for no pay which the Government sells all over the world? \n \n Are you aware that China determines how many new workers they need each year in order to maintain production schedules, they they send their military police out to arrest the needed number of people on any trumped up charges necessary to fill the quota for free human labor? Do you even care about that with your blind liberal sensibilities?\n \n Are you aware that every prisoner in every chinese prison makes something which you personally consume, whether you're aware of it or not? And do you care about that? Is that what you consider being much smarter in business than we are? You go ahead and keep defending the countries which practice this work ethic simone, and one of these days they'll be your boss also.", 
   {}, 
   333911, 
   null, 
   1227465480.0
  ], 
  [
   333932, 
   null, 
   "Shooterandproud", 
   "Are you aware that Unions are illegal in Japan? They keep costs down by limiting what they pay their auto makers. Even the executives make a pittance compared to American CEOs. And as for China, do you want our Government arresting people who disagree with human slavery and placing them in work camps/factories for years in order to make products for no pay which the Government sells all over the world? \n \n Are you aware that China determines how many new workers they need each year in order to maintain production schedules, they they send their military police out to arrest the needed number of people on any trumped up charges necessary to fill the quota for free human labor? Do you even care about that with your blind liberal sensibilities?\n \n Are you aware that every prisoner in every chinese prison makes something which you personally consume, whether you're aware of it or not? And do you care about that? Is that what you consider being much smarter in business than we are? You go ahead and keep defending the countries which practice this work ethic simone, and one of these days they'll be your boss also.\n\n \n One of the few occasions I agree with archie. I don't know about Japan, but China benefits off of exploiting its own people. I don't agree with that.", 
   {}, 
   333918, 
   null, 
   1227475620.0
  ], 
  [
   333957, 
   null, 
   "Joel_Henderson", 
   "Yep. This is a good thing, might as well make use of a dead person. Too bad we can't experiment on dead human bodies w/o permission. It would benefit society a lot more if we could.\n\n \n And LIVING ones even more... ok Adolph.", 
   {}, 
   327893, 
   null, 
   1227489900.0
  ], 
  [
   333958, 
   null, 
   "Joel_Henderson", 
   "One of the few occasions I agree with archie. I don't know about Japan, but China benefits off of exploiting its own people. I don't agree with that.\n\n \n Do you agree with the federal government dictating the law to sovereign nations, like it does now?", 
   {}, 
   333932, 
   null, 
   1227490080.0
  ], 
  [
   333960, 
   null, 
   "Joel_Henderson", 
   "Hmm, I wonder why Asian scientists and businesses are going so great guns into emryonic stem cell research?\n \n Those folks in Asia seem to be lots smarter in business than we Americans -- as witnessed by the number of Asian-made cars and other products that are purchased all over the world.\n\n \n \n Things are SELDOM what they seem; you simply see richest and most educated Asians-- i.e. the ruling elite; meanwhile the other 2 billion don't know enough to come in from the Tsunami (partially because their governments didn't think it worth investing $20 million for an early-warning system, in order to prevent the loss of over 200,000 lives and $4 billion in damage; however that didn't stop them from begging the West for a handout, most of which WENT to the ruling elite in government).\n \n It's a FACT that Asian lands are aristocracies, where the lands are owned by the ruling elite familes-- no matter HOW much they pretend to \"democracy.\"\n If you think dictatorship is \"smart,\" you need to think again.", 
   {}, 
   333911, 
   null, 
   1227490380.0
  ], 
  [
   333962, 
   null, 
   "Shooterandproud", 
   "Do you agree with the federal government dictating the law to sovereign nations, like it does now?\n\n \n Not quite sure what you mean. Do you have an example?", 
   {}, 
   333958, 
   null, 
   1227490800.0
  ], 
  [
   334057, 
   null, 
   "simone", 
   "Are you aware that Unions are illegal in Japan? They keep costs down by limiting what they pay their auto makers. Even the executives make a pittance compared to American CEOs. And as for China, do you want our Government arresting people who disagree with human slavery and placing them in work camps/factories for years in order to make products for no pay which the Government sells all over the world? \n \n Are you aware that China determines how many new workers they need each year in order to maintain production schedules, they they send their military police out to arrest the needed number of people on any trumped up charges necessary to fill the quota for free human labor? Do you even care about that with your blind liberal sensibilities?\n \n Are you aware that every prisoner in every chinese prison makes something which you personally consume, whether you're aware of it or not? And do you care about that? Is that what you consider being much smarter in business than we are? You go ahead and keep defending the countries which practice this work ethic simone, and one of these days they'll be your boss also.\n\n The manufacturing structure in Japan is far different from that in the U.S. I don't pretend to understand the Japanese model but I believe that workers may be so well-treated in Japan that they don't need unons.\n \n It must be remembered that unions arose in capitalist America and Europe because of the incredible need to protect workers from the predations of those who hired them.\n \n Furthermore, I believe there is also a different model of health care delivery in Japan which makes it unnecessary for employers to provide health care in their hiring packages.\n \n Very possibly, the Japanese have a superior model when one compares how the Japanese model works to the American model.", 
   {}, 
   333918, 
   null, 
   1227555840.0
  ], 
  [
   334059, 
   null, 
   "Ryuuichi", 
   "And LIVING ones even more... ok Adolph.\n\n \n You just had to bring Godwin into didn't you. <_< \n \n Besides what good is a corpse? Nevermind you're never going to understand my logic so I might as well not waste the time.", 
   {}, 
   333957, 
   null, 
   1227555960.0
  ], 
  [
   342167, 
   null, 
   "pro-con", 
   "Even be for a baby leaves its mothers womb its alive. it has a heart beat!!! And some people think its ok to kill a baby because it has not left its womb yet!!!!!!emoticon_xbangheadxbanghead:xbanghead\n \n Its not ok!!", 
   {}, 
   334059, 
   null, 
   1233169200.0
  ], 
  [
   342192, 
   null, 
   "simone", 
   "What the devil are you talking about?\n \n Who the Hades wants to kill babies?\n \n Why are you so hysterical?", 
   {}, 
   342167, 
   null, 
   1233173940.0
  ], 
  [
   342199, 
   null, 
   "Colonel Ingus", 
   "And some people think its ok to kill a baby because it has not left its womb yet\n\n You think that's bad, some people are so ignorant that they think that it's a \"baby\" while still in the womb emoticon_rolleyes", 
   {}, 
   342167, 
   null, 
   1233175800.0
  ], 
  [
   342203, 
   null, 
   "Another opinion", 
   "Fact is grant money isn't going to embryonic stem cell research because it hasn't yielded results favorable to the investment... now scientism on the other hand has an agenda in supporting the pro-choice contingent they don't care about objectivity, truth, right... wrong... evidence, fact, reason, common sense, clinical trials. All they care about is their agenda, abortion on demand. Thought I'd poke a hole the glass of Kool-Aid you folks are guzzling here:\n \n Stem Cell Research - The Next Four Years Under Barack Obama | Science Blog\n \n Congressman Daniel Lipinski - (July 30, 2007) Adult Stem Cell Research Puts Patients First, Proponents Say\n\n The only arguement I hear from these links against embryonic stem cell research is that, in ten years, it hasn't yielded sufficient results for human trials. If that is your only arguement against its scientific viability then it is a weak one. Many technologies, biological ones included, can take a long time to develop. \n \n Certainly, the adult repair stem cells that are mentioned in your articles may have their uses and sound as if they also deserve research money. However, one cannot just listen to one side of the story to make a decision. The scientists researching repair stem cells, patients who benefited from them, and doctors who use them are obviously going to sing its praises when it does introduce some gain. However, the embryonic stem cells might have even more potential, given the time and money to develop the technology.\n \n So, unless you can show me evidence that embryonic stem cells will never achieve their potential or that repair stem cells can achieve everything that embryonic stem cells are hoped to achieve, then your arguement against embryonic stem cell research continues to be unconvincing.", 
   {}, 
   333649, 
   null, 
   1233177060.0
  ], 
  [
   342271, 
   null, 
   "Archangel", 
   "The manufacturing structure in Japan is far different from that in the U.S. I don't pretend to understand the Japanese model but I believe that workers may be so well-treated in Japan that they don't need unons.\n \n It must be remembered that unions arose in capitalist America and Europe because of the incredible need to protect workers from the predations of those who hired them.\n \n Very possibly, the Japanese have a superior model when one compares how the Japanese model works to the American model.\n\n \n You're right about one thing simone, you don't have a clue regarding the Japanese model. Here are some facts to enlighten you.\n Japan: Get a life \n By Scott North \n \n Speaking Freely is an Asia Times Online feature that allows guest writers to have their say. Please click here if you are interested in contributing. \n \n OSAKA - The student sat in my office and explained her boyfriend's plight. Fresh out of university, he started working for a trading company in April. She said she thought it was customary\n \n for such workers to come home on the last train each night. To me that sounded bad. But it was actually worse: he was often coming back by taxi at 3am or 4am. His boss took the first train in each morning and the last train back each night: an 18-hour day. The night before she came to see me, the boyfriend got only an hour's sleep because he was preparing to accompany the boss on a business trip the next day. I wondered how sharp he could possibly be on only an hour's rest. \n \n Well, I said, at least he's collecting lots of overtime pay. But the student told me that despite working such long hours, the boyfriend said he'd have to wait a couple years to submit requests for overtime pay. That sounded so strange I was afraid I had misunderstood. But no: he was waiting to learn from his senpai (senior person) when it is appropriate to file for overtime pay, and how many hours it is permissible to request. \n \n The premise is that new employees have no right to be paid overtime because they are not yet competent, and the incompetent cannot claim overtime pay because their overwork is due only to their incompetence. The young man was taking his cues from workers two years or so his senior. They were just filing their first overtime claims. \n \n Another attempt to amend the Labor Standards Law to broaden the category of Japanese workers who are not subject to regulations concerning working hours and overtime pay will likely be made after the July election. Nippon Keidanren, the powerful business federation, talks of exempting white-collar workers who make more than 4 million yen (US$32,880) per year. But long work hours and unpaid overtime are already a reality for many Japanese workers regardless of their collar color, employment status, or salary level. \n \n When workers cannot demand what is legally theirs, then the corporate culture, the strategies for organizing the social activity of the workplace, need to be examined. The young man understood that refraining from filing overtime claims is a stage in his corporate socialization. Rather than brainwashing, the culprit is a none-too-subtle regime of institutionalized, generational intimidation. Advancing in step with performance evaluations or merit-based pay, the practices that produce overwork and work stress are intensifying in Japan. \n \n In 1995, Japanese workers or their surviving families filed just over 500 applications for worker compensation due to karoshi (death from overwork), and 76 were recognized. There were 1,757 claims filed last year for death or major depression caused by overwork. Only 560 were approved, including 66 for suicide or attempted suicide, and 355 for circulatory ailments such as stroke and heart disease. Nearly all the recognized claims concerned men (94%). The majority of claims for psychological problems, including suicides, concerned men in their 30s. Recognized claims for psychological distress caused by work increased 61.4% over 2005. Because of revisions in the standards for recognizing these claims, we can expect to see further increases in the number of claims recognized in the future.\n \n Companies cite intense competition as the reason for long hours. To attract investors, companies compete to cut labor costs. They use as few workers as possible, and unscrupulous firms try to keep as many hours as possible off the books. The declining number of full-time, regular positions, especially at the middle-management levels, has increased competition for them among workers. So fewer workers are bearing heavier loads, in greater isolation, and with less cooperation from their co-workers. In lieu of overtime pay, some service-industry workers are given titles and small management stipends, and then forced to work so many hours that their total hourly compensation falls below Japan's minimum wage. This gives rise to the psychological stress reflected in the recent karoshi statistics. \n Asia Times Online :: Japan News - Japan's poor work-life choices\n \n As you can see, Corporations who's main goal is profits will cut costs anywhere they can. And if using strong arm tactics like threatening one employee that if he wont work overtime for free, then another surely will, and get away with it, then they will do it no matter what Country it is. But rather than recognize the incredibly high suicide rate they have, you just assume they treat their employees better than American companies.", 
   {}, 
   334057, 
   null, 
   1233251580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Stem Cells Give a Young Blind Girl Sight", 
  "url": "http://www.4forums.com/political/abortion-debates/11648-stem-cells-give-young-blind-girl-sight.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 11648, 
  "discussion_files": [
   [
    "30182.html", 
    "http://www.4forums.com/political/abortion-debates/11648-stem-cells-give-young-blind-girl-sight-print.html"
   ], 
   [
    "30183.html", 
    "http://www.4forums.com/political/abortion-debates/11648-stem-cells-give-young-blind-girl-sight-2-print.html"
   ]
  ], 
  "identifier": 11648
 }
]