[
 [
  [
   325542, 
   null, 
   "Ethmi", 
   "Seriously... do you think that Obama can negotiate with a guy who habitually refers to America as \"The more distinquished among the devilish\"(commonly misinterpreted as the more abrupt \"Great Satan\")? Do you think he could negotiate one who is so hate-filled that he openly vowed to destroy Israel? emoticon_wow This guy really does think we live in a world of sunshine and rainbows, doesn't he?", 
   {
    "post_info": {
     "post_title": "Obama Wants Meeting With Ahmadinejad"
    }
   }, 
   null, 
   null, 
   1222658880.0
  ], 
  [
   325543, 
   null, 
   "Bassman", 
   "Any meeting with Imawhackjob is doomed to failure unless it's to tell him that unless he stands down, we shove a Minuteman ICBM in a place of his that wasn't designed for said weapon. Obama is just too much a pacifist to be of any real good! And BTW, Obama truly is too naive.", 
   {}, 
   325542, 
   null, 
   1222660500.0
  ], 
  [
   325552, 
   null, 
   "Jo Bennett", 
   "Ahmadinejad didn't say he was going to destroy Israel. And so what if he uses confrontational rehtoric, he has to get elected to same as any other politician, and Iranian conservatives react about as well to the softly-softly approach as Republicans do.", 
   {}, 
   325543, 
   null, 
   1222670880.0
  ], 
  [
   325585, 
   null, 
   "isly ilwott", 
   "Ahmadinejad didn't say he was going to destroy Israel. And so what if he uses confrontational rehtoric, he has to get elected to same as any other politician, and Iranian conservatives react about as well to the softly-softly approach as Republicans do.\nThis has little to do with the naivete of the inexperienced one, Barack Obama. He is wet behind the ears yet...totally incompetent to deal with people like those that Iran and other ME tribal-warfare, 14th century mentality nations can throw in his face.\n \n I do believe the Irate Iranian has called for the total destruction of Israel. Your pointing out that he may have not said specifically that he is going to do it means nothing at all.", 
   {}, 
   325552, 
   null, 
   1222711260.0
  ], 
  [
   325596, 
   null, 
   "isly ilwott", 
   "Obama lied again when he said Kissinger would approve of his plan to meet with the sick one.\n \n http://www.newsmax.com/insidecover/kissinger_obama_iran/2008/09/28/135207.html?s=sp&promo_code=6BBD-1\n \n \n Obama, the inexperienced one would not last five minutes with the sick one. I'm beginning to believe that Barack Hussein Obama sees himself as an irresistable saviour that can control all others, whether sane or not, with his charismatic show of teeth and gums.\n \n What is scary is that there appear to be others who share his naivete. Obama is totally incompetent and a complete political sham.", 
   {
    "post_info": {
     "post_title": "Don't mess with Kissinger..."
    }
   }, 
   325585, 
   null, 
   1222714980.0
  ], 
  [
   325597, 
   null, 
   "Ethmi", 
   "Ahmadinejad didn't say he was going to destroy Israel. And so what if he uses confrontational rehtoric, he has to get elected to same as any other politician, and Iranian conservatives react about as well to the softly-softly approach as Republicans do.\n\n \n Is that so?", 
   {}, 
   325552, 
   null, 
   1222715400.0
  ], 
  [
   325639, 
   null, 
   "isly ilwott", 
   "Is that so?\nI realize how silly Jo's statement is. However, those who parse words may say he's entirely correct in what he said. He said that the Iranian idiot did not say he was going to wipe Israel off the map...he just said that it must be done. Not volunteering his own services is as good to Jo Bennett as not having said he would do it.", 
   {}, 
   325597, 
   null, 
   1222733280.0
  ], 
  [
   325664, 
   null, 
   "Ethmi", 
   "I realize how silly Jo's statement is. However, those who parse words may say he's entirely correct in what he said. He said that the Iranian idiot did not say he was going to wipe Israel off the map...he just said that it must be done. Not volunteering his own services is as good to Jo Bennett as not having said he would do it.\n\n \n This is more in response to Jo than to you. Are you familiar with the redneck \"Get 'er done!\" attitude?", 
   {}, 
   325639, 
   null, 
   1222744860.0
  ], 
  [
   325680, 
   null, 
   "Jo Bennett", 
   "Is that so?\n\n \n The phrase has been mistranslated. He was talking about hoping for a change of regime, much as every world leader does (even if their targets are different).\n http://en.wikipedia.org/wiki/Mahmoud_Ahmadinejad_and_Israel#.22Wiped_off_the_map.22_or_.22Vanish_from_the_pages_of_time.22_translation", 
   {}, 
   325597, 
   null, 
   1222754520.0
  ], 
  [
   325682, 
   null, 
   "Archangel", 
   "The phrase has been mistranslated. He was talking about hoping for a change of regime, much as every world leader does (even if their targets are different).\n http://en.wikipedia.org/wiki/Mahmoud_Ahmadinejad_and_Israel#.22Wiped_off_the_map.22_or_.22Vanish_from_the_pages_of_time.22_translation\n\n \n Great Jo, from your link.\n The translation presented by IRIB has been challenged by Mr. Arash Norouzi, who proposes that the statement \"wiped off the map\" was never made and that Ahmadinejad did not refer to the nation or land mass of Israel, but to the \"regime occupying Jerusalem\". He says that the Iranian government News Agency IRIB/IRNA translation is the source of the confusion:\n One may wonder: where did this false interpretation originate? Who is responsible for the translation that has sparked such worldwide controversy? The answer is surprising. The inflammatory 'wiped off the map' quote was first disseminated not by Iran's enemies, but by Iran itself. The Islamic Republic News Agency, Iran's official propaganda arm, used this phrasing in the English version of some of their news releases covering the World Without Zionism conference. International media including the BBC, Al Jazeera, Time magazine and countless others picked up the IRNA quote and made headlines out of it without verifying its accuracy, and rarely referring to the source. Iran's Foreign Minister soon attempted to clarify the statement, but the quote had a life of its own. Though the IRNA wording was inaccurate and misleading, the media assumed it was true, and besides, it made great copy.[11]\n The phrase 'wiped away' can still be seen on Mr Ahmadinejad's Presidential website:\n He further expressed his firm belief that the new wave of confrontations generated in Palestine and the growing turmoil in the Islamic world would in no time wipe Israel away.[12]\n According to Juan Cole, a University of Michigan Professor of Modern Middle East and South Asian History, Ahmadinejad's statement should be translated as:\n The Imam said that this regime occupying Jerusalem (een rezhim-e eshghalgar-e qods) must [vanish from] the page of time (bayad az safheh-ye ruzgar mahv shavad).[13]\n So he doesn't really want to wipe the LAND off the face of the Earth. Only the Jewish people who possess and control the State of Israel. So that's completely different, right? NOT!!! He is a genocidal maniac who believes the only way to quicken the return of the 12th imam is to hasten world war three. And the fact that you would even make excuses for him speaks volumes about who you are. :xbanghead", 
   {}, 
   325680, 
   null, 
   1222756920.0
  ], 
  [
   325686, 
   null, 
   "GiantOreo", 
   "Great Jo, from your link.\n The translation presented by IRIB has been challenged by Mr. Arash Norouzi, who proposes that the statement \"wiped off the map\" was never made and that Ahmadinejad did not refer to the nation or land mass of Israel, but to the \"regime occupying Jerusalem\". He says that the Iranian government News Agency IRIB/IRNA translation is the source of the confusion:\n One may wonder: where did this false interpretation originate? Who is responsible for the translation that has sparked such worldwide controversy? The answer is surprising. The inflammatory 'wiped off the map' quote was first disseminated not by Iran's enemies, but by Iran itself. The Islamic Republic News Agency, Iran's official propaganda arm, used this phrasing in the English version of some of their news releases covering the World Without Zionism conference. International media including the BBC, Al Jazeera, Time magazine and countless others picked up the IRNA quote and made headlines out of it without verifying its accuracy, and rarely referring to the source. Iran's Foreign Minister soon attempted to clarify the statement, but the quote had a life of its own. Though the IRNA wording was inaccurate and misleading, the media assumed it was true, and besides, it made great copy.[11]\n The phrase 'wiped away' can still be seen on Mr Ahmadinejad's Presidential website:\n He further expressed his firm belief that the new wave of confrontations generated in Palestine and the growing turmoil in the Islamic world would in no time wipe Israel away.[12]\n According to Juan Cole, a University of Michigan Professor of Modern Middle East and South Asian History, Ahmadinejad's statement should be translated as:\n The Imam said that this regime occupying Jerusalem (een rezhim-e eshghalgar-e qods) must [vanish from] the page of time (bayad az safheh-ye ruzgar mahv shavad).[13]\n So he doesn't really want to wipe the LAND off the face of the Earth. Only the Jewish people who possess and control the State of Israel. So that's completely different, right? NOT!!! He is a genocidal maniac who believes the only way to quicken the return of the 12th imam is to hasten world war three. And the fact that you would even make excuses for him speaks volumes about who you are. :xbanghead\n\n \n  regime\n -noun 1. a mode or system of rule or government: a dictatorial regime. \n 2. a ruling or prevailing system. \n 3. a government in power. \n 4. the period during which a particular government or ruling system is in power. \n \n \n Looks like he wants the current ruling government out of power.\n \n Durr (perhaps you should look atthe meaning of words like that before you spout off and make yourself look even more dense).", 
   {
    "unicode_changes_made": true
   }, 
   325682, 
   null, 
   1222761600.0
  ], 
  [
   325819, 
   null, 
   "Ethmi", 
   "The phrase has been mistranslated. He was talking about hoping for a change of regime, much as every world leader does (even if their targets are different).\n http://en.wikipedia.org/wiki/Mahmoud_Ahmadinejad_and_Israel#.22Wiped_off_the_map.22_or_.22Vanish_from_the_pages_of_time.22_translation\n\n \n Is that so? How would this maniac go about changing the government of another country? One that is used as the political scapegoat of the Arabs, no less... If he speaks of changing the government of another country, what else could he mean besides military force? The only country he has power over is his own.", 
   {}, 
   325680, 
   null, 
   1222832700.0
  ], 
  [
   325822, 
   null, 
   "Archangel", 
   "The only rational interpretation one can make from Abinadinijhads numerous statement and fatwas regarding Israel is that he intends to rid the world of all jews through extreme violence. Any attempts to make excuses or minimize his intent is to become an accessory to his intended crimes against humanity which will be carried out at the earliest possible opportunity. \n \n http://www.freerepublic.com/focus/f-news/1639947/posts\n Why Iran wants War? --- Ahmadinejad & Co. starring in Armageddon\n \n \"The Iranian nation will wipe the strain of regret on the foreheads of those who want to bring about injustice\", President Ahmadinejad scorned at a recent rally in the province of Zanjan. Iran \"will cut off the hands of any aggressor\", any attack would be met with a response that is double-fold including suicide attacks across Europe and the United States, he warned. \"Israel should be wiped off the map\", the predominately Jewish nation \"cannot survive\" and is headed \"towards extinction\" quipped the fanatical President.\n \n If one were to listen to his rhetoric alone, even the most astute political intellectuals would think Iran is a nation equipped with the most dangerous military arsenal capable of challenging any nation.\n \n But Iran's rhetoric has little to do with their outdated and dismal military, their fledging economy or their detested government. The root of the government's fiery tone may be traced to their Shi'te ideology's messianic belief in a mysterious, mystical twelfth imam who ventured into hiding over a thousand years ago.\n \n The Hidden Imam is a central concept in the teachings of Shi'te Islam. Born Muhammad al-Mahdi he ventured into a cave in 941 AD hidden by a gate called the Gate of Occultation.\n \n The doctrine of Occultation professes Allah aided the cloaking of the Imam away from the eyes of man so that he could be kept alive until his return. Shi'tes believe that the Twelfth Imam will return to lead the religious battle between good and evil when the world has become consummately nefarious.\n \n According to Shi'te orthodoxy humans may not force or hasten the return of the Imam, but the Hojjateiehs a group of which Ahmadinejad is a member, opine that humans may stir up chaos to encourage his return. With his recent rhetoric vowing for the destruction of Israel, demanding deportation of the Jews to Europe and denying the Holocaust that the President seems to be doing just that. In fact, his messianic axiom of the Twelfth Imam and the subsequent suppression of the forces of evil [modern day US, UK, Israel and many other nations] is central to Ahmadinejad's foreign policy.\n \n The Iranian government's official policy has undercut efforts of the international community by rejecting a United Nations deadline to suspend Iran's nuclear program, threatening to quit the Non-Proliferation Treaty and vying that \"nothing can stop Iran's path to nuclear technology.\" In anticipation of a stand off with the West Iran recently clinched agreements with eight different Middle East insurgency groups to carry out suicide attacks against Israeli, British and US interests across the world. Ironically this plan is called 'Judgment Day.'\n \n During a private meeting with an Iranian cleric in November Ahmadinejad claimed that while giving a speech before the United Nations he felt \"the atmosphere change and for 27 to 28 minutes the leaders did not blink -- they were astonished.. it had opened their eyes and ears to the Islamic Republic.\" He further said that he felt the hand of God upon him as he delivered his omniscient speech. In his egocentric fantasy world the Iranian President likely sees himself as a deputy of the Imam with a divine mission to encourage his arrival. His references to the Imam in conjunction with threats to wipe countries off the face of earth should be taken seriously.\n IN HIS OWN WORDS:The Return of the Twelfth Imam\n by Duane Nicol. \n \n In a speech to the U.N. General Assembly on September 17, 2005, Iranian President Mahmoud Ahmadinejad spoke of a plan for world peace.\n \n He told the Assembly,\n \n When that day comes, the ultimate promise of all Divine religions will be fulfilled with the emergence of a perfect human being who is heir to all prophets and pious men. He will lead the world to justice and absolute peace.\"\n Iranian President, Ahmadinejad, closed his speech by calling for the reappearance of the Twelfth Imam, the Mahdi. He prayed before the assembly,\n \n O Mighty Lord, I pray to you to hasten the emergence of your last repository, the promised one, that perfect human being, the one that will fill this world with justice and peace.\"\n Why is the President of Iran praying for the return of the Mahdi, the so-called perfect human who will bring peace on Earth?\n \n Because, Shi'ite Muslims believe the Twelfth Imam, or Mahdi, the last in a line of saints, descended from Ali, the founder of their sect and vanished down a well in 941 AD. According to this belief, he went into a state of occulation' like the sun hiding behind the clouds. The story goes on and claims that after a stormy period of apocalyptic wars, the clouds will part, and the sun (the Mahdi) will be revealed. They believe that when he is released from his imprisonment, the entire world will submit to Islam. This belief is the driving force behind Ahmadinejad, Ayatollah Khameni, and the majority of the central figures in the Iranian government.\n \n Ahmadinejad and tens of thousands of mullahs are controlling Iran (ancient Persia) and are dead serious about the Mahdi's return. They are all connected and impassioned with fiery, zealous, religious fervor. Ahmadinejad believes Iran's redemption will come through a volatile mixture of Islamic ideology and confronting the \"world conspiracy\" they deeply suspect is instigated by the Crusaders and Zionists (America and Israel); this suspicion and hatred goes back hundreds of years.\n \n In fact, the origin of the volatile hatred dates back to the book of Genesis where Moses wrote about Ishmael, Abraham's son by Hagar. Moses writes,\n \n And he [Ishmael] will be a wild man; his hand will be against every man, and he shall dwell in the presence of all his brethren\" (Genesis 16:11-12)\n Once Iran has the necessary nuclear bombs or missiles, Israel, the U.S. and/or even Europe will be threatened with a thermonuclear exchange if any of these countries expects or attempts a regime change in Iran.\n \n Michael Evans, author of, Showdown with Nuclear Iran, gives a chilling example of just how feasible a nuclear attack could be manifested by Iran on the U.S. and Israel, and has set up an illustrative scenario depicting a nuclear attack:LINK TO EXERPT:\n http://www.prevailmagazine.org/the-return-of-the-twelfth-imam/\n \n http://www.eioba.com/a54640/iran_israel_the_12th_imam\n \n http://www.washtimes.com/news/2006/feb/05/20060205-100341-6320r/", 
   {
    "unicode_changes_made": true
   }, 
   325819, 
   null, 
   1222834860.0
  ], 
  [
   325827, 
   null, 
   "GiantOreo", 
   "Is that so? How would this maniac go about changing the government of another country? One that is used as the political scapegoat of the Arabs, no less... If he speaks of changing the government of another country, what else could he mean besides military force? The only country he has power over is his own.\n\n \n How did the maniac that currently is our President go about changing the goverment of another country?\n \n Why should we get special rights to do so and forbid and censure others that want to do so? Hypocrisy at its finest.", 
   {}, 
   325819, 
   null, 
   1222839240.0
  ], 
  [
   325828, 
   null, 
   "GiantOreo", 
   "The only rational interpretation one can make from Abinadinijhads numerous statement and fatwas regarding Israel is that he intends to rid the world of all jews through extreme violence. Any attempts to make excuses or minimize his intent is to become an accessory to his intended crimes against humanity which will be carried out at the earliest possible opportunity. \n <useless BS cut/paste text snipped<\n\n \n Once again:\n \n regime\n -noun 1. a mode or system of rule or government: a dictatorial regime. \n 2. a ruling or prevailing system. \n 3. a government in power. \n 4. the period during which a particular government or ruling system is in power. \n \n \n Looks like he wants the current ruling government out of power.\n \n Durr (perhaps you should look atthe meaning of words like that before you spout off and make yourself look even more dense).\n \n I'd ask how the bloody hell a regime of a country equals \"every jew in the world\", but you seem to be a bit slow on this so we'll hold off on that for now.", 
   {
    "unicode_changes_made": true
   }, 
   325822, 
   null, 
   1222839360.0
  ], 
  [
   325831, 
   null, 
   "Jo Bennett", 
   "If you read further, the Iranian government clarified the statement and said that the President was expecting the Israeli and US governments to collapse, much as the USSR did. Given the bankrupt nature of the US (and other western) economies and the degree to which Israel is dependent on it, it's not a totally outlandish prediction.", 
   {}, 
   325828, 
   null, 
   1222841100.0
  ], 
  [
   325858, 
   null, 
   "Ethmi", 
   "If you read further, the Iranian government clarified the statement and said that the President was expecting the Israeli and US governments to collapse, much as the USSR did. Given the bankrupt nature of the US (and other western) economies and the degree to which Israel is dependent on it, it's not a totally outlandish prediction.\n\n \n Would you care to provide us with some evidence?", 
   {}, 
   325831, 
   null, 
   1222889580.0
  ], 
  [
   325859, 
   null, 
   "Ethmi", 
   "How did the maniac that currently is our President go about changing the goverment of another country?\n \n Why should we get special rights to do so and forbid and censure others that want to do so? Hypocrisy at its finest.\n\n \n On the contrast, did a terrorist organization that was traced back to Israel randomly attack the Arab nations out of religous zeal? I doubt it. At least not on the scale of 9-11. Do the Arabs have justification to attack Israel? Just their bigotry. Did a team of Jews fly a plane into a very important Arab building, killing themselves in the process? No. Did the Jews even have a big celebration when Arifat died like the Arabs did when Ariel Sharon had a stroke? No. Face it, Israel is a scapegoat for all of the Arab's problems. Period. End of story.", 
   {}, 
   325827, 
   null, 
   1222889760.0
  ], 
  [
   325868, 
   null, 
   "Jo Bennett", 
   "Would you care to provide us with some evidence?\n\n \n It's in the link I already posted.\n \n And stop trying to smear every arab (incidentally most Iranians aren't arabs, they're persian) with your ridiculously broad brush. And personally I think the ethnic cleansing and occupation of palestine is a rather bigger grievance than a one off terrorist attack launched by citizens of your ally Saudi Arabia. Holding the entire arab world (and apparently anyone brown nearby because you're too ignorant to know the difference) responsible is like holding all white and hispanic people responsible for the crusades or, at the risk of a Godwin, the holocaust.", 
   {}, 
   325858, 
   null, 
   1222892280.0
  ], 
  [
   325870, 
   null, 
   "Archangel", 
   "Once again:\n \n regime\n -noun 1. a mode or system of rule or government: a dictatorial regime. \n 2. a ruling or prevailing system. \n 3. a government in power. \n 4. the period during which a particular government or ruling system is in power. \n \n \n Looks like he wants the current ruling government out of power.\n \n Durr (perhaps you should look atthe meaning of words like that before you spout off and make yourself look even more dense).\n \n I'd ask how the bloody hell a regime of a country equals \"every jew in the world\", but you seem to be a bit slow on this so we'll hold off on that for now.\n\n \n Once again cookie, I have shown you clearly that ahm a dam nut job wants to force the return of the 12th imam through the 3rd world war. That is his method of forcing islam onto the world as the one true religion. And all of your excuses and justifications for what he represents wont change that aspect of his beliefs and agenda.", 
   {
    "unicode_changes_made": true
   }, 
   325828, 
   null, 
   1222892520.0
  ], 
  [
   325900, 
   null, 
   "GiantOreo", 
   "On the contrast, did a terrorist organization that was traced back to Israel randomly attack the Arab nations out of religous zeal? I doubt it. At least not on the scale of 9-11. Do the Arabs have justification to attack Israel? Just their bigotry. Did a team of Jews fly a plane into a very important Arab building, killing themselves in the process? No. Did the Jews even have a big celebration when Arifat died like the Arabs did when Ariel Sharon had a stroke? No. Face it, Israel is a scapegoat for all of the Arab's problems. Period. End of story.\n\n \n Talking about Iraq dude. Not Afghanistan. Period. End of Story.", 
   {}, 
   325859, 
   null, 
   1222899240.0
  ], 
  [
   325901, 
   null, 
   "GiantOreo", 
   "Once again cookie, I have shown you clearly that ahm a dam nut job wants to force the return of the 12th imam through the 3rd world war. That is his method of forcing islam onto the world as the one true religion. And all of your excuses and justifications for what he represents wont change that aspect of his beliefs and agenda.\n\n Once again archie squirms when the definition of regime is pointed out to him and it nullifies his claims.........", 
   {}, 
   325870, 
   null, 
   1222899300.0
  ], 
  [
   325906, 
   null, 
   "Archangel", 
   "Once again cookie, I have shown you clearly that ahm a dam nut job wants to force the return of the 12th imam through the 3rd world war. That is his method of forcing islam onto the world as the one true religion. And all of your excuses and justifications for what he represents wont change that aspect of his beliefs and agenda.\n\n \n \nOnce again archie squirms when the definition of regime is pointed out to him and it nullifies his claims.........\n\n \n WHO'S SQUIRMING? What in my post implies any type of squirming? I simply restated the fact that ahbinanutjob is committed to starting ww3 in order to hasten the return of his islamic messiah. He has clearly stated as much in his own words and with his own mouth, HERE.\n \n So how is pointing that out squirming in any way, shape or form cookie? What is squirming is your refusal to admit the reality of this evidence.", 
   {}, 
   325901, 
   null, 
   1222901040.0
  ], 
  [
   325908, 
   null, 
   "GiantOreo", 
   "WHO'S SQUIRMING? What in my post implies any type of squirming? I simply restated the fact that ahbinanutjob is committed to starting ww3 in order to hasten the return of his islamic messiah. He has clearly stated as much in his own words and with his own mouth, HERE.\n \n So how is pointing that out squirming in any way, shape or form cookie? What is squirming is your refusal to admit the reality of this evidence.\n\n \n So, he wants the imam to return (which would lead to various destructions, etc.).\n \n How is that any different from you Christian whackjobs that want Jebus to return (thus leading to the mass slaughters and destructions by God as detailed in Revelations)?\n \n Not one whit of difference.\n \n \n Oh, and nice goalpost shift. First you claimed he wanted to wipe every Jew from the face of the earth (when Islam teaches the opposite - to respect the People of the Book), and when it is pointed out to you that he wants the regime in Israel to be removed (and hte definition of regime was pointed out), you now say that you have been saying all along htat he wants a World War III.", 
   {}, 
   325906, 
   null, 
   1222901460.0
  ], 
  [
   325915, 
   null, 
   "Archangel", 
   "So, he wants the imam to return (which would lead to various destructions, etc.).\n \n How is that any different from you Christian whackjobs that want Jebus to return (thus leading to the mass slaughters and destructions by God as detailed in Revelations)?\n \n Not one whit of difference.\n\n \n There's a huge difference. And that is that I am looking forward to Messiah's return according to His perfect timing and Will. I'm not attempting to start WW3 in order to hasten His return like this iranian nut job wants to do. And neither is any aspect of the modern Protestant movement calling for military violence in order to cause Messiah's return. \n \n \nOh, and nice goalpost shift. First you claimed he wanted to wipe every Jew from the face of the earth (when Islam teaches the opposite - to respect the People of the Book), and when it is pointed out to you that he wants the regime in Israel to be removed (and hte definition of regime was pointed out), you now say that you have been saying all along htat he wants a World War III.\n\n \n Sorry if you're confused, but I'm not changing the goal post or my original assertion at all. I maintain that this minor ant-christ is committed to destroying Israel in a violent military attack. The fact that his reason happens to be motivated by his cultic religious fanaticism is secondary to the diabolical nature of his agenda. And you are in denial of that reality so it is you who is squirming for a way to appear both rational and reasonable due to the fact that you're attempting to defend a madman. One who doesn't even have the support of the Iranian citizenry, I might ADD.", 
   {}, 
   325908, 
   null, 
   1222905840.0
  ], 
  [
   325949, 
   null, 
   "Ethmi", 
   "Talking about Iraq dude. Not Afghanistan. Period. End of Story.\n\n \n Don't change the subject on me! Did you read my post?\n \n If so, I question your reading comprehension.\n If not, then I question wether or not you should be on here! \n \n What you said is irrelevant, the Arabs are ultimately bent on the destruction of Israel. We are just an obstacle to them. Like I said elsewhere, I can't even blink without someone changing the subject. \n \n You're just being yourself; using little technicalities to evade my main point. \n \n Now getting back on topic, we're (supposed to be) talking about Arab Hostilities with Israel and what Obama would do about it, not Iraq. \n \n You're obviously just trying to derail the topic, like Chester or Penfold. But at least you try to debate. I'll give you that.", 
   {}, 
   325900, 
   null, 
   1222918440.0
  ], 
  [
   325951, 
   null, 
   "GiantOreo", 
   "Don't change the subject on me! Did you read my post?\n \n If so, I question your reading comprehension.\n If not, then I question wether or not you should be on here! \n \n What you said is irrelevant, the Arabs are ultimately bent on the destruction of Israel. We are just an obstacle to them. Like I said elsewhere, I can't even blink without someone changing the subject. \n \n You're just being yourself; using little technicalities to evade my main point. \n \n Now getting back on topic, we're (supposed to be) talking about Arab Hostilities with Israel and what Obama would do about it, not Iraq. \n \n You're obviously just trying to derail the topic, like Chester or Penfold. But at least you try to debate. I'll give you that.\n\n I MADE A FRICKIN' COMPARISON oh reading comprehension lord! Perhaps you should take your own advice! DUrp aderp derp derp.", 
   {}, 
   325949, 
   null, 
   1222918860.0
  ], 
  [
   325957, 
   null, 
   "Jo Bennett", 
   "Don't change the subject on me! Did you read my post?\n \n If so, I question your reading comprehension.\n If not, then I question wether or not you should be on here! \n \n What you said is irrelevant, the Arabs are ultimately bent on the destruction of Israel. We are just an obstacle to them. Like I said elsewhere, I can't even blink without someone changing the subject. \n \n You're just being yourself; using little technicalities to evade my main point. \n \n Now getting back on topic, we're (supposed to be) talking about Arab Hostilities with Israel and what Obama would do about it, not Iraq. \n \n You're obviously just trying to derail the topic, like Chester or Penfold. But at least you try to debate. I'll give you that.\n\n \n \n You're the one doing the derailing, Arabs have nothing to do with the topic, seeing as how the topic is the Iranian president, and Iran is 97% non-arab.", 
   {}, 
   325949, 
   null, 
   1222927320.0
  ], 
  [
   325965, 
   null, 
   "chester", 
   "\n Sorry if you're confused, but I'm not changing the goal post or my original assertion at all. I maintain that this minor ant-christ is committed to destroying Israel in a violent military attack. The fact that his reason happens to be motivated by his cultic religious fanaticism is secondary to the diabolical nature of his agenda. And you are in denial of that reality so it is you who is squirming for a way to appear both rational and reasonable due to the fact that you're attempting to defend a madman. One who doesn't even have the support of the Iranian citizenry, I might ADD.\n\n \n Archie, since you make a point over and over again that you are an American \"Christian\", just exactly what is your stake in the continued existence of a secular state of Israel, the majority of whose citizens are of the Jewish faith?", 
   {}, 
   325915, 
   null, 
   1222947300.0
  ], 
  [
   325987, 
   null, 
   "isly ilwott", 
   "Archie, since you make a point over and over again that you are an American \"Christian\", just exactly what is your stake in the continued existence of a secular state of Israel, the majority of whose citizens are of the Jewish faith?\nDoes one have to have a stake in the continued existence of a group of people other than the belief that we all have a right to exist?\n \n What is your justification for ignoring the genocidal tendencies of radical muslims?\n \n Are your motives based on the world economy, world peace or plain old anti-Semitism?\n \n The fact that I am not Jewish does not translate into apathy regarding their struggle to survive.", 
   {}, 
   325965, 
   null, 
   1222967880.0
  ], 
  [
   326012, 
   null, 
   "isly ilwott", 
   "I wonder if, when Obama meets with the little Iranian puppy if Obama will be able to use a Teleprompter to enable him to keep up with his talking points.\n \n He seems to be unable to speak fluently when all by himself. God forbid he should ever be allowed to negotiate with Iran in closed door meetings.\n \n Obama's arrogance was displayed during the first debate in his comments regarding this topic. While McCain suggested following protocol to establish preconditions for talks at the presidential level, Barack was saying things like, \"I'll be the president and I can talk to whoever I want to.\"", 
   {}, 
   325987, 
   null, 
   1222976040.0
  ], 
  [
   326043, 
   null, 
   "Penfold", 
   "I wonder if, when Obama meets with the little Iranian puppy if Obama will be able to use a Teleprompter to enable him to keep up with his talking points.\n \n He seems to be unable to speak fluently when all by himself. God forbid he should ever be allowed to negotiate with Iran in closed door meetings.\n \n Obama's arrogance was displayed during the first debate in his comments regarding this topic. While McCain suggested following protocol to establish preconditions for talks at the presidential level, Barack was saying things like, \"I'll be the president and I can talk to whoever I want to.\"\n\n \n ...Nasty rumour, half-truth , or innuendo? You decide.", 
   {}, 
   326012, 
   null, 
   1222989000.0
  ], 
  [
   326058, 
   null, 
   "Archangel", 
   "Archie, since you make a point over and over again that you are an American \"Christian\", just exactly what is your stake in the continued existence of a secular state of Israel, the majority of whose citizens are of the Jewish faith?\n\n \n \nDoes one have to have a stake in the continued existence of a group of people other than the belief that we all have a right to exist?\n \n What is your justification for ignoring the genocidal tendencies of radical muslims?\n \n Are your motives based on the world economy, world peace or plain old anti-Semitism?\n \n The fact that I am not Jewish does not translate into apathy regarding their struggle to survive.\n\n \n To add to isly's answer would just be redundant. emoticon_xagree", 
   {}, 
   325987, 
   null, 
   1222991700.0
  ], 
  [
   326089, 
   null, 
   "Ethmi", 
   "I MADE A FRICKIN' COMPARISON oh reading comprehension lord! Perhaps you should take your own advice! DUrp aderp derp derp.\n\n \n You're getting closer to Chester's level. That's called an ad hom. You attacked me as a way to evade my point. I was just pointing out that there was no valid analogy... and this is your response.", 
   {}, 
   325951, 
   null, 
   1223006940.0
  ], 
  [
   326102, 
   null, 
   "Jo Bennett", 
   "To add to isly's answer would just be redundant. emoticon_xagree\n\n \n Typical right wing sleight of hand - the question is about the state of Israel, the answer is about the Jewish people, most of whom live outside Israel, and a significant proportion of whom oppose the actions of the Israeli government in Palestine.", 
   {}, 
   326058, 
   null, 
   1223015580.0
  ], 
  [
   326118, 
   null, 
   "Archangel", 
   "Typical right wing sleight of hand - the question is about the state of Israel, the answer is about the Jewish people, most of whom live outside Israel, and a significant proportion of whom oppose the actions of the Israeli government in Palestine.\n\n \n Define \"significant proportion\" if you can. And what do you mean \"right wing slight of hand\"? Are you implying that I don't support either the Jewish People or the State of Israel in reality? Clarify what you mean with that term.", 
   {}, 
   326102, 
   null, 
   1223039640.0
  ], 
  [
   326119, 
   null, 
   "Ethmi", 
   "Typical right wing sleight of hand - the question is about the state of Israel, the answer is about the Jewish people, most of whom live outside Israel, and a significant proportion of whom oppose the actions of the Israeli government in Palestine.\n\n \n Israelis don't fly planes into buildings. I have already explained multiple times that the Arab nations use Israel as a political scapegoat.", 
   {}, 
   326102, 
   null, 
   1223042100.0
  ], 
  [
   326180, 
   null, 
   "GiantOreo", 
   "Israelis don't fly planes into buildings. I have already explained multiple times that the Arab nations use Israel as a political scapegoat.\n\n \n Neither did Iraqis. So you're sort of out of luck here if we go by my comparison/analogy.", 
   {}, 
   326119, 
   null, 
   1223057820.0
  ], 
  [
   326181, 
   null, 
   "GiantOreo", 
   "You're getting closer to Chester's level. That's called an ad hom. You attacked me as a way to evade my point. I was just pointing out that there was no valid analogy... and this is your response.\n\n \n No, I didn't \"evade\" your \"point\", I ignored your strawman argument that you set up against something I never said.\n \n And, as pointed out before, IRan is 3% Arab, which nullifies your strawman argument.", 
   {}, 
   326089, 
   null, 
   1223057940.0
  ], 
  [
   326186, 
   null, 
   "isly ilwott", 
   "...Nasty rumour, half-truth , or innuendo? You decide.\n\n http://www.google.com/search?sourceid=navclient&aq=t&ie=UTF-8&rlz=1T4GGIK_enUS273US274&q=Obama+teleprompter+fails\n \n Yes, you decide. Just google 'Obama teleprompter' or something similar.", 
   {}, 
   326043, 
   null, 
   1223059380.0
  ], 
  [
   326212, 
   null, 
   "Penfold", 
   "Originally Posted by isly ilwott \n \" I wonder if, when Obama meets with the little Iranian puppy if Obama will be able to use a Teleprompter to enable him to keep up with his talking points.\n \n He seems to be unable to speak fluently when all by himself. God forbid he should ever be allowed to negotiate with Iran in closed door meetings.\n \n Obama's arrogance was displayed during the first debate in his comments regarding this topic. While McCain suggested following protocol to establish preconditions for talks at the presidential level, Barack was saying things like, \"I'll be the president and I can talk to whoever I want to.\" \"\n \n The fact content of this melange of nasty rumour, half-truth and innuendo speaks volumes.", 
   {}, 
   326186, 
   null, 
   1223064720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Obama Wants Meeting With Ahmadinejad", 
  "url": "http://www.4forums.com/political/elections-debates/11662-obama-wants-meeting-ahmadinejad.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11662, 
  "discussion_files": [
   [
    "6454.html", 
    "http://www.4forums.com/political/elections-debates/11662-obama-wants-meeting-ahmadinejad-print.html"
   ], 
   [
    "6455.html", 
    "http://www.4forums.com/political/elections-debates/11662-obama-wants-meeting-ahmadinejad-3-print.html"
   ], 
   [
    "6456.html", 
    "http://www.4forums.com/political/elections-debates/11662-obama-wants-meeting-ahmadinejad-2-print.html"
   ]
  ], 
  "identifier": 11662
 }
]