[
 [
  [
   325614, 
   null, 
   "jazyjason", 
   "In case you dont know california will be voting on prop 8 which if passes will stop same sex unions or attempt to do so.\n Well I have had to sit in a church that actually sells t-shirts supporting prop 8. \n \n And the pastors argument for voting on prop 8? Gays are destroying families, family values and because they can't procreate they can't marry...\n \n So my question is since gay marriage has been legal and the sky has not fallen and god hasnt reigned fire and brimstone down upon us, whats the big deal? People are happy! For once gays and lesbians are seen as equal couples and have had to fight tooth and nail against the bigoted narrow minded people who dont take into account the welfare and happiness of ALL people, not just ones that conform to your ideals. Your thoughts.", 
   {
    "post_info": {
     "post_title": "Prop 8 and all the hate Ive heard"
    }
   }, 
   null, 
   null, 
   1222720500.0
  ], 
  [
   325726, 
   null, 
   "Kronus", 
   "In case you dont know california will be voting on prop 8 which if passes will stop same sex unions or attempt to do so.\n Well I have had to sit in a church that actually sells t-shirts supporting prop 8\n\n \n That's illegal. Part of the \"deal\" that lets churches avoid taxation and other government interference is that they stay out of government. A church may not take a direct stand on a political issue like that. I don't know who you would report it to, but you really should call the authorities on this.", 
   {}, 
   325614, 
   null, 
   1222804560.0
  ], 
  [
   325784, 
   null, 
   "sinjin", 
   "...I have had to sit in a church that actually sells t-shirts supporting prop 8.\nNo, you don't. Time to find a new church.", 
   {}, 
   325614, 
   null, 
   1222811940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Prop 8 and all the hate Ive heard", 
  "url": "http://www.4forums.com/political/gay-rights-debates/11667-prop-8-all-hate-ive-heard.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 11667, 
  "discussion_files": [
   [
    "23001.html", 
    "http://www.4forums.com/political/gay-rights-debates/11667-prop-8-all-hate-ive-heard-print.html"
   ]
  ], 
  "identifier": 11667
 }
]