[
 [
  [
   325720, 
   null, 
   "yes", 
   "NO ONE that I have seen so far has said much about this ... \n \n There is a massive shift of control in the world currency market.\n \n Some of the BIGGEST MONEY institutions are being moved into other larger financial institutions.\n \n That would be comparable to Toyota - the world's largest car maker taking over Ford and General Motors.\n \n Look at these links:\n [*]\n (the link)\n OSLO, Sept 30 (Reuters) - The Norwegian central bank sold $3 billion in a one-month U.S. dollar swaps to participants in the Norwegian money market on Tuesday.\n \n[*]\n (the link)\n Late Sunday, the Federal Reserve cut its lending rate to banks, about the same time U.S. banking giant JPMorgan Chase agreed to buy cash-strapped rival Bear Stearns.\n \n The bank sale valued Bear Stearns at about $250 million, far less than the $4 billion market value at the end of last week, in what amounts to a stunning collapse of one of the world's largest and most respected investment banks.\n \n The U. S. Central Bank - the Federal Reserve - is expected to help fund some of the transaction.\n \n[*]\n (the link)\n Garnett, KS\n Jul 21, 2008\n Peoples Bank sold\n Patriots Bank of Garnett has entered into an agreement to purchase the Paola branch of Peoples Bank, which currently is located on the south side of Park Square.\n \n[*]\n (the link)\n September 17, 2008 \n Search Archives: \n \n American Community Bank sold \n By LARRY HILLIARD Ledger Staff Writer larry@gaffneyledger.com \n For the second time this year, North Carolina-based Yadkin Valley Financial Corp. has acquired another bank.\n \n But this time, it will affect Cherokee County residents.\n \n Yadkin Valley Financial has agreed to acquire American Community Bancshares Inc. and its American Community Bank subsidiary, which operates three branches here.\n \n Yadkin Valley Financial reportedly will pay $92 million for the bank.\n \n The deal, which comes on the heels of Yadkin Valley Financial's purchase of Cardinal State Bank in April, is expected to be completed by the first quarter of 2009.\n \n[*]\n (the link)\n Russian c.bank sold upto $4 bln to prop up rouble\n 09.04.08, 10:22 AM ET\n \n[*]\n (the link)\n Denmark's Roskilde Bank sold to rivals\n \n \n AFP , COPENHAGEN \n Tuesday, Sep 30, 2008, Page 10\n Denmark's Roskilde Bank, bailed out by the central bank last month, has been sold to Nordic bank Nordea and two regional Danish lenders, Arbejdernes Landsbank and Spar Nord Bank, it said yesterday.\n \n Roskilde Bank lost some 5.1 billion kroner (US$979 million) in the first half of the year, after making significantly bigger writedowns than expected on its real estate loans.\n \n It also made provisions of 3.6 billion kroner.\n \n On Aug. 24, the central bank announced that it and a group of Scandinavian financial institutions had bought all of Roskilde's assets and taken over all debt and other liabilities, which it placed in a separate entity.\n \n \n[*]\n (the link)\n Wachovia's banking sold to Citigroup\n by Russ Wiles - Sept. 30, 2008 12:00 AM\n The Arizona Republic\n Another week, another seismic shift affecting Arizona's banking landscape.\n \n Citigroup has emerged as the latest player with a major presence in Arizona after its purchase of Wachovia Corp.'s banking operation for $2.16 billion.\n \n[*]\n (the link)\n What the WaMu Collapse Means for Its Customers\n \n Kimberly Lankford, Contributing Editor,\n Kiplinger.com \n Tuesday, September 30, 2008; 12:00 AM\n I have an account with Washington Mutual. What changed when the FDIC put the bank into receivership?\n \n Not much. The FDIC took over Washington Mutual on September 25, 2008 -- the largest bank failure in history -- then almost immediately sold all of the bank's deposits, loans and branches to JP Morgan Chase for $1.9 billion. All accounts were transferred to Chase, regardless of the size, even if they were above the FDIC limits. Nobody lost any money on deposits at Washington Mutual.\n \n", 
   {
    "post_info": {
     "post_title": "A BIG SHIFT in money"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1222802820.0
  ], 
  [
   326263, 
   null, 
   "Jim Colyer", 
   "I am trying to understand all this. Where do you think it is leading us?", 
   {}, 
   325720, 
   null, 
   1223093100.0
  ], 
  [
   326279, 
   null, 
   "yes", 
   "I'm not sure where it's leading us. \n \n but when you have one of the largest banks on the west coast buying one of the bigger banks on the east coast\n and banks around the world are seeing the same shifting situation - it makes me wonder how much of this is a move towards the next level in globalism.", 
   {}, 
   326263, 
   null, 
   1223130900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A BIG SHIFT in money", 
  "url": "http://www.4forums.com/political/current-events-debates/11672-big-shift-money.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 11672, 
  "discussion_files": [
   [
    "21004.html", 
    "http://www.4forums.com/political/current-events-debates/11672-big-shift-money-print.html"
   ]
  ], 
  "identifier": 11672
 }
]