[
 [
  [
   325961, 
   null, 
   "Galileo", 
   "It occured to me that the message of the film might be- Canadians can be trusted with guns but Americans can't. The reason I say that is he keeps talking about how Canadians own millions of guns but have much fewer problems with gun violence (not mentioned in the film is that Canada also has gun registration, licensing and most privately owned guns are long guns not handguns). He talks about how Americans, in contrast to Canadians, are continually pumped full of fear. Because Americans are continually pumped full of fear they develop a dog-eat-dog/ kill-or-be-killed approach to life and see weapons and violence as solutions to their problems. This can be seen both internationally and domestically- Americans have often turned to bombing and killing people in other nations to solve disputes. He interviews some Canadians in the film who say Canadians would rather negotiate and work things out rather than resort to bombing and killing. He talks to an American gun owner in the movie who is so pumped full of fear and paranoid that he sleeps with a loaded gun under his pillow. He interviews some Canadians who say they don't lock their doors at night and would never want to shoot an intruder. He suggests that Americans own guns for racist reasons- that they are pumped full of fear of black people and own guns to protect themselves against black people. He points out that the NRA and KKK were founded in the same year. At the end of the movie he successfully lobbies K-Mart to stop selling handgun ammunition. He makes a comment about how it's not good for Americans to have easy access to guns in the fearful atmosphere of the post 9/11 era. That's mainly what I remember.", 
   {
    "post_info": {
     "post_title": "How many pro-gun people have ever watched the documentary, Bowling for Columbine?"
    }
   }, 
   null, 
   null, 
   1222934820.0
  ], 
  [
   325973, 
   null, 
   "Omegamon_X", 
   "Let's get a few things straight right now. Canadians might have less crime, but what Moore fails to mention is that Canada only has about 10% the total population size that America does. When your country only hosts 30 million instead of 300 million there's a lot less population density and people on top of each other, that's a factor that needs to be examined. You can't just say \"Canada has gun registration, America doesn't, but Canada has much less crime so obviously gun registration is the key\" because that's not the case at all so stop the deception already!\n \n Second, September 11th, those terrorists that blew up the World Trade Center came from across the Canadian border, so it's their fault that we got blown up. If they did a better job of policing their borders and stopped letting illegal immigrants come and go so damn freely this might not have happened and Americans wouldn't have to worry about the possibility of facing random attacks from people who hate us.\n \n Which brings up another point. When has Canada ever suffered a terrorist attack that even rivals the scale of September 11th? What do they know about fear? They wouldn't be so willing to negotiate with an enemy if they were cutting their heads off and sending children loaded with dynamite out to blow up tour buses full of Canadians. The only reason they're so smug and are willing to negotiate with words is because they haven't seen that such actions are useless against the current threat.\n \n Third, Moore is one of the biggest anti-gun names in Hollywood, nothing he does could ever be taken seriously! His comparison of the NRA and the KKK is meant to mislead people and make them think the NRA is all for hanging blacks from trees and burning crosses on the front lawns of black people; that couldn't be further from the truth! The NRA had Ulysses S. Grant, who was a union soldier as their eighth president in 1883, not Robert E. Lee who was a confederate soldier that supported slavery and keeping blacks \"in their place where they belonged\"! If the NRA was racists and a KKK splinter faction, Grant would've never been considered for president of the organization.\n \n Moore shows his anti-gun arrogance by actually expecting Charlton Heston to apologize for the fact that a little girl was shot to death, as if he had anything to do with it! How about you apologize for September 11th taking place?", 
   {}, 
   325961, 
   null, 
   1222960560.0
  ], 
  [
   325979, 
   null, 
   "Bryan", 
   "I have watched the production. I would not call it a \"documentary\" though. I would term it a carefully made and deliberately false propaganda piece. Let Brady or someone else defend it here if they can.", 
   {
    "post_info": {
     "post_title": "Watched it"
    }, 
    "unicode_changes_made": true
   }, 
   325973, 
   null, 
   1222964400.0
  ], 
  [
   325991, 
   null, 
   "sinjin", 
   "I'd bet that the percentage of KKK members that are also NRA members is very high.", 
   {}, 
   325979, 
   null, 
   1222968420.0
  ], 
  [
   325993, 
   null, 
   "Omegamon_X", 
   "I'd bet that the percentage of KKK members that are also NRA members is very high.\n\n \n Don't bet that such is true, prove that such is true. Find the information and use it to present a case.", 
   {}, 
   325991, 
   null, 
   1222968720.0
  ], 
  [
   325996, 
   null, 
   "sinjin", 
   "Don't bet that such is true, prove that such is true. Find the information and use it to present a case.\nDo you really believe I'll find a KKK membership list online? Or an NRA for that matter? Well let's start with you since you're probably an NRA member. What's you're real name?", 
   {}, 
   325993, 
   null, 
   1222969860.0
  ], 
  [
   325998, 
   null, 
   "shatnerpossum", 
   " NRA and KKK were founded in the same year. \n\n \n Not true. NRA was 1871. KKK was in 1865.", 
   {}, 
   325961, 
   null, 
   1222970040.0
  ], 
  [
   326005, 
   null, 
   "Omegamon_X", 
   "Do you really believe I'll find a KKK membership list online? Or an NRA for that matter?\n\n \n So obviously there's no proof to support your baseless and erroneous accusation. You're just spouting off another anti-gun opinion designed to mislead the public and confuse them on who the real enemy is.", 
   {}, 
   325996, 
   null, 
   1222973820.0
  ], 
  [
   326009, 
   null, 
   "Flyboy_451", 
   "It has been a LONG time since I have seen this film, so will not even try to remember all of the inaccuracies and outright falsehoods claimed within it. Michael Moore has shown that anyone with the ambition to falsely lead people to conclusions, can certainly do so. \n \n Some of the obvious lies within the work include his rant on the NRA convention following the events at Columbine. He fails to mention that, while the NRA did indeed host their annual convention in Denver, they canceled all of the activities with the exception of their business meeting. This meeting is required by law due to the type of organization that they are, and if the location of the meeting were to change, they would have to provide advanced notice to all members within a time span that was not possible following columbine (I don't remember off the top of my head how much notice is required).\n \n He then pieces together audio clips of multiple speeches made by Charlton Heston with the intent of misleading people to believe that it was the speech presented at the meeting in Denver. He even edited statements made by Heston to distort the meaning of what was truly said.\n \n Moore also tries to demonstrate how easy it is to get a gun, when he opens an account at a bank that is running a promotional event in which you receive a free gun when a specific type of account is opened. What he fails to show is that the bank is the holder of a federal firearms license, and that he had to fill out all of the requisite forms and submit to a background check conducted through the NICS system. \n \n The list of inaccuracies goes on throughout the film, and number far too many to even begin to address here...\n \n As to the interviews with various people in Canada that were shown in the film, I would bet that I could just as easily find Canadians with opposing views to the one presented by Moore. Showing what a few people hold as opinions is not indicative of what the average or majority of a people think or believe. On top of that is the fact that what people think and believe often does not display a possession of any knowledge or experience about a given subject. \n \n Crime rates in Canada vs. the U.S. ... AS has been pointed out by others already, there are many factors that influence crime rates. One of the bigger influences is population and population density. Canada has approximately 30 million people, the U.S. has a approximately 300 million. This alone will have a large impact on crime rates. There are many other factors that have an impact on crime rates as well. Comparing two countries with vastly different cultures is, at best, misleading and difficult. To compare the two as Moore has done, is fraudulent and deceiving. \n \n Michael Moore is welcome to his opinion, and I would even fight for his right to free speech in presenting his opinion to others, but to call his work a documentary is akin to calling \"Alice in Wonderland\" a scholastic study of the space time continuum. \n \n Just as I discourage those on the gun rights side of the argument from posting quotes by such groups as the NRA, to utilize information presented by Moore and others of his beliefs, is a poor way in which to make an argument.\n \n Justin", 
   {}, 
   325998, 
   null, 
   1222975440.0
  ], 
  [
   326011, 
   null, 
   "sinjin", 
   "So obviously there's no proof to support your baseless and erroneous accusation. You're just spouting off another anti-gun opinion designed to mislead the public and confuse them on who the real enemy is.\nWhen someone uses the term \"obvious\" get ready for an unsupported assertion. Proof may exist but would probably be hard to obtain. Erroneous? Assumes facts not in evidence. Accusation? What I said can hardly be claimed an accusation. I said I'd bet. That's all. Anti-gun? How so? Does the fact that so many criminals have guns like you make you pro-criminal? Confuse and mislead the public? There's a lot of that on both sides of the gun issue. I try not to contribute to that. I think my posts in this arena will show that. I can't help who your bedfellows are.", 
   {}, 
   326005, 
   null, 
   1222975860.0
  ], 
  [
   326026, 
   null, 
   "iangb", 
   "Let's get a few things straight right now. Canadians might have less crime, but what Moore fails to mention is that Canada only has about 10% the total population size that America does. When your country only hosts 30 million instead of 300 million there's a lot less population density and people on top of each other, that's a factor that needs to be examined.\n\n The UK has a higher population density than the US and less crime.\n \n :p\n \n Yes, I know there may well be other factors. It's certainly evidence of sorts, though.\n \n EDIT: Oh, and I've never watched BFC. I try to get my info with less bias, thanks - although I might get around to watching it at some point.", 
   {}, 
   326011, 
   null, 
   1222979100.0
  ], 
  [
   326047, 
   null, 
   "Penfold", 
   "Let's get a few things straight right now. Canadians might have less crime, but what Moore fails to mention is that Canada only has about 10% the total population size that America does. When your country only hosts 30 million instead of 300 million there's a lot less population density and people on top of each other, that's a factor that needs to be examined. You can't just say \"Canada has gun registration, America doesn't, but Canada has much less crime so obviously gun registration is the key\" because that's not the case at all so stop the deception already!\n \n Second, September 11th, those terrorists that blew up the World Trade Center came from across the Canadian border, so it's their fault that we got blown up. If they did a better job of policing their borders and stopped letting illegal immigrants come and go so damn freely this might not have happened and Americans wouldn't have to worry about the possibility of facing random attacks from people who hate us.\n \n Which brings up another point. When has Canada ever suffered a terrorist attack that even rivals the scale of September 11th? What do they know about fear? They wouldn't be so willing to negotiate with an enemy if they were cutting their heads off and sending children loaded with dynamite out to blow up tour buses full of Canadians. The only reason they're so smug and are willing to negotiate with words is because they haven't seen that such actions are useless against the current threat.\n \n Third, Moore is one of the biggest anti-gun names in Hollywood, nothing he does could ever be taken seriously! His comparison of the NRA and the KKK is meant to mislead people and make them think the NRA is all for hanging blacks from trees and burning crosses on the front lawns of black people; that couldn't be further from the truth! The NRA had Ulysses S. Grant, who was a union soldier as their eighth president in 1883, not Robert E. Lee who was a confederate soldier that supported slavery and keeping blacks \"in their place where they belonged\"! If the NRA was racists and a KKK splinter faction, Grant would've never been considered for president of the organization.\n \n Moore shows his anti-gun arrogance by actually expecting Charlton Heston to apologize for the fact that a little girl was shot to death, as if he had anything to do with it! How about you apologize for September 11th taking place?\n\n \n \n We've endured all the talking point repetitions before. \"Have you seen the movie?\" was the question, do we take that you have not?", 
   {}, 
   326026, 
   null, 
   1222990140.0
  ], 
  [
   326050, 
   null, 
   "shatnerpossum", 
   "The NRA had Ulysses S. Grant, who was a union soldier as their eighth president in 1883, not Robert E. Lee who was a confederate soldier that supported slavery and keeping blacks \"in their place where they belonged\"! \n\n \n Don't insult Lee. He fought to protect his State's sovereignty. Slavery was not a major issue for him. He even led to the CS policy of enlisting blacks as condition for freedom. \n \n I'm a Confederate reenactor, and it ###### me off when people don't respect the reasons we fought. It wasn't slavery. It wasn't racism.", 
   {}, 
   325973, 
   null, 
   1222990500.0
  ], 
  [
   326062, 
   null, 
   "grizzly6626", 
   "When someone uses the term \"obvious\" get ready for an unsupported assertion. Proof may exist but would probably be hard to obtain. Erroneous? Assumes facts not in evidence. Accusation? What I said can hardly be claimed an accusation. I said I'd bet. That's all. Anti-gun? How so? Does the fact that so many criminals have guns like you make you pro-criminal? Confuse and mislead the public? There's a lot of that on both sides of the gun issue. I try not to contribute to that. I think my posts in this arena will show that. I can't help who your bedfellows are.\n\n \n Sinjin, does the fact that you have a car, like so many drunk drivers who have killed children, make you a chilld killing drunk driver.", 
   {}, 
   326011, 
   null, 
   1222992240.0
  ], 
  [
   326079, 
   null, 
   "sinjin", 
   "Sinjin, does the fact that you have a car, like so many drunk drivers who have killed children, make you a chilld killing drunk driver.\nNow you're catchin' on.emoticon_xgood I never said most NRA members are in the Klan, I said I'd bet many Klansmen are members of the NRA. See the difference?", 
   {}, 
   326062, 
   null, 
   1223000160.0
  ], 
  [
   326086, 
   null, 
   "Omegamon_X", 
   "Now you're catchin' on.emoticon_xgood I never said most NRA members are in the Klan, I said I'd bet many Klansmen are members of the NRA. See the difference?\n\n \n You know who else is in the NRA? Police, military and politicians. Are you saying that people in these fields are Klansmen?", 
   {}, 
   326079, 
   null, 
   1223005080.0
  ], 
  [
   326115, 
   null, 
   "snakespit", 
   "To answer your question simply...yes, I have seen it. I didn't watch it to hear MM's opinion one way or another as a supporter of guns, rather I watched it because MM is so sexy that I just can't help myself from getting a look at that big, sweaty, hairy man-beast. emoticon_xclown\n \n In all reality...MM and his films makes me sick.", 
   {}, 
   326079, 
   null, 
   1223035560.0
  ], 
  [
   326193, 
   null, 
   "sinjin", 
   "You know who else is in the NRA? Police, military and politicians. Are you saying that people in these fields are Klansmen?\n\"Some of those that were enforcers are the same that burned crosses\" \n - Zack de la Rocha\n \n \"Seale and Edwards had faced state murder charges in the case in 1964, but federal prosecutors said they were quickly thrown out \n because local law enforcement officers were in collusion with the Klan.\"\n http://www.msnbc.msn.com/id/26662519/\n \n http://books.google.com/books?id=2-84635lwKYC&pg=PA101&lpg=PA101&dq=police+were+klansmen&source=web&ots=x8zPlvWpS2&sig=gck9wr1WiYZp-vXdN9F8tj9JGOU&hl=en&sa=X&oi=book_result&resnum=6&ct=result", 
   {}, 
   326086, 
   null, 
   1223060340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How many pro-gun people have ever watched the documentary, Bowling for Columbine?", 
  "url": "http://www.4forums.com/political/gun-control-debates/11674-how-many-pro-gun-people-have-ever-watched-documentary-bowling-columbine.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11674, 
  "discussion_files": [
   [
    "23033.html", 
    "http://www.4forums.com/political/gun-control-debates/11674-how-many-pro-gun-people-have-ever-watched-documentary-bowling-columbine-print.html"
   ], 
   [
    "23034.html", 
    "http://www.4forums.com/political/gun-control-debates/11674-how-many-pro-gun-people-have-ever-watched-documentary-bowling-columbine-2-print.html"
   ]
  ], 
  "identifier": 11674
 }
]