[
 [
  [
   326155, 
   null, 
   "Ethmi", 
   "Why is it the the Soviet union, British Empire, and many other dictatorships set up Government regulated churches? It seems that independent religion is an obstacle to dictators. They have to suppress freedoms.", 
   {
    "post_info": {
     "post_title": "New Question"
    }
   }, 
   null, 
   null, 
   1223052180.0
  ], 
  [
   326213, 
   null, 
   "Jo Bennett", 
   "By the time the British Empire could be called that, Britain was a democracy (or thereabouts), and had been religiously plural for some time. At the height of the Empire toward the end of the 19th century the Church in Wales was disestablished in response to the growth of Methodism, and many other sects, Congregationalists, Baptists, Quakers, etc. could all be found in Britain's major cities. The end of religious monopoly largely coincided with the beginning of Empire, so you have it backward.\n \n A more sensible example would be the Reichschurch set up by Hitler, to avoid true Christianity being preached and undermining the Reich. You might also look at the opposition of the Chinese to the Roman Catholic church - it's not so much a matter of freedom as loyalty to an external power. Let's not forget that Catholics are still regarded with some suspicion in US politics, certainly when JFK was elected. I think democracies are just as capable of religious exclusivity as dictatorships. Just think about the furore over the thought that Obama might be a Muslim.", 
   {}, 
   326155, 
   null, 
   1223065680.0
  ], 
  [
   326222, 
   null, 
   "Kronus", 
   "Why is it the the Soviet union, British Empire, and many other dictatorships set up Government regulated churches? It seems that independent religion is an obstacle to dictators. They have to suppress freedoms.\n\n \n Saying that dictators suppress freedom is hardly shocking news. :) Your choice of examples aside, it would seem like a fairly straightforward question. Dictators want supreme power, religions vest power in priests, therefore religions are a threat to the dictators monopoly on power. Either do away with religion or take it over and have the priests support you.", 
   {}, 
   326155, 
   null, 
   1223070360.0
  ], 
  [
   326229, 
   null, 
   "sinjin", 
   "Why is it the the Soviet union, British Empire, and many other dictatorships set up Government regulated churches? It seems that independent religion is an obstacle to dictators. They have to suppress freedoms.\nPlease tell us more about the Soviet Union's government regulated church. Sounds fascinating. \n And with respect to Great Britain, the RCC was an impediment to divorce. \n Were you homeschooled?\n \"I'm Henery the Eighth I am, Henery the Eighth I am, I am. I got married to the widow next door...\"", 
   {}, 
   326155, 
   null, 
   1223071620.0
  ], 
  [
   330222, 
   null, 
   "obvious_child", 
   "The British Empire was a dictatorship?\n \n That's news to me. Last I checked, they were a parliamentary system and had been for at least several hundred years.", 
   {}, 
   326229, 
   null, 
   1225259940.0
  ], 
  [
   330228, 
   null, 
   "Jo Bennett", 
   "Interesting how Ethmi utterly abandoned this thread once his arguments were demolished...", 
   {}, 
   330222, 
   null, 
   1225273620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  New Question", 
  "url": "http://www.4forums.com/political/religion-debates/11685-new-question.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 11685, 
  "discussion_files": [
   [
    "28353.html", 
    "http://www.4forums.com/political/religion-debates/11685-new-question-print.html"
   ]
  ], 
  "identifier": 11685
 }
]