[
 [
  [
   326473, 
   null, 
   "isly ilwott", 
   "...some research may show that his lover of the time when good old Barney was busy defeating McCain's et al efforts to reform Fannie Mae and Freddie Mac worked for Fannie Mae.\n \n \n ...and guess what he was doing. He was developing their plan for sub-prime mortgages.\n \n \n It is no wonder Barney was in favor of letting the cash cow continue to pump dollars into his cronies pockets. His lover was part of the action. I think old Barney himself got some $40,000 out of Fannie Mae...free money...to him...\n \n I do wonder why the MSM has been silent about this. I also wonder if it had been Sarah Palin and a lover in a similar scenario if we'd see anything else on the front page.", 
   {
    "post_info": {
     "post_title": "And speaking of Barney Frank's motives..."
    }
   }, 
   null, 
   null, 
   1223310540.0
  ], 
  [
   326474, 
   null, 
   "Truthsayer", 
   "That's very interesting. \n \n Got a link?", 
   {}, 
   326473, 
   null, 
   1223311380.0
  ], 
  [
   326475, 
   null, 
   "isly ilwott", 
   "That's very interesting. \n \n Got a link?\nHow about two or more?\n \n http://businessandmedia.org/printer/2008/20080924145932.aspx\n http://www.foxnews.com/story/0,2933,432501,00.html\n http://www.dvorak.org/blog/?p=25759\n http://clipmarks.com/clipmark/83D1F949-E399-4BEB-8BC5-74C796F9E95F/\n http://www.hyscience.com/archives/2008/10/barney_franks_g.php", 
   {}, 
   326474, 
   null, 
   1223314440.0
  ], 
  [
   326479, 
   null, 
   "chester", 
   "isly,\n \n Got a link that's not a front for some hard right radical fringe activist?\n \n Got a link that isn't homophobic, talking endlessly about Congressman Frank's gay lover?\n \n Got any links which talk about anything after 1998, which, if you haven't noticed, was 10 years ago?\n \n IOW, got any serious links?\n \n OLD NEWS!!\n \n Didn't think so.", 
   {}, 
   326475, 
   null, 
   1223319780.0
  ], 
  [
   326480, 
   null, 
   "Ethmi", 
   "isly,\n \n Got a link that's not a front for some hard right radical fringe activist?\n \n Got a link that isn't homophobic, talking endlessly about Congressman Frank's gay lover?\n \n Got any links which talk about anything after 1998, which, if you haven't noticed, was 10 years ago?\n \n IOW, got any serious links?\n \n OLD NEWS!!\n \n Didn't think so.\n\n \n Refutation of his point is useless unless you provide the truth. Try taking some armour rather than just a sword this time. Claims of bias are speculation; they don't do anything to prove that there are factual errors, and normally aren't helpful at all unless you're dealing with statistics. It seems that anything that doesn't support you is written by \"some hard right radical religous lunatic fringe activist\", and is wrong the the nth degree. Sorry, but it doesn't work that way, especially not when you refuse to provide on-topic info of your own. You seem to think that anything that doesn't support you is written by some \"hard right radical religous lunatic fringe activist\" and is wrong the the nth degree. Sorry, but it doesn't work that way, especially when you refuse to provide any on-topic info of your own.", 
   {}, 
   326479, 
   null, 
   1223320260.0
  ], 
  [
   326488, 
   null, 
   "isly ilwott", 
   "isly,\n \n Got a link that's not a front for some hard right radical fringe activist?\n \n Got a link that isn't homophobic, talking endlessly about Congressman Frank's gay lover?\n \n Got any links which talk about anything after 1998, which, if you haven't noticed, was 10 years ago?\n \n IOW, got any serious links?\n \n OLD NEWS!!\n \n Didn't think so.\nAh, I see. The quintessential weak argument of those that excuse the bad behavior of their fellow liberals...attack and dismiss the sources as \"not worthy of serious consideration\" whether the information is correct or not. What you need to do, chester, is find some information that refutes the claims made here.\n \n Whether old or new news, it is true. Barney had a serious conflict of interest going there when he was stiff-arming the efforts of reformers to control the graft in the institutions that his lovemate was helping manipulate. I can safely say that had McCain been fighting the reform while Cindy worked for Fannie Mae, you'd be hearing about it everyday from the same liberal XXXXXX that today want to ignore this issue...including chester and his ilk.\n \n This is just one stroke of the brush in the making of a group portrait of crooks and liars associated with Fannie Mae and Freddie Mac. What one likely will see when the portrait is completed is that the Democrats monopolize the list of those receiving the most campaign funds, salaries and bonuses from them. Franklin Raines should be indicted for fraud and made to pay back most of his 90 million theft of funds.\n \n If it is true that actions prove more than words, then there must be some value in reviewing the history of a person or a group such as the liberal Democrats to get an idea of how they will likely perform in the future, despite their empty promises for the future and claims of being innocent in the past.", 
   {}, 
   326479, 
   null, 
   1223323020.0
  ], 
  [
   326500, 
   null, 
   "Truthsayer", 
   "isly,\n \n Got a link that's not a front for some hard right radical fringe activist?\n \n Got a link that isn't homophobic, talking endlessly about Congressman Frank's gay lover?\n \n Got any links which talk about anything after 1998, which, if you haven't noticed, was 10 years ago?\n \n IOW, got any serious links?\n \n OLD NEWS!!\n \n Didn't think so.\n\n \n In other words, do you have a link that is from a leftwingnut, democrat or liberal newsrag? You know, a \"credible\" link? :xbanghead\n \n Thanks for the link Isly. I won't discount them simply because they are from a rightwing propaganda site. I will take that into consideration when I check it out for myself. Even a broken clock is right twice a day.", 
   {}, 
   326479, 
   null, 
   1223326440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  And speaking of Barney Frank's motives...", 
  "url": "http://www.4forums.com/political/elections-debates/11697-speaking-barney-franks-motives.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11697, 
  "discussion_files": [
   [
    "17124.html", 
    "http://www.4forums.com/political/elections-debates/11697-speaking-barney-franks-motives-print.html"
   ]
  ], 
  "identifier": 11697
 }
]