[
 [
  [
   326532, 
   null, 
   "Ethmi", 
   "I know that not all of you believe that the person you're voting for will be good for the economy, but some of you do. I just want to know who believes what.", 
   {
    "post_info": {
     "post_title": "What do you believe?"
    }
   }, 
   null, 
   null, 
   1223338920.0
  ], 
  [
   326542, 
   null, 
   "jyoshu", 
   "The only problem I have with this poll is that it sort of assumes voting will be based on this issue. (Given the middle option.) For some, the economy isn't necessarily the most important issue to influence voting.", 
   {}, 
   326532, 
   null, 
   1223346060.0
  ], 
  [
   326579, 
   null, 
   "isly ilwott", 
   "It also appears to overlook the thought that if one is the lessor of two evils regarding the economy, that one will be beneficial to the economy in that it will either grow more or recede less under the lessor of two evils.", 
   {}, 
   326542, 
   null, 
   1223393220.0
  ], 
  [
   326646, 
   null, 
   "Ethmi", 
   "It seems that Chester has voted \"Obama will be good for the economy\". I would like him to back this up; though if he posts here, I only expect him to change the subject to his pathetic attempts to bash McCain.", 
   {}, 
   326579, 
   null, 
   1223407320.0
  ], 
  [
   326666, 
   null, 
   "Jo Bennett", 
   "Well generally the redistribution of wealth from rich to poor has economic benefits from the multiplier effect. Whether Obama can be said to advocate such a policy is another matter. Generally spending large amount of money on wars is bad for the economy.", 
   {}, 
   326646, 
   null, 
   1223410080.0
  ], 
  [
   326682, 
   null, 
   "isly ilwott", 
   "Well generally the redistribution of wealth from rich to poor has economic benefits from the multiplier effect. Whether Obama can be said to advocate such a policy is another matter. Generally spending large amount of money on wars is bad for the economy.\nIf you don't know that Obama advocates redistribution of wealth, you haven't been awake for the past couple of years.", 
   {}, 
   326666, 
   null, 
   1223412420.0
  ], 
  [
   326693, 
   null, 
   "chester", 
   "If you don't know that Obama advocates redistribution of wealth, you haven't been awake for the past couple of years.\n\n \n You say this as though it were a BAD thing.\n \n Why weren't you saying this during the present malAdministration when the country experienced the greatest upward redistribution of wealth in its history?\n \n Are you rich, or are you merely a SHONDA for those who are?", 
   {}, 
   326682, 
   null, 
   1223416080.0
  ], 
  [
   326752, 
   null, 
   "Ethmi", 
   "You say this as though it were a BAD thing.\n \n Why weren't you saying this during the present malAdministration when the country experienced the greatest upward redistribution of wealth in its history?\n \n Are you rich, or are you merely a SHONDA for those who are?\n\n \n Oh, nothing's wrong with that except for the fact that it'll take CEO's incentive to invest the money in our economy rendering our economy worthless, thereby putting us in a severe depression. There's nothing to worry about! You have just capitalized, boldfaced, and italicized to me that you don't have a clue what you're saying.", 
   {}, 
   326693, 
   null, 
   1223438400.0
  ], 
  [
   326771, 
   null, 
   "Jo Bennett", 
   "If you don't know that Obama advocates redistribution of wealth, you haven't been awake for the past couple of years.\n\n \n I know the right has been claiming he does. I haven't seen any policy of his that actually advocates it.\n \n Earning 1 million instead of 2 million will do absolutely no harm to a CEO's incentive, and his business will do a whole lot better when ordinary people have more money in their pockets to buy his products. Taxing profits will actually encourage investment rather than short term bottom line thinking.", 
   {}, 
   326682, 
   null, 
   1223446080.0
  ], 
  [
   326775, 
   null, 
   "chester", 
   "I know the right has been claiming he does. I haven't seen any policy of his that actually advocates it.\n \n Earning 1 million instead of 2 million will do absolutely no harm to a CEO's incentive, and his business will do a whole lot better when ordinary people have more money in their pockets to buy his products. Taxing profits will actually encourage investment rather than short term bottom line thinking.\n\n \n Agreed, but it seems you have to increase your estimates of the CEO's salaries by a factor of 50.\n \n Personally, I like the tax system in Finland.\n \n All personal income over $1M per annum is taxed at 100%. Looking at Nokia's success, it doesn't seem to have hurt the Finns.\n \n Of course, the Finns have a much more highly developed sense of community that the average member of the hard right religious radical fringe - the ones who go to Clint Eastwood and Rambo films and think they're documentaries.emoticon_mad", 
   {}, 
   326771, 
   null, 
   1223446800.0
  ], 
  [
   326783, 
   null, 
   "snakespit", 
   "Agreed, but it seems you have to increase your estimates of the CEO's salaries by a factor of 50.\n \n Personally, I like the tax system in Finland.\n \n All personal income over $1M per annum is taxed at 100%. Looking at Nokia's success, it doesn't seem to have hurt the Finns.\n \n Of course, the Finns have a much more highly developed sense of community that the average member of the hard right religious radical fringe - the ones who go to Clint Eastwood and Rambo films and think they're documentaries.emoticon_mad\n\n Sorry, for some reason I seem to be having trouble posting links. I'll save you the suspense...it was a link to a Finn Real Estate site.", 
   {}, 
   326775, 
   null, 
   1223460240.0
  ], 
  [
   326793, 
   null, 
   "chester", 
   "here you go...\n\n \n And your implication is...?", 
   {}, 
   326783, 
   null, 
   1223477520.0
  ], 
  [
   326807, 
   null, 
   "grizzly6626", 
   "I think most politicians are liars and crooks, in it for themselves. You and me dont matter to washington, we are nothing more than a readily available source of labor and money. Washington spends trillions helping other nations that hate us to begin with. With the exceptions of Europe and Israel, I wish our government would just tell the rest of the world to fend for themselves, and start using that money to help our country. OPEC gets a big chunk of their money from the US, and they got greedy, plain and simple. If we would quit buying their 100 dollar a barrell oil for a while, their pocket book will suffer a lot and maybe then they will price their oil at a reasonable fee. I know it would hurt here for a while if this happened, but in the long run we would benefit because gas would go down a lot. The gas companies here also need to be hit hard, because all of them are reporting record breaking profits by gauging us at the pumps, but then the gas companies turn around and say that most of those profits are going into research. The only place those profits are really going is in someones pocket. Sorry, I just discovered I am off topic. Anyhow back to the topic, I think we should just vote out everyone in washington who is not in it for us, and put all new people in office, and if those new people dont work for the people of America, we vote them right back out. Eventually politicians will get the message.", 
   {}, 
   326793, 
   null, 
   1223485620.0
  ], 
  [
   326894, 
   null, 
   "isly ilwott", 
   "I know the right has been claiming he does. I haven't seen any policy of his that actually advocates it.\n \n ..... \nTry the so-called \"windfall profits tax\" on the \"big oil companies\". He wants to give each of us a thousand dollars...to be taken from the oil companies 'excessive' profits.\n \n He has no interest in reminding us that the profit margins for the oil companies are not huge. It's the volume of oil products that we consume with our great demand for three or four cars in every garage that makes the oil companies profits seem huge. It's that BIG number that we see posted as oil company profit that makes the redistribution seem fair to the welfare Democrats.\n \n Maybe he should consider a windfall profits tax on Hollywood every time they come up with a movie that makes 150 million in its first month in the theaters.\n \n How about a windfall profits tax on Nike for making so much money on their use of twenty cent labor to make their two hundred dollar sneakers?\n \n So far, he's only proposed the oil profits tax...along with Hillary.\n \n What they don't tell you is that if we tax profits enough, companies will stop trying so hard to make profits, investors will withhold exoansion capaital and profits will decrease to the point that jobs are lost and NOBODY BENEFITS. I wonder continually why this reality is so hard to grasp.", 
   {}, 
   326771, 
   null, 
   1223501220.0
  ], 
  [
   326953, 
   null, 
   "T.Q", 
   "Try the so-called \"windfall profits tax\" on the \"big oil companies\". He wants to give each of us a thousand dollars...to be taken from the oil companies 'excessive' profits.\n \n He has no interest in reminding us that the profit margins for the oil companies are not huge. It's the volume of oil products that we consume with our great demand for three or four cars in every garage that makes the oil companies profits seem huge. It's that BIG number that we see posted as oil company profit that makes the redistribution seem fair to the welfare Democrats.\n\n \n Palin is a welfare Democrat? Because what you're deriding is something that she instituted in Alaska, something she is quite proud of and is campaigning on.", 
   {}, 
   326894, 
   null, 
   1223514900.0
  ], 
  [
   326979, 
   null, 
   "chester", 
   "What do I believe?\n \n I believe the Rebuttlickans are in the process of trying to pull off a coup d'etat.\n \n Here's why: http://www.nytimes.com/2008/10/09/us/politics/09voting.html?hpemoticon_angry\n \n Also, do not be surprised if there is another Gulf of Tonkin incident between now and Election day, this time in the Strait of Hormuz.", 
   {}, 
   326953, 
   null, 
   1223526420.0
  ], 
  [
   327142, 
   null, 
   "lpdm", 
   "I believe that they are both kinda bad I prefer Obama because he's gonna end the war in iraq", 
   {}, 
   326953, 
   null, 
   1223614740.0
  ], 
  [
   327144, 
   null, 
   "Ethmi", 
   "I believe that they are both kinda bad I prefer Obama because he's gonna end the war in iraq\n\n \n How would this be a good thing? Terrorist organizations have already plotted to destroy America; nineteen plots have been foiled ever since the war started. The Islamic Jihadists shipped all the nukes they were hiding in Iraq to Syria, but the media didn't seem to make a big deal about this. I guess they worship Nanci Pelosi, or something. But aside from that, if these people haven't given up after nineteen plots, what makes you think they would hesitate to formulate another one? Pulling the troops would be just the opportunity they need; an act that they interpret as weakness. It's an act we will regret.", 
   {}, 
   327142, 
   null, 
   1223623800.0
  ], 
  [
   327169, 
   null, 
   "isly ilwott", 
   "What do I believe?\n \n I believe the Rebuttlickans are in the process of trying to pull off a coup d'etat.\n \n Here's why: http://www.nytimes.com/2008/10/09/us/politics/09voting.html?hpemoticon_angry\n \n Also, do not be surprised if there is another Gulf of Tonkin incident between now and Election day, this time in the Strait of Hormuz.\nA proper response would address the poll questions. Since you have switched to allegations of election fraud, answer these two questions. What group is being investigated in at least 15 states in regard to allegations of fraud involving registration of 'new voters'? Which presidential candidate is the only one ever to be associated with that group?", 
   {}, 
   326979, 
   null, 
   1223652480.0
  ], 
  [
   327170, 
   null, 
   "isly ilwott", 
   "I believe that they are both kinda bad I prefer Obama because he's gonna end the war in iraq\nMcCain will end the war, too. The only difference is that McCain will do it with a victory...Obama will withdraw in defeat.\n \n Obama will end the growth and prosperity of this nation with his economic plan. He and the Democrats would rather raise taxes and control more of what government does for us, McCain wants to keep taxes low and let us control ourselves.\n \n McCain's plan will cost us far less than Obama's.\n \n Obama is a Marxist.", 
   {}, 
   327142, 
   null, 
   1223652780.0
  ], 
  [
   327178, 
   null, 
   "Archangel", 
   "A proper response would address the poll questions. Since you have switched to allegations of election fraud, answer these two questions. What group is being investigated in at least 15 states in regard to allegations of fraud involving registration of 'new voters'? Which presidential candidate is the only one ever to be associated with that group?\n\n \n You don't really expect chester to honestly acknowledge the pervasive corruption within the democratic party do you? You know all too well that he is here to make unfounded accusations while proving nothing in a substantial way at all. Corruption like this: WIDENING Allegations of Civil Rights Violations by the Obama Campaign Or this: ACORN Vegas Office Raided in Voter Fraud Investigation", 
   {
    "post_info": {
     "post_title": "Corruption, the democratic parties mantra for assured victory!"
    }
   }, 
   327169, 
   null, 
   1223654820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What do you believe?", 
  "url": "http://www.4forums.com/political/elections-debates/11701-what-do-you-believe.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11701, 
  "discussion_files": [
   [
    "32631.html", 
    "http://www.4forums.com/political/elections-debates/11701-what-do-you-believe-print.html"
   ], 
   [
    "32632.html", 
    "http://www.4forums.com/political/elections-debates/11701-what-do-you-believe-2-print.html"
   ]
  ], 
  "identifier": 11701
 }
]