[
 [
  [
   326562, 
   null, 
   "Bassman", 
   "Democrats are not clean and pure as the wind driven snow, they do not have an absolute birthright to govern, and they certainly are not the only ones qualified to govern!", 
   {
    "post_info": {
     "post_title": "Contrary to popular opinion..."
    }
   }, 
   null, 
   null, 
   1223358240.0
  ], 
  [
   326565, 
   null, 
   "Jo Bennett", 
   "Strawman...\n \n The only good thing I have to say about the Democrats is that at least they're not Republicans.", 
   {}, 
   326562, 
   null, 
   1223359620.0
  ], 
  [
   326566, 
   null, 
   "Bassman", 
   "Strawman...\n \n The only good thing I have to say about the Democrats is that at least they're not Republicans.\n\n Why?? Why do you have such a problem with Conservatism?? Oh, but I forgot, you live in that Worker's Paradise known as England.", 
   {}, 
   326565, 
   null, 
   1223360040.0
  ], 
  [
   326570, 
   null, 
   "Big_Bear_Scot", 
   "Why?? Why do you have such a problem with Conservatism?? Oh, but I forgot, you live in that Worker's Paradise known as England.\n\n \n I can just imagine Jo praising his dear leader Gordon Brown emoticon_smile\n \n It is also arguable whether the Republican party is actually Conservative. Just look at the facts for a moment, a Republican President has nationalised banks and now wants to use public money to bail out the rest of financial system. Doesn't seem like a traditional Conservative action to me.\n \n \nStrawman...\n \n The only good thing I have to say about the Democrats is that at least they're not Republicans.\n\n \n They are both the different sides of the Capitalist coin. They are both beholden to the same special interests, in effect a different President will probably have the same policies as Bush but with a slightly different PR image.\n \n The only really difference between them is how they want Government to interfere in people's lives. The Dems want more economic control and Reps want more Government interference on Social issues. \n \n \nDemocrats are not clean and pure as the wind driven snow, they do not have an absolute birthright to govern, and they certainly are not the only ones qualified to govern!\n\n \n Judging by both parties performance in the current climate I would say none of them deserve to govern.", 
   {
    "unicode_changes_made": true
   }, 
   326566, 
   null, 
   1223376300.0
  ], 
  [
   326581, 
   null, 
   "isly ilwott", 
   "The differences between Democrats and Republicans keep changing. The difference between liberalism and conservatism is constant. Both parties have some of each.\n \n The Democrats have put up their most liberal, the Republicans have put up a centrist.\n \n I cannot vote for the most liberal...in this case, a Marxist Barack Hussein Obama...no way. I'd rather have anarchy than Obama.", 
   {}, 
   326570, 
   null, 
   1223394900.0
  ], 
  [
   326582, 
   null, 
   "daewoo", 
   "Why?? Why do you have such a problem with Conservatism?? Oh, but I forgot, you live in that Worker's Paradise known as England.\n\n \n \"Republicans\", Bassman, not \"Conservatism\" \n \n BIG, HUGE difference. You are a republican, but NOT a conservative. I am a conservative but NOT (anymore) a republican.", 
   {}, 
   326566, 
   null, 
   1223394960.0
  ], 
  [
   326585, 
   null, 
   "Kronus", 
   "The differences between Democrats and Republicans keep changing. The difference between liberalism and conservatism is constant. Both parties have some of each.\n \n The Democrats have put up their most liberal, the Republicans have put up a centrist.\n \n I cannot vote for the most liberal...in this case, a Marxist Barack Hussein Obama...no way. I'd rather have anarchy than Obama.\n\n \n That's really pretty funny. Just a few months ago Clinton was the most liberal, the one that was going to drag us into marxism. But now she's out of the picture, and suddenly it's Obama wearing the liberal crown. It's almost as if republicans simply declare whichever democrat they don't like at the moment \"most liberal\", so as to be able to dismiss them without dealing with the actual person. The idea that Obama is the most liberal holds about as much water as calling McCain a centrist. :)", 
   {}, 
   326581, 
   null, 
   1223395680.0
  ], 
  [
   326587, 
   null, 
   "isly ilwott", 
   "That's really pretty funny. Just a few months ago Clinton was the most liberal, the one that was going to drag us into marxism. But now she's out of the picture, and suddenly it's Obama wearing the liberal crown. It's almost as if republicans simply declare whichever democrat they don't like at the moment \"most liberal\", so as to be able to dismiss them without dealing with the actual person. The idea that Obama is the most liberal holds about as much water as calling McCain a centrist. :)\nI do not recall ever claiming that Hillary was the most liberal Democrat. Please show me where I did so.\n \n Obama has been defined as such for a long time. He has the most liberal voting record of them all.\n \n Liberalism runs rampant amongst the Democrats. Obama goes off the chart. I'd rather elect a real dog than Obama. Perhaps I'll write in my neighbors retriever.\n \n ...and I'm not a Republican either.\n \n \n ON edit:\n ...as for dealing with the actual person, the more I look into Barack Obama's history, the less I like him. Whether the liberals are able to realize that history means more than promises is yet to be seen. Listening to his empty promises of change for the better is like hearing the broken record of promises made for decades by both sides. Studying his friends, acquaintances, mentors, advisors, voting record, previous comments and other indisputable facts concerning this would-be leader's history makes me wonder more each day how far the idiocy of liberalism can be advanced.", 
   {}, 
   326585, 
   null, 
   1223396400.0
  ], 
  [
   326589, 
   null, 
   "Kronus", 
   "I do not recall ever claiming that Hillary was the most liberal Democrat. Please show me where I did so.\n \n Obama has been defined as such for a long time. He has the most liberal voting record of them all.\n\n Not you, republicans in general. There's been a concerted effort to paint Clinton as this great liberal/marxist monster going on for quite some time. Do a quick search through these forums and you'll find plenty of examples. It's just quite recently that Obama has been dubbed \"most liberal\". As I said, it's a title bestowed upon whoever is in the republican crosshairs at the moment, it has little to do with the person in question.\n \n But if you really think that Obama qualifies then feel free to show us just why you think that. Define \"liberal\", and perhaps tell us what's so horrendous about it, then show us why Obama is the most liberal. Simply saying \"look at his voting record\" doesn't tell us anything.", 
   {}, 
   326587, 
   null, 
   1223397480.0
  ], 
  [
   326590, 
   null, 
   "Archangel", 
   "Not you, republicans in general. There's been a concerted effort to paint Clinton as this great liberal/marxist monster going on for quite some time. Do a quick search through these forums and you'll find plenty of examples. It's just quite recently that Obama has been dubbed \"most liberal\". As I said, it's a title bestowed upon whoever is in the republican crosshairs at the moment, it has little to do with the person in question.\n \n But if you really think that Obama qualifies then feel free to show us just why you think that. Define \"liberal\", and perhaps tell us what's so horrendous about it, then show us why Obama is the most liberal. Simply saying \"look at his voting record\" doesn't tell us anything.\n\n \n To accurately point out that Hitlery is a rabid liberal, and a socialist doesn't detract from the fact that Obama voted even to the left of her. They are both just different degrees of the same animal. And YES kronus, both still flaming liberals.", 
   {}, 
   326589, 
   null, 
   1223397720.0
  ], 
  [
   326592, 
   null, 
   "Kronus", 
   "To accurately point out that Hitlery is a rabid liberal, and a socialist doesn't detract from the fact that Obama voted even to the left of her. They are both just different degrees of the same animal. And YES kronus, both still flaming liberals.\n\n \n Except, of course, that wasn't what was being said. She was The Liberal, the most dangerous lefty out there who had to be stopped at all costs! *cue ominous music*\n \n Seriously, what do you guys think the word \"liberal\" means that you think it's such a horrible thing? Or is this simply a case of \"different from you\" = \"bad\"? Come on, give us a definition of liberal. Since you seem to be experts at judging fine degrees of liberalness you must have a very exact notion of what it means, so please share.", 
   {}, 
   326590, 
   null, 
   1223398380.0
  ], 
  [
   326594, 
   null, 
   "isly ilwott", 
   "Not you, republicans in general. There's been a concerted effort to paint Clinton as this great liberal/marxist monster going on for quite some time. Do a quick search through these forums and you'll find plenty of examples. It's just quite recently that Obama has been dubbed \"most liberal\". As I said, it's a title bestowed upon whoever is in the republican crosshairs at the moment, it has little to do with the person in question.\n \n But if you really think that Obama qualifies then feel free to show us just why you think that. Define \"liberal\", and perhaps tell us what's so horrendous about it, then show us why Obama is the most liberal. Simply saying \"look at his voting record\" doesn't tell us anything.\n\n Oh, I see. You debate by using your overall perception of what some group thinks to replace the statements of the person you're addressing. How clever!\n \n I don't have to search any forums to know what I have said.\n \n Obama has been recognized as the most liberal voting senator in Washington ever since he began his quest for the White House...quite possibly even before that. I'll not waste my energy proving the obvious to you.\n \n The fact that Hillary and Obama both have been described as very socialistic, even Marxist, is purely coincidental. They are indeed both on the extreme left side of the curve.\n \n Perhaps you can rebut the following with something besides dismissal of the source.\n \n http://nj.nationaljournal.com/voteratings/\n © National Journal Group Inc.\n Thursday, Jan. 31, 2008 \n \n Sen. Barack Obama, D-Ill., was the most liberal senator in 2007, according to National Journal's 27th annual vote ratings. The insurgent presidential candidate shifted further to the left last year in the run-up to the primaries, after ranking as the 16th- and 10th-most-liberal during his first two years in the Senate. \n \n Sen. Hillary Rodham Clinton, D-N.Y., the other front-runner in the Democratic presidential race, also shifted to the left last year. She ranked as the 16th-most-liberal senator in the 2007 ratings, a computer-assisted analysis that used 99 key Senate votes, selected by NJ reporters and editors, to place every senator on a liberal-to-conservative scale in each of three issue categories. In 2006, Clinton was the 32nd-most-liberal senator. \n \n In their yearlong race for the Democratic presidential nomination, Obama and Clinton have had strikingly similar voting records. Of the 267 measures on which both senators cast votes in 2007, the two differed on only 10. \"The policy differences between Clinton and Obama are so slight they are almost nonexistent to the average voter,\" said Richard Lau, a Rutgers University political scientist.", 
   {}, 
   326589, 
   null, 
   1223398680.0
  ], 
  [
   326597, 
   null, 
   "Kronus", 
   " Oh, I see. You debate by using your overall perception of what some group thinks to replace the statements of the person you're addressing. How clever!\n\n Nope, just using your statement as an example of how perceptions have shifted.\n \n \n\n Obama has been recognized as the most liberal voting senator in Washington ever since he began his quest for the White House...quite possibly even before that. I'll not waste my energy proving the obvious to you. \n\n So you won't debate. Your choice.\n \n \n\n Perhaps you can rebut the following with something besides dismissal of the source. \n\n Oh, so you will debate. Please, make up your mind. :)\n \n \n\n Sen. Barack Obama, D-Ill., was the most liberal senator in 2007, according to National Journal's 27th annual vote ratings. The insurgent presidential candidate shifted further to the left last year in the run-up to the primaries, after ranking as the 16th- and 10th-most-liberal during his first two years in the Senate. \n\n Yup, I've seen that. Nothing in it suggests that it would be better to vote for a dog than Obama, so clearly when they say \"most liberal\" it has nothing to do with whatever you mean by \"liberal\". Define your terms, try to explain what \"liberal\" means to you that is so horrendous, then maybe your applying the term to Obama will make sense.", 
   {}, 
   326594, 
   null, 
   1223399100.0
  ], 
  [
   326598, 
   null, 
   "Archangel", 
   "Except, of course, that wasn't what was being said. She was The Liberal, the most dangerous lefty out there who had to be stopped at all costs! *cue ominous music*\n \n Seriously, what do you guys think the word \"liberal\" means that you think it's such a horrible thing? Or is this simply a case of \"different from you\" = \"bad\"? Come on, give us a definition of liberal. Since you seem to be experts at judging fine degrees of liberalness you must have a very exact notion of what it means, so please share.\n\n \n And if she had won the democratic nomination, she would still be the most liberal candidate IN THE RACE. But since Obama won, he is. You're arguing semantics as the only focus that counts is on the candidate that is running.\n \n But to correct your misperception, during the primaries, we didn't distinguish between her and Obama for most liberal, we recognized them both as dangerous and very liberal. But I remember the stats being posted back them that placed Obama at number one and Hillary at number 16.", 
   {}, 
   326592, 
   null, 
   1223399460.0
  ], 
  [
   326600, 
   null, 
   "iangb", 
   "...actually, I'd like to take up people on Kronus' challenge. Can they explain exactly what they define as 'liberal' and why that makes it so bad?\n \n There's plenty of argument on these boards about people. Maybe one on the ideas behind the people wouldn't be such a bad idea...\n \n EDIT: Oh, and the argument of the OP is made entirely of straw.", 
   {}, 
   326598, 
   null, 
   1223400360.0
  ], 
  [
   326602, 
   null, 
   "isly ilwott", 
   "Nope, just using your statement as an example of how perceptions have shifted.\nThat's laughable. Equating my views with the overall perceptions you have of what the Republicans think is almost as stupid assuming that I am a Republican.\n \n \n\n So you won't debate. Your choice.\n \n \n Oh, so you will debate. Please, make up your mind. :)\nWe not in a formal debate. I merely found a simple way to prove my statement. I would not have analyzed Obama's record on my own to convince you of his liberal voting habits. It has been done for us.\n \n \n\n Yup, I've seen that. Nothing in it suggests that it would be better to vote for a dog than Obama, so clearly when they say \"most liberal\" it has nothing to do with whatever you mean by \"liberal\". Define your terms, try to explain what \"liberal\" means to you that is so horrendous, then maybe your applying the term to Obama will make sense.\nI am not so eager to re-invent the wheel as you may think. If you don't see Obama as liberal, you are not worth discussing anything with.\n \n My opinion regarding the worth of Obama compared to the worth of a dog is not something that has to be proved. The fact that I prefer a dog to Obama also has nothing to do with the definition of \"liberal\".\n \n Maybe you and chester need to debate each other...you have similar styles.", 
   {}, 
   326597, 
   null, 
   1223400600.0
  ], 
  [
   326603, 
   null, 
   "Kronus", 
   "And if she had won the democratic nomination, she would still be the most liberal candidate IN THE RACE. But since Obama won, he is. You're arguing semantics as the only focus that counts is on the candidate that is running.\n\n Ooh, so close! In point of fact what I'm doing is arguing against semantics. I'm arguing against the conservative strategy of labeling whoever they don't like as being \"the most liberal\". At this point all the term means, coming from the right, is \"the person conservatives dislike the most at the moment\". Instead of focusing on the candidate they're just throwing around labels and hoping they'll stick.", 
   {}, 
   326598, 
   null, 
   1223400780.0
  ], 
  [
   326605, 
   null, 
   "Kronus", 
   " That's laughable. Equating my views with the overall perceptions you have of what the Republicans think is almost as stupid assuming that I am a Republican.\n \n\n \n You have no actual interest in trying to read or understand anything I post, do you? Your takes on what I'm saying are so far off base it's kinda funny. Ah well.\n \n \n\n I am not so eager to re-invent the wheel as you may think. If you don't see Obama as liberal, you are not worth discussing anything with.\n\n Do I see him as liberal as you define the term? Who knows, you don't seem willing to say what you think the term means. Your reaction seems to place \"liberal\" about two steps away from \"eating live puppies\", so I tend to doubt I share your exact feelings about how liberal he is.", 
   {}, 
   326602, 
   null, 
   1223401020.0
  ], 
  [
   326607, 
   null, 
   "jyoshu", 
   "Ooh, so close! In point of fact what I'm doing is arguing against semantics. I'm arguing against the conservative strategy of labeling whoever they don't like as being \"the most liberal\". At this point all the term means, coming from the right, is \"the person conservatives dislike the most at the moment\". Instead of focusing on the candidate they're just throwing around labels and hoping they'll stick.\n\n \n Unfortunately, it looks like in this case you didn't get \"close\" in understanding. Archangel JUST explained, in the post you're responding to, that the context that matters here is \"in the race.\" It's hard to imagine how you could have missed that. In such a case, saying Obama is the most liberal (in the race) in quite simply a statement of fact, whether there is is \"dislike\" behind it or not. \n \n Holy context, batman!", 
   {}, 
   326603, 
   null, 
   1223401260.0
  ], 
  [
   326611, 
   null, 
   "Kronus", 
   " Unfortunately, it looks like in this case you didn't get \"close\" in understanding. Archangel JUST explained, in the post you're responding to, that the context that matters here is \"in the race.\" It's hard to imagine how you could have missed that.\n\n I didn't miss it, I ignored it because it was blatantly false but I didn't feel like trying to point that out to Archie. In the debate McCain didn't say that Obama was the most liberal in the race, he said most liberal, as in \"in the senate\". The National Journal didn't rank senators in the race, it ranked senators. If Archie wants to pretend that something else was meant he's free to, but I'm not required to correct every mistake he makes.\n \n \n\n In such a case, saying Obama is the most liberal (in the race) in quite simply a statement of fact, whether there is is \"dislike\" behind it or not. \n \n\n In fact, that would be such a blindingly obvious fact that it would be utterly pointless to point it out, wouldn't it? Why would anyone possibly bother to say such a thing? They wouldn't. If they're calling Obama the most liberal, they mean of all the senators, not all the senators running for president.\n \n \n\n Holy context, batman!\n\n That's still bugging you?! Wow.", 
   {}, 
   326607, 
   null, 
   1223401920.0
  ], 
  [
   326617, 
   null, 
   "simone", 
   "Democrats are not clean and pure as the wind driven snow, they do not have an absolute birthright to govern, and they certainly are not the only ones qualified to govern!\n\n Um, Bassman, so you, the one person in the world who is as \"pure as the wind-driven snow,\" is the one who may judge others, including Democrats. Um, for the record I grew up on the prairie and saw a goodly bit of \"wind-driven snow\" and it was not particularly pure. A feeble and laughable metaphor.", 
   {}, 
   326562, 
   null, 
   1223404140.0
  ], 
  [
   326618, 
   null, 
   "simone", 
   "Why?? Why do you have such a problem with Conservatism?? Oh, but I forgot, you live in that Worker's Paradise known as England.\n\n No problem with conservatives. Their point of view is always needed.\n \n I have severe problems with fiscally reckless and irresponsible borrow, borrow, borrow and spend, spend, spend Republicans.", 
   {}, 
   326566, 
   null, 
   1223404200.0
  ], 
  [
   326620, 
   null, 
   "simone", 
   "To accurately point out that Hitlery is a rabid liberal, and a socialist doesn't detract from the fact that Obama voted even to the left of her. They are both just different degrees of the same animal. And YES kronus, both still flaming liberals.\n\n False, totally false. I commend Barack Obama for his sterling fiscal responsibility, as we discovered, much to the right of, oh, excuse me, why are we making comparisons with Hitler, Archie?\n \n Geeze, this is the 21st century, idiot boy, not the early 20th. \n \n Drinking too much Kool-Aid? In some sort of time warp?", 
   {}, 
   326590, 
   null, 
   1223404440.0
  ], 
  [
   326623, 
   null, 
   "isly ilwott", 
   "....\n In fact, that would be such a blindingly obvious fact that it would be utterly pointless to point it out, wouldn't it? Why would anyone possibly bother to say such a thing? They wouldn't. If they're calling Obama the most liberal, they mean of all the senators, not all the senators running for president.\n \n \n .....\nHow illogical of you. If Obama is the most liberal of all the senators, he has to be the most liberal senator running for president. There're only two people running for president, and both are senators.", 
   {}, 
   326611, 
   null, 
   1223404980.0
  ], 
  [
   326624, 
   null, 
   "simone", 
   "How illogical of you. If Obama is the most liberal of all the senators, he has to be the most liberal senator running for president. There're only two people running for president, and both are senators.\n\n For the record, Obama is more liberal than McCain, but he is far from the most liberal Senator.\n \n The most liberal senator is Bernie Sanders, then Russ Feingold of Wisconsin, next probably Barbara Boxer of California or even possibly Senator Dorgan of North Dakota. Obama hasn't much a rating for being liberal.", 
   {}, 
   326623, 
   null, 
   1223405340.0
  ], 
  [
   326630, 
   null, 
   "isly ilwott", 
   "For the record, Obama is more liberal than McCain, but he is far from the most liberal Senator.\n \n The most liberal senator is Bernie Sanders, then Russ Feingold of Wisconsin, next probably Barbara Boxer of California or even possibly Senator Dorgan of North Dakota. Obama hasn't much a rating for being liberal.\nThat explains why he's been identified as the most liberal voting senator of 2007...because he hasn't much of a rating.\n \n Honestly, it is amusing when liberals try to explain things.", 
   {}, 
   326624, 
   null, 
   1223405940.0
  ], 
  [
   326634, 
   null, 
   "Kronus", 
   "How illogical of you. If Obama is the most liberal of all the senators, he has to be the most liberal senator running for president. There're only two people running for president, and both are senators.\n\n \n Is there even any point in trying to explain that you've once again misunderstood me? Are you doing it on purpose, throwing up strawmen rather than actually engaging the points I'm raising, or are you just not very good with reading comprehension when it comes to ideas you don't like?", 
   {}, 
   326623, 
   null, 
   1223406300.0
  ], 
  [
   326636, 
   null, 
   "simone", 
   "That explains why he's been identified as the most liberal voting senator of 2007...because he hasn't much of a rating.\n \n Honestly, it is amusing when liberals try to explain things.\n\n Forgive me, Ilsott, for thinking you had more of a brain and understanding than you actually have. I won't trouble you again with reason, rationality, reality, etc.", 
   {}, 
   326630, 
   null, 
   1223406480.0
  ], 
  [
   326642, 
   null, 
   "jyoshu", 
   "For the record, Obama is more liberal than McCain, but he is far from the most liberal Senator. The most liberal senator is Bernie Sanders, then Russ Feingold of Wisconsin, next probably Barbara Boxer of California or even possibly Senator Dorgan of North Dakota. Obama hasn't much a rating for being liberal.\n\n \n Ted Kennedy HAS to be in there somewhere.", 
   {}, 
   326624, 
   null, 
   1223407140.0
  ], 
  [
   326648, 
   null, 
   "Kronus", 
   "Ted Kennedy HAS to be in there somewhere.\n\n \n I guess that depends on your defintions. How do you define liberal?", 
   {}, 
   326642, 
   null, 
   1223407440.0
  ], 
  [
   326649, 
   null, 
   "isly ilwott", 
   "Forgive me, Ilsott, for thinking you had more of a brain and understanding than you actually have. I won't trouble you again with reason, rationality, reality, etc.\nThat won't require that you change anything. I haven't seen much of that from you anyway.", 
   {}, 
   326636, 
   null, 
   1223407440.0
  ], 
  [
   326653, 
   null, 
   "Big_Bear_Scot", 
   "The differences between Democrats and Republicans keep changing. The difference between liberalism and conservatism is constant. Both parties have some of each.\n \n The Democrats have put up their most liberal, the Republicans have put up a centrist.\n \n I cannot vote for the most liberal...in this case, a Marxist Barack Hussein Obama...no way. I'd rather have anarchy than Obama.\n\n \n Obama a Marxist? \n \n I would call myself a Marxist and I would never support Obama. Could you point to the Marxist policies of Obama?\n \n Does he want to Nationalise the means of production?\n Does he support worker coops?\n \n I think we should really define what a Liberal/Conservative/Marxist is, because it seems like a few people in this thread don't know what the terms mean.", 
   {}, 
   326649, 
   null, 
   1223407860.0
  ], 
  [
   326659, 
   null, 
   "simone", 
   "Ted Kennedy HAS to be in there somewhere.\n\n Oops! Thank you, Jyoshu, for the reminder! You are quite right.", 
   {}, 
   326642, 
   null, 
   1223408940.0
  ], 
  [
   326678, 
   null, 
   "Kronus", 
   "Oops! Thank you, Jyoshu, for the reminder! You are quite right.\n\n \n Ok, maybe you'll play. :)\n \n How do you define liberal?", 
   {}, 
   326659, 
   null, 
   1223411580.0
  ], 
  [
   326684, 
   null, 
   "isly ilwott", 
   "Obama a Marxist? \n \n I would call myself a Marxist and I would never support Obama. Could you point to the Marxist policies of Obama?\n \n Does he want to Nationalise the means of production?\n Does he support worker coops?\n \n I think we should really define what a Liberal/Conservative/Marxist is, because it seems like a few people in this thread don't know what the terms mean.\n\n \n \n \n \n Who said this?\n \"I chose my friends carefully. The more politically active black students. The foreign students. The Chicanos. The Marxist professors and structural feminists and punk-rock performance poets.\"\n http://beartracks.wordpress.com/2008/06/06/obama-and-karl-marx-and-stalin-quotes/\n \n \n http://nalert.blogspot.com/2008/02/obamas-socialist-relationships.html\n The Democratic Socialists of America(DSA) is America largest socialist organization with an easy to understand goal.Here's a quote from their website:\n We are socialists because we reject an international economic order sustained by private profit\n \n http://www.dsausa.org/about/index.html\n \n \n http://aclockworkobama.com/\n especially revealing\n \n \n \n \n http://www.ibdeditorials.com/IBDArti...02137342405551 \n \n http://www.nicenetruth.com/home/2008...s-marxist.html\n \n http://www.renewamerica.us/columns/vernon/080526\n \n http://messageboards.ivillage.com/n/...=16650.1&ctx=0\n \n http://theconservativepost.com/WordPress/?p=485\n \n http://www.aim.org/aim-report/is-bar...-marxist-mole/", 
   {
    "unicode_changes_made": true
   }, 
   326653, 
   null, 
   1223412660.0
  ], 
  [
   326686, 
   null, 
   "simone", 
   "Kronus, the terms \"liberal\" and \"conservative\" are quite fluid. I'm going to steal definitions, giving attribution, and indicate why I disagree with those definitions.\n \n From:\n http://www.studentnewsdaily.com/other/conservative-vs-liberal-beliefs/\n \n \nCONSERVATIVES - believe in personal responsibility, limited government, free markets, individual liberty, traditional American values and a strong national defense. Believe the role of government should be to provide people the freedom necessary to pursue their own goals. \n \n Conservative policies generally emphasize empowerment of the individual to solve problems.\n\n No. Liberals also believe in personal responsibility, fiscal responsibility. Liberals also believe in individual liberty, often more than conservatives do. The American Bill of Rights is largely a liberal creation.\n \n Liberals believe that there should be enough government -- we the people are the government, the government is for our benefit, we are also the governed by our common agreement. Liberals believe that there should be enough government to stand as guarantor to our Bill of Rights, to see that our American principles of Life, Liberty and the Pursuit of Happiness are guaranteed to each one of us. Liberal values ARE the traditional American values.\n \n As far as markets go, liberals believe in fair markets as opposed to so-called \"free-markets,\" which can mean market thuggery and unchecked manipulation of markets by a few who seek to capitalize on their contrived manipulation to the disadvantage of others.\n \n Liberals also value a strong national defense in order to preserve our traditional liberal American values. Liberals believe that our national defense should be, as much as possible, a shared responsibility. If a person, for personal and religious reasons, cannot bear arms or serve in warfare, that person can contribute service to the nation in other ways.\n \n Those who serve in the defense of our nation should be valued citizens who, if wounded or otherwise harmed by their participation in our nations's defense, deserve the support and care of other citizens until they have regained as much of their individual abilities as possible. No Walter Reed scandals for liberals, no shameful mistreatment of returning warriors, no refusing to honor those who died in the defense of our nation.\n \n To be continued.", 
   {}, 
   326678, 
   null, 
   1223413020.0
  ], 
  [
   326687, 
   null, 
   "simone", 
   "From the site cited above:\n \nLIBERALS - believe in governmental action to achieve equal opportunity and equality for all, and that it is the duty of the State to alleviate social ills and to protect civil liberties and individual and human rights. Believe the role of the government should be to guarantee that no one is in need. Believe that people are basically good. \n \n Liberal policies generally emphasize the need for the government to solve people's problems.\n\n No. Equal opportunity and protection for all is assumed by liberals as \"natural right.\" If, however, these natural rights fail to materialize, action by government may be necessary. \n \n The purpose of government is not to \"guarantee\" that no one shall be in need, but if persons in the nation are hungry or don't get the medical need they need, government may need to intervene. I do believe that government should be involved in providing free and public education, largely governed on a local basis.\n \n Liberals do believe that people are basically good if they are allowed to flourish in a decent environment. \n \n Liberals DO NOT believe that government serves to \"solve\" the problems of the people. If the people are unable to solve their own problems -- and if they are empowered as participants in the true, the liberal American dream, they can generally solve their own problems. It may be necessary for governmental intervention in a very few cases. Not everyone can solve their own problems.\n \n Also, this may be a very important difference between conservatives and liberals, depending upon your definition.\n \n Liberals do not believe that corporations are persons, that corporations are not covered under our nation's Bill of Rights, that there should not be \"corporate welfare\" as opposed to people welfare, corporate welfare seems to be quite beloved by conservatives.", 
   {}, 
   326686, 
   null, 
   1223413680.0
  ], 
  [
   326701, 
   null, 
   "Kronus", 
   "Kronus, the terms \"liberal\" and \"conservative\" are quite fluid. I'm going to steal definitions, giving attribution, and indicate why I disagree with those definitions.\n \n\n \n Ok. Your analysis is certainly much more than anyone else has supplied. I appreciate your efforts here. I agree that the defintions are fluid, and that those on the right mean something quite different from the term \"liberal\" than those on the left. I get a sense of what you mean from the term via your disagreements with the supplied defintion, but can you pin down what the term means to you? Do you have a definition you go by, or is it like art? You know it when you see it.", 
   {}, 
   326686, 
   null, 
   1223420100.0
  ], 
  [
   326736, 
   null, 
   "simone", 
   "Kronus, the concept of liberalism or conservativism is an idea, not something that can be carved in stone. My idea of what a liberal or conservative is may not be the same tomorrow as it is today. Subtle shadings may be added.\n \n In fact, I tossed the two concepts out on a different site and gained a more nuanced understanding of the terms.\n \n For example:\n \n Conservatives are categorized as selfish. Conservatives don't like change. They don't like risk, at least not with their own assets.\n \n I tend to agree with those assessments.\n \n Liberals, in the modern sense, tend to have more faith in the government's ability to have a beneficial impact on people's lives. I agree.\n \n Reference was made to the works of George Lakoff, I think I might summarize his stance as portraying conservatives as requiring a strong authority figure to refer to, a commanding, powerful father figure, stern, adamant in enforcing the rules which he has lain down, stressing obedience to the father, humans are regarded as weak and sinful, requiring rigid boundaries to keep them from straying. The strict father model. I largely agree with that assessment of conservatism.\n \n Liberals are portrayed as nurturing mother figures who encourage individuals to develop their own moral bounds, recognizing that individuals may have differing values, almost all of which are relatively valid. Nurturing. Being able to take care of oneself, enabling one thereby to take care of others if necessary, desiring that people be happy, desiring fairness, acknowledging the capacity for moral growth, as well as encouraging such growth. \n \n I've stolen these concepts from:\n http://www.wwcd.org/issues/Lakoff.html\n \n One last word, conservatives tend to not be able to think for themselves. They need someone else to tell them what to do. Liberals are encouraged to figure things out, because when liberals apply themselves and figure things out, they get new and wonderful ideas, new ways of solving problems.", 
   {}, 
   326701, 
   null, 
   1223433300.0
  ], 
  [
   326774, 
   null, 
   "Jo Bennett", 
   "Marxism in academia doesn't mean the same as it does in politics. For a professor, to be a Marxist means having a Marxist veiw that history is largely a result of economic factors and mass movements of people, rather than a history of \"great people\" as the opposing view suggests. This is not the same as revolutionary socialism with which the term marxist is usually associated.", 
   {}, 
   326736, 
   null, 
   1223446740.0
  ], 
  [
   326821, 
   null, 
   "Kronus", 
   "Marxism in academia doesn't mean the same as it does in politics. \n\n \n Is this in response to Isly's out of context quote? He didn't even quote it correctly. It actually starts \"To avoid being mistaken for a sellout,I chose my friends carefully.\" It's amazing how many people are throwing that quote, and Isly's misquote, around in attempt to \"prove\" that Obama is a scary leftist radical. Ooh, a college kid cultivating an image! What bizarre behavior, that'll come back to haunt him! :)\n \n First Clinton, now Obama. This is just the standard conservative smear job on the Democrat-du-jour, taking out of context quotes and blowing them up to try to make someone they don't like look Liberal. *shudder*", 
   {}, 
   326774, 
   null, 
   1223488320.0
  ], 
  [
   326898, 
   null, 
   "isly ilwott", 
   "Is this in response to Isly's out of context quote? He didn't even quote it correctly. It actually starts \"To avoid being mistaken for a sellout,I chose my friends carefully.\" It's amazing how many people are throwing that quote, and Isly's misquote, around in attempt to \"prove\" that Obama is a scary leftist radical. Ooh, a college kid cultivating an image! What bizarre behavior, that'll come back to haunt him! :)\n \n First Clinton, now Obama. This is just the standard conservative smear job on the Democrat-du-jour, taking out of context quotes and blowing them up to try to make someone they don't like look Liberal. *shudder*\nIsly copied that from another source. The truncation is meaningless. It doesn't matter why he chose his friends. What matters is who he chose...and who he specificallty mentioned as preferred, carefully chosen, Marxist professors.\n \n Obama is a Marxist. So is his wife.", 
   {}, 
   326821, 
   null, 
   1223502180.0
  ], 
  [
   326925, 
   null, 
   "Kronus", 
   "Isly copied that from another source. The truncation is meaningless. It doesn't matter why he chose his friends. What matters is who he chose...and who he specificallty mentioned as preferred, carefully chosen, Marxist professors.\n \n Obama is a Marxist. So is his wife.\n\n \n This is a prime example of the mental twists that some will put themselves through to try to make reality fit their wishes. First off, chopping off an important part of a quote, the first half of the first sentence, is unimportant. If it's not important, you have to wonder why so many people are deliberately misleading people by chopping a sentence in half. And then of course the bizarre leap from \"Obama hung out a Marxist professor to try to fit in\" to \"Obama's a marxist\" is just ludicrous. There really seems to be no depths to which some won't sink to try to push their lies. The sad thing is how easily some people are taken in by said lies. Mostly people who wouldn't vote for Obama anyway, but it's still sad how little value truth has for some people.", 
   {}, 
   326898, 
   null, 
   1223508720.0
  ], 
  [
   327002, 
   null, 
   "Steeeeve", 
   "\"Republicans\", Bassman, not \"Conservatism\" \n \n BIG, HUGE difference. You are a republican, but NOT a conservative. I am a conservative but NOT (anymore) a republican.\n\n \n For comparison, \n \n McCain is a republican\n Ron Paul is a conservative (all be it a crazy one)\n \n Conservative has no major party.", 
   {}, 
   326582, 
   null, 
   1223559000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Contrary to popular opinion...", 
  "url": "http://www.4forums.com/political/politics-debates/11702-contrary-popular-opinion.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 11702, 
  "discussion_files": [
   [
    "22303.html", 
    "http://www.4forums.com/political/politics-debates/11702-contrary-popular-opinion-print.html"
   ], 
   [
    "22304.html", 
    "http://www.4forums.com/political/politics-debates/11702-contrary-popular-opinion-3-print.html"
   ], 
   [
    "22305.html", 
    "http://www.4forums.com/political/politics-debates/11702-contrary-popular-opinion-2-print.html"
   ]
  ], 
  "identifier": 11702
 }
]