[
 [
  [
   326641, 
   null, 
   "simone", 
   "Unleashed, Palin Makes a Pit Bull Look Tame\n By Dana Milbank\n Tuesday, October 7, 2008; Page A03\n FORT MYERS, Fla., Oct. 6 John McCain is collapsing in the polls in Florida and other swing states, but Sarah Palin, God bless her, has a solution. \n \n \"For me, the heels are on, the gloves are off,\" she announced at high noon Monday to a group of Republican donors at the Naples Beach Club.\n \n .... As the donors sipped their bloody marys and mimosas, she added, in a conspiratorial stage whisper, \"I'm sending the message back to John McCain also: Tomorrow night in his debate, might as well take the gloves off.\" \n \n .... Well, the self-identified pit bull has been unleashed -- if not unhinged.\n \n Barack Obama, she told 8,000 fans at a rally here Monday afternoon, \"launched his political career in the living room of a domestic terrorist!\" This followed her earlier accusation that the Democrat pals around with terrorists. \"This is not a man who sees America the way you and I see America,\" she told the Clearwater crowd. \"I'm afraid this is someone who sees America as imperfect enough to work with a former domestic terrorist who had targeted his own country.\" The crowd replied with boos....\n \n Worse, Palin's routine attacks on the media have begun to spill into ugliness. In Clearwater, arriving reporters were greeted with shouts and taunts by the crowd of about 3,000. Palin then went on to blame Katie Couric's questions for her \"less-than-successful interview with kinda mainstream media.\" At that, Palin supporters turned on reporters in the press area, waving thunder sticks and shouting abuse. Others hurled obscenities at a camera crew. One Palin supporter shouted a racial epithet at an African American sound man for a network and told him, \"Sit down, boy.\"...\n\n http://www.washingtonpost.com/wp-dyn/content/article/2008/10/06/AR2008100602935.html\n \n Sigh! I thought this was the 21st century -- not the 19th.", 
   {
    "post_info": {
     "post_title": "The Palin Racists"
    }
   }, 
   null, 
   null, 
   1223406960.0
  ], 
  [
   327121, 
   null, 
   "Ethmi", 
   "http://www.washingtonpost.com/wp-dyn/content/article/2008/10/06/AR2008100602935.html\n \n Sigh! I thought this was the 21st century -- not the 19th.\n\n \n *sigh* What kind of vile creature are you? What lengths won't you people take to demonize republicans? If you're going to attack Palin, then ATTACK PALIN! Not her supporters! It's not like she's controlling her supporters with a telepathic connection, or anything! Her followers aren't the flood, and she's not the gravemind either.", 
   {}, 
   326641, 
   null, 
   1223603880.0
  ], 
  [
   327160, 
   null, 
   "simone", 
   "Palin was giggling with joy when she saw how her supporters responded to her racist hints. It's just what she wanted and she made no effort to tamp it down.", 
   {}, 
   327121, 
   null, 
   1223649960.0
  ], 
  [
   327164, 
   null, 
   "Baron", 
   "*sigh* What kind of vile creature are you? What lengths won't you people take to demonize republicans? If you're going to attack Palin, then ATTACK PALIN! Not her supporters! It's not like she's controlling her supporters with a telepathic connection, or anything! Her followers aren't the flood, and she's not the gravemind either.\n\n \n Don't let her get to you Ethmi. \n \n Yesterday I almost complimented her when I discovered that she prefers political arguments to political debates. She either is or plays the left wing liberal democrat. Either way she amuses me.\n \n Go Sarah.", 
   {}, 
   327121, 
   null, 
   1223651520.0
  ], 
  [
   327219, 
   null, 
   "simone", 
   "I am proudly leftist. I am proudly liberal. I'm not particularly happy with the Democratic party at the moment.\n \n And, I am almost always right. It kind of runs in my family, you know.", 
   {}, 
   327164, 
   null, 
   1223663580.0
  ], 
  [
   327263, 
   null, 
   "Baron", 
   "I am proudly leftist. I am proudly liberal. I'm not particularly happy with the Democratic party at the moment.\n \n And, I am almost always right. It kind of runs in my family, you know.\n\n \n Whatever makes you happy. A proud leftist almost always right? LOL \n \n What's wrong with the Democratic party? Not socialist enough? Don't worry, whatever the Republicans didn't screw up the Democrats will manage to totally destroy. Can't wait to see what foolishness Nancy, Harry and Barney will come up with.\n \n Cheerio.", 
   {}, 
   327219, 
   null, 
   1223669880.0
  ], 
  [
   327267, 
   null, 
   "Ethmi", 
   "Palin was giggling with joy when she saw how her supporters responded to her racist hints. It's just what she wanted and she made no effort to tamp it down.\n\n \n Can you support this moronic statement? The answer is obviously no. Also, why should Obama be less responsible for his own words on Guns and Religion than Palin is for the words of her audience? The media will follow Palin through the gates of hell and beyond to find something to demonize her. What lengths won't they take to attack republicans?", 
   {}, 
   327160, 
   null, 
   1223670240.0
  ], 
  [
   327269, 
   null, 
   "Ethmi", 
   "I am proudly leftist. I am proudly liberal. I'm not particularly happy with the Democratic party at the moment.\n \n And, I am almost always right. It kind of runs in my family, you know.\n\n \n You have quite an ego there. You don't say \"I'm right!\". You say \"I'm right because...\".", 
   {}, 
   327219, 
   null, 
   1223670420.0
  ], 
  [
   327279, 
   null, 
   "T.Q", 
   "Also, why should Obama be less responsible for his own words on Guns and Religion than Palin is for the words of her audience? \n\n \n I don't recall anyone in the audience when Obama spoke saying \"Let's kill them\" or screaming \"terrorist!\", so what is your point? The two situations are in no way similar.", 
   {}, 
   327267, 
   null, 
   1223671620.0
  ], 
  [
   327301, 
   null, 
   "Jo Bennett", 
   "Whatever makes you happy. A proud leftist almost always right? LOL \n \n What's wrong with the Democratic party? Not socialist enough? Don't worry, whatever the Republicans didn't screw up the Democrats will manage to totally destroy. Can't wait to see what foolishness Nancy, Harry and Barney will come up with.\n \n Cheerio.\n\n \n Not socialist AT ALL seems like the problem to me. They make new labour look socialist...", 
   {}, 
   327263, 
   null, 
   1223676660.0
  ], 
  [
   327305, 
   null, 
   "Ethmi", 
   "I don't recall anyone in the audience when Obama spoke saying \"Let's \" or screaming % ist!\", so what is your point? The two situations are in no way similar.\n\n \n But when you consider that one came from the audience, but the other came from the cantidate himself, we're about even.", 
   {}, 
   327279, 
   null, 
   1223677020.0
  ], 
  [
   327326, 
   null, 
   "foundit66", 
   "You want to see the difference between Obama and McCain?\n Earlier today, Obama remarked on recent outbursts of \"Traitor!\" \"Terrorist!\" and \"Kill him!\" at McCain campaign events. \"It's easy to rile up a crowd,\" Obama said. \"Nothing's easier than riling up a crowd by stoking anger and division. But that's not what we need right now in the United States.\"\n \n In response, McCain senior adviser Nicolle Wallace released this statement, NBC's Kelly O'Donnell reports. \"Barack Obama's assault on our supporters is insulting and unsurprising. These are the same people obama called 'bitter' and attacked for 'clinging to guns' and faith. He fails to understand that people are angry at corrupt practices in Washington and Wall Street and he fails to understand that America's working families are not 'clinging' to anything other than the sincere hope that Washington will be reformed from top to bottom.\" http://firstread.msnbc.msn.com/archive/2008/10/10/1529529.aspx\n \n Obama responded with something that shows he thinks they were \"riled up\".\n A more courteous response, cause anybody can lose their head to emotion.\n \n McCain responded BY BLAMING OBAMA!!!\n McCain responded claiming that OBAMA ASSAULTED McCain supporters, instead of addressing the behavior of the McCain supporters.\n Blaming Obama for the guys who are shouting \"kill him\"... emoticon_ic\n \n Let me repeat that.\n McCain supporters shout \"kill him\" (regarding Obama), and McCain claims it is OBAMA's Fault... emoticon_ic\n emoticon_xdonno\n \n McCain has sunk to a new low.\n There is already a concern that somebody may try to kill Obama.\n Already a concern that some MAY HAVE ALREADY TRIED to set that into motion.\n And McCain comes along, his campaign STOKE THE FIRES OF HATRED, and then blames Obama for the vile statements McCain's supporters say. emoticon_xdonno", 
   {}, 
   327305, 
   null, 
   1223684100.0
  ], 
  [
   327339, 
   null, 
   "chester", 
   "Well, folks, it looks as if it's over for Governor Gidget.\n \n the Alaska legislative investigation committee just ruled UNANIMOUSLY and on a bipartisan basis to release the report on her activities as Governor of the Igloo State.\n \n Here's the link: http://www.nytimes.com/aponline/us/AP-Palin-Troopergate.html\n \n If you prefer, here's the link to the Anchorage News story: http://www.adn.com/palin/story/552393.html\n \n adn = Anchorage Daily News\n \n Can anyone spell Obama landslide??", 
   {}, 
   327326, 
   null, 
   1223692320.0
  ], 
  [
   327347, 
   null, 
   "jyoshu", 
   "You want to see the difference between Obama and McCain?\n \n Earlier today, Obama remarked on recent outbursts of \"Traitor!\" \"Terrorist!\" and \"Kill him!\" at McCain campaign events. \"It's easy to rile up a crowd,\" Obama said. \"Nothing's easier than riling up a crowd by stoking anger and division. But that's not what we need right now in the United States.\"\n \n\n \n Obama shouldn't have blamed anyone for \"stoking\" the guy in the crowd, to begin with. More dishonesty from Obama. You're berating McCain for wrongly blaming Obama, but you're saying nothing about the fact that Obama wrongly blamed McCain! His dishonesty is not unlike his repeated claims awhile back that McCain thinks we should be in Iraq for 100 years. He has dishoenstly misrepresented McCain a number of times.", 
   {}, 
   327326, 
   null, 
   1223694900.0
  ], 
  [
   327354, 
   null, 
   "T.Q", 
   "But when you consider that one came from the audience, but the other came from the cantidate himself, we're about even.\n\n \n No, \"we're\" not. This is just another example of you being unable to stay on topic and typing whatever pops into your head.", 
   {}, 
   327305, 
   null, 
   1223701260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Palin Racists", 
  "url": "http://www.4forums.com/political/politics-debates/11707-palin-racists.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 11707, 
  "discussion_files": [
   [
    "31576.html", 
    "http://www.4forums.com/political/politics-debates/11707-palin-racists-print.html"
   ]
  ], 
  "identifier": 11707
 }
]