[
 [
  [
   327106, 
   null, 
   "DrD", 
   "Have you had enough yet? If not, how's it working for you?", 
   {
    "post_info": {
     "post_title": "Have you had enough yet?"
    }
   }, 
   null, 
   null, 
   1223596260.0
  ], 
  [
   327159, 
   null, 
   "simone", 
   "I had enough 8 years ago when George W. Bush was selected, not elected, as our president. I knew he would totally screw America.\n \n I'm voting for Obama, of course! He's going to save America. And he's going to save capitalism too, with one hand tied behind him.", 
   {}, 
   327106, 
   null, 
   1223649840.0
  ], 
  [
   327183, 
   null, 
   "isly ilwott", 
   "I had enough 8 years ago when George W. Bush was selected, not elected, as our president. I knew he would totally screw America.\n \n I'm voting for Obama, of course! He's going to save America. And he's going to save capitalism too, with one hand tied behind him.\n..and afterwards, He will ascend into Heaven amid the trumpets of a thousand angels and accept his 72 virgins!\n \n All hail the saviour! Praise Allah! The second coming of Christ will be nothing compared to this!\n \n Simone, dear, Obama is poison...like a snake. I am concerned for you regarding your delusional prediction of the outcome under Obama. He will save us from nothing whatsoever. He is not really trying to do that anyway. I am hoping that when you realize you've been duped by Obamessiah and his disciples that you do not do something drastic...like SHOOT YOURSELF! It will be quite a letdown when the metaphorical two by four hits you in the face. It won't be so bad for me because I'm expecting it. You, on the other hand, are dreaming.", 
   {}, 
   327159, 
   null, 
   1223656680.0
  ], 
  [
   327221, 
   null, 
   "simone", 
   "idiotly illsot, you, unfortunately, are the lying snake.\n \n Obama is a Christian, a devoted Christian.\n \n And, truly, if there is a hell, I know exactly who shall be screaming out in eternal agony.", 
   {}, 
   327183, 
   null, 
   1223663760.0
  ], 
  [
   327223, 
   null, 
   "ServantOfChrist", 
   "I had enough 8 years ago when George W. Bush was selected, not elected, as our president. I knew he would totally screw America.\n \n I'm voting for Obama, of course! He's going to save America. \n YES! Praise the Obamessiah! ;)\n \n \nAnd he's going to save capitalism too, with one hand tied behind him.\n\n \n Won't it be kind of hard for him to \"save\" capitalism while he is implementing his plan to create the Socialist States of America?", 
   {}, 
   327159, 
   null, 
   1223663880.0
  ], 
  [
   327229, 
   null, 
   "ServantOfChrist", 
   "idiotly illsot, you, unfortunately, are the lying snake.\n \n Obama is a Christian, a devoted Christian.\n \n And, truly, if there is a hell, I know exactly who shall be screaming out in eternal agony.\n\n \n This article is rather revealing on Obama's \"Christian\" faith.\n \n The most revealing is this comment at the end : \n\"The difficult thing about any religion, including Christianity, is that at some level there is a call to evangelize and proselytize. There's the belief, certainly in some quarters, that if people haven't embraced Jesus Christ as their personal savior, they're going to hell.\" \n \n Obama doesn't believe he, or anyone else, will go to hell. \n \n But he's not sure if he'll be going to heaven, either. \n \n \"I don't presume to have knowledge of what happens after I die,\" he says. \"When I tuck in my daughters at night, and I feel like I've been a good father to them, and I see in them that I am transferring values that I got from my mother and that they're kind people and that they're honest people, and they're curious people, that's a little piece of heaven.\"\n \n\n No Christian would say the first bolded.\n \n And no \"devout\" Christian would ever say or even think the second bolded.\n \n \n And again from more recently: http://www.christianpost.com/article/20080327/obama-suggests-jesus-christ-not-the-only-way-to-heaven.htm\n \n \nDemocratic presidential contender Barack Obama suggested Wednesday that Jesus Christ is not the only way to heaven during a campaign event in North Carolina.\n \n While answering a question about his Christian faith, Obama said he believes that Jesus Christ died for his sins and through God's grace and mercy he could have \"everlasting life,\" according to the Los Angeles Times.\n \n But he also believes Jews and Muslims and non-believers who live moral lives are as much \"children of God\" as he is, according to The Associated Press.\n \n \n\n and\n \n\n As an example, he spoke about his late mother who was \"not a believer.\"\n \n \"[S]he was the kindest, most decent, generous person that I have ever known,\" Obama said, according to the Times. \"I'm sure she is in heaven, even though she may not have subscribed to everything that I subscribe to.\"\n \n\n \n No Christian would believe this.\n \n Obama is not a Christian - he is a Black Liberation Theology Cultist.", 
   {
    "unicode_changes_made": true
   }, 
   327221, 
   null, 
   1223664720.0
  ], 
  [
   327246, 
   null, 
   "simone", 
   "\n \nObama doesn't believe he, or anyone else, will go to hell.\n \n The most revealing is this comment at the end : \n No Christian would say the first bolded....\n\n There are a number of Christian denominations who do not believe in hell. Where have you been?\n \n To which narrowly focused cult do you belong?", 
   {}, 
   327229, 
   null, 
   1223667540.0
  ], 
  [
   327293, 
   null, 
   "DrD", 
   "Hey, guess what folks? I want a president, not a Christian, Bhuddist, Rabbi, etc.  We've had a (ahem) christian in the white house for 8 years. He very well may be a christian but he is just plain dumb. He doesn't get it. Don't believe me. . . .look around, that's all, just look around. Not because he is a christian but in spite of the fact he is a christian. Let's get someone this time who has a brain and let the preachers take care of the children.", 
   {}, 
   327246, 
   null, 
   1223674200.0
  ], 
  [
   327295, 
   null, 
   "DrD", 
   "The most revealing is this comment at the end : \n No Christian would say the first bolded....Obama doesn't believe he, or anyone else, will go to hell. \nNeither do the jews but we have no problem supporting them with money, oil, blood, whatever they need. They don't have the concept of heaven down either like christians.", 
   {}, 
   327293, 
   null, 
   1223674380.0
  ], 
  [
   327307, 
   null, 
   "Jo Bennett", 
   "This article is rather revealing on Obama's \"Christian\" faith.\n \n The most revealing is this comment at the end : \n No Christian would say the first bolded.\n \n And no \"devout\" Christian would ever say or even think the second bolded.\n \n \n And again from more recently: http://www.christianpost.com/article/20080327/obama-suggests-jesus-christ-not-the-only-way-to-heaven.htm\n \n \n and\n \n \n No Christian would believe this.\n \n Obama is not a Christian - he is a Black Liberation Theology Cultist.\n\n \n Liberation theology IS Christian. It's far more Christian than Bush's supply side Jesus for certain:\n http://www.buzzflash.com/contributors/03/09/17_franken.html\n \n Belief in hell as a place of eternal torment is not central to Christian theology, the summaries of the Christian faith, the Creeds, only mention it as the land of the dead - Sheol. Even the late Pope John Paul II thought that hell was not a physical place, but a state of separation from God.", 
   {}, 
   327229, 
   null, 
   1223677080.0
  ], 
  [
   327310, 
   null, 
   "chester", 
   "..and afterwards, He will ascend into Heaven amid the trumpets of a thousand angels and accept his 72 virgins!\n \n All hail the saviour! Praise Allah! The second coming of Christ will be nothing compared to this!\n \n Simone, dear, Obama is poison...like a snake. I am concerned for you regarding your delusional prediction of the outcome under Obama. He will save us from nothing whatsoever. He is not really trying to do that anyway. I am hoping that when you realize you've been duped by Obamessiah and his disciples that you do not do something drastic...like SHOOT YOURSELF! It will be quite a letdown when the metaphorical two by four hits you in the face. It won't be so bad for me because I'm expecting it. You, on the other hand, are dreaming.\n\n \n Getting really desperate now that you are so far behind, right?\n \n Can't argue issues, so you righties need to resort to personal attacks.\n \n Face facts, McStain is the Bob Dole of 2008, is a nice, elderly gentleman who might like to be President when he wakes up from his nap.", 
   {}, 
   327183, 
   null, 
   1223677500.0
  ], 
  [
   327718, 
   null, 
   "DrD", 
   "Using a religous reference, PRAISE GOD, this hell is almost over. emoticon_xangel", 
   {}, 
   327310, 
   null, 
   1223920260.0
  ], 
  [
   327840, 
   null, 
   "applemacin", 
   "I'm sick and tired of the Bush era. One more day with him in the White House will send this country into the bottom of the drain.", 
   {}, 
   327106, 
   null, 
   1223960940.0
  ], 
  [
   327845, 
   null, 
   "neilsimon", 
   "Who hasn't had enough of him, really?", 
   {}, 
   327840, 
   null, 
   1223975460.0
  ], 
  [
   328605, 
   null, 
   "grizzly6626", 
   "..and afterwards, He will ascend into Heaven amid the trumpets of a thousand angels and accept his 72 virgins!\n \n All hail the saviour! Praise Allah! The second coming of Christ will be nothing compared to this!\n \n Simone, dear, Obama is poison...like a snake. I am concerned for you regarding your delusional prediction of the outcome under Obama. He will save us from nothing whatsoever. He is not really trying to do that anyway. I am hoping that when you realize you've been duped by Obamessiah and his disciples that you do not do something drastic...like SHOOT YOURSELF! It will be quite a letdown when the metaphorical two by four hits you in the face. It won't be so bad for me because I'm expecting it. You, on the other hand, are dreaming.\n\n \n You forgot to tell her that before Obama does anything, he is going to walk on water and feed the masses with three fish and a loaf of bread.", 
   {}, 
   327183, 
   null, 
   1224261300.0
  ], 
  [
   328607, 
   null, 
   "Archangel", 
   "http://i180.photobucket.com/albums/x283/BBSoonerJax/ATT00088.jpg\n \n \n http://i180.photobucket.com/albums/x283/BBSoonerJax/ATT00103.jpg", 
   {}, 
   328605, 
   null, 
   1224262620.0
  ], 
  [
   328641, 
   null, 
   "simone", 
   "My God! Archie! If things are as you say in those cartoon sites, why don't Michelle and Barack have nine or more homes? They surely are not keeping up with the McCains. \n \n Oh yeah, Cindy McCain has at least a net worth of $100 million. How close are the Obamas to that amount?", 
   {}, 
   328607, 
   null, 
   1224271680.0
  ], 
  [
   328663, 
   null, 
   "Ethmi", 
   "My God! Archie! If things are as you say in those cartoon sites, why don't Michelle and Barack have nine or more homes? They surely are not keeping up with the McCains. \n \n Oh yeah, Cindy McCain has at least a net worth of $100 million. How close are the Obamas to that amount?\n\n \n Cite a reference to support that (who am I kidding? You'll never do that.) Also, how do you know she didn't save? Third, is Cindy McCain a known racist? Fourth, does McCain have connections to known terrorists? This entire argument is irrelevant to anything, especially when you refuse to provide the method in which Cindy McCain got that money. And finally, if you're going to attack McCain, then attack him, not his wife.", 
   {}, 
   328641, 
   null, 
   1224274500.0
  ], 
  [
   328665, 
   null, 
   "Archangel", 
   "My God! Archie! If things are as you say in those cartoon sites, why don't Michelle and Barack have nine or more homes? They surely are not keeping up with the McCains. \n \n Oh yeah, Cindy McCain has at least a net worth of $100 million. How close are the Obamas to that amount?\n\n \n The difference between them is that Cindy's family has actually worked for, and earned their wealth. They haven't obtained their homes through sketchy real estate deals with convicted criminals as the Obama's have. Just check out Obama's and Rezko's illegal real estate deals for evidence.\n \n But being a socialist, your class envy prevents you from respecting earned money as you lust after all of the hand outs you can get without working for them.", 
   {}, 
   328641, 
   null, 
   1224274560.0
  ], 
  [
   328679, 
   null, 
   "sinjin", 
   "Cite a reference to support that (who am I kidding? You'll never do that.) Also, how do you know she didn't save? Third, is Cindy McCain a known racist? Fourth, does McCain have connections to known terrorists? This entire argument is irrelevant to anything, especially when you refuse to provide the method in which Cindy McCain got that money. And finally, if you're going to attack McCain, then attack him, not his wife.\n\"At the time of his death in 2000, Jim Hensley held most of the controlling stock; annual revenues were over $220 million on 20 million cases of beer sold. Cindy Hensley McCain, who had been a vice president, became the controlling stockholder &#8212; she, her children, and Andrew McCain together control 68 percent of the company &#8212; and chair of the board.\"\n \n http://en.wikipedia.org/wiki/Hensley_%26_Co.#cite_note-az-hensley-2", 
   {}, 
   328663, 
   null, 
   1224275760.0
  ], 
  [
   328683, 
   null, 
   "simone", 
   "Cite a reference to support that (who am I kidding? You'll never do that.)\n\n To what are you referring? Reference to support what?\n \nAlso, how do you know she didn't save?\nWho saved? What was saved? What are you talking about?\n \nThird, is Cindy McCain a known racist? \nDid I ever say that Cindy McCain was a racist? Where the devil did I say that?\n \n As a matter of fact, Cindy McCain is very much not a racist. I applaud her for her extensive charitable works. When she was visiting Bangladesh in 1993:\n \n\"Cindy cradles little Bridget, a baby she and John adopted in 1993 from Mother Teresa's orphanage in Bangladesh. Bridget has been a great blessing to the McCain family,\" the mailing says.\n\n http://www.huffingtonpost.com/2008/01/11/mccain-mailer-features-ad_n_81023.html\n \n Unfortunately, cynically racist Bush Republicans used this adoption to slime the McCains when McCain ran against Bush in 2000. \n \nFourth, does McCain have connections to known terrorists?\nG. Gordon Liddy:\n \nLiddy is noted for controversial advice to his radio audience, including on one occasion in 1994, after the federal raid on the Branch Davidian compound in Waco, Texas, Liddy advised his listeners: \"Now if the Bureau of Alcohol, Tobacco and Firearms comes to disarm you and they are bearing arms, resist them with arms. Go for a head shot; they're going to be wearing bulletproof vests. ... Kill the sons of bitches.\"\n \n In 1998 Liddy hosted a fundraiser at his house for John McCain's re-election campaign at which guests could have their pictures taken with McCain and Liddy. Over the years, he has made at least four contributions totaling $5,000 to the senator's campaigns -- including $1,000 in 2008.\n \n Last November, McCain went on his radio show. Liddy greeted him as \"an old friend,\" and McCain said \"I'm proud of you, I'm proud of your family.\" \"It's always a pleasure for me to come on your program, Gordon, and congratulations on your continued success and adherence to the principles and philosophies that keep our nation great.\"\n\n http://en.wikipedia.org/wiki/G._Gordon_Liddy \n \n \nThis entire argument is irrelevant to anything, especially when you refuse to provide the method in which Cindy McCain got that money. And finally, if you're going to attack McCain, then attack him, not his wife.\nCindy McCain inherited her money from her father, she did not work for her wealth -- although she has been a hard worker to maintain her wealth, as well as in her charitable endeavors, as well as in her maintenance of John Sydney McCain III.", 
   {}, 
   328663, 
   null, 
   1224277020.0
  ], 
  [
   328728, 
   null, 
   "jyoshu", 
   "G. Gordon Liddy\n\n \n What he recommended was not being a terrorist; rather resisting a form of terrorism. Not something that I would do in the way he recommended, but I could understand the desire to resist the government breaking into my home. The government DID go too far in the Waco siege.\n \n There's no comparison between Liddy and Ayers. To even throw the Liddy thing up is grasping at straws, and probably just put forward as a sad attempt to put out a counter example of the Ayers thing.", 
   {}, 
   328683, 
   null, 
   1224291660.0
  ], 
  [
   328735, 
   null, 
   "Penfold", 
   "Liddy is only one of the dubious associates close to McCain...\n \n Jim Hensley, Convicted Felon\n G. Gordon Liddy, Convicted Felon\n Charles Keating, Convicted Felon \n Raffaello Follieri, Convicted Felon\n Rick Renzi, Under Indictment \n Rick Davis, Freddie Mac Lobbyist \n Charles Black, Lobbyist for Dictators \n Richard Quinn, White Supremist \n Pastor John Hagee, Bigot \n Pastor Rod Parsley, Bigot\n Todd Palin, Member of Secessionist Group\n Andrew McCain, Resigned Manager Savings & Loan ...", 
   {}, 
   328728, 
   null, 
   1224295140.0
  ], 
  [
   328752, 
   null, 
   "chester", 
   "Let's not forget the head of McStain's transition team, Saddam Hussein lobbyist William Timmons.", 
   {}, 
   328735, 
   null, 
   1224305280.0
  ], 
  [
   328972, 
   null, 
   "snakespit", 
   "...No Christian would say the first bolded...\n \n ...And no \"devout\" Christian would ever say or even think the second bolded...\n \n ...No Christian would believe this...\n\n Which is why you and your like minded cohorts are rapidly losing numbers in this country. Many people find the \"we are the only righteous ones and the rest will burn in hell\" argument a little distasteful. Intolerance is not a virtue.", 
   {}, 
   327229, 
   null, 
   1224520140.0
  ], 
  [
   329087, 
   null, 
   "simone", 
   "Liddy is only one of the dubious associates close to McCain...\n \n Jim Hensley, Convicted Felon\n G. Gordon Liddy, Convicted Felon\n Charles Keating, Convicted Felon \n Raffaello Follieri, Convicted Felon\n Rick Renzi, Under Indictment \n Rick Davis, Freddie Mac Lobbyist \n Charles Black, Lobbyist for Dictators \n Richard Quinn, White Supremist \n Pastor John Hagee, Bigot \n Pastor Rod Parsley, Bigot\n Todd Palin, Member of Secessionist Group\n Andrew McCain, Resigned Manager Savings & Loan ...\n\n Kiss! Kiss! XXXX!!! Thank you for this nice list.", 
   {}, 
   328735, 
   null, 
   1224542880.0
  ], 
  [
   330311, 
   null, 
   "DrD", 
   "You forgot to tell her that before Obama does anything, he is going to walk on water and feed the masses with three fish and a loaf of bread.\nHe's already done that, didn't you hear?", 
   {}, 
   328605, 
   null, 
   1225327320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Have you had enough yet?", 
  "url": "http://www.4forums.com/political/politics-debates/11724-have-you-had-enough-yet.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 11724, 
  "discussion_files": [
   [
    "11015.html", 
    "http://www.4forums.com/political/politics-debates/11724-have-you-had-enough-yet-print.html"
   ], 
   [
    "11016.html", 
    "http://www.4forums.com/political/politics-debates/11724-have-you-had-enough-yet-2-print.html"
   ]
  ], 
  "identifier": 11724
 }
]