[
 [
  [
   327510, 
   null, 
   "Ethmi", 
   "We already know that Obama's wife is racist; that's a no-brainer. But it seems Obama has ridiculed the bible in the past. Don't believe me? The do some research. It's not very difficult, actually. His \"guns and religion\" comments may not have been sufficent evidence that he's not a Christian, but if the video isn't, then what is? He mocked Christianity in a jest, and the fools in his audience laughed. Wellp, we now know that he wasn't going to that church for the sermons. He was definitely going there to feed his racism, because frankly, sermons and anti-white bigotry are the only things you'll find in that place. From this, I could conclude that he's either an atheist, or a Muslim. But this fear is the least of my concerns; I don't want a racist in office.", 
   {
    "post_info": {
     "post_title": "Process of Elimination says Obama is racist."
    }
   }, 
   null, 
   null, 
   1223797620.0
  ], 
  [
   327518, 
   null, 
   "Jo Bennett", 
   "What the hell are you talking about? They've ripped 3 quotes from what appears to be a lengthly speech. It's not as if the quotes are particularly damning, Obama simply raises the very real problem with the claim that law should be based on the Bible, given that the Old Testament appears to advocate and condone both slavery and executing children. His point about the DoD not surviving the application of the Sermon on the Mount is entirely correct, and simply highlights the moral bankruptcy of the religious right. Christ WOULD turn the other cheek to terrorists and enemies of America, just as he turned the other cheek to the Roman occupiers who mocked him, just as he refused to defend himself or have others defend him with violence when he was arrested, just as his early followers went to martyrs deaths without violence.\n \n Obama did not mock Christianity, he mocked those who claim to want to apply Christ's teaching but then only want to apply the bits that restrict other people, not those that might risk their own safety and security.", 
   {}, 
   327510, 
   null, 
   1223807460.0
  ], 
  [
   327526, 
   null, 
   "Penfold", 
   "Having a blackevilcommiemuslim for President is anathema to some creatures of the night. They are not many, but are vocal, as seen at Repug rallies, shouting \"Kill Him!!", 
   {}, 
   327518, 
   null, 
   1223818080.0
  ], 
  [
   327541, 
   null, 
   "Archangel", 
   "Having a blackevilcommiemuslim for President is anathema to some creatures of the night. They are not many, but are vocal, as seen at Repug rallies, shouting \"Kill Him!!\n\n \n http://www.phforamerica.com/web%20images/Stormunder.jpg\n Have a look at America's future outlook if Barrack Hussein Obama wins in November. Gone is this Countries greatness and openness to the prospect of positive change and true enlightenment. Prepare yourself for the racial revolution that will come with the hate based philosophy of the slave \"mentality\" class who feel as if they have finally captured the Palace and killed the oppressor King as they finally take control of the land. \n \n The result will be social, political, economic and racial chaos as the sky's which were once bright and blue with birds singing and crickets chirping go black and heavy with the doom and gloom of such a dark future as this Nation has never faced. Gone are the days when the Sun rises in America, with hope and a positive outlook for a bright future for all. Barrack Obama represents the very worst of what America represents. Let those of good conscience hope and pray that this radical African American racist isn't able to take control of the most powerful position in this great country. Seleh...\n \n http://www.4forums.com/political/picture.php?pictureid=30&albumid=2&dl=1222057623&wall=1\n Say goodbye to the morning glory and sunrise of hope which America once represented to the oppressed of this World.", 
   {}, 
   327526, 
   null, 
   1223831760.0
  ], 
  [
   327542, 
   null, 
   "Jo Bennett", 
   "I really cannot comprehend how, somewhere between the real Obama and the right wing media he gets turned from the wishy-washy liberal he is to a member of the Black panthers. Then again, if MLK Jr. had lived and run for pres, the right would have wheeled out exactly the same accusations. In fact pretty much any black Democrat would have the same accusations levelled at them.", 
   {}, 
   327541, 
   null, 
   1223832660.0
  ], 
  [
   327544, 
   null, 
   "Penfold", 
   "The \"process of elimination\" is all too evident in the desperate angry baying of \"Kill Him!\" by those staring defeat in the face at the Nuremb..... Palin/McCain rallies. \"Don't vote for the arab!\" emoticon_wow", 
   {}, 
   327542, 
   null, 
   1223834400.0
  ], 
  [
   327556, 
   null, 
   "isly ilwott", 
   "The \"process of elimination\" is all too evident in the desperate angry baying of \"Kill Him!\" by those staring defeat in the face at the Nuremb..... Palin/McCain rallies. \"Don't vote for the arab!\" emoticon_wow\nYou say that as if McCain wrote the question. You give him no credit for cutting the woman off and denying her premise.\n \n How very liberal of you.\n \n Obama's preacher is a racist. Obama's wife is a racist. Obama's pal Louis Farrakhan is a racist. Obama's pal Bill Ayers is a terrorist. I suspect Obama is a racist that likes terrorists.", 
   {}, 
   327544, 
   null, 
   1223838600.0
  ], 
  [
   327605, 
   null, 
   "jitobear", 
   "Thanks Arch - I so needed a laugh. \n \n \n \nHave a look at America's future outlook (redundant) if Barrack Hussein Obama wins in November. Gone is this Countries (country's - spelling, misuse of capitalization) greatness and openness (openess - sp)to the prospect of positive change and true enlightenment. Prepare yourself for the racial revolution that will come with the hate based philosophy of the slave \"mentality\" class who feel as if they have finally captured the Palace (misuse of capitalization) and killed the oppressor King (misuse of capitalization) as they finally take control of the land. \n \n The result will be social, political, economic and racial chaos as the sky's which were once bright and blue with birds singing and crickets chirping go black and heavy with the doom and gloom of such a dark future as this Nation has never faced. (There is no evidence that politics impact meteorology or the behavior of animals.) Gone are the days when the Sun rises in America (or astronomy), with hope and a positive outlook for a bright future for all (anthropomorphism). Barrack Obama represents the very worst of what America represents. (Incorrect sentence - should be \"represents the very worst of America\", period) Let those of good conscience hope and pray that this radical African American racist isn't able to take control of the most powerful position in this great country. Seleh\n", 
   {}, 
   327541, 
   null, 
   1223852100.0
  ], 
  [
   327618, 
   null, 
   "Ethmi", 
   "The \"process of elimination\" is all too evident in the desperate angry baying of \"Kill Him!\" by those staring defeat in the face at the Nuremb..... Palin/McCain rallies. \"Don't vote for the arab!\" emoticon_wow\n\n \n What lengths won't you people take to demonize republicans? It's not like Palin herself said this...", 
   {}, 
   327544, 
   null, 
   1223856180.0
  ], 
  [
   327672, 
   null, 
   "Jo Bennett", 
   "You say that as if McCain wrote the question. You give him no credit for cutting the woman off and denying her premise.\n \n How very liberal of you.\n \n Obama's preacher is a racist. Obama's wife is a racist. Obama's pal Louis Farrakhan is a racist. Obama's pal Bill Ayers is a terrorist. I suspect Obama is a racist that likes terrorists.\n\n \n In what way is Ayers Obama's pal? They worked together on a committee years ago. I've worked on committees with all sorts of people, doesn't mean they're friends of mine.", 
   {}, 
   327556, 
   null, 
   1223880000.0
  ], 
  [
   327687, 
   null, 
   "chester", 
   "In what way is Ayers Obama's pal? They worked together on a committee years ago. I've worked on committees with all sorts of people, doesn't mean they're friends of mine.\n\n \n It's overwhelmingly clear that McStain's supporters' quivers quiver for the lack of the arrows of substance. Therefore, they must resort to smears and slander.\n \n That might just energize the hard religious right lunatic radical fringe that constitutes his base (and base they truly are!) , but others are turning away in droves.\n \n President Obama, 63 Democratic Senators and 265 Democrats in the House will start to bring some relief from our 8-year national nightmare.", 
   {}, 
   327672, 
   null, 
   1223910180.0
  ], 
  [
   327711, 
   null, 
   "isly ilwott", 
   "In what way is Ayers Obama's pal? They worked together on a committee years ago. I've worked on committees with all sorts of people, doesn't mean they're friends of mine.\nAyers helped orchestrate Obama's rise in Chicago politics. Ayers hosted Obama in his home to kick off Obama's debute on the scene. They are more than just coincidental committee members. They are political allies.\n \n But, just as Obama doesn't want to have anything to do with his preacher right now, he doesn't want you to know how friendly he is with Bill Ayers. Don't bring up Bill Ayers when you go to the victory party...Obama may have you shot.", 
   {}, 
   327672, 
   null, 
   1223916720.0
  ], 
  [
   327717, 
   null, 
   "sinjin", 
   "Obama's mother is a white woman. Which half of himself is he racist against?", 
   {}, 
   327711, 
   null, 
   1223919840.0
  ], 
  [
   327720, 
   null, 
   "Penfold", 
   "What lengths won't you people take to demonize republicans? It's not like Palin herself said this...\n\n \n She has enough low cunning to make the toxic bullets, but not to fire them. Neither has she condemned, rebuked, or even distanced herself from the vile sentiments expressed by her witchhunting acolytes.", 
   {}, 
   327618, 
   null, 
   1223920740.0
  ], 
  [
   327729, 
   null, 
   "Ethmi", 
   "In what way is Ayers Obama's pal? They worked together on a committee years ago. I've worked on committees with all sorts of people, doesn't mean they're friends of mine.\n\n \n You do realize that Obama couldn't have gotten a political career unless it was for Bill Ayers, do you?", 
   {}, 
   327672, 
   null, 
   1223923020.0
  ], 
  [
   327730, 
   null, 
   "Ethmi", 
   "She has enough low cunning to make the toxic bullets, but not to fire them. Neither has she condemned, rebuked, or even distanced herself from the vile sentiments expressed by her witchhunting acolytes.\n\n \n What? Was she supposed to have him executed on sight or something? You have no proof that Palin condoned of this, or if she even heard it among the chatter for that matter.", 
   {}, 
   327720, 
   null, 
   1223923140.0
  ], 
  [
   327735, 
   null, 
   "iangb", 
   "Prepare yourself for the racial revolution that will come with the hate based philosophy of the slave \"mentality\" class who feel as if they have finally captured the Palace and killed the oppressor King as they finally take control of the land.\n\n Sorry, you're accusing us of racism?\n \n I would say 'pot calling the kettle black', but you'd probably accept that as more evidence of 'racism'.", 
   {}, 
   327730, 
   null, 
   1223924280.0
  ], 
  [
   327740, 
   null, 
   "simone", 
   "You do realize that Obama couldn't have gotten a political career unless it was for Bill Ayers, do you?\n\n Proof?\n \n Of course, you never have any proof and you have never entered any evidence to refute my questioning of your integrity.", 
   {}, 
   327729, 
   null, 
   1223924880.0
  ], 
  [
   327761, 
   null, 
   "Archangel", 
   "Thanks Arch - I so needed a laugh.\n\n \n \n \n Have a look at America's future outlook (redundant) if Barrack Hussein Obama wins in November. Gone is this Countries (country's - spelling, misuse of capitalization) greatness and openness (openess - sp)to the prospect of positive change and true enlightenment. Prepare yourself for the racial revolution that will come with the hate based philosophy of the slave \"mentality\" class who feel as if they have finally captured the Palace (misuse of capitalization) and killed the oppressor King (misuse of capitalization) as they finally take control of the land. \n \n The result will be social, political, economic and racial chaos as the sky's which were once bright and blue with birds singing and crickets chirping go black and heavy with the doom and gloom of such a dark future as this Nation has never faced. (There is no evidence that politics impact meteorology or the behavior of animals.) Gone are the days when the Sun rises in America (or astronomy), with hope and a positive outlook for a bright future for all (anthropomorphism). Barrack Obama represents the very worst of what America represents. (Incorrect sentence - should be \"represents the very worst of America\", period) Let those of good conscience hope and pray that this radical African American racist isn't able to take control of the most powerful position in this great country. Seleh\n\n \n You call this a response to my post as you place it in quote brackets to make sure I can't quote it for a hands on response? And how interesting that you aren't even smart enough to recognize metaphors, yet you feel qualified to critique my grammar. Oh, and by the way, learn how to spell before you criticize mine because your spelling of openness with just one N is wrong. But why would I expect you to get that. \n \n But while I've got your attention, any response on the substance of my post? Or are you just here to troll and derail the thread once again?\n http://aolsvc.merriam-webster.aol.com/dictionary/openness", 
   {}, 
   327605, 
   null, 
   1223929680.0
  ], 
  [
   327766, 
   null, 
   "Archangel", 
   "Sorry, you're accusing us of racism?\n \n I would say 'pot calling the kettle black', but you'd probably accept that as more evidence of 'racism'.\n\n \n That's because your submission to what is perceived as political correctness keeps you from speaking truthfully and forcefully against what the left truly represents. You prove your ignorance by calling me a racist as you support a candidate who has embraced Wright, Phlager and Farrakhan for decades now. \n \n No iangb, I said nothing racists at all. I just spoke the truth about what Obama and his associations represent in the real world. And that is black racism. And what is worst, we have half a Nation full of voters with white guilt who will vote this hater into office as they hand him the keys to the kingdom.", 
   {}, 
   327735, 
   null, 
   1223930280.0
  ], 
  [
   327769, 
   null, 
   "Penfold", 
   "Arch has kingdom envy too!.....emoticon_rolleyes", 
   {}, 
   327766, 
   null, 
   1223930400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Process of Elimination says Obama is racist.", 
  "url": "http://www.4forums.com/political/elections-debates/11745-process-elimination-says-obama-racist.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11745, 
  "discussion_files": [
   [
    "23771.html", 
    "http://www.4forums.com/political/elections-debates/11745-process-elimination-says-obama-racist-print.html"
   ], 
   [
    "23772.html", 
    "http://www.4forums.com/political/elections-debates/11745-process-elimination-says-obama-racist-2-print.html"
   ]
  ], 
  "identifier": 11745
 }
]