[
 [
  [
   327659, 
   null, 
   "Penfold", 
   "\" THE $12.5 MILLION sports complex and hockey rink that is the lasting monument to Palin's two terms as Wasilla mayor is also a monument to the kind of insider politics that dismays Americans of both parties. Six months before Palin stepped down as mayor in October 2002, the city awarded nearly a half-million-dollar contract to design the biggest project in Wasilla history to Kumin Associates. Blase Burkhart was the Kumin architect on the job-the son of Roy Burkhart, who is frequently described as a \"mentor\" of Palin and was head of the local Republican Party (his wife, June, who also advised Palin, is the national committeewoman). Asked if the contract was a favor, Roy Burkhart, who contributed to her campaign in the same time frame that his son got the contract, said: \"I really don't know.\" Palin then named Blase Burkhart to a seven-member builder-selection committee that picked Howdie Inc., a mostly residential contractor owned at the time by Howard Nugent. Formally awarded the contract a couple of weeks after Palin left office, Nugent has donated $4,000 to Palin campaigns. Two competitors protested the process that led to Nugent's contract. Burkhart and Nugent had done at least one project together before the complex-and have done several since.\n \n A list of subcontractors on the job, obtained by the Voice, includes many with Palin ties. One was Spenard Builders Supply, the state's leading supplier of wood, floor, roof, and other \"pre-engineered components.\" In addition to being a sponsor of Todd Palin's snow-machine team that has earned tens of thousands for the Palin family, Spenard hired Sarah Palin to do a statewide television commercial in 2004. When the Palins began building a new family home off Lake Lucille in 2002-at the same time that Palin was running for lieutenant governor and in her final months as mayor-Spenard supplied the materials, according to Antoine Bricks, who works in its Wasilla office. Spenard actually filed a notice \"of its right to assert a lien\" on the deed for the Palin property after contracting for labor and materials for the site. Spenard's name has popped up in the trial of Senator Stevens-it worked on the house that is at the center of the VECO scandal as well.\n \n Todd Palin told Fox News that he built the two-story, 3,450-square-foot, four-bedroom, four-bath, wood house himself, with the help of contractors he described as \"buddies.\" As mayor, Sarah Palin blocked an effort to require the filing of building permits in the wide-open city, and there is no public record of who the \"buddies\" were. The house was built very near the complex, on a site whose city purchase led to years of unsuccessful litigation and, now, $1.3 million in additional costs, with a law firm that's also donated to Palin collecting costly fees from the city. ........ \"\n \n \n http://www.villagevoice.com/2008-10-08/news/the-book-of-sarah/5", 
   {
    "post_info": {
     "post_title": "Another palin scandal oozes out...."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1223871720.0
  ], 
  [
   327742, 
   null, 
   "simone", 
   "Bounce!\n \n So much ook and ugliness. But, we must know, unfortunately.", 
   {}, 
   327659, 
   null, 
   1223925060.0
  ], 
  [
   327747, 
   null, 
   "isly ilwott", 
   "Bounce!\n \n So much ook and ugliness. But, we must know, unfortunately.\nYes, you must. Noted by its absense is your desire to know more about the accusations against Obama. You want to ignore his past yet pick through hers with a fine tooth comb.\n \n How liberally biased of you.", 
   {}, 
   327742, 
   null, 
   1223926740.0
  ], 
  [
   327772, 
   null, 
   "Penfold", 
   "Liberals are happy to have a bias for truth against smear and innuendo.", 
   {}, 
   327747, 
   null, 
   1223930760.0
  ], 
  [
   327774, 
   null, 
   "Jo Bennett", 
   "Yes, you must. Noted by its absense is your desire to know more about the accusations against Obama. You want to ignore his past yet pick through hers with a fine tooth comb.\n \n How liberally biased of you.\n\n \n So you're not actually going to refute the accusations then? in any case all you can come up with against Obama is guilt by association.", 
   {}, 
   327747, 
   null, 
   1223931000.0
  ], 
  [
   327990, 
   null, 
   "grizzly6626", 
   "So you're not actually going to refute the accusations then? in any case all you can come up with against Obama is guilt by association.\n\n \n Have you ever heard the old saying \" where there is smoke there is fire\", im not saying anything is or is not true about Obama. But I will say I personally have seen Obama do things that scare me, as far as politicians go though, I dont trust any of them.", 
   {}, 
   327774, 
   null, 
   1224023760.0
  ], 
  [
   327992, 
   null, 
   "grizzly6626", 
   "So you're not actually going to refute the accusations then? in any case all you can come up with against Obama is guilt by association.\n\n \n One more thought, in a court of law, you can be convicted for guilt by association, I have seen it done.", 
   {}, 
   327774, 
   null, 
   1224023880.0
  ], 
  [
   327994, 
   null, 
   "Penfold", 
   "You may think you did, but even Bush hasn't tried that one yet. Which statute was it prosecuted under? \n \n Meanwhile back at the ranch ......... Or third house, in Palin's case.... I wonder how much the mortgage on it is?", 
   {}, 
   327992, 
   null, 
   1224024240.0
  ], 
  [
   328081, 
   null, 
   "Jo Bennett", 
   "Have you ever heard the old saying \" where there is smoke there is fire\", im not saying anything is or is not true about Obama. But I will say I personally have seen Obama do things that scare me, as far as politicians go though, I dont trust any of them.\n\n \n I've heard the old saying, and I know it's rubbish. I work in education and dealing with utterly false allegations is a daily fact of life.", 
   {}, 
   327990, 
   null, 
   1224052020.0
  ], 
  [
   328084, 
   null, 
   "grizzly6626", 
   "You may think you did, but even Bush hasn't tried that one yet. Which statute was it prosecuted under? \n \n Meanwhile back at the ranch ......... Or third house, in Palin's case.... I wonder how much the mortgage on it is?\n\n \n No I dont think I did, I know I did. My cousin was at a party, got to drunk to drive, was offered a ride home, he accepted, passed out in the back seat of the car, and the designated driver and his buddy robbed a convienience store before getting my cousin home, the cops shortly arrested everyone in the car, including my cousin who was still passed out in the back seat, and all three were tried and convicted. The judge told my cousin to choose a better ride home next time, like my cousin knew what they were going to do. And it even stated in the police report that my cousin was incapacitated at the time of the arrest, and on top of all this, my cousin recieved a charge og public drunkenness, but yet he was in a private automobile, trying to obey the law and be safe by not driving drunk. So tell me how that is not guilt by association, or even right.", 
   {}, 
   327994, 
   null, 
   1224052620.0
  ], 
  [
   328129, 
   null, 
   "simone", 
   "Have you ever heard the old saying \" where there is smoke there is fire\", im not saying anything is or is not true about Obama. But I will say I personally have seen Obama do things that scare me, as far as politicians go though, I dont trust any of them.\n\n But if any one asks you, you suddenly draw a blank and can't possibly remember what any of those \"things that scare me\" are.", 
   {}, 
   327990, 
   null, 
   1224090900.0
  ], 
  [
   328163, 
   null, 
   "Penfold", 
   "No I dont think I did, I know I did. My cousin was at a party, got to drunk to drive, was offered a ride home, he accepted, passed out in the back seat of the car, and the designated driver and his buddy robbed a convienience store before getting my cousin home, the cops shortly arrested everyone in the car, including my cousin who was still passed out in the back seat, and all three were tried and convicted. The judge told my cousin to choose a better ride home next time, like my cousin knew what they were going to do. And it even stated in the police report that my cousin was incapacitated at the time of the arrest, and on top of all this, my cousin recieved a charge og public drunkenness, but yet he was in a private automobile, trying to obey the law and be safe by not driving drunk. So tell me how that is not guilt by association, or even right.\n\n \n Was it your \"cousin\", and was he there or was he not?", 
   {}, 
   328084, 
   null, 
   1224101040.0
  ], 
  [
   328222, 
   null, 
   "grizzly6626", 
   "But if any one asks you, you suddenly draw a blank and can't possibly remember what any of those \"things that scare me\" are.\n\n \n Thats where you are wrong, I know them almost by heart, at least the ones I discovered through a little research. But I do not know the bill numbers or the dates, only what they said.", 
   {}, 
   328129, 
   null, 
   1224113520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Another palin scandal oozes out....", 
  "url": "http://www.4forums.com/political/elections-debates/11754-another-palin-scandal-oozes-out.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11754, 
  "discussion_files": [
   [
    "16125.html", 
    "http://www.4forums.com/political/elections-debates/11754-another-palin-scandal-oozes-out-print.html"
   ]
  ], 
  "identifier": 11754
 }
]