[
 [
  [
   328303, 
   null, 
   "grizzly6626", 
   "I was reading another thread on the issue of racism, and I started thinking about this. Why is it ok for a black person to call another black person the N word, but yet when a white person uses the same word some black people go into a rage. Why is it that some black people think that it is ok to call a white person such names as honky, white cracker, or white bread honky, but if a white person uses racist remarks towards the black person who used the above terminology, the black person then gets angry. Why is it ok for a black male to date and marry a white woman, but it is not ok when a white man marries a black woman. Why is it ok to have things like BET, the all black miss America pageant, the NAACP, and other things which only accept black people, but yet if these organizations only accepted white people, lawsuits would be filed and won. Now dont get me wrong, there are plenty of white hate groups out there, but these white hate groups are not socially acceptable, but yet the above mentioned black programs are. Black people are constantly saying that they are the target of racism, but in reality so are white people. My point on this thread is that we are all Americans, weather we are black, white, or brown, and we should all oppose anything that resembles racism, black americans as well as white americans should oppose things such as BET and the rest, just as we should all oppose things that restrict the blacks and any other skin color from participation, or that teach hatred. I sincerely hope this post is not misunderstood as a message of racism, because that is not its intent, it is intended to simply bring awareness to everyone on the issue of racism in america.", 
   {
    "post_info": {
     "post_title": "Why is this ok"
    }
   }, 
   null, 
   null, 
   1224131520.0
  ], 
  [
   329871, 
   null, 
   "Mass Debater", 
   "Why is it ok for a black person to call another black person the N word, but yet when a white person uses the same word some black people go into a rage.\n\n \n Nigger is all about context. You don't have to worry about a black person calling a black person a racist slur for black people because you know they're not racist. A white person calling a black person a nigger is questioned because there is no inherent sense of camaraderie between a white and black person concerning their race.\n \n \nWhy is it ok for a black male to date and marry a white woman, but it is not ok when a white man marries a black woman. \n\n \n It's OK either way. \n \n \nWhy is it ok to have things like BET, the all black miss America pageant, the NAACP, and other things which only accept black people, but yet if these organizations only accepted white people, lawsuits would be filed and won. Now dont get me wrong, there are plenty of white hate groups out there, but these white hate groups are not socially acceptable, but yet the above mentioned black programs are. Black people are constantly saying that they are the target of racism, but in reality so are white people. \n\n \n These things are born out of being a minority group, there isn't white-only pageants in America because white people are the majority and have representation everywhere else. Exclusive groups are not hate groups but I do disagree with some of the sentiments. \n \n Black people, white people and every other race are subject to racism across the world, yes.", 
   {}, 
   328303, 
   null, 
   1225058160.0
  ], 
  [
   329872, 
   null, 
   "isly ilwott", 
   "I was reading another thread on the issue of racism, and I started thinking about this. Why is it ok for a black person to call another black person the N word, but yet when a white person uses the same word some black people go into a rage. Why is it that some black people think that it is ok to call a white person such names as honky, white cracker, or white bread honky, but if a white person uses racist remarks towards the black person who used the above terminology, the black person then gets angry. Why is it ok for a black male to date and marry a white woman, but it is not ok when a white man marries a black woman. Why is it ok to have things like BET, the all black miss America pageant, the NAACP, and other things which only accept black people, but yet if these organizations only accepted white people, lawsuits would be filed and won. Now dont get me wrong, there are plenty of white hate groups out there, but these white hate groups are not socially acceptable, but yet the above mentioned black programs are. Black people are constantly saying that they are the target of racism, but in reality so are white people. My point on this thread is that we are all Americans, weather we are black, white, or brown, and we should all oppose anything that resembles racism, black americans as well as white americans should oppose things such as BET and the rest, just as we should all oppose things that restrict the blacks and any other skin color from participation, or that teach hatred. I sincerely hope this post is not misunderstood as a message of racism, because that is not its intent, it is intended to simply bring awareness to everyone on the issue of racism in america.\nI think it's called selective acceptance...otherwise known as hypocrisy.\n \n Anything that will garner sympathy for the minority group being described by such terms is presented as negative when it comes from unlike people, but as a legitimate joke when it comes from a member of that group.\n \n As time goes by, more words are being shunned by those too sensitive to understand. The use of the descriptor \"community organizer\" has now come to be a sign racism...as interpretted by those that will lose their significance in American life if racism ever disappears from the scene.", 
   {}, 
   328303, 
   null, 
   1225059300.0
  ], 
  [
   329923, 
   null, 
   "marc9000", 
   "I think it's called selective acceptance...otherwise known as hypocrisy. \n\n \n I think the best term for it is political correctness. \n \n The world is far more complicated than the day is long, and the nature of news reporting and distribution has dictated that one source generally sets the tone for what will be reported each day, and that source is the New York Times.\n \n \nThe New York Times is arguably the most influential media outlet in America. Not only is it the most influential newspaper in the media capital of the world, New York City, but it is also read nationwide and frequently sets the agenda for the television news programs from which most Americans get their news. \n\n \n Example; If a black man with a white woman companion has a hate crime commited against him in the southern US, it will be reported to a far greater extent than would a white man with a black woman companion having a hate crime committed against him on the streets on New York City (or anywhere else for that matter). There are many documented examples of this type of omission of news.\n \n \n IMO the situation described in post #1 didn't come about throughout the general population in a natural way, it has trickled in starting with the NYT, through most news media outlets, including daytime TV like PBS and Oprah. \n \n Political correctness is the result of a combination of omissions of some news, and sensationalism of others. It sells.", 
   {}, 
   329872, 
   null, 
   1225079880.0
  ], 
  [
   330136, 
   null, 
   "grizzly6626", 
   "Well my whole point was that some people think that they should be allowed to say and do certain things because of their skin color, but if a person of a different skin color attempts to do something similar to what the first person did or said, then the first person gets angry about it and resorts to violence or legal action against the second person. Society can call it what they want, but it is plain old racism and descrimination, regardless of who is doing it.", 
   {}, 
   329923, 
   null, 
   1225211700.0
  ], 
  [
   330197, 
   null, 
   "marc9000", 
   "Well my whole point was that some people think that they should be allowed to say and do certain things because of their skin color, but if a person of a different skin color attempts to do something similar to what the first person did or said, then the first person gets angry about it and resorts to violence or legal action against the second person. Society can call it what they want, but it is plain old racism and descrimination, regardless of who is doing it.\n\n \n I agree of course. Do you think there is anything that can be done about it? Some kind of general law or rule? I don't think there is, short of limiting free speech in some way, and I don't think it's worth it. Individual cases of anger usually aren't societal problems - not crimes by themselves. A different story of course when they lead to violence or legal action. How else could they be handled, other than a case-by-case basis?", 
   {}, 
   330136, 
   null, 
   1225244640.0
  ], 
  [
   330201, 
   null, 
   "sinjin", 
   "Some kind of general law or rule?\nGeneral rule? How 'bout \"if you're white, quit complainin\"?", 
   {}, 
   330197, 
   null, 
   1225247040.0
  ], 
  [
   330206, 
   null, 
   "Charliegone", 
   "I admit, I use the word \"nigga\" all the time, but not in the context of trying to offend someone. I use it as a \"friendly\" term if you will with someone I know well. I can understand why some Black people get mad, but some of them take it too seriously and seriously, they need to chill out. I guess maybe because my family is pretty diverse, that we really do not find offense in many things.", 
   {}, 
   330201, 
   null, 
   1225252380.0
  ], 
  [
   330487, 
   null, 
   "grizzly6626", 
   "I agree of course. Do you think there is anything that can be done about it? Some kind of general law or rule? I don't think there is, short of limiting free speech in some way, and I don't think it's worth it. Individual cases of anger usually aren't societal problems - not crimes by themselves. A different story of course when they lead to violence or legal action. How else could they be handled, other than a case-by-case basis?\n\n \n I dont know what can legally be done about it, but i should have the right to sue a person of different race for discrimination, just like they can sue me for descriminating against them.", 
   {}, 
   330197, 
   null, 
   1225410360.0
  ], 
  [
   370993, 
   null, 
   "syklopps61", 
   "I feel it's all a matter of pride...TRUE pride. A Black can call me Cracker, Honky, etc, even when used in a derogatory manner, and it rolls off of my back, because I have a deep pride in my heritage (guess that makes me a racist nowadays). My wife is Hispanic and also has true pride in her heritage and she feels the same, and last time I checked, Hispanics were minorities as well. Now, I will say this, whatever anger I DO feel is not because of the term itself, but because Blacks can say whatever they want with no consequences and I/Whites CAN'T.", 
   {}, 
   330487, 
   null, 
   1253633100.0
  ], 
  [
   370999, 
   null, 
   "JPSartre12", 
   "I feel it's all a matter of pride...TRUE pride. A Black can call me Cracker, Honky, etc, even when used in a derogatory manner, and it rolls off of my back, because I have a deep pride in my heritage (guess that makes me a racist nowadays). My wife is Hispanic and also has true pride in her heritage and she feels the same, and last time I checked, Hispanics were minorities as well. Now, I will say this, whatever anger I DO feel is not because of the term itself, but because Blacks can say whatever they want with no consequences and I/Whites CAN'T.\n\n \n Sounds like you need a \"fightin' whities\" T-shirt. emoticon_xgood\n Fightin' Whities : Fightin Whites", 
   {}, 
   370993, 
   null, 
   1253634900.0
  ], 
  [
   371210, 
   null, 
   "syklopps61", 
   "Sounds like you need a \"fightin' whities\" T-shirt. emoticon_xgood\n Fightin' Whities : Fightin Whites\n\n \n LMAO...Christmas IS coming soon!", 
   {}, 
   370999, 
   null, 
   1253736180.0
  ], 
  [
   371384, 
   null, 
   "JPSartre12", 
   "LMAO...Christmas IS coming soon!\n\n \n If you follow the history, you see that the whole thing began as a shot at whites, and against racial stereotypes in mascots. What they didn't count on was the fact that white's weren't offended by their move and actually demonstrated a good-humored acceptance and subsequent embrace of the attempt. Now, it's a moneymaker for the school. emoticon_xgood", 
   {}, 
   371210, 
   null, 
   1253811060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why is this ok", 
  "url": "http://www.4forums.com/political/society-debates/11777-why-ok.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 11777, 
  "discussion_files": [
   [
    "23573.html", 
    "http://www.4forums.com/political/society-debates/11777-why-ok-print.html"
   ]
  ], 
  "identifier": 11777
 }
]