[
 [
  [
   328800, 
   null, 
   "Jim Colyer", 
   "Obama want to redistribute wealth rather than create it.\n \n http://elections.foxnews.com/2008/10/18/mccain-compares-obamas-tax-policies-socialism/", 
   {
    "post_info": {
     "post_title": "Obama is a socialist"
    }
   }, 
   null, 
   null, 
   1224362580.0
  ], 
  [
   328802, 
   null, 
   "Penfold", 
   "You say that like it was a bad thing.", 
   {}, 
   328800, 
   null, 
   1224366600.0
  ], 
  [
   328804, 
   null, 
   "chester", 
   "Obama want to redistribute wealth rather than create it.\n \n http://elections.foxnews.com/2008/10/18/mccain-compares-obamas-tax-policies-socialism/\n\n \n Were you protesting while the current inhabitant of the People's House on Pennsylvania Avenue was presiding over the greatest UPWARD redistribution of wealth in our country's history?\n \n If not, why not?\n \n Are you rich or are you a SHONDA for those who are?", 
   {}, 
   328800, 
   null, 
   1224369780.0
  ], 
  [
   328836, 
   null, 
   "Jo Bennett", 
   "Let me know when Obama endorses collective ownership of the means of production, then we can talk about socialism. Additionally, redistribution and creation of wealth are not mutually exclusive. Some countries have successfully achieved both (Sweden, Finland).", 
   {}, 
   328804, 
   null, 
   1224406080.0
  ], 
  [
   328837, 
   null, 
   "Penfold", 
   "Since Obama is well to the political right of socialism by any measure outside of American hard conservative propaganda, where does that leave them? ;)", 
   {}, 
   328836, 
   null, 
   1224414060.0
  ], 
  [
   328859, 
   null, 
   "yes", 
   "Obama want to redistribute wealth rather than create it.\n \n http://elections.foxnews.com/2008/10/18/mccain-compares-obamas-tax-policies-socialism/\n\n \n This topic has been tried - Good Luck! These sheeple don't get it!\n \n \nYou say that like it was a bad thing.\n\n \n well - let's see - business gets taxed for buying things and capital gains goes up to 45% means \n that they sell a small retail location and make a modest profit that almost 1/2 gets wiped out with Obama's redistribution of wealth means\n \n WHY bother expanding - we make enough money - screw those who have no jobs - IT IS NOT WORTH IT TO CARE since the government doesn't care about ME keeping money to help them \n \n ... so now poor people can enjoy spam for Christmas dinner emoticon_xdonno\n \n \nWere you protesting while the current inhabitant of the People's House on Pennsylvania Avenue was presiding over the greatest UPWARD redistribution of wealth in our country's history?\n \n If not, why not?\n \n Are you rich or are you a SHONDA for those who are?\n\n \n Who else is desperate enough to employ YOU?? \n When was the last time the poor employed you?\n Bite The Hand That Feeds YOU ... smart! REAL SMART!\n \n \nLet me know when Obama endorses collective ownership of the means of production, then we can talk about socialism. Additionally, redistribution and creation of wealth are not mutually exclusive. Some countries have successfully achieved both (Sweden, Finland).\n\n When Obama endorses collective ownership - it's TOO LATE to stop it!\n \n If American industry was like Sweden and Finland - we would have very little distribution of products (like automotive, paper, computer, and a host of other's) JUST LIKE THEM ... \n \n what was the LAST thing you bought from those wonderful examples of such success?\n \n \nSince Obama is well to the political right of socialism by any measure outside of American hard conservative propaganda, where does that leave them? ;)\n\n That is a ton of BULL! you are talking in THEORY - not reality ...", 
   {}, 
   328800, 
   null, 
   1224427860.0
  ], 
  [
   328861, 
   null, 
   "Jo Bennett", 
   "Well, a huge proportion of the world's phones are made by Nokia, and a fair proportion of my furniture and kitchen utensils are made by Ikea. So, since you ask, probably the large mixing bowl I use for making bread, a plastic spatula and a pair of kitchen scissors. Considering the US is 30+ times the size of either country, I doubt I've bought 30 times as much stuff from US companies. The only reason it's even close is because of US media products and a (semi) shared language.\n \n In any case, it's largely irrelevant when you consider the standard of living in Scandinavia, and the high GDP per capita. It doesn't matter if you have household names based there when people have enough to live on and can afford healthcare, childcare and education.", 
   {}, 
   328859, 
   null, 
   1224428880.0
  ], 
  [
   328865, 
   null, 
   "Penfold", 
   "Sweden's exports are healthy enough that the US had a nine and a half billion dollar trade deficit in 2006. Volvo or Saab ring any automotive bells? And the world's biggest paper producing company is Finnish. (along with the third biggest.) They also have the shipyards that built the worlds largest cruise ships such as the \"Freedom of the Seas\", Kone who make elevators and escalators.....\n Tiny \"socialist\" nations who do pretty well for themselves...", 
   {}, 
   328861, 
   null, 
   1224432660.0
  ], 
  [
   328866, 
   null, 
   "Jo Bennett", 
   "I think it's going a bit far to claim that Sweden and Finland are socialist, social democratic is more accurate. They still operate a capitalist system, albeit a more humane one than practised elsewhere.", 
   {}, 
   328865, 
   null, 
   1224433140.0
  ], 
  [
   328868, 
   null, 
   "Penfold", 
   "Sorry, forgot the quotation marks! Now fixed, though in his worldview, they are likely virtual communists.\n \n ps. When did Obama reject wealth creation?", 
   {}, 
   328866, 
   null, 
   1224435300.0
  ], 
  [
   328870, 
   null, 
   "chester", 
   "\n \n When Obama endorses collective ownership - it's TOO LATE to stop it!\n \n If American industry was like Sweden and Finland - we would have very little distribution of products (like automotive, paper, computer, and a host of other's) JUST LIKE THEM ... \n \n what was the LAST thing you bought from those wonderful examples of such success?\n \n\n \n Volvos, Saabs, Nokia phones.emoticon_idea\n \n Shall we continue?", 
   {}, 
   328859, 
   null, 
   1224435780.0
  ], 
  [
   329170, 
   null, 
   "simone", 
   "Sorry, I'm just going to repost something I posted in another thread:\n \nWhat an idiotic statement! Obama is not a socialist, he is not going to tax the rich and then go over and redistribute that money to the poor. The rich are, finally, going to have to pay their way for the services they have gotten either for free or at very low cost from our tax-financed services at all levels, police protection, the protection of the courts, roads, bridges, infrastructure, etc., and the increased money will also, I hope, be used to lower the debt that Bush incurred in order to lower taxes on the rich.\n \n Obama also wants to create American jobs instead of outsourcing them overseas. Outsourcing was done by the Bush administration in order that the very rich could have access to slave labor in China and elsewhere. Unfortunately, they were stupid and didn't realize that jobless Americans would be unable to pay off their mortgages and buy goods.\n \n Obama wants to see working people paid a living wage so that they can afford to buy, to consume American goods, so they can afford to pay off their mortgages, send their kids to college, do all the things that are part of the American dream that Bush has so carefully dismantled.\n \n Obama wants our nation to become America, the land of opportunity for all, again.\n \n Only anti-Americans would have a problem with that.\n", 
   {}, 
   328870, 
   null, 
   1224610440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Obama is a socialist", 
  "url": "http://www.4forums.com/political/current-events-debates/11794-obama-socialist.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 11794, 
  "discussion_files": [
   [
    "32802.html", 
    "http://www.4forums.com/political/current-events-debates/11794-obama-socialist-print.html"
   ]
  ], 
  "identifier": 11794
 }
]