[
 [
  [
   329010, 
   null, 
   "Ethmi", 
   "The only thing I have to say is that if you can persuade 2/3s of congress to agree on anything at all, I salute you.", 
   {
    "post_info": {
     "post_title": "Will guns in the US ever be banned?"
    }
   }, 
   null, 
   null, 
   1224530640.0
  ], 
  [
   329046, 
   null, 
   "grizzly6626", 
   "If Obama and Biden are elected, and with the majority of congress already consisting of anti-gun democrats, and if anti-gun judiciaries are appointed to the supreme court, then gun ownership could very well be banned, unconstitutional or not. But, since Obama can only serve eight years max, then the next president could undo the gun ban. But if Obama does ban guns, he will surely make the ban unchangeable by future leaders. I personally cant see Obama, congress, or the supreme court passing a gun ban though, because it would not only be political suicide, a gun ban would also devastate the economy. But if a gun ban is tried, look for the right to vote to dissapear as well, plus he will do away with the eight years maximum law that he can serve, he will do these to prevent being voted out of office and to keep from running out of time in which he can serve as president, thus making Obama a dictator at this point, and from there, all hell would break loose for Americans.", 
   {}, 
   329010, 
   null, 
   1224537000.0
  ], 
  [
   329060, 
   null, 
   "gansao", 
   "If Obama and Biden are elected, and with the majority of congress already consisting of anti-gun democrats, and if anti-gun judiciaries are appointed to the supreme court, then gun ownership could very well be banned, unconstitutional or not. But, since Obama can only serve eight years max, then the next president could undo the gun ban. But if Obama does ban guns, he will surely make the ban unchangeable by future leaders. I personally cant see Obama, congress, or the supreme court passing a gun ban though, because it would not only be political suicide, a gun ban would also devastate the economy. But if a gun ban is tried, look for the right to vote to dissapear as well, plus he will do away with the eight years maximum law that he can serve, he will do these to prevent being voted out of office and to keep from running out of time in which he can serve as president, thus making Obama a dictator at this point, and from there, all hell would break loose for Americans.\n\n \n If Obama gets elected he will walk straight into the worse financial crisis in the states for decades. Within weeks Russia,North Korea and Iran will test his resolve( China will wait to see what he does). This will keep him busy for a while. The last thing that he will want to do will be to address controversial issues like gun control or abortion. This will come in his second term or never!", 
   {}, 
   329046, 
   null, 
   1224538860.0
  ], 
  [
   329079, 
   null, 
   "grizzly6626", 
   "If Obama gets elected he will walk straight into the worse financial crisis in the states for decades. Within weeks Russia,North Korea and Iran will test his resolve( China will wait to see what he does). This will keep him busy for a while. The last thing that he will want to do will be to address controversial issues like gun control or abortion. This will come in his second term or never!\n\n \n You might very well be acurate here, but no one asked for a time frame on a gun ban, only if it could happen. And Obama could very well hire someone right out of the gate to write a gun ban for him to send through a biased congress for approval, and then sign it himself, sending it into law.", 
   {}, 
   329060, 
   null, 
   1224542220.0
  ], 
  [
   329083, 
   null, 
   "gansao", 
   "You might very well be acurate here, but no one asked for a time frame on a gun ban, only if it could happen. And Obama could very well hire someone right out of the gate to write a gun ban for him to send through a biased congress for approval, and then sign it himself, sending it into law.\n\n \n Can you really see that Grizzly?\n It would literally cause a revolution in certain States.\n Obama needs everybody on his side in the forseeable future.\n There wont be any real attempt for at least a generation I think.\n Not until the American public accepts a much more left wing government than they would today.\n As long as there is a lot of opposition I cant see it happening.", 
   {}, 
   329079, 
   null, 
   1224542700.0
  ], 
  [
   329191, 
   null, 
   "grizzly6626", 
   "Can you really see that Grizzly?\n It would literally cause a revolution in certain States.\n Obama needs everybody on his side in the forseeable future.\n There wont be any real attempt for at least a generation I think.\n Not until the American public accepts a much more left wing government than they would today.\n As long as there is a lot of opposition I cant see it happening.\n\n \n All I know is Obama and Biden both have a bad history of voting agains law abiding gun owners, if they are given a gun ban bill to sign, they will almost certainly sign it.", 
   {}, 
   329083, 
   null, 
   1224615360.0
  ], 
  [
   329381, 
   null, 
   "Omegamon_X", 
   "More interesting news from Britain.\n \n Gun crime 60pc higher than official figures - Telegraph\n \n Figures to be published by the Home Office this week will massively understate the scale of the problem.\n \n Data provided to The Sunday Telegraph by nearly every police force in England and Wales, under freedom of information laws, show that the number of firearms incidents dealt with by officers annually is 60 per cent higher than figures stated by the Home Office.\n \n Last year 5,600 firearms offences were excluded from the official figures. It means that, whereas the Home Office said there were only 9,800 offences in 2007/8, the real total was around 15,400. The latest quarterly figures, due to be released on Thursday, will again exclude a significant number of incidents.\n \n The explanation for the gulf is that the Government figures only include cases where guns are fired, used to \"pistol whip\" victims, or brandished as a threat.\n \n Thousands of offences including gun-smuggling and illegal possession of a firearm - which normally carries a minimum five-year jail sentence - are omitted from the Home Office's headline count, raising questions about the reliability of Government crime data.\n \n Dominic Grieve, the shadow home secretary, said: \"These alarming new figures not only highlight the appalling state of gun crime in this country, but also remind us just how poor the Government's statistics actually are.\n \n \"Crime statistics must also be compiled and published independent of the Home Office, and crime mapping rolled out so that people can have confidence in what they are being told about the state of crime in this country.\"\n \n Chris Huhne, the Liberal Democrat home affairs spokesman, said the figures revealed the extent to which gun crime is a \"scar on society\".\n \n \"It is shocking that the Home Office is in denial about the extent of gun crime by refusing to include offences where a gun is present but not brandished,\" he said.\n \n \"This is another strong reason why the Home Office should not be in charge of collecting its own statistics, which should be put directly under the responsibility of the Office for National Statistics.\n \n \"Gun crime must be treated with the same seriousness and concern as knife crime. Both are a scar on our society.\"\n \n In all, there were at least 5,612 offences excluded from the Home Office's official gun crime total last year, according to figures supplied by police forces.\n \n The true total number of excluded offences will have been even higher, because two of the 43 forces in England and Wales, Thames Valley and Leicestershire, failed to hand over their data when asked to do so under the Freedom of Information Act, and a large urban force, Greater Manchester, provided incomplete statistics. Scotland records gun crime differently.\n \n When the Home Office publishes its latest quarterly crime figures on Thursday, they will include a section on gun crime injuries and deaths, but the figures will again exclude a significant number of incidents.\n \n The Sunday Telegraph's figures suggest that the Metropolitan Police's official tally of 3,300 gun crimes in 2006/7, the most recent available, would have risen to around 5,000 if excluded categories had been counted. In 2007, Met officers dealt with 1,678 firearms incidents which were not included in the official tally. The Met's figures show that offences of firearms possession in the capital rose from 850 five years ago to 1,400 last year.\n \n After the Met, the second-highest number of offences excluded from the official statistics was recorded by West Midlands Police with 404, taking the force's true annual total of gun crimes to around 1,400.\n \n Richard Garside, director of the Centre for Crime and Justice Studies at King's College London, said: \"We welcome this research. Effective policy-making needs to be informed by the best information available.\n \n \"Firearms offences are comparatively rare in Britain, and the vast majority thankfully do not result in a serious or fatal injury. But if the police already collect this information it is difficult to understand why it should not be put routinely into the public domain.\"\n \n The Home Office crime figures document states: \"Firearms are taken to be involved in a crime if they are fired, used as a blunt instrument against a person, or used as a threat.\"\n \n A Home Office spokeswoman said: \"Gun crime figures have only ever included offences involving the use of a firearm. These counting rules for these figures were drawn up by the Home Office in conjunction with police.\"\n \n She added: \"There are five offences which are not included in the firearm statistics, and which can be tried for in the courts.\"\n \n The Sunday Telegraph also recently revealed that knife crime figures were at least two-thirds higher than official figures.\n \n Police statistics showed forces in England and Wales are on course to record 38,000 serious knife crimes this year, or more than 100 a day, compared with last year's official total of 22,151 offences, a figure announced by the Home Office in July in its first annual count of knife crimes.", 
   {}, 
   329010, 
   null, 
   1224708660.0
  ], 
  [
   329391, 
   null, 
   "iangb", 
   "...is this even remotely on-topic?\n \n Reading the article - the extra 'gun crimes' that have been 'shockingly revealed' in this article are those crimes where a gun has been smuggled or illegally possessed, not crimes where a gun has been used used. As such, they wouldn't be used in my figures for the US either, which were compiled from the 'violent crime' section.\n \n It's quite hard to argue that this is particularly shocking. It is interesting though, thanks emoticon_xgood.\n \n EDIT: I suppose I should say something on-topic... I doubt that guns will ever be 'banned' in the US, there are too many states which don't agree with it. However, more restrictions on guns might be put forwards at some point...", 
   {}, 
   329381, 
   null, 
   1224710280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Will guns in the US ever be banned?", 
  "url": "http://www.4forums.com/political/gun-control-debates/11809-will-guns-us-ever-banned.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11809, 
  "discussion_files": [
   [
    "26298.html", 
    "http://www.4forums.com/political/gun-control-debates/11809-will-guns-us-ever-banned-print.html"
   ]
  ], 
  "identifier": 11809
 }
]