[
 [
  [
   329042, 
   null, 
   "ServantOfChrist", 
   "Hey there everyone, I'd like to open a debate about creationism (young earth is my partiular belief) versus Evolutionism.\n \n Here is my opening argument against evolution:\n \n There are in fact no transitional fossils known. Some believe there are because they have been told there are. An examination of the fossils proves otherwise. What there are however, is thousands of animals in fossils which exist exactly today as they did hundreds of millions of years ago (according to evolutionist interpretation of the fossil record) without noticable change. \n \n Evolution is said to occur by mutation and mutation occurs to all life forms, by the sun's radiation and DNA recombining error by if no other means! If evolution occurs to all life forms, there could be no life forms today which have not evolved, because all life would be in transition. Mutation does not stop once an animal becomes well suited for their envioronment. It continues to occur to all life. Living fossils are proof that evolution has not occurred. Natural selection would have eliminated those which did not evolve.\n \n Not even Tikaalik is transition, as it is not unlike lobe-finned fish that exist today. Furthermore, Tikaalik does not have shoulder bones or muscles and could therefore not support it's own weight, which is said to be @ 900 lbs. Have you ever seen a deep sea tuna or a dolphin waddling across land? Small fish can do it. But not such a large one. Small whales are beached constantly trying to get onto land because their weight is too great to allow them locomotion on land without shoulder bones and muscle stuctures. Tikaalik has neither, and was too heavy to support it's weight without shoulder bones or muscles and could not therefore crawl onto land and back into the sea - not without shoulder bones and muscles.\n \n All attempts to find a mechanism for evolution in microbiology are futile. We already know the outcome - chicken & egg paradox, DNA's complexity is impossible to be created by nature, no new information in the DNA to new define features or morphologies, zero transitional forms in the fossil record when they should dominate it, many thousands of living fossils, the irreducible complexity of biological machinery, intelligence cannot arise from molecules - it is a trait that is passed along from a parent organism - a molecule has no intelligence, human abilities such as creativity, philosophy, emotion, inventiveness - none of which can be had from molecules or amino acids, etc.", 
   {
    "post_info": {
     "post_title": "Evolution vs. Creationism"
    }
   }, 
   null, 
   null, 
   1224536100.0
  ], 
  [
   329048, 
   null, 
   "gansao", 
   "There are in fact no transitional fossils known. Some believe there are because they have been told there are. An examination of the fossils proves otherwise. What there are however, is thousands of animals in fossils which exist exactly today as they did hundreds of millions of years ago without noticable change. .\n\n \n So do you think that the earth is hundreds of millions of years old?", 
   {}, 
   329042, 
   null, 
   1224537060.0
  ], 
  [
   329053, 
   null, 
   "ServantOfChrist", 
   "So do you think that the earth is hundreds of millions of years old?\n\n \n No. Sorry, I wasn't absolutely clear there - I was speaking of the Evolutionist \"fossil record\" which they CLAIM is hundreds of millions of years old.\n \n Sorry for the confusion there.", 
   {}, 
   329048, 
   null, 
   1224537480.0
  ], 
  [
   329056, 
   null, 
   "gansao", 
   "No. Sorry, I wasn't absolutely clear there - I was speaking of the Evolutionist \"fossil record\" which they CLAIM is hundreds of millions of years old.\n \n Sorry for the confusion there.\n\n \n Ok mate but I would edit it if I were you because you are taking on probably the most difficult argument that there is to debate. Good Luckemoticon_xgood", 
   {}, 
   329053, 
   null, 
   1224538020.0
  ], 
  [
   329070, 
   null, 
   "gansao", 
   "What do you think fossils are ?", 
   {}, 
   329056, 
   null, 
   1224541140.0
  ], 
  [
   329144, 
   null, 
   "obvious_child", 
   "\n There are in fact no transitional fossils known. Some believe there are because they have been told there are. An examination of the fossils proves otherwise. What there are however, is thousands of animals in fossils which exist exactly today as they did hundreds of millions of years ago (according to evolutionist interpretation of the fossil record) without noticable change.\n\n \n Factually False.\n \n Transitional fossils exist in relatively large amounts. Furthermore, every species is transitional. \n \n http://www.talkorigins.org/faqs/faq-transitional.html\n http://www.talkorigins.org/indexcc/CC/CC200.html\n \n There is no species today that existed millions of years ago that are identical. \n \n http://www.talkorigins.org/indexcc/CB/CB930.html\n \n Even the coelacanth has changed over time. \n \n http://www.talkorigins.org/indexcc/CB/CB930_1.html\n \n \nEvolution is said to occur by mutation and mutation occurs to all life forms, by the sun's radiation and DNA recombining error by if no other means!\n\n \n Factually incorrect again. Radiation is not purely solar in origin. And species can gain new genes through viral vectors. Good college prep high schools run these experiments to show how gene transfers can lead to new traits in new animals. \n \n \nIf evolution occurs to all life forms, there could be no life forms today which have not evolved, because all life would be in transition.\n\n \n And all life is in transition. Even the roach. Bacteria as we speak are evolving. \n \n \nMutation does not stop once an animal becomes well suited for their environment. It continues to occur to all life. Living fossils are proof that evolution has not occurred. Natural selection would have eliminated those which did not evolve.\n\n \n Incorrect. Living Fossils have changed. The links to several are already provided in my counter argument. \n \n \nNot even Tikaalik is transition, as it is not unlike lobe-finned fish that exist today.\n\n \n The Tikaalik is extinct. Therefore it cannot be in transition. \n \n \nFurthermore, Tikaalik does not have shoulder bones or muscles and could therefore not support it's own weight, which is said to be @ 900 lbs.\n\n \n Where did you get that weight number from? It appears you just ran a search and assumed that Tikaalik was a cephalopod. The first result in Google appears to support my claim about your researching 'skills.' \n \n \nHave you ever seen a deep sea tuna or a dolphin waddling across land? Small fish can do it. But not such a large one. Small whales are beached constantly trying to get onto land because their weight is too great to allow them locomotion on land without shoulder bones and muscle stuctures. Tikaalik has neither, and was too heavy to support it's weight without shoulder bones or muscles and could not therefore crawl onto land and back into the sea - not without shoulder bones and muscles.\n\n \n Tikaalik did have weight bearing fins. \n http://en.wikipedia.org/wiki/Tiktaalik\n \n Perhaps you should edit your post after researching what Tikaalik actually had? \n \n \nAll attempts to find a mechanism for evolution in microbiology are futile.\n\n \n And what mechanisms are you specifically saying are futile? \n \n \nWe already know the outcome - chicken & egg paradox, DNA's complexity is impossible to be created by nature\n\n \n Based on what reasoning? RNA is simple. And we know that RNA was created in special types of clay. We know that under certain conditions amino acids form. Or are you using the dishonest, fallacious and generally questionable argument of sequential trials rather then the reality based parallel trials that we see in every cubic foot of soil? \n \n \nno new information in the DNA to new define features or morphologies, zero transitional forms in the fossil record when they should dominate it, many thousands of living fossils, the irreducible complexity of biological machinery\n\n \n We do have new information that is added to DNA. And we have numerous examples of transitional fossils. As for living fossils, none of them are identical to their fossil ancestors. \n \n http://www.talkorigins.org/indexcc/CB/CB102.html\n \n \nintelligence cannot arise from molecules - it is a trait that is passed along from a parent organism - a molecule has no intelligence, human abilities such as creativity, philosophy, emotion, inventiveness - none of which can be had from molecules or amino acids, etc.\n\n \n Based on what? Emotions are chemically based. What makes you think that evolution can't produce creativity, philosophy, emotion, inventiveness?\n \n Nothing you have said is factual. Not a single thing.", 
   {}, 
   329042, 
   null, 
   1224583080.0
  ], 
  [
   329145, 
   null, 
   "obvious_child", 
   "Furthermore, Evolution isn't necessarily impossible on a short time frame.\n \n Below are 29+ evidences for evolution.\n www.talkorigins.org/faqs/comdesc\n \n My question to you, Servant, is how do you deal with the heat problems of a young Earth? \n \n YECs, as I understand them, believe that the world was much flatter during the time of the flood, thus requiring less water. The problem with that is to produce such massive mountains across the world in 4000+ years would require massive geological upheaval. With such upheaval, the internal heat of the planet would need to be staggeringly more then what we see today. Where did all of this heat go? Why is there absolutely no records anywhere about such truly epic geological changes happening every day? You'd think that the people living in the Indian Subcontinent would write down the happenings of huge earthquakes and massive volcanoes. \n \n Another big problem is that of the flood. If you accept that the mountains existed as they were, the water requirements to flood the earth to the levels written in the Bible would require over 300% of the water on the planet now. Where did all of that water come from? If it came from the fountains of the deep, it would be superheated. Releasing trillions of cubic miles of superheated water into the atmosphere would have poached all life aside from thermophilic bacteria. Noah would have been dead along with everything else. If the water was in a vapor canopy, not only would it break down from UV, but it would raise pressure to the level of toxicity. Same outcome: everyone's dead. \n \n Another big problem is the issue of hydrological sorting. You can test this in your sink. Fill your sink, and then drop in different sized and mass objects. The heavier ones sink faster. Therefore, if the flood occurred, we should see organisms sorted by mass and shape. Aka, elephants with large dinosaurs. We don't. In fact we see species that evolution predicted in the same layer. And we see species generally sorted by primitive to complex. This doesn't make any sense with a global flood. \n \n Evolution may have a few holes here and there, but literal creationism frankly doesn't make an ounce of sense.", 
   {}, 
   329042, 
   null, 
   1224584100.0
  ], 
  [
   329148, 
   null, 
   "gansao", 
   "OV went straight in with the knockout punch. I was hoping to get more of what the YECs actually believe. I would have like to have seen a complete version of what SOV thought happened. Instead the argument was that evolution is not proven.\n Evolution of a kind happens all the time.\n The problem with bacterial resistance to antibiotics is an example of evolution within a small time span. The breeding of domesticated pets and farm animals into different shapes, sizes and temperament is just evolution being harnessed by farmers and breeders.\n As for the flood, God must have placed an incredible amount of water onto the surface of the Earth for forty days then took it away without leaving a trace. All the dead animals would sink to the bottom of the water and lie in different depths under the ground below.\n Maybe they think that was the point, that God created the world but deliberately left all the clues that he didnt , maybe to test faith in him.\n \n If not God the story creating the world in seven days is just an allegory.", 
   {}, 
   329145, 
   null, 
   1224596280.0
  ], 
  [
   329257, 
   null, 
   "obvious_child", 
   "maybe to test faith in him.\n\n \n That makes God a liar. How you say? Simple.\n \n If God created the world as literal genesis interprets, then God is operating the world on a vastly different set of physical and natural laws. Therefore God is deliberately deceiving us every second of our lives. That makes God a rather large liar. \n \n If God created the world as we see it and according to the laws of physics and nature, then God is lying in the Bible under a literal interpretation as he did NOT create the world in such a fashion and in such a short time frame. God is again lying, but in the Bible. \n \n A literal interpretation of Genesis results in God being a huge deceiver. It is said that reason is the greatest gift by God to man. Reason deduces that literal interpretation makes God a liar.", 
   {}, 
   329148, 
   null, 
   1224641460.0
  ], 
  [
   329268, 
   null, 
   "obvious_child", 
   "One more issue, irreducible complexity and Intelligent Design for that matter are effectively nothing more then animism. Irreducible complexity is a term to describe things we cannot explain now. The problem is that on the primary fundamental layer, irreducible complexity and intelligent design are nothing more then cop-outs. Animism seeks to explain the natural world by crediting Gods. What we did not know, we believed to have been of divine nature, the rains for example. ID simply replaces rain and lightning with the eye or some other organ that currently we may not fully be able to explain. Most people have rejected animism for obvious reasons: its premise is silly as it is fundamentally the god of the gaps. Intelligent Design and its concept of irreducible complexity are nothing more then repackaged animism.", 
   {}, 
   329042, 
   null, 
   1224649980.0
  ], 
  [
   329293, 
   null, 
   "gansao", 
   "OV That makes God a liar. How you say? Simple.\n \n No it doesnt make God a liar .No more than people dying makes God a serial killer!\n What it does do is mask the real message of God !\n \n OV It is said that reason is the greatest gift by God to man\n \n Is that in the bible?", 
   {}, 
   329257, 
   null, 
   1224676380.0
  ], 
  [
   329434, 
   null, 
   "obvious_child", 
   "\n No it doesnt make God a liar .No more than people dying makes God a serial killer!\n What it does do is mask the real message of God !\n\n \n Yes it does. If God deliberately is deceiving us either in the Bible or in the natural world, God is a liar. Case 1: God knows that the world was not made according to literal Genesis but states otherwise in the Bible. That is deception and God is pushing a known falsehood as fact. That's a lie and God know it is a lie. Therefore God is a liar. Case 1: God operates the world very differently then how it was created. Therefore God is deliberately deceiving us. \n \n \nOV It is said that reason is the greatest gift by God to man\n \n Is that in the bible?\n\n \n No. Socrates.", 
   {}, 
   329293, 
   null, 
   1224719880.0
  ], 
  [
   329653, 
   null, 
   "gansao", 
   "Yes it does. If God deliberately is deceiving us either in the Bible or in the natural world, God is a liar. Case 1: God knows that the world was not made according to literal Genesis but states otherwise in the Bible. That is deception and God is pushing a known falsehood as fact. That's a lie and God know it is a lie. Therefore God is a liar. Case 1: God operates the world very differently then how it was created. Therefore God is deliberately deceiving us. .\n\n \n Its not God its Satan.ok look at it any way you like either if its the truth or a myth. It is actually Satan that is decieving man not god.\n It gets a bit complicated and I would have to bone up on it a bit to explain . Oh the existence Satan does not mean that there is a hell. It does not exist you will be pleased to know!\n \n \n \n \nNo. Socrates.\n\n \n I thought it was not in the Bible because reason and especially 'worldlyness'\n is what has gotten us into trouble.", 
   {}, 
   329434, 
   null, 
   1224885240.0
  ], 
  [
   329660, 
   null, 
   "obvious_child", 
   "Its not God its Satan.\n\n \n Maybe, but even if God isn't, that doesn't preclude God from the ability to deceive and lie. A literal interpretation of Genesis requires a liar God and that God to be engaging in lies now. That's a big problem with literal creationism that extends well beyond the factual hard sciences. \n \n \nok look at it any way you like either if its the truth or a myth. It is actually Satan that is decieving man not god.\n\n \n That we do not know. And would God allow Satan to operate his creation in a way that completely goes against how he made it for thousands of years? Furthermore, would God have allowed Satan to pervert the Bible into saying something untrue? \n \n \nIt gets a bit complicated and I would have to bone up on it a bit to explain . Oh the existence Satan does not mean that there is a hell. It does not exist you will be pleased to know!\n\n \n I'm not a Christian and haven't been one for quite some time. Hell to me, is largely just a threat that immature Christians make to get what they want. \n \n \nI thought it was not in the Bible because reason and especially 'worldlyness'\n is what has gotten us into trouble.\n\n \n More like Christians ignoring the moral and ethical teachings of Christ and using religion as a cover for their secular desires. But we're getting off topic even if servantofchrist isn't ever coming back to discuss this, which I'm willing to bet money on.", 
   {}, 
   329653, 
   null, 
   1224886920.0
  ], 
  [
   329666, 
   null, 
   "gansao", 
   "Maybe, but even if God isn't, that doesn't preclude God from the ability to deceive and lie. A literal interpretation of Genesis requires a liar God and that God to be engaging in lies now. That's a big problem with literal creationism that extends well beyond the factual hard sciences. \n \n \n \n That we do not know. And would God allow Satan to operate his creation in a way that completely goes against how he made it for thousands of years? Furthermore, would God have allowed Satan to pervert the Bible into saying something untrue? \n \n \n \n I'm not a Christian and haven't been one for quite some time. Hell to me, is largely just a threat that immature Christians make to get what they want. \n \n \n \n More like Christians ignoring the moral and ethical teachings of Christ and using religion as a cover for their secular desires. But we're getting off topic even if servantofchrist isn't ever coming back to discuss this, which I'm willing to bet money on.\n\n \n \n Im working at the moment so will not have time to add much of value but in a few days I will try to answer these questions as well as a I can and try to make it interesting.", 
   {}, 
   329660, 
   null, 
   1224887940.0
  ], 
  [
   329898, 
   null, 
   "obvious_child", 
   "SOC appears to have left the building.", 
   {}, 
   329666, 
   null, 
   1225071600.0
  ], 
  [
   330884, 
   null, 
   "byozaw", 
   "then I will debate", 
   {}, 
   329898, 
   null, 
   1225685520.0
  ], 
  [
   331822, 
   null, 
   "obvious_child", 
   "byozaw appears to have left the building. \n \n I asked SOC before, \"If you can't win in the regular forum, why bother in the formal?\" \n \n Thus, I must ask again, why bother if you're going to run away?", 
   {}, 
   330884, 
   null, 
   1226207280.0
  ], 
  [
   331956, 
   null, 
   "ServantOfChrist", 
   "byozaw appears to have left the building. \n \n I asked SOC before, \"If you can't win in the regular forum, why bother in the formal?\" \n \n Thus, I must ask again, why bother if you're going to run away?\n\n \n Sorry if I actually have a life and cannot post constantly on the forums. I've been tying up a lot of deals at work and frankly have not had the time to do much besides visit a few minutes and read new posts. This is the reason I did not want to commit to an actual formal debate but rather a formal open debate.\n \n So again, sorry if you think I am required to post to your whims, but I will post when I please and when I have time, Child. You can claim I am \"running away\" all you please, Child, if you enjoy trying to claim victory or something.", 
   {}, 
   331822, 
   null, 
   1226263920.0
  ], 
  [
   332082, 
   null, 
   "obvious_child", 
   "[QUOTE=ServantOfChrist;331956 but I will post when I please [/QUOTE]\n \n Got it. Therefore this thread should be deleted as you won't come back.", 
   {}, 
   331956, 
   null, 
   1226288940.0
  ], 
  [
   335020, 
   null, 
   "Larni", 
   "Victory for Obvious Child?", 
   {}, 
   332082, 
   null, 
   1228240380.0
  ], 
  [
   335065, 
   null, 
   "obvious_child", 
   "Victory for Obvious Child?\n\n \n When was the last time a creationist stood their ground on the flood when they weren't able to change the subject? Never?", 
   {}, 
   335020, 
   null, 
   1228256520.0
  ], 
  [
   335120, 
   null, 
   "Larni", 
   "Yeah, spose so.", 
   {}, 
   335065, 
   null, 
   1228270200.0
  ], 
  [
   336404, 
   null, 
   "Another opinion", 
   "This may be a slight tangent to any debate about a global flood, but there is substantial evidence of a large-scale flood around the Black Sea that may well have led to the perpetuation, elaboration, and final enshrinement in written form of the flood stories. Scientists from Columbia University discovered just such evidence around the Black Sea: (from http://www.columbia.edu/cu/news/99/11/flood.html )\n \nRyan and Pitman believe that the sealed Bosporus strait, which acted as a dam between the Mediterranean and Black seas, collapsed when climatic warming at the close of the last glacial period and caused icecaps to melt, raising global sea level. With more than 200 times the force of Niagara falls, the flood caused water levels in the Black Sea, which was no more than a large lake, to rise six inches per day and swallowed 60,000 square miles in less than a year. As the Mediterranean salt water replaced fresh water, it caused a wave of human migration from what had been an oasis of fresh water within very arid lands--an exodus traumatic enough to be recorded in human memory as the epic of Gilgamesh and the biblical story of Noah's Ark, the scientists said.\n ...\n Using cutting-edge sonar equipment to map the ancient shoreline, Ryan and Pitman found that the shores had been at least 140 meters lower than the present shoreline. They also found a single, uniform layer of mud that strongly indicated a flood. When the sediment core samples were brought to the surface, Candace Major, a student intern for the cruise who is now a graduate student at Lamont, discovered sun-bleached freshwater mollusks, fossilized plant roots and cracks in the buried mud indicating that it had once been dried out and windswept.\n \n \"We came back with the goods,\" said Pitman.\n \n While the scientists waited for the mollusk shell carbon-14 dates from an accelerated mass spectrometer--a machine with the highest accuracy available--they knew that those dates would be the ultimate test. If the sea had grown slowly for more than a thousand years, so would the population of the mollusks. But if a flood had occurred, all the mollusks would be approximately the same age.\n \n In February 1994, the results came in. There was only a 40 year difference between the mollusks in the deepest layers and the ones in the shallowest. The date was 5,600 B.C.-- within the era of modern human history.\n \n \"Statistically, the dates were the same. It was pretty persuasive,\" said Pitman.\n \n So with the scientific story in place, Ryan and Pitman began looking at other aspects of the story. They consulted with archeologists, anthropologists, linguists and seed geneticists. From this research, their hypothesis took shape: the Black Sea was an oasis where people from surrounding areas migrated during a cold, arid period beginning in 6,200 B.C. and exchanged languages, ideas and farming. When the Bosporus dam broke and the valley was deluged, the scientists believe, the peoples migrated to higher lands, taking the farming and cultural adaptations with them. The memory of the flood continued in an oral tradition for three thousand years until written languages emerged, and the tale remains in the epic of Gilgamesh and the biblical story of Noah.\n\n I personally do not believe in the literal interpretation of the Bible. However, I do agree with many who simply view it as a history of a people - the Hebrews - who may have interpreted various events in their lives religiously since they had no science to tell them otherwise. To local peoples, a relatively local flood would seem like a world flood. I personally find it interesting to find sources of information of the core (and usually much less exciting) reality that led to the Bible stories and other mythical stories (such as Troy).", 
   {}, 
   335120, 
   null, 
   1229114220.0
  ], 
  [
   341900, 
   null, 
   "pro-con", 
   "Even if we cann't explain every thing in the bible we still have faith. The very meaning of faith is to believe in something, even if you can't always prove it.", 
   {
    "post_info": {
     "post_title": "faith"
    }
   }, 
   336404, 
   null, 
   1233030000.0
  ], 
  [
   341994, 
   null, 
   "Larni", 
   " However, I do agree with many who simply view it as a history of a people - the Hebrews - who may have interpreted various events in their lives religiously since they had no science to tell them otherwise. To local peoples, a relatively local flood would seem like a world flood. I personally find it interesting to find sources of information of the core (and usually much less exciting) reality that led to the Bible stories and other mythical stories (such as Troy).\n\n \n \n This is a very ggood attitude to have and I imagine any non creationist would largely agree. \n \n The problem only becomes apparent when creationists try to pass their beliefs in the inerrant nature of the xian bible as a scientific account of natural history.\n \n Such as treating the xian creation story in a science class.", 
   {}, 
   336404, 
   null, 
   1233052740.0
  ], 
  [
   341995, 
   null, 
   "Larni", 
   "Even if we cann't explain every thing in the bible we still have faith. The very meaning of faith is to believe in something, even if you can't always prove it.\n\n \n \n I would suggest that you have put your finger on the whole point of being a good xian.\n \n When xian apologetics get trumpeted as 'evidence' to support faith they are totally missing the point of 'having faith'.", 
   {}, 
   341900, 
   null, 
   1233052920.0
  ], 
  [
   342247, 
   null, 
   "obvious_child", 
   "Even if we cann't explain every thing in the bible we still have faith. The very meaning of faith is to believe in something, even if you can't always prove it.\n\n \n Actually we can explain it. Genesis is a metaphor for what actually happened. Aka, literal genesis is the wrong interpretation. \n \n YEC =/= Christanity. Get that through your head.", 
   {}, 
   341900, 
   null, 
   1233196260.0
  ], 
  [
   392179, 
   null, 
   "Riverarod", 
   "I'm curious where Obvious is getting his resources on transitional forms? I have been reading and studying on evolution and there, to my knowledge have been no \"proven scientific or otherwise\" fossils found. If he is simply believing everything he hears out of the mouth of the media and or scientists then he Obviously has greater faith in them than I do and greater faith in us all for that matter.", 
   {}, 
   342247, 
   null, 
   1266987180.0
  ], 
  [
   392184, 
   null, 
   "Penfold", 
   "I'm curious why anyone would reincarnate a zombie thread more than a year old.", 
   {}, 
   392179, 
   null, 
   1266988380.0
  ], 
  [
   392202, 
   null, 
   "Riverarod", 
   "Its enough for you to reply my friend", 
   {}, 
   392184, 
   null, 
   1266993360.0
  ], 
  [
   392217, 
   null, 
   "Larni", 
   "Obvious is getting his info from the sites Talk Origins and Wiki. I would be tentative about wiki but Talk Origins is most well received.\n \n I would also hazard Obvious uses EvCforum.net as well.", 
   {}, 
   392202, 
   null, 
   1267018200.0
  ], 
  [
   392297, 
   null, 
   "Riverarod", 
   "Thanks Larni, I'm confused because I've been researching this a lot lately and all transitional forms to date have gaping holes or are from other fossils not related to the animal themselves. That's all.", 
   {}, 
   392217, 
   null, 
   1267048620.0
  ], 
  [
   392838, 
   null, 
   "Larni", 
   "Thanks Larni, I'm confused because I've been researching this a lot lately and all transitional forms to date have gaping holes or are from other fossils not related to the animal themselves. That's all.\n\n \n If you think of the fossil record as a line from 240 MYA (for example) right through to today and pick any fossil that has been discovered you will see a gaping hole on either side. \n \n If another fossil is found and dated to some point in between your original fossil and it's proposed ancestor (i.e. existing today) you will have created two 'gaps'. Each fossil you find of an organisms evolutionary path will create two more 'gaps' and so on.\n \n The only way you can resolve the 'gaping hole' problem is two find a fossil for an organism at every generation.\n \n The gaps problem is like a jigsaw: you don't need all the pieces to realise what the picture is.\n \n A good way to look at is this way: what does having 'gaping' holes in the fossil record rather than having a fossil of every type of organism that ever lived at every generation?\n \n Why is the first situation a problem?\n \n You must be aware that every organism is a transitional organism: think of the chicken and the egg conundrum.\n \n Which came first? Obviously it is the egg. Laid by a bird so very close to a chicken that only molecular genetics can tell it apart.\n \n The common misconception when people talk about transitional fossils is that they are often looking for an organism 'transitioning' into another organism.\n \n This is why many scientist assume that people who consider ToE to be bunk are young earth creationist. With billions of years organism adapt to environmental changes and when they are physically isolated so that they can no longer breed they become genetically isolated.\n \n They don't, as an individual 'become' a new creature; their descendants change very slightly over millions of years.\n \n For the YEC this is obviously a flawed why of thinking because with only 6000 years, or so to adapt this cannot possibly happen.\n \n Going back to gaps. You must have photos of yourself growing up: but you don't have one for every day of your life. In thousands of year a researcher of antiquity my find them and conclude from the evidence of your sporadic photos that you grew up from the toddler to you old age self.\n \n Think of this hypothetical 'you' as a genetic lineage and you will be on the right track. We don't have all the photos/fossils but we have enough to know what's going on.", 
   {}, 
   392297, 
   null, 
   1267403100.0
  ], 
  [
   400994, 
   null, 
   "Freedom", 
   "Assuming rational evolution vs. Creationism.\n \n I take the negative.\n \n \nThere are in fact no transitional fossils known. Some believe there are because they have been told there are. An examination of the fossils proves otherwise.\n\n This is a matter of degree, under evolutionary theory there will be millions of intermediate \"transitional\" forms during the process.\n \n In a certain scale the existence of apes is a transitional fossil between ancient mammals and man, if the argument is that it is still to large a gap by narrowing the scale one can point out that the scale will always be able to be more narrow.\n \n At what point is there a complete transitional sequence? When we have a fossil of every individual who carried a selected mutation?\n \nWhat there are however, is thousands of animals in fossils which exist exactly today as they did hundreds of millions of years ago (according to evolutionist interpretation of the fossil record) without noticable change. \n \n Evolution is said to occur by mutation and mutation occurs to all life forms, by the sun's radiation and DNA recombining error by if no other means! If evolution occurs to all life forms, there could be no life forms today which have not evolved, because all life would be in transition.\n\n \n Evolution states that beneficial mutations will be preserved while detrimental mutations would be deleted.\n \n It fully accounts for constancy within species provided there are no possible improvements to be made.\n \n \n Mutation does not stop once an animal becomes well suited for their envioronment. It continues to occur to all life. Living fossils are proof that evolution has not occurred. Natural selection would have eliminated those which did not evolve.\n\n Mutation does not stop once an animal becomes well suited for the environment, but if selection pressures don't push the creature away from it's form it will not change.\n \n The existence of apparently static fossils is evidence that their form was comparatively the best suited for any environments it might have been in.\n \n In other words you usually cannot see neutral mutations in the fossil record.\n \n \nNot even Tikaalik is transition, as it is not unlike lobe-finned fish that exist today. Furthermore, Tikaalik does not have shoulder bones or muscles and could therefore not support it's own weight, which is said to be @ 900 lbs. Have you ever seen a deep sea tuna or a dolphin waddling across land? Small fish can do it. But not such a large one. Small whales are beached constantly trying to get onto land because their weight is too great to allow them locomotion on land without shoulder bones and muscle stuctures. Tikaalik has neither, and was too heavy to support it's weight without shoulder bones or muscles and could not therefore crawl onto land and back into the sea - not without shoulder bones and muscles.\n\n What you got there is an IC system.\n \nAll attempts to find a mechanism for evolution in microbiology are futile. We already know the outcome - chicken & egg paradox, DNA's complexity is impossible to be created by nature, no new information in the DNA to new define features or morphologies, zero transitional forms in the fossil record when they should dominate it, many thousands of living fossils, the irreducible complexity of biological machinery, intelligence cannot arise from molecules - it is a trait that is passed along from a parent organism - a molecule has no intelligence, human abilities such as creativity, philosophy, emotion, inventiveness - none of which can be had from molecules or amino acids, etc.\n\n That in essence may be true; however you haven't said anything about creationism?", 
   {}, 
   329042, 
   null, 
   1273466520.0
  ], 
  [
   401053, 
   null, 
   "Larni", 
   "This is a matter of degree, under evolutionary theory there will be millions of intermediate \"transitional\" forms during the process.\n\n \n Correct.\n \n Every fossil and indeed, every organism you could ever find is a transitional fossil/organism: between it and the next generation.\n \n There are no dogs transitioning into ducks.", 
   {}, 
   400994, 
   null, 
   1273522380.0
  ], 
  [
   423296, 
   null, 
   "signelect", 
   "If you want to believe that all of this world just happened, go for it. I chose to believe that God did it but I am not going to try and talk you into it. As far as the 7 days go the bible never said it was 7 24 hours (as we understand it) days. It was most likely millions of years, what difference does it make.\n \n If you happy then I am happy. If I am right they you won't be getting any of my share.\n \n Good luck", 
   {}, 
   329666, 
   null, 
   1296079200.0
  ], 
  [
   423299, 
   null, 
   "Larni", 
   "The important thing is that you are happy.\n \n I could not be happy with something that does not make sense, either.", 
   {}, 
   423296, 
   null, 
   1296082140.0
  ], 
  [
   423534, 
   null, 
   "signelect", 
   "I understand, I just re-read my post and it appears that I can't spell. But the point you make is that we evolved and we not created. If that is the case why are there still monkeys if that in fact is where we came from. I don't mind your not agreeing but it appears that it bothers you that I believe in something more than just chance.", 
   {}, 
   423299, 
   null, 
   1296499620.0
  ], 
  [
   423541, 
   null, 
   "Xcaliber", 
   "If you want to believe that all of this world just happened, go for it. I chose to believe that God did it but I am not going to try and talk you into it. As far as the 7 days go the bible never said it was 7 24 hours (as we understand it) days. It was most likely millions of years, what difference does it make.\n\n \n The word for \"day\" in Genesis one is the Hebrew word yom. It can mean either a day (in the ordinary 24-our sense), the daylight portion (say about 12 hours) of an ordinary 24-hour day (i.e., day as distinct from night), or, occasionally, an indefinite period of time (e.g.. \"In the time of the Judges\" or \"In the day of the Lord\"). Without exception, in the Hebrew Old Testament the word yom is never used to refer to a definite long period of time with specific beginning and end points. Furthermore, it is important to note that even when the word yom is used in the indefinite sense, it is clearly indicated by the context that the literal meaning of the word day is not intended. \n \n A day in Biblical times was the Same 24 hour DAY of today. This is also indicated by the Sun and the Moon, which we now know cycles through a 24 hour period bringing both light and darkness. \n \n And Evolution doesn't specifically mean we came from a Monkey. our Ancestors , or at least the ones we have found, carried similar traits to what we now know as Humans, and evolution takes place over billions of years so you wouldn't exactly see a monkey evolve into a human in your lifetime.", 
   {}, 
   423296, 
   null, 
   1296502560.0
  ], 
  [
   423548, 
   null, 
   "Larni", 
   "I understand, I just re-read my post and it appears that I can't spell. But the point you make is that we evolved and we not created. If that is the case why are there still monkeys if that in fact is where we came from. I don't mind your not agreeing but it appears that it bothers you that I believe in something more than just chance.\n\n \n What on Earth makes you think that humans evolved from monkeys?\n \n I thought only people who were around in the late 19 century thought that. Unless your from the US Bible Belt in which your complete ignorance of science (post 19 century) or Amish.\n \n So what is it. religious or dumb?", 
   {}, 
   423534, 
   null, 
   1296510780.0
  ], 
  [
   423558, 
   null, 
   "Accipiter", 
   "What on Earth makes you think that humans evolved from monkeys?\n\n \n My guess is lack of a proper education.", 
   {}, 
   423548, 
   null, 
   1296522960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evolution vs. Creationism", 
  "url": "http://www.4forums.com/political/formal-open-debate/11810-evolution-vs-creationism.html", 
  "breadcrumbs": [
   "Formal Open Debate"
  ], 
  "id_number": 11810, 
  "discussion_files": [
   [
    "10820.html", 
    "http://www.4forums.com/political/formal-open-debate/11810-evolution-vs-creationism-print.html"
   ], 
   [
    "10821.html", 
    "http://www.4forums.com/political/formal-open-debate/11810-evolution-vs-creationism-3-print.html"
   ], 
   [
    "10822.html", 
    "http://www.4forums.com/political/formal-open-debate/11810-evolution-vs-creationism-2-print.html"
   ]
  ], 
  "identifier": 11810
 }
]