[
 [
  [
   329649, 
   null, 
   "isly ilwott", 
   "Was Obama born in Kenya?\n \n http://citizenwells.wordpress.com/2008/06/10/obama-natural-born-citizen-obamas-birth-certificate-obama-born-in-kenya-is-obama-eligible-to-be-president/", 
   {
    "post_info": {
     "post_title": "Is Obama a United States Citizen?"
    }
   }, 
   null, 
   null, 
   1224881220.0
  ], 
  [
   329652, 
   null, 
   "mummer02", 
   "Give it up, Isly.\n \n First off, his birth certificate has been posted for months now. Go to Factcheck.org. Second, dont you think that Hillary in the primaries tried everything in her might to find out if he was born in Kenya? Its just simply not true. And, guess what, even if he was, .....nobody but you neocons would give a damn. \n \n Give it up. You conservatives are jumping ship like a bunch of rats. Not only will Obama be your next president (thank God), but he will win by a major landslide. America is tired of the awful Rovian tactics from the last 2 elections. McShame and Caribou Barbie have run the worst and dirtiest campaign in US history and will be sent packing in a few short weeks. We will not be swiftboated this time. Count on it!!!", 
   {
    "post_info": {
     "post_title": "Obama a Citizen"
    }
   }, 
   329649, 
   null, 
   1224885060.0
  ], 
  [
   329669, 
   null, 
   "Archangel", 
   "Was Obama born in Kenya?\n \n Obama natural born citizen?, Obama&#8217;s birth certificate, Obama born in Kenya, Is Obama eligible to be president? Citizen Wells\n\n \n This story is being taken more seriously now and is getting legs, as they say. The inference is that his birth certificate is a forgery. Hopefully, the Government is verifying the true place of his birth as we speak.", 
   {}, 
   329649, 
   null, 
   1224888480.0
  ], 
  [
   329670, 
   null, 
   "Baron", 
   "Give it up, Isly.\n \n First off, his birth certificate has been posted for months now. Go to Factcheck.org. Second, dont you think that Hillary in the primaries tried everything in her might to find out if he was born in Kenya? Its just simply not true. And, guess what, even if he was, .....nobody but you neocons would give a damn. \n \n Give it up. You conservatives are jumping ship like a bunch of rats. Not only will Obama be your next president (thank God), but he will win by a major landslide. America is tired of the awful Rovian tactics from the last 2 elections. McShame and Caribou Barbie have run the worst and dirtiest campaign in US history and will be sent packing in a few short weeks. We will not be swiftboated this time. Count on it!!!\n\n \n A Philadelphia Mummer salivating about the possibility of a Kenyan becoming President of The United Socialist States of America. Why don't we all wait until the fat lady sings.\n \n BTW, the only rats I see are all those who are following Barry the Pied Piper.", 
   {
    "post_info": {
     "post_title": "What have we got here?"
    }
   }, 
   329652, 
   null, 
   1224888480.0
  ], 
  [
   329676, 
   null, 
   "foundit66", 
   "This thread is a perfect example of how grotesquely desperate Republicans are getting.\n \n One thing I get REALLY bored of is how people will try to phrase an argument as a question.\n That is mainly how the Obama / Muslim thing started...\n People tried to raise it as a \"question\", to pretend the issue had validity...\n It's like asking \"Is John McCain the father of a black baby?\"\n Instead of a news reporter proving the claim, he just repeats a rumor that is circulating, which can have precious little substantiation of the claim.\n \n You'd think that any Christian organization would have a problem with rumor-mongering and the \"Thou shalt not bear false witness\" commandment, but evidently the religious right in the Republican party don't care enough to complain. I guess if it helps to keep Obama out of office, breaking God's word is irrelevant...\n \n \n \nThis story is being taken more seriously now and is getting legs, as they say. The inference is that his birth certificate is a forgery. Hopefully, the Government is verifying the true place of his birth as we speak.\n\n Just cause World Nut Daily says something doesn't mean that any \"legitimate\" scandal is in play...\n What's really going on is that the panicking conservative base is gripping onto any crazy rumor which could help them steal a win. It's the same insanity that gripped some liberals into the claims of \"republicans stole the election\".", 
   {}, 
   329652, 
   null, 
   1224894420.0
  ], 
  [
   329680, 
   null, 
   "Archangel", 
   "Isly's link wasn't to that organization at all foundit, look at it again. But if you liked that one, you'll love this one. Lo and behold, Obama's a member of your club. emoticon_xlove Larry Sinclair press conference, National Press Club, confirmed, Obama allegations, Obama cocaine use, gay sex, NPC Wednesday, June 18, 2008 Citizen Wells", 
   {}, 
   329676, 
   null, 
   1224896640.0
  ], 
  [
   329684, 
   null, 
   "Penfold", 
   "It would be laughable were it not so piteously forlorn.", 
   {}, 
   329680, 
   null, 
   1224897960.0
  ], 
  [
   329701, 
   null, 
   "foundit66", 
   "Isly's link wasn't to that organization at all foundit, look at it again.\n\n I wasn't speaking specifically, but generically.\n I googled news sources that were \"commenting\" on this garbage, and guess which one came to the forefront?\n Oh yeah! You can count on WND to post trash!\n \n \n \nBut if you liked that one, you'll love this one. Lo and behold, Obama's a member of your club. emoticon_xlove Larry Sinclair press conference, National Press Club, confirmed, Obama allegations, Obama cocaine use, gay sex, NPC Wednesday, June 18, 2008 Citizen Wells\n\n OMG you guys are desperate.\n That has LONG since been debunked!", 
   {}, 
   329680, 
   null, 
   1224903840.0
  ], 
  [
   329740, 
   null, 
   "antonia", 
   "Pathetic suggestion. A lot to do with why your side is losing by a landslide.", 
   {}, 
   329701, 
   null, 
   1224961080.0
  ], 
  [
   329745, 
   null, 
   "Archangel", 
   "Pathetic suggestion. A lot to do with why your side is losing by a landslide.\n\n \n Only in the minds of the looney left is victory declared before the election even takes place. emoticon_xgood", 
   {}, 
   329740, 
   null, 
   1224964260.0
  ], 
  [
   329753, 
   null, 
   "T.Q", 
   "Only in the minds of the looney left is victory declared before the election even takes place. emoticon_xgood\n\n \n Which is why Fox News was declaring \"only x number of days/months until President Bush is re-elected\" during the last election...", 
   {}, 
   329745, 
   null, 
   1224966600.0
  ], 
  [
   329777, 
   null, 
   "antonia", 
   "I think the radical evangelical's eye is shut with thumb raised because he keeps sticking himself there.", 
   {}, 
   329753, 
   null, 
   1224977100.0
  ], 
  [
   329780, 
   null, 
   "Ethmi", 
   "\n OMG you guys are desperate.\n That has LONG since been debunked!\n\n \n I'd really expect this \"YOU'RE WRONG!!! YOU'RE WRONG!!!!!\" screaming from Penfold. You disappoint me.", 
   {}, 
   329701, 
   null, 
   1224978240.0
  ], 
  [
   329817, 
   null, 
   "Penfold", 
   "Your ignorance of the facts is nobody's fault but your own. ;)\n \n It's what happens when you believe things on faith alone.", 
   {}, 
   329780, 
   null, 
   1225003980.0
  ], 
  [
   329824, 
   null, 
   "Archangel", 
   "Which is why Fox News was declaring \"only x number of days/months until President Bush is re-elected\" during the last election...\n\n \n I'd love to see evidence of this assertion. And I say that for 2 reasons, 1) FOX NEWS didn't go on the air in Canada until December 16, 2004, more than a month after the 04 election. So I don't know how you can claim to know anything about what FOX was declaring prior to that election. And #2, it just isn't true because I watch FOX and would have seen it if it happened. But feel free to prove it if you can.\n \n \nOn November 18, 2004 the CRTC announced that a digital license would be granted to Fox News.[38] In its proposal, Fox News stated, with reference to Fox News Canada, that \"Fox News does not intend to implement this service and therefore will not meet the extended deadline to commence operations.\"[39] On December 16, 2004, Rogers Communications became the first Canadian cable or satellite provider to broadcast Fox News, with other companies following suit within the next several weeks.\n \n Fox News Channel - Wikipedia, the free encyclopedia", 
   {}, 
   329753, 
   null, 
   1225018500.0
  ], 
  [
   329832, 
   null, 
   "chester", 
   "Was Obama born in Kenya?\n \n Obama natural born citizen?, Obama&#8217;s birth certificate, Obama born in Kenya, Is Obama eligible to be president? Citizen Wells\n\n \n The only candidate in this Presidential race who was born outside the USA is John McCain.\n \n He was born in the Panama Canal Zone, which was land we were renting from Panama at the time under the terms of the Hay-Bunau-Varilla Treaty.\n \n He was so unsure of his status, tht he asked the Congress to affirm that he met the Article II requirement that the POTUS be a \"natural born citizen\" of the USA.\n \n BTW, Congress did so willingly.", 
   {}, 
   329649, 
   null, 
   1225033800.0
  ], 
  [
   329833, 
   null, 
   "chester", 
   "Alaska's largest circulation newspaper endorses Obama:\n \n Obama for president: ADN Editorial | adn.com\n \n John & Sarah, don't let the door hit you in the [donkey] as you exit stage (FAR) right!!!", 
   {}, 
   329832, 
   null, 
   1225034580.0
  ], 
  [
   329863, 
   null, 
   "Archangel", 
   "The only candidate in this Presidential race who was born outside the USA is John McCain.\n \n He was born in the Panama Canal Zone, which was land we were renting from Panama at the time under the terms of the Hay-Bunau-Varilla Treaty.\n \n He was so unsure of his status, tht he asked the Congress to affirm that he met the Article II requirement that the POTUS be a \"natural born citizen\" of the USA.\n \n BTW, Congress did so willingly.\n\n \n Correction: He was born on a US Military Base which is US Territory no matter where it is located on Earth. Another example of that truth is US Embassy's. Only you would attempt to first lie about him not being a naturally born citizen, and then attempt to disqualify a man because he was born while his father was serving our Country and was deployed at the time. emoticon_confusedemoticon_xgood", 
   {}, 
   329832, 
   null, 
   1225055040.0
  ], 
  [
   329864, 
   null, 
   "isly ilwott", 
   "Alaska's largest circulation newspaper endorses Obama:\n \n Obama for president: ADN Editorial | adn.com\n \n John & Sarah, don't let the door hit you in the [donkey] as you exit stage (FAR) right!!!\n\n Many fools endorse Obama. That some are publishers is quite understandable...not convincing, but understandable.\n \n Nobody here has produced a link to any evidence that Barack Hussien Obama is really a citizen born in the United States (or to a pair of US citizens elsewhere, like was John Sidney McCain, III). Anyone who wants to overlook the fact that he might not be eligible to run for President thinks little of our Constitution. Upholding our Constitution is what it's all about. Naturally, the liberals don't think so...they call it a living document, to be re-interpretted as necessary to promote their drive toward socialism.", 
   {}, 
   329833, 
   null, 
   1225055100.0
  ], 
  [
   329901, 
   null, 
   "obvious_child", 
   "Barack Obama's birth certificate revealed here | Top of the Ticket | Los Angeles Times\n \n PolitiFact | Obama's birth certificate: Final chapter\n \n snopes.com: Barack Obama Birth Certificate\n \n Factcheck.org: Born in the U.S.A. | Newsweek Politics: Campaign 2008 | Newsweek.com\n \n Seriously. You would rather discuss that then the coming financial insolvency that both will bring.", 
   {}, 
   329864, 
   null, 
   1225072080.0
  ], 
  [
   329902, 
   null, 
   "Ethmi", 
   "Your ignorance of the facts is nobody's fault but your own. ;)\n \n It's what happens when you believe things on faith alone.\n\n \n Bull. You've always been one to conclude preposterous things, then scream that they're self-evident without supporting them.", 
   {}, 
   329817, 
   null, 
   1225072140.0
  ], 
  [
   329921, 
   null, 
   "Penfold", 
   "Bull. You've always been one to conclude preposterous things, then scream that they're self-evident without supporting them.\n\n \n I call your offensive attack. Please show that my every conclusion has been preposterous, that I have ever \"screamed\" anything, and that I have not supported any conclusion which was not self-evident.\n \n When your preposterous allegation falls as it must, I will not hold my breath for the due apology.", 
   {}, 
   329902, 
   null, 
   1225079640.0
  ], 
  [
   329953, 
   null, 
   "antonia", 
   "Listen to the radical evangelical, Archangel, defend the candidate he claimed he couldn't stand during the primaries. The candidate he asserted had no character.", 
   {}, 
   329921, 
   null, 
   1225095420.0
  ], 
  [
   329954, 
   null, 
   "antonia", 
   "Here's an interesting February 08 NYT article on McCain's Canal Zone birth, among some other historic questionables,\n \n McCain's Canal Zone Birth Prompts Queries About Whether That Rules Him Out\n \n [excerpt]\n \n \"There are powerful arguments that Senator McCain or anyone else in this position is constitutionally qualified, but there is certainly no precedent,\" said Sarah H. Duggin, an associate professor of law at Catholic University who has studied the issue extensively. \"It is not a slam-dunk situation.\"\n \n Mr. McCain was born on a military installation in the Canal Zone, where his mother and father, a Navy officer, were stationed. His campaign advisers say they are comfortable that Mr. McCain meets the requirement and note that the question was researched for his first presidential bid in 1999 and reviewed again this time around.\n \n But given mounting interest, the campaign recently asked Theodore B. Olson, a former solicitor general now advising Mr. McCain, to prepare a detailed legal analysis. \"I don't have much doubt about it,\" said Mr. Olson, who added, though, that he still needed to finish his research.\n \n [photo caption]\n \n From left, LOWELL P. WEICKER JR., of Connecticut, born in Paris, was told he was eligible for the Oval Office. GEORGE ROMNEY, born in Mexico, ran for the presidency in 1968. BARRY GOLDWATER was born in the Arizona territory in 1909, before it became a state. CHESTER A. ARTHUR was born in Vermont, but rumors suggested it was Canada.\n \n http://www.nytimes.com/2008/02/28/us/politics/28mccain.html", 
   {
    "unicode_changes_made": true
   }, 
   329953, 
   null, 
   1225096020.0
  ], 
  [
   329959, 
   null, 
   "obvious_child", 
   "Anyone who seriously gives attention to the whole birth certificate/panama canal birth is pathetic.\n \n We are facing debt servicing of over $400 billion and you XXXXXX are talking about birth certificates and panama canal zones?\n \n We are facing huge (read: trillions) underfunded liabilities in both the private and public sector and you're are talking about alleged birth reasons why either can't be president?", 
   {}, 
   329954, 
   null, 
   1225098360.0
  ], 
  [
   329960, 
   null, 
   "antonia", 
   "Why don't you start a thread if you value other issues more highly? \n \n I agree that what you mention is much more important, given that no issues exist -- but you are mistaken if you think the birth place of a candidate for president isn't important, even during an economic crisis. \n \n For there have been, actually, legitimate legal questions re McCain's eligibility. At least as late as February. You can read about in the Times article, or many, many other major newspapers, if you google. \n \n There are no legitimate issues, however, for Obama. There never have been. He was born in the United States. The only reason people write stories about a Kenyan birth, at this point in the game, is because they're dishonest or racist.\n \n And, if they believe these stories, pathetic.\n \n So you see, all things are not equal.", 
   {}, 
   329959, 
   null, 
   1225099860.0
  ], 
  [
   329961, 
   null, 
   "antonia", 
   "Spoken by \"The Sword of Truth\" --\n \n \nI'm far from a McCain supporter antonia. I can't stand the jerk and consider him just barely better than a flaming liberal like Obama and Clinton. But I refuse to vote for him because I wont contribute to his election at all.\n\n \n http://www.4forums.com/political/elections-debates/11013-clinton-ad-fearmongering.html#post304071", 
   {}, 
   329960, 
   null, 
   1225100220.0
  ], 
  [
   329968, 
   null, 
   "Archangel", 
   "Spoken by \"The Sword of Truth\" --\n \n http://www.4forums.com/political/elections-debates/11013-clinton-ad-fearmongering.html#post304071\n\n \n Nice find antonia, and I feel the same way today as I did back in March, 7 months ago. And only when Sarah Palin was chosen as his running mate did I start to take any interest in his candidacy. Also, surely it isn't beyond you to comprehend that my vote for McCain is cast more as a vote against what Obama represents. I realize this is an election between the lesser of 2 evils, and on that count, McCain wins hands down.", 
   {}, 
   329961, 
   null, 
   1225114620.0
  ], 
  [
   329972, 
   null, 
   "T.Q", 
   "I'd love to see evidence of this assertion. And I say that for 2 reasons, 1) FOX NEWS didn't go on the air in Canada until December 16, 2004, more than a month after the 04 election. So I don't know how you can claim to know anything about what FOX was declaring prior to that election. And #2, it just isn't true because I watch FOX and would have seen it if it happened. But feel free to prove it if you can.\n \n \n Fox News Channel - Wikipedia, the free encyclopedia\n\n \n Wow, if you're going to accuse me of lying, make sure you're right. Watch the documentary \"Outfoxed\". And here's a blog post referencing exactly what I am talking about<b></b>:\n Blog referencing \"Outfoxed\"\n \noutfoxed! \n \n It just amazes me how a network can honestly call themselves \"fair and balanced\" and say things like \"it's 204 days until president bush is reelected\" and \"shut up\" to anyone who has an opposing (anti-republican) viewpoint. True, no media source is unbiased, but even the super liberal Daily Show invites on republicans on the show and has real discussions with them. Boo fox news.\n\n \n You can even read the book on Google Books. I'll accept your apology now.", 
   {}, 
   329824, 
   null, 
   1225118040.0
  ], 
  [
   329973, 
   null, 
   "T.Q", 
   "And only when Sarah Palin was chosen as his running mate did I start to take any interest in his candidacy.\n\n \n Not surprising in the least.", 
   {}, 
   329968, 
   null, 
   1225118100.0
  ], 
  [
   329975, 
   null, 
   "Archangel", 
   "Wow, if you're going to accuse me of lying, make sure you're right. Watch the documentary \"Outfoxed\". And here's a blog post referencing exactly what I am talking about<b></b>:\n Blog referencing \"Outfoxed\"\n \n \n You can even read the book on Google Books. I'll accept your apology now.\n\n \n You put forth a personal opinion of a blogger and offer that as evidence of anything? How about a clip or something of them actually declaring victory rather than just putting a positive spin on a story?", 
   {}, 
   329972, 
   null, 
   1225119900.0
  ], 
  [
   329978, 
   null, 
   "T.Q", 
   "Speaking of an idiot. You put forth a personal opinion of a blogger and offer that as evidence of anything? How about a clip or something of them actually declaring victory rather than just putting a positive spin on a story?\n\n \n You apparently missed the other link on there to Google Books. Since reading isn't something you're proficient in, Here's a link to the documentary.\n \n \"A positive spin on a story\"? You stated that only the \"loony left\" would declare victory before the election is over. I gave you a blog of a guy who watched a movie showing clips of Sean Hannity declaring victory almost a year before the last election, and gave you a link to the book the documentary was based on, documenting this same behaviour and providing numerous examples of it. Instead of apologising for calling me a liar, you continue to insinuate that I'm lying.\n \n What a douche.", 
   {}, 
   329975, 
   null, 
   1225121880.0
  ], 
  [
   329993, 
   null, 
   "antonia", 
   "I am not the press, Archangel, so I can predict victory as freely as I please. And express my delight, as a citizen, over it! Too bad for you -- IOW -- tough. For the polls are indeed going with Obama/Biden. And I'm going to keep exercising my first amendment right to state my opinion on that phenomenon. Bunko.\n \n On the other hand, that is quite a sorry (though unsurprising) story about FOX, a news station that is supposed to hold to to certain journalistic standards, and keep bias and coverage seperate. But regularly and extremely departs from any such professional standards. \n \n Not surprising, either, that's where you regularly feed your brain cells \"news\" information.\n \n More on your contempt for McCain, the \"bum\" you are voting for,\n \n \nOriginally Posted by antonia \n Listen to you, Archangel, arguing on behalf of a candidate you yourself described as spilling his guts like a traitor to a foreign communist government. You didn't hold it against the guy for breaking. But that the files were still there in the hands of the Vietcong -- to blackmail the President of the United States. He therefore couldn't be president. It was a national security risk against the national interest. Not to mention that you said you didn't even like him. He revolted you and made you sick.\n \n My first choice is Hillary, but I like both the Democrat candidates. \n \n So much for who goes on substance. So much for who cares about our demise as a superpower.\n \n As for the Republicans, you will set sail in a wind of arrogant confidence, but sink like the Titanic that said it never would, come November:\n \n YouTube - Sinking of the TITANIC in Ship Simulator 2008\n\n \n \nPoint out where I have argued on behalf of Mcain! I can't stand the bum. But that doesn't mean I have to embrace these flaming liberals who will sell us to our enemies like so much chattel. So good luck with your shallow World view that assumes that this is just another election that your savior candidates can actually save, if you just believe in them enough; and that nothing really bad will ever destroy this Country. \n \n I feel sorry for the rude awakening that you're in for antonia. And sadly, knowing what's coming wont protect me or mine from suffering the same fate. Like I said, we rise and fall together as a Nation. So as a good compassionate christian, I guess the only thing I can do is wish everything you hope for comes to you. And may God have mercy on your soul when it finally does.\n\n \n http://www.4forums.com/political/elections-debates/11067-wow-what-hate-obamas-preacher-anti-white-american-12.html#post308133\n \n Pointed out here, Archangel. While that ship we spoke of earlier? Going down, now, rapidly. Your desperation quite evident.\n \n \n http://www.monacaron.com/images/large/titanic-sinking.jpg\n \n \n I like my candidates. I'm PROUD to vote Barack Obama and Joe Biden. I have peace within -- and a clear conscience -- about my ballot.\n \n I feel sorry for you voting for someone you hate so much. A bum and a traitor who you see as a national security risk in office.\n \n Looks like you are willing to say just about anything to get the unqualified, radical evangelical Sarah Palin one heartbeat away from the presidency of the United States. Defend an honorless man as having honor, sell out the national security of your country, and promote blatantly false and racist stories about Obama's citizenship. \n \n If anyone is \"looney\", it is you. You must hoping for a miracle, as you pull the lever against all reason.", 
   {
    "post_info": {
     "post_title": "Thou shalt not bear false witness"
    }
   }, 
   329978, 
   null, 
   1225131660.0
  ], 
  [
   330068, 
   null, 
   "obvious_child", 
   "Why don't you start a thread if you value other issues more highly?\n\n \n I did.\n \n http://www.4forums.com/political/elections-debates/11844-more-important.html \n \n \nI agree that what you mention is much more important, given that no issues exist -- but you are mistaken if you think the birth place of a candidate for president isn't important, even during an economic crisis.\n\n \n Really? Obama's birth certificate is acceptable and the panama canal zone is accepted as US soil. Get over it.", 
   {}, 
   329960, 
   null, 
   1225167180.0
  ], 
  [
   330071, 
   null, 
   "antonia", 
   "Really? Obama's birth certificate is acceptable and the panama canal zone is accepted as US soil. Get over it.\n\n \n Get over what? I think you need to simply *get it* -- the point the other person is making. It's not \"accepted\". Try reading the whole article, as suggested before. \n \n Otherwise, this conversation with you and your pejoratives is finished.\n \n I saw your thread and it's uninteresting. Maybe you should consider some more thought-provoking starters than a dumb poll, or calling people <XXXXXX<.", 
   {}, 
   330068, 
   null, 
   1225167780.0
  ], 
  [
   330072, 
   null, 
   "obvious_child", 
   "....\n \n FactCheck.org: How can Panamanian-born McCain be elected president?\n \n McCain qualifies by law.", 
   {}, 
   330071, 
   null, 
   1225168500.0
  ], 
  [
   330077, 
   null, 
   "antonia", 
   "This is what I said -- word for word:\n \n \nI agree that what you mention is much more important, given that no issues exist -- but you are mistaken if you think the birth place of a candidate for president isn't important, even during an economic crisis. \n \n For there have been, actually, legitimate legal questions re McCain's eligibility. At least as late as February. You can read about in the Times article, or many, many other major newspapers, if you google. \n \n There are no legitimate issues, however, for Obama. There never have been. He was born in the United States. The only reason people write stories about a Kenyan birth, at this point in the game, is because they're dishonest or racist.\n\n \n So there is nothing I need to \"get over\". You need to get over it (as well as *get it*). Get over your need to make all things equal. And be right when you're not.\n \n I don't give a damn about your blind authority reference. Here is (again) my reference to the article, http://www.4forums.com/political/elections-debates/11837-obama-united-states-citizen-2.html#post329954, along with Theodore Olson, Sarah Duggin, and if you link in, to other than \"blind authority\", attorney Jill Pryor; i.e. \"[...] it is certainly not a frivolous issue.\"", 
   {}, 
   329973, 
   null, 
   1225169400.0
  ], 
  [
   330079, 
   null, 
   "obvious_child", 
   "And what have they said that makes the Congressional act of 1790 and 1795 invalid?\n \n Furthermore, what under 301(c) of the Immigration and Nationality Act is invalid?\n \n It appears absolutely nothing.", 
   {}, 
   330077, 
   null, 
   1225169760.0
  ], 
  [
   330094, 
   null, 
   "antonia", 
   "And what have they said that makes the Congressional act of 1790 and 1795 invalid?\n \n Furthermore, what under 301(c) of the Immigration and Nationality Act is invalid?\n \n It appears absolutely nothing.\n\n \n You're arguing the legal points. I'm not. I'm simply pointing out that there have been legitimate concerns and questions. (Unlike the *concerns* re Obama.)\n \n My *guess* is that, as stated in the article by a McCain supporter, if it got as far as a court -- it would be thrown out. And that, likely, that would be correct.\n \n You have got to stop confusing reference to issues of law -- as a statement of opinion.\n \n Or, simply making strawmen with others because you can't stand being wrong. So you pretend they are saying something they aren't (giving your intelligence the benefit of the doubt -- moreso than your character).\n \n All things are not equal.\n \n There have been real legal questions around McCain's eligibility -- even his people say so. There are none with Obama.", 
   {}, 
   330079, 
   null, 
   1225173780.0
  ], 
  [
   330099, 
   null, 
   "antonia", 
   "What you should do, oc, is argue the points with someone who is voting for McCain, but hates his guts and hopes -- if he's elected -- he drops in his tracks so that America can be reigned over by a unqualified radical evangelist.\n \n They could likely find good reasons for McCain being thrown out of office on the basis of where he was born.\n \n But you'd have to wait until after McCain were elected -- so that the biblical one could take her rightful place.\n \n And McCain being elected -- well, looks like that ain't gonna happen.", 
   {}, 
   330094, 
   null, 
   1225174740.0
  ], 
  [
   330100, 
   null, 
   "Bassman", 
   "What you should do, oc, is argue the points with someone who is voting for McCain, but hates his guts and hopes -- if he's elected -- he drops in his tracks so that America can be reigned over by a unqualified radical evangelist.\n \n They could likely find good reasons for McCain being thrown out of office on the basis of where he was born.\n \n But you'd have to wait until after McCain were elected -- so that biblical one could take her rightful place.\n \n And McCain being elected -- well, looks like that ain't gonna happen.\nAntonia, are there any conservatives you DO like???", 
   {}, 
   330099, 
   null, 
   1225174920.0
  ], 
  [
   330103, 
   null, 
   "trebor", 
   "Antonia, are there any conservatives you DO like???\n\n \n I thought William F Buckley Sr was a gentleman and a scholar.\n \n The vast majority of conservatives I have seen are #####s, jerks and out of touch from reality.", 
   {}, 
   330100, 
   null, 
   1225175760.0
  ], 
  [
   330107, 
   null, 
   "antonia", 
   "Antonia, are there any conservatives you DO like???\n\n \n Yes, there most certainly are. Colin Powell is one who comes to mind in more recent events.\n \n Are there any liberals you like, Bassman?", 
   {}, 
   330100, 
   null, 
   1225181580.0
  ], 
  [
   330112, 
   null, 
   "obvious_child", 
   "\n There have been real legal questions around McCain's eligibility -- even his people say so. There are none with Obama.\n\n \n MAYBE. The only thing is whether or not the laws regarding the declaration of foreign born children to American citizens in specific places are Constitutional. That's about it.", 
   {}, 
   330094, 
   null, 
   1225189500.0
  ], 
  [
   330199, 
   null, 
   "antonia", 
   "MAYBE. The only thing is whether or not the laws regarding the declaration of foreign born children to American citizens in specific places are Constitutional. That's about it.\n\n \n That's not what Theodore Olson said.", 
   {}, 
   330112, 
   null, 
   1225245060.0
  ], 
  [
   330212, 
   null, 
   "obvious_child", 
   "That's not what Theodore Olson said.\n\n \n But that is the crux of the argument. Several laws passed years ago all state that specific types of people born to American parents in specific places are natural born citizens. The question is whether or not those laws are Constitutional. Every candidate who fell under those clauses who ran didn't win, thus we don't have closure on the issue. If they are not Constitutional, then we have a problem, but that first needs to be proven. There has yet to see a real argument as to why those laws violate the Constitution. Until then, McCain is perfectly qualified under those laws.", 
   {}, 
   330199, 
   null, 
   1225253880.0
  ], 
  [
   330234, 
   null, 
   "baconsbud", 
   "I'm not up-to-date on the laws dealing this topic but do know that while I was stationed in Germany in the early 90's, any child born to military personnel had to have paperwork filled out or they would be considered German citizens. I doubt that at the time of birth the rules were much different in Mccains birth. Has anyone else noticed it isn't the democrats that are trying to confuse the voters with lies. The only people I see trying to push the lies are those that are afraid of any change.", 
   {}, 
   330212, 
   null, 
   1225284000.0
  ], 
  [
   330247, 
   null, 
   "Archangel", 
   " Has anyone else noticed it isn't the democrats that are trying to confuse the voters with lies. The only people I see trying to push the lies are those that are afraid of any change.\n\n \n Really? Then you have proven you have a serious case of tunnel vision. Has it missed your notice how the dems have turned on Joe the Plumber since he labeled Obama a socialist, and they/the mainstream media have investigated a private citizen, attempting to destroy his credibility and character just because he doesn't agree with them? And on the reverse, have you seen even ONE Republican pundit or conservative attempt to attack, excoriate, insult or defame Colin Powell for endorsing Obama? \n \n The SOP for the left is to destroy anyone who dares to speak out publicly against their guy as they accuse those who criticize Obama as attempting to confuse the voters with lies, just as you have done here. At least you have shown in short order that you're a typical liberal with only the standard talking points to offer, and nothing new or unique to add to the mix. emoticon_rolleyes", 
   {}, 
   330234, 
   null, 
   1225300500.0
  ], 
  [
   330251, 
   null, 
   "chester", 
   "Really? Then you have proven you have a serious case of tunnel vision. Has it missed your notice how the dems have turned on Joe the Plumber since he labeled Obama a socialist, and they/the mainstream media have investigated a private citizen, attempting to destroy his credibility and character just because he doesn't agree with them? And on the reverse, have you seen even ONE Republican pundit or conservative attempt to attack, excoriate, insult or defame Colin Powell for endorsing Obama? \n \n The SOP for the left is to destroy anyone who dares to speak out publicly against their guy as they accuse those who criticize Obama as attempting to confuse the voters with lies, just as you have done here. At least you have shown in short order that you're a typical liberal with only the standard talking points to offer, and nothing new or unique to add to the mix. emoticon_rolleyes\n\n \n Maybe that's because Joe the Plumber is both a fraud and a liar.\n \n He's a fraud because he is not licensed to practice his supposed line of work.\n \n He's a liar since Senator Obama is no more a socialist (as though that were a bad thing) than you are an atheist.\n \n Even so, with the economy in the tank, with unemployment and foreclosures rising, with 47 million Americans without health care, the fact that the Repubbies raise the non-issue of Joe the Plumber is an indication of how desperate they are and just how much the kindly old gentleman from Arizona has destroyed whatever tattered remnants of his honor he had left in his vain pursuit of the Presidency.emoticon_mad\n \n BTW, maybe you missed it, but Gush Limpbutt called Gen. Powell's endorsement of Senator Obama racially motivated.\n \n When that didn't work Hannity called it self-serving, saying that Powelll wanted a job - as though he needed one.", 
   {}, 
   330247, 
   null, 
   1225302960.0
  ], 
  [
   330255, 
   null, 
   "Archangel", 
   "Maybe that's because Joe the Plumber is both a fraud and a liar.\n \n He's a fraud because he is not licensed to practice his supposed line of work.\n\n \n Once again cap0, you prove that the truth means absolutely nothing to you in reality as you misrepresent facts and slander all journeyman plumbers in the USA, in your attempt to justify the attacks on Joe. You have a blatent misconception of the plumbing trade in this country. The vast majority of plumbers are not licensed and do not require a license to perform simple work and that includes Houston Texas. Simple plumbing work which does not require work permits are perhaps 60 percent of all plumbing work performed in this country, and the other 40 percent which require local inspections are either performed by a licensed plumber or a licensed plumber's permit is used to pass the inspection of work performed by an unlicensed journeyman. Working on a licensed plumber's permit is the standard and not an exception in this country. Go on cap0, prove me wrong!\n \n \nHe's a liar since Senator Obama is no more a socialist (as though that were a bad thing) than you are an atheist.\n\n \n Obama is a proven and self declared socialist and this has been proven too many times here to even argue anymore. And for once in your life, disprove the information if you can rather than attacking the source. Obama&#8217;s International Socialist Connections\n \n Here's more:Barack Obama's Socialist and Communist Connection in Kenya\n \n \n Barack Obama campaigning with Raila Odinga in Kenya\n \n Photo credit Telegraph.co.uk\n Barack Obama Raila Odinga\n \n \n Barack Obama is well-connected to the top-tier of Kenyan politics - Kenya being the home of his Arab-African Muslim father.\n \n In January 2008, Raila Odinga lost his bid for the Presidency of Kenya to encumbent Mwai Kibaki. Raila Odinga is at the least a socialist in the Orange Democrat party, he says he is Barack Obama's cousin, and the most distinguishing mark the would-be-Kenyan-President made, was his agreement with the National Muslim Leaders Forum (NAMLEF), to turn over a specified portion of Kenya to Shariah Law IF he won the election, which he did not.\n \n Obama the father, admired Odinga the father, and supported Odinga the father's politics - which were decidedly communist.\n \n Obama the son, following in the footsteps of his Dad, Obama the father, campaigned in Kenya, for Raila Odinga in 2006.\n \n The ties between Barack's father, Obama Sr. and Raila Odinga's father, Oginga Odinga, are in written form in the East Africa Journal, direct from the words of Obama the father.\n \n The following is excerpted from Greg Ransom at PrestoPundit, referencing the connections Obama the son chose to leave out of his own writings about his father:\n A bit of research at the library reveals the answers about Barack Obama's father and his father's convictions which Obama withholds from his readers. A first hint comes from authors E. S. Atieno Odhiambo and David William Cohen in their book The Risks of Knowledge (Ohio U. Press, 2004).\n \n On page 182 of their book they describe how Barack Obama's father, a Harvard trained economist, attacked the economic proposals of pro-Western 'third way\" leader Tom Mboya from the socialist left, siding with communist-allied leader Oginga Odinga, in a paper Barack Obama's father wrote for the East Africa Journal. As Odhiambo and Cohen write, \"The debates [over economic policy] pitted .. Mboya against .. Oginga Odinga and radical economists Dharam Ghai and Barrack Obama, who critiqued the document for being neither African nor socialist enough.\"\n The Barack Obama currently running for the Presidency of the United States supported Raila Odinga for the Presidency of his own family's country - Kenya. Yet, Raila Odinga signed documents intended to enslave some citizens of the REPUBLIC of Kenya within Islam, under Shariah Law.\n \n Here's how Islam would have worked in Kenya, given the opportunity:\n \n The following is a partial transcription of the agreement between Odinga and the National Muslim Leaders. (In a previous post, there was a link to this document at Evangelical Alliance of Kenya website, but this link is no longer available. You can see a screen shot of the agreement in this video:\n PURPOSE: To establish a lasting relationship between Hon. Raila Amolo Odinga, hereinafter referred to as The Candidate, and the National Muslim Leaders, herinafter referred to as The Leaders.\n \n This MOU [Memorandum of Understanding] states as follows:\n \n WHEREAS The Candidate -- who recognizes Islam as the only true religion -- is seeking to become the next President of the Republic of Kenya;\n \n WHEREAS The Leaders recognize The Candidate as the only presidential candidate who has the interests of the Kenyan Muslim community at heart;\n There are more \"WHEREAS' and numerous \"The Parties agree..., among which you'll see this:\"\n (iii) That the Leaders will work hard to ensure that all (or at least the majority) of Kenyan Muslim faithful vote overwhelmingly for The Candidate at the 2007 General Election.\n \n (v) That The Candidate, when, InshaAllah, he becomes President of Kenya will:\n \n a) ...In addition, while freedom of worship will be upheld at the JIMBO LA PWANI, the Council of Islamic leaders shall be permitted to have an oversight role to monitor activities of ALL other religions and any applications for religious activities and institutions will require their approval. They shall have the right to deny approval to cults and other evil practices.\n \n b) Within 6 months re-write the Constitution of Kenya to recognize Shariah as the only true law sanctioned by the Holy Quran for Muslim declared regions.\n \n c) With immediate effect dismiss the Commissioner of Police who has allowed himself to be used by heathens and Zionists to oppress the Kenyan Muslim community.\n \n d) and e) intentionally skipped\n \n f) No Muslim residing in Kenya whether a citizen, visitor or relative of any of the above shall be subjected to any process involving the laws of a foreign country and in particular any Muslim arrested for or suspected of Terrorism or any other International crime shall only be tried within the boarders of Kenya and shall be granted a competent lawyer of his/her choice at the expense of the Government.\n \n g) Within 1 year facilitate the establishment of a Shariah court in every Kenyan divisional headquarters.\n \n h) Popularize Islam, the only true religion, in the Coast and North Eastern Regions by ordering every primary school in Kenya in the regions to conduct daily Madrassa classes.\n \n h) Impose a total ban on open-air gospel crusades by worshippers of the cross in the Coast and North Eastern regions.\n \n i), j), k) l), and m) intentionally skipped\n \n n) Impose an immediate ban on women's public dressing styles that are considered immoral and offensive to the Muslim faith in the Muslim regions of the Coastal and North Eastern Regions. This ban will apply to Muslims and non-Muslims alike, in these regions and will include all visitors whether domestic or foreign tourists.\n It goes on...and then is signed by Abdullahi Abdi (Chairman) and Hon. Eng. Raila Amollo Odinga.\n \n All Americans should be taking a very hard look at Senator Obama. His father was Arab, Muslim and Socialist, leaning Communist. Senator Obama has not answered questions about his support for Odinga, or explained his support for Odinga, or acknowledged that Odinga supported Shariah Law in Kenya.\n \n It's all quiet on the Obama front.Maggie's Notebook: Barack Obama's Socialist and Communist Connection in Kenya\n \n \nBTW, maybe you missed it, but Gush Limpbutt called Gen. Powell's endorsement of Senator Obama racially motivated.\n \n When that didn't work Hannity called it self-serving, saying that Powelll wanted a job - as though he needed one.\n\n \n I didn't say that conservative pundits never commented on his motivation for endorsing Ossama, I said they never practiced the politics of personal destruction in attempting to defame and slander Colin Powell. Pointing out his obvious racial motivation and desire to support the perceived winner is not attempting to destroy him, it's simply telling the truth.\n \n Where is your outrage that the drive by media would investigate a private citizen looking for dirt on him just because he disagrees with their chosen candidate during an election cycle? You condemn Bush for investigating suspected terrorists who seek to attack America, but you aren't offended at all when the liberal hit squads go after an average american citizen. How consistent of you and your reprobate sense of justice and fair play.", 
   {}, 
   330251, 
   null, 
   1225305540.0
  ], 
  [
   330257, 
   null, 
   "antonia", 
   "I'm not up-to-date on the laws dealing this topic but do know that while I was stationed in Germany in the early 90's, any child born to military personnel had to have paperwork filled out or they would be considered German citizens. I doubt that at the time of birth the rules were much different in Mccains birth. Has anyone else noticed it isn't the democrats that are trying to confuse the voters with lies. The only people I see trying to push the lies are those that are afraid of any change.\n\n \n The issues were discussed in the Times article, not \"pushed\", and by persons who work for McCain. Citizenship is different than eligibility to run for president of the United States.\n \n The only persons I see pushing lies about the candidate's citizenship are those desparately supporting McCain and his sinking ship. Thus willing, as the old song goes, to say anything.\n \n From Kenyan birth tales, to *socialism*, to swindlers, to \"dey only like 'im 'cause he's black\". And all 'da truth, da whole truth and nothin' but da truth.' The bunkos on the block, as ever throughout history, arrogantly carrying the 'sword of truth' and in the name of God himself.\n \n But the American People are rejecting the Bush/Cheney/McCain/Palin policies that brought us eight years of illegal war, grotesque irresponsibility in the face of two national disasters - one natural (Katrina) and one a terrorist attack on American soil, a nation now in economic crisis after being driven trillions in debt by their bloodthirsty hunt on behalf of the oil emperors -- an economic crisis that has spread globally -- thousands of American soldiers dead, tens of thousands of Americans permanently disabled, hundreds of thousands of Iraqis dead -- their country now demolished -- America sunk to its knees before China -- as Georgie and Dickie take the money and run, rising unemployment, 50 million without health insurance and another 50 million without adequate health coverage, torture, untenable housing costs, scores being thrown out of their homes, college loans skyrocketing, the violation of Americans' constitutional rights, women's constitutional reproductive rights under attack, the assault on the Constitutional separation between church and state, between powers, unchecked international borders whereupon millions have crossed illegally under Republican watch, criminal disregard for international environmental issues that require nations to work together on behalf of scientifically based concerns -- and not pure corporate greed -- our international standing virtually demolished, our leaders seen everywhere as criminals and clowns, need one continue ...\n \n Is it any wonder, Obama ahead by 19 points, Democrats and thinking Republicans alike are saying, \"so long, no thank you -- it hasn't been good to know you at all.\"\n \n There are so many reasons for thinking people for vote for Obama/Biden, it's mind boggling.", 
   {}, 
   330234, 
   null, 
   1225307520.0
  ], 
  [
   330265, 
   null, 
   "Archangel", 
   "As usual antonia spews her drivel without directly responding to any of the evidence forwarded regarding the sketchy character and background of her messiah. The question remains that if Ossama is so proud of the principles which he hold so dear, why must he lie about them and deny his true beliefs to the American people whom he is seeking to support him? That's a question his sheeple will never answer as they continue to deny that what he truly represents is factual, in spite of the overwhelming evidence to the contrary. emoticon_rolleyes At least you are consistent in your dishonesty.\n http://archive.patriotpost.us/uploadedfiles/imagegallery4908541800998.jpg", 
   {}, 
   330257, 
   null, 
   1225310820.0
  ], 
  [
   330267, 
   null, 
   "antonia", 
   "As usual antonia spews her drivel without directly responding to any of the evidence forwarded regarding the sketchy character and background of her messiah. The question remains that if Ossama is so proud of the principles which he hold so dear, why must he lie about them and deny his true beliefs to the American people whom he is seeking to support him? That's a question his sheeple will never answer as they continue to deny that what he truly represents is factual, in spite of the overwhelming evidence to the contrary. emoticon_rolleyes At least you are consistent in your dishonesty.\n \n\n \n One thing you are consistent in, Archangel, is your inability to respond to people's posts without launching into character assassination, implied or overt. At this point in the forum, the only character you have assassinated is your own. All that you say reflects upon yourself.\n \n Your posting drivel and lies about Obama -- and what has been shown as such -- for some time now in the campaign -- and simply asserting it as evidence -- does not make it so. That is, as well, that, coming from your Highness' mouth doesn't mean all must respond again and again and again to your incessant garbage and hate.\n \n I'm reminded of your insane defense of charlatan Peter Paul who ran from the feds, illegally fleeing the country after ripping off people's retirement funds. A guy so dishonest that the judge had to remind the jury that a professional conman was on the witness stand. Yet you could not acknowledge this. So what could you possibly know about honesty or integrity? \n \n Who are you really Archangel. 24/7 on these boards. Disgracing the bible you hold in front of your face. A snake oil salesman, for sure.", 
   {}, 
   330265, 
   null, 
   1225311840.0
  ], 
  [
   330270, 
   null, 
   "Archangel", 
   "One thing you are consistent in, Archangel, is your inability to respond to people's posts without launching into character assassination, implied or overt. \n\n \n As you accuse me of character assassination, you do exactly the same thing. emoticon_smile Your hypocrisy and tunnel vision is what defines you antonia. And I'm sorry that the truth about you is so offensive. And I did respond directly to your post. It is my post above which documented Ossama actually campaigning for his communist and pro-islamic cousin in Kenya which you have avoided and not proven wrong or untrue at all. \n \n All you are capable of doing in response to that evidence is to attack, insult and hope to divert attention from the reality that your messiah is an enemy of the state in sheeps clothing. But like a good sheeple, you follow faithfully as you run towards destruction with your fingers in your ears.\n http://archive.patriotpost.us/uploadedfiles/imagegallery4908540953980.jpg", 
   {}, 
   330267, 
   null, 
   1225312680.0
  ], 
  [
   330272, 
   null, 
   "antonia", 
   "As you accuse me of character assassination, you do exactly the same thing. \n\n \n You assassinate your own character, Archangel. And, all things are not equal. For my statements about you are based on reasoning and example; while yours about me are nothing more than unsubstantiated character attacks, assertions without evidence. A very cheap trick. I must frighten you greatly, that you feel so compelled to launch into me again and again -- and especially since our conversation about the charlatan and rip-off artist, Peter Paul. Who forged papers, lied to officials attempting to leave the country, fled justice after ripping off people's retirement acccounts.\n \n As for your garbage about Obama, well, just pathetic at this point.\n \n Snake oil salesman. Bunko. Creep.", 
   {}, 
   330270, 
   null, 
   1225313160.0
  ], 
  [
   330273, 
   null, 
   "Archangel", 
   "You assassinate your own character, Archangel. And, all things are not equal. For my statements about you are based on reasoning and example; while yours about me are nothing more than unsubstantiated character attacks, assertions without evidence. I must frighten you greatly, that you feel so compelled to launch into me again and again -- and especially since our conversation about the charlatan and rip-off artist, Peter Paul. Who falsified papers, lied to officials attempting to leave the country, fled justice after ripping off people's retirement acccounts.\n \n As for your garbage about Obama, well, just pathetic at this point.\n \n Snake oil salesman. Bunko. Creep.\n\n \n Please post the evidence of my low character antonia. You think that your accusations hold some credibility at all as you dishonestly rip examples out of context in order to slander me? You do nothing more that reveal your own inherent dishonesty as you deny what has been proven about your messiah now, and the very questionable, hillbilly clinton before him. Just by the politicians you cling to you prove your poor judgement and lack of a moral center. \n \n As evidence of your dishonesty, let's use this Peter Paul who I referred to as a person who had business dealings with the Clintons and testified to their part in illegal doings. From that reference, you have attempted to tie me to him as if I endorsed his character from personal knowledge. When one person of poor character is referred to in condemning another person of poor character, in this instance that would be your first choice for President, that in no way means I am defending the witness, or Peter Paul in this case.\n \n Yet, you continue to lie and dishonestly claim that I have somehow endorsed his character or standing in the community. It is not only pathetic, but is solid evidence of your innate dishonesty and need to slander me based on lies rather than be able to defend your messiah with any truth at all. I notice you still haven't even attempted to refute the link to him campaigning for a known pro-islamic communist cousin in Kenya. But what is most disturbing about you as an american, is that it you're not smart enough to allow it to even bother you. emoticon_rolleyes Truly pathetic antonia, and yet you're not even ashamed of yourself. emoticon_confused", 
   {}, 
   330272, 
   null, 
   1225314000.0
  ], 
  [
   330274, 
   null, 
   "antonia", 
   "There is no ignore button on this forum, but you are henceforth on ignore for me, Archangel. For that is entirely my view of you, and I have responded ad vomitum to your points. \n \n Perhaps you even make up handles to talk to yourself here. Keep you afloat, so to speak.", 
   {}, 
   330273, 
   null, 
   1225314480.0
  ], 
  [
   330277, 
   null, 
   "Archangel", 
   "There is no ignore button on this forum, but you are henceforth on ignore for me, Archangel. For that is entirely my view of you, and I have responded ad vomitum to your points. \n \n Perhaps you even make up handles to talk to yourself here. Keep you afloat, so to speak.\n\n \n Yes there is an ignore feature schmuck, check your User CP. And by all means put me on ignore so I don't have to respond to anymore of your dishonest rants. But be forewarned, if you continue to lie, I will continue to challenge them whether you respond to me or not. emoticon_xbye", 
   {}, 
   330274, 
   null, 
   1225314720.0
  ], 
  [
   330278, 
   null, 
   "antonia", 
   "I advise parents to keep their minor participants away from Archangel, and to consider keeping them away from posters who continually engage with him.", 
   {}, 
   330277, 
   null, 
   1225315440.0
  ], 
  [
   330279, 
   null, 
   "Archangel", 
   "I advise parents to keep their minor participants away from Archangel, and to consider keeping them away from posters who continually engage with him.\n\n \n Minors have no place on an adult centered debate forum anyway, but what assertion are you making about me antonia? Are you actually recommending that a pro God, anti-abortion promoter of submission to a perfect and holy God is a bad influence on anybody? That my admitting that I am a sinner in need of personal salvation is someone to be feared, when you are surrounded here by secular humanists who promote pre-marital sex and moral values that justify any personal conduct that is ok if it feels good? \n \n By warning about me, you further prove the depth of your own reprobate character. emoticon_xbye BTW, how's that ignore feature coming, did you find it yet? emoticon_xbye", 
   {}, 
   330278, 
   null, 
   1225316100.0
  ], 
  [
   330281, 
   null, 
   "T.Q", 
   "Archie, you may want to read these articles:\n \n Cognitive dissonance - Wikipedia, the free encyclopedia\n \n Confirmation bias - Wikipedia, the free encyclopedia\n \n Denial - Wikipedia, the free encyclopedia\n \n Defence mechanism - Wikipedia, the free encyclopedia", 
   {}, 
   330279, 
   null, 
   1225317060.0
  ], 
  [
   330284, 
   null, 
   "Archangel", 
   "Archie, you may want to read these articles:\n \n Cognitive dissonance - Wikipedia, the free encyclopedia\n \n Confirmation bias - Wikipedia, the free encyclopedia\n \n Denial - Wikipedia, the free encyclopedia\n \n Defence mechanism - Wikipedia, the free encyclopedia\n\n \n These links are precisely what you need to hopefully get a grasp on reality tq. I know exactly where I came from, where I'm going and why I'm here, and have no problem accepting or respecting reality.\n \n http://www.thismodernworld.org/arc/72199.gif", 
   {}, 
   330281, 
   null, 
   1225317960.0
  ], 
  [
   330287, 
   null, 
   "T.Q", 
   "[QUOTE=Archangel;330284]I know exactly where I came from, where I'm going and why I'm here, and have no problem accepting or respecting reality.[QUOTE]\n \n Except for pesky bits that disagree with your preconceived notions (ie-what the rest of us call reality)", 
   {}, 
   330284, 
   null, 
   1225318380.0
  ], 
  [
   330290, 
   null, 
   "Archangel", 
   "[QUOTE=T.Q;330287][QUOTE=Archangel;330284]I know exactly where I came from, where I'm going and why I'm here, and have no problem accepting or respecting reality.\n\n \n Except for pesky bits that disagree with your preconceived notions (ie-what the rest of us call reality)\n\n \n Your preferred reality is an illusion and a lie tq. After all, you are ignorant of a complete aspect of your spiritual being. And without that awareness you are destined to be deluded by this world lies and deceptions. So to proclaim that I am unlike the rest of your so called realists is solid evidence that I am seeing that which you are blind to. But thanks for sharing... really. emoticon_smile", 
   {}, 
   330287, 
   null, 
   1225318920.0
  ], 
  [
   330292, 
   null, 
   "Penfold", 
   "http://www.fototime.com/CA12E6DB76A8B85/orig.jpgemoticon_rolleyes THE GOSPEL OF SECULAR HUMANISM, AND OBAMA'S FOLLOWERS TOO. emoticon_rolleyes\n\n \n \n This is simply grotesquely offensive. A sweeping generalisation of the worst kind, compounded by the obvious fact that the poster either sees no problem with it, or does not care who is offended by it.", 
   {}, 
   330284, 
   null, 
   1225320060.0
  ], 
  [
   330293, 
   null, 
   "Penfold", 
   "[QUOTE=Archangel;330290][QUOTE=T.Q;330287]\nI know exactly where I came from, where I'm going and why I'm here, and have no problem accepting or respecting reality.\n \n Your preferred reality is an illusion and a lie tq. After all, you are ignorant of a complete aspect of your spiritual being. And without that awareness you are destined to be deluded by this world lies and deceptions. So to proclaim that I am unlike the rest of your so called realists is solid evidence that I am seeing that which you are blind to. But thanks for sharing... really. emoticon_smile\n\n \n We can be thankful that the majority do not interpret their hallucinations as reality. We should try not to revile those who do but pity them in their narrowminded delusion.", 
   {}, 
   330290, 
   null, 
   1225320300.0
  ], 
  [
   330300, 
   null, 
   "Archangel", 
   "This is simply grotesquely offensive. A sweeping generalisation of the worst kind, compounded by the obvious fact that the poster either sees no problem with it, or does not care who is offended by it.\n\n \n I agree, it's truth is very offensive, which is why it needed to be posted. So maybe you would realize exactly what you represent in reality. ;)", 
   {}, 
   330292, 
   null, 
   1225324140.0
  ], 
  [
   330303, 
   null, 
   "trebor", 
   "Really? Then you have proven you have a serious case of tunnel vision. Has it missed your notice how the dems have turned on Joe the Plumber since he labeled Obama a socialist, and they/the mainstream media have investigated a private citizen, attempting to destroy his credibility and character just because he doesn't agree with them? And on the reverse, have you seen even ONE Republican pundit or conservative attempt to attack, excoriate, insult or defame Colin Powell for endorsing Obama? \n \n The SOP for the left is to destroy anyone who dares to speak out publicly against their guy as they accuse those who criticize Obama as attempting to confuse the voters with lies, just as you have done here. At least you have shown in short order that you're a typical liberal with only the standard talking points to offer, and nothing new or unique to add to the mix. emoticon_rolleyes\n\n \n George Will for one\n \n Pat Buchannan\n \n Rush Limbaugh", 
   {}, 
   330247, 
   null, 
   1225325580.0
  ], 
  [
   330305, 
   null, 
   "trebor", 
   "Maybe that's because Joe the Plumber is both a fraud and a liar.\n \n He's a fraud because he is not licensed to practice his supposed line of work.\n \n He's a liar since Senator Obama is no more a socialist (as though that were a bad thing) than you are an atheist.\n \n Even so, with the economy in the tank, with unemployment and foreclosures rising, with 47 million Americans without health care, the fact that the Repubbies raise the non-issue of Joe the Plumber is an indication of how desperate they are and just how much the kindly old gentleman from Arizona has destroyed whatever tattered remnants of his honor he had left in his vain pursuit of the Presidency.emoticon_mad\n \n BTW, maybe you missed it, but Gush Limpbutt called Gen. Powell's endorsement of Senator Obama racially motivated.\n \n When that didn't work Hannity called it self-serving, saying that Powelll wanted a job - as though he needed one.\n\n \n In addition, Joe the Plumber was a set up from square one. Look at his relations. His cousin is Charles Keatings son in law. . Coincidence?? I don't think so.", 
   {}, 
   330251, 
   null, 
   1225325640.0
  ], 
  [
   330383, 
   null, 
   "Penfold", 
   "I agree, it's truth is very offensive, which is why it needed to be posted. So maybe you would realize exactly what you represent in reality. ;)\n\n \n Your intolerance, projection and lack of insight are truly prodigious.", 
   {}, 
   330300, 
   null, 
   1225352820.0
  ], 
  [
   330409, 
   null, 
   "Archangel", 
   "Your intolerance, projection and lack of insight are truly prodigious.\n\n \n Why do you consider my posting a cartoon which accurately defines what your side represents to be offensive at all penfold? If it was possible to draw a picture of what you think about what my side represents, it would look just like that cartoon. I mean, it's not as if you fascists are really tolerant at all with all beliefs and attitudes, only with people who agree with you. So to be accurate here, it must be pointed out that it's your intolerance, projection and lack of insight are truly prodigious, which is proven by your complaints about an innocent cartoon which accurately portrays what you represent.", 
   {}, 
   330383, 
   null, 
   1225378080.0
  ], 
  [
   330412, 
   null, 
   "T.Q", 
   "Why do you consider my posting a cartoon which accurately defines what your side represents to be offensive at all penfold?\n\n Because it isn't accurate, and there are no \"sides\". Wth is wrong with you people?\n \n \nIf it was possible to draw a picture of what you think about what my side represents, it would look just like that cartoon.\n\n Once again, there is no \"sides\". You are both people. You are not at war, you are not on different teams. This divisiveness in the US is sickening.\n \n \nI mean, it's not as if you fascists\n\n Define fascist, and explain in detail why Penfold is one.\n \n \nare really tolerant at all with all beliefs and attitudes, only with people who agree with you.\n\n I'll speak for Penfold here and say-not so. I am tolerant of those who are tolerant.\n \n \nSo to be accurate here, it must be pointed out that it's your intolerance, projection and lack of insight are truly prodigious, which is proven by your complaints about an innocent cartoon which accurately portrays what you represent.\n\n Anyone want to take the days it would take to list examples of Archie being intolerant and ignorant?\n \n How is a cartoon, which you address to those who disagree with you, portraying a Nazi/Muslim stabbing jews and christians \"innocent\"?", 
   {}, 
   330409, 
   null, 
   1225379040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is Obama a United States Citizen?", 
  "url": "http://www.4forums.com/political/elections-debates/11837-obama-united-states-citizen.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11837, 
  "discussion_files": [
   [
    "28058.html", 
    "http://www.4forums.com/political/elections-debates/11837-obama-united-states-citizen-print.html"
   ], 
   [
    "28059.html", 
    "http://www.4forums.com/political/elections-debates/11837-obama-united-states-citizen-5-print.html"
   ], 
   [
    "28060.html", 
    "http://www.4forums.com/political/elections-debates/11837-obama-united-states-citizen-4-print.html"
   ], 
   [
    "28061.html", 
    "http://www.4forums.com/political/elections-debates/11837-obama-united-states-citizen-3-print.html"
   ], 
   [
    "28062.html", 
    "http://www.4forums.com/political/elections-debates/11837-obama-united-states-citizen-2-print.html"
   ]
  ], 
  "identifier": 11837
 }
]