[
 [
  [
   329928, 
   null, 
   "El Arte", 
   "I don't see the point. Theists, for the most part, do not harm anyone by holding theistic beliefs nor do their beliefs actively promote harm or destructive actions. \n \n There are a few exceptions, as there exists with parts of any ideology like the faith-healing of many religious traditions, but even the most extreme example, Islam does not cause every one of its believers to do harm to others. A survery taken in Iran recently documented that over 60% of the population would rather be free like the citizens of the U.S. and accepting of other religions and culture. With around 1 billion Muslims in the world, the few examples of terror that some Islam extremists will inflict on others is proof to me that religion isn't as big a problem as many atheists blow it up to be.\n \n Delving into the causes of many wars you will find religion was merely a tool used to add further \"justification\" to actions that were truly caused by politics, land disputes, greed, and many other factors.\n \n Even if you manage to successfully argue logically it's unlikely to change many people because we have our prejudices and biases we learned through our culture and we tend to adopt beliefs and thought-systems that conform with our views. I think so long as someone isn't hurting someone else, then we should leave them be.", 
   {
    "post_info": {
     "post_title": "What is your reason for arguing against theism and theists?"
    }
   }, 
   null, 
   null, 
   1225082280.0
  ], 
  [
   329939, 
   null, 
   "Zardoz", 
   " (snip)does not cause every one of its believers to do harm to others. (snip).\n\n \n \n It's implicit in your statement that it causes SOME to cause harm.\n \n The mere fact that it causes some to engage in abhorant practices is enough to see it's timely demise.\n \n Theism causes people to abandon rational thought in the pursuit of nonsense that is typically exploited by others for personal gain.\n When you ask people to believe in made up BS, you can shoe-horn you are doing them a great disservice.\n \n How would you like it if I cradle raised you to believe in faries and told you that you had to work extra-hard through the week and then fill up a bag full of groceries and take it out to the woods for the faries to eat?\n Wasteful of resources.\n How would you feel if I asked you to do so but, to stop by my place on your way there and let me pick out some of the stuf for my own use...hey, I am the great teller of knoweldge glened from the fairies, I'm OWED that skimming off the top...it's all writen down in the book I like to read from so you should believe it to be true!", 
   {}, 
   329928, 
   null, 
   1225085880.0
  ], 
  [
   329945, 
   null, 
   "Archangel", 
   "It's implicit in your statement that it causes SOME to cause harm.\n \n The mere fact that it causes some to engage in abhorant practices is enough to see it's timely demise.\n \n Theism causes people to abandon rational thought in the pursuit of nonsense that is typically exploited by others for personal gain.\n When you ask people to believe in made up BS, you can shoe-horn you are doing them a great disservice.\n \n How would you like it if I cradle raised you to believe in faries and told you that you had to work extra-hard through the week and then fill up a bag full of groceries and take it out to the woods for the faries to eat?\n Wasteful of resources.\n How would you feel if I asked you to do so but, to stop by my place on your way there and let me pick out some of the stuf for my own use...hey, I am the great teller of knoweldge glened from the fairies, I'm OWED that skimming off the top...it's all writen down in the book I like to read from so you should believe it to be true!\n\n \n Only the most bigoted and closed minded among us would assert that because some people radicalize a cult and use it to justify murdering the innocent as has happened with islam, that all theism is bad and should be erased from society. Should cars be banned because accidents occur and because some abuse the driving privilege? And should airplanes be abolished because they crash sometimes and can potentially be hijacked? \n \n How dare we continue with the space program since 2 shuttles have failed and killed the astronauts on board! Why don't we ban red meat since it leads to heart problems? Or how about ridding the world of atheists because the 100 million people killed during the 20th century were destroyed at the hands of godless tyrants who felt that life was cheap.\n \n You give a couple of imaginary hypotheticals which have no basis in fact at all, yet you use them to justify the expulsion of GOD from the human psyche. Is that what you call being open and tolerant of others and respecting human and civil rights? Are you so shallow that you believe God is to blame because some people have perverted and abused His loving message of reconciliation?", 
   {}, 
   329939, 
   null, 
   1225088280.0
  ], 
  [
   329949, 
   null, 
   "pandion", 
   "I don't see the point. Theists, for the most part, do not harm anyone by holding theistic beliefs nor do their beliefs actively promote harm or destructive actions.\nAnd, of course, you follow with a mention of \"exceptions\" and follow with your biased opinion of Islam. Why not use christian examples of these \"exceptions\"?\n \n For my part, I don't argue against theists or theism, deists or deism, or any other religious view. As far as I am concerned, they are free to delude themselves with whatever superstition they wish. I argue against efforts by the above to impose their religious views on me and my children in our schools, on and in our government buildings, and in our government. (For example, the very first organization that received government money under Bush's \"faith based initiative\" was required to return the money because they required a profession of faith before giving aid to the needy. But, that's just how christians are. I just don't want to give them my tax money.)\n \nThere are a few exceptions, as there exists with parts of any ideology like the faith-healing of many religious traditions, but even the most extreme example, Islam does not cause every one of its believers to do harm to others. A survery taken in Iran recently documented that over 60% of the population would rather be free like the citizens of the U.S. and accepting of other religions and culture. With around 1 billion Muslims in the world, the few examples of terror that some Islam extremists will inflict on others is proof to me that religion isn't as big a problem as many atheists blow it up to be.\nIt seems that you haven't actually paid any attention to history. You seem completely unaware of the religious wars in England and Europe. You have no idea of the torture inflicted by Calvin on dissenters in Geneva, or the torture inflicted by the Puritans in New England.\n \nDelving into the causes of many wars you will find religion was merely a tool used to add further \"justification\" to actions that were truly caused by politics, land disputes, greed, and many other factors.\nBut, of course religion was a \"tool\" used by the powerful to control the masses. It has been in the past and is still today. That doesn't mean that any religion used to justify war was the true religion.\n \nEven if you manage to successfully argue logically it's unlikely to change many people because we have our prejudices and biases we learned through our culture and we tend to adopt beliefs and thought-systems that conform with our views.\nRight. And thus, a rebellious bomber who took pains to make sure that no one was in any building and never killed anyone is branded a terrorist, while bombers who struck without warning and killed several people are not terrorists, but rather people fighting for their religious beliefs. Give me a break. If you agree, then move to Alaska. How stupid is that? You will probably get along with a governor who fires librarians who will not remove books from a public library because they offend your theistic ideals, or one who fires a state director of public safety because he wont fire a state policeman for no reason except that the governor is ###### because that state policeman divorced the governor's sister.\n \nI think so long as someone isn't hurting someone else, then we should leave them be.\nI agree. But that isn't what I see. I see state supreme court justices displaying their monumental erections of mythological religious icons in the rotunda of the Supreme Court of Alabama, and them claiming that their 1st Amendment rights are being violated when it is removed. I also see people doing their jobs whose jobs are threatened by a fundamentalist christian for religious and vindictive reasons.\n \n I hear christian prayers over the PA system at public school sporting events, and then I read that when the Supreme Court declared such activities to be unconstitutional, some deluded chubby girl sued the school district because she felt that her 1st Amendment rights had been violated because she was barred from using the PA system to express her faith at football games.\n \n Give me a break. Fundamentalist christians want to impose their morality on everyone, and that hurts me and my family. I wont go to your churches and I wont swear on your Bible. I will fight the teaching of your mythology as science in public schools, as well as the use of school facilities to propagate your faith. If your faith actually needs government support, then maybe it isn't as much TROOTH as you think.\n \n So, please, go off and practice your faith in private, as Christ commanded. I don't care. Please don't play the martyr when anyone objects to your efforts to impose it on everyone.", 
   {}, 
   329928, 
   null, 
   1225091400.0
  ], 
  [
   329950, 
   null, 
   "pandion", 
   "Only the most bigoted and closed minded among us would assert that because some people radicalize a cult and use it to justify murdering the innocent as has happened with islam, that all theism is bad and should be erased from society.\nSo, you are saying that this was never the case with christianity? Have you actually ever studied history?\n \nShould cars be banned because accidents occur and because some abuse the driving privilege? And should airplanes be abolished because they crash sometimes and can potentially be hijacked?\nWhat does this have to do with the torture and murder of anyone who disagreed with the predominant religion?\n \nHow dare we continue with the space program since 2 shuttles have failed and killed the astronauts on board!\nHow is that relevant to the murder done in the name of God?\n \nWhy don't we ban red meat since it leads to heart problems?\nDo you think that you are actually addressing the topic? What does that have to do with the millions upon millions of people who have been murdered in the name of your god?\n \nOr how about ridding the world of atheists because the 100 million people killed during the 20th century were destroyed at the hands of godless tyrants who felt that life was cheap.\nThen you would agree that any theist should also be killed because theists have caused many more deaths over history.\n \nYou give a couple of imaginary hypotheticals which have no basis in fact at all, yet you use them to justify the expulsion of GOD from the human psyche.\nThat's ####. Nobody talked about the psyche. If you want to believe in mythology, the do so. Stop trying to impose it on others by using the government.\n \nIs that what you call being open and tolerant of others and respecting human and civil rights?\nI think that allowing you to wallow in your mythology in your home and in your church as much as you want without interference from government is being tolerant. I become intolerant when you try to impose your mythology on me as truth, in the face of volumes of evidence to the contrary. If you keep your superstitious mythology to yourself, I have no problem. When you try to impose it on others, I try to expose your superstition for what it is.\n \nAre you so shallow that you believe God is to blame because some people have perverted and abused His loving message of reconciliation?\nActually, no. I blame you and those who are as superstitious as you for propagating such nonsense. I don't blame the tooth fairy for the same reason that I don't blame your god for anything. I do blame religious excess from whatever faith for offering the justification for inhuman actions.", 
   {}, 
   329945, 
   null, 
   1225092540.0
  ], 
  [
   329971, 
   null, 
   "Penfold", 
   "......... use it to justify murdering the innocent as has happened with islam, ............\n \n Are you so shallow that you believe God is to blame because some people have perverted and abused His loving message of reconciliation?\n\n \n Who says Americans don't do irony?", 
   {}, 
   329945, 
   null, 
   1225117920.0
  ], 
  [
   329977, 
   null, 
   "trebor", 
   "Only the most bigoted and closed minded among us would assert that because some people radicalize a cult and use it to justify murdering the innocent as has happened with islam, that all theism is bad and should be erased from society. Should cars be banned because accidents occur and because some abuse the driving privilege? And should airplanes be abolished because they crash sometimes and can potentially be hijacked? \n \n How dare we continue with the space program since 2 shuttles have failed and killed the astronauts on board! Why don't we ban red meat since it leads to heart problems? Or how about ridding the world of atheists because the 100 million people killed during the 20th century were destroyed at the hands of godless tyrants who felt that life was cheap.\n \n You give a couple of imaginary hypotheticals which have no basis in fact at all, yet you use them to justify the expulsion of GOD from the human psyche. Is that what you call being open and tolerant of others and respecting human and civil rights? Are you so shallow that you believe God is to blame because some people have perverted and abused His loving message of reconciliation?\n\n \n \n Thank you for providing an example of why agnostics and atheists fight against theism. You have been very kind.", 
   {}, 
   329945, 
   null, 
   1225120680.0
  ], 
  [
   330070, 
   null, 
   "obvious_child", 
   "Archangel is like Kurt Cameron. \n \n Turning people off to Christanity with every word he says.", 
   {}, 
   329977, 
   null, 
   1225167600.0
  ], 
  [
   330392, 
   null, 
   "iangb", 
   "Personally speaking (agnostic!), I don't argue against theism/theists in general. Instead, I argue against those few instances where a faith either conflicts with observable reality (creationism) or is harmful to the well-being of others (gay rights).\n \n I do get involved in more general theological discussions from time to time, but that's pretty much intellectual indulgence. This is a debate forum, after all. emoticon_rolleyes", 
   {}, 
   330070, 
   null, 
   1225365780.0
  ], 
  [
   330595, 
   null, 
   "unkerpaulie", 
   "Religion on a whole is a problem. I could ask the same of christians and what they have against wiccans, paganists, satanists, etc that don't harm others. I dant recall anywhere in history where satanists wages war against anybody else in other to acheive religious dominance. \n \n The problem arises when any group creates a model of their reality that is founded on any type of unproven and unprovable mythology. Personally, I have found that the bible is full of false promises. Obedient children sometimes still die young. The prayers of righteous men often go unanswered. There's no correlation between actions and results. So its utterly pointless for me to use the bible as a guide for anything at all. The authors were clueless. \n \n Religion is all about not taking responsibility for what happens to you.", 
   {}, 
   330392, 
   null, 
   1225478100.0
  ], 
  [
   330602, 
   null, 
   "Archangel", 
   "Religion on a whole is a problem. I could ask the same of christians and what they have against wiccans, paganists, satanists, etc that don't harm others. \n\n \n Believers in and followers of Christ don't have any problem with these people you mention. It's their belief systems which we reject as they are false cultic belief systems. \n \n \nI dant recall anywhere in history where satanists wages war against anybody else in other to acheive religious dominance.\n\n \n For every generation prior to this reprobate and very secular humanist based generation, satanists have had to hide what they are as their belief system promotes the father of lies and deception. Not to mention the ongoing spiritual battle between good and evil. Secret societies act and exist in secret. If they had nothing to be ashamed of they would act in the open. \n \n \n The problem arises when any group creates a model of their reality that is founded on any type of unproven and unprovable mythology. \n\n \n You mean like evolution which is mathematically impossible to have occurred according to all laws of probability?\n \n \nPersonally, I have found that the bible is full of false promises. Obedient children sometimes still die young. The prayers of righteous men often go unanswered. There's no correlation between actions and results. So its utterly pointless for me to use the bible as a guide for anything at all. The authors were clueless. \n \n Religion is all about not taking responsibility for what happens to you.\n\n \n Then you haven't searched out the truth which is available to all who ask with a sincere heart and mind. We exist in a fallen world and have free will which causes us to create many of our own bad outcomes and the negative circumstances we find ourselves in. Even righteous people aren't perfect all of a sudden. We are only forgiven. \n \n And is it beyond you to comprehend that the writers of the bible weren't required to have a clue about what they wrote? It was only necessary that they submitted to the holy spirit who authored the words they wrote down. \n \n And your statement that believers don't take responsibility for what happens to us is fallacious because in fact, we do just the opposite. I have openly admitted that I am a fallen sinner in need of forgiveness for the wrong I have done in my life. That is the epitome of taking responsibility for my mistakes in life. \n \n We admit we are flawed and seek to make right our errors and poor judgement in life. It is you who lies to yourself as you assume you are just fine the way you are. You are in complete denial of your need for forgiveness and therefore take absolutely no responsibility for your shortcomings in life or for what happens to you.", 
   {}, 
   330595, 
   null, 
   1225480560.0
  ], 
  [
   330633, 
   null, 
   "Jo Bennett", 
   "You mean like evolution which is mathematically impossible to have occurred according to all laws of probability?\n \n\n \n You seriously believe this? Go read up on Bayes' Theorem and come back when you actually understand probability. Even if you discount Bayes' Theorem there is no law of probability that declares things to be impossible.", 
   {}, 
   330602, 
   null, 
   1225487520.0
  ], 
  [
   330707, 
   null, 
   "Zardoz", 
   "Believers in and followers of Christ don't have any problem with these people you mention. It's their belief systems which we reject as they are false cultic belief systems.\n\n \n WOW Archy...\n \n You just don't get it.\n \n We also don't have any problems with you...just your cultic belief system that seeks to cause harm to others who don't follow it's narrow tenants.\n \n Quite honestly Archy, I think you'd be a decent neighbor.\n Take away the clap-trap and you'd be an awesome one.\n So awesome in fact that I'd tolerate you being off a leash and out of a staight jacket and allowed to cut your grass with a butter-knife.", 
   {}, 
   330602, 
   null, 
   1225510080.0
  ], 
  [
   330709, 
   null, 
   "T.Q", 
   "allowed to cut your grass with a butter-knife.\n\n \n Whoa whoa whoa, let's not be hasty here.", 
   {}, 
   330707, 
   null, 
   1225513380.0
  ], 
  [
   333142, 
   null, 
   "Peeling", 
   "I don't see the point. Theists, for the most part, do not harm anyone by holding theistic beliefs nor do their beliefs actively promote harm or destructive actions. \n\n My views on this have changed substantially over the past three years of posting here. To begin with, I was quite impatient with the silliness of it all: I saw religion first and foremost in terms of its various denials of the obvious, its absurd rituals and frequently bizarre concept of sin, all of which seemed synonymous with belief in a god. I also despaired of the widespread perception that merely believing in something fervently - having faith - was somehow a virtue. In short, any babies swilling around in there were getting tossed out with the copious quantities of bathwater.\n \n Since then I think I've come to appreciate a bigger picture. Denial, rituals and moral oddities are not unique to theistic religion. Nor is the commission of atrocity. Although one could argue that belief in the divine might in principle correlate more strongly with a cheapening of human life, that doesn't seem to actually happen. To demonize god, as it were, is to bark up the wrong tree. Nor is the idea of faith as a virtue unique to theistic religion, although elsewhere it goes by other names, such as 'patriotism'.\n \n Latterly I've realised theistic religions are, in the end, just another kind of social manifesto, another set of rules designed and/or evolved to forge individual humans into a coherent collective. The effective role of the 'god-idea' in that process is twofold: it ossifies beliefs and rules, insulating them against external change (for better or worse, unfortunately), and it concentrates the control over 'steering' the religion into the hands of a few: those who interpret the scriptures. But there's nothing uniquely theistic in that: all types of society have ways and means of concentrating control and policing codes of conduct.\n \n Seeing things from that perspective came as something of a revelation for me. A hell of a lot fell into place with a bang. It's not about whether a given social manifesto incorporates a belief in god, it's about the relationships between individuals and between individuals and society as a whole defined by that manifesto.\n \n Consider for a moment the defence mechanism of the gecko. No, really - bear with me here. When threatened the gecko is able to shed the end of its tail, giving it a chance to escape. And that's all very clever and absolutely fine - except we're only thinking about it in terms of the gecko as an entity in its own right. We think 'the gecko' escapes. But the gecko is a collective; a society of cells all doing their bit. And in order for that society to preserve its integrity, it will cheerfully abandon a substantial and quite blameless chunk of itself to die. It will even breed that chunk specifically for that purpose. Seen from the perspective of an individual cell, the gecko is a merciless totalitarian regime.\n \n Atrocities aren't committed by religious regimes or atheist regimes, they're committed whenever the survival or expansion of the collective - whatever it may be - is held to be more important than individual human lives. The cold war exemplifies this: two rival collectives very nearly willing to destroy every human on the whole planet rather than allow their humans to become part of the other. Every dictatorship throughout history fits that same criterion. It's tempting to think dictatorships are all about the dictator; they're not. They're about preserving the societal infrastucture that makes it possible for him/her to be a dictator.\n \n And while I have myself used the example of Galileo's imprisonment to illustrate the injustices and injuries to science committed by religion, the same could be said for any form of dogma. Even putting aside the violent purges carried out in the name of collective ideals, the blind determination that communism ought to work in the face of all evidence to the contrary impoverished millions of Russians and Chinese (most of the deaths under Mao were due to starvation after he wrecked the country's infrastructure), so it's hard to get too upset about the imprisonment of one man and the associated retardation of scientific progress.\n \n So while I once might have described myself as atheist, I would now describe myself as a humanist and pragmatist. We obviously need collectives, and if a collective looks after its members and treats them well, I have nothing in principle against the incorporation of a god-idea (though I may have a specific problem with the associated beliefs concerning what god has to say).\n \n Hopefully this puts into context the bee in my personal bonnet: the willy-nilly advocation of blind faith as a virtue, mostly by those whose blind faith hasn't (in their eyes anyway) yet proved catastrophic. To practise blind faith is to put yourself entirely at the mercy of an idea and just hope it has your best interests at heart. Sometimes it works out OK, and sometimes you find out too late you've signed up to be the gecko's tail. But blind faith doesn't have to be about god. Equally, patriotism or idealism renders people vulnerable to those who would exploit that ready emotional handle to distort society in their favour, or who would commit terrible crimes in the name of spreading or preserving an idea.", 
   {}, 
   329928, 
   null, 
   1226945880.0
  ], 
  [
   333215, 
   null, 
   "Charliegone", 
   "I don't see the point. Theists, for the most part, do not harm anyone by holding theistic beliefs nor do their beliefs actively promote harm or destructive actions. \n \n There are a few exceptions, as there exists with parts of any ideology like the faith-healing of many religious traditions, but even the most extreme example, Islam does not cause every one of its believers to do harm to others. A survery taken in Iran recently documented that over 60% of the population would rather be free like the citizens of the U.S. and accepting of other religions and culture. With around 1 billion Muslims in the world, the few examples of terror that some Islam extremists will inflict on others is proof to me that religion isn't as big a problem as many atheists blow it up to be.\n \n Delving into the causes of many wars you will find religion was merely a tool used to add further \"justification\" to actions that were truly caused by politics, land disputes, greed, and many other factors.\n \n Even if you manage to successfully argue logically it's unlikely to change many people because we have our prejudices and biases we learned through our culture and we tend to adopt beliefs and thought-systems that conform with our views. I think so long as someone isn't hurting someone else, then we should leave them be.\n\n \n I do not really care what religion people are. To me it's about how far they take their beliefs. If they take it to the point where they start forcing or start damaging people's lives with their beliefs, then yes I would have problem. For example, extreme \"Islamic\" terrorists, \"Christians\" bombing abortion clinics, denying gay marriage, etc. One of the reasons I left the LDS church was it's over reaching power. In one instance I remember they said sexual relations other then the \"right\" ways was wrong. I was ###? They are going to tell me how to even have sex with my wife (I do not have a wife, just hypothetically I said so in my mind.)? I guess for some people it is alright for them to live like that, not me though.", 
   {}, 
   329928, 
   null, 
   1226968860.0
  ], 
  [
   333279, 
   null, 
   "Peeling", 
   "I do not really care what religion people are. To me it's about how far they take their beliefs. If they take it to the point where they start forcing or start damaging people's lives with their beliefs, then yes I would have problem. For example, extreme \"Islamic\" terrorists, \"Christians\" bombing abortion clinics, denying gay marriage, etc. One of the reasons I left the LDS church was it's over reaching power. In one instance I remember they said sexual relations other then the \"right\" ways was wrong. I was ###? They are going to tell me how to even have sex with my wife (I do not have a wife, just hypothetically I said so in my mind.)? I guess for some people it is alright for them to live like that, not me though.\n\n This is the sort of thing I meant when I talked about the collective's identity starting to overwhelm that of the people of whom it is composed. The LDS example is perfect: individuals must to bend over backwards (or in this case refrain from doing so) in order to demonstrate their commitment to the society. The rules might in themselves be relatively innocuous, but in terms of suppressing or misdirecting your critical faculties they function like push-ups or lunges: training the mind to conform.\n \n Don't get me wrong: I don't believe there has to be anything deliberately cynical or manipulative going on in any specific case, any more than I believe that once upon a time some of the gecko's elbow cells got together and conspired to exploit its tail. What I think is that there is a natural tendency for collectives to take on a life of their own, for the conventions that bind the members together to become skewed more and more heavily towards demonstrations of loyalty and prioritising the needs and survival of the collective over those of the individuals - probably because the fate of the individuals has become inextricably entwined with that of the collective.\n \n Consider the current global financial crisis. A small number of very rich and priviliged individuals make a stupid mistake, and suddenly Joe Average is having to pay to bail them out - because if we don't we'll be in even worse trouble. The similarity to the physiological effects of shock on a living body is striking: resources must be diverted to the essential organs to keep them alive because however unfair it might be for the cells in your extremities to have to pay for the consequences of a decision made by your brain, if they don't do it all your cells will die. That's the price we pay for enjoying the fruits of such a potent, specialised socio-financial organism: like any other complex, differentiated organism the whole has to function lest the individual parts die. Contrast that with bacterial colonies: they don't achieve very much but they're virtually impossible to eradicate: you literally have to kill each individual cell rather than just disrupting their organisation a bit and watching their interdependence kill them for you.\n \n Anyway, sorry for rambling :) I just find it a fascinating topic.", 
   {}, 
   333215, 
   null, 
   1227029460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is your reason for arguing against theism and theists?", 
  "url": "http://www.4forums.com/political/religion-debates/11845-what-your-reason-arguing-against-theism-theists.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 11845, 
  "discussion_files": [
   [
    "20138.html", 
    "http://www.4forums.com/political/religion-debates/11845-what-your-reason-arguing-against-theism-theists-print.html"
   ], 
   [
    "20139.html", 
    "http://www.4forums.com/political/religion-debates/11845-what-your-reason-arguing-against-theism-theists-2-print.html"
   ]
  ], 
  "identifier": 11845
 }
]