[
 [
  [
   330073, 
   null, 
   "Galileo", 
   "\"WESTFIELD, Mass. - With an instructor watching, an 8-year-old boy at a gun fair aimed an Uzi at a pumpkin and pulled the trigger as his dad reached for a camera.\n \n \"It was his first time shooting a fully automatic machine gun, and the recoil of the weapon was too much for him. He lost control and fatally shot himself in the head.\"\n Boy, 8, shoots himself to death at Mass. gun show - Yahoo! News\n \n Disturbing. So children are allowed to fire machine guns at gun shows?", 
   {
    "post_info": {
     "post_title": "Child shoots himself with a machine gun at a gun show"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1225168680.0
  ], 
  [
   330075, 
   null, 
   "Omegamon_X", 
   "Disturbing. So children are allowed to fire machine guns at gun shows?\n\n \n As it said in the article, children need permission from their parent or legal guardian, and they have to be supervised the entire time.\n \n How's it any different from teaching your children to drive? You put them behind the wheel of two tons of power and they try to operate it like they know what they're doing.", 
   {}, 
   330073, 
   null, 
   1225169100.0
  ], 
  [
   330080, 
   null, 
   "hollyh", 
   "Developmentally the cognitive, psychological and gross/fine motor skills of a 16yr old differ vastly from an 8 yr old, so vast they could not even be compared.\n If you are making a comparative analysis regarding the introduction of handeling any (cars and guns being the objective of this statement) dangerous situation, then an 8yr old vs a 16yr old just isnt viable.\n An 8yr old should not have been able to fire the weapon, the result was tragic.\n \n Im so sorry to hear about this little guy, such a horrific accident. My thoughts go out to his family.", 
   {}, 
   330075, 
   null, 
   1225169880.0
  ], 
  [
   330081, 
   null, 
   "Penfold", 
   "The father deserves nothing but scorn and derision. He is a murderous cretin whose stupidity killed his child.", 
   {}, 
   330080, 
   null, 
   1225170480.0
  ], 
  [
   330083, 
   null, 
   "Omegamon_X", 
   "Developmentally the cognitive, psychological and gross/fine motor skills of a 16yr old differ vastly from an 8 yr old, so vast they could not even be compared.\n If you are making a comparative analysis regarding the introduction of handeling any (cars and guns being the objective of this statement) dangerous situation, then an 8yr old vs a 16yr old just isnt viable.\n\n \n I find it to be a viable comparison. In both situations you've got somebody young handling something dangerous without prior experience in how you do it properly.\n \n \nAn 8yr old should not have been able to fire the weapon, the result was tragic.\n\n \n I'm gonna have to disagree here with you Holly. I think children should be able to fire guns, so long as it's done in a responsible manner. If you teach them at an early age, and teach them right, then theyr'e gonna be far more likely to respect the guns when they grow up and less inclined to treat them like toys and shoot themselves or others. The reason there are so many accidental deaths among children is because their parents don't teach them the basics and just how dangerous guns are, while leaving them to watch gun battles on TV.\n \n \nIm so sorry to hear about this little guy, such a horrific accident. My thoughts go out to his family.\n\n \n Well I'm not trying to play it off as something it's not, I'm trying to keep people like Galileo from making stupid and untrue points.", 
   {}, 
   330080, 
   null, 
   1225170780.0
  ], 
  [
   330084, 
   null, 
   "Omegamon_X", 
   "The father deserves nothing but scorn and derision. He is a murderous cretin whose stupidity killed his child.\n\n \n Well that's a stupid statement. Stupid enough that I can't even wrap my head around it and make a proper comparison.", 
   {}, 
   330081, 
   null, 
   1225170900.0
  ], 
  [
   330085, 
   null, 
   "hollyh", 
   "Its difficult to explain what i mean in terms of cognitive, mental, motor skill ... without boring the pants of you. \n But i can contribute the idea that should a 16yr old had fired the very same weapon the result would have been vastly different. \n \n [QUOTE=Omegamon_X;330083] If you teach them at an early age, and teach them right, then theyr'e gonna be far more likely to respect the guns when they grow up and less inclined to treat them like toys and shoot themselves or others. The reason there are so many accidental deaths among children is because their parents don't teach them the basics and just how dangerous guns are, while leaving them to watch gun battles on TV.\n [QUOTE]\n \n I agree with that, but not with the part where they are actually allowed to fire the weapon. If guns are going to be a continued part of American culture then children should be educated and taught to respect the weapon. \n Im shuddering thinking about all the accidental deaths related to children.", 
   {}, 
   330083, 
   null, 
   1225171560.0
  ], 
  [
   330086, 
   null, 
   "Omegamon_X", 
   "Its difficult to explain what i mean in terms of cognitive, mental, motor skill ... without boring the pants of you. \n But i can contribute the idea that should a 16yr old had fired the very same weapon the result would have been vastly different.\n\n \n I get the basic idea of what you're saying, I just can't put it into words.\n \n \nI agree with that, but not with the part where they are actually allowed to fire the weapon. If guns are going to be a continued part of American culture then children should be educated and taught to respect the weapon.\n\n \n I'm going to have to ask why a \"no\" vote on the firing experience.\n \n \nIm shuddering thinking about all the accidental deaths related to children.\n\n \n I believe the large majority of such deaths occur among inner city kids who don't know anything about guns except for what they see on TV and movies.", 
   {}, 
   330085, 
   null, 
   1225172040.0
  ], 
  [
   330089, 
   null, 
   "Archangel", 
   "Obviously something went terribly wrong here. And I think it was a twofold error on his fathers part. First, the child obviously had no clue regarding the recoil of the weapon. And secondly and most important, his father had the gun set on full auto which caused it to continue to fire as it recoiled due to the fact that he probably squeezed harder on the gun as it recoiled, thereby keeping his finger pressed on the trigger. \n \n Had the gun been set on semi-auto this accident never would have happened. The News also said that the father was reaching for his camera when this happened. He shouldn't have allowed that child to hold the gun until he was holding it with him, and had explained the recoil, the proper stance and even fired it first so the kid could see it respond to his strength. What is painfully obvious is that the boy wasn't prepared for reaction of a full auto weapon and the recoil it has. It's a tragedy which the father will live with for the rest of his life, and because it happened in anti-gun mass, I expect the law will attempt to crucify someone if at all possible.", 
   {}, 
   330086, 
   null, 
   1225173360.0
  ], 
  [
   330095, 
   null, 
   "hollyh", 
   "I'm going to have to ask why a \"no\" vote on the firing experience. \n\n \n \n I dont think a child should ever feel comfortable firing a gun, they should understand, respect & definately be educated, but experienced? i have to draw the line there.\n Even if the developmental attributes required to fire a weapon existed one has to question the maturity of the recipient.\n A young child, one such as an 8yr old does not posses the psychological maturity needed to understand and appreciate the magnitude of such a weapon and its power.\n If this ability is then squandered by acclimatising the child to such a weapon then they are more likely to experiment further.\n You have actually highlighted this by introducing the affects TV/Media violence has on children. If they are exposed to it enough they become de-sensitised, that is dangerous.\n \n Sorry, i hope i'm not moving off topic here.", 
   {}, 
   330086, 
   null, 
   1225173900.0
  ], 
  [
   330102, 
   null, 
   "Omegamon_X", 
   "I dont think a child should ever feel comfortable firing a gun, they should understand, respect & definately be educated, but experienced? i have to draw the line there.\n Even if the developmental attributes required to fire a weapon existed one has to question the maturity of the recipient.\n A young child, one such as an 8yr old does not posses the psychological maturity needed to understand and appreciate the magnitude of such a weapon and its power.\n If this ability is then squandered by acclimatising the child to such a weapon then they are more likely to experiment further.\n You have actually highlighted this by introducing the affects TV/Media violence has on children. If they are exposed to it enough they become de-sensitised, that is dangerous.\n \n Sorry, i hope i'm not moving off topic here.\n\n \n Alright, I'm going to have to both disagree with this, and ask if you have any evidence to back up your position.\n \n I don't believe that teaching children firearms safety, responsibility and marksmanship, will encourage them to get further involved with guns and more likely to engage in violent acts and shoot others.\n \n I don't have anything on hand to back it up and prove it, but from what I remember the majority of the kids who shoot each other are inner city kids who were never taught to respect the gun, were never taught anything about safety, were never taught anything except for guns being dangerous and something to fear, and the extent of their knowledge being gangster rap videos.\n \n And what they get exposed to in the media and desensitized to, it's violence and killing and rape and the gang lifestyle. I've never seen anything even remotely responsible in cases like these. All these kids know is what they see, and what they see is people in gold jewelry, holding their guns sideways, preaching about how cool it is to kill cops and blow people away.\n \n Now, who do you think is in the higher risk group of becoming a dangerous individual and likely to kill somebody: a kid that was taught from an early age about how a gun isn't a toy, but also shown the fun of making a tin can dance on impact; or an inner city kid who only knows what somebody like Ice-T with his pants hanging off his XXX raps about?", 
   {}, 
   330095, 
   null, 
   1225175700.0
  ], 
  [
   330106, 
   null, 
   "Charliegone", 
   "\"WESTFIELD, Mass. - With an instructor watching, an 8-year-old boy at a gun fair aimed an Uzi at a pumpkin and pulled the trigger as his dad reached for a camera.\n \n \"It was his first time shooting a fully automatic machine gun, and the recoil of the weapon was too much for him. He lost control and fatally shot himself in the head.\"\n Boy, 8, shoots himself to death at Mass. gun show - Yahoo! News\n \n Disturbing. So children are allowed to fire machine guns at gun shows?\n\n \n If there is parental consent than yes they can, but that isn't the issue. The issue is that the father failed in teaching and supervising the child. He has no one to blame but himself.", 
   {
    "unicode_changes_made": true
   }, 
   330073, 
   null, 
   1225179180.0
  ], 
  [
   330121, 
   null, 
   "chester", 
   "\n I'm gonna have to disagree here with you Holly. I think children should be able to fire guns, so long as it's done in a responsible manner. If you teach them at an early age, and teach them right, then theyr'e gonna be far more likely to respect the guns when they grow up and less inclined to treat them like toys and shoot themselves or others. The reason there are so many accidental deaths among children is because their parents don't teach them the basics and just how dangerous guns are, while leaving them to watch gun battles on TV.\n \n\n \n Much to my surprise, I find myself agreeing with you here.\n \n I also think that, at age 8 or so, the experience ought to begin with a single-shot .22 caliber rifle.\n \n Proper firearms training, in an age appropriate manner, has much to recommend it.\n \n That so-called \"Dad\" had as much business letting his little boy handle an Uzi as he would letting him behind the wheel of a big-block Modified Stock Car.\n \n He simply wasn't ready.", 
   {}, 
   330083, 
   null, 
   1225202040.0
  ], 
  [
   330132, 
   null, 
   "grizzly6626", 
   "I have been to a lot of gun shows myself, and seen how they work. So two questions come to my mind pertaining to the article, first of all what was a fully automatic weapon doing at a gun show as it couldnt be sold there to begin with. Second of all, I have never seen or been to a gun show where shooting a gun was even allowed, at all of the shows I have been to you cant even posses a loaded gun while at the gun show. I think that there is more to the story than is being told, and probably some bias by the reporting writer. It is never a good thing when anyone shoots themselves, especially a child. Also, I have never seen a child even allowed to touch a gun at a show either. So, either the article is not being truthfull, or gun shows up north are a lot different than in Texas, because in Texas that never would have happened at a gun show.", 
   {}, 
   330121, 
   null, 
   1225209960.0
  ], 
  [
   330134, 
   null, 
   "Omegamon_X", 
   "Well the article refers to it as a gun fair, not a gun show. My guess is that it's an organized shooting event.", 
   {}, 
   330132, 
   null, 
   1225210800.0
  ], 
  [
   330186, 
   null, 
   "hollyh", 
   "I dunno guys, i'm still trying to wrap my head around the arguments in favor of gun rights for adults. The subject of children using guns was a brand new thought process for me yesterday, and not exactly introduced in the most favorable manner. emoticon_frazzled\n I got off topic bringing media influences into an argument that i hadn't really had any time to digest. \n \n I think i will stick to learning, understanding and educating myself on your gun culture before i enter into this debate. Otherwise i will be speaking purely from an emotional POV, this is not exactly contingent to a fair, valid, educated debate.", 
   {}, 
   330102, 
   null, 
   1225238760.0
  ], 
  [
   330187, 
   null, 
   "Omegamon_X", 
   "I dunno guys, i'm still trying to wrap my head around the arguments in favor of gun rights for adults. The subject of children using guns was a brand new thought process for me yesterday, and not exactly introduced in the most favorable manner. emoticon_frazzled\n I got off topic bringing media influences into an argument that i hadn't really had any time to digest. \n \n I think i will stick to learning, understanding and educating myself on your gun culture before i enter into this debate. Otherwise i will be speaking purely from an emotional POV, this is not exactly contingent to a fair, valid, educated debate.\n\n \n I'll help if I can. Ask away and I'll see what I can offer.", 
   {}, 
   330186, 
   null, 
   1225238940.0
  ], 
  [
   330190, 
   null, 
   "Penfold", 
   "Well that's a stupid statement. Stupid enough that I can't even wrap my head around it and make a proper comparison.\n\n \n Once the personal attack is removed nothing remains of the post, other than the fact of your difficulty of understanding being noted. \n Meanwhile, have an iron bar. You could usefully pass the time attempting to wrap your head around it. ;)", 
   {}, 
   330084, 
   null, 
   1225242060.0
  ], 
  [
   330195, 
   null, 
   "Omegamon_X", 
   "Once the personal attack is removed nothing remains of the post, other than the fact of your difficulty of understanding being noted. \n Meanwhile, have an iron bar. You could usefully pass the time attempting to wrap your head around it. ;)\n\n \n Alright then let's try that again.\n \n Your entire argument is one of pure stupidity and absurdity! Suggesting that the father should be brought up on murder charges because of this tragic accident is a cruel and heartless statement and you should be ashamed of yourself for even suggesting it.", 
   {}, 
   330190, 
   null, 
   1225244640.0
  ], 
  [
   330225, 
   null, 
   "Penfold", 
   "Alright then let's try that again.\n \n Your entire argument is one of pure stupidity and absurdity! Suggesting that the father should be brought up on murder charges because of this tragic accident is a cruel and heartless statement and you should be ashamed of yourself for even suggesting it.\n\n \n \n I would disagree with absurd, as there was nothing comedic in the father's stupidity. Your quibbling over my comment, I leave for others to judge.\n The suggestion that the father should be brought up on murder charges happened inside your head, not in what wrote. Your defence of the cretin who killed his child by his woeful negligence is not a surprise given your record of indiscriminate defence of shooting and shooters", 
   {}, 
   330195, 
   null, 
   1225261140.0
  ], 
  [
   330227, 
   null, 
   "Charliegone", 
   "I would disagree with absurd, as there was nothing comedic in the father's stupidity. Your quibbling over my comment, I leave for others to judge.\n The suggestion that the father should be brought up on murder charges happened inside your head, not in what wrote. Your defence of the cretin who killed his child by his woeful negligence is not a surprise given your record of indiscriminate defence of shooting and shooters\n\n \n Murder charges? No. Negligence? Yes.", 
   {}, 
   330225, 
   null, 
   1225269360.0
  ], 
  [
   330530, 
   null, 
   "Galileo", 
   "As it said in the article, children need permission from their parent or legal guardian, and they have to be supervised the entire time.\n \n How's it any different from teaching your children to drive? You put them behind the wheel of two tons of power and they try to operate it like they know what they're doing.\n\n This is the kind of reasoning that got the child killed. The child was supervised by an adult the entire time and still ended up getting killed. Adult supervision isn't enough if the child can't physically handle the recoil of the gun being fired.", 
   {}, 
   330075, 
   null, 
   1225436280.0
  ], 
  [
   330533, 
   null, 
   "Galileo", 
   "I expect the law will attempt to crucify someone if at all possible.\n\n I have a difficult time understanding why gun rights organizations would support and sponsor events where children can fire automatic weapons especially since people in such organizations always try to portray themselves as responsible individuals who don't endanger others with their guns. I know this post will probably receive a lot of hostile responses from gun activists on this board but it needs to be said and I'm not going to back down when lives are at stake.", 
   {}, 
   330089, 
   null, 
   1225436760.0
  ], 
  [
   330534, 
   null, 
   "Charliegone", 
   "This is the kind of reasoning that got the child killed. The child was supervised by an adult the entire time and still ended up getting killed. Adult supervision isn't enough if the child can't physically handle the recoil of the gun being fired.\n\n \n How is standing back and taking pictures supervision? He wasn't being supervised that is the problem. The father failed in assisting the child holding the gun.\n \n \n \"I have a difficult time understanding why gun rights organizations would support and sponsor events where children can fire automatic weapons especially since people in such organizations always try to portray themselves as responsible individuals who don't endanger others with their guns. I know this post will probably receive a lot of hostile responses from gun activists on this board but it needs to be said and I'm not going to back down.\"\n \n It's called individual responsibility. The father failed at it and the result was tragic. He completely ignored all the gun safety rules. The gun rights organizations did nothing wrong and neither did the sponsors or even the guy who rented them the MG. It was completely the fault of the person supervising the child; his father. The fact is all gun rights organizations stress safety first, it's not their fault some XXXXX failed to follow procedures.", 
   {}, 
   330530, 
   null, 
   1225437060.0
  ], 
  [
   330536, 
   null, 
   "Galileo", 
   "How is standing back and taking pictures supervision? He wasn't being supervised that is the problem. The father failed in assisting the child holding the gun.\n \n \n \"I have a difficult time understanding why gun rights organizations would support and sponsor events where children can fire automatic weapons especially since people in such organizations always try to portray themselves as responsible individuals who don't endanger others with their guns. I know this post will probably receive a lot of hostile responses from gun activists on this board but it needs to be said and I'm not going to back down.\"\n \n It's called individual responsibility. The father failed at it and the result was tragic. He completely ignored all the gun safety rules. The gun rights organizations did nothing wrong and neither did the sponsors or even the guy who rented them the MG. It was completely the fault of the person supervising the child; his father. The fact is all gun rights organizations stress safety first, it's not their fault some XXXXX failed to follow procedures.\n\n So he failed to follow procedure? So was one of the procedures to assist the child in holding the gun while the gun was being fired and to not stand at a distance? If that's the case then the instructor at the firing range was also partially at fault because it was also his responsibility to supervise the child. And I just found this:\n \n \"SPRINGFIELD, Mass. - Authorities in Massachusetts are considering whether criminal charges should be filed in the death of an eight-year-old boy who accidentally shot himself with an Uzi submachine-gun at a gun show. \n \n \n \"Hampden County District Attorney William Bennett says he hasn't been able to find any law that would authorize a child to possess or fire a machine-gun.\"\n Criminal charges possible in boy's Uzi death, Massachusetts authorities say - Yahoo! Canada News \n \n So not only is allowing children to fire machines guns irresponsible it may also be illegal.", 
   {}, 
   330534, 
   null, 
   1225438260.0
  ], 
  [
   330566, 
   null, 
   "Penfold", 
   " .... The gun rights organizations did nothing wrong and neither did the sponsors or even the guy who rented them the MG. It was completely the fault of the person supervising the child; his father. The fact is all gun rights organizations stress safety first, it's not their fault some XXXXX failed to follow procedures.\n\n \n So suddenly, being supervised by not one, but two law-abiding qualified (in one case an instructor!) adults is not safe? Who administered the training and qualifications of the instructor? Who drew up the regulations which allowed this to happen? Who pays lip service to \"safety\" in the use of their deadly toys?\n We constantly hear that only criminals with guns are a threat, and the law-abiding gun owner is a paragon of rational safe behaviour. This is all too obviously not so.", 
   {}, 
   330534, 
   null, 
   1225461420.0
  ], 
  [
   330571, 
   null, 
   "Omegamon_X", 
   "This is the kind of reasoning that got the child killed. The child was supervised by an adult the entire time and still ended up getting killed. Adult supervision isn't enough if the child can't physically handle the recoil of the gun being fired.\n\n \n We already know that. Move onto a more relevant point.", 
   {}, 
   330530, 
   null, 
   1225464420.0
  ], 
  [
   330572, 
   null, 
   "Omegamon_X", 
   "I have a difficult time understanding why gun rights organizations would support and sponsor events where children can fire automatic weapons especially since people in such organizations always try to portray themselves as responsible individuals who don't endanger others with their guns. I know this post will probably receive a lot of hostile responses from gun activists on this board but it needs to be said and I'm not going to back down when lives are at stake.\n\n \n The event was for charity, run by a police chief.\n \n Besides, accidents happen, they're unavoidable. Accidents shouldn't be the measuring stick that's used for deciding the legality of something.", 
   {}, 
   330533, 
   null, 
   1225464540.0
  ], 
  [
   330573, 
   null, 
   "Omegamon_X", 
   "So he failed to follow procedure? So was one of the procedures to assist the child in holding the gun while the gun was being fired and to not stand at a distance? If that's the case then the instructor at the firing range was also partially at fault because it was also his responsibility to supervise the child. And I just found this:\n \n \"SPRINGFIELD, Mass. - Authorities in Massachusetts are considering whether criminal charges should be filed in the death of an eight-year-old boy who accidentally shot himself with an Uzi submachine-gun at a gun show. \n \n \n \"Hampden County District Attorney William Bennett says he hasn't been able to find any law that would authorize a child to possess or fire a machine-gun.\"\n Criminal charges possible in boy's Uzi death, Massachusetts authorities say - Yahoo! Canada News \n \n So not only is allowing children to fire machines guns irresponsible it may also be illegal.\n\n \n When does operating count as possession? If it was illegal shouldn't the police chief who ran the fair know about it?", 
   {}, 
   330536, 
   null, 
   1225464720.0
  ], 
  [
   330574, 
   null, 
   "Omegamon_X", 
   "So suddenly, being supervised by not one, but two law-abiding qualified (in one case an instructor!) adults is not safe? Who administered the training and qualifications of the instructor? Who drew up the regulations which allowed this to happen? Who pays lip service to \"safety\" in the use of their deadly toys?\n We constantly hear that only criminals with guns are a threat, and the law-abiding gun owner is a paragon of rational safe behaviour. This is all too obviously not so.\n\n \n So now anytime you don't like something, you're going to whine and bemoan it until there's a law passed that makes it illegal, so it can't possibly ever happen again?\n \n Where does a mentality like that stop? Are you going to push for it to be illegal for a parent to let their child go out and play without first applying sunscreen so they don't get burned?", 
   {}, 
   330566, 
   null, 
   1225465020.0
  ], 
  [
   330603, 
   null, 
   "Charliegone", 
   "So suddenly, being supervised by not one, but two law-abiding qualified (in one case an instructor!) adults is not safe? Who administered the training and qualifications of the instructor? Who drew up the regulations which allowed this to happen? Who pays lip service to \"safety\" in the use of their deadly toys?\n We constantly hear that only criminals with guns are a threat, and the law-abiding gun owner is a paragon of rational safe behaviour. This is all too obviously not so.\n\n \n It's not the instructors fault. If the father knew his child couldn't handle it, he should have said so and the instructor would have helped. My guess is the father said \"he'll be ok.\" and the kid ended up shooting himself. As for you \"law abiding gun owner\" being a threat. Look up accidental deaths by firearm. Far more children die of poisoning and drowning then by firearm discharge. So yeah gun owners for the most part are responsible human beings.", 
   {}, 
   330566, 
   null, 
   1225481220.0
  ], 
  [
   330680, 
   null, 
   "TRIGGER", 
   "I have to this point been reluctant to join this thread. I am not going to debate in this I only want to set the facts strait don't try to sucker me in I will not bite.\n \n I am a firearms safety instructor and have extensive knowledge and experience with the particular type of gun that along with other factors facilitated this accident. Most if not all senseless accidents are not caused by a single event but by the culmination of a chain of factors, this one was no different. Had any one of the factors had been broken in the chain this boy would be alive, scared but alive. The father was the one that picked the gun thinking that the gun was small there for would be easy for the child to shoot (it was a Micro UZI). This was the first of a string of errors. The father wasn&#8217;t familiar with machine guns and would not have known the gun he picked is not a gun for an amateur to shoot let alone a child. The owner should have enquired as to who would be shooting the gun or if he did know he should have refused to let the kid shoot it and found a more appropriate one for him to shoot (the owner knows that gun better than anyone and would know that it was dangerous for any child to shoot that particular gun) error number two. The owner should have walked the gun up to the line and supervised the gun while the child shot, as it was the child was being supervised by someone who wouldn&#8217;t have known the capabilities of the child or the behavior of that gun error number three. The child was allowed to fire the gun from the hip the stock was not extended (this is just for accuracy it would have made no difference to the final out come whether it was extended or not) error number four. Had the stock been extended and shouldered the gun would have rocketed straight up in the air knocking the child to the ground he would have been bruised and scared but alive or if the gun had a barrel extension on it for the child to hold on to while firing from the hip the extension would have folded the Childs arm but it would have been slowed and would not have reached the angle to kill him and ripped the trigger out of his hand stopping the gun, he would be bruised with a sprained wrist, scared but still live. One more thing if the range officers had been educated on machine guns they would have known enough to stop it. There was a complete break down in reasonable caution and safety that caused this tragedy. The truly sad thing is it could have just as easily been a drowning or anything else that took his life and then no one would have noticed.\n \n This unfortunate accident has left others and me heart broken. I was there the day before with a number of others that had the experience to have prevented this were we there and saw the chain of events start. I don't think anyone of us would have hesitated to step in and take the bullet for him I know I would have.", 
   {}, 
   330603, 
   null, 
   1225498920.0
  ], 
  [
   330732, 
   null, 
   "Brady", 
   "from my time in nam I know that children definitely shouldnt be handling weapons designed for soldiers but sadly the average gun nut just doesnt get it", 
   {}, 
   330680, 
   null, 
   1225555440.0
  ], 
  [
   330742, 
   null, 
   "Omegamon_X", 
   "from my time in nam I know that children definitely shouldnt be handling weapons designed for soldiers but sadly the average gun nut just doesnt get it\n\n \n And people who didn't serve in the army shouldn't be bragging about their Vietnam service.", 
   {}, 
   330732, 
   null, 
   1225557840.0
  ], 
  [
   330750, 
   null, 
   "Penfold", 
   "Children who get all their knowledge from the internet should thank those who won them the freedom to do so.", 
   {}, 
   330742, 
   null, 
   1225559940.0
  ], 
  [
   330751, 
   null, 
   "Omegamon_X", 
   "Children who get all their knowledge from the internet should thank those who won them the freedom to do so.\n\n \n This is the first time I've ever seen Brady mention any kind of military service, and I've looked over all of his posts here. And he brings up his \"military service\" specifically for the point of saying that children shouldn't be allowed anywhere near guns.", 
   {}, 
   330750, 
   null, 
   1225561500.0
  ], 
  [
   330917, 
   null, 
   "grizzly6626", 
   "from my time in nam I know that children definitely shouldnt be handling weapons designed for soldiers but sadly the average gun nut just doesnt get it\n\n \n Well Brady, maybe I am not your average gun nut, we have dissagreed on almost everything you have posted, but I would never have allowed my eight year old child to fire any fully auto firearm. When I was eight years old I was still shooting my bb gun, and got my first conventional firearm at about twelve years old, it was a semi-auto 22 rifle. I recieved a 12 guage single shot at about 13. I got into more powerful hunting rifles and handguns after I turned 21. This 8 year old that shot himself should never have been allowed to fire the gun that killed him, so on this we agree. But I still disagree with you on most everything else you have posted to this point, and I know in Texas this shooting would never have happened, because Texas does not hold such events, and does not allow the discharge of any firearm at gun shows.", 
   {}, 
   330732, 
   null, 
   1225725780.0
  ], 
  [
   330952, 
   null, 
   "Ethmi", 
   "Galileo, have you ever done anything besides Cherry pick? If you can prove that this is a huge problem rather than a single, isolated incedent, then maybe you can talk.", 
   {}, 
   330917, 
   null, 
   1225742460.0
  ], 
  [
   330954, 
   null, 
   "Ethmi", 
   "from my time in nam I know that children definitely shouldnt be handling weapons designed for soldiers but sadly the average gun nut just doesnt get it\n\n \n Like I said, this is an isolated incedent, not a growing problem. It was unfortunate, but it was also uncommon. If you're going to say this is a gigantic, mega-leviathan sized problem, you've got alot of work ahead of you.", 
   {}, 
   330732, 
   null, 
   1225742580.0
  ], 
  [
   331171, 
   null, 
   "Galileo", 
   "Galileo, have you ever done anything besides Cherry pick? If you can prove that this is a huge problem rather than a single, isolated incedent, then maybe you can talk.\n\n So how many more children have to die for you to start taking the problem seriously? Sometimes one incident is enough to justify a change in policy. Look at 9/11. You could argue that terrorists flying planes into building is very unusual and that prior to 9/11 tens of thousands of planes had safely reached their destination therefore no precautions should be taken to prevent 9/11 from happening again. \n \n So what do you think should be done to prevent this tragedy from happening again? As I understand the father gave permission for his child to shoot an UZI with the understanding that his son would be closely supervised by an instructor at the gun range. The father stood at a distance and watched as his son fired an UZI with the instructor standing right next to his child. The gun did not malfunction and the rules of the gun range were followed. If these precautions were followed then what was the problem? Maybe allowing children to shoot machine guns was not such a bright idea in the first place. As Wayne Sampson, executive director of the Massachusetts Chiefs of Police Association, explains-\n \n \" 'The problem is there isn't any restriction on the age of a person who can use a weapon,' he said. 'I would not allow my 8-year-old to handle a weapon like this. I believe it's beyond their capacity, because of the velocity and recoil of the weapon.' \"\n Uzi recoils, questions echo - The Boston Globe", 
   {}, 
   330952, 
   null, 
   1225872300.0
  ], 
  [
   331173, 
   null, 
   "Charliegone", 
   "So how many more children have to die for you to start taking the problem seriously? Sometimes one incident is enough to justify a change in policy. Look at 9/11. You could argue that terrorists flying planes into building is very unusual and that prior to 9/11 tens of thousands of planes had safely reached their destination therefore no precautions should be taken to prevent 9/11 from happening again. \n \n So what do you think should be done to prevent this tragedy from happening again? As I understand the father gave permission for his child to shoot an UZI with the understanding that his son would be closely supervised by an instructor at the gun range. The father stood at a distance and watched as his son fired an UZI with the instructor standing right next to his child. The gun did not malfunction and the rules of the gun range were followed. If these precautions were followed then what was the problem? Maybe allowing children to shoot machine guns was not such a bright idea in the first place. As Wayne Sampson, executive director of the Massachusetts Chiefs of Police Association, explains-\n \n \" 'The problem is there isn't any restriction on the age of a person who can use a weapon,' he said. 'I would not allow my 8-year-old to handle a weapon like this. I believe it's beyond their capacity, because of the velocity and recoil of the weapon.' \"\n Uzi recoils, questions echo - The Boston Globe\n\n \n Drum roll please.....\n \n and the number of accidental gun deaths for the year 2005 (as there is no more recent information) are....\n \n 789! That includes adults...so you want to tell me that we should make a \"change\" of policy based on this? You are too emotional to come up with good legislation. The problem was the father is XXXXX who failed to inform any one that his son couldn't handle such firearm. It is no one but his fault.\n \n BTW, since you are so inclined in making \"policy\" changes..how about we start with pools? 3,582 drowning deaths...far more than firearm deaths.", 
   {}, 
   331171, 
   null, 
   1225872660.0
  ], 
  [
   331175, 
   null, 
   "Galileo", 
   "Drum roll please.....\n \n and the number of accidental gun deaths for the year 2005 (as there is no more recent information) are....\n \n 789! That includes adults...so you want to tell me that we should make a \"change\" of policy based on this?\n\n I was referring specifically to the policy of allowing children to shoot machine guns. Stay on topic. \n \n \n\n You are too emotional to come up with good legislation. The problem was the father is XXXXX who failed to inform any one that his son couldn't handle such firearm. It is no one but his fault.\n\n Your name calling makes you sound like you're the one that is too emotional. The father entrusted his son to the care of an expert trained in the use of the 9-mm Micro Uzi machine gun and had no reason to believe that his child was less capable of shooting such a weapon than the average 8 year old. So if he was negligent it was only because he was allowing a young child to shoot such a weapon but that also means the gun club was also negligent because they also allowed it. The gun club was advertizing this event as having \"no age limit or licenses required to shoot machine guns.\" \n \n \n \n\n BTW, since you are so inclined in making \"policy\" changes..how about we start with pools? 3,582 drowning deaths...far more than firearm deaths.\n\n Not a good comparison. Which is more dangerous per minute of use? I'll bet children spend a lot more time swimming than shooting machine guns.", 
   {}, 
   331173, 
   null, 
   1225874940.0
  ], 
  [
   331183, 
   null, 
   "Brady", 
   "One more thing if the range officers had been educated on machine guns they would have known enough to stop it. There was a complete break down in reasonable caution and safety that caused this tragedy.\n\n so those range officers were like omega \n they werent educated enough about guns to know that an 8 year old shooting a machine gun isnt like a 16 year old driving a car", 
   {}, 
   330680, 
   null, 
   1225892100.0
  ], 
  [
   331196, 
   null, 
   "Omegamon_X", 
   "So how many more children have to die for you to start taking the problem seriously? Sometimes one incident is enough to justify a change in policy. Look at 9/11. You could argue that terrorists flying planes into building is very unusual and that prior to 9/11 tens of thousands of planes had safely reached their destination therefore no precautions should be taken to prevent 9/11 from happening again.\n\n \n How about you quit making a big damn deal out of one single accident already.\n \n You wanna go off on how this is grounds for changing the laws in America? Well that door works both ways, I can just as easily make a counterargument. I could easily point out how many people are killed by criminals because they aren't armed and able to fight back, and that could be seen as grounds for removing the restrictive gun laws we have in this country.", 
   {}, 
   331171, 
   null, 
   1225899540.0
  ], 
  [
   331197, 
   null, 
   "Omegamon_X", 
   "so those range officers were like omega \n they werent educated enough about guns to know that an 8 year old shooting a machine gun isnt like a 16 year old driving a car\n\n \n Accidents happen, people die, it's a part of living in the real world. Get over it!", 
   {}, 
   331183, 
   null, 
   1225899660.0
  ], 
  [
   331232, 
   null, 
   "Ethmi", 
   "So how many more children have to die for you to start taking the problem seriously? Sometimes one incident is enough to justify a change in policy. Look at 9/11. You could argue that terrorists flying planes into building is very unusual and that prior to 9/11 tens of thousands of planes had safely reached their destination therefore no precautions should be taken to prevent 9/11 from happening again. \n \n So what do you think should be done to prevent this tragedy from happening again? As I understand the father gave permission for his child to shoot an UZI with the understanding that his son would be closely supervised by an instructor at the gun range. The father stood at a distance and watched as his son fired an UZI with the instructor standing right next to his child. The gun did not malfunction and the rules of the gun range were followed. If these precautions were followed then what was the problem? Maybe allowing children to shoot machine guns was not such a bright idea in the first place. As Wayne Sampson, executive director of the Massachusetts Chiefs of Police Association, explains-\n \n \" 'The problem is there isn't any restriction on the age of a person who can use a weapon,' he said. 'I would not allow my 8-year-old to handle a weapon like this. I believe it's beyond their capacity, because of the velocity and recoil of the weapon.' \"\n Uzi recoils, questions echo - The Boston Globe\n\n \n The emotion has no appeal to me. You're still just trying to weep your veiws into my soul. It doesn't work, it's emotion, not fact. It changes nothing. It's speculation. It's something similar to this:\n \n \n\n You: A kid got shot!\n Me: Yeah, but that's just one incendent.\n You: You vile, heartless dirtbag! How many more have to die before you take this seriously?\n \n\n \n Weeping doesn't change anything. It's still just one incedent. Why are you so sure that more will suffer that fate? What makes you think safety precautions weren't taken following this incedent? Anything?\n \n Let me repeat myself:\n \n This is one time; one time. One person, not thousands like your 9-11 analogy.\n \n If you want to prove that this is a huge, gigantic problem, then you've got much work ahead of you.", 
   {}, 
   331171, 
   null, 
   1225915500.0
  ], 
  [
   331667, 
   null, 
   "Brady", 
   "Accidents happen, people die, it's a part of living in the real world. Get over it!\n'\n an accident that wouldnt have happened if the people at the gun range had been more educated about guns, but youre arent interested in saving childrens lives and think we just have just have to accept it", 
   {}, 
   331197, 
   null, 
   1226147640.0
  ], 
  [
   331671, 
   null, 
   "Penfold", 
   "It's a natural consequence in his eyes. The price paid by innocent others in support of the gun nut's overarching desire.", 
   {}, 
   331667, 
   null, 
   1226153280.0
  ], 
  [
   331672, 
   null, 
   "Brady", 
   "It's a natural consequence in his eyes. The price paid by innocent others in support of the gun nut's overarching desire.\n\n yup, they think their rights are more important than others rights", 
   {}, 
   331671, 
   null, 
   1226154780.0
  ], 
  [
   331678, 
   null, 
   "NATO 556", 
   "Mr. Penfold, Mr. Brady-\n \n While I do value human life, I don't believe that we should be obsessed with saving a single individual, to the point that we're willing to take extreme measures just to try and protect the life of one person.\n \n I came from Britain where the mindset was \"if it prevents the life of a single person, then we'll take away anything we possibly can to do it\" and I can tell you that it simply doesn't work. There was even an effort by parliament to ban step ladders because too many people were falling from too great a height and dying.\n \n Yes this is a tragic accident, that can't be denied. But if you wish to talk about accidents, how many innocent people are mistakenly shot and killed by the police each year? Surely if protecting a single life is so important to you, you'd be pushing for the police to be as unarmed as our police, correct?\n \n Or...maybe you don't care about protecting lives, maybe you just care about exploiting the dead to make to try and advance your agendas. One of the most common, and most hated lines that I hear when supporters of gun control speak is \"Think of the children!\" yet if no children were dying, you wouldn't care about them, you wouldn't worry about them, and you wouldn't try and conjure up fear mongering tactics such as this.\n \n I honestly doubt that any of you truly care about saving the lives of children, otherwise you'd be pushing for a nationwide ban on swimming pools since the CDC statistics show that you're far more likely to drown than be killed with a bullet.", 
   {}, 
   331672, 
   null, 
   1226161080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Child shoots himself with a machine gun at a gun show", 
  "url": "http://www.4forums.com/political/gun-control-debates/11855-child-shoots-himself-machine-gun-gun-show.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11855, 
  "discussion_files": [
   [
    "15851.html", 
    "http://www.4forums.com/political/gun-control-debates/11855-child-shoots-himself-machine-gun-gun-show-print.html"
   ], 
   [
    "15852.html", 
    "http://www.4forums.com/political/gun-control-debates/11855-child-shoots-himself-machine-gun-gun-show-4-print.html"
   ], 
   [
    "15853.html", 
    "http://www.4forums.com/political/gun-control-debates/11855-child-shoots-himself-machine-gun-gun-show-3-print.html"
   ], 
   [
    "15854.html", 
    "http://www.4forums.com/political/gun-control-debates/11855-child-shoots-himself-machine-gun-gun-show-2-print.html"
   ]
  ], 
  "identifier": 11855
 }
]