[
 [
  [
   330286, 
   null, 
   "isly ilwott", 
   "The LA Times refuses to release avideo tape showing Barack Obama praising and proposing a toast to yet another terrorist. Why does the LA Times withhold such things from the voting public?\n \n I can answer that. It's because the publishers want Obama elected in spite of his terrorist associations.\n \n Obama is a socialist. Obama likes to think he can reorganize the world with his silver tongue. Obama has many fools fooled.", 
   {
    "post_info": {
     "post_title": "The LA times and the Obama/Terrorist Tape"
    }
   }, 
   null, 
   null, 
   1225318380.0
  ], 
  [
   330291, 
   null, 
   "Archangel", 
   "The LA Times refuses to release avideo tape showing Barack Obama praising and proposing a toast to yet another terrorist. Why does the LA Times withhold such things from the voting public?\n \n I can answer that. It's because the publishers want Obama elected in spite of his terrorist associations.\n \n Obama is a socialist. Obama likes to think he can reorganize the world with his silver tongue. Obama has many fools fooled.\n\n \n But what does it say about a News Organization when they abandon their reason for existing which was at one time to disseminate the truth for public consumption without concern for who it hurt? And how scary is it when they are able to bury such information which carries with it such serious implications for this Country when the man being protected is running for the most powerful position on Earth as America's Commander in Chief. That is truly so disturbing about this type of cover up.\n \n It's as if these people are so ethically challenged that they believe that if they hide this info, it wont be an issue in reality in the way he represents us if he were to actually win the election. I repeat my siggy for punctuation as it expresses what this story represents for America today. Thanks for posting this reminder isly.\n \n A great civilization is not conquered from without, until it destroys itself from within.-Durant", 
   {}, 
   330286, 
   null, 
   1225319880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The LA times and the Obama/Terrorist Tape", 
  "url": "http://www.4forums.com/political/elections-debates/11864-la-times-obama-terrorist-tape.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11864, 
  "discussion_files": [
   [
    "17118.html", 
    "http://www.4forums.com/political/elections-debates/11864-la-times-obama-terrorist-tape-print.html"
   ]
  ], 
  "identifier": 11864
 }
]