[
 [
  [
   330319, 
   null, 
   "Jim Colyer", 
   "YOGA MADE EASY - HOWARD KENT\n http://jimcolyer.com/papers/entry?id=119\n \n I looked for a yoga book to review for my site and decided on this one. Yoga expert Howard Kent offers a program of yoga postures with pictures of men and women demonstrating them. Kent touches on some of the philosophy which accompanies yoga while steering clear of Oriental religions. Kent founded the Yoga for Health Foundation. He died in 2005 at age 85. \n \n Yoga is about unity: body, brain and mind working as one. It is about a healthy lifestyle. It is about letting go and relaxing. It is about achieving balance, moderation in eating and sleeping, the middle path in sexual matters. Yoga is discipline, controlling your thoughts. It is peace of mind. Hatha yoga is practised in the west. It utilizes positions called asanas. Pranayama has to do with breathing and breath control. Control is always the key, and we all want and need to be in control. The spine plays a major role in yoga. The spine needs to be kept flexible. Muscle groups are stretched upward, forward, backward and sideways. Stretching should be smooth, not jerky. Asanas can be held 20-30 seconds. \n \n There should be no constrictions at the waist when doing the asanas. Nudity may be best. Use a mat and a pillow for the neck and head. You must have ample room. Peace and quiet. Wait two hours following meals. Follow the program suited to your own needs. Mental and physical balance are central to yoga. Postures are followed by counter-postures. Slow progression is a key. \n \n Many of the asanas in Kent's book are different from the ones I do. I developed my routine when I was 22. I have had to modify it since I am now in my 60s. \n \n Kent writes about the Cobra. The Cobra opens the chest and abdomen while stretching the front part of the body. \n \n The Triangle can be extended to include sideways movement. Run your hands down each leg. Hold the free hand in the air with the lead leg and foot turned outward. \n \n I could do the Plow at 22. Barely. I would not try it now. But there are asanas I can do. I can do the Bridge. Back, butt and thighs are raised. Hands give support. Relieve lower back stiffness. \n \n Kent dwells on visualization and retaining images too much. There is nothing to gain by visualizing a blue sky or a wild goose. \n \n Uttering \"Om\" and expecting results is downright silly. Chakras (energy centers) are not real. And there is no way I am going to stare at a candle. \n \n Any author sets himself up as an authority. He assumes that he \"knows\" and that his readers are to be taught. In no way is the thinking or general approach to life in India superior to that in the west. On the contrary, life in the United States and Europe is vastly more desirable than life in India. Take what yoga has to offer, which is essentialy a series of exercises designed to maintain general health. Go light on the background. Do not run counter to science and common sense.", 
   {
    "post_info": {
     "post_title": "Yoga Made Easy"
    }
   }, 
   null, 
   null, 
   1225331160.0
  ], 
  [
   354541, 
   null, 
   "tuvw888", 
   "&#36825;&#26159;&#26032;&#21152;&#30340;&#31354;&#30333;&#25991;&#31456;30&#65292;&#21487;&#20197;&#22312;ubb&#21487;&#35270;&#21270;&#32534;&#36753;&#22120;&#20013;&#65292;&#28155;&#21152;&#21644;&#20462;&#25913;&#25991;&#31456;&#20869;&#23481;&#12290;", 
   {
    "post_info": {
     "post_title": "&#26032;&#21152;&#30340;&#31354;&#30333;&#25991;&#31456;30"
    }
   }, 
   330319, 
   null, 
   1242932280.0
  ], 
  [
   354603, 
   null, 
   "kateflora", 
   "to lead a healthy as well as wealthy life, if u do yoga daily its a mental releaf in a day today life do asanas regularly and do meditation also it lead our life in a soft and smoothy way..............", 
   {
    "post_info": {
     "post_title": "hello"
    }
   }, 
   354541, 
   null, 
   1242977820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Yoga Made Easy", 
  "url": "http://www.4forums.com/political/health-debates/11867-yoga-made-easy.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 11867, 
  "discussion_files": [
   [
    "7725.html", 
    "http://www.4forums.com/political/health-debates/11867-yoga-made-easy-print.html"
   ]
  ], 
  "identifier": 11867
 }
]