[
 [
  [
   330390, 
   null, 
   "obvious_child", 
   "Who are you voting for/ have voted for?", 
   {
    "post_info": {
     "post_title": "Who are you voting for/ have voted for?"
    }
   }, 
   null, 
   null, 
   1225358700.0
  ], 
  [
   330394, 
   null, 
   "snakespit", 
   "You forgot my candidates,__________and____________.", 
   {}, 
   330390, 
   null, 
   1225368960.0
  ], 
  [
   330396, 
   null, 
   "snakespit", 
   "By the way, how does anyone in the green party expect to be taken seriously when they run Cynthia McKinney? \n \n (For those who don't recall, McKinney is one of those notable structural engineers who theorized that 9/11 must have been an inside job, because there is no way a fire could have softened or melted steel. How the bloody hell does she think they make it? emoticon_rolleyes)", 
   {}, 
   330394, 
   null, 
   1225369500.0
  ], 
  [
   330420, 
   null, 
   "Jo Bennett", 
   "I didn't think the US Green party, unlike its European counterparts, expected anyone to take it seriously.", 
   {}, 
   330396, 
   null, 
   1225384860.0
  ], 
  [
   330442, 
   null, 
   "isly ilwott", 
   "I will be voting for every Republican candidate on my ballot. This will be the first time in twenty years I have voted for a single party.\n \n The D's and R's are the only parties with a chance of winning the Presidency. If the D's get a 60 seat Senate, they will have a blank check to ruin the country with their socialism and corruption.\n \n You can count on the Democrats to do one thing for you...they will continue to lie to and deceive the Amnerican public with twisted half truths and outright lies...so help them God.", 
   {
    "post_info": {
     "post_title": "Vote Republican!!!"
    }
   }, 
   330420, 
   null, 
   1225393440.0
  ], 
  [
   330444, 
   null, 
   "isly ilwott", 
   "By the way, how does anyone in the green party expect to be taken seriously when they run Cynthia McKinney? \n \n (For those who don't recall, McKinney is one of those notable structural engineers who theorized that 9/11 must have been an inside job, because there is no way a fire could have softened or melted steel. How the bloody hell does she think they make it? emoticon_rolleyes)\nThe Green Party is a front for the Communist Party. With the stigma attached to their real name, they had to attach to some other cause. Environmentalism is essentially anti-capitalism. Cynthia is a long-time communist supporter.", 
   {}, 
   330396, 
   null, 
   1225393620.0
  ], 
  [
   330474, 
   null, 
   "trebor", 
   "I will be voting for every Republican candidate on my ballot. This will be the first time in twenty years I have voted for a single party.\n \n The D's and R's are the only parties with a chance of winning the Presidency. If the D's get a 60 seat Senate, they will have a blank check to ruin the country with their socialism and corruption.\n \n You can count on the Democrats to do one thing for you...they will continue to lie to and deceive the Amnerican public with twisted half truths and outright lies...so help them God.\n\n \n As opposed to the Republicans, who ruined it for the last 8 years with corporate welfare and corruption.", 
   {}, 
   330442, 
   null, 
   1225404300.0
  ], 
  [
   330475, 
   null, 
   "trebor", 
   "The Green Party is a front for the Communist Party. With the stigma attached to their real name, they had to attach to some other cause. Environmentalism is essentially anti-capitalism. Cynthia is a long-time communist supporter.\n\n \n Yet, if you look at who started much of the environmentalist things, it was under Nixon, a die hard republican. \n \n The paranoia and misrepresentation of this viewpoint is one reason I won't be voting republican for a long long time.\n \n Mind you, while Cynthia McKinney does look like a wack job, I don't see any evidence she was a communist.", 
   {}, 
   330444, 
   null, 
   1225405380.0
  ], 
  [
   330489, 
   null, 
   "foundit66", 
   "Voting Obama/Biden.\n McCain doesn't have a clue on what to do beyond attack, and his mishandling of his campaign (and his selection of the clueless hockey mom in chanel) only demonstrate that he can't handle being president...\n I would have been more interested in McCain in 2000. Maybe 2004.\n But he's past his shelf-life expiration date in 2008.", 
   {}, 
   330475, 
   null, 
   1225411320.0
  ], 
  [
   330502, 
   null, 
   "Steeeeve", 
   "(For those who don't recall, McKinney is one of those notable structural engineers who theorized that 9/11 must have been an inside job, because there is no way a fire could have softened or melted steel. How the bloody hell does she think they make it? emoticon_rolleyes)\nAnybody with a brain knows that once you form steel you can't melt it! I mean come on...if they could do that then wouldn't we have some sort of program that reuses or recycles metals to form other products? Geesh, you really dropped the ball here.\n \n But yeah, McKinney is an #####.\n \n In any event. I voted with Symbiote and went Constitutional party. The McBama/Padin ticket just smells of increased spending and more debt.", 
   {}, 
   330396, 
   null, 
   1225417800.0
  ], 
  [
   330506, 
   null, 
   "ShadowPikachu", 
   "Already voted (absentee). Hopefully help my candidate win my state of Missouri.\n \n Voted McCain - First time I've voted Republican ever (I'm a moderate Democrat). Just don't trust Obama or like his policies (like his retarded plan to raise the taxes of a large number of people - we'll see the ruination of small business under him, not to mention we've seen already what happens when someone raises taxes in a recession: his name was Hoover and you can check out what happened by looking up the time called \"Great Depression\")", 
   {}, 
   330390, 
   null, 
   1225418820.0
  ], 
  [
   330575, 
   null, 
   "unkerpaulie", 
   "You guys are so right! Everybody knows that when you put steel on fire the steel melts. Duh, you don't need to be an engineer to know that. \n \n I would love to see Obama implement his health care and education plans and get us out of iraq in his first term. He'll probably have his hands full doing that while dodging assasination attempts.", 
   {}, 
   330506, 
   null, 
   1225466580.0
  ], 
  [
   330600, 
   null, 
   "simone", 
   "Unfortunately, steel melts, depending upon which alloy of steel it happens to be:\n \nWhat's the melting point of steel?\n That depends on the alloy of steel you are talking about. The term alloy is almost always used incorrectly these days, especially amongst bicyclists. They use the term to mean aluminum. What the term alloy really means is a mixture of metals, any kind of metals. Almost all metal used today is a mixture and therefore an alloy.\n \n Most steel has other metals added to tune its properties, like strength, corrosion resistance, or ease of fabrication. Steel is just the element iron that has been processed to control the amount of carbon. Iron, out of the ground, melts at around 1510 degrees C (2750°F). Steel often melts at around 1370 degrees C (2500°F).\n \n Author:\n \n Brian Kross, Chief Detector Engineer\n\n What's the melting point of steel?\n \n Just a few facts and figures for the unscientific.", 
   {}, 
   330575, 
   null, 
   1225479600.0
  ], 
  [
   330611, 
   null, 
   "isly ilwott", 
   "Anybody with a brain knows that once you form steel you can't melt it! I mean come on...if they could do that then wouldn't we have some sort of program that reuses or recycles metals to form other products? Geesh, you really dropped the ball here.\n \n .......\nThe fact that steel objects can be re-melted is staring you in the face. How do you think they recycle old cars?....They melt them. Steel will lose its strength and warp like a piece of licorice candy when heated enough. When it gets red hot, it bends with less force applied than when cold.\n \n Cutting torches work by melting a small puddle of steel and then blowing it away with a high pressure stream of oxygen. It is quite simple to melt steel after it is made.\n \n Where did you get the idea that it can't be done?\n \n ...or were you being undetectably facetious?", 
   {}, 
   330502, 
   null, 
   1225484340.0
  ], 
  [
   330621, 
   null, 
   "Jo Bennett", 
   "He was actually being fairly obviously facetious...", 
   {}, 
   330611, 
   null, 
   1225486620.0
  ], 
  [
   330691, 
   null, 
   "Baron", 
   "Unfortunately, steel melts, depending upon which alloy of steel it happens to be:\n \n What's the melting point of steel?\n \n Just a few facts and figures for the unscientific.\n\n \n There are times when you can be quite useful. Just stay away from politics.\n \n Happy Halloween", 
   {
    "post_info": {
     "post_title": "Thank you Simone."
    }
   }, 
   330600, 
   null, 
   1225503300.0
  ], 
  [
   330715, 
   null, 
   "unkerpaulie", 
   "Simone, unfortunately your scientific facts are useless in political debates. Once you become more in line with political mentality you'll understand how easy it is to produce molten steel from flames at 1500 F.", 
   {}, 
   330691, 
   null, 
   1225516800.0
  ], 
  [
   330731, 
   null, 
   "simone", 
   "Baron, you mean I'm not emotional and childish enough to discuss politics?", 
   {}, 
   330715, 
   null, 
   1225555140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Who are you voting for/ have voted for?", 
  "url": "http://www.4forums.com/political/elections-debates/11870-who-you-voting-have-voted.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11870, 
  "discussion_files": [
   [
    "1965.html", 
    "http://www.4forums.com/political/elections-debates/11870-who-you-voting-have-voted-print.html"
   ], 
   [
    "1966.html", 
    "http://www.4forums.com/political/elections-debates/11870-who-you-voting-have-voted-2-print.html"
   ]
  ], 
  "identifier": 11870
 }
]