[
 [
  [
   330792, 
   null, 
   "obvious_child", 
   "Reagan backed the Earned Income Tax Credit, which takes monies often taken from the taxes of the rich and gives it to specific working poor.\n \n That's wealth redistribution. \n \n \"Reagan's Liberal Legacy\" by Joshua Green\n \n So why, if Obama supports wealth redistribution, isn't Reagan a Marxist too? emoticon_xgood emoticon_rolleyes\n \n Or is because the fools tossing out the term \"Marxist\" have no idea what it means?", 
   {
    "post_info": {
     "post_title": "If Obama's a Marxist for wealth Redistribution, why isn't Reagan too?"
    }
   }, 
   null, 
   null, 
   1225596420.0
  ], 
  [
   331000, 
   null, 
   "isly ilwott", 
   "Reagan backed the Earned Income Tax Credit, which takes monies often taken from the taxes of the rich and gives it to specific working poor.\n \n That's wealth redistribution. \n \n \"Reagan's Liberal Legacy\" by Joshua Green\n \n So why, if Obama supports wealth redistribution, isn't Reagan a Marxist too? emoticon_xgood emoticon_rolleyes\n \n Or is because the fools tossing out the term \"Marxist\" have no idea what it means?\nObama is a Marxist.\n \n Read all about it.\n \n \n No Pundit Intended - Why Exposing Obama Marxism Won&#8217;t Work\n \n Why Exposing Obama Marxism Won't Work\n by Joel Gaines\n June 16th, 2008\n Of late, there have been a number of articles and blog posts pointing to the evidence of Barak Obama's Marxist political theory. It is interesting, to say the least, but it is also going to be completely ineffective as a tool to defeat him in November.\n I am not debating that Obama is a Marxist. His own words and associations reflect a long-held belief in class struggle, liberation theology, and alienation of those who produce vs. the owners of the production. I am also not trying to define Obama's Marxism - mostly because we don't call it Marxism anymore. Marx himself has become irrelevant to the 31 flavors of \"Marxism\", which have evolved in various places across the world. That Obama leans toward a \"Marxist\" view of the world is easy to see for anyone who chooses to remove the rose-tinted lenses.\n \n \n \n \n \n \n \n American Thinker: Another Obama Marxist\n \n \n Barack Obama has a thing for Marxists. He befriends them, listens to their counsel, and he even hires them to work in his campaign. And they seem to feel the warmth. President Daniel Ortega of Nicaragua, who led a revolution there in 1979, says Barack Obama's presidential bid is a \"revolutionary\" phenomenon, and Americans are \"laying the foundations for a revolutionary change.\" A captured computer revealed that an unknown person chatted with Marxist FARC guerillas on Obama's behalf (they believed), stating he would be the next President and US policy towards Columbia would change. Frank Marshall Davis, a dear Obama friend and mentor was as a member of the Communist Party USA. Barack Obama just seems to attract Marxists.\n \n \n \n YouTube - Barack Obama's Marxism\n \n Amazon.com: obama marxism\n \n \n Obama&#8217;s Marxism steps out of the shadows and into the public realm\n \n Meanwhile, the fawning mainstream media can add another first to what they consider their precedent-setting candidate: Obama is the first presidential candidate in history to resort to Marxism to get ahead. \n \n Finally, Obama is telling the truth about something.\n \n \n Obama's Marxism on Display... - Reformed Chicks Blabbing\n \n Global Politician - Obama favors an unholly alliance between Marxism and Islam\n Obama favors an unholly alliance between Marxism and Islam\n \n Obama and Marxism - Topic Powered by eve community\n \n Obama Affinity to Marxists Dates Back to College Days - FOXNews.com Elections\n \n Barack Obama laughs off charges of socialism. Joe Biden scoffs at references to Marxism. Both men shrug off accusations of liberalism.\n But Obama himself acknowledges that he was drawn to socialists and even Marxists as a college student. He continued to associate with Marxists later in life, even choosing to launch his political career in the living room of a self-described Marxist, William Ayers, in 1995, when Obama was 34.\n Obama's affinity for Marxists began when he attended Occidental College in Los Angeles.\n \"To avoid being mistaken for a sellout, I chose my friends carefully,\" the Democratic presidential candidate wrote in his memoir, \"Dreams From My Father.\" \"The more politically active black students. The foreign students. The Chicanos. The Marxist professors and structural feminists.\"\n Obama's interest in leftist politics continued after he transferred to Columbia University in New York. He lived on Manhattan's Upper East Side, venturing to the East Village for what he called \"the socialist conferences I sometimes attended at Cooper Union.\"\n After graduating from Columbia in 1983, Obama spent a year working for a consulting firm and then went to work for what he described as \"a Ralph Nader offshoot\" in Harlem.\n \"In search of some inspiration, I went to hear Kwame Toure, formerly Stokely Carmichael of Black Panther fame, speak at Columbia,\" Obama wrote in \"Dreams,\" which he published in 1995. \"At the entrance to the auditorium, two women, one black, one Asian, were selling Marxist literature.\"\n Obama supporters point out that plenty of Americans flirt with radical ideologies in college, only to join the political mainstream later in life. But Obama, who made a point of noting how \"carefully\" he chose his friends in college, also chose to launch his political career in the Chicago living room of Ayers, a domestic terrorist who in 2002 proclaimed: \"I am a Marxist.\"\n Also present at that meeting was Ayers' wife, fellow terrorist Bernardine Dohrn, who once gave a speech extolling socialism, communism and \"Marxism-Leninism.\"\n Obama has been widely criticized for choosing the Rev. Jeremiah Wright, an anti-American firebrand, as his pastor. Wright is a purveyor of black liberation theology, which analysts say is based in part on Marxist ideas.", 
   {
    "unicode_changes_made": true
   }, 
   330792, 
   null, 
   1225754040.0
  ], 
  [
   331024, 
   null, 
   "obvious_child", 
   "You clearly haven't got a clue:\n \n http://www.4forums.com/political/open-forum/11857-i-think-we-doomed-3.html#post331023", 
   {}, 
   331000, 
   null, 
   1225765620.0
  ], 
  [
   331031, 
   null, 
   "marc9000", 
   "You clearly haven't got a clue:\n \n http://www.4forums.com/political/open-forum/11857-i-think-we-doomed-3.html#post331023\n\n \n Two minutes later, you run and start another thread about this exact same subject?", 
   {}, 
   331024, 
   null, 
   1225766880.0
  ], 
  [
   331035, 
   null, 
   "obvious_child", 
   "Two minutes later, you run and start another thread about this exact same subject?\n\n \n Incorrect. It was a focus of a specific reply. It is not about the exact same subject. Learn to read better.", 
   {}, 
   331031, 
   null, 
   1225767000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  If Obama's a Marxist for wealth Redistribution, why isn't Reagan too?", 
  "url": "http://www.4forums.com/political/elections-debates/11888-if-obamas-marxist-wealth-redistribution-why-isnt-reagan-too.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11888, 
  "discussion_files": [
   [
    "25534.html", 
    "http://www.4forums.com/political/elections-debates/11888-if-obamas-marxist-wealth-redistribution-why-isnt-reagan-too-print.html"
   ]
  ], 
  "identifier": 11888
 }
]