[
 [
  [
   330814, 
   null, 
   "antonia", 
   "From AP,\n \n TORONTO - Sarah Palin unwittingly took a prank call Saturday from a Canadian comedian posing as French President Nicolas Sarkozy and telling her she would make a good president someday.\n \n :telephone Hear it for yourself on youtube -- Les Justiciers Masques prank call and fool Sarah Palin.\n \n YouTube - Sarah Palin prank call", 
   {
    "post_info": {
     "post_title": "Sarcozy imposter fools Palin in prank phone call"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1225617540.0
  ], 
  [
   330827, 
   null, 
   "jitobear", 
   "I don't approve.", 
   {}, 
   330814, 
   null, 
   1225641720.0
  ], 
  [
   330841, 
   null, 
   "isly ilwott", 
   "From AP,\n \n TORONTO &#8212; Sarah Palin unwittingly took a prank call Saturday from a Canadian comedian posing as French President Nicolas Sarkozy and telling her she would make a good president someday.\n \n :telephone Hear it for yourself on youtube -- Les Justiciers Masques prank call and fool Sarah Palin.\n \n YouTube - Sarah Palin prank call\nMerely proving the basic dishonesty and trickery employed in the liberal approach to politics.", 
   {}, 
   330814, 
   null, 
   1225650780.0
  ], 
  [
   330848, 
   null, 
   "T.Q", 
   "Merely proving the basic dishonesty and trickery employed in the liberal approach to politics.\n\n \n What the hell does this have to do with liberals? Absolutely nothing! This is some lame comedian who figured he'd get a little fame by playing a dumb trick on a famous person.\n \n Your idiocy is showing isly.", 
   {}, 
   330841, 
   null, 
   1225655220.0
  ], 
  [
   330849, 
   null, 
   "isly ilwott", 
   "What the hell does this have to do with liberals? Absolutely nothing! This is some lame comedian who figured he'd get a little fame by playing a dumb trick on a famous person.\n \n Your idiocy is showing isly.\nA lame, liberal, Obama supporting, comedic XXX...similar to Jay Leno of late.", 
   {}, 
   330848, 
   null, 
   1225655460.0
  ], 
  [
   330850, 
   null, 
   "iangb", 
   "It was a stupid joke to make, but to characterise it as a typical 'liberal approach to politics'? That strikes me as kinda desperate...", 
   {}, 
   330849, 
   null, 
   1225656000.0
  ], 
  [
   330858, 
   null, 
   "isly ilwott", 
   "It was a stupid joke to make, but to characterise it as a typical 'liberal approach to politics'? That strikes me as kinda desperate...\nLies and deception are the hallmarks of liberal politics. There are numerous deceptive ads being aired continually in several states claiming that Republican candidates want to put a 23% sales tax on everybody. What they leave out is the coincidental disappearance of other taxes...like income tax.\n \n This is completely deceptive and typical of liberal techniques. It is also completely expected. After all, they are appealing to the dummies of the nation.\n \n Obama and his panel of liars have said they will not increase taxes on the middle class...yet they will allow the current tax rate reductions to expire...thus increasing our taxes. That's just another example of deceptive politics.", 
   {}, 
   330850, 
   null, 
   1225662240.0
  ], 
  [
   330859, 
   null, 
   "thelmoose", 
   "This is a prank performed by a pair of Montreal radio DJs, and it's pretty typical sophomoric humor that you hear on the radio. To attribute this to some liberal dishonestly ignores a few facts.\n Her staff must be XXXXXX to not screen calls and be able to figure out this was not from the President of France.\n Sarah handles herself politely, kind of like when you are speaking to someone at a party and you have no idea what they are talking about. But, if the poor dear had a clue and got out of town now and then she should have picked up some obvious indications this was a prank:[*]the outrageous and obviously fake \"Clouseau\" French accent[*]the French President wanting to hunt with her from a helicopter[*]she didn't know the prime minister of Canada[*]\"I can see Belgium from my house\"? C'mon[*]France's answer to Joe the Plumber is Marcel with a loaf of bread under his armpitAnd so on...\n The woman is an idjit.", 
   {}, 
   330858, 
   null, 
   1225665360.0
  ], 
  [
   330862, 
   null, 
   "T.Q", 
   "Lies and deception are the hallmarks of liberal politics. There are numerous deceptive ads being aired continually in several states claiming that Republican candidates want to put a 23% sales tax on everybody. What they leave out is the coincidental disappearance of other taxes...like income tax.\n \n This is completely deceptive and typical of liberal techniques. It is also completely expected. After all, they are appealing to the dummies of the nation.\n \n Obama and his panel of liars have said they will not increase taxes on the middle class...yet they will allow the current tax rate reductions to expire...thus increasing our taxes. That's just another example of deceptive politics.\n\n \n Quit embarassing yourself already.", 
   {}, 
   330858, 
   null, 
   1225668480.0
  ], 
  [
   330905, 
   null, 
   "antonia", 
   "I don't approve.\n\n \n I approve entirely. If they were Americans, I would embrace them as true patriots. Since they're from Montreal, certainly as bearers of the torch of liberty. For if there were any question Palin is unqualified for the vice presidency, this phone call has established her gullible idiocy and ignorance beyond a reasonable doubt. It's not about the comics, it's not about poor Miss Palin, it's about the United States, the American people, the entire world, and her stupidity and lack of ability for a position of tremendous power. She's nothing more than an overdressed figurehead chosen by a desperate old corrupt fool who would jeopardize our national interests, and compromise the integrity of our Constitution, by choosing someone who can't even recognize (in a phone conversation as transparent as saran wrap) who isn't the French president. And thinks the sum total of foreign policy preparation is looking across the water at Russia.", 
   {}, 
   330827, 
   null, 
   1225699080.0
  ], 
  [
   330924, 
   null, 
   "jyoshu", 
   "Gee, I had no idea using MTV stunts was so patriotic and now as an accepted part of the political process. emoticon_rolleyes Some people really need to grow up. There's no need to use blatant dishonesty to prove anything about either candidate, and the dishonestly of the tactic is really the bottom line. Anyone can potentially fall for a dishonest prank if they are caught at the wrong time, esp. over the phone.\n \n This shouldn't even be in the news.", 
   {}, 
   330905, 
   null, 
   1225730760.0
  ], 
  [
   330926, 
   null, 
   "jitobear", 
   "Antonia - don't mistake my disapproval of the stunt for approval of the Palin. I think she is a poor, poor choice for VP and that McCain did himself damage in selecting her. I am voting Obama tomorrow. However, her character has been pretty well established. The stunt was just mean. But then I hate morning talk show DJs as a rule and find their antics beyond tedious. (Must be the grown up in me.)\n \n Isly - these were two DJs in Montreal being jack-asses. It has nothing to do with liberal politics anywhere. And have you not yet figured out that most politicians are a sack of lying snakes? Its partly our fault as constituants. We can't seem to believe that we are electing mere men in women with good and bad traits so they have to jump through hoops to make us believe they are super-heros. Few are worthy of worship or villification.\n \n I can't wait until Wednesday.", 
   {}, 
   330924, 
   null, 
   1225731600.0
  ], 
  [
   330959, 
   null, 
   "simone", 
   "Lies and deception are the hallmarks of liberal politics. There are numerous deceptive ads being aired continually in several states claiming that Republican candidates want to put a 23% sales tax on everybody. What they leave out is the coincidental disappearance of other taxes...like income tax.\n \n This is completely deceptive and typical of liberal techniques. It is also completely expected. After all, they are appealing to the dummies of the nation.\n \n Obama and his panel of liars have said they will not increase taxes on the middle class...yet they will allow the current tax rate reductions to expire...thus increasing our taxes. That's just another example of deceptive politics.\n\n The pot who calls....", 
   {}, 
   330858, 
   null, 
   1225743300.0
  ], 
  [
   330962, 
   null, 
   "antonia", 
   "Antonia - don't mistake my disapproval of the stunt for approval of the Palin. I think she is a poor, poor choice for VP and that McCain did himself damage in selecting her. I am voting Obama tomorrow. However, her character has been pretty well established. The stunt was just mean. But then I hate morning talk show DJs as a rule and find their antics beyond tedious. (Must be the grown up in me.)\n \n Isly - these were two DJs in Montreal being jack-asses. It has nothing to do with liberal politics anywhere. And have you not yet figured out that most politicians are a sack of lying snakes? Its partly our fault as constituants. We can't seem to believe that we are electing mere men in women with good and bad traits so they have to jump through hoops to make us believe they are super-heros. Few are worthy of worship or villification.\n \n I can't wait until Wednesday.\n\n \n Jitobear, I'm glad you're voting for Obama too. With all due respect, however, it's entirely the grown-up in me, as well, that approves. I don't know the talk show or DJs in question (have you listened to their Montreal program here in the U.S.?), but our politicians are vetted by a free press -- and that includes investigative journalism, and even comedic exposé. \n \n It would be mean-spirited if the media source were conveying a false impression about the candidate in question -- for example, blatantly lying and/or making up stories about a candidate's citizenship or affiliations with terrorists. Like some of the threads started on these boards, and about Obama.\n \n It's quite another thing when the media source is revealing something truthful about a candidate\"s qualifications or lack thereof for office. The person with her on the phone, \"juvenile\" in conversation, on purpose. To show how non-cognizant the candidate is -- to the extent of not being able to recognize that, a speaker greatly greatly different than Nicolas Sarcozy, isn't him at all. \n \n What kind of characters do you think a vice president has to deal with, in terms of the VP's discriminatory faculties? They have to be prepared to deal with some very sophisticated forms of swindling. These two (relatively innocent Montreal residents) handed to Palin, on a silver platter, all kinds of clues that she was being had. That's not \"jack-XXX\" or dumb at all. \"Look! This person can't even see through the most obvious con!\" Do you want this person in the second highest office?\" Making an XXX out of the United States?\n \n They dug up exactly the kind of information the media is supposed to find. If Palin can't deal with that, either, she doesn't belong in office. It's isn't about her, it isn't about them, it's about the nation and how its interests are served by a free media. If, in addition to not seeing through the most obvious forms of deception (which was the basic point established), she can't stand the heat, she should get out of the kitchen.", 
   {}, 
   330926, 
   null, 
   1225743420.0
  ], 
  [
   330970, 
   null, 
   "Ethmi", 
   "Your point is? \n \n There are many stupid posts I see that are desperate, lame attempts to attack McCain, but this isn't even an attack!", 
   {}, 
   330814, 
   null, 
   1225744020.0
  ], 
  [
   330995, 
   null, 
   "antonia", 
   "There's no need to use blatant dishonesty to prove anything about either candidate, and the dishonestly of the tactic is really the bottom line.\n\n \n Investigative journalists use deception and dishonesty regularly.\n \n \nAnyone can potentially fall for a dishonest prank if they are caught at the wrong time, esp. over the phone.\n\n \n A United States governor who doesn't know what Nicolas Sarcozy doesn't sound like doesn't belong in political office.\n \n \nThis shouldn't even be in the news.\n\n \n It most certainly should.\n \n \nSome people really need to grow up.\n\n \n Indeed.", 
   {}, 
   330924, 
   null, 
   1225751880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Sarcozy imposter fools Palin in prank phone call", 
  "url": "http://www.4forums.com/political/elections-debates/11890-sarcozy-imposter-fools-palin-prank-phone-call.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11890, 
  "discussion_files": [
   [
    "830.html", 
    "http://www.4forums.com/political/elections-debates/11890-sarcozy-imposter-fools-palin-prank-phone-call-print.html"
   ], 
   [
    "831.html", 
    "http://www.4forums.com/political/elections-debates/11890-sarcozy-imposter-fools-palin-prank-phone-call-2-print.html"
   ]
  ], 
  "identifier": 11890
 }
]