[
 [
  [
   756, 
   null, 
   "fallingupwards", 
   "ok everyone, this is your opportunity to express your opinions about ghettocracka and his racist and ignorant posts.", 
   {
    "post_info": {
     "post_title": "ghettocracka"
    }
   }, 
   null, 
   null, 
   1044325080.0
  ], 
  [
   768, 
   null, 
   "Broker", 
   "-_- Kill this post before you all break out into childlike fighting! This is not the manner in which to conduct yourselves!", 
   {}, 
   756, 
   null, 
   1044326820.0
  ], 
  [
   793, 
   null, 
   "ghettocracka", 
   "ummmmm.............ok", 
   {}, 
   756, 
   null, 
   1044334080.0
  ], 
  [
   796, 
   null, 
   "thistownwilleat", 
   "Halo. 1 on 1. Winner takes all, if Dave wins mxpx sold out.", 
   {}, 
   756, 
   null, 
   1044334140.0
  ], 
  [
   800, 
   null, 
   "ghettocracka", 
   "dave will win, therefor mxpx sold out", 
   {}, 
   756, 
   null, 
   1044334860.0
  ], 
  [
   827, 
   null, 
   "fallingupwards", 
   "i say me and ghetto have a debate tournament type thing. i'll kick his butt because he never has any clue what he is talking about", 
   {}, 
   756, 
   null, 
   1044345120.0
  ], 
  [
   833, 
   null, 
   "thistownwilleat", 
   "It wouldn't matter what it was on, it would eventually turn into socialism vs capitalism, just like every other forum you're in.", 
   {}, 
   756, 
   null, 
   1044348480.0
  ], 
  [
   836, 
   null, 
   "Broker", 
   "I hate these anger posts...", 
   {}, 
   756, 
   null, 
   1044369780.0
  ], 
  [
   846, 
   null, 
   "ghettocracka", 
   "no, i would win because fallingupwards will turn it to a politics debate, it will be an XXX whopping there", 
   {}, 
   756, 
   null, 
   1044371580.0
  ], 
  [
   847, 
   null, 
   "ghettocracka", 
   "i say we have a 1v1 brawl\n \n if i loose mxpx didnt sell out", 
   {}, 
   756, 
   null, 
   1044371760.0
  ], 
  [
   851, 
   null, 
   "fallingupwards", 
   "i have only turned one debate (it was in the abortion debate) into a politics debate. and that was only because parcum started saying that liberals are authoritarians. believe it or not, people do go off topic sometimes on this site. i've only done it once. its not like you've never done it yourself thistown.\n \n i want to debate ghetto one on one. i will kick his butt. i guarantee it.", 
   {}, 
   756, 
   null, 
   1044378000.0
  ], 
  [
   863, 
   null, 
   "Maynard", 
   "he has a right to say what he wants, and so do I.", 
   {}, 
   756, 
   null, 
   1044383400.0
  ], 
  [
   871, 
   null, 
   "ghettocracka", 
   "you start it up\n \n of course i loose because you will start talking about political XXXX, and i know XXXX about politics", 
   {}, 
   756, 
   null, 
   1044387600.0
  ], 
  [
   882, 
   null, 
   "fallingupwards", 
   "i swear i wont go off topic. and maynard is right, debaters on this site have the right to talk about whatever they want on this site. if you're unhappy with it then leave.\n \n i want an unbiased person (someone who is not from appalachian state) to select a random topic for me and ghetto to debate about. it can be about politics, religion, abortion, crime, government or whatever.", 
   {}, 
   756, 
   null, 
   1044397980.0
  ], 
  [
   888, 
   null, 
   "Broker", 
   "Capitalism vs. Socialism :)", 
   {}, 
   756, 
   null, 
   1044402000.0
  ], 
  [
   920, 
   null, 
   "ghettocracka", 
   "lol", 
   {}, 
   756, 
   null, 
   1044421200.0
  ], 
  [
   928, 
   null, 
   "debategirl88", 
   "Umm... try the war on iraq.", 
   {}, 
   756, 
   null, 
   1044421740.0
  ], 
  [
   929, 
   null, 
   "debategirl88", 
   "If thats to political for you then try school uniforms. (what I got nothin).:p", 
   {}, 
   756, 
   null, 
   1044421860.0
  ], 
  [
   963, 
   null, 
   "fallingupwards", 
   "we have to debate on a topic that we disagree about. i'm against a war in iraq. i'm against school uniforms. if ghetto is for any of these, then we could debate those topics.", 
   {}, 
   756, 
   null, 
   1044426060.0
  ], 
  [
   965, 
   null, 
   "ghettocracka", 
   "im aginst school uniformz\n war with iraq, im undecided but everyday i read about things that make me go aginst it", 
   {}, 
   756, 
   null, 
   1044426240.0
  ], 
  [
   974, 
   null, 
   "fallingupwards", 
   "hmmmmm, we gotta find something we disagree on", 
   {}, 
   756, 
   null, 
   1044428280.0
  ], 
  [
   984, 
   null, 
   "ghettocracka", 
   "this ususally isnt a problem", 
   {}, 
   756, 
   null, 
   1044458400.0
  ], 
  [
   1008, 
   null, 
   "Broker", 
   "Maybe your war view will change if you watched Powell today.", 
   {}, 
   756, 
   null, 
   1044472620.0
  ], 
  [
   1017, 
   null, 
   "fallingupwards", 
   "or maybe not\n \n maybe your war view will change if you stop listening to all that conservative propoganda", 
   {}, 
   756, 
   null, 
   1044483360.0
  ], 
  [
   1019, 
   null, 
   "Broker", 
   "So none of that was true? It was fake photos and tapes? You'd make a nice press agent for Iraq... \"lies complete with stunts\"", 
   {}, 
   756, 
   null, 
   1044484260.0
  ], 
  [
   1356, 
   null, 
   "debategirl88", 
   "fjrfjfjdl;ljv;ldkj ;lekfjd;lkj d;lkvj dl;kj ;dlkj ;ljk lkejf ;lkej l;kejf l;ekj;lkjdsl;k d;klfj lfjffffffffffffffffffqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqwertyuiiopasdfghjklzxcvbnmqwertyuiopasdfghjklzxcvbnm,qwertyuiopasdfghjklzxcvbmdflkjd'lkfj ;lkjfdl;kj kljfdslkfj d;lfjk ;lkfj ;lskj ;lkj l;kj l;skjc lkdjf lkjdf lkjdflkejfsdlkjvdslkf jds;lkv jdl lkfjdl;jk sel;k dvkdv ;livndk frdlfkmesd\n \n SORRY EXTREME BOREDNESS!!!!! :o :o :o :o", 
   {}, 
   756, 
   null, 
   1044682140.0
  ], 
  [
   1399, 
   null, 
   "debategirl88", 
   "I think we sahould have a debate tournament between Broker and Jon. lol!", 
   {}, 
   756, 
   null, 
   1044732960.0
  ], 
  [
   1402, 
   null, 
   "Broker", 
   "It would always turn into socialism vs capitalism!", 
   {}, 
   756, 
   null, 
   1044734340.0
  ], 
  [
   1415, 
   null, 
   "debategirl88", 
   "that's true. lol!", 
   {}, 
   756, 
   null, 
   1044743880.0
  ], 
  [
   1902, 
   null, 
   "sarablaze", 
   "Falling, go hug a tree.", 
   {}, 
   756, 
   null, 
   1045130100.0
  ], 
  [
   1908, 
   null, 
   "Broker", 
   "He probably will... It's like Al Gore...giving the government's budget to a really old tree!", 
   {}, 
   756, 
   null, 
   1045147200.0
  ], 
  [
   1911, 
   null, 
   "fallingupwards", 
   "whats wrong with protecting our environment? as a christian, i think its very important to protect the environment. is it wrong to get mad when a whole forest is torn down in order to build another super-walmart?? and i think giving part of the governments budget to help save old forests is a good idea, broker.", 
   {}, 
   756, 
   null, 
   1045149840.0
  ], 
  [
   1915, 
   null, 
   "thistownwilleat", 
   "Agreed. I read a book once that compared American (well really world) culture and the state of humanity to the first men trying to fly. At first you feel like your flying and then you realize that you're in a nosedive, but all people say is \"It's gotten us this far, we can't bail out now.\" And then you hit the ground. That's where we're heading. Everytime a problem arises we'll say, \"We just need an invention to counter the negative effects.\" Problem is we never find them.\n \n And I hate cities, give me Spruce Pine, North Carolina anyday to some soul-less concrete jungle. There is no \"tree hugging\", I think as you so intelligently put it, to that. I don't remember what movie it was but it compared human beings to a virus, and I believe that in some sense we are. We come to this planet, somehow see it as our God-given right to destroy it, to conquer it, and then die. We are not the cure.", 
   {}, 
   756, 
   null, 
   1045157520.0
  ], 
  [
   1921, 
   null, 
   "sarablaze", 
   "So in a way: i just gave you guys your debate!", 
   {}, 
   756, 
   null, 
   1045172040.0
  ], 
  [
   1941, 
   null, 
   "Cool Hand Dave", 
   "this would indeed be a new topic for debate. something i haven't seen on here before. and i think that rarely happens", 
   {}, 
   756, 
   null, 
   1045181820.0
  ], 
  [
   1959, 
   null, 
   "fallingupwards", 
   "start a new thread in the environmental forum", 
   {}, 
   756, 
   null, 
   1045188840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  ghettocracka", 
  "url": "http://www.4forums.com/political/fun-debates/119-ghettocracka.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 119, 
  "discussion_files": [
   [
    "13017.html", 
    "http://www.4forums.com/political/fun-debates/119-ghettocracka-print.html"
   ], 
   [
    "13018.html", 
    "http://www.4forums.com/political/fun-debates/119-ghettocracka-3-print.html"
   ], 
   [
    "13019.html", 
    "http://www.4forums.com/political/fun-debates/119-ghettocracka-2-print.html"
   ]
  ], 
  "identifier": 119
 }
]