[
 [
  [
   331148, 
   null, 
   "foundit66", 
   "Thousands of voters whose citizenship has been questioned should receive letters from the state this week telling them they may have to vote with a &#8220;challenged&#8221; paper ballot on Election Day.\n \n On Wednesday, Secretary of State Karen Handel&#8217;s office sent letters to 4,770 registered voters believed to be noncitizens, Handel said in an interview Wednesday.\n \n Handel&#8217;s office decided to send out the letters &#8220;as expeditiously as possible&#8221; to comply with a judge&#8217;s order, said Matt Carrothers, a spokesman for Handel.\n \n Previously, it was up to each county to look up people whose citizenship was considered questionable and send them a letter. Many counties stopped this process after the U.S. Department of Justice questioned it this month, saying it had not been cleared in advance.\n \n The secretary of state&#8217;s office verifies citizenship by checking voter registration application information against records held by the Georgia Department of Driver Services.\n \n A panel of federal judges this week ordered Handel&#8217;s office to come up with a way of alerting those whose status has been questioned and allowing them to vote in some way on Election Day.\n \n Those whose citizenship is in question can go to a county elections office before Election Day and produce documents proving their citizenship and resolve the issue, Carrothers said.\n \n The letter from Handel&#8217;s office tells the voters that if they appear at their polling place with the issue still unresolved, they will be given a &#8220;challenge&#8221; ballot &#8212;- a paper version of the ballot that appears on electronic voting machines. The ballot will not be included in the precinct&#8217;s vote totals, Handel said.\n \n Counties that have election boards will conduct hearings on these and other challenged ballots at 10 a.m. the Friday after the election. They will determine whether the person is a citizen.\n \n In counties where probate judges preside over election disputes, hearings also will take place soon, Handel said.\n \n Counties can&#8217;t certify their election results until the challenges are resolved. If the voters can prove citizenship, Handel said, their ballots will be counted.\n \n Any voter can challenge another&#8217;s qualifications to cast a ballot by notifying a precinct poll manager, Handel said. That voter then would be given a challenge ballot and would have to go before the election board.\n \n If large numbers of challenges are made on Election Day, Handel said, her office will investigate whether they are part of an orchestrated effort to influence the election&#8217;s outcome.\n \n But, she said, &#8220;I&#8217;m not anticipating any kind of huge issue there.&#8221;\n State to notify 4,770 their votes are 'challenged' | ajc.com\n \n 1) I am amazed that they claim \"as expeditiously as possible\", then the letters get mailed out ON THE WEDNESDAY BEFORE the election.\n Give 1-2 days, they get the mail on Thursday or FRIDAY, and at THAT time they are made aware that next week Tuesday they have their vote \"challenged\".\n :rolls\n \n 2) ANY voter can \"challenge\" another voter?\n WHAT STIPULATIONS are made to verify that the \"challenger\" has any grounds for the challenge???\n And just based on that challenge, the status of the vote is changed, making the voter have to change his plans the day after to try to justify his voting right?\n \n 3) And oh yeah.\n As if it needed to be said, she's a Republican...\n Go figure...", 
   {
    "post_info": {
     "post_title": "State to notify 4,770 their votes are \u0091challenged\u0092"
    }
   }, 
   null, 
   null, 
   1225860180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  State to notify 4,770 their votes are \u0091challenged\u0092", 
  "url": "http://www.4forums.com/political/elections-debates/11910-state-notify-4-770-their-votes-challenged.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 11910, 
  "discussion_files": [
   [
    "31328.html", 
    "http://www.4forums.com/political/elections-debates/11910-state-notify-4-770-their-votes-challenged-print.html"
   ]
  ], 
  "identifier": 11910
 }
]