[
 [
  [
   331413, 
   null, 
   "Zardoz", 
   "Ya know, I read the bible and am shocked and amazed at the level of pornography displayed in it.\n \n And the SMBD stuff is positively horrendous.\n \n I can't believe they actually make children read this filth.", 
   {
    "post_info": {
     "post_title": "Song of Solomon = Porn"
    }
   }, 
   null, 
   null, 
   1226018520.0
  ], 
  [
   331471, 
   null, 
   "Jo Bennett", 
   "Typical America, the Bible features tales of genocide, terrorism, murder, kidnap, rape, torture, execution, human sacrifice, incest... what are Americans concerned about? Consensual sex between 1 man and 1 woman. :xbanghead", 
   {}, 
   331413, 
   null, 
   1226042220.0
  ], 
  [
   331587, 
   null, 
   "Penfold", 
   "..... And what is 1 Kings 21/21 about anyway? Strong mano a mano stuff going on there.", 
   {}, 
   331471, 
   null, 
   1226099700.0
  ], 
  [
   344733, 
   null, 
   "isly ilwott", 
   "Erotica rules!", 
   {}, 
   331587, 
   null, 
   1235288160.0
  ], 
  [
   344770, 
   null, 
   "marc9000", 
   "God inspired the captivating Song of Solomon to bless the lives of every man and every woman regardless of their age or upbringing by teaching them how to find true love, enjoy a lifelong sexual partner, and build a successful marriage. Lovemaking originated within the mind of God along with beautiful sunsets and undersea wonders, and this beautiful true story demonstrates his love for Christians. \n\n \n http://www.ask.com/bar?q=song+of+solomon+interpretations&page=3&qsrc=178&zoom=&ab=2&u=http%3A%2F%2Fgospelthemes.com%2Fsongfaq.htm\n \n \n (also)\n \nIdeally, the Song of Solomon should be everyone's own love story as everyone must choose between sensuous love and true love. As Ecclesiastes says, people are the same from generation to generation (Eccl. 1:4, 10). The tools they use to subdue the earth change, but the people remain the same.\n When parents teach the Song of Solomon to their children, they should be able to say, \"When Mommy and Daddy fell in love, we did . . . just like the Shulammite and the Shepherd. Someday you'll fall in love, too. You'll know if he or she is the right person just like the Shulammite and the Shepherd did.\" In this way, the Song of Solomon becomes everyone's own love story that they pass down from generation to generation.\n \n The Song of Solomon shows that God cares about the daily lives of his people. He wants his people to be happy and to enjoy wonderful love lives. Ideally, if a couple learns the Song of Solomon in their youth, then they can lay the proper foundation in courtship for a joyful marriage. The story gives some of the best advice available for courting couples. It teaches a girl how to choose a husband and a boy how to choose a wife so that they might live happily forevermore.\n \n Newlyweds, in whose eyes love still shines, enjoy beautiful marriages when they study God's plan for them. But their happiness doesn't begin to compare with that of couples who learn their role before marriage and who lay the proper foundation in courtship. The ones who learn what God expects of them before marriage start off with fewer problems. When problems do appear, they know how to handle them instead of just reacting to them.\n \n However, it's not too late for the ones already married. The Song of Solomon teaches how to lay the foundation for a happy marriage at every stage--courting, newlywed, and silver or golden anniversaries. At whatever stage a couple happens to be, they can examine their relationship. Did they build their marriage upon a foundation of true love rather than sensuous love? If not, they can still lay that foundation in their marriage. It's not too late to enjoy the happiness of the Shulammite and the Shepherd and to thrill to the marital love that God designed. Thus, the Song of Solomon beautifully demonstrates God's love and care for all those who wish to serve him. \n", 
   {
    "unicode_changes_made": true
   }, 
   331413, 
   null, 
   1235338080.0
  ], 
  [
   344779, 
   null, 
   "trebor", 
   "http://www.ask.com/bar?q=song+of+solomon+interpretations&page=3&qsrc=178&zoom=&ab=2&u=http%3A%2F%2Fgospelthemes.com%2Fsongfaq.htm\n \n \n (also)\n\n \n It's really amazing the kind of misunderstanding people can do when they want to justify something being in the bible.\n \n I mean, all you have to do is actually READ the song of Solomon and figure out that interpretation is stretching it. It is quite explicit sexual imagery, and the term 'almah' is used for a woman that is generally unmarried.", 
   {}, 
   344770, 
   null, 
   1235347920.0
  ], 
  [
   344862, 
   null, 
   "Zardoz", 
   "Yeah!\n \n Especially since during the time that Song of Soloman was writen, there was virtually no 'courtship/dating'. There WAS arranged marriages though.\n Which makes dating material kinda dumb.", 
   {}, 
   344779, 
   null, 
   1235430720.0
  ], 
  [
   344923, 
   null, 
   "simone", 
   "The Queen of Sheba was hot for Solomon. Big deal!\n \n I take it Solomon had the hots for her in return.", 
   {}, 
   344862, 
   null, 
   1235505540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Song of Solomon = Porn", 
  "url": "http://www.4forums.com/political/religion-debates/11924-song-solomon-porn.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 11924, 
  "discussion_files": [
   [
    "27225.html", 
    "http://www.4forums.com/political/religion-debates/11924-song-solomon-porn-print.html"
   ]
  ], 
  "identifier": 11924
 }
]