[
 [
  [
   331990, 
   null, 
   "ServantOfChrist", 
   "Crocodiles and humans live side-by-side in African village - Telegraph\n \n Here are some comments made by the Creation Science organization AnswersinGenesis:\n \n A series of photographs published by the Telegraph document African villagers who enjoy a &#8220;startlingly close relationship&#8221; with local crocodiles. The villagers believe the crocodiles are sacred and feed them chicken&#8212;no doubt a key to keeping them happy (or full) enough to allow the villagers to &#8220;play and do chores just yards from them.&#8221; (Follow the link above for photographs.)\n \n Calling it a &#8220;magical place,&#8221; photographer Oliver Born said, &#8220;It shows that crocodiles are not just ferocious and dangerous animals and that they deserve to be protected. Crocodiles are today completely integrated in the life of the population.&#8221; The Telegraph also reports that more than 100 of the reptiles live near the village, growing up to 20 feet (6 m) long.\n \n The news is also quite relevant to the creation/evolution debate, because of our often-mocked belief&#8212;which comes straight from Scripture&#8212;that dinosaurs and humans coexisted (at first peacefully) all the way back to the Garden of Eden. This is from a straightforward reading of Scripture that clearly teaches that humans and dinosaurs were both created on Day 6 of Creation Week.\n \n Of course, while many dinosaurs were always plant-eating, the diets of other dinosaurs went from herbivorous to carnivorous after the Fall. This is the perhaps the most salient basis for evolutionists&#8217; mockery of our human&#8211;dinosaur coexistence claim, even though humans inhabit the same world as many dangerous carnivores even today!\n \n Crocodilians are one such dangerous carnivore, considered closely related to dinosaurs and believed even by evolutionists to have lived alongside them. In fact, there&#8217;s quite little other than nomenclature that prevents us from considering them living dinosaurs&#8212;remember that when anyone laughs at the prospect of dinosaurs living today! We suspect that if crocodilians weren&#8217;t so widespread today, they might have been considered just another long-extinct dinosaur&#8212;until they turned up living in the present! The same goes for Komodo dragons and other monitor lizards, along with tuatara.\n \n Thus, the scenes of the African villagers mingling with the crocodiles corroborate that humans could have lived alongside (or nearby) even carnivorous dinosaurs. The original &#8220;magical place&#8221; where that happened was the Garden of Eden, before any animals had turned to carnivory.\n \n ", 
   {
    "post_info": {
     "post_title": "It may not be dinosaurs living side-by-side with humans, but it\u0092s close!"
    }
   }, 
   null, 
   null, 
   1226269800.0
  ], 
  [
   331996, 
   null, 
   "obvious_child", 
   "\n Thus, the scenes of the African villagers mingling with the crocodiles corroborate that humans could have lived alongside (or nearby) even carnivorous dinosaurs. The original \"magical place\" where that happened was the Garden of Eden, before any animals had turned to carnivory.\n \n\n \n Seriously?\n \n That's your reasoning?\n \n By such logic, swimming with sharks means that humans always have coexisted with sharks, including the ancient ones that preceded the dinosaurs. By such logic, since humans can coexist with insects, we must have been around during the carboniferous period.", 
   {
    "unicode_changes_made": true
   }, 
   331990, 
   null, 
   1226270460.0
  ], 
  [
   332036, 
   null, 
   "prschuster", 
   "Gee, where does one begin to respond to a post like this one? It would require a complete lecture on paleontology, explaining that there is a 60 million year gap between the last of the Cretaceous dinosaurs and the first hominids. Then it would require one to explain why crocs aren't really dinosaurs any more than Plesiosaurs or Pterodactyls were. Then, of course, it would require a lengthy lecture on how birds, not crocs, share the same lineage as the likes of Tyrannosaurus.", 
   {
    "post_info": {
     "post_title": "Crocs are not Dinos"
    }
   }, 
   331996, 
   null, 
   1226283600.0
  ], 
  [
   332041, 
   null, 
   "smiley", 
   "One might also argue that, since we have now managed to send people into space where some live for months at a time, human existence must predate the earth itself.\n \n Perhaps not!", 
   {}, 
   332036, 
   null, 
   1226284080.0
  ], 
  [
   332048, 
   null, 
   "CashBurnRate", 
   "Seriously?\n \n That's your reasoning?\n \n By such logic, swimming with sharks means that humans always have coexisted with sharks, including the ancient ones that preceded the dinosaurs. By such logic, since humans can coexist with insects, we must have been around during the carboniferous period.\n\n \n Another lie.\n \n The sentence you've quoted never made any such argument.", 
   {}, 
   331996, 
   null, 
   1226284500.0
  ], 
  [
   332051, 
   null, 
   "prschuster", 
   "Another lie.\n \n The sentence you've quoted never made any such argument.\n\n \n \n The quote below which Obvious Child responded to doesn't make enough sense to be an argument for anything. This whole thing about living side by side with carnivirous crocs by feeding them chicken has little to do with anything, really.\n \n \n Servant of Christ says:\n \"Thus, the scenes of the African villagers mingling with the crocodiles corroborate that humans could have lived alongside (or nearby) even carnivorous dinosaurs. The original \"magical place\" where that happened was the Garden of Eden, before any animals had turned to carnivory. \"", 
   {
    "unicode_changes_made": true
   }, 
   332048, 
   null, 
   1226285160.0
  ], 
  [
   332054, 
   null, 
   "ServantOfChrist", 
   "Seriously?\n \n That's your reasoning?\n \n\n Er, no. That is AnswersinGenesis' reasoning. Are you having difficulties reading? It seems so, as you are unable to distinguish between what a poster says and what an organization they are quoting says.", 
   {}, 
   331996, 
   null, 
   1226286360.0
  ], 
  [
   332055, 
   null, 
   "ServantOfChrist", 
   "The quote below which Obvious Child responded to doesn't make enough sense to be an argument for anything. This whole thing about living side by side with carnivirous crocs by feeding them chicken has little to do with anything, really.\n \n \n Servant of Christ says:\n \"Thus, the scenes of the African villagers mingling with the crocodiles corroborate that humans could have lived alongside (or nearby) even carnivorous dinosaurs. The original \"magical place\" where that happened was the Garden of Eden, before any animals had turned to carnivory. \"\n\n \n Actually, no, that is not what I said. I said: \nCrocodiles and humans live side-by-side in African village - Telegraph\n \n Here are some comments made by the Creation Science organization AnswersinGenesis:\n \n\n \n What you quoted is what Answers in Genesis said. Please do not be dishonest and tell others that I said this as I did not.", 
   {
    "unicode_changes_made": true
   }, 
   332051, 
   null, 
   1226286420.0
  ], 
  [
   332056, 
   null, 
   "Penfold", 
   "So having quoted them, do you disagree with answersingenesis' risible comparison?", 
   {}, 
   332055, 
   null, 
   1226286660.0
  ], 
  [
   332058, 
   null, 
   "ServantOfChrist", 
   "So having quoted them, do you disagree with answersingenesis' risible comparison?\n\n \n Yes, although I think they have a point (about evos criticising the idea of humans not being able to live with dinos that are carnivorous when humans can coexist with various other animals that are carnivorous), their claims do not follow. I personally posted it becuase of the interesting idea of humans and crocs living together (as well as the darn cool pictures, especially the first one of the flying croc), and happened to run across an article by AiG.\n \n Now, any evo explanations of this close relationship between the two animals?", 
   {}, 
   332056, 
   null, 
   1226286960.0
  ], 
  [
   332059, 
   null, 
   "obvious_child", 
   "Er, no. That is AnswersinGenesis' reasoning. Are you having difficulties reading? It seems so, as you are unable to distinguish between what a poster says and what an organization they are quoting says.\n\n \n Generally, when someone posts an article without a disclaimer, they agree with the findings and the reasoning of the article provided. \n \n Besides, your statement does not change the fact that the reasoning provided is foolish.", 
   {}, 
   332054, 
   null, 
   1226287560.0
  ], 
  [
   332062, 
   null, 
   "obvious_child", 
   "\n Now, any evo explanations of this close relationship between the two animals?\n\n \n Humans like exotic pets? But that's not exactly news. Humans have been keeping dangerous and strange animals as pets for thousands of years.", 
   {}, 
   332058, 
   null, 
   1226287620.0
  ], 
  [
   332063, 
   null, 
   "ServantOfChrist", 
   "Generally, when someone posts an article without a disclaimer, they agree with the findings and the reasoning of the article provided. \n \n Besides, your statement does not change the fact that the reasoning provided is foolish.\n\n \n Since when? So if I were to post a news article where someone says that pedophilia should be legalized, then it means I agree with them? I thought this was a discussion board. That means we, you know, DISCUSS THINGS.\n \n Now, if I had said \"Here is AiG's article and I couldn't agree with them more\", then you would have an argument.\n \n As I did not, you don't. Now, do you retract your false statement that what you quoted was my reasoning?", 
   {}, 
   332059, 
   null, 
   1226287740.0
  ], 
  [
   332064, 
   null, 
   "obvious_child", 
   "Another lie.\n \n The sentence you've quoted never made any such argument.\n\n \n Ah, you've engaged in the grammarian nitpick function of debate. Sad, but predictable. \n \n Obviously, I was discussing the entire article, which is making that argument. It is generally bad form to quote an entire post when it reaches such length.", 
   {}, 
   332048, 
   null, 
   1226287740.0
  ], 
  [
   332069, 
   null, 
   "CashBurnRate", 
   "Ah, you've engaged in the grammarian nitpick function of debate. Sad, but predictable. \n \n Obviously, I was discussing the entire article, which is making that argument. It is generally bad form to quote an entire post when it reaches such length.\n\n \n The article as a whole never made that argument either.\n \n Lie number.... oh I can't keep track anymore, let's just call it 40.", 
   {}, 
   332064, 
   null, 
   1226288100.0
  ], 
  [
   332070, 
   null, 
   "obvious_child", 
   "Since when?\n\n \n Since always?\n \n \nSo if I were to post a news article where someone says that pedophilia should be legalized, then it means I agree with them? I thought this was a discussion board. That means we, you know, DISCUSS THINGS.\n\n \n Well, if you said \"Look what I found, isn't that disgusting?\" Or \"Here's something truly controversial, what do you guys think\" or basically anything that shows you were posting it merely for a discussion and that you weren't supporting its findings. Disclaimers are great things. You should try them. And \n \n \nNow, if I had said \"Here is AiG's article and I couldn't agree with them more\", then you would have an argument.\n\n \n Not really. If someone posts an article without a disclaimer, do you think that they don't support that article's findings? \n \n \nAs I did not, you don't. Now, do you retract your false statement that what you quoted was my reasoning?\n\n \n Fine, it's not your reasoning. That doesn't make the reasoning not defunct though.", 
   {}, 
   332063, 
   null, 
   1226288160.0
  ], 
  [
   332071, 
   null, 
   "obvious_child", 
   "The article as a whole never made that argument either.\n \n Lie number.... oh I can't keep track anymore, let's just call it 40.\n\n \n Okay Yankee Fan. Keep pretending that it doesn't. Well, if you never read the article, you wouldn't be pretending as that would be an argument from position of ignorance.", 
   {}, 
   332069, 
   null, 
   1226288220.0
  ], 
  [
   332073, 
   null, 
   "CashBurnRate", 
   "Okay Yankee Fan. Keep pretending that it doesn't. Well, if you never read the article, you wouldn't be pretending as that would be an argument from position of ignorance.\n\n \n I'm a twins fan, I've always hated big market teams buying their way into the playoffs.\n \n You're arguing out of sheer ignorance.\n \n You're just spewing anything out just so you don't have to focus on the main subject, right? \n \n You remind me of a delusional person who said that McCain will still win the election on the morning of Nov 4 even as poll after poll shows Obama winning 350+ electoral votes.", 
   {}, 
   332071, 
   null, 
   1226288400.0
  ], 
  [
   332075, 
   null, 
   "obvious_child", 
   "If you think I'm wrong Yankee Fan, then explain to me what the article actually says. \n \n And constant violations of the TOS will get you banned.", 
   {}, 
   332073, 
   null, 
   1226288580.0
  ], 
  [
   332076, 
   null, 
   "CashBurnRate", 
   "\n \n \n Fine, it's not your reasoning. That doesn't make the reasoning not defunct though.\n\n \n \nSeriously?\n \n That's your reasoning?\n \n By such logic, swimming with sharks means that humans always have coexisted with sharks, including the ancient ones that preceded the dinosaurs. By such logic, since humans can coexist with insects, we must have been around during the carboniferous period.\n\n \n I'm not criticizing you because you're wrong, I'm criticizing you because you're massively dishonest.", 
   {}, 
   332070, 
   null, 
   1226288580.0
  ], 
  [
   332077, 
   null, 
   "obvious_child", 
   "I'm not criticizing you because you're wrong, I'm criticizing you because you're massively dishonest.\n\n \n That would be incorrect. \n \n http://www.4forums.com/political/332048-post5.html\n \n Again, if you want to get banned from another forum, keep up with the insults.", 
   {}, 
   332076, 
   null, 
   1226288640.0
  ], 
  [
   332078, 
   null, 
   "CashBurnRate", 
   "If you think I'm wrong Yankee Fan, then explain to me what the article actually says. \n \n And constant violations of the TOS will get you banned.\n\n \n If you want to live in your fantasy world, fine by me.\n \n Why should I even bother debating with someone who's delusional, a liar and a hypocrite?\n \n STOP CALLING ME A YANKEES FAN. I LIKE THE TWINS.", 
   {}, 
   332075, 
   null, 
   1226288640.0
  ], 
  [
   332079, 
   null, 
   "CashBurnRate", 
   "That would be incorrect. \n \n http://www.4forums.com/political/332048-post5.html\n \n Again, if you want to get banned from another forum, keep up with the insults.\n\n \n yes, that's an example of me criticizing you because of your dishonesty\n \n how is that inconsistent with what I said?", 
   {}, 
   332077, 
   null, 
   1226288700.0
  ], 
  [
   332080, 
   null, 
   "obvious_child", 
   "You claimed that the article did not give that line of reasoning, aka, that I was wrong about their reasoning. You just claimed that you aren't attacking me because you think I'm wrong, but because you think I'm dishonest. I cited your first post where you did in fact attack me because you thought I was wrong. \n \n Furthermore, if you actually do think I'm wrong, explain what the article actually means instead of relying entirely upon terms of service violating insults.\n \n Again, if you want to get banned from another forum, keep up with the insults.", 
   {}, 
   332079, 
   null, 
   1226288820.0
  ], 
  [
   332081, 
   null, 
   "Penfold", 
   "Yes, although I think they have a point (about evos criticising the idea of humans not being able to live with dinos that are carnivorous when humans can coexist with various other animals that are carnivorous), their claims do not follow. I personally posted it becuase of the interesting idea of humans and crocs living together (as well as the darn cool pictures, especially the first one of the flying croc), and happened to run across an article by AiG.\n \n Now, any evo explanations of this close relationship between the two animals?\n\n \n \"Evo's\" do not criticise the idea of humans being unable to live with dinosaurs because said dinosaurs were carnivorous. They laugh at the very suggestion,\n since the age of the dinosaurs had long passed before humans had evolved.", 
   {}, 
   332058, 
   null, 
   1226288820.0
  ], 
  [
   332083, 
   null, 
   "CashBurnRate", 
   "You claimed that the article did not give that line of reasoning, aka, that I was wrong about their reasoning. You just claimed that you aren't attacking me because you think I'm wrong, but because you think I'm dishonest. I cited your first post where you did in fact attack me because you thought I was wrong. \n \n Furthermore, if you actually do think I'm wrong, explain what the article actually means instead of relying entirely upon terms of service violating insults.\n \n Again, if you want to get banned from another forum, keep up with the insults.\n\n \n You think I criticized you because I thought you were wrong.\n \n I criticized you because of YOUR MASSIVE DISHONESTY.\n \n Stop being delusional and say that I'm some other guy.\n \n Go ahead, keep lying. I enjoy exposing people's massive lies.", 
   {}, 
   332080, 
   null, 
   1226289000.0
  ], 
  [
   332085, 
   null, 
   "obvious_child", 
   "If you have something other then behavior that will get you banned, please provide it. \n \n Or do you agree that the article is nuts in its argument? \n \n You claim not to be a believer in literal creationism, yet every time you are asked to show that you aren't believer, your skirt, avoid, dance away. \n \n I know who you are. Just because your little crusade on LW failed doesn't mean it will work here. Keep up with the insults, I'd love to watch you get banned.", 
   {}, 
   332083, 
   null, 
   1226289180.0
  ], 
  [
   332086, 
   null, 
   "ServantOfChrist", 
   "\"Evo's\" do not criticise the idea of humans being unable to live with dinosaurs because said dinosaurs were carnivorous. They laugh at the very suggestion,\n since the age of the dinosaurs had long passed before humans had evolved.\nThey don't? I suggest you head on over to a forum called CARM (christiandiscussionboards.org) and tell all the evolutionists on there that, because they certainly would not agree with this bolded statement. They routinely criticize the idea of humans and dinos living together on that very basis.", 
   {}, 
   332085, 
   null, 
   1226289360.0
  ], 
  [
   332087, 
   null, 
   "ServantOfChrist", 
   "Since always?\n \n \n \n Well, if you said \"Look what I found, isn't that disgusting?\" Or \"Here's something truly controversial, what do you guys think\" or basically anything that shows you were posting it merely for a discussion and that you weren't supporting its findings. Disclaimers are great things. You should try them. And \n \n Well, sorry I did not bow to your whims and read your mind to know that you require a disclaimer to realize that the words of a quoted article are not the words of the person that posted them.\n \n \n\n Not really. If someone posts an article without a disclaimer, do you think that they don't support that article's findings? \n \n No, not really. If they do not specify in that post I may ask them if they agree with it, but typically don't even do that but rather comment on the actual article. I CERTAINLY don't claim that the words of the article are the words of the poster. That would be retarded.\n \n \n\n Fine, it's not your reasoning. That doesn't make the reasoning not defunct though.\n\n That's nice. So we agree you lied.", 
   {}, 
   332070, 
   null, 
   1226289480.0
  ], 
  [
   332088, 
   null, 
   "smiley", 
   "Yes, although I think they have a point (about evos criticising the idea of humans not being able to live with dinos that are carnivorous when humans can coexist with various other animals that are carnivorous), their claims do not follow. I personally posted it becuase of the interesting idea of humans and crocs living together (as well as the darn cool pictures, especially the first one of the flying croc), and happened to run across an article by AiG.\n \n Now, any evo explanations of this close relationship between the two animals?\n\n Where do you get this idea that evolutionists think that man cannot live alongside dinosaurs? The evidence is overwhelming that humans did not live alongside dinosaurs.\n \n As you say, humans are capable of living alongside many species, although evidence would tend to suggest that humans would rather steal their habitat and force them to live behind bars purely for the human's amusement.\n \n This statement is from your opening post . . \n \nThus, the scenes of the African villagers mingling with the crocodiles corroborate that humans could have lived alongside (or nearby) even carnivorous dinosaurs.\n\n Simply speaking, humans could not have lived alongside dinosaurs (such as the terranasuarus rex) because those dinosaurs died out long before humans evolved. Your \"evidence\" that humans are capable of living alongside other carnivores (hell, I have a dog) does nothing to alter the fact that they did not.\n \n Smiley", 
   {}, 
   332058, 
   null, 
   1226289960.0
  ], 
  [
   332089, 
   null, 
   "prschuster", 
   "Actually, no, that is not what I said. I said: \n \n What you quoted is what Answers in Genesis said. Please do not be dishonest and tell others that I said this as I did not.\n\n \n \n OK, you didn't say it. My mistake. But am I wrong in assuming that you agree with their arguments by virtue of having posted quotes by them without rebutting what they have stated?", 
   {}, 
   332055, 
   null, 
   1226290440.0
  ], 
  [
   332090, 
   null, 
   "prschuster", 
   "Yes, although I think they have a point (about evos criticising the idea of humans not being able to live with dinos that are carnivorous when humans can coexist with various other animals that are carnivorous), their claims do not follow. I personally posted it becuase of the interesting idea of humans and crocs living together (as well as the darn cool pictures, especially the first one of the flying croc), and happened to run across an article by AiG.\n \n Now, any evo explanations of this close relationship between the two animals?\n\n \n \n I have read vertebrate paleontology texts and never have I seen this argument that humans did not coexist with carnivorous dinos because of fear of being eaten. Humans did not coexist with dinos because there was a 60 million year gap in the fossil record between the last of the dinos and the first hominids. This AIG article would insult the intelligence of a 12 year old.", 
   {}, 
   332058, 
   null, 
   1226290860.0
  ], 
  [
   332091, 
   null, 
   "obvious_child", 
   "Well, sorry I did not bow to your whims and read your mind to know that you require a disclaimer to realize that the words of a quoted article are not the words of the person that posted them.\n\n \n You fail to realize that when posting in such a fashion, you assume the author and the reasoning and the beliefs. \n \n \nNo, not really. If they do not specify in that post I may ask them if they agree with it, but typically don't even do that but rather comment on the actual article. I CERTAINLY don't claim that the words of the article are the words of the poster. That would be retarded.\n\n \n By your logic, people have no basis for things they post. \n \n \nThat's nice. So we agree you lied.\n\n \n You posted without a disclaimer. Therefore you take into the statements made by that article. \n \n You even agreed that you wouldn't assume that a poster doesn't disagree. \n \n lol. I find it amusing how you can't win normally you assume Yankee fan's tactics of nitpick.\n \n The article you posted is stupid and the reasoning it suggests results in pretty outlandish ideas.", 
   {}, 
   332087, 
   null, 
   1226291280.0
  ], 
  [
   332092, 
   null, 
   "obvious_child", 
   "OK, you didn't say it. My mistake. But am I wrong in assuming that you agree with their arguments by virtue of having posted quotes by them without rebutting what they have stated?\n\n \n Apparently SOC doesn't understand what printers since the middle ages have understood. If I repeat or post something without a disclaimer, or something that doesn't show I don't accept the beliefs and arguments of that posting, I therefore accept that posting's beliefs and arguments. SOC is hundreds of years behind the times.", 
   {}, 
   332089, 
   null, 
   1226291340.0
  ], 
  [
   332093, 
   null, 
   "prschuster", 
   "So, instead of arguing about who is being dishonest or who is engaging in behavior that may get themselves banned, I just want to know why Servantofchrist posted this quote from a creationist website and whether he or she agrees with it. Otherwise this whole thing is way too ludicrous to discuss.", 
   {
    "post_info": {
     "post_title": "What is the point?"
    }
   }, 
   332090, 
   null, 
   1226291400.0
  ], 
  [
   332096, 
   null, 
   "obvious_child", 
   "So, instead of arguing about who is being dishonest or who is engaging in behavior that may get themselves banned, I just want to know why Servantofchrist posted this quote from a creationist website and whether he or she agrees with it. Otherwise this whole thing is way too ludicrous to discuss.\n\n \n We tried that. Cashburn (aka Yankee Fan, [I can provide you links to his truly insane posts]) tried on another forum to bash me for previous destruction on his asinine arguments. He knows full well that he cannot win an honest discussion about the actual topics (hence the massive use of TOS violations). So he's going to be deliberately discussing top topic character issues rather then the actual subject. SOC in turn has noticed this tactic is great for avoiding owning up to his own original post. Thus, we won't get any real discussion from these two.", 
   {}, 
   332093, 
   null, 
   1226291580.0
  ], 
  [
   332097, 
   null, 
   "ShadowPikachu", 
   "You fail to realize that when posting in such a fashion, you assume the author and the reasoning and the beliefs. \n \n \n \n By your logic, people have no basis for things they post. \n \n \n \n You posted without a disclaimer. Therefore you take into the statements made by that article. \n \n You even agreed that you wouldn't assume that a poster doesn't disagree. \n \n lol. I find it amusing how you can't win normally you assume Yankee fan's tactics of nitpick.\n \n The article you posted is stupid and the reasoning it suggests results in pretty outlandish ideas.\n\n \n He also said he wouldn't assume the poster DID agree. As much as I dislike creationists, I dislike it even more when people treat them like this when those people were in the wrong in their assumptions. \n \n OC, you should know what assuming does, and yet that is exactly what you did, and now you are trying to rationalize your assumptions with some silly argument that if a person posts an article that it means he agrees with every word it says.\n \n Sorry OC, but I have never heard something so absurd - I saw SOC's post as posting a link to an article and then a quote from a creationist news source in an attempt to get people's comments on it.\n \n Sorry OC, but I agree with SOC here - it is absurd to assume that a person agrees or disagrees with an article they post unless they specifically state their agreement/disagreement.\n \n EDIT: I myself made such an oP here (and many times on other forums). Example here: http://www.4forums.com/political/news-forum/9717-ukrainian-president-dissolves-parliament.html", 
   {}, 
   332091, 
   null, 
   1226291580.0
  ], 
  [
   332098, 
   null, 
   "obvious_child", 
   "\n OC, you should know what assuming does, and yet that is exactly what you did, and now you are trying to rationalize your assumptions with some silly argument that if a person posts an article that it means he agrees with every word it says.\n\n \n Do we need a search on SOC's historical posting trends?\n \n His posting is like Arch angel posting something about why Gays are horrible. It's pretty damn obvious what he thinks. \n \n \nSorry OC, but I have never heard something so absurd - I saw SOC's post as posting a link to an article and then a quote from a creationist news source in an attempt to get people's comments on it.\n\n \n That you did. I however, took into account his previous posting history, that of a strong literal creationist who will look for anything that supports creation. You just took a snapshot without adding historical trends. Thus, why you came to that conclusion and why I did not. True, SOC COULD have changed in the past month away from a literal creationist looking for truly anything to bolster his beliefs, but that is highly unlikely. \n \n \nSorry OC, but I agree with SOC here - it is absurd to assume that a person agrees or disagrees with an article they post unless they specifically state their agreement/disagreement.\n\n \n Why? And why especially when the person posting it is a strong literal creationist who has repeatively made posts for creation over evolution?", 
   {}, 
   332097, 
   null, 
   1226291820.0
  ], 
  [
   332099, 
   null, 
   "CashBurnRate", 
   "We tried that. Cashburn (aka Yankee Fan, [I can provide you links to his truly insane posts]) tried on another forum to bash me for previous destruction on his asinine arguments. He knows full well that he cannot win an honest discussion about the actual topics (hence the massive use of TOS violations). So he's going to be deliberately discussing top topic character issues rather then the actual subject. SOC in turn has noticed this tactic is great for avoiding owning up to his own original post. Thus, we won't get any real discussion from these two.\n\n \n All you have is \"Cuz I say so!\" arguments\n \n \nSeriously?\n \n That's your reasoning?\n \n By such logic, swimming with sharks means that humans always have coexisted with sharks, including the ancient ones that preceded the dinosaurs. By such logic, since humans can coexist with insects, we must have been around during the carboniferous period.\n\n \n the article never made such an argument and you assume that the poster agrees completely with the article\n \n again, I won't be so critical of you if you weren't dishonest\n \n and the reason I won't take a side is because I don't know which side to believe, and I just want to hold ppl accountable for their lies", 
   {}, 
   332096, 
   null, 
   1226291940.0
  ], 
  [
   332101, 
   null, 
   "obvious_child", 
   "hence the massive use of TOS violations\n\n \n Two insults that got modded.\n \n By the way, are you ever going to get around to showing that the article doesn't suggest such reasoning? \n \n Essentially all you have is \"I say so\"", 
   {}, 
   332099, 
   null, 
   1226292240.0
  ], 
  [
   332102, 
   null, 
   "ShadowPikachu", 
   "Do we need a search on SOC's historical posting trends?\n \n His posting is like Arch angel posting something about why Gays are horrible. It's pretty damn obvious what he thinks. \n \n \n \n That you did. I however, took into account his previous posting history, that of a strong literal creationist who will look for anything that supports creation. You just took a snapshot without adding historical trends. Thus, why you came to that conclusion and why I did not. True, SOC COULD have changed in the past month away from a literal creationist looking for truly anything to bolster his beliefs, but that is highly unlikely. \n \n \n \n Why? And why especially when the person posting it is a strong literal creationist who has repeatively made posts for creation over evolution?\n\n Well I see the problem here. I, unlike you, realize that there are numerous creationist positions on the same issues, and do not automatically assume what a creationist believes without asking them. I visit CARM and there is a HUGE variety among the YECs, and even variety between Old Earth Creationists.\n \n I guess somepeople just jump to conclusions based on assumptions they make on a persons beliefs while others (like myself) are open-minded and like to find out personally from that poster exactly what they do believe.\n \n And from my edit to my other post on OPs: EDIT: I myself have made such an oP here (and many times on other forums). Example here: http://www.4forums.com/political/news-forum/9717-ukrainian-president-dissolves-parliament.html", 
   {}, 
   332098, 
   null, 
   1226292240.0
  ], 
  [
   332103, 
   null, 
   "CashBurnRate", 
   "Two insults that got modded.\n \n By the way, are you ever going to get around to showing that the article doesn't suggest such reasoning? \n \n Essentially all you have is \"I say so\"\n\n \n You're the one that said the article uses such and such reasoning.\n \n the burden of proof is on you", 
   {}, 
   332101, 
   null, 
   1226292300.0
  ], 
  [
   332104, 
   null, 
   "obvious_child", 
   "Well I see the problem here. I, unlike you, realize that there are numerous creationist positions on the same issues, and do not automatically assume what a creationist believes without asking them. I visit CARM and there is a HUGE variety among the YECs, and even variety between Old Earth Creationists.\n\n \n Except that we have asked SOC what he believes. And his posts clearly show that he is indeed a Literalist. Again, this is like Arch posting an article titled \"gays are an abomination.\" We know what he thinks. \n \n \nI guess people just jump to conclusions based on assumptions they make on a persons beliefs while others are open-minded and like to find out personally from that poster exactly what they do believe.\n\n \n After reading numerous posts all showing the same thing, it's a waste of time to ask. Would you ask Arch what he thought about gays or Evolution? Or would you already know?", 
   {}, 
   332102, 
   null, 
   1226292480.0
  ], 
  [
   332105, 
   null, 
   "obvious_child", 
   "You're the one that said the article uses such and such reasoning.\n \n the burden of proof is on you\n\n \n \nThus, the scenes of the African villagers mingling with the crocodiles corroborate that humans could have lived alongside (or nearby) even carnivorous dinosaurs. The original \"magical place\" where that happened was the Garden of Eden, before any animals had turned to carnivory.\n\n \n Explain to me how that does not suggest that if we live with them now, we could have lived with them or something similar in the past. \n \n Or you can just keep up with the TOS violations on your path to being banned.", 
   {
    "unicode_changes_made": true
   }, 
   332103, 
   null, 
   1226292600.0
  ], 
  [
   332106, 
   null, 
   "CashBurnRate", 
   "Explain to me how that does not suggest that if we live with them now, we could have lived with them or something similar in the past. \n \n Or you can just keep up with the TOS violations on your path to being banned.\n\n \n in your post, you didn't say \"could have lived with them or something similiar in the past\"\n \n you said \"always have coexisted\"\n \n admit it, you change your arguments as you see fit as people learn about your massive dishonesty so you can at least pretend to be honest\n \n all you have to say is, \"you're gonna get banned because I don't want you exposing more of my massive lies!!\"\n \n really, grow up", 
   {}, 
   332105, 
   null, 
   1226292960.0
  ], 
  [
   332107, 
   null, 
   "obvious_child", 
   "Nitpick. You haven't addressed the issue here. \n \n Explain to me how that article isn't suggesting that since we can live with crocs, we could have lived with dinos. \n \n How is that fundamentally different from arguments replacing crocs/dinos with insects/large insects and sharks/ancient sharks?\n \n You don't have an argument. You're purely here to flame Yankee Fan. \n \n Your claims have been reduced down to nitpick issue of semantics.", 
   {}, 
   332106, 
   null, 
   1226293140.0
  ], 
  [
   332108, 
   null, 
   "ShadowPikachu", 
   "Except that we have asked SOC what he believes. \n Really? You asked him if he thought that AiG is correct on this issue and if he agreed with them? Where?\n \n \nAnd his posts clearly show that he is indeed a Literalist. \n\n Ah, mmore broad brushing and grouping a diverse set of beliefs together. Sorry OC, but in the real world there is a wide variety of groups even among \"literalists\", as even \"literalists\" take different verses to mean different things. For example I know several who beleive that humans did not eat meat before the fall and others who believe that they did, and both follow literal interpretations. Your problem is you broadbrush people that you dislike to make it easier for yourself to argue against them as a group that you generalize rather than treat each person identically.\n \nAgain, this is like Arch posting an article titled \"gays are an abomination.\" We know what he thinks. \n\n That is because we have asked him. Besides ,the two aren't comparable.\n \n \n\n After reading numerous posts all showing the same thing, \n So, where is the post from SOC on his agreement with AiG on any issues let alone this one? Oh, that's right, he didn't make one.\n \n \nit's a waste of time to ask. Would you ask Arch what he thought about gays or Evolution? Or would you already know?\n\n \n Already have. That is how I know.", 
   {}, 
   332104, 
   null, 
   1226293200.0
  ], 
  [
   332111, 
   null, 
   "obvious_child", 
   "Really? You asked him if he thought that AiG is correct on this issue and if he agreed with them? Where?\n\n \n No, look at his posting history. \n \n \nAh, mmore broad brushing and grouping a diverse set of beliefs together. Sorry OC, but in the real world there is a wide variety of groups even among \"literalists\", as even \"literalists\" take different verses to mean different things. For example I know several who beleive that humans did not eat meat before the fall and others who believe that they did, and both follow literal interpretations. Your problem is you broadbrush people that you dislike to make it easier for yourself to argue against them as a group that you generalize rather than treat each person identically.\n\n \n Explain to me the fundamental difference in minute differences when they all believe in the same principles of a Young Earth and no Evolution. Why can't I group those people based on that overarching belief and hit them on that overarching belief? Simply because someone believes that humans didn't eat meat before the fall, does that exclude them from attacks on the young earth belief? \n \n \nThat is because we have asked him. Besides ,the two aren't comparable.\n\n \n Have you looked at SOC's posting history? \n \n \nSo, where is the post from SOC on his agreement with AiG on any issues let alone this one? Oh, that's right, he didn't make one.\n\n \n By that logic, if a literal creationist who you know is a literal creationist who has claimed to be a literal creationist, who has used literal creationist arguments found on that website, cites that website that is a literal creationist website, we are not to assume he doesn't agree with it? \n \n Uh that doesn't sound rational in any sense.", 
   {}, 
   332108, 
   null, 
   1226293500.0
  ], 
  [
   332114, 
   null, 
   "ShadowPikachu", 
   "No, look at his posting history. \n \n \n \n Explain to me the fundamental difference in minute differences when they all believe in the same principles of a Young Earth and no Evolution. Why can't I group those people based on that overarching belief and hit them on that overarching belief? Simply because someone believes that humans didn't eat meat before the fall, does that exclude them from attacks on the young earth belief? \n \n Not really going to get into it much as I now see you are little more than the liberal version of Archie, but it would exclude them from attacks on things they do not believe. You can attack them on their belief in there being a young earth, but if you attack them on something another YEC believes and they don't, then yes, they are excluded.\n \n \n\n Have you looked at SOC's posting history? \n \n \n \n By that logic, if a literal creationist who you know is a literal creationist who has claimed to be a literal creationist, who has used literal creationist arguments found on that website, cites that website that is a literal creationist website, we are not to assume he doesn't agree with it? \n\n YEs, we should not assume that he agrees with it. Becasue, as I said before, there is a wide range of beliefs among what many term as YECers. There is a saying about assuming. When you assume, you make an XXX out of u and an XXX out of me.\n \n I prefer tangible statements of views rather than assuming what they believe.\n \n Archie and yourself, however, prefer to assume things and group people of varying beliefs together (you with creationists and Archie with evolutionists/atheists or liberals) Thus I have suprised him numerous times when he realises I beleive the same as himself on the issue when he assumed I'd take a \"liberal\" standpoint. Like the election of Obama for example.\n \n \n\n Uh that doesn't sound rational in any sense.\n\n \n I'm sure Archie would feel the same.", 
   {}, 
   332111, 
   null, 
   1226294220.0
  ], 
  [
   332116, 
   null, 
   "obvious_child", 
   "Not really going to get into it much as I now see you are little more than the liberal version of Archie, but it would exclude them from attacks on things they do not believe. You can attack them on their belief in there being a young earth, but if you attack them on something another YEC believes and they don't, then yes, they are excluded.\n\n \n Fair enough. When was the last time I didn't bash for a broad idea accepted by creationists?\n \n You know for a fact that I make a key distinction between YECs and OEC. \n \n \nYEs, we should not assume that he agrees with it. Becasue, as I said before, there is a wide range of beliefs among what many term as YECers. There is a saying about assuming. When you assume, you make an XXX out of u and an XXX out of me.\n\n \n But SOC is in fact an YEC. And the article he posted comes from a YEC organization and the article itself argued for YEC. \n \n \nI prefer tangible statements of views rather than assuming what they believe.\n\n \n Enjoy.\n \n http://www.4forums.com/political/search.php?searchid=162132\n \n \nArchie and yourself, however, prefer to assume things and group people of varying beliefs together (you with creationists and Archie with evolutionists/atheists or liberals)\n\n \n Aside from the fact that I've pointed out in the past that OEC are not the same as YECs. Furthermore YECs from other religions, such as Yezidiz are fundamentally different. \n \n Dude, SOC is a YEC. He has made YEC arguments. He just made a YEC argument from a YEC site. \n \n Explain to me why it is irrational to assume he is a YEC.", 
   {}, 
   332114, 
   null, 
   1226294700.0
  ], 
  [
   332120, 
   null, 
   "ShadowPikachu", 
   "Fair enough. When was the last time I didn't bash for a broad idea accepted by creationists?\n \n You know for a fact that I make a key distinction between YECs and OEC. \n \n \n \n But SOC is in fact an YEC. And the article he posted comes from a YEC organization and the article itself argued for YEC. \n \n \n \n Enjoy.\n \n http://www.4forums.com/political/search.php?searchid=162132\n \n \n \n Aside from the fact that I've pointed out in the past that OEC are not the same as YECs. Furthermore YECs from other religions, such as Yezidiz are fundamentally different. \n \n Dude, SOC is a YEC. He has made YEC arguments. He just made a YEC argument from a YEC site. \n \n Explain to me why it is irrational to assume he is a YEC.\n\n \n It's irrational to assume his particuar YEC beliefs are the same as the AiG beliefs that you argued against.", 
   {}, 
   332116, 
   null, 
   1226296500.0
  ], 
  [
   332127, 
   null, 
   "obvious_child", 
   "It's irrational to assume his particuar YEC beliefs are the same as the AiG beliefs that you argued against.\n\n \n Why? He posted that article. And he is in fact a YEC. \n \n Why would a YEC posts a YEC argument from a YEC website without a disclaimer if he didn't believe it?", 
   {}, 
   332120, 
   null, 
   1226302140.0
  ], 
  [
   332131, 
   null, 
   "ShadowPikachu", 
   "Why? He posted that article. And he is in fact a YEC. \n \n Why would a YEC posts a YEC argument from a YEC website without a disclaimer if he didn't believe it?\n\n \n Maybe he wanted a discussion on the article that he found? I really don't see what your problem is - he said he didn't agree with it and its been established that he doesn't. I really don't see what your problem here is - you assumed something, and it was shown you were wrong (perhaps a hint to not make assumptions).\n \n Just because you are a YEC doesn't mean you accept every belief of every other YECer. For example, I am a rather liberal Democrat like yourself. However, someone would be sorely mistaken to think I voted for or even supported or liked Obama. As another example, I accept evolutionist and am what people would call an \"evolutionist\", and so is someone like GiantOreo and various others. To assume I don't believe in God because the others are atheists, would be wrong as I believe god used evolution to create us.", 
   {}, 
   332127, 
   null, 
   1226303880.0
  ], 
  [
   332134, 
   null, 
   "obvious_child", 
   "Maybe he wanted a discussion on the article that he found? I really don't see what your problem is - he said he didn't agree with it and its been established that he doesn't. I really don't see what your problem here is - you assumed something, and it was shown you were wrong (perhaps a hint to not make assumptions).\n\n \n Where did he reject the argument made by the article? All I see is that he rejected that it was his reasoning. Could you cite the post where he rejects that article? \n \n \nJust because you are a YEC doesn't mean you accept every belief of every other YECer. For example, I am a rather liberal Democrat like yourself.\n\n \n I'm not a democrat. I didn't vote for Insolvency Candidate #2. And if you consider my positions \"liberal\" you may need to see a doctor, or a political scientist. \n \n \nHowever, someone would be sorely mistaken to think I voted for or even supported or liked Obama.\n\n \n Perhaps if you had posted Obama propaganda without disclaimers, yes. But did you do that? \n \n \nAs another example, I accept evolutionist and am what people would call an \"evolutionist\", and so is someone like GiantOreo and various others. To assume I don't believe in God because the others are atheists, would be wrong as I believe god used evolution to create us.\n\n \n That would be more of a position of stupidity as evolution is not atheistic despite the wishes of some here. \n \n A known YEC posting a YEC argument from a YEC website who doesn't believe in that article?\n \n Really. It would be like Arch posting gay hate articles from www.hategays.com and not supporting it.", 
   {}, 
   332131, 
   null, 
   1226306760.0
  ], 
  [
   332138, 
   null, 
   "obvious_child", 
   "Alright, enough of this off tangent horse ****. \n \n Back to the article at hand. \n \n The article clearly argues that since humans are able to live with crocodiles, then possibly mankind could have lived with dinosaurs.\n \n Independent of the insane argument that ignores geology entirely, the existence of predators is not a reason why creation is wrong.", 
   {}, 
   332134, 
   null, 
   1226308200.0
  ], 
  [
   332146, 
   null, 
   "Iuris", 
   "I don't know what happened with this forum... NOTHING is ever discussed. It switches to ad hominems at the third post...\n \n ON TOPIC:\n \n Cohabitation of dinosaurs and humans is not impossible because dinosaurs were carnivores. After all, there is such thing as herbivorous dinosaurs, and I bet they outnumbered the carnivores, what with the standard predator-prey dynamic.\n \n The reason cohabitation was impossible is simply that there's a huge temporal gap. By the time the first humans appeared, the dinosaurs had already been extinct for a loooooong time.", 
   {}, 
   332138, 
   null, 
   1226331000.0
  ], 
  [
   332226, 
   null, 
   "prschuster", 
   "I don't know what happened with this forum... NOTHING is ever discussed. It switches to ad hominems at the third post...\n \n ON TOPIC:\n \n Cohabitation of dinosaurs and humans is not impossible because dinosaurs were carnivores. After all, there is such thing as herbivorous dinosaurs, and I bet they outnumbered the carnivores, what with the standard predator-prey dynamic.\n \n The reason cohabitation was impossible is simply that there's a huge temporal gap. By the time the first humans appeared, the dinosaurs had already been extinct for a loooooong time.\n\n \n \n \n \n \n Thanks for getting back to the real topic. Now, since we've demolished the argument from this AIG article, there is little else to discuss unless Servant of Christ wants to weigh in.", 
   {}, 
   332146, 
   null, 
   1226359020.0
  ], 
  [
   332969, 
   null, 
   "Darles Charwin", 
   "I'm quite certain dinosaurs and dragons are one in the same. Throughout history, nearly every culture speaks of large, reptilian-like creatures. Some were land-based, others water-based. Some could fly. And remember, we're talking many isolated cultures here which would rule out the possibility that this was worldwide folklore.\n \n Yet what do we discover? The fossilized remains of large, reptilian-like creatures. Some were land-based, others water-based. Some could fly.\n \n Of course this doesn't necessarily mean they lived side-by-side, but it should make any rational, unbiased person stop and think. I wouldn't be surprised if there were still dinosaurs living today, especially those which were water-based.\n \n Anyways, I think it's rather obvious dinos and dragons are one and the same. I think it's so obvious that I would say anyone who disagrees clearly has an agenda.", 
   {}, 
   332069, 
   null, 
   1226824920.0
  ], 
  [
   332994, 
   null, 
   "iangb", 
   "Go to Africa. What will you see?\n \n Deadly, large, reptilian creatures. Commonly known as 'crocodile'.", 
   {}, 
   332969, 
   null, 
   1226853420.0
  ], 
  [
   333064, 
   null, 
   "prschuster", 
   "\"I'm quite certain dinosaurs and dragons are one in the same. Throughout history, nearly every culture speaks of large, reptilian-like creatures. Some were land-based, others water-based. Some could fly. And remember, we're talking many isolated cultures here which would rule out the possibility that this was worldwide folklore.\" ... Charles Darwin\n \n \n Dinosaurs were all land-based. Pterosaurs and plesiosaurs were not dinosaurs. But anyway, the folklore about dragons is about as believable as that about Yetis & Sasquatch, which are also very widespread. The proof lies in the evidence, and so far there is evidence of dinosaurs living 65 million years ago and no concrete evidence of present day dragons. A legend is just that unless you can find one living today (or else a skeleton dated a few thousand years ago). BTW, there is no evidence of fire breathing dinos either for that matter.", 
   {}, 
   332994, 
   null, 
   1226882160.0
  ], 
  [
   333953, 
   null, 
   "baconsbud", 
   "I'm not sure what most of these postings on this are about, just seems to be a lot of name calling. I don't see that the original post really has anything to do with creationism or evolution. So some villagers feed the crocs and the crocs don't eat them. You see that on a regular bases in life and history. What would happen if they quit feeding them? Some of the crocs would probably go to other places for food and others would start attacking the animals and people in the village.", 
   {}, 
   333064, 
   null, 
   1227486540.0
  ], 
  [
   334622, 
   null, 
   "Larni", 
   "Anyways, I think it's rather obvious dinos and dragons are one and the same. I think it's so obvious that I would say anyone who disagrees clearly has an agenda.\n\n \n You don't think Megalania is a better cause of dragon legends? Or salt water crocodiles? Or Komodo dragons?\n \n Occams razor.", 
   {}, 
   332969, 
   null, 
   1227908700.0
  ], 
  [
   334628, 
   null, 
   "trebor", 
   "You don't think Megalania is a better cause of dragon legends? Or salt water crocodiles? Or Komodo dragons?\n \n Occams razor.\n\n \n They have found some dino bone fossils in the ruins of ancient Greek temples. Now, could they be the source of the legends of Giants and Dragons? \n \n Huge bones (rocks or not) can make for a lot of legends.", 
   {}, 
   334622, 
   null, 
   1227917520.0
  ], 
  [
   334669, 
   null, 
   "Iuris", 
   "I'm not sure what most of these postings on this are about, just seems to be a lot of name calling.\n\n \n Quite true. It's just that the people arguing have been arguing for so long already that the history takes over. Years ago, a thread would be answered on topic, with long answers and links to pages long resources. But then, it turned out that the other side never read/discounted as biased/read but obviously failed to understand/... the resources, and so now no one bothers any more. Of course, this made everyone feel that the other side was intellectually dishonest, and so accusations started to fly. \n \n And by now, so many accusations have been flying around for so long that they have evolved and fly on their own...", 
   {}, 
   334628, 
   null, 
   1227966900.0
  ], 
  [
   334672, 
   null, 
   "snakespit", 
   "And by now, so many accusations have been flying around for so long that they have evolved and fly on their own...\n\n \n But you do know that there are going to be some who will argue that these arguments were all created quite recently by some sort of supreme moderator. This moderator created both the arguments that could fly with our help, and those that now fly without our help. Both types of arguments existed side by side since the supreme moderator created the arguments. No matter how much scientific evidence you post supporting the evolution of arguments, you will find those who oppose you by saying that they are privy to special insider information because they know the supreme moderator (by know him, they mean that they have read a book written by followers of an assistant moderator who claimed to be the moderators son long after the supreme moderator supposedly created arguments). \n \n My brain hurts now.", 
   {}, 
   334669, 
   null, 
   1227977280.0
  ], 
  [
   334678, 
   null, 
   "Iuris", 
   "But you do know that there are going to be some who will argue that these arguments were all created quite recently by some sort of supreme moderator. This moderator created both the arguments that could fly with our help, and those that now fly without our help. Both types of arguments existed side by side since the supreme moderator created the arguments. No matter how much scientific evidence you post supporting the evolution of arguments, you will find those who oppose you by saying that they are privy to special insider information because they know the supreme moderator (by know him, they mean that they have read a book written by followers of an assistant moderator who claimed to be the moderators son long after the supreme moderator supposedly created arguments).\n\n \n emoticon_wow\n \n Nonsense. They will instead claim that these arguments could not possibly have evolved on their own as they are far too complex, especially as they have no previous functions that would give them an evolutionary value. Their very existence implies a supreme moderator.", 
   {}, 
   334672, 
   null, 
   1227981720.0
  ], 
  [
   334745, 
   null, 
   "smiley", 
   "emoticon_wow\n \n Nonsense. They will instead claim that these arguments could not possibly have evolved on their own as they are far too complex, especially as they have no previous functions that would give them an evolutionary value. Their very existence implies a supreme moderator.\n\n Further, these people would state as fact that 'their' arguments had been created by the supreme moderator, whereas those of their opponents must be the work of the Lord of Dark Arguments. And that this would be self-evident if only their opponents had the spiritual insight to accept the supreme moderator (and his only moderated son) as their saviour.", 
   {}, 
   334678, 
   null, 
   1228024740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  It may not be dinosaurs living side-by-side with humans, but it\u0092s close!", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11943-may-not-dinosaurs-living-side-side-humans-but-s-close.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 11943, 
  "discussion_files": [
   [
    "28667.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11943-may-not-dinosaurs-living-side-side-humans-but-s-close-print.html"
   ], 
   [
    "28668.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11943-may-not-dinosaurs-living-side-side-humans-but-s-close-5-print.html"
   ], 
   [
    "28669.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11943-may-not-dinosaurs-living-side-side-humans-but-s-close-4-print.html"
   ], 
   [
    "28670.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11943-may-not-dinosaurs-living-side-side-humans-but-s-close-3-print.html"
   ], 
   [
    "28671.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11943-may-not-dinosaurs-living-side-side-humans-but-s-close-2-print.html"
   ]
  ], 
  "identifier": 11943
 }
]