[
 [
  [
   332563, 
   null, 
   "Galileo", 
   "I'll bet that people on the pro-gun side narrowly define freedom as freedom from government control. Yet, this is not the only kind of important freedom.\n \n James Madison in Federalist 51 explained, \"In framing a government which is to be administered by men over men the great difficulty lies in this: You must first enable the government to control the governed, and in the next place, oblige it to control itself.\" \n \n So it appears that government controlling the people so that they do not violate the rights of each other is at least as important as government being controlled to prevent it from becoming tyrannical. When we think about it we can easily see that gun control is a clear example of this. Gun control is about government controlling the people so that they do not use guns to violate the rights of each other. This type of government control is the foundation of a civilized society. In a state of anarchy, might makes right. The strongest people and the people with the most guns dominate. In a civilized society, government is powerful enough to protect the weak and can make sure that disputes between individual are resolved in a more fair manner so that the rights of all are protected. \n \n Which is the more important freedom- freedom from government control of guns or freedom from gun violence and murder?", 
   {
    "post_info": {
     "post_title": "What is Freedom?"
    }
   }, 
   null, 
   null, 
   1226572380.0
  ], 
  [
   332579, 
   null, 
   "NATO 556", 
   "I'll bet that people on the pro-gun side narrowly define freedom as freedom from government control. Yet, this is not the only kind of important freedom.\n\n \n What's freedom? Not what you bloody democrats are proposing?\n \n Higher taxes? Most people can't afford to pay anymore than they already are.\n \n Childproof handguns? \"Childproof\" is just a code word for \"gun that can't ever be used\" and is just a stepping stone to a ban on handguns which aren't \"child proof\". It's absolutely impossible to make one unusable by a child without making it unusable to everyone else as well.\n \n Bigger government? The government is too big as it is.\n \n Banning \"assault weapons\"? The Supreme Court has said that you can't ban entire classes of guns, so anything you deem as \"assault weapon\" has to have immunity.\n \n \nJames Madison in Federalist 51 explained, \"In framing a government which is to be administered by men over men the great difficulty lies in this: You must first enable the government to control the governed, and in the next place, oblige it to control itself.\"\n\n \n I highly doubt that James Madison supported the kind of dystopian governing that my former country initiated, and what this one is trying to initiate.\n \n \nWhich is the more important from freedom- freedom from government control of guns or freedom from gun violence and murder?\n\n \n Freedom from both is important, but only freedom from government has even a chance of being prevented. You can vote against government expansion plans, but you can't vote against criminals killing you because they're better armed.\n \n A lack of guns is not a sign of freedom, it's a sign of enslavement. I should know, I've seen it done.", 
   {}, 
   332563, 
   null, 
   1226592840.0
  ], 
  [
   332601, 
   null, 
   "Charliegone", 
   "I'll bet that people on the pro-gun side narrowly define freedom as freedom from government control. Yet, this is not the only kind of important freedom.\n \n James Madison in Federalist 51 explained, \"In framing a government which is to be administered by men over men the great difficulty lies in this: You must first enable the government to control the governed, and in the next place, oblige it to control itself.\" \n \n So it appears that government controlling the people so that they do not violate the rights of each other is at least as important as government being controlled to prevent it from becoming tyrannical. When we think about it we can easily see that gun control is a clear example of this. Gun control is about government controlling the people so that they do not use guns to violate the rights of each other. This type of government control is the foundation of a civilized society. In a state of anarchy, might makes right. The strongest people and the people with the most guns dominate. In a civilized society, government is powerful enough to protect the weak and can make sure that disputes between individual are resolved in a more fair manner so that the rights of all are protected. \n \n Which is the more important from freedom- freedom from government control of guns or freedom from gun violence and murder?\n\n \n My, my how we love to cherry pick don't we? Did you forget about the last part? If the government keep their side of their bargain why should we? In my state California has gone beyond it's capacity to try to take guns from law abiding citizens. I know, because I live here and have to deal with it. Not only that I have donated and fought hard to get men and women that did NOTHING wrong released from prison because of the insanely stupid laws in this state! It's obvious we have to draw the line and the Supreme court drew that line with Heller vs. Washington DC. Government has also the responsibility to protect those that exercise their right and at the same time protect those that have those rights violated. You are basically saying, \"hey let's limit this right much more so that some one elses right to feel safe is kept.\" emoticon_rolleyes I'm sorry but that is a load of baloney.", 
   {}, 
   332563, 
   null, 
   1226604420.0
  ], 
  [
   332603, 
   null, 
   "Lurch907", 
   "James Madison in Federalist 51 explained, \"In framing a government which is to be administered by men over men the great difficulty lies in this: You must first enable the government to control the governed, and in the next place, oblige it to control itself.\" \n\n \n I believe you are misinterpreting Mr. Madison. James Madison made it clear throughout his writings that a powerful government was something to be worried about and carefully watched.\n But, lets say your right. Where do you draw the line? For example: seeing as religion has most likely killed more people than cancer, under your theory, what is to stop government from outlawing organized religion? You once told me you were studied in the ways of Joseph Smith and Brigham Young, would you be willing to give up your freedom of religion to protect other freedoms?", 
   {}, 
   332563, 
   null, 
   1226605140.0
  ], 
  [
   332609, 
   null, 
   "Lurch907", 
   "\"[T]he advantage of being armed, which the Americans possess over the people of almost every other nation, the existence of subordinate governments, to which the people are attached, and by which the militia officers are appointed, forms a barrier against the enterprises of ambition, more insurmountable than any which a simple government of any form can admit of. Notwithstanding the military establishments in the several kingdoms of Europe, which are carried as far as the public resources will bear, the governments are afraid to trust the people with arms.\"\n \n The above quote from James Madison clearly expresses his view that an armed populace keeps gov't and gov't controlled militias in check. Also, that the governments of other nations did and should fear an armed populace.\n I'm afraid your barking up the wrong tree trying to use Madison to support gun control.", 
   {}, 
   332603, 
   null, 
   1226610840.0
  ], 
  [
   332618, 
   null, 
   "NATO 556", 
   "Galileo-\n \n What you call freedom is nothing more than a perversion of the concept of freedom.", 
   {}, 
   332563, 
   null, 
   1226619720.0
  ], 
  [
   332704, 
   null, 
   "Ethmi", 
   "\n James Madison in Federalist 51 explained, \"In framing a government which is to be administered by men over men the great difficulty lies in this: You must first enable the government to control the governed, and in the next place, oblige it to control itself.\" \n\n \n Define control of the people.", 
   {}, 
   332563, 
   null, 
   1226695020.0
  ], 
  [
   332794, 
   null, 
   "Brady", 
   "rich people can take away poor peoples freedom\n thats why marx was so important\n he showed us that goverment can be the great equaliser because if \n only government owns property then nobody will be rich and we will all be equal", 
   {}, 
   332704, 
   null, 
   1226750820.0
  ], 
  [
   332805, 
   null, 
   "NATO 556", 
   "rich people can take away poor peoples freedom\n thats why marx was so important\n he showed us that goverment can be the great equaliser because if \n only government owns property then nobody will be rich and we will all be equal\n\n \n I believe that the theory you speak of is called slavery; everybody is equal because they have nothing and need to work long and hard just to earn the privilege of living in order to serve their masters.", 
   {}, 
   332794, 
   null, 
   1226767080.0
  ], 
  [
   334329, 
   null, 
   "Galileo", 
   "I recently saw Michael Moore's Sicko. It reminded me of this thread. People who have opposed government control of healthcare have tried to associate such control with tyranny and communism just as people who oppose government control of guns try to associate gun control with tyranny and communism. I think this is largely paranoia. Moore investigates healthcare in Canada, France, the UK, and Cuba and finds that people in these nations are living longer, healther lives than Americans. Yes, people in these nations have less freedom from government control of healthcare but they also have greater freedom from death, disease, and sickness. So which is the greater freedom? That brings us back to the question in the first post-\n Which is the more important freedom- freedom from government control of guns or freedom from gun violence and murder?", 
   {}, 
   332805, 
   null, 
   1227690300.0
  ], 
  [
   334346, 
   null, 
   "NATO 556", 
   "I recently saw Michael Moore's Sicko. It reminded me of this thread. People who have opposed government control of healthcare have tried to associate such control with tyranny and communism just as people who oppose government control of guns try to associate gun control with tyranny and communism. I think this is largely paranoia.\n \n \n I came from England. I know about government sponsored health care and gun control, and it IS a sign of communism and tyranny. Just because you don't spend three grand for a routine checkup doesn't mean that you live in the better country.\n \n I've been to the hospitals in England, you get treated like dirt; by the doctors that will treat you that is. A lot of them won't see anyone if they go by the government payment plan, they'll only see patients that can pay on their own.\n \n \nMoore investigates healthcare in Canada, France, the UK, and Cuba and finds that people in these nations are living longer, healther lives than Americans. Yes, people in these nations have less freedom from government control of healthcare but they also have greater freedom from death, disease, and sickness. So which is the greater freedom?\n\n \n Zoo animals live longer than animals in the wild, but they're confined to cages for the duration of their lives. Which would you rather have, freedom or longevity? Living or just merely existing?\n \n \nWhich is the more important freedom- freedom from government control of guns or freedom from gun violence and murder?\n\n \n These two aren't interchangeable. What stupid Americans like you don't understand is that revoking the Second Amendment wouldn't play any part on protecting anyone from criminals that're armed with guns. You already have all the laws you need to put away every armed criminal for many, many years, but you choose not to, because you're too weak and limp wristed in your approach. Toughen up or p**s off and let the conservatives do the job, they'll lock the bad guys away and take them out of the public so they can't do anymore harm.", 
   {}, 
   334329, 
   null, 
   1227717000.0
  ], 
  [
   334354, 
   null, 
   "Bryan", 
   "When I consider the concept of individual liberty where my government seeks to become involved, then I consider liberty to be the ability to live my life free from arbitrary restrictions and purposeless restraints imposed by my government. \n \n Now I know many individual rights in the BoR are expressed in absolute terms (2nd. Amendment \"shall not be infringed,\" 1st. Amendment \"congress shall make no law,\" etc.) But SCOTUS has always recognized these rights are not absolute. Certain restrictions have always been justified. \n \n Let me offer a SCOTUS case as an illustration of the concept of \"liberty.\" It will show how SCOTUS deals with any restriction on individual liberty by balancing liberty with the needs of an orderly society. \n \n The case is Moore v. East Cleveland, 431 U.S. 494, 501-502 (1977) It involved a housing ordinance which made it a crime to allow people to live with you who were not from the same \"family.\" The ordinance defined \"family\" so narrowly that it made it a crime for a grandmother to allow her grandson to live with her. Grandma was convicted of violating the ordinance, and she appealed claiming a due process violation. SCOTUS declared the ordinance unconstitutional. \n \n The Moore court quoted with approval from a dissent by Justice Harlan in Poe v. Ullman. This quote has since become accepted SCOTUS doctrine, and it will help you understand how SCOTUS evaluates a claim that a law has unconstitutionally infringed upon a protected liberty interest. The Harlan quote contains a powerful assertion of the \"penumbra doctrine\" (which says SCOTUS can on its own find all kinds of things not specified in the Constitution and grant them the status of individual rights-abortion being the most recognizable one). The quote also contains a warning about unfettered use of that power. Here is the quote:\n \n \"Due process has not been reduced to any formula; its content cannot be determined by reference to any code. The best that can be said is that through the course of this Court's decisions it has represented the balance which our Nation, built upon postulates of respect for the liberty of the individual, has struck between that liberty and the demands of organized society. If the supplying of content to this Constitutional concept has of necessity been a rational process, it certainly has not been one where judges have felt free to roam where unguided speculation might take them. The balance of which I speak is the balance struck by this country, having regard to what history teaches are the traditions from which it developed as well as the traditions from which it broke. That tradition is a living thing. A decision of this Court which radically departs from it could not long survive, while a decision which builds on what has survived is likely to be sound.8 No formula could serve as a substitute, in this area, for judgment and restraint. [Page 502]\n \n \". . . [T]he full scope of the liberty guaranteed by the Due Process Clause cannot be found in or limited by the precise terms of the specific guarantees elsewhere provided in the Constitution. This 'liberty' is not a series of isolated points pricked out in terms of the taking of property; the freedom of speech, press, and religion; the right to keep and bear arms; the freedom from unreasonable searches and seizures; and so on. It is a rational continuum which, broadly speaking, includes a freedom from all substantial arbitrary impositions and purposeless restraints, . . . and which also recognizes, what a reasonable and sensitive judgment must, that certain interests require particularly careful scrutiny of the state needs asserted to justify their abridgment.\" Poe v. Ullman, supra, at 542-543 (dissenting opinion).\n \n Laudable goals in legislation are perfectly fine, but paternalistic motives cannot be allowed to save legislation which unconstitutionally infringes upon a core individual liberty expressed in the BoR. For example, claimed increases in health and safety should not be automatically assumed to be fair compensation for the surrender of liberty.\n \n ---\n \n The issue, however, is not whether court rules are \"mutable\"; they assuredly are. It is not whether, in the light of \"various circumstances,\" they can be \"modifi[ed]\"; they assuredly can. The issue is whether, as mutated and modified, they must make sense. The requirement that they do so is the only thing that prevents this Court from being some sort of nine-headed Caesar, giving thumbs-up or thumbs-down to whatever outcome, case by case, suits or offends its collective fancy. Dickerson v. United States, 530 U.S. 428, 455 (2000) (Scalia, dissenting).\n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, New haven, 1921.\n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\" Justice Brandeis, Olmstead v. United States, 277 U.S. 438, 485 (1928) (dissenting opinion).", 
   {
    "post_info": {
     "post_title": "liberty v. the needs of society"
    }, 
    "unicode_changes_made": true
   }, 
   334346, 
   null, 
   1227720600.0
  ], 
  [
   334397, 
   null, 
   "Lurch907", 
   "Which is the more important freedom- freedom from government control of guns or freedom from gun violence and murder?\n\n \n You speak as if these two things are mutually exclusive, they are not. Government control of guns only works on those willing to obey the law. Government cannot control criminals, they can and should however punish them when they catch them.\n Allow me to ask you a question: Which is more important a perceived saftey via government control or the freedoms endowed by our creator and enumerated in the bill of rights?\n I asked you before (you didn't answer) what rights are you willing to give up for what you perceive as a safer life? You once posted that you were studied in the ways of Joseph Smith and Brigham Young, as it could be argued that religion has killed more people then cancer would you be willing to give up that freedom? How about if the government said you can own a Bible but not a Koran? Or you could only buy one religios text per month?", 
   {}, 
   334329, 
   null, 
   1227738840.0
  ], 
  [
   337876, 
   null, 
   "votewithabullet", 
   "I define freedom as being able to do what you want. On a collective scale, I define it as people being able to do what they want, as long as it doesn't hinder other people to do what they want. Me owning an MP-5, or whatever, does not hinder anyone else's ability to do what they want (accept if they try to hinder me from doing what I want, to an extent :)). Me shooting someone does hinder them from doing what they want. That's why shooting people should be illegal, and owning a MP-5 should not be.\n \n This reminds of a quote I still remember from 4th grade: \"The right to swing my fist ends where the other man's nose begins.\"\n -Oliver Wendell Holmes", 
   {}, 
   334397, 
   null, 
   1230132960.0
  ], 
  [
   337877, 
   null, 
   "iangb", 
   "I'm still on/off writing my long-winded reply to Bryan's question from a while ago which would fit quite well into this thread; so when it's done I'll put that here. For now, though, a reply to NATO regarding his continued misrepresentation of Britain.\n \n I could reply about other things aswell, but hopefully they'll be covered in my response to Bryan.\n \n \nI came from England. I know about government sponsored health care and gun control, and it IS a sign of communism and tyranny. Just because you don't spend three grand for a routine checkup doesn't mean that you live in the better country.\n \n I've been to the hospitals in England, you get treated like dirt; by the doctors that will treat you that is. A lot of them won't see anyone if they go by the government payment plan, they'll only see patients that can pay on their own.\n\n Entirely false. There are a few instances of failings and the newspapers seize on these - but largely, the UK system works very well. The private system is there for those that want to pay for it, and the government system does well to care for the rest.\n \n \nYou already have all the laws you need to put away every armed criminal for many, many years, but you choose not to, because you're too weak and limp wristed in your approach. Toughen up or p**s off and let the conservatives do the job, they'll lock the bad guys away and take them out of the public so they can't do anymore harm.\nThe US already locks up almost 10% of it's population at any one time, and yet still has a very high (for a developed country) violent crime rate.\n Something tells me your approach isn't working.\n \n EDIT: More info on that is here and here - the US has the highest documented incarceration rate in the world. Yes, wikipedia is hosting it - but the image is not from wikipedia and the source from the graph/data is cited.", 
   {}, 
   337876, 
   null, 
   1230134460.0
  ], 
  [
   338336, 
   null, 
   "Heywood Jablome", 
   "I do not know what \"Freedom\" Is for you, or any other man. I do Know what liberty is and I also know that ones rights are supposed to be Non-obligatory, meaning my rights can not infringe on yours. Is that your point?", 
   {}, 
   337877, 
   null, 
   1230708000.0
  ], 
  [
   338455, 
   null, 
   "Ethmi", 
   "I recently saw Michael Moore's Sicko. It reminded me of this thread. People who have opposed government control of healthcare have tried to associate such control with tyranny and communism just as people who oppose government control of guns try to associate gun control with tyranny and communism. I think this is largely paranoia. Moore investigates healthcare in Canada, France, the UK, and Cuba and finds that people in these nations are living longer, healther lives than Americans. Yes, people in these nations have less freedom from government control of healthcare but they also have greater freedom from death, disease, and sickness. So which is the greater freedom? That brings us back to the question in the first post-\n Which is the more important freedom- freedom from government control of guns or freedom from gun violence and murder?\n\n \n You're citing another crappy movie by Michael the Hutt? Man, it doesn't take an addicted researcher kept up two weeks by a thousand cups of coffee to know that Michael Moore is one of the most left-wing, anti-gun, troop-bashing producers in Hollywood. And what does that fat ignoramus have? He's ignorant. All he has is an opinion, just like you and I do. The fact that he is a celebrity does not make him any more knowledgeable than anyone else, especially when you consider that he thinks that he's the divine prophet of the universe, and that everything will be fine and dandy if you do what he says we should do.", 
   {}, 
   334329, 
   null, 
   1230777360.0
  ], 
  [
   338564, 
   null, 
   "Charliegone", 
   "You're citing another crappy movie by Michael the Hutt? Man, it doesn't take an addicted researcher kept up two weeks by a thousand cups of coffee to know that Michael Moore is one of the most left-wing, anti-gun, troop-bashing producers in Hollywood. And what does that fat ignoramus have? He's ignorant. All he has is an opinion, just like you and I do. The fact that he is a celebrity does not make him any more knowledgeable than anyone else, especially when you consider that he thinks that he's the divine prophet of the universe, and that everything will be fine and dandy if you do what he says we should do.\n\n \n Not only that he does a lot of chop and tape to make his stupid insane views work. Ever seen the Bowling for Columbine when shoes the clips of Charlton Heston? One clip showed him wearing one suit while the other showed a different one. If your dumb enough to believe that, your dumb enough to fall for anything.", 
   {}, 
   338455, 
   null, 
   1230858240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is Freedom?", 
  "url": "http://www.4forums.com/political/gun-control-debates/11964-what-freedom.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 11964, 
  "discussion_files": [
   [
    "6202.html", 
    "http://www.4forums.com/political/gun-control-debates/11964-what-freedom-print.html"
   ], 
   [
    "6203.html", 
    "http://www.4forums.com/political/gun-control-debates/11964-what-freedom-2-print.html"
   ]
  ], 
  "identifier": 11964
 }
]