[
 [
  [
   333515, 
   null, 
   "Archangel", 
   "I was only mildly interested in this story of Piracy until I saw the location of all of the most recent hijackings, so I posted the map also so you could see the placement of the Gulf of Aden. What disturbs me most is what they aren't telling us. I believe the pirates are members of Al Qaida or an arm of it, and are using this as a method to raise quick cash in order to finance future attacks on whom ever. Most likely the USA/Israel or Europe though. No reports at all have attributed these attacks to this terrorist group or any terrorist groups at all, even though they're working right in the main shipping lane of the Gulf's largest Oil Producers. \n \n The question is, what are they planning which requires so much money?\n Nov 20, 2008\n Gulf of Aden piracy\n Out of control\n Indian Navy destroys pirate 'mothership' but attacks on vessels continue\n MOGADISHU: The Indian Navy said it has destroyed a Somali pirate 'mothership', as bandits continued launching attacks and demanded a ransom for a Saudi super-tanker seized in their most daring raid yet.\n \n With shipping groups reporting a new surge in hijackings off Somalia, the International Maritime Bureau said pirates based in the lawless African country were now 'out of control'.\n \n The Indian frigate INS Tabar, one of dozens of warships from several countries protecting shipping lanes in the Gulf of Aden, attacked the pirate ship late on Tuesday after coming under fire, navy spokesman Nirad Sinha said.\n \n 'The INS Tabar closed in on the mother vessel and asked her to stop for investigation,' he said. 'But on repeated calls, the vessel's threatening response was that she would blow up the naval warship' if it approached.\n \n 'The vessel...subsequently fired on the INS Tabar, and the warship retaliated in self-defence. Explosions were heard, possibly due to exploding ammunition that was stored on the vessel.'\n \n Pirates had been on the upper deck with automatic weapons and rocket-propelled grenade launchers, he said.\n \n Also yesterday, Kenyan police paraded eight suspected pirates in a Mombasa court, after Britain's Royal Navy captured them and killed two others in the Gulf of Aden last week, while other pirates freed a Hong Kong-flagged ship and 25 crew members seized two months ago.\n \n But overall, the piracy crisis has grown since last Saturday's capture of Saudi super-tanker Sirius Star, with its full load of two million barrels of oil worth an estimated US$100 million (S$153 million).\n \n Al-Jazeera television broadcast an audio tape that it said was one of the pirates making a ransom demand.\n \n 'Negotiators are located on board the ship and on land. Once they have agreed on the ransom, it will be taken in cash to the oil tanker,' said the man identified as Farah Abd Jameh.\n \n Vela International, the owners of the ship, would not comment on the report, but Saudi Arabia's Foreign Minister confirmed that the company had begun talks.\n \n There was no official comment on how much the pirates were demanding, but they appeared to be holding out for far more than the average ransom of between US$300,000 and US$1.5 million.\n \n Britain's Daily Mail reported that officials involved in the release of previous ships claimed that 'electronic monitoring' showed they 'were talking' of at least US$10 million, while a Somali website put the figure at a massive US$250 million.\n \n And since taking their biggest prize to date, the pirates have hijacked three more ships.\n \n Mr Andrew Mwangura, from the East African Seafarers Association, said a Thai fishing boat, a Hong Kong-registered cargo ship and a Greek bulk carrier were seized on Tuesday in the gulf.\n \n 'The latest confirmation we got was the seizure of the Greek cargo ship that was taken yesterday afternoon in the Gulf of Aden,' he said.\n \n The Greek merchant marine ministry said it had no word of a Greek-flagged or Greek-owned vessel being seized.\n \n But Chinese officials said the Hong Kong-flagged MV Delight was seized in the Gulf of Aden. With a crew of 25, it was carrying 36,000 tonnes of wheat to Iran.\n \n On the same day, pirates operating near the Yemen coast hijacked a Thai-operated fishing boat that was heading towards the Red Sea.\n \n The Gulf of Aden controls access to the Suez Canal, which allows ships to go between Europe and Asia without having to take the longer and more expensive route around the southern tip of Africa. It is a crucially important route for oil tankers.\n \n Nato, the United States and a number of European nations have all sent ships to the region to try to stop the piracy, which has increased instead.\n \n The German navy said on Tuesday that one of its frigates had foiled attacks on two ships in the Gulf of Aden, using a helicopter to chase off pirates who fled in their speedboats.\n \n South Korea, Japan, and Saudi Arabia are also considering sending warships to help secure the area.\n \n The International Maritime Bureau has called on the United Nations to act over the piracy, with the head of its piracy reporting centre saying: 'The situation is already out of control.'\n \n AGENCE FRANCE-PRESSE, REUTERSOut of control\n \n http://upload.wikimedia.org/wikipedia/commons/archive/b/b4/20050812042746!Gulf_of_Aden.png", 
   {
    "post_info": {
     "post_title": "Gulf of Aden: Piracy out of control"
    }
   }, 
   null, 
   null, 
   1227164760.0
  ], 
  [
   333520, 
   null, 
   "obvious_child", 
   "I believe the pirates are members of Al Qaida or an arm of it, and are using this as a method to raise quick cash in order to finance future attacks on whom ever.\n\n \n That is questionable, especially given how they are spending that money on lavish houses, cars and spending it so freely that in certain towns they are supporting new restaurants to internet cafes. That's not in line with Islamic radical terrorism. They appear to be spending the money on personal consumption for personal gain. Again, not Islamic terrorists. And they treat their hostages well. Very strange for Islamic terrorists. How many Islamic terrorists that are in the tree of Bin Laden hire chiefs and import specific non-kosher ingredients to make Western dishes for their hostages? This sounds like a bunch of people who realizes that piracy is a way to make a living in war torn, poor Somalia. \n \n \npirates are building sprawling stone houses, cruising in luxury cars, marrying beautiful women &#8212; even hiring caterers to prepare Western-style food for their hostages.\n\n \n The Associated Press: Somali pirates transform villages into boomtowns", 
   {}, 
   333515, 
   null, 
   1227172320.0
  ], 
  [
   333524, 
   null, 
   "Archangel", 
   "That is questionable, especially given how they are spending that money on lavish houses, cars and spending it so freely that in certain towns they are supporting new restaurants to internet cafes. That's not in line with Islamic radical terrorism. They appear to be spending the money on personal consumption for personal gain. Again, not Islamic terrorists. And they treat their hostages well. Very strange for Islamic terrorists. How many Islamic terrorists that are in the tree of Bin Laden hire chiefs and import specific non-kosher ingredients to make Western dishes for their hostages? This sounds like a bunch of people who realizes that piracy is a way to make a living in war torn, poor Somalia. \n \n \n \n The Associated Press: Somali pirates transform villages into boomtowns\n\n \n I hope this info is accurate, and I agree with you that these don't appear to be expenditures that terrorists would make. As terrible as this crime spree is, it would be preferable that they are spending the money on luxuries than on terrorist attacks. This is the very first thing I've seem on their spending habits also. One would think this aspect of the Pirates lives would be exposed and I must ask, if they are being this obvious in their spending with no evidence of legally earning it, why haven't they been arrested yet?", 
   {}, 
   333520, 
   null, 
   1227194460.0
  ], 
  [
   333550, 
   null, 
   "Penfold", 
   "Living in a place which has not had an effective central government for almost 20 years might have something to do with it. The fact that the average Somali income is around $500 per annum makes bribery of any official which might exist simple, and if you buy your local warlord's help, they might even chase the Americans out of your country!", 
   {}, 
   333524, 
   null, 
   1227210960.0
  ], 
  [
   333587, 
   null, 
   "obvious_child", 
   "One would think this aspect of the Pirates lives would be exposed and I must ask, if they are being this obvious in their spending with no evidence of legally earning it, why haven't they been arrested yet?\n\n \n Because Somalia's government can't do ####. It can't even police Mogadishu much less the north.", 
   {}, 
   333524, 
   null, 
   1227219120.0
  ], 
  [
   333829, 
   null, 
   "simone", 
   "Between the Pirates of the Middle East and the Equity Brokers of Wall Street:\n \nPirate hijackings of oil tankers have surged 75% during 2008, according to the International Maritime Bureau's weekly piracy report. (Who knew?) And they're making good money - better money, this year, than most of the beleaguered money men of Wall Street. \n \n In these upside-down days of credit crisis (and in part because they just sound kind of similar) we got to thinking. What makes for better returns: Piracy or private-equity?\n \n The answer says a lot about the state of the buyout business, which spent hundreds of billions of dollars on deals that are today deeply underwater.\n \n Here's how the two compare.\n \n Public Profile\n \n Piracy: Treated with scorn in the past, as practitioners were called barbarians. Blamed for international wars such as the First Barbary War of 1801 to 1805. Illegal.\n \n Private equity: Treated with scorn in the past. Famously dubbed Barbarians at the Gate in the 1988 book on KKR's takeover of RJR Nabisco. Currently skirmishing with Congress over carried interest, or the amount of taxes paid on investment gains. Legal.\n \n Business model\n \n Piracy: Seize assets; make money by causing distress; demand ransom; \"all for one, one for all\" partnership model.\n \n Private equity: Seize assets; make money by reducing distress; dividend recap, then sale or IPO; \"all for one, one for all\" partnership model.\n \n Compensation structure\n \n Private equity: Management fees and carried interest. Average yearly salary of $885,000. Invest money, then divide booty when the effort is successful.\n \n Pirates: Ransom. No taxes. Somali pirates earned $50 million last year. Hijack ships, then divide booty when the effort is successful.\n \n Year-to-date performance\n \n Private equity: Volume down. Returns abysmal. Expected annual return of about 15%, which is down significantly from the 28% to 30% return of previous years.\n \n Piracy: Volume up. Returns rising. Target hit rate of nearly 100%, much to the chagrin of the chairman of the Joint Chiefs of Staff.\n \n Investment horizon/lifespan\n \n Piracy: Only the number of days it takes to receive a wire transfer for $500,000 to $2 million, which is the average ransom on an oil tanker. Investment lifespan ranges from several days to several weeks.\n \n Private equity: Three to five years for each company purchased, on average. Given high asset prices and grim economic outlook, that could push the horizon even longer, seriously crimping returns. With a coming shakeout in the business, that is diminishing fund lifespans.\n \n Geographical investment thesis\n \n Private equity: Bullish on China.\n \n Piracy: Opportunities on the coast of Africa.\n \n Start-up costs\n \n Piracy: Gun, boats, a handful of men, rocket-propelled grenades.\n \n Private equity: Office on Park Avenue.\n \n Jargon\n \n Private equity: \"Internal rate of return,\" called IRR.\n \n Piracy: Eerily similar: \"Aaar.\"\n\n \n Thanks to Heidi N. Moore in a blog on the Wall Street Journal website.\n Deal Journal - WSJ.com : Piracy v. Private Equity: A Comparison", 
   {
    "post_info": {
     "post_title": "Here's an interesting comparison..."
    }, 
    "unicode_changes_made": true
   }, 
   333515, 
   null, 
   1227384600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gulf of Aden: Piracy out of control", 
  "url": "http://www.4forums.com/political/news-forum/11998-gulf-aden-piracy-out-control.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 11998, 
  "discussion_files": [
   [
    "10397.html", 
    "http://www.4forums.com/political/news-forum/11998-gulf-aden-piracy-out-control-print.html"
   ]
  ], 
  "identifier": 11998
 }
]