[
 [
  [
   333791, 
   null, 
   "Brady", 
   "&#8220;Perhaps the most compelling purely political story in this data is that the National Rifle Association is losing their old power to turn elections. A 79 percent majority of voters say that America&#8217;s most famous interest group was not an important factor in deciding the election; fully 74 percent of gun owners agree and say the NRA wasn&#8217;t a factor&#8230; We suspect it is because it&#8217;s a post-Heller world.&#8221; \n \n More than three-quarters said they would support reasonable gun restrictions. Fully 83 percent of all voters favor criminal background checks for all gun sales, including 83 percent of moderates and 84 percent of McCain voters. \n \n There is extensive support for a wide variety of gun restrictions, including criminal background checks, registration, assault weapon bans, and a five-day waiting period for handgun sales.  Even though these are initiatives that the National Rifle Association opposes, a majority of gun owners still support almost all gun laws tested in the poll. The only exception is when it comes to limiting the number of guns that can be bought at one time, where only 42% of gun owners say they could support the measure. But support remains constant for all other groups, including people who voted for John McCain. \n \n Voters also say that they want to get things done quickly during the upcoming Obama Presidency.  More than two-thirds said that the gun laws they support should be adopted during the first year of the next administration. This is true for McCain voters and gun owners too.  \n Brady Campaign to Prevent Gun Violence\n \n people just arent falling for the NRAs tricks anymore\n the time has really come to kick gun nut butt", 
   {
    "post_info": {
     "post_title": "Voter Poll Data Show Broad Support For Stronger Gun Laws"
    }
   }, 
   null, 
   null, 
   1227364860.0
  ], 
  [
   333800, 
   null, 
   "NATO 556", 
   "Mr. Brady-\n \n Not a single one of the democrats who got elected this term ran on an anti-gun campaign. None of them made the statement of \"I support strict gun control laws and if elected I'll do everything I can to make it more difficult than ever to get a gun\". No Brady, Americans aren't in favor of more gun control laws. If we were then Obama wouldn't have changed his Second Amendment standpoint after the Heller decision to say that he actually supported the individual rights interpretation.\n \n Since none of the elected democrats could openly support gun control as their political agenda and chose to remain silent on the issue, it echoes loudly of just how suicidal such a position is in today's world.\n \n I was here for the 2004 elections, and the same thing was claimed when the democrats got the congressional majority. People like you claimed that Americans were in favor of more gun control, but none of those elected candidates made promises of supporting gun control when they ran for office. If they had then the republicans would still control the house, senate, and the white house.", 
   {}, 
   333791, 
   null, 
   1227371040.0
  ], 
  [
   333809, 
   null, 
   "Jo Bennett", 
   "The reason the dems wimp out is because the gun nuts votes are likely to be swayed by a candidate's position on gun control, whereas non gun nuts, while having an opinion, are most likely concerned about other issues. It is the same reason people don't tend to come out loudly pro-choice, even though the majority of the US population are pro-choice.", 
   {}, 
   333800, 
   null, 
   1227376020.0
  ], 
  [
   333973, 
   null, 
   "Ethmi", 
   "The reason the dems wimp out is because the gun nuts votes are likely to be swayed by a candidate's position on gun control, whereas non gun nuts, while having an opinion, are most likely concerned about other issues. It is the same reason people don't tend to come out loudly pro-choice, even though the majority of the US population are pro-choice.\n\n \n Uh, by gun nuts are you refering to anyone who owns a gun? Do you deny that Archie, me, Mega, Grizzly, and others have discussed what effects Obama's policies (particulary his energy policies) would have on the economy? Geez, your veiws are getting closer to Brady's, whose dislike for gun owners is near-bigotry.\n \n But aside from this, how do you figure that? Your side always has tryed (normally in vain) to be activists.", 
   {}, 
   333809, 
   null, 
   1227493740.0
  ], 
  [
   334009, 
   null, 
   "Jo Bennett", 
   "Uh, by gun nuts are you refering to anyone who owns a gun? Do you deny that Archie, me, Mega, Grizzly, and others have discussed what effects Obama's policies (particulary his energy policies) would have on the economy? Geez, your veiws are getting closer to Brady's, whose dislike for gun owners is near-bigotry.\n \n But aside from this, how do you figure that? Your side always has tryed (normally in vain) to be activists.\n\n \n I don't mean anyone who owns a gun. Clearly from the polling posted some gun owners are perfectly reasonable people. It's just the NRA aren't among them. Thing is, if 5% of democrats are rabidly pro-gun and you're a congressman in a district that has 3% more dems than repubs, you're not going to take the risk even if 95% of dems and 20% of repubs agree with you on guns, because it will be the gun nuts that switch sides over gun control.", 
   {}, 
   333973, 
   null, 
   1227510240.0
  ], 
  [
   334011, 
   null, 
   "NATO 556", 
   "Mr Bennett-\n \n Perhaps you can explain some things to me.\n \n What is reasonable about being told that you can't own a gun with certain cosmetic features attached?\n \n What is reasonable about being told \"You're not allowed to have more than 10 rounds of ammunition per magazine, and if you even try you're going to prison for 10 years\"?\n \n What is reasonable about politicians deciding we shouldn't be allowed to own guns that aren't designed purely for hunting game animals?\n \n What is reasonable about lawsuits to be brought against manufacturers for the specific purpose of driving them out of business through bankruptcy?\n \n What is reasonable about denying the legal claim of self-defense to an individual who was forced to shoot and kill a violent home invader?\n \n What is reasonable about outlawing a gun shop within five miles of a school, park, or another gun shop?\n \n What is reasonable about a total ban on handguns when the Supreme Court has said that such is not allowable?\n \n What is reasonable about paying money to people who don't file/pay their income taxes?\n \n What is reasonable about destroying our nation's defense systems?\n \n How in the name of hell do any of these Obama sanctioned schemes able to be considered \"reasonable\"? What brand of twisted logic is applied in such a situation?", 
   {}, 
   334009, 
   null, 
   1227513300.0
  ], 
  [
   334014, 
   null, 
   "Penfold", 
   "The evidence for these wild exaggerations? Not lists from gun nut sites, but policy statements or press releases from Democrat party sites.", 
   {}, 
   334011, 
   null, 
   1227531780.0
  ], 
  [
   334025, 
   null, 
   "Ethmi", 
   "I don't mean anyone who owns a gun. Clearly from the polling posted some gun owners are perfectly reasonable people. It's just the NRA aren't among them. Thing is, if 5% of democrats are rabidly pro-gun and you're a congressman in a district that has 3% more dems than repubs, you're not going to take the risk even if 95% of dems and 20% of repubs agree with you on guns, because it will be the gun nuts that switch sides over gun control.\n\n \n You're generalizing? You're saying that the NRA isn't a reasonable organziation? Uh, saying that there are radicals in the NRA is not the same as saying that the NRA is radical.", 
   {}, 
   334009, 
   null, 
   1227541680.0
  ], 
  [
   334272, 
   null, 
   "TRIGGER", 
   "I don't mean anyone who owns a gun. Clearly from the polling posted some gun owners are perfectly reasonable people. It's just the NRA aren't among them. Thing is, if 5% of democrats are rabidly pro-gun and you're a congressman in a district that has 3% more dems than repubs, you're not going to take the risk even if 95% of dems and 20% of repubs agree with you on guns, because it will be the gun nuts that switch sides over gun control.\n\n \n There was a poll done I beleave last year and sorry I don't have a link I wish I did but it was about like this 61% of republicans were pro gun the indpendants were like 53% and dems were about 46%. I like that this info is comming from the Brady bunch which has stated that childrens deaths due to guns has doubled every year since 1950. Yep I don't beleave anything comming out of that out fit.", 
   {}, 
   334009, 
   null, 
   1227665460.0
  ], 
  [
   334276, 
   null, 
   "Charliegone", 
   "I do not know where people get this information that the NRA is full of \"gun nuts\" or the such. I'll tell you now, that is just pure bs. I'll tell the facts right here. The majority of gun owners earn a higher income and are college educated. The NRA promotes purely responsible gun ownership. The NRA would NEVER support irresponsibility. EVER! These \"gun nuts\" you speak of are in the very low numbers in which the media just loves to focus on. It's like when there's a shooting in south central LA they go seek out the most \"ghetto\" sounding person there to do an interview with.", 
   {}, 
   334272, 
   null, 
   1227666000.0
  ], 
  [
   334328, 
   null, 
   "Galileo", 
   "You're generalizing? You're saying that the NRA isn't a reasonable organziation? Uh, saying that there are radicals in the NRA is not the same as saying that the NRA is radical.\n\n It really needs to be said- the NRA is anything but reasonable. How can an organization that has a history of opposing reasonable gun control be considered reasonable? How can an organization that has a long history of supporting legislation which makes it harder for law enforcement to catch the bad guys and enforce the law be considered reasonable? They have opposed the ATF for years and even tried to abolish it in the 1980s. How can an organization that has supported a radical rebel-against-the-government ideology- an ideology that ultimately led to the Oklahoma City bombings be considered reasonable? How can an organization that resorts to two faced lying to gain an advantage over its opponents be considered reasonable? How can an organization that shamelessly resorts to spreading lies about people in law enforcement that oppose it on gun control issues be considered reasonable? For example, the NRA ran full page ads falsely claiming that police chief Joseph McNamara supported legalizing \"drugs, marijuana, cocaine, heroin, crack.\" The NRA was trying to discredit McNamara because he supported the Brady Bill. In Georgia, the NRA alienated many of its own members and was criticized for \"acting like a hysterical teenaged girl\" by a pro-gun State Senator after it pushed its guns at work bill. A lot of people on the pro-gun side couldn't understand why the NRA wanted to violate the private property rights of business owners.", 
   {}, 
   334025, 
   null, 
   1227689100.0
  ], 
  [
   334345, 
   null, 
   "NATO 556", 
   "[QUOTE]\nIt really needs to be said- the NRA is anything but reasonable. How can an organization that has a history of opposing reasonable gun control be considered reasonable?\n\n \n Perhaps you can explain this to me better.\n \n What exactly is reasonable about a ban on commonly available firearms that're equipped with certain cosmetic features that play absolutely no part on the overall functionality of the firearm?\n \n What exactly is reasonable about a ban on detachable box magazines that hold more than 10 rounds of ammunition?\n \n What exactly is reasonable about a ban on the .50 BMG caliber and rifles chambered for it?\n \n What exactly is reasonable about rationing handgun sales to one a month?\n \n What exactly is reasonable with making it a crime to use lead ammunition for hunting purposes?\n \n What exactly is reasonable about placing blame on the victim of theft and home invasion?\n \n What exactly is reasonable about being against bills that clarify a person's right to self defense?\n \n What exactly is reasonable about serializing ammunition when the current registration programs haven't helped solve any crimes?\n \n I want explanations to these questions, not answering a question with another question. If you can't provide clear and in depth explanations about how each of these would qualify as being reasonable laws, then you have no standing to call us unreasonable.\n \n \nHow can an organization that has a long history of supporting legislation which makes it harder for law enforcement to catch the bad guys and enforce the law be considered reasonable?\n\n \n Perhaps you can provide me a link to this legislation that you speak of? For what you say to be true, there would have to be a congressman that introduced a bill that would directly harm the police. I can't see something like that getting even a single vote in the house or senate.\n \n \nThey have opposed the ATF for years and even tried to abolish it in the 1980s.\n\n \n Who can blame them? Anytime I hear a story about them trying to revoke an FFL dealer's license over an issue of an unchecked box, or a change in policy at a later date, I don't trust the ATF either. They've established a position, reversed it, and then contradicted it so many times that they can't be considered trustworthy. A law enforcement agency shouldn't be allowed to change its mind at the drop of a hat just because it feels like it.\n \n If the ATF isn't going to be reigned in and held to strict standards of review and forced to play by the rules like everybody else, then yes I agree that they should be abolished. Fix them or remove them, that's my position.\n \n \nHow can an organization that has supported a radical rebel-against-the-government ideology- an ideology that ultimately led to the Oklahoma City bombings be considered reasonable?\n\n \n Say what? It seems to me that you're the one making paranoid ramblings designed to scare people. Kindly prove that the NRA was behind the OCB incident.\n \n \nHow can an organization that resorts to two faced lying to gain an advantage over its opponents be considered reasonable?\n\n \n The NRA isn't the one saying that \"assault weapons\" are the weapon of choice for criminals. The NRA isn't the one saying that .50 caliber rifles are being bought up by terrorists for the purpose of shooting down airplanes. The NRA isn't saying that 95% of Americans don't support hunting. If anyone is lying and fear mongering it's the Brady Campaign and the Violence Policy Center.\n \n \nHow can an organization that shamelessly resorts to spreading lies about people in law enforcement that oppose it on gun control issues be considered reasonable? For example, the NRA ran full page ads falsely claiming that police chief Joseph McNamara supported legalizing \"drugs, marijuana, cocaine, heroin, crack.\" The NRA was trying to discredit McNamara because he supported the Brady Bill.\n\n \n Proof please?\n \n \nIn Georgia, the NRA alienated many of its own members and was criticized for \"acting like a hysterical teenaged girl\" by a pro-gun State Senator after it pushed its guns at work bill. A lot of people on the pro-gun side couldn't understand why the NRA wanted to violate the private property rights of business owners.\n\n \n Private property rights don't trump constitutional rights.", 
   {}, 
   334328, 
   null, 
   1227716580.0
  ], 
  [
   334361, 
   null, 
   "isly ilwott", 
   "The gun-control advocates fall into the same category as do other minorities in protesting what the majority enjoys. It is the small group of vocal protestors that seek to control the rights of all citizens.\n \n This is similar to the position of the same-sex-marriage advocates, the \"let's take God off our currency\" advocates, the \"let's ban the display of Christmas thoughts\" to keep from offending those who don't believe in Christ and other areas where the minority will whine and cry until they get their way.\n \n I will say this about that....screw the minorities. If their ideas were really good, there'd be more people moving to their side...and they would become the majority.", 
   {
    "post_info": {
     "post_title": "Minority rule..."
    }
   }, 
   334345, 
   null, 
   1227726300.0
  ], 
  [
   334364, 
   null, 
   "Archangel", 
   "If the anti-gun leftists in Congress and this Administration ever attempt to ban handguns for all civilians in America, it will provoke a true Revolution the likes of which hasn't been seen since our break from England. And since it would require the confiscation of the peoples weapons, it would be a shooting war as the call to Arms came forth from the pro-gun and pro-National Security groups leaders issue their call to arms.", 
   {}, 
   334361, 
   null, 
   1227727680.0
  ], 
  [
   334464, 
   null, 
   "Penfold", 
   "......... I will say this about that....screw the minorities. If their ideas were really good, there'd be more people moving to their side...and they would become the majority.\n\n \n A minority of gun owners are NRA members.", 
   {}, 
   334361, 
   null, 
   1227756720.0
  ], 
  [
   334481, 
   null, 
   "Ripskar", 
   "What is reasonable about being told that you can't own a gun with certain cosmetic features attached?\n\n Status symbol betraying irresponsible attitude.\n \n \nWhat is reasonable about being told \"You're not allowed to have more than 10 rounds of ammunition per magazine, and if you even try you're going to prison for 10 years\"?\n\n 10 rounds = 10 school kids. Do you want to shoot more? Reference Tazmania.\n \n \nWhat exactly is reasonable about rationing handgun sales to one a month?\n\n Straw Sales.", 
   {}, 
   334011, 
   null, 
   1227787980.0
  ], 
  [
   334502, 
   null, 
   "NATO 556", 
   "Status symbol betraying irresponsible attitude.\n \n 10 rounds = 10 school kids. Do you want to shoot more? Reference Tazmania.\n \n Straw Sales.\n\n \n Your entire argument is nothing more than scare tactics and fear mongering. Come back when you have something of true substance and can answer the questions.", 
   {}, 
   334481, 
   null, 
   1227803040.0
  ], 
  [
   334509, 
   null, 
   "Penfold", 
   "Your entire argument is nothing more than scare tactics and fear mongering. Come back when you have something of true substance and can answer the questions.\n\n \n Have you heard of a psychological schema called \"projection\"?", 
   {}, 
   334502, 
   null, 
   1227807480.0
  ], 
  [
   334551, 
   null, 
   "NATO 556", 
   "Have you heard of a psychological schema called \"projection\"?\n\n \n Projection, what many anti-gunners display when they say how we're too violent to be trusted with owning guns. They project their intense and irrational fears of an inanimate object onto us in order to make us out to be the bad guys that're out there killing innocent children every single day.", 
   {}, 
   334509, 
   null, 
   1227828120.0
  ], 
  [
   334561, 
   null, 
   "Charliegone", 
   "Status symbol betraying irresponsible attitude.\n \n \n That's the most ridiculous thing I have ever heard.\n \n \n 10 rounds = 10 school kids. Do you want to shoot more? Reference Tazmania.\n \n The average shooting consist of less than 5 rounds and the guns used in most school shootings have been with guns that hold less rounds. So your point is pointless.\n \n Straw Sales.\n\n \n If a person purchases several (as in a lot of guns) a month, it starts to raise flags and an investigation starts regardless of the reason. If found that it is legitimate it is let go off if not well.. One gun a month does absolutely nothing to curve straw purchases. Most are just satisfied with one gun. BTW, guns aren't exactly cheap.", 
   {}, 
   334481, 
   null, 
   1227830340.0
  ], 
  [
   334568, 
   null, 
   "NATO 556", 
   "ATF Online - Firearms FAQs\n \n \n(F5) As a licensed dealer, must I advise ATF if I sell more than one handgun to an individual?\n \n If you sell or dispose of more than one handgun to any non-licensee during a period of 5 consecutive business days, the sale must be reported on ATF Form 3310.4, Report of Multiple Sale or Other Disposition of Pistols and Revolvers, not later than the close of the business day on which you sold or disposed of the second handgun. The licensee must forward a copy of the Form 3310.4 to the ATF office specified thereon, and another copy must be forwarded to the State police or local law enforcement agency where the sale occurred. A copy of the Form 3310.4 also must be attached to the firearms transaction record, ATF Form 4473, documenting the sale or disposition of the second handgun.\n \n A business day for purposes of reporting multiple sales of pistols or revolvers is a day that a licensee conducts business pursuant to the license, regardless of whether State offices are open. The application of the term \"business day\" is, therefore, distinguishable from the term \"business day\" as used in the NICS context. Example: A licensee conducts business only on Saturdays and Sundays, days on which State offices are not open. The licensee sells a pistol to an unlicensed person on a Saturday. If that same unlicensed person acquires another handgun the next day (Sunday), the following Saturday or Sunday, or the Saturday after the reporting requirement would be triggered, the subsequent acquisition of a handgun would have to be reported on a Form 3310.4 by the close of the day upon which the second or subsequent handgun was sold.\n \n [18 U.S.C. 923(g)(3), 27 CFR 478.126a]\n \n \n Direct from the website of the ATF; the ones who're the experts on this matter.\n \n If anybody wants my opinion, it sounds like these firearms rationing bills do nothing productive, and instead actually shield the criminals from being discovered and caught.\n \n I don't get it, seriously. We have mayors who want their cities to be immigration sanctuaries where illegal and violent immigrants can go and not be deported, and we have politicians who want to keep the ATF from finding and dealing with people who're knowingly trafficking guns to criminals. Maybe we're looking in the wrong place, maybe we should be sending politicians to prison instead.", 
   {
    "unicode_changes_made": true
   }, 
   334561, 
   null, 
   1227831840.0
  ], 
  [
   334572, 
   null, 
   "Ripskar", 
   "That's the most ridiculous thing I have ever heard.\n\n \n Try looking up weapons as status symbols.\n School shootings are linked to semi-automatic and automatic weapons as demonstrated beyond all reasonable doubt by the Tasmanian authorities where following the ban on such weapons school shootings fell to zero.", 
   {}, 
   334561, 
   null, 
   1227834540.0
  ], 
  [
   334575, 
   null, 
   "NATO 556", 
   "Try looking up weapons as status symbols.\n School shootings are linked to semi-automatic and automatic weapons as demonstrated beyond all reasonable doubt by the Tasmanian authorities where following the ban on such weapons school shootings fell to zero.\n\n \n What about all of the school killings that have involved use of revolvers, shotguns, and IEDs? What's your p***ing away excuse for instances like these?\n \n In reality school shootings are linked to them being target rich environments where nobody can mount any opposition to the deranged killer. It's like a wolf in the chicken coop.", 
   {}, 
   334572, 
   null, 
   1227837480.0
  ], 
  [
   334576, 
   null, 
   "Ethmi", 
   "It really needs to be said- the NRA is anything but reasonable. How can an organization that has a history of opposing reasonable gun control be considered reasonable?\n How can an organization that has a long history of supporting legislation which makes it harder for law enforcement to catch the bad guys and enforce the law be considered reasonable?\n\n \n Define reasonable. The only reason you call these laws reasonable is because you agree with them. Well, news flash: the fact that you support a law doesn't make it reasonable.\n \n \nThey have opposed the ATF for years and even tried to abolish it in the 1980s. How can an organization that has supported a radical rebel-against-the-government ideology- an ideology that ultimately led to the Oklahoma City bombings be considered reasonable?\n\n \n Can you support that?\n \n \nHow can an organization that resorts to two faced lying to gain an advantage over its opponents be considered reasonable?\n\n \n What two-faced lies?\n \n \nHow can an organization that shamelessly resorts to spreading lies about people in law enforcement that oppose it on gun control issues be considered reasonable?\n\n \n Once again, what lies?\n \n \nFor example, the NRA ran full page ads falsely claiming that police chief Joseph McNamara supported legalizing \"drugs, marijuana, cocaine, heroin, crack.\" The NRA was trying to discredit McNamara because he supported the Brady Bill.\n\n \n First, how do you know it was false?\n Second, how do you know this happened?\n Third, do you deny the existance of people who want to end the war on drugs? I woudn't be suprised, as the Brady Bunch always has believed that we live in a world of sunshine and rainbows.\n \n \nIn Georgia, the NRA alienated many of its own members and was criticized for \"acting like a hysterical teenaged girl\" by a pro-gun State Senator after it pushed its guns at work bill.\n\n \n Link, please.\n \n \nA lot of people on the pro-gun side couldn't understand why the NRA wanted to violate the private property rights of business owners.\n\n \n First, link please.\n \n Second, you want to talk about rights? Okay, let's talk.\n \n I would like to know why you think that it's reasonable that we shouldn't have the right to protect ourselves.\n \n I would like to know why you think that it's reasonable for us to allow ourselves to become victims.\n \n I would like to know why you think that it's resonable to passively accept being walked on.\n \n I would like to know why you think that it's reasonable to let criminals come and go as if it's grand central station.\n \n I would like to know why you think that it's reasonable to complain about criminals rights (As many of you did in Rape Victim Kills attacker) while you have no sympathy for the victim.\n \n I would like to know why you think that it's reasonable to sympathize with the kind of people that you are trying in vain to control with your laws.\n \n I would like to know why you think that it's reasonable to take guns from everone, regardless of their histories.\n \n I would like to know why you think that it's reasonable to assume that the police will be there to save you when here in the real world, it's common knowledge that we have no right to police protection as individuals.\n \n I would like to know why you think that it's reasonable to ban firearms with certain cosmetic features. \n \n I would like to know why you think that it's reasonable to serialize ammo even though it's obviously not helping.\n \n NATO said it best:\n \n I want explanations to these questions, not answering a question with another question. If you can't provide clear and in depth explanations about how each of these would qualify as being reasonable laws, then you have no standing to call us unreasonable.\n \n \n And finally, I'll repeat my point that you seemed to have missed.\n \n There is a difference between saying that there are radicals in the NRA and that the NRA is radical.", 
   {}, 
   334328, 
   null, 
   1227837600.0
  ], 
  [
   334828, 
   null, 
   "Ethmi", 
   "Status symbol betraying irresponsible attitude.\n\n \n I don't even see how you figure that, but it was sure off the bottom-of-the-barrell, wasn't it? Cosmetic features are anything but status symbols.\n \n \n10 rounds = 10 school kids. Do you want to shoot more? Reference Tazmania.\n\n \n That's a paranoid thing to say.\n \n \n \nStraw Sales.\n\n \n Which is illegal.", 
   {}, 
   334481, 
   null, 
   1228091160.0
  ], 
  [
   334992, 
   null, 
   "Galileo", 
   "Define reasonable. The only reason you call these laws reasonable is because you agree with them. Well, news flash: the fact that you support a law doesn't make it reasonable.\n\n Well, I'm a reasonable person so if I support a law then there's good reason to believe the law is reasonable. \n \n \n \nCan you support that?\n\n The book Under Fire: The NRA and the Battle for Gun Control  documents how the NRA has opposed the ATF. \n \n \n \n \nWhat two-faced lies?\n\n Like when they hired a person to infiltrate Cease Fire Pennsylvania.\n \n \n \n \nOnce again, what lies?\n First, how do you know it was false?\n Second, how do you know this happened?\n Third, do you deny the existance of people who want to end the war on drugs? I woudn't be suprised, as the Brady Bunch always has believed that we live in a world of sunshine and rainbows.\n\n It's in the book Under Fire: The NRA and the Battle for Gun Control . \n In a world of Sunshine and Rainbows gun violence does not exist and thus there would be no need for the Brady Campaign in such a world. If the Brady Campaign really believed we lived in a world of sunshine and rainbows why would they continually complain about gun violence? \n \n \nLink, please.\n \n First, link please.\n\n You asked for it:\n \"While you are contacting others, contact the NRA and tell them their bullying, threatening tactics are backfiring. I have for the past two years earned an A+ and A rating from them and supported their efforts all the way. They are accusing every major company in Georgia of being anti gun, sending out their alerts every few hours naming more companies as anti gun and acting like a hysterical teenaged girl.\"\n -State Senator John Douglas of Georgia\n Gun Guys NRA &#8220;Acting like a Hysterical Teenaged Girl&#8221; on Guns at Work\n \n From another former supporter of the NRA:\n \"Mr. LaPierre and Mr. Cox:\n \n \"I am writing to inform you that I wish to cancel my life membership in the National Rifle Association effective immediately. When I joined the NRA three years ago, I was under the impression that I was joining a grassroots organization which fought to protect our Second Amendment rights....\n \n \"Senate Bill 43, introduced in the Georgia State Senate during the 2007 session, was a pro-gun bill. Yes. But 'pro-gun' does not necessarily mean 'pro-Second Amendment'. In fact, the bill was far from being 'pro-liberty' and 'pro-constitution'. The Constitution, along with our Bill of Rights, is based on the concept of liberty and the natural rights of man. We have the right to life, the right to liberty, and the right to pursue happiness. And the founding fathers put into place a system which would ensure that these rights were protected--private property. Private property provides us with a zone of privacy where we are free to exercise our own free-will without fear of intrusion. In a very real way, private property is the one liberty that ensures all others.\n \n \"Senate Bill 43 was a blatant assault on private property rights.\"\n JasonPye.com: My Letter to the NRA\n So we see that the NRA is willing to shamelessly trample on the rights of others to serve its own agenda.\n \n \n\n Second, you want to talk about rights? Okay, let's talk.\n \n I would like to know why you think that it's reasonable that we shouldn't have the right to protect ourselves.\n \n I would like to know why you think that it's reasonable for us to allow ourselves to become victims.\n \n I would like to know why you think that it's resonable to passively accept being walked on.\n \n I would like to know why you think that it's reasonable to let criminals come and go as if it's grand central station.\n \n I would like to know why you think that it's reasonable to complain about criminals rights (As many of you did in Rape Victim Kills attacker) while you have no sympathy for the victim.\n \n I would like to know why you think that it's reasonable to sympathize with the kind of people that you are trying in vain to control with your laws.\n \n I would like to know why you think that it's reasonable to take guns from everone, regardless of their histories.\n \n I would like to know why you think that it's reasonable to assume that the police will be there to save you when here in the real world, it's common knowledge that we have no right to police protection as individuals.\n \n I would like to know why you think that it's reasonable to ban firearms with certain cosmetic features. \n \n I would like to know why you think that it's reasonable to serialize ammo even though it's obviously not helping.\n\n I would like to know why you think it is reasonable to make all the above strawman arguments. \n \n \n\n NATO said it best:\n \n I want explanations to these questions, not answering a question with another question. If you can't provide clear and in depth explanations about how each of these would qualify as being reasonable laws, then you have no standing to call us unreasonable.\n \n \n And finally, I'll repeat my point that you seemed to have missed.\n \n \n There is a difference between saying that there are radicals in the NRA and that the NRA is radical.\n\n The NRA is truly radical. It has been radical since 1977 when the pro-gun radicals seized power from the pro-gun moderates in the NRA in what is known as the Cincinnati Revolution. Before that the NRA was a supporter of reasonable gun laws and wasn't such a threat to American rights and freedoms as it is now. For example:\n \n \"A waiting period could help in reducing crimes of passion and in preventing people with criminal records or dangerous mental illness from acquiring guns.\"\n -NRA Fact Book on Firearms Control, 1976", 
   {}, 
   334576, 
   null, 
   1228207080.0
  ], 
  [
   334999, 
   null, 
   "Ripskar", 
   "I don't even see how you figure that, but it was sure off the bottom-of-the-barrell, wasn't it? Cosmetic features are anything but status symbols.\n\n Again you're claiming ignorance of basic psychology. Why would you have cosmetic alterations if you didn't intend to show off?\n \n \nThat's a paranoid thing to say.\n\n It's a politicians calculation.\n \n \nWhich is illegal.\n\n But doesn't stop it from happening on a regular basis in the first place.\n None of your whinging alters any of the facts.", 
   {}, 
   334828, 
   null, 
   1228217160.0
  ], 
  [
   335009, 
   null, 
   "NATO 556", 
   "Well, I'm a reasonable person so if I support a law then there's good reason to believe the law is reasonable.\n\n \n Just because you're reasonable doesn't mean what you believe in is reasonable. Some reasonable people believe that it's perfectly alright to cheat on their spouse, does that it too is reasonable?\n \n \nThe book Under Fire: The NRA and the Battle for Gun Control  documents how the NRA has opposed the ATF.\n\n \n Amazon.com: Under Fire: The Nra and the Battle for Gun Control: Osha Gray Davidson: Books\n \n \nNeither an expose nor a polemic, this book bogs down in description while stinting on hard analysis. Davidson ( Broken Heartland: The Rise of America's Rural Ghetto ) intersperses several set pieces--on the 1988 schoolyard massacre in Stockton, Calif., the 1986 congressional debate over the McClure-Volkmer Bill and the workings of a Washington, D.C., emergency room--with a fair-minded history of the National Rifle Association. Davidson looks critically at some of the NRA's broad-brush critics, suggesting that neither side gives \"any credence to the claims of the other.\" He observes that the NRA is \"neither the Evil Empire its foes claim nor the superpatriotic defender of the most cherished American values it claims to be.\" But only in the epilogue does he address important policy questions (such as the role of handguns in self-defense) and sociological analysis (such as of the urban-rural cultural roots of the gun control debate). His conclusion that the epidemic of gun violence must be addressed demands a more rigorous foundation.\n Copyright 1993 Reed Business Information, Inc.\n \n This detailed history of that politically powerful and often feared lobby, the National Rifle Association (NRA), examines the organization's current troubles and its declining influence with elected officials and leadership in the police community. The publisher claims that the book is \"nonpartisan\" but also provides a statement of praise from gun control advocate Sarah Brady. Davison has carefully researched his topic. His book is journalistic in style yet compares favorably with the best on this subject, such as James D. Wright and Peter H. Rossi's Armed and Considered Dangerous (Aldine de Gruyter, 1986) and Franklin Zimring and Gordon Hawkins's The Citizen's Guide to Gun Control ( LJ 7/87). Davidson's study brings the debate up to date. Highly recommended for any collection that has either of the aforementioned books.\n\n \n And a review of the same book.\n \n \nthe subtitle, \"... and the battle for gun control\" pretty well states the author's bias. even so, he attempts to be fair and on occasion unintentionally provides flashes of insight. for example, he states that n.y.c.'s 'sullivan law' was passed because of fear of immigrants, and further says that that is an example of the sort of tactical position you should take to advance gun control if it will be effective. (similar to 'the racist roots ...')\n \n in the chapter on the inner city, he documents that 'all' 'gun violence' is related to the drug trade, in other words, the fallout from prohibition.\n \n the broad history of the nra is somewhat useful for tracing the left's deep-seated hostility towards the right to keep and bear arms. the nra grew out of the national guard movements that, after the civil war, were called upon to defend industries against union organizers.\n \n like a loaded gun, this book is a useful tool in the hands of someone who knows how to use it;-)\n\n \n Don't try and use Under Fire for your argumentative position, you fail.\n \n \nLike when they hired a person to infiltrate Cease Fire Pennsylvania.\n\n \n Evidence please. I want links to sources sited, not another damn book.\n \n You also haven't explained to me exactly how the proposals I mentioned would be considered \"reasonable\". Kindly detail how the list qualifies as being reasonable.", 
   {}, 
   334992, 
   null, 
   1228234020.0
  ], 
  [
   335010, 
   null, 
   "NATO 556", 
   "Again you're claiming ignorance of basic psychology. Why would you have cosmetic alterations if you didn't intend to show off?\n\n \n ...Because you can have it since this is still America and a \"need\" based system for rights has yet to be implemented?\n \n Perhaps you can explain to me how having an adjustable stock on your rifle somehow makes you \"ghetto fabulous\" and contributes to an increase in violent crime, whereas a plain fixed stock is more subdue and doesn't contribute to any sort of crime.\n \n \nIt's a politicians calculation.\n\n \n No it's a sign of fear mongering and seeing murderers around every street corner and behind every lamp post.\n \n I would highly suggest not playing this game, because I can play it much better than you and give reason for banning anything. \n \n The internet, for example, is used in the exploiting of millions of children as sex toys, acquiring information for building explosives, and stealing millions of dollars from innocent people as well as their identity. With the right virus you can hijack hundreds of personal computers (a trend known as zombies) and use them for evil purposes while remaining undetected yourself, thus getting others into trouble.\n \n Money is a source of great evil. Money is the sole reason we have robberies, ransoms and embezzling.\n \n And kindly don't try the tired and whining old \"That's different, guns are meant for killing (fill in the blank) isn't\" excuse, because that doesn't fly.\n \n \nBut doesn't stop it from happening on a regular basis in the first place. None of your whinging alters any of the facts.\n\n \n So we can both agree that laws don't prevent crimes from occurring. Therefore you can see that new laws won't make any difference in the matter as they'll be broken right along with the old laws. And if the courts aren't enforcing the old laws, then the new laws serve no purpose except to make politicians feel better about their job.", 
   {}, 
   334999, 
   null, 
   1228234260.0
  ], 
  [
   335026, 
   null, 
   "NATO 556", 
   "According to a recent report for Congress on foreign country gun laws states, \"From available statistics, among the [27] countries surveyed, it is difficult to find a correlation between the existence of strict firearms regulations and a lower incidence of gun-related crimes. [I]n Canada a dramatic increase in the percentage of handguns used in all homicides was reported during a period in which handguns were most strictly regulated. And in strictly regulated Germany, gun-related crime is much higher than in countries such as Switzerland and Israel, that have simpler and/or less restrictive legislation.\" (Library of Congress, \"Firearms Regulations in Various Foreign Countries, May 1998\")", 
   {}, 
   334568, 
   null, 
   1228244460.0
  ], 
  [
   335039, 
   null, 
   "Ethmi", 
   "Again you're claiming ignorance of basic psychology. Why would you have cosmetic alterations if you didn't intend to show off?\n\n \n Hmm, first off, name a gun owner who treasures cosmetic apperances over product quality.\n \n Second, how is this relevant?\n \n Third, even if one's intent is to show off, does this mean that they're more likely to commit a violent crime? Or is this just another lame, desperate excuse to take guns from our hands?\n \n \nIt's a politicians calculation.\n\n \n Does that garuntee that it'll happen?\n \n \nBut doesn't stop it from happening on a regular basis in the first place.\n None of your whinging alters any of the facts.\n\n \n I assure you, the media and stats you poison your mind with greatly exaggerates the existance of this problem. Both will ignore legally purchased guns.", 
   {}, 
   334999, 
   null, 
   1228248480.0
  ], 
  [
   335046, 
   null, 
   "Ethmi", 
   "Well, I'm a reasonable person so if I support a law then there's good reason to believe the law is reasonable. \n\n \n Let me teach you the most common human belief:\n \n \"Any thing I agree with is automatically reasonable.\"\n \n In other words, you say it's reasonable because you think it's reasonable. But your opinions don't trump others, despite your beliefs.\n \n \nThe book Under Fire: The NRA and the Battle for Gun Control  documents how the NRA has opposed the ATF. \n\n \n NATO said it best.\n \n \nLike when they hired a person to infiltrate Cease Fire Pennsylvania.\n\n \n First, link please. Second, what makes you so certain that it was the NRA?\n \n \nIt's in the book Under Fire: The NRA and the Battle for Gun Control . \n\n \n NATO addressed this best.\n \n \nIn a world of Sunshine and Rainbows gun violence does not exist and thus there would be no need for the Brady Campaign in such a world. If the Brady Campaign really believed we lived in a world of sunshine and rainbows why would they continually complain about gun violence? \n\n \n I've seen no alternatives from them. They're pacifists. They think that criminals are like Darth Vader, evil, but with \"good in them\". Sorry, but if a criminal will break the law, what makes you think your cries and pleads will stop him?\n \n From another former supporter of the NRA:\n \"Mr. LaPierre and Mr. Cox:\n \n \n\"I am writing to inform you that I wish to cancel my life membership in the National Rifle Association effective immediately. When I joined the NRA three years ago, I was under the impression that I was joining a grassroots organization which fought to protect our Second Amendment rights....\n \n \"Senate Bill 43, introduced in the Georgia State Senate during the 2007 session, was a pro-gun bill. Yes. But 'pro-gun' does not necessarily mean 'pro-Second Amendment'. In fact, the bill was far from being 'pro-liberty' and 'pro-constitution'. The Constitution, along with our Bill of Rights, is based on the concept of liberty and the natural rights of man. We have the right to life, the right to liberty, and the right to pursue happiness. And the founding fathers put into place a system which would ensure that these rights were protected--private property. Private property provides us with a zone of privacy where we are free to exercise our own free-will without fear of intrusion. In a very real way, private property is the one liberty that ensures all others.\n \n \"Senate Bill 43 was a blatant assault on private property rights.\"\n JasonPye.com: My Letter to the NRA\n So we see that the NRA is willing to shamelessly trample on the rights of others to serve its own agenda.\n\n \n That bill prohibited employers from prohibiting employees to carry guns. Uh, I don't see how this takes away rights. Company grounds may be private property, but I wouldn't categorize \"worker\" as \"intruder\". The only reason you call this law unreasonable is because you disagree with it. Also, if you have to leave the gun in the car, it's more likely to be stolen. If somebody steals it, then they're probably going to commit a crime with it. But a law that would help lessen this effect wouldn't be reasonable because you disagree with it. :)\n \n \nI would like to know why you think it is reasonable to make all the above strawman arguments.\n \n \n I thought I quoted NATO to tell you \"Answer, don't question.\" Did yo umiss that?\n \n \nThe NRA is truly radical. It has been radical since 1977 when the pro-gun radicals seized power from the pro-gun moderates in the NRA in what is known as the Cincinnati Revolution. Before that the NRA was a supporter of reasonable gun laws and wasn't such a threat to American rights and freedoms as it is now. For example:\n \n \"A waiting period could help in reducing crimes of passion and in preventing people with criminal records or dangerous mental illness from acquiring guns.\"\n -NRA Fact Book on Firearms Control, 1976\n[/QUOTE]\n \n Define reasonable. Like I said, you whine and scream because you disagree with these laws, not because they're unreasonable.\n \n Like I said, you call the NRA radical because you think the laws they support are unreasonable. And the reason you say that these laws are unreasonable is because you disagree with them.", 
   {}, 
   334992, 
   null, 
   1228249740.0
  ], 
  [
   335064, 
   null, 
   "NATO 556", 
   "Now that I've had time to better think it out, I'm going to revisit this post and really lay into it like it deserves to be.\n \n \nWell, I'm a reasonable person so if I support a law then there's good reason to believe the law is reasonable.\n\n \n \"Reasonable\" is defined as:\n 1. Capable of reasoning; rational: a reasonable person.\n 2. Governed by or being in accordance with reason or sound thinking: a reasonable solution to the problem.\n 3. Being within the bounds of common sense: arrive home at a reasonable hour.\n 4. Not excessive or extreme; fair: reasonable prices.\n \n Simply that you find something to be \"reasonable\" doesn't make it reasonable. Suppose a new law was proposed and it dictated that anybody who shared a view contradictory to the government was to be immediately moved to Guantanomo Bay and held indefinitely without counsel or legal resolve. Some might consider that reasonable, but others would disagree.\n \n I'll ask again, since you seem to have forgotten the questions from last time. And this time kindly have enough sense to answer them, all with answers that can explain your position in a clear manner.\n \n What is reasonable about being told that you can't own a gun with certain cosmetic features attached?\n \n What is reasonable about being told \"You're not allowed to have more than 10 rounds of ammunition per magazine, and if you even try you're going to prison for 10 years\"?\n \n What is reasonable about politicians deciding we shouldn't be allowed to own guns that aren't designed purely for hunting game animals?\n \n What is reasonable about lawsuits to be brought against manufacturers for the specific purpose of driving them out of business through bankruptcy?\n \n What is reasonable about denying the legal claim of self-defense to an individual who was forced to shoot and kill a violent home invader?\n \n What is reasonable about outlawing a gun shop within five miles of a school, park, or another gun shop?\n \n What is reasonable about a total ban on handguns when the Supreme Court has said that such is not allowable?\n \n What is reasonable about paying money to people who don't file/pay their income taxes?\n \n What is reasonable about destroying our nation's defense systems?\n \n How in the name of hell do any of these Obama sanctioned schemes able to be considered \"reasonable\"? What brand of twisted logic is applied in such a situation?\n \n \nThe book Under Fire: The NRA and the Battle for Gun Control  documents how the NRA has opposed the ATF.\n \n \n I've already covered the entire Under Fire issue sufficiently.\n \n \nLike when they hired a person to infiltrate Cease Fire Pennsylvania.\n\n \n You've yet to provide evidence that the NRA hired anybody to infiltrate anything. Simply because you said it doesn't make it such; you aren't God after all, your word isn't gospel.\n \n \nIn a world of Sunshine and Rainbows gun violence does not exist and thus there would be no need for the Brady Campaign in such a world. If the Brady Campaign really believed we lived in a world of sunshine and rainbows why would they continually complain about gun violence? \n\n \n One of the latest schemes by the Brady Campaign is serialized ammunition, the argument is that it'll make it easier for the police to solve shooting crimes. As it is now we already have a ballistics database program in several states where gun barrels and the marks left are listed in centralized databases.\n \n For what purpose does the proposal of serialized ammunition exist if we already have ballistics databases? Either the databases are helping fight crime, or we were lied to and they're really nothing more than a waste of taxpayer dollars and should be dismantled immediately. If they're working just fine, why do we need serialized bullets? If it's not working, how can we be expected to believe that serializing ammunition will work any better?\n \n \nYou asked for it:\n \"While you are contacting others, contact the NRA and tell them their bullying, threatening tactics are backfiring. I have for the past two years earned an A+ and A rating from them and supported their efforts all the way. They are accusing every major company in Georgia of being anti gun, sending out their alerts every few hours naming more companies as anti gun and acting like a hysterical teenaged girl.\"\n\n \n Less than 30 minutes after Virginia Tech occurred, the Brady Campaign was urging its members to donate $32 to their organization; $1 for every victim killed.\n \n \n-State Senator John Douglas of Georgia\n Gun Guys NRA \"Acting like a Hysterical Teenaged Girl\" on Guns at Work\n\n \n What makes senator Douglas an expert on the topic?\n \n \nFrom another former supporter of the NRA:\n \"Mr. LaPierre and Mr. Cox:\n \n \"I am writing to inform you that I wish to cancel my life membership in the National Rifle Association effective immediately. When I joined the NRA three years ago, I was under the impression that I was joining a grassroots organization which fought to protect our Second Amendment rights....\n \n \"Senate Bill 43, introduced in the Georgia State Senate during the 2007 session, was a pro-gun bill. Yes. But 'pro-gun' does not necessarily mean 'pro-Second Amendment'. In fact, the bill was far from being 'pro-liberty' and 'pro-constitution'. The Constitution, along with our Bill of Rights, is based on the concept of liberty and the natural rights of man. We have the right to life, the right to liberty, and the right to pursue happiness. And the founding fathers put into place a system which would ensure that these rights were protected--private property. Private property provides us with a zone of privacy where we are free to exercise our own free-will without fear of intrusion. In a very real way, private property is the one liberty that ensures all others.\n \n \"Senate Bill 43 was a blatant assault on private property rights.\"\n JasonPye.com: My Letter to the NRA\n So we see that the NRA is willing to shamelessly trample on the rights of others to serve its own agenda.\n\n \n First, kindly prove beyond all reasonable doubt that the person who wrote this letter truly was a member of the NRA, and simply not some anti-gun ##### impersonating them.\n \n Second, you've yet to provide any evidence whatsoever that private property rights are able to trump constitutional rights.\n \n The reason behind Senate Bill 43 was because employers were telling employees that they couldn't keep their legally owned guns in their cars while at work, even though the cars were their private property, and the business parking lots were open to the public at large. Basically the bosses were saying \"You can either exercise your constitutional rights, or you can keep your job and earn a paycheck.\" You have to travel to and from work, using public roads that the employer has no control on. Private property rights don't begin until the property line, so the prejudice of the employer shouldn't be allowed to reflect outside happenings.\n \n Suppose the mayor of a city declared City Hall to be his private property and used that as an excuse to shut down any protest that took place on the steps to City Hall. Would you be in favor of that as well?\n \n \nI would like to know why you think it is reasonable to make all the above strawman arguments.\n\n \n You were the one who talked about \"reasonable restrictions\", I want to know exactly how each and every one of those proposals listed qualifies as being reasonable. Kindly answer the question and stop dodging the question. If you don't know then simply say \"I don't know\", drop the whole holier-than-thou attitude you've displayed. Despite what you might think you aren't God, you do have to talk to us lowly mortals who you perceive to be beneath your contempt.\n \n \nThe NRA is truly radical. It has been radical since 1977 when the pro-gun radicals seized power from the pro-gun moderates in the NRA in what is known as the Cincinnati Revolution. Before that the NRA was a supporter of reasonable gun laws and wasn't such a threat to American rights and freedoms as it is now. For example:\n\n \n Just because you call them radical doesn't make them radical. I call you a jihad terrorist, does that make you a terrorist?\n \n \n\"A waiting period could help in reducing crimes of passion and in preventing people with criminal records or dangerous mental illness from acquiring guns.\"\n\n \n Show me the study that supports the concept of how having to wait five days before you pick up your legally owned property, would help prevent a crime of passion from occurring. To my knowledge no such study exists except for what's been funded by the Joyce Foundation, a known supporter of any and all gun control laws.", 
   {
    "unicode_changes_made": true
   }, 
   334992, 
   null, 
   1228256160.0
  ], 
  [
   335208, 
   null, 
   "Galileo", 
   "Now that I've had time to better think it out, I'm going to revisit this post and really lay into it like it deserves to be.\n \n \n \n \"Reasonable\" is defined as:\n 1. Capable of reasoning; rational: a reasonable person.\n 2. Governed by or being in accordance with reason or sound thinking: a reasonable solution to the problem.\n 3. Being within the bounds of common sense: arrive home at a reasonable hour.\n 4. Not excessive or extreme; fair: reasonable prices.\n \n Simply that you find something to be \"reasonable\" doesn't make it reasonable. Suppose a new law was proposed and it dictated that anybody who shared a view contradictory to the government was to be immediately moved to Guantanomo Bay and held indefinitely without counsel or legal resolve. Some might consider that reasonable, but others would disagree.\n \n I'll ask again, since you seem to have forgotten the questions from last time. And this time kindly have enough sense to answer them, all with answers that can explain your position in a clear manner.\n \n What is reasonable about being told that you can't own a gun with certain cosmetic features attached?\n \n What is reasonable about being told \"You're not allowed to have more than 10 rounds of ammunition per magazine, and if you even try you're going to prison for 10 years\"?\n \n What is reasonable about politicians deciding we shouldn't be allowed to own guns that aren't designed purely for hunting game animals?\n \n What is reasonable about lawsuits to be brought against manufacturers for the specific purpose of driving them out of business through bankruptcy?\n \n What is reasonable about denying the legal claim of self-defense to an individual who was forced to shoot and kill a violent home invader?\n \n What is reasonable about outlawing a gun shop within five miles of a school, park, or another gun shop?\n \n What is reasonable about a total ban on handguns when the Supreme Court has said that such is not allowable?\n \n What is reasonable about paying money to people who don't file/pay their income taxes?\n \n What is reasonable about destroying our nation's defense systems?\n \n How in the name of hell do any of these Obama sanctioned schemes able to be considered \"reasonable\"? What brand of twisted logic is applied in such a situation?\n \n\n This appears to be a diversionary tactic. The issue being debated is whether or not the NRA is radical and what it advocates is reasonable. It's not about whether or not what the Brady Campaign advocates is reasonable and a lot of what you wrote above appears to be more strawman arguments. Who actually advocated destroying our nation's defense systems? I really wish you would strictly address what I wrote instead of deciding to throw a bunch of new things into your post. \n \n \n \n\n I've already covered the entire Under Fire issue sufficiently.\n \n\n So for you skimming a few book reviews is sufficient research while I actually read the book. \n \n \n\n You've yet to provide evidence that the NRA hired anybody to infiltrate anything. Simply because you said it doesn't make it such; you aren't God after all, your word isn't gospel.\n\n So why was somebody on the Cease Fire Pennsylvania Board of Directors also on the NRA's payroll? And why has the NRA refused to say anything about it? \n \n \n \n\n Less than 30 minutes after Virginia Tech occurred, the Brady Campaign was urging its members to donate $32 to their organization; $1 for every victim killed.\n\n Another diversionary tactic by someone who has problems addressing the real issue. \n \n \nWhat makes senator Douglas an expert on the topic?\n\n Obviously, as a member of the state legislature it's his job to be familiar with proposed bills that are debated by that body and especially as a long time supporter of the NRA he would have been familiar with legislation the NRA was proposing. \n \n \n \n\n First, kindly prove beyond all reasonable doubt that the person who wrote this letter truly was a member of the NRA, and simply not some anti-gun ##### impersonating them.\n \n Second, you've yet to provide any evidence whatsoever that private property rights are able to trump constitutional rights.\n \n\n So can you exercise your freedom of speech at work by carrying signs that say negative things about your employer without being fired? You know what, you should be the one to provide the evidence since your claiming things that go against the long establish norm. Prove that there is a right to carry a gun at work. \n \n \n\n Show me the study that supports the concept of how having to wait five days before you pick up your legally owned property, would help prevent a crime of passion from occurring. To my knowledge no such study exists except for what's been funded by the Joyce Foundation, a known supporter of any and all gun control laws.\n\n You're totally missing the point. As I pointed out before, the NRA made the claim so ask them for the proof.", 
   {}, 
   335064, 
   null, 
   1228311000.0
  ], 
  [
   335209, 
   null, 
   "Galileo", 
   "The reason the dems wimp out is because the gun nuts votes are likely to be swayed by a candidate's position on gun control, whereas non gun nuts, while having an opinion, are most likely concerned about other issues. It is the same reason people don't tend to come out loudly pro-choice, even though the majority of the US population are pro-choice.\n\n Well said. Most Americans favor more gun control, but unfortunately this majority of Americans tends not to vote based on the issue of gun control while a very vocal minority composed of gun activists definitely does vote based on the issue. This is something politicians have realized since 1994 so they have been more hesitant to support gun control. There probably will be more gun control supporters in office in the coming years but I'm not sure how much this will change things.", 
   {}, 
   333809, 
   null, 
   1228311600.0
  ], 
  [
   335217, 
   null, 
   "NATO 556", 
   "This appears to be a diversionary tactic. The issue being debated is whether or not the NRA is radical and what it advocates is reasonable. It's not about whether or not what the Brady Campaign advocates is reasonable and a lot of what you wrote above appears to be more strawman arguments. Who actually advocated destroying our nation's defense systems? I really wish you would strictly address what I wrote instead of deciding to throw a bunch of new things into your post.\n\n \n Either answer the questions raised, or stop talking.\n \n You opened your mouth about \"reasonable laws\", I asked just how they would be classified as reasonable. I know how they would be considered unreasonable, now it's your turn to prove me wrong.\n \n \nSo for you skimming a few book reviews is sufficient research while I actually read the book.\n \n \n Just because you read a piece of biased fiction doesn't mean that you're an expert on anything. There's absolutely no evidence that Under Fire is an honest, unbiased telling of the truth, the whole truth and nothing but the truth. It's no more acceptable than the discredited Kellerman study.\n \n \nSo why was somebody on the Cease Fire Pennsylvania Board of Directors also on the NRA's payroll? And why has the NRA refused to say anything about it?\n\n \n Evidence, NOW!\n \n \nAnother diversionary tactic by someone who has problems addressing the real issue.\n \n \n No, it's the truth. The fact that you choose to ignore it speaks volumes about you and the people you associate with.\n \n \nObviously, as a member of the state legislature it's his job to be familiar with proposed bills that are debated by that body and especially as a long time supporter of the NRA he would have been familiar with legislation the NRA was proposing.\n\n \n Please! Politicians think that the moment something is made illegal the problem goes away. They have no concept of reality.\n \n \nSo can you exercise your freedom of speech at work by carrying signs that say negative things about your employer without being fired? You know what, you should be the one to provide the evidence since your claiming things that go against the long establish norm. Prove that there is a right to carry a gun at work.\n\n \n There's a difference between inside the business, and the publicly accessible parking lot. There's also a difference between slander, and being able to defend your life.\n \n \nYou're totally missing the point. As I pointed out before, the NRA made the claim so ask them for the proof.\n\n \n No I'm asking YOU for the proof because you made the point! Now put up or shut up! I'm tired of playing games with you!", 
   {}, 
   335208, 
   null, 
   1228320360.0
  ], 
  [
   335242, 
   null, 
   "Ripskar", 
   "Hmm, first off, name a gun owner who treasures cosmetic apperances over product quality.\n \n Second, how is this relevant?\n \n Third, even if one's intent is to show off, does this mean that they're more likely to commit a violent crime? Or is this just another lame, desperate excuse to take guns from our hands?\n\n How is it dangerous to show off with a lethal weapon? Seriously???\n Try rubbing two brain cells together...\n As for people who show off with firearms; Name me one serial killer who hasn't posed for photos holding a gun, or even made their own YouTube videos showing off... And that's without touching gangland culture.\n \n \n \nI assure you, the media and stats you poison your mind with greatly exaggerates the existance of this problem. Both will ignore legally purchased guns.\n\n Do criminal groups posess a significant number of firearms, does this threaten law and order? The answer in relation to the US would be yes to both. Measures implimented thus far to restrict criminal access to firearms in the US have failed.", 
   {}, 
   335039, 
   null, 
   1228333260.0
  ], 
  [
   335243, 
   null, 
   "NATO 556", 
   "Name me one serial killer who hasn't posed for photos holding a gun, or even made their own YouTube videos showing off... And that's without touching gangland culture.\n\n \n Jack the Ripper.", 
   {}, 
   335242, 
   null, 
   1228333500.0
  ], 
  [
   335249, 
   null, 
   "Ethmi", 
   "How is it dangerous to show off with a lethal weapon? Seriously???\n Try rubbing two brain cells together...\n As for people who show off with firearms; Name me one serial killer who hasn't posed for photos holding a gun, or even made their own YouTube videos showing off... And that's without touching gangland culture.\n\n \n Name a gun owner who actually shows off, and prove to me that gun owners are generally murderers. You're almost like Brady. Anyhow, I asked you a question. I want it answered with an answer, not a question. Once you answer, I answer.\n \n \nDo criminal groups posess a significant number of firearms, does this threaten law and order? The answer in relation to the US would be yes to both. Measures implimented thus far to restrict criminal access to firearms in the US have failed.\n\n \n Yes, but would they just hand them over? If you think so, then let's see you become a police officer, go into a biker bar, and shout \"Alright everyone. His Grand Majestic Mightiness King Obama has banned guns. So hand 'em over.\"", 
   {}, 
   335242, 
   null, 
   1228334640.0
  ], 
  [
   335252, 
   null, 
   "sinjin", 
   "If we could effectively prevent the over 1 million guns finding their way into criminal hands annually, it would certainly have an impact on criminality. That existing guns wouldn't be turned in doesn't change that fact.", 
   {}, 
   335249, 
   null, 
   1228335120.0
  ], 
  [
   335254, 
   null, 
   "isly ilwott", 
   "A minority of gun owners are NRA members.\n\n \n But the NRA is not opposing their right to own guns. They are not trying to control an opposing majority. You simply missed the point.", 
   {}, 
   334464, 
   null, 
   1228336080.0
  ], 
  [
   335256, 
   null, 
   "NATO 556", 
   "If we could effectively prevent the over 1 million guns finding their way into criminal hands annually, it would certainly have an impact on criminality. That existing guns wouldn't be turned in doesn't change that fact.\n\n \n We could if we'd follow federal guidelines instead of shielding firearms traffickers with these brainless gun rationing laws, and instead trying to place the blame on the victims.", 
   {}, 
   335252, 
   null, 
   1228336440.0
  ], 
  [
   335402, 
   null, 
   "Ripskar", 
   "Name a gun owner who actually shows off.\n\n Lee Harvey Oswald\n Image:CE746A.jpg - Wikipedia, the free encyclopedia\n Richard Ramirez\n Jeffery Dahmer\n Ted Bundy, etc. etc. etc.\n You name it, they're there.\n Like I said, just about all of them", 
   {}, 
   335249, 
   null, 
   1228426140.0
  ], 
  [
   335414, 
   null, 
   "Charliegone", 
   "Lee Harvey Oswald\n Image:CE746A.jpg - Wikipedia, the free encyclopedia\n Richard Ramirez\n Jeffery Dahmer\n Ted Bundy, etc. etc. etc.\n You name it, they're there.\n Like I said, just about all of them\n\n \n John Wayne Gacy comes to mind of serial killer who has never posed with firearms. I have seen him posing with Democrats...does that mean all Democrats are serial killers?emoticon_rolleyes", 
   {}, 
   335402, 
   null, 
   1228435440.0
  ], 
  [
   335420, 
   null, 
   "NATO 556", 
   "John Wayne Gacy comes to mind of serial killer who has never posed with firearms. I have seen him posing with Democrats...does that mean all Democrats are serial killers?emoticon_rolleyes\n\n \n *Hands Charlie a cigar* And what about Jack the Ripper?", 
   {}, 
   335414, 
   null, 
   1228443840.0
  ], 
  [
   335441, 
   null, 
   "Charliegone", 
   "*Hands Charlie a cigar* And what about Jack the Ripper?\n\n \n Yup same thing, though I think he didn't hang around Democrats though.:p I've done studies on serial killers; and there is one thing I can tell you. They are NOT your normal human beings. They have no perception of right and wrong. They only care about one person and one person only. That is themselves. Whether they pose with guns or not has no relevance at all. People do it all the time, even JFK did it! Holding a firearm in your hand while someone takes a picture has very different meanings for every one. I, for example, pose with them because I'm proud of the fact that I was able to put one together (like build it). It's like posing with a car you just refinished or spruced up, how firearms are different, that seems to be something people against firearms have a problem with...for reasons unknown.emoticon_confused", 
   {}, 
   335420, 
   null, 
   1228468140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Voter Poll Data Show Broad Support For Stronger Gun Laws", 
  "url": "http://www.4forums.com/political/gun-control-debates/12008-voter-poll-data-show-broad-support-stronger-gun-laws.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12008, 
  "discussion_files": [
   [
    "20648.html", 
    "http://www.4forums.com/political/gun-control-debates/12008-voter-poll-data-show-broad-support-stronger-gun-laws-print.html"
   ], 
   [
    "20649.html", 
    "http://www.4forums.com/political/gun-control-debates/12008-voter-poll-data-show-broad-support-stronger-gun-laws-4-print.html"
   ], 
   [
    "20650.html", 
    "http://www.4forums.com/political/gun-control-debates/12008-voter-poll-data-show-broad-support-stronger-gun-laws-3-print.html"
   ], 
   [
    "20651.html", 
    "http://www.4forums.com/political/gun-control-debates/12008-voter-poll-data-show-broad-support-stronger-gun-laws-2-print.html"
   ]
  ], 
  "identifier": 12008
 }
]