[
 [
  [
   334649, 
   null, 
   "Joel_Henderson", 
   "It's futile to discuss policy-matters, since policy isn't about logic but about POWER. As I've stated before, law is subject to the whim of the sovereign; and therefore we must recognize that the federal government is a DICTATORSHIP, since policy is DICTATED to the people.\n \n Fact: the federal government was never intended to have sovereign national authority over the sovereign states (via their people, vs. their governments); as Jefferson stated in the Kentucky Resolutions, this would naturally void the Constitution, since the federal government could then do as it pleased-- the Constitution be damned. \n \n Since the federal government has usurped sovereign national authority, policy is simply DICTATED as the federal government pleases-- and therefore it simply serves special-interests of those in power. Logic is therefore the talk of those they fool; meanwhile lobbying-groups, political-action committees, and voter's whims, is the REAL driving force behind policy, following political causation rather than sound logic\n \n And political forces are a juggernaut forcing ever-toward Leviathan, granting more and more power to the government (state AND federal), and away from the indvidual. As I've stated before, law means nothing\n \n The Federal Reserve, US entry into WWI, global socialism, the Great Depression, US entry into WWII, the Cold War, and now the War on Terror (i.e. war for oil), are all simply the consequences of the Leviathan dictatorship.\n Logic is irrelevant.", 
   {
    "post_info": {
     "post_title": "Logic vs. Power"
    }
   }, 
   null, 
   null, 
   1227944160.0
  ], 
  [
   334679, 
   null, 
   "simone", 
   "And handing Europe over to Hitler is pure logic, eh?", 
   {}, 
   334649, 
   null, 
   1227982620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Logic vs. Power", 
  "url": "http://www.4forums.com/political/policy-ideas/12034-logic-vs-power.html", 
  "breadcrumbs": [
   "Policy Ideas"
  ], 
  "id_number": 12034, 
  "discussion_files": [
   [
    "27847.html", 
    "http://www.4forums.com/political/policy-ideas/12034-logic-vs-power-print.html"
   ]
  ], 
  "identifier": 12034
 }
]