[
 [
  [
   334587, 
   null, 
   "Joel_Henderson", 
   "As you may know, the sovereign is the elite ruler of any nation.\n \n The Southern states, like the Founders, clearly held that the sovereign in America, was the People of each state, respectively.\n \n However, Lincoln claimed that \"A majority held in restraint by constitutional checks and limitations, and always changing easily with deliberate changes of popular opinions and sentiments, is the only true sovereign of a free people.\" \n \n But this is an oxymoron, since it conveniently omits who interprets and enforces these \"constitutional checks and limitations--\" i.e. the federal government, which therefore becomes the true sovereign. As Jefferson astutely observed, this makes the government, and not the Constitution, the judge of its own powers. \n \n Lincoln proved this, by stating that \"Doing this I deem to be only a simple duty on my part, and I shall perform it so far as practicable unless my rightful masters, the American people, shall withhold the requisite means or in some authoritative manner direct the contrary.\" \n \n In other words, he held that the federal government could do as it pleased, and could only be controlled by the majority.\n \n Therefore, Lincoln held the Union to be a simple conspiracy between the voting majority, and the officials that they elect-- which once again voids the Constitution entirely as a protector of minority/individual rights.\n \n In the US, therefore, it's clear that the sovereign is the federal government via its officials-- i.e. an elective aristocracy.", 
   {
    "post_info": {
     "post_title": "Who is the sovereign?"
    }
   }, 
   null, 
   null, 
   1227846000.0
  ], 
  [
   334602, 
   null, 
   "Ripskar", 
   "Nah, 'tis ye mighty dollar.\n Cash is King!", 
   {}, 
   334587, 
   null, 
   1227889260.0
  ], 
  [
   334604, 
   null, 
   "smiley", 
   "Nah, 'tis ye mighty dollar.\n Cash is King!\n\n Or possibly the Gold Sovereign.\n Yeah! Cash is King.\n \n But not Johnny Cash.\n Aaah, the King is dead, long live the King.", 
   {}, 
   334602, 
   null, 
   1227892200.0
  ], 
  [
   334659, 
   null, 
   "Joel_Henderson", 
   "This level of intelligence explains why Obama won by promising to raise taxes.", 
   {}, 
   334604, 
   null, 
   1227952380.0
  ], 
  [
   334931, 
   null, 
   "chester", 
   "This level of intelligence explains why Obama won by promising to raise taxes.\n\n \n What are the first 7 words of the United States Constitution?\n \n Have you renounced your \"non-existent\" American citizenship?\n \n Do you ignore the laws made by the Congress and signed by the President?\n \n Did you vote for a candidate for President of the United States?\n \n If you have a passport, which state government issued it?\n \n If the answers to # 1&2 are no, why not?\n \n If the answers to #3&4 are, \"I voted for a Presidential candidate..\" and \"I have a United States passport\" respectively, the question is why?\n \n Crackpot theories cannot withstand present realities.", 
   {}, 
   334659, 
   null, 
   1228176420.0
  ], 
  [
   334937, 
   null, 
   "hollyh", 
   "JH has left the building! :)", 
   {}, 
   334931, 
   null, 
   1228176960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Who is the sovereign?", 
  "url": "http://www.4forums.com/political/government-debates/12033-who-sovereign.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 12033, 
  "discussion_files": [
   [
    "21192.html", 
    "http://www.4forums.com/political/government-debates/12033-who-sovereign-print.html"
   ]
  ], 
  "identifier": 12033
 }
]