[
 [
  [
   334693, 
   null, 
   "snakespit", 
   "Saturday, November 29, 2008\n AP\n NEW YORK - Police were reviewing video from surveillance cameras in an attempt to identify people who trampled on a Wal-Mart worker killed when a crowd of post-Thanksgiving shoppers burst through the doors at a suburban store and knocked him down.\n \n Criminal charges were still possible, but identifying anyone in the store's videos may prove difficult, said Nassau County police spokesman Detective Lt. Michael Fleming on Friday.\n \n Other workers were trampled as they tried to rescue the man, and customers stepped over him and became irate when officials said the store was closing because of the death, police and witnesses said.\n \n At least four other people, including a woman who was eight months pregnant, were taken to hospitals for observation or minor injuries, and the store in Valley Stream on Long Island closed for several hours. It reopened shortly after 1 p.m.\n \n Police said about 2,000 people were gathered outside the Wal-Mart doors before its 5 a.m. opening at a mall about 20 miles east of Manhattan. The impatient crowd knocked the employee, identified by police as Jdimytai Damour of Queens, to the ground as he opened the doors, leaving a metal portion of the frame crumpled like an accordion.\n \n \"This crowd was out of control,\" said Fleming, who described the scene as \"utter chaos.\"\n \n Dozens of store employees trying to fight their way out to help Damour were also getting trampled by the crowd, Fleming said. Witnesses said that even as the worker lay on the ground, shoppers streamed into the store, stepping over him.\n \n Kimberly Cribbs, who witnessed the stampede, said shoppers were acting like \"savages.\"\n \n \"When they were saying they had to leave, that an employee got killed, people were yelling, 'I've been on line since yesterday morning,\"' she said. \"They kept shopping.\"\n \n The 28-year-old pregnant woman was taken to a hospital, where she and the baby were reported to be OK, said police Sgt. Anthony Repalone. At least three other people were taken to hospitals with minor injuries.\n \n \n http://http://www.foxnews.com/story/0,2933,459068,00.html\n\n \n How idiotic can people get? I hope they are able to identify every one of the XXXXXX that caused this and charge them all with manslaughter. People seem to get a little more rediculous every year. \n \n I especially like the fact that people will sit in line in front of a Wal-Mart on Thanksgiving day to be among the first in line when it opens on Friday.", 
   {
    "post_info": {
     "post_title": "Mindless animals"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1227995580.0
  ], 
  [
   334722, 
   null, 
   "hollyh", 
   "Yeah, this very sad story made our news here in Oz. Many years ago we had one of those big sales run in a major department store chain, after the behavior of the shoppers was shown to be a step above savagery all such sales have ceased to exist. \n Fortunately we didnt wait for someone to be seriously injured before the event was permanently axed.\n \n I feel so sorry for this poor man, his family and his fellow workers who tried to save him.\n \n I do have to ask, what on earth was an heavily pregnant woman doing in such a notoriously aggressive environment??", 
   {}, 
   334693, 
   null, 
   1228011240.0
  ], 
  [
   334735, 
   null, 
   "marc9000", 
   "Something similar happened at a rock concert in Cincinnati 29 years ago. Slightly more understandable at a rock concert than at a department store, but not much. \n \n Is this a reflection of an ever increasing downturn in human nature, or a lack of planning/management of crowds by businesses, as the above link seems to suggest? I believe it's the former.", 
   {}, 
   334693, 
   null, 
   1228018920.0
  ], 
  [
   334753, 
   null, 
   "Jo Bennett", 
   "I think it's the ultimate result of capitalism. When you have a very limited supply and huge demand then you encourage this sort of behaviour. A new furniture store in the UK opened near a rundown estate and advertised brand new leather sofas at £100 each, there were huge crowds as a result, and a riot. This opinion piece from the Guardian highlights some of the crowd control research that applies in this situation:\n Crush that was waiting to happen | Science | The Guardian\n \n The key point, I think, is not that human beings have got any worse, just that capitalism focuses desire on the material, so the desire for material goods is heightened to a level where it becomes the sole focus.", 
   {}, 
   334735, 
   null, 
   1228038540.0
  ], 
  [
   334792, 
   null, 
   "marc9000", 
   "I think it's the ultimate result of capitalism. When you have a very limited supply and huge demand then you encourage this sort of behaviour. A new furniture store in the UK opened near a rundown estate and advertised brand new leather sofas at £100 each, there were huge crowds as a result, and a riot. This opinion piece from the Guardian highlights some of the crowd control research that applies in this situation:\n Crush that was waiting to happen | Science | The Guardian\n \n The key point, I think, is not that human beings have got any worse, just that capitalism focuses desire on the material, so the desire for material goods is heightened to a level where it becomes the sole focus.\n\n \n But the rock concert I mentioned above had nothing to do with capitalism. I think it was a similar situation. A sentence from your link;\n \n \nOnce you've weathered the horrors of getting there, you enter into sensory deprivation in an environment that is manipulative and particularly prone to difficult crowd dynamics.\n\n \n True I think, and can be applied to non-capatalistic events as well as capatalistic ones. I think something like this could (and probably has) happened in a non-capatalistic country.", 
   {}, 
   334753, 
   null, 
   1228076280.0
  ], 
  [
   334794, 
   null, 
   "isly ilwott", 
   "I think it's the ultimate result of capitalism. When you have a very limited supply and huge demand then you encourage this sort of behaviour. A new furniture store in the UK opened near a rundown estate and advertised brand new leather sofas at £100 each, there were huge crowds as a result, and a riot. This opinion piece from the Guardian highlights some of the crowd control research that applies in this situation:\n Crush that was waiting to happen | Science | The Guardian\n \n The key point, I think, is not that human beings have got any worse, just that capitalism focuses desire on the material, so the desire for material goods is heightened to a level where it becomes the sole focus.\nBS!\n \n It was greed. What you have in communist countries is a very limited supply and a huge demand for everything. The communist dopes stand in line for hours to get a ration of whatever is being passed out that day.\n \n Their desire for material goods is likely higher than ours. It's just that the pickings are slim and there is no incentive to improve the system.", 
   {}, 
   334753, 
   null, 
   1228076820.0
  ], 
  [
   334820, 
   null, 
   "snakespit", 
   "I think it's the ultimate result of capitalism. When you have a very limited supply and huge demand then you encourage this sort of behaviour. A new furniture store in the UK opened near a rundown estate and advertised brand new leather sofas at £100 each, there were huge crowds as a result, and a riot. This opinion piece from the Guardian highlights some of the crowd control research that applies in this situation:\n Crush that was waiting to happen | Science | The Guardian\n \n The key point, I think, is not that human beings have got any worse, just that capitalism focuses desire on the material, so the desire for material goods is heightened to a level where it becomes the sole focus.\n\n Limited supply in the face of huge demand is not exclusive to capitallism. It has occured with China, N. Korea, Cuba, the USSR, etc. The difference is that historically they have rioted over things like food, shelter, medicine, and clothing. This can easily be understood, if not even condoned. Sadly, some people here in the US are willing to trample others for items likke DVD payers, video games, and children's toys. While I agree that capitalism has allowed people to enojy a standard of living where the majority of people have enough essentials and can afford to go out and buy these non-essential items, I cannot understand blaming capitalism for this human behavior. It would be like blaming the grocery store for making people fat. It comes down to individual responsibility. The grocery store provides people the means to get fat, but the individual must make the conscious choice to buy and consume the products. Likewise, people must choose to engage in such abominable behavior. \n \n I think it is foolish projection to blame this abhorent animal behavior on capitalism.", 
   {}, 
   334753, 
   null, 
   1228088220.0
  ], 
  [
   334854, 
   null, 
   "Jo Bennett", 
   "Rioting over food and shelter - essentials for life - has a certain amount of logic. It is only modern consumerism that has elevated leather sofas and plasma TVs to that \"essential\" level in the minds of some. True, materialism is present in some forms of communism too (certainly the atheist types of communism were in the literal sense materialist philosophies).", 
   {}, 
   334820, 
   null, 
   1228115040.0
  ], 
  [
   334913, 
   null, 
   "Ripskar", 
   "We get this every year, remember the fights for Cabbage Patch dolls?\n It also happens at religious festivals, people are trampled every year on the Hajj. People are animals, every so often they forget they're pretending to be civilised.", 
   {}, 
   334854, 
   null, 
   1228170480.0
  ], 
  [
   334925, 
   null, 
   "isly ilwott", 
   "We get this every year, remember the fights for Cabbage Patch dolls?\n It also happens at religious festivals, people are trampled every year on the Hajj. People are animals, every so often they forget they're pretending to be civilised.\nExactly so. When we legislate sexual activity, we are pretending to be civilized. In recent years I have amended my sentiments toward rapists and child molesters. Rather than kill them, we should castrate them (in a radical fashion) to remove their need to pretend to be harmless.\n \n That has little bearing on the trampling incidents that will occur when greed or fear become the prevalent motivator of mobs. The big wedding dress sale that occasionally gets into the news shows women willing to tear a dress in half rather than let go of it. Greed causes the camp-out-shoppers to attempt to purchase several of the demanded toy in order to resell them for additional profit. There is little we can do about greed. It comes from our natural drive to survive. Siblings will fight over scraps of bread if both are hungry.", 
   {}, 
   334913, 
   null, 
   1228174980.0
  ], 
  [
   335353, 
   null, 
   "chester", 
   "Exactly so. When we legislate sexual activity, we are pretending to be civilized. In recent years I have amended my sentiments toward rapists and child molesters. Rather than kill them, we should castrate them (in a radical fashion) to remove their need to pretend to be harmless.\n \n That has little bearing on the trampling incidents that will occur when greed or fear become the prevalent motivator of mobs. The big wedding dress sale that occasionally gets into the news shows women willing to tear a dress in half rather than let go of it. Greed causes the camp-out-shoppers to attempt to purchase several of the demanded toy in order to resell them for additional profit. There is little we can do about greed. It comes from our natural drive to survive. Siblings will fight over scraps of bread if both are hungry.\n\n \n Once again we see the natural propensity of righties to take a dark view of the nature of man. Jesus, Shabbati Tsvi, Gandhi, MLK, Mandela, Schindler - fools, FOOLS every one of them, putting others before themselves, right?\n \n BTW, are you familiar with the 8th Amendment to the Constitution - you know, the one outlawing cruel and unusual punishment?", 
   {
    "post_info": {
     "post_title": "Why do we kill people to teach people that killing people is wrong?"
    }
   }, 
   334925, 
   null, 
   1228417740.0
  ], 
  [
   335362, 
   null, 
   "Charliegone", 
   "In Communist countries people would wait in line because they are forced to. If Wal-mart had 2 guys standing outside with machine guns telling people to get in line or else, I'm sure they'd do it! The problem here was this. People got way to greedy over something so stupid. Saving $50 bucks on tv is no reason to trample over someone. Second, poor planning by the Wal-mart employees. Had they done this in a more orderly fashion this would have never happened. Capitalism is NOT at fault here. The lack of planning and people's greed is what caused this.", 
   {}, 
   335353, 
   null, 
   1228420020.0
  ], 
  [
   335371, 
   null, 
   "simone", 
   "Capitalism is greed.", 
   {}, 
   335362, 
   null, 
   1228420500.0
  ], 
  [
   335415, 
   null, 
   "Charliegone", 
   "Capitalism is greed.\n\n \n emoticon_rolleyes An ideology cannot have greed. Only people are capable of that.", 
   {}, 
   335371, 
   null, 
   1228435620.0
  ], 
  [
   335433, 
   null, 
   "chester", 
   "emoticon_rolleyes An ideology cannot have greed. Only people are capable of that.\n\n \n NONSENSE!!\n \n If a belief system promotes greed in its followers, the system itself is greedy.", 
   {
    "post_info": {
     "post_title": "Capitalism - take from the needy and give to the greedy"
    }
   }, 
   335415, 
   null, 
   1228453620.0
  ], 
  [
   335435, 
   null, 
   "Symbiote", 
   "Capitalism is greed.\n\n \n I'm sorry you feel that way Simone, but it is particularly sad to see you've decided to drop any rationale for this feeling.\n \n Since you've put so little effort into making your feelings clear, all you get is this URL.\n \n Does Capitalism Make Us More Materialistic? - Ben O'Neill - Mises Institute", 
   {}, 
   335371, 
   null, 
   1228454520.0
  ], 
  [
   335444, 
   null, 
   "Winston Smith", 
   "\"There was a time when the advocates of socialism argued that it would lead man to material abundance, whereas free-market capitalism would lead only to increasing misery and would ultimately collapse under its own internal stresses. You don't hear that too much these days, and for good reason. A century of empirical evidence has shown the contrary - that the free market leads to increasing wealth and material freedom...\"\n \n Sure! emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   335435, 
   null, 
   1228470900.0
  ], 
  [
   335479, 
   null, 
   "simone", 
   "Monsieur O'Neill muses on environmentalism:\n \nIn Australia, governments have adopted environmental education programs that teach children that human intrusion into nature is to be condemned and that man's life must be subordinated to the preservation of nature, by government force if necessary. Under this view, nature is not to be preserved for the benefit of man, but rather, it is to be preserved for its own sake against the encroachments of man. This is the philosophy of environmentalism, and the standard viewpoint of environmentalists, according to philosopher Michael Berliner:\n\n Teaching Kids about the Environment, Government Style - Ben O'Neill - Mises Institute\n \n So, it appears that Monsieur O'Neill makes the claim that this Michael Berliner person speaks for all environmentalists when Monsieur Berliner makes the claim:\n \nNature, they insist, has \"intrinsic value,\" to be revered for its own sake, irrespective of any benefit to man. As a consequence, man is to be prohibited from using nature for his own ends. Since nature supposedly has value and goodness in itself, any human action which changes the environment is necessarily branded as immoral. Environmentalists invoke this argument from intrinsic value not against lions that eat gazelles or beavers that fell trees; they invoke it only against man, only when man wants something. The environmentalists' concept of intrinsic value is nothing but the desire to destroy human values.\n\n And Monsieur Berliner tries to diminish the issues of environmental concerns to the simplistic and rather ridiculous equation:\n \nHuman values vs. the intrinsic value of nature.\n\n The problem is that human values may be highly invested in the intrinsic value of nature and we do not yet thoroughly understand the natural world which surrounds us and nurtures us.\n \n I am an environmentalist because of my intrinsic interest in my own welfare. I can perceive that I exist because of a very delicately balanced network of other life forms and the basic resources of good air, good water and rich and abundant soil for growing my food. When human tampering mucks up one of these resources, including the network of other life forms, I might cease to exist before my time to do so because of human blundering. My self-interest commands that I look out for my own interests and that impels me to insist that we must know more about our natural surroundings before we take any drastic actions.", 
   {}, 
   335444, 
   null, 
   1228506660.0
  ], 
  [
   335488, 
   null, 
   "Jo Bennett", 
   "\"There was a time when the advocates of socialism argued that it would lead man to material abundance, whereas free-market capitalism would lead only to increasing misery and would ultimately collapse under its own internal stresses. You don't hear that too much these days, and for good reason. A century of empirical evidence has shown the contrary - that the free market leads to increasing wealth and material freedom...\"\n \n Sure! emoticon_rolleyes\n\n \n The last century has proven that capitalism isn't quite as viscious when tempered by the promise of socialism. The countries with the highest standard of living are those which adopted social market rather than free market solutions.", 
   {
    "unicode_changes_made": true
   }, 
   335444, 
   null, 
   1228510500.0
  ], 
  [
   335507, 
   null, 
   "Zardoz", 
   " In recent years I have amended my sentiments toward rapists and child molesters. Rather than kill them, we should castrate them (in a radical fashion) to remove their need to pretend to be harmless.\n\n \n Might want to re-reammend your sentiments.\n Rape is about power.\n Molestation doesn't often involve genitalia.\n \n Much better to simply kill them and remove all doubt if that's what you seek.", 
   {}, 
   334925, 
   null, 
   1228525560.0
  ], 
  [
   335509, 
   null, 
   "Zardoz", 
   "As to the OP.\n \n A death is MORE likely to cause people to want to show up for such events.\n People are just bloodthirsty.\n \n Also, many of the dumbarses who partake of these events have been camping out in the cold for HOURS waiting to be first in line to get in.\n Once the doors open, there's not only a rush to get the goods...but a simple desire to get out of the elements.\n \n I tend not to do this stuff myself. But, tried it for 2 years a while back when I was short on cash.\n \n 1st year, I was smart and had a whore to snuggle up with and some blankets in my car to shroud ourselves with.\n \n 2nd year, I showed up mostly on a lark near the time the doors were to open.\n By the time I got inside, people were already lined up to pay for their stuff. I was more looking for a couple of items with my son nad just taking my time to observe what was going on.\n \n My wife does this thing and her mother and buddies are serious about it.\n Don't know why...there's typically nothing that is ever really 'needed' that you can't find on sale (maybe less so) while avoiding the chaos.\n But, like the Jerry Springer life I live, I note that they just 'like it'. It's and 'experience'.\n Thus, unless you ban this activity altogether...XXXXXX will continue doing it.\n \n IMO, the sales aren't that awesome...but, what would I know.", 
   {}, 
   335507, 
   null, 
   1228526040.0
  ], 
  [
   335511, 
   null, 
   "Penfold", 
   "The deaths are directly attributable to the flow dynamics within the moving crowd, and the design of the passageways within the store. But then that's boring reality.", 
   {}, 
   335509, 
   null, 
   1228529460.0
  ], 
  [
   335514, 
   null, 
   "snakespit", 
   "The deaths are directly attributable to the flow dynamics within the moving crowd, and the design of the passageways within the store. But then that's boring reality.\n\n If by \"flow dynamics within the moving crowd\" you mean people acting like animals and crushing a man to death, then yes...you are correct. I wonder if those \"deadly passageways\" would have killed anyone if the crowd had walked into the store like mature adults in an orderly fasion rather than pushing and shoving like a bunch of 3 y/o kids at an icecream truck. emoticon_rolleyes", 
   {}, 
   335511, 
   null, 
   1228533960.0
  ], 
  [
   335516, 
   null, 
   "Penfold", 
   "Nobody intended to maim or kill. It happened as a result of the combination of the circumstances and the geography of the store. Those unfortunates who possibly saw him fall, could do nothing against the pressure from the crowd behind, and knowingly trampled him. The people behind would stumble over an unexpected obstacle, and not even know what they stood on. \n Some folks need scapegoats... blame the designer of the store, who did not forsee the risk.", 
   {}, 
   335514, 
   null, 
   1228534860.0
  ], 
  [
   335526, 
   null, 
   "Winston Smith", 
   "The last century has proven that capitalism isn't quite as viscious when tempered by the promise of socialism. The countries with the highest standard of living are those which adopted social market rather than free market solutions.\n\n \n \n Precisely! that is why the Swedish model is the one that delivers the highest standard of living in the world, not the highest in material terms, but in social terms. \n quality of life is not measured by the size of your car or your house or how many nuclear bombs your country posess.\n \n half a million people were left unemployed in the USA in November alone, and if the government does not bail out those automakers which produce cars nobody wants the unemplyment will skyrocket", 
   {}, 
   335488, 
   null, 
   1228543500.0
  ], 
  [
   335529, 
   null, 
   "snakespit", 
   "Nobody intended to maim or kill. It happened as a result of the combination of the circumstances and the geography of the store. Those unfortunates who possibly saw him fall, could do nothing against the pressure from the crowd behind, and knowingly trampled him. The people behind would stumble over an unexpected obstacle, and not even know what they stood on. \n Some folks need scapegoats... blame the designer of the store, who did not forsee the risk.\n\n \n Who needs a scapegoat when we know who the guilty parties are? It's the crowd that trampled the man. The designer of the store did nothing wrong. A narrow entrance-way to a store does not excuse people of their responsibility to act like responsible and civil human beings. Sounds like a textbook definition of involuntary manslaughter to me...look it up.", 
   {}, 
   335516, 
   null, 
   1228543800.0
  ], 
  [
   335553, 
   null, 
   "Winston Smith", 
   "a mob is not just a collection of individuals. a mob is monster; haven't you heard of the term \"mob mentality\"", 
   {}, 
   335529, 
   null, 
   1228568760.0
  ], 
  [
   335570, 
   null, 
   "simone", 
   "And America is currently ruled by mob mentality.\n \n Our schools are disaster zones that teach only the basest of skills. The founding moral principles of our nation have been made mock of by the Bush administration.", 
   {}, 
   335553, 
   null, 
   1228591740.0
  ], 
  [
   335595, 
   null, 
   "Winston Smith", 
   "True, but remember that Jefferson pursued his happiness in the arms of his mistress, her slave Sally Hemings. He was a slaver.\n But I know what you mean. Bush & Co. only value wealth and are the government of the rich for the rich. They bailed out all their buddies in Wall Street, but don't care if the auto industry goes belly up and thousands more workers end up jobless.\n Greed sends your moral compass haywire, and Capitalism is driven by greed and greed only. It infects all of society eventually", 
   {
    "unicode_changes_made": true
   }, 
   335570, 
   null, 
   1228608180.0
  ], 
  [
   335659, 
   null, 
   "Symbiote", 
   "Monsieur O'Neill muses on environmentalism:\n \\\n\n \n I'm glad you were so impressed by his discussion of materialism, marginal utility and greed that you decided to move on to read the rest of his work.", 
   {}, 
   335479, 
   null, 
   1228635960.0
  ], 
  [
   335691, 
   null, 
   "simone", 
   "True, but remember that Jefferson pursued his happiness in the arms of his mistress, her slave Sally Hemings. He was a slaver.\n But I know what you mean. Bush & Co. only value wealth and are the government of the rich for the rich. They bailed out all their buddies in Wall Street, but don't care if the auto industry goes belly up and thousands more workers end up jobless.\n Greed sends your moral compass haywire, and Capitalism is driven by greed and greed only. It infects all of society eventually\n\n I am well aware of Jefferson's flawed morality. As well as the problematical idiosyncrasies of our other Founders.\n \n But they did a damned fine job of creating our nation despite their humanity.", 
   {
    "unicode_changes_made": true
   }, 
   335595, 
   null, 
   1228670940.0
  ], 
  [
   335727, 
   null, 
   "isly ilwott", 
   "And America is currently ruled by mob mentality.\nQuite so. That is exactly what got Barack Hussein Obama elected...mob mentality. Had the mob members paid attention to true values and the history of the candidates, they would not have garnered 40% of the vote.\n \n\n Our schools are disaster zones that teach only the basest of skills. The founding moral principles of our nation have been made mock of by the Bush administration.\nNay, nay. It was Bill Clinton that taught our children that felatio is not having sex.\n \n The school system has been controlled by liberals for decades. That's one reason that so many private schools have been recently established.", 
   {}, 
   335570, 
   null, 
   1228687380.0
  ], 
  [
   335840, 
   null, 
   "Winston Smith", 
   "Quite so. That is exactly what got Barack Hussein Obama elected...mob mentality. Had the mob members paid attention to true values and the history of the candidates, they would not have garnered 40% of the vote.\n \n\n \n and what do you call McCain supporters?\n \n People who voted for Obama paid close attention to the true values and the history of the candidates indeed.", 
   {}, 
   335727, 
   null, 
   1228728060.0
  ], 
  [
   335841, 
   null, 
   "Winston Smith", 
   "I am well aware of Jefferson's flawed morality. As well as the problematical idiosyncrasies of our other Founders.\n \n But they did a damned fine job of creating our nation despite their humanity.\n\n \n \n what was idiosyncratic of Jefferson, being a slaver or, having a prolonged affair with one of his slaves? \n \n I thought that what he was and did was pretty common in the South so idiosyncrasy is the wrong adjective. Shameful comes to mind\n \n OK! he was all for the pursuit of happiness wasn't he? ;)", 
   {}, 
   335691, 
   null, 
   1228728480.0
  ], 
  [
   335872, 
   null, 
   "simone", 
   "Actually, Jefferson might have actually been ashamed of what he did. Other southerners had no comparable sense of shame.\n \n And, had Jefferson been wealth enough, he would have freed all his slaves.\n \n Most of the Founders of our nation desired to free their slaves but they had risked all their capital and means in creating a brave new nation and were largely left destitute.", 
   {}, 
   335841, 
   null, 
   1228759260.0
  ], 
  [
   335908, 
   null, 
   "Winston Smith", 
   "Actually, Jefferson might have actually been ashamed of what he did. Other southerners had no comparable sense of shame.\n \n And, had Jefferson been wealth enough, he would have freed all his slaves.\n \n Most of the Founders of our nation desired to free their slaves but they had risked all their capital and means in creating a brave new nation and were largely left destitute.\n\n \n not wealthy enough? kinda of I will be a good person when I wealthy enough?\n \n \n Jefferson destitute?\n \n How do you know he was ashamed? \n \n You know, the more you try to justify his actions the worse he looks.\n Every time he paid a visit to the plantation he left her pregnant.\n \n He began his sexual abuse of her, when she was underage and his maid in Paris. A criminal offence in this day and age, apart from slavery.\n She struck a deal with him, in return for him scr***ing her, he promised to free her children when they became 21. A promise he kept", 
   {}, 
   335872, 
   null, 
   1228786980.0
  ], 
  [
   335998, 
   null, 
   "simone", 
   "Jefferson's estate:\n \nJefferson died on the Fourth of July, 1826, the 50th anniversary of the adoption of the Declaration of Independence. He died a few hours before the death of John Adams, his compatriot in their quest for independence, then great political rival, and later friend and correspondent. Adams is often rumored to have referenced Jefferson in his last words, unaware of his passing.\n \n Although he was born into one of the wealthiest families in the United States, Thomas Jefferson was deeply in debt when he died.\n \n Jefferson's trouble began when his father-in-law died, and he and his brothers-in-law quickly divided the estate before its debts were settled. It made each of them liable for the whole amount due - which turned out to be more than they expected.\n \n Jefferson sold land before the American Revolution to pay off the debts, but by the time he received payment, the paper money was worthless amid the skyrocketing inflation of the war years. Cornwallis ravaged Jefferson's plantation during the war, and British creditors resumed their collection efforts when the conflict ended. Jefferson was burned again when he co-signed notes for a relative who reneged on debts in the financial Panic of 1819. Only Jefferson's public stature prevented creditors from seizing Monticello and selling it out from under him during his lifetime.\n \n After his death, his possessions were sold at auction. In 1831, Jefferson's 552 acres (223 hectares) were sold for $7,000 to James T. Barclay. Thomas Jefferson is buried on his Monticello estate, in Charlottesville, Virginia. In his will, he left Monticello to the United States to be used as a school for orphans of navy officers. His epitaph, written by him with an insistence that only his words and \"not a word more\" be inscribed, reads:\n\n Thomas Jefferson - Wikipedia, the free encyclopedia", 
   {
    "unicode_changes_made": true
   }, 
   335908, 
   null, 
   1228857540.0
  ], 
  [
   336019, 
   null, 
   "Winston Smith", 
   "but does being in debt justify slavery?", 
   {}, 
   335998, 
   null, 
   1228864020.0
  ], 
  [
   336020, 
   null, 
   "Ethmi", 
   "That's why you won't find me at any store on Black Friday morning.", 
   {}, 
   335433, 
   null, 
   1228864080.0
  ], 
  [
   336023, 
   null, 
   "Ethmi", 
   "and what do you call McCain supporters?\n \n People who voted for Obama paid close attention to the true values and the history of the candidates indeed.\n\n \n Yes, which is why they would've voted for Joe Stalin. They didn't really care how things turned out as long as their worshiped \"change\" came. That was reckless of them.", 
   {}, 
   335840, 
   null, 
   1228864320.0
  ], 
  [
   336138, 
   null, 
   "CUNxTime", 
   "I think it's the ultimate result of capitalism. When you have a very limited supply and huge demand then you encourage this sort of behaviour. A new furniture store in the UK opened near a rundown estate and advertised brand new leather sofas at £100 each, there were huge crowds as a result, and a riot. This opinion piece from the Guardian highlights some of the crowd control research that applies in this situation:\n Crush that was waiting to happen | Science | The Guardian\n \n The key point, I think, is not that human beings have got any worse, just that capitalism focuses desire on the material, so the desire for material goods is heightened to a level where it becomes the sole focus.\n\n \n \n \n MY GOD I LOVE YOU JO! And you are right, if we didn't have capitalism, there wouldn't BE anything in the stores to run for!", 
   {}, 
   334753, 
   null, 
   1228918980.0
  ], 
  [
   336237, 
   null, 
   "Winston Smith", 
   "BS!\n \n It was greed. What you have in communist countries is a very limited supply and a huge demand for everything. The communist dopes stand in line for hours to get a ration of whatever is being passed out that day.\n \n Their desire for material goods is likely higher than ours. It's just that the pickings are slim and there is no incentive to improve the system.\n\n \n \n Recently our Labor Prime Minister increased the pension in Australia and told us the pensioners to go to the nearest mall and spend it all in order to stimulate the economy. Most of us saved it for the rainy days that are already here, and he wasn't amused.\n \n Our economic system is predicated in growth, a balloon (called greedy capitalism) we all have to be blowing into constantly or it collapses and all us hanging in the basket below crash. We the poor crash heavily but the rich crash softly if they ever crash.", 
   {}, 
   334794, 
   null, 
   1228988940.0
  ], 
  [
   336254, 
   null, 
   "chester", 
   "Yes, which is why they would've voted for Joe Stalin. They didn't really care how things turned out as long as their worshiped \"change\" came. That was reckless of them.\n\n \n Nothing like dissing the 63% of the American people who voted for Obama, right.\n \n All of them were deluded, right.\n \n The Rethugnicans should have understood the truth of the old cliche around the race track. \"You can't beat somebody with nobody.\"emoticon_smile\n \n McCain the Vietnam sellout was a pathetic joke, Palin the clothes horse was worse, and the platform was straight-out unAmerican.emoticon_mad\n \n One other good thing did come out of this election. Given my age, I'll be looking up at the grass before there is another Pubbie in the People's House on Pennsylvania Avenue.", 
   {}, 
   336023, 
   null, 
   1229002380.0
  ], 
  [
   336293, 
   null, 
   "Charliegone", 
   "Nothing like dissing the 63% of the American people who voted for Obama, right.\n \n All of them were deluded, right.\n \n The Rethugnicans should have understood the truth of the old cliche around the race track. \"You can't beat somebody with nobody.\"emoticon_smile\n \n McCain the Vietnam sellout was a pathetic joke, Palin the clothes horse was worse, and the platform was straight-out unAmerican.emoticon_mad\n \n One other good thing did come out of this election. Given my age, I'll be looking up at the grass before there is another Pubbie in the People's House on Pennsylvania Avenue.\n\n \n Actually it's more like 52% Obama 45% McCain so...that pretty much is split down the middle.", 
   {}, 
   336254, 
   null, 
   1229031300.0
  ], 
  [
   336296, 
   null, 
   "isly ilwott", 
   "Actually it's more like 52% Obama 45% McCain so...that pretty much is split down the middle.\n...and I'm guessing that 92.5% of those who voted for Obama did so without serious consideration of his history. They rode the popularity wave created by the MSM and others who simply thought it would be cool to have a black man as President.", 
   {}, 
   336293, 
   null, 
   1229032740.0
  ], 
  [
   336345, 
   null, 
   "Winston Smith", 
   "Although I did not vote for Obama, I am not a US citizen, I read several articles in The New Yorker before and during the campaign about his personal and politic background. I also read daily The New York Times \n \n I know, I know those publications are leftist rags, founded secretely by Islamic fundamentalists, former members of the KGB and by Putin himself, but what the heck ... one reads what is at hand, and since I am suscriber to The New Yorker it is weekly at hand.\n \n Obama is an intelligent, well educated American who has the right ideas, he is the opposite of W and luckily he appeared on the right place at the right time. Phew!", 
   {}, 
   336296, 
   null, 
   1229061000.0
  ], 
  [
   336353, 
   null, 
   "Charliegone", 
   "...and I'm guessing that 92.5% of those who voted for Obama did so without serious consideration of his history. They rode the popularity wave created by the MSM and others who simply thought it would be cool to have a black man as President.\n\n \n Seriously, I still do not understand how people could vote for a guy who was a junior Senator and limited experience. Even his win of the senate seat was questionable (you know when his obamabots tried to dig dirt up on Ryan about his divorce). Then comes to find out he has some ties to the Blago and others there. How he simply \"didn't know\" is pure bs. If I said the same thing about Bush, all these people that hate him would say that I was full of bs. Heck, he isn't even president yet and already is catching flak! Seems like we are in for a long 4 years.", 
   {}, 
   336296, 
   null, 
   1229066460.0
  ], 
  [
   336380, 
   null, 
   "chester", 
   "Seriously, I still do not understand how people could vote for a guy who was a junior Senator and limited experience. Even his win of the senate seat was questionable (you know when his obamabots tried to dig dirt up on Ryan about his divorce). Then comes to find out he has some ties to the Blago and others there. How he simply \"didn't know\" is pure bs. If I said the same thing about Bush, all these people that hate him would say that I was full of bs. Heck, he isn't even president yet and already is catching flak! Seems like we are in for a long 4 years.\n\n \n Only the far right radical religious lunatic fringe ideologues thinks so.\n \n For more thinking Americans, Obama's Presidency will restore the USA to its rightful place as the world's moral and economic leader after the miasma of the Bush years.:)", 
   {}, 
   336353, 
   null, 
   1229103000.0
  ], 
  [
   336383, 
   null, 
   "isly ilwott", 
   "Seriously, I still do not understand how people could vote for a guy who was a junior Senator and limited experience. Even his win of the senate seat was questionable (you know when his obamabots tried to dig dirt up on Ryan about his divorce). Then comes to find out he has some ties to the Blago and others there. How he simply \"didn't know\" is pure bs. If I said the same thing about Bush, all these people that hate him would say that I was full of bs. Heck, he isn't even president yet and already is catching flak! Seems like we are in for a long 4 years.\nObama won his first election by having all other candidates removed from the ballot. He is likely just as sleazy and underhanded as the governor. They definitely helped each other along the way. They each came from the same cess pool of corruption. Practice makes perfect. As time goes on, more and more will be revealed about the the true nature of the beast.\n \n The comments from the loony liberal left on this forum have verified time after time that they have lax morals and no common sense...previous post included.", 
   {}, 
   336353, 
   null, 
   1229104860.0
  ], 
  [
   336394, 
   null, 
   "snakespit", 
   "Only the far right radical religious lunatic fringe ideologues thinks so.\n\n Just not so. I in no way identify with the \"far right radical religious lunatic fringe ideologues\" any more than I identify with people like you Chester. I find both distasteful. \n \n \nFor more thinking Americans, Obama's Presidency will restore the USA to its rightful place as the world's moral and economic leader after the miasma of the Bush years.:)\n\n \n I like to think of Obama in terms of skeptical optimism. I would like to see him do a good job, I just don't hold much hope that he will. As for restoring the US to an economic leader, I really think he is off to a bad start. His support of the Wall Street bailout and the auto industry bailout have left little doubt in my mind that he doesn't understand economic fundamentals. Throwing money at monsters that do nothing but consume money only makes the monsters bigger. We need to take our lumps and pick ourselves up off the mat, not try to pad our landing.", 
   {}, 
   336380, 
   null, 
   1229108820.0
  ], 
  [
   336474, 
   null, 
   "chester", 
   "\n I like to think of Obama in terms of skeptical optimism. I would like to see him do a good job, I just don't hold much hope that he will. As for restoring the US to an economic leader, I really think he is off to a bad start. His support of the Wall Street bailout and the auto industry bailout have left little doubt in my mind that he doesn't understand economic fundamentals. Throwing money at monsters that do nothing but consume money only makes the monsters bigger. We need to take our lumps and pick ourselves up off the mat, not try to pad our landing.\n\n \n What do you propose the country do when and if the auto companies go bankrupt and more than 3M people are thrown out of work?emoticon_mad", 
   {
    "post_info": {
     "post_title": "Capitalism - take from the needy and give to the greedy!"
    }
   }, 
   336394, 
   null, 
   1229132580.0
  ], 
  [
   336476, 
   null, 
   "Symbiote", 
   "All I can do is laugh at the irony and stupidity of a self-styled leftist demanding the government steal from workers and give to corporations. \n \n \nWhat do you propose the country do when and if the auto companies go bankrupt and more than 3M people are thrown out of work?\n\n \n I don't know Chester, maybe the same thing it did about the Candlemakers, Piano Tuners and Horse-Drawn-Carriage-crafters when their archaic practices failed in the market - let them die.\n \n There is no policy more regressive, conservative and misguided than propping up prehistoric industries that are no longer profitable.", 
   {}, 
   336474, 
   null, 
   1229133000.0
  ], 
  [
   336493, 
   null, 
   "snakespit", 
   "What do you propose the country do when and if the auto companies go bankrupt and more than 3M people are thrown out of work?emoticon_mad\n\n Support, work for, and buy from auto companies that can run their businesses with some sense of financial responsibility. Americans are still going to need cars, and they will continue to be made and sold right here in America. They just might not say Ford, Chevy, or Chrysler on them anymore. I can live with that, I would rather buy a Honda or Toyota or Nissan anyway.", 
   {}, 
   336474, 
   null, 
   1229143080.0
  ], 
  [
   342028, 
   null, 
   "pro-con", 
   "the world is connected. for example; Japan creates a video game, China manufactures it, then the US buys it", 
   {
    "post_info": {
     "post_title": "globilazation"
    }
   }, 
   336493, 
   null, 
   1233084360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mindless animals", 
  "url": "http://www.4forums.com/political/news-forum/12038-mindless-animals.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 12038, 
  "discussion_files": [
   [
    "30427.html", 
    "http://www.4forums.com/political/news-forum/12038-mindless-animals-print.html"
   ], 
   [
    "30428.html", 
    "http://www.4forums.com/political/news-forum/12038-mindless-animals-4-print.html"
   ], 
   [
    "30429.html", 
    "http://www.4forums.com/political/news-forum/12038-mindless-animals-3-print.html"
   ], 
   [
    "30430.html", 
    "http://www.4forums.com/political/news-forum/12038-mindless-animals-2-print.html"
   ]
  ], 
  "identifier": 12038
 }
]