[
 [
  [
   334871, 
   null, 
   "Patriotus", 
   "While Europe is trying to manage the consequences of world's financial crisis and scrape the bottom of the barrel for provision of funds for some Ukraine and Georgia .... where officials misallocate those funds! It's clear that when Europe appropriates funds it determines what for those funds must be spent. So I think that Ukraine president is well in the know 'course but he pretended to be just not and spent the money for organization of Holodomor super show! \n Look, Ukraine administration can't solve real problems of country and produce for nation some 'bread and circuses' instead! As for me it's crime towards Europe at time of crisis! My money is spent for nothing, for some minor political things! Germany refused from financing Ukraine because of those are hard times now and we should think about own problems. Ukraine should rather ask for any financial support her master lusting such shows. I mean Washington 'course.", 
   {
    "post_info": {
     "post_title": "While Europe is trying to manage the consequences of world\u0092s financial crisis and scr"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1228148640.0
  ], 
  [
   334877, 
   null, 
   "simone", 
   "My God! Accountability is still present in the world?\n \n I thought Bush/Cheney had totally stamped out the devil of accountability!", 
   {}, 
   334871, 
   null, 
   1228151520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  While Europe is trying to manage the consequences of world\u0092s financial crisis and scr", 
  "url": "http://www.4forums.com/political/politics-debates/12043-while-europe-trying-manage-consequences-world-s-financial-crisis-scr.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 12043, 
  "discussion_files": [
   [
    "10032.html", 
    "http://www.4forums.com/political/politics-debates/12043-while-europe-trying-manage-consequences-world-s-financial-crisis-scr-print.html"
   ]
  ], 
  "identifier": 12043
 }
]