[
 [
  [
   21169, 
   null, 
   "Inspector346", 
   "Regarding the 2nd Amendment and right to carry laws: In the United States we have the Constitution and the related Bill Of Rights. The first ten of these should be perused on occasion if only to maintain familiarity.\n Specifically, the 2nd Amendment addresses the question of right to carry in the United States. Dispense with the temptation to interpret this amendment and ask yourself one very simple question. Who were the Bill Of Rights meant to protect? Was it \"the people\" or \"the government\"? Now that we understand this simple question there is no debate. Our calling now should be on how to deal with non-patriots and rogue states that would deny or attempt to deny our constitutional right to keep and bear arms. God save us.", 
   {
    "post_info": {
     "post_title": "2nd Amendment/NoDebate"
    }
   }, 
   null, 
   null, 
   1067825340.0
  ], 
  [
   21236, 
   null, 
   "kelvin90701", 
   "Regarding the 2nd Amendment and right to carry laws: In the United States we have the Constitution and the related Bill Of Rights. The first ten of these should be perused on occasion if only to maintain familiarity.\n Specifically, the 2nd Amendment addresses the question of right to carry in the United States. Dispense with the temptation to interpret this amendment and ask yourself one very simple question. Who were the Bill Of Rights meant to protect? Was it \"the people\" or \"the government\"? Now that we understand this simple question there is no debate. Our calling now should be on how to deal with non-patriots and rogue states that would deny or attempt to deny our constitutional right to keep and bear arms. God save us.\n\n \n It is very clear to me what is to be done with non-patriots and gun haters. You tolerate them. There is no other choice in a democracy.\n \n In a free market of ideas, I am absolutely convinced that the XXXXXX, liars, and dark age reasoning will expose themselves. In a free market of ideas the stupid ideas will die and go away.\n \n Two cases:\n \n \n See post #11\n http://www.4forums.com/political/showthread.php?p=21234\n \n See post on Sat Nov 01, 2003 1:10 pm \n http://forums.evula.com/viewtopic.php?t=1179&postdays=0&postorder=asc&start=225&sid=a2276f42164b4bc60af01fc12e57ef66\n \n \n That does not mean you passively allow them the free market. It means you hunt down these ideas and expose them.", 
   {}, 
   21169, 
   null, 
   1067879160.0
  ], 
  [
   21237, 
   null, 
   "Rev. HellH0und", 
   "Regarding the 2nd Amendment and right to carry laws: In the United States we have the Constitution and the related Bill Of Rights. The first ten of these should be perused on occasion if only to maintain familiarity.\n Specifically, the 2nd Amendment addresses the question of right to carry in the United States. Dispense with the temptation to interpret this amendment and ask yourself one very simple question. Who were the Bill Of Rights meant to protect? Was it \"the people\" or \"the government\"? Now that we understand this simple question there is no debate. Our calling now should be on how to deal with non-patriots and rogue states that would deny or attempt to deny our constitutional right to keep and bear arms. God save us.\n\n \n \n \n Of course there is no debate! But the civil rights violators do not care. That is why we take up the fight, to defend the very principles this country was founded on.", 
   {}, 
   21169, 
   null, 
   1067879640.0
  ], 
  [
   21363, 
   null, 
   "BMF", 
   "THe words \"militia\" and \"people\" make it very clear who has the right to bear arms.", 
   {}, 
   21237, 
   null, 
   1067926620.0
  ], 
  [
   21563, 
   null, 
   "kelvin90701", 
   "THe words \"militia\" and \"people\" make it very clear who has the right to bear arms.\n\n \n You are also protected by the 4, 5, and 14th Amendments. Your guns can not be seized. You can not be under suspicion for your guns to be seized without due process. All your legally obtained property is yours do to with in any way you want as long as it is legal.\n \n Lets not forget privacy. No one has the right to stick your nose into your business to even find out what your doing with your guns.", 
   {}, 
   21363, 
   null, 
   1068085560.0
  ], 
  [
   26906, 
   null, 
   "Dan the White", 
   "Regarding the 2nd Amendment and right to carry laws: In the United States we have the Constitution and the related Bill Of Rights. The first ten of these should be perused on occasion if only to maintain familiarity.\n Specifically, the 2nd Amendment addresses the question of right to carry in the United States. Dispense with the temptation to interpret this amendment and ask yourself one very simple question. Who were the Bill Of Rights meant to protect? Was it \"the people\" or \"the government\"? Now that we understand this simple question there is no debate. Our calling now should be on how to deal with non-patriots and rogue states that would deny or attempt to deny our constitutional right to keep and bear arms. God save us.\n\n \n First of all, the Constitution must be interpreted Mr. Constitutional Scholar. Where in the constitution does it say that murderers shouldn't have the right to guns? And to steal from Bowling for Columbine, shouldn't everyone have the right to have nuclear weapons, since those are arms? Don't use the whole second amendment debate because first of all, it is up to interpretation, and second of all, saying \"the right to bear arms\" in the Constitution doesn't make it the correct thing to do. And shut the hell up with your \"non-patriots\" XXXXXXXX. People can express their disagreement with the right to bear arms because, oh yeah, that's amendment 1. Oh, did you just happen to miss that part? And it's also not \"the people\" vs. \"the government\" because the people are the government. That's the point of a democracy.", 
   {}, 
   21169, 
   null, 
   1071182460.0
  ], 
  [
   26930, 
   null, 
   "kelvin90701", 
   "First of all, the Constitution must be interpreted Mr. Constitutional Scholar. Where in the constitution does it say that murderers shouldn't have the right to guns? And to steal from Bowling for Columbine, shouldn't everyone have the right to have nuclear weapons, since those are arms? Don't use the whole second amendment debate because first of all, it is up to interpretation, and second of all, saying \"the right to bear arms\" in the Constitution doesn't make it the correct thing to do. And shut the hell up with your \"non-patriots\" XXXXXXXX. People can express their disagreement with the right to bear arms because, oh yeah, that's amendment 1. Oh, did you just happen to miss that part? And it's also not \"the people\" vs. \"the government\" because the people are the government. That's the point of a democracy.\n\n \n Convicted murderes are not full citizens and do not have full rights. All the rights in the Constitution only applies to people who are full citizens.\n \n Nuclear weapons argument is moot. There is only one vendor in this country. You or anyone else does not have the right to make a vendor sell their private property against thier will. The only vendor in this country will not sell nuclear weapons to anyone other than the Department of Defense. The only vendor in this country is quite happy having only one customer. Until you can find a vendor, the nuclear weapons argument is just useless chit chat.\n \n Wrong or right. The Constitution is law. Regarding the \"non-patriots\", I have a different target for my venom, they are civil rights violators. That is exactly what those people are who are trying to take my guns, they are civil rights violators.", 
   {}, 
   26906, 
   null, 
   1071190740.0
  ], 
  [
   26933, 
   null, 
   "SilentPoet", 
   "Regarding the 2nd Amendment and right to carry laws\n\n \n For some reason I don't think that the founding fathers of this country meant for everyone in their house to own an M-16.", 
   {}, 
   26930, 
   null, 
   1071190920.0
  ], 
  [
   26939, 
   null, 
   "Inspector346", 
   "First of all, the Constitution must be interpreted Mr. Constitutional Scholar. Where in the constitution does it say that murderers shouldn't have the right to guns? And to steal from Bowling for Columbine, shouldn't everyone have the right to have nuclear weapons, since those are arms? Don't use the whole second amendment debate because first of all, it is up to interpretation, and second of all, saying \"the right to bear arms\" in the Constitution doesn't make it the correct thing to do. And shut the hell up with your \"non-patriots\" XXXXXXXX. People can express their disagreement with the right to bear arms because, oh yeah, that's amendment 1. Oh, did you just happen to miss that part? And it's also not \"the people\" vs. \"the government\" because the people are the government. That's the point of a democracy.\n\n \n Dan, you won't get far in these forums with personal attacks. You only demonstrate your lack of civility. And regarding my post; if you don't understand the difference between \"the people\" and \"the government\", see how far inside the Pentagon you get before \"the government\" stops you \"the people\". Regarding the 2nd amendment and my post on \"non-patriots\"; I believe it means what it says, and by extension, I believe that those who do not accept all or parts of the Bill Of Rights, ARE Not being patriotic. Regarding the 1st amendment in your personal attack, I never sought to silence you or anyone else in the realm of all these many posts on the subject. You are most certainly welcome to disagree with the posts of others -- just try to be more pleasant about it.", 
   {}, 
   26906, 
   null, 
   1071191940.0
  ], 
  [
   26946, 
   null, 
   "kelvin90701", 
   "For some reason I don't think that the founding fathers of this country meant for everyone in their house to own an M-16.\n\n \n \n Hmmm. They meant for militia members to have modern military weapons at home to bring with them when called up. What part of the Federalist supports your opinion? What part of the Founding Fathers writings support your opinion?\n \n Please see:\n http://federalistpapers.com/\n \n Your idea is notion based on your personal prejudice.", 
   {}, 
   26933, 
   null, 
   1071192720.0
  ], 
  [
   26953, 
   null, 
   "SilentPoet", 
   "Hmmm. They meant for militia members to have modern military weapons at home to bring with them when called up. What part of the Federalist supports your opinion? What part of the Founding Fathers writings support your opinion?\n\n \n That doesn't mean they wanted every civilian to carry an M-16.\n I can't prove it and I'm very inexpereinced in this debate.\n \n \n\n Your idea is notion based on your personal prejudice.\n\n \n Which is?", 
   {}, 
   26946, 
   null, 
   1071193140.0
  ], 
  [
   26992, 
   null, 
   "tarawa12", 
   "That doesn't mean they wanted every civilian to carry an M-16.\n I can't prove it and I'm very inexpereinced in this debate.\n \n \n \n\n Actually it DOES mean that. If you need to call up the militia then you want them to have \"militia weapons\". i.e. M16's etc.", 
   {}, 
   26953, 
   null, 
   1071197280.0
  ], 
  [
   27051, 
   null, 
   "kelvin90701", 
   "That doesn't mean they wanted every civilian to carry an M-16.\n I can't prove it and I'm very inexpereinced in this debate.\n \n \n \n Which is?\n\n \n \n It is both. Your idea on the Founding Fathers is both wrong and prejudiced.\n \n Please see the Federalist Papers, more specificially #46 and #48.\n \n If you do not know where your ideas came from or can not prove them, then may I suggest that you are basing them on previous prejudiced ideas?\n \n The Federalist the document that outlines the democratic principles that our republic is based on. It discusses citizenship, taxes, authority, government, rights, balance of power, etc. More specifically please see #46 and #48. It discusses the mistrust of standing armies and the balance of power required to keep a standing army is check.\n \n The Federalist is very explict, the Founding Fathers intended to balance the power of standing armies with armed militia. These militia would be citizens who bring thier own weapons from home.", 
   {}, 
   26953, 
   null, 
   1071212400.0
  ], 
  [
   27112, 
   null, 
   "Dan the White", 
   "Convicted murderes are not full citizens and do not have full rights. All the rights in the Constitution only applies to people who are full citizens.\n\n \n Good point.\n \n \nNuclear weapons argument is moot. There is only one vendor in this country. You or anyone else does not have the right to make a vendor sell their private property against thier will. The only vendor in this country will not sell nuclear weapons to anyone other than the Department of Defense. The only vendor in this country is quite happy having only one customer. Until you can find a vendor, the nuclear weapons argument is just useless chit chat.\n\n \n So if I did find a vender, then what would you say? Why do we prevent the importation of weapons grade plutonium? Shouldn't that be protected under the second amendment? Why doesn't the government allow people to produce nucleur weapons? If the government suddenly stopped all production of guns except those that were sold to the Department of defense, would it suddenly make this arguement moot?\n \n \nWrong or right. The Constitution is law. Regarding the \"non-patriots\", I have a different target for my venom, they are civil rights violators. That is exactly what those people are who are trying to take my guns, they are civil rights violators.\n\n \n True, true, although it can be amended. However, the Supreme Court's interpretations of the laws are also law and if the Supreme Court had already outlawed gun control laws, I think I would know about it. From what I briefly read on the web, the Court has avoided the issue mostly but did make an influencial ruling in some case involving a Miller. I would look for it now but I'm running out of time. Regardless, it's not as straightfoward as you guys are making it seem. Don't call people non-patriots or civil rights violators for disagreeing with your interpretation of the second amendment.\n \n \nDan, you won't get far in these forums with personal attacks. You only demonstrate your lack of civility. And regarding my post; if you don't understand the difference between \"the people\" and \"the government\", see how far inside the Pentagon you get before \"the government\" stops you \"the people\". Regarding the 2nd amendment and my post on \"non-patriots\"; I believe it means what it says, and by extension, I believe that those who do not accept all or parts of the Bill Of Rights, ARE Not being patriotic. Regarding the 1st amendment in your personal attack, I never sought to silence you or anyone else in the realm of all these many posts on the subject. You are most certainly welcome to disagree with the posts of others -- just try to be more pleasant about it.\n\n \n I always like to have a little fun with personal attacks, and I don't mind if someone attacks me because it's just the internet. However, I didn't think it would bother you that much and if it did then sorry.\n \n You also aren't allowed to get into my house without my permission, but does that make me \"the government\" and you \"the people.\" And if this government is so bad, then why do we even have one?\n \n And as for patriotic, the British colonists prior to the American Revolution were being non-patriotic by not accepting the principal of virtual representation.", 
   {}, 
   26930, 
   null, 
   1071269280.0
  ], 
  [
   27151, 
   null, 
   "montalban", 
   "The 2nd Amendment was put in place to protect the states from a central government becoming a tyranny just like the one you claim Britain to have been* hence the use of the word militia... (of which I have posted court made definitions of on previous posts.)\n \n This law is not a 'natural law' but one negotiated betwixt various representatives of the colonies/states.\n \n Even the amendment re: religion has been changed by the court - in the famous Mormon trail of the late 1800s their freedom of religion was ruled not to extend to the point of polygamy.\n \n The statement earlier about the court deciding the law is true. You guys established a referee to determine these matters; a body of government that's supposed to be impartial.\n \n Most democracies believe that courts can decide. Except in your nation there's a huge body of opinion that doesn't believe this; if it affects there right to have a penis replacement... er.... gun.\n \n \n \n \n *In these jingoistic terms you Americans forget that you allied yourself with even more repressive governments viz France and Spain in order to get rid of Britain (France being so monstrously corrupt that it burst into revolution not long afterwards; Spain too was no bastion of liberty)\n \n Further in your pursuit of 'freedom' you invaded Canada several times both in the Revolution and in the War of 1812.\n \n Also, it is estimated that only 1/3 of colonials actively supported the cause of revolution - hardly a picture of a people 'yearning to be free'.\n \n The government 'of the people' was never true in your early history either. George Washington wasn't popularly elected. Women didn't get the vote till c.1920. Blacks didn't formally get it till 1860s, but were discriminated against in so many areas that you had to pass another amendment in the 1960s (re: state taxes)", 
   {}, 
   27112, 
   null, 
   1071282480.0
  ], 
  [
   27157, 
   null, 
   "Dan the White", 
   "*In these jingoistic terms you Americans forget that you allied yourself with even more repressive governments viz France and Spain in order to get rid of Britain (France being so monstrously corrupt that it burst into revolution not long afterwards; Spain too was no bastion of liberty)\n \n Further in your pursuit of 'freedom' you invaded Canada several times both in the Revolution and in the War of 1812.\n \n Also, it is estimated that only 1/3 of colonials actively supported the cause of revolution - hardly a picture of a people 'yearning to be free'.\n \n The government 'of the people' was never true in your early history either. George Washington wasn't popularly elected. Women didn't get the vote till c.1920. Blacks didn't formally get it till 1860s, but were discriminated against in so many areas that you had to pass another amendment in the 1960s (re: state taxes)\n\n \n Yeah, I've learned a lot from U.S. history this year. For all those people who always bring up images of the great freedom that we fought and died for, you may want to do a little bit more research. It was not only unnecessary to separate from Britain, but also a bit selfish. At the time of the American Revolution, the colonists/Americans were the least taxed and had the highes standard of living in the western world. And once they did win independence, not much really changed. If anything, conditions got worse. And although its popular these days to hate terrorists, some Americans were terrorists against the British. The somewhat famous Nathaniel Hale, often believed to have been hanged by the British for espionage, was in fact hanged because he attempted to burn down British quarters. Sounds surprisingly similar to the many attacks on U.S. troops in the middle east.\n \n Yeah, I'm not quite sure what that has to do with the topic. I think I started off with a purpose but now I forget where it went. Anyway, it's good to know those things.", 
   {}, 
   27151, 
   null, 
   1071283620.0
  ], 
  [
   27163, 
   null, 
   "montalban", 
   "Yeah, I'm not quite sure what that has to do with the topic. I think I started off with a purpose but now I forget where it went. Anyway, it's good to know those things.\n\n \n Many Americans has also sworn to hold firm to the King in order to gain posts of government. They turned against their rightful government. They are traitors, not patriots.\n \n Comparitively speaking the Brit Parliament was just as unrepresentative as the American Congress became to be - where popular vote still doesn't mean a Presidential victory - because the Electoral College can in theory go against what the voters want.\n \n Every system has its bad points. But jingoists such as Kelvin will only point out the bad in other systems, and tell me I have no right to comment on America. (even though my dad's American :) )\n \n Anyway, these same people who flag wave about their great country will in the next breath tell you that the country is about to take all their rights from them... unless they're fully armed.\n \n A comment made earlier about nuclear weapons - it need not be so extreme... what about land mines? Surely they'd help you be better protected. Just sow them in the front yard. Put up a sign to warn kids in case they want to fetch back a football, and you'll be laughing.", 
   {}, 
   27157, 
   null, 
   1071285540.0
  ], 
  [
   27229, 
   null, 
   "kelvin90701", 
   "\n \n Every system has its bad points. But jingoists such as Kelvin will only point out the bad in other systems, and tell me I have no right to comment on America. (even though my dad's American :) )\n .\n\n \n Your not commenting. Your trying to convince people, you and your point of view is right. Your trying to convince people here in the USA to follow your ideas. \n \n Is your father an Aussie citizen? If he is, then he is no longer a US citizen. No need to answer, just a thought.\n \n I am sure your are not a US citizen. So your argument to convince people really does not matter does it? Your attempts to convince people you are right and influence our policies sickens me. Please take you imperialistic attitudes somewhere else.", 
   {}, 
   27163, 
   null, 
   1071337920.0
  ], 
  [
   27230, 
   null, 
   "Inspector346", 
   "The 2nd Amendment was put in place to protect the states from a central government becoming a tyranny just like the one you claim Britain to have been* hence the use of the word militia... (of which I have posted court made definitions of on previous posts.)\n \n This law is not a 'natural law' but one negotiated betwixt various representatives of the colonies/states.\n \n Even the amendment re: religion has been changed by the court - in the famous Mormon trail of the late 1800s their freedom of religion was ruled not to extend to the point of polygamy.\n \n The statement earlier about the court deciding the law is true. You guys established a referee to determine these matters; a body of government that's supposed to be impartial.\n \n Most democracies believe that courts can decide. Except in your nation there's a huge body of opinion that doesn't believe this; if it affects there right to have a penis replacement... er.... gun.\n \n \n \n \n *In these jingoistic terms you Americans forget that you allied yourself with even more repressive governments viz France and Spain in order to get rid of Britain (France being so monstrously corrupt that it burst into revolution not long afterwards; Spain too was no bastion of liberty)\n \n Further in your pursuit of 'freedom' you invaded Canada several times both in the Revolution and in the War of 1812.\n \n Also, it is estimated that only 1/3 of colonials actively supported the cause of revolution - hardly a picture of a people 'yearning to be free'.\n \n The government 'of the people' was never true in your early history either. George Washington wasn't popularly elected. Women didn't get the vote till c.1920. Blacks didn't formally get it till 1860s, but were discriminated against in so many areas that you had to pass another amendment in the 1960s (re: state taxes)\n\n \n And your point is?", 
   {}, 
   27151, 
   null, 
   1071339420.0
  ], 
  [
   27302, 
   null, 
   "Dan the White", 
   "And your point is?\n\n \n The point is that the second amendment is up to interpretation, and those whose duty it is to interpret, the justices of the Supreme Court, have ruled in favor of gun control laws in most cases. And this whole notion of gun control laws taking away our freedom is not a good arguement against gun control. Don't try to justify your right to bear arms with the idea that America is a \"free\" country, whatever that means.", 
   {}, 
   27230, 
   null, 
   1071386340.0
  ], 
  [
   27306, 
   null, 
   "montalban", 
   "Your not commenting. Your trying to convince people, you and your point of view is right. Your trying to convince people here in the USA to follow your ideas. \n \n Is your father an Aussie citizen? If he is, then he is no longer a US citizen. No need to answer, just a thought.\n \n I am sure your are not a US citizen. So your argument to convince people really does not matter does it? Your attempts to convince people you are right and influence our policies sickens me. Please take you imperialistic attitudes somewhere else.\n\n \n \n Oh dear, and your argument against me is not based on what I've said, but what kind of person you perceive me to be.\n \n Ouch!", 
   {}, 
   27229, 
   null, 
   1071397860.0
  ], 
  [
   27307, 
   null, 
   "montalban", 
   "The point is that the second amendment is up to interpretation, and those whose duty it is to interpret, the justices of the Supreme Court, have ruled in favor of gun control laws in most cases. And this whole notion of gun control laws taking away our freedom is not a good arguement against gun control. Don't try to justify your right to bear arms with the idea that America is a \"free\" country, whatever that means.\n\n \n Exactly. Those that claim that the right is inalienable and natural have no leg to stand on. The law says \"Shall not be infringed\" but it is and has always been.\n \n There are commecial interests such as the operators of aeroplanes who forbid you take a gun on board.\n \n There is the government that has courts to act as a referee - and this referee has consistantly ruled that the right to carry arms does not mean a right to protect yourself - it is to form a militia to protect your rights through your state; because the colonies were worried about replacing one tyranny with another.\n \n But hey, don't let facts get in the way. Kelvin and Hellhound have ingored these and said that I am some kind of Aussie imperialist out to de-stabilise your country* :). These are the same people who are constantly worried about their own government shafting them. There are conspiracies everywhere.\n \n \n *Yes, and Nicole Kidman has been sent to infiltrate Hollywood!", 
   {}, 
   27302, 
   null, 
   1071398100.0
  ], 
  [
   27337, 
   null, 
   "voiceofreason", 
   "The point is that the second amendment is up to interpretation, and those whose duty it is to interpret, the justices of the Supreme Court, have ruled in favor of gun control laws in most cases. And this whole notion of gun control laws taking away our freedom is not a good arguement against gun control.\n\n Here is a list a of links to second amendment court cases. http://www.abanet.org/gunviol/courts.html\n \n I know that Kelvin will probably continue to bury his head in the sand, but I post this link for the benefit of others who are interested in finding out the truth. \n \n The American Bar Association, an organization which represents lawyers and accredits law schools in the US, explains that:\n \n \"The lower federal courts have uniformly followed the interpretation of the Supreme Court. No legislation regulating the private ownership of firearms has been struck down in our nation's history on Second Amendment grounds. \n \n Yet the perception that the Second Amendment is somehow an obstacle to Congress and state and local legislative bodies fashioning laws to regulate firearms remains a pervasive myth. The gun lobby has conducted extensive and expensive campaigns to foster this misperception and the result has been that the myth of the 'absolute bar of the Second Amendment' has real effects on regulatory efforts.\n \n As lawyers, as representatives of the legal profession, and as recognized experts on the meaning of the Constitution and our system of justice, we share a responsibility to the public and lawmakers to 'say what the law is.' \"\n http://www.abanet.org/gunviol/secondamend.html", 
   {}, 
   27302, 
   null, 
   1071419220.0
  ], 
  [
   27416, 
   null, 
   "kelvin90701", 
   "Here is a list a of links to second amendment court cases. http://www.abanet.org/gunviol/courts.html\n \n I know that Kelvin will probably continue to bury his head in the sand, but I post this link for the benefit of others who are interested in finding out the truth. \n \n The American Bar Association, an organization which represents lawyers and accredits law schools in the US, explains that:\n \n \"The lower federal courts have uniformly followed the interpretation of the Supreme Court. No legislation regulating the private ownership of firearms has been struck down in our nation's history on Second Amendment grounds. \n \n Yet the perception that the Second Amendment is somehow an obstacle to Congress and state and local legislative bodies fashioning laws to regulate firearms remains a pervasive myth. The gun lobby has conducted extensive and expensive campaigns to foster this misperception and the result has been that the myth of the 'absolute bar of the Second Amendment' has real effects on regulatory efforts.\n \n As lawyers, as representatives of the legal profession, and as recognized experts on the meaning of the Constitution and our system of justice, we share a responsibility to the public and lawmakers to 'say what the law is.' \"\n http://www.abanet.org/gunviol/secondamend.html\n\n \n Fine, call a cop. Tell them you what to take my supposed \"illegal\" guns. If anyone trys that I'll slap them so hard with a civil rights violation law suit they will have marks from my hand on both sides of thier face.\n \n Oh BTW the way, it has already been tried. A woman at gas station called a cop on me for having an open carried firearm. Guess who the cops got angry at? Not me.", 
   {}, 
   27337, 
   null, 
   1071447300.0
  ], 
  [
   27460, 
   null, 
   "Dan the White", 
   "Fine, call a cop. Tell them you what to take my supposed \"illegal\" guns. If anyone trys that I'll slap them so hard with a civil rights violation law suit they will have marks from my hand on both sides of thier face.\n \n Oh BTW the way, it has already been tried. A woman at gas station called a cop on me for having an open carried firearm. Guess who the cops got angry at? Not me.\n\n \n Ho ho ho, quite a convincing arguement. Don't try to use reasoning or anything, that would be rediculous. Just stick to the one personaly example to prove your case.", 
   {}, 
   27416, 
   null, 
   1071460260.0
  ], 
  [
   27479, 
   null, 
   "voiceofreason", 
   "Ho ho ho, quite a convincing arguement. Don't try to use reasoning or anything, that would be rediculous.\n\n I'm not going to call a cop to take away Kelvin's guns. I don't think anybody is in favor of that strategy. I don't know how Kelvin got that ridiculous notion. \n \n What I am going to do is use my influence to convince politicians to pass common sense gun-control laws. The courts have agreed that most gun-control laws are constitutional so I'm not violating anybody's civil rights by advocating gun-control.", 
   {}, 
   27460, 
   null, 
   1071470100.0
  ], 
  [
   28089, 
   null, 
   "kelvin90701", 
   "I'm not going to call a cop to take away Kelvin's guns. I don't think anybody is in favor of that strategy. I don't know how Kelvin got that ridiculous notion. \n \n What I am going to do is use my influence to convince politicians to pass common sense gun-control laws. The courts have agreed that most gun-control laws are constitutional so I'm not violating anybody's civil rights by advocating gun-control.\n\n \n Do you really really believe that? Do you really believe that so much that you will die for your belief? That come and get them yourslef. No don't send someone elses son or daugheter in uniform to risk their life for your ideas, come and get them yourself.\n \n Because I will be standing on my property line waiting for the first one of YOU to step up and take my guns.\n \n How did I get that notion. Please see the the \"common sense\" laws that started in the UK, Australia, and Canada. Yep it all started with common sense, it ended with complete BANS.", 
   {}, 
   27479, 
   null, 
   1071711300.0
  ], 
  [
   28109, 
   null, 
   "NEO55", 
   "Ok i think its time i introduced some greek philosophy into this debate. once upon a time there was a man named Plato. Plato came up with this idea for a perfect society. the main idea behind this society was that the good of the many outweighs the good of the one. he also goes on to talk about a man who is all knowing being murderd by his homeys because hes smarter than them. well up in canada where we actully care about our countrys best intrests we have something called gun control. basiclly this prohibits the averge joe going to the local wal mart and buying an M-16. if one were to look at the number of gun murders in the united states which last i heard was hovering around 11000 per year, and we look at the number of gun murders in great britain, which has even stricter gun control laws, we see that the number of gun murders decreases by around 10961. now we have to factor in the population diffrence and figure out how many murders that is per capita\n the population of great britain is right around 60 000 000. so we divide by 60000000 and we get approximatly 2. now lets divide that by 39 and we get 0.0000065. hmmm..... well i dont think that anybody can debate that having 100000 fewer gun murders percapita is a bad thing. anyways back to plato. If the U.S.A does not implement gun control, then what we will eventually get is a country with a massive and powerful army that will be used primarily for internal affairs, while other countrys will build up their armies to protect themselves from american attack, thus plunging the world into another cold war. oh by the ways thats a bad thing", 
   {}, 
   21169, 
   null, 
   1071716760.0
  ], 
  [
   28110, 
   null, 
   "NEO55", 
   "Oh by the way CANADA KICKED AMERICAN XXX in 1812. we marched all the way to D.C. and burned the white house down. thats why its white, because they whitewashed over the scorch marks", 
   {
    "post_info": {
     "post_title": "1812"
    }
   }, 
   28109, 
   null, 
   1071717060.0
  ], 
  [
   28111, 
   null, 
   "Dan the White", 
   "Do you really really believe that? Do you really believe that so much that you will die for your belief? That come and get them yourslef. No don't send someone elses son or daugheter in uniform to risk their life for your ideas, come and get them yourself.\n \n Because I will be standing on my property line waiting for the first one of YOU to step up and take my guns.\n \n How did I get that notion. Please see the the \"common sense\" laws that started in the UK, Australia, and Canada. Yep it all started with common sense, it ended with complete BANS.\n\n \n Yeah, that's why wars start. That's why there is violence. People think you have to risk your life for what you believe. You're afraid to compromise so you just go with killing. You are the reason that you need a gun. You kill people and then complain when there is violence and say that you need a gun to protect yourself.\n \n Why don't you actually explain to us why having the complete right to bear arms is good for this country rather than just threatening anyone who tries to \"take away your civil liberties.\"\n \n And are complete gun bans supposed to scare me? Is the fact that those bans are enforced and there isn't much murder in those countries supposed to scare me?", 
   {}, 
   28089, 
   null, 
   1071717240.0
  ], 
  [
   28139, 
   null, 
   "NEO55", 
   "Dan, you won't get far in these forums with personal attacks. You only demonstrate your lack of civility. And regarding my post; if you don't understand the difference between \"the people\" and \"the government\", see how far inside the Pentagon you get before \"the government\" stops you \"the people\". Regarding the 2nd amendment and my post on \"non-patriots\"; I believe it means what it says, and by extension, I believe that those who do not accept all or parts of the Bill Of Rights, ARE Not being patriotic. Regarding the 1st amendment in your personal attack, I never sought to silence you or anyone else in the realm of all these many posts on the subject. You are most certainly welcome to disagree with the posts of others -- just try to be more pleasant about it.\n\n I was under the impression that the government WAS the people...but maybe im wrong about that...It really goes to show how the average American thinks...for the record Jean Poutine is not the prime minister of canada... or the former prime minister", 
   {}, 
   26939, 
   null, 
   1071726600.0
  ], 
  [
   28140, 
   null, 
   "NEO55", 
   "Hmmm. They meant for militia members to have modern military weapons at home to bring with them when called up. What part of the Federalist supports your opinion? What part of the Founding Fathers writings support your opinion?\n \n Please see:\n http://federalistpapers.com/\n \n Your idea is notion based on your personal prejudice.\n\n Whats with the debate of \"The Founding Fathers?\"are you saying that America has not moved forward in the last 200 years?", 
   {}, 
   26946, 
   null, 
   1071726720.0
  ], 
  [
   28157, 
   null, 
   "voiceofreason", 
   "Do you really really believe that? Do you really believe that so much that you will die for your belief? That come and get them yourslef. No don't send someone elses son or daugheter in uniform to risk their life for your ideas, come and get them yourself.\n \n Because I will be standing on my property line waiting for the first one of YOU to step up and take my guns.\n\n What part about \"What I am going to do is use my influence to convince politicians to pass common sense gun-control laws\" do you not understand? Can you understand plain English? I said nothing about personally going to your property and taking away your guns.\n \n Suppose someone wanted the speed limit to be lowered. Kelvin's argument against that would be like this- \"Do you really believe that? Do you really believe it so much that you would be willing to die for your belief? Then run out in the middle of the road when you see a speeding car and hope that when the driver sees you he/she will slow down. Don't ask anyone else to do it. Risk your own life by running out in the middle of the road.\"", 
   {}, 
   28089, 
   null, 
   1071731040.0
  ], 
  [
   28158, 
   null, 
   "kelvin90701", 
   "Yeah, that's why wars start. That's why there is violence. People think you have to risk your life for what you believe. You're afraid to compromise so you just go with killing. You are the reason that you need a gun. You kill people and then complain when there is violence and say that you need a gun to protect yourself.\n \n Why don't you actually explain to us why having the complete right to bear arms is good for this country rather than just threatening anyone who tries to \"take away your civil liberties.\"\n \n And are complete gun bans supposed to scare me? Is the fact that those bans are enforced and there isn't much murder in those countries supposed to scare me?\n\n \n Civil liberties do not just include the right to free speech or the right to vote. Civil liberties are also the right to merely live. \n \n Taking away the right to vote or any civil liberty is the first step before we have gas chambers and death camps in the USA. That is not my idea. Please see the Federalist Papers written by the some of the founding fathers. They have already warned me about people looking to asert authority over my civil liberities.", 
   {}, 
   28111, 
   null, 
   1071731340.0
  ], 
  [
   28159, 
   null, 
   "kelvin90701", 
   "What part about \"What I am going to do is use my influence to convince politicians to pass common sense gun-control laws\" do you not understand? Can you understand plain English? I said nothing about personally going to your property and taking away your guns.\n .\"\n\n \n How about taking some responsibility for what you say? You can not be pro-gun control, then have politicians and authority come by and take my guns and just say, \"oh well, that was not my fault\", and still be responsible for what you say.\n \n Please see UK, Australia, and Canada for common sense. It started there, then went beyond that. That is 3 for 3. For the sample size of 3 that is 100% chance that gun control will end up as complete bans.", 
   {}, 
   28157, 
   null, 
   1071731580.0
  ], 
  [
   28160, 
   null, 
   "kelvin90701", 
   "Whats with the debate of \"The Founding Fathers?\"are you saying that America has not moved forward in the last 200 years?\n\n \n These men were political geniuses, highly educated, and very well informed on society and poltitical behavior of humans. No, homo sapien has not evolved to be much different from 200 years ago. To think so is arrogant. Unless you have superior qualifications than the founding fathers, I'll put my trust in the founding fathers over a faceless person on the internet.", 
   {}, 
   28140, 
   null, 
   1071731820.0
  ], 
  [
   28287, 
   null, 
   "Dan the White", 
   "Civil liberties do not just include the right to free speech or the right to vote. Civil liberties are also the right to merely live. \n \n Taking away the right to vote or any civil liberty is the first step before we have gas chambers and death camps in the USA. That is not my idea. Please see the Federalist Papers written by the some of the founding fathers. They have already warned me about people looking to asert authority over my civil liberities.\n\n \n What is it with people and their civil liberties? THey think it's some sort of absolute. There are different degrees of civil liberties. It's not just you have civil liberties, or you don't. There are always restrictions on civil liberties. You can't vote below the age of 18, can you? Is that \"the first step before we have gas chambers and death camps in the USA\"?\n \n And the \"right to live\" always makes me laugh. What the hell are you talking about? Does that mean that everyone gets to live a certain number of years and then they can be murdered? What about the people who die before that because of disease? What about the criminal trying to rob your house that you shoot? The absolute \"right to life\" is nonsense. We all die eventually.", 
   {}, 
   28158, 
   null, 
   1071785220.0
  ], 
  [
   28364, 
   null, 
   "montalban", 
   "Civil liberties do not just include the right to free speech or the right to vote. Civil liberties are also the right to merely live. \n \n Taking away the right to vote or any civil liberty is the first step before we have gas chambers and death camps in the USA. That is not my idea. Please see the Federalist Papers written by the some of the founding fathers. They have already warned me about people looking to asert authority over my civil liberities.\n\n \n \n You HAVE HAD gas chambers in the USA! (used to execute criminals).\n \n The same authors of the Constitution - since you now want to hark back to them, believed in civil liberties for white men of property only.", 
   {}, 
   28158, 
   null, 
   1071802260.0
  ], 
  [
   28395, 
   null, 
   "voiceofreason", 
   "You HAVE HAD gas chambers in the USA! (used to execute criminals).\n \n The same authors of the Constitution - since you now want to hark back to them, believed in civil liberties for white men of property only.\n\n An excellent point. Thomas Jefferson, who spoke \"certain unalienable Rights\" in the Declaration of Independence, was a slave owner himself. So was James Madison, the main author of the US Constitution and the Bill of Rights.\n http://www.jmu.edu/madison/eliteandslave.htm\n \n Kelvin speaks of gas chambers and death camps. Unlike the US, nations in the European Union don't execute criminals. Nations in the EU believe that they have a more limited form of government than the US because their governments don't have the power to take away a human life. The US, with all its privately owned guns, is closer to being Nazi Germany than nations like the UK because it allows its government to destroy human life.", 
   {}, 
   28364, 
   null, 
   1071812940.0
  ], 
  [
   28438, 
   null, 
   "montalban", 
   "An excellent point. Thomas Jefferson, who spoke \"certain unalienable Rights\" in the Declaration of Independence, was a slave owner himself. So was James Madison, the main author of the US Constitution and the Bill of Rights.\n http://www.jmu.edu/madison/eliteandslave.htm\n \n Kelvin speaks of gas chambers and death camps. Unlike the US, nations in the European Union don't execute criminals. Nations in the EU believe that they have a more limited form of government than the US because their governments don't have the power to take away a human life. The US, with all its privately owned guns, is closer to being Nazi Germany than nations like the UK because it allows its government to destroy human life.\n\n \n \n We don't have the death penalty in Australia either (technically it's 'on the books' still in Western Australia but isn't even referred to; all the other states and the Commonwealth (national government) don't have recourse to it).\n \n \n \n \n Do US states still use the Gas Chamber?\n \n By the way - there was mention ages ago about English police wanting to have guns - well our neighbour, New Zealand has an un-armed police force too.", 
   {}, 
   28395, 
   null, 
   1071836220.0
  ], 
  [
   28439, 
   null, 
   "voiceofreason", 
   "We don't have the death penalty in Australia either (technically it's 'on the books' still in Western Australia but isn't even referred to; all the other states and the Commonwealth (national government) don't have recourse to it).\n \n \n \n \n Do US states still use the Gas Chamber?\n \n By the way - there was mention ages ago about English police wanting to have guns - well our neighbour, New Zealand has an un-armed police force too.\n\n \n Certain parts of the US still use the gas chamber.\n http://www.deathpenaltyinfo.org/article.php?scid=8&did=245#authorized", 
   {}, 
   28438, 
   null, 
   1071836820.0
  ], 
  [
   28443, 
   null, 
   "kelvin90701", 
   "You HAVE HAD gas chambers in the USA! (used to execute criminals).\n \n The same authors of the Constitution - since you now want to hark back to them, believed in civil liberties for white men of property only.\n\n \n Correction we still do have gas chambers. You have a problem with that? This is a domestic matter.", 
   {}, 
   28364, 
   null, 
   1071853260.0
  ], 
  [
   28444, 
   null, 
   "kelvin90701", 
   "An excellent point. Thomas Jefferson, who spoke \"certain unalienable Rights\" in the Declaration of Independence, was a slave owner himself. So was James Madison, the main author of the US Constitution and the Bill of Rights.\n http://www.jmu.edu/madison/eliteandslave.htm\n \n Kelvin speaks of gas chambers and death camps. Unlike the US, nations in the European Union don't execute criminals. Nations in the EU believe that they have a more limited form of government than the US because their governments don't have the power to take away a human life. The US, with all its privately owned guns, is closer to being Nazi Germany than nations like the UK because it allows its government to destroy human life.\n\n \n When 1 right is in taken away. They are all at risk. When rights are at risk then right to merely exist is at risk. Those gas chabers I speak of are not for criminals, they are for soccer moms, poets, reporters, teachers. You know, anyone who can be labled as subersive to the government. In WW2 Germany those people were Jews. In Soviet Russia, those people were anyone who was suspicious, in Cambodia that was everyone. As anti-gunners have noted, we have developed democracy and the republic in the 200 years since then, haven't we? The USA is more like Nazi Germany? Try and get license for your dog or a finshing license in MODERN Germany/Europe and see which country is more free. Almost every aspect of life in Europe is LICENSED, which means you have to ask permission from the government. That is not freedom.", 
   {}, 
   28395, 
   null, 
   1071853800.0
  ], 
  [
   28473, 
   null, 
   "Dan the White", 
   "When 1 right is in taken away. They are all at risk. When rights are at risk then right to merely exist is at risk. Those gas chabers I speak of are not for criminals, they are for soccer moms, poets, reporters, teachers. You know, anyone who can be labled as subersive to the government. In WW2 Germany those people were Jews. In Soviet Russia, those people were anyone who was suspicious, in Cambodia that was everyone. As anti-gunners have noted, we have developed democracy and the republic in the 200 years since then, haven't we? The USA is more like Nazi Germany? Try and get license for your dog or a finshing license in MODERN Germany/Europe and see which country is more free. Almost every aspect of life in Europe is LICENSED, which means you have to ask permission from the government. That is not freedom.\n\n \n You seem to think that there is a constant war between you and the government. You seem to think that the government is bad and you are good. You seem to think that all the government does is \"take away your liberties.\" So do you want no government at all? Do you want anarchy? Complete anarchy?\n \n And you still didn't respond to my last post.", 
   {}, 
   28444, 
   null, 
   1071870600.0
  ], 
  [
   28499, 
   null, 
   "kelvin90701", 
   "You seem to think that there is a constant war between you and the government. You seem to think that the government is bad and you are good. You seem to think that all the government does is \"take away your liberties.\" So do you want no government at all? Do you want anarchy? Complete anarchy?\n \n And you still didn't respond to my last post.\n\n \n No, I want to have a good and effective government. What I do not want is to be disarmed and made into passive sheep.\n \n Yes there is a constant battle and never ending fight for authority. Please see our own government. 3-branches? Why? No one can be trusted with all the authority. Government = authority = power. Power corrupts people. No matter how little power a person has, they become incrementally more corrupt with more power and authority. Please see:\n \n http://american-buddha.com/stanford.prison.htm\n \n These prison guards were just pretending to be guards. After just a few days they became sadistic and corrupt with power.", 
   {}, 
   28473, 
   null, 
   1071876360.0
  ], 
  [
   28502, 
   null, 
   "kelvin90701", 
   "What is it with people and their civil liberties? THey think it's some sort of absolute. There are different degrees of civil liberties. It's not just you have civil liberties, or you don't. There are always restrictions on civil liberties. You can't vote below the age of 18, can you? Is that \"the first step before we have gas chambers and death camps in the USA\"?\n \n And the \"right to live\" always makes me laugh. What the hell are you talking about? Does that mean that everyone gets to live a certain number of years and then they can be murdered? What about the people who die before that because of disease? What about the criminal trying to rob your house that you shoot? The absolute \"right to life\" is nonsense. We all die eventually.\n\n \n \n This one? I am a full citizen. My rights are only taken away by two methods: 1) conviction by a judge and jurry for a crime, then off to prison and away with my rights 2) a doctor and judge say I am insane.\n \n Other than that my rights are never controlled or limited in any way.\n \n Under age 18? They are not full citizens.\n \n The right to live? I am talking about the right to breathe, eat, and excrete. Yes I am talking about life. I have a right to have my organs intact and operational. That means no MORTAL man has the right to deny me my right to live.\n \n A criminal has no rights. When someone enters my house I am allowed by law to use the MAXIUM amount of violence on them. A person entering my home has just violated my property rights. In turn they have no rights on my property. Citizens have full rights and only citizens that respect each other rights. I am not making this up. The law is on my side.", 
   {}, 
   28287, 
   null, 
   1071876840.0
  ], 
  [
   28511, 
   null, 
   "montalban", 
   "This one? I am a full citizen. My rights are only taken away by two methods: 1) conviction by a judge and jurry for a crime, then off to prison and away with my rights 2) a doctor and judge say I am insane.\n \n Other than that my rights are never controlled or limited in any way.\n \n Under age 18? They are not full citizens.\n \n The right to live? I am talking about the right to breathe, eat, and excrete. Yes I am talking about life. I have a right to have my organs intact and operational. That means no MORTAL man has the right to deny me my right to live.\n \n A criminal has no rights. When someone enters my house I am allowed by law to use the MAXIUM amount of violence on them. A person entering my home has just violated my property rights. In turn they have no rights on my property. Citizens have full rights and only citizens that respect each other rights. I am not making this up. The law is on my side.\n\n \n \n You keep harping on about 'rights'. Sometimes you call these 'natural rights' but I have asked you to list these, and explain how a gun is a 'natural right' since it has absolutely nothing to do with breathing, eating, etc.\n \n What about owning property? Is that a right/natural right?", 
   {}, 
   28502, 
   null, 
   1071882780.0
  ], 
  [
   28572, 
   null, 
   "Dan the White", 
   "This one? I am a full citizen. My rights are only taken away by two methods: 1) conviction by a judge and jurry for a crime, then off to prison and away with my rights 2) a doctor and judge say I am insane.\n \n Other than that my rights are never controlled or limited in any way.\n \n Under age 18? They are not full citizens.\n \n The right to live? I am talking about the right to breathe, eat, and excrete. Yes I am talking about life. I have a right to have my organs intact and operational. That means no MORTAL man has the right to deny me my right to live.\n \n A criminal has no rights. When someone enters my house I am allowed by law to use the MAXIUM amount of violence on them. A person entering my home has just violated my property rights. In turn they have no rights on my property. Citizens have full rights and only citizens that respect each other rights. I am not making this up. The law is on my side.\n\n \n No, your rights are always controlled and limited. There are no absolute rights. Don't kid yourself. Your right to eat? How much does that right include. What if you get just one crumb? Is your right fulfilled? What if you get fired? Is the employer who fires you taking away your right to eat since you would have less money to buy food? And by the way everything effects everything, so don't act like when you die by natural causes that it has nothing to do with \"mortal men.\" What about your mom who smokes (and I'm just making these things up if you couldn't tell)? If the second hand smoke makes you live a shorter life, is she taking away your right to life? You see, it's not as clear cut as you want to make it. There are no absolute rights. It's about striking a balance.\n \n And now you hide behind the law. Before, you said \"oh it's my natural right to have a gun and nobody can take that away,\" but as soon as the law favors your side of the arguement, you switch back to that.\n \n \"A good and effective government\"? Wow, you're a genius.", 
   {}, 
   28502, 
   null, 
   1071902580.0
  ], 
  [
   28583, 
   null, 
   "kelvin90701", 
   "No, your rights are always controlled and limited. There are no absolute rights. Don't kid yourself. Your right to eat? How much does that right include. What if you get just one crumb? Is your right fulfilled? What if you get fired? Is the employer who fires you taking away your right to eat since you would have less money to buy food? And by the way everything effects everything, so don't act like when you die by natural causes that it has nothing to do with \"mortal men.\" What about your mom who smokes (and I'm just making these things up if you couldn't tell)? If the second hand smoke makes you live a shorter life, is she taking away your right to life? You see, it's not as clear cut as you want to make it. There are no absolute rights. It's about striking a balance.\n \n And now you hide behind the law. Before, you said \"oh it's my natural right to have a gun and nobody can take that away,\" but as soon as the law favors your side of the arguement, you switch back to that.\n \n \"A good and effective government\"? Wow, you're a genius.\n\n \n The right to work does not exist in the Constitution. You have the right to eat to live. You do not have the right to eat food that belongs to someone else. So if you get a small morsel by your own effort, to bad, you do not have the right to take any more from someone else. If your 18+ and your mom is shortening your life and you choose to be around here when she smokes, then you can not complain. You have the right to get up and leave. If your below 18, too bad, legally your an infant, and you have no full rights of a full citizen. If your below 18 you need a judge to emancipate you. As you can tell, I'm NOT making this up.\n \n I do not argue natural rights to carry a firearm. That argument is moot. I am legally protected to carry one. I already have that right. Any argument is moot. It is about personal responsibility and good citizenship. A \"balance\" implies a negotiatation. My rights are not negotiatable. So many people have died to ensure your rights. You dishonor so many who made that sacrafice by negotiating your rights away.", 
   {}, 
   28572, 
   null, 
   1071911460.0
  ], 
  [
   28585, 
   null, 
   "kelvin90701", 
   "You keep harping on about 'rights'. Sometimes you call these 'natural rights' but I have asked you to list these, and explain how a gun is a 'natural right' since it has absolutely nothing to do with breathing, eating, etc.\n \n What about owning property? Is that a right/natural right?\n\n \n You keep harping natural. I keep harping so what? I have the right to carry a firearm. I have the right to own property. I have the right to enter into contract. It makes no difference natural or not. I have the right don't I?\n \n Feel disappointed? Then change the laws and the Constitution by democratic process. I obey the Brady laws. They were democratically made law. Opps I forget? You can't vote can't you. I remember something to the effect, \"I'd rather die than be a US citizen\". Please try to keep the momentum of that thought when you keep trying to argue US domestic policy.", 
   {}, 
   28511, 
   null, 
   1071911760.0
  ], 
  [
   28590, 
   null, 
   "Tim", 
   "\n I do not argue natural rights to carry a firearm. That argument is moot. I am legally protected to carry one. I already have that right. Any argument is moot. It is about personal responsibility and good citizenship. A \"balance\" implies a negotiatation. My rights are not negotiatable. So many people have died to ensure your rights. You dishonor so many who made that sacrafice by negotiating your rights away.\n\n Well, you can't just go into a crowded building and yell \"FIRE\" when there is no fire and try to justify it by saying that you were just exercising your free speech rights. In this example, free speech is being limited in the interest of the common good. Gun ownership can also be limited in the interest of the common good. Gun violence puts us all at risk. Your desire to own a gun must be balanced against legitimate public safety concerns.http://www.potowmack.org/garwills.html", 
   {}, 
   28583, 
   null, 
   1071917340.0
  ], 
  [
   28591, 
   null, 
   "montalban", 
   "You keep harping natural. I keep harping so what? I have the right to carry a firearm. I have the right to own property. I have the right to enter into contract. It makes no difference natural or not. I have the right don't I?\n \n Feel disappointed? Then change the laws and the Constitution by democratic process. I obey the Brady laws. They were democratically made law. Opps I forget? You can't vote can't you. I remember something to the effect, \"I'd rather die than be a US citizen\". Please try to keep the momentum of that thought when you keep trying to argue US domestic policy.\n\n \n Those Brady laws; were they written by Mike or Carroll?\n \n It is interesting now that you harp on about laws that are democratically made, yet one of our first encounters talked about how legislators were whittling away at your 'rights'. You've reveresed this stance here now! :)\n \n Those very same legislators were elected to create laws which you only seem to support when they are in favour of keeping your phallic gun.\n \n \n You were the one talking about legislators having no right to mess with your inalieable right - recall \"Shall not be abridged\" at the end of that gun section, however you were happy for it to be abridged by commerical and private interests.\n \n Further to the previous poster talking about 'free speech' as a right that's not absolute, I've mentioned about the freedom of religion which was abridged by the Federal government (see reference earlier to the Mormon Church).", 
   {}, 
   28585, 
   null, 
   1071920100.0
  ], 
  [
   28595, 
   null, 
   "voiceofreason", 
   "Further to the previous poster talking about 'free speech' as a right that's not absolute, I've mentioned about the freedom of religion which was abridged by the Federal government (see reference earlier to the Mormon Church).\n\n \"So here, as a law of the organization of society under the exclusive dominion of the United States, it is provided that plural marriages shall not be allowed. Can a man excuse his practices to the contrary because of his religious belief? The permit this would be to make the professed doctrines of religious belief superior to the law of the land, and in effect to permit every citizen to become a law unto himself. Government could exist only in name under such circumstances....\"\n -US Supreme Court (Reynolds v. United States 1878)\n \n So basically here the Supreme Court said that freedom of religion is not an absolute right because then you could use your freedom of religion to justify doing anything and that would lead to anarchy. What would Kelvin say about this? Would Kelvin say that this court ruling is the first step towards gas chambers and death camps?", 
   {}, 
   28591, 
   null, 
   1071924720.0
  ], 
  [
   28640, 
   null, 
   "NEO55", 
   "You keep harping natural. I keep harping so what? I have the right to carry a firearm. I have the right to own property. I have the right to enter into contract. It makes no difference natural or not. I have the right don't I?\n \n .\n\n ok so you have the right to do that thats just fine. but do you really NEED a gun? as far as i can the 4 basic things a human needs to live is food, air, water and shelter. if you had the right to kill everyone who disagreed with you would you kill me?", 
   {}, 
   28585, 
   null, 
   1071964260.0
  ], 
  [
   28641, 
   null, 
   "NEO55", 
   "This one? I am a full citizen. My rights are only taken away by two methods: 1) conviction by a judge and jurry for a crime, then off to prison and away with my rights 2) a doctor and judge say I am insane.\n \n Other than that my rights are never controlled or limited in any way.\n \n Under age 18? They are not full citizens.\n \n The right to live? I am talking about the right to breathe, eat, and excrete. Yes I am talking about life. I have a right to have my organs intact and operational. That means no MORTAL man has the right to deny me my right to live.\n \n A criminal has no rights. When someone enters my house I am allowed by law to use the MAXIUM amount of violence on them. A person entering my home has just violated my property rights. In turn they have no rights on my property. Citizens have full rights and only citizens that respect each other rights. I am not making this up. The law is on my side.\n\n and we wonder why we still have wars... actully a criminal still has rights as described by several international organizations such as the U.N. \n 1 EVERY HUMAN HAS THE RIGHT TO LIVE\n 2 every human has the right to be a citizen of a country\n and the list goes on", 
   {}, 
   28502, 
   null, 
   1071964680.0
  ], 
  [
   28645, 
   null, 
   "montalban", 
   "and we wonder why we still have wars... actully a criminal still has rights as described by several international organizations such as the U.N. \n 1 EVERY HUMAN HAS THE RIGHT TO LIVE\n 2 every human has the right to be a citizen of a country\n and the list goes on\n\n \n And a right to security would also involve not having a neighbour who's armed to the teeth - because I'd be worried about him getting bad news from the wife or something to push him over the edge.\n \n The obvious reply of course is that knives can kill too - so I'll nip this one in the bud right away - guns are more lethal.\n \n I've mentioned this twice before, but I will do so again as it's a good illustration of this point.\n \n There was a 'massacre' at Hoddle Street, Melbourne in the 80s. Some dude armed with all kinds of para-military guns went nuts. A motorcyclist came up over a bridge and saw a car parked at an unusual angle, with a woman hanging out of the opened door.\n \n He stopped to see what was happening. Up jumped the loon across the street and shot the biker to death.\n \n Had he been armed with a knife/series of knives, the biker could have sped off. As it happens, even speeding off from a loon with a gun, the biker can be 100 metres down the road, and still be dropped by a gun.", 
   {}, 
   28641, 
   null, 
   1071968160.0
  ], 
  [
   28655, 
   null, 
   "NEO55", 
   "It is very clear to me what is to be done with non-patriots and gun haters. You tolerate them. There is no other choice in a democracy.\n \n In a free market of ideas, I am absolutely convinced that the XXXXXX, liars, and dark age reasoning will expose themselves. In a free market of ideas the stupid ideas will die and go away.\n \n Two cases:\n \n \n See post #11\n http://www.4forums.com/political/showthread.php?p=21234\n \n See post on Sat Nov 01, 2003 1:10 pm \n http://forums.evula.com/viewtopic.php?t=1179&postdays=0&postorder=asc&start=225&sid=a2276f42164b4bc60af01fc12e57ef66\n \n So what are you doing here? look at mahatma ghandi. he was a pacifist and he freed india\n That does not mean you passively allow them the free market. It means you hunt down these ideas and expose them.\nSo what are you doing here? look at mahatma ghandi. he was a pacifist and he freed india", 
   {}, 
   21236, 
   null, 
   1071970080.0
  ], 
  [
   28688, 
   null, 
   "Dan the White", 
   "The right to work does not exist in the Constitution. You have the right to eat to live. You do not have the right to eat food that belongs to someone else. So if you get a small morsel by your own effort, to bad, you do not have the right to take any more from someone else. If your 18+ and your mom is shortening your life and you choose to be around here when she smokes, then you can not complain. You have the right to get up and leave. If your below 18, too bad, legally your an infant, and you have no full rights of a full citizen. If your below 18 you need a judge to emancipate you. As you can tell, I'm NOT making this up.\n \n I do not argue natural rights to carry a firearm. That argument is moot. I am legally protected to carry one. I already have that right. Any argument is moot. It is about personal responsibility and good citizenship. A \"balance\" implies a negotiatation. My rights are not negotiatable. So many people have died to ensure your rights. You dishonor so many who made that sacrafice by negotiating your rights away.\n\n \n Then what exactly does the right to eat entail? Does it mean you get to move your jaw up and down when food is in your mouth? And don't give me that \"belongs to someone else\" XXXXXXXX. What does that mean? How do we know if something officially belongs to someone? What, does the law determine that? Well there are also gun control laws. I guess that makes gun control good. Don't just fall back on the law when it supports you.\n \n And please explain what a right is. Since you seem to think rights are \"natural\" and \"nonnegotiatable\" please tell me what this means. And don't try to say I dishonor anyone.", 
   {}, 
   28583, 
   null, 
   1071990240.0
  ], 
  [
   28936, 
   null, 
   "kelvin90701", 
   "Then what exactly does the right to eat entail? Does it mean you get to move your jaw up and down when food is in your mouth? And don't give me that \"belongs to someone else\" XXXXXXXX. What does that mean? How do we know if something officially belongs to someone? What, does the law determine that? Well there are also gun control laws. I guess that makes gun control good. Don't just fall back on the law when it supports you.\n \n And please explain what a right is. Since you seem to think rights are \"natural\" and \"nonnegotiatable\" please tell me what this means. And don't try to say I dishonor anyone.\n\n \n The right to eat? That is included with the right to exist. I have the right to do what ever I want to do that will assure my right to merely exist, as long as I do not violate anyone esles right. No mortal man has the right to deny me the ability to maintain life within my body. I can do anything I want to maintain life within my body as long as I do not violate anyone esles right.\n \n Food is property. A basic fundamental corner stones of the Constitution is the concept of property and contract. I have a right to eat to exist. When I take some elses food I violate thier right to property and contract.", 
   {}, 
   28688, 
   null, 
   1072218360.0
  ], 
  [
   28937, 
   null, 
   "kelvin90701", 
   "and we wonder why we still have wars... actully a criminal still has rights as described by several international organizations such as the U.N. \n 1 EVERY HUMAN HAS THE RIGHT TO LIVE\n 2 every human has the right to be a citizen of a country\n and the list goes on\n\n \n The UN does not dictate internal matters within the USA. They are not my democratic representative. Nor will I pledge obediance to an authority that does not represent me.\n \n Every person does NOT have the right to be a citizen of the USA. I have no objection to people being citizens within thier own country or deciding thier own fate through thier own democratic leaders.", 
   {}, 
   28641, 
   null, 
   1072218660.0
  ], 
  [
   28939, 
   null, 
   "kelvin90701", 
   "So what are you doing here? look at mahatma ghandi. he was a pacifist and he freed india\n\n \n Yes he was a pacifist. He had no choice.\n \n But he did want guns for Indian nationals.", 
   {}, 
   28655, 
   null, 
   1072218780.0
  ], 
  [
   28940, 
   null, 
   "kelvin90701", 
   "Well, you can't just go into a crowded building and yell \"FIRE\" when there is no fire and try to justify it by saying that you were just exercising your free speech rights. In this example, free speech is being limited in the interest of the common good. Gun ownership can also be limited in the interest of the common good. Gun violence puts us all at risk. Your desire to own a gun must be balanced against legitimate public safety concerns.http://www.potowmack.org/garwills.html\n\n \n Yelling fire is not free speech. It is a crimnal act called mayhem. Free speech is artistic, political, economic, and communication. Yelling fire is neither. It is a lie.\n \n Please use a more suitable argument.", 
   {}, 
   28590, 
   null, 
   1072219080.0
  ], 
  [
   28969, 
   null, 
   "montalban", 
   "Yelling fire is not free speech. It is a crimnal act called mayhem. Free speech is artistic, political, economic, and communication. Yelling fire is neither. It is a lie.\n \n Please use a more suitable argument.\n\n \n \n Don't you get it? It isn't 'free speech' because someone has ruled it a crime!\n \n What determined that it wasn't free speech was a court!\n \n What you might otherwise determine as an absolute and natural right has been over-turned by the courts.\n \n This is the major flaw in your logic - somethings you accept as inherent and natural rights, others you don't - depending upon whether you personally agree with the courts or not.", 
   {}, 
   28940, 
   null, 
   1072240080.0
  ], 
  [
   28971, 
   null, 
   "montalban", 
   "Yes he was a pacifist. He had no choice.\n \n But he did want guns for Indian nationals.\n\n \n \n That's right, he continually went on life-threatening hunger strikes - not to sue for peace, but because he wanted more guns for Indian nationals.\n \n And Abe Lincoln sold tainted milk to school-children.\n \n Mother Theressa's real name was Stanley Smith.\n \n :p \n \n \n Interesting you say he had no choice, because he was a pacifist. He chose to be a pacifist.", 
   {}, 
   28939, 
   null, 
   1072240440.0
  ], 
  [
   28981, 
   null, 
   "Dan the White", 
   "The right to eat? That is included with the right to exist. I have the right to do what ever I want to do that will assure my right to merely exist, as long as I do not violate anyone esles right. No mortal man has the right to deny me the ability to maintain life within my body. I can do anything I want to maintain life within my body as long as I do not violate anyone esles right.\n \n Food is property. A basic fundamental corner stones of the Constitution is the concept of property and contract. I have a right to eat to exist. When I take some elses food I violate thier right to property and contract.\n\n \n You don't live inside an isolated box; therefore all of your actions affect other people, whether you like it or not. Therefore, all of you actions can impinge the rights of others. What if, while you are walking along the sidewalk attempting to make it to a job interview to secure your right to eat and exist you cut off a homeless person walking along? You probably would think nothing of it, but what if that homeless person was also walking to a job interview? What if cutting him off causes him to be late to his job interview and not get the job? What if this causes him to starve to death? My point is not to say that you are a terrible human being for cutting off a homeless person or to say that you should analyze your every step this in depth. I am only pointing out that every action of yours, every step of yours, affects the rights of others, impinging or helping those rights. So your idea of absolute rights simply is not true.", 
   {}, 
   28936, 
   null, 
   1072246980.0
  ], 
  [
   28982, 
   null, 
   "kelvin90701", 
   "Don't you get it? It isn't 'free speech' because someone has ruled it a crime!\n \n What determined that it wasn't free speech was a court!\n \n What you might otherwise determine as an absolute and natural right has been over-turned by the courts.\n \n This is the major flaw in your logic - somethings you accept as inherent and natural rights, others you don't - depending upon whether you personally agree with the courts or not.\n\n \n The major flaw that you ingore in your argument is \"who cares\". I have the right no matter what your opinion and your opinion is not held up in court. You are confused between judical opinion, judicial analysis, and judical decision. My right has not been overturned by the courts. Judicial opinion does not form case law. Only the decision and holding matters. You gave me examples of judical opinion, not decisons. The holdings in your examples did not take away my rights to firearms. Nor did they decide my rights were not natural. \n \n The part you do not get is yelling fire in a crowded movie theater when there is no fire is a lie. It is a lie cause panic, danger, and hurt on purpose. Slander is a lie to cause hurt just like yelling fire. Both with which are NOT speech, but crimes. Lie in all dealings with contracts, due process, or any other Constitutional issue is ILLEGAL and violates the rights of other individuals. Yelling \"FIRE\" in a crowded movie theater is a violation of other people civil rigts in a movie theather. \n \n 1) Violates the right to peacable gathering\n 2) Violates the right to life if anyone gets hurt in the process\n 3) Violates the right the right of the movie patron and theatre owner to complete a contract.\n \n Rights end for the individual when they violate the rights of others.\n \n Speech consist of simple communication, political communications, aristic expression, and economic advertisment.", 
   {}, 
   28969, 
   null, 
   1072247220.0
  ], 
  [
   28993, 
   null, 
   "kelvin90701", 
   "You don't live inside an isolated box; therefore all of your actions affect other people, whether you like it or not. Therefore, all of you actions can impinge the rights of others. What if, while you are walking along the sidewalk attempting to make it to a job interview to secure your right to eat and exist you cut off a homeless person walking along? You probably would think nothing of it, but what if that homeless person was also walking to a job interview? What if cutting him off causes him to be late to his job interview and not get the job? What if this causes him to starve to death? My point is not to say that you are a terrible human being for cutting off a homeless person or to say that you should analyze your every step this in depth. I am only pointing out that every action of yours, every step of yours, affects the rights of others, impinging or helping those rights. So your idea of absolute rights simply is not true.\n\n \n The homeless man and Me(?) walking along the sidewalk. His rights are not any more important than mine. I am going to a job interview for the same reason he is, I can make the same argument that homelessman violated my rights. Please provide another example. I am willing to entertain more relavant examples of ME(?) violating someone elses rights\n \n With the same thought. I was in McDonalds after work today because I was to lazy to cook. With a .45 on my hip, how did I violate other peoples rights today in MCDonalds?\n \n Did I deny someone free speech? Did I deny someone the right to contract. Did I deny someone right to property? Did I deny someone the right to life? Did I deny someone to illegal search or seizure? How about privacy?\n \n You accused me of affecting someones right, I must violated someone in McDonalds? Please specify a right that I affected and how I affected that right.", 
   {}, 
   28981, 
   null, 
   1072251780.0
  ], 
  [
   29008, 
   null, 
   "montalban", 
   "[QUOTE=kelvin90701]The major flaw that you ingore in your argument is \"who cares\". \n \n Obviously, you for one. I do as well. :)\n \n \nI have the right no matter what your opinion and your opinion is not held up in court. You are confused between judical opinion, judicial analysis, and judical decision. My right has not been overturned by the courts. Judicial opinion does not form case law. \n\n \n Judicial opinion does make case law. That is the basis of the Common Law system - it's often called precedent. A major flaw with your education about legal process. (unless your in a area that practices Statute Law)\n \n Your right has been limited by laws and court decisions.\n \n \nOnly the decision and holding matters. You gave me examples of judical opinion, not decisons. The holdings in your examples did not take away my rights to firearms. \n\n \n Huh? Your absolute rule of Free Speech has been curbed by laws re:\n a) public annoyance\n b) state/national secrets\n c) slander etc.\n \n And it is a court that will rule in cases as to whether your effort at speech comes under any of these or other laws.\n \n \nNor did they decide my rights were not natural. \n\n \n What does? How are they natural if they are determined by court?\n \n \nThe part you do not get is yelling fire in a crowded movie theater when there is no fire is a lie. It is a lie cause panic, danger, and hurt on purpose. Slander is a lie to cause hurt just like yelling fire. Both with which are NOT speech, but crimes. Lie in all dealings with contracts, due process, or any other Constitutional issue is ILLEGAL and violates the rights of other individuals. Yelling \"FIRE\" in a crowded movie theater is a violation of other people civil rigts in a movie theather. \n \n 1) Violates the right to peacable gathering\n 2) Violates the right to life if anyone gets hurt in the process\n 3) Violates the right the right of the movie patron and theatre owner to complete a contract.\n\n \n Yes, as determined by courts and legislators. If I were to ask you 'what is a 'peaceable' gathering - you'd go look up the court/legal rulings to determine this. That is the essence of the system we both live in - rules defined by courts, not by gun-worshipping organisations. A difference however, in your system the judiciary is not as detached as it should be - with judges facing elections and therefore coming under the influence of electioneers.\n \n \nRights end for the individual when they violate the rights of others.\n\n \n So, you're against the death penalty? You're against smoking near anyone else (of course you're going to say not in a private home - but what about the rights of kids to have good air?)\n \n What you believe to be lawful etc, simply chops and changes depending on whether you like it or not. With guns, you love guns, so otherwise you don't accept either\n a) court rulings of the past\n or\n b) the right of courts/government in the future to legislate against something you like.\n \n \nSpeech consist of simple communication, political communications, aristic expression, and economic advertisment.\n\n \n Yelling \"Fire\" is a simple form of communication. Talking to you is another :)", 
   {}, 
   28982, 
   null, 
   1072268460.0
  ], 
  [
   29015, 
   null, 
   "kelvin90701", 
   "Judicial opinion does make case law. That is the basis of the Common Law system - it's often called precedent. A major flaw with your education about legal process. (unless your in a area that practices Statute Law)\n \n Your right has been limited by laws and court decisions.\n \n \n \n Huh? Your absolute rule of Free Speech has been curbed by laws re:\n a) public annoyance\n b) state/national secrets\n c) slander etc.\n \n And it is a court that will rule in cases as to whether your effort at speech comes under any of these or other laws.\n \n \n \n What does? How are they natural if they are determined by court?\n \n \n \n Yes, as determined by courts and legislators. If I were to ask you 'what is a 'peaceable' gathering - you'd go look up the court/legal rulings to determine this. That is the essence of the system we both live in - rules defined by courts, not by gun-worshipping organisations. A difference however, in your system the judiciary is not as detached as it should be - with judges facing elections and therefore coming under the influence of electioneers.\n \n \n \n So, you're against the death penalty? You're against smoking near anyone else (of course you're going to say not in a private home - but what about the rights of kids to have good air?)\n \n What you believe to be lawful etc, simply chops and changes depending on whether you like it or not. With guns, you love guns, so otherwise you don't accept either\n a) court rulings of the past\n or\n b) the right of courts/government in the future to legislate against something you like.\n \n \n \n Yelling \"Fire\" is a simple form of communication. Talking to you is another :)\n\n \n You are the one confused. \n \n \"Your right has been limited by laws and court decisions.\"\n \n Judicial opinion is NOT a decision.\n \n Yelling \"fire\" when there is none is a LIE. I lie is not speech. It is deception. You seem to have accepted a very low standard for truth.\n \n Lies are not protected under contracts law, due process, or any other Constitutional activities. \n \n Your notions on US law come from Australian law.", 
   {}, 
   29008, 
   null, 
   1072283880.0
  ], 
  [
   29024, 
   null, 
   "montalban", 
   "You are the one confused. \n \n \"Your right has been limited by laws and court decisions.\"\n \n Judicial opinion is NOT a decision.\n \n Yelling \"fire\" when there is none is a LIE. I lie is not speech. It is deception. You seem to have accepted a very low standard for truth.\n \n Lies are not protected under contracts law, due process, or any other Constitutional activities. \n \n Your notions on US law come from Australian law.\n\n \n \n Yes I understand that they are lies. They are defined as lies by the court - that is why they aren't convered by 'Free Speech'\n \n What would otherwise be Free Speech has been defined by the court.\n \n There's a number of things you could say.\n \n What makes one a lie, what makes one part of your right to voice your opinion, have, in law, been defined by the court.\n \n My notion of US law comes from the same principles as Australian law, New Zealand law etc... that courts and legislators define things in law.\n \n You telling me it's a lie, I agree. I might call you a name, and it might be a lie, but in law it might be okay - you're mixing up what is a 'lie' and what is a 'lie' as defined by law. In law yelling \"Fire\" in the circumstances we're talking about is a lie; it's been defined as such by the courts.\n \n Further, judicial opinion and judicial decision are very closely linked.\n \n In court a judge might determine a company 'guilty' and award costs. That is the decision. He/she might state how he/she came to that decision in law that is the judicial opinion.\n \n Thus when it comes to the actual issue of gun ownership - what makes it legal or illegal for you to own comes from the law. That is what 'legal' is. It is defined by law - through the instruments of courts and legislators.\n \n These laws say you can own a gun - the courts say yes, but in the context of you being part of a militia - for the defence of your state.", 
   {}, 
   29015, 
   null, 
   1072289760.0
  ], 
  [
   29031, 
   null, 
   "kelvin90701", 
   "Yes I understand that they are lies. They are defined as lies by the court - that is why they aren't convered by 'Free Speech'\n \n What would otherwise be Free Speech has been defined by the court.\n \n There's a number of things you could say.\n \n What makes one a lie, what makes one part of your right to voice your opinion, have, in law, been defined by the court.\n \n My notion of US law comes from the same principles as Australian law, New Zealand law etc... that courts and legislators define things in law.\n \n You telling me it's a lie, I agree. I might call you a name, and it might be a lie, but in law it might be okay - you're mixing up what is a 'lie' and what is a 'lie' as defined by law. In law yelling \"Fire\" in the circumstances we're talking about is a lie; it's been defined as such by the courts.\n \n Further, judicial opinion and judicial decision are very closely linked.\n \n In court a judge might determine a company 'guilty' and award costs. That is the decision. He/she might state how he/she came to that decision in law that is the judicial opinion.\n \n Thus when it comes to the actual issue of gun ownership - what makes it legal or illegal for you to own comes from the law. That is what 'legal' is. It is defined by law - through the instruments of courts and legislators.\n \n These laws say you can own a gun - the courts say yes, but in the context of you being part of a militia - for the defence of your state.\n\n \n You forget to address some points above:\n \n 1) The right to contract.\n 2) The right to peacefull assemble.\n 3) The right to life.\n \n Rights for the yeller ends when he violates anyone of the 3 above. \n \n If the courts say that guns are only owned in the context of a militia, then all my guns are ILLEGAL. They are not, they already went through federal and state red tape before I purchased them. You can wish all you want for guns to be illgeal. They FACT is they are not.\n \n A lie is NEVER OK in any legal or Constitutional activities. It is NEVER protected. Example, you can lie all you want to get some girl and it is OK. If the lie includes some contractual or legal promise, then YOU have violated the law.\n \n Is that an imperialistic attitude to apply your notions of government, society, and law in the Australia to the USA? Your imperialism sickens me. What courts are you talking about? I hope not Australian courts. Feel free to do with your country all you want. Please do not bring those feces here.", 
   {}, 
   29024, 
   null, 
   1072304880.0
  ], 
  [
   29040, 
   null, 
   "montalban", 
   " Is that an imperialistic attitude to apply your notions of government, society, and law in the Australia to the USA? Your imperialism sickens me. What courts are you talking about? I hope not Australian courts. Feel free to do with your country all you want. Please do not bring those feces here.\n\n \n \n Kelvin, you're looking at law the wrong way round, and show a grave misunderstanding of law.\n \n If I run into a building yelling 'bomb', you can call it a 'lie', even I could call it a 'lie'. But in law, it is not a 'lie', yet. Hundreds of people, the media, etc can all say 'that was a lie', but I won't go to prison/be fined simply on everyone's say.\n \n It has to go through something called due process.* Arrest, charging, court, decision. Then it is a 'lie' in law.\n \n If there is not enough evidence, then the court will decide there was no reson to convict. You could go on saying it was a 'lie'. But in law, it would not be.\n \n In fact, if you called me a liar - I could sue for defomation.\n \n You going on about yelling 'Fire' as a lie, is only because it has already been decided upon, you know the outcome. It still has to have gone through the courts.\n \n You are looking at things the wrong way around - because you already know that yelling fire has been determined in the courts as being outside the scope of the \"Freedom of Speech\" laws. It still had to be determined in the courts. You've applied the wisdom of hindsight, to retrospectively say that it was always a lie - yes, but in law it had to be adjudicated first.\n \n And yes, you holding guns might still be legal, if the court allows for gun ownership in the context of a militia.\n \n There are many laws that governments don't enforce.\n \n *Something supposedly done in both USA, and Australia", 
   {}, 
   29031, 
   null, 
   1072312200.0
  ], 
  [
   29221, 
   null, 
   "kelvin90701", 
   "Kelvin, you're looking at law the wrong way round, and show a grave misunderstanding of law.\n \n If I run into a building yelling 'bomb', you can call it a 'lie', even I could call it a 'lie'. But in law, it is not a 'lie', yet. Hundreds of people, the media, etc can all say 'that was a lie', but I won't go to prison/be fined simply on everyone's say.\n \n It has to go through something called due process.* Arrest, charging, court, decision. Then it is a 'lie' in law.\n \n If there is not enough evidence, then the court will decide there was no reson to convict. You could go on saying it was a 'lie'. But in law, it would not be.\n \n In fact, if you called me a liar - I could sue for defomation.\n \n You going on about yelling 'Fire' as a lie, is only because it has already been decided upon, you know the outcome. It still has to have gone through the courts.\n \n You forget. Every citizen above the age of 18 is in the militia. Citizens do not have a choice. They are in the militia when they turn 18.\n \n You are looking at things the wrong way around - because you already know that yelling fire has been determined in the courts as being outside the scope of the \"Freedom of Speech\" laws. It still had to be determined in the courts. You've applied the wisdom of hindsight, to retrospectively say that it was always a lie - yes, but in law it had to be adjudicated first.\n \n And yes, you holding guns might still be legal, if the court allows for gun ownership in the context of a militia.\n \n There are many laws that governments don't enforce.\n \n *Something supposedly done in both USA, and Australia\n\n \n OK thanks. I am patient enough for a court to make the act of yelling \"fire\" when there is none a lie.\n \n BTW every citizen above the age of 18 is in the militia.", 
   {}, 
   29040, 
   null, 
   1072492980.0
  ], 
  [
   29222, 
   null, 
   "montalban", 
   "OK thanks. I am patient enough for a court to make the act of yelling \"fire\" when there is none a lie.\n \n BTW every citizen above the age of 18 is in the militia.\n\n \n You still don't get it.\n \n What is a lie, to you and me (read my post - I said, we'd both reckon it to be a lie) is not enought for it to be a lie 'in law'.\n \n It has to be proven in a court for the law to recognise it is a lie, otherwise, in law, it isn't. :)\n \n You for instance might think I'm an idiot. You could get a dozen people to agree with you, BUT in law, this is not good enough.\n \n If you called me an idiot, I could take you to court for deformation. I might win. In law, you have not proven your case. You still might call me an idiot, but as far as the law is concerned, I'm not.\n \n This is because the legal reality may differ from the 'real world'.\n \n Take another example. Here in New South Wales, person 'A' was issued with an Original Birth Certificate, upon his birth; there are blank spaces for father and mother because these were not known. Later he was adopted. The adpoting parents had the certificate amended at time of adoption to have their names put in as parents.\n \n When Person 'A' gets to be 18 and he wishes for a copy of his Original Birth Certificate, he applies for it, and he gets the one amended, because in law, it is the 'original' though in reality it isn't. This is what we call a legal fiction. He could keep demanding his 'original', and the Department of Births, Deaths and Marriages would keep issuing it... only they'd be issuing the amended one... because as far as they are concerned, it is legally the original.\n \n It is quite clear from my discussions with you that you are not well versed with matters legal. I am endeavouring to explain these to you, but either I'm failing as a communicator, or you're pretty thick.\n \n Your views on shouting 'fire' are a prime example. I have stated again and again, your opinion, my opinion for that matter, do not matter. As far as the law is concerned, it has to have been proven in court to have been a lie - unless your laws provide for some other body to adjudicate. It is the law that decides who adjudicates whether it is a lie or not. Not you, not I.\n \n So, when you harp on about legal rights, they are only rights, as determined by law. Your belief in 'Free Speech' must constantly be tested in court...\n \n Several posters, including myself have already shown that your Constitutional right for freedom of religion has been abridged by your courts - the Mormon Case was cited.\n \n Again, we've shown you that your right to carry a gun, has been interpreted by the courts as being valid only within the context of being a member of a militia. Your only retort is - why haven't they come for your guns, if they are illegal.\n \n I don't know why the police in your country are so poor - this is demonstrated by the fact that they arne't prosecuting you, as well by the various pro-gun posters who have stated quite frankly that they feel the need to have guns, because the police are unreliable.\n \n I know for a fact that Mormon communities in Utah continue to live in polygomous relationships, this despite the fact that its against the law. It still remains against the law, even if the police don't act.", 
   {}, 
   29221, 
   null, 
   1072494420.0
  ], 
  [
   29332, 
   null, 
   "kelvin90701", 
   "\n Again, we've shown you that your right to carry a gun, has been interpreted by the courts as being valid only within the context of being a member of a militia. Your only retort is - why haven't they come for your guns, if they are illegal.\n\n \n All US citizens of 18 years and older are in the militia. Then by that militia only argument means all citizens older than 17 years are protected to bear arms.\n \n My \"only' retort is \"they have not come for my guns, if...\"? My other retort is that they have not come for my guns because I am in the militia.\n \n Not only is the government prohibited from taking my guns. The government encourages me to train with military weapons. \n \n http://www.odcmp.com/Services/Rifles/index.htm\n \n The CMP sells discounted suplus military rifles and ammo for training. If you do not want the retired rifles, they give you \"coupons\" to buy modern AR-15/M-16s at a discount from the manufacture.\n \n To qualify to purchase these rifles or get a coupon all you need to do is 1) be a basic good standing citizen older than 17. 2) Shoot a match with a club. The clubs will even loan you a rifle to shoot a match and sell discounted surplus ammo. You do not even have to prove you hit the target. All you have to do is show up and squeeze rounds down range.\n \n So not only is the government prohibited from taking my military rifles, they are making easy for me to obtain one. So \"They\" are almost giving away the rifles and ammo. So how does illegal fit in?\n \n A lie? In said example. I'll still wait for the court to stamp the act of yelling \"fire\" a lie. Then I'm still right and your wrong. Yelling \"Fire\" is not speech. It does not conform to artistic, political, economic, or communication. It is deception. It just took time for a said court to catch up with the facts. It is a deception with intent to deny rights of others to peacable assembly. It a deception to deny the right movie goers and theatre owner to complete a contract. It is a deception to deny the civil rights of movie goers and theatre owner. Violating civil rights of others is not a protected act in the Constitution.\n \n BTW in the other thread? Ever figure out which NRA policies and practices deny the civil rights non-white people?", 
   {}, 
   29222, 
   null, 
   1072605300.0
  ], 
  [
   29338, 
   null, 
   "voiceofreason", 
   "Yelling fire is not free speech. It is a crimnal act called mayhem. Free speech is artistic, political, economic, and communication. Yelling fire is neither. It is a lie.\n \n Please use a more suitable argument.\n\n Who are you to define what free speech is? Next you're going to be defining what religion is. Polygamy was a central principle of the Mormon religion in the 19th century and yet the Supreme Court allowed freedom of religion to be limited in Reynolds v. United States 1878.", 
   {}, 
   28940, 
   null, 
   1072624260.0
  ], 
  [
   29343, 
   null, 
   "kelvin90701", 
   "Who are you to define what free speech is? Next you're going to be defining what religion is. Polygamy was a central principle of the Mormon religion in the 19th century and yet the Supreme Court allowed freedom of religion to be limited in Reynolds v. United States 1878.\n\n \n OK not me. The Supreme Court.\n \n http://www.krusch.com/real/supreme.html\n \n Free speech is simple communication, economic advertisment, artistic, or political. Yelling fire in a theatre when there is none is a LIE. It is decpetion to cause panic and injury. \n \n \n Everyone is perfectly within thier rights to tell lies if they want to. You are free to lie. You are not free of responsibility due to damages because of a lie. \n \n Please use a more suitable arguement.", 
   {}, 
   29338, 
   null, 
   1072631580.0
  ], 
  [
   29361, 
   null, 
   "montalban", 
   "OK not me. The Supreme Court.\n \n http://www.krusch.com/real/supreme.html\n \n Free speech is simple communication, economic advertisment, artistic, or political. Yelling fire in a theatre when there is none is a LIE. It is decpetion to cause panic and injury. \n \n \n Everyone is perfectly within thier rights to tell lies if they want to. You are free to lie. You are not free of responsibility due to damages because of a lie. \n \n Please use a more suitable arguement.\n\n \n Hang on Kelvin, you're contradicting yourself. Before you said yelling 'fire' was a decision that you and I would both know was a lie, and therefore not covered by the 'free speech' provisions of the constitution...\n \n Now you change to saying 'no - it's defined by the court'. Well, you've been arguing against me when I've been saying exactly that!\n \n Stop, please, you're spinning around too fast to know where you stand.", 
   {}, 
   29343, 
   null, 
   1072655640.0
  ], 
  [
   29363, 
   null, 
   "montalban", 
   "\n A lie? In said example. I'll still wait for the court to stamp the act of yelling \"fire\" a lie. Then I'm still right and your wrong. Yelling \"Fire\" is not speech. It does not conform to artistic, political, economic, or communication. It is deception. It just took time for a said court to catch up with the facts. It is a deception with intent to deny rights of others to peacable assembly. It a deception to deny the right movie goers and theatre owner to complete a contract. It is a deception to deny the civil rights of movie goers and theatre owner. Violating civil rights of others is not a protected act in the Constitution.\n \n\n \n Okay, it seems I've still not got through to you.\n \n I understand it's a lie, you do to. Do you understand what it means when something is said to be a lie 'in law'?\n \n We everyday don't wait for court decisions before we act, so I don't know why you keep bringing it up - you recongise it, I recognise it. What we're talking about is in the context of 'law'.\n \n If you write a song that is a rip-off of mine, can I take money from you? No, I've got to go to court FIRST, the court has to rule FIRST before I can get compensation. It is then said to be a rip-off 'in law' (or rather 'breach of copyright'.\n \n Anymore of simply repeating yourself, and I might just give up.", 
   {}, 
   29332, 
   null, 
   1072655940.0
  ], 
  [
   29379, 
   null, 
   "kelvin90701", 
   "Hang on Kelvin, you're contradicting yourself. Before you said yelling 'fire' was a decision that you and I would both know was a lie, and therefore not covered by the 'free speech' provisions of the constitution...\n \n Now you change to saying 'no - it's defined by the court'. Well, you've been arguing against me when I've been saying exactly that!\n \n Stop, please, you're spinning around too fast to know where you stand.\n\n \n So...\n \n I'm holding a gun right now. I just got back from the pistol range. That XXXXXX you off doesn't it? That I am doing something against YOUR will. Do you get XXXXXX off at the idea that people you look upon as inferior do not listen to you? Do you wonder why people just refuse to \"Do it my way\"? Why is that? Why do you need to mold society to your vision? I just want to be left alone by anti-gunners.\n \n BTW do you still have \"rape gangs\" attacking teen age girls in Australia? Where were the police? I remember the big head line a few years ago passing through Sydney was a the rape of a girl 15 times by a gang.", 
   {}, 
   29361, 
   null, 
   1072663740.0
  ], 
  [
   29383, 
   null, 
   "montalban", 
   "So...\n \n I'm holding a gun right now. I just got back from the pistol range. That XXXXXX you off doesn't it? That I am doing something against YOUR will. Do you get XXXXXX off at the idea that people you look upon as inferior do not listen to you? Do you wonder why people just refuse to \"Do it my way\"? Why is that? Why do you need to mold society to your vision? I just want to be left alone by anti-gunners.\n\n \n You're holding a gun right now? Are you stroking it's long barrel?\n \n Yes I do look down upon you. It is one of my many faults. I know you don't have any.\n \n But when you skip and dance about so much with regards to what you are trying to say - natural rights then court made rights, then back to natural rights, and all the while having very little knowledge about law, history, culture etc.\n \n \n \nBTW do you still have \"rape gangs\" attacking teen age girls in Australia? Where were the police? I remember the big head line a few years ago passing through Sydney was a the rape of a girl 15 times by a gang.\n\n \n That's right! America is crime free! Well done, I didn't realise that, thanks be to guns.\n \n Mmm... maybe you do still have crime. I recall headlines of your nation; Bundy, Dharmer, etc, the Washington Sniper, the Unabomber, etc.", 
   {}, 
   29379, 
   null, 
   1072664580.0
  ], 
  [
   29385, 
   null, 
   "kelvin90701", 
   "You're holding a gun right now? Are you stroking it's long barrel?\n \n Yes I do look down upon you. It is one of my many faults. I know you don't have any.\n \n But when you skip and dance about so much with regards to what you are trying to say - natural rights then court made rights, then back to natural rights, and all the while having very little knowledge about law, history, culture etc.\n \n \n \n \n That's right! America is crime free! Well done, I didn't realise that, thanks be to guns.\n \n Mmm... maybe you do still have crime. I recall headlines of your nation; Bundy, Dharmer, etc, the Washington Sniper, the Unabomber, etc.\n\n \n Ahh. Bundy and Darhmer didn't use guns. So how does gun control apply to Bundy and Darhmer? I don't know. Do you women feel safe in the parts of the city with rape gangs? Did you say something about Australian police being effective enough were gun are not needed in your state or something to that effect? I know USA has crime, that is why I carry a gun. Duh?\n \n I didn't know the unabomber used a gun. I'm glad to hear that the Australian police can stop so many crimes that you have a safe society. Does't that mean that the police roll up before the first gang member penetrates a victim? Wow I wish our cops were that good. I know you look down upon me. Why should it matter to you? Your imperialism sickens me.", 
   {}, 
   29383, 
   null, 
   1072665660.0
  ], 
  [
   29388, 
   null, 
   "montalban", 
   "Ahh. Bundy and Darhmer didn't use guns. So how does gun control apply to Bundy and Darhmer?\n\n \n So? You mentioned the gang-rape in Australia, I thought at least you knew something about what you're talking about. They didn't use guns either.\n \n So, are we talking about crime in general - your assertion was that we have gang-rapes because people can't arm themselves with guns, yet you admit Bundy and Darhmer didn't need to carry guns to enact these crimes.\n \n \n I don't know. Do your women feel safe in the parts of the city with rape gangs? \n\n \n Do your women feel safe?\n \n \n Did you say something about Australian police being effective enough were gun are not needed in your state or something to that effect? I know USA has crime, that is why I carry a gun. Duh?\n\n \n So, what are you talking about? And Australia has crime - we have less of it, even by per head of population statistics.\n \n \n I didn't know the unabomber used a gun. \n\n \n Again you miss the point - another sinister person getting away with things without a gun. Obviosuly guns aren't the issue!\n \n \n \n I'm glad to hear that the Australian police can stop so many crimes that you have a safe society. Does't that mean that the police roll up before the first gang member penetrates a victim? Wow I wish our cops were that good. I know you look down upon me. Why should it matter to you? Your imperialism sickens me.\n\n \n Huh? You're the one who raised this as an issue in the first place! You were trying to imply that gangs were rampant because of our lack of guns. I tells ya' fella, you've really got to pick an argument and stick with it, unless you just like looking silly.", 
   {}, 
   29385, 
   null, 
   1072666080.0
  ], 
  [
   29435, 
   null, 
   "kelvin90701", 
   "So? You mentioned the gang-rape in Australia, I thought at least you knew something about what you're talking about. They didn't use guns either.\n \n So, are we talking about crime in general - your assertion was that we have gang-rapes because people can't arm themselves with guns, yet you admit Bundy and Darhmer didn't need to carry guns to enact these crimes.\n \n \n \n Do your women feel safe?\n \n \n \n So, what are you talking about? And Australia has crime - we have less of it, even by per head of population statistics.\n \n \n \n Again you miss the point - another sinister person getting away with things without a gun. Obviosuly guns aren't the issue!\n \n \n \n \n Huh? You're the one who raised this as an issue in the first place! You were trying to imply that gangs were rampant because of our lack of guns. I tells ya' fella, you've really got to pick an argument and stick with it, unless you just like looking silly.\n\n \n Ok never mind the rape gangs. The other really brutal crimes I remember from Australia were the home invasions. Do you still have those? One really brutal one in the headlines the perps raped the wife infront of the husband, then before leaving, they urinated on the couple. Do you remember that one? Just like the USA guns are not the problem, it is crime. Isn't it?", 
   {}, 
   29388, 
   null, 
   1072724520.0
  ], 
  [
   29454, 
   null, 
   "Dan the White", 
   "The homeless man and Me(?) walking along the sidewalk. His rights are not any more important than mine. I am going to a job interview for the same reason he is, I can make the same argument that homelessman violated my rights. Please provide another example. I am willing to entertain more relavant examples of ME(?) violating someone elses rights\n \n With the same thought. I was in McDonalds after work today because I was to lazy to cook. With a .45 on my hip, how did I violate other peoples rights today in MCDonalds?\n \n Did I deny someone free speech? Did I deny someone the right to contract. Did I deny someone right to property? Did I deny someone the right to life? Did I deny someone to illegal search or seizure? How about privacy?\n \n You accused me of affecting someones right, I must violated someone in McDonalds? Please specify a right that I affected and how I affected that right.\n\n \n That is a perfectly relevant example. I'm not saying that it was wrong for you to impinge the homeless man's rights or that it was wrong for him to impinge your rights. I'm not saying that what you did was wrong. I'm simply saying that what you did impinged another person's right and so to say that your rights extend as far as they don't violate another person's rights is simply wrong.\n \n By simply carrying your gun in McDonalds, you didn't greatly impinge anyone's rights. You could analyze the air flow created by carrying your gun or the change in weighting, and you would find that you were violating someone's rights. Yeah, it sounds silly, and I'm not saying that that is why you shouldn't carry a gun. I'm simply saying that since your rights affect everyone and everything, they are not absolute.\n \n By the way, where in the Constitution are we guaranteed the right to life?", 
   {}, 
   28993, 
   null, 
   1072746420.0
  ], 
  [
   29490, 
   null, 
   "kelvin90701", 
   "\n \n By simply carrying your gun in McDonalds, you didn't greatly impinge anyone's rights. \n\n \n I violated no ones rights when I carry a concealed gun into McDonalds. That is why your example is not valid. Did I \"impinge\" on a right? Please name the right.\n \n You say, I \"didn't greatly impinge anyone's right\". Then what makes \"not greatly impinge\" more important than definately VIOLATING my civil rights to carry a firearm?", 
   {}, 
   29454, 
   null, 
   1072769820.0
  ], 
  [
   29491, 
   null, 
   "montalban", 
   "I violated no ones rights when I carry a concealed gun into McDonalds. That is why your example is not valid. Did I \"impinge\" on a right? Please name the right.\n \n You say, I \"didn't greatly impinge anyone's right\". Then what makes \"not greatly impinge\" more important than definately VIOLATING my civil rights to carry a firearm?\n\n \n Well, you don't keep to a story now, do you.\n \n When I first started to debate you on the gun's issues you talked about respecting corporate rights - re airlines. You respected their rights to take a gun from you if you were to travel by aeroplane.\n \n Further, you expressed the fact you wouldn't carry a gun into a supermarket either.\n \n Now you don't care? Or you don't remember what you were in favour of?\n \n Isn't it funny how you change debate so quickly. And you feign ingorance now of a right you were arguing vocally for some few months ago.\n \n Obviously they let any nut carry a gun.", 
   {}, 
   29490, 
   null, 
   1072771320.0
  ], 
  [
   29494, 
   null, 
   "kelvin90701", 
   "\n \n Further, you expressed the fact you wouldn't carry a gun into a supermarket either.\n \n\n \n What are you talking about. I do all the time and I just did a few hours ago like I always do.\n \n I have never used any contraban drugs. NEVER. I have to pass drug test ever few years to keep employment. Have you ever used contraban drugs?", 
   {}, 
   29491, 
   null, 
   1072772880.0
  ], 
  [
   29498, 
   null, 
   "montalban", 
   "What are you talking about. I do all the time and I just did a few hours ago like I always do.\n \n I have never used any contraban drugs. NEVER. I have to pass drug test ever few years to keep employment. Have you ever used contraban drugs?\n\n \n I'm not saying that you don't do it! I'm saying that you argued that you respected the rights of commerical interests and wouldn't do it.\n \n Your saying one thing, and doing another.\n \n Kelvin, under the Gun Debate look for the thread marked \"The Constitution\", it's even one you started so you can't pretend to be unaware of it!\n \n Tell me, in this light, does McDonalds allow you to bring your gun into the store; as you seem to argue some while ago that you respect private property...\n \n \n Post 4\n \nWhat then do you think of the idea that they stop you taking a gun onto a plane... do you still feel safe? Aren't they stopping you're exercising constitutional rights?\n\n \n You replied that you'd...\n \n ...Allow airlines to choose for themselves.\n\n \n This despite the fact that the Constitution says \"Shall not be infringed\" i.e. NO EXCEPTIONS.\n \n Post 8\n \nSee airlines are denying you your constitutional rights...\n\n \n Post 18\n \nNo I do not take a gun to work. It is private property and the owner has banned firearms on his property. I take a gun with me every where possible considering dress, activity, and legality. \n\n \n Post 34\n \nNo. My way allows for people to carry firearms aboard a privately own aircraft if the owner allows it. \n I allow friends and family to bring loaded firearms into my house, but NOT strangers. On my private property, I am sole authority. I can refuse the right to anyone. Your rights to bear arms ends on my property. Same for aircraft. Airplanes are private property. I am for allowing the option to stay open decision defaulted to an airline, but not the the government.\n\n \n And so on, and so on. Kelvin now, you've changed to say you carry your gun onto private property all the time.\n \n Post 21 hits the nail on the head\n \n What is more important that the firearm is the brains of the person carrying the firearm. A stupid person with a firearm is going to find more trouble of quantity and variety. It is perfectly Constitutional to be stupid and with a firearm; and I will not restrict anyone who wants to exercise thier rights to be stupid.\n\n \n Your words are painting quite a portrait; any idiot can carry a gun - even one that argues all sides at once.", 
   {}, 
   29494, 
   null, 
   1072779420.0
  ], 
  [
   29521, 
   null, 
   "kelvin90701", 
   "I'm not saying that you don't do it! I'm saying that you argued that you respected the rights of commerical interests and wouldn't do it.\n \n Your saying one thing, and doing another.\n \n Kelvin, under the Gun Debate look for the thread marked \"The Constitution\", it's even one you started so you can't pretend to be unaware of it!\n \n Tell me, in this light, does McDonalds allow you to bring your gun into the store; as you seem to argue some while ago that you respect private property...\n \n \n Post 4\n \n \n You replied that you'd...\n \n \n This despite the fact that the Constitution says \"Shall not be infringed\" i.e. NO EXCEPTIONS.\n \n Post 8\n \n \n Post 18\n \n \n Post 34\n \n \n And so on, and so on. Kelvin now, you've changed to say you carry your gun onto private property all the time.\n \n Post 21 hits the nail on the head\n \n \n Your words are painting quite a portrait; any idiot can carry a gun - even one that argues all sides at once.\n\n \n Yes the private property owners of the supermarket and McDonalds allow me to carry concealed weapons. So I do. Geez whats your beef? So what private property rights that I have violated are you talking about?\n \n Do you agree that imperialism is evil? That imposing your notions of right and wrong on people within their own borders is imperialistic? That looking down upon native people for what they do within thier own country which is legally accepted and socially accepted, imperialistic? Does that make you an imperialist? Granted that the imperialism practiced by the UK 100 years ago no longer exists, but the notions and attitudes that UK had are now within you when you express your passion about gun control in the USA?", 
   {}, 
   29498, 
   null, 
   1072816080.0
  ], 
  [
   29544, 
   null, 
   "montalban", 
   "Yes the private property owners of the supermarket and McDonalds allow me to carry concealed weapons. So I do. Geez whats your beef? So what private property rights that I have violated are you talking about?\n \n Do you agree that imperialism is evil? That imposing your notions of right and wrong on people within their own borders is imperialistic? That looking down upon native people for what they do within thier own country which is legally accepted and socially accepted, imperialistic? Does that make you an imperialist? Granted that the imperialism practiced by the UK 100 years ago no longer exists, but the notions and attitudes that UK had are now within you when you express your passion about gun control in the USA?\n\n \n Show me McDonalds policy that allows you to carry in a gun.\n \n I'm not trying to take you gun away, I'm arguing based on US laws. You chop and change so much. First you're in favour of natural laws, then court-made laws.", 
   {}, 
   29521, 
   null, 
   1072829940.0
  ], 
  [
   29582, 
   null, 
   "montalban", 
   "Cum catapultae proscriptae erunt tum soli proscript catapultas habebunt. \n When catapults are outlawed, only outlaws will have catapults. \n \n http://www.zippynet.com/pages/latin.htm", 
   {}, 
   29544, 
   null, 
   1072838880.0
  ], 
  [
   29612, 
   null, 
   "kelvin90701", 
   "\"Show me McDonalds policy that allows you to carry in a gun.\"\n \n Just typical of anti-gunner. You would like for me to be your servant and command me around wouldn't you? Ever since I started to carry a gun I have been much more polite to EVERYONE. Since then I answer to stragers \"Yes Sir\" or \"Yes Ma'am\", \"excuse me Sir\", or \"please Ma'am\". That is very typical on a pistol or rifle range. Civility and politeness exceed on a pistol range more than on the street. That is one thing I learned from people on the gun ranges, POLITENESS. \n \n Keep trying. It doesn't work that way over here. McDonalds has to show me the policy that they don't want me to carry a gun into their private property. Not only do I carry concealed into McDonalds, but I carry openly. I carry openly to the bank, the grocery, pumping gas, etc. Try to think like an American when you apply US laws to me. Is it too much to leave your imperialism and judge me by our standards and not yours?\n \n How about trying \"Please\" next time?\n \n So you want to make me an outlaw? \n Like this man and so many other good people:\n http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=29004\n \n So how would that work? Do you just start filling up trucks with people who own guns and take them to jail?", 
   {}, 
   29582, 
   null, 
   1072851900.0
  ], 
  [
   29631, 
   null, 
   "montalban", 
   "\"Show me McDonalds policy that allows you to carry in a gun.\"\n \n Just typical of anti-gunner. You would like for me to be your servant and command me around wouldn't you? Ever since I started to carry a gun I have been much more polite to EVERYONE. Since then I answer to stragers \"Yes Sir\" or \"Yes Ma'am\", \"excuse me Sir\", or \"please Ma'am\". That is very typical on a pistol or rifle range. Civility and politeness exceed on a pistol range more than on the street. That is one thing I learned from people on the gun ranges, POLITENESS. \n \n Keep trying. It doesn't work that way over here. McDonalds has to show me the policy that they don't want me to carry a gun into their private property. Not only do I carry concealed into McDonalds, but I carry openly. I carry openly to the bank, the grocery, pumping gas, etc. Try to think like an American when you apply US laws to me. Is it too much to leave your imperialism and judge me by our standards and not yours?\n \n How about trying \"Please\" next time?\n \n So you want to make me an outlaw? \n Like this man and so many other good people:\n http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=29004\n \n So how would that work? Do you just start filling up trucks with people who own guns and take them to jail?\n\n \n Please state the law by which McDoanlds must so act.\n \n Kelvin, you're not aware of even your own nation's corporate attitudes to guns\n \n McDonald's certainly doesn't like their employees using guns\n http://keepandbeararms.com/newsarchives/XcNewsPlus.asp?cmd=view&articleid=282\n \n I've seen people's comments that criticise McDonalds, because even in states that allow CCW, but McDonald's doesn't. See article \"Then they are responsible for your safety, aren't they?\" at http://www.packing.org/news/article.jsp/8335.\n \n People criticise McDonald's for being anti-gun in general.\n We also suggest contacting the major sponsors, listed under \"TOP Partners\". These include Coca Cola, McDonald's, Panasonic, Samsung, Sports Illustrated, Xerox, John Hancock and Kodak, and VISA.\n http://www.sierratimes.com/archive/files/dec/27/arut122701.htm\n \n Thus McDonald's\n Does not want their employees using guns.\n They don't want their customers using guns.\n They aren't pro gun.\n \n Where did you think that they should be?", 
   {}, 
   29612, 
   null, 
   1072868760.0
  ], 
  [
   29654, 
   null, 
   "Rev. HellH0und", 
   "D00d,\n \n \n McDonalds kills more people anually than guns. If you want the answer to this dilema here it is. I can (if I can legally) carry concealed anywhere I wish. If it is not unlawfull to bring a concealled gun but simply a company policy then it is a civil manner and not a criminal one (unless there is a law of course outlining this) and if micky'd s catches me they can throw me out as is thier perrogative.\n \n \n Freely,\n \n \n The Good Reverend Hellh0und", 
   {}, 
   29631, 
   null, 
   1072888140.0
  ], 
  [
   29665, 
   null, 
   "kelvin90701", 
   "Please state the law by which McDoanlds must so act.\n \n Kelvin, you're not aware of even your own nation's corporate attitudes to guns\n \n McDonald's certainly doesn't like their employees using guns\n http://keepandbeararms.com/newsarchives/XcNewsPlus.asp?cmd=view&articleid=282\n \n I've seen people's comments that criticise McDonalds, because even in states that allow CCW, but McDonald's doesn't. See article \"Then they are responsible for your safety, aren't they?\" at http://www.packing.org/news/article.jsp/8335.\n \n People criticise McDonald's for being anti-gun in general.\n We also suggest contacting the major sponsors, listed under \"TOP Partners\". These include Coca Cola, McDonald's, Panasonic, Samsung, Sports Illustrated, Xerox, John Hancock and Kodak, and VISA.\n http://www.sierratimes.com/archive/files/dec/27/arut122701.htm\n \n Thus McDonald's\n Does not want their employees using guns.\n They don't want their customers using guns.\n They aren't pro gun.\n \n Where did you think that they should be?\n\n \n Got an email address? I'll send you the training manual for the state in PDF form?\n \n Firearms are prohibited in following areas:\n \n 1) Airports\n 2) Courts\n 3) National Parks\n 4) Federal Buildings\n 5) Correctional and Mental health facilities\n 6) A house of worship or private residence (now this is important part) IF NOTICE IS GIVEN (verbal/posted sign).\n \n There is no sign. No one has verbally notified me. Please try to know our laws and judge me by our laws not yours. Yes, there are MacDonalds and stores with signs out front that prohibit CCW. I don't go there.\n \n I am not an employee of McDonalds. What you posted is not McDonald's policy for customers.\n \n Simple question if you can help me out. Where I can not carry a firearm, I carry a 4\" serated spring loaded folding blade and a pepper spray mix of tear gas, olin resin, and pepper. If I have to I use the pepper spray for distance in my left hand. With the knife in my right hand. So use pepper spray first to gain advantage just for second, then use the knife across neck, chest, belly area with one large cut as you run past him and away. Be sure to run past attackers side opposite to where he is holding a weapon. Not as effective as a bullet, but a much more painful way to become disabled. I use a spray that mists, not foam, so be sure to hold your breath as you run past attacker. First maced, then cut, Ouch!. Do you think I should use the point of knife and stab and twist? Or use a big sweaping single cut?\n \n \n BTW. Entering a business with a firearm that prohibits fireramrs is NOT a firearm violation. It is a property violation called tresspassing.", 
   {}, 
   29631, 
   null, 
   1072895100.0
  ], 
  [
   29681, 
   null, 
   "Inspector346", 
   "Kelvin, I certainly applaud your willingness to suffer the \"Prisoner of Australia's\" idealogy, but are'nt you kicking a dead wombat? There are none so blind as they who CHOOSE not to see. The \"prisoner\" will die before accepting the truth. It is their bane in blind acceptance of the \"Warden's Word\" to acquiesce to a government that does not allow them a Bill Of Rights as we U.S. citizens know it. Suffer this child no further. (My apologies in advance if this offends others.)", 
   {}, 
   29665, 
   null, 
   1072909260.0
  ], 
  [
   29684, 
   null, 
   "kelvin90701", 
   "Kelvin, I certainly applaud your willingness to suffer the \"Prisoner of Australia's\" idealogy, but are'nt you kicking a dead wombat? There are none so blind as they who CHOOSE not to see. The \"prisoner\" will die before accepting the truth. It is their bane in blind acceptance of the \"Warden's Word\" to acquiesce to a government that does not allow them a Bill Of Rights as we U.S. citizens know it. Suffer this child no further. (My apologies in advance if this offends others.)\n\n \n The Aussie serves a purpose. The more questions he asks, the more answers I have for him. He is not the only one reading this.\n \n BTW to the others. The Aussie has lived under years of social conditions where they equate gun ownership = crime. Thus to him I am a criminal. When he discusses gun control with US citizens he is bringing his prejudice. This is also the goal of Sarah Brady and anti-gunners. To socially engineer the US to think that ownership = crime. That opens the way to look upon gun onwers as deviants not worthy of rights. It is already started. When anti-gunners harp \"You are violating my rights\". All you have to ask, can you name that right I'm violating? They can't, but they for some reason they still think you are for carrying a firearm. Because of the social engineering and blantant Constitutional illeteracy of many anti-gunners, when they simply do not get their way to them means some how thier rights have been violated. Well guess what Mr./Ms. Anti-gunner? Too bad. That is not the way our republic and democracy work. No matter how vile you look upon gun ownership, it is your duty to TOLLERATE it, unless you can get a Constitutional amendmend passed. If you can get it passed honestly then so be it. If you get it passed with lies and decit such as in Bowling, then so be it, but that is the day I find a hole in Montana and wait for the USA to implode.\n \n BTW it is your Constitutional right to be offensive, but not in the UK, where in an effort to control crime \"anti-social\" laws prohibit you from being offensive.", 
   {}, 
   29681, 
   null, 
   1072912560.0
  ], 
  [
   29700, 
   null, 
   "montalban", 
   "Firearms are prohibited in following areas:\n \n 1) Airports\n 2) Courts\n 3) National Parks\n 4) Federal Buildings\n 5) Correctional and Mental health facilities\n 6) A house of worship or private residence (now this is important part) IF NOTICE IS GIVEN (verbal/posted sign).\n\n \n SHALL NOT BE INFRINGED. says the law... you are selective in when to apply the law. What happened to your natural rights? What happened to the Federal Government not infringing upon these rights?\n \n I asked you earlier about National Parks, and you said it was okay. Now it's not. See Post 10 of \"For anti-gunners? How do you defend yourself?\"\n You suggest people can take guns onto National Parks - for deer hunting.\n \n If only you could keep to one story, please.\n \n You said that you took a gun onto public hospitals. But what about federally operated hospitals (if there are any?)\n \n You stated that Airlines could make up their own minds about whether or not to allow guns, now how do they do this in any meaningful way, if airports won't allow guns?\n \n I take it that the Federal Buildings ban is legislated. This means that you accept the violation of your right to bear arms.\n \n \nThere is no sign. No one has verbally notified me. Please try to know our laws and judge me by our laws not yours. Yes, there are MacDonalds and stores with signs out front that prohibit CCW. I don't go there.\n \n I am not an employee of McDonalds. What you posted is not McDonald's policy for customers.\n\n \n No, but the three sites cited are suggestive that McDonald's is not pro-gun. You seem to think that they are, and that you can take your gun into there. You do so without consulting them.\n \n Again you are being highly selective in your application to law. You make no sense.\n \n \n BTW. Entering a business with a firearm that prohibits fireramrs is NOT a firearm violation. It is a property violation called tresspassing.\n\n \n It doesn't matter which law forbids it, it's forbidden. You are still being selective in application of law. You stated that you'd carry where-ever you wanted, then made exceptions for businesses that forbid it.\n \n You apply the law only when it suits you. Sometimes you say its an absoulte/natural right. Other times you say you respect private property.\n \n If you could actually tell me what you believe and stick to it, it would be a lot easier to understand.\n \n You cry about your god-given rights to carry a gun, but then make so many exceptions, and then even these change.\n \n You tell me not to judge you by our laws. I'm not, I'm judging you by what you say... and you keep changing.", 
   {}, 
   29665, 
   null, 
   1072923960.0
  ], 
  [
   29716, 
   null, 
   "Dan the White", 
   "I violated no ones rights when I carry a concealed gun into McDonalds. That is why your example is not valid. Did I \"impinge\" on a right? Please name the right.\n \n You say, I \"didn't greatly impinge anyone's right\". Then what makes \"not greatly impinge\" more important than definately VIOLATING my civil rights to carry a firearm?\n\n \n You need to work on your reading comprehension. There aren't just two points of view in any debate. I don't ever remember saying that you shouldn't be allowed to have your gun in McDonalds. I have only said that rights are not absolute because anything you do probably impinges on someone else's rights in a way. But there are different degrees of impingement, different degrees of violations, so there are different degrees to the right to bear arms. That's why there are gun control laws.\n \n And once and for all, why don't you answer the question that montalban has asked about 47 times. On what do you base this right to bear arms? State it once and for all and then don't randomly change it.", 
   {}, 
   29490, 
   null, 
   1072942260.0
  ], 
  [
   29722, 
   null, 
   "montalban", 
   "The Aussie serves a purpose. The more questions he asks, the more answers I have for him. He is not the only one reading this.\n\n \n The only problem really, for your argument is that although you have a bag of answers, these change all the time. The same question will elicit a different response from you.\n \n \nBTW to the others. The Aussie has lived under years of social conditions where they equate gun ownership = crime. Thus to him I am a criminal. When he discusses gun control with US citizens he is bringing his prejudice.\n\n \n When will you realise that not everyone is 'yearning to be free' in the 'home of the brave'. You are continually of the opinion Australia is some kind of nirvana for ciminals.\n \n If you have something to say with regard to addressing an issue I've raised, then it would be helpful if you stick to the one line of argument and stop changing it. Your lack of knowledge of history, law, etc, and even logical formation of argument don't seem to hamper your wish to continue to post. I suppose a gun compensates for more things than what I previously thought.", 
   {}, 
   29684, 
   null, 
   1072953540.0
  ], 
  [
   29723, 
   null, 
   "voiceofreason", 
   " It is already started. When anti-gunners harp \"You are violating my rights\". All you have to ask, can you name that right I'm violating?\n \n Which anti-gunner is saying \"You are violating my rights\"? In think it's the other way around. In most cases involving gun-control, the courts have upheld gun-control laws as being constitutional. So when pro-gunners harp about their rights being violated can they name which right is being violated by gun-control? \n \n \nBTW it is your Constitutional right to be offensive, but not in the UK, where in an effort to control crime \"anti-social\" laws prohibit you from being offensive.\n\n BTW it is your Constitutional right to advocate gun-control since free speech is protected by the first amendment.", 
   {}, 
   29684, 
   null, 
   1072966200.0
  ], 
  [
   29739, 
   null, 
   "montalban", 
   "BTW it is your Constitutional right to be offensive, but not in the UK, where in an effort to control crime \"anti-social\" laws \n prohibit you from being offensive.\n\n \n \n Why are you saying this? I am not in the UK, so that part's nothing to do with me. Are you referring to the Australian Constitution in saying that, if so, please provide reference.\n \n Are you referring to the USA Constitution? If so, please provide references... and explain how the USA's Constitutional right affects me?", 
   {}, 
   29684, 
   null, 
   1072999320.0
  ], 
  [
   29882, 
   null, 
   "kelvin90701", 
   "You need to work on your reading comprehension. There aren't just two points of view in any debate. I don't ever remember saying that you shouldn't be allowed to have your gun in McDonalds. I have only said that rights are not absolute because anything you do probably impinges on someone else's rights in a way. But there are different degrees of impingement, different degrees of violations, so there are different degrees to the right to bear arms. That's why there are gun control laws.\n \n And once and for all, why don't you answer the question that montalban has asked about 47 times. On what do you base this right to bear arms? State it once and for all and then don't randomly change it.\n\n \n Well the current state of laws and rights are not debateable. Yes I am allowed to carry a gun into McDonalds. \n \n Can you explain which rights I impinge on? You said I did or think I did. So then which one is it? If there is none, then I have not impinged on anyone's rights. If I have not impinged on a right, then your dicussion about putting a limit on me carrying a gun into McDonalds is moot, isn't it?", 
   {}, 
   29716, 
   null, 
   1073103120.0
  ], 
  [
   29883, 
   null, 
   "kelvin90701", 
   ". So when pro-gunners harp about their rights being violated can they name which right is being violated by gun-control? \n .\n\n \n Yes I can:\n \n 1) Waiting periods and gun prohibitions on purchases violate my right to contract.\n \n 2) Information in a database regarding my ownership violates my right to privacy.\n \n 3) Denying self-protection denies people who are killed without one and who want a gun the right to life.\n \n 4) Of course lets not forget the 2nd Amendment. The right to bear arms. If you bring up the militia argument, YES I'M IN THE MILITIA and so is every citizen over 17 years of age.\n \n 5) If the government starts taking guns that violates the IV Amendment and right to illegal search and seizure.\n \n So anti-gunners who think I'm violating rights when I carry a gun only think I am violating someones rights. For sakes, please LEARN THE CONSTITUTION and the principles that govern our democracy and republic.", 
   {}, 
   29723, 
   null, 
   1073103660.0
  ], 
  [
   29886, 
   null, 
   "montalban", 
   "Yes I can:\n \n 1) Waiting periods and gun prohibitions on purchases violate my right to contract.\n\n \n There's often 'cooling-off' periods in contracts.\n \n Secondly, despite having a contract with a supplier - that does not of itself mean it is legal. \n \n a) You might lie on a contract - therefore voiding it under some laws\n \n b) You might take out a contract to kill someone, such a contract might exist, but legally, it is not valid.\n \n c) You might gain a contract to get supply of a product - such as a hazardous material that you're not capable under law of keeping/storing.\n \n \n2) Information in a database regarding my ownership violates my right to privacy.\n\n \n Banks and the IRS hold information about you. Are you whinning about that?\n \n If you have a criminal record - don't they keep fingerprints - even after your sentence is over?\n \n \n3) Denying self-protection denies people who are killed without one and who want a gun the right to life.\n\n \n Guns are not about 'self-protection' see 2nd Amendment.\n \n Secondly, you are allowed to protect yourself, otherwise you've not heard of 'self-defence'... and this doesn't mean only using a gun either.\n \n \n4) Of course lets not forget the 2nd Amendment. The right to bear arms. If you bring up the militia argument, YES I'M IN THE MILITIA and so is every citizen over 17 years of age.\n\n \n What? Every single citizen over 17 years of age is in a militia? Oh, of course you bring up your 2nd Amendment right now, but see before, you said it was about personal protection. You seem confused about what the 2nd Amendment allows.\n \n \n5) If the government starts taking guns that violates the IV Amendment and right to illegal search and seizure.\n\n \n Only if they seize them illegally.\n \n There are legal ways the cops can take a gun off you, such as when they arrest you for a major crime -they'll take any guns you've got on you, off you.\n \n \nSo anti-gunners who think I'm violating rights when I carry a gun only think I am violating someones rights. For sakes, please LEARN THE CONSTITUTION and the principles that govern our democracy and republic.\n\n \n Perhaps you might want to 'learn the constitution', as you seem to think that the amendments were wrestled from Britain.\n \n You don't understand the Constitution. That's why you keep making rules for the \"Shall not be infringed\" part.\n \n That's why you keep thinking it's about personal protection, when it's not.", 
   {}, 
   29883, 
   null, 
   1073105940.0
  ], 
  [
   29890, 
   null, 
   "kelvin90701", 
   "There's often 'cooling-off' periods in contracts.\n \n Secondly, despite having a contract with a supplier - that does not of itself mean it is legal. \n \n a) You might lie on a contract - therefore voiding it under some laws\n \n b) You might take out a contract to kill someone, such a contract might exist, but legally, it is not valid.\n \n c) You might gain a contract to get supply of a product - such as a hazardous material that you're not capable under law of keeping/storing.\n \n \n \n Banks and the IRS hold information about you. Are you whinning about that?\n \n If you have a criminal record - don't they keep fingerprints - even after your sentence is over?\n \n \n \n Guns are not about 'self-protection' see 2nd Amendment.\n \n Secondly, you are allowed to protect yourself, otherwise you've not heard of 'self-defence'... and this doesn't mean only using a gun either.\n \n \n \n What? Every single citizen over 17 years of age is in a militia? Oh, of course you bring up your 2nd Amendment right now, but see before, you said it was about personal protection. You seem confused about what the 2nd Amendment allows.\n \n \n \n Only if they seize them illegally.\n \n There are legal ways the cops can take a gun off you, such as when they arrest you for a major crime -they'll take any guns you've got on you, off you.\n \n \n \n Perhaps you might want to 'learn the constitution', as you seem to think that the amendments were wrestled from Britain.\n \n You don't understand the Constitution. That's why you keep making rules for the \"Shall not be infringed\" part.\n \n That's why you keep thinking it's about personal protection, when it's not.\n\n \n Good citizens do not have to lie to purchase firearms. They qualify already. My right to purchase firearms are protected under the contract clause of the Constitution. The contract clause does not protect activites that violate the rights of OTHERS or the exchange of contraban. The contractual agreement to purchase a firearm between good citizens violates NO rights of others. Try to open your simple mind to include legal activities that violate NO ONE as proper,legal, and Constitutional; which your two above examples do not hold to. The reason why your two above exaples seem logical is because you bring the prejudice of living under criminalized ownership of firearms in your country.\n \n My right to firearms are both convered as a natural right to life and in the 2nd Amendment. Yes every citizen of age is in the militia. You do not have a choice when you turn 18. \n \n My information with a bank is included with the right to contract. In the contract they obtain the information. Both parties agree to have the information stored. Yes I agree to give the information. I do not have the right to force the bank to do business with me according to MY terms. If the banks want it, I have to give it to them to contract with the bank. \n \n The IRS does not store information on me. That is why every year they need me to provide them new documentation and upon an audit I supply the documents.\n \n Perhaps you need to drop your prejudice you bring with you across an ocean and stop thinking of gun owners as criminals, they are not, we are the keepers of democracy, and the Federalist papers say so.", 
   {}, 
   29886, 
   null, 
   1073108940.0
  ], 
  [
   29894, 
   null, 
   "montalban", 
   "Good citizens do not have to lie to purchase firearms. They qualify already. My right to purchase firearms are protected under the contract clause of the Constitution. The contract clause does not protect activites that violate the rights of OTHERS or the exchange of contraban. The contractual agreement to purchase a firearm between good citizens violates NO rights of others. Try to open your simple mind to include legal activities that violate NO ONE as proper,legal, and Constitutional; which your two above examples do not hold to. The reason why your two above exaples seem logical is because you bring the prejudice of living under criminalized ownership of firearms in your country.\n \n My right to firearms are both convered as a natural right to life and in the 2nd Amendment. Yes every citizen of age is in the militia. You do not have a choice when you turn 18. \n \n My information with a bank is included with the right to contract. In the contract they obtain the information. Both parties agree to have the information stored. Yes I agree to give the information. I do not have the right to force the bank to do business with me according to MY terms. If the banks want it, I have to give it to them to contract with the bank. \n \n The IRS does not store information on me. That is why every year they need me to provide them new documentation and upon an audit I supply the documents.\n\n \n You believe the IRS doesn't store information on you!\n \n Hey, it's cool! I see you've switched to 'natural rights' arguments (again!)\n \n How are these national militia's organised? When do all those Americans get training?\n \n \n \nPerhaps you need to drop your prejudice you bring with you across an ocean and stop thinking of gun owners as criminals, they are not, we are the keepers of democracy, and the Federalist papers say so.\n\n \n Kelvin, this is so lame it's sad. You have demonstrated a patent lack of knowledge on the formation of the constitution. Just saying 'the Federalist Papers say so' is so weak. Give me a reference.\n \n Look I know you don't know what you're talking about here, so I'll put you out of your misery.\n \n One of the Federalist Papers \"Concerning the Militia\" by Hamilton deals with the militia being a safe-guard by the State. People were concerned that the militia might get out of hand. Hamilton wrote...\n \"There is something so far-fetched and so extravagant in the idea of danger to liberty from the militia, that one is at a loss whether to treat it with gravity or with raillery; whether to consider it as a mere trial of skill, like the paradoxes of rhetoricians; as a disingenuous artifice to instil prejudices at any price; or as the serious offspring of political fanaticism. Where in the name of common-sense, are our fears to end if we may not trust our sons, our brothers, our neighbors, our fellow-citizens? What shadow of danger can there be from men who are daily mingling with the rest of their countrymen and who participate with them in the same feelings, sentiments, habits and interests? What reasonable cause of apprehension can be inferred from a power in the Union to prescribe regulations for the militia, and to command its services when necessary, while the particular States are to have the SOLE AND EXCLUSIVE APPOINTMENT OF THE OFFICERS? If it were possible seriously to indulge a jealousy of the militia upon any conceivable establishment under the federal government, the circumstance of the officers being in the appointment of the States ought at once to extinguish it. There can be no doubt that this circumstance will always secure to them a preponderating influence over the militia. \"\n http://lcweb2.loc.gov/const/fed/fed_29.html\n That is, there is the State to leglislate and control the use of the militia.... recall, that's what the militia was for. Not to aid your own personal protection, but to protect the state, from tyranny and insurrection, or invasion.\n \n You're a funny guy Kelvin. Only in your last few posts have you begun to acknowledge that the militia is there for state protection, not personal protection, because in protecting the state, your rights are protected. You can't quite let go of the personal protection issue, because then you'd have no excuse to carry a gun every where you go.\n \n However, which government should control the militia? Hamilton above, believed the state. Jay just says \"one government\"\n \n \"One government can ...place the militia under one plan of discipline, and, by putting their officers in a proper line of subordination to the Chief\n Magistrate, will, as it were, consolidate them into one corps, and\n thereby render them more efficient than if divided into thirteen or into\n three or four distinct independent companies.\"\n http://federalistpapers.com/federalist4.html\n \n This is borne out by the following paragraph\n \"What would the militia of Britain be if the English militia obeyed the\n government of England, if the Scotch militia obeyed the government of\n Scotland, and if the Welsh militia obeyed the government of Wales?\n Suppose an invasion; would those three governments (if they agreed at\n all) be able, with all their respective forces, to operate against the\n enemy so effectually as the single government of Great Britain would?\"\n Ibid.\n \n Obviously he wants the national government to control the militia.\n \n And that's obvious about the nature of the Federalist Papers, they are a discussion about what might be. If you think that they hold weight to your argument, then please present a quote and why it is relevant.\n \n Kelvin, I await your next factless tract.", 
   {}, 
   29890, 
   null, 
   1073110200.0
  ], 
  [
   29929, 
   null, 
   "kelvin90701", 
   "You believe the IRS doesn't store information on you!\n \n Hey, it's cool! I see you've switched to 'natural rights' arguments (again!)\n \n How are these national militia's organised? When do all those Americans get training?\n \n \n \n \n Kelvin, this is so lame it's sad. You have demonstrated a patent lack of knowledge on the formation of the constitution. Just saying 'the Federalist Papers say so' is so weak. Give me a reference.\n \n Look I know you don't know what you're talking about here, so I'll put you out of your misery.\n \n One of the Federalist Papers \"Concerning the Militia\" by Hamilton deals with the militia being a safe-guard by the State. People were concerned that the militia might get out of hand. Hamilton wrote...\n \"There is something so far-fetched and so extravagant in the idea of danger to liberty from the militia, that one is at a loss whether to treat it with gravity or with raillery; whether to consider it as a mere trial of skill, like the paradoxes of rhetoricians; as a disingenuous artifice to instil prejudices at any price; or as the serious offspring of political fanaticism. Where in the name of common-sense, are our fears to end if we may not trust our sons, our brothers, our neighbors, our fellow-citizens? What shadow of danger can there be from men who are daily mingling with the rest of their countrymen and who participate with them in the same feelings, sentiments, habits and interests? What reasonable cause of apprehension can be inferred from a power in the Union to prescribe regulations for the militia, and to command its services when necessary, while the particular States are to have the SOLE AND EXCLUSIVE APPOINTMENT OF THE OFFICERS? If it were possible seriously to indulge a jealousy of the militia upon any conceivable establishment under the federal government, the circumstance of the officers being in the appointment of the States ought at once to extinguish it. There can be no doubt that this circumstance will always secure to them a preponderating influence over the militia. \"\n http://lcweb2.loc.gov/const/fed/fed_29.html\n That is, there is the State to leglislate and control the use of the militia.... recall, that's what the militia was for. Not to aid your own personal protection, but to protect the state, from tyranny and insurrection, or invasion.\n \n You're a funny guy Kelvin. Only in your last few posts have you begun to acknowledge that the militia is there for state protection, not personal protection, because in protecting the state, your rights are protected. You can't quite let go of the personal protection issue, because then you'd have no excuse to carry a gun every where you go.\n \n However, which government should control the militia? Hamilton above, believed the state. Jay just says \"one government\"\n \n \"One government can ...place the militia under one plan of discipline, and, by putting their officers in a proper line of subordination to the Chief\n Magistrate, will, as it were, consolidate them into one corps, and\n thereby render them more efficient than if divided into thirteen or into\n three or four distinct independent companies.\"\n http://federalistpapers.com/federalist4.html\n \n This is borne out by the following paragraph\n \"What would the militia of Britain be if the English militia obeyed the\n government of England, if the Scotch militia obeyed the government of\n Scotland, and if the Welsh militia obeyed the government of Wales?\n Suppose an invasion; would those three governments (if they agreed at\n all) be able, with all their respective forces, to operate against the\n enemy so effectually as the single government of Great Britain would?\"\n Ibid.\n \n Obviously he wants the national government to control the militia.\n \n And that's obvious about the nature of the Federalist Papers, they are a discussion about what might be. If you think that they hold weight to your argument, then please present a quote and why it is relevant.\n \n Kelvin, I await your next factless tract.\n\n \n I 100% believe you. Especially the part of \"There is something so far-fetched and so extravagant in the idea of danger to liberty from the militia\". \n \n The idea of the militia a danger to liberty is \"far-fetched\" and \"extravagant\". Regardless of the natural rights arugement. It is moot. I have the rights, natural or not.\n \n Keep reading the Federalist Papers. Then maybe you will understand US notions on democracy and government, but first you have to leave behind your imperialism and forgein notions on government and democracy.", 
   {}, 
   29894, 
   null, 
   1073162220.0
  ], 
  [
   29932, 
   null, 
   "kelvin90701", 
   "Anyone ever figure out which whose right or which right I vioate by carrying a gun into McDonalds?", 
   {}, 
   29929, 
   null, 
   1073163360.0
  ], 
  [
   29961, 
   null, 
   "montalban", 
   "I 100% believe you. Especially the part of \"There is something so far-fetched and so extravagant in the idea of danger to liberty from the militia\". \n \n The idea of the militia a danger to liberty is \"far-fetched\" and \"extravagant\". Regardless of the natural rights arugement. It is moot. I have the rights, natural or not.\n \n Keep reading the Federalist Papers. Then maybe you will understand US notions on democracy and government, but first you have to leave behind your imperialism and forgein notions on government and democracy.\n\n \n Your cartoon-like argument has shown through. I called your bluff! You said that the Federalist Papers backed up your argument.\n \n I asked you to show me where - to give me a reference. And you haven't!\n \n You need to back up your statement with facts, or withdraw it.\n \n When you find the Federalist paper that supports your notions, then you need to connect it to an actual argument.\n \n Your glib suggestion that I should keep reading them is suggestive that you haven't and you don't know what you're talking about. But far be it for an American to cease discussing a topic he knows nothiong about. :)\n \n You say you have the 'rights' natural or not... how do you have these rights?", 
   {}, 
   29929, 
   null, 
   1073181300.0
  ], 
  [
   29962, 
   null, 
   "montalban", 
   "Anyone ever figure out which whose right or which right I vioate by carrying a gun into McDonalds?\n\n \n \n You said much earlier on that you would not carry a gun into court - because that would influence the jury.\n \n This suggests that a gun can intimidate people. If so, then you carrying a gun into a family restaurant can intimidate people.\n \n By the way, by what 'right' do you carry a gun into McDonalds. You have not yet mentioned the basis for your rights. You waver between natural and statutory rights.\n \n It's been about 3 months of me asking you this. I expect instead that you'll give one of your funny phony statements about 'foreign' 'imperialism' (which is insane that you'd feel threatened by a guy in Australia).", 
   {}, 
   29932, 
   null, 
   1073181600.0
  ], 
  [
   29965, 
   null, 
   "kelvin90701", 
   "Your cartoon-like argument has shown through. I called your bluff! You said that the Federalist Papers backed up your argument.\n \n I asked you to show me where - to give me a reference. And you haven't!\n \n You need to back up your statement with facts, or withdraw it.\n \n When you find the Federalist paper that supports your notions, then you need to connect it to an actual argument.\n \n\n \n I am using your own quote from the Federalist.\n \n \"There is something so far-fetched and so extravagant in the idea of danger to liberty from the militia\"\n \n The militia dangerous to liberty is \"far-fetched\" and \"extravagant\". \n \n There is no right to not be intimidated. \n \n Natural and legal right to carry a gun. I have both.", 
   {}, 
   29961, 
   null, 
   1073185260.0
  ], 
  [
   29970, 
   null, 
   "montalban", 
   "I am using your own quote from the Federalist.\n \n \"There is something so far-fetched and so extravagant in the idea of danger to liberty from the militia\"\n \n The militia dangerous to liberty is \"far-fetched\" and \"extravagant\". \n \n There is no right to not be intimidated. \n\n \n What has this got to do with you arming yourself for your own personal protection? How are you protecting your State's rights by carrying a gun into McDonald's? (are you expecting an anti-American uprising during McBreakfast?)\n \n Construct an argument, or retire. There's a notion called 'context' you need to be aware of.\n \n \n \nNatural and legal right to carry a gun. I have both.\n\n \n Hurrah. This only took 3 months.\n \n How do you have a 'natural right' to carry a gun? Where do you deem that this notion exists? (or did you just make it up). And don't be vague, (again!) use a reference unless you are just stating your opinion.", 
   {}, 
   29965, 
   null, 
   1073188560.0
  ], 
  [
   29981, 
   null, 
   "Pie", 
   "The right to self defense is considered by most people to be a natural one. And given the choice, many would choose to protect themselves with a firearm", 
   {}, 
   29970, 
   null, 
   1073194500.0
  ], 
  [
   30003, 
   null, 
   "Dan the White", 
   "Well the current state of laws and rights are not debateable. Yes I am allowed to carry a gun into McDonalds.\n\n \n What? Is this ancient Greece or something? In ancient Greece, once a law was passed, everyone had to agree to it. However, here in the US, laws can be changed. \n \n \nCan you explain which rights I impinge on? You said I did or think I did. So then which one is it? If there is none, then I have not impinged on anyone's rights. If I have not impinged on a right, then your dicussion about putting a limit on me carrying a gun into McDonalds is moot, isn't it?\n\n \n I'm thinking it was montalban who said that you intimidate people by carrying your gun into McDonalds. But although that right is not specifically mentioned in the Constitution (and neither is the absolute right to bear arms or the absolute right of anything), it is a right that must be considered. In fact, your favorite document (when you think it helps you), the Constitution of the United States of America, states in Amendment 9, \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\" That means that although the right to not be intimidated is not specifically mentioned in the Constitution, it is a right of the people. And your idea, \"well if it isn't in the Bill of Rights, then it isn't a right,\" is exactly what the Federalist leaders feared in having a Bill of Rights. Yes, that's right, your favorite people, the authors of the Federalist Papers, those American heros, Madison, Hamilton, and Jay, did not want a Bill of Rights because they feared exactly what you have been saying. But you know what, I don't know why I'm telling you all this, because obviously, unlike that imperialistic, annoying, Australian, you know everything there is to know about the Constitution and its radification debates.\n \n Speaking of montalban, your criticism of him being so imperialistic could be one of the most rediculous things I've ever heard. Are you aware that the US currently has troops in Afgahnistan, Iraq, and Korea, among other places. And no war has been declared in any of those places.\n \n But despite what you have implied from my posts even though I have corrected you several times, I am not necessarily against you having a gun in McDonalds. There should be gun control, because as in all parts of life, there must be a balance. You can't have your absolute rights. That's been my whole point. Now, I don't want you to have your gun, I don't want anyone to have his or her gun. But I don't think the solution is a complete gun ban because that would just add to your and other people's unfounded fears and suspicions. Those fears and suspicions are the problem in America, and guns are just a manifestation of that problem. I'm not sure what the solution to this is yet, but I know that a complete gun ban isn't it. We can't just take people's guns away completely, we have to make people not feel that they need a gun. And judging from kelvin's comments, that could take awhile.", 
   {}, 
   29882, 
   null, 
   1073202360.0
  ], 
  [
   30009, 
   null, 
   "montalban", 
   "The right to self defense is considered by most people to be a natural one. And given the choice, many would choose to protect themselves with a firearm\n\n \n What 'many'? Enough with your opinion, please provide facts.\n \n And...\n \n What has this got to do with a militia/2nd Amendment which is the crux of this thread?", 
   {}, 
   29981, 
   null, 
   1073212380.0
  ], 
  [
   30011, 
   null, 
   "Tim", 
   "\n The right to self defense is considered by most people to be a natural one. And given the choice, many would choose to protect themselves with a firearm\n\n In Morton Grove, Illinois the town leaders passed a law which required everybody to turn in their handguns to the police station. A federal appeals court upheld the law as being constitutional and said that it didn't violate the 2nd, 9th, or 14th amendments. The court rejected the argument that the 9th amendment protects a right defend yourself with a firearm. \n \n \"Appellants argue that, although the right to use commonly-owned arms for self-defense is not explicitly listed in the Bill of Rights, it is a fundamental right protected by the ninth amendment....Since appellants do not cite, and our research has not revealed, any Supreme Court case holding that any specific right is protected by the ninth amendment, appellants' argument has no legal significance. Appellants may believe the ninth amendment should be read to recognize an unwritten, fundamental, individual right to own or possess firearms; the fact remains that the Supreme Court has never embraced this theory.\"\n Quilici v. Village of Morton Grove, 695 F.2d 261 (7th Cir. 1982) \n http://www.healylaw.com/cases/quilici.htm", 
   {}, 
   29883, 
   null, 
   1073218860.0
  ], 
  [
   30017, 
   null, 
   "kelvin90701", 
   "What? Is this ancient Greece or something? In ancient Greece, once a law was passed, everyone had to agree to it. However, here in the US, laws can be changed. \n \n \n \n I'm thinking it was montalban who said that you intimidate people by carrying your gun into McDonalds. But although that right is not specifically mentioned in the Constitution (and neither is the absolute right to bear arms or the absolute right of anything), it is a right that must be considered. In fact, your favorite document (when you think it helps you), the Constitution of the United States of America, states in Amendment 9, \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\" That means that although the right to not be intimidated is not specifically mentioned in the Constitution, it is a right of the people. And your idea, \"well if it isn't in the Bill of Rights, then it isn't a right,\" is exactly what the Federalist leaders feared in having a Bill of Rights. Yes, that's right, your favorite people, the authors of the Federalist Papers, those American heros, Madison, Hamilton, and Jay, did not want a Bill of Rights because they feared exactly what you have been saying. But you know what, I don't know why I'm telling you all this, because obviously, unlike that imperialistic, annoying, Australian, you know everything there is to know about the Constitution and its radification debates.\n \n Speaking of montalban, your criticism of him being so imperialistic could be one of the most rediculous things I've ever heard. Are you aware that the US currently has troops in Afgahnistan, Iraq, and Korea, among other places. And no war has been declared in any of those places.\n \n But despite what you have implied from my posts even though I have corrected you several times, I am not necessarily against you having a gun in McDonalds. There should be gun control, because as in all parts of life, there must be a balance. You can't have your absolute rights. That's been my whole point. Now, I don't want you to have your gun, I don't want anyone to have his or her gun. But I don't think the solution is a complete gun ban because that would just add to your and other people's unfounded fears and suspicions. Those fears and suspicions are the problem in America, and guns are just a manifestation of that problem. I'm not sure what the solution to this is yet, but I know that a complete gun ban isn't it. We can't just take people's guns away completely, we have to make people not feel that they need a gun. And judging from kelvin's comments, that could take awhile.\n\n \n You are already working your way towards a gun ban. Just admit it. That is the same doctrine by Brady, HCI, and MMM. Say you want gun control, but in reality work towards a gun ban.\n \n You still can not name the right I infringe upon, because IT DOES NOT EXIST. If people are intimidated, that is too bad. In a democracy if someone lawfully exersing their rights are found to be distasteful, then it is the citizens duty to TOLLERATE it. The balnace is someone who thinks their rights are violated and someone who is exercsing a valid right. \n \n My fears are quite founded. In 6 years, I have had to draw my pistol twice to defend myself. \n \n US imperialism is not debatable. It exists. The same for the Aussie. I am judged by the Aussie according the his notions of law and democracy. His notions of proper and lawful behavior are being applied to me. Notions that are founded in a country were gun owership is criminalized. That is why his imperialism sickens me.", 
   {}, 
   30003, 
   null, 
   1073240100.0
  ], 
  [
   30018, 
   null, 
   "kelvin90701", 
   "What has this got to do with you arming yourself for your own personal protection? How are you protecting your State's rights by carrying a gun into McDonald's? (are you expecting an anti-American uprising during McBreakfast?)\n \n Construct an argument, or retire. There's a notion called 'context' you need to be aware of.\n \n \n \n \n Hurrah. This only took 3 months.\n \n How do you have a 'natural right' to carry a gun? Where do you deem that this notion exists? (or did you just make it up). And don't be vague, (again!) use a reference unless you are just stating your opinion.\n\n \n The natural right argument is moot. I do not need the natural right to carry a gun or own firearms do I? I already have the right to do so and that is not debatable.\n \n Retire? Say \"please\" and maybe I'll consider it. Hmmm, no. Just like a typical anti-gun freak, always giving orders to people you want to control.", 
   {}, 
   29970, 
   null, 
   1073240280.0
  ], 
  [
   30030, 
   null, 
   "montalban", 
   "The natural right argument is moot. I do not need the natural right to carry a gun or own firearms do I? I already have the right to do so and that is not debatable.\n \n Retire? Say \"please\" and maybe I'll consider it. Hmmm, no. Just like a typical anti-gun freak, always giving orders to people you want to control.\n\n \n The good thing about debating you is that you offer no rational reasons for your cause, thus damaging it constantly. The ol' saying 'with friends like you...' is something most pro-gunners will direct towards you.\n \n Take this latest effort... you have 'natural rights' because you 'have' natural rights. That is the crux of your argument.\n \n How did you come by this right? Where is its source?\n \n Tell me about those Federalist Papers? Which ones support your cause?\n The \"Evidence-Lite\" approach to debating whilst novel, is not helping you. You are demonstrating a patent lack of knowledge into which you wish to debate.\n \n How come you didn't call me an 'imperialist' again? You haven't come up with a new jingo.\n \n Please provide some evidentiary argument.", 
   {}, 
   30018, 
   null, 
   1073257320.0
  ], 
  [
   30081, 
   null, 
   "kelvin90701", 
   "The good thing about debating you is that you offer no rational reasons for your cause, thus damaging it constantly. The ol' saying 'with friends like you...' is something most pro-gunners will direct towards you.\n \n Take this latest effort... you have 'natural rights' because you 'have' natural rights. That is the crux of your argument.\n \n How did you come by this right? Where is its source?\n \n Tell me about those Federalist Papers? Which ones support your cause?\n The \"Evidence-Lite\" approach to debating whilst novel, is not helping you. You are demonstrating a patent lack of knowledge into which you wish to debate.\n \n How come you didn't call me an 'imperialist' again? You haven't come up with a new jingo.\n \n Please provide some evidentiary argument.\n\n \n I don't need the natural right to carry a gun. You wish I didn't. Isn't that imperialist of you? You judge my actions to be wrong and illegal. Not by US laws and notions of democracy and freedom, but by yours, a forgeiner. Isn't that imperialist. You sicken me.\n \n The Federalist? Do you agree with post#108 written by Montaban:\n \n \"so I'll put you out of your misery.\n \n One of the Federalist Papers \"Concerning the Militia\" by Hamilton deals with the militia being a safe-guard by the State. People were concerned that the militia might get out of hand. Hamilton wrote...\n \"There is something so far-fetched and so extravagant in the idea of danger to liberty from the militia...\"\n \n Your notions of the milita are \"far-fetched\" and extravagant\". Don't you agree with quote in post #108. Your own quote goes on to discuss trusting our sons and not fearing people who have the same interest in protecting feedom.\n \n To the other Americans here. Don't you believe too that the threat to democracy from the milita is \"far-fetched\". These lessons were learned from people who lived under tyranny and opression. Isn't that the lesson the Constitution, the Declearation of Independance, and the Federalist are trying to teach?\n \n To the forgeiners, you need to drop your hatred of American when dealing with INTERNAL and DOMESTIC matters within the US. Feel free to hate the USA regarding forgein matters. Passing judgement upon US domestic matters based upon your own forgein notions of culture, freedom, government, and democracy is imperialistic. Plus hating the USA for thier imperialism while practising imperialism yourself makes you what? A hypocrite?", 
   {}, 
   30030, 
   null, 
   1073278620.0
  ], 
  [
   30082, 
   null, 
   "montalban", 
   "I don't need the natural right to carry a gun. You wish I didn't. Isn't that imperialist of you? You judge my actions to be wrong and illegal. Not by US laws and notions of democracy and freedom, but by yours, a forgeiner (sic). Isn't that imperialist. You sicken me.\n \n\n \n im·pe·ri·al·ism n. \n 1. The policy of extending a nation's authority by territorial acquisition or by the establishment of economic and political hegemony over other nations. \n 2. The system, policies, or practices of such a government. \n http://dictionary.reference.com/search?q=imperialism\n \n \n One of the Federalist Papers \"Concerning the Militia\" by Hamilton deals with the militia being a safe-guard by the State. People were concerned that the militia might get out of hand. Hamilton wrote...\n \"There is something so far-fetched and so extravagant in the idea of danger to liberty from the militia...\"\n Your notions of the milita (sic) are \"far-fetched\" and extravagant\". Don't you agree with quote in post #108. Your own quote goes on to discuss trusting our sons and not fearing people who have the same interest in protecting feedom (sic).\n\n \n Indeed it says that. Nice re-edit, Kelvin. Shows how much you respect your source.\n \n Go a few more sentences to where it says\n \" What reasonable cause of apprehension can be inferred from a power in the Union to prescribe regulations for the militia, and to command its services when necessary, WHILE THE PARTICULAR STATES ARE TO HAVE THE SOLE AND EXCLUSIVE APPOINTMENT OF THE OFFICERS? If it were possible seriously to indulge a jealousy of the militia upon any conceivable establishment under the federal government, the circumstance of the officers being in the appointment of the States ought at once to extinguish it. There can be no doubt that this circumstance will always secure to them a preponderating influence over the militia. \"\n http://lcweb2.loc.gov/const/fed/fed_29.html\n \n So much for 'natural' rights. So long as the State has control, the militia will be fine.\n \n Hamilton above, believed the state was sufficient. Jay wrote in another Federalist Paper that \"one government\" should control the militia; \n \n \"One government can ...place the militia under one plan of discipline, and, by putting their officers in a proper line of subordination to the Chief Magistrate, will, as it were, consolidate them into one corps, and thereby render them more efficient than if divided into thirteen or into three or four distinct independent companies.\"\n http://federalistpapers.com/federalist4.html\n \n and he hints that means the national government\n \n \"What would the militia of Britain be if the English militia obeyed the government of England, if the Scotch militia obeyed the government of Scotland, and if the Welsh militia obeyed the government of Wales? Suppose an invasion; would those three governments (if they agreed at\n all) be able, with all their respective forces, to operate against the enemy so effectually as the single government of Great Britain would?\"\n Ibid.\n \n So tell me Kelvin, how does this give you the right to protect yourself from robbers? You believe that the government has no right to legislate against your 'natural' rights full stop. Both these Federalist Papers disagree with you on that account.\n \n All they say is you've a right to have a militia. But you're not about having a gun for the protection of the state, but for your own personal protection, and we've already dealt with that by showing you that court cases (such as those in the 1800s) ruled that the holding of a weapon in for such purposes was not covered by this article of the constitution - you do remember those posts Kelvin, the cases I gave to you, then you pretended that you'd never seen them so I sent them again :)\n \n \nTo the other Americans here. Don't you believe too that the threat to democracy from the milita (sic) is \"far-fetched\". These lessons were learned from people who lived under tyranny and opression (sic). Isn't that the lesson the Constitution, the Declearation (sic) of Independance (sic), and the Federalist are trying to teach? \n\n \n Who said that the militia is a threat to democracy? I haven't. I said owning a gun was a threat. And who else said that? Why, you did. One of our first posts in argument you said that you agreed with the notion that you weren't allowed to take a gun into court because that would intimidate the jury.\n \n But once again your whirlwind mind has spun around and moved on.\n \n \nTo the forgeiners (sic), you need to drop your hatred of American when dealing with INTERNAL and DOMESTIC matters within the US. Feel free to hate the USA regarding forgein (sic) matters. Passing judgement upon US domestic matters based upon your own forgein (sic) notions of culture, freedom, government, and democracy is imperialistic. Plus hating the USA for thier (sic) imperialism while practising imperialism yourself makes you what? A hypocrite?\n \n \n How do I 'practice' imperialism?\n \n \n I get a good laugh reading your posts. They are so surreal. Some of my friends are convinced you're on something. A few want to know what it is.", 
   {
    "unicode_changes_made": true
   }, 
   30018, 
   null, 
   1073280420.0
  ], 
  [
   30093, 
   null, 
   "Pie", 
   "In Morton Grove, Illinois the town leaders passed a law which required everybody to turn in their handguns to the police station. A federal appeals court upheld the law as being constitutional and said that it didn't violate the 2nd, 9th, or 14th amendments. The court rejected the argument that the 9th amendment protects a right defend yourself with a firearm. \n \n \"Appellants argue that, although the right to use commonly-owned arms for self-defense is not explicitly listed in the Bill of Rights, it is a fundamental right protected by the ninth amendment....Since appellants do not cite, and our research has not revealed, any Supreme Court case holding that any specific right is protected by the ninth amendment, appellants' argument has no legal significance. Appellants may believe the ninth amendment should be read to recognize an unwritten, fundamental, individual right to own or possess firearms; the fact remains that the Supreme Court has never embraced this theory.\"\n Quilici v. Village of Morton Grove, 695 F.2d 261 (7th Cir. 1982) \n http://www.healylaw.com/cases/quilici.htm\n\n \n \n Good for them. What was your point?", 
   {}, 
   30011, 
   null, 
   1073292660.0
  ], 
  [
   30097, 
   null, 
   "montalban", 
   "Good for them. What was your point?\n\n \n Even li'l 'ol me can see that.\n It's one of your 'self-evident' truths... that when it comes to the end of the day, your legislators can take your guns from you - that the 2nd Amendment is not absolute, and that it has nothing to do with personal defence.", 
   {}, 
   30093, 
   null, 
   1073298420.0
  ], 
  [
   30099, 
   null, 
   "kelvin90701", 
   "im·pe·ri·al·ism n. \n 1. The policy of extending a nation's authority by territorial acquisition or by the establishment of economic and political hegemony over other nations. \n 2. The system, policies, or practices of such a government. \n http://dictionary.reference.com/search?q=imperialism\n \n \n \n Indeed it says that. Nice re-edit, Kelvin. Shows how much you respect your source.\n \n Go a few more sentences to where it says\n \" What reasonable cause of apprehension can be inferred from a power in the Union to prescribe regulations for the militia, and to command its services when necessary, WHILE THE PARTICULAR STATES ARE TO HAVE THE SOLE AND EXCLUSIVE APPOINTMENT OF THE OFFICERS? If it were possible seriously to indulge a jealousy of the militia upon any conceivable establishment under the federal government, the circumstance of the officers being in the appointment of the States ought at once to extinguish it. There can be no doubt that this circumstance will always secure to them a preponderating influence over the militia. \"\n http://lcweb2.loc.gov/const/fed/fed_29.html\n \n So much for 'natural' rights. So long as the State has control, the militia will be fine.\n \n Hamilton above, believed the state was sufficient. Jay wrote in another Federalist Paper that \"one government\" should control the militia; \n \n \"One government can ...place the militia under one plan of discipline, and, by putting their officers in a proper line of subordination to the Chief Magistrate, will, as it were, consolidate them into one corps, and thereby render them more efficient than if divided into thirteen or into three or four distinct independent companies.\"\n http://federalistpapers.com/federalist4.html\n \n and he hints that means the national government\n \n \"What would the militia of Britain be if the English militia obeyed the government of England, if the Scotch militia obeyed the government of Scotland, and if the Welsh militia obeyed the government of Wales? Suppose an invasion; would those three governments (if they agreed at\n all) be able, with all their respective forces, to operate against the enemy so effectually as the single government of Great Britain would?\"\n Ibid.\n \n So tell me Kelvin, how does this give you the right to protect yourself from robbers? You believe that the government has no right to legislate against your 'natural' rights full stop. Both these Federalist Papers disagree with you on that account.\n \n All they say is you've a right to have a militia. But you're not about having a gun for the protection of the state, but for your own personal protection, and we've already dealt with that by showing you that court cases (such as those in the 1800s) ruled that the holding of a weapon in for such purposes was not covered by this article of the constitution - you do remember those posts Kelvin, the cases I gave to you, then you pretended that you'd never seen them so I sent them again :)\n \n \n \n Who said that the militia is a threat to democracy? I haven't. I said owning a gun was a threat. And who else said that? Why, you did. One of our first posts in argument you said that you agreed with the notion that you weren't allowed to take a gun into court because that would intimidate the jury.\n \n But once again your whirlwind mind has spun around and moved on. \n \n \n How do I 'practice' imperialism?\n \n \n I get a good laugh reading your posts. They are so surreal. Some of my friends are convinced you're on something. A few want to know what it is.\n\n \n Sorry you do not have judicial holding on yourside. All you have is judicial opinion. That does not make case law. I have law on my side allowing me to use as much leathal force in type and quantity I want in response to leathal force. Which is natural. It does not make sesne to an imperialist based on the prejudice of your own cultural system, government, and laws. The same way the natives in Australia culture and traditions do not make sense to imperialist settlers. US Anglo law is also based on what is practiced by tradition. You don't have those traditions common the the USA. You judge me by your system of government and law. \n \n Your an imperialist. You want me to live like you. The little brown brother attitude typical of imperialistm. Where you know what is good for me.\n \n Natural rights? I don't need the natural right. Regardless of rights, I have the ability to carry and own fireamrs. That is when makes you mad. That I defile your system of notions and ideas. Which does not belong in the USA. You sicken me with your attempt to export your ideas where they are not wanted.\n \n You arguement starts with position that danger to liberty is far-fetched. Then the arguemnt continues from there. Regardless of natural rights, I'm going to strap my .45 on right now. Thank you very much.", 
   {
    "unicode_changes_made": true
   }, 
   30082, 
   null, 
   1073317380.0
  ], 
  [
   30158, 
   null, 
   "Dan the White", 
   "You are already working your way towards a gun ban. Just admit it. That is the same doctrine by Brady, HCI, and MMM. Say you want gun control, but in reality work towards a gun ban.\n\n \n Wow, strong arguement. You just proved my point of the problem of no trust in America.\n \n \nYou still can not name the right I infringe upon, because IT DOES NOT EXIST. If people are intimidated, that is too bad. In a democracy if someone lawfully exersing their rights are found to be distasteful, then it is the citizens duty to TOLLERATE it. The balnace is someone who thinks their rights are violated and someone who is exercsing a valid right.\n\n \n What is officially a right? A valid right? On what do you base these rights? Did you even read my previous post? Did you even read the part about Amendment 9? Do you realize that all of those people who you keep quoting from the Federalist Papers were actually against a bill of rights?\n \n \nMy fears are quite founded. In 6 years, I have had to draw my pistol twice to defend myself.\n\n \n Testimonials aren't very strong arguements.\n \n \nUS imperialism is not debatable. It exists. The same for the Aussie. I am judged by the Aussie according the his notions of law and democracy. His notions of proper and lawful behavior are being applied to me. Notions that are founded in a country were gun owership is criminalized. That is why his imperialism sickens me.\n\n \n So should we have judged Hitler? Should we have attacked him? Let's say Germany did not declare war on the US. Let's say Germany did not declare war on any country. But let's say that Hitler still did order the slaughter of millions of Jews, homosexuals, and other minorities. Should the US have attacked? Should the US have done anything about it? Not according to you. THat would be sickening imperialism. That would be imposing US \"notions of proper and lawful behavior\" on the Germans and as we all know that is just sick and wrong. All of those people who wanted to stop the slaughter of millions of Jews in Germany were just imperialistic JERKS!!!!!!!!!\n \n You know what though, I actually agree with montalban. Isn't that funny, since I live in the US? Since I don't have his notions of proper and lawful behavior? Maybe you should stick to actually debating his arguements, especially since he has been using US history and documents to make his points.", 
   {}, 
   30017, 
   null, 
   1073340300.0
  ], 
  [
   30210, 
   null, 
   "montalban", 
   "Sorry you do not have judicial holding on yourside (sic). All you have is judicial opinion. That does not make case law. \n\n \n That does make for case law. The opinions I cited were opinion, and the decisions from those courts stemmed from that opinion. That what judges do. They give an opinion in a case, and when they're the only judge that opinion is the ruling, or when they're the majority of opinion, it's the ruling. The court cases I cited were rulings that said your side is wrong.\n \n \nI have law on my side allowing me to use as much leathal (sic) force in type and quantity I want in response to leathal (sic) force. Which is natural. It does not make sesne (sic) to an imperialist based on the prejudice of your own cultural system, government, and laws. The same way the natives in Australia (sic) culture and traditions do not make sense to imperialist settlers. \n\n \n Defending yourself is a thing protected by law. Carrying guns for such purposes is not. Are you arguing it's a natural right? I think not, because a few paragraphs on, you'll switch argument again.\n \n \nUS Anglo law is also based on what is practiced by tradition. You don't have those traditions common the (sic) the USA. \n\n \n What a nonsense. Australian law is based on common law; ie. precedent, the same as the USA. When you make laughable statements like this it only highlights how little you know. Even though you are a different jurisdiction from Britain, there is such a commonality in principles, that a ruling in a UK court can have persuasive influence over a US court's decision.\n \n \nYou judge me by your system of government and law. \n\n \n Do I? So all those cases showing that you aren't supposed to keep guns are just made up?\n \n \nYour (sic) an imperialist. You want me to live like you. The little brown brother attitude typical of imperialistm (sic). Where you know what is good for me. \n\n \n I'm glad you've returned to using this jingoistic term again Kelvin.\n \n \nNatural rights? I don't need the natural right. \n\n \n Funny guy! You've changed yet again - now you don't rely on them! Even in the space of the same post (see above when you talk about a natural right to defend yourself)\n \n \nRegardless of rights, I have the ability to carry and own firearms (sic). That is when makes you mad. That I defile your system of notions and ideas. Which does not belong in the USA. You sicken me with your attempt to export your ideas where they are not wanted. \n\n \n This doesn't make sense. You have the 'ability' but not the right?\n \n \nYou arguement (sic) starts with position that danger to liberty is far-fetched. Then the arguemnt (sic) continues from there. Regardless of natural rights, I'm going to strap my .45 on right now. Thank you very much.\n \n \n No, my argument starts with the notion that your thinking is misplaced because you believe in 'natural rights' one moment, then 'legislative rights' the next, but in any case you have no right to carry a gun with you for personal protection as based on either right. At least you certainly don't present a logical reason for thinking that you do.\n \n I could easily concede that you have a legislative right if you could provide convincing evidence, but your argument is the 'evidence-lite' type. It is 'opinion-rich' but that doesn't count, especially when you keep switching.", 
   {
    "unicode_changes_made": true
   }, 
   30099, 
   null, 
   1073357820.0
  ], 
  [
   30259, 
   null, 
   "voiceofreason", 
   "The natural right argument is moot. I do not need the natural right to carry a gun or own firearms do I? I already have the right to do so and that is not debatable.\n\n So basically you're saying that it's my right because it's my right. It is because it is. Sounds like circular logic to me.", 
   {}, 
   30018, 
   null, 
   1073394960.0
  ], 
  [
   30261, 
   null, 
   "voiceofreason", 
   "That does make for case law. The opinions I cited were opinion, and the decisions from those courts stemmed from that opinion. That what judges do. They give an opinion in a case, and when they&#8217;re the only judge that opinion is the ruling, or when they&#8217;re the majority of opinion, it&#8217;s the ruling. The court cases I cited were rulings that said your side is wrong.\n\n As for case law- read this article reprinted from the Boston University Law Review. \"We must label the gun lobby's view that the Second Amendment guarantees a nearly unlimited right to bear arms for what it is- a fabrication. [Page 68]...That expansive Second Amendment story is also a fabrication because it is not the law of the land....federal courts have invariably ruled that the Second Amendment right to bear arms applies only to those individuals using firearms in connection with their service in an organized state militia. An extraordinarily consistent body of case law has held that a variety of restrictions on private firearms ownership, use, and sales do not violate the Second Amendment,....As former Solicitor General Erwin Griswold once wrote: '[T]hat the Second Amendment poses no barrier to strong gun laws is perhaps the most well-settled proposition in American Constitutional law.' \"\n http://www.saf.org/LawReviews/Herz1.html\n \n So as far as case law goes, there is no debate. Gun-control does not offend the second amendment.", 
   {}, 
   30210, 
   null, 
   1073396220.0
  ], 
  [
   30364, 
   null, 
   "montalban", 
   "You arguement (sic) starts with position that danger to liberty is far-fetched. Then the arguemnt (sic) continues from there. Regardless of natural rights, I'm going to strap my .45 on right now. Thank you very much.\n\n \n Sorry, I missed this howler. You have some kind of gun-obsession that every time I 'shoot' your argument down in flames you touch your gun. You have now mentioned about 4 times this predilection to holding it. It compensates for something missing in your life.", 
   {}, 
   30099, 
   null, 
   1073442360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  2nd Amendment/NoDebate", 
  "url": "http://www.4forums.com/political/gun-control-debates/1205-2nd-amendment-nodebate.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1205, 
  "discussion_files": [
   [
    "31127.html", 
    "http://www.4forums.com/political/gun-control-debates/1205-2nd-amendment-nodebate-print.html"
   ], 
   [
    "31128.html", 
    "http://www.4forums.com/political/gun-control-debates/1205-2nd-amendment-nodebate-9-print.html"
   ], 
   [
    "31129.html", 
    "http://www.4forums.com/political/gun-control-debates/1205-2nd-amendment-nodebate-7-print.html"
   ], 
   [
    "31130.html", 
    "http://www.4forums.com/political/gun-control-debates/1205-2nd-amendment-nodebate-5-print.html"
   ], 
   [
    "31131.html", 
    "http://www.4forums.com/political/gun-control-debates/1205-2nd-amendment-nodebate-4-print.html"
   ], 
   [
    "31132.html", 
    "http://www.4forums.com/political/gun-control-debates/1205-2nd-amendment-nodebate-6-print.html"
   ], 
   [
    "31133.html", 
    "http://www.4forums.com/political/gun-control-debates/1205-2nd-amendment-nodebate-8-print.html"
   ], 
   [
    "31134.html", 
    "http://www.4forums.com/political/gun-control-debates/1205-2nd-amendment-nodebate-3-print.html"
   ], 
   [
    "31135.html", 
    "http://www.4forums.com/political/gun-control-debates/1205-2nd-amendment-nodebate-2-print.html"
   ]
  ], 
  "identifier": 1205
 }
]