[
 [
  [
   336208, 
   null, 
   "Falsefaith", 
   "\"Religion is far more of a choice than homosexuality... Gay people don't choose to be gay. At what age did you choose not to be gay?\" -- Jon Stewart, interviewing Gov. Mike Huckabee on \"The Daily Show\" emoticon_xchicken\n \n I'm interested to read your thoughts. (I love Jon Stewart! emoticon_xagree)\n \n Watch the interview here:\n \n Mike Huckabee Pt. 2 | The Daily Show | Comedy Central", 
   {
    "post_info": {
     "post_title": "Religion is far more of a choice than homosexuality..."
    }
   }, 
   null, 
   null, 
   1228966020.0
  ], 
  [
   336216, 
   null, 
   "jitobear", 
   "This is a no-brainer. Jon Stewart does rule.", 
   {}, 
   336208, 
   null, 
   1228972440.0
  ], 
  [
   336236, 
   null, 
   "Winston Smith", 
   "to believe or not to believe in God is not a choice for most people.", 
   {}, 
   336216, 
   null, 
   1228988220.0
  ], 
  [
   336278, 
   null, 
   "unkerpaulie", 
   "Nobody argued that religion wasn't a choice. Even among the religious, and in the bible itself, it says that people choose God or not. \n \n However, just because somebody can't answer the Jon Stewart question, that doesn't prove that people are born gay.", 
   {}, 
   336236, 
   null, 
   1229024700.0
  ], 
  [
   336284, 
   null, 
   "jyoshu", 
   "Nobody argued that religion wasn't a choice. Even among the religious, and in the bible itself, it says that people choose God or not. \n \n However, just because somebody can't answer the Jon Stewart question, that doesn't prove that people are born gay.\n\n \n Bingo.\n \n It was obviously a set-up--leading questions and all. I really don't know why any conservative would go on his show, the way he tries make them look bad, and with the biased crowd and all. Huckabee showed enormous respect and restraint here (as usual), I thought. Stewart owes him a visit onto his show; but he'll be better treated.", 
   {}, 
   336278, 
   null, 
   1229026620.0
  ], 
  [
   336285, 
   null, 
   "sinjin", 
   "to believe or not to believe in God is not a choice for most people.\nI think to not believe in God is a choice. Certainly for me it was and I suspect for most atheists raised in the US.", 
   {}, 
   336236, 
   null, 
   1229026920.0
  ], 
  [
   336310, 
   null, 
   "lesz", 
   "to believe or not to believe in God is not a choice for most people.\n\n \n You are probably right, here. Most people don't think deeply enough about their religion to make a real choice. They just go along with the choices made for them by accident of birth.\n \n However, there are an abundance of examples of conversion from one religion to another. It's not common, but it isn't exactly unheard of. There are no scientifically documented cases of a true change in sexual orientation.\n \n It is even possible that some people have a deep need to believe, built in by biology. Others of us are more fortunate. What we believe is not nearly as often chosen. People tend to stick with what they learned as children.", 
   {}, 
   336236, 
   null, 
   1229039280.0
  ], 
  [
   336311, 
   null, 
   "lesz", 
   "I think to not believe in God is a choice. Certainly for me it was and I suspect for most atheists raised in the US.\n\n \n I wouldn't argue that religious belief can never be a choice -- there are clearly examples when it is. The same is simply not true of sexual orientation.\n \n Still, I think that religion is so deeply ingrained in most people, it is extraordinarily hard to make a choice against the religion you were brought up with, which is why a conversion experience can be traumatic. I fought against my conversion to atheism tooth and nail, but eventually I was overcome. When we are heavily invested in some belief system, we do not always choose freely what to believe about it. We reach some crisis, and tumble one way or the orther.\n \n If beliefs are not so tightly held, then there seems to be more of a choice about it, to the extent that anyone has a free hoice about what to believe. I am not a subscriber to the theory of free will myself. However, some choices just seem easier to make than others. And some seem to be completely uncontrolled, and hence no free choice at all.", 
   {}, 
   336285, 
   null, 
   1229039700.0
  ], 
  [
   336339, 
   null, 
   "GOPER", 
   "Wow, so I was born to be straight, black, and a criminal. This is why we black males can't help ourselves when it comes to committing crimes? We are born this way just as homosexuals are born to be homosexuals? \n Thank you for clearing that up for me!\n \n emoticon_xkillIt's my Right!emoticon_xkill", 
   {
    "post_info": {
     "post_title": "Wow, not my choice!"
    }
   }, 
   336311, 
   null, 
   1229056440.0
  ], 
  [
   336347, 
   null, 
   "foundit66", 
   "Bingo.\n It was obviously a set-up--leading questions and all. I really don't know why any conservative would go on his show, the way he tries make them look bad, and with the biased crowd and all. Huckabee showed enormous respect and restraint here (as usual), I thought. Stewart owes him a visit onto his show; but he'll be better treated.\n\n Stuart typically doesn't treat people badly, unless their position is just indefensible then Stuart simply states what everybody else is thinking in the first place.\n \n Huckabee puts out his ridiculous responses that are reminiscent of some of the stuff said on this board.\n Marriage IS NOT ABOUT \"procreation\". There IS NO requirement for procreative capability in marriage.\n \n Voters put \"miscegenation laws\" into most states as well. Doesn't make it right. Appealing to the populace vote is hardly justification.\n \n Stuart's points on polygamy were right on. People keep treating this issue like they have some magical bedrock of \"marriage\" whereby the standard is and has been a certain way, and just shouldn't change essentially because some people don't want change.\n \n I think what you're really picking up on is Huckabee's weak performance.\n When challenged, anti-gay and anti-gay marriage posters usually DO perform weak, cause ultimately their position relies on \"somebody told me to think this way\" and then there is a lot of scrabbling to conjure up excuses for why it should be rational to think that way.\n \n That's a difference between reason and religion. Reason doesn't start from \"somebody told me to think a certain way, ergo I gotta justify ...\" emoticon_rolleyes", 
   {}, 
   336284, 
   null, 
   1229061300.0
  ], 
  [
   336398, 
   null, 
   "jitobear", 
   "Wow, so I was born to be straight, black, and a criminal. This is why we black males can't help ourselves when it comes to committing crimes? We are born this way just as homosexuals are born to be homosexuals? \n Thank you for clearing that up for me!\n \n emoticon_xkillIt's my Right!emoticon_xkill\n\n \n Well, you are 2/3 right. If you are a straight black man, you were born that way. However, if you are a criminal - that was choice - and a damned poor one.", 
   {}, 
   336339, 
   null, 
   1229110680.0
  ], 
  [
   336402, 
   null, 
   "GOPER", 
   "Well, you are 2/3 right. If you are a straight black man, you were born that way. However, if you are a criminal - that was choice - and a damned poor one.\n\n \n Thank you, you help make my point \"choices\"emoticon_xgood\n \n I CHOOSE NOT to be a criminal. I CHOOSE NOT to be a homosexual. I DID NOT CHOOSE to be black.", 
   {
    "post_info": {
     "post_title": "poor one"
    }
   }, 
   336398, 
   null, 
   1229113080.0
  ], 
  [
   336405, 
   null, 
   "smiley", 
   "Thank you, you help make my point \"choices\"emoticon_xgood\n \n I CHOOSE NOT to be a criminal. I CHOOSE NOT to be a homosexual. I DID NOT CHOOSE to be black.\n\n Still only 2 out of 3. You do not choose not to be homosexual.", 
   {}, 
   336402, 
   null, 
   1229114280.0
  ], 
  [
   336408, 
   null, 
   "lesz", 
   "Thank you, you help make my point \"choices\"emoticon_xgood\n \n I CHOOSE NOT to be a criminal. I CHOOSE NOT to be a homosexual. I DID NOT CHOOSE to be black.\n\n \n And I choose not to be a bigot, though I can't choose not to be be gay. You have the same choice, or lack of it.", 
   {}, 
   336402, 
   null, 
   1229115720.0
  ], 
  [
   336420, 
   null, 
   "GOPER", 
   "Still only 2 out of 3. You do not choose not to be homosexual.\n\n \n Well well, the next time you see a black male in the news that committed a crime, understand he was born that way. Homosexuals should come out in protest for his right to be what he is, a criminal. He had no choice in what he is.emoticon_xgood 3 out of 3 emoticon_xgood\n \n Thats what we are talking about right Not a Choice?", 
   {
    "post_info": {
     "post_title": "Not a Choice"
    }
   }, 
   336405, 
   null, 
   1229118960.0
  ], 
  [
   336422, 
   null, 
   "jyoshu", 
   "I think what you're really picking up on is Huckabee's weak performance.\n\n \n Au contraire, his \"performance\" showed impressive self-restraint. I think what you're not picking up on is that he probably wasn't out to \"perform\" to begin with. He was going on the show to answer questions. Believe it or not, sometimes people dialogue to dialogue, Foundit. Look, Stuart is just asking to get his nose broken or something one of these days by someone who's not as willing to put up with that junk. It's just a matter of time with huis approach and the way his audience treats them. Again, I don't know why any conservative gives him the time of day.", 
   {}, 
   336347, 
   null, 
   1229119500.0
  ], 
  [
   336439, 
   null, 
   "foundit66", 
   "Au contraire, his \"performance\" showed impressive self-restraint.\n\n I would say that of Stewart. emoticon_rolleyes\n \n \n \nI think what you're not picking up on is that he probably wasn't out to \"perform\" to begin with.\n\n Yeah.\n A POLITICIAN went on a syndicated talk show, and he wasn't looking to \"perform\"... emoticon_rolleyes\n \n \n \nHe was going on the show to answer questions. Believe it or not, sometimes people dialogue to dialogue, Foundit. Look, Stuart is just asking to get his nose broken or something one of these days by someone who's not as willing to put up with that junk.\n\n ROFLMAO!\n You keep demonstrating extreme melodrama in how you can't take an HONEST RESPONSE to the ideals that others espouse.\n Stewart did nothing to justify violence.\n \n In fact, I think you should look within yourself for why you keep responding with violent thoughts to other people. Not once have I had any fantasy about bodily injury to you.\n But I keep seeing you toss it out there repeatedly...\n Says something, don't you think?\n \n \n \nIt's just a matter of time with huis approach and the way his audience treats them. Again, I don't know why any conservative gives him the time of day.\n\n Yes. I imagine a lot of conservatives would prefer to just play to their own audience cause they are not willing or able to engage in intellectual dialogue without fantasies of violence or predilections to complain about \"being insulted\"...\n \n Quite frankly, I look at people like Bill O'Reilly and his \"CUT HIS MIC\" style of discussion, or Ann Coulter and her obvious insults towards liberals.\n I look at people like Falwell and Robertson who seek political gain out of a tragedy like 9/11.\n I look at people who pray to God that certain supreme court members will leave SCOTUS based on an illness...\n \n But you look at Stewart, and think of somebody punching him... emoticon_rolleyes\n I don't think you realize just how much you expose about yourself. emoticon_cool", 
   {}, 
   336422, 
   null, 
   1229123220.0
  ], 
  [
   336440, 
   null, 
   "foundit66", 
   "Thank you, you help make my point \"choices\"emoticon_xgood\n I CHOOSE NOT to be a criminal. I CHOOSE NOT to be a homosexual. I DID NOT CHOOSE to be black.\n\n \n I am amazed at this sudden inrush of people who think they could \"choose\" to be gay if they wanted...\n Amazed, or there IS a probable reason for that which has been often played out on this message board and others... emoticon_ic", 
   {}, 
   336402, 
   null, 
   1229123340.0
  ], 
  [
   336442, 
   null, 
   "lesz", 
   "I am amazed at this sudden inrush of people who think they could \"choose\" to be gay if they wanted...\n Amazed, or there IS a probable reason for that which has been often played out on this message board and others... emoticon_ic\n\n \n They could \"choose\" to be gay the same way they could \"choose\" to be intelligent. However, they certainly could choose to stop trolling and race-baiting.", 
   {}, 
   336440, 
   null, 
   1229124000.0
  ], 
  [
   336448, 
   null, 
   "jyoshu", 
   "Quite frankly, I look at people like Bill O'Reilly and his \"CUT HIS MIC\" style of discussion, or Ann Coulter and her obvious insults towards liberals.\n\n \n What makes you think I don't think of Coulter the same way? I never said Coulter was any less biased than Stewart.\n \n But the fact that you're using Coulter and Stewart in the same context speaks VOLUMES, imo. emoticon_xangel \n \n I wouldn't put O'Reilly him in the same category as Coulter and Stewart.\n \n \nBut you look at Stewart, and think of somebody punching him... emoticon_rolleyes\n I don't think you realize just how much you expose about yourself. emoticon_cool\n\n \n hey, somebody had better, and warn Stewart as well! Not everyone is as restrained as Huckabee! Don't worry, I'd say the same about Coulter too, but then she doesn't bring in guests on a show to intentionally try to make them look foolish ...", 
   {}, 
   336439, 
   null, 
   1229125200.0
  ], 
  [
   336462, 
   null, 
   "foundit66", 
   "What makes you think I don't think of Coulter the same way? I never said Coulter was any less biased than Stewart.\n\n That sound everybody's hearing?\n Yup! Goal-posts being ripped up and moved...\n This wasn't about \"bias\". This was about you talking about Stewart and having his teeth no longer intact because of his tactics.\n \n \n \nBut the fact that you're using Coulter and Stewart in the same context speaks VOLUMES, imo. emoticon_xangel \n\n I only do it to show the differences in extremes.\n But instead of realizing the TRUE fundamental comparison going on, you BLOWI all over the place and pretend that there is significance in comparing Coulter and Stewart, like there is some pretense of similarity...\n \n \n \nI wouldn't put O'Reilly him in the same category as Coulter and Stewart.\n\n I wouldn't put Stewart in the same category as Coulter and O'Reilly, and I didn't.\n The point (which you are attempting to side-step), is that if anybody lacks civility or a cause to keep intact teeth (your standard), it's Coulter and O'Reilly.\n \n \n \nhey, somebody had better, and warn Stewart as well! Not everyone is as restrained as Huckabee! Don't worry, I'd say the same about Coulter too, but then she doesn't bring in guests on a show to intentionally try to make them look foolish ...\n\n Stewart has been doing this for years.\n I imagine there are some extremists out there (like yourself) who can't handle intelligent conversation, but Stewart is doing just fine. He is under no threat of losing teeth.\n That isn't the normal approach to civilized conversation, even when it gets heated.\n \n And Coulter has a show?\n And she doesn't \"intentionally try to make people look foolish\"?\n I guess she's either smart enough or cowardly enough (probably both) to realize that somebody who thinks like you (on the other side of the fence) might do the \"teeth\" thing if she treats people in person like she does an entire group of people in her book.", 
   {}, 
   336448, 
   null, 
   1229128740.0
  ], 
  [
   336465, 
   null, 
   "jyoshu", 
   "Stewart has been doing this for years.\n\n \n Which ... is why I said I don't know why any conservative would go on his show. It's not like they don't know of his tactics long before now.\n \n At any rate, Stewart owes Huckabee a show visit.", 
   {}, 
   336462, 
   null, 
   1229129100.0
  ], 
  [
   336470, 
   null, 
   "foundit66", 
   "Which ... is why I said I don't know why any conservative would go on his show. It's not like they don't know of his tactics long before now.\n\n Oh yes.\n It is much safer for conservatives to just go on O'Reilly's show or interview with Fox News.\n Heaven forbid they ever be challenged on their views, cause they just may start thinking about knocking teeth loose instead of answering REAL questions with REAL answers ... emoticon_wow\n < end sarcasm <\n \n Huckabee has been on Stewart's show MULTIPLE times before. He'll be back.\n He isn't afraid to be challenged.\n \n Stewart's nowhere near as bad as you make him out to be.\n The extremists get annoyed with Stewart, but I think the main problem they have is NOT regarding a lack of civility, but rather cause he shines a light on the cockroaches and rust in the conservative thinking process.\n \n What did Stewart say that was ACTUALLY lacking in civility or warranting \"teeth\" loosening?\n \n \n \nAt any rate, Stewart owes Huckabee a show visit.\n\n Does Huckabee even have a show?", 
   {}, 
   336465, 
   null, 
   1229131620.0
  ], 
  [
   336492, 
   null, 
   "smiley", 
   "Well well, the next time you see a black male in the news that committed a crime, understand he was born that way. Homosexuals should come out in protest for his right to be what he is, a criminal. He had no choice in what he is.emoticon_xgood 3 out of 3 emoticon_xgood\n \n Thats what we are talking about right Not a Choice?\n\n Are you claiming that being born black makes you a criminal? Isn't that a bit racist?\n \n Anyway, looking at your previous statement . . .\n \n \nOriginally Posted by GOPER \n Thank you, you help make my point \"choices\"\n \n I CHOOSE NOT to be a criminal. I CHOOSE NOT to be a homosexual. I DID NOT CHOOSE to be black.\n\n You now claim that you cannot choose to be not a criminal (as you are born that way). You certainly can't choose your sexuality. So, it appears you are down to 1 out of 3.\n \n I suppose one cannot choose one's intellect either.", 
   {}, 
   336420, 
   null, 
   1229143080.0
  ], 
  [
   336507, 
   null, 
   "hollyh", 
   "I do not believe for a second sexual orientation is a choice. We are born with our own natural predispositions with sexual orientation amongst them. Any sexual orientation is as natural to each individual as our many other instincts, hunger, thirst, defense ...\n \n Imagine declaring hunger as a choice. And what of that in which we hunger for? we all have different taste buds that ensure our palettes are not exactly universal. We do not decide, for example, that peas makes us dry reach and yet they do, instinctual and without thought or choice for many of us.\n \n I see no heterosexuals walking around saying they \"chose\" their sexual orientation, because to me, and i am heterosexual, its just absurd. I did not think, debate, or absolve my sexuality, it was just in existence, as natural as any other orientation. \n \n But more importantly i wonder, why does it matter who one loves? it should only matter that they love. emoticon_xgood", 
   {}, 
   336492, 
   null, 
   1229155020.0
  ], 
  [
   336620, 
   null, 
   "Shooterandproud", 
   "Race, sexuality, gender, eye color, hair color, etc. are all things we are born with. To suggest otherwise is laughable.\n \n Tell me goper, at what age do you think I chose to be straight?", 
   {}, 
   336507, 
   null, 
   1229281440.0
  ], 
  [
   336909, 
   null, 
   "unkerpaulie", 
   "I am amazed at this sudden inrush of people who think they could \"choose\" to be gay if they wanted...\n Amazed, or there IS a probable reason for that which has been often played out on this message board and others... emoticon_ic\n\n There is an easy way to tell for sure if x is a choice or not (x being any trait, personality feature or tendency). \n \n Ask yourself \"why would I choose to be/do x?\" Or \"when did I choose to be/do x?\"\n \n If you can't asnwer the question, then you did not choose to be/do x, you were born that way.", 
   {}, 
   336440, 
   null, 
   1229448780.0
  ], 
  [
   337059, 
   null, 
   "SickDelirium", 
   "It's worth noting that attraction can be documented. There are physiological responses that people have when they see or interact with someone they find attractive. In discussions about whether a homosexual orientation is a choice (and I'm differentiating between behavior and orientation here), the biological component of attraction is often left out.\n \n These include increased pupil dilation, adrenaline, endorphines, heart rate and perspiration. Most people have these reactions with people of the opposite sex, but many also have these reactions when interacting with people of the same sex.", 
   {}, 
   336909, 
   null, 
   1229556060.0
  ], 
  [
   337064, 
   null, 
   "foundit66", 
   "It's worth noting that attraction can be documented. There are physiological responses that people have when they see or interact with someone they find attractive. In discussions about whether a homosexual orientation is a choice (and I'm differentiating between behavior and orientation here), the biological component of attraction is often left out.\n \n These include increased pupil dilation, adrenaline, endorphines, heart rate and perspiration. Most people have these reactions with people of the opposite sex, but many also have these reactions when interacting with people of the same sex.\n\n Excellent point!\n \n There is even a study which involved this type of \"physiological response\" as a demonstration of true sexual attraction.\n A University of Georgia study used a questionnaire to determine people's status according to a \"homophobia\" measuring system.\n They then showed these people heterosexual pornography, lesbian pornography, and gay male pornography.\n \n The \"straight\" males who were more homophobic showed a markedly higher level of sexual arousal to the \"gay male\" porn than did their straight counterparts who were not homophobic. This helped demonstrate a link between \"homophobia\" and \"latent homosexuality\".\n Latent homosexuality - Wikipedia, the free encyclopedia\n \n Furthermore, it should be obvious to most people that if being gay were NOT a choice, the \"straight\" people who were MORE homophobic would be LESS aroused, if they could \"choose\" what they were attracted to.", 
   {}, 
   337059, 
   null, 
   1229557440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Religion is far more of a choice than homosexuality...", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12083-religion-far-more-choice-than-homosexuality.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12083, 
  "discussion_files": [
   [
    "28762.html", 
    "http://www.4forums.com/political/gay-rights-debates/12083-religion-far-more-choice-than-homosexuality-print.html"
   ], 
   [
    "28763.html", 
    "http://www.4forums.com/political/gay-rights-debates/12083-religion-far-more-choice-than-homosexuality-2-print.html"
   ]
  ], 
  "identifier": 12083
 }
]