[
 [
  [
   336746, 
   null, 
   "simone", 
   "Handouts in the states of Alabama, South Carolina, Mississippi, Texas:\n \nHere are the deals that the state's gave to corporate America:\n \n South Carolina: BMW: $230 million\n \n Alabama: Mercedes-Benz:$258 million, 1993; Honda: $158 million, 1999; Honda: $90 million, 2002; Hyundai: $252 million, 2002 \n \n Mississippi: Nissan: $685 million, 2000 \n \n San Antonio, Texas: Toyota: $133 million, 2003. Toyota said it selected San Antonio over higher offers so that they could gain access to the large Texas market for the pickup trucks.\n\n Daily Kos: Damn those welfare queens.. (updated)", 
   {
    "post_info": {
     "post_title": "Corporate Welfare Queens"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1229359320.0
  ], 
  [
   336748, 
   null, 
   "Steeeeve", 
   "Aside from the important fact that there is no source, companies get incentives all the time to locate or expand a facility. Chances are they were not checks cut to the company but rather tax incentives. These are done for companies other than car manufacturers as well. Common ones are housing developments in redevelopment areas. \n \n It's not welfare, it is smart business for a state to generate revenue. \n \n emoticon_xgood", 
   {}, 
   336746, 
   null, 
   1229361240.0
  ], 
  [
   336752, 
   null, 
   "isly ilwott", 
   "Aside from the important fact that there is no source, companies get incentives all the time to locate or expand a facility. Chances are they were not checks cut to the company but rather tax incentives. These are done for companies other than car manufacturers as well. Common ones are housing developments in redevelopment areas. \n \n It's not welfare, it is smart business for a state to generate revenue. \n \n emoticon_xgood\n...or for a county or city to do the same. I remember my home town bidding against other small cities for the building of several manufacturing/agricultural plants. The lowering of taxes or the exclusion from being taxed at all for several years was a strong incentive for the companies to locate there. Despite the loss of revenue from those forgiven taxes, jobs were created, real estate markets rallied, new workers pumped money into the local economy and the overall state of the economy went up.", 
   {}, 
   336748, 
   null, 
   1229363760.0
  ], 
  [
   336885, 
   null, 
   "simone", 
   "Isn't it interesting, however, how anti-American these Southern Republican states are. \n \n They aren't willing to extend any comparable benefits to American companies.", 
   {}, 
   336752, 
   null, 
   1229428500.0
  ], 
  [
   336958, 
   null, 
   "Steeeeve", 
   "Isn't it interesting, however, how anti-American these Southern Republican states are. \n \n They aren't willing to extend any comparable benefits to American companies.\n\n \n This would be true but for one thing...it isn't. \n \n American companies get the same benefits. In my state, Motorola did as one example but I could go on.", 
   {}, 
   336885, 
   null, 
   1229464140.0
  ], 
  [
   336969, 
   null, 
   "snakespit", 
   "Isn't it interesting, however, how anti-American these Southern Republican states are. \n \n They aren't willing to extend any comparable benefits to American companies.\n\n Yeah, very interesting that these \"anti-American\" states don't want to extend money and benefits to companies who cannot turn a profit. Go figure.", 
   {}, 
   336885, 
   null, 
   1229470740.0
  ], 
  [
   337013, 
   null, 
   "obvious_child", 
   "\n It's not welfare, it is smart business for a state to generate revenue. \n \n emoticon_xgood\n\n \n Maybe in the short run. Dell in Oregon effectively pulled the scam where it milked the local governments for millions and then packed up shop, fired everyone and left immediately after their tax incentives stopped. If you're really hurting for jobs it's not a bad idea, but it's a poor method of building a reliable economic base, especially for industries that can go anywhere and have few to no ties with the region.", 
   {}, 
   336748, 
   null, 
   1229507040.0
  ], 
  [
   337014, 
   null, 
   "obvious_child", 
   "Handouts in the states of Alabama, South Carolina, Mississippi, Texas:\n \n Daily Kos: Damn those welfare queens.. (updated)\n\n \n That's not welfare. \n \n Welfare would be cutting a hundred million dollar check to ADM for doing what it was going to do anyways. \n \n Welfare would be cutting a hundred million dollar check to ExxonMobile for merely existing. \n \n Those actually happen, well, not necessarily in those amounts, but that's corporate welfare.", 
   {}, 
   336746, 
   null, 
   1229507160.0
  ], 
  [
   337016, 
   null, 
   "Archangel", 
   "Isn't it interesting, however, how anti-American these Southern Republican states are. \n\n \n At least simone is being perfectly consistent by spreading the liberal talking points and propaganda whole cloth in order to attempt to both demonize the republicans, and guilt them into supporting a bailout without requiring the big 3 to make any real concessions, or to refine their business plan which is destined to lose billions more if it remains as it is. \n \n \nThey aren't willing to extend any comparable benefits to American companies.\n\n \n Tell us simone, what is comparable about giving tax incentives of hundreds of MILLIONS of dollars to profitable companies which benefit the communities they move to, and giving corporate welfare of BILLIONS of dollars to companies which haven't turned a profit in years? The question you must ask yourself is how much is enough for companies that can't sell their products and who are we really bailing out here; the big three or the UAW?\n \n If this bailout is just to prevent massive layoffs with no plan for actually improving american auto sales, then the initial 15 billion is like burning that money in a bon fire for all the good it will do. We will just be delaying the inevitable collapse rather than actually fixing the problem. And strangely enough, the republicans want to actually fix the problem, unlike the dems who just want to feed the monster and keep it alive.", 
   {}, 
   336885, 
   null, 
   1229523600.0
  ], 
  [
   337020, 
   null, 
   "Steeeeve", 
   "Maybe in the short run. Dell in Oregon effectively pulled the scam where it milked the local governments for millions and then packed up shop, fired everyone and left immediately after their tax incentives stopped. If you're really hurting for jobs it's not a bad idea, but it's a poor method of building a reliable economic base, especially for industries that can go anywhere and have few to no ties with the region.\n\n \n I assume you mean the call center in 2007. Dell was struggling then as this was the start of our recession so the close was probably a combination of that, a lawsuit (which Dell denies), and overall strategy. They stopped getting a tax abatement in 2005 from what I read which means they went two years before they backed out.\n \n This is not really a scam and in many states it has worked great to attract business.", 
   {}, 
   337013, 
   null, 
   1229531820.0
  ], 
  [
   337079, 
   null, 
   "obvious_child", 
   "I assume you mean the call center in 2007. Dell was struggling then as this was the start of our recession so the close was probably a combination of that, a lawsuit (which Dell denies), and overall strategy. They stopped getting a tax abatement in 2005 from what I read which means they went two years before they backed out.\n\n \n Dell did this in other places too. \n \n \nThis is not really a scam and in many states it has worked great to attract business.\n\n \n That depends on the type of business you're trying to attract. Big industrial plants that require huge capital inlays, sure. Cheap call centers that can be moved in weeks? No.", 
   {}, 
   337020, 
   null, 
   1229587560.0
  ], 
  [
   337117, 
   null, 
   "Steeeeve", 
   "Dell did this in other places too. \nWell they are a struggling company. There was no abuse of the tax abatements.\n \n \nThat depends on the type of business you're trying to attract. Big industrial plants that require huge capital inlays, sure. Cheap call centers that can be moved in weeks? No.\nBMW and the others discussed are not cheap call centers.", 
   {}, 
   337079, 
   null, 
   1229615460.0
  ], 
  [
   337254, 
   null, 
   "obvious_child", 
   "Well they are a struggling company. There was no abuse of the tax abatements.\n\n \n That depends how we define abuse. \n \n \nBMW and the others discussed are not cheap call centers.\n\n \n I never said they were. Car factories are generally big industrial centers.", 
   {}, 
   337117, 
   null, 
   1229681340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Corporate Welfare Queens", 
  "url": "http://www.4forums.com/political/economics-debates/12103-corporate-welfare-queens.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 12103, 
  "discussion_files": [
   [
    "22789.html", 
    "http://www.4forums.com/political/economics-debates/12103-corporate-welfare-queens-print.html"
   ]
  ], 
  "identifier": 12103
 }
]