[
 [
  [
   337147, 
   null, 
   "Lurch907", 
   "Anchorage Daily News, Anchorage, Alaska, 11/4/2006 \n \n WHEN MATTHEW SCHNEIDER pulled into his driveway and got out of his truck, three teenagers approached and began an altercation. According to authorities, Schneider told the youths to vacate his property, but they began assaulting him, even slamming the truck door on his head. Schneider, who has a concealed carry permit, reached for his .4o pistol and fired twice at his assailants. \"I thought they were going to kill me if I didn't do something,\" Schneider said. Two suspects fled, one of them wounded, while a third collapsed. Schneider says he prayed for the fallen suspect to survive, but he died at the scene \n\n \n I thought I'd give Brady and Penfold a chance to tell us what a bad man this guy was for defending himself like that.\n BTW, here in Alaska he didn't need to have a concealed carry permit. Here, if you can legally own a gun you can carry it with a few exceptions.\n \n Merry Christmas", 
   {
    "post_info": {
     "post_title": "Defense in the north"
    }
   }, 
   null, 
   null, 
   1229628060.0
  ], 
  [
   337152, 
   null, 
   "Charliegone", 
   "I thought I'd give Brady and Penfold a chance to tell us what a bad man this guy was for defending himself like that.\n BTW, here in Alaska he didn't need to have a concealed carry permit. Here, if you can legally own a gun you can carry it with a few exceptions.\n \n Merry Christmas\n\n \n I think he did every thing right. All in self-defense. I probably would have reacted a bit earlier, but hey at least the guy is alive. I heard of similar situation in Delaware where a suspect put something behind a guys back asking for his stuff, unfortunately for them he was armed (open carrying) and shot the guy. The suspects ran away only to find one guy going to the hospital with a gun shot wound. When someone puts what appears to be a gun behind your back and asks for the money, you have 50, 50 chance of living or dying. I'd rather make my own chance and try to live.", 
   {}, 
   337147, 
   null, 
   1229630520.0
  ], 
  [
   337153, 
   null, 
   "Ethmi", 
   "Hey, Ian, Chet, Jo, try to convince me a burglar alarm would save him like that! Oh, I dare ya!", 
   {}, 
   337152, 
   null, 
   1229630700.0
  ], 
  [
   337330, 
   null, 
   "sinjin", 
   "I'll bet the surviving youths learned a valuable lesson. Let's hope the right one. \n If not, they'll likely arm themselves before they think of assaulting someone again.", 
   {}, 
   337153, 
   null, 
   1229719380.0
  ], 
  [
   337340, 
   null, 
   "NATO 556", 
   "I'll bet the surviving youths learned a valuable lesson. Let's hope the right one. \n If not, they'll likely arm themselves before they think of assaulting someone again.\n\n \n How do we know that they weren't armed to begin with and simply never expected one of their victims to fight back in such an effective manner?", 
   {}, 
   337330, 
   null, 
   1229723760.0
  ], 
  [
   337447, 
   null, 
   "sinjin", 
   "How do we know that they weren't armed to begin with and simply never expected one of their victims to fight back in such an effective manner?\nI suppose we don't except for the dead one maybe.", 
   {}, 
   337340, 
   null, 
   1229807700.0
  ], 
  [
   337470, 
   null, 
   "Ethmi", 
   "I'll bet the surviving youths learned a valuable lesson. Let's hope the right one. \n If not, they'll likely arm themselves before they think of assaulting someone again.\n\n \n Nice speculation, but so far it's come to nothing. This is one level above a troll comment.", 
   {}, 
   337330, 
   null, 
   1229821020.0
  ], 
  [
   337586, 
   null, 
   "sinjin", 
   "Nice speculation, but so far it's come to nothing. This is one level above a troll comment.\nwhy do you feel the need to be insulting?", 
   {}, 
   337470, 
   null, 
   1229893020.0
  ], 
  [
   337616, 
   null, 
   "Ethmi", 
   "Why do you feel the need to be insulting?\n\n \n I'm not trying to be. I simply believe that your comment didn't really have any useful point.", 
   {}, 
   337586, 
   null, 
   1229908620.0
  ], 
  [
   337628, 
   null, 
   "sinjin", 
   "I'm not trying to be. I simply believe that your comment didn't really have any useful point.\nAnd your response was useful how? IMO it is useful to remember that criminals learn to perfect their craft. More armed potential victims could lead to more routinely armed perps.", 
   {}, 
   337616, 
   null, 
   1229917320.0
  ], 
  [
   337642, 
   null, 
   "NATO 556", 
   "And your response was useful how? IMO it is useful to remember that criminals learn to perfect their craft. More armed potential victims could lead to more routinely armed perps.\n\n \n I haven't seen any proof that criminals aren't already armed. Nor have I seen evidence that a lacked of potentially armed criminals encourages unarmed criminals. DC wasn't your murder capital for years for no reason.", 
   {}, 
   337628, 
   null, 
   1229928600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Defense in the north", 
  "url": "http://www.4forums.com/political/gun-control-debates/12116-defense-north.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12116, 
  "discussion_files": [
   [
    "7122.html", 
    "http://www.4forums.com/political/gun-control-debates/12116-defense-north-print.html"
   ]
  ], 
  "identifier": 12116
 }
]