[
 [
  [
   337517, 
   null, 
   "Ethmi", 
   "I'll let you make the first move. After all, it won't be any fun unless I see one or two responses; I'm not really expecting many more.", 
   {
    "post_info": {
     "post_title": "Resist Arrest, are you sure that communism has never destroyed democracy?"
    }
   }, 
   null, 
   null, 
   1229840820.0
  ], 
  [
   337546, 
   null, 
   "obvious_child", 
   "I'll let you make the first move. After all, it won't be any fun unless I see one or two responses; I'm not really expecting many more.\n\n \n The likely flaw of this argument is defining Communism. Communism as defined by Marx and Engel has never been implemented. Furthermore, Communism as defined by Marx and Engel IS democracy. Often people either forget that or have no idea what Communism is. Historically, Communist supporting ideology candidates that have won democratic elections have been removed by force (or attempted) by Western powers. Chile, Nicaragua, Guatemala, several African nations including Mozambique, the list is actually quite long.", 
   {}, 
   337517, 
   null, 
   1229856900.0
  ], 
  [
   337549, 
   null, 
   "Jo Bennett", 
   "The other flaw will be that you can't define democracy either. Was apartheid South Africa a democracy? How about present day Zimbabwe? What about the US circa 1950? 1900? 1850?", 
   {}, 
   337546, 
   null, 
   1229858700.0
  ], 
  [
   337596, 
   null, 
   "Ethmi", 
   "This is all a bit useless if you read the guy's posts.\n \n He concluded that China, North Korea, Cuba, the USSR (which was a dictatorship under Stalin, but mostly subject to propaganda during the cold war) were all ladi-dadi-daa paradises where you could see sunshine, rainbows, and unicorns all around.\n \n Get those fancy ideas out of your head, RA. North Korea, the USSR under Stalin, Cuba, etc. will arrest you for the heinous crime against humanity of disagreeing with el camendante. I've never seen this level of ignorance before; not even from a conspiracy theorist!\n \n And OC, Jo, most dictatorships are good governments gone bad. Like that guy said from Jurassic Park III, \"Some of the worst things imaginable are done with the best intentions.\" And might I add that their first step is normally to ban, or tightly restrict firearms, Jo. Most communist countries do start out as democracies. They do start out with redistribution and working for \"the common good\". The problem is, the governments are normally the people who get to define \"the common good\". Communist Coutries may start good, but they have a tendency to turn out very differently.", 
   {}, 
   337549, 
   null, 
   1229896320.0
  ], 
  [
   337597, 
   null, 
   "Ethmi", 
   "The other flaw will be that you can't define democracy either. Was apartheid South Africa a democracy? How about present day Zimbabwe? What about the US circa 1950? 1900? 1850?\n\n \n A democracy is simply a form of government where ordinary dirtbags like us have some say in the matter. You've actually helped me with this, as in North Korea, Cuba, and the USSR under Stalin, your opinions certainly don't matter to them.", 
   {}, 
   337549, 
   null, 
   1229896500.0
  ], 
  [
   337599, 
   null, 
   "Jo Bennett", 
   "some say? How about Iran then? And the Cuban people do have  some  say. Democracy is not binary, it's a continuum. In fact, most countries that have claimed to be communist are those which have been subject to some form of violent revolution - those who get there democratically tend to find the US has paid a right wing armed group to launch a coup and don't last long. The only times governments claiming to be communist have survived is when they're too totalitarian for US agents to be able to undermine them.", 
   {}, 
   337597, 
   null, 
   1229897040.0
  ], 
  [
   337614, 
   null, 
   "Ethmi", 
   "Some say? How about Iran then? And the Cuban people do have  some  say.\n\n \n Yes, which is why people are arrested for disagreeing with el camendante, including human rights advocates, journalists, and photographers who have evidence of Castro's declining health. Let's stick with countries where your say won't get you arrested, shall we? :)\n \n \nDemocracy is not binary, it's a continuum. In fact, most countries that have claimed to be communist are those which have been subject to some form of violent revolution - those who get there democratically tend to find the US has paid a right wing armed group to launch a coup and don't last long. The only times governments claiming to be communist have survived is when they're too totalitarian for US agents to be able to undermine them.\n\n \n Such as?", 
   {}, 
   337599, 
   null, 
   1229908260.0
  ], 
  [
   337615, 
   null, 
   "Ethmi", 
   "You people are trying to refute my point by listing communist countries that supposedly aren't dictatorships. But since the starter was \"Communism has never led to dictatorship!!!!\", then North Korea effectively refutes RA's point.", 
   {}, 
   337614, 
   null, 
   1229908440.0
  ], 
  [
   337617, 
   null, 
   "Penfold", 
   " ........ Such as?\n\n \n Chile. 1973.", 
   {}, 
   337614, 
   null, 
   1229909280.0
  ], 
  [
   337655, 
   null, 
   "Jo Bennett", 
   "You people are trying to refute my point by listing communist countries that supposedly aren't dictatorships. But since the starter was \"Communism has never led to dictatorship!!!!\", then North Korea effectively refutes RA's point.\n\n \n No, because North Korea was never a democracy. What you need to prove your side is a country which started off as a democracy and turned into a dictatorship as a result of communism.\n \n And you can get arrested for what you say in most countries. Saying Bush should be shot, or even wearing a t-shirt with a picture of Bush and crosshairs, has got people picked up by the FBI.", 
   {}, 
   337615, 
   null, 
   1229940660.0
  ], 
  [
   337696, 
   null, 
   "Ethmi", 
   "No, because North Korea was never a democracy. What you need to prove your side is a country which started off as a democracy and turned into a dictatorship as a result of communism.\n\n \n This is kind of irrelevant. Either way, North Korea is a communist dictatorship.\n \n \nAnd you can get arrested for what you say in most countries. Saying Bush should be shot, or even wearing a t-shirt with a picture of Bush and crosshairs, has got people picked up by the FBI.\n\n \n I wouldn't say that advocating human rights is comparable to terroristic threats, though. And here, you could criticize every single policy that Bush has passed, advocate policies that are completely opposite of his, snap an unflattering picture of him, publish it to USA Today with your signature, and get away with it. Try that in Cuba...", 
   {}, 
   337655, 
   null, 
   1229978160.0
  ], 
  [
   337703, 
   null, 
   "Jo Bennett", 
   "This is kind of irrelevant. Either way, North Korea is a communist dictatorship.\n \n\n \n Entirely relevant, communism cannot have destroyed democracy where it didn't exist. And we could argue until the cows come home about whether North Korea is communist. It is certainly a dictatorship, it claims to be communist, much as the GDR claimed to be democratic.", 
   {}, 
   337696, 
   null, 
   1229983800.0
  ], 
  [
   339009, 
   null, 
   "Ethmi", 
   "Entirely relevant, communism cannot have destroyed democracy where it didn't exist. And we could argue until the cows come home about whether North Korea is communist. It is certainly a dictatorship, it claims to be communist, much as the GDR claimed to be democratic.\n\n \n Should we discuss the benefits the communist government has had? No, Bennet. The fact that North Korea is a communist country is unquestionable.", 
   {}, 
   337703, 
   null, 
   1231185540.0
  ], 
  [
   339020, 
   null, 
   "Jo Bennett", 
   "Should we discuss the benefits the communist government has had? No, Bennet. The fact that North Korea is a communist country is unquestionable.\n\n \n I question it. What makes you think it is communist? Is it run by the people for the benefit of the population as a whole?", 
   {}, 
   339009, 
   null, 
   1231188540.0
  ], 
  [
   339999, 
   null, 
   "Ethmi", 
   "I question it. What makes you think it is communist? Is it run by the people for the benefit of the population as a whole?\n\n \n The USSR under Stalin was definitely communist, but I don't think it was ran by people. And I've always found it fascinating that the government gets to define the common good.", 
   {}, 
   339020, 
   null, 
   1231809300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Resist Arrest, are you sure that communism has never destroyed democracy?", 
  "url": "http://www.4forums.com/political/challengers-corner/12123-resist-arrest-you-sure-communism-has-never-destroyed-democracy.html", 
  "breadcrumbs": [
   "Challengers Corner"
  ], 
  "id_number": 12123, 
  "discussion_files": [
   [
    "27779.html", 
    "http://www.4forums.com/political/challengers-corner/12123-resist-arrest-you-sure-communism-has-never-destroyed-democracy-print.html"
   ]
  ], 
  "identifier": 12123
 }
]