[
 [
  [
   21389, 
   null, 
   "crazy_j420", 
   "emoticon_xagree weed is the best damn thing that ever came out and i dont care if it is legal or not i will toke it till the day i die emoticon_xkill emoticon_zzzz", 
   {
    "post_info": {
     "post_title": "legal weed"
    }
   }, 
   null, 
   null, 
   1067968800.0
  ], 
  [
   21395, 
   null, 
   "gilligan8503", 
   "emoticon_xagree weed is the best damn thing that ever came out and i dont care if it is legal or not i will toke it till the day i die emoticon_xkill emoticon_zzzz\n\n even though i am for legalization, you might as well not have put this. it doesn't help; it only hurts.", 
   {}, 
   21389, 
   null, 
   1067971080.0
  ], 
  [
   21402, 
   null, 
   "sundowner", 
   "emoticon_xagree weed is the best damn thing that ever came out and i dont care if it is legal or not i will toke it till the day i die emoticon_xkill emoticon_zzzz\n\n \n I must agree, this is a really pointless post which does nothing but make responsible pot smokers and pro-legalization people look like XXXXXX. USE IT RESPONSIBLY, TALK OF IT INTELLIGENTLY, PORTRAY IT FAVORABLY, AND MOST OF ALL, CONTRIBUTE TO THE FIGHT FOR IT.", 
   {}, 
   21389, 
   null, 
   1067972460.0
  ], 
  [
   21450, 
   null, 
   "epaphras_faith", 
   "Since I am against it, I would like to take the time to thank this fellow for his portrayal as it most definitely helps my position.\n \n However, Gilligan and Sundowner are right. Participate with thought and logic and something of an intelligent nature. Your post is offensive even to those who wish what you wish. \n \n Lastly, get some help.", 
   {}, 
   21402, 
   null, 
   1067997300.0
  ], 
  [
   73886, 
   null, 
   "sglaine", 
   "emoticon_xhoho \nSince I am against it, I would like to take the time to thank this fellow for his portrayal as it most definitely helps my position.\n \n However, Gilligan and Sundowner are right. Participate with thought and logic and something of an intelligent nature. Your post is offensive even to those who wish what you wish. \n \n Lastly, get some help.\n\n \n Why are you against it. Is it maybe your afraid that you might be out of a job? emoticon_xhoho", 
   {}, 
   21450, 
   null, 
   1098928260.0
  ], 
  [
   73888, 
   null, 
   "Duo_Maxwell", 
   "legalize? \n \n Ummm....\n \n Decriminalize?\n \n Defintely. Non-violent pot heads cost us MILLIONS, if not BILLIONS in prison costs every year. If we decriminalize it, we could fine them and not have to pay for prison costs!\n \n Besides, Weed's overall affect is nothing like Tobacco or Alcohol. No one ever died from weed, where...well you get the idea.", 
   {}, 
   73886, 
   null, 
   1098928440.0
  ], 
  [
   73889, 
   null, 
   "sglaine", 
   "legalize? \n \n Ummm....\n \n Decriminalize?\n \n Defintely. Non-violent pot heads cost us MILLIONS, if not BILLIONS in prison costs every year. If we decriminalize it, we could fine them and not have to pay for prison costs!\n \n Besides, Weed's overall affect is nothing like Tobacco or Alcohol. No one ever died from weed, where...well you get the idea.\n\n \n And further more if it is legal it could be taxed and the tax money could go for health care for everyone. emoticon_xhoho", 
   {}, 
   73888, 
   null, 
   1098928860.0
  ], 
  [
   73908, 
   null, 
   "lord tammerlain", 
   "To my knowledge possesion of weed in much of Canada no longer results in even a fine. Growing your own, kept for personal use is much the same. The police wouldnt have the time, and the jails wouldnt have the space to keep all the pot smokers in jail. Large grow operations are a different story, and are busted with regularity.\n \n In fact last month or so a \"pot cafe\" was running in Vancouver without being busted for at least 2 weeks. I dont know if it is still open or running.", 
   {}, 
   73889, 
   null, 
   1098961260.0
  ], 
  [
   73940, 
   null, 
   "college_girl", 
   "It got shut down after it started getting media attention. However, there are several more in the vicinity...", 
   {}, 
   73908, 
   null, 
   1098980160.0
  ], 
  [
   73948, 
   null, 
   "joebrummer", 
   "emoticon_xagree weed is the best damn thing that ever came out and i dont care if it is legal or not i will toke it till the day i die emoticon_xkill emoticon_zzzz\n\n \n \n The die part will come sooner than you think. Pot does 25 times the damge to your lung that cigarettes do. It depresses the immune system against invading bacteria. It also damages sperm counts in men causing sterility.\n \n It accumualtes in the microscopic spaces between nerve cells in the brain called \"synapses\". This clogging interfers by slowing and imparing transfer of critical information. Long term use causes the brain to stop production of brain chemicals necessary to \"feel good\" a negative feedback condition and the user becomes chemically addicted to the drug.\n \n Increases chances of throat cancer by irrating the larynx.\n \n The smoke produces has twice as much tar as cigarette smoke.\n \n I am all for legalizing it so it doesn't cost my tax money to keep offenders in jail!", 
   {}, 
   21389, 
   null, 
   1098981540.0
  ], 
  [
   73974, 
   null, 
   "sinjin", 
   "The die part will come sooner than you think. Pot does 25 times the damge to your lung that cigarettes do. It depresses the immune system against invading bacteria. It also damages sperm counts in men causing sterility.\n \n It accumualtes in the microscopic spaces between nerve cells in the brain called \"synapses\". This clogging interfers by slowing and imparing transfer of critical information. Long term use causes the brain to stop production of brain chemicals necessary to \"feel good\" a negative feedback condition and the user becomes chemically addicted to the drug.\n \n Increases chances of throat cancer by irrating the larynx.\n \n The smoke produces has twice as much tar as cigarette smoke.\n \n I am all for legalizing it so it doesn't cost my tax money to keep offenders in jail!\n\n \n Who smokes a \"pack\" of doobies a day?\n \n btw most of this is \"junk\" science specifically designed to come up with something to use as deterrent.", 
   {}, 
   73948, 
   null, 
   1098992160.0
  ], 
  [
   74001, 
   null, 
   "joebrummer", 
   "Who smokes a \"pack\" of doobies a day?\n \n btw most of this is \"junk\" science specifically designed to come up with something to use as deterrent.\n\n \n You can keep telling yourself it is good for ya until the doc says yeah, it's cancer. \n \n Just the heat of the smoke alone burns out the small hair like fibers in the lungs and scars teh bronchi. You can tell yourself what ever you want about it, but it is not junk science.", 
   {}, 
   73974, 
   null, 
   1099000860.0
  ], 
  [
   74005, 
   null, 
   "Duo_Maxwell", 
   "And further more if it is legal it could be taxed and the tax money could go for health care for everyone. emoticon_xhoho\n\n \n I'm not ready to take that step, and Weed does cause reproductive problems in males, along with a bunch of other sideaffects. Of course it doesn't kill you like our state sponsored tobacco industry, but it's not exactly long term side affect free.", 
   {}, 
   73889, 
   null, 
   1099001580.0
  ], 
  [
   74010, 
   null, 
   "sinjin", 
   "http://www.drugtext.org/sub/marmyt1.html\n \n http://www.drugpolicy.org/marijuana/factsmyths/\n \n http://www.ukcia.org/research/zimmer.htm", 
   {}, 
   74005, 
   null, 
   1099001940.0
  ], 
  [
   74014, 
   null, 
   "Duo_Maxwell", 
   "http://www.click2houston.com/health/2551085/detail.html\n \n weed;s affect on sperm cells.", 
   {}, 
   74010, 
   null, 
   1099002420.0
  ], 
  [
   74040, 
   null, 
   "sinjin", 
   "http://www.click2houston.com/health/2551085/detail.html\n \n weed;s affect on sperm cells.\n\n \n Apparently I'm immune.", 
   {}, 
   74014, 
   null, 
   1099009260.0
  ], 
  [
   74075, 
   null, 
   "joebrummer", 
   "Apparently I'm immune.\n\n \n \n So you are saying your sperm are just perfect! This is good to know. We are very happy for you and your happy sperm!\n \n \n (I am kidding around here in case anyone was in doubt)", 
   {}, 
   74040, 
   null, 
   1099022220.0
  ], 
  [
   74076, 
   null, 
   "Duo_Maxwell", 
   "Apparently I'm immune.\n\n \n hahahha. I don't think anyone is going to say that weed is harmless. However, unlike other pharmetcical drugs, Weed is harmful to everyone, regardless of your medical history. While Asprin kills on average a few thousand people a year, the vast majority of users aren't harmed at all. Legazling a drug that is harmful to everyone is sketchy.", 
   {}, 
   74040, 
   null, 
   1099022280.0
  ], 
  [
   74078, 
   null, 
   "joebrummer", 
   "hahahha. I don't think anyone is going to say that weed is harmless. However, unlike other pharmetcical drugs, Weed is harmful to everyone, regardless of your medical history. While Asprin kills on average a few thousand people a year, the vast majority of users aren't harmed at all. Legazling a drug that is harmful to everyone is sketchy.\n\n \n \n but Duo it isn't harmful......\n \n That is what the pot smoking world says, failing to realize the heat from a puff alone does tons of damage. You could smoke tree leaves. You are still talking about inhaling something up to 600 degrees into your lungs and assuming the heat won't burn you. That is like taking a lighter to your skin and saying....no way will I get burned.\n \n The main chemical in pot is THC. It has medical benefits, the heat and tar and smoke do not.....", 
   {}, 
   74076, 
   null, 
   1099022760.0
  ], 
  [
   74080, 
   null, 
   "college_girl", 
   "Water bongs can help with that, also with high quality weed you would only need a couple puffs.", 
   {}, 
   74078, 
   null, 
   1099023960.0
  ], 
  [
   74081, 
   null, 
   "joebrummer", 
   "Water bongs can help with that, also with high quality weed you would only need a couple puffs.\n\n \n \n Yeah, that will help. What about the brain damage? Will water bongs help with the decreased oxygen supply to the brain and decreased nuero damge that THC causes in brain chemistry? I doubt it. I use to smoke and maybestill do, but do it with some honesty. It isn't good for you!", 
   {}, 
   74080, 
   null, 
   1099024380.0
  ], 
  [
   74084, 
   null, 
   "Duo_Maxwell", 
   "but Duo it isn't harmful......\n\n \n Oh yes it is, but compared to state sponsored tobacco and alchohol, it's nothing, however it's not exactly harmless. \n \n \n\n The main chemical in pot is THC. It has medical benefits, the heat and tar and smoke do not.....\n\n \n I don't doubt that, but it has sideaffects that apply to all users, unlike drugs such as asprin that only affect a tiny fraction of users. If Weed had that sort of record, i wouldn't have a problem with legalization.", 
   {}, 
   74078, 
   null, 
   1099025040.0
  ], 
  [
   74089, 
   null, 
   "college_girl", 
   "It isn't good for you!\n\n \n Neither are most things that are fun, moderation is the key. I believe smoking a joint once a month to be akin to drinking a coke or eating fries occasionally- certainly not healthy but if it's a rare treat it's not going to kill you.", 
   {}, 
   74084, 
   null, 
   1099025820.0
  ], 
  [
   74091, 
   null, 
   "joebrummer", 
   "Oh yes it is, but compared to state sponsored tobacco and alchohol, it's nothing, however it's not exactly harmless. \n \n \n \n I don't doubt that, but it has side effects that apply to all users, unlike drugs such as asprin that only affect a tiny fraction of users. If Weed had that sort of record, i wouldn't have a problem with legalization.\n\n \n \n Preaching to the promodial choir here! I work in mental health and substance abuse, I have seen what the \"its' just pot\" menatiality has done to people. I am in favor a legalized pot because of the burden it has put on the tax payer. I may seem like a big liberal but in reality, I am not. Tax payers spend too much money on housing drug offenders for simple posession of small amounts of pot. Some are very successful people. If they want to kill themself smoking pot, great! But do not let it cost me, the tax payer, money keeping them in jail for a joint. screw em! Let them screw up their life without costing me money. \n \n Working in mental health I have seen the long term users, sad! They struggle to make sentences because the nuerons have been clogged by THC. It lives in the fat cells and stays there. It messes with the nuerons so they do not send clear messeges back and forth to the brain. Although pot smokers feel a sense of \"happiness\" when they are stoned, THC is a depressant. It makes you depressed. Unlike anti-depressants like celexa or zoloft, it closes the brain up rather than opening the brains natural chemistry to communication. It also enhances the effects of ADHD patients to be more unfocused. I could go on for hours about how bad it is., but like most drug users, they live in denial. I don't have a problem it is good for me....yeah, sure it is....you keep telling yourself that.\n \n I am in favor of the medical use. People who lives will be shortened by their disored or disease anyway, why not make for a better quality of life. That could be fine. but recreational use is by far worse than alcohol . Despite what the pro-drug websites tell you.\n \n Of course these pro-pot sites tell you it is Junk science, they are addicts, they will say anything to make it ok, that is part of the deal. It is an addiction. They will say whatever it taskes to keep being high. When you talk to people who have gotten sober, you change you opinion fast. They rave about how much bettter they feel NOT smoking pot!", 
   {}, 
   74084, 
   null, 
   1099026360.0
  ], 
  [
   74095, 
   null, 
   "Duo_Maxwell", 
   "exactly Joe, that is why I favor decriminzation. Not only would it get them out of our jails, but we'd make some cash in fines as well. \n \n Non-violent pot heads should be fined a small sum, like $50 for possession, but not jailed.", 
   {}, 
   74091, 
   null, 
   1099026660.0
  ], 
  [
   74098, 
   null, 
   "joebrummer", 
   "[QUOTE=Duo_Maxwell]exactly Joe, that is why I favor decriminzation. Not only would it get them out of our jails, but we'd make some cash in fines as well. \n \n Non-violent pot heads should be fined a small sum, like $50 for possession, but not jailed.[/QUOTE\n \n But if it is legal, on what grounds can you fine them?", 
   {}, 
   74095, 
   null, 
   1099027080.0
  ], 
  [
   74100, 
   null, 
   "Duo_Maxwell", 
   "Decriminization doesn't make it legal, it simply strips it of most of the legal ramifcations of crime. \n \n I'd fine them for 1/2 a pound and let them carry on with a slip stating they've already been fined for that 1/2 lb.", 
   {}, 
   74098, 
   null, 
   1099027500.0
  ], 
  [
   74165, 
   null, 
   "sinjin", 
   "Working in mental health I have seen the long term users, sad! They struggle to make sentences because the nuerons have been clogged by THC. It lives in the fat cells and stays there. It messes with the nuerons so they do not send clear messeges back and forth to the brain. Although pot smokers feel a sense of \"happiness\" when they are stoned, THC is a depressant. It makes you depressed. Unlike anti-depressants like celexa or zoloft, it closes the brain up rather than opening the brains natural chemistry to communication. It also enhances the effects of ADHD patients to be more unfocused. I could go on for hours about how bad it is., but like most drug users, they live in denial. I don't have a problem it is good for me....yeah, sure it is....you keep telling yourself that.\n \n\n \n Remarkable claims but I'll just repeat that apparently I am immune to these effects. Funny you never see these tongue-tied zombies propped up before a camera doing a PSA.", 
   {}, 
   74091, 
   null, 
   1099072200.0
  ], 
  [
   74180, 
   null, 
   "billsco", 
   "exactly Joe, that is why I favor decriminzation. Not only would it get them out of our jails, but we'd make some cash in fines as well. \n \n Non-violent pot heads should be fined a small sum, like $50 for possession, but not jailed.\n\n \n In my county the best thing to do if caught with a small amount is not even appear before the judge. He's usually forced to throw out the case, and it will not appear on your record. However, if you do appear and pay the relatively small fine...\n \n This information came from the head of the Sheriff's Narcotics Divison, and may not be applicable to where you live.", 
   {}, 
   74095, 
   null, 
   1099075320.0
  ], 
  [
   74183, 
   null, 
   "joebrummer", 
   "Remarkable claims but I'll just repeat that apparently I am immune to these effects. \n\n \n \n Like I said, most users are in denial about what effects it is having on their body", 
   {}, 
   74165, 
   null, 
   1099075560.0
  ], 
  [
   74388, 
   null, 
   "georged", 
   " Although pot smokers feel a sense of \"happiness\" when they are stoned, THC is a depressant. It makes you depressed. \n\n \n I'd sure rather be around a 'depressed' toker than a 'happy' redneck (present in all US States) who's a 12-pack along to those Jekyll and Hyde mood swings.", 
   {}, 
   74091, 
   null, 
   1099178700.0
  ], 
  [
   74400, 
   null, 
   "Dzeron", 
   "emoticon_xagree weed is the best damn thing that ever came out and i dont care if it is legal or not i will toke it till the day i die emoticon_xkill emoticon_zzzz\n\n \n I understand the point he's trying to make. If he thinks that weed is good for him, then he has the right to use it. As long as he's not forcing me to smoke it, I'm fine.", 
   {}, 
   21389, 
   null, 
   1099180380.0
  ], 
  [
   74436, 
   null, 
   "joebrummer", 
   "I'd sure rather be around a 'depressed' toker than a 'happy' redneck (present in all US States) who's a 12-pack along to those Jekyll and Hyde mood swings.\n\n much agreed, don't get me wrong. I am not against pot at all. In my younger days I was the biggest stoner ever, but If you are going to indulge at least be honest with yourself about what you are doing to your body!", 
   {}, 
   74388, 
   null, 
   1099200540.0
  ], 
  [
   74441, 
   null, 
   "Tboy321025", 
   "I understand the point he's trying to make. If he thinks that weed is good for him, then he has the right to use it. As long as he's not forcing me to smoke it, I'm fine.\n\n \n I feel the same way, but I also think that the only reason it's not legalized is because the government doesn't know how to tax it. It has been proven that it is less harmful than cigerettes and behind the wheel is less dangorous than alcohol, so why not legalize it? Because that have no idea how they would tax it.", 
   {}, 
   74400, 
   null, 
   1099203180.0
  ], 
  [
   74444, 
   null, 
   "Dzeron", 
   "I feel the same way, but I also think that the only reason it's not legalized is because the government doesn't know how to tax it. It has been proven that it is less harmful than cigerettes and behind the wheel is less dangorous than alcohol, so why not legalize it? Because that have no idea how they would tax it.\n\n \n No, it's because the conservatives have convinced themselves that they are right and you are wrong (about using marijuana) and they get emotional security by turning their \"rightness\" into law. Same goes with their position on alcohol, gay marriage, seatbelt laws, censorship, and, with more extreme conservatives, destorying the separation of church and state.", 
   {}, 
   74441, 
   null, 
   1099204140.0
  ], 
  [
   74455, 
   null, 
   "joebrummer", 
   "No, it's because the conservatives have convinced themselves that they are right and you are wrong (about using marijuana) and they get emotional security by turning their \"rightness\" into law. Same goes with their position on alcohol, gay marriage, seatbelt laws, censorship, and, with more extreme conservatives, destorying the separation of church and state.\n\n \n \n I usually agree with you , but here I don't. I think it is the tax, If the government can make money off it, they will tax it and and that is that. As soon as the government can figure out how to grow it and sell it they will tax it then it will be legal. And you have to love how I managged this post with no grammar rules what so ever. Damn me!", 
   {}, 
   74444, 
   null, 
   1099210260.0
  ], 
  [
   74461, 
   null, 
   "Tboy321025", 
   "I usually agree with you , but here I don't. I think it is the tax, If the government can make money off it, they will tax it and and that is that. As soon as the government can figure out how to grow it and sell it they will tax it then it will be legal. And you have to love how I managged this post with no grammar rules what so ever. Damn me!\n\n \n Haha, thank you for agreeing with me", 
   {}, 
   74455, 
   null, 
   1099212120.0
  ], 
  [
   74480, 
   null, 
   "georged", 
   "No, it's because the conservatives have convinced themselves that they are right and you are wrong (about using marijuana) and they get emotional security by turning their \"rightness\" into law. Same goes with their position on alcohol, gay marriage, seatbelt laws, censorship, and, with more extreme conservatives, destorying the separation of church and state.\n\n \n That's the correct answer. Government is structured to tax anything that generates revenue or has asset value. Moral legislation by those pretending to preserve traditional values is the real issue. And it isn't just conservatives, many liberals are still clinging to the rapidly crumbling American Dream.", 
   {}, 
   74444, 
   null, 
   1099244040.0
  ], 
  [
   74588, 
   null, 
   "Master_Shake", 
   "I must agree, this is a really pointless post which does nothing but make responsible pot smokers and pro-legalization people look like XXXXXX. USE IT RESPONSIBLY, TALK OF IT INTELLIGENTLY, PORTRAY IT FAVORABLY, AND MOST OF ALL, CONTRIBUTE TO THE FIGHT FOR IT.\n\n \n \"Responsible pot smokers\"?????? That's a laugh. I have a lot of friends that smoke pot and met a lot of other people that smoke, and not a darn one is responsible. It's not a judgement on them, but let's not kid ourselves here.", 
   {}, 
   21402, 
   null, 
   1099337940.0
  ], 
  [
   74594, 
   null, 
   "georged", 
   "\"Responsible pot smokers\"?????? That's a laugh. I have a lot of friends that smoke pot and met a lot of other people that smoke, and not a darn one is responsible. It's not a judgement on them, but let's not kid ourselves here.\n\n \n Must be the social structures one associates with. I've responsible and non-responsible, just as with any other groups of people.", 
   {}, 
   74588, 
   null, 
   1099338420.0
  ], 
  [
   74598, 
   null, 
   "Master_Shake", 
   "It has been proven that it is less harmful than cigerettes and behind the wheel is less dangorous than alcohol.\n\n \n What are you smoking?! (pun very much intended). It is not less harmful than cigarettes, yet another myth propagated by users. These people claim that \"no one has ever died from pot.\" BS. The reason that they claim this is that some of the kind of things that can be cause from smoking pot are much the same as from smoking cigarettes (lung cancer, emphasyma[sp?]), and almost every pothead on the planet smokes cigarettes too. So when a pot smoker is in the hospital with lung cancer, of course they are going to say that it was from smoking cigarettes, they are not going to readily admit that they are pot heads.\n \n And where has it been \"proven\" that pot is less dangerous behind the wheel that booze? Did they put a bunch of drunks in cars, and a bunch of potheads in cars and see that the drunks caused more accidents than the potheads? Stop making stuff up, okay?", 
   {}, 
   74441, 
   null, 
   1099339080.0
  ], 
  [
   74599, 
   null, 
   "Anastasia", 
   "\"Responsible pot smokers\"?????? That's a laugh. I have a lot of friends that smoke pot and met a lot of other people that smoke, and not a darn one is responsible. It's not a judgement on them, but let's not kid ourselves here.\n\n Wow thats pretty good that you can draw that conclusion on your circle of friends and have it apply to everyone.\n I know so many people that smoke pot and are responsible, that you would never guess they smoked.\n Even one of my doc's smokes, he doesnt know that I know this I am close friends with his nurse. he is one of the best docs I ever had.\n How many responsible alcoholics do you know?\n Also there are so many Heroine addicts that are functioning as well.", 
   {}, 
   74588, 
   null, 
   1099339320.0
  ], 
  [
   74605, 
   null, 
   "pnac=ww3", 
   "What are you smoking?! (pun very much intended). It is not less harmful than cigarettes, yet another myth propagated by users. These people claim that \"no one has ever died from pot.\" BS. The reason that they claim this is that some of the kind of things that can be cause from smoking pot are much the same as from smoking cigarettes (lung cancer, emphasyma[sp?]), and almost every pothead on the planet smokes cigarettes too. So when a pot smoker is in the hospital with lung cancer, of course they are going to say that it was from smoking cigarettes, they are not going to readily admit that they are pot heads.\n \n And where has it been \"proven\" that pot is less dangerous behind the wheel that booze? Did they put a bunch of drunks in cars, and a bunch of potheads in cars and see that the drunks caused more accidents than the potheads? Stop making stuff up, okay?\n\n \n Can you site something that proves that someone died because they smoked pot? There is no evidence that anyone has ever overdosed by smoking pot. There is no overdose limit for THC (unless you start shooting for hundreds of times the normal amount injested, but at that rate water becomes lethal).\n \n Are you saying that smoking pot may give you lung cancer? So? That means you agree with outlawing cigarettes. Is that what we should do? outlaw tobacco? I might agree with you, but I don't think there should be laws that control what you do with your own body. \n \n The only \"proof\" that anyone has for pot being safer than booze when behind the wheel is the number of people killed or injured in accidents where the driver was drunk (lots) and the number of injuries/fatalities caused by people being stoned (none). it also has to do with the fact that marijuana doesn't affect coordination. It may affect reaction time, but I'd have to find a study or something. \n \n .", 
   {}, 
   74598, 
   null, 
   1099339920.0
  ], 
  [
   74608, 
   null, 
   "Anastasia", 
   "Here is one click \n There are so many pages, but that one has a few things on it, you might find interesting.\n \n The myth \"No one has ever died of a marijuana overdose\" is true. This myth was put to a test; it showed that animal tests revealed extremely high doses of marijuana are needed to have any lethal effect. This has led scientists to find that the ratio of the amount of marijuana necessary to get a person stoned is relative to the amount necessary to kill them is one to 40,000. In other words, to overdose, you would have to consume 40,000 times as much marijuana as you needed to get stoned. In contrast, a ten to one ratio of alcohol would certainly cause alcohol poisoning. It is easy to see how five thousand people die of alcohol overdoses every year and no one has EVER died of a marijuana overdose.", 
   {}, 
   74605, 
   null, 
   1099340160.0
  ], 
  [
   74609, 
   null, 
   "pnac=ww3", 
   "\n How many responsible alcoholics do you know?\n Also there are so many Heroine addicts that are functioning as well.\n\n \n What about Bush? If you were ever an alcoholic you are always an alcoholic so I guess it's now a matter of opinion whether Bush is responsible or not.\n \n And just because someone can handle a heroin addiction doesn't mean that heroin is nice or good. Heroin is just plain dangerous. People who get wrapped up in it are foolishly playing with their lives. Same goes for crack.\n \n (If someone were trying to manage their pain through self administration of heroin, then they might be better off going to a doctor who can prescribe them other, less-addictive and more effective, narcotics. If someone were using heroin purely recreationally, then they are toying with their lives, like I said.)\n \n .", 
   {}, 
   74599, 
   null, 
   1099340340.0
  ], 
  [
   74610, 
   null, 
   "joebrummer", 
   "Wow thats pretty good that you can draw that conclusion on your circle of friends and have it apply to everyone.\n I know so many people that smoke pot and are responsible, that you would never guess they smoked.\n\n \n Those are called functional addicts. If they are a regular user (not a social user), They are functional addicts. This is seen all the time with alcoholics. Very highly functioning adults who are alcoholics or drug addicts. The majority of alcoholics are highly functioning adults. I don't know this for fact but I would venture to say it is most likely true of pot smokers too!\n \n\n Even one of my doc's smokes, he doesnt know that I know this I am close friends with his nurse. he is one of the best docs I ever had.\n\n This remind me of those cigarette comercials back in the 50's were the voice over says \"doctors reccomend camel to their patirnts who smoke\" Your doctors are just highly functioning addicts.\n \n\n How many responsible alcoholics do you know?\n \n The majority are responsible adults, doesn't mean they are not addicts. They are!\n \n\n Also there are so many Heroine addicts that are functioning as well.\n\n \n This one I doubt, It just isn't possible to be addicted to heroine and still function. The drug is one of the most addictive for the body, users don't eat sometimes for days. People may function but it has to be at a low level. This is also the hardest drug to get people off, even after the first use, people get violently ill as they come off it. Vomiting, shakes, and fever to name just some of the isssues of withdraw. How could they function like that? No food for days, little or no sleep. I would need some web resource that says this is possible.", 
   {}, 
   74599, 
   null, 
   1099340340.0
  ], 
  [
   74614, 
   null, 
   "Anastasia", 
   "I guess everyone missed my point, I just thought it was silly to base judgement on someone who smoked pot to be automatically irresponsible...\n I get the addiction thing, but if I am not mistaken pot is mentally addictive.\n As for the heroine thing, I didnt do any research online, I just knew of someone who was a user and functioned normally.\n As for my doc, yea maybe he is an addict nonetheless it never got in the way of his judgement in my eyes. I respected him and continued to see him even after I knew he smoked. I have been around pot smokers all of my adult life, all work, have families and lead productive lives. To me it is no more than having a glass of wine after work, same difference. Its all about moderation, and personally I would much rather get stoned than get drunk if I felt the need. \n Everyone can dispute this till we are all blue in the face and like religion your not going to change anyones mind... Why not give those who want to smoke the right to, we allow people to drink... same thing. \n Everything can be proven to be bad for you if you look hard enough.", 
   {}, 
   74610, 
   null, 
   1099341000.0
  ], 
  [
   74631, 
   null, 
   "Tboy321025", 
   "What are you smoking?! (pun very much intended). It is not less harmful than cigarettes, yet another myth propagated by users. These people claim that \"no one has ever died from pot.\" BS. The reason that they claim this is that some of the kind of things that can be cause from smoking pot are much the same as from smoking cigarettes (lung cancer, emphasyma[sp?]), and almost every pothead on the planet smokes cigarettes too. So when a pot smoker is in the hospital with lung cancer, of course they are going to say that it was from smoking cigarettes, they are not going to readily admit that they are pot heads.\n \n And where has it been \"proven\" that pot is less dangerous behind the wheel that booze? Did they put a bunch of drunks in cars, and a bunch of potheads in cars and see that the drunks caused more accidents than the potheads? Stop making stuff up, okay?\n\n \n Whoa there buddy! First of all, it HAS been proven in clinical studies by Berkely and i think Stanford that pot is less harmful to your lungs, maybe not your brain but at least your lungs. Secondly, in response to your comment about driving while high, i didn't mean that being behind the wheel with pot in your system has been PROVEN to be safer than alcohol. That was a mistake, i simply meant that as my opinion, because from my experiance (well not mine but i have a pot head friend and this is what he tells me) is that alcohol kind of speeds you up, so while driving, you feel like you are going to slow, so you speed up in the car, while with pot it slow you down, so you think that you're going too fast, so it seems like you're doing 100 when in reality you're only going about 5, lol, this is what he tells me, and i know this isn't exactly the most \"reliable\" source, but if he doesn't know and he uses pot a lot, then who would?", 
   {}, 
   74598, 
   null, 
   1099345560.0
  ], 
  [
   74643, 
   null, 
   "joebrummer", 
   "Whoa there buddy! First of all, it HAS been proven in clinical studies by Berkely and i think Stanford that pot is less harmful to your lungs, maybe not your brain but at least your lungs. Secondly, in response to your comment about driving while high, i didn't mean that being behind the wheel with pot in your system has been PROVEN to be safer than alcohol. That was a mistake, i simply meant that as my opinion, because from my experiance (well not mine but i have a pot head friend and this is what he tells me) is that alcohol kind of speeds you up, so while driving, you feel like you are going to slow, so you speed up in the car, while with pot it slow you down, so you think that you're going too fast, so it seems like you're doing 100 when in reality you're only going about 5, lol, this is what he tells me, and i know this isn't exactly the most \"reliable\" source, but if he doesn't know and he uses pot a lot, then who would?\n\n \n Neither is safe while driving. Lack of sleep is bad for drivers. Anything that distorts your view of reality and perception is dangerous when you drive. BUT alcohol being legal and more available causes more accidents and problems, if pot were more accessible I assume (and only assume) the amount of DUI's for pot and accidents would increase. Sort of saying access = accidents.", 
   {}, 
   74631, 
   null, 
   1099346940.0
  ], 
  [
   74654, 
   null, 
   "Anastasia", 
   "Neither is safe while driving. Lack of sleep is bad for drivers. Anything that distorts your view of reality and perception is dangerous when you drive. BUT alcohol being legal and more available causes more accidents and problems, if pot were more accessible I assume (and only assume) the amount of DUI's for pot and accidents would increase. Sort of saying access = accidents.\n\n IMHO the only way you would see an increase is if the user had BOTH alcohol and pot in their system.. I am willing to bet it will not be the case if it's just pot.", 
   {}, 
   74643, 
   null, 
   1099348380.0
  ], 
  [
   74657, 
   null, 
   "joebrummer", 
   "IMHO the only way you would see an increase is if the user had BOTH alcohol and pot in their system.. I am willing to bet it will not be the case if it's just pot.\n\n \n \n http://www.whitehousedrugpolicy.gov/news/press03/091603.html", 
   {}, 
   74654, 
   null, 
   1099348920.0
  ], 
  [
   74681, 
   null, 
   "pnac=ww3", 
   "The majority of alcoholics are highly functioning adults. I don't know this for fact but I would venture to say it is most likely true of pot smokers too!\n\n Do you know of any dysfunctional pot smokers? \n Hmm. I guess you have the lazy slacker stereotype. I guess we have to figure out if they were lazy to begin with or if it was pot that drove them to sit around all day. To me it seems that they were lazy to begin with and pot just enhanced the laziness. Pot is really good at making boredom acceptable. \n \n \n \n .", 
   {}, 
   74610, 
   null, 
   1099352640.0
  ], 
  [
   74683, 
   null, 
   "pnac=ww3", 
   "Neither is safe while driving. Lack of sleep is bad for drivers. Anything that distorts your view of reality and perception is dangerous when you drive. BUT alcohol being legal and more available causes more accidents and problems, if pot were more accessible I assume (and only assume) the amount of DUI's for pot and accidents would increase. Sort of saying access = accidents.\n\n \n I would say that being sleepy while driving is worse than smoking pot then driving. I'm not advocating getting high and driving, but I do it all the time. (berating ensues:)) Anyway, anyone who doubts it, do a little experiment. Wake up in the middle of the night and make sure you are really groggy, then hit the road. Then when you feel awake, get stoned, and hit the same road. You will notice that you are driving much better while stoned than you were when you were sleepy.\n \n \n .", 
   {}, 
   74643, 
   null, 
   1099352940.0
  ], 
  [
   74692, 
   null, 
   "Anastasia", 
   "http://www.whitehousedrugpolicy.gov/news/press03/091603.html\n\n \"The White House Office of National Drug Control Policy agrees. The organization started the 'Steer Clear of Pot,' campaign in September aimed at informing young people of the dangers of driving under the influence.\"\n \n What prohibitionists don't want you to know -\n \n Cannabis/Driving Studies Australia: No Proof Cannabis Put Drivers At Risk (2001) link\n \n UK: Cannabis May Make You A Safer Driver (2000) link \n \n University Of Toronto Study Shows Marijuana Not A Factor In Driving Accidents (1999) link \n \n Australia: Cannabis Crash Risk Less: Study (1998) link \n \n Australia: Study Goes to Pot (1998) [URL=http://www.mapinc.org/drugnews/v98/n947/a06.html \n ]link[/URL] \n \n \n * breaking pot news at the speed of bot http://drugpolicycentral.com/bot/pot", 
   {}, 
   74657, 
   null, 
   1099353660.0
  ], 
  [
   74712, 
   null, 
   "Master_Shake", 
   "You will notice that you are driving much better while stoned than you were when you were sleepy.\n\n \n How would you know? You couldn't objectively judge your driving while you were high.", 
   {}, 
   74683, 
   null, 
   1099359180.0
  ], 
  [
   74714, 
   null, 
   "Tboy321025", 
   "Neither is safe while driving. Lack of sleep is bad for drivers. Anything that distorts your view of reality and perception is dangerous when you drive. BUT alcohol being legal and more available causes more accidents and problems, if pot were more accessible I assume (and only assume) the amount of DUI's for pot and accidents would increase. Sort of saying access = accidents.\n\n \n This is completely true, it is just safer with pot, but that's not saying it's safe to begin with", 
   {}, 
   74643, 
   null, 
   1099359420.0
  ], 
  [
   74715, 
   null, 
   "Master_Shake", 
   "Can you site something that proves that someone died because they smoked pot? There is no evidence that anyone has ever overdosed by smoking pot. There is no overdose limit for THC (unless you start shooting for hundreds of times the normal amount injested, but at that rate water becomes lethal).\n \n Are you saying that smoking pot may give you lung cancer? So? That means you agree with outlawing cigarettes. Is that what we should do? outlaw tobacco? I might agree with you, but I don't think there should be laws that control what you do with your own body. \n \n The only \"proof\" that anyone has for pot being safer than booze when behind the wheel is the number of people killed or injured in accidents where the driver was drunk (lots) and the number of injuries/fatalities caused by people being stoned (none). it also has to do with the fact that marijuana doesn't affect coordination. It may affect reaction time, but I'd have to find a study or something. \n\n \n I wasn't talking about overdoses and you know that because I made that clear. And I wasn't arguing for or against the legalization of pot either. I was merely discussing the health risks involved. And as joebrummer pointed out, the reason there are more accidents as a result of alcohol is because there is much easier access to alcohol.", 
   {}, 
   74605, 
   null, 
   1099359480.0
  ], 
  [
   74723, 
   null, 
   "joebrummer", 
   "Do you know of any dysfunctional pot smokers? \n \n\n \n Lets keep in mind I work in mental health and substance absue. I hear of all sorts of stuff. Like any other addiction there are very functional addicts and very disfunctional addicts. Here in Rhode Island, the mayor of my town was re-elected after being arrested for possession (he claims it wasn't his). \n \n As for driving while stoned. You can go and find all the studies you want but who funded them and why? Of course the pot heads went out and did a study that says that people are fine when they drive. Hell the evaulators for the study could have been stoned. We don't know hoe reliable those studies are. How the results been duplicated?\n \n If anyone thinks they drive better when they are stoned, I am sure I can come up with hundreds of stories from thsoe who stopped smoking and all say the same thing. You only think youare more creative, more alert, more hip. Really you are just stoned. Large amounts of Dopamine have been sent off by the brain into the hypothalmus and suddenly your the queen of england and do everything better. You need to understand brain chemistry to understand, you think one thing, but the reality is distorted greatly.", 
   {}, 
   74681, 
   null, 
   1099362600.0
  ], 
  [
   74725, 
   null, 
   "Anastasia", 
   "Lets keep in mind I work in mental health and substance absue. .\n\n I understand what you are saying, and any study from anyone will be biased.. But I still think it should be legal to the same level alcohol is. Any mind altering substance is a bad idea to drive on, I wonder how many people have been in an accident because they took Benedryl for their allergies, we could argue this all day.\n Point is.. we will all choose our poisen.. be it good or bad and of course there are limits to everything...\n Joe I am just curious what do you do in the mental heath field, I am just curious :)", 
   {}, 
   74723, 
   null, 
   1099363860.0
  ], 
  [
   74727, 
   null, 
   "joebrummer", 
   "I understand what you are saying, and any study from anyone will be biased.. But I still think it should be legal to the same level alcohol is. Any mind altering substance is a bad idea to drive on, I wonder how many people have been in an accident because they took Benedryl for their allergies, we could argue this all day.\n Point is.. we will all choose our poisen.. be it good or bad and of course there are limits to everything...\n Joe I am just curious what do you do in the mental heath field, I am just curious :)\n\n \n \n I pm'ed the answer to that question for you!", 
   {}, 
   74725, 
   null, 
   1099366440.0
  ], 
  [
   74797, 
   null, 
   "sinjin", 
   " ...the reason there are more accidents as a result of alcohol is because there is much easier access to alcohol.\n\n \n This not correct. There are more accidents with alcohol primarily because the effect of alcohol on motor skills is far more profound. Of course there are also many more alcohol users.", 
   {}, 
   74715, 
   null, 
   1099420080.0
  ], 
  [
   74802, 
   null, 
   "joebrummer", 
   "This not correct. There are more accidents with alcohol primarily because the effect of alcohol on motor skills is far more profound. Of course there are also many more alcohol users.\n\n \n \n Pot has just as many effects on motor skills, more importantly, reaction time. I am in agreement. Alcohol is more accessible. Pretty much any street corner there is a small pub, store or deli where you can grab a drink. Pot is a bit more rare, so of course there are less accidents with pot. If more people had it, there would be more accidents. That almost seems logical.", 
   {}, 
   74797, 
   null, 
   1099422060.0
  ], 
  [
   74815, 
   null, 
   "sinjin", 
   "Pot has just as many effects on motor skills, more importantly, reaction time. I am in agreement. Alcohol is more accessible. Pretty much any street corner there is a small pub, store or deli where you can grab a drink. Pot is a bit more rare, so of course there are less accidents with pot. If more people had it, there would be more accidents. That almost seems logical.\n\n \n Everyone who wants to get some grass is doing so. Of this I'm certain.", 
   {}, 
   74802, 
   null, 
   1099425960.0
  ], 
  [
   74819, 
   null, 
   "joebrummer", 
   "Everyone who wants to get some grass is doing so. Of this I'm certain.\n\n \n \n I doubt that. If there were stores on every corner selling it, more people would buy it! Maybe even some that are not currently users would become users. We may never know because that will never happen in the USA.\n \n In Amsterdam they have cafes and stores that sell it everwhere, they adverstise, they get \"NEW\" customers!", 
   {}, 
   74815, 
   null, 
   1099426560.0
  ], 
  [
   74824, 
   null, 
   "sinjin", 
   "I doubt that. If there were stores on every corner selling it, more people would buy it! Maybe even some that are not currently users would become users. We may never know because that will never happen in the USA.\n \n In Amsterdam they have cafes and stores that sell it everwhere, they adverstise, they get \"NEW\" customers!\n\n \n If it was sold on every corner legally there would be some new users of course. Some people just don't do things that are illegal. That number would likely be small since its illegality is not preventing most people from using any more than speed limit signs are preventing most of us from speeding.\n \n Have you been to Amsterdam? Cannabis products are not sold \"everywhere\". I believe the percentage of residents using is fairly close to that of any U.S. city. BTW there aren't clinics overflowing with \"brain damaged\" citizens there either.", 
   {}, 
   74819, 
   null, 
   1099427520.0
  ], 
  [
   74828, 
   null, 
   "pnac=ww3", 
   "How would you know? You couldn't objectively judge your driving while you were high.\n\n Huh? Have you ever smoked pot? You are aware of its quite innocuous high, I hope. It's not like taking a valium even. Look, let's change the experiment then. Get an objective observer (good luck) and they will find that the high person drove better than the sleepy person.\n \n \nI wasn't talking about overdoses and you know that because I made that clear. And I wasn't arguing for or against the legalization of pot either. I was merely discussing the health risks involved. And as joebrummer pointed out, the reason there are more accidents as a result of alcohol is because there is much easier access to alcohol.\n\n Ah, I thought this thread was about legalization. If some outside chance of getting cancer when you are old should be the criterion for banning a substance then tobacco should go the way of asbestos.\n \n And, no. Alcohol impairs coordination and reaction time. It also distorts your vision. Pot does none of these things. It may end up slowing reaction time, but only if the high has made you sleepier. If it's \"early weed\" you don't get the sleepy feeling, and I doubt (with lack of expermintation) that unless the weed made you less energetic, you wouldn't have a slowed reaction time.\n \n \nLets keep in mind I work in mental health and substance absue. I hear of all sorts of stuff. Like any other addiction there are very functional addicts and very disfunctional addicts. Here in Rhode Island, the mayor of my town was re-elected after being arrested for possession (he claims it wasn't his).\n\n Sounds like Marion Barry. :)\n \nAs for driving while stoned. You can go and find all the studies you want but who funded them and why? Of course the pot heads went out and did a study that says that people are fine when they drive. Hell the evaulators for the study could have been stoned. We don't know hoe reliable those studies are. How the results been duplicated?\n\n I don't need a study. Despite what master_shake says I can see for myself that I am not impaired (at least not detectably).\n \n \nIf anyone thinks they drive better when they are stoned, I am sure I can come up with hundreds of stories from thsoe who stopped smoking and all say the same thing. You only think youare more creative, more alert, more hip. Really you are just stoned. Large amounts of Dopamine have been sent off by the brain into the hypothalmus and suddenly your the queen of england and do everything better. You need to understand brain chemistry to understand, you think one thing, but the reality is distorted greatly.\n\n I don't think I'm more creative, alert (hah), or hip. I know I'm stoned, and it doesn't affect driving. I understand brain chemistry, probably better than you think. Nicotine is far worse for the brain than THC, for sure. I think you may have been watching \"Reefer Madness.\" No one thinks they are anything but stoned. Maybe some 13 year old kid trying it for the first time thinks he's cool. All I think is that it's been a poopy day and it's time to relax. That's what weed is for. When you feel all poopy at the end of a hard day, and your all achy and irritable, those couple of tokes just make that melt away.", 
   {}, 
   74712, 
   null, 
   1099429080.0
  ], 
  [
   75101, 
   null, 
   "Anastasia", 
   "http://www.norml.org/index.cfm?Group_ID=3442\n * Voters Nationwide Embrace Marijuana Law Reform Proposals\n \n ________________________________________________________\n Voters Nationwide Embrace Marijuana Law Reform Proposals\n Washington, DC: Voters nationwide approved numerous ballot proposals\n liberalizing marijuana laws, including a statewide measure in Montana\n legalizing the use of medicinal cannabis for medical purposes, and a\n citywide proposal in Oakland mandating police to make the prosecution of\n pot offenses the city's \"lowest law enforcement priority.\"\n While this year's election was not a clean sweep for marijuana law\n reform initiatives, voters backed the majority of proposals put before\n them, particularly on the municipal level.\n In Oakland, California, 64 percent of voters approved Measure Z, which\n directs the Oakland Police Department to make the \"investigation,\n citation, and arrest for private adult cannabis offenses the lowest law\n enforcement priority, effective immediately upon passage of this\n ordinance.\" Measure Z also mandates the city of Oakland \"to tax and\n regulate the sale of cannabis for adult use, so as to keep it off the\n streets and away from children and to raise revenue for the city, as soon\n as possible under state law.\"\n In Columbia, Missouri, voters backed a pair of measures seeking to\n liberalize local pot laws. Approximately 70 percent of voters approved\n The Missouri Medical Marijuana Initiative (Proposition 1), which amends\n the Columbia city criminal code so that \"adults who obtain and use\n marijuana and/or marijuana paraphernalia for medical purposes pursuant to\n the recommendation of a physician shall not be subject to any arrest,\n prosecution, punishment, or sanction.\"\n Six out of ten Columbia voters also approved The Missouri Smart\n Sentencing Initiative (Proposition 2), which amends the city criminal code\n to depenalize the possession of marijuana and/or paraphernalia to a\n fine-only offense.\n In Michigan, an estimated 75 percent of voters in Ann Arbor approved\n Proposal C, the Ann Arbor Medical Marijuana Act, which directs the city to\n allow qualified patients to possess and cultivate marijuana for medicinal\n purposes under the authorization of their physician. Detroit voters\n endorsed a similar initiatives this past August.\n In Montana, 63 percent of voters approved a similar statewide measure,\n I-148, which legalizes authorized patients to possess up to six marijuana\n plants and one usable ounce of marijuana to treat certain qualified\n medical conditions, including cancer, AIDS, and Multiple Sclerosis.\n Montana is the tenth state to exempt medicinal marijuana patients from\n state criminal penalties, and is the seventh to do so via state\n initiative. Other states that have enacted laws protecting qualified\n patients who use marijuana include: Alaska, California, Colorado, Hawaii,\n Maine, Maryland, Nevada, Vermont and Washington.\n In Massachusetts, voters in three state Senate and eight House\n districts overwhelmingly backed several non-binding \"public policy\n questions\" depenalizing the possession of marijuana for personal use, and\n legalizing the medical use of cannabis for patients who possess a doctor's\n authorization.\n On the local level, only one marijuana law reform proposal - Berkeley,\n California's Measure R, which sought to replace the city's 10-plant\n medical cannabis limit with an amount in accordance with a patient's needs\n - failed to gain majority support from voters.\n At the state level, both Oregon's Measure 33, which sought to greatly\n expand the state's existing medicinal cannabis law, and Alaska's Measure\n 2, which sought to eliminate all criminal penalties on the adult\n possession and use of marijuana and encouraged the state legislature to\n establish a system to regulate marijuana \"in a manner similar to alcohol\n or tobacco,\" failed to gain voter approval. Oregon voters rejected\n Measure 33 by a vote of 58 to 42 percent, while Alaskans voted against\n Measure 2 by a vote of 57 to 43 percent.\n NORML Foundation Executive Director Keith Stroup said that the outcome\n of yesterday's ballot initiatives was generally positive. \"What these\n results appear to be telling us is that Americans strongly support\n reforming America's marijuana laws, but that they prefer to do so\n incrementally,\" he said. \"The results, once again, affirm that a majority\n of US citizens strongly back the legalization of medical marijuana for\n qualified patients, and that they don't want adults who use marijuana\n responsibly to face arrest or jail.\"", 
   {}, 
   74828, 
   null, 
   1099520400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  legal weed", 
  "url": "http://www.4forums.com/political/health-debates/1212-legal-weed.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 1212, 
  "discussion_files": [
   [
    "20397.html", 
    "http://www.4forums.com/political/health-debates/1212-legal-weed-print.html"
   ], 
   [
    "20398.html", 
    "http://www.4forums.com/political/health-debates/1212-legal-weed-5-print.html"
   ], 
   [
    "20399.html", 
    "http://www.4forums.com/political/health-debates/1212-legal-weed-4-print.html"
   ], 
   [
    "20400.html", 
    "http://www.4forums.com/political/health-debates/1212-legal-weed-3-print.html"
   ], 
   [
    "20401.html", 
    "http://www.4forums.com/political/health-debates/1212-legal-weed-2-print.html"
   ]
  ], 
  "identifier": 1212
 }
]