[
 [
  [
   337805, 
   null, 
   "Matt Dillon", 
   "Simply state what Christmas means to you (I don't really see a need for debate or antagonism in this thread). \n \n I'll go first - I found a couple of poems which seem to sum it all up: \n \n Edgar Albert Guest writes about the spirit of Christmas in At Christmas. Read this famous work of poetry for the holiday.\n \n A man is at his finest towards the finish of the year;\n He is almost what he should be when the Christmas season is here;\n Then he's thinking more of others than he's thought the months before,\n And the laughter of his children is a joy worth toiling for.\n He is less a selfish creature than at any other time;\n When the Christmas spirit rules him he comes close to the sublime.\n \n When it's Christmas man is bigger and is better in his part;\n He is keener for the service that is prompted by the heart.\n All the petty thoughts and narrow seem to vanish for awhile\n And the true reward he's seeking is the glory of a smile.\n Then for others he is toiling and somehow it seems to me\n That at Christmas he is almost what God wanted him to be.\n \n If I had to paint a picture of a man I think I'd wait\n Till he'd fought his selfish battles and had put aside his hate.\n I'd not catch him at his labors when his thoughts are all of pelf,\n On the long days and the dreary when he's striving for himself.\n I'd not take him when he's sneering, when he's scornful or depressed,\n But I'd look for him at Christmas when he's shining at his best.\n \n Man is ever in a struggle and he's oft misunderstood;\n There are days the worst that's in him is the master of the good,\n But at Christmas kindness rules him and he puts himself aside\n And his petty hates are vanquished and his heart is opened wide.\n Oh, I don't know how to say it, but somehow it seems to me\n That at Christmas man is almost what God sent him here to be.\n \n \n From Wilfred A. Peterson, The Art of Living\n Christmas is not in tinsel and lights and outward show. The secret lies in an inner glow. It's lighting a fire inside the heart. Good will and joy a vital part. It's higher thought and a greater plan. It's glorious dream in the soul of man.\n \n Hope everyone has a Merry Christmas and a Happy New Year. emoticon_xhoho\n \n - Matt", 
   {
    "post_info": {
     "post_title": "What does Christmas mean to you?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1230056340.0
  ], 
  [
   337833, 
   null, 
   "Zardoz", 
   "The first thing that pops into my head is...\n \n A moist, wet vagina. ;)", 
   {}, 
   337805, 
   null, 
   1230084840.0
  ], 
  [
   337865, 
   null, 
   "obvious_child", 
   "Usually it meant coming dividends. Not this year.", 
   {}, 
   337833, 
   null, 
   1230104580.0
  ], 
  [
   337866, 
   null, 
   "Archangel", 
   "In spite of the pagan symbolism which permeates the holiday, and the commercialism which defines it in this Country today, Christmas still represents the unconditional love which God has for all of humanity to some of us, in that He sent His only begotten Son to first live as a perfect example of the holy standards we can live up to, and then He willingly gave His life in order to redeem us by personally taking our sins upon Himself in death. \n \n He then defeated death by rising from the grave, thereby assuring all who receive Him have also died with Him on the Cross and therefore will live with Him for eternity. This is where the term \"born again\" comes from as we are in this world, but no longer of it. All of this was a direct result of what we refer to as the Nativity. The birth of Jesus Christ, the Messiah, was the most important and relevant event in the history of the world since Man occupied the Garden of Eden.\n \n All of the violence, evil and mans inhumanity to man which has taken place throughout the history of this Planet pales in comparison to the good that was accomplished, and the expression of unconditional love which that one single life accomplished 2000 years ago on Calvary. That is what Christmas means to me.", 
   {}, 
   337865, 
   null, 
   1230107700.0
  ], 
  [
   337867, 
   null, 
   "hollyh", 
   "Its one of the few moments in each year where my entire family joins together in body, mind and soul to celebrate. No-one is wishing they weren't here, thinking about chores they should be doing, bills that need paying ...\n Everyone, for one fleeting moment is here and joyous that each other is here. So for me, on this day it means family! the lifetime of happy memories i have with the family i love dearly.", 
   {}, 
   337866, 
   null, 
   1230109320.0
  ], 
  [
   337870, 
   null, 
   "Winston Smith", 
   "AMEN TO THAT emoticon_xgood", 
   {}, 
   337867, 
   null, 
   1230121380.0
  ], 
  [
   337872, 
   null, 
   "Penfold", 
   "Brussels sprouts and longer days. (not necessarily in that order)", 
   {}, 
   337870, 
   null, 
   1230126720.0
  ], 
  [
   337910, 
   null, 
   "jitobear", 
   "Partying with the family, nummy food, and a bit-o-stress.", 
   {}, 
   337872, 
   null, 
   1230166440.0
  ], 
  [
   337952, 
   null, 
   "simone", 
   "Peace be with you.", 
   {}, 
   337910, 
   null, 
   1230231480.0
  ], 
  [
   337974, 
   null, 
   "unkerpaulie", 
   "Christmas is the time of year when my family expects me to give them gifts and expects me to expect gifts from them as well. It represents a huge obligation to spend more than usual and put myself under more financial strain than normal. \n \n Without christmas I would have a bit more funds going into the new year. Also acts of generosity would be more spontaneous and reflect people's affection (or surplus of cash) more accurately.", 
   {}, 
   337952, 
   null, 
   1230311160.0
  ], 
  [
   338045, 
   null, 
   "simone", 
   "You know, I am offended by the first post and its emphasis on:\n \nA man is at his finest towards the finish of the year;\n\n Christmas wouldn't even exist without the incredible amount of work done by women.\n \n Women work to make Christmas what it is. They plan and cook and bake and clean and decorate, they choose the gifts that bring happiness to others, they make enormous personal sacrifrices of their time, energy and resources to make Christmas happen.\n \n I am truly sick and tired of a male Santa Claus getting all the credit for the enormous amount of work that women do to make Christmas happen.", 
   {}, 
   337974, 
   null, 
   1230405540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What does Christmas mean to you?", 
  "url": "http://www.4forums.com/political/religion-debates/12143-what-does-christmas-mean-you.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12143, 
  "discussion_files": [
   [
    "1180.html", 
    "http://www.4forums.com/political/religion-debates/12143-what-does-christmas-mean-you-print.html"
   ]
  ], 
  "identifier": 12143
 }
]