[
 [
  [
   338339, 
   null, 
   "Matthew", 
   "Again, by way of taking my own advice...\n \n 1. Does God exist? How do you know?\n \n 2. What is God? How do you know?", 
   {
    "post_info": {
     "post_title": "The existence and nature of God"
    }
   }, 
   null, 
   null, 
   1230709320.0
  ], 
  [
   338369, 
   null, 
   "iangb", 
   "This is a copy-pasted post of mine from a different forum, rehashed a little to add context. It sums me up pretty well, although I need to get around to rewriting it at some point. I've been meaning to make a topic entitled 'why do you believe what you believe' for ages...\n \n **************\n \n Three parts to my answer. Why I'm agnostic, why I'm atheist, and a middle bit, which is either (most likely) ignorable or the most important part. This applies to Christianity specifically.\n \n Why I'm agnostic:\n It's... tricky. You can disprove Christianity based on logic and flaws in the bible - ultimately by applying logic to the bible. But if God exists, and is truly omnipotent, then He trancendes logic, so any logical argument falls foul. Similarly any flaws in the bible are laid aside as 'metaphor', or 'translation problems', or any other features of mankind's inherent corruption. And pretty much everything else falls under the domain of ineffability - just because it doesn't make sense to me doesn't mean that it isn't true.\n In short, it's easy to disprove God if you assume first that He doesn't exist. If you assume He does exist, then all of the logic you can come up with is inapplicable.\n \n The middle bit:\n It is becoming increasingly hard to define a 'true Christian'. There is fundamentalism, which, IMO, is blatantly absurd and potentially incredibly harmful to humanity (although, even then, I could be wrong). There are more moderate Christians, those who blindly follow their faith and those who have looked into their faith and are satisfied with it. Then there are those who believe in Christ and God, but have distanced themselves from organised religion. Of those three the choice is difficult.\n Fundamentalism is, from my current viewpoint, insane (see here here for a nice example). But if God does exist and the bible is 100% true (due to unknown God-powers that contradict observable reality) then it is the only correct path. The moderate path is equally valid if it is correct, and is far less harmful than fundamentalism. The non-organised-religion path is the most free from human corruption, but many church-goers would argue that it does not count as true Christianity.\n Opinion-wise, I'd say that the more liberal the religion, the better (so non-organised is my favourite). This has nothing to do with proof (to me, all paths are unprovable and unprovable), but it does aid in choice.\n \n Why I'm atheist:\n So, God is unprovable, and un-dis-provable. All that is left is the choice. And I, personally, see no need for God. I see not God, but a God of the Gaps, which humanity has used to explain away all that is currently not understood. And as I want to discover more about the universe, I do not want to be able to just fall back and say \"oh, God did it\". That's the easy way out. I feel I can live my life well, following my own moral code, without a metaphorical Father always keeping His eye on me to make sure I obey, or forcing me through pointless ritual.\n \n My main beef with Christianity is that it separates action from faith. To go to heaven, Jesus proclaims, all you have to do is believe in Christ and ask for forgiveness. Although this implies you have to act in a good way, it never states this, nor does it really tell you what a 'good' way is - thanks to our good friend the Old Testament and its outdatedness and openness to misinterpretation. I'm never sure I want to be part of a faith where all that matters is your beliefs, not your deeds. To quote Terry Pratchett: \"if you stopped telling people it's all sorted out after they're dead, they might try sorting it all out while they're alive\".\n \n ~iangb, metanet forums.", 
   {}, 
   338339, 
   null, 
   1230743820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The existence and nature of God", 
  "url": "http://www.4forums.com/political/religion-debates/12166-existence-nature-god.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12166, 
  "discussion_files": [
   [
    "1080.html", 
    "http://www.4forums.com/political/religion-debates/12166-existence-nature-god-print.html"
   ]
  ], 
  "identifier": 12166
 }
]