[
 [
  [
   338808, 
   null, 
   "Superlite27", 
   "I keep seeing America's rate of gun ownership and violent crime statistics referred to as if they are one and the same.\n \n Those who would remove our freedom to defend ourselves always seem to link the number of guns to the high rate of gun crime.\n \n The debunked Kellerman study (which many here still religiously cling to) states that households with firearms are more likely to result in a member of that household being shot.\n \n Well DUH!\n \n I bet houses with swimming pools are more likely to have drownings.\n \n I bet two story houses are more likely to have people injured from falling down stairs.\n \n I bet people who ride in cars are more likely to be in a traffic accident.\n \n I bet people who hit themselves with hammers are more likely to have bruises.\n \n How is this statement of fact supposed to be relevant to VIOLENT CRIME?\n \n I bet households with firearms are more likely to result in self defense shootings as well, but this gets overlooked for the shock value of the meaningless statistic and its manipulation to achieve a desired result.\n \n I propose that, while the number of guns can indeed be related to the number of shootings, (duh) it is irrelevant to the gun control argument because the opposite is also true. The fact that more uses in self defense will also occur gets conveniently ignored by those who would choose to ban firearms.\n \n If you have \"action A\" resulting in both \"effect B\" and \"effect C\", is it honest to use \"effect B\" as a complete justification while completely ignoring \"effect C\" which refutes it?", 
   {
    "post_info": {
     "post_title": "Skewed Statistics"
    }
   }, 
   null, 
   null, 
   1231029540.0
  ], 
  [
   339582, 
   null, 
   "Galileo", 
   "I keep seeing America's rate of gun ownership and violent crime statistics referred to as if they are one and the same.\n \n Those who would remove our freedom to defend ourselves always seem to link the number of guns to the high rate of gun crime.\n \n The debunked Kellerman study (which many here still religiously cling to) states that households with firearms are more likely to result in a member of that household being shot.\n\n I have heard many gun activists make this claim, but I have yet to see anybody prove that his studies have been debunked. On the other hand, I have seen a lot of bogus criticisms made by pro-gun activists of his studies.\n For example- http://www.4forums.com/political/gun-control-debates/11460-9-myths-gun-control.html \n \n \n\n Well DUH!\n \n I bet houses with swimming pools are more likely to have drownings.\n \n I bet two story houses are more likely to have people injured from falling down stairs.\n \n I bet people who ride in cars are more likely to be in a traffic accident.\n \n I bet people who hit themselves with hammers are more likely to have bruises.\n \n How is this statement of fact supposed to be relevant to VIOLENT CRIME?\n \n I bet households with firearms are more likely to result in self defense shootings as well, but this gets overlooked for the shock value of the meaningless statistic and its manipulation to achieve a desired result.\n \n I propose that, while the number of guns can indeed be related to the number of shootings, (duh) it is irrelevant to the gun control argument because the opposite is also true. The fact that more uses in self defense will also occur gets conveniently ignored by those who would choose to ban firearms.\n \n If you have \"action A\" resulting in both \"effect B\" and \"effect C\", is it honest to use \"effect B\" as a complete justification while completely ignoring \"effect C\" which refutes it?\n\n Sounds like a strawman argument to me. Who's ignoring effect C? It has been addressed several times on this forum and the best evidence available shows that effect B is greater than C.", 
   {}, 
   338808, 
   null, 
   1231512900.0
  ], 
  [
   339595, 
   null, 
   "NATO 556", 
   "Galileo-\n \n For over 30 years Washington DC had a total prohibition of operational firearms. It was absolutely impossible to get a handgun, and nearly impossible to get a rifle or shotgun. Nobody could ever, under any circumstances, take a gun outside of their home, and if you were caught with a gun in the city the police could arrest you just for that.\n \n Yet DC was known as the Murder Capital of the United States for most of that 30+ year span. If violent crime was truly linked to legal gun ownership, then DC shouldn't have had more than a maximum of five crimes per year. But they didn't, in 1989 DC was declared to be more deadly than ALL of Great Britain despite it's near total gun ban.\n \n How do you explain that?", 
   {}, 
   338808, 
   null, 
   1231517400.0
  ], 
  [
   339618, 
   null, 
   "Lurch907", 
   "I have heard many gun activists make this claim, but I have yet to see anybody prove that his studies have been debunked. On the other hand, I have seen a lot of bogus criticisms made by pro-gun activists of his studies.\n\n \n Come on Galileo, you have been shown plenty of evidence, statistics, and peer reviews that debunk the Kellerman study. Kellermans research was sloppy, his data cherry picked, his controls virtually non-existant, and his conclusions unfounded, all of which is not suprising from a gun-control activist. Just because you refuse to believe what you've been shown, doesn't make it any less valid.\n \n \nWho's ignoring effect C?\n\n \n Well, Kellerman for one.\n \n \nIt has been addressed several times on this forum and the best evidence available shows that effect B is greater than C. \n\n \n Really, with C being between 1/2 and 2 million defensive gun uses per year. Or perhaps the hundreds of millions of legal, non-defense related, gun uses per year. When you compare the number times a guns are used legally to the number of times they are used illegally, B becomes pretty insignificant.", 
   {}, 
   339582, 
   null, 
   1231528020.0
  ], 
  [
   339619, 
   null, 
   "Superlite27", 
   "I have yet to see anybody prove that his studies have been debunked.\n\n \n Kellerman used suicides and spousal murder in his stats.\n \n So, if a person premeditates an intended result and INTENTIONALLY uses his gun to end his life, this would contribute to \"used against the owner\".\n \n Good thing he didn't INTENTIONALLY hang himself. Then this couldn't be used in the study.\n \n Discounting INTENTIONAL uses for suicide, (it's the intent to die, not the firearm that ended in the \"use of a firearm against its owner\") the ratio drops to somewhere near 5 times more likely to be \"used against its owner\".\n \n But, wait! There's more!\n \n Kellerman also included cases of INTENTIONAL spousal murder where the homeowners firearm was used. \n \n Good thing wifey decided to use his gun and not POISON HIS CHEERIO'S! Then this premeditated INTENTIONAL plan resulting in the objective death can be counted. Had she decided to run over him with the family mini-van instead of the gun (achieving the intended result) this could not be used in the study.\n \n Do you think, possibly, someone with the INTENTIONAL and PREMEDITATED plan to end his own, or his spouse's life might still do so if a firearm wasn't available?\n \n Yeah right. \"Hi! I'm Joe Snuffy and I'm going to kill myself. What? I don't have a gun? Wow. I guess I can't commit suicide then!\".\n \n Once you remove PREMEDITATED spousal murder, a firearm is now MORE THAN TWICE AS LIKELY to be used to defend the homeowner.\n \n You are left with accidental deaths, which is the only legitimate argument against guns in the home.\n \n Still want to use the accidental death argument? Careful, careful!\n \n Accidental firearm deaths are so far down the list, it's not even worth it.\n \n If you want to scream and shout about banning firearms to prevent accidents, you'll have to save the children by banning bicycles first since they are more likely to result in the death of a child. Followed by swimming pools, stairs, and plastic bags. Then chemicals. Then five gallon buckets. THEN firearms. Way down the list. A person who said \"I want to ban swimming pools to save childrens lives!\" would make more sense and be more effective in achieving their desired outcome than someone wanting to ban firearms for safety. \n \n You want stats? Just Google \"National Safety Council\" and \"injury facts\" for actual \"real\" statistics rather than \"I have an agenda, so I'm going to make up a study and include stuff that supports it even if it's ####\" like Kellerman.\n \n You don't need to be some big, hot-shot university type to debunk Kellerman, you just have to use your brain to think, rather than blindly follow.\n \n \nI have yet to see anybody prove that his studies have been debunked.\n\n \n TA-DA! Now you have. So glad to offer up something useful.", 
   {}, 
   339595, 
   null, 
   1231529280.0
  ], 
  [
   339620, 
   null, 
   "Superlite27", 
   "\n Really, with C being between 1/2 and 2 million defensive gun uses per year. Or perhaps the hundreds of millions of legal, non-defense related, gun uses per year. When you compare the number times a guns are used legally to the number of times they are used illegally, B becomes pretty insignificant.\n\n \n Don't forget! These are REPORTED uses. How about the lady who is accosted by a rapist in a dark parking lot, scares him off by showing him a gun, and it is never reported? \n \n 1/2 and 2 million REPORTED defensive gun uses per year. I wonder how many are unreported? Quite a few, I'd imagine.\n \n But, of course, the amount of guns goes up (A) the amount of shootings go up (B)...................\n \n \n \n .......(and the amount of self defense cases go up (C)...but we'll conveniently ignore that.", 
   {}, 
   339618, 
   null, 
   1231529580.0
  ], 
  [
   339653, 
   null, 
   "sinjin", 
   "1/2 and 2 million REPORTED defensive gun uses per year. I wonder how many are unreported? Quite a few, I'd imagine. \nI wonder how many are exaggerated.", 
   {}, 
   339620, 
   null, 
   1231543140.0
  ], 
  [
   339661, 
   null, 
   "Superlite27", 
   "I wonder how many are exaggerated.\n\n \n \n Oh, probably about as many as there are killed by bayonet lugs, pistol grips, heat shields, detachable magazines, and folding stocks.", 
   {}, 
   339653, 
   null, 
   1231547760.0
  ], 
  [
   339672, 
   null, 
   "sinjin", 
   "Oh, probably about as many as there are killed by bayonet lugs, pistol grips, heat shields, detachable magazines, and folding stocks.\n\"Survey Research and Self-Defense Gun Use: An Explanation of Extreme Overestimates, David Hemenway, PhD, The Journal of Criminal Law & Criminology, Vol. 87, No. 4, 1997, pp. 1430-1445.\n \n This paper analyzes survey methodology by Gary Kleck and Marc Gertz, who estimate that civilians use guns in self-defense against offenders up to 2.5 million times each year. This estimate is based on a survey of civilian defensive gun use in 1992 and has been repeatedly by the NRA and gun advocates. This paper concludes that the Kleck and Gertz survey design contains a huge overestimation bias and that their estimate is highly exaggerated. \n \n This paper illustrates the overestimation problem found in Kleck and Gertz's methodology by applying it to a 1994 ABC News/ Washington Post survey of 1500 adults of which 10 percent answered affirmatively as to whether they had ever seen an alien spacecraft. Of these, six percent stated they had come into contact with a space alien. If extrapolated to the national population using Kleck and Gertz's methodology, this would translate into almost 20 million Americans who had seen a spacecraft from another planet and more than a million who had actually met space aliens.\"\n VPC - Where Did You Get That Statistic?", 
   {}, 
   339661, 
   null, 
   1231551300.0
  ], 
  [
   339678, 
   null, 
   "NATO 556", 
   "Sinjin-\n \n The VPC is a non-credible source, citing them just weakens your argument. Their agenda is expanding gun control further than it is now. Of course they're going to say that more guns means more crime, more violence, and more death.", 
   {}, 
   339672, 
   null, 
   1231558800.0
  ], 
  [
   339680, 
   null, 
   "Penfold", 
   "I keep seeing America's rate of gun ownership and violent crime statistics referred to as if they are one and the same. ...........\n\n \n \n Then you will have no problem providing..........five examples at random, since they are such a frequent occurrence.", 
   {}, 
   338808, 
   null, 
   1231560900.0
  ], 
  [
   339702, 
   null, 
   "Superlite27", 
   "Then you will have no problem providing..........five examples at random, since they are such a frequent occurrence.\n\n \n \n Only five? You must just want the recent ones. \n \n Robbery victim saved in Dixwell shootout- The New Haven Register - Serving Greater New Haven, CT\n \n Intruder Killed In Apartment Shootout - Cincinnati News Story - WLWT Cincinnati\n \n Police: Man shot, killed robber who was beating woman -- OrlandoSentinel.com\n \n Victim Shoots And Kills Robbery Suspect - News Story - WFTV Orlando\n \n KFDA - NewsChannel 10 / Amarillo, TX: newschannel10.com - Police: Homeowner Fatally Shoots Alleged Robber\n \n Man, 93, shoots alleged intruder\n \n Police: Jewelry Store Owner Shoots Thieves - Phoenix News Story - KPHO Phoenix\n \n Burglar flees after resident fires shot : Local News : Ventura County Star\n \n Pembroke Pines store manager shoots armed robbers - Breaking News - MiamiHerald.com\n \n \n Homeowner opens fire on burglar | Dothan Eagle\n \n Ocoee man, 91, shoots at, repels home invaders who threatened his wife -- OrlandoSentinel.com\n \n Mugging Suspect Shot By Witness At Mall - Central Florida News 13\n \n Man fatally shot during robbery identified | IndyStar.com | The Indianapolis Star\n \n Suspect shot to death during apparent home burglary in Myrtle Beach | SCNow\n \n upstatetoday.com - Upstate South Carolina's leading news and information Web site | The Daily Journal, Daily Messenger, Upstate Lake Living, Golden Corner Shopper\n \n Columbus Man Killed While Burlarizing A Home | WRBL - News 3, Columbus GA and Opelika-Auburn AL\n \n http://www.myfoxdfw.com/myfox/pages/Home/Detail?contentId=8100189&version=3&locale=EN-US&layoutCode=TSTY&pageId=1.1.1\n \n Update: Malvern Man Holds Intruder At Gunpoint Until Police Arrive - todaysthv.com | KTHV | Little Rock, AR\n \n \n WIS News 10 - Columbia, South Carolina | Newberry police: One dead, four charged in apparent robbery attempt\n \n Police: Liquor Store Owner Kills Would-be Robber|ABC 7 News\n \n Lexington man shoots, kills intruder - Latest News - Kentucky.com\n \n Deseret News | Burglary goes bad when would-be thief, homeowner trade shots in Ogden\n \n WBNS 10TV : Man Fires Shots At Intruders, Thwarts Home Robbery - WBNS-10TV, Central Ohio's News Leader\n \n Woman shoots home invader through abdomen | andrews, haven, lynn - News - NWFDailynews.com\n \n Trapper Creek man is shot, then arrested: Mat-Su | adn.com\n \n Sheriff: Man Shot During Home Invasion\n \n SAN FRANCISCO / Auto shop owner acquitted in killing\n \n WCAX.COM Local Vermont News, Weather and Sports-Murder Charges Dropped, Shooting Was Self-Defense\n \n Police: Robber shot by would-be victim | delawareonline | The News Journal\n \n WCAX.COM Local Vermont News, Weather and Sports-North Hero Burglary Suspect Arrested\n \n NewsChannel 5.com - Nashville, Tennessee - 69-Year-Old Shoots Home Intruder\n \n Man shot trying to steal SUV | clarionledger.com | The Clarion-Ledger\n \n \n \n I'd put a few hundered more if you want to go back more than a month or so, but I get tired of adding all the links.\n \n I've sumbitted (and exceeded) what you have reasonably requested. Perhaps you would have no problem providing............five examples at random of an individual's life who was saved by a gun control law since this is such a frequent occurrence?", 
   {}, 
   339680, 
   null, 
   1231607820.0
  ], 
  [
   339713, 
   null, 
   "Penfold", 
   "You missed the question. Try again for comprehension.", 
   {}, 
   339702, 
   null, 
   1231613220.0
  ], 
  [
   339726, 
   null, 
   "Superlite27", 
   "You missed the question. Try again for comprehension.\n\n \n Hmmm. Here's a couple of lines from MY original post:\n \n I propose that, while the number of guns can indeed be related to the number of shootings, (duh) it is irrelevant to the gun control argument because the opposite is also true. The fact that more uses in self defense will also occur gets conveniently ignored by those who would choose to ban firearms.\n \n If you have \"action A\" resulting in both \"effect B\" and \"effect C\", is it honest to use \"effect B\" as a complete justification while completely ignoring \"effect C\" which refutes it?\n \n You asked a reasonable request for me to verify my belief:\n \n \nThen you will have no problem providing..........five examples at random, since they are such a frequent occurrence. \n\n \n I've done so..IN SPADES! I then asked:\n \n \nPerhaps you would have no problem providing............five examples at random of an individual's life who was saved by a gun control law since this is such a frequent occurrence?\n\n \n Which gets this from you:\n \n \nYou missed the question. Try again for comprehension.\n\n \n No. I AM THE OP. You have completely ignored a question I posed by offering a counter question, have been answered IN SPADES, then completely ignored the follow up question I posed.\n \n Only one of us is answering questions, the other is ignoring effect C and trying their damnedest to obfuscate, therefore proving the original statement: \nThe fact that more uses in self defense will also occur gets conveniently ignored by those who would choose to ban firearms.\n\n \n Now, either buck-up and answer my question, since I bucked-up and answered yours, or else stop the obfuscation which proves my first point.\n \n \nPerhaps you would have no problem providing............five examples at random of an individual's life who was saved by a gun control law since this is such a frequent occurrence?\n \n \n After all, I posted the evident proof that firearms used in self defense save individual lives that you requested. Either you post the evident proof of your belief that gun control saves individual lives that I've requested, or it will become obvious that one of us is answering with the truth and the other is talking out of the side of their head.", 
   {}, 
   339713, 
   null, 
   1231623180.0
  ], 
  [
   339728, 
   null, 
   "Penfold", 
   "You posted an unfounded assertion, which I quoted, and asked for five examples of such statistical conflations which you suggest are commonplace. You produced an impressive list of sadly irrelevant links, which whilst constituting a response, do not address the question. This further emanation is similarly bereft of relevance to the point at issue.", 
   {}, 
   339726, 
   null, 
   1231624140.0
  ], 
  [
   339754, 
   null, 
   "sinjin", 
   "Sinjin-\n \n The VPC is a non-credible source, citing them just weakens your argument. Their agenda is expanding gun control further than it is now. Of course they're going to say that more guns means more crime, more violence, and more death.\nThe report is from the USDoJ:\n http://www.ojp.usdoj.gov/bjs/pub/ascii/hvfsdaft.txt", 
   {}, 
   339678, 
   null, 
   1231631820.0
  ], 
  [
   339768, 
   null, 
   "NATO 556", 
   "Even if the supplied information was perfectly factual and without bias, what does it mean? Is saving lives worth taking away the rights of the people? When does security in exchange for freedom become too much and not cost effective?", 
   {}, 
   339754, 
   null, 
   1231635660.0
  ], 
  [
   339796, 
   null, 
   "Penfold", 
   "Even if the supplied information was perfectly factual and without bias, what does it mean? ...... \n\n \n It means your \"argument\" is screwed, and you have to resort to diversion and misdirection to save face......;) Again.", 
   {}, 
   339768, 
   null, 
   1231651080.0
  ], 
  [
   339799, 
   null, 
   "Ethmi", 
   "You added another person's comment to your sig? Sweet! My turn!", 
   {}, 
   339796, 
   null, 
   1231653720.0
  ], 
  [
   340417, 
   null, 
   "Galileo", 
   "Come on Galileo, you have been shown plenty of evidence, statistics, and peer reviews that debunk the Kellerman study. Kellermans research was sloppy, his data cherry picked, his controls virtually non-existant, and his conclusions unfounded, all of which is not suprising from a gun-control activist. Just because you refuse to believe what you've been shown, doesn't make it any less valid.\n\n Is that what you read on a pro-gun site? \n \n \n \n \nWell, Kellerman for one.\n\n Not in all his studies.\n \n \n \n \nReally, with C being between 1/2 and 2 million defensive gun uses per year. Or perhaps the hundreds of millions of legal, non-defense related, gun uses per year. When you compare the number times a guns are used legally to the number of times they are used illegally, B becomes pretty insignificant.\n\n The NCVS consistently shows about 100,000 defensive gun uses each year. Furthermore, if you use the same methodology that is typically used in defensive gun use studies to study criminal use of guns, you find even more people reporting that they have been a victim of a gun crime. \n \n \"Even after excluding many reported firearm victimizations, far more survey respondents report having been threatened or intimidated with a gun than having used a gun to protect themselves. A majority of the reported self defense gun uses were rated as probably illegal by a majority of judges. This was so even under the assumption that the respondent had a permit to own and carry the gun, and that the respondent had described the event honestly. CONCLUSIONS: Guns are used to threaten and intimidate far more often than they are used in self defense. Most self reported self defense gun uses may well be illegal and against the interests of society.\"\n Gun use in the United States: results from two nat...[Inj Prev. 2000] - PubMed Result\n \n And like Sinjin pointed out, using the same methodoloy also shows that millions of Americans have seen aliens or seen alien spacecraft. So the methodology that is typically used in defensive gun use studies is very questionable at best.", 
   {}, 
   339618, 
   null, 
   1232092020.0
  ], 
  [
   340418, 
   null, 
   "Galileo", 
   "Kellerman used suicides and spousal murder in his stats.\n \n So, if a person premeditates an intended result and INTENTIONALLY uses his gun to end his life, this would contribute to \"used against the owner\".\n \n Good thing he didn't INTENTIONALLY hang himself. Then this couldn't be used in the study.\n \n Discounting INTENTIONAL uses for suicide, (it's the intent to die, not the firearm that ended in the \"use of a firearm against its owner\") the ratio drops to somewhere near 5 times more likely to be \"used against its owner\".\n \n But, wait! There's more!\n \n Kellerman also included cases of INTENTIONAL spousal murder where the homeowners firearm was used. \n \n Good thing wifey decided to use his gun and not POISON HIS CHEERIO'S! Then this premeditated INTENTIONAL plan resulting in the objective death can be counted. Had she decided to run over him with the family mini-van instead of the gun (achieving the intended result) this could not be used in the study.\n \n Do you think, possibly, someone with the INTENTIONAL and PREMEDITATED plan to end his own, or his spouse's life might still do so if a firearm wasn't available?\n \n Yeah right. \"Hi! I'm Joe Snuffy and I'm going to kill myself. What? I don't have a gun? Wow. I guess I can't commit suicide then!\".\n\n An attempt to commit suicide with a gun is more likely to be successful. Doctors may still be able to save you after swallowing a bunch of sleeping pills, but they can't do much if you've blown off your head with a shotgun. \n \n \n\n Once you remove PREMEDITATED spousal murder, a firearm is now MORE THAN TWICE AS LIKELY to be used to defend the homeowner.\n\n I'm not sure how you reach that conclusion. \n \"After controlling for these characteristics, we found that keeping a gun in the home was strongly and independently associated with an increased risk of homicide (adjusted odds ratio, 2.7; 95 percent confidence interval, 1.6 to 4.4). Virtually all of this risk involved homicide by a family member or intimate acquaintance.\"\n NEJM -- Gun Ownership as a Risk Factor for Homicide in the Home \n \n \n \n\n You are left with accidental deaths, which is the only legitimate argument against guns in the home.\n \n Still want to use the accidental death argument? Careful, careful!\n \n Accidental firearm deaths are so far down the list, it's not even worth it.\n \n If you want to scream and shout about banning firearms to prevent accidents, you'll have to save the children by banning bicycles first since they are more likely to result in the death of a child. Followed by swimming pools, stairs, and plastic bags. Then chemicals. Then five gallon buckets. THEN firearms. Way down the list. A person who said \"I want to ban swimming pools to save childrens lives!\" would make more sense and be more effective in achieving their desired outcome than someone wanting to ban firearms for safety. \n\n More children die swimming or riding bikes? That's probably because children spend a lot more time doing those things than shooting firearms. That doesn't show which is more dangerous per minute of use.", 
   {}, 
   339619, 
   null, 
   1232092740.0
  ], 
  [
   340449, 
   null, 
   "NATO 556", 
   "An attempt to commit suicide with a gun is more likely to be successful. Doctors may still be able to save you after swallowing a bunch of sleeping pills, but they can't do much if you've blown off your head with a shotgun.\n\n \n That's if you're found in time. If the doctors can't get to you within so many minutes, the sleeping pills will kill you just as well as the shotgun to the head.\n \n \nMore children die swimming or riding bikes? That's probably because children spend a lot more time doing those things than shooting firearms. That doesn't show which is more dangerous per minute of use.\n\n \n The number of people who die every year in hospitals due to doctor incompetence is in the millions. One would think that hospital are like roach motels then.", 
   {}, 
   340418, 
   null, 
   1232119980.0
  ], 
  [
   340455, 
   null, 
   "Superlite27", 
   "\"Even after excluding many reported firearm victimizations, far more survey respondents report having been threatened or intimidated with a gun than having used a gun to protect themselves. A majority of the reported self defense gun uses were rated as probably illegal by a majority of judges. This was so even under the assumption that the respondent had a permit to own and carry the gun, and that the respondent had described the event honestly. CONCLUSIONS: Guns are used to threaten and intimidate far more often than they are used in self defense. Most self reported self defense gun uses may well be illegal and against the interests of society.\"\n\n \n \nfar more survey respondents report having been threatened or intimidated with a gun than having used a gun to protect themselves.\n\n \n I bet a survey of criminals would also result in using a gun to threaten or intimidate.\n \n Duh! What's the percentage of POSESSION of a firearm between criminals and law abiding citizens?\n \n If you have 100% of 1 million criminals using guns in crimes THERE'S 1 MILLION uses!\n \n Whereas if you have 1% of 100 million law abiding citizens who are armed, THERE'S 99 MIILION PEOPLE for this 1 million criminals to \"threateningly\" use their firearms on without the resultant defensive use!\n \n Both 1 million criminals and 1 million law abiding citizens are armed......but the criminals have a 99% chance of using theirs on an unarmed citizen! Whereas, the lawfully armed citizen has to WAIT until he is chosen by the criminal in order to defensively use his.\n \n Proving my point....Skewed stats.\n \n What if a criminal is going to murder Person A, but Person A diplays a handgun? This would be a defensive use, but isn't this \"threatening\" and \"intimidating\" the criminal? I guess, according to Kellerman, you can include this in the \"respondants reported being threatened or intimidated\" category.\n \n \n \nI'm not sure how you reach that conclusion. \n \"After controlling for these characteristics, we found that keeping a gun in the home was strongly and independently associated with an increased risk of homicide (adjusted odds ratio, 2.7; 95 percent confidence interval, 1.6 to 4.4). Virtually all of this risk involved homicide by a family member or intimate acquaintance.\"\n\n \n It didn't state whether it was justified or not. If your \"intimate acquaintance\" tried to kill you, and you defended yourself, it counts as \"used against the owner\". If you INTENTIONALLY killed your \"intimate acquaintance\" with a gun, it was also used. Good thing you used a gun and not an ice-pick. Otherwise, you couldn't be used in the study. \n \n It's the exact same with suicide because INTENTIONAL use was involved. PREMEDITATED. How can you say a gun is more likely to be used on its owner if the owner had jumped off a building rather than choose to shoot himself? IT'S THE END desire, not the means! What if he planned to drink anti-freeze? Nope. Slash his wrists? Nope. Shoot himself? YES! WE'LL INCLUDE THIS IN THE STUDY!\n \n If all the people who are now dead decided to jump in front of a train,your study results would be different but the people would still be DEAD! How does changing the means of death make anyone any safer? You are stating that a GUN INTENTIONALLY USED ON ONE'S SELF IS MORE LIKELY TO BE USED AGAINST ITS OWNER! DUH! How is intentional death with anti-freeze any safer than intentional death with a firearm?\n \n Your concoction of a hypothetical \"Doctors may still be able to save you after swallowing a bunch of sleeping pills\" sounds exactly like what it is.....grasping at straws. Doctors may still be able to save you if you're shot in the head instead of jumping off a 100 story building, but you didn't use jumping off a building instead of the sleeping pills because that particular statistic didn't support your cause, did it?\n \n Back to the point. In past tense, (We're looking at results, not future intentions) show me where death by intentional use of a firearm is more dangerous to the victim than intentional death by any other means. If you can't show me this, then you have to concede that the use of a firearm INTENTIONALLY by a firearm owner included in the Kellerman study and the exclusion of the use of anti-freeze achieving the SAME RESULT is \"skewed\".", 
   {}, 
   340449, 
   null, 
   1232126460.0
  ], 
  [
   340480, 
   null, 
   "iangb", 
   "Superlite:\n \n I suggest you look at this thread. It's a fairly comprehensive list (though I say so myself) of the arguments for/against the main studies on defensive gun use. I could repeat myself here, but I'd really rather not have to.", 
   {}, 
   338808, 
   null, 
   1232138160.0
  ], 
  [
   341091, 
   null, 
   "Galileo", 
   "I bet a survey of criminals would also result in using a gun to threaten or intimidate.\n \n Duh! What's the percentage of POSESSION of a firearm between criminals and law abiding citizens?\n \n If you have 100% of 1 million criminals using guns in crimes THERE'S 1 MILLION uses!\n \n Whereas if you have 1% of 100 million law abiding citizens who are armed, THERE'S 99 MIILION PEOPLE for this 1 million criminals to \"threateningly\" use their firearms on without the resultant defensive use!\n \n Both 1 million criminals and 1 million law abiding citizens are armed......but the criminals have a 99% chance of using theirs on an unarmed citizen! Whereas, the lawfully armed citizen has to WAIT until he is chosen by the criminal in order to defensively use his.\n \n Proving my point....Skewed stats.\n \n\n You seem to be proving the opposition's point since you're providing reasons why there should be more criminal uses of firearms than defensive uses. \n \n \n\n What if a criminal is going to murder Person A, but Person A diplays a handgun? This would be a defensive use, but isn't this \"threatening\" and \"intimidating\" the criminal? I guess, according to Kellerman, you can include this in the \"respondants reported being threatened or intimidated\" category.\n \n\n Studies that claim huge numbers of defensive guns uses don't take into account the possibility that many of these cases of claimed defensive gun use could actually be cases of gun owners threatening and intimidating innocent people with their guns. The person being interviewed naturally is likely to be biased in favor of their own position and they like to think that their brandishing of a gun was justified. \n \n \n\n It didn't state whether it was justified or not. If your \"intimate acquaintance\" tried to kill you, and you defended yourself, it counts as \"used against the owner\". If you INTENTIONALLY killed your \"intimate acquaintance\" with a gun, it was also used.\n\n However, such a small percentage of homicides are classified by the FBI as legally justified self defense killings so it would be unreasonable to suppose that the increase in homicide associated with guns ownership was mostly due to self defense killings. \n \n \n\n Good thing you used a gun and not an ice-pick. Otherwise, you couldn't be used in the study.\n\n The study did include other types of homicides (besides gun homicides) and found that the risk of homicide was greater in the homes of gun owners.\n \n \n\n It's the exact same with suicide because INTENTIONAL use was involved. PREMEDITATED. How can you say a gun is more likely to be used on its owner if the owner had jumped off a building rather than choose to shoot himself? IT'S THE END desire, not the means! What if he planned to drink anti-freeze? Nope. Slash his wrists? Nope. Shoot himself? YES! WE'LL INCLUDE THIS IN THE STUDY!\n \n If all the people who are now dead decided to jump in front of a train,your study results would be different but the people would still be DEAD! How does changing the means of death make anyone any safer? You are stating that a GUN INTENTIONALLY USED ON ONE'S SELF IS MORE LIKELY TO BE USED AGAINST ITS OWNER! DUH! How is intentional death with anti-freeze any safer than intentional death with a firearm?\n \n Your concoction of a hypothetical \"Doctors may still be able to save you after swallowing a bunch of sleeping pills\" sounds exactly like what it is.....grasping at straws. Doctors may still be able to save you if you're shot in the head instead of jumping off a 100 story building, but you didn't use jumping off a building instead of the sleeping pills because that particular statistic didn't support your cause, did it?\n\n Strawman argument. Other types of suicides (besides gun suicides) were included in this study and it was found that suicide is more common in the homes of gun owners. \n \"After we controlled for these characteristics through conditional logistic regression, the presence of one or more guns in the home was found to be associated with an increased risk of suicide (adjusted odds ratio, 4.8; 95 percent confidence interval, 2.7 to 8.5). CONCLUSIONS. Ready availability of firearms is associated with an increased risk of suicide in the home. Owners of firearms should weigh their reasons for keeping a gun in the home against the possibility that it might someday be used in a suicide.\"\n NEJM -- Suicide in the home in relation to gun ownership \n \n \n\n Back to the point. In past tense, (We're looking at results, not future intentions) show me where death by intentional use of a firearm is more dangerous to the victim than intentional death by any other means. If you can't show me this, then you have to concede that the use of a firearm INTENTIONALLY by a firearm owner included in the Kellerman study and the exclusion of the use of anti-freeze achieving the SAME RESULT is \"skewed\".\n\n That would be like arguing that a person that dies due to cigarette use is just as dead as some one who dies to due to other means. But that does nothing to shed light on the question of whether or not cigarette use leads to an increased risk of death just as your argument does nothing to tell us whether or not a gun leads to an increased risk of homicide.", 
   {}, 
   340455, 
   null, 
   1232546820.0
  ], 
  [
   341112, 
   null, 
   "NATO 556", 
   "Studies that claim huge numbers of defensive guns uses don't take into account the possibility that many of these cases of claimed defensive gun use could actually be cases of gun owners threatening and intimidating innocent people with their guns. The person being interviewed naturally is likely to be biased in favor of their own position and they like to think that their brandishing of a gun was justified.\n\n \n The burden of proof is on you. I want to see evidence that legal gun owners are making a habit of whipping out their piece and waving it in the faces of the people around them.\n \n \nHowever, such a small percentage of homicides are classified by the FBI as legally justified self defense killings so it would be unreasonable to suppose that the increase in homicide associated with guns ownership was mostly due to self defense killings.\n\n \n How exactly was \"legally justified\" reached in this case? Did they only look at cases where no charges were pressed against the person who defended themselves, or did the number also include all cases that went before the court but reached a not guilty verdict?\n \n \nThe study did include other types of homicides (besides gun homicides) and found that the risk of homicide was greater in the homes of gun owners.\n\n \n So now you're claiming that the gun is a sort of mystical object that, like a magnet, will draw death and violence to its location?\n \n \nStrawman argument. Other types of suicides (besides gun suicides) were included in this study and it was found that suicide is more common in the homes of gun owners.\n\n \n Japan is without access to guns, they still have a higher suicide rate than anyone. The latest fad in suicides over in Japan is with a cleaning chemical cocktail that results in a deadly gas.", 
   {}, 
   341091, 
   null, 
   1232558700.0
  ], 
  [
   341761, 
   null, 
   "Galileo", 
   "The burden of proof is on you. \n\n So people who constantly advocate the use of guns for self defense are not expected to back up their claims with proof? I am not so gullible. \n \n \nI want to see evidence that legal gun owners are making a habit of whipping out their piece and waving it in the faces of the people around them.\n\n Is this another one of your sneaky attempts to distort my argument because you have a hard time addressing my actual argument? I didn't say that gun owners habitually misuse their guns, but I have presented evidence to show that they use their guns illegally more often than they use guns to defend themselves. \n \n \n\n How exactly was \"legally justified\" reached in this case? Did they only look at cases where no charges were pressed against the person who defended themselves, or did the number also include all cases that went before the court but reached a not guilty verdict?\n\n Why would the FBI disagree with a not guilty verdict? Think about what you're saying. \n \n \n \n So now you're claiming that the gun is a sort of mystical object that, like a magnet, will draw death and violence to its location?\n\n LOL, :), a very obvious strawman argument.\n \n \n Japan is without access to guns, they still have a higher suicide rate than anyone. The latest fad in suicides over in Japan is with a cleaning chemical cocktail that results in a deadly gas.\n\n The higher rates of suicide can be explained by such things as cultural differences. This little bit of information tells us nothing about the relationship between gun ownership and suicide. It does not tell us whether the Japanese would have an even higher suicide rate if they owned a lot of guns. \n \n On the other hand, it's hard to explain the difference in suicide rates between Americans who own guns and Americans who don't without taking gun ownership into consideration.", 
   {}, 
   341112, 
   null, 
   1232961240.0
  ], 
  [
   341799, 
   null, 
   "NATO 556", 
   "I didn't say that gun owners habitually misuse their guns, but I have presented evidence to show that they use their guns illegally more often than they use guns to defend themselves.\n\n \n You've presented no such thing. All you've done is propose the possibility that people who carry their concealed firearms in a legal manner make it a habit to brandish their guns in a threatening manner when it wasn't called for. Well I'm not buying it. This is a bogus claim, and you've done nothing to try and support it.\n \n \nWhy would the FBI disagree with a not guilty verdict?\n\n \n Why would the ATF revoke an FFL license over an issue of \"MS\" instead of \"Mississippi\" being put on Form 4473?\n \n \nLOL, :), a very obvious strawman argument.\n\n \n You made the claim that homicide is much more likely when there's a gun in a home. If you choose to exclude all other possible factors that would affect this outcome, then the only answer left is that the gun has magical powers to draw violence to it. After all you discount the possibility of the house being in a high crime area, you disregard the concept that the person who more often dies than not is the home intruder, you don't address anything except whether or not there's a gun in the house, so what other conclusion are we supposed to arrive at?\n \n \nThe higher rates of suicide can be explained by such things as cultural differences. This little bit of information tells us nothing about the relationship between gun ownership and suicide. It does not tell us whether the Japanese would have an even higher suicide rate if they owned a lot of guns.\n\n \n You just said that Japan's higher suicide rate is because of cultural differences, and in the very next sentence claimed that there's no way to tell if the Japanese would still commit suicide in such numbers if they had access to guns like Americans do.\n \n \nOn the other hand, it's hard to explain the difference in suicide rates between Americans who own guns and Americans who don't without taking gun ownership into consideration.\n\n \n So now you're trying to claim that the gun itself has the ability to suggest suicide as an option? Not only have you made a piece of metal out as a magical magnet that draws death and destruction to its general area, you're also stating that it has the ability to influence its owner with the schizophrenic message of \"kill yourself...kill yourself...blow your brains out...end it all now...\"", 
   {}, 
   341761, 
   null, 
   1233001920.0
  ], 
  [
   341801, 
   null, 
   "jyoshu", 
   "More children die swimming or riding bikes? That's probably because children spend a lot more time doing those things than shooting firearms. That doesn't show which is more dangerous per minute of use.\n\n \n Well if they're not spending much time shooting firearms in the first place, then what are you worried about?", 
   {}, 
   340418, 
   null, 
   1233002520.0
  ], 
  [
   342039, 
   null, 
   "iangb", 
   "You made the claim that homicide is much more likely when there's a gun in a home. If you choose to exclude all other possible factors that would affect this outcome, then the only answer left is that the gun has magical powers to draw violence to it. After all you discount the possibility of the house being in a high crime area, you disregard the concept that the person who more often dies than not is the home intruder, you don't address anything except whether or not there's a gun in the house, so what other conclusion are we supposed to arrive at?\n\n Didn't I post something about this, too?\n \n\"Researchers have known for over 30 years that the mere presence of a weapon leads people to behave more aggressively than they do in situations where no weapon is present (e.g., Berkowitz & LePage, 1967; Carlson, Marcus-Newhall, & Miller, 1990).\"\n\n Yes, I did.", 
   {}, 
   341801, 
   null, 
   1233086340.0
  ], 
  [
   342042, 
   null, 
   "NATO 556", 
   "Didn't I post something about this, too?\n \n Yes, I did.\n\n \n And this would suggest that the gun has the magical ability to influence the behavior of whomever its in the presence of or act like a hallucinogenic drug.\n \n This entire statement amounts to the hypothesis that if you could travel back in time to the period of 1200 BC, find somebody at random and hand them a modern firearm, but teach them absolutely nothing about the operation or mechanics of it, then they'll somehow become far more violent than they would have been, simply because they now have a new piece of metal to play with.", 
   {}, 
   342039, 
   null, 
   1233087120.0
  ], 
  [
   342047, 
   null, 
   "iangb", 
   "And this would suggest that the gun has the magical ability to influence the behavior of whomever its in the presence of or act like a hallucinogenic drug.\n \n This entire statement amounts to the hypothesis that if you could travel back in time to the period of 1200 BC, find somebody at random and hand them a modern firearm, but teach them absolutely nothing about the operation or mechanics of it, then they'll somehow become far more violent than they would have been, simply because they now have a new piece of metal to play with.\n\n No, it doesn't - as I explained in the linked thread. To quote myself from there:\n \nThe general theme developed is one of contextual linking. Individuals associate guns with violence due to exposure to the media and the general uses of guns - one of the sources reports that the effect is lessened in hunters, because they do not associate guns with human-to-human violence as readily. On sensing the presence of the gun (or even a picture of a gun, in cases (again, see the sources)), this cue acts to 'remind' the individual of the violence that they perceive to be linked to the weapon, making them more aggressive. An analogy would be some phobias - people are afraid of apparently harmless objects because they associate a fear-causing situation with that object, just as seeing a gun causes someone to become more aggressive because they associate aggressiveness with the weapon.\nFrom post #66.\n After this point in the other thread, you asked for my evidence that this was the case, read the wrong link (an honest mistake, as I see it), and stopped posting.\n \n To summarise: people mentally link 'weapons' to 'aggression' - for a variety of reasons, not least of which is that weapons are by their nature often used aggressively. When a weapon is seen, therefore, the link is triggered and the person becomes more aggressive. The analogy is some phobias, where a person (for example) mentally links 'oranges' with 'fear' - perhaps because they were dropped as a child while eating an orange, or saw adverts for Orangeade in the queue for a scary film/theme park ride/etc. When seeing an orange, the fear kicks in.\n \n EDIT: A technological analogy would be one of the methods used by Google to determine page rank in a search, which were abused to create 'Googlebombs'. These 'bombs forced the search engine to semantically associate (for example) 'Miserable failure' with the George Bush biography.", 
   {}, 
   342042, 
   null, 
   1233089280.0
  ], 
  [
   342052, 
   null, 
   "NATO 556", 
   "To summarise: people mentally link 'weapons' to 'aggression' - for a variety of reasons, not least of which is that weapons are by their nature often used aggressively. When a weapon is seen, therefore, the link is triggered and the person becomes more aggressive. The analogy is some phobias, where a person (for example) mentally links 'oranges' with 'fear' - perhaps because they were dropped as a child while eating an orange, or saw adverts for Orangeade in the queue for a scary film/theme park ride/etc. When seeing an orange, the fear kicks in.\n\n \n Going by that it's the media that makes people violent, not the gun itself. The media in their biased approach to getting ratings, is constantly flooding the airwaves with the message of violence and the use of force against others, conditioning us so that we'll be more likely to act in a violent manner.\n \n The gun does nothing in this equation, it's just there. The media is the true problem. Stop them and force them to stop their ratings tactics, make them stop flashing headlines of \"AK-47 blah blah blah\" every two seconds, and maybe the proliferation of violence will decrease.", 
   {}, 
   342047, 
   null, 
   1233091980.0
  ], 
  [
   342056, 
   null, 
   "isly ilwott", 
   "It means your \"argument\" is screwed, and you have to resort to diversion and misdirection to save face......;) Again.\nThis description fits your own behavior far better than NATO's.\n \n \nStudies that claim huge numbers of defensive guns uses don't take into account the possibility that many of these cases of claimed defensive gun use could actually be cases of gun owners threatening and intimidating innocent people with their guns. The person being interviewed naturally is likely to be biased in favor of their own position and they like to think that their brandishing of a gun was justified.\nSuch studies do not justify establishment of hard and fast percentages representative of the the way things really are. Unless all gun owners are questioned, there is no valid extension of the results coming from a small pool of gun owners into an accurate description of gun owners in general. Also, your personal opinion of the surveyed gun owner's honesty is of no value.\n \n \n \nIs this another one of your sneaky attempts to distort my argument because you have a hard time addressing my actual argument? I didn't say that gun owners habitually misuse their guns, but I have presented evidence to show that they use their guns illegally more often than they use guns to defend themselves.\nI must have missed that. How many gun owners were surveyed? Where do they live? How do you know that an illegal act committed with a gun was done by the gun's owner? While it may be true that more illegal acts than protective measures are associated with guns, the extension to the average law abiding gun owner's habits is invalid.\n \n If I missed your link to the proof of your claim (that gun owners use their guns illegally more often than they use guns to defend themselves) please post it again. If there is no proof within it that the illegal users of the guns were indeed the legal owners of the guns they used, then your argument is flawed.", 
   {}, 
   342039, 
   null, 
   1233092280.0
  ], 
  [
   342061, 
   null, 
   "iangb", 
   "Going by that it's the media that makes people violent, not the gun itself. The media in their biased approach to getting ratings, is constantly flooding the airwaves with the message of violence and the use of force against others, conditioning us so that we'll be more likely to act in a violent manner.\n \n The gun does nothing in this equation, it's just there. The media is the true problem. Stop them and force them to stop their ratings tactics, make them stop flashing headlines of \"AK-47 blah blah blah\" every two seconds, and maybe the proliferation of violence will decrease.\n\n So censoring the free speech of the media is OK, but limiting your right to bear arms isn't?\n \n This also misses the fact that it's not just the media which is to blame. To quote myself yet again from the other thread (in the final post in that thread):\n \nAs far as I can see, there are three components to this 'chain'. Media linking guns and violence, reality linking guns and violence, and guns triggering the link. Ultimately, I agree that getting rid of the first two links would be a good thing... but for now, that third one is the only one which can be removed (and even then, with extreme caution).\n\n To summarise/rephrase this new quote - guns are intrinsically offensive weapons, and anyone who knows this will make that mental link to aggression, even if it is a tenuous one.\n \n I'd just add that this is irrelevant - the fact is, currently guns act as a trigger towards aggressive behaviour, for whatever reason this may be.\n \n EDIT:\n \nIf there is no proof within it that the illegal users of the guns were indeed the legal owners of the guns they used, then your argument is flawed.\n\n I believe that when Galileo said 'gun owner' he meant 'gun possessor', not 'legal gun owner'. I would be interested to see data on 'legal gun owners' though, although more so for 'owner of a legally purchased gun' data.", 
   {}, 
   342056, 
   null, 
   1233093900.0
  ], 
  [
   342064, 
   null, 
   "isly ilwott", 
   "...\n \n I believe that when Galileo said 'gun owner' he meant 'gun possessor', not 'legal gun owner'. I would be interested to see data on 'legal gun owners' though, although more so for 'owner of a legally purchased gun' data.\nThen he should have stated his claim that way. \n \n In that case I believe it is patently obvious....that guns are used (outside of warfare) more for illegal purposes than for defensive purposes. However, that does not project itself into a comparison of frequencies of illegal uses and legal uses since hunting, target practice, turkey shoots and deterrent presence (letting people know you are armed without brandishing a weapon) would not be considered \"pulling a gun on someone\" though each is an example of \"using a gun\".", 
   {}, 
   342061, 
   null, 
   1233095340.0
  ], 
  [
   342065, 
   null, 
   "chester", 
   "Even if the supplied information was perfectly factual and without bias, what does it mean? Is saving lives worth taking away the rights of the people? When does security in exchange for freedom become too much and not cost effective?\n\n \n I am sure you apply this standard to the CIA's \"enhanced interrogation techniques as well, right?", 
   {}, 
   339768, 
   null, 
   1233095760.0
  ], 
  [
   342066, 
   null, 
   "NATO 556", 
   "So censoring the free speech of the media is OK, but limiting your right to bear arms isn't?\n\n \n Is it free speech when the press is involved and what they report amounts to scare tactics? The media is running unchecked, they need to be reigned in and better regulated. They need to stop painting such a negative image of gun ownership, it amounts to slandering.\n \n \nThis also misses the fact that it's not just the media which is to blame. To quote myself yet again from the other thread (in the final post in that thread):\n\n \n For the quote to be factual then it would be necessary for contact with a gun to trigger an emotional or violent response, and do so in a repeated basis so it could be proven no matter how many times the experiment is carried out, to show that results can be duplicated.\n \n But such isn't the case. Somebody sees news that there was a drive by shooting and several people killed, but they never use their gun for anything more than recreational purposes, it blows your theory out of the water.\n \n \nTo summarise/rephrase this new quote - guns are intrinsically offensive weapons, and anyone who knows this will make that mental link to aggression, even if it is a tenuous one.\n\n \n I don't make that mental link even though I know the obviousness of it all. Am I the exception to the rule, or are you speaking in general terms?\n \n \nI'd just add that this is irrelevant - the fact is, currently guns act as a trigger towards aggressive behaviour, for whatever reason this may be.\n\n \n Bull! I've never seen a case of a person just suddenly going on a violent rampage and leaving a trail of blood, bodies and destruction in their wake just because somebody handed them a gun.\n \n Perhaps what you mean is that guns act as a trigger to aggressive behavior when applied to individuals that're predisposed towards violence against others, such as the criminal element?", 
   {}, 
   342061, 
   null, 
   1233096300.0
  ], 
  [
   342075, 
   null, 
   "iangb", 
   "Is it free speech when the press is involved and what they report amounts to scare tactics? The media is running unchecked, they need to be reigned in and better regulated. They need to stop painting such a negative image of gun ownership, it amounts to slandering.\n\n You seem to have a radically different definition of 'free speech' to me. Furthermore...\n If the media reports that a war exists, where guns are used in a violent manner, is this 'negative coverage'?\n If the media reports the latest shooting incident, is this 'negative coverage', even when many of them discuss the pro-gun arguments (with regards to columbine, VT etc)\n If the media reports a case where a gun has been used violently to prevent a crime, is this 'negative coverage'?\n What would you have the media report with regards to guns?\n \n @the rest of your post: you should really read the links. I'm talking about the observed fact that guns tend to increase aggressive behaviour in all people, as evidenced by the links I've posted. Not just criminals, not extreme responses, and not to an extent that cannot be controlled/affected - but it's there, nonetheless.\n \n \nEven if the supplied information was perfectly factual and without bias, what does it mean? Is saving lives worth taking away the rights of the people? When does security in exchange for freedom become too much and not cost effective?\nSee here for a fairly in-depth reply.\n \n \nIn that case I believe it is patently obvious....that guns are used (outside of warfare) more for illegal purposes than for defensive purposes. However, that does not project itself into a comparison of frequencies of illegal uses and legal uses since hunting, target practice, turkey shoots and deterrent presence (letting people know you are armed without brandishing a weapon) would not be considered \"pulling a gun on someone\" though each is an example of \"using a gun\".\nIn that case, let me make my own claim. Guns are used more often used to commit a crime than to defend against a crime - 'deterrent presence' and 'intimidatory presence' included. The relevant data is discussed here.", 
   {}, 
   342066, 
   null, 
   1233098760.0
  ], 
  [
   342079, 
   null, 
   "isly ilwott", 
   "...\n In that case, let me make my own claim. Guns are used more often used to commit a crime than to defend against a crime - 'deterrent presence' and 'intimidatory presence' included. The relevant data is discussed here.\nI'll need your guidance to find the proof. Am I to use Ethmi's link, or sinjin's link or your typed statements? I will not read the whole thread searching for it. I suggest you link me directly to the evidence.\n \n Frankly, I don't see how one could compile a list of instances wherein presence of a gun prevented a crime from happening. Have all the criminals been polled to say when they changed their minds about committing a crime because they detected a gun being in the possession of someone else on the scene? (Therefore, I cannot accept your statement that some pile of data is inclusive of such instances.)\n \n On edit:\n Additionally, there is still no argument presented to prove that gun control would make the ratio of criminal/defensive use of a gun anything but higher. Take the guns away from people that use them for defense and you'll have more gun crimes against people. The defensive uses will drop to near zero and the criminal uses will soar in comparison because the criminals will know that the victims shouldn't have guns.", 
   {}, 
   342075, 
   null, 
   1233101760.0
  ], 
  [
   342082, 
   null, 
   "iangb", 
   "I'll need your guidance to find the proof. Am I to use Ethmi's link, or sinjin's link or your typed statements? I will not read the whole thread searching for it. I suggest you link me directly to the evidence.\n \n Frankly, I don't see how one could compile a list of instances wherein presence of a gun prevented a crime from happening. Have all the criminals been polled to say when they changed their minds about committing a crime because they detected a gun being in the possession of someone else on the scene? (Therefore, I cannot accept your statement that some pile of data is inclusive of such instances.)\nGood point (on the whole 'statements' thing). I'll go link-hunting for ya.\n \n This post gives a medley of evidence. The main article I argued with was link #2 (full text here (pdf)), but the others look interesting (especially #4... I haven't looked at any of them in detail, though). Ethmi's source is here - which is worth mentioning because it states that the figures it calculates are inaccurate - a significant fact, given that it was designed to test out Kleck's methodology which gave the original high numbers.\n \n \nAdditionally, there is still no argument presented to prove that gun control would make the ratio of criminal/defensive use of a gun anything but higher. Take the guns away from people that use them for defense and you'll have more gun crimes against people. The defensive uses will drop to near zero and the criminal uses will soar in comparison because the criminals will know that the victims shouldn't have guns.\n\n I mean to go into this in more detail at some point soon - the short version, however, is to say that the reduction in gun availability will also affect criminals significantly if it is countrywide, which will cut down on crime. That reduction will outweigh the drop in self-defence, because there is much more crime than self-defence to be cut down on. It's a little more complicated than that, though.", 
   {}, 
   342079, 
   null, 
   1233104580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Skewed Statistics", 
  "url": "http://www.4forums.com/political/gun-control-debates/12178-skewed-statistics.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12178, 
  "discussion_files": [
   [
    "23994.html", 
    "http://www.4forums.com/political/gun-control-debates/12178-skewed-statistics-print.html"
   ], 
   [
    "23995.html", 
    "http://www.4forums.com/political/gun-control-debates/12178-skewed-statistics-3-print.html"
   ], 
   [
    "23996.html", 
    "http://www.4forums.com/political/gun-control-debates/12178-skewed-statistics-2-print.html"
   ]
  ], 
  "identifier": 12178
 }
]