[
 [
  [
   339490, 
   null, 
   "Teleological", 
   "Welcome to the Molecular Machines\n \n A thread to lump together all the interesting discoveries regarding the intracellular biomolecular machinery that are crucial for life to exist. Feel free to post interesting discoveries and perhaps describe the functionality of the intracellular biomolecular machines.\n \n Intracellular biomolecular machinery include the following:\n 1) DNA replication and repair machinery (replisome) \n 2) DNA transcription machinery and RNA processing and translation machinery (Spliceosomes and ribosomes)\n 3) Cell cycle signaling network (pRB, e2F, CDKs)\n 4) Programmed cell death machinery (Apoptosis, autophagy, mitotic catastrophe)\n 5) Protein processing machinery (Chaperones, ubiquitin-proteasome system)\n 6) Intracellular signaling networks (protein kinases and phosphatases)\n 7) Mechanical machines for intracellular shuttling of biomolecules and cellular movement (Microtubule network, kinesin, dynein)\n 8) Energy production machines (Electron transport chain, F0F1 ATP synthase)\n \n \n Sliding clamps and the clamp-loading machine.\n Sliding clamps are ring-shaped proteins that some refer to as the &#8220;guardians&#8221; of the genome or others name them as the &#8220;ringmasters&#8221; of the genome.\n Interestingly these clamps are structurally and functionally conserved in all branches of life and crystallographic studies have shown that they have almost superimposable three-dimensional structures, yet these components have very little sequence similarity.\n Figure 1: Human sliding clamp\n Figure 2: E. coli sliding clamp\n Figure 3: Bacteriophage T4 sliding clamp\n Figure 4: Sulfolobus solfataricus (Archaeon) sliding clamp\n \n What do they do? \n The picture below is taken from the Molecular Biology Visualization of DNA video (2:14) from the freesciencelectures.com site. \n Great video!\n http://mybroadband.co.za/vb/picture.php?albumid=84&pictureid=393\n The following components can be seen.\n Sliding clamps (PCNA in eukaryotes): Green circular shaped\n Clamp loader (RFC in eukaryotes): Blue-white component in the middle \n (Figure 5: Structures of PCNA connected to RFC (front))\n (Figure 6: Structures of PCNA connected to RFC (side))\n (Figure 7: Structures of PCNA connected to RFC (back))\n Helicase: Blue \n (Figure 8: Helicase (front))\n DNA polymerase: Dark-blue components attached to the sliding clamps\n Primase: Green component attached to helicase\n Leading strand: Spinning off to the right\n Lagging strand: Spinning off to the top\n \n They are not ringmasters for nothing.\n Sliding clamps participate and control events that orchestrate DNA replication events in the following ways:[*]Enhancement of DNA polymerase activity.[*]Coordinate Okazaki fragment processing. [*]Prevention of rereplication[*]Translesion synthesis[*]Prevents sister-chromatid recombination and also coordinates sister-chromatid cohesion[*]Crucial role in mismatch repair, base excision repair, nucleotide excision repair[*]Participates in chromatin assembly\n Other functions include:[*]Epigenetic inheritance [*]Chromatin remodeling[*]Controls cell cycle and cell death signaling\n The true ringmasters. \n \n Clamp loaders are another group of interesting proteins (see video and figures 5-7 above). Interestingly again, their functional and structural architecture are conserved across the three domains of life with low-level sequence similarity. At the replication fork during replication, they load the sliding clamps many times onto the lagging strand (after DNA priming) and only once onto the leading strand. They also act as a bridge to connect the leading and lagging strand polymerases and the helicase. Which brings us to another interesting group of proteins; the helicases.\n \n Helicases are also known to be ring-shaped motor proteins, typically hexamers (see figure 8) and separate double-stranded DNA into single-stranded templates for the replication machinery. Replication occurs at about 1000 base pairs per second due to the highly efficient combination of sliding clamps and the polymerases. Thus, helicases need to unwind DNA at at least that speed. Unwinding DNA too slowly and the replication machinery might break down . Unwind the DNA too fast or untimely and harmful mutations might occur as single-stranded DNA is prone to degradation and cytosine deamination. The speed at which helicase unwinds DNA is no accident though, as it is intrinsically controlled. As helicase is bound to the lagging strand, it unwinds the leading strand in a separate direction. Applying a pulling force on the leading strand leads to a 7-fold increase in the speed of DNA unwinding by helicase. The highly efficient DNA polymerase/sliding clamp combination provides this controlling force on the leading strand. This forms a robust unwinding/polymerization interaction whereby polymerization controls and prevents unwanted DNA unwinding.\n Altogether, the replisome machinery provides a robust way for DNA replication to prevent unnecessary DNA damage and mutation. Epigenetic factors are also able to control its efficiency (more later).", 
   {
    "post_info": {
     "post_title": "Biomolecular Machines"
    }
   }, 
   null, 
   null, 
   1231455360.0
  ], 
  [
   339509, 
   null, 
   "Teleological", 
   "Putting cytosine deamination to work: How the immune system exploits the optimal properties of the genome for antibody diversification and immune function.\n \n The effect of cytosine deamination on a random pool of amino acids and how it might facilitate evolution has been described. The optimal features of the genetic code are exploited by the vertebrate immune system by \"putting cytosine deamination to work\". Antibody diversification is crucial in limiting the frequency of environmentally acquired infections and thereby increasing the fitness of the organism. Initial diversification of antibodies is achieved by assembling variable (V), diversity (D) and joining (J) gene segments (V(D)J recombination) by non-homologous recombination. Further diversification is carried out by somatic hypermutation (SHM) and Class Switch Recombination. Central to the initiation to these diversification processes is the activation-induced cytosine deaminase (AID) protein. AID deaminates cytosine to uracil in single stranded DNA (ssDNA - arising during gene transcription) and is dependent on active gene transcription of the various antibody genes. The induced mutation is resolved by at least 4 pathways (Figure 1):\n 1) Copying of the base by high-fidelity polymerases during DNA replication.\n 2) Short-Patch Base Excision Repair (SP-BER) by uracil-DNA glycosylase removal and subsequent repair of the base.\n 3) Long-Patch Base Excision Repair (LP-BER)\n 4) Mismatch repair (MMR)\n \n Link to big picture\n http://mybroadband.co.za/vb/picture.php?albumid=180&pictureid=1884\n Figure 1: Activation induced cytosine deamination and the pathways involved in resolving the induced mutation. 1) Normal DNA replication results in a C:G&#8594;T:A transition. 2) Successful SP-BER resolves the mutation, however the recruitment of error-prone translesion polymerases results (e.g. REV1) in transversions (REV1; C:G&#8594;G:C) and transition. 3) LP-BER can also resolve the mutation, however recruitment of low-fidelity polymerases (e.g. Pol n) also causes transition and transversion mutations. 4) MMR repair can also resolve the mutation, however the recruitment of low-fidelity polymerases through this pathway is a major cause of A:T transitions.\n \n AID causes somatic hypermutation and its activity is limited to the certain genetic regions of the immune system. When the system runs unchecked, mutations might be introduced into proto-oncogenes, resulting in possible cancerous growth. The system is controlled (Figure 2). The activity and gene expression of AID is controlled. The type of error-repair pathway and the subsequent recruitment of various low-fidelity polymerases determine the type of mutations after the repair process and these also seem to be controlled. Current research focuses on the mechanisms of control of downstream repair pathways and why this system is selectively targeted to the small region of antibody genes.\n \n http://mybroadband.co.za/vb/picture.php?albumid=180&pictureid=1886\n Figure 2: Controlled variability of somatic hypermutation.\n \n Thus, the immune system exploits the properties the genetic code for the purpose of controlled variability. This system is not only limited to vertabrate. Cytosine deamninases are found in bacteria as well. Error-prone repair systems are also present together with an optimal code.\n \n References:\n Peled JU, Kuang FL, Iglesias-Ussel MD, Roa S, Kalis SL, Goodman MF et al. The biochemistry of somatic hypermutation. Annu Rev Immunol. 2008;26:481-511.\n \n Teng G, Papavasiliou FN. Immunoglobulin somatic hypermutation. Annu Rev Genet. 2007;41:107-20.\n \n Goodman MF, Scharff MD, Romesberg FE. Abstract AID-initiated purposeful mutations in immunoglobulin genes. Adv Immunol. 2007;94:127-55.\n \n Basu U, Chaudhuri J, Phan RT, Datta A, Alt FW. Regulation of activation induced deaminase via phosphorylation. Adv Exp Med Biol. 2007;596:129-37", 
   {}, 
   339490, 
   null, 
   1231457820.0
  ], 
  [
   339579, 
   null, 
   "Teleological", 
   "Speaking of antibody diversification:\n \n Evolution In Action: Our Antibodies Take 'Evolutionary Leaps' To Fight Microbes\n \nScienceDaily (Jan. 8, 2009) - With cold and flu season in full swing, the fact that viruses and bacteria rapidly evolve is apparent with every sneeze, sniffle, and cough. A new report explains for the first time how humans keep up with microbes by rearranging the genes that make antibodies to foreign invaders. This research fills a significant gap in our understanding of how the immune system helps us survive.\n\n \n \nWhen the body encounters a foreign invader, like a virus or bacterium, it immediately begins to find a way to neutralize it by means of cellular or antibody-mediated defenses. Part of the process involves tailoring the genes that code for antibodies to specific viruses or bacteria.\n\n \n Wonder what the reaction would be if the title was:\n Teleological Evolution in Action: Our Antibodies Take 'Evolutionary Leaps' to fight Microbes\n \n Why Teleological evolution? Well, the immune system purposefully manipulates information by using the optimality of the genetic code, random variation and selection as a means to an end... antibody diversification. (See how)\n \n Teleological evolution is not limited to the immune system.\n Somatic evolution of malignancy alse seem to have a teleological streak...\n Adaptive landscapes and emergent phenotypes: why do cancers have high glycolysis?\n \nInvestigating the causes of increased aerobic glycolysis in tumors (Warburg Effect) has gone in and out of fashion many times since it was first described almost a century ago. The field is currently in ascendance due to two factors. Over a million FDG-PET studies have unequivocally identified increased glucose uptake as a hallmark of metastatic cancer in humans. These observations, combined with new molecular insights with HIF-1alpha and c-myc, have rekindled an interest in this important phenotype. A preponderance of work has been focused on the molecular mechanisms underlying this effect, with the expectation that a mechanistic understanding may lead to novel therapeutic approaches. There is also an implicit assumption that a mechanistic understanding, although fundamentally reductionist, will nonetheless lead to a more profound teleological understanding of the need for altered metabolism in invasive cancers. In this communication, we describe an alternative approach that begins with teleology; i.e. adaptive landscapes and selection pressures that promote emergence of aerobic glycolysis during the somatic evolution of invasive cancer. Mathematical models and empirical observations are used to define the adaptive advantage of aerobic glycolysis that would explain its remarkable prevalence in human cancers. These studies have led to the hypothesis that increased consumption of glucose in metastatic lesions is not used for substantial energy production via Embden-Meyerhoff glycolysis, but rather for production of acid, which gives the cancer cells a competitive advantage for invasion. Alternative hypotheses, wherein the glucose is used for generation of reducing equivalents (NADPH) or anabolic precursors (ribose) are also discussed.\n\n \n Somatic evolution of malignancy:\n The purposeful manipulating of information by using the optimality of the genetic code, random variation and selection as a means to an end... adaptation to hypoxic and acidic fitness landscapes.\n \n \n Viewing cells as computers that make other computers and information as an irreducible property of nature makes this view tenable.", 
   {
    "unicode_changes_made": true
   }, 
   339509, 
   null, 
   1231507260.0
  ], 
  [
   339607, 
   null, 
   "Smallax", 
   "Welcome to the Molecular Machines\n \n A thread to lump together all the interesting discoveries regarding the intracellular biomolecular machinery that are crucial for life to exist. Feel free to post interesting discoveries and perhaps describe the functionality of the intracellular biomolecular machines.\n ...\n\n \n The most interestting 'music video' I've ever seen. :)\n Thanks for the link. I have something to watch this evening!", 
   {}, 
   339490, 
   null, 
   1231522140.0
  ], 
  [
   343216, 
   null, 
   "jakers", 
   "Welcome to the Molecular Machines\n \n A thread to lump together all the interesting discoveries regarding the intracellular biomolecular machinery that are crucial for life to exist. Feel free to post interesting discoveries and perhaps describe the functionality of the intracellular biomolecular machines.\n \n Intracellular biomolecular machinery include the following:\n 1) DNA replication and repair machinery (replisome) \n 2) DNA transcription machinery and RNA processing and translation machinery (Spliceosomes and ribosomes)\n 3) Cell cycle signaling network (pRB, e2F, CDKs)\n 4) Programmed cell death machinery (Apoptosis, autophagy, mitotic catastrophe)\n 5) Protein processing machinery (Chaperones, ubiquitin-proteasome system)\n 6) Intracellular signaling networks (protein kinases and phosphatases)\n 7) Mechanical machines for intracellular shuttling of biomolecules and cellular movement (Microtubule network, kinesin, dynein)\n 8) Energy production machines (Electron transport chain, F0F1 ATP synthase)\n \n \n Sliding clamps and the clamp-loading machine.\n Sliding clamps are ring-shaped proteins that some refer to as the \"guardians\" of the genome or others name them as the \"ringmasters\" of the genome.\n Interestingly these clamps are structurally and functionally conserved in all branches of life and crystallographic studies have shown that they have almost superimposable three-dimensional structures, yet these components have very little sequence similarity.\n Figure 1: Human sliding clamp\n Figure 2: E. coli sliding clamp\n Figure 3: Bacteriophage T4 sliding clamp\n Figure 4: Sulfolobus solfataricus (Archaeon) sliding clamp\n \n What do they do? \n The picture below is taken from the Molecular Biology Visualization of DNA video (2:14) from the freesciencelectures.com site. \n Great video!\n http://mybroadband.co.za/vb/picture.php?albumid=84&pictureid=393\n The following components can be seen.\n Sliding clamps (PCNA in eukaryotes): Green circular shaped\n Clamp loader (RFC in eukaryotes): Blue-white component in the middle \n (Figure 5: Structures of PCNA connected to RFC (front))\n (Figure 6: Structures of PCNA connected to RFC (side))\n (Figure 7: Structures of PCNA connected to RFC (back))\n Helicase: Blue \n (Figure 8: Helicase (front))\n DNA polymerase: Dark-blue components attached to the sliding clamps\n Primase: Green component attached to helicase\n Leading strand: Spinning off to the right\n Lagging strand: Spinning off to the top\n \n They are not ringmasters for nothing.\n Sliding clamps participate and control events that orchestrate DNA replication events in the following ways:[*]Enhancement of DNA polymerase activity.[*]Coordinate Okazaki fragment processing. [*]Prevention of rereplication[*]Translesion synthesis[*]Prevents sister-chromatid recombination and also coordinates sister-chromatid cohesion[*]Crucial role in mismatch repair, base excision repair, nucleotide excision repair[*]Participates in chromatin assembly\n Other functions include:[*]Epigenetic inheritance [*]Chromatin remodeling[*]Controls cell cycle and cell death signaling\n The true ringmasters. \n \n Clamp loaders are another group of interesting proteins (see video and figures 5-7 above). Interestingly again, their functional and structural architecture are conserved across the three domains of life with low-level sequence similarity. At the replication fork during replication, they load the sliding clamps many times onto the lagging strand (after DNA priming) and only once onto the leading strand. They also act as a bridge to connect the leading and lagging strand polymerases and the helicase. Which brings us to another interesting group of proteins; the helicases.\n \n Helicases are also known to be ring-shaped motor proteins, typically hexamers (see figure 8) and separate double-stranded DNA into single-stranded templates for the replication machinery. Replication occurs at about 1000 base pairs per second due to the highly efficient combination of sliding clamps and the polymerases. Thus, helicases need to unwind DNA at at least that speed. Unwinding DNA too slowly and the replication machinery might break down . Unwind the DNA too fast or untimely and harmful mutations might occur as single-stranded DNA is prone to degradation and cytosine deamination. The speed at which helicase unwinds DNA is no accident though, as it is intrinsically controlled. As helicase is bound to the lagging strand, it unwinds the leading strand in a separate direction. Applying a pulling force on the leading strand leads to a 7-fold increase in the speed of DNA unwinding by helicase. The highly efficient DNA polymerase/sliding clamp combination provides this controlling force on the leading strand. This forms a robust unwinding/polymerization interaction whereby polymerization controls and prevents unwanted DNA unwinding.\n Altogether, the replisome machinery provides a robust way for DNA replication to prevent unnecessary DNA damage and mutation. Epigenetic factors are also able to control its efficiency (more later).\n\n \n This is great material, teleological, although I don't pretend to understand it, I'm clever enough to recognise complex systems that never fell together thanks to good luck and lots and lots and lots of time. Thanks", 
   {
    "unicode_changes_made": true
   }, 
   339490, 
   null, 
   1234144080.0
  ], 
  [
   343264, 
   null, 
   "The Barbarian", 
   "Natural selection is, as you might know, the antithesis of \"luck.\" This one seems to be one of those \"Gee whiz, I don't see how it could evolve, and I'm smarter than everyone else, so God mustadunnit\" arguments.\n \n What part of this process do you think was impossible to evolve?", 
   {}, 
   343216, 
   null, 
   1234159800.0
  ], 
  [
   343771, 
   null, 
   "Teleological", 
   "Natural selection is, as you might know, the antithesis of \"luck.\"\n\n Funny how anyone can think natural selection is the anti-thesis of anything since it really does nothing. As so well put by Will Provine in his book:\n The Origins of Theoretical Population Genetics\n From page 199 (see above link):\n \nAs John Endler has argued eloquently in Natural Selection in The Wild (1968), natural selection is not a mechanism. Natural selection does not act on anything, nor does it select (for or against), force, maximize, create, modify, shape, operate, drive, favor, maintain, push or adjust. Natural selection does nothing. Natural selection as a natural force belongs in the insubstantial category already populated by the Becker/Stahl phlogiston (Endler 1986) or Newton's \"ether\".\n Natural selection is the necessary outcome of discernible and often quantifiable causes. \n\n Natural selection DOES NOTHING. The true agents of change are cellular mechanisms. Mechanism, all wrapped up in a near universal and superbly optimal genetic code (wait for the discoveries on the epigenetic code) driven by biomolecular machines, quality control programs and variation inducers. Nano-intentional entities capable of manipulating information, using natural selection and random variation and biasing evolutionary trajectories.\n \n \n \n \n \nThis one seems to be one of those \"Gee whiz, I don't see how it could evolve, and I'm smarter than everyone else, so God mustadunnit\" arguments.\n Now why would you want to say \"Gee whiz, I don't see how it could evolve, and I'm smarter than everyone else, so God mustadunnit\" (mind you, you are the only one saying that at present). Bad news for you then, there are plenty more of these examples. But if natural selection DOES NOTHING, what is the origin of functionality and why do you think functionality emerged in the first place? Out of necessity? Is function a necessary outcome of the system then? Somehow, I feel that view is a bit too telic for some.\n \n \nWhat part of this process do you think was impossible to evolve?\n Inevitable comes to mind, not imipossible.\n \n Want more? Sure, no problem :)!\n \n Cell division: Cross-talk between DNA replication, DNA repair, cell cycle signaling and programmed cell death pathways\n \n The cell cycle is a highly regulated process and \"takes micromanagement to the extreme\". Various positive- and negative-feedback systems ensure that cells divide in a controlled manner. The process consists of a sequence of events by which a growing cell duplicates all its components and divides into two daughter cells, each with sufficient machinery to repeat the process. In eukaryotic cells, one round of cell division consists of two \"gap\" phases termed G1- and G2-, an S-phase during which duplication of all DNA happen, and an M-phase where proper segregation of duplicated chromosomes and chromatid separation occur. During each of these phases, regulatory signaling pathways monitor the successful completion of events in each phase before proceeding to the next phase. These regulatory pathways are commonly referred to as cell cycle checkpoints. Cell cycle checkpoints are activated in response the following (Figure 1):\n [*]Cellular damage[*]Exogenous cellular stress signals[*]Lack of availability of nutrients, hormones and essential growth factors.\n During the G1 phase many signals intervene to influence cell division and the deployment of a cell's developmental program (Figure 1). Crucial \"decisions\" are made to pass the G1 restriction point as commitment to replicate DNA and divide is irreversible until the next G1 phase. Failure to meet the correct conditions results in a failed attempt to divide. Signaling events converge to affect the phosphorylation status of the retinoblastoma protein (pRB) family (pRB, p107, and p130). Cyclin dependent kinases (CDKs) play a crucial role in pRB phosphorylation status and their activity is in turn controlled by cell stress and growth inhibitory signaling pathways. Sufficient phosphorylation (hyper-phosphorylation) of pRB causes it to dissociate from the elongation factor 2 (e2F) family of transcription factors. Dissociated e2F transcription factors mediate the transcription and activity of genes required for DNA replication during the S-phase.\n \n As soon as the restriction point (G1/S transition checkpoint) is passed, initiation of DNA replication takes place at multiple sites on the chromosomes, called the origins of replication. The origin recognition complex (ORC) marks the position of replication origins in the genome and serves as the landing pad for the assembly of a multiprotein, pre-replicative complex (pre-RC) at the origins, consisting of ORC, cell division cycle 6 (Cdc6), Cdc10-dependent transcript (Cdt1), mini-chromosome maintenance (MCM) proteins, clamp-loaders, sliding clamps, helicases, DNA polymerases etc. The MCM proteins serve as key participants in the mechanism that limits eukaryotic DNA replication to once-per-cell-cycle and its binding to the chromatin marks the final step of pre-RC formation. Once the replisome is assembled, the transition to DNA replication is irreversibly completed and the cell enters the S-phase.\n \n After successful completion of DNA replication the mitosis promoting factor (MPF) complex forms and plays a crucial role in nuclear envelope breakdown, centrosome separation, spindle assembly, chromosome condensation and Golgi fragmentation during mitosis. Cells only enter mitosis (G2/M transition) after the completion of the above events.\n \n When a cell is unable to address the above circumstances, cell division is permanently halted and the cell either enters senescence or programmed cell death is activated (Figure 1). Programmed cell death (particularly apoptosis) removes potentially hazardous cells from a population of cells, resulting in the controlled destruction of the cells designated for destruction. Two checkpoints during the cell cycle exist.\n [*]The DNA structure checkpoint[*]The spindle checkpoint\n The DNA structure checkpoint operates between the G1/S transition, the S-phase and the G2/M transition (Figure 1). The DNA structure checkpoint during the G1/S and G2/M transitions ensure that DNA damage is minimal while the S-phase DNA structure checkpoint also recognizes and deals with replication intermediates, stalled replication forks and unreplicated DNA. Whenever the criteria are not met during a checkpoint, a cell will not proceed to the next phase. Various signaling networks are activated and operate to ensure these criteria are met. DNA structure checkpoint signaling has the same pattern during any phase of the cell cycle (Figure 1):\n [*]Detection: Sensor proteins include proliferating cell nuclear antigen (PCNA)-like and replication factor C (RFC)-like protein complexes (see Sliding clamps, clamp-loaders and helicases), which are able to bind to damaged DNA to form a scaffold for downstream repair proteins. The Rad50/Mre11/NBS1 complex is also loaded onto damaged DNA sites and mediates downstream checkpoint and repair proteins.[*]Signal transduction: Activated sensor proteins in turn activate several signaling proteins which in turn activates DNA repair mechanisms and downstream effector proteins that controls cell cycle checkpoint signal transduction and programmed cell death signaling. Some examples include, ataxia telangiectasia mutated (ATM), ataxia telangiectasia and Rad3 related (ATR) p53 binding protein (53bp), the topoisomerase binding protein TopBP1, mediator of DNA damage checkpoint (MDC1), breast cancer 1 (BRCA 1) etc.[*]Effect: Downstream of the signal transducers include the the effector serine/threonine protein kinases CHK1 and CHK2. CHK's transfer the signal of DNA damage to the phosphotyrosine phosphatases and cell division cycle proteins Cdc25A, Cdc25B, and Cdc25C as well the tumor-suppressor p53. Cdc25A controls the G1/S and S-phase transition (prevents pRB dissociation through dephosphorylation of pRB proteins) while Cdc25B and Cdc25C control the G2/M transition (both upregulating Wee1 and Myt1 by phosphorylation, which together control Cdc2/CyclinB activity). Tumor supressor p53 protein activity links DNA damage to programmed cell death.\n http://mybroadband.co.za/vb/picture.php?albumid=125&pictureid=612\n Figure 1: Dynamic control of cell cycle events through cell signaling, checkpoints, nutrient availability and extracellular stress. (Click for larger version)\n \n The spindle assembly checkpoint is a molecular system that ensures accurate segregation of mitotic chromosomes and functions during the M-phase of cell division. The spindle checkpoint depends on the activity of two systems.\n [*]The 26S proteasome (APC/C-cdc20 complex) for the degradation of cyclin B.[*]The anaphase promoting complex/cyclosome (APC/C-cdh1 complex) for the degradation of cyclins and securin\n How are these for provocative sounding titles:\n Voges D, Zwickl P, Baumeister W. The 26S proteasome: a molecular machine designed for controlled proteolysis. Annu Rev Biochem. 1999;68:1015-68.\n Peters JM. The anaphase promoting complex/cyclosome: a machine designed to destroy. Nat Rev Mol Cell Biol. 2006 Sep;7(9):644-56.\n \n Cyclin B is ubiquitinylated and degraded by the the 26S proteasome (APC/C-cdc20 complex) which in turn results in the activation of the APC/C-cdh1 complex. The APC/C-cdc20 complex is controlled by the mitotic checkpoint complex (MCC) which detects tubulin and kinetochore integrity. The APC/C-cdh1 complex mediates the degradation of securin resulting in chromosome segregation.", 
   {
    "unicode_changes_made": true
   }, 
   343264, 
   null, 
   1234445700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Biomolecular Machines", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12192-biomolecular-machines.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 12192, 
  "discussion_files": [
   [
    "10910.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12192-biomolecular-machines-print.html"
   ]
  ], 
  "identifier": 12192
 }
]