[
 [
  [
   339489, 
   null, 
   "Teleological", 
   "Scientists and engineers employ various methods to design optimal structures, methods, programs, machines, molecules etc. One method that is gaining popularity is memetic algorithms.\n \n What is it and how does it work?\n Memetic Algorithms (MAs) are search techniques used to solve problems by mimicking molecular processes of evolution including selection, recombination, mutation and inheritance. In order to understand the basics, a few important aspects of MAs need to be considered (Figure 1).\n [*]The fitness landscape needs to be finite.[*]The search space of the MA is limited to the fitness landscape.[*]There is at least one solution in the fitness landscape .[*]A fitness function determines the relationship between the fitness of the genotype (or phenotype) and the fitness landscape.[*]Selection is based on fitness.\n http://mybroadband.co.za/vb/picture.php?albumid=180&pictureid=1854\n Figure 1: A) Basic lay out of memetic algorithms. A population of individuals is randomly seeded with regard to fitness (initialized). The individuals are randomly mutated and their fitness is measured. Individuals with optimal fitness are further mutated until convergence of a local optima is reached. The process is carried out for the entire initialized population. The global optima is selected from the various local optima. B) Fitness landscape with local optima (A, B and D) and a global optima (C). In a memetic algorithm, the initial population of individual are randomly seeded and can be viewed as any of the arrows indicated in the figure.\n \n Autodock (a molecular docking program) employs MAs in order to try and predict the orientation of a ligand within a protein receptor. A docking run with Autodock can be characterized by the following:\n [*]Finite fitness landscape: The physical properties of the protein receptor (E.g. electrostatic properties, Van der Waals interactions, desolvation energies etc.). This can be characterized as the pre-existing fitness landscape.[*]Search space: Confined to the protein receptor.[*]At least one solution: The original crystallographic pose.[*]Fitness function: Estimated Free Energy of Binding pose. This is determined through a combination of various interactions including Van der Waals-, electrostatic-, desolvation-, hydrogen bond- and torsional free energy.[*]Selection (guiding function): Selection is based on fitness, i.e. The Estimated Free Energy of Binding pose.\n Using Autodock as an example, a docking simulation of a ligand (molecule that binds to a protein) was run 4 times. Each time the ligand is docked, 30 populations with 250 individuals (ligands) are randomly placed within the receptor and the position of each ligand is randomly \"mutated\" after which the Estimated Free Energy of the pose is measured. The position of each ligand is \"mutated\" until a local optima of the Estimated Free Energy of a ligand is reached. The local optima of each of the four docking runs were measured and in all four runs, the convergence of the global optima (in each run) corresponded reasonably well to the crystallographic pose (RMSD<1.8). Two conclusions can be reached thus far:\n 1. The software can predict the best pose (biologically relevant) of a ligand in a protein with reasonable success.\n 2. Separate runs after random variation and selection converged on similar local optima even after random variation and selection processes in a pre-existing finite fitness landscape. The global optimum corresponded well with the original ligand pose. \n \n It is also interesting that running the software on different occasions result in the convergence of similar ligand poses (optimal designs), even though random variation and selection processes were employed in the algorithm. Biased towards a few ends...\n \n This software and MAs (mimicking evolutionary processes) can thus be used to design new molecules and predict optimal designs. Thus demonstrating evolution can be used to design optimal designs in pre-existing fitness landscapes.\n \n Are there parallels with MAs and life and the universe? It should be an interesting scientific exercise to explore these possible parallels.", 
   {
    "post_info": {
     "post_title": "Programmed Evolution"
    }
   }, 
   null, 
   null, 
   1231455180.0
  ], 
  [
   339504, 
   null, 
   "Teleological", 
   "So let's look at a few parallels between development and a docking simulation employing memetic algorithms.\n \n The biased nature of development:\n Primordial germ cells (PGC) are prevented from entering the somatic program and are demethylated (genome-wide erasure of existing epigenetic modifications). Then the gametes are imprinted (targeted DNA methylation) during gametogenesis, only to be demethylated again after fertilization. Then during development, DNA is methylated again, causing totipotential cells to become pluripotent. X-inactivation and reactivation of the paternal also occurs. The whole process is governed by the genetic and epigenetic program. During the unfolding of this somatic program, random variation and selection occur, ultimately leading to just a few endpoints every time it is successful. The process is constrained (few end points) as a result of pre-existing information that is set up during the initiation of the process. All this is controlled by information in the genome.\n \n Article to demonstrate this:\n Many Paths, Few Destinations: How Stem Cells Decide What They'll Become\n http://www.sciencedaily.com/images/2008/05/080521131552-large.jpg\n \n \nHow does a stem cell decide what specialized identity to adopt -- or simply to remain a stem cell? A new study suggests that the conventional view, which assumes that cells are \"instructed\" to progress along prescribed signaling pathways, is too simplistic. Instead, it supports the idea that cells differentiate through the collective behavior of multiple genes in a network that ultimately leads to just a few endpoints -- just as a marble on a hilltop can travel a nearly infinite number of downward paths, only to arrive in the same valley.\n\n Just like in memetic algorithms, there are many paths to an endpoint. Both memetic algorithms in development and in the docking simulation converge on similar endpoints each time it is rerun. (e.g. skin in development). \n \n \nThe findings, published in the May 22 issue of Nature, give a glimpse into how that collective behavior works, and show that cell populations maintain a built-in variability that nature can harness for change under the right conditions. The findings also help explain why the process of differentiating stem cells into specific lineages in the laboratory has been highly inefficient.\n\n \n \n\"Nature has created an incredibly elegant and simple way of creating variability, and maintaining it at a steady level, enabling cells to respond to changes in their environment in a systematic, controlled way,\" adds Chang, first author on the paper.\n\n \n \nThe landscape analogy and collective \"decision-making\" are concepts unfamiliar to biologists, who have tended to focus on single genes acting in linear pathways. This made the work initially difficult to publish, notes Huang. \"It's hard for biologists to move from thinking about single pathways to thinking about a landscape, which is the mathematical manifestation of the entirety of all the possible pathways,\" he says. \"A single pathway is not a good way to understand a whole process. Our goal has been to understand the driving force behind it.\"\n\n Like the docking simulation, in development there is a pre-existing fitness landscape (the womb). Both processes converge on similar endpoints each time it is run, both process are biased to a few endpoints and both processes reach local optima (e.g. skin cells) after the process id complete.\n http://mybroadband.co.za/vb/picture.php?albumid=180&pictureid=1857\n Figure 1: Similarities between development and a docking simulation employing a memetic algorithm.\n \n There are certainly many parallels between our own designed simulated docking runs and the development of life.", 
   {}, 
   339489, 
   null, 
   1231457520.0
  ], 
  [
   339507, 
   null, 
   "Teleological", 
   "Now let's look at a few parallels between evolution and a docking simulation employing memetic algorithms.\n \n For life and evolution:\n 1. Finite fitness landscape: (See here)\n The quantum teleportation experiments have demonstrated that information can be viewed as a fundamental irreducible property of physics (informationalism). Information in the sense that energy supervenes on information. Energy is understood to be the ultimate foundation of all matter in this universe. From Einstein's equation, E=mc^2, all matter was ultimately created out of energy, and is theoretically reducible to energy. From there it can also be derived that time comes to complete stop at the speed of light. In addition, the first law of thermodynamics states that energy cannot be created or destroyed. The quantum teleportation experiments showed the entire information content (properties) of one photon can be teleported instantaneously onto another photon whereby the second photon assumes the complete identity of the first photon, while the first photon loses its complete identity. So from there, energy can be viewed to supervene on information, and information can be viewed as a fundamental category of Nature and the finite fitness landscape.\n \n 2. Search space:\n Confined to this universe, and since the beginning of life on earth, confined to earth. Cells can be seen as computers (machines expressing various programs), that are not only able to govern cellular processes needed to sustain the software, but also contains the necessary software and machinery to reproduce the computing machine while replicating its program. Therefore, cells can actively manipulate information as a means to an end: self-replication and self-preservation.\n \n 3. At least one solution:\n Consciousness is at least one solution. Us.\n \n 4. Fitness function:\n Standard evolutionary theory describes fitness as the capability of an individual and/or a population of a certain genotype to reproduce (self-replicate). Is this fitness function solely confined to self-replication prowess? Intelligence and agency also seem to play a role in organisms that do not self-replicate in high numbers (e.g. elephants [low] vs bacteria [high]). Self-replication entities do not necessarily result in intelligent self-replicating entities, and intelligent self-replicating entities do not necessarily result in intelligent self-replicating agents. In order to differentiate between intelligence and agency, intelligence can be viewed as an ability to process information (e.g. genetics, proteomics, metabolomics) and agency can be viewed as the ability to willfully manipulate information. Self-replication, intelligence and agency can all be part of the fitness function?\n \n 5. Selection (guiding function): \n Natural selection and the ability of an organism to survive. Self-replication, intelligence and agency would thus play a part. \n \n Is there evidence to support parallels between evolution and our own designed docking simulations?\n \n Let's talk evidence:\n \n A. The Memetic Algorithms of life.\n 1) A very optimal genetic code that seems to be optimized for evolution and random searches. It also maintains its own functional integrity.\n 2) Quality control systems are in place. These include DNA repair, protein folding and programmed cell death (also in unicellular organisms). Some of these systems are so efficient that they remove even functional mutated proteins from the population of proteins generated in the genome. Thus this serve to constrain evolution, preventing certain functional proteins from entering a population.\n 3) Variation inducers. These include cytosine deaminases, Low vs High fidelity polymerases, gene conversion and homologous recombination. The immune system harnesses the properties of the genetic code for antibody diversification. Protein folding is an exquisitely controlled process, but cells can tweak this process under periods of stress to introduce variation. \n \n For example:\n Misfolded Proteins Accelarate Yeast Evolution\n \n \nScienceDaily (Nov. 24, 2008) &#8212; Under stress, yeast cells can unleash a remarkable mechanism based on protein-misfolding that gives them new characteristics without requiring genetic mutations.\n\n \n The article continues to comment that this mechanism serves as a mechanism tailored for evolution? Irrespective of its origins, somehow, life utilizes evolution FOR evolution.\n \n B. Convergence\n As seen in the docking simulation, the solutions all converge on relatively similar local optima. Examples of molecular and structural convergence are abundant in nature. Also, abiogenesis spectacularly converged into a reasonably optimized genetic code (with a few derivatives) and life's memetic algorithms. Convergence in virtual simulations and in nature thus serve to point to similarities between them.\n \n C) The Biased Nature of Evolution.\n D) The Biased Nature of Evolution.\n After running the docking simulations, the software seemed to have been biased towards a few local optima even after random variation processes. The parallels between development has already been highlighted above. Parallels between development and evolution also exist. Compare the developmental program to evolution. \n \n Evolution also seems to be biased towards a few endpoints:\n Peer-reviewed article:\n An End to Endless Forms: Epistasis, Phenotype Distribution Bias, and Nonuniform Evolution\n It is argued to be as a result of genetic instructions dating earlier in evolutionary time. (Preadaptations).\n \n To conclude, parallels exist between our own designed docking simulations employing memetic algorithms and the evolution of life.\n These include (Figure 1):\n 1) Memetic algoritms\n 2) Convergence\n 3) Biased to a few endpoints\n 4) Local optima (optimal biomolecular machines)\n \n http://mybroadband.co.za/vb/picture.php?albumid=180&pictureid=1885\n Figure 1: Similarities between evolution and a docking simulation.", 
   {}, 
   339504, 
   null, 
   1231457640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Programmed Evolution", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12191-programmed-evolution.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 12191, 
  "discussion_files": [
   [
    "26096.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12191-programmed-evolution-print.html"
   ]
  ], 
  "identifier": 12191
 }
]