[
 [
  [
   340153, 
   null, 
   "ShadowPikachu", 
   "Saw this on another forum: Life As We Know It Nearly Created in Lab | LiveScience\n \n Life is almost created in a test tube:\n \n \nSpecifically, the researchers synthesized RNA enzymes that can replicate themselves without the help of any proteins or other cellular components, and the process proceeds indefinitely. \"Immortalized\" RNA, they call it, at least within the limited conditions of a laboratory. \n \n \n More significantly, the scientists then mixed different RNA enzymes that had replicated, along with some of the raw material they were working with, and let them compete in what's sure to be the next big hit: \"Survivor: Test Tube.\" \n \n \n Remarkably, they bred. \n \n \n And now and then, one of these survivors would screw up, binding with some other bit of raw material it hadn't been using. Hmm. That's exactly what life forms do ... \n \n \n When these mutations occurred, \"the resulting recombinant enzymes also were capable of sustained replication, with the most fit replicators growing in number to dominate the mixture,\" the scientists report. \n \n The \"creatures\" - wait, we can't call them that! - evolved, with some \"species\" winning out. \n\n \n We have life, or at least life-like behavior, coming from non-life. No need to invoke the supernatural. When the conditions are right, and in a big universe it's bound to happen, life emerges.", 
   {
    "post_info": {
     "post_title": "One more step toward creation of life"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1231912560.0
  ], 
  [
   340159, 
   null, 
   "Penfold", 
   "Pass the electrodes Igor! ;) Seriously fascinating.", 
   {}, 
   340153, 
   null, 
   1231914420.0
  ], 
  [
   340166, 
   null, 
   "pandion", 
   "We have life, or at least life-like behavior, coming from non-life. No need to invoke the supernatural. When the conditions are right, and in a big universe it's bound to happen, life emerges.\nThat's interesting. Along another line, Craig Venter (of human genome fame) and his company have created a virus that works. Venter and crew assembled individual bases into a molecule of RNA and then injected it into a bacterium. It began to reproduce, killed the bacterium and ejected unnumbered copies, sheathed in appropriate protein shells, into the surrounding environment, where they infected other bacteria. The model for this artificial virus was a bacteriophage, which explains why it was injected into a bacterium. The artificial variety worked perfectly.\n \n I also read a paper that reported that the polio virus had been artificially reproduced in the lab. It is indistinguishable from the actual polio virus in laboratory conditions, but (of course) it has not been tested in nature.\n \n There was also a paper that reported the creation of an artificial bacterium. The DNA of an infectious bacterium was reproduced artificially, with the exception that the single gene that makes the model bacterium infectious was left out. This DNA was then inserted into the shell of a similar (but non infectious bacterium) from which the genetic material had been removed. The resultant bacterium reproduced and formed colonies in laboratory media. IT'S ALIVE! IT'S ALIVE!\n \n So I guess the objection that man will never create life in the lab is now pretty much moot (not \"mute\" as so many creationists would say).\n \n For those who demand links rather than sources, do a google search. The information is easy to find and many of the stories contain links to the papers.", 
   {}, 
   340153, 
   null, 
   1231917060.0
  ], 
  [
   340169, 
   null, 
   "pandion", 
   "We have life, or at least life-like behavior, coming from non-life. No need to invoke the supernatural. When the conditions are right, and in a big universe it's bound to happen, life emerges.\nI am seriously less interested in the scientific accomplishments that I reported than in those that you reported. What I reported is more an accomplishment of technology. The creation of living or near living organisms from scratch following the pattern offered by real organisms and viruses is technology. Your report is about an advancement in understanding and the natural emergence of near life molecules. Self replicating molecules have been around for a long time.\n \n Of course, creationists ask why, if life arose by natural processes, we don't see new life emerging. First, we don't know that new life is not emerging all of the time. We still have little idea of what is happening around black smokers at the bottom of the oceans. Moreover, any such organic molecules would be food for already existing organisms. It must be pointed out that the spontaneous formation of self replicating molecules in the lab are protected from living predators. They compete only with each other in the lab and thus, the differential reproductive success of molecules better able to acquire raw material from the environment makes them more numerous.\n \n Sounds a bit like evolution.", 
   {}, 
   340153, 
   null, 
   1231918320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  One more step toward creation of life", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12218-one-more-step-toward-creation-life.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 12218, 
  "discussion_files": [
   [
    "12064.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12218-one-more-step-toward-creation-life-print.html"
   ]
  ], 
  "identifier": 12218
 }
]