[
 [
  [
   340087, 
   null, 
   "Charliegone", 
   "WTH! For some reason I'm not too surprised.\n \n British Police set to step up hacking of home PCs | Australian IT\n \n THE Home Office has quietly adopted a new plan to allow police across Britain routinely to hack into people's personal computers without a warrant.\n The move, which follows a decision by the European Union's council of ministers in Brussels, has angered civil liberties groups and opposition MPs. They described it as a sinister extension of the surveillance state which drives \"a coach and horses\" through privacy laws.\n \n The hacking is known as \"remote searching\". It allows police or MI5 officers who may be hundreds of miles away to examine covertly the hard drive of someone's PC at his home, office or hotel room.\n \n Material gathered in this way includes the content of all e-mails, web-browsing habits and instant messaging.\n \n Under the Brussels edict, police across the EU have been given the green light to expand the implementation of a rarely used power involving warrantless intrusive surveillance of private property. The strategy will allow French, German and other EU forces to ask British officers to hack into someone's UK computer and pass over any material gleaned.\n \n A remote search can be granted if a senior officer says he \"believes\" that it is \"proportionate\" and necessary to prevent or detect serious crime - defined as any offence attracting a jail sentence of more than three years.\n \n However, opposition MPs and civil liberties groups say that the broadening of such intrusive surveillance powers should be regulated by a new act of parliament and court warrants.\n \n They point out that in contrast to the legal safeguards for searching a suspect's home, police undertaking a remote search do not need to apply to a magistrates' court for a warrant.\n \n Shami Chakrabarti, director of Liberty, the human rights group, said she would challenge the legal basis of the move. \"These are very intrusive powers - as intrusive as someone busting down your door and coming into your home,\" she said.\n \n \"The public will want this to be controlled by new legislation and judicial authorisation. Without those safeguards it's a devastating blow to any notion of personal privacy.\"\n \n She said the move had parallels with the warrantless police search of the House of Commons office of Damian Green, the Tory MP: \"It's like giving police the power to do a Damian Green every day but to do it without anyone even knowing you were doing it.\"\n \n Richard Clayton, a researcher at Cambridge University's computer laboratory, said that remote searches had been possible since 1994, although they were very rare. An amendment to the Computer Misuse Act 1990 made hacking legal if it was authorised and carried out by the state.\n \n He said the authorities could break into a suspect's home or office and insert a \"key-logging\" device into an individual's computer. This would collect and, if necessary, transmit details of all the suspect's keystrokes. \"It's just like putting a secret camera in someone's living room,\" he said.\n \n Police might also send an e-mail to a suspect's computer. The message would include an attachment that contained a virus or \"malware\". If the attachment was opened, the remote search facility would be covertly activated. Alternatively, police could park outside a suspect's home and hack into his or her hard drive using the wireless network.\n \n Police say that such methods are necessary to investigate suspects who use cyberspace to carry out crimes. These include paedophiles, internet fraudsters, identity thieves and terrorists.\n \n The Association of Chief Police Officers (Acpo) said such intrusive surveillance was closely regulated under the Regulation of Investigatory Powers Act. A spokesman said police were already carrying out a small number of these operations which were among 194 clandestine searches last year of people's homes, offices and hotel bedrooms.\n \n \"To be a valid authorisation, the officer giving it must believe that when it is given it is necessary to prevent or detect serious crime and (the) action is proportionate to what it seeks to achieve,\" Acpo said.\n \n Dominic Grieve, the shadow home secretary, agreed that the development may benefit law enforcement. But he added: \"The exercise of such intrusive powers raises serious privacy issues. The government must explain how they would work in practice and what safeguards will be in place to prevent abuse.\"\n \n The Home Office said it was working with other EU states to develop details of the proposals. \n \n yeah right....emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "British Government hacking computers!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1231877400.0
  ], 
  [
   340102, 
   null, 
   "chester", 
   "\n The Association of Chief Police Officers (Acpo) said such intrusive surveillance was closely regulated under the Regulation of Investigatory Powers Act. A spokesman said police were already carrying out a small number of these operations which were among 194 clandestine searches last year of people's homes, offices and hotel bedrooms.\n \n \"To be a valid authorisation, the officer giving it must believe that when it is given it is necessary to prevent or detect serious crime and (the) action is proportionate to what it seeks to achieve,\" Acpo said.\n \n Yeah right....emoticon_rolleyes\n\n \n Doesn't it make you wonder just who guards the guardians?emoticon_mad", 
   {
    "unicode_changes_made": true
   }, 
   340087, 
   null, 
   1231882980.0
  ], 
  [
   357770, 
   null, 
   "DrNo", 
   "I wonder how they can hack into your computer if you disconnect it from the phone / cable line? I'm not saying people should have to do that in order to preserve their privacy; I'm just wondering if it's effective. As long as you don't have a wireless network card or anything like that in your PC, I don't see how else they could do it. There has to be some kind of connection.", 
   {}, 
   340087, 
   null, 
   1245276240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  British Government hacking computers!", 
  "url": "http://www.4forums.com/political/civil-rights-debates/12215-british-government-hacking-computers.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 12215, 
  "discussion_files": [
   [
    "10663.html", 
    "http://www.4forums.com/political/civil-rights-debates/12215-british-government-hacking-computers-print.html"
   ]
  ], 
  "identifier": 12215
 }
]