[
 [
  [
   340257, 
   null, 
   "Ravin", 
   "Oh, wait a minute; they're Jewish Israeli citizens....\n \n \nNine Israeli human rights groups called on Wednesday for an investigation into whether Israeli officials had committed war crimes in Gaza since tens of thousands of civilians there have nowhere to flee, the health system has collapsed, many are without electricity and running water, and some are beyond the reach of rescue teams. \n\n \n Never mind. emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "Terrorist-loving Anti-semites demand Gaza Inquiry"
    }
   }, 
   null, 
   null, 
   1231984380.0
  ], 
  [
   340261, 
   null, 
   "Ravin", 
   "Oh, wait a minute; they're Jewish Israeli citizens....\n \n \n \n Never mind. emoticon_rolleyes\n\n \n Bumpity bump.", 
   {}, 
   340257, 
   null, 
   1231985400.0
  ], 
  [
   340284, 
   null, 
   "ShadowPikachu", 
   "Oh, wait a minute; they're Jewish Israeli citizens....\n \n \n \n Never mind. emoticon_rolleyes\n\n 'About 700 Israelis have been arrested for protesting against the war on Gaza since the beginning of the deadly offensive, said Neve Gordon, chair of the Department of Politics and Government at Ben-Gurion University of the Negev in Israel on Monday.'\n \n Middle East Online", 
   {}, 
   340257, 
   null, 
   1232002980.0
  ], 
  [
   340286, 
   null, 
   "Jo Bennett", 
   "Oh, wait a minute; they're Jewish Israeli citizens....\n \n \n \n Never mind. emoticon_rolleyes\n\n \n In the eyes of the lunatics that make the sort of claim in the title, these are just self-hating Jews (yes, I've heard a zionist Jew call a non-zionist that).", 
   {}, 
   340257, 
   null, 
   1232004360.0
  ], 
  [
   340296, 
   null, 
   "Winston Smith", 
   "Oh, wait a minute; they're Jewish Israeli citizens....\n \n \n \n Never mind. emoticon_rolleyes\n\n \n \n what war? emoticon_xkill", 
   {}, 
   340257, 
   null, 
   1232013000.0
  ], 
  [
   340313, 
   null, 
   "Archangel", 
   "Terrorist-loving Anti-semites demand Gaza Inquiry\n \nOh, wait a minute; they're Jewish Israeli citizens....\n \n Never mind. emoticon_rolleyes\n\n \n Your NY Times piece also admits this.\n The Israeli human rights groups that called for an investigation said that while they believed that it was legitimate for Israel to bomb military installations, it was a violation of international law to hit civilian sites and government buildings that contained no weapons.\n What these protesters have ignored is that it's Hamas who is placing civilians in harms way by firing rockets from civilian positions while forcing civilians to remain their as fodder for the Israeli retaliations. Hamas builds tunnels for transporting weapons but never bothered to build underground bunkers for its civilian population. Why? Because the more dead children, the better for their propaganda machine.\n The groups included the Israel section of Amnesty International, B&#8217;Tselem, Gisha and Physicians for Human Rights-Israel. Israeli Jews are firmly behind the government&#8217;s conduct of the war, with the human rights groups representing a small minority.\n The good news is that the majority of Israeli's understand the propaganda game being waged against them, and they support hitting the terrorists where their weapons are fired from. Their attitude is, if the Palestinians don't care about their citizens enough to protect them from the line of fire, and consciously place them in harms way for their propaganda value, then why is it Israel's responsibility to worry about them during a shooting war? The answer is, it isn't. Here is a paper written by another famous American liberal regarding the game Hamas is playing with the lives of their innocent citizens. Here's an excerpt from that paper:\n The Hamas war crime strategy\n \n By Mr. Dershowitz, law professor at Harvard. Hudson, January 8, 2009.\n \n As Israel persists in its military efforts - by ground, air and sea - to protect its citizens from deadly Hamas rockets, and as protests against Israel increase around the world, the success of the abominable Hamas double war crime strategy becomes evident. \n The strategy is as simple as it is cynical: provoke Israel by playing Russian roulette with its children, firing rockets at kindergartens, playgrounds and hospitals; hide behind its own civilians when firing at Israeli civilians; refuse to build bunkers for its own civilians; have the TV cameras ready to transmit every image of dead Palestinians, especially children; exaggerate the number of civilians killed by including as \"children\" Hamas fighters who are 16 or 17 years old and as \"women,\" female terrorists.\n \n Hamas itself has a name for this. They call it \"the CNN strategy\" (this is not to criticize CNN or any other objective news source for doing its job; it is to criticize Hamas for exploiting the freedom of press which it forbids in Gaza). The CNN strategy is working because decent people all over the world are naturally sickened by images of dead and injured children. When they see such images repeatedly flashed across TV screens, they tend to react emotionally.\n \n Rather than asking why these children are dying and who is to blame for putting them in harms way, the average viewer, regardless of their political or ideological perspective, wants to see the killing stopped. They blame those whose weapons directly caused the deaths, rather than those who provoked the violence by deliberately targeting civilians. They forget the usual rules of morality and law. \n For example, when a murderer takes a hostage and fires from behind his human shield, and a policeman, in an effort to stop the shooting accidentally kills the hostage, the law of every country holds the hostage taker guilty of murder even though the policeman fired the fatal shot. The same is true of the law of war. The use of human shields, in the way Hamas uses the civilian population of Gaza, is a war crime - as is its firing of rockets at Israeli civilians. Every human shield that is killed by Israeli self defense measures is the responsibility of Hamas, but you wouldn't know that from watching the media coverage.\n \n The CNN strategy seems to work better, at least in some parts of the world, against Israel that it would against other nations. There are many more protests - and fury - directed against Israel when it inadvertently kills fewer than 100 civilians in a just war of self defense, than against Arab and Muslim nations and groups that deliberately kill far more civilians for no legitimate reason. The Hamas war crime strategy - Likud of Holland / Likoed Nederland\n \n If you had any sense of justice or balance at all, you would recognize and acknowledge the responsibility which falls squarely on the shoulders of this terrorist group for the human carnage it is causing. But like a blind man you lash out at the IDF for simply defending itself against the rockets fired from those locations where civilians have been placed as sacrificial lambs to allah, the demon god they worship. Which of course explains why you side with the terrorists. How proud you must be to defend those who refuse peace as you condemn those who took thousands of unanswered rockets before responding to end these unending rocket attacks from these terrorists.", 
   {}, 
   340257, 
   null, 
   1232034060.0
  ], 
  [
   340318, 
   null, 
   "Penfold", 
   ".....\n If you had any sense of justice or balance at all, you would recognize and acknowledge the responsibility which falls squarely on the shoulders of this terrorist group for the human carnage it is causing. ....\n\n \n \n Yes, Israel must be stopped.", 
   {}, 
   340313, 
   null, 
   1232037720.0
  ], 
  [
   340324, 
   null, 
   "Archangel", 
   " \n .....\n If you had any sense of justice or balance at all, you would recognize and acknowledge the responsibility which falls squarely on the shoulders of this terrorist group for the human carnage it is causing. ....\n\n \n \nYes, Israel must be stopped.\n\n \n This is the only rebuttal your blind ignorance deserves as you must attempt to distort my message, since you have absolutely no defense against the historical facts and truth of who's actually the guilty party and the aggressor in this situation. \n \n It's also very telling how you respond to singular statements for your dishonest and trollish quips while offering absolutely no substantive evidence AT ALL in order to oppose my evidence.\n \n \n \n Terrorist-loving Anti-semites demand Gaza Inquiry\n \nOh, wait a minute; they're Jewish Israeli citizens....\n \n Never mind. emoticon_rolleyes\n\n \n Your NY Times piece also admits this.\n The Israeli human rights groups that called for an investigation said that while they believed that it was legitimate for Israel to bomb military installations, it was a violation of international law to hit civilian sites and government buildings that contained no weapons.\n What these protesters have ignored is that it's Hamas who is placing civilians in harms way by firing rockets from civilian positions while forcing civilians to remain their as fodder for the Israeli retaliations. Hamas builds tunnels for transporting weapons but never bothered to build underground bunkers for its civilian population. Why? Because the more dead children, the better for their propaganda machine.\n The groups included the Israel section of Amnesty International, B'Tselem, Gisha and Physicians for Human Rights-Israel. Israeli Jews are firmly behind the government's conduct of the war, with the human rights groups representing a small minority.\n The good news is that the majority of Israeli's understand the propaganda game being waged against them, and they support hitting the terrorists where their weapons are fired from. Their attitude is, if the Palestinians don't care about their citizens enough to protect them from the line of fire, and consciously place them in harms way for their propaganda value, then why is it Israel's responsibility to worry about them during a shooting war? The answer is, it isn't. Here is a paper written by another famous American liberal regarding the game Hamas is playing with the lives of their innocent citizens. Here's an excerpt from that paper:\n The Hamas war crime strategy\n \n By Mr. Dershowitz, law professor at Harvard. Hudson, January 8, 2009.\n \n As Israel persists in its military efforts - by ground, air and sea - to protect its citizens from deadly Hamas rockets, and as protests against Israel increase around the world, the success of the abominable Hamas double war crime strategy becomes evident. \n The strategy is as simple as it is cynical: provoke Israel by playing Russian roulette with its children, firing rockets at kindergartens, playgrounds and hospitals; hide behind its own civilians when firing at Israeli civilians; refuse to build bunkers for its own civilians; have the TV cameras ready to transmit every image of dead Palestinians, especially children; exaggerate the number of civilians killed by including as \"children\" Hamas fighters who are 16 or 17 years old and as \"women,\" female terrorists.\n \n Hamas itself has a name for this. They call it \"the CNN strategy\" (this is not to criticize CNN or any other objective news source for doing its job; it is to criticize Hamas for exploiting the freedom of press which it forbids in Gaza). The CNN strategy is working because decent people all over the world are naturally sickened by images of dead and injured children. When they see such images repeatedly flashed across TV screens, they tend to react emotionally.\n \n Rather than asking why these children are dying and who is to blame for putting them in harms way, the average viewer, regardless of their political or ideological perspective, wants to see the killing stopped. They blame those whose weapons directly caused the deaths, rather than those who provoked the violence by deliberately targeting civilians. They forget the usual rules of morality and law. \n For example, when a murderer takes a hostage and fires from behind his human shield, and a policeman, in an effort to stop the shooting accidentally kills the hostage, the law of every country holds the hostage taker guilty of murder even though the policeman fired the fatal shot. The same is true of the law of war. The use of human shields, in the way Hamas uses the civilian population of Gaza, is a war crime - as is its firing of rockets at Israeli civilians. Every human shield that is killed by Israeli self defense measures is the responsibility of Hamas, but you wouldn't know that from watching the media coverage.\n \n The CNN strategy seems to work better, at least in some parts of the world, against Israel that it would against other nations. There are many more protests - and fury - directed against Israel when it inadvertently kills fewer than 100 civilians in a just war of self defense, than against Arab and Muslim nations and groups that deliberately kill far more civilians for no legitimate reason. The Hamas war crime strategy - Likud of Holland / Likoed Nederland\n \n If you had any sense of justice or balance at all, you would recognize and acknowledge the responsibility which falls squarely on the shoulders of this terrorist group for the human carnage it is causing. But like a blind man you lash out at the IDF for simply defending itself against the rockets fired from those locations where civilians have been placed as sacrificial lambs to allah, the demon god they worship. Which of course explains why you side with the terrorists. How proud you must be to defend those who refuse peace as you condemn those who took thousands of unanswered rockets before responding to end these unending rocket attacks from these terrorists.", 
   {
    "unicode_changes_made": true
   }, 
   340318, 
   null, 
   1232039700.0
  ], 
  [
   340329, 
   null, 
   "Penfold", 
   "The \"thousands of rockets\" killed 20 people in ten years The rogue Israeli state has killed a thousand in the last two weeks alone. They are directly culpable for the deaths of 250 children among those murdered by their fascist state. Likud propaganda is not to be trusted.", 
   {}, 
   340324, 
   null, 
   1232040600.0
  ], 
  [
   340337, 
   null, 
   "Archangel", 
   "The \"thousands of rockets\" killed 20 people in ten years \n\n \n Care to prove this lie?\n \n \nThe rogue Israeli state has killed a thousand in the last two weeks alone. They are directly culpable for the deaths of 250 children among those murdered by their fascist state. Likud propaganda is not to be trusted.\n\n \n And care to prove this lie? How can Israel be clamed for those deaths when civilians were placed their as human fodder for the attacks that Hamas promoted by firing on Israel from those locations where they placed the civilians? How does your sense of justice blame Israel for the deliberate actions of Hamas which led to those deaths? \n \n How severe is your blindness to condemn Israel, the defenders of these senseless attacks, rather than Hamas, the promoters of them? But you know what penfold, you're not here to debate facts. You exist just to troll and snipe against what is true and right. You're in willful denial as you defend terrorists against the only proponents of true and lasting peace in this troubled land. And you do it by spewing lies.", 
   {}, 
   340329, 
   null, 
   1232043480.0
  ], 
  [
   340338, 
   null, 
   "Zardoz", 
   "The \"thousands of rockets\" killed 20 people in ten years The rogue Israeli state has killed a thousand in the last two weeks alone. They are directly culpable for the deaths of 250 children among those murdered by their fascist state. Likud propaganda is not to be trusted.\n\n \n Moral: STOP LAUNCHING INEFFECTIVE ROCKETS AT FASCIST ROGUE NATIONS...or they'll retaliate and kill your children.\n \n \n All propaganda is not to be trusted.\n \n \n Seriously, a group of people THAT stupid should be purged from the gene pool.", 
   {}, 
   340329, 
   null, 
   1232044020.0
  ], 
  [
   340346, 
   null, 
   "Penfold", 
   "The entire 1.5 million people don't fire the rockets, why kill so many of the innocents, even if they are only arabs?", 
   {}, 
   340338, 
   null, 
   1232048880.0
  ], 
  [
   340348, 
   null, 
   "Penfold", 
   "Care to prove this lie? \n\n \n No lie. An underestimate, but not a lie. Read a newspaper. emoticon_rolleyes\n \n List of Qassam rocket attacks - Wikipedia, the free encyclopedia ) estimates that &#8220;From 2001 until May 2008, there have been over 3,050 Qassam rockets fired at Israeli targets &#8230;mainly against Sderot and the Western Negev. Fifteen Israelis have been killed and over 433 injured, along with significant property damage. Additionally, more than 2,500 mortar attacks have been launched against Israel from Gaza. This has resulted in eight (8) Israeli deaths.&#8221;\n \n So in fact, according to Israeli sources, 23 Israelis have been killed by Occupied Palestinian mortar and rocket attacks.", 
   {}, 
   340337, 
   null, 
   1232049960.0
  ], 
  [
   340360, 
   null, 
   "Archangel", 
   "No lie. An underestimate, but not a lie. Read a newspaper. emoticon_rolleyes\n \n List of Qassam rocket attacks - Wikipedia, the free encyclopedia ) estimates that &#8220;From 2001 until May 2008, there have been over 3,050 Qassam rockets fired at Israeli targets &#8230;mainly against Sderot and the Western Negev. Fifteen Israelis have been killed and over 433 injured, along with significant property damage. Additionally, more than 2,500 mortar attacks have been launched against Israel from Gaza. This has resulted in eight (8) Israeli deaths.&#8221;\n \n So in fact, according to Israeli sources, 23 Israelis have been killed by Occupied Palestinian mortar and rocket attacks.\n\n \n My numbers are a little different. And the harm done goes much deeper than just the dead and injured since these are acts of terror.\n Massive rocket fire against Sderot and the Western Negev commenced in January 2001, and has caused significant damage to homes and property, while injuring 433 Israeli residents and traumatizing thousands of adults and children.\n \n 22 people have been killed in the Western Negev region by the rocket attacks, including 9 residents of Sderot, three of whom were children.\n \n Qassam rocket fire poses a major threat to Israel from Palestinian terrorist organizations who are based in Gaza. As of January 2008, over 8,000 rockets have been launched at Sderot and the Western Negev. \n And I thought you were worried about civilians and specifically children? Why doesn't that concern include the 8000 rockets which have been fired at civilian communities for the past 8 years? Where is your compassion for the truly innocent who haven't done anything to deserve to live in fear every day of their lives? Are you aware of the affects of that on the children? Do you care about them?\n MENTAL HEALTH: The mental health of Sderot residents has severely deteriorated over the past seven years as each rocket attack results in psychological turmoil. In the past year and a half more than 1,600 instances of stress were reported. Approximately 70% of Sderot residents suffer from signs of post traumatic stress disorder which include extreme stress and anxiety. According to a recent Natal report, between 70% to 94% of Sderot children show symptoms of PTSD. The Natal study found 28 percent of adults and 30 percent of children in Sderot actually have post-traumatic stress disorder (PTSD).\n \n Approximately 3000 patient files have been opened in the Sderot Mental Health Center due to the rocket fire environment. In the year 2007 alone, 1,117 trauma victim files were opened, up significantly from 2006. Anxiety symptoms among children often include sleeping difficulties, nightmares, sweating, development regressions, wetting beds, and fear of the outside. There are only 4 psychologists on call in Sderot. Therefore, many Sderot trauma victims do not receive the proper, if any, psychological therapy and care.\n How long is Israel expected to subject their people to this without responding in force with one goal in mind? That goal being to permanently stop these attacks once and for all time? Wouldn't any weaker a response just prompt these terrorist to continue on as they have since no degree of talking has ever accomplished anything lasting or real? Are you so bigoted against Jews that you will support terrorists if that's what it takes to accomplish your hateful goals? \n \n AND WHY IS THE ONLY ARAB ON THIS FORUM, ONE OF THE ONLY PEOPLE WILLING TO STAND UP AND DEFEND ISRAEL AGAINST THESE OBVIOUS CRIMES AGAINST HUMANITY WHICH THEY HAVE SUFFERED UNDER FOR SO LONG BEFORE RESPONDING WITH FORCE, WITH NARY A MENTION FROM THE INTERNATIONAL COMMUNITY? ARE EVEN THE JEWS HERE AFRAID TO SPEAK UP FOR THEIR OWN PEOPLE AND COUNTRY?", 
   {}, 
   340348, 
   null, 
   1232057640.0
  ], 
  [
   340379, 
   null, 
   "Penfold", 
   "Your numbers conflict with my Israeli government source. I bet a Pound to a penny there will be no retraction of the lie declamation.", 
   {}, 
   340360, 
   null, 
   1232068080.0
  ], 
  [
   340516, 
   null, 
   "Zardoz", 
   "The entire 1.5 million people don't fire the rockets, why kill so many of the innocents, even if they are only arabs?\n\n \n I don't see 1.5 million dead people.\n \n I don't even see the numbers of dead that can happen in a decent effort at 'genocide'.\n Damn man, over 5,000 were killed in the Soccer War of 1969 in about 4 days of fighting.\n If Israel were trying to target 'civilians', I'd guestimate that about 80,000 would be dead by now. \n \n \n And there's no such thing as 'innocent' in a democracy either. \n Ask Hamas...you know the ones, they launch unguided and indescriminate rocket attacks at civilian areas. Then they scurry off and hide behind their own civilians.\n Too bad they only have such lame weaponry or they'd achieve their goals of wiping out the Jews altogether...their stated goal you know.\n \n For a people such as the Palestinians who seem to believe in and practice a concept called 'total war' I think they're getting off light in response. I'd carpet bomb, fire bomb and nukify them in retaliation. Kinda as a lesson to their descendants (if there ended up being any alive afterwards) on 'how to do it properly.'\n \n Personally, I think comparing casualty numbers is the most asinine thing to do in trying to see who's meaner and who's more merciful.\n Hamas is TRYING to kill civilians and sucking badly at it.\n Israel is TRYING NOT to kill civilians and doing a decent job all factors considered. I guess they could simply stop attacking the militants who are attacking them...then Hamas would only suffer casualties from accidents. \n \n \n I'd still like to give Palistinian supporters a big old club and take them out to the desert and poke them with a pointy stick and see what happens. \n I poke you.\n I poke you.\n I poke you.\n I hurl some insults and poke you.\n Nyah, nyah, nyah I poke you.\n I poke you.\n ...\n Dude! Why you have to massively retaliate against me with that club? It's not my fault your eye was in the way of my stick. If you weren't here, you'd not have been poked. I suggest you leave the Earth if you don't want to be poked with my stick. Seriously, what's your problem. I'm telling the Gila Monster that you started it. Look at this bruise you caused! My arm is going to swell up. I won't be able to fling my poo at you if it does that.\n I'd like you so much better if you were dead. So would everyone else here like the Gila Monster and the Coyote.\n Dude, seriously, that wasn't cool hitting me with that club. That's not fair at all. You're soo going to get it when my arm heals. I'm going to poke you mercilessly...just like I did before.\n Yeah, that'll teach you!", 
   {}, 
   340346, 
   null, 
   1232155920.0
  ], 
  [
   340518, 
   null, 
   "Archangel", 
   "I don't see 1.5 million dead people.\n \n I don't even see the numbers of dead that can happen in a decent effort at 'genocide'.\n Damn man, over 5,000 were killed in the Soccer War of 1969 in about 4 days of fighting.\n If Israel were trying to target 'civilians', I'd guestimate that about 80,000 would be dead by now. \n \n \n And there's no such thing as 'innocent' in a democracy either. \n Ask Hamas...you know the ones, they launch unguided and indescriminate rocket attacks at civilian areas. Then they scurry off and hide behind their own civilians.\n Too bad they only have such lame weaponry or they'd achieve their goals of wiping out the Jews altogether...their stated goal you know.\n \n For a people such as the Palestinians who seem to believe in and practice a concept called 'total war' I think they're getting off light in response. I'd carpet bomb, fire bomb and nukify them in retaliation. Kinda as a lesson to their descendants (if there ended up being any alive afterwards) on 'how to do it properly.'\n \n Personally, I think comparing casualty numbers is the most asinine thing to do in trying to see who's meaner and who's more merciful.\n Hamas is TRYING to kill civilians and sucking badly at it.\n Israel is TRYING NOT to kill civilians and doing a decent job all factors considered. I guess they could simply stop attacking the militants who are attacking them...then Hamas would only suffer casualties from accidents. \n \n\n \n I couldn't have said it better. But then again, I have given up trying to reason with penfold. excellent post and absolutely correct on all counts.", 
   {}, 
   340516, 
   null, 
   1232156520.0
  ], 
  [
   340540, 
   null, 
   "Penfold", 
   "They say a picture paints a thousand words. Here's two thousand.\n \n Palestine vs Israel: Can You Guess Which One Is Which? at CSPAN Junkie", 
   {}, 
   340518, 
   null, 
   1232197980.0
  ], 
  [
   340565, 
   null, 
   "Zardoz", 
   "They say a picture paints a thousand words. Here's two thousand.\n \n Palestine vs Israel: Can You Guess Which One Is Which? at CSPAN Junkie\n\n \n \n It doesn't MATTER.\n It's a PROPAGANDA piece. \n To me, it says 'rocekts made in the basements of terrorists may not be a good weapon to start a war with...and here, we see the ruins of said basement weapons making factory after the Zionist retaliated with weapons perfected by their fascist partners's military industrial complexes. Hamas 0, People with Bigger Guns 1.'\n Dee dee dee.\n \n Lesson one, don't fight someone who can kick your butt without breaking a sweat.\n Lesson two, read lesson one.\n \n ESPECIALLY if Israel had been making concessions to the Palestinians and working towards peace; you keep pushing for that...diplomatically.\n Hamas has an agenda and it isn't peace. It isn't co-existance nor in having your own self-governed lands. It's perpetual war and the extermination of your declared enemy.\n Same with other organizations like them.", 
   {}, 
   340540, 
   null, 
   1232218020.0
  ], 
  [
   340568, 
   null, 
   "chester", 
   "Hamas has an agenda and it isn't peace.\n\n \n And just what is Israel's \"agenda\" if not to seize more and more Palestinian land?", 
   {}, 
   340565, 
   null, 
   1232218860.0
  ], 
  [
   340577, 
   null, 
   "Archangel", 
   "And just what is Israel's \"agenda\" if not to seize more and more Palestinian land?\n\n \n Must you constantly prove how clueless you are cap0? If that was Israel's agenda, they never would have returned Gaza which they legally captured while responding to an invasion. They actually decreased the size of a previously existing buffer zone in order to show good faith, only to have that good faith squashed once more by the unending volley of Rockets intended to kill as many civilians as allah would give them. \n \n The dismally low number of kills recorded by those rockets is further evidence of which God is real, and it isn't allah.", 
   {}, 
   340568, 
   null, 
   1232221560.0
  ], 
  [
   340581, 
   null, 
   "smiley", 
   "Must you constantly prove how clueless you are cap0? If that was Israel's agenda, they never would have returned Gaza which they legally captured while responding to an invasion. They actually decreased the size of a previously existing buffer zone in order to show good faith, only to have that good faith squashed once more by the unending volley of Rockets intended to kill as many civilians as allah would give them. \n \n The dismally low number of kills recorded by those rockets is further evidence of which God is real, and it isn't allah.\n\n In exactly the same way as the winner of the Superbowl have proved that god must have been on their side (presumable allah was supporting the other team).\n \n If you honestly think that god is interested in the petty squabblings of man then you're in need of a serious reality check, on so many levels.\n \n Smiley", 
   {}, 
   340577, 
   null, 
   1232222100.0
  ], 
  [
   340585, 
   null, 
   "Archangel", 
   "In exactly the same way as the winner of the Superbowl have proved that god must have been on their side (presumable allah was supporting the other team).\n \n If you honestly think that god is interested in the petty squabblings of man then you're in need of a serious reality check, on so many levels.\n \n Smiley\n\n \n WOW smiley, can you get any more shallow? You are actually comparing Gods interest in protecting Israel, whom He has an Abrahamic Covenant with, from these rocket attacks, to a football game? Also, if you think God isn't interested in the things of Man then it's you who needs the reality check. And to increase your understanding of the degree of love He has for us. emoticon_xdonno", 
   {}, 
   340581, 
   null, 
   1232223060.0
  ], 
  [
   340592, 
   null, 
   "Jo Bennett", 
   " legally captured \n\n \n Now there's an oxymoron. Show we which bit of international law permits the occupation and settlement of foreign territory. There are also plenty of UN resolutions making it quite clear the Israeli settlement of the West Bank and Gaza is unacceptable, and the UN charter specifically recognises the right to self-determination, which must necessarily include not being subject to military occupation. If you want to claim that Israel was legally founded based on UN decisions, then you must also accept that the decisions when they are against what Israel is doing. Otherwise we can go back to 1948 and ask why Israel was, by means of terrorism, allowed to appropriate a chunk of Palestine and expel most of the lawful residents.", 
   {}, 
   340577, 
   null, 
   1232224980.0
  ], 
  [
   340594, 
   null, 
   "smiley", 
   "WOW smiley, can you get any more shallow? You are actually comparing Gods interest in protecting Israel, whom He has an Abrahamic Covenant with, from these rocket attacks, to a football game? Also, if you think God isn't interested in the things of Man then it's you who needs the reality check. And to increase your understanding of the degree of love He has for us. emoticon_xdonno\n\n I agree that it is possible to become more shallow than I have currently attained - you are living proof of such (assuming you're not a spambot, of course).\n \n As for that Abrahamic Covenant, I don't believe it.\n \n As to your god's interest in the affairs of man\n \n 1 - I don't believe he exists\n 2 - If he did, he wouldn't interfere in such a petty squabble\n \n As to your god's love for man\n \n 1 - I don't believe he exists\n 1 - If he did (and your proposed godly love come with said existence), the above mentioned squabble and the suffereing it causes wouldn't be happening.\n \n You really should think these thing through before claiming you have some spiritually superior grip on reality.\n \n Smiley", 
   {}, 
   340585, 
   null, 
   1232226240.0
  ], 
  [
   340609, 
   null, 
   "Superlite27", 
   "Let me get a few things straight:\n \n 1) If Isreal is the evil, mean, bloody killer entity, what would happen if Hamas stopped firing rockets at it? Would they continue to kill all the innocent, poor, angelic civilians? If not, you can't really call them terorists, eh?\n \n 2) If you call them terrorists because they are blowing up civilians, what do you call the people who fire rockets and hide behind these innocents?\n \n 3) Why are they called innocent civilians? Didn't they democratically VOTE to empower Hamas? Doesn't voting for people who lob rockets INDESCRIMINATELY obligate you towards the consequences?\n \n 4) There is no question Hamas is INDESCRIMINATELY firing rockets. They are. So this obviously means their tatget is RANDOM. How is this NOT terrorism?\n \n 5) There is no question Isreal is targeting SPECIFIC ACTS OF MILITANCY. It just so happens, these militants are hiding behind the PEOPLE WHO VOTED FOR THEM. Since they are firing at military targets, (hiding behind civilians) how is this terrorism? You can't honestly believe they shouldn't fire when civilians are near, right? How would this NOT invite a barrage of rockets from every hospital, mosque, and school in Gaza? Hamas is firing from these places UNDER FIRE! What do you think would happen if they didn't have to worry about that small problem?\n \n If Hamas is indifferent to their targets, and indifferent to who dies when they are targeted, WHY ARE YOU HOLDING ISREAL TO A DIFFERENT STANDARD? \n \n The world knows who the terrorists are. There are a few who have to be wearing blinders.", 
   {}, 
   340594, 
   null, 
   1232233500.0
  ], 
  [
   340613, 
   null, 
   "Archangel", 
   "I agree that it is possible to become more shallow than I have currently attained - you are living proof of such (assuming you're not a spambot, of course).\n \n As for that Abrahamic Covenant, I don't believe it.\n \n As to your god's interest in the affairs of man\n \n 1 - I don't believe he exists\n 2 - If he did, he wouldn't interfere in such a petty squabble\n \n As to your god's love for man\n \n 1 - I don't believe he exists\n 1 - If he did (and your proposed godly love come with said existence), the above mentioned squabble and the suffereing it causes wouldn't be happening.\n \n You really should think these thing through before claiming you have some spiritually superior grip on reality.\n \n Smiley\n\n \n What is humorous, if it wasn't so cynical and pathetic of course, is that you think that because you choose not to believe in God that He doesn't exist all of a sudden. So it's you who really should think these things through before offering your very shallow and shortsighted opinion.", 
   {}, 
   340594, 
   null, 
   1232233980.0
  ], 
  [
   340622, 
   null, 
   "Penfold", 
   "There can be no \"all of a sudden\" when there never was.:)", 
   {}, 
   340613, 
   null, 
   1232237580.0
  ], 
  [
   340625, 
   null, 
   "smiley", 
   "What is humorous, if it wasn't so cynical and pathetic of course, is that you think that because you choose not to believe in God that He doesn't exist all of a sudden. So it's you who really should think these things through before offering your very shallow and shortsighted opinion.\n\n I'm glad it amuses you, but you should also realise that just because you do believe in your petty little god does not mean the he/she/it does exist.\n \n To believe in something, and insist that everyone will find out the you're right at some unspecified date (whilst insisting that everyone who disagrees with you only does so because they are either being willfully dissonant or are somehow inferior to you), yet be able to offer no evidence whatsoever is just plain dumb. But that has come to be expected.\n \n Smiley", 
   {}, 
   340613, 
   null, 
   1232239080.0
  ], 
  [
   340632, 
   null, 
   "Archangel", 
   "I'm glad it amuses you, but you should also realise that just because you do believe in your petty little god does not mean the he/she/it does exist.\n\n \n Ah, but God has made Himself evident in His Creation. To deny that is to deny a whole world of evidence which surrounds you each and every day of your life. You are so full of yourself though that you can't get out of your own way long enough to see Him. Here is what I mean, He say's it better than I can.\n Rom 1:19 because that which is known about God is evident within them; for God made it evident to them.\n Rom 1:20 For since the creation of the world His invisible attributes, His eternal power and divine nature, have been clearly seen, being understood through what has been made, so that they are without excuse.\n Rom 1:21 For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened.\n Rom 1:22 Professing to be wise, they became fools, \n \nTo believe in something, and insist that everyone will find out the you're right at some unspecified date \n\n \n The date isn't really unspecified. You will know the eternal truth of what you squandered seconds after this body dies and your spirit is freed.\n \n \n(whilst insisting that everyone who disagrees with you only does so because they are either being willfully dissonant or are somehow inferior to you), \n\n \n Dissonant is a bad word to describe what you guys are. It means discordant and inharmonious. You guys are plain old stubborn and rebellious against the very idea of God. But never have I said, implied or inferred that you are inferior to me because of that stubbornness. Although I have said that I am unworthy to have received the grace that has been shown to me. \n \n This isn't about being good enough to be saved smiley, because if we were good enough, we wouldn't need to be saved. Get it? God doesn't love the greatest Apostle that ever lived one iota more than He loves YOU. God is not partial, nor is He a respecter of men that any should boast. \n \n \n yet be able to offer no evidence whatsoever is just plain dumb. But that has come to be expected.\n \n Smiley\n\n \n See the verses above. God Himself has supplied the evidence all around you of His existence. If you reject that, then you will surely be without excuse.", 
   {}, 
   340625, 
   null, 
   1232242200.0
  ], 
  [
   340636, 
   null, 
   "Penfold", 
   "Those verses were written and edited by fallible humans. Not a god.", 
   {}, 
   340632, 
   null, 
   1232245980.0
  ], 
  [
   340642, 
   null, 
   "listen2galloway", 
   "type in Jewish Viewpoint On Israel on youtube and hear Sir Gerald Kaufman and the truth\n \n this is a learned man, his intellect far eclipses anything you will find on a mere blog site.", 
   {
    "post_info": {
     "post_title": "all israel supporters watch this"
    }
   }, 
   340516, 
   null, 
   1232249220.0
  ], 
  [
   340678, 
   null, 
   "Big_Bear_Scot", 
   "type in Jewish Viewpoint On Israel on youtube and hear Sir Gerald Kaufman and the truth\n \n this is a learned man, his intellect far eclipses anything you will find on a mere blog site.\n\n \n I normally don't like Gerald Kaufman, he is a New Labour stooge who has helped to destroy the traditional values of the Labour party but I agree with him 100% this time.\n \n YouTube - UK Jewish MP: Israel acting like Nazis in Gaza\n \n Also if Israel want true peace with the Palestinian people they will need to negotiate with organisations like Hamas, after all they have been democratically elected. \n \n The Israeli Government should also take the example of the UK and how it dealt with the IRA. During the troubles the British Government opened up secret negations with the IRA, even while the IRA where still bombing the British mainland, shooting British troops and killing Loyalists.\n \n The result of these negations is that the IRA has fully embraced the democratic process and Sinn Féin(the political wing of the IRA) has became part of power sharing Government in Northern Ireland.", 
   {}, 
   340642, 
   null, 
   1232282520.0
  ], 
  [
   340698, 
   null, 
   "smiley", 
   "Ah, but God has made Himself evident in His Creation. To deny that is to deny a whole world of evidence which surrounds you each and every day of your life. You are so full of yourself though that you can't get out of your own way long enough to see Him.\n\n Now it is my turn to be amused. You talk of denying a whole world of evidence, which is your very calling card You've been looking in that mirror again, haven't you Archie?\n \n \nHere is what I mean, He say's it better than I can.\n Rom 1:19 because that which is known about God is evident within them; for God made it evident to them.\n Rom 1:20 For since the creation of the world His invisible attributes, His eternal power and divine nature, have been clearly seen, being understood through what has been made, so that they are without excuse.\n Rom 1:21 For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened.\n Rom 1:22 Professing to be wise, they became fools, \n\n Here we go again, using the word of a man as 'evidence' of the existence of a god. You are seeing evidence where there is none.\n \n \nThe date isn't really unspecified. You will know the eternal truth of what you squandered seconds after this body dies and your spirit is freed.\n\n After I'm dead, I won't be learning anything. You have no evidence otherwise. And saying, \"but there must be something more,\" is not evidence, it's just wishful thinking.\n \n \nDissonant is a bad word to describe what you guys are. It means discordant and inharmonious. You guys are plain old stubborn and rebellious against the very idea of God. But never have I said, implied or inferred that you are inferior to me because of that stubbornness. Although I have said that I am unworthy to have received the grace that has been shown to me. \n\n So, you have never said that you have a personal relationship with god that we spiritually dead secular humanist don't. That sound like a superiority complex to me.\n \n \nThis isn't about being good enough to be saved smiley, because if we were good enough, we wouldn't need to be saved. Get it? God doesn't love the greatest Apostle that ever lived one iota more than He loves YOU. God is not partial, nor is He a respecter of men that any should boast. \n\n God doesn't do anything.\n \n \nSee the verses above. God Himself has supplied the evidence all around you of His existence. If you reject that, then you will surely be without excuse.\n\n Another example of using the word of man as evidence of god. Unfortunately, you will never see this.\n \n Smiley", 
   {}, 
   340632, 
   null, 
   1232296860.0
  ], 
  [
   340703, 
   null, 
   "Archangel", 
   "Hey, I tried smiley, even though I knew I was just wasting my time and bandwidth. Nuff said. emoticon_xgood", 
   {}, 
   340698, 
   null, 
   1232301960.0
  ], 
  [
   346516, 
   null, 
   "kmtina", 
   "The \"innocents\" elect a terrorist group as their government, stand by and watch as they use their hospitals and schools to launch rockets across the border, and then are shocked at the consequences?", 
   {}, 
   340379, 
   null, 
   1236570840.0
  ], 
  [
   346660, 
   null, 
   "Ethmi", 
   "The \"innocents\" elect a terrorist group as their government, stand by and watch as they use their hospitals and schools to launch rockets across the border, and then are shocked at the consequences?\n\n \n Here's a thought: Hitler was democratically elected. Therefore, smiley, Hitler was good, wasn't he?", 
   {}, 
   346516, 
   null, 
   1236665400.0
  ], 
  [
   346661, 
   null, 
   "Ethmi", 
   "I see alot of links to videos on this thread? But here's one that grabs my attention. I'm sure that this will shed some light on the issue.", 
   {}, 
   346660, 
   null, 
   1236665520.0
  ], 
  [
   346762, 
   null, 
   "chester", 
   "I see alot of links to videos on this thread? But here's one that grabs my attention. I'm sure that this will shed some light on the issue.\n\n \n Then again, since the clip is almost 10 years old, it might just shed more heat than light.", 
   {}, 
   346661, 
   null, 
   1236787440.0
  ], 
  [
   346832, 
   null, 
   "Ethmi", 
   "Then again, since the clip is almost 10 years old, it might just shed more heat than light.\n\n \n You can talk when you provide a link of your own to refute the video. Then again, maybe I shouldn't bother telling you this. Everyone here knows that you'll never provide evidence for anything.\n \n I'll explain in terms that even you can understand (hopefully).\n \n I give evidence.\n \n You question the credibility, but only on the grounds that you don't agree with it. You refuse to actually refute it, and you also refuse to provide any evidence of your own.\n \n Until you provide evidence of your own, the evidence I presented still stands strong. You're just upset because the video I presented casts a shadow of doubt on all Palestenian sources.", 
   {}, 
   346762, 
   null, 
   1236828900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Terrorist-loving Anti-semites demand Gaza Inquiry", 
  "url": "http://www.4forums.com/political/peace-middle-east/12219-terrorist-loving-anti-semites-demand-gaza-inquiry.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 12219, 
  "discussion_files": [
   [
    "606.html", 
    "http://www.4forums.com/political/peace-middle-east/12219-terrorist-loving-anti-semites-demand-gaza-inquiry-print.html"
   ], 
   [
    "607.html", 
    "http://www.4forums.com/political/peace-middle-east/12219-terrorist-loving-anti-semites-demand-gaza-inquiry-3-print.html"
   ], 
   [
    "608.html", 
    "http://www.4forums.com/political/peace-middle-east/12219-terrorist-loving-anti-semites-demand-gaza-inquiry-2-print.html"
   ]
  ], 
  "identifier": 12219
 }
]