[
 [
  [
   340349, 
   null, 
   "Penfold", 
   "\" One by one the justifications given by Israel for its latest war in Gaza are unravelling.\n The argument that this is a purely defensive war, launched only after Hamas broke a six-month ceasefire has been challenged, not just by observers in the know such as Jimmy Carter, the former US president who helped facilitate the truce, but by centre-right Israeli intelligence think tanks.\n \n The Intelligence and Terrorism Information Center, whose December 31 report titled \"Six Months of the Lull Arrangement Intelligence Report,\" confirmed that the June 19 truce was only \"sporadically violated, and then not by Hamas but instead by ... \"rogue terrorist organisations\".\n \n Instead, \"the escalation and erosion of the lull arrangement\" occurred after Israel killed six Hamas members on November 4 without provocation and then placed the entire Strip under an even more intensive siege the next day.\n \n According to a joint Tel Aviv University-European University study, this fits a larger pattern in which Israeli violence has been responsible for ending 79 per cent of all lulls in violence since the outbreak of the second intifada, compared with only 8 per cent for Hamas and other Palestinian factions.\n Indeed, the Israeli foreign ministry seems to realise that this argument is losing credibility. \n \n During a conference call with half a dozen pro-Israel professors on Thursday, Asaf Shariv, the Consul General of Israel in New York, focused more on the importance of destroying the intricate tunnel system connecting Gaza to the Sinai.\n \n He claimed that such tunnels were \"as big as the Holland and Lincoln tunnels,\" and offered as proof the \"fact\" that lions and monkeys had been smuggled through them to a zoo in Gaza. In reality, the lions were two small cubs that were drugged, thrown in sacks, and dragged through a tunnel on their way to a private zoo.\n \n Israel's self-image\n \n The claim that Hamas will never accept the existence of Israel has proved equally misinformed, as Hamas leaders explicitly announce their intention to do just that in the pages of the Los Angeles Times or to any international leader or journalist who will meet with them.\n \n With each new family, 10, 20 and 30 strong, buried under the rubble of a building in Gaza, the claim that the Israeli forces have gone out of their way to diminish civilian casualties - long a centre-piece of Israel's image as an enlightened and moral democracy - is falling apart.\n \n Anyone with an internet connection can Google \"Gaza humanitarian catastrophe\" and find the UN's Office for the Coordination of Humanitarian Affairs in the Occupied Territories and read the thousands of pages of evidence documenting the reality of the current fighting, and the long term siege on Gaza that preceded it.\n \n The Red Cross, normally scrupulous in its unwillingness to single out parties to a conflict for criticism, sharply criticised Israel for preventing medical personnel from reaching wounded Palestinians, some of whom remained trapped for days, slowly starving and dying in the Gazan rubble amidst their dead relatives.\n \n Meanwhile, the United Nations has flatly denied Israeli claims that Palestinian fighters were using the UNRWA school compound bombed on January 6, in which 40 civilians were killed, to launch attacks, and has challenged Israel to prove otherwise.\n \n War crimes admission\n \n Additionally, numerous flippant remarks by senior Israeli politicians and generals, including Tzipi Livni, the foreign minister, refusing to make a distinction between civilian people and institutions and fighters - \"Hamas doesn't ... and neither should we\" is how Livni puts it - are rightly being seen as admissions of war crimes.\n \n Indeed, in reviewing statements by Israeli military planners leading up to the invasion, it is clear that there was a well thought out decision to go after Gaza's civilian infrastructure - and with it, civilians.\n \n The following quote from an interview with Major-General Gadi Eisenkot that appeared in the Israeli daily Yedioth Ahronoth in October, is telling:\n \n \"We will wield disproportionate power against every village from which shots are fired on Israel, and cause immense damage and destruction. From our perspective these [the villages] are military bases,\" he said.\n \n \"This isn't a suggestion. This is a plan that has already been authorised.\"\n \n Causing \"immense damage and destruction\" and considering entire villages \"military bases\" is absolutely prohibited under international law. \n \n Eisenkot's description of this planning in light of what is now unfolding in Gaza is a clear admission of conspiracy and intent to commit war crimes, and when taken with the comments above, and numerous others, renders any argument by Israel that it has tried to protect civilians and is not engaging in disproportionate force unbelievable. ...\"", 
   {
    "post_info": {
     "post_title": "Who will save Israel from itself?"
    }
   }, 
   null, 
   null, 
   1232052840.0
  ], 
  [
   340366, 
   null, 
   "Archangel", 
   "Got a link for this propaganda piece? Or can I just assume it's from a pro-islamic source in the middle east. 10 dollars to a dime say's I'm right. emoticon_rolleyes", 
   {}, 
   340349, 
   null, 
   1232059020.0
  ], 
  [
   340375, 
   null, 
   "Penfold", 
   "Assumption may be your forte, but being correct is not.\n \n \"\" ... International laws violated\n \n On the ground, the evidence mounts ever higher that Israel is systematically violating a host of international laws, including but not limited to Article 56 of the IV Hague Convention of 1907, the First Additional Protocol of the Geneva Convention, the Fourth Geneva Convention (more specifically known as the \"Geneva Convention relative to the Protection of Civilian Persons in Time of War of 12 August 1949\", the International Covenant on Economic, Social and Cultural Rights, and the principles of Customary International Humanitarian Law.\n \n None of this excuses or legitimises the firing of rockets or mortars by any Palestinian group at Israeli civilians and non-military targets. \n \n As Richard Falk, the UN special rapporteur, declared in his most recent statement on Gaza: \"It should be pointed out unambiguously that there is no legal (or moral) justification for firing rockets at civilian targets, and that such behavior is a violation of IHR, associated with the right to life, as well as constitutes a war crime.\" \n \n By the same logic, however, Israel does not have the right to use such attacks as an excuse to launch an all-out assault on the entire population of Gaza.\n \n In this context, even Israel's suffering from the constant barrage of rockets is hard to pay due attention to when the numbers of dead and wounded on each side are counted. Any sense of proportion is impossible to sustain with such a calculus.\n \n 'Rogue' state\n \n Israeli commentators and scholars, self-described \"loyal\" Zionists who served proudly in the army in wars past, are now publicly describing their country, in the words of Oxford University professor Avi Shlaim, as a \"rogue\" and gangster\" state led by \"completely unscrupulous leaders\". \n \n \n Gazans inspect the damage after an air strike hit a mosque [GALLO/GETTY] Neve Gordon, a politics professor at Ben Gurion University, has declared that Israel's actions in Gaza are like \"raising animals for slaughter on a farm\" and represent a \"bizarre new moral element\" in warfare.\n \"The moral voice of restraint has been left behind ... Everything is permitted\" against Palestinians, writes a disgusted Haaretz columnist, Gideon Levy.\n \n Fellow Haaretz columnist and daughter of Holocaust survivors, Amira Haas writes of her late parents disgust at how Israeli leaders justified Israel's wars with a \"language laundromat\" aimed at redefining reality and Israel's moral compass. \"Lucky my parents aren't alive to see this,\" she exclaimed.\n \n Around the world people are beginning to compare Israel's attack on Gaza, which after the 2005 withdrawal of Israeli forces and settlers was turned literally into the world's largest prison, to the Jewish uprising in the Warsaw Ghetto. \n \n Extremist Muslims are using internet forums to collect names and addresses of prominent European Jews with the goal, it seems clear, of assassinating them in retaliation for Israel's actions in Gaza.\n \n Al-Qaeda is attempting to exploit this crisis to gain a foothold in Gaza and Palestinian refugee camps in Lebanon and Syria, as well as through attacking Jewish communities globally. \n \n Iran's defiance of both Israel and its main sponsor, the US, is winning it increasing sympathy with each passing day. .... \"\n \n \n Al Jazeera English - War on Gaza - Who will save Israel from itself?", 
   {}, 
   340366, 
   null, 
   1232063220.0
  ], 
  [
   340377, 
   null, 
   "Archangel", 
   "Got a link for this propaganda piece? Or can I just assume it's from a pro-islamic source in the middle east. 10 dollars to a dime say's I'm right. emoticon_rolleyes\n\n \n \nAssumption may be your forte, but being correct is not.\n Al Jazeera English - War on Gaza - Who will save Israel from itself? \n\n \n I rest my case. It is exactly as I said. You have posted nothing more than an Arab propaganda piece and are even blatantly dishonest enough to claim my prediction was wrong when I hit the nail, or should I say the pin right on the head. emoticon_xbye My job here is done.", 
   {}, 
   340366, 
   null, 
   1232066700.0
  ], 
  [
   340378, 
   null, 
   "Penfold", 
   "There speaks the certainty of a christian who had googled the result before commenting.....;)\n \n \" ...... Indeed, one of the sad facts of this latest tragedy is that with each claim publicly refuted by facts on the ground, more and more Americans, including Jews, are refusing to trust the assertions of Israeli and American Jewish leaders. \n \n Even worse, in the Arab/Muslim world, the horrific images pouring out of Gaza daily are allowing preachers and politicians to deploy well-worn yet still dangerous and inciteful stereotypes against Jews as they rally the masses against Israel - and through it - their own governments.\n \n What is most frightening is that the most important of Israel's so-called friends, the US political establishment and the mainstream Jewish leadership, seem clueless to the devastating trap that Israel has led itself into - in good measure with their indulgence and even help. \n \n It is one that threatens the country's existence far more than any Qassam rockets, with their 0.4 per cent kill rate; even more than the disastrous 2006 invasion of southern Lebanon, which by weakening Israel's deterrence capability in some measure made this war inevitable.\n \n First, it is clear that Israel cannot destroy Hamas, it cannot stop the rockets unless it agrees to a truce that will go far to meeting the primary demand of Hamas - an end to the siege.\n \n Merely by surviving (and it surely will survive) Hamas, like Hezbollah in 2006, will have won. ..... \"\n \n It certainly appears more honest and unbiased than the Likud propaganda posted earlier on another thread as commentary.", 
   {}, 
   340377, 
   null, 
   1232067720.0
  ], 
  [
   340461, 
   null, 
   "Archangel", 
   "There speaks the certainty of a christian who had googled the result before commenting.....;)\n\n \n That wasn't necessary since I knew two, no, three things for certain. The first being that everything your post said was right out of the Arab propaganda manual and secondly, that you would only post pro-terrorist propaganda in defense of your position. And third, that because you understood that you were posting dishonest lies and disinformation that you would attempt to slip it by without exposing that it was from Al Jazeera. \n \n \n\" ...... Indeed, one of the sad facts of this latest tragedy is that with each claim publicly refuted by facts on the ground, more and more Americans, including Jews, are refusing to trust the assertions of Israeli and American Jewish leaders.\n\n \n Don't you get it, it doesn't matter who or how many people are in denial of the facts, that doesn't make them right, or the facts wrong.\n \n \n Even worse, in the Arab/Muslim world, the horrific images pouring out of Gaza daily are allowing preachers and politicians to deploy well-worn yet still dangerous and inciteful stereotypes against Jews as they rally the masses against Israel - and through it - their own governments.\n\n \n Yes, and just as always, they are based on lies and a perversion of the actual facts. And in your mind, Israel would be wise to do nothing in response to these thousands of rockets disrupting and terrorizing their country so as not to incite further lies about their right to defend themselves. Talk about a classic case of circular reasoning.\n \n \nWhat is most frightening is that the most important of Israel's so-called friends, the US political establishment and the mainstream Jewish leadership, seem clueless to the devastating trap that Israel has led itself into - in good measure with their indulgence and even help.\n\n \n Not at all. What is most frightening is that so many people are responding against Israel based on the evidence manufactured by Hamas by sacrificing their own people for political gain. That is the real tragedy here. By ignorant people worldwide buying into these distortions of events, they are encouraging the continued sacrifice of innocent Palestinians by buying into the lies being perpetrated by the proponents of these terrorists. Sadly though, the blindness and tunnel vision of the leftist brain makes rational thinking an impossible exercise in futility.\n \n \n It is one that threatens the country's existence far more than any Qassam rockets, with their 0.4 per cent kill rate; even more than the disastrous 2006 invasion of southern Lebanon, which by weakening Israel's deterrence capability in some measure made this war inevitable.\n\n \n The only threat to Israel's survival would be to continue to allow these attacks to go unchallenged. If Israel would take my advice and escort every Palestinian unwilling to leave on their own to the Lebanese and Syrian borders and send them packing since they hate the jews so much. If they refuse to live in peace then let them go live with Arabs whom they claim to love. 61 years is more than enough time to have attempted this experiment of Arab/Israeli cohabitation. The problem the Palestinians have is that they are so impossible to live with, that they have also been forcefully ejected from every Arab Country they have ever gone to.\n \n \nFirst, it is clear that Israel cannot destroy Hamas, it cannot stop the rockets unless it agrees to a truce that will go far to meeting the primary demand of Hamas - an end to the siege.\n\n \n That remains to be seen. But one thing is for sure, by accepting another truce of empty promises which will never be honored by Hamas, that is a sure way to continue the same circle of oppression and terror which Israel has been suffering under.\n \n \nMerely by surviving (and it surely will survive) Hamas, like Hezbollah in 2006, will have won. ..... \"\n\n \n I realize that is your hope and prayer. But the only hope Israel has to make sure that doesn't happen is to continue to batter them until they destroy them. Because we know from past experience that Hamas will never negotiate honestly or in good faith, EVER!!!\n \n \nIt certainly appears more honest and unbiased than the Likud propaganda posted earlier on another thread as commentary.\n\n \n Sure it does, to you who prefers the lie to the truth. Only you could be so blind and blatantly dishonest as to call the terrorists reports of the effect their thousands of fired rockets are having on Israel, over the Israeli reports themselves as the recipients of these attacks.", 
   {}, 
   340378, 
   null, 
   1232131740.0
  ], 
  [
   340652, 
   null, 
   "subaru", 
   "-\n \n My program for solving the problems of the Mideast is, as usual, \n blindingly simple, clear and effective. The United States should, in \n that spirit of true generosity which it incessantly praises itself \n for possessing in great abundance, give the southern half of Florida \n to the state of Israel as New Israel, in exchange for removing itself \n from the Middle East. Surely, in common decency, considering the \n great evil which the US has inflicted on the Middle East for more than \n half-a-century, it is the least it can do. Jews obviously like \n Florida---there are so many there already---therefore the transition \n should be easy. After being cooped-up in that dangerous, god-forsaken, \n postage-stamp-sized desert where they are now, New Israel \n should make them happy as clams. They will come to see New Israel as \n the TRUE Land of Milk and Honey which was foretold in their scriptures.\n \n \n It will be a win-win situation for everybody. The New Israelites will \n have a safe, clean, prosperous land to develop. They will finally be \n able to earn their own keep. The United States will no longer need to \n spend countless billions of dollars of its treasure in the vain \n attempt to prop up a doomed country in a hostile region. The Arabs \n will be over-joyed to take possession of the desert wasteland they \n covet so much. This sense of victory will give a much-needed boost to \n their sense of self-confidence after having defeated themselves in so \n many wars. I am sure that in exchange for this settlement of \n outstanding grievances they would gladly allow those few Jewish \n religious conservatives who did not want to emigrate to the fleshpots \n of New Israel to end their days in contentment, happily and \n peacefully beating their heads against the Wailing Wall.\n \n Also, after a few years, when tempers have had time to cool down, the \n Arabs will probably be begging New Israelite technicians and \n scientists to return to the Middle East, in order to help them \n develop their economies and educational institutions. [That was the \n way Zionism was originally supposed to work---remember?]\n It is true that there will be a few losers in the otherwise \n astounding perfection of this scheme. There will be a few \n fundamentalist Christians who will be deeply saddened that, due to \n the absence of a Jewish government in Jerusalem, the End of the World \n will have to be postponed. I would console them with the reflection \n that it is the Will of the Almighty that life be a vale of tears for \n the Elect of God.\n \n Lastly---and this is the clincher---the consideration which will make \n the American people, nay, the people of the entire world, embrace \n this proposal with fervor: once this brilliant plan is implemented \n something finally will be done about global warming! The citizens of \n New Israel will move heaven and earth to prevent so much valuable \n real estate from being swallowed up by rising sea-levels!\n \n I am in awe of the wondrous radiance of my beautiful mind! I AM a \n true American!\n \n -", 
   {
    "post_info": {
     "post_title": "Sagacious, Bold and Turbulent of Wit...."
    }
   }, 
   340461, 
   null, 
   1232260380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Who will save Israel from itself?", 
  "url": "http://www.4forums.com/political/peace-middle-east/12222-who-will-save-israel-itself.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 12222, 
  "discussion_files": [
   [
    "11272.html", 
    "http://www.4forums.com/political/peace-middle-east/12222-who-will-save-israel-itself-print.html"
   ]
  ], 
  "identifier": 12222
 }
]