[
 [
  [
   340529, 
   null, 
   "subaru", 
   "-\n \n In the benighted West, there is a tendency to look at politics as a joke, but to be very serious about religion. This has had a good influence on politics, and a very bad influence on religion. The sorry history of Western religion is a tale of incredible barbarism and savagery.\n \n In glorious China, the reverse has been the case. Politics have been taken very seriously, and religion is regarded as a subject for humor. Just look at the Zhuang Zi, the only major religious classic in human history that displays a sense of humor. Also take note of the famous Chinese novel, Journey to the West, [Xi You Ji], a picaresque and fantastic adventure yarn with a great deal of Buddhist doctrine woven into it.\n \n Traditional Chinese politics were a mixed bag: some things good, some things bad. In many ways they were superior to traditional European politics: more social mobility and a more orderly society, with a greater emphasis on humane behaviour. The Chinese tradition of humor in religion is a major contribution to human civilization. Zen (Chan), for example, is a signal example of the benefits which this light touch confers upon the religious sensibility.\n \n My view, of course, is that religion is a joke ---- unfortunately, one which usually is in bad taste.\n --------------------------------------------------------\n \n Living without faith takes real courage\n ---- sign at a fundamentalist church \n \n (My sense of humor was tickled by the double entendre of which the fundamentalists were quite unaware)\n \n -", 
   {
    "post_info": {
     "post_title": "Religion Is a Joke"
    }
   }, 
   null, 
   null, 
   1232173260.0
  ], 
  [
   340532, 
   null, 
   "subaru", 
   "-\n \n The entire New Testament of the Bible is nothing more than legend. ( With the exception that Pontius Pilate was a prefect [ not a procurator! ] in Judea in the first century A.D. )\n \n There is no independent attestation to any of the New Testament. There is not a single mention of Jesus in any non-biblical writing of the first century A.D. [ I discount the two fragments in Josephus. Only the longer fragment is significant, and it is all too obviously an interpolation by a later Christian scribe ]\n \n First century Judea was lousy with religious fanatics, rabbis and \"Christs\" ( that is, supposed \"Anointed Ones\" or \"Messiahs\" ). The Gospels could easily be ( and probably are ) a mish-mash of \"wise saws and ancient instances\" and confused recollections about any number of the religious lunatics who were wandering through Judea during that century. It would not surprise me that one of these \"Christs\" was crucified by Pontius Pilate, and that he had a brother named James; but neither would it surprise me that the whole story was woven out of pure fantasy and bits and pieces of various incidents which occurred during that century.\n \n The first significant mention of Christians comes from the second century. Tacitus, in his Annals, describes the Great Fire of Rome during Nero's reign, and he states:\n \n Sed non ope humana, non largitionibus principis aut deum placamentis decedebat infamia, quin iussum incendium crederetur. ergo abolendo rumori Nero subdidit reos et quaesitissimis poenis adfecit, quos per flagitia invisos vulgus Chrestianos appellabat. auctor nominis eius Christus Tibero imperitante per procuratorem Pontium Pilatum supplicio adfectus erat; repressaque in praesens exitiablilis superstitio rursum erumpebat, non modo per Iudaeam, originem eius mali, sed per urbem etiam, quo cuncta undique atrocia aut pudenda confluunt celebranturque. igitur primum correpti qui fatebantur, deinde indicio eorum multitudo ingens haud proinde in crimine incendii quam odio humani generis convicti sunt. \n ---- Annales XV 44\n \n [ But all human efforts, all the lavish gifts of the emperor, and the propitiations of the gods, did not banish the sinister belief that the conflagration was the result of an order. Consequently, to get rid of the report, Nero fastened the guilt and inflicted the most exquisite tortures on a class hated for their abominations, called Christians by the populace. Christus, from whom the name had its origin, suffered the extreme penalty during the reign of Tiberius at the hands of one of our procurators, Pontius Pilatus, and a most mischievous superstition, thus checked for the moment, again broke out not only in Judaea, the first source of the evil, but even in Rome, where all things hideous and shameful from every part of the world find their centre and become popular. Accordingly, an arrest was first made of all who pleaded guilty; then, upon their information, an immense multitude was convicted, not so much of the crime of firing the city, as of hatred against mankind. ]\n \n Tacitus also writes:\n \n nec quisquam defendere audebat, crebris multorum minis restinguere prohibentium, et quia alii palam facies iaciebant atque esse sibi auctorem vociferabantur, sive ut raptus licentius exercerent seu iussu. \n ---- Annales XV 38\n \n [ And no one dared to stop the mischief, because of incessant menaces from a number of persons who forbade the extinguishing of the flames, because again others openly hurled brands, and kept shouting that there was one who gave them authority, either seeking to plunder more freely, or obeying orders. ]\n \n Even if the Christians did not start the fire, it seems very likely that they did everything they could in order to keep the fire burning and to spread the flames.\n \n The Latin says that certain people confessed to \"attacks,\" or to \"seizing of plunder.\" Then, apparently because all or most of the people first arrested were Christians, the rest of the cult of atheists ( as the Romans thought of them ) were rounded up because \"they hated mankind\" and were prone to terrorism.\n \n I do not know why so many people assume that the Christians were not, in fact, responsible for the Great Fire of Rome. They were hysterical religious fanatics; they considered Rome to be Great Babylon, a sewer of sin; they thought the world was going to end at any moment, ushering in a golden age of the reign of the saints ( that is, of their own humble selves ). What could be more natural than to attempt to hurry along the advent of so much glory and happiness? The ramshackle area of Rome where the fire started was inhabited by many Jews ( and so, presumably, by many Christians ). The Roman authorities at the time were convinced that the Christians had a hand in starting or spreading the fire.\n \n -", 
   {
    "post_info": {
     "post_title": "Legions of Legends"
    }
   }, 
   340529, 
   null, 
   1232176680.0
  ], 
  [
   340533, 
   null, 
   "Archangel", 
   "This passage was written specifically for you subaru.\n Rom 1:18 For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men who suppress the truth in unrighteousness,\n Rom 1:19 because that which is known about God is evident within them; for God made it evident to them.\n Rom 1:20 For since the creation of the world His invisible attributes, His eternal power and divine nature, have been clearly seen, being understood through what has been made, so that they are without excuse.\n Rom 1:21 For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened.\n Rom 1:22 Professing to be wise, they became fools,\n Rom 1:23 and exchanged the glory of the incorruptible God for an image in the form of corruptible man and of birds and four-footed animals and crawling creatures.\n Rom 1:24 Therefore God gave them over in the lusts of their hearts to impurity, so that their bodies would be dishonored among them.\n Rom 1:25 For they exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator, who is blessed forever. Amen.\n Rom 1:26 For this reason God gave them over to degrading passions; for their women exchanged the natural function for that which is unnatural,\n Rom 1:27 and in the same way also the men abandoned the natural function of the woman and burned in their desire toward one another, men with men committing indecent acts and receiving in their own persons the due penalty of their error.\n Rom 1:28 And just as they did not see fit to acknowledge God any longer, God gave them over to a depraved mind, to do those things which are not proper,\n Rom 1:29 being filled with all unrighteousness, wickedness, greed, evil; full of envy, murder, strife, deceit, malice; {they are} gossips,\n Rom 1:30 slanderers, haters of God, insolent, arrogant, boastful, inventors of evil, disobedient to parents,\n Rom 1:31 without understanding, untrustworthy, unloving, unmerciful;\n Rom 1:32 and although they know the ordinance of God, that those who practice such things are worthy of death, they not only do the same, but also give hearty approval to those who practice them.", 
   {}, 
   340532, 
   null, 
   1232179140.0
  ], 
  [
   340537, 
   null, 
   "Penfold", 
   "This passage was written specifically for you subaru. ............. \n\n \n I don't see his name in there anywhere, but I do see that you still don't get it. It may speak to you, and those of your condemnatory ilk, but it's just empty meaningless incantations to him.", 
   {}, 
   340533, 
   null, 
   1232194980.0
  ], 
  [
   340541, 
   null, 
   "hollyh", 
   "\n Rom 1:32 and although they know the ordinance of God, that those who practice such things are worthy of death\n\n \n Worthy of death? who is worthy of death?", 
   {}, 
   340533, 
   null, 
   1232198820.0
  ], 
  [
   340544, 
   null, 
   "Archangel", 
   "Worthy of death? who is worthy of death?\n\n \n Note the bolded Holly, that's the general warning. And the rest of the passage gets more specific in defining the character traits that God hates, which I also bolded. It's really very clear if you read it, so I don't really understand your question.\n \n The fact is that all who are unredeemed fit into this list of sins somewhere. So it reveals that we are all worthy of death, and subsequently all in need of salvation and Gods supernatural forgiveness. \n Rom 1:18 For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men who suppress the truth in unrighteousness,\n Rom 1:19 because that which is known about God is evident within them; for God made it evident to them.\n Rom 1:20 For since the creation of the world His invisible attributes, His eternal power and divine nature, have been clearly seen, being understood through what has been made, so that they are without excuse.\n Rom 1:21 For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened.\n Rom 1:22 Professing to be wise, they became fools,\n Rom 1:23 and exchanged the glory of the incorruptible God for an image in the form of corruptible man and of birds and four-footed animals and crawling creatures.\n Rom 1:24 Therefore God gave them over in the lusts of their hearts to impurity, so that their bodies would be dishonored among them.\n Rom 1:25 For they exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator, who is blessed forever. Amen.\n Rom 1:26 For this reason God gave them over to degrading passions; for their women exchanged the natural function for that which is unnatural,\n Rom 1:27 and in the same way also the men abandoned the natural function of the woman and burned in their desire toward one another, men with men committing indecent acts and receiving in their own persons the due penalty of their error.\n Rom 1:28 And just as they did not see fit to acknowledge God any longer, God gave them over to a depraved mind, to do those things which are not proper,\n Rom 1:29 being filled with all unrighteousness, wickedness, greed, evil; full of envy, murder, strife, deceit, malice; {they are} gossips,\n Rom 1:30 slanderers, haters of God, insolent, arrogant, boastful, inventors of evil, disobedient to parents,\n Rom 1:31 without understanding, untrustworthy, unloving, unmerciful;\n Rom 1:32 and although they know the ordinance of God, that those who practice such things are worthy of death, they not only do the same, but also give hearty approval to those who practice them. Also, remember holly, that in its proper context, this is a warning, not an inevitable curse. The bible offers a solution and deliverance from the stated outcome to the willing heart.", 
   {}, 
   340541, 
   null, 
   1232205720.0
  ], 
  [
   340553, 
   null, 
   "Penfold", 
   "....the rest of the passage gets more specific ......... that God hates, ....... It's really very clear if you read it, so I don't understand. .......\n \n Also, remember holly, that in its proper context, this is ..... an inevitable curse.....\n\n \n \n \n Fixed it. emoticon_xgood", 
   {}, 
   340544, 
   null, 
   1232210460.0
  ], 
  [
   340557, 
   null, 
   "Archangel", 
   "Fixed it. emoticon_xgood\n\n \n And always true to character, penfold perverts yet another clearly written post in order to satisfy his warped and corrupted understanding of what I say, not to mention God and His truths. emoticon_xgood", 
   {}, 
   340553, 
   null, 
   1232212140.0
  ], 
  [
   340564, 
   null, 
   "subaru", 
   "-\n \n And these are for you, Archie:\n \n \n Rom 1:22 Professing to be wise, they became fools,\n \n Rom 1:30 slanderers,\n \n Rom 1:31 without understanding, untrustworthy, unloving, unmerciful\n \n -", 
   {
    "post_info": {
     "post_title": "Take the beam out of your own eye, Buster"
    }
   }, 
   340557, 
   null, 
   1232217240.0
  ], 
  [
   340570, 
   null, 
   "subaru", 
   "\n \n I don't see his name in there anywhere, but I do see that you still don't get it. It may speak to you, and those of your condemnatory ilk, but it's just empty meaningless incantations to him.\n \n \n\n \n Oh, not wholly meaningless. The passage shows that Paul or whoever wrote it was preaching to Jews or trying to get Gentiles to move on over to the Jewish side. Christianity was still a part of the Jewish cult. Some of the things he condemns were crimes among the Jews, but not among the Gentiles. For example, Jews killed homosexuals, but Romans and Greeks were basically indifferent to homosexuality. It became a crime in Roman law only around 430 AD under the Christian emperor Justinian because \"it is well-known that the practice causes earthquakes.\"\n \n Ah, well! And so the March of Human Folly goes on.\n \n And why so much anger and desire to murder those who are different from oneself, as is so evidently just under the surface in people like Archangel? If he ever got the chance, Archangel would be supporting pogroms, witch-hunts, inquisitions, torture and burning of heretics, and so on. He would easily convince himself that he was an instrument of the Almighty. Such was the mind-set of the Jewish laws, and they were the expression of fearful, paranoid, hysterical, semi-civilized Bronze Age barbarians.\n \n The God of most of the Old Testament shows this mind-set, blown up to an absurd extent, like the frog in Aesop's fable. He is like one of those paranoid, megalomaniacal Babylonian or Assyrian god-kings we see revealed in the cuneiform inscriptions: boasting that he is all-powerful, that he has killed and tortured all his enemies, that there is none like unto him, that all must bow down and grovel before him, and so on. Jehovah is the outward manifestation of a very sick society.\n \n -", 
   {
    "post_info": {
     "post_title": "Jehovah, that dirty old man!"
    }
   }, 
   340537, 
   null, 
   1232219700.0
  ], 
  [
   340575, 
   null, 
   "Archangel", 
   "-\n \n And these are for you, Archie:\n \n \n Rom 1:22 Professing to be wise, they became fools,\n \n Rom 1:30 slanderers,\n \n Rom 1:31 without understanding, untrustworthy, unloving, unmerciful\n \n -\n\n \n Actually, I posted those because they define you so perfectly. After all, It isn't me who is claiming to be God or slandering His faithful follower here. That is most definitely you.", 
   {}, 
   340564, 
   null, 
   1232221080.0
  ], 
  [
   340579, 
   null, 
   "T.Q", 
   "Actually, I posted those because they define you so perfectly. After all, It isn't me who is claiming to be God or slandering His faithful follower here. That is most definitely you.\n\n \n Actually, they're a pretty good fit for you. \n You profess to know more than most on here, yet constantly display your ignorance\n You contstantly slander those who you don't agree with.\n You are ignorant (without understanding), you believe everyone who disagrees with you is lying (untrustworthy), you constantly bash gays and those who don't share your particular narrow beliefs (unloving), and constantly state that muslims should be wiped off the face of the earth (unmerciful).\n \n Sounds like a good fit to me.", 
   {}, 
   340575, 
   null, 
   1232221860.0
  ], 
  [
   340588, 
   null, 
   "Archangel", 
   "Only in the mind of you and your cohorts is that true tq, and I can live with that opinion considering the source. Just to prove to all objective observers how incredibly dishonest and in denial you are, here's the whole passage in context to read. Now who does it sound like it's speaking to?\n Rom 1:18 For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men who suppress the truth in unrighteousness,\n Rom 1:19 because that which is known about God is evident within them; for God made it evident to them.\n Rom 1:20 For since the creation of the world His invisible attributes, His eternal power and divine nature, have been clearly seen, being understood through what has been made, so that they are without excuse.\n Rom 1:21 For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened.\n Rom 1:22 Professing to be wise, they became fools,\n Rom 1:23 and exchanged the glory of the incorruptible God for an image in the form of corruptible man and of birds and four-footed animals and crawling creatures.\n Rom 1:24 Therefore God gave them over in the lusts of their hearts to impurity, so that their bodies would be dishonored among them.\n Rom 1:25 For they exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator, who is blessed forever. Amen.\n Rom 1:26 For this reason God gave them over to degrading passions; for their women exchanged the natural function for that which is unnatural,\n Rom 1:27 and in the same way also the men abandoned the natural function of the woman and burned in their desire toward one another, men with men committing indecent acts and receiving in their own persons the due penalty of their error.\n Rom 1:28 And just as they did not see fit to acknowledge God any longer, God gave them over to a depraved mind, to do those things which are not proper,\n Rom 1:29 being filled with all unrighteousness, wickedness, greed, evil; full of envy, murder, strife, deceit, malice; {they are} gossips,\n Rom 1:30 slanderers, haters of God, insolent, arrogant, boastful, inventors of evil, disobedient to parents,\n Rom 1:31 without understanding, untrustworthy, unloving, unmerciful;\n Rom 1:32 and although they know the ordinance of God, that those who practice such things are worthy of death, they not only do the same, but also give hearty approval to those who practice them.", 
   {}, 
   340579, 
   null, 
   1232223540.0
  ], 
  [
   340599, 
   null, 
   "subaru", 
   "\n \n Only in the mind of you and your cohorts is that true.... \n \n \n\n \n That is an illiterate usage of the word \"cohort\".\n \n -", 
   {
    "post_info": {
     "post_title": "I command no divisions of a Roman legion"
    }
   }, 
   340588, 
   null, 
   1232227200.0
  ], 
  [
   340608, 
   null, 
   "Archangel", 
   "That is an illiterate usage of the word \"cohort\".\n \n -\n\n \n Only an illiterate would make such an ignorant statement. Note the bolded:\n co&#8901;hort[koh-hawrt] Show IPA Pronunciation \n -noun\n 1. a group or company: She has a cohort of admirers.\n 2. a companion or associate.\n 3. one of the ten divisions in an ancient Roman legion, numbering from 300 to 600 soldiers.\n 4. any group of soldiers or warriors.\n 5. an accomplice; abettor: He got off with probation, but his cohorts got ten years apiece.\n 6. a group of persons sharing a particular statistical or demographic characteristic: the cohort of all children born in 1980.", 
   {
    "unicode_changes_made": true
   }, 
   340599, 
   null, 
   1232233020.0
  ], 
  [
   340611, 
   null, 
   "subaru", 
   "-\n \n #2 and #5 are sub-standard. A cohort must be a group, not an individual.\n \n -", 
   {
    "post_info": {
     "post_title": "Get a &quot;personal revelation&quot; from your drooling, sex-maniac God, Archangel"
    }
   }, 
   340608, 
   null, 
   1232233500.0
  ], 
  [
   340615, 
   null, 
   "Archangel", 
   "That is an illiterate usage of the word \"cohort\".\n \n -\n\n \n \nOnly an illiterate would make such an ignorant statement. Note the bolded:\n co&#8901;hort[koh-hawrt] Show IPA Pronunciation \n -noun\n 1. a group or company: She has a cohort of admirers.\n 2. a companion or associate.\n 3. one of the ten divisions in an ancient Roman legion, numbering from 300 to 600 soldiers.\n 4. any group of soldiers or warriors.\n 5. an accomplice; abettor: He got off with probation, but his cohorts got ten years apiece.\n 6. a group of persons sharing a particular statistical or demographic characteristic: the cohort of all children born in 1980.\n\n \n \n-\n \n #2 and #5 are sub-standard. A cohort must be a group, not an individual.\n \n -\n\n \n Did you miss 1 and 6? Either way, you're being consistent in how wrong you are once again in your attempt to criticize the mundane and irrelevant rather than the subject being debated.", 
   {
    "unicode_changes_made": true
   }, 
   340611, 
   null, 
   1232235000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Religion Is a Joke", 
  "url": "http://www.4forums.com/political/religion-debates/12228-religion-joke.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12228, 
  "discussion_files": [
   [
    "7539.html", 
    "http://www.4forums.com/political/religion-debates/12228-religion-joke-print.html"
   ], 
   [
    "7540.html", 
    "http://www.4forums.com/political/religion-debates/12228-religion-joke-2-print.html"
   ]
  ], 
  "identifier": 12228
 }
]