[
 [
  [
   340904, 
   null, 
   "Bassman", 
   "This is not an attempt at partisanship, mind you, but a legitimate concern that I see cropping up as the \"One\" is sworn in this week. Do Obama supporters have unrealistic expectations for the new President??", 
   {
    "post_info": {
     "post_title": "Is Barack Setting himself up for failure??"
    }
   }, 
   null, 
   null, 
   1232426340.0
  ], 
  [
   340943, 
   null, 
   "Jo Bennett", 
   "I think it's a reasonable concern. Everyone is (rightly, given that he couldn't be much worse) expecting him to be better than Bush. From that point, people veer off into their own wish-fulfillment about what precise ways he will be better. My suspicion is that we're just going to get another Clinton, just without the adultery. Yes he won't go in for mass murder on such a grand and expensive scale but he's no peacenik and certainly no socialist.", 
   {}, 
   340904, 
   null, 
   1232436240.0
  ], 
  [
   340949, 
   null, 
   "Penfold", 
   "He is actively trying to reduce those expectatons as we speak, but he is struggling against a tide of relief that Bush is gone at last. This partisan poll notwithstanding.", 
   {}, 
   340943, 
   null, 
   1232454000.0
  ], 
  [
   341058, 
   null, 
   "Charliegone", 
   "This is not an attempt at partisanship, mind you, but a legitimate concern that I see cropping up as the \"One\" is sworn in this week. Do Obama supporters have unrealistic expectations for the new President??\n\n \n Heck yes they do. I think they should be optimistic, but not to the point where they'd lie to themselves about some of his past dubious doings or even ignore them. I certainly took into considerations all those things when the election was on of both candidates, not just Barack. I think most people will see he is not going to keep all those promises he made.", 
   {}, 
   340904, 
   null, 
   1232510220.0
  ], 
  [
   341107, 
   null, 
   "Steeeeve", 
   "Over the past few days all we have heard from the Obama supporters is \"he will bring hope and change\". This is ridiculous as he will bring much of the same and leave us with some loose change left in our pockets. I support this by pointing out two examples; that his cabinet is full of people who are already DC folks (ie former Clinton or former Bush [1]) and he is already proposing a $800 billion bailout just like Bush's previous 2 that didn't work. We have only had President Obama for less that 24hrs though.\n \n This however was not the question. Obama is actually setting himself up for success and he is smart enough to pull it off (debatable if he can). I define success as people perceiving you are a good president and not that you are actually a good president. \n \n Obama is setting himself up for success by doing things that will make people happy as opposed to what will be best for them. If you want an analogy think of a fat kid who wants a candy bar. If you give him a candy bar he will like you but you certainly aren't helping him. Some things he is doing is trying to make the economy seem better in the short term (self admitting on his part). So in 4 years he can claim the economy is awesome when it really isn't and we just charged in on the Visa until a future date. This could backfire since this is a different kind of problem but it did work for Bush (another similarity). \n \n Obama is setting himself in other ways but I won't get specific. He pretty much wants to be a people pleaser and you can set yourself to be one. The bad thing about this is you might end up like Jimmy Carter.", 
   {}, 
   341058, 
   null, 
   1232556780.0
  ], 
  [
   341145, 
   null, 
   "simone", 
   "The important thing is that President Obama's cabinet is not larded with corporatist self-serving Bush people and there will be change.\n \n Laws will be enforced, old regulations will be brought back and corporate greed will be brought under a certain amount of control.", 
   {}, 
   341107, 
   null, 
   1232566200.0
  ], 
  [
   341159, 
   null, 
   "snakespit", 
   "The important thing is that President Obama's cabinet is not larded with corporatist self-serving Bush people and there will be change.\n \n Laws will be enforced, old regulations will be brought back and corporate greed will be brought under a certain amount of control.\n\n \n Tim Geithner. emoticon_xgood", 
   {}, 
   341145, 
   null, 
   1232570760.0
  ], 
  [
   341169, 
   null, 
   "Steeeeve", 
   "Tim Geithner. emoticon_xgood\n\n \n Seriously! I understand making a mistake on taxes but not if you are going to Treasury secretary when the mistake was not that long ago. Good grief, it just looks terrible. \n \n It is as if Obama wants to prove he can appoint worse people than Bush did and I admit it is going to be hard to go below Paulson.", 
   {}, 
   341159, 
   null, 
   1232575020.0
  ], 
  [
   341174, 
   null, 
   "Zardoz", 
   "Over the past few days all we have heard from the Obama supporters is \"he will bring hope and change\". This is ridiculous as he will bring much of the same and leave us with some loose change left in our pockets. I support this by pointing out two examples; that his cabinet is full of people who are already DC folks (ie former Clinton or former Bush [1]) and he is already proposing a $800 billion bailout just like Bush's previous 2 that didn't work. We have only had President Obama for less that 24hrs though.\n \n This however was not the question. Obama is actually setting himself up for success and he is smart enough to pull it off (debatable if he can). I define success as people perceiving you are a good president and not that you are actually a good president. \n \n Obama is setting himself up for success by doing things that will make people happy as opposed to what will be best for them. If you want an analogy think of a fat kid who wants a candy bar. If you give him a candy bar he will like you but you certainly aren't helping him. Some things he is doing is trying to make the economy seem better in the short term (self admitting on his part). So in 4 years he can claim the economy is awesome when it really isn't and we just charged in on the Visa until a future date. This could backfire since this is a different kind of problem but it did work for Bush (another similarity). \n \n Obama is setting himself in other ways but I won't get specific. He pretty much wants to be a people pleaser and you can set yourself to be one. The bad thing about this is you might end up like Jimmy Carter.\n\n \n Yep.\n All Obama's ever really done is position himself to run for election. From office to higher office. Already he's working on getting re-elected. That's about it.\n \n But, you didn't hear that from me 'cause I played basketball with him so I'll be appointed to a nice cushy position...Chicago style. \n Already got the hoops set up in the oval office.\n \n Can't wait for some pork-barrel projects to be swung my way...erm, I mean stimulus projects to get the 'conomy going again.", 
   {}, 
   341107, 
   null, 
   1232578680.0
  ], 
  [
   341232, 
   null, 
   "snakespit", 
   "Seriously! I understand making a mistake on taxes but not if you are going to Treasury secretary when the mistake was not that long ago. Good grief, it just looks terrible. \n \n It is as if Obama wants to prove he can appoint worse people than Bush did and I admit it is going to be hard to go below Paulson.\n\n \n I think Obama has tapped some great people to serve in his administration, but Geithner is certainly is not one of them. The man who will head the IRS admits to what amounts to tax evasion, appologizes (during his confirmation hearing for Sec. of Treasury!!!), and still garners the support of the man who say's he will clean up Washington and hold his administration to a higher standard. Sounds like business as usual in DC to me.", 
   {}, 
   341169, 
   null, 
   1232631360.0
  ], 
  [
   341254, 
   null, 
   "isly ilwott", 
   "I voted Yea even though I think it is not Obama's intent to set himself up for failure. He would love to succeed. However, the MSM and the good old boy system that Barack was cultivated in have set him up for failure to reach the goals and promises created by the media's desire to contrast the future with the past.\n \n Obama is our President now, but our system is not such that any President can do anything he wants to do. I suspect even some of his appointments and nominations have been driven by the machine and not solely by his personal feelings toward the individuals being tapped.\n \n Yes, there are those that voted for Obama thinking he is actually going to line their pockets and pay their bills. There is a recent example of a person who responded to a bank's request that she bring her car loan to good standing by saying that Obama was going to take care of it. I have no doubt that there are thousands, if not millions of people that think like that. That's why they voted for him.\n \n I wish Obama a great deal of luck. He's going to need it.", 
   {
    "post_info": {
     "post_title": "With reservations..."
    }
   }, 
   341232, 
   null, 
   1232643420.0
  ], 
  [
   341267, 
   null, 
   "Charliegone", 
   "I voted Yea even though I think it is not Obama's intent to set himself up for failure. He would love to succeed. However, the MSM and the good old boy system that Barack was cultivated in have set him up for failure to reach the goals and promises created by the media's desire to contrast the future with the past.\n \n Obama is our President now, but our system is not such that any President can do anything he wants to do. I suspect even some of his appointments and nominations have been driven by the machine and not solely by his personal feelings toward the individuals being tapped.\n \n Yes, there are those that voted for Obama thinking he is actually going to line their pockets and pay their bills. There is a recent example of a person who responded to a bank's request that she bring her car loan to good standing by saying that Obama was going to take care of it. I have no doubt that there are thousands, if not millions of people that think like that. That's why they voted for him.\n \n I wish Obama a great deal of luck. He's going to need it.\n\n \n I still think Obama's campaign ran a dirty one. Why do I say this. Just research on how he won the Senate seat. He didn't win with honest old tactics, he dove into the private life of his opponent and destroyed him (his opponent was a divorced from the movie star Jeri Ryan, you know Seven of Nine on star trek.) I think, it will be business as usual in DC, Chicago style, that is...do it or else. If this is your view of change...you are in for a loooonnngg ride.", 
   {}, 
   341254, 
   null, 
   1232650080.0
  ], 
  [
   341275, 
   null, 
   "isly ilwott", 
   "I still think Obama's campaign ran a dirty one. Why do I say this. Just research on how he won the Senate seat. He didn't win with honest old tactics, he dove into the private life of his opponent and destroyed him (his opponent was a divorced from the movie star Jeri Ryan, you know Seven of Nine on star trek.) I think, it will be business as usual in DC, Chicago style, that is...do it or else. If this is your view of change...you are in for a loooonnngg ride.\n...and he won his first election by having all the other candidates removed from the ballot.\n \n Let's not give Republicans a pass on dirty tricks though. IIRC, there have been some wickedly dishonest campaigns with underhanded tricks on both sides of the aisle. I think it was the media that tainted this past election to a point far beyond what either party has ever done by itself. By reporting Obama's good intentions, Bush's failings and by not reporting Obama's failings and shady past, the media painted a very unblemished picture of Obama and a very biased picture of Bush. Obama became the Messiah. The unenlightened American public would have voted for a two headed goat rather than another Republican. McCain had no chance from the beginning regardless of how much money he had to spend.", 
   {}, 
   341267, 
   null, 
   1232654460.0
  ], 
  [
   341283, 
   null, 
   "chester", 
   "\n \n Let's not give Republicans a pass on dirty tricks though.\n\n \n Saxby Chambliss ran the sleaziest campaign in modern history, accusing Max Cleland, a man who left three limbs in Viet Nam, of being unpatriotic.\n \n Nothing, NOTHING compares to that sewer spouter.", 
   {}, 
   341275, 
   null, 
   1232655540.0
  ], 
  [
   341289, 
   null, 
   "Ethmi", 
   "He has good intentions, but I think we've spent enough tax dollars to fund programs that don't work.", 
   {}, 
   341283, 
   null, 
   1232656140.0
  ], 
  [
   341320, 
   null, 
   "isly ilwott", 
   "Saxby Chambliss ran the sleaziest campaign in modern history, accusing Max Cleland, a man who left three limbs in Viet Nam, of being unpatriotic.\n \n Nothing, NOTHING compares to that sewer spouter.\nMax blew his own limbs off accidentally...still no cause for sleaze. I was thinking more of another Republican strategist that initiated dirty tricks to get other Republicans elected. IIRC, he was remorseful on his death bed for having pulled such dirty tricks...can't seem to think of his name.\n \n The dirtiest tricks of this past Presidential campaign came from the media in their continual effort to report only the bad things about Bush's policies and the war while reporting only the positive things about Obama and his call for change. Of course everyone wanted change.\n \n The American media has absolute control over what gets emphasized or ignored in the news broadcasts. Most news productions these days are intended to make celebrities of the anchors more so than anything else. They are paid millions just to look right and come across well to the viewers. Couple that with dumb American's near maniacal need to watch Entertainment Tonight, American Idol and Monday Night Football rather than the BBC, Reuters, Frontline, Charlie Rose and the like and you have a recipe for a mass of complete fools going to the polls. That is nearly exactly what happened here in November 2008...fools went to the polls and elected Barack Obama's packaged image to the highest office in the land. Obama's campaign proved again that all it takes is money...and those that gave him money will expect something in return. He bought the Presidency for 668 million dollars.", 
   {}, 
   341283, 
   null, 
   1232668920.0
  ], 
  [
   341366, 
   null, 
   "jitobear", 
   "I don't think he is doing it. He has repeatedly said that things won't get better easily and has said we all have to work for them to do so.\n \n I do think some of his supporters need a reality check. I like Obama. I voted for Obama. I have high hopes for this administration. But it is not peopled with the infallable.", 
   {}, 
   341320, 
   null, 
   1232687520.0
  ], 
  [
   341450, 
   null, 
   "Steeeeve", 
   "I think Obama has tapped some great people to serve in his administration, but Geithner is certainly is not one of them. The man who will head the IRS admits to what amounts to tax evasion, appologizes (during his confirmation hearing for Sec. of Treasury!!!), and still garners the support of the man who say's he will clean up Washington and hold his administration to a higher standard. Sounds like business as usual in DC to me.\nYou really think the appointments are good? \n \n Gates is probably a good keep, Clinton probably not a terrible pick, Salazer seems to be ok but I don't know much about him.\n \n The ones that I know stink Duncan for education, Geithner for treasury, and Daschle for HHS. Some of the others I'm still researching...don't know much about them.", 
   {}, 
   341232, 
   null, 
   1232745180.0
  ], 
  [
   341468, 
   null, 
   "simone", 
   "Steeeve, your expert reasoning on why Geithner, Daschle and Clinton are stinky.", 
   {}, 
   341450, 
   null, 
   1232754780.0
  ], 
  [
   341572, 
   null, 
   "Steeeeve", 
   "Steeeve, your expert reasoning on why Geithner, Daschle and Clinton are stinky.\nHow kind of you to notice....I wasn't exactly trying to lay out the evidence to try and convince you but merely offer my opinion.", 
   {}, 
   341468, 
   null, 
   1232842080.0
  ], 
  [
   341673, 
   null, 
   "simone", 
   "Hast thou, then, any solid evidence of their stinkiness?", 
   {}, 
   341572, 
   null, 
   1232917080.0
  ], 
  [
   341682, 
   null, 
   "marc9000", 
   "The stinkiest one of all is Carol Browner. \n \n \nMs. Browner belonged to Socialist International until 2008 per the Washington Times. SI is an umbrella group of many socialist groups worldwide. Controversially, she was one of 14 SI leaders of the Commission for a Sustainable World Society, which calls for \"global governance\" and says rich countries must shrink their economies to address climate change. Browner served as head of the Environmental Protection Agency under Clinton (has anyone else been noticing just how may of Clinton's goons are returning?) \n\n \n Barack Obama Appoints Socialist Carol Browner as Global Warming Czar (PART 1/2)\n \n I'm sure she'll do wonders for the economy, and liberty. emoticon_rolleyes", 
   {}, 
   341673, 
   null, 
   1232919480.0
  ], 
  [
   341758, 
   null, 
   "Jo Bennett", 
   "Bear in mind that the Socialist International is not socialist in the strict sense, given that member organisations include the Zimbabwe opposition MDC, Venezuelan opposition Democratic Action, the UK governing Labour Party, the Australian governing Labor Party, the Israeli Labour Party. This is an organisation of social marketeers, not radical socialists. There's really nothing to get worked up about.", 
   {}, 
   341682, 
   null, 
   1232959800.0
  ], 
  [
   341777, 
   null, 
   "Steeeeve", 
   "Hast thou, then, any solid evidence of their stinkiness?\n\n \n Geithner, Daschle, Duncan are the three in question.\n \n Geithner can't pay taxes so shouldn't be heading the treasury.\n \n Daschle - Nothing qualifies him to be here as far as I know. Has he done anything related to health? He was part of a lobbying firm (although he denies this) that did some health stuff another many other things.\n \n Duncan has never been a teacher and that, in my opinion, means you shouldn't be a principal let alone the sec. of education. I'm also a little hesitant about someone from Chicago appointed by Mayor Daley but from what I can tell nothing bad ever happened.", 
   {}, 
   341673, 
   null, 
   1232981820.0
  ], 
  [
   341811, 
   null, 
   "simone", 
   "The stinkiest one of all is Carol Browner. \n \n \n \n Barack Obama Appoints Socialist Carol Browner as Global Warming Czar (PART 1/2)\n \n I'm sure she'll do wonders for the economy, and liberty. emoticon_rolleyes\n\n Is that your only source for your claim?\n \n I find that source to be rather questionable.", 
   {}, 
   341682, 
   null, 
   1233005580.0
  ], 
  [
   341920, 
   null, 
   "antonia", 
   "Is that your only source for your claim?\n\n \n Which one?", 
   {}, 
   341811, 
   null, 
   1233036000.0
  ], 
  [
   341936, 
   null, 
   "snakespit", 
   "Hast thou, then, any solid evidence of their stinkiness?\n\n \n In Geithners case, how about his appolgy to the confirmation panel. I might understand Joe Blow messing up his taxes here and there, but the man who is now in change of the Treasury and the IRS? Let alone that fact that he made the same \"simple error\" 4 years running. Give me a break. Either the man clearly can't even do his own taxes, which seriously brings his ability to lead the US treasury into question, or he is a crook. In either case, bad choice. Obama say's he wants to clean up Washington and hold his administration to a higher standard...what better place to start? I would have been far more impressed by Obama if he would have called on Geithner to step back.", 
   {}, 
   341673, 
   null, 
   1233039060.0
  ], 
  [
   341988, 
   null, 
   "daewoo", 
   "In Geithners case, how about his appolgy to the confirmation panel. I might understand Joe Blow messing up his taxes here and there, but the man who is now in change of the Treasury and the IRS? Let alone that fact that he made the same \"simple error\" 4 years running. Give me a break. Either the man clearly can't even do his own taxes, which seriously brings his ability to lead the US treasury into question, or he is a crook. In either case, bad choice. Obama say's he wants to clean up Washington and hold his administration to a higher standard...what better place to start? I would have been far more impressed by Obama if he would have called on Geithner to step back.\n\n \n He is a crook. Seriously...look into Geithner. He is like Paulsons EVIL twin. \n \n I can only imagine that Obama bust have had some trouble finding anybody willing to take the job. There are a half dozen people on his economic advisory board who are both better qualified and are NOT the personification of economic evils and excesses. I am guessing none of them were willing to do it.", 
   {}, 
   341936, 
   null, 
   1233047340.0
  ], 
  [
   342002, 
   null, 
   "chester", 
   "He is a crook. Seriously...look into Geithner. He is like Paulsons EVIL twin. \n \n I can only imagine that Obama bust have had some trouble finding anybody willing to take the job. There are a half dozen people on his economic advisory board who are both better qualified and are NOT the personification of economic evils and excesses. I am guessing none of them were willing to do it.\n\n \n Let's get this straight.\n \n You are seriously comparing someone who owed a mere $34K on his taxes to the likes of Ken Lay, the Rigases, Kozlowski, and the current crop of Gordon Geckos who looted their companies and then bailed?\n \n If you are, I have some oceanfront property in Montana I will sell you cheap.\n \n Let's have a little perspective please, unless, of course, you will grasp at anything to bring our new President down.", 
   {}, 
   341988, 
   null, 
   1233074280.0
  ], 
  [
   342005, 
   null, 
   "Penfold", 
   "... Or Mr Fuld, of Lehmans infamy, who just sold his $13m Florida mansion to his wife for ten bucks....emoticon_rolleyes", 
   {}, 
   342002, 
   null, 
   1233075780.0
  ], 
  [
   342016, 
   null, 
   "daewoo", 
   "Let's get this straight.\n \n You are seriously comparing someone who owed a mere $34K on his taxes to the likes of Ken Lay, the Rigases, Kozlowski, and the current crop of Gordon Geckos who looted their companies and then bailed?\n \n If you are, I have some oceanfront property in Montana I will sell you cheap.\n \n Let's have a little perspective please, unless, of course, you will grasp at anything to bring our new President down.\n\n \n Look into Geithner. The tax thing is immaterial. I would not only compare him to the likes of those folks, I would argue that he is worse. He is the guy who has been orchestrating the bailouts for all these jackasses after they run their companies on the ground, but refusing to allow or enforce any limits on those bailouts, so they can keep right on stealing.", 
   {}, 
   342002, 
   null, 
   1233082260.0
  ], 
  [
   342023, 
   null, 
   "Steeeeve", 
   "Look into Geithner. The tax thing is immaterial. I would not only compare him to the likes of those folks, I would argue that he is worse. He is the guy who has been orchestrating the bailouts for all these jackasses after they run their companies on the ground, but refusing to allow or enforce any limits on those bailouts, so they can keep right on stealing.\nIt isn't immaterial in my opinion. It is bad image and signifies a more serious problem when you don't admit to the mistake until you are appointed. \n \n The \"cronies\" are back...but they aren't cronies when they are on \"your side\" of the political scene. Funny how people are.", 
   {}, 
   342016, 
   null, 
   1233083280.0
  ], 
  [
   342059, 
   null, 
   "snakespit", 
   "Let's get this straight.\n \n You are seriously comparing someone who owed a mere $34K on his taxes to the likes of Ken Lay, the Rigases, Kozlowski, and the current crop of Gordon Geckos who looted their companies and then bailed?\n \n If you are, I have some oceanfront property in Montana I will sell you cheap.\n \n Let's have a little perspective please, unless, of course, you will grasp at anything to bring our new President down.\n\n \n See, here is the difference. You say \"someone who owed a mere $34K on his taxes\" (which by the way is more than many Americans make in a year), and I simply say \"that guy who admitted to tax evasion\". And, as Daewoo pointed out, it's the tip of the iceberg when it comes to Geithner. I think it is a bad choice, especially when the man will head the IRS. I don't think anyone is using it to try to \"bring our new president down\", but it clearly does show a major hypocrisy from the man who says that he is going to hold the government to a higher standard and clean up Washington.", 
   {}, 
   342002, 
   null, 
   1233093540.0
  ], 
  [
   342078, 
   null, 
   "daewoo", 
   "I am afraid that we may be headed for a re-run of the Bush administration on the PR front, where Obama will have a cadre of reality detached individuals who will refuse to ever say anything about the man who is not complimentary....or allow others to without coming up with some kind of ridiculous, nonsensical justification for it. It also seems like we may be doomed to 4 years of BUSHDIDITS to justify bad behavior.\n \n Are people actually incapable of learning??", 
   {}, 
   342059, 
   null, 
   1233101580.0
  ], 
  [
   342081, 
   null, 
   "Steeeeve", 
   "Well Daewoo,\n \n at least people are loyal...I guess. I don't know if there is much honor is going down with the ship if the captain is insane. \n \n It is remarkable to hear people who hated Bush say certain policies are bad and this or that justification/reason is bad but are the same people who use the exact same justification/reason for the same policies that Obama is doing or about to do. I said this in a complicated way but you get my point.\n \n On the other side the Bush loyalties were saying things and now are saying the exact opposite. \n \n Guess what! Both are screwing us over....Ron Paul doesn't seem as crazy as he did in the primaries.", 
   {}, 
   342078, 
   null, 
   1233104520.0
  ], 
  [
   342102, 
   null, 
   "marc9000", 
   "Bear in mind that the Socialist International is not socialist in the strict sense, given that member organisations include the Zimbabwe opposition MDC, Venezuelan opposition Democratic Action, the UK governing Labour Party, the Australian governing Labor Party, the Israeli Labour Party. This is an organisation of social marketeers, not radical socialists. There's really nothing to get worked up about.\n\n \n I don't believe an organization of social marketeers is going to stop short of radical socialism. I don't think history shows us one single case where any organization that forwards an ideology, reaches a plateau and then voluntarily stops. If there's a higher level in any ideology, it will be sought.\n \n Browner was largely behind auto emissions testing programs - my area suffered through one from Clintons last year in office until it was finally declared a failure in 2005, by the Bush EPA. Millions of dollars wasted, a lot of frustration, and several lavish government garages now sit empty. It will probably be back soon. There's little that works me up more than the public use of existing products being regulated and restricted by government.", 
   {
    "unicode_changes_made": true
   }, 
   341758, 
   null, 
   1233109860.0
  ], 
  [
   342105, 
   null, 
   "marc9000", 
   "Is that your only source for your claim?\n \n I find that source to be rather questionable.\n\n \n \n It's not my only source. She was controversial, and in the news many times, when she was Bill Clinton's EPA administrator. Anywhere you look, there's no question she is a radical. \n \n Carol Browner - Wikipedia, the free encyclopedia\n \n Carol Browner, master of mission creep - Forbes.com\n \n (Forbes)\n \nPlaying mission creep is an old game in Washington. But no one has ever played the game with more skill than Carol M. Browner, Bill Clinton's choice to head the Environmental Protection Agency. \n\n \n \n This newly created position she holds doesn't require congressional approval - maybe she won't have near as much power as she did as EPA administrator. But she'll get attention, and it won't be positive attention from conservatives. As the Obama administration moves along, and the recognition of the positive things from the past Bush administration come rolling in, somewhere on that long list will be the fact that Bush gave us an 8 year break from the tyranny of Carol Browner.", 
   {
    "unicode_changes_made": true
   }, 
   341811, 
   null, 
   1233110340.0
  ], 
  [
   342198, 
   null, 
   "simone", 
   "Marc9000, your quote concerning Carol Browner: \"Ms. Browner belonged to Socialist International until 2008 per the Washington Times.\" ... for Chrissake Socialist International?\n \n What the Hades?\n \n The weird Rev Moon's Washington Times serves not as a reliable source. Nor does the questionable Nolan chart.\n \n They offer opinion, not journalism and reporting of actual facts.", 
   {}, 
   341320, 
   null, 
   1233175320.0
  ], 
  [
   342250, 
   null, 
   "Steeeeve", 
   "The EPA is an abuse of power and frankly insane. Why not put someone insane incharge of it. the EPA is borderline constitutional at best.", 
   {}, 
   342198, 
   null, 
   1233197400.0
  ], 
  [
   342252, 
   null, 
   "marc9000", 
   "Marc9000, your quote concerning Carol Browner: \"Ms. Browner belonged to Socialist International until 2008 per the Washington Times.\" ... for Chrissake Socialist International?\n \n What the Hades?\n \n The weird Rev Moon's Washington Times serves not as a reliable source. Nor does the questionable Nolan chart.\n \n They offer opinion, not journalism and reporting of actual facts.\n\n \n So it can't be true if you don't want it to be true? :)\n \n You make me throw my hands in the ayer a ayer - ayer a ayer.....", 
   {}, 
   342198, 
   null, 
   1233201840.0
  ], 
  [
   342295, 
   null, 
   "simone", 
   "What is Socialist Internationale?\n \n What are its goals?\n \n Where is its center?\n \n How can one determine its membership?", 
   {}, 
   342252, 
   null, 
   1233261060.0
  ], 
  [
   342342, 
   null, 
   "marc9000", 
   "What is Socialist Internationale?\n \n What are its goals?\n \n Where is its center? \n\n \n Socialist International - Progressive Politics For A Fairer World\n \n \nHow can one determine its membership?\n\n \n Socialist International - Progressive Politics For A Fairer World\n \n \nRicardo Lagos, former President of the Republic of Chile and a Special Envoy of the United Nations Secretary-General on Climate Change, and Göran Persson, former Prime Minister of Sweden, have been appointed Co-Chairs of the Commission, and other members are: Hilary Benn, Secretary of State for the Environment, Food and Rural Affairs, United Kingdom; Carol M. Browner, Administrator of the United States Environmental Protection Agency under President Bill Clinton; Elio di Rupo, leader of the Socialist Party of Belgium; Mohamed El Yazghi, leader of the Socialist Union of Popular Forces, USFP, and Minister of the Government of Morocco; Sigmar Gabriel, Federal Minister for the Environment, Nature Conservation and Nuclear Safety, Germany; Aleksandr Kwasniewski, former President of the Republic of Poland; Sergei Mironov, President of the Federal Council of Russia; Cristina Narbona, Minister of the Environment of Spain; Beatriz Paredes, President of the Institutional Revolutionary Party (PRI) of Mexico; Anand Sharma, Minister of State for External Affairs of India; Marina Silva, Minister of the Environment of the Federative Republic of Brazil; Martin Torrijos, President of the Republic of Panama and leader of the Democratic Revolutionary Party (PRD); and Nkosazana Dlamini Zuma, Minister of Foreign Affairs, Republic of South Africa. \n\n \n I thought it best to c/p this membership list, because her name could be scrubbed off of it at any time. Check it quickly, because as is reported by the Washington Times and others \"the group's web site was recently scrubbed to remove Browner's picture and biography,...\"", 
   {}, 
   342295, 
   null, 
   1233281220.0
  ], 
  [
   342366, 
   null, 
   "Jo Bennett", 
   "I think it's worth reiterating just how non-radical the Socialist International is. Look at the name immediately preceding Browner's on the list - Hilary Benn, arch Blairite and about as moderate as they come. Now, if it had been his Dad, Tony Benn, then you might have had something to be concerned about. I fail to see how an organisation with affiliations from the UK, Israeli and Australian Labo(u)r parties can be in any way considered radical.", 
   {}, 
   342342, 
   null, 
   1233300180.0
  ], 
  [
   342433, 
   null, 
   "marc9000", 
   "I think it's worth reiterating just how non-radical the Socialist International is. Look at the name immediately preceding Browner's on the list - Hilary Benn, arch Blairite and about as moderate as they come. Now, if it had been his Dad, Tony Benn, then you might have had something to be concerned about. I fail to see how an organisation with affiliations from the UK, Israeli and Australian Labo(u)r parties can be in any way considered radical.\n\n \n I think the best way to determine their radicalism is to look at their Declaration of Principles page rather than individual names or small affiliations from significant countries. \n \n The opening paragraph of their principles says this;\n \n \nThe idea of Socialism has caught the imagination of people across the world, promoted successful political movements, decisively improved the lives of working men and women, and contributed to shaping the 20th century. \n\n \n And, much further down;\n \n \nA critical and fundamental challenge of worldwide dimensions is the crisis of the environment. ln both the North and the South, the ecological balance is jeopardised. \n\n \n These two things, and most everything in between them on that page, represent radical one-sided U.S. (Democrat) political beliefs. \n \n One of the things stated in between them said this;\n \n \nPeace is equally a necessity within nations. Violent ways of handling conflicts destroy opportunities for development and human rights. Education for peace and disarmament must be intensified. \n\n \n The U.S. Constitution authorizes the Congress to \"define and punish Piracies and Felonies committed on the high Seas........to declare war.........to raise and support armies.......to provide and maintain a Navy.....\"\n \n The bottom line is, membership in a global political organization cannot be reconciled with the spirit of the U.S. Constitution. There's simply no room in it for worldwide decision making in U.S. affairs.", 
   {}, 
   342366, 
   null, 
   1233369660.0
  ], 
  [
   342455, 
   null, 
   "Jo Bennett", 
   "Saying that war happens too much and is harmful is a statement of fact, as is saying there are too many weapons in the world. So is that fact that socialism, through education, health and welfare systems, has improved the lives of ordinary people immeasurably. Likewise saying the environment is under threat is pretty much a given. Even if one were to accept that these are opinions, the first it common to anyone even remotely left of centre, and many on the right, and certainly to most Christian denominations. The second is simply a reflection of the history of the 20th century, where socialism took us from the \"5 giants\" (Want, Disease, Ignorance, Squalor and Idleness) to situations where, in parts of world, everyone had enough to eat, healthcare, education, sanitation and work. The last is, again accepted by government across the political spectrum, even Margaret Thatcher, who is hardly a radical socialist.", 
   {}, 
   342433, 
   null, 
   1233400440.0
  ], 
  [
   342475, 
   null, 
   "simone", 
   "Marc9000, thanks for the link.\n \n Very revealing.\n \n Here's more to the story:\n \n \nSI COMMISSION for a Sustainable World Society: First meeting to be held in London\n The Socialist International (SI), the worldwide organisation of social democratic, labour and socialist political parties, will hold the first meeting of its Commission for a Sustainable World Society at 10 Downing Street on Monday 19 November, hosted by Prime Minister Gordon Brown, Leader of the British Labour Party.....\n \n The Commission brings together leading personalities, among them serving and former heads of state and government ministers from different continents, to set out recommendations to tackle these fundamental issues.\n \n ... and Göran Persson, former Prime Minister of Sweden, have been appointed Co-Chairs of the Commission, and other members are: ... Carol M. Browner, Administrator of the United States Environmental Protection Agency under President Bill Clinton...\n\n Socialist International - Progressive Politics For A Fairer World\n \n Using your rationale as a start, I guess we can also speculate that Gordon Brown is a member as well, since the meeting was held at his digs.\n \n No where is it indicated that Carol Browner is a dues-paying member of SSI.\n \n Clever insinuations, Marc.", 
   {}, 
   342455, 
   null, 
   1233430020.0
  ], 
  [
   342509, 
   null, 
   "marc9000", 
   "Saying that war happens too much and is harmful is a statement of fact, as is saying there are too many weapons in the world. So is that fact that socialism, through education, health and welfare systems, has improved the lives of ordinary people immeasurably. Likewise saying the environment is under threat is pretty much a given. Even if one were to accept that these are opinions, the first it common to anyone even remotely left of centre, and many on the right, and certainly to most Christian denominations. \n\n \n They are opinions. The first is true only because there is evil in the world, not because governments are not socialistic enough. War happening too much and being harmful is not a new thing, it was that way when the U.S. was founded. A belief that evil will lessen or disappear if the public places its trust in a socialist government is not a belief that the U.S. founders had. In some cases, a mistrust of government by the population could actually prevent a war. \n \n \nThe second is simply a reflection of the history of the 20th century, where socialism took us from the \"5 giants\" (Want, Disease, Ignorance, Squalor and Idleness) to situations where, in parts of world, everyone had enough to eat, healthcare, education, sanitation and work. \n\n \n What parts? What did the socialism replace that originally resulted in the previous \"want, disease, ignorance, squalor and idleness\"? Did those things arise from previous freedom, or previous tyranny? Socialism is better than some things (dictatorships/communism, etc) but not better than what we have in the U.S. \n \n If, as a non-U.S. resident, you get a little tired of hearing Americans claim that the U.S. is \"the greatest country in the world\", I honestly don't blame you for that. But it's a fact that the U.S. has accomplished a lot for itself and the rest of the world, and it accomplished it with liberty, not socialism. What it has accomplished may have helped make socialism succeed somewhere else, as it replaced some form of tyranny. \n \n \nThe last is, again accepted by government across the political spectrum, even Margaret Thatcher, who is hardly a radical socialist.\n\n \n The belief that the environment is \"under threat\" is a broad generalization. Many who believe it's threatened in some way don't believe basic political changes need to happen in order to fix it. \n \n If Browner (and Obama) believe socialism is the best way for the U.S. to go, it would be nice if they would come right out and say it, and make a case for it, rather than trying to sneak it through by doing things like scrubbing some things about Browners past association with a socialist group, that apparently no other politician in the U.S. belongs to.", 
   {
    "unicode_changes_made": true
   }, 
   342455, 
   null, 
   1233454680.0
  ], 
  [
   342511, 
   null, 
   "marc9000", 
   "Marc9000, thanks for the link. \n\n \n You're welcome, but it wasn't hard to find. \n \n \nUsing your rationale as a start, I guess we can also speculate that Gordon Brown is a member as well, since the meeting was held at his digs. \n\n \n And your point is? emoticon_confused He wasn't in the members list like Carol Browner is. What does that have to do with it anyway?\n \n \nNo where is it indicated that Carol Browner is a dues-paying member of SSI. \n\n \n You didn't believe she belonged to the SSI at all, and now that I show that she did, you imply that her membership means nothing if I don't get busy and show that she pays dues? If I did THAT, how much further would you move the goalposts? Are you going to be anywhere near Tampa tomorrow - I'm afraid you might disrupt the superbowl. emoticon_frazzled\n \n \nClever insinuations, Marc.\n\n \n Nothing clever, just an honest look at the real Carol Browner. Why are socialists in U.S. politics so secretive about who they really are?", 
   {
    "unicode_changes_made": true
   }, 
   342475, 
   null, 
   1233455040.0
  ], 
  [
   342538, 
   null, 
   "Jo Bennett", 
   "They are opinions. The first is true only because there is evil in the world, not because governments are not socialistic enough. War happening too much and being harmful is not a new thing, it was that way when the U.S. was founded. A belief that evil will lessen or disappear if the public places its trust in a socialist government is not a belief that the U.S. founders had. In some cases, a mistrust of government by the population could actually prevent a war. \n \n \n \n What parts? What did the socialism replace that originally resulted in the previous \"want, disease, ignorance, squalor and idleness\"? Did those things arise from previous freedom, or previous tyranny? Socialism is better than some things (dictatorships/communism, etc) but not better than what we have in the U.S. \n \n If, as a non-U.S. resident, you get a little tired of hearing Americans claim that the U.S. is \"the greatest country in the world\", I honestly don't blame you for that. But it's a fact that the U.S. has accomplished a lot for itself and the rest of the world, and it accomplished it with liberty, not socialism. What it has accomplished may have helped make socialism succeed somewhere else, as it replaced some form of tyranny. \n \n \n \n The belief that the environment is \"under threat\" is a broad generalization. Many who believe it's threatened in some way don't believe basic political changes need to happen in order to fix it. \n \n If Browner (and Obama) believe socialism is the best way for the U.S. to go, it would be nice if they would come right out and say it, and make a case for it, rather than trying to sneak it through by doing things like scrubbing some things about Browners past association with a socialist group, that apparently no other politician in the U.S. belongs to.\n\n \n You are committing the fallacy of begging the question. I agree that peace is not an aim solely of socialists, that was entirely my point, you were the one claiming the policy was a sign of radical socialism. My reference to the 5 giants was from the Beveridge report which heralded the creation of the NHS and the welfare state in the UK in the 1940s. The 5 giants were a result of free market capitalism, the first attempts to curb this were implemented by Churchill in the early 1900s. Whether you consider free market capitalism to be freedom or tyranny is rather a matter of opinion. Neither I, nor the Socialist International, are referring to eastern bloc dictatorships whe nwe talk about socialism.", 
   {
    "unicode_changes_made": true
   }, 
   342509, 
   null, 
   1233487860.0
  ], 
  [
   342540, 
   null, 
   "Symbiote", 
   "Neither I, nor the Socialist International, are referring to eastern bloc dictatorships whe nwe talk about socialism.\n\n \n Undoubtedly, neither you, nor the Socialist International, will be talking about South American dictatorships when you talk about socialism once they collapse either.", 
   {}, 
   342538, 
   null, 
   1233492840.0
  ], 
  [
   342546, 
   null, 
   "Jo Bennett", 
   "Undoubtedly, neither you, nor the Socialist International, will be talking about South American dictatorships when you talk about socialism once they collapse either.\n\n \n The only south american dictatorships I'm aware of have been right wing (Pinochet, Galtieri etc.). The bolivarian socialist governments in south america are all democratic. In any case, they are far more radical than the socialist international.", 
   {}, 
   342540, 
   null, 
   1233499800.0
  ], 
  [
   342665, 
   null, 
   "snakespit", 
   "Steeeve, your expert reasoning on why Geithner, Daschle and Clinton are stinky.\n\n \n \nHast thou, then, any solid evidence of their stinkiness?\n\n \n Wow, Geithner and now Daschle. Tax evasion stinks to me. And as far as Clinton, she gives off a bad smell that is all her own.", 
   {}, 
   341468, 
   null, 
   1233603480.0
  ], 
  [
   342672, 
   null, 
   "simone", 
   "SnakeSpit, is your misogyny leaping out of your chest?\n \n Um, perchance, you find the scent of women offensive?", 
   {}, 
   342665, 
   null, 
   1233609120.0
  ], 
  [
   342676, 
   null, 
   "Steeeeve", 
   "Wow, Geithner and now Daschle. Tax evasion stinks to me. And as far as Clinton, she gives off a bad smell that is all her own.\n\n \n It is almost funny. We get Bush who puts a bunch of XXXXXX in cabinet positions (few exceptions) and all the democrats are mad and the republicans say it is no big deal. We then get Obama who puts a bunch of XXXXXX in cabinet positions (few exceptions) and all the republicans are mad and the democrats says it is no big deal. I mean check out todays news: http://bloomberg.com/apps/news?pid=20601087&sid=ahZUCjwltDRk&refer=home Apparently Obama wants to tap the expert opinions of those running Citi Bank. We all know Citi bank has done such a great job of running their own business, why not get their ideas on the economy. Maybe we can take Citi's policy of moving the bad stuff off the books to make the company look better and apply that to the US.\n \n The American public is left with a bunch of lunacy. \n \n I actually think Clinton has turned out to be the best choice...so far.", 
   {}, 
   342665, 
   null, 
   1233610800.0
  ], 
  [
   342712, 
   null, 
   "snakespit", 
   "SnakeSpit, is your misogyny leaping out of your chest?\n \n Um, perchance, you find the scent of women offensive?\n\n \n Not at all, I love Al Pacino movies!!! Grow up simone. \n \n Does the fact that I think Obama was the wrong choice for president make me a racist? \n \n Does the fact that I thought McCain would have been a horrible president make me an ageist?\n \n I would urge you to take caution in your accusations. In this case the only leaping that took place was your leaping to an assinine conclusion. How very mature of you. emoticon_rolleyes", 
   {}, 
   342672, 
   null, 
   1233624720.0
  ], 
  [
   342726, 
   null, 
   "Symbiote", 
   "The only south american dictatorships I'm aware of have been right wing (Pinochet, Galtieri etc.).\n\n \n I have cuba in mind for one, is it a socialist utopia, or has it progressed to the status of \"never was socialist\", I have trouble keeping track.", 
   {}, 
   342546, 
   null, 
   1233634620.0
  ], 
  [
   342746, 
   null, 
   "Jo Bennett", 
   "I have cuba in mind for one, is it a socialist utopia, or has it progressed to the status of \"never was socialist\", I have trouble keeping track.\n\n \n I'd have said that wasn't actually in South America, given that its latitude places it on a level with Mexico, and it's actually in the Carribean. As far as categorising it, Deformed Workers' State would seem pretty close. There are some pluses to the Cuban regime in comparison with, say, Haiti, the Dominican Republic, and other comparable states, but it's not truly socialist because it is undemocratic. As Trotsky said \"Socialism needs democracy like the human body needs oxygen\".", 
   {}, 
   342726, 
   null, 
   1233645900.0
  ], 
  [
   342918, 
   null, 
   "Matthew", 
   "Personally, I think it's great that barely two weeks into his administration, Obama has publicly taken responsibility for more mistakes than Bush did for his first 7 years and 51 weeks. I think it's an indication that the tone is indeed changing -- and also that the new president might actually learn from his mistakes rather than ignore and perpetuate them.", 
   {}, 
   342746, 
   null, 
   1233844860.0
  ], 
  [
   342921, 
   null, 
   "Steeeeve", 
   "Personally, I think it's great that barely two weeks into his administration, Obama has publicly taken responsibility for more mistakes than Bush did for his first 7 years and 51 weeks. I think it's an indication that the tone is indeed changing -- and also that the new president might actually learn from his mistakes rather than ignore and perpetuate them.\n\n \n Actually it indicates to me that we might get into a position where Pelosi and Reid are walking all over Obama. We don't need a push over.", 
   {}, 
   342918, 
   null, 
   1233852240.0
  ], 
  [
   342930, 
   null, 
   "Matthew", 
   "Actually it indicates to me that we might get into a position where Pelosi and Reid are walking all over Obama. We don't need a push over.\n\n \n And we don't have one. Admitting mistakes is not a sign of weakness. Quite the opposite, in fact.", 
   {}, 
   342921, 
   null, 
   1233859260.0
  ], 
  [
   342934, 
   null, 
   "Steeeeve", 
   "And we don't have one. Admitting mistakes is not a sign of weakness. Quite the opposite, in fact.\n\n \n Looking beyond the admission of a mistake is key. Looking at some of the things coming out makes me worried about Pelosi trying to take over leadership from Obama....just look at the stimulus package. \n \n I hope I'm wrong and we will just wait and see how it plays out.", 
   {}, 
   342930, 
   null, 
   1233865020.0
  ], 
  [
   342941, 
   null, 
   "Matthew", 
   "Looking beyond the admission of a mistake is key. Looking at some of the things coming out makes me worried about Pelosi trying to take over leadership from Obama....just look at the stimulus package. \n \n I hope I'm wrong and we will just wait and see how it plays out.\n\n \n Fair enough. A bit early to get too pessimistic, but fair enough.\n \n On the other hand, we might also want to remember that the stimulus package is, ultimately, a piece of legislation. The founders actually conceived a much weaker executive in principle than those we've gotten in practice ever since FDR. So up to a point, I'm not even sure it would be entirely bad if Congress reasserted a bit more of its constitutional authority. The President is not a Prime Minister.", 
   {}, 
   342934, 
   null, 
   1233869820.0
  ], 
  [
   342945, 
   null, 
   "Steeeeve", 
   "Fair enough. A bit early to get too pessimistic, but fair enough.\n \n On the other hand, we might also want to remember that the stimulus package is, ultimately, a piece of legislation. The founders actually conceived a much weaker executive in principle than those we've gotten in practice ever since FDR. So up to a point, I'm not even sure it would be entirely bad if Congress reasserted a bit more of its constitutional authority. The President is not a Prime Minister.\n\n \n True, but if they wanted to do their constitutional authority they wouldn't even have a stimulus package and would probably only need to be in session 3 months out of the year. \n \n So much for that!", 
   {}, 
   342941, 
   null, 
   1233872280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is Barack Setting himself up for failure??", 
  "url": "http://www.4forums.com/political/politics-debates/12237-barack-setting-himself-up-failure.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 12237, 
  "discussion_files": [
   [
    "11858.html", 
    "http://www.4forums.com/political/politics-debates/12237-barack-setting-himself-up-failure-print.html"
   ], 
   [
    "11859.html", 
    "http://www.4forums.com/political/politics-debates/12237-barack-setting-himself-up-failure-5-print.html"
   ], 
   [
    "11860.html", 
    "http://www.4forums.com/political/politics-debates/12237-barack-setting-himself-up-failure-4-print.html"
   ], 
   [
    "11861.html", 
    "http://www.4forums.com/political/politics-debates/12237-barack-setting-himself-up-failure-3-print.html"
   ], 
   [
    "11862.html", 
    "http://www.4forums.com/political/politics-debates/12237-barack-setting-himself-up-failure-2-print.html"
   ]
  ], 
  "identifier": 12237
 }
]