[
 [
  [
   340985, 
   null, 
   "simone", 
   "I can finally exhale.\n \n God Bless America! \n \n We are safe again.", 
   {
    "post_info": {
     "post_title": "Now That Barack Hussein Obama Is President"
    }
   }, 
   null, 
   null, 
   1232479980.0
  ], 
  [
   340988, 
   null, 
   "Charliegone", 
   "Oh brother....emoticon_rolleyes\n \n That is left to be seen Simone.", 
   {}, 
   340985, 
   null, 
   1232480520.0
  ], 
  [
   341036, 
   null, 
   "trebor", 
   "I can finally exhale.\n \n God Bless America! \n \n We are safe again.\n\n \n I don't know about 'safe' quite yet. I think Obama has one ability that Bush did not.. and that is to look at ability, not a political litmus test.", 
   {}, 
   340985, 
   null, 
   1232500380.0
  ], 
  [
   341120, 
   null, 
   "snakespit", 
   "I can finally exhale.\n \n God Bless America! \n \n We are safe again.\n\n \n How? How are you \"safer\" today than you were on Monday? Tell me 5 things that Obama has done during his presidency that have made you safe.", 
   {}, 
   340985, 
   null, 
   1232560260.0
  ], 
  [
   341130, 
   null, 
   "Penfold", 
   "How? How are you \"safer\" today than you were on Monday? Tell me 5 things that Obama has done during his presidency that have made you safe.\n\n \n Not been Bush, Not been Bush, Not been Bush, Not been Bush, and finally, Not been George W. Bush. ;)", 
   {}, 
   341120, 
   null, 
   1232563020.0
  ], 
  [
   341141, 
   null, 
   "simone", 
   "How? How are you \"safer\" today than you were on Monday? Tell me 5 things that Obama has done during his presidency that have made you safe.\n\n Barack Hussein Obama has held his hands out to the world, to all our allies out there, the allies who have been pushed away by Bush, and we, America, have more support from the rest of the world, which makes me feel enormously safer.\n \n America has been restored to its role as the beacon of freedom and democracy and integrity, words which truly have meaning now because Barack Hussein Obama is now the President of the United States.\n \n President Barack Hussein Obama. The man who speaks English with eloquence and elegance, the man who can speak in complete sentences, the man who understands and reveres the United States Constitution, the man who is held in respect, if not love, by the rest of the world.\n \n America now has the greatest power of all, the power of example which serves to rule, not the example of power used to enforce rule.", 
   {}, 
   341120, 
   null, 
   1232565720.0
  ], 
  [
   341151, 
   null, 
   "Steeeeve", 
   "Barack Hussein Obama has held his hands out to the world, \nAnd Chavez said he stinks like Bush. That is change we can not see emoticon_xbouncer\n \n So far the difference between Bush and Obama is $100 billion - Bush $700 billion bailout, Obama $800 billion. Ha :)", 
   {}, 
   341141, 
   null, 
   1232566800.0
  ], 
  [
   341177, 
   null, 
   "Zardoz", 
   "Barack Hussein Obama has held his hands out to the world, to all our allies out there, the allies who have been pushed away by Bush, and we, America, have more support from the rest of the world, which makes me feel enormously safer.\n \n America has been restored to its role as the beacon of freedom and democracy and integrity, words which truly have meaning now because Barack Hussein Obama is now the President of the United States.\n \n President Barack Hussein Obama. The man who speaks English with eloquence and elegance, the man who can speak in complete sentences, the man who understands and reveres the United States Constitution, the man who is held in respect, if not love, by the rest of the world.\n \n America now has the greatest power of all, the power of example which serves to rule, not the example of power used to enforce rule.\n\n \n Calm down Simone before you have an Obamargasm.", 
   {}, 
   341141, 
   null, 
   1232579460.0
  ], 
  [
   341231, 
   null, 
   "Ohioprof", 
   "Hi, all. I am so very happy now that Bush is gone and we have a President whom I support! I love President Obama. He hasn't even done very much in office yet, and I love him! My daughter is thrilled too. She says, \"He has brown skin like me! His daughters have brown skin like me!\" \n \n The day we have waited for for 8 long years finally arrived this week, and it was a glorious day on Tuesday, wasn't it? \n \n I loved Obama's inaugural address. I think he struck the proper tone for the times we are in. Serious and dignified. Calling people to take responsibility and to make the world better. My daughter and I have been discussing the kinds of service we can do together. \n \n If I had to characterize President Obama at the beginning of his Presidency, I would call him a pragmatic progressive. Bush, in contrast, was neither pragmatic nor progressive. He wasn't much of a compassionate conservative either. His compassion and his conservatism were both stymied by the ideological rigidity of his administration. There were a few exceptions, notably his efforts to fight AIDS in Africa, which was good. \n \n When Bush took office back in 2001, I did not celebrate. I did not feel included; I did not feel that Bush was my President. I felt he had stolen the office. In the years that followed, I came to feel ashamed of our nation, as Bush trampled on the constitution and on civil liberties, invaded another country and started a war, alienated nearly every ally we had, ran up a huge budget deficit, and pursued economic policies that lined the pockets of the rich at the expense of the poor and led us into our current depression. It was a terrible 8 years. Now it's over, at last! \n \n With President Obama, I do feel included. I do feel that this my President, the President of all of us. I am proud of our nation again. \n \n It's a glorious time to be alive!", 
   {}, 
   341177, 
   null, 
   1232629620.0
  ], 
  [
   341244, 
   null, 
   "chester", 
   "Ohio Prof,\n \n Welcome back after your hiatus.\n \n Good analysis.", 
   {}, 
   341231, 
   null, 
   1232636220.0
  ], 
  [
   341246, 
   null, 
   "smiley", 
   "Hi, all. I am so very happy now that Bush is gone and we have a President whom I support! I love President Obama. He hasn't even done very much in office yet, and I love him! My daughter is thrilled too. She says, \"He has brown skin like me! His daughters have brown skin like me!\" \n \n The day we have waited for for 8 long years finally arrived this week, and it was a glorious day on Tuesday, wasn't it? \n \n I loved Obama's inaugural address. I think he struck the proper tone for the times we are in. Serious and dignified. Calling people to take responsibility and to make the world better. My daughter and I have been discussing the kinds of service we can do together. \n \n If I had to characterize President Obama at the beginning of his Presidency, I would call him a pragmatic progressive. Bush, in contrast, was neither pragmatic nor progressive. He wasn't much of a compassionate conservative either. His compassion and his conservatism were both stymied by the ideological rigidity of his administration. There were a few exceptions, notably his efforts to fight AIDS in Africa, which was good. \n \n When Bush took office back in 2001, I did not celebrate. I did not feel included; I did not feel that Bush was my President. I felt he had stolen the office. In the years that followed, I came to feel ashamed of our nation, as Bush trampled on the constitution and on civil liberties, invaded another country and started a war, alienated nearly every ally we had, ran up a huge budget deficit, and pursued economic policies that lined the pockets of the rich at the expense of the poor and led us into our current depression. It was a terrible 8 years. Now it's over, at last! \n \n With President Obama, I do feel included. I do feel that this my President, the President of all of us. I am proud of our nation again. \n \n It's a glorious time to be alive!\n\n Welcome back OP.\n \n A couple of points.\n \n 1 - Obama's address contained similar phrases to those used by Bush in most of his speaches, (we will not back down; we are a great nation; we will pass our freedom on to following generations, blah blah blah) and we all know how that turned out. So, I wouldn't go as far as to say I loved the address, though I have a little more hope of some truth behind his words than I ever did with Bush.\n \n 2 - I don't get this, \"I love the President,\" stuff. Americans get very emotional when it comes to their president. The great celebrations when he is inaugurated (in other nations, only the campaign workers seem to celebrate, everyone else just gets with their life). He is just a leader, he will lead the nation for a few years and then move on, and some other wannabe will take his place. If he is assassinated people will be bawling in the streets. I realise that given the last 8 years, emotions should be a little higher than normal, but I just don't get the idolisation that goes on between America and its president.\n \n Anyway, hope you're right. We will just have to wait and see. He has a very big hill to climb.\n \n Smiley", 
   {}, 
   341231, 
   null, 
   1232638980.0
  ], 
  [
   341266, 
   null, 
   "Charliegone", 
   "Sorry, but call me a pessimist if you will, I'm not celebrating or anything until I see some results. As a leader he has to work for the people and I truly hope he keeps his promises. I have my doubts he will though, because it seems to me he owes a lot of other people favors.", 
   {}, 
   340985, 
   null, 
   1232649360.0
  ], 
  [
   341274, 
   null, 
   "Steeeeve", 
   "Welcome back OP.\n \n A couple of points.\n \n 1 - Obama's address contained similar phrases to those used by Bush in most of his speaches, (we will not back down; we are a great nation; we will pass our freedom on to following generations, blah blah blah) and we all know how that turned out. So, I wouldn't go as far as to say I loved the address, though I have a little more hope of some truth behind his words than I ever did with Bush.\n \n 2 - I don't get this, \"I love the President,\" stuff. Americans get very emotional when it comes to their president. The great celebrations when he is inaugurated (in other nations, only the campaign workers seem to celebrate, everyone else just gets with their life). He is just a leader, he will lead the nation for a few years and then move on, and some other wannabe will take his place. If he is assassinated people will be bawling in the streets. I realise that given the last 8 years, emotions should be a little higher than normal, but I just don't get the idolisation that goes on between America and its president.\n \n Anyway, hope you're right. We will just have to wait and see. He has a very big hill to climb.\n \n Smiley\n\n I have pretty similar feelings as you Smiley. I will say it is scary that people like Ohioprof seem to think Obama is the \"messiah\". \n \n People seem to think so much has changed and we are all better now but really nothing has changed and house prices are still going down 18% a year. All we know about Obama is that he is planning a stimulus package similar to Bush's that will hurt our country in the long term. He has also managed to appoint mostly all Washington insiders after he said he wouldn't. The others seem to be Chicago insiders which is just as bad.\n \n So people like Ohioprof are happy as nothing but skin color has changed. This is shameful and I refuse to let people treat me different because of my skin color.", 
   {}, 
   341246, 
   null, 
   1232654460.0
  ], 
  [
   341280, 
   null, 
   "chester", 
   "I have pretty similar feelings as you Smiley. I will say it is scary that people like Ohioprof seem to think Obama is the \"messiah\".\n\n \n Would you please link to the post of OP where those wordfs were used. \n \n \nPeople seem to think so much has changed and we are all better now but really nothing has changed and house prices are still going down 18% a year. All we know about Obama is that he is planning a stimulus package similar to Bush's that will hurt our country in the long term. He has also managed to appoint mostly all Washington insiders after he said he wouldn't. The others seem to be Chicago insiders which is just as bad.\n\n \n Please provide us with a list of those whom YOU would have appointed to Cabinet posts in the new Administration.\n \n \nSo people like Ohioprof are happy as nothing but skin color has changed. This is shameful and I refuse to let people treat me different because of my skin color.\n\n \n If you are white, I suspect it has never been an issue; if not, you know this statement is absurd on its face.", 
   {}, 
   341274, 
   null, 
   1232655120.0
  ], 
  [
   341293, 
   null, 
   "simone", 
   "Yeah, Steeeeve, divvy up a little proof for your claims.", 
   {}, 
   341280, 
   null, 
   1232656440.0
  ], 
  [
   341299, 
   null, 
   "Ohioprof", 
   "I have pretty similar feelings as you Smiley. I will say it is scary that people like Ohioprof seem to think Obama is the \"messiah\". \n \n People seem to think so much has changed and we are all better now but really nothing has changed and house prices are still going down 18% a year. All we know about Obama is that he is planning a stimulus package similar to Bush's that will hurt our country in the long term. He has also managed to appoint mostly all Washington insiders after he said he wouldn't. The others seem to be Chicago insiders which is just as bad.\n \n So people like Ohioprof are happy as nothing but skin color has changed. This is shameful and I refuse to let people treat me different because of my skin color.\n\n \n I have never called President Obama the \"messiah.\" We don't need a \"messiah.\" We need someone who will change the direction of our national government, someone who will lead the country in positive ways. We need someone who is better than George W. Bush and the Republicans who served us so poorly and did so much damage to our nation and to the world. \n \n It's not accurate to say that \"nothing but skin color has changed.\" I think the election of President Obama is a huge and significant change. I see few similarities between President Obama and George W. Bush and his cronies. I am filled with hope and with happiness. At last, at last, we are rid of the Bush regime! We have a real leader in the Presidency. I feel joyful. \n \n I hope you have been well, Steeeve and others.", 
   {}, 
   341274, 
   null, 
   1232661960.0
  ], 
  [
   341315, 
   null, 
   "trebor", 
   "I have never called President Obama the \"messiah.\" We don't need a \"messiah.\" We need someone who will change the direction of our national government, someone who will lead the country in positive ways. We need someone who is better than George W. Bush and the Republicans who served us so poorly and did so much damage to our nation and to the world. \n \n It's not accurate to say that \"nothing but skin color has changed.\" I think the election of President Obama is a huge and significant change. I see few similarities between President Obama and George W. Bush and his cronies. I am filled with hope and with happiness. At last, at last, we are rid of the Bush regime! We have a real leader in the Presidency. I feel joyful. \n \n I hope you have been well, Steeeve and others.\n\n \n Well, he doesn't mind stepping on toes, by looking at following through on some of his promises.. .such as tightening regulations of lobbyists, and looking to close Gitmo.\n \n Of course, we are going to have the red neck mouth breathing , knuckle dragging dittoheads muttering and hoping for failure.. but hey, let them.", 
   {}, 
   341299, 
   null, 
   1232666760.0
  ], 
  [
   341330, 
   null, 
   "Zardoz", 
   "Some people need to learn to read and understand english.\n \n \"seem to think\" was the modifier used above...and is perfeclty admissable and descriptive to the behavior of most Obama supporters.\n The only other place this type of behaviour that many dems are displaying can be seen is in an evangelical church.\n \n I also think many people have a short attention span.\n Bush DID state just as much rhetorical garbage in the past and had a lot of support too from his side in the beginning.\n Obama comes along and repeats it and now, it's magically better?\n \n If race is NOT a factor why are SO MANY PEOPLE speaking about it?\n Seriously, all I've heard recently are comments on Obama's rhetoric and race.\n Few people seem to be focusing on policy and actions.\n And, granted he hasn't had a lot of time in office to do much yet so people should give it a little time before singing his praises so much.\n I'd certainly hate to see him utterly fail. I'd dread to hear the responses of his supporters.\n \n I think it'd be more constructive to hear what you'd like to see him do and/or point out the steps he's taken to do that.\n \n Gitmo is to be closed, in a year. Still NO idea what to do with the detainees.\n Iraq withdrawal...16 months and already action there was winding down under Bush. Will this be a good thing in the end...only time will tell.\n Yet, Afghanistan is to get a surge. You know the place. It's where soldiers are dying...mama's little babies! Still war persists. .\n I wonder what will happen with Iran and Pakistan. The Israeli/Palestinian dispute? North Korea? A resurgent Russia and with other nations who rightly have self intererst at the top of their lists.\n I know many world leaders went to the Machavellian school of diplomacy and not the Cumbyah School of Hugging...it doesn't matter how nice America is if they believe it's in their interests to see America wane. \n After 9/11 we had a lot of sympathy...that amounted to nothing once the going got tough and it was in the best interersts of other nations to oppose the US. \n \n I'd post a quote from Pres. Comancho of the movie Idiocracy on presidential problem solving...but the admin. would just delete it again.", 
   {}, 
   341315, 
   null, 
   1232672460.0
  ], 
  [
   341445, 
   null, 
   "Steeeeve", 
   "I have never called President Obama the \"messiah.\" We don't need a \"messiah.\" We need someone who will change the direction of our national government, someone who will lead the country in positive ways. We need someone who is better than George W. Bush and the Republicans who served us so poorly and did so much damage to our nation and to the world. \nWell you are acting like he is a messiah. Obama also doesn't seem to want to change any meaningful direction. It doesn't seem like any country likes us any better and nor will they(no surprise), he is continuing the terrible spending policies we had over the last 8 years, he is continuing the normal DC politics. \n \n The only things he has changed are small policies that appeal to his voters and just make the other half of the country mad...yippy.\n \n \nIt's not accurate to say that \"nothing but skin color has changed.\" I think the election of President Obama is a huge and significant change. I see few similarities between President Obama and George W. Bush and his cronies. I am filled with hope and with happiness. At last, at last, we are rid of the Bush regime! We have a real leader in the Presidency. I feel joyful. \nI feel like you are in for a big surprise if you think there is a significant change...at least one for any good. We will probably go down a more socialist path restricting freedom. Bush has freedom restricting policies as well but related them to defense. So basically all that will change is the excuse. One was terrorism the other will probably be something like equality.\n \n Spending policies don't appear to be changing. This is a huge issue.\n \n the whole \"crony\" thing is still around...just different names. \n \n All the hope and happiness is blinding people just like it did with Bush supporters. \n \n \nI hope you have been well, Steeeve and others.\nI've been well, thanks for asking.", 
   {}, 
   341299, 
   null, 
   1232744160.0
  ], 
  [
   341446, 
   null, 
   "Steeeeve", 
   "Yeah, Steeeeve, divvy up a little proof for your claims.\nWhich claims?", 
   {}, 
   341293, 
   null, 
   1232744340.0
  ], 
  [
   341447, 
   null, 
   "Jo Bennett", 
   " It doesn't seem like any country likes us any better and nor will they(no surprise),\n\n \n I think you're wrong about that. The closure of Guantanamo Bay, the closure of secret CIA prisons, the ban on torture, a willingness to negotiate rather than just kill people; all these suggest to those of us outside the US that finally you have someone who is at the very least a decent human being in charge. The US may once again be welcome in the community of civilised nations. Just as soon as you deal with the death penalty.", 
   {}, 
   341445, 
   null, 
   1232744700.0
  ], 
  [
   341463, 
   null, 
   "Ohioprof", 
   "Well you are acting like he is a messiah. Obama also doesn't seem to want to change any meaningful direction. It doesn't seem like any country likes us any better and nor will they(no surprise), he is continuing the terrible spending policies we had over the last 8 years, he is continuing the normal DC politics. \n \n The only things he has changed are small policies that appeal to his voters and just make the other half of the country mad...yippy.\n \n I feel like you are in for a big surprise if you think there is a significant change...at least one for any good. We will probably go down a more socialist path restricting freedom. Bush has freedom restricting policies as well but related them to defense. So basically all that will change is the excuse. One was terrorism the other will probably be something like equality.\n \n Spending policies don't appear to be changing. This is a huge issue.\n \n the whole \"crony\" thing is still around...just different names. \n \n All the hope and happiness is blinding people just like it did with Bush supporters. \n \n I've been well, thanks for asking.\n\n \n I support government spending as a way to pull the nation of of a depression. I do not regard such spending as \"restricting freedom.\" I do not believe in the \"free market\" as the solution to economic problems. I reject laissez-faire economics, and I support Keynesian solutions. While I think we should try to avoid running up a deficit in good times, I think it's necessary when the economy crashes. I think it was mostly laissez-faire economic policies that led to our current economic predicament in the first place, just like similar policies did in the 1920s. \n \n It's clear that you and I, Steeeve, disagree on economic principles and economic policies. I think President Obama has proposed the right kinds of solutions to our current crisis. As to whether his and our collective efforts will succeed or not, we'll have to wait and see. \n \n Again, I do not regard Obama as a \"messiah,\" nor do I think we need a \"messiah.\" I think we need a smart leader who will help turn us in a better direction, with the support of most of the people. I think Barack Obama will be that leader, which is why I voted for him. I think he has made mostly excellent choices for his cabinet. \n \n As for Bush, yes his supporters were enthusiastic when he took office, and he appears to have disappointed them. President Obama could disappoint those of us who support him, but we don't know this yet. We should not start out assuming that President Obama will fail or will disappoint us just because Bush turned out to be a poor President.", 
   {}, 
   341445, 
   null, 
   1232753220.0
  ], 
  [
   341523, 
   null, 
   "simone", 
   "Well you are acting like he is a messiah. Obama also doesn't seem to want to change any meaningful direction. It doesn't seem like any country likes us any better and nor will they(no surprise), he is continuing the terrible spending policies we had over the last 8 years, he is continuing the normal DC politics.\n\n I will grant that a number of African-American folk are deep in the throes of euphoria because they still can't believe that an African-American actually got elected and confirmed as President of the United States.\n \n They'll get over it very shortly and roll up their sleeves to help clean up the Bush mess.\n \n Oh, and Obama isn't planning to flush U.S. money down into the toilet of war. Major spending change. Can you prove other wise?\n \nThe only things he has changed are small policies that appeal to his voters and just make the other half of the country mad...yippy.\n\n Small policies? Show me your small policies.\n \nI feel like you are in for a big surprise if you think there is a significant change...at least one for any good. We will probably go down a more socialist path restricting freedom. Bush has freedom restricting policies as well but related them to defense. So basically all that will change is the excuse. One was terrorism the other will probably be something like equality.\n\n Show me that President Obama is dumping the issue of terrorism in favor of equality. Like, what kind of equality and specifically how?\n \nSpending policies don't appear to be changing. This is a huge issue.\n\n Got some specifics on this? President Obama has warned us that we must go deeper into debt temporarily in order to get us out of the Bush economic and financial crisis. Everyone is aware of that.\n \nthe whole \"crony\" thing is still around...just different names. \n \n Crony? Specifically what cronies?\n \n And, cronies for what purpose?\n \n \nAll the hope and happiness is blinding people just like it did with Bush supporters. \n \n I've been well, thanks for asking.\n", 
   {}, 
   341445, 
   null, 
   1232828820.0
  ], 
  [
   341573, 
   null, 
   "Steeeeve", 
   "I think you're wrong about that. The closure of Guantanamo Bay,\n It isn't closed yet...we are \"studying it\"\n \nthe ban on torture\nWe are also studying what the word torture means.\n \nwillingness to negotiate rather than just kill people\nObama hasn't done any of this yet.\n \nall these suggest to those of us outside the US that finally you have someone who is at the very least a decent human being in charge.\nWell we are 0 for 1 already with Chavez. Hating the US has been popular long before Bush....people have such short memories of this.", 
   {}, 
   341447, 
   null, 
   1232842320.0
  ], 
  [
   341578, 
   null, 
   "Jo Bennett", 
   "That's because the US has violated international law and the peace and security of the world long before Bush was elected (certainly since at least the 60s, if not before). The hope is that Obama will change that.", 
   {}, 
   341573, 
   null, 
   1232843220.0
  ], 
  [
   341582, 
   null, 
   "Steeeeve", 
   "Oh, and Obama isn't planning to flush U.S. money down into the toilet of war. Major spending change. Can you prove other wise?\n You have a great point here actually. I've always said that if you are going to pile on debt that will destroy our country you might as well make us have better roads and infrastructure. Obama plans on doing this which is an upgrade from the policy of blowing up a road in a foreign country and rebuilding it. \n \n Something to show for our inflation we will get in a few years (2 years from the last estimate I saw...at 8-10%)\n \n \n \n\n Small policies? Show me your small policies.\nI refer to the executive orders that always change when a democrat replaces a republican or visa versa. They don't mean much as they pretty much are paying off the debt of the people who voted for him.\n \n \nShow me that President Obama is dumping the issue of terrorism in favor of equality. Like, what kind of equality and specifically how?\nIt didn't say it would be equality but the excuse is irrelevant. Remember when Bush was going around saying we have to do the Patriot Act or the terrorists will burn your house down? Well Obama will do the same thing in restricting our freedom but have a different excuse. He might do the fairness doctrine and claim local interests or authorize bank takeovers to save the poor and uneducated from having bad loans. The possibilities are endless. \n \n \nGot some specifics on this? President Obama has warned us that we must go deeper into debt temporarily in order to get us out of the Bush economic and financial crisis. Everyone is aware of that.\nI just posted about excuses above and this is a perfect example of them! Bush economy and financial crisis? This is idiotic as it wasn't anything Bush did. In any event the problem is a credit problem..ie too much debt. So Obama is telling you that in order to fix a problem of debt he is going to go further into debt. This is like paying off a credit card with another credit card. And you don't go into debt temporarily with 800 billion dollars...although it really might be 2 trillion for FY09. Do you realize for FY08 we only took in 2.6 trillion? We spent 3.6 trillion. So this isn't a temporary debt...it is printing money so fast the printing presses are running out of ink..literally...and we are borrowing the rest. \n \n Beyond the suicide of the dollar this will cause, what makes you think it will even work? Government bailouts haven't worked in the history of government...anywhere! The first two in the US didn't work, the ones in Japan in the 90s didn't work, the ones during the \"great depression\" didn't work. The excuse is always \"we didn't do enough fast enough\" but at some point you wonder if maybe the idea just stinks. It is like the excuse for why tricky down economics didn't work \"this\" time...always something.", 
   {}, 
   341523, 
   null, 
   1232843460.0
  ], 
  [
   341641, 
   null, 
   "Ohioprof", 
   "Government spending most certainly DID pull the U.S. economy out of the Great Depression of the 1930s. The Keynesian spending solution was shown to succeed with the massive government spending on World War II. The previous spending during the second New Deal helped the economy, but it was not enough to pull the economy completely out of the depression. When FDR unwisely decided to try to balance the budget during the depression and he cut spending, this plunged the economy down again, in the \"Roosevelt recession\" of 1937. \n \n Government spending does work to generate demand in times of recession and depression, and generating demand serves to restore the economy. The alternate solution, more acceptable to conservatives, is to cut taxes, which is a strategy that in theory would do the same thing: generate consumer demand. The problem is that cutting taxes usually won't necessarily generate consumer demand, as consumers during a recession or depression are inclined to spend less even with tax cuts, which keeps the economy depressed. Consumers do not necessarily do that which will help the economy as a whole. Government spending can generate a huge demand while producing socially beneficial projects, like road repairs and other infrastructure improvements, as you have pointed out. \n \n Yes, there are costs to government spending and to running a budget deficit, which is why Keynes wrote that deficit spending should not be practiced during times when the economy is strong. Then, he said, a nation should keep a surplus. Deficit spending, he wrote, is to be used when the economy is headed down, to soften the down part of the business cycle. Under President Bush, because of his war spending, we generated a huge deficit when the economy was strong, which now puts us in a position to generate an enormous deficit when the economy is down.\n \n President Obama proposes both to stimulate the economy with government spending and to cut taxes. This will of course produce an enormous budget deficit. Both spending and tax cuts are aimed at pumping up consumer demand, in order to stimulate business and pull the economy out of the recession/depression. Let's hope it works. It did before, and we can only hope it works again, or we will all suffer greatly.", 
   {}, 
   341582, 
   null, 
   1232891580.0
  ], 
  [
   341658, 
   null, 
   "Steeeeve", 
   "Government spending most certainly DID pull the U.S. economy out of the Great Depression of the 1930s. The Keynesian spending solution was shown to succeed with the massive government spending on World War II. The previous spending during the second New Deal helped the economy, but it was not enough to pull the economy completely out of the depression. When FDR unwisely decided to try to balance the budget during the depression and he cut spending, this plunged the economy down again, in the \"Roosevelt recession\" of 1937. \nWhat is the common theme in all these \"successes\" of government spending you speak of? They are short term and when the money stop the economy tanks again. In 1936 the economy wasn't much better in reality...it was inflated by unsustainable spending on pet projects which gave a false GDP. Unemployment was still insanely high and actual industry growth was nothing (short of the industries created for the New Deal projects). The second it stopped the economy froze. You also used the excuse I said they always use: \"it wasn't enough\". No one ever realizes it is never enough.\n \n Look to WWII and the same thing happened. Basically the economy collapsed the second the government didn't need tanks and planes anymore. Lucky for us, though, we were the only industrialized nation that wasn't bombed into the stone age so after a while of converting our factories to products people needed we were able to export and be a functioning economy. So it really wasn't the spending by government that pulled us out but the fact that no one else was producing anything that pulled us out. \n \n I suppose today we could bomb China and all of Europe, blame someone else, and then supply them with goods to help our economy. \n \n My point is just that it is a huge myth that government spending during the depression pulled us out. People site GDP but don't realize that government spending is used to calculate GDP. They also don't realize that it is unsustainable because a government can't take on that level of debt each year for forever. Basically at some point inflation will kick in and screw you over even more. In the New Deal time they actually didn't incur much debt which was nice. \n \n \nYes, there are costs to government spending and to running a budget deficit, which is why Keynes wrote that deficit spending should not be practiced during times when the economy is strong.\n Much like \"trickle down\" the economic theory given by Keynes has never succeeded in the history of man. It didn't work with the New Deal and WWII spending still didn't do anything. \n \n \nUnder President Bush, because of his war spending, we generated a huge deficit when the economy was strong, which now puts us in a position to generate an enormous deficit when the economy is down.\nWe were already in a huge deficit I might add. Furthermore Congress controls the money and the democrats posted a 1 trillion dollar loss in FY08. So don't go on a Bush blaming rant...there is enough blame for our deficit issues to go around.\n \n \nPresident Obama proposes both to stimulate the economy with government spending and to cut taxes. This will of course produce an enormous budget deficit. Both spending and tax cuts are aimed at pumping up consumer demand, in order to stimulate business and pull the economy out of the recession/depression. Let's hope it works. It did before, and we can only hope it works again, or we will all suffer greatly.\nYou were fooled if you think it worked before.", 
   {}, 
   341641, 
   null, 
   1232905680.0
  ], 
  [
   341676, 
   null, 
   "Ohioprof", 
   "What is the common theme in all these \"successes\" of government spending you speak of? They are short term and when the money stop the economy tanks again. In 1936 the economy wasn't much better in reality...it was inflated by unsustainable spending on pet projects which gave a false GDP. Unemployment was still insanely high and actual industry growth was nothing (short of the industries created for the New Deal projects). The second it stopped the economy froze. You also used the excuse I said they always use: \"it wasn't enough\". No one ever realizes it is never enough.\n \n Look to WWII and the same thing happened. Basically the economy collapsed the second the government didn't need tanks and planes anymore. Lucky for us, though, we were the only industrialized nation that wasn't bombed into the stone age so after a while of converting our factories to products people needed we were able to export and be a functioning economy. So it really wasn't the spending by government that pulled us out but the fact that no one else was producing anything that pulled us out. \n \n I suppose today we could bomb China and all of Europe, blame someone else, and then supply them with goods to help our economy. \n \n My point is just that it is a huge myth that government spending during the depression pulled us out. People site GDP but don't realize that government spending is used to calculate GDP. They also don't realize that it is unsustainable because a government can't take on that level of debt each year for forever. Basically at some point inflation will kick in and screw you over even more. In the New Deal time they actually didn't incur much debt which was nice. \n \n Much like \"trickle down\" the economic theory given by Keynes has never succeeded in the history of man. It didn't work with the New Deal and WWII spending still didn't do anything. \n \n We were already in a huge deficit I might add. Furthermore Congress controls the money and the democrats posted a 1 trillion dollar loss in FY08. So don't go on a Bush blaming rant...there is enough blame for our deficit issues to go around.\n \n You were fooled if you think it worked before.\n\n \n I'll just respond briefly to your broad point here. I will argue to you that government spending DID work to pull the country out of the depression. The fact that decreasing government spending sank the economy is evidence of this. Was the spending of the New Deal and World War II a short-term fix? Yes, of course, but that is what the economy needs in a depression or a recession; the economy needs a source of demand to restore business. In a depression or a recession, the economy spirals down because lack of consumer demand causes industries to cut production and lay people off, which leads to more decline in consumer demand. Government spending is a way of stimulating demand. It's not the only way, but it's an effective and quick way, more reliable than tax cuts, because tax cuts usually do not stimulate enough demand, at least not by themselves. Government spending, as in World War II, will jump start an economy. \n \n It's clear that the government spending of the New Deal was a step in the right direction, but the economy was so far down, the spending wasn't enough. The far greater spending on World War II was enough to end the Depression and to create a labor shortage, not a labor surplus. \n \n Bush is to blame for starting an unnecessary war that cost enormous sums of money and cost the lives of many thousands of people. The Democrats in Congress are at fault to the extent that so many went along with Bush's war, at least at the beginning. That was a major mistake. Now that Bush is gone, we have to clean up the mess he left.", 
   {}, 
   341658, 
   null, 
   1232917560.0
  ], 
  [
   341688, 
   null, 
   "daewoo", 
   "I'll just respond briefly to your broad point here. I will argue to you that government spending DID work to pull the country out of the depression. The fact that decreasing government spending sank the economy is evidence of this. Was the spending of the New Deal and World War II a short-term fix? Yes, of course, but that is what the economy needs in a depression or a recession; the economy needs a source of demand to restore business. In a depression or a recession, the economy spirals down because lack of consumer demand causes industries to cut production and lay people off, which leads to more decline in consumer demand. Government spending is a way of stimulating demand. It's not the only way, but it's an effective and quick way, more reliable than tax cuts, because tax cuts usually do not stimulate enough demand, at least not by themselves. Government spending, as in World War II, will jump start an economy. \n \n It's clear that the government spending of the New Deal was a step in the right direction, but the economy was so far down, the spending wasn't enough. The far greater spending on World War II was enough to end the Depression and to create a labor shortage, not a labor surplus. \n \n Bush is to blame for starting an unnecessary war that cost enormous sums of money and cost the lives of many thousands of people. The Democrats in Congress are at fault to the extent that so many went along with Bush's war, at least at the beginning. That was a major mistake. Now that Bush is gone, we have to clean up the mess he left.\n\n \n Suffice it to say that the situation was about 20x more complicated than you put forth above. It was not jsut the governemnt spending but HOW it was spent, and the entire thing would almost certainly have been a total and absolute failure if not for the fact that the industrial infrastructure of pretty muck all of Europe, the UK, japan, and china were virtually wiped out by the war, which allowed us to become the worlds manufacturing powerhouse, which generated so much wealth that it has taken us 50 years of living high on the hog to blow it all.\n \n The big problem with Obamas stimulus plan is how the money is to be spent. It is absolutely impossible for it to do us any good as it is currently designed. In order for the government spending to have the desired impact it has to be spent on value added projects and as the obama plan stands now, it is not, which means that in the BEST CASE scenario it will be inflationary as hell. \n \n Let em give an example. When the interstate highway system was built it added a HUGE amount of value to the US. It allowed for the efficient transport of people and goods across an entire continent. Until its creation our industrial production was pretty much clustered around rivers and ocean ports, with the rest of the country largely being wasted. \n \n Fast forward to Obamas plan. Infrastructure spending on things like patching potholes and repairing bridges is NOT really value added spending. Trucks are already rolling over the interstates and will continue to do so even if there are pot holes and the bridges need to be re-decked. \n \n Literally the ONLY thing in his plan that produces a major added value to the US is his internet expansion plan and he even screws that up in the end because he has essentially said the government will pay for it, but there will be virtually no strings attached to that money, which pretty much means we all get screwed. If he had announced that the government was going to support the rollout of FREE nationwide high speed wireless, THAT would have actually been good....in fact it would have saved us companies and consumers nearly $450 billion per year EVERY year for the foreseeable future. Instead he is going to give grants to the telcoms to expand their networks, they will continue to gouge consumers, and what we will end up with is a bigger version of what we have now, which puts us about 15 years behind the S Koreans. \n \n Spending money on firefighters and cops is likewise futile...it does not actually add value to the economy and frankly both of those institutions are already horrendously overfunded. \n \n Government spending certainly CAN stimulate the economy, but is has to be the RIGHT government spending. Filling potholes and buying more military #### is not going to do it. His alternative energy plan will be TERRIBLE for the US economy and consumers. \n \n The problem is that there is not really the political will to create programs that WOULD stimulate the economy. If he wanted to stimulate the economy, the government funding and rollout of a national high speed wireless network would be a good first step. For maximum effect it should be a government service that is FREE to individuals (charge businesses). The next best option would be a nationwide wireless network with SIGNIFICANT strings attached including price limits and a federally dictated TOS. On the alternative energy front, putting in more wind and solar energy in its current form is not an economically viable plan...in fact it is an economic disaster waiting to happen (think about it and if you cant figure out why I will explain it). \n \n If he wants to push alternative energy he needs to funnel SIGNIFICANT funding to the DOE for RESEARCH instead of spending it on deployment because the technology we have right now is simply not good enough to deploy yet. HE needs to go one step further and rescind the reagan federal research dogma that left the federal government paying for research, but made the results the property of private companies. Instead the energy research conducted using federal funds needs to be PUBLIC DOMAIN....IP free...so it can be rolled out in the market quickly as opposed to being sat on by a few wealthy companies. A lot of people would FREAK OUT at that and claim he is turning the country socialist, but the truth is that until Reagan, that is the way federally funded research was handled...you took the money and the results of the research were public domain. It was part of a radical idea that said the taxpayer should derive maximum benefit from taxpayer funded research. Crazy, I know.", 
   {}, 
   341676, 
   null, 
   1232921700.0
  ], 
  [
   341706, 
   null, 
   "Ohioprof", 
   "There were certainly multiple factors that contributed to and caused the continuation of the Great Depresion. But lack of consumer demand, resulting largely from working people not earning enough to consume the products of industry, was at the heart of the problem. Capitalist economies tend toward overproduction/underconsumption, which leads to and strongly contributes to the downturn in the business cycle. Government spending worked to pull the country out of depression because the government, in effect, acted a giant consumer. \n \n I would argue that in the short run, it really did not matter particularly for economic recovery what the government spent money on so long as the government spending created jobs. By spending money on weapons and ships and planes and tanks, many of which were destroyed in the war, the government acted as a consumer whose demand created jobs. The creation of jobs put money in the pockets of working people, which enabled them to consume more. In the short run, the mere act of spending and putting money into people's pockets, whether on public works projects or on weapons of war, stimulated the economy and brought recovery. \n \n In the long run, it is certainly true that some economic activity is more useful to the society and promotes economic development more than other economic activity. I agree with you that for long run improvement, the government should be careful about how it spends, because stimulating the economy immediately is not the only goal of a spending program. \n \n It's true that the United States emerged as the world's leading economic and military power after World War II largely because of the destruction of much of Europe and parts of Asia. American industries did not face foreign competition at that point, and they found a world hungry for what American industry could produce. The U.S. sought to fund economic recovery abroad in order to build up its trading partners as well as to stop the spread of Communism. We certainly were in a uniquely advantageous position economically at the end of the war. But this is a separate question from whether the government spending during the war stimulated American economic recovery, which it clearly did. War spending quickly pulled the U.S. economy out of the depression. \n \n After World War II, many folks feared that the Great Depression might resume. One reason it did not, besides the unique economic position of the U.S. in the world at that point, was because the United States kept up its military spending during the Cold War. The U.S. kept its economy pumped up.", 
   {}, 
   341688, 
   null, 
   1232931660.0
  ], 
  [
   341733, 
   null, 
   "Archangel", 
   "Good post Daewoo, and don't forget that by increasing the income and luxury tax on the rich he will stifle spending by the demographic most capable of spending large sums of money. Before Reagan reversed Carters luxury tax, the pleasure boat and American Yacht industry had for all intents and purposes closed up shop. This represented 10s of thousands of jobs in the boating industry alone. Luxury cars and second home sales also collapsed which had a huge negative impact on Real Estate and Auto sale leading to further stagflation. And don't forget the loss of vacation home sales which also fell under the hammer of the luxury tax. This affected the economies of both ski and summer resorts leading to higher unemployment in those sectors.\n \n What these socialists fail to understand is that like it or not the economy flows like a river. In other words, it trickles down from the rich to the middle to the poor. And only if the richest people are spending, is their a flow of cash to employ the rest of the population in order to produce products which employed people purchase. \n \n But of what value is the government spending going to do when it must be paid back by our taxes? It's like paying back on a loan which we got no benefit of at all. The Governments spending the money after all, but they aren't spending it in profitable ways which will offer us a return on the investment WE AS THE TAXPAYERS MUST PAY BACK. It is an insane plan which will bankrupt this country in short order.\n \n We would be better off if Uncle Sam just took this bailout money and gave each taxpayer a half million dollars each, and each business a check for 10% of what their business was valued at for hiring new employees and investing in new equipment. That would be a much better use of the 800 BILLION DOLLARS THEY'RE GOING TO BLOW and would actually stimulate the economy in a quick and real way.", 
   {}, 
   341706, 
   null, 
   1232938740.0
  ], 
  [
   341740, 
   null, 
   "daewoo", 
   "Good post Daewoo, and don't forget that by increasing the income and luxury tax on the rich he will stifle spending by the demographic most capable of spending large sums of money. Before Reagan reversed Carters luxury tax, the pleasure boat and American Yacht industry had for all intents and purposes closed up shop. This represented 10s of thousands of jobs in the boating industry alone. Luxury cars and second home sales also collapsed which had a huge negative impact on Real Estate and Auto sale leading to further stagflation. And don't forget the loss of vacation home sales which also fell under the hammer of the luxury tax. This affected the economies of both ski and summer resorts leading to higher unemployment in those sectors.\n\n \n No, we wont. Nor did the yacht industry or resort industries suffer because of increased taxes on the wealthy. They closed up because despite decreases in taxes on the middle class, real incomes have been falling for 30 years in the US. For all intents and purposes, the \"upper middle class\" is dead. Reagan killed it with his spending programs. \n \n \nWhat these socialists fail to understand is that like it or not the economy flows like a river. In other words, it trickles down from the rich to the middle to the poor. And only if the richest people are spending, is their a flow of cash to employ the rest of the population in order to produce products which employed people purchase. \n\n \n Again...WRONG. Trickle down economics is junk. It always has been, it always will be. Frankly the very idea is retarded, but Reagan managed to sell it because most Americans are XXXXXX and he had a folksey quality that they liked. \n \n \nBut of what value is the government spending going to do when it must be paid back by our taxes? It's like paying back on a loan which we got no benefit of at all. The Governments spending the money after all, but they aren't spending it in profitable ways which will offer us a return on the investment WE AS THE TAXPAYERS MUST PAY BACK. It is an insane plan which will bankrupt this country in short order.\n\n \n Which in large part is my point. If we want to use government spending to stimulate the economy we have to abandon any idiotic ideas about trickle down economics. We have to kick the reaganites in the nuts and buy them all calculators so they will stop spouting his idiocy, and we have to actually engage in value added government spending. This means no Reagan era corporate welfare, no trying to apply free market BS to government stimulus spending. WE have to find projects that will have positive economic impact, the government has to pay for them, and either the government has to then own them, or set up a non profit to own them, so full and actual economic value of those projects is passed to the general public. \n \n \nWe would be better off if Uncle Sam just took this bailout money and gave each taxpayer a half million dollars each, and each business a check for 10% of what their business was valued at for hiring new employees and investing in new equipment. That would be a much better use of the 800 BILLION DOLLARS THEY'RE GOING TO BLOW and would actually stimulate the economy in a quick and real way.\n\n \n Wow. This is maybe the WORST idea I have seen. That would lead to overnight hyperinflation. The US would be a third world country in roughly 120 days. By the end of the year we would all be millionaires, but that would be just enough to buy you a loaf of bread and a box of condoms.", 
   {}, 
   341733, 
   null, 
   1232943480.0
  ], 
  [
   341744, 
   null, 
   "Archangel", 
   "No, we wont. Nor did the yacht industry or resort industries suffer because of increased taxes on the wealthy. They closed up because despite decreases in taxes on the middle class, real incomes have been falling for 30 years in the US. For all intents and purposes, the \"upper middle class\" is dead. Reagan killed it with his spending programs. \n \n Don't presume to tell me what I lived through Daewoo. I'm speaking from first hand knowledge regarding the spending attitudes of peers who refused to purchase boats and second homes specifically because of the luxury tax at the time under \"Carter\". You do realize I'm speaking about Jimmy Carter's policies don't you? And many refused to sell homes due to the capital gains tax which was huge. And the inheritance tax was the motivation for the creation of tax shelters which were created during his regime. All of these policies mostly affected the wealthy, and brought spending by them to a halt. \n \n Reagan reversed those taxes and the economy bounced back before his first term was up which was evidenced by his victory which was the largest in history I believe. Only in Massachusetts did Mondale win. Reagan won all other states. \n \n \n \nAgain...WRONG. Trickle down economics is junk. It always has been, it always will be. Frankly the very idea is retarded, but Reagan managed to sell it because most Americans are XXXXXX and he had a folksey quality that they liked. \n \n \n I never commented on the right or wrong, or good or bad of trickle down economics. What I said is it's the way capitalism works whether you like it or not. When the wealthiest among us stop spending and investing their money, the economy stops moving. PERIOD. That is the impact Carters policies had on the economy whether you can see it or not.\n \n \nWhich in large part is my point. If we want to use government spending to stimulate the economy we have to abandon any idiotic ideas about trickle down economics. We have to kick the reaganites in the nuts and buy them all calculators so they will stop spouting his idiocy, and we have to actually engage in value added government spending. This means no Reagan era corporate welfare, no trying to apply free market BS to government stimulus spending. WE have to find projects that will have positive economic impact, the government has to pay for them, and either the government has to then own them, or set up a non profit to own them, so full and actual economic value of those projects is passed to the general public. \n \n \n Regarding the bolded, this is a pipe dream. Name one government program that has ever made a profit. Here's an example, PostalReporter.com Blog USPS Reports $5.4 Billion Deficit for FY 2007 USPS Reports $5.4 Billion Deficit for FY 2007 Projects net loss of $600 million in 2008 Now, do you believe that Daewoo? That they lost 5.4 billion in 07, but would only lose 600 million in 08? If so, I have a bridge to nowhere to sell you.\n \n The Government must get out of the way of business, not take control over it. \n \n \nWow. This is maybe the WORST idea I have seen. That would lead to overnight hyperinflation. The US would be a third world country in roughly 120 days. By the end of the year we would all be millionaires, but that would be just enough to buy you a loaf of bread and a box of condoms.\n\n \n emoticon_smile I agree completely. I said it to show how absolutely ridiculous and wasteful Obamas plan is and that this plan is no worse in the long run than his will be. The destruction to the economy will be similarly fatal. And considering the condition our economy is in, and that untold millions of people would bank and invest their money rather than just spend it. It would revitalize liquidity in the banking system, promote investment and free up spending which would promote hiring and put a stop to these massive closures and layoffs. My reason for even suggesting it was to say that rather than give the banking institutions control of 850 billion of our money and make us pay the bill for it, better they give it to us and at least allow americans to have a bankbook to show for the taxes they'll pay anyway. Get my point?", 
   {}, 
   341740, 
   null, 
   1232947680.0
  ], 
  [
   341757, 
   null, 
   "daewoo", 
   "Don't presume to tell me what I lived through Daewoo. I'm speaking from first hand knowledge regarding the spending attitudes of peers who refused to purchase boats and second homes specifically because of the luxury tax at the time under \"Carter\". You do realize I'm speaking about Jimmy Carter's policies don't you? And many refused to sell homes due to the capital gains tax which was huge. And the inheritance tax was the motivation for the creation of tax shelters which were created during his regime. All of these policies mostly affected the wealthy, and brought spending by them to a halt. \n\n \n I dont know what you lived though, But I do know that the decline in luxury goods industries did NOT correspond with any tax policy of the government, it corresponded exactly with reduced spending power in the middle class. I also know that your claim that his policies brought spending by the upper class to a halt is pure stupidity. There has never, ever, in the history of the united states, been even one single year where spending by the top 20% of earners (the class that his tax policies hit) has declined. Not one. Thst is just a fact...regardless of what you THINK you saw.\n \n As far as people choosing not to sell their houses because they did not want to pay the capital gains tax....that is pretty much an economically neutral decision. It does not matter. \n \n \n \nReagan reversed those taxes and the economy bounced back before his first term was up which was evidenced by his victory which was the largest in history I believe. Only in Massachusetts did Mondale win. Reagan won all other states. \n\n \n It has been proven absolutely that Reagans tax policies did not have a positive effect on the economy...his deficit spending did. He flooded the nation with cash, which stimulated the economy. Unfortunately he also shot our debt through the roof, the bill for which is coming due. \n \n \n \nI never commented on the right or wrong, or good or bad of trickle down economics. What I said is it's the way capitalism works whether you like it or not. When the wealthiest among us stop spending and investing their money, the economy stops moving. PERIOD. That is the impact Carters policies had on the economy whether you can see it or not.\n\n \n No, that is not how capitalism works. Capitalism works through the creation of wealth via the production of tangible goods. \n \n \nRegarding the bolded, this is a pipe dream. Name one government program that has ever made a profit. Here's an example, PostalReporter.com Blog USPS Reports $5.4 Billion Deficit for FY 2007 USPS Reports $5.4 Billion Deficit for FY 2007 Projects net loss of $600 million in 2008 Now, do you believe that Daewoo? That they lost 5.4 billion in 07, but would only lose 600 million in 08? If so, I have a bridge to nowhere to sell you.\n \n The Government must get out of the way of business, not take control over it. \n \n\n \n The government is not supposed to turn a profit with the services it provides...it is supposed to provide services that create economic value to the economy as a whole. Examples of government projects:\n \n Interstate highways\n Electrical Grid\n Telephone system\n Hoover Dam\n \n The postal service does generally turn a profit. Yes, I believe they will only have a $600 million deficit for 2008 despite the much larger deficit in 2007 because if you had bothered to read the article you would have noticed that the deficit in 2007 included several billion $s in one time costs. Considering the fact that the post office, in theory, has reserves of roughly half a trillion dollars (money that have transferred to the federal government over the last 15 years...their profits) neither of the deficits in question is particularly alarming. \n \n So, when government is \"getting out of businesses way\" should they take the roads, grid, and telephone system with them?? All 3 were directly funded by the federal government. \n \n \n \nemoticon_smile I agree completely. I said it to show how absolutely ridiculous and wasteful Obamas plan is and that this plan is no worse in the long run than his will be. The destruction to the economy will be similarly fatal. And considering the condition our economy is in, and that untold millions of people would bank and invest their money rather than just spend it. It would revitalize liquidity in the banking system, promote investment and free up spending which would promote hiring and put a stop to these massive closures and layoffs. My reason for even suggesting it was to say that rather than give the banking institutions control of 850 billion of our money and make us pay the bill for it, better they give it to us and at least allow americans to have a bankbook to show for the taxes they'll pay anyway. Get my point?\n\n \n Not really. First, we do not need to \"free up\" spending or revitalize liquidity. There is no liquidity problem. There never was. There is a solvency problem. The idea that this is a liquidity issue is a lie that our politicians have told us because they don't want us to think too hard about 2 simple facts:\n \n 1. Most of our banks are insolvent\n 2. Most Americans are not credit worthy\n \n Generally the idea behind stimulus spending is that it essentially acts as a bridge loan until the economy can basically grow back into itself. That is why Reagans spending worked...it let the economy continue to move until the ag bubble started, which led to enough \"wealth creation\" to allow the economy to grow some without just stealing from our kids (not really, but we thought so at the time).\n \n That pretty much only works during an inventory adjustment recession. That is OK, since pretty much all recessions are inventory adjustment events. What we are in right now is NOT an inventory adjustment. We had a big credit bubble, it has burst, and we are in a risk reassessment adjustment. That is an entirely different monster.\n \n The keep talking about getting banks lending again, but the truth of the matter is that there is still plenty of money available for creditworthy borrowers. There just are not very many creditworthy borrowers. Not long ago Paulson released \"suggested\" lending standards for banks and basically said he was setting an ultimatum for them...lend to those standards or lose federal aid. Teh banks pretty much all came back with \"If we TIGHTENED to those standards we would lose half our consumer lending business\" \n \n Most Americans spend over 75% of their paychecks on some kind of debt service (loan payments). That is insane and unsustainable. You would have to be an ##### to loan more money to somebody who spends that much of their paycheck on loan service. \n \n Banks have been doing it for years, though. Last year fuel prices went through the roof, as did food prices, and a lot of those people who were spending 75% of their paychecks on debt service could no longer do it. People started defaulting, and it quickly accelerated into a self perpetuating downward spiral.\n \n Now we are seeing lenders stepping back to more traditional risk patterns. Suddenly you have to be able to prove that at SOME POINT in your life you HAVE paid a bill on time or they are not willing to lend you $45,000 for a new pickup. They also are not willing to loan you $45,000 for a new pickup if you only make $50,000 per year because...well...that is stupid. \n \n This downturn, what is currently a recession, is different from others in the past...the last time we had something like this it was 1929. A bridge loan is not going to cut it. Federal spending certainly has its place, but if we want it to actually help here we need to make sure it is something that adds value to the economy...something that will help revitalize it, not just help it limp through. \n \n The problem that we get into there is that our economy is so far out of whack that coming up with ideas for that kind of spending is a challenge. For the most part our infrastructure is pretty complete. His ideas about upgrading the power grid are relatively good...if they attach some MAJOR strings to them. For instance, they should require that as part of the grid upgrade electrical companies should be required to install 3 phase power in homes if it is requested by the home owner...and at no extra charge. Expansion of 3 phase power availability would save us hundreds of billions of dollars per year as well as spawning new markets for 3 phase appliances, panels, and provide a lot of work for electrical contractors. IT could include net metering provisions that require the utilities to purchase power from homeowners at either the rate they charge for it or an average wholesale rate. Currently many states have net metering, but many do not, and a lot of them that do have it only require that the utility pay a \"cost avoided\" price for the electricity, which amazingly is always charged at 3 cents/kw hr, the price of producing the power from coal. Even power companies that have NO generating capacity and pay wholesale for ALL their power pay out that 3 cents/kw hr (which is typically about 1/3 wholesale). \n \n The roads, public safety, and renewable energy parts are junk. Scrap them. The internet part is pretty good IF done properly.", 
   {}, 
   341744, 
   null, 
   1232953920.0
  ], 
  [
   341770, 
   null, 
   "Ohioprof", 
   "Daewoo, I agree with much of what you write, and I disagree with some of what you write. Mostly I agree with you. I disagree about the federal projects you label \"junk,\" simply because we need to repair the roads. In and of itself this is a good and necessary undertaking. It will help boost the economy in the short run, as we discussed earlier, and it will benefit everyone in the long run by giving us better roads. Environmental efforts will improve the environment beyond their impact on the economy. Whether these initiatives add long-term value to the economy or not, they are worth doing because they make needed improvements. It's better to have a clean environment than not, and this by itself is reason for the federal government to pursue this. I think it's imperative. Cleaning the environment has a social value beyond economic stimulus. \n \n Here is an interesting piece by Paul Krugman in today's NYTimes about why we need a government stimulus package: http://www.nytimes.com/2009/01/26/opinion/26krugman.html?_r=1&hp", 
   {}, 
   341757, 
   null, 
   1232972100.0
  ], 
  [
   341773, 
   null, 
   "Steeeeve", 
   "I'll just respond briefly to your broad point here. I will argue to you that government spending DID work to pull the country out of the depression. The fact that decreasing government spending sank the economy is evidence of this.\nIt is evidence it does nothing to fix an economy though as that kind of increased spending is unsustainable. Your argument basically amounts to someone saying you can fix your money troubles by paying them off with a credit card or getting a money advance. A temporary solution is just not a solution..even more so when it risks even bigger consequences such as inflation.\n \n \nIt's clear that the government spending of the New Deal was a step in the right direction, but the economy was so far down, the spending wasn't enough. The far greater spending on World War II was enough to end the Depression and to create a labor shortage, not a labor surplus. \nThe logic doesn't follow. You admit that once government spending went down the economy went down. Well later the economy went back up but it wasn't because an increase in government spending, it was an increase for demand of US products. What caused the increase in demand was basically the fact that no other production facilities were around. The government spending was irrelevant....assuming WWII could have been won without us spending a dime we would have had the same economic benefit. \n \n In other words you could have government spending continually increase and your economy would look better but at some point that bill is due and you can't tax people 100% and you can't borrow money indefinitely. The second that spending is gone the people are left with nothing because no growth really existed and no demand was created. This is evidenced with the New Deal and WWII....government spending went down and the economy tanked, demand for goods and services went up and our economy did well. Providing goods and services is much more sustainable than government spending.\n \n \nBush is to blame for starting an unnecessary war that cost enormous sums of money and cost the lives of many thousands of people. The Democrats in Congress are at fault to the extent that so many went along with Bush's war, at least at the beginning. That was a major mistake. Now that Bush is gone, we have to clean up the mess he left.\nOh give me a break, the war isn't going to cut us nearly as much as these ridiculous stimulus plans and the war had little to do with the economy we are in now.", 
   {}, 
   341676, 
   null, 
   1232978400.0
  ], 
  [
   341774, 
   null, 
   "Steeeeve", 
   "Which in large part is my point. If we want to use government spending to stimulate the economy we have to abandon any idiotic ideas about trickle down economics. We have to kick the reaganites in the nuts and buy them all calculators so they will stop spouting his idiocy, and we have to actually engage in value added government spending. This means no Reagan era corporate welfare, no trying to apply free market BS to government stimulus spending. WE have to find projects that will have positive economic impact, the government has to pay for them, and either the government has to then own them, or set up a non profit to own them, so full and actual economic value of those projects is passed to the general public.\nI disagree that government spending will do anything even if spent on worth wild projects. It may be a smart move that could lead to long term benefits but it will not jump start anything. This is even more true if you use debt to pay for it.\n \n In normal times government spending on infrastructure is probably a good idea which promotes growth and gives you a competitive advantage over, say, India where Dell has to build water treatment facilities to run their call center. I think the myth is that if you print billions and spend it on people building roads that all of a sudden you get this massive growth to turn things around. For one, you have created numerous government jobs of which many are going away the second you stop that spending which leads you right back in the same boat. The New Deal and WWII are great examples. In 1937 the unemployment rate was like 15% and after WWII there was no need for hundreds of thousands of soldiers. I keep hearing the lame excuse \"we didn't spend enough in the New Deal\"...well did we spend enough in WWII? If so then why did we fall into recession after it? It is never enough because you have to continue it and increase it indefinitely.\n \n Basically my point is government spending doesn't stimulate an economy..it can only help promote one.", 
   {}, 
   341740, 
   null, 
   1232979240.0
  ], 
  [
   341775, 
   null, 
   "Steeeeve", 
   "The government is not supposed to turn a profit with the services it provides...it is supposed to provide services that create economic value to the economy as a whole. Examples of government projects:\n \n Interstate highways\n Electrical Grid\n Telephone system\n Hoover Dam\n \n The postal service does generally turn a profit. Yes, I believe they will only have a $600 million deficit for 2008 despite the much larger deficit in 2007 because if you had bothered to read the article you would have noticed that the deficit in 2007 included several billion $s in one time costs. Considering the fact that the post office, in theory, has reserves of roughly half a trillion dollars (money that have transferred to the federal government over the last 15 years...their profits) neither of the deficits in question is particularly alarming.\n \n So, when government is \"getting out of businesses way\" should they take the roads, grid, and telephone system with them?? All 3 were directly funded by the federal government.\n \n\n You could also point out that setting up post offices is a power of congress...specifically listed in the constitution actually.", 
   {}, 
   341774, 
   null, 
   1232979480.0
  ], 
  [
   341783, 
   null, 
   "jitobear", 
   "Just want to correct some historical info for Archie. Mondale won in Minnesota (his home state) not Mass. I believe he also won in the District of Columbia.", 
   {}, 
   341775, 
   null, 
   1232990820.0
  ], 
  [
   341805, 
   null, 
   "Ohioprof", 
   "It is evidence it does nothing to fix an economy though as that kind of increased spending is unsustainable. Your argument basically amounts to someone saying you can fix your money troubles by paying them off with a credit card or getting a money advance. A temporary solution is just not a solution..even more so when it risks even bigger consequences such as inflation.\n \n The logic doesn't follow. You admit that once government spending went down the economy went down. Well later the economy went back up but it wasn't because an increase in government spending, it was an increase for demand of US products. What caused the increase in demand was basically the fact that no other production facilities were around. The government spending was irrelevant....assuming WWII could have been won without us spending a dime we would have had the same economic benefit. \n \n In other words you could have government spending continually increase and your economy would look better but at some point that bill is due and you can't tax people 100% and you can't borrow money indefinitely. The second that spending is gone the people are left with nothing because no growth really existed and no demand was created. This is evidenced with the New Deal and WWII....government spending went down and the economy tanked, demand for goods and services went up and our economy did well. Providing goods and services is much more sustainable than government spending.\n \n\n \n Remember that Keynes did not call for having government spending continually increase. He called for government to spend and run a deficit when the economy is headed into recession/depression, at a specific point in the business cycle. His idea was not to have government spending be \"sustainable,\" to quote your last sentence. Keyne's argument was to use government spending to counter the business cycle, which is known as counter-cyclical spending. And yes, this government deficit spending is a short-term solution to the immediate problem of depression/recession, to the downturn in the business cycle. \n \n The analogy of the jump start is apt. Just as you use jumper cables attached to another power source to give an immediate jump to your car battery, you use the federal government to give an immediate jump to the economy. You don't rely on government deficit spending to sustain economic growth over time, just as you don't run your car off the other power source over time. You use the jump to get the car engine started, and the engine runs the car. Similarly, you use the jump of deficit spending to get the economic engine started, and the private sector economy then runs the car.\n \n Your point as I understand it is that in the long run, it wasn't government spending during World War II that caused the economy to prosper, but the demand for U.S. products. But it was government spending that created the demand, by creating jobs that enabled people to buy the products. This is true of products purchased by Americans and of products purchased by people overseas. The U.S. government spent money on the Marshall Plan to build up Europe, in part to rebuild our trading partners and to enable Europeans to buy American products. Government spending served to fix the economy by helping to create jobs both at home and abroad, which in turn paid people wages that allowed them to spend money on products, which led to the demand for U.S. goods. Government spending jump starts an economy by enabling the demand for products that then goes on to fuel economic growth.", 
   {}, 
   341773, 
   null, 
   1233004140.0
  ], 
  [
   341806, 
   null, 
   "daewoo", 
   "Daewoo, I agree with much of what you write, and I disagree with some of what you write. Mostly I agree with you. I disagree about the federal projects you label \"junk,\" simply because we need to repair the roads. In and of itself this is a good and necessary undertaking. It will help boost the economy in the short run, as we discussed earlier, and it will benefit everyone in the long run by giving us better roads. Environmental efforts will improve the environment beyond their impact on the economy. Whether these initiatives add long-term value to the economy or not, they are worth doing because they make needed improvements. It's better to have a clean environment than not, and this by itself is reason for the federal government to pursue this. I think it's imperative. Cleaning the environment has a social value beyond economic stimulus. \n \n Here is an interesting piece by Paul Krugman in today's NYTimes about why we need a government stimulus package: http://www.nytimes.com/2009/01/26/opinion/26krugman.html?_r=1&hp\n\n \n The problem is that when you talk about, for instance, repairing the roads, the only question that really matters is \"Will repairing the roads provide an immediate net positive gain to the economy of the US\" and it will not. I absolutely agree that we should spend more on infrastructure, but borrowing a whole bunch of money to play catch up on your maintenance is just plain dumb. Filling potholes and doing overlays and fixkign bridges will not actually allow for an increase in the amount of goods transported across our roads in the short term because the demand is simply not there. So, there is no imperative to those projects and no short term gain. To do them now means we have to borrow the money. Currently there are NO PLANS whatsoever to repay ANY of the outstanding US debt....they just plan to continually roll it over. For all intents and purposes, that means that the cost of those repairs that we do NOW with BORROWED money is infinite. You are talking abotu spending an infinite amount of money to FILL POT HOLES. We cannot saddle ourselves with that kind of debt for something that does not provide an immediate benefit. There is no point when we can put it off until the recession is over and the cost will be like 20 billion percent less. \n \n The alternative energy plan is even worse. First, we need to recognize that there IS NO SHORTAGE OF ELECTRICITY IN THE US. None at all. We have such a surplus that we literally have plants shut down and operating at half capacity. We do have an energy problem, but it is a liquid fuels problem and since we do not use liquid fuels to produce electricity, the 2 are entirely unrelated. \n \n The bigger problem with renewables is that none of the technologies we have now are competitive. Coal plants produce electricity for 3 cents kw/hr. Wind costs roughly 6 times that. So does solar (and that is cheap solar). We have subsidized these technologies so we have built utility scale projects knowing from day one that they were not competitive. Then we force utilities to buy power from them at a higher price.\n \n My electricity bill has more than doubled in the last year and it is because our provider has literally been forced to shut down a turbine at their coal plant and buy wind power at 6 times the cost. That kin dof thing is a MAJOR economic negative for the economy. \n \n Think it leads to a cleaner environment? Think again. A 100mw wind plant uses roughly 70x the amount of copper that a coal plant requires for the same output...that copper is mostly cyanide leached out of open pit copper mines. Those projects are INCREDIBLY resource intensive. It is questionable, especially with clean coal technologies coming online, whether there is ANY environmental benefit to \"renewable\" energy as we practice it today AT ALL. You have to look at the whole supply stream, not just the fuel requirements.", 
   {}, 
   341770, 
   null, 
   1233004500.0
  ], 
  [
   341807, 
   null, 
   "daewoo", 
   "I disagree that government spending will do anything even if spent on worth wild projects. It may be a smart move that could lead to long term benefits but it will not jump start anything. This is even more true if you use debt to pay for it.\n \n In normal times government spending on infrastructure is probably a good idea which promotes growth and gives you a competitive advantage over, say, India where Dell has to build water treatment facilities to run their call center. I think the myth is that if you print billions and spend it on people building roads that all of a sudden you get this massive growth to turn things around. For one, you have created numerous government jobs of which many are going away the second you stop that spending which leads you right back in the same boat. The New Deal and WWII are great examples. In 1937 the unemployment rate was like 15% and after WWII there was no need for hundreds of thousands of soldiers. I keep hearing the lame excuse \"we didn't spend enough in the New Deal\"...well did we spend enough in WWII? If so then why did we fall into recession after it? It is never enough because you have to continue it and increase it indefinitely.\n \n Basically my point is government spending doesn't stimulate an economy..it can only help promote one.\n\n \n You are missing an important dynamic here, Steeeve.\n \n They are going to spend the money. It does not MATTER whether it makes sense or not under these particular circumstances. It is GOING to get spent.\n \n Once we let that little bit of reality in, the argument changes. NOT spending the money is NOT on the table. Even if we had irrefutable proof that spending the money would not help...even if we had a signed letter from god himself saying that spending the money will not help, WE ARE GOING TO SPEND THE MONEY because politicians have to look like they are doing something to help in order to avoid having people actually think about it for too long and realizing that it is largely the politicians that made this mess to begin with. \n \n So, we are stuck arguing about WHERE to spend the money that it might have a positive long term impact. Even this is largely hypothtical because frankly there IS no America in the long term...at least not anything recognizable to us today. \n \n Once all those qualifiers are on the table, you CAN use government spending to spur the economy (provided you have one...which we dont) and you CAN use deficit spending or even rank monetarization to do it and still avoid inflationary problems IF, and ONLY IF, it is used on projects that impart long term value on the economy that is on par or greater than the amount spent.", 
   {}, 
   341774, 
   null, 
   1233004620.0
  ], 
  [
   341813, 
   null, 
   "Ohioprof", 
   "I disagree that government spending will do anything even if spent on worth wild projects. It may be a smart move that could lead to long term benefits but it will not jump start anything. This is even more true if you use debt to pay for it.\n \n In normal times government spending on infrastructure is probably a good idea which promotes growth and gives you a competitive advantage over, say, India where Dell has to build water treatment facilities to run their call center. I think the myth is that if you print billions and spend it on people building roads that all of a sudden you get this massive growth to turn things around. For one, you have created numerous government jobs of which many are going away the second you stop that spending which leads you right back in the same boat. The New Deal and WWII are great examples. In 1937 the unemployment rate was like 15% and after WWII there was no need for hundreds of thousands of soldiers. I keep hearing the lame excuse \"we didn't spend enough in the New Deal\"...well did we spend enough in WWII? If so then why did we fall into recession after it? It is never enough because you have to continue it and increase it indefinitely.\n \n Basically my point is government spending doesn't stimulate an economy..it can only help promote one.\n\n \n The transition to a peace economy after World War II had some bumps, notably strikes, but the economy did not sink back into depression, as some had feared it would. One reason is because the government spending during the war, coupled with a lack of consumer goods during the war, created pent-up demand. People had money to spend, and they spent it. This is a direct result of the government spending that jump-started the economy during the war and put money in people's pockets by giving them jobs. The fact that government-funded jobs are temporary really doesn't matter so long as there is enough demand to create other jobs after the government spending declines. \n \n The key is for the government spending to enable consumption that then triggers private sector growth.", 
   {}, 
   341774, 
   null, 
   1233005940.0
  ], 
  [
   341815, 
   null, 
   "Steeeeve", 
   "Remember that Keynes did not call for having government spending continually increase. He called for government to spend and run a deficit when the economy is headed into recession/depression, at a specific point in the business cycle. His idea was not to have government spending be \"sustainable,\" to quote your last sentence. Keyne's argument was to use government spending to counter the business cycle, which is known as counter-cyclical spending. And yes, this government deficit spending is a short-term solution to the immediate problem of depression/recession, to the downturn in the business cycle. \nRight, but the only way to make it work is to continue the increase in spending, that was my point. As we have seen and you agree with, the moment the funding stops the economy goes right back into recession. It is also debatable whether we were even out of a recession when the spending is on going. The New Deal was happening and the recession wasn't over. The recession in the 80s had no relationship to government spending (in terms of trying to solve it).\n \n Keynes theory is about as accurate as trickle down economics. It sounds good in theory but doesn't work and never will.\n \n \nThe analogy of the jump start is apt. Just as you use jumper cables attached to another power source to give an immediate jump to your car battery, you use the federal government to give an immediate jump to the economy. You don't rely on government deficit spending to sustain economic growth over time, just as you don't run your car off the other power source over time. You use the jump to get the car engine started, and the engine runs the car. Similarly, you use the jump of deficit spending to get the economic engine started, and the private sector economy then runs the car.\nI understand the purpose, you have a bad habit of describing how something works instead of arguing whether or not it does work. I'm not stupid.\n \n I am arguing that it doesn't jump start the car. If you want to use the analogy it would be like jumping a completely dead car battery. You might get the engine started for a second but you will have to replace the battery before the car will go anywhere. Even getting the car started for a second is debatable.\n \n \nYour point as I understand it is that in the long run, it wasn't government spending during World War II that caused the economy to prosper, but the demand for U.S. products. But it was government spending that created the demand, by creating jobs that enabled people to buy the products.\nIt was the government spending that led to the demand...but by flattening the rest of the industrialized nations. The demand had nothing to do with employing people because after WWII people weren't employed by the federal government (war is over) and it wasn't like they got a big check when they came home and spent it. Remember we were in a mini recession after WWII for 2-3 years. People got jobs when manufacturing was needed after the war. The government was buying this stuff...at least not the US. It was US citizens and foreign nations. All of this was unrelated to the war and to government spending. \n \n In your defense, we did build some great infrastructure during that time that allowed for extreme business growth...so in that sense the government spending helped but this was mostly paid for without debt and would be worthless without the main cause of economic recovery. In other words, you can't go out and build interstates anytime you want and think the economy will go nuts.\n \n \nThis is true of products purchased by Americans and of products purchased by people overseas. The U.S. government spent money on the Marshall Plan to build up Europe, in part to rebuild our trading partners and to enable Europeans to buy American products. Government spending served to fix the economy by helping to create jobs both at home and abroad, which in turn paid people wages that allowed them to spend money on products, which led to the demand for U.S. goods. Government spending jump starts an economy by enabling the demand for products that then goes on to fuel economic growth.\nNothing I've seen supports this. While having no other countries functioning helped us, we didn't have a huge trade surplus which is what you are arguing the government created. \n \n You talk about the Marshall Plan, well that wasn't during a period of US economic recession...at least most of it wasn't. This is largely irrelevant. \n \n \n One trap you can fall into is assuming a truth and finding a way to get that answer. For example we can do bailouts over and over and over until the economy gets better and then everyone will say it was the bailouts and it took \"# of bailouts x $\" to get the economy going again when you really don't have any correlation. We have already done a few stimulus packages and those failed. Japan tried them in the 90s and that failed. The New Deal failed. We have had recessions recover is 1-2 years with no stimulus packages. \n \n There is just no relation to government spending and economic recovery. Keynes is wrong.", 
   {}, 
   341805, 
   null, 
   1233006420.0
  ], 
  [
   341818, 
   null, 
   "Steeeeve", 
   "You are missing an important dynamic here, Steeeve.\n \n They are going to spend the money. It does not MATTER whether it makes sense or not under these particular circumstances. It is GOING to get spent.\nWe have had this problem before between us....I am always thinking in \"a perfect world\" while you are thinking in reality of the situation. Seeing how this is a forum, and you and I are clearly in the minority, I doubt it really matters which way you view it.\n \n \nOnce all those qualifiers are on the table, you CAN use government spending to spur the economy (provided you have one...which we dont) and you CAN use deficit spending or even rank monetarization to do it and still avoid inflationary problems IF, and ONLY IF, it is used on projects that impart long term value on the economy that is on par or greater than the amount spent.\nI would argue that this is an impossibility. The only time this kind of worked was after WWII when we accidentally created an infrastructure. It wasn't build by a government project though but by private industry with the government being the customer. We also invented some nice technology that we could produce...and were half-way producing...in the US. A lucky break that could never be duplicated on purpose. \n \n I see your point if you want to get into reality than this 825 billion plan will fail without question. Giving someone $7,500 for buying a house doesn't cause a factor to start producing some magic product...it allows them to buy a slightly more expensive house so they can foreclose on it. Giving money to schools for better computers helps Taiwan I guess but not so much the USA. \n \n The plan is silly and no better than the Bush stimulus packages. \n \n I'd also like to point out again (back to perfect world) that a \"stimulus\" package for purpose of helping the economy has never succeeded in the history of humanity...not just the US. If you argue WWII helped out than that was an accident stimulus (and I debate whether the spending helped here)...we weren't trying to do it, we were trying to win a war.", 
   {}, 
   341807, 
   null, 
   1233007320.0
  ], 
  [
   341820, 
   null, 
   "daewoo", 
   "\n I would argue that this is an impossibility. The only time this kind of worked was after WWII when we accidentally created an infrastructure. It wasn't build by a government project though but by private industry with the government being the customer. We also invented some nice technology that we could produce...and were half-way producing...in the US. A lucky break that could never be duplicated on purpose. \n \n I see your point if you want to get into reality than this 825 billion plan will fail without question. Giving someone $7,500 for buying a house doesn't cause a factor to start producing some magic product...it allows them to buy a slightly more expensive house so they can foreclose on it. Giving money to schools for better computers helps Taiwan I guess but not so much the USA. \n \n The plan is silly and no better than the Bush stimulus packages. \n \n I'd also like to point out again (back to perfect world) that a \"stimulus\" package for purpose of helping the economy has never succeeded in the history of humanity...not just the US. If you argue WWII helped out than that was an accident stimulus (and I debate whether the spending helped here)...we weren't trying to do it, we were trying to win a war.\n\n \n I don't think it is fair to say we \"accidentally\" ended up with infrastructure after WWII. When the government was handing out money to build wartime production facilities they required that a plan be in place to convert the facility to peace time production when the war was over.\n \n That said, what really fixed the US economy was not the government spending, it was the fact that Europes entire industrial infrastructure was destroyed. After the war we gave them a big loan to get them started, engineered brenton woods agreement to ensure that the money we were repaid with would have some value, and then basically commenced to replace all of Europe with our factory output. \n \n So, it was not exactly an accident, but it certainly was not something we can re-create unless we want to bomb the hell out of Europe. Even that would probably not work because they would buy all their replacements stuff from the Chinese. \n \n You have options in the middle of a world war that do not generally exist.\n \n That does not mean that starting another world war is a good idea (though I know that is being floated as an idea in some quarters) because quite frankly we would probably lose. We won WWII with our manufacturing capability and prowess. We could produce tanks and ships and bullets and planes twice as fast as the enemy. Today we lack that, and, in fact, we cannot even replace most of our equipment without imports from Taiwan and Japan. \n \n Also, the war in Iraq has exposed a serious weakness in the way our military is structured. For a long time now we have bought better hardware in order to make up for the poor quality of our recruits. The war in IRaq has shown us that if you take a piece of ignorant trailer trash and stick him a $40 million tank, he is still just a piece of ignorant trailer trash and he still does the same stupid stuff, he just breaks a $40 million tank while doing it.", 
   {}, 
   341818, 
   null, 
   1233008460.0
  ], 
  [
   341847, 
   null, 
   "Steeeeve", 
   "I don't think it is fair to say we \"accidentally\" ended up with infrastructure after WWII. When the government was handing out money to build wartime production facilities they required that a plan be in place to convert the facility to peace time production when the war was over.\nI had not read this as an incentive. I know they basically guaranteed a profit for companies and helped pay for the conversion to tanks which gave the companies a huge increase in profits and actually made them operate above the 50% they were operating at prior to the war (good job New Deal!). Combine with with the banning of every household good and basically you have a large demand at the end of the war. This is what I mean by accidental. If you can't by a waffle iron for 5 years I'd say the demand would be high at the end of those 5 years. The WPB was in charge of limiting the use of products outside of war production and making sure the economy was good but I don't' recall it being anymore than making sure it didn't collapse during the war. I could be wrong though.\n \n\n That said, what really fixed the US economy was not the government spending, it was the fact that Europes entire industrial infrastructure was destroyed. After the war we gave them a big loan to get them started, engineered brenton woods agreement to ensure that the money we were repaid with would have some value, and then basically commenced to replace all of Europe with our factory output. \nAnd, like I said, the fact that no one could buy normal products for years. Exports and Imports didn't change much after the war.\n \n So, it was not exactly an accident, but it certainly was not something we can re-create unless we want to bomb the hell out of Europe. Even that would probably not work because they would buy all their replacements stuff from the Chinese. \n \n \nWe won WWII with our manufacturing capability and prowess. We could produce tanks and ships and bullets and planes twice as fast as the enemy. Today we lack that, and, in fact, we cannot even replace most of our equipment without imports from Taiwan and Japan. \nWasn't there some evidence that showed the patriotism of the country actually helped out with this?\n \n \nAlso, the war in Iraq has exposed a serious weakness in the way our military is structured. For a long time now we have bought better hardware in order to make up for the poor quality of our recruits. The war in IRaq has shown us that if you take a piece of ignorant trailer trash and stick him a $40 million tank, he is still just a piece of ignorant trailer trash and he still does the same stupid stuff, he just breaks a $40 million tank while doing it.\nIt worked in Vietnam didn't it? emoticon_frazzled", 
   {}, 
   341820, 
   null, 
   1233015300.0
  ], 
  [
   341852, 
   null, 
   "daewoo", 
   "I had not read this as an incentive. I know they basically guaranteed a profit for companies and helped pay for the conversion to tanks which gave the companies a huge increase in profits and actually made them operate above the 50% they were operating at prior to the war (good job New Deal!). Combine with with the banning of every household good and basically you have a large demand at the end of the war. This is what I mean by accidental. If you can't by a waffle iron for 5 years I'd say the demand would be high at the end of those 5 years. The WPB was in charge of limiting the use of products outside of war production and making sure the economy was good but I don't' recall it being anymore than making sure it didn't collapse during the war. I could be wrong though.\n \n\n \n Very few of the new facilities that were built during the war (as opposed to converted) we private facilities. They were actually owned and constructed by the government and then lent to companies for production. They were ALL designed with civilian applications in mind because (thankfully) somebody in the government was smart enough to recognize that the war would eventually be over and if all those buildings were purpose built, they would be useless. \n \n \nAnd, like I said, the fact that no one could buy normal products for years. Exports and Imports didn't change much after the war.\n\n \n This is a lot of the reason that comparisons between WWII and today are pretty useless. The circumstances are so radically different that they are really not comparable. \n \n \nWasn't there some evidence that showed the patriotism of the country actually helped out with this?\n\n \n Yes and no. Patriotism does encourage people at home to work hard and sacrifice for the war effort, but without the manufacturing infrastructure in place they may as well sit in a field and yell \"go america\". \n \n Frankly I think that blind patriotism is part of the PROBLEM today. It has kept people from anything resembling an honest assessment of where our nation is at financially and the possible repercussions of that. \n \n Americans swagger aroudn and talk about how great our country is, but consider this. In the same amount of time it took us to build 4500 stryker vehicles, a vehicle that was already a mature design with production facilities in place, we designed, built production facilities for, produced, and deployed roughly 20,000 sherman tanks. \n \n People saw it as a challenge to the country and they stepped up to try to meet it. Today we are so arrogant and so complacent that we wave our hand at challenges and go \"It does not matter because this is America and we dont have to worry about that ####\".\n \n Bad news. YES, we do. \n \n \nemoticon_xgood\n", 
   {}, 
   341847, 
   null, 
   1233017760.0
  ], 
  [
   341857, 
   null, 
   "Steeeeve", 
   "Very few of the new facilities that were built during the war (as opposed to converted) we private facilities. They were actually owned and constructed by the government and then lent to companies for production. They were ALL designed with civilian applications in mind because (thankfully) somebody in the government was smart enough to recognize that the war would eventually be over and if all those buildings were purpose built, they would be useless. \nThey did lease a lot of buildings for next to nothing but remember that factories were already at 50% or less capacity so building new factories was not a huge cost...compared to what it could have been. I think it was the head of the WPB that directed all of this...again I wasnt aware of the payment for conversion after the war. All that conversion would be worthless if demand wasn't there. In the end it wasn't exactly direct government spending...it was more indirect by blowing up half the world and not letting anyone buy stuff for years. Oddly enough this is what brings people out of recession. You don't spend a dime for years and then when things settle down you spend some money and you get back on track.\n \n You can't give $500 to a guy that has no job and think he will make it last for years. That $500 won't even pay for the credit card debt.\n \n \nFrankly I think that blind patriotism is part of the PROBLEM today. It has kept people from anything resembling an honest assessment of where our nation is at financially and the possible repercussions of that. \n \n Americans swagger aroudn and talk about how great our country is, but consider this. In the same amount of time it took us to build 4500 stryker vehicles, a vehicle that was already a mature design with production facilities in place, we designed, built production facilities for, produced, and deployed roughly 20,000 sherman tanks. \n \n People saw it as a challenge to the country and they stepped up to try to meet it. Today we are so arrogant and so complacent that we wave our hand at challenges and go \"It does not matter because this is America and we dont have to worry about that ####\".\n \n Bad news. YES, we do.\nIT could be argued that those folks really aren't patriotic but more like paris hilton. They think they are great but have no idea what you really have.", 
   {}, 
   341852, 
   null, 
   1233020940.0
  ], 
  [
   341881, 
   null, 
   "daewoo", 
   "They did lease a lot of buildings for next to nothing but remember that factories were already at 50% or less capacity so building new factories was not a huge cost...compared to what it could have been. I think it was the head of the WPB that directed all of this...again I wasnt aware of the payment for conversion after the war. All that conversion would be worthless if demand wasn't there. In the end it wasn't exactly direct government spending...it was more indirect by blowing up half the world and not letting anyone buy stuff for years. Oddly enough this is what brings people out of recession. You don't spend a dime for years and then when things settle down you spend some money and you get back on track.\n \n You can't give $500 to a guy that has no job and think he will make it last for years. That $500 won't even pay for the credit card debt.\n\n \n What? You dont think the extra $10 per paycheck is going to change peoples lives and pull us out of this?? \n \n \nIT could be argued that those folks really aren't patriotic but more like paris hilton. They think they are great but have no idea what you really have.\n\n \n Exactly. And it seems like far too many are proud of stuff that quite frankly is dumb. \n \n To anybody who did not know, I am sorry to be the one to clue you in, but being proud of your military is idiotic. Anybody can have a military just as good as ours if they are willing to spend the money. Fortunately (for them), most are too smart to blow all their national wealth on non value added military spending. \n \n The US was not made great by blind patriotism and random cheering. Frankly we should all be ashamed of ourselves and I can virtually promise that previous generations would be. For generations this country was built by people who were willing to work hard not just to provide for themselves, but to provide something better for the next generation. The last couple of generations have done the exact opposite. The greatest generation spawned the most worthless generation, which then cloned itself. \n \n Instead of working to improve the country for future generations, we have quite literally stolen all their money and saddled them with a debt that they cannot possibly pay. NOBODY actually believes that the steps beign taken will actually FIX the problem. They are all about trying to figure out how to steal enough from our kids to get us past this and keep us living high on the hog until we are old enough that they get stuck with the problem.", 
   {}, 
   341857, 
   null, 
   1233026400.0
  ], 
  [
   341899, 
   null, 
   "chester", 
   "\n To anybody who did not know, I am sorry to be the one to clue you in, but being proud of your military is idiotic. Anybody can have a military just as good as ours if they are willing to spend the money. Fortunately (for them), most are too smart to blow all their national wealth on non value added military spending. \n\n \n TRUTH!!\n \n As you say, money spent on the military is gone; it adds no value to the economy.\n \n Then again, we were warned by good old Republican President Eisenhower about the danger of the power of the Military/Industrial Complex way back in 1961.", 
   {}, 
   341881, 
   null, 
   1233029760.0
  ], 
  [
   341996, 
   null, 
   "Ohioprof", 
   "Right, but the only way to make it work is to continue the increase in spending, that was my point. As we have seen and you agree with, the moment the funding stops the economy goes right back into recession. It is also debatable whether we were even out of a recession when the spending is on going. The New Deal was happening and the recession wasn't over. The recession in the 80s had no relationship to government spending (in terms of trying to solve it).\n \n Keynes theory is about as accurate as trickle down economics. It sounds good in theory but doesn't work and never will.\n \n I understand the purpose, you have a bad habit of describing how something works instead of arguing whether or not it does work. I'm not stupid.\n \n I am arguing that it doesn't jump start the car. If you want to use the analogy it would be like jumping a completely dead car battery. You might get the engine started for a second but you will have to replace the battery before the car will go anywhere. Even getting the car started for a second is debatable.\n \n It was the government spending that led to the demand...but by flattening the rest of the industrialized nations. The demand had nothing to do with employing people because after WWII people weren't employed by the federal government (war is over) and it wasn't like they got a big check when they came home and spent it. Remember we were in a mini recession after WWII for 2-3 years. People got jobs when manufacturing was needed after the war. The government was buying this stuff...at least not the US. It was US citizens and foreign nations. All of this was unrelated to the war and to government spending. \n \n In your defense, we did build some great infrastructure during that time that allowed for extreme business growth...so in that sense the government spending helped but this was mostly paid for without debt and would be worthless without the main cause of economic recovery. In other words, you can't go out and build interstates anytime you want and think the economy will go nuts.\n \n Nothing I've seen supports this. While having no other countries functioning helped us, we didn't have a huge trade surplus which is what you are arguing the government created. \n \n You talk about the Marshall Plan, well that wasn't during a period of US economic recession...at least most of it wasn't. This is largely irrelevant. \n \n \n One trap you can fall into is assuming a truth and finding a way to get that answer. For example we can do bailouts over and over and over until the economy gets better and then everyone will say it was the bailouts and it took \"# of bailouts x $\" to get the economy going again when you really don't have any correlation. We have already done a few stimulus packages and those failed. Japan tried them in the 90s and that failed. The New Deal failed. We have had recessions recover is 1-2 years with no stimulus packages. \n \n There is just no relation to government spending and economic recovery. Keynes is wrong.\n\n \n I simply disagree with you that Keynes was wrong, and I disagree with you that the economic recovery from the Great Depression had nothing to do with government spending. Government spending directly produced the recovery. \n \n You have argued, as I understand your posts, that government spending does not work to bring recovery because once the government infusion of money stops, the economy slumps back into recession. My argument to you is that this may or may not be true, depending on whether the government spending is sufficient to pump up consumption to the point where the consumption can revive private industry and get it growing again. In the \"Roosevelt Recession\" of 1937, FDR cut the budget in an effort to balance it, thinking that he should not continue deficit spending, despite what Keynes had told him. The economy slumped back into recession, and it sank to levels almost as low as in 1933, the worst year. When FDR increased the government spending again, the economy went back up. In the 1930s the government spending was never enough to really jump start the economy and keep it going, though New Deal spending did help the economy to some extent. The problem was that the spending was insufficient to trigger ongoing recovery, because people were not at a level where they could consume sufficiently so they could sustain an economic recovery. New Deal spending was a step in right direction, but the economy had sunk so low that the jolt of New Deal spending was not sufficient to produce consumption that sustained economic growth. World War II spending was sufficient, indeed more than sufficient. And as you yourself point out, the minor recession after World War II was just that: a minor recession. People had money to spend, because they had paychecks from the military and from doing war production paid for by the government. There was pent up demand that resulted from the massive government war spending. \n \n The Marshall Plan, by rebuilding the economies of Europe, created trading partners and consumers of American products abroad. This was not a jump start to the U.S. economy, which was no longer in a depression, but this government spending on economies abroad helped to sustain American prosperity over time. \n \n The question of whether giving an individual a temporary job will help the economy has to be understood in terms of the economy as a whole. Giving one person a temporary job is not going to boost the U.S. economy. Giving a million people temporary jobs probably will boost the U.S. economy. The key is whether the boost triggers ongoing economic growth, by relighting the fire of consumption and thus reviving the private sector. This happened after World War II, as people had money from government spending that they were eager to spend on consumer goods. \n \n You can't have demand if people don't have any money to spend. Conservatives argue that we should give people money to spend by cutting taxes. In theory that does the same as government spending, except that it doesn't promote enough consumption to revive an economy that is in the doldrums. It's not strong enough medicine. People don't always spend their tax cut money, and people who are most in need of goods to purchase and are most likely to consume usually don't pay that much in taxes in the first place. Obama's stimulus bill contains significant tax cuts, probably too much in the way of tax cuts, which are not going to work. Government spending is the strongest medicine, the medicine our economy needs at this point. \n \n Here is a link to an interesting article in today's NYTimes about FDR and government spending. It addresses what we have been talking about. http://www.nytimes.com/2009/01/27/business/economy/27fdr.html?pagewanted=1&hp", 
   {}, 
   341815, 
   null, 
   1233064560.0
  ], 
  [
   342004, 
   null, 
   "daewoo", 
   "What you and steeeve both seem to be missing is that what we are talking about here is not really Keynesian. Keynes argued that government should put back money during the good years to expand spending during the bad ones in order ot even out economic cycles. \n \n Have we put back money during our good years? Of course not. Even in our best years we cut taxes and run deficits. \n \n In order for Keynesian economics to work you also have to assume that the required infrastructure is in place for a recovery. Typically economic recoveries happen when the inventory of goods falls to meet demand, at which point new production comes online. Today that is not going to happen. First, we would have to build a bunch of factories (it has been estimated that we would have to spend roughly $4 trillion to bring our industrial infrastructure up to where it needs to be to support our economy) and second, even if we had all the infrastructure in place, we still cannot compete with the Chinese without a MASSIVE adjustment to wages, which would push is right back into recession or depression.", 
   {}, 
   341996, 
   null, 
   1233075120.0
  ], 
  [
   342006, 
   null, 
   "Ohioprof", 
   "What you and steeeve both seem to be missing is that what we are talking about here is not really Keynesian. Keynes argued that government should put back money during the good years to expand spending during the bad ones in order ot even out economic cycles. \n \n Have we put back money during our good years? Of course not. Even in our best years we cut taxes and run deficits. \n \n In order for Keynesian economics to work you also have to assume that the required infrastructure is in place for a recovery. Typically economic recoveries happen when the inventory of goods falls to meet demand, at which point new production comes online. Today that is not going to happen. First, we would have to build a bunch of factories (it has been estimated that we would have to spend roughly $4 trillion to bring our industrial infrastructure up to where it needs to be to support our economy) and second, even if we had all the infrastructure in place, we still cannot compete with the Chinese without a MASSIVE adjustment to wages, which would push is right back into recession or depression.\n\n \n Keynes did argue for running a surplus during periods of economic boom. We did that during the Clinton years; under Bill Clinton we had a surplus. The Bush administration ran up a huge deficit, which puts us in a tough position now, because we are going to have to run up the deficit much more.\n \n Recovery can happen when demand for goods increases, which is what government spending does: it increases demand. The same is supposed to be true for tax cuts, though tax cuts do not boost demand the way government spending does. If we think of the economy as global today, increasing aggregate demand will help the world economy to recover. The demand for goods produced in China will increase. \n \n I think there are opportunities in the United States for new kinds of enterprises, and government investment in promoting new enterprises will help to get them off the ground. That's a long term issue that we do need to address. The short term problem is the immediate economic downturn, and government spending can and must turn this around by boosting demand.", 
   {}, 
   342004, 
   null, 
   1233076140.0
  ], 
  [
   342018, 
   null, 
   "Steeeeve", 
   "I simply disagree with you that Keynes was wrong, and I disagree with you that the economic recovery from the Great Depression had nothing to do with government spending. Government spending directly produced the recovery. \n There is zero evidence of this! At best WWII indirectly helped but those are circumstances you can't reproduce.\n \n \nYou have argued, as I understand your posts, that government spending does not work to bring recovery because once the government infusion of money stops, the economy slumps back into recession.\n Just to clarify, my argument is that their is little evidence to support the government spending does anything hurt us more when the spending stops and it is debatable it helps us while we are getting the money. During the New Deal unemployment was ridiculously high...even at the end of it (15%).\n \n \nMy argument to you is that this may or may not be true, depending on whether the government spending is sufficient to pump up consumption to the point where the consumption can revive private industry and get it growing again. In the \"Roosevelt Recession\" of 1937, FDR cut the budget in an effort to balance it, thinking that he should not continue deficit spending, despite what Keynes had told him. The economy slumped back into recession, and it sank to levels almost as low as in 1933, the worst year. When FDR increased the government spending again, the economy went back up. \n That \"again\" is WWII and when it stopped what happened? The economy slumped again. As Daewoo and I have been discussing it may be that WWII indirectly helped with industry build up and combined with the fact that no one was producing anything helped us out. This is a rare set of circumstances that almost never exist...and don't today.\n \n \nIn the 1930s the government spending was never enough to really jump start the economy and keep it going, though New Deal spending did help the economy to some extent. The problem was that the spending was insufficient to trigger ongoing recovery, because people were not at a level where they could consume sufficiently so they could sustain an economic recovery. New Deal spending was a step in right direction, but the economy had sunk so low that the jolt of New Deal spending was not sufficient to produce consumption that sustained economic growth. World War II spending was sufficient, indeed more than sufficient. And as you yourself point out, the minor recession after World War II was just that: a minor recession. People had money to spend, because they had paychecks from the military and from doing war production paid for by the government. There was pent up demand that resulted from the massive government war spending. \nA minor recession is still a recession and 2 years is not great. Furthermore, lets say the WWII spending did pull us out. Do you realize the spending that took place during that time and what that would cost us today? Luckily taxes were sky high then and not too much debt was taken on but if that level of spending is needed to only make us have a minor recession after the spending ends than we are screwed. \n \n In any event, this isn't the case. We have had recessions where we didn't spend much more money (1990) and we did fine. We have had some where we lowered taxes and that did the same thing as doing nothing as well. There is no correlation between government spending an improving an economy. This is a correlation between massive amounts of debt/printed money and hyper inflation though.\n \n \nThe Marshall Plan, by rebuilding the economies of Europe, created trading partners and consumers of American products abroad. This was not a jump start to the U.S. economy, which was no longer in a depression, but this government spending on economies abroad helped to sustain American prosperity over time. \nIt wasn't that much (we were paid back for some if it too) and is still irrelevant to your point. You are arguing now that we should always do government spending and this isn't what Keynes said. I'd prefer to stay on topic. \n \n \nYou can't have demand if people don't have any money to spend. \nWhat happens if you print money so that everyone had a billion dollars. Will this increase demand or make the dollar worthless? See above for why WWII created a demand...it wasn't government spending directly.\n \n \nObama's stimulus bill contains significant tax cuts, probably too much in the way of tax cuts, which are not going to work. Government spending is the strongest medicine, the medicine our economy needs at this point. \nwe've had two stimulus packages so far and they didn't work. Japan did 10 or so in the 90s and none of them didn't work. The excuse is always \"it was never enough\" but apparently the only thing that is enough might be flattening half the world and depriving the other half of anything tangible for 5 years while building massive amounts of factories.\n \n This theory is just like \"trickle down economics\"...it doesn't work but everyone still believes in it.", 
   {}, 
   341996, 
   null, 
   1233082380.0
  ], 
  [
   342019, 
   null, 
   "Steeeeve", 
   "What you and steeeve both seem to be missing is that what we are talking about here is not really Keynesian. Keynes argued that government should put back money during the good years to expand spending during the bad ones in order ot even out economic cycles. \n \n Have we put back money during our good years? Of course not. Even in our best years we cut taxes and run deficits. \n \n In order for Keynesian economics to work you also have to assume that the required infrastructure is in place for a recovery. Typically economic recoveries happen when the inventory of goods falls to meet demand, at which point new production comes online. Today that is not going to happen. First, we would have to build a bunch of factories (it has been estimated that we would have to spend roughly $4 trillion to bring our industrial infrastructure up to where it needs to be to support our economy) and second, even if we had all the infrastructure in place, we still cannot compete with the Chinese without a MASSIVE adjustment to wages, which would push is right back into recession or depression.\n\n I'm fully aware it isn't the exact theory he posed but neither is \"supply side economics\" talked about correctly when it is discussed here.\n \n In any event, the theory is irrelevant because we treat it like \"trickle down\"...we think it is godlike but in the end it is nothing more than a inflation tool.", 
   {}, 
   342004, 
   null, 
   1233082560.0
  ], 
  [
   342021, 
   null, 
   "Steeeeve", 
   "Keynes did argue for running a surplus during periods of economic boom. We did that during the Clinton years; under Bill Clinton we had a surplus. \n This isn't exactly true. We had better spending habits but the debt went up every year under Clinton and we never ran a surplus...you have been fooled by Cash basis accounting. Clinton also delayed a lot of expenses which was no good. Was this better than Bush's spending habits? Yes. Did they still stink? Yes.", 
   {}, 
   342006, 
   null, 
   1233083040.0
  ], 
  [
   342029, 
   null, 
   "daewoo", 
   "Keynes did argue for running a surplus during periods of economic boom. We did that during the Clinton years; under Bill Clinton we had a surplus. The Bush administration ran up a huge deficit, which puts us in a tough position now, because we are going to have to run up the deficit much more.\n\n \n He did not just advocate running a surplus, he advocated running a surplus and building reserves, which we did not do during the Clinton years because our surplus was nothing but an accounting trick and the surplus was built on the false prosperity of the dot com bubble. \n \n \nRecovery can happen when demand for goods increases, which is what government spending does: it increases demand. The same is supposed to be true for tax cuts, though tax cuts do not boost demand the way government spending does. If we think of the economy as global today, increasing aggregate demand will help the world economy to recover. The demand for goods produced in China will increase. \n\n \n But, the increased demand from government spending is not sustainable, nor is it even helpful if you can not meet that demand domestically. That was the problem with Bushs stimulus package. Everybody got a nice check, but over 60% of the money spent on consumer goods ended up overseas. We ended up spending a fortune and got a bunch of consumer #### that started depreciating immediately. Our trading partners got a bunch of cash that is earning them interest or paying for expansion. \n \n \nI think there are opportunities in the United States for new kinds of enterprises, and government investment in promoting new enterprises will help to get them off the ground. That's a long term issue that we do need to address. The short term problem is the immediate economic downturn, and government spending can and must turn this around by boosting demand.\n\n \n No, they cant, because we do not have any means to meet that demand and increasing demand that just leads to exporting your national wealth is counterproductive. \n \n Buying things does not create wealth. Marking things up does not create wealth. Wealth is only created through the production of tangible goods. There is no other way. There never has been. That is one of the fundamental laws of the economic universe.", 
   {}, 
   342006, 
   null, 
   1233084360.0
  ], 
  [
   342041, 
   null, 
   "Ohioprof", 
   "He did not just advocate running a surplus, he advocated running a surplus and building reserves, which we did not do during the Clinton years because our surplus was nothing but an accounting trick and the surplus was built on the false prosperity of the dot com bubble. \n \n \n \n But, the increased demand from government spending is not sustainable, nor is it even helpful if you can not meet that demand domestically. That was the problem with Bushs stimulus package. Everybody got a nice check, but over 60% of the money spent on consumer goods ended up overseas. We ended up spending a fortune and got a bunch of consumer #### that started depreciating immediately. Our trading partners got a bunch of cash that is earning them interest or paying for expansion. \n \n \n \n No, they cant, because we do not have any means to meet that demand and increasing demand that just leads to exporting your national wealth is counterproductive. \n \n Buying things does not create wealth. Marking things up does not create wealth. Wealth is only created through the production of tangible goods. There is no other way. There never has been. That is one of the fundamental laws of the economic universe.\n\n \n I agree with you that wealth is created through production. For that reason, the loss of production to nations overseas has indeed harmed the U.S. economy. However, it's wrong to suggest that the United States does not produce wealth or that industries in the United States are incapable of responding to increased demand. There are also prospects for American entrepreneurs to develop new industries, and I think our government should encourage this. That's for the long run. \n \n You seem to be making recommendations for long term economic growth, and that's important. My argument is about a short term stimulus to revive the economy. It can be done, because it has been done.", 
   {}, 
   342029, 
   null, 
   1233086880.0
  ], 
  [
   342050, 
   null, 
   "simone", 
   "I was merely riffing on what Daewoo said:\n \nWhat you and steeeve both seem to be missing is that what we are talking about here is not really Keynesian. Keynes argued that government should put back money during the good years to expand spending during the bad ones in order ot even out economic cycles....\n", 
   {}, 
   342004, 
   null, 
   1233091380.0
  ], 
  [
   342057, 
   null, 
   "Ohioprof", 
   "There is zero evidence of this! At best WWII indirectly helped but those are circumstances you can't reproduce.\n \n Just to clarify, my argument is that their is little evidence to support the government spending does anything hurt us more when the spending stops and it is debatable it helps us while we are getting the money. During the New Deal unemployment was ridiculously high...even at the end of it (15%).\n \n That \"again\" is WWII and when it stopped what happened? The economy slumped again. As Daewoo and I have been discussing it may be that WWII indirectly helped with industry build up and combined with the fact that no one was producing anything helped us out. This is a rare set of circumstances that almost never exist...and don't today.\n \n A minor recession is still a recession and 2 years is not great. Furthermore, lets say the WWII spending did pull us out. Do you realize the spending that took place during that time and what that would cost us today? Luckily taxes were sky high then and not too much debt was taken on but if that level of spending is needed to only make us have a minor recession after the spending ends than we are screwed. \n \n In any event, this isn't the case. We have had recessions where we didn't spend much more money (1990) and we did fine. We have had some where we lowered taxes and that did the same thing as doing nothing as well. There is no correlation between government spending an improving an economy. This is a correlation between massive amounts of debt/printed money and hyper inflation though.\n \n It wasn't that much (we were paid back for some if it too) and is still irrelevant to your point. You are arguing now that we should always do government spending and this isn't what Keynes said. I'd prefer to stay on topic. \n \n What happens if you print money so that everyone had a billion dollars. Will this increase demand or make the dollar worthless? See above for why WWII created a demand...it wasn't government spending directly.\n \n we've had two stimulus packages so far and they didn't work. Japan did 10 or so in the 90s and none of them didn't work. The excuse is always \"it was never enough\" but apparently the only thing that is enough might be flattening half the world and depriving the other half of anything tangible for 5 years while building massive amounts of factories.\n \n This theory is just like \"trickle down economics\"...it doesn't work but everyone still believes in it.\n\n \n The government spending of World War II quite obviously did stimulate the economy and produced economic recovery from the Great Depression. The war put Americans to work, and it instantly ended the labor surplus. Production soared. Workers had money to spend, but with the war, consumer production was largely replaced by war production, and that left consumers with pent-up demand. You have argued that the recovery was only temporary, and once the war ended the economy slumped again. My argument is that the economy did slump a little bit, but we certainly did not return to the Great Depression. The post-war era became an era of prosperity. Your response to that, as I understand it, is that we did not return to the Great Depression because there was new demand for American products, and the circumstances that existed at the end of the war do not exist today. It's certainly true that the circumstances then do not exist today. The world has changed, and the U.S. position in the world has changed. The world will never be like it was in 1945. But the government spending on World War II did jump start the economy very directly, and the economy never sank back into depression once the government spending declined. What produced the new demand for American products after the war was the spending of the U.S. government during the war, which put money into people's pockets to fuel demand. That pent-up demand during the war resulted in consumption after the war. Also after the war, the U.S. government spent money to rebuild Europe, which promoted trade and generated demand for American products abroad. \n \n I have expressly NOT argued that we should always use government spending to aid the economy. Keynes himself argued against this, and there is good reason not use government spending to micro-manage an economy. I have argued that, as Keynes argued, we should use government spending as a short-term means of pulling the economy out of a deep recession or a depression, and we should run a surplus in times of prosperity. I think tax cuts do not work very effectively to stimulate the economy, and I frankly think that the Obama stimulus plan has too much in the way of tax cuts, which should be eliminated.\n \n We will probably always have recessions so long as we have a capitalist economy. Government counter-cyclical spending will not eliminate recessions, though it can and it had softened them. We have had recessions since the Great Depression. I fear that right now we face something different. I fear that we face a potentially devastating depression that I hope we can head off. FDR was too slow to use government spending to address the Great Depression, partly because he didn't really know what to do, and so he tried various solutions, some of which didn't work. He tried the NIRA, and that was a failure, mostly because it raised prices without raising people's incomes and without thus enabling them to buy the products of industry. The NIRA also produced business cartels that undermined competition and promoted the tendency toward monopoly. It was good that the Supreme Court struck the NIRA down. FDR never entirely embraced the Keynesian spending solution, though during the second New Deal he moved in that direction by creating programs that put money into the pockets of ordinary people, like the WPA. He thus moved, without embracing Keynes' ideas, in a Keynesian direction. \n \n I think there are two separate concerns here. One is short-term economic recovery, and the second is long-term economic policy that will benefit the American people and nation. These are related to each other, but they are not identical. In the short run, I think it is imperative that the government jump start the economy through spending, to create demand for goods. Long term reform and change will have to come afterwards, I think.", 
   {}, 
   342018, 
   null, 
   1233092640.0
  ], 
  [
   342077, 
   null, 
   "Steeeeve", 
   "The government spending of World War II quite obviously did stimulate the economy and produced economic recovery from the Great Depression. The war put Americans to work, and it instantly ended the labor surplus. Production soared. Workers had money to spend, but with the war, consumer production was largely replaced by war production, and that left consumers with pent-up demand. \nI don't argue that production didn't go up during WWII. It obviously did and people were employed as soldiers for the war. Innovations and production was so high because it was either that or be taken over. These weren't exactly government work programs, they were the government purchasing planes and tanks to win a war which caused industry to boom during the war. Of course this largely misses the point. After the war we had a bunch of factories and a bunch of families who weren't able to buy anything for years. In this sense the governments around the world created a demand simply by killing each other for a few years. This is obviously not normal circumstances. \n \n I wouldn't call this direct government spending though. The New Deal was direct government spending. WWII was meant to keep us from being taken over. It was the indirect consequences of a war that led to an economic boom a few years after the war. To get the same results today we would have to flatten China and bomb Europe into the stone age while ramping up manufacturing jobs and lowering wages. At the same time we also have to keep americans from purchasing anything for a few years. This isn't exactly a practical solution.\n \n \nYou have argued that the recovery was only temporary, and once the war ended the economy slumped again. My argument is that the economy did slump a little bit, but we certainly did not return to the Great Depression. The post-war era became an era of prosperity. Your response to that, as I understand it, is that we did not return to the Great Depression because there was new demand for American products, and the circumstances that existed at the end of the war do not exist today. It's certainly true that the circumstances then do not exist today. The world has changed, and the U.S. position in the world has changed.\nI'm saying the circumstances that allowed the prosperity are only indirectly related to government spending. I suppose if you could flatten Europe and China without spending a dime you would see incredible growth for us. Now I realize this will always take money but my point is...and I think Daewoo's point is...that it wasn't spending...it was the circumstances of the spending. That is a huge difference. In fact, I can't think of any other scenario where government spending could indirectly impact an economy like that. \n \n \nWhat produced the new demand for American products after the war was the spending of the U.S. government during the war, which put money into people's pockets to fuel demand. That pent-up demand during the war resulted in consumption after the war. Also after the war, the U.S. government spent money to rebuild Europe, which promoted trade and generated demand for American products abroad. \n Again, trade didn't change that much following the war. \n \n More importantly, it wasn't that more Americans had money...it was that no one had anything. Americans actually had money before the war. \n \n \nI have expressly NOT argued that we should always use government spending to aid the economy. Keynes himself argued against this, and there is good reason not use government spending to micro-manage an economy. I have argued that, as Keynes argued, we should use government spending as a short-term means of pulling the economy out of a deep recession or a depression, and we should run a surplus in times of prosperity. I think tax cuts do not work very effectively to stimulate the economy, and I frankly think that the Obama stimulus plan has too much in the way of tax cuts, which should be eliminated.\nI think you are missing my point in that Keynes says you can just spend your way out of a recession. This is never the case and has proven to be so with the New Deal, Japan, and the previous stimulus packages in the US. WWII was an indirect spending that created a demand by bombing and killing everything. \n \n In other words, Keynes can only be right if the circumstances of WWII are present....those of forcing a high demand by necessity. This is an impossibility in our current state and no matter what Obama spends it will not help. And yes, the tax cuts are dumb.\n \n \nHe thus moved, without embracing Keynes' ideas, in a Keynesian direction. \nThis is always an excuse for economic policies that don't work. People who like trickle down always say \"we didn't do enough and we didn't do it all the way\" as a justification for why it failed. In reality the most simply economic theory has always proven to be the best.\n \n All Obama is going to do is give us a nice inflation boost in 1-2 years (from estimates I read).", 
   {}, 
   342057, 
   null, 
   1233101280.0
  ], 
  [
   342085, 
   null, 
   "Ohioprof", 
   "So, Steeeve, what do you propose that our government do about the current economic downturn, if anything? \n \n Much of the problem we as a nation are having, I think, is one you have identified. Folks are looking to the past to try to figure out what to do now, and the circumstances are different now than they were in the 1930s. My own view is that history does not repeat itself, because circumstances are always different at different times. But we are, because of our flawed and impartial knowledge as humans, forced to look to the past to see what people did and to try to learn from it the best we can. I would not want to be President of the United States right now. President Obama has been reading about the New Deal, and he is trying to garner insight from FDR's efforts and experiences to apply to our efforts and experiences today. That is useful, but looking at the past means looking at a world that was different from today, a world that is gone forever. We can learn from the past, gain insights into what policies may succeed, but we must never confuse the past with the present, as you have pointed out. \n \n I do think, as I have said, that we should use government spending to give the economy a jump start. Do I know for certain that this jump start will revive the private sector enough to foster ongoing growth that brings renewed prosperity? No, I don't know that. I don't know what is going to happen, and neither does anyone else. Like FDR, we are engaged in an experiment; we are trying government spending as economic stimulus and hoping it works to pull us out of recession/depression as it did in World War II. Do we know it will work? No. But as FDR said in the worst year of the Great Depression, \"We have to try something!\"\n \n (This discussion brings up an interesting distinction between historians and economists. Economists develop predictive theories about economic activity, theories that they see as explaining economic activity in different times. Historians usually do not develop predictive theories, because we regard each time and place as sui generis, as unique. We seek to honor the pastness of the past. But for government leaders and policy makers, a look at the past becomes essential for making decisions about the present, just as consideration of economic theories is essential for making decisions about the present.)", 
   {}, 
   342077, 
   null, 
   1233106080.0
  ], 
  [
   342094, 
   null, 
   "Steeeeve", 
   "So, Steeeve, what do you propose that our government do about the current economic downturn, if anything? \nStay out of it. Doing nothing is a method never tried on purpose.", 
   {}, 
   342085, 
   null, 
   1233108180.0
  ], 
  [
   342107, 
   null, 
   "T.Q", 
   "Stay out of it. Doing nothing is a method never tried on purpose.\n\n \n Ever see a president lynched? lol\n \n Not that you're wrong, that is (from what I've read) exactly what needs to be done. Can you imagine the uproar though?\n \n Press conference:\n \"Mr. President, what do you plan to do about the current economic crisis?\"\n Obama shrugs, \"Nothing. Tighten your belts and suck it up.\"", 
   {}, 
   342094, 
   null, 
   1233110760.0
  ], 
  [
   342124, 
   null, 
   "Ohioprof", 
   "Stay out of it. Doing nothing is a method never tried on purpose.\n\n \n Two points. First, doing nothing is as much of a gamble as taking action. Sure, there are economists who will insist that a market economy will eventually come back on its own if the government does nothing, just as there are economists who insist that the government must act decisively to bring an economy back. We cannot see the future, and while the government does nothing, people will suffer. And we do not know that the economy will bounce back on its own, nor do we know when this may happen. Worshipping the god of the \"free market\" may be worshipping a false god. I suspect it is. \n \n Second, doing nothing would not be politically acceptable. Even Herbert Hoover, who is often inaccurately portrayed as doing nothing, used government action to try to bring the economy back. Under great pressure, he even created some public works programs, though to a limited extent. But the depression grew too deep, and the limited efforts he undertook were not enough to stop the downward slide. A problem with government doing nothing or government doing relatively little is that people elect our leaders, and people expect our government to act in times of crisis and widespread distress. \n \n In times of economic decline, the downward slide of the economy fuels itself. Manufacturers cut back production because of reduced demand. As they do so, they are forced to lay off workers, which we are seeing now. As the workers are laid off, they are unable to consume as much, which further reduces demand. \n \n How will this slide be reversed if government does nothing?", 
   {}, 
   342094, 
   null, 
   1233148380.0
  ], 
  [
   342125, 
   null, 
   "Ohioprof", 
   "Here are some more of my musings on this topic. \n \n When we look back in American history to try to find examples of the federal government doing nothing to respond to past depressions, we don't find the government doing nothing even in the depression of 1893, which lasted for nearly the entire decade, with some upturns and then downturns. This depression was horrible, and it produced violent strikes and much popular unrest and suffering. The following paragraph is from an excellent book on the depression of 1893. It is entitled Democracy in Desperation: The Depression of 1893, by Douglas Steeples (historian) and David Whitten (economist):\n \n \"The eruption of political upheavals from 1893 on, far-flung labor strife in 1894, and traumatic social ferment throughout the era impelled people to look, even in a time of limited government, for remedial public action. Deepening crisis demanded replies that only government had the resources to make. Responses involved every level of public authority from local through national, and they extended from fiscal retrenchment and relief for the jobless to controversial steps in national finance, diplomatic measures, and innovations in national business labor policy.\"\n \n These scholars argue that the depression of the 1890s forced government on all levels to act, though the government action was somewhat confused and contradictory. The depression of the 1890s brought about much public pressure for government intervention in the economy, to address the widespread suffering and unrest. I will argue that the new progressive movement had a great impact on subsequent social, political, and economic changes. I see the progressive movement as largely resulting from this terrible depression in the 1890s, and the progressive movement, embraced by Theodore Roosevelt, successfully and sometimes unsuccessfully pushed for government intervention in the economy. The progressive movement of the early 20th century was the precursor to the New Deal activism of the 1930s. It emerged as a significant movement in response, I think, to the depression that began in 1893. \n \n So even if we go back to the depression of 1893, we don't find the government doing nothing to respond to the crisis. Nor did most people want the government to do nothing.", 
   {
    "unicode_changes_made": true
   }, 
   342124, 
   null, 
   1233150300.0
  ], 
  [
   342156, 
   null, 
   "Steeeeve", 
   "Two points. First, doing nothing is as much of a gamble as taking action. Sure, there are economists who will insist that a market economy will eventually come back on its own if the government does nothing, just as there are economists who insist that the government must act decisively to bring an economy back. We cannot see the future, and while the government does nothing, people will suffer. And we do not know that the economy will bounce back on its own, nor do we know when this may happen. Worshipping the god of the \"free market\" may be worshipping a false god. I suspect it is. \nWell we haven't seen a system with no government intervention during modern times. There does seem to be evidence that government intervention doesn't help. It was the government trying to play with things that helped this recession and the Federal Reserve, who is unchecked, will probably be the cause of future problems. \n \n The argument that people are suffering isn't a good one. Recessions happen no matter what and people will suffer during them but I do not think it is wise to hurt everyone in the future for the benefit of a few today...assuming it really does help them (which it won't). It is better for people to take the consequences of their actions.\n \n \nSecond, doing nothing would not be politically acceptable.\n This is obvious. In fact it is political suicide.\n \n \nIn times of economic decline, the downward slide of the economy fuels itself. Manufacturers cut back production because of reduced demand. As they do so, they are forced to lay off workers, which we are seeing now. As the workers are laid off, they are unable to consume as much, which further reduces demand. \n \n How will this slide be reversed if government does nothing?\nThis is simple. Once the economy adjusts to its actual worth than people will spend again and demand will be back to what it should be. Recessions happen when things are overvalued. For example our houses are overvalued. It would be idiotic to try and keep them overvalued as you just risk a bigger collapse. Once they adjust to the correct price people will buy them again.\n \n \nSo even if we go back to the depression of 1893, we don't find the government doing nothing to respond to the crisis. Nor did most people want the government to do nothing.\nI don't find this relevant. What is relevant is what makes the most sense. Economics works much like any force of nature...it will force you to comply with how it works. The economy has to adjust itself when things get out of hand...like a flood to clean a river. So it is better to just let the economy do its thing and have prices adjust to true levels. \n \n It would be nice it someone came along and developed a way to do nothing while making it look like you are doing something.", 
   {}, 
   342124, 
   null, 
   1233167100.0
  ], 
  [
   342183, 
   null, 
   "Ohioprof", 
   "Well we haven't seen a system with no government intervention during modern times. There does seem to be evidence that government intervention doesn't help. It was the government trying to play with things that helped this recession and the Federal Reserve, who is unchecked, will probably be the cause of future problems. \n \n The argument that people are suffering isn't a good one. Recessions happen no matter what and people will suffer during them but I do not think it is wise to hurt everyone in the future for the benefit of a few today...assuming it really does help them (which it won't). It is better for people to take the consequences of their actions.\n \n This is obvious. In fact it is political suicide.\n \n This is simple. Once the economy adjusts to its actual worth than people will spend again and demand will be back to what it should be. Recessions happen when things are overvalued. For example our houses are overvalued. It would be idiotic to try and keep them overvalued as you just risk a bigger collapse. Once they adjust to the correct price people will buy them again.\n \n I don't find this relevant. What is relevant is what makes the most sense. Economics works much like any force of nature...it will force you to comply with how it works. The economy has to adjust itself when things get out of hand...like a flood to clean a river. So it is better to just let the economy do its thing and have prices adjust to true levels. \n \n It would be nice it someone came along and developed a way to do nothing while making it look like you are doing something.\n\n \n I disagree that economics works like a force of nature. Economies are made up by humans; they are social creations. The idea that economics is like nature is a myth. It's been a popular myth, embraced by social Darwinists in the past. And I think it's wrong. There is nothing in nature that says that governments should not be actively involved in economies. Indeed, there is nothing in nature that dictates that economies should be capitalist. We humans created capitalism, and we humans can and have changed capitalism over time. It's just as natural to involve governments in capitalist economies as it is to say that governments should keep hands off. Indeed, in recent memory governments everywhere have been involved in regulating and influencing capitalist economies. Government involvement has kept capitalist economies from collapsing during severe downturns. \n \n Your argument appears to be the position advanced by what have been called the New Classical Economists. They argued in the 1970s that wages and prices are flexible and that prices adjust quickly to balance supply and demand. The New Classical Economists were answered by the New Keynesian Economists. They argued in the 1980s that both prices and wages are sticky and this stickiness, or slowness of wages and prices to adjust, is what leads to involuntary unemployment. The New Keynesians also pointed to other problems that have interfered with market adjustments in the classical economic model. \n \n In recent decades a new synthesis has emerged, bringing together ideas of New Classical Economists and New Keynesian Economists. The new synthesis embraces the view that over the long run, markets tend to behave according to the new classicial theory, while in the short run, markets experience the sticky prices and wages and other market imperfections described by the New Keynesian Economists. Because of these short run problems like sticky prices and wages, proponents of this new synthesis often argue for government intervention to counter downturns, meaning counter-cyclical fiscal or monetary policies promoted by the New Keynesians. \n \n It was Keynes' view that we live in the short run, and governments should address the short run problems that beset capitalist economies, through counter-cyclical spending. Remember Keynes' famous quote, \"In the long run we are all dead.\" Human suffering occurs in the short run when an economy sinks into depression or a deep recession. When he took office in 1933, FDR feared that the suffering and popular anger were so intense, there could be a revolution. He feared that simply waiting for the markets to adjust themselves in the long run could have led suffering people to organize and foment a revolution. People do not elect leaders to do nothing while the people suffer. That's the political reality, and economic policy cannot be divorced from political reality.", 
   {}, 
   342156, 
   null, 
   1233170940.0
  ], 
  [
   342195, 
   null, 
   "simone", 
   "Stay out of it. Doing nothing is a method never tried on purpose.\n\n Isn't that what Hoover did?\n \n On the advice of his treasury secretary Andrew Mellon?\n \nThe inaction of the United States government during the 1929-33 slide into the Great Depression is both astonishing and puzzling when viewed from any of the perspectives held today. All points of view today hold that governments should strive to provide a stable environment in which the private economy can operate, and should do this by keeping some broad nominal aggregate measure of spending or liquidity on a stable growth path. For monetarist economists, the measure to be stabilized is some definition of the nominal money supply.\n \n ....Contemplating in retrospect the wreck of his country's economy and his own presidency, Herbert Hoover wrote bitterly in his memoirs about those who had advised inaction during the downslide:\n \n \"The 'leave-it-alone liquidationists' headed by Secretary of the Treasury Mellon ... felt that government must keep its hands off and let the slump liquidate itself. Mr. Mellon had only one formula: 'Liquidate labor, liquidate stocks, liquidate the farmers, liquidate real estate'....He held that even panic was not altogether a bad thing. He said: 'It will purge the rottenness out of the system. High costs of living and high living will come down. People will work harder, live a more moral life. Values will be adjusted, and enterprising people will pick up the wrecks from less competent people'.\"\n\n http://econ161.berkeley.edu/pdf_files/Liquidation_Cycles.pdf", 
   {
    "unicode_changes_made": true
   }, 
   342094, 
   null, 
   1233174720.0
  ], 
  [
   342197, 
   null, 
   "Steeeeve", 
   "I disagree that economics works like a force of nature. Economies are made up by humans; they are social creations. The idea that economics is like nature is a myth. \n It works like a force of nature because people generally follow certain trends of behavior. There are many things humans do that you could say are forces of nature because they are behavior trends. \n \n \nIt's been a popular myth, embraced by social Darwinists in the past. And I think it's wrong. There is nothing in nature that says that governments should not be actively involved in economies. Indeed, there is nothing in nature that dictates that economies should be capitalist. We humans created capitalism, and we humans can and have changed capitalism over time. It's just as natural to involve governments in capitalist economies as it is to say that governments should keep hands off. Indeed, in recent memory governments everywhere have been involved in regulating and influencing capitalist economies. Government involvement has kept capitalist economies from collapsing during severe downturns. \nI don't think Darwin has anything to do with this..it is mere behavior patterns. Basically humans are selfish and this is why capitalism is a means to work with this inherent flaw. Capitalism says you can't have me build you house in return for you giving me a pie. It comes down to worth of things as perceived by humans but even this is fairly standard. Worth is seen in rarity, effort, and a few other things and it would show that a house is worth more than a pie. With other types of economic systems you try to go against this trend but fixing worth. I believe what happens with this is that eventually capitalism will prevail and the item that is fixed in worth will eventually come down to that level or up to that level (such as by change in quality). This happens because someone will feel like they get the rare end of the deal and will adjust accordingly. \n \n So my point is that capitalism is nothing more than saying \"let people act naturally\" while socialism and communism so \"lets try to control nature actions\". I happen to think that nature actions will prevail if you try to control them...or rather they will adjust to the control. \n \n \nYour argument appears to be the position advanced by what have been called the New Classical Economists. They argued in the 1970s that wages and prices are flexible and that prices adjust quickly to balance supply and demand. \nNo, I don't take their position because I think they believe everyone is \"rational\". I believe people are predictable...but not always rational. Because of this the balance of supply and demand may not quickly adapt but in the long run will. \n \n The thing about government spending is that it tries to stop and adjustment from happening (such as home price falling). It stops the natural flow of things and it isn't a matter of trying to make supply and demand come back in balance more quickly....it just can't do this.", 
   {}, 
   342183, 
   null, 
   1233175140.0
  ], 
  [
   342204, 
   null, 
   "Steeeeve", 
   "Isn't that what Hoover did?\n \n On the advice of his treasury secretary Andrew Mellon?\n \n http://econ161.berkeley.edu/pdf_files/Liquidation_Cycles.pdf\n\n \n Mellon kind of did this. Keep in mind Mellon was around for almost all of the 20s and it could be argued that he helped some of the \"roaring\" 20s. It could also be argued that Mellon helped us prepare for a depression because he was lowering federal debt (something we don't have today). \n \n I don't know if this really counts as being tried though (using the excuse I criticized earlier). It was pretty much the policy for less than 2 years before the New Deal starting taking effect and the depression lasted another 8-9 years once that started. \n \n I think some people are confused by what \"doing nothing\" will do. Doing nothing will cause a drastic and painful collapse but will clean the system as Mellon suggested. Everything has to go down to what it is worth and either you do it all at once or you try to prop it up with government spending and this is crazy. \n \n One downside of this theory during the Great Depression was that everyone thought money was safe in a bank. Well when the banks loaned a bunch of money and couldn't give people what they deposited you ended up with a bad situation. What ended up happening was that everyone had to pay for societies debts. In any event, the assets did correct themselves to the right level just like Mellon thought they would. Home prices and banks all were priced correctly by the end. The New Deal just prolonged this correction.", 
   {}, 
   342195, 
   null, 
   1233177360.0
  ], 
  [
   342205, 
   null, 
   "Ohioprof", 
   "It works like a force of nature because people generally follow certain trends of behavior. There are many things humans do that you could say are forces of nature because they are behavior trends. \n \n I don't think Darwin has anything to do with this..it is mere behavior patterns. Basically humans are selfish and this is why capitalism is a means to work with this inherent flaw. Capitalism says you can't have me build you house in return for you giving me a pie. It comes down to worth of things as perceived by humans but even this is fairly standard. Worth is seen in rarity, effort, and a few other things and it would show that a house is worth more than a pie. With other types of economic systems you try to go against this trend but fixing worth. I believe what happens with this is that eventually capitalism will prevail and the item that is fixed in worth will eventually come down to that level or up to that level (such as by change in quality). This happens because someone will feel like they get the rare end of the deal and will adjust accordingly. \n \n So my point is that capitalism is nothing more than saying \"let people act naturally\" while socialism and communism so \"lets try to control nature actions\". I happen to think that nature actions will prevail if you try to control them...or rather they will adjust to the control. \n \n No, I don't take their position because I think they believe everyone is \"rational\". I believe people are predictable...but not always rational. Because of this the balance of supply and demand may not quickly adapt but in the long run will. \n \n The thing about government spending is that it tries to stop and adjustment from happening (such as home price falling). It stops the natural flow of things and it isn't a matter of trying to make supply and demand come back in balance more quickly....it just can't do this.\n\n \n It's no less \"natural\" for people to organize governments that exercise direction over economies than it is for individuals buy and sell items at will. Both are \"natural,\" because both are what people do and have done over time. Your argument suggests that to use government action is to interfere with what people do naturally. But people naturally put pressure on the government to take action and to intervene in the economy when they are suffering and the economy is down. This pressure, this desire for government action, is no less natural than the desire of individuals to trade freely. \n \n Here's an example. In the 1870s, farmers in America were deeply distressed. Farm prices were dropping, and the more farmers produced, the more prices dropped, causing farmers to lose their farms and to experience great suffering. Farmers began to organize, to put pressure on the government to intervene in the market in various ways and to expand the money supply to encourage farm prices to rise. Theirs came to be known as the populist movement, and for a time they organized a political party called the Populist Party. (You probably already know this, but I am including basic information for anyone who happens to be reading this who is unfamiliar with this history.) They demanded government intervention in the economy to stop the downward drop in farm prices. Eventually the money supply did expand, and some of their goals were achieved decades later with the creation of the AAA during the New Deal. Today farm prices are regulated. Some people object to this and call it unnatural. But it's no less natural than allowing the free market to determine farm prices, classical economic orthodoxy notwithstanding. \n \n The Populist farmers were acting no less naturally in demanding government action than they were when they were growing and selling farm products individually. Both were natural. Government intervention in the market has come about because people have demanded it, and people's demands for government action are not unnatural. Some people object to such actions because of their personal beliefs. But whatever people believe in, free trade in a system of unregulated capitalism is no more natural than is a system regulated by the government. Most capitalist economies, perhaps all today, incorporate some degree government regulation and intervention, by popular demand. \n \n Btw, socialism and communism were and are not the only alternatives to free market capitalism. Mercantilism was a system based on government control, and it was widely embraced by European thinkers from the 16th through the 18th centuries. The American founder Alexander Hamilton has been called a mercantilist. Mercantilism laid the foundation for what would later become free market capitalism. We also have seen examples in 20th century history of what some have called \"corporatism,\" referring to a state-directed, centrally controlled capitalism, as in Nazi Germany and Fascist Italy.", 
   {}, 
   342197, 
   null, 
   1233178320.0
  ], 
  [
   342208, 
   null, 
   "Steeeeve", 
   "Isn't that what Hoover did?\n \n On the advice of his treasury secretary Andrew Mellon?\n \n http://econ161.berkeley.edu/pdf_files/Liquidation_Cycles.pdf\n\n \n I finished reading this article than looked up DeLong and naturally he is invested in being a Keynes kind of guy. I'm not so sure we should just look at one sided views here. A good article though.", 
   {}, 
   342195, 
   null, 
   1233178860.0
  ], 
  [
   342209, 
   null, 
   "Ohioprof", 
   "Mellon kind of did this. Keep in mind Mellon was around for almost all of the 20s and it could be argued that he helped some of the \"roaring\" 20s. It could also be argued that Mellon helped us prepare for a depression because he was lowering federal debt (something we don't have today). \n \n I don't know if this really counts as being tried though (using the excuse I criticized earlier). It was pretty much the policy for less than 2 years before the New Deal starting taking effect and the depression lasted another 8-9 years once that started. \n \n I think some people are confused by what \"doing nothing\" will do. Doing nothing will cause a drastic and painful collapse but will clean the system as Mellon suggested. Everything has to go down to what it is worth and either you do it all at once or you try to prop it up with government spending and this is crazy. \n \n One downside of this theory during the Great Depression was that everyone thought money was safe in a bank. Well when the banks loaned a bunch of money and couldn't give people what they deposited you ended up with a bad situation. What ended up happening was that everyone had to pay for societies debts. In any event, the assets did correct themselves to the right level just like Mellon thought they would. Home prices and banks all were priced correctly by the end. The New Deal just prolonged this correction.\n\n \n Mellon served under Calvin Coolidge before Hoover. He was the advocate of cutting taxes on the wealthy (not the poor) in order to spur investment. He was a proponent of trickle-down economics, and his policies helped to cause the Great Depression. Mellon was entirely wrong-headed, in my view. \n \n In response to the previous poster, Herbert Hoover did not \"do nothing\" in response to the Great Depression. Hoover was not committed to laissez-faire as was his predecessor, Coolidge. He did believe in some degree of counter-cyclical government action, just not too much. Some scholars have even called Hoover a mild progressive, though that may be a stretch. Mellon was more conservative philosophically than Hoover was.", 
   {}, 
   342204, 
   null, 
   1233178920.0
  ], 
  [
   342218, 
   null, 
   "Steeeeve", 
   "It's no less \"natural\" for people to organize governments that exercise direction over economies than it is for individuals buy and sell items at will. Both are \"natural,\" because both are what people do and have done over time. Your argument suggests that to use government action is to interfere with what people do naturally. But people naturally put pressure on the government to take action and to intervene in the economy when they are suffering and the economy is down. This pressure, this desire for government action, is no less natural than the desire of individuals to trade freely. \nPerhaps I wasn't as clear as I wanted to be. The natural part is people are selfish and they want things to be \"fair\" to them (but will try to get more...the fairness comes from resistance other others trying to get ahead). So supply and demand is a natural occurance...for example. It is natural for people to try to get the government to give them something. In this case they want the government to fix the economy. Government can respond but will do so by stopping the natural flow of values to a level deemed fair by the public. So you almost have a contradiction here. You have, in this example, people who want home prices to stop falling but at the same time you have people who think price are unfair and won't pay them until they are fair. The first one is selfishness and the second is fairness. Like I said earlier the fairness comes from this conflict of everyone getting what they want. If the government steps in you pretty much are trying to pick a side and this just creates a block that will have to be fixed naturally. In this case if they stop housing prices from falling you will basically see the natural fix of no one buying homes.\n \n \n \nHere's an example. In the 1870s, farmers in America were deeply distressed. Farm prices were dropping, and the more farmers produced, the more prices dropped, causing farmers to lose their farms and to experience great suffering. Farmers began to organize, to put pressure on the government to intervene in the market in various ways and to expand the money supply to encourage farm prices to rise. Theirs came to be known as the populist movement, and for a time they organized a political party called the Populist Party. (You probably already know this, but I am including basic information for anyone who happens to be reading this who is unfamiliar with this history.) They demanded government intervention in the economy to stop the downward drop in farm prices. Eventually the money supply did expand, and some of their goals were achieved decades later with the creation of the AAA during the New Deal. Today farm prices are regulated. Some people object to this and call it unnatural. But it's no less natural than allowing the free market to determine farm prices, classical economic orthodoxy notwithstanding. \nI'm actually not too familar with the whole farm thing but I do recall us kind of price fixing crops which led to us buying up crops if they were not in demand at that time. \n \n \nThe Populist farmers were acting no less naturally in demanding government action than they were when they were growing and selling farm products individually. Both were natural. Government intervention in the market has come about because people have demanded it, and people's demands for government action are not unnatural. Some people object to such actions because of their personal beliefs. But whatever people believe in, free trade in a system of unregulated capitalism is no more natural than is a system regulated by the government. Most capitalist economies, perhaps all today, incorporate some degree government regulation and intervention, by popular demand. \nThese are natural and I don't mean to imply this. I am only saying that people acting for their own benefit and if government picks a side you create an inequality that will work itself out because the other half will adapt to make it \"fair\". Like price fixing of a crop is made fair by increasing prices for goods made by the crop which will eventually make all prices higher or cause other industries to suffer because less money can be used for them. There is no gain to this.", 
   {}, 
   342205, 
   null, 
   1233181440.0
  ], 
  [
   342220, 
   null, 
   "Steeeeve", 
   "Mellon served under Calvin Coolidge before Hoover. He was the advocate of cutting taxes on the wealthy (not the poor) in order to spur investment. He was a proponent of trickle-down economics, and his policies helped to cause the Great Depression. Mellon was entirely wrong-headed, in my view. \nI gotta be honest in that I'm not as well read about Mellon as I should be. I thought he did tax decreases for all.\n \n He also didn't do trickle down as we think of it...he was for a balanced budget. I'm not sure his policies could be linked to the Great Depression....remember this thing was world wide. It was more of a problem with debt that caused the depression.", 
   {}, 
   342209, 
   null, 
   1233181620.0
  ], 
  [
   342228, 
   null, 
   "Ohioprof", 
   "I gotta be honest in that I'm not as well read about Mellon as I should be. I thought he did tax decreases for all.\n \n He also didn't do trickle down as we think of it...he was for a balanced budget. I'm not sure his policies could be linked to the Great Depression....remember this thing was world wide. It was more of a problem with debt that caused the depression.\n\n \n Mellon did insist on a balanced budget. He favored cutting taxes on the wealthy and not people of lower incomes because he wanted to enhance the ability of those with money to invest and thus drive the economy. The reason I say that he supported trickle-down is because he believed that the wealth generated by wealthy investors would trickle down to the poorer people below. The problem with this belief is that not enough wealth trickled down to enable people below to consume enough of what was produced. \n \n The reason I say that his policies helped to produce the depression is because at root, the depression resulted from a decrease in demand beginning in 1927, and Mellon did not recognize this or address it. Consumption began falling in part because working people earned too little to continue purchasing the products of industry. This problem had been masked in industry for a time because of the advent of credit buying. People did not have credit cards yet, but they could buy consumer goods and pay for them over time. This held off the decrease in consumption for awhile, but it could not do so forever. Mellon saw a need to use tax policy to bolster investment, but not consumption. Almost no one saw consumption as a concern. Henry Ford had recognized a decade earlier that if he paid his workers more, they could purchase his cars and thus boost his profits. He was a rare exception among industrialists of his day, and once the depression hit, he no longer paid his workers high wages. Most business leaders sought to pay the lowest wages possible. Wages did rise in the 1920s, but not sufficiently to enable workers to continue the level of consumption needed to sustain economic growth. Union membership declined in the 1920s, and workers were unable to demand higher wages. Mellon's tax policies did not help, as he did not cut taxes on working people. Of course, working people did not pay particularly high taxes anyway, and so it's probably not fair to blame him for the decrease in consumption. He did not recognize the problem of underconsumption, and so he did nothing to address it, but other government and business leaders did not recognize the problem either. Hoover and other leaders did not see the depression coming. \n \n The depression was worldwide, but it was triggered by the collapse of the American economy. Hoover argued in his memoirs that it was caused by trade problems and by events abroad, but that really was not true.", 
   {}, 
   342220, 
   null, 
   1233183600.0
  ], 
  [
   342230, 
   null, 
   "Ohioprof", 
   "Perhaps I wasn't as clear as I wanted to be. The natural part is people are selfish and they want things to be \"fair\" to them (but will try to get more...the fairness comes from resistance other others trying to get ahead). So supply and demand is a natural occurance...for example. It is natural for people to try to get the government to give them something. In this case they want the government to fix the economy. Government can respond but will do so by stopping the natural flow of values to a level deemed fair by the public. So you almost have a contradiction here. You have, in this example, people who want home prices to stop falling but at the same time you have people who think price are unfair and won't pay them until they are fair. The first one is selfishness and the second is fairness. Like I said earlier the fairness comes from this conflict of everyone getting what they want. If the government steps in you pretty much are trying to pick a side and this just creates a block that will have to be fixed naturally. In this case if they stop housing prices from falling you will basically see the natural fix of no one buying homes.\n \n \n I'm actually not too familar with the whole farm thing but I do recall us kind of price fixing crops which led to us buying up crops if they were not in demand at that time. \n \n These are natural and I don't mean to imply this. I am only saying that people acting for their own benefit and if government picks a side you create an inequality that will work itself out because the other half will adapt to make it \"fair\". Like price fixing of a crop is made fair by increasing prices for goods made by the crop which will eventually make all prices higher or cause other industries to suffer because less money can be used for them. There is no gain to this.\n\n \n I would say there is an immediate gain in keeping farmers from losing their farms and enabling them to continue farming. It certainly is a gain for the farmers in the short run, and people have to live in the short run in order to survive to the long run. Whether this is a gain for the society as a whole is a political question; it depends on whom you ask and what people value. \n \n One problem the Populist farmers were upset about was monopolistic pricing practices by the railroads. Railroads charged high rates, and they worked in concert to keep the rates high rather than competing over price. Populist leaders urged the government to nationalize the railroads! They agreed with the large labor movement of the time, the Knights of Labor, who also wanted the government to nationalize the railroads. \n \n The biggest concern of the Populists was over the money supply. They argued that the government was keeping the money supply artificially small. This became a big issue between Democrats, who wanted to expand the money supply, and Republicans in the late 19th century.", 
   {}, 
   342218, 
   null, 
   1233184860.0
  ], 
  [
   342234, 
   null, 
   "Steeeeve", 
   "I would say there is an immediate gain in keeping farmers from losing their farms and enabling them to continue farming. It certainly is a gain for the farmers in the short run, and people have to live in the short run in order to survive to the long run. Whether this is a gain for the society as a whole is a political question; it depends on whom you ask and what people value. \n \n One problem the Populist farmers were upset about was monopolistic pricing practices by the railroads. Railroads charged high rates, and they worked in concert to keep the rates high rather than competing over price. Populist leaders urged the government to nationalize the railroads! They agreed with the large labor movement of the time, the Knights of Labor, who also wanted the government to nationalize the railroads. \n \n The biggest concern of the Populists was over the money supply. They argued that the government was keeping the money supply artificially small. This became a big issue between Democrats, who wanted to expand the money supply, and Republicans in the late 19th century.\n\n \n I was curious about the crops and so I read the American Economic Review of 1918 and it talks about this a lot. The basic conclusion was price fixing shouldn't be used but it isn't as bad as people think it is (price fixing for crops). One reason they give is that it sets a maximum price as well.\n \n I'll post more when I have more time.", 
   {}, 
   342230, 
   null, 
   1233186660.0
  ], 
  [
   342236, 
   null, 
   "Steeeeve", 
   "The reason I say that his policies helped to produce the depression is because at root, the depression resulted from a decrease in demand beginning in 1927\nThis was a debt issue. ...demand fell because of an overuse of debt which inflates wealth. decrease in demand is a symptom of the problem and not the problem itself.", 
   {}, 
   342228, 
   null, 
   1233186780.0
  ], 
  [
   342242, 
   null, 
   "Ohioprof", 
   "This was a debt issue. ...demand fell because of an overuse of debt which inflates wealth. decrease in demand is a symptom of the problem and not the problem itself.\n\n \n There was an overuse of debt, and the reason for this was the inability of consumers to buy the goods of industry on the wages they received without using credit. So you are right about this. The result was decrease in demand, which was more than just a symptom; it led directly to the decrease in production, which further undermined demand, and the spiral went down. \n \n There were, of course, other factors involved in the depression. But this problem was, I think, the root of it. People did not earn enough money to consume enough of the goods produced by industry.", 
   {}, 
   342236, 
   null, 
   1233189000.0
  ], 
  [
   342246, 
   null, 
   "Steeeeve", 
   "There was an overuse of debt, and the reason for this was the inability of consumers to buy the goods of industry on the wages they received without using credit. So you are right about this. The result was decrease in demand, which was more than just a symptom; it led directly to the decrease in production, which further undermined demand, and the spiral went down. \n A decrease in demand is just what happens in a recession...I think this is pretty much implied so I don't understand why the emphasis is on that. The bigger problem issue is that people had too much debt. The roaring 20s was people living beyond their means. I think Daewoo said it best though, most recessions are asset adjustments while this and the Great Depression are both credit adjustments (which include asset adjustments). These are much more severe in nature. To go along with this, a time must come when we have a dollar adjustment for all the debt we have at the federal level. This might be catastrophic. I guess this is different issue but the only solution I've heard to that problem is lower services(spending) and raise taxes...which pretty much insures a recession/depression.", 
   {}, 
   342242, 
   null, 
   1233193860.0
  ], 
  [
   342251, 
   null, 
   "Ohioprof", 
   "A decrease in demand is just what happens in a recession...I think this is pretty much implied so I don't understand why the emphasis is on that. The bigger problem issue is that people had too much debt. The roaring 20s was people living beyond their means. I think Daewoo said it best though, most recessions are asset adjustments while this and the Great Depression are both credit adjustments (which include asset adjustments). These are much more severe in nature. To go along with this, a time must come when we have a dollar adjustment for all the debt we have at the federal level. This might be catastrophic. I guess this is different issue but the only solution I've heard to that problem is lower services(spending) and raise taxes...which pretty much insures a recession/depression.\n\n \n We may simply be placing our emphases differently. I see the Great Depression as resulting from a many people living beyond their means and accumulating too much debt that they were unable to pay and many other people being too poor to consume much in the first place. The 20s brought wild speculation on stocks and buying sprees for consumer items that people could purchase on newly available credit. People bought both stocks and consumer goods on credit. The 20s also brought a farm crisis that depressed farmers' incomes throughout the decade and made farmers unable to contribute much to demand. And the 20s brought a decline in union membership, which tended to hold workers' wages down over the decade. These factors together produced the drop in demand. The drop in demand preceded the Great Depression and was what plunged the economy into the depression. The drop in demand was not merely a result of the depression or a byproduct of it. It was the drop in demand beginning around 1927 and the buildup of unsold inventories that set the stage for the economic plunge that began in 1929. \n \n The 20s was really the first time in American history that consumer goods were widely available to ordinary working people, and the new advertising industry promoted buying on time, with the promise that things would continue to get better and money would always be there and stock prices would always go up. Some of this bears an eerie resemblance to what was happening before the recent economic downturn, when people were speculating especially on housing, and credit was easy to get. And the real wages of American workers have been stagnant or declining in recent decades, which has tended to depress demand. (I seem to be suggesting here that maybe history does repeat itself. I don't think that's really true, but it may be true that people repeat patterns of behavior because there is a human tendency to do so.)", 
   {}, 
   342246, 
   null, 
   1233201480.0
  ], 
  [
   342356, 
   null, 
   "chester", 
   "Steeve & Ohioprof,\n \n I have battled with each of you on occasion, but not this time.\n \n I want to thank you for your intelligent and enlightening dialogue on the causes and cures for the current economic meltdown.\n \n I feel that I have a new perspective on things.emoticon_xagree", 
   {}, 
   342251, 
   null, 
   1233286680.0
  ], 
  [
   342361, 
   null, 
   "Steeeeve", 
   "Steeve & Ohioprof,\n \n I have battled with each of you on occasion, but not this time.\n \n I want to thank you for your intelligent and enlightening dialogue on the causes and cures for the current economic meltdown.\n \n I feel that I have a new perspective on things.emoticon_xagree\n\n \n I think Ohioprof and I agree that this stimulus plan is not exactly the best thing we can do. At the very least you should have come away with that. Whether you believe in Keynes or you believe in letting things go, this plan doesn't follow either path very well.", 
   {}, 
   342356, 
   null, 
   1233290940.0
  ], 
  [
   342369, 
   null, 
   "chester", 
   "I think Ohioprof and I agree that this stimulus plan is not exactly the best thing we can do. At the very least you should have come away with that. Whether you believe in Keynes or you believe in letting things go, this plan doesn't follow either path very well.\n\n \n Agreed. The plan will not succeed as well as it might because it simply is too timid.\n \n The stimulus needs to be 2 or 3X the size it is.", 
   {}, 
   342361, 
   null, 
   1233328200.0
  ], 
  [
   342371, 
   null, 
   "daewoo", 
   "Agreed. The plan will not succeed as well as it might because it simply is too timid.\n \n The stimulus needs to be 2 or 3X the size it is.\n\n \n Are you going to be writing a check for that, because the Chinese say they most certainly will not\n \n When you are cheering at the idea of a bigger stimulus package, keep in mind that what we already need to borrow this year actually exceeds the amount of free capital (capital not already sourced to a project or investment) expected to be available this year by nearly 12%. \n \n That is why the fed is talking about buying treasuries...because for all intents and purposes there is no enough money in the world to meet our borrowing needs. \n \n You may as well suggest 5x since that aint going to happen either.", 
   {}, 
   342369, 
   null, 
   1233329760.0
  ], 
  [
   342375, 
   null, 
   "Ohioprof", 
   "Agreed. The plan will not succeed as well as it might because it simply is too timid.\n \n The stimulus needs to be 2 or 3X the size it is.\n\n \n There is the issue of the size of the plan and also the nature of the projects being funded. The big question is whether a stimulus will really trigger the private sector to kick in and revive economic growth and prosperity.", 
   {}, 
   342369, 
   null, 
   1233333540.0
  ], 
  [
   342379, 
   null, 
   "Steeeeve", 
   "Are you going to be writing a check for that, because the Chinese say they most certainly will not\n \n When you are cheering at the idea of a bigger stimulus package, keep in mind that what we already need to borrow this year actually exceeds the amount of free capital (capital not already sourced to a project or investment) expected to be available this year by nearly 12%. \n \n That is why the fed is talking about buying treasuries...because for all intents and purposes there is no enough money in the world to meet our borrowing needs. \n \n You may as well suggest 5x since that aint going to happen either.\n\n \n This is why you print the money instead :) Sadly, the last time I heard the printing presses were literally running out of ink", 
   {}, 
   342371, 
   null, 
   1233335820.0
  ], 
  [
   342384, 
   null, 
   "daewoo", 
   "This is why you print the money instead :) Sadly, the last time I heard the printing presses were literally running out of ink\n\n \n Which brings up the really important question which is \"How are we going to fund this\". Every major US bond purchaser has said \"Not going to do it\". If you look at data from the last several auctions, they meant it. \n \n They have been talking about the fed buying treasuries, which basically boils down to printing money directly, but frankly if they start doing that, everybody and their brother will dump any US treasuries they are holding. When you start direct monetarization like that you have announced that you are moving to a hyperinflationary policy.", 
   {}, 
   342379, 
   null, 
   1233341460.0
  ], 
  [
   342393, 
   null, 
   "snakespit", 
   "Agreed. The plan will not succeed as well as it might because it simply is too timid.\n \n The stimulus needs to be 2 or 3X the size it is.\n\n \n Does that incluse 2 or 3X the pork currently contained in the stimulus, a figure that I have seen estimated at about 30%? \n \n If our government showed the slightest hint of fiscal responsibility by eliminating the wasteful pork, the confidence inspired in consumers could probably do as much good for the economy as this rediculous bailout, all while costing taxpayers less money.", 
   {}, 
   342369, 
   null, 
   1233345480.0
  ], 
  [
   342398, 
   null, 
   "Steeeeve", 
   "Does that incluse 2 or 3X the pork currently contained in the stimulus, a figure that I have seen estimated at about 30%? \n \n If our government showed the slightest hint of fiscal responsibility by eliminating the wasteful pork, the confidence inspired in consumers could probably do as much good for the economy as this rediculous bailout, all while costing taxpayers less money.\n\n \n I can live with pork so long as it is done when we have money and actually an investment in our economy (such as true infrastructure projects...hell, build a manufacturing plant for someone).", 
   {}, 
   342393, 
   null, 
   1233349200.0
  ], 
  [
   342458, 
   null, 
   "Ohioprof", 
   "To Steeeve and Daewoo,\n \n On Thursday, after our rather lengthy analysis of past depressions and whether government spending will trigger economic recovery, I had a similar discussion in our faculty lounge with two economists, a political scientist, and a sociologist. (I am history professor.) The economists argued over the multiplier effect. I brought up Steeve's point that economic conditions around the world are very different today than they were at the end of World War II, and while a stimulus large enough will certainly pump up the U.S. economy temporarily, how can we know that it will revive the private sector and produce ongoing growth? One economist said that a stimulus package is likely to work in the long run, while the other economist said it can work, but he cannot predict whether it will work. \n \n I asked my colleagues about the issue of so much manufacturing being done abroad, which is clearly a different situation than we faced at the end of WWII. If much of what we consume is manufactured in China, won't pumping up U.S. demand simply increase the demand for Chinese products and help the Chinese economy? One of the economists replied that it's fine to pump up demand for Chinese products; this will help the U.S. economy as well by bolstering trade and boosting U.S. exports. The economist insisted that despite the movement of much manufacturing abroad, the United States still exports a huge amount, and our manufacturing sector, while having changed in nature, is not dead.", 
   {}, 
   342398, 
   null, 
   1233411780.0
  ], 
  [
   342471, 
   null, 
   "snakespit", 
   "I asked my colleagues about the issue of so much manufacturing being done abroad, which is clearly a different situation than we faced at the end of WWII. If much of what we consume is manufactured in China, won't pumping up U.S. demand simply increase the demand for Chinese products and help the Chinese economy? One of the economists replied that it's fine to pump up demand for Chinese products; this will help the U.S. economy as well by bolstering trade and boosting U.S. exports. The economist insisted that despite the movement of much manufacturing abroad, the United States still exports a huge amount, and our manufacturing sector, while having changed in nature, is not dead.\n\n \n 'Buy American' Rule in Stimulus Bill Sparks Protest - Presidential Politics | Political News - FOXNews.com\n \n It's almost as if we are following the \"How to Start a Depression in 10 Easy Steps Handbook\" (published circa ~1930). \n \n \nU.S. businesses and trading partners are resisting a new \"Buy American\" provision in the $819 billion economic stimulus package making its way through Congress.\n \n The provision, included in the House bill that passed on Wednesday, generally prohibits the purchase of foreign iron and steel for any stimulus-funded infrastructure project. \n \n The goal is to boost the U.S. iron and steel industries, which have been pummeled by the current recession. Shipments in the steel industry, for example, fell 40 percent last year.\n \n Yet John Murphy, vice president of international affairs at the U.S. Chamber of Commerce, said 50 million Americans whose jobs depend on exports would pay the price.\n \n \"If the U.S. raises these barriers to international business, we're likely to see massive retaliation around the world,\" he said.\n\n \n I'm no economic wizard, but doesn't this sound a little...dumb?", 
   {}, 
   342458, 
   null, 
   1233428100.0
  ], 
  [
   342474, 
   null, 
   "simone", 
   "Yeah, John Murphy is stupid.", 
   {}, 
   342471, 
   null, 
   1233429300.0
  ], 
  [
   342484, 
   null, 
   "snakespit", 
   "Yeah, John Murphy is stupid.\n\n \n Intelligent and insightful analysis as usual simone. emoticon_rolleyes Read up a little more about the Smoot-Hawley Tariff Act.", 
   {}, 
   342474, 
   null, 
   1233434880.0
  ], 
  [
   342505, 
   null, 
   "daewoo", 
   "To Steeeve and Daewoo,\n \n On Thursday, after our rather lengthy analysis of past depressions and whether government spending will trigger economic recovery, I had a similar discussion in our faculty lounge with two economists, a political scientist, and a sociologist. (I am history professor.) The economists argued over the multiplier effect. I brought up Steeve's point that economic conditions around the world are very different today than they were at the end of World War II, and while a stimulus large enough will certainly pump up the U.S. economy temporarily, how can we know that it will revive the private sector and produce ongoing growth? One economist said that a stimulus package is likely to work in the long run, while the other economist said it can work, but he cannot predict whether it will work. \n \n I asked my colleagues about the issue of so much manufacturing being done abroad, which is clearly a different situation than we faced at the end of WWII. If much of what we consume is manufactured in China, won't pumping up U.S. demand simply increase the demand for Chinese products and help the Chinese economy? One of the economists replied that it's fine to pump up demand for Chinese products; this will help the U.S. economy as well by bolstering trade and boosting U.S. exports. The economist insisted that despite the movement of much manufacturing abroad, the United States still exports a huge amount, and our manufacturing sector, while having changed in nature, is not dead.\n\n \n We have had several years to study the impact of our current account deficit. From an academic standpoint, you colleagues are correct. From a real world standpoint, they are way off the mark. \n \n While it is accurate that the stimulus package will probably stimulate economic activity here in the US even if most of the money ends up being spent on goods from china, frankly he is working from the academic standpoint that economic activiy is by its very nature good, when the fact is that not all economic activity is good, not all economic activity is equal, and while you do have to consider the multiplier effect (which we have discussed her on many occasions in the past during discussions of deficit spending and economic growth) if the economic activity you are engaging in is not necessarily positive, the multiplier effect just makes things worse.\n \n Cheap imports are actually an excellent example. In theory when a ship full of goods docks the goods are paid for, representing an loss of national wealth to the chinese. The american consumer, though, in theory sees massive benefit in the form of reduced prices on merchandise. That is NOT the case, though. Instead those goods come into harbor, the chinese pay for them, the wholesaler marks them up 1200%, and the consumer sees very little benefit. The only person in the whole transaction that really makes out well is the importer/wholesaler.\n \n This is problematic for our nation. First of all, the gap between rich and poor is growing at an alarming rate and the middle class is suffering. I am no leveler, but in order of r aconsumer capitalist system to work you HAVE TO have a vibrant and relatively wealthy middle class. When the top 10% of your society controls 90% of the wealth an economy like ours simply cannot survive. Ours has survived longer than it probably should have because we have some pretty cool technology that has allowed us to build a massive credit/debt structure that basically has allowed the wealthy to loan enough money to the middle class to keep us afloat and then (in theory) collect their money back, plus interest. In reality this has just saddled the middle class with more debt than they can possibly hope to repay, so credit terms were decreased to keep them spending until the time finally came that the defaults started.\n \n So, the stimulus package increases economic activity, but it increased the flow of wealth out of the US, which is a bad thing. It also increases the flow of wealth out of the middle class, which is also a bad thing. It MAY increase exports, which is a good thing, but frankly the odds are SERIOUSLY against it. The last stimulus package increased imports but did nothing at all for exports because manufacturing nations recognized that the boom created was short lived and European nations, which generally purchase our luxury goods, did not see any benefit so they certainly did not buy more from us. \n \n That is why much of the business world cringed when Bernanke was appointed to the fed, and then again pretty much every time he has announced a strategy since then. While Bernankes work on the great depression has brought him a good deal of notoriety and respect in the academic world, pretty much anybody in the business world knows they are ####...a bunch of theoretical BS that does not reflect reality. Frankly it shows in his response to the crisis. If his work was not jsut a bunch of theoretical garbage, his response would have worked. The policies of the fed would have dragged us out of this mess, or at least there would be some kind of end in sight.\n \n Instead, they have acted as if the policies would work because Bernanke said they would, but they have NOT. They have not just failed, they have failed miserably...because they were based on theoretical garbage. Instead of looking like we are near the end, every day seems to bring us closer to an end game. \n \n The theory and the application are 2 entirely different things. I can provide literally thousands of examples. \n \n And I am not belittling the work that academic economists do. I think it is important to know and understand the theories behind our economy. I used to tell people \"When you close the textbook and walk out on the production floor, it is a whole new world\".\n \n The same applies here.", 
   {}, 
   342458, 
   null, 
   1233451260.0
  ], 
  [
   342507, 
   null, 
   "daewoo", 
   "'Buy American' Rule in Stimulus Bill Sparks Protest - Presidential Politics | Political News - FOXNews.com\n \n It's almost as if we are following the \"How to Start a Depression in 10 Easy Steps Handbook\" (published circa ~1930). \n \n I'm no economic wizard, but doesn't this sound a little...dumb?\n\n \n I am not sure exactly how much this matters. The bailouts we have seen are at their base nothing but massive protectionist programs. I think that is why China had so much trouble with the Obama administration coming out of the gate by slapping a \"currency manipulator\" label on them and threatening to take it up with the WTO. We have pretty much abandoned free market principals here lately. Any one of our trading partners or competitors could lodge a dozen complaints against us and they would all be valid. \n \n I can only imagine that they have not put forth a meaningful response yet because they are hoping that once they stop passing the crack pipe around the white house somebody will eventually recognize that trying to strong arm your bookie, and threatening somebody with what amounts to assault charges when they have just seen you commit a murder, is not a good idea.", 
   {}, 
   342471, 
   null, 
   1233451620.0
  ], 
  [
   342530, 
   null, 
   "Steeeeve", 
   "Daewoo,\n \n \nWe have had several years to study the impact of our current account deficit. From an academic standpoint, you colleagues are correct. From a real world standpoint, they are way off the mark.\n\n \n I have a few problems with what economists say vs reality. The most basic one is how do you determine the effects of something long term and short term? I do believe you can spend your way into economic recovery but it seems there is a simple problem to this...all you are doing is paying off a credit card with another credit card. I hate to say this but the simplest and most logical economic concepts seem to be the ones that work out the best in the long run. So if we are to determine if this really helped we can't just say \"hey looks like the economy is better..look at GDP\" 1 year after a 1 trillion dollar infusion. What happens in the long term when our debt is sky high and it collapses? Do we blame the president who put the last dollar in that make the dam break?\n \n My second problem is that this isn't really a stimulus package. This is more of a gift program. $500 isn't going to bring back the middle class and the fixing of potholes (or infrastructure as the bill calls it) isn't going to create jobs. \n \n Finally, the theory that government spending helps everything is suspect since the same excuses for failure and reason for needing it are the same ones used for \"trickle down\" economics. This should be be a red flag in my opinion. As an accountant I deal with reality and history. Economists deal with theory and frankly I think theory is just guessing with style. \n \n So a few points here....how do we measure long term effects of government spending, what will it help anyway, and why is this theory so popular?", 
   {}, 
   342507, 
   null, 
   1233471240.0
  ], 
  [
   342532, 
   null, 
   "Steeeeve", 
   "To Steeeve and Daewoo,\n \n On Thursday, after our rather lengthy analysis of past depressions and whether government spending will trigger economic recovery, I had a similar discussion in our faculty lounge with two economists, a political scientist, and a sociologist. (I am history professor.) The economists argued over the multiplier effect. I brought up Steeve's point that economic conditions around the world are very different today than they were at the end of World War II, and while a stimulus large enough will certainly pump up the U.S. economy temporarily, how can we know that it will revive the private sector and produce ongoing growth? One economist said that a stimulus package is likely to work in the long run, while the other economist said it can work, but he cannot predict whether it will work. \n \n I asked my colleagues about the issue of so much manufacturing being done abroad, which is clearly a different situation than we faced at the end of WWII. If much of what we consume is manufactured in China, won't pumping up U.S. demand simply increase the demand for Chinese products and help the Chinese economy? One of the economists replied that it's fine to pump up demand for Chinese products; this will help the U.S. economy as well by bolstering trade and boosting U.S. exports. The economist insisted that despite the movement of much manufacturing abroad, the United States still exports a huge amount, and our manufacturing sector, while having changed in nature, is not dead.\n\n \n I have to agree with Daewoo when he talks about the difference between the academics and reality. No offense to professors but many seem to get lost with what they think should happen with what actually has to happen. I remember in my accounting classes I was taught a ton of things that just don't work out in the real world and my professors are shocked when I talk to them from time to time (ones that are still there ha). \n \n I also have problems with economists..must be a normal accounting hatred haha. Accountants deal with actual numbers and historical data as opposed to theory like economists, finance, and management folks. The difference is you get an economists who say it will be a long term fix while an accountant sees a short term fix. 1 trillion in debt (or 3 trillion) gets you a GDP bump during that year and inserts cash. They also see that historically when you flood an economy with printed money you get inflation. This is a long term issue seen 2-3 years after printing. You also know that debt has to be paid off and is a liability that can damage a company. Three trillion is not free and represents 100% of our annual revenue. Basically the accountant comes to the same conclusion David Walker did about our economy (prior to Obama who he supports) which is we can't take on anymore debt without putting this country into a hole we may never get out of. \n \n Our country has people who are too rich and unwilling to adjust their living to something reasonable. You can create more exports when China is producing 10 times cheaper unless you are willing to go that low with our standard of living. In WWII we could do that because no one else was producing anything. \n \n This is the reality and this is why this plan will fail. It can only create inflation and maybe a few temporary jobs. Once that money stops it might hurt us even worse.", 
   {}, 
   342458, 
   null, 
   1233471840.0
  ], 
  [
   342570, 
   null, 
   "simone", 
   "Yes, indeed.\n \n Our present day economic problems are largely the brainchildren of theotal School of Chicago economic brain drain, the school of Leo Strauss filtered through the Bush Administration.\n \n Total airheads who lacked contact with Planet Earth.", 
   {}, 
   342532, 
   null, 
   1233515940.0
  ], 
  [
   342577, 
   null, 
   "Steeeeve", 
   "Yes, indeed.\n \n Our present day economic problems are largely the brainchildren of theotal School of Chicago economic brain drain, the school of Leo Strauss filtered through the Bush Administration.\n \n Total airheads who lacked contact with Planet Earth.\n\n \n Hate to break up your Bush Bashing party but this problem started a lot longer than 8 years ago and appears will only be prolonged with the current administration...maybe not the current economic meltdown but certainly the fall of the dollar.", 
   {}, 
   342570, 
   null, 
   1233517380.0
  ], 
  [
   342580, 
   null, 
   "simone", 
   "To be sure, Steeeve. The whole sorry business began during the administration of Ronald Wilson Reagan.", 
   {}, 
   342577, 
   null, 
   1233518100.0
  ], 
  [
   342583, 
   null, 
   "isly ilwott", 
   "To be sure, Steeeve. The whole sorry business began during the administration of Ronald Wilson Reagan.\nOh, puleeeze! Even foreign governments recognize that the lax rules in the housing markets here in the United States (pushed by Jimmy Carter...boosted along by Bill Clinton) caused the entire global economic meltdown. Reagan gave the Democrats something to destroy and they did it.", 
   {}, 
   342580, 
   null, 
   1233520620.0
  ], 
  [
   342616, 
   null, 
   "T.Q", 
   "Carter and Clinton-12 years\n Reagan-8 years (after Carter)\n Bush Sr-4 years\n W.-8 years\n \n How is it that it's always Carter's and Clinton's fault when your hero Reagan had 8 years to fix Carter's screw up, Bush Sr had an additional 4 years, and W. had 8 years after Clinton to realize something needed to be done?\n \n Amazing how this point just keeps on eluding you every time it's brought up. Politicians may be to blame, but not democrats.", 
   {}, 
   342583, 
   null, 
   1233547080.0
  ], 
  [
   342618, 
   null, 
   "daewoo", 
   "To be sure, Steeeve. The whole sorry business began during the administration of Ronald Wilson Reagan.\n\n \n Actually it is even older than that. When Nixon took us off the gold standard because we could not actually afford to redeem for gold, that was the beginnign of the end. We should have seen a massive, nationwide correction then which would have been painful and long...maybe as long as 2 years...and then we could have started growing again. \n \n Everything since then has essentially been compounding the problem and putting off the correction, and every time we do it, it gets worse.", 
   {}, 
   342580, 
   null, 
   1233550440.0
  ], 
  [
   342619, 
   null, 
   "daewoo", 
   "Daewoo,\n \n I have a few problems with what economists say vs reality. The most basic one is how do you determine the effects of something long term and short term? I do believe you can spend your way into economic recovery but it seems there is a simple problem to this...all you are doing is paying off a credit card with another credit card. I hate to say this but the simplest and most logical economic concepts seem to be the ones that work out the best in the long run. So if we are to determine if this really helped we can't just say \"hey looks like the economy is better..look at GDP\" 1 year after a 1 trillion dollar infusion. What happens in the long term when our debt is sky high and it collapses? Do we blame the president who put the last dollar in that make the dam break?\n \n My second problem is that this isn't really a stimulus package. This is more of a gift program. $500 isn't going to bring back the middle class and the fixing of potholes (or infrastructure as the bill calls it) isn't going to create jobs. \n \n Finally, the theory that government spending helps everything is suspect since the same excuses for failure and reason for needing it are the same ones used for \"trickle down\" economics. This should be be a red flag in my opinion. As an accountant I deal with reality and history. Economists deal with theory and frankly I think theory is just guessing with style. \n \n So a few points here....how do we measure long term effects of government spending, what will it help anyway, and why is this theory so popular?\n\n \n Infinite growth paradigm. Our economy is essentially based on the absolutely moronic notion that infinite growth is possible. Not only does it rely on infinite growth being possible, it requires it for the economy to keep ticking over. \n \n If you start with an assumption of infinite growth, suddenly deficit spending does not seem so bad because you can always discount it based on the fact that in the future, it will basically be a lot less because we will have so much more. Basically they look at deficit spending the way one might look at the receipt of a lottery payout, or in anticipation of a big payment from a client. \n \n The problem, of course, is that you cannot possibly have infinite growth within a finite system, and if you chop the economy off at the roots, you can not count on any real growth at all.\n \n If you look at this stuff and apply infinite growth thinking to it, it all makes sense. Unfortunately we have reached the point where infinite growth pretty much looks like the idiocy it is.", 
   {}, 
   342530, 
   null, 
   1233551100.0
  ], 
  [
   342623, 
   null, 
   "Jo Bennett", 
   "Capitalism itself is predicated on the basis of infinite growth, that's why the whole system is screwed up.", 
   {}, 
   342619, 
   null, 
   1233558360.0
  ], 
  [
   342626, 
   null, 
   "daewoo", 
   "Capitalism itself is predicated on the basis of infinite growth, that's why the whole system is screwed up.\n\n \n Yes and no. In theory a balanced system would be possible. It has never happened...nor have we ever been anywhere close to it...but in THEORY it could be done.", 
   {}, 
   342623, 
   null, 
   1233560580.0
  ], 
  [
   342642, 
   null, 
   "Steeeeve", 
   "Correct me if I am wrong but didn't China decide to stop buying 30yr notes and instead are buying 5yr and 10yr notes?\n \n Isn't this pretty much admitting they don't think we can buy our debt 30yrs from now?", 
   {}, 
   342626, 
   null, 
   1233598080.0
  ], 
  [
   342646, 
   null, 
   "T.Q", 
   "Correct me if I am wrong but didn't China decide to stop buying 30yr notes and instead are buying 5yr and 10yr notes?\n \n Isn't this pretty much admitting they don't think we can buy our debt 30yrs from now?\n\n \n But they think you can 5 years from now? Not being snarky, just kind of confused. If that is the case, how is 5 or 10 years better than 30?", 
   {}, 
   342642, 
   null, 
   1233599400.0
  ], 
  [
   342653, 
   null, 
   "daewoo", 
   "But they think you can 5 years from now? Not being snarky, just kind of confused. If that is the case, how is 5 or 10 years better than 30?\n\n \n 5 and 10 year notes are easier to dump on the secondary market.", 
   {}, 
   342646, 
   null, 
   1233600540.0
  ], 
  [
   342656, 
   null, 
   "T.Q", 
   "5 and 10 year notes are easier to dump on the secondary market.\n\n \n Ah, gotcha. Thanks Daewoo", 
   {}, 
   342653, 
   null, 
   1233601140.0
  ], 
  [
   342661, 
   null, 
   "simone", 
   "Correct me if I am wrong but didn't China decide to stop buying 30yr notes and instead are buying 5yr and 10yr notes?\n \n Isn't this pretty much admitting they don't think we can buy our debt 30yrs from now?\n\n I guess China figures they'll own the U.S. in 30 years and they don't want to put themselves into indebtedness.\n \n Wal-mart certainly paved the way for the Chinese to own us.", 
   {}, 
   342642, 
   null, 
   1233602400.0
  ], 
  [
   342662, 
   null, 
   "Steeeeve", 
   "So basically in the first few weeks Obama has managed to #### off China to the point where they stopped buying 30yr treasuries and Chavez still thinks our president smells funny.\n \n Not a promising start to that change I keep hearing about.", 
   {}, 
   342656, 
   null, 
   1233602460.0
  ], 
  [
   342664, 
   null, 
   "Steeeeve", 
   "I guess China figures they'll own the U.S. in 30 years and they don't want to put themselves into indebtedness.\n \n Wal-mart certainly paved the way for the Chinese to own us.\n\n \n Or it could be the fact that China has 681 billion (as of Nov 08) invested in our t-bills and t-bonds. That is roughly 22%..more than any other country, including Japan. \n \n The road was paved with the big government you love so much.", 
   {}, 
   342661, 
   null, 
   1233603180.0
  ], 
  [
   342671, 
   null, 
   "simone", 
   "No, Steeeeve, George Bush's irresponsible Big Government that lied us into a war otherwise known as the Quagmire Known as Iraq.\n \n Oh yes, and by refusing to pay as we go, Bush borrowed and borrowed and borrowed.\n \n Republicans can never be trusted with the American treasury again.", 
   {}, 
   342664, 
   null, 
   1233608760.0
  ], 
  [
   342674, 
   null, 
   "Steeeeve", 
   "No, Steeeeve, George Bush's irresponsible Big Government that lied us into a war otherwise known as the Quagmire Known as Iraq.\n \n Oh yes, and by refusing to pay as we go, Bush borrowed and borrowed and borrowed.\n \n Republicans can never be trusted with the American treasury again.\n\n \n You are so clouded by hatred and bigotry you can't even see reality. Running a deficit isn't a new thing that Bush created...it has been going on at incredible rates since the 70s. Clinton, for example, ran a deficit every year in office. Both Bush's did as well. Obama has already promised to see Bush's record deficits and double them..at least..under the illusion that we have to or our country will be in shatters. But why blame the president in power when it is Congress who controls money (read the constitution if you don't believe me)? Republicans only controlled both houses 10 out of the last 55 (almost 60) years. Democrats have controlled both houses for around 40 of those years. \n \n Well guess what, China thinks we are insane and is dropping 30yr t-bonds. I doubt Japan will hang in there much longer and all of a sudden we are stuck printing money. Just last week we heard the treasury say they wanted to actually loan themselves money. This is insanity under the illusion that we need to get out of an economic downturn this very second.\n \n You want to blame people, try blaming everyone in Congress over the last 50yrs. \n \n Way too easy Simone..come on.", 
   {}, 
   342671, 
   null, 
   1233610500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Now That Barack Hussein Obama Is President", 
  "url": "http://www.4forums.com/political/elections-debates/12241-now-barack-hussein-obama-president.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 12241, 
  "discussion_files": [
   [
    "2468.html", 
    "http://www.4forums.com/political/elections-debates/12241-now-barack-hussein-obama-president-print.html"
   ], 
   [
    "2469.html", 
    "http://www.4forums.com/political/elections-debates/12241-now-barack-hussein-obama-president-8-print.html"
   ], 
   [
    "2470.html", 
    "http://www.4forums.com/political/elections-debates/12241-now-barack-hussein-obama-president-6-print.html"
   ], 
   [
    "2471.html", 
    "http://www.4forums.com/political/elections-debates/12241-now-barack-hussein-obama-president-4-print.html"
   ], 
   [
    "2472.html", 
    "http://www.4forums.com/political/elections-debates/12241-now-barack-hussein-obama-president-5-print.html"
   ], 
   [
    "2473.html", 
    "http://www.4forums.com/political/elections-debates/12241-now-barack-hussein-obama-president-7-print.html"
   ], 
   [
    "2474.html", 
    "http://www.4forums.com/political/elections-debates/12241-now-barack-hussein-obama-president-3-print.html"
   ], 
   [
    "2475.html", 
    "http://www.4forums.com/political/elections-debates/12241-now-barack-hussein-obama-president-2-print.html"
   ]
  ], 
  "identifier": 12241
 }
]