[
 [
  [
   341392, 
   null, 
   "RandyA", 
   "http://creationwiki.org/Chinese_characters_for_Noah%27s_ark\n \n \n\n There is a story from ancient China which is very similar to Noah's ark. This story also describe about a global flood. In the story, the water from the flood reached to the sun and the heaven, and covered all the mountains and made all the living things in the earth to be sank into the water. In the middle of the global flood period, the hero appeared who named Noah (&#22899;&#23301;). She-in the story, the hero is woman- turned back the flood and helped to repopulated the world. The story was written by ancient Chinese character. Researcher analyzed about the ancient Chinese characters and they found that oracle Bone and Seal characters that are related with flood(&#27946;) and boat(&#33311;)and they represent discovery of evidence for Noah's ark in the Chinese characters. Also, the story includes that Noah build the ark and took eight worshiper and 'the remnants of the world' and then finally found ground. In many ways, we can see the similarity between Noah's ark and Noah's ark in Chinese version. \n", 
   {
    "post_info": {
     "post_title": "Evidence for the Flood: chinese characters"
    }
   }, 
   null, 
   null, 
   1232724720.0
  ], 
  [
   341397, 
   null, 
   "Penfold", 
   "Chinese history predates the Noachian flood, with no mention of it.", 
   {}, 
   341392, 
   null, 
   1232728500.0
  ], 
  [
   341398, 
   null, 
   "T.Q", 
   "Chinese history unbroken\n \n \nChinese history begins nearly 3,000 BCE. The Shu-King historic record of China, shows that King Yao came to the throne in 2356 BCE and ruled China for many years after the alleged flood. Incidentally, durring the reign of Yao, the Shu King reports that the Hwang Ho River flooded on a number of times, for three generations, again with NO break in history.\n\n \n Penfold beat me to it.", 
   {}, 
   341392, 
   null, 
   1232728560.0
  ], 
  [
   341405, 
   null, 
   "Ripskar", 
   "Every civilisation associated with a river has a flood story.\n The \"world\" of ancient barbarians does not equate to the globe, but to the couple of square miles around their home.", 
   {}, 
   341398, 
   null, 
   1232731980.0
  ], 
  [
   341406, 
   null, 
   "iangb", 
   "Another way of looking at the Chinese myth is as further evidence that the storywriters from the OT (and the NT, if you swing that way) borrowed liberally from the stories of previous religions when they were composing their own.\n \n I'm sure you've heard the term 'creationist goggles'.", 
   {}, 
   341398, 
   null, 
   1232732040.0
  ], 
  [
   341408, 
   null, 
   "Archangel", 
   "http://creationwiki.org/Chinese_characters_for_Noah%27s_ark\n\n \n They'll also ignore these other historical records of the flood Randy. Because they must in order to hold on to their secular belief system.\n \n Abiogenesis and the Origin of Life", 
   {}, 
   341392, 
   null, 
   1232732100.0
  ], 
  [
   341430, 
   null, 
   "Matthew", 
   "Another way of looking at the Chinese myth is as further evidence that the storywriters from the OT (and the NT, if you swing that way) borrowed liberally from the stories of previous religions when they were composing their own.\n\n \n See, for example, the Babylonian epic of Gilgamesh. The gods decide to destroy the world in a deluge. One of them \"goes rogue\" and warns a man named Utnapishtim. He is advised to build a great boat, and to bring every living thing aboard, which he prudently does. He and his wife and the animals ride out the ferocious storm for seven days and seven nights. Utnapishtim finds that when the rains have stopped, land is nowhere to be found. He releases several birds to no avail, but finally a raven finds dry land. Meanwhile, the god who had originally proposed destroying the world now relents and blesses Utnapishtim and his wife with immortality.\n \n The written version of this story predates the written Judaic tale of Noah. Which isn't to say that the Israelites borrowed the tale consciously or deliberately. Nor even, necessarily, that they \"borrowed\" it at all: various elements of the tale can be found in sacred stories throughout the Fertile Crescent, and all of them originally appeared in oral traditions, so it's exceedingly difficult to determine which came \"first\" or to sort out the subsequent lineages. But that the stories are closely connected is clear. And when one considers the historical connections between the Israelites and the Babylonians, it becomes even clearer.", 
   {}, 
   341406, 
   null, 
   1232739180.0
  ], 
  [
   341448, 
   null, 
   "Penfold", 
   "Not without some controversy at the time, the work of Ryan and Pitman in 1999 provides a plausible example of a local timely flood event in the inundation of the freshwater lake which became the saltwater Black Sea, when the Mediterranean broke through the Bosphorus Strait.", 
   {}, 
   341430, 
   null, 
   1232744760.0
  ], 
  [
   341461, 
   null, 
   "T.Q", 
   "They'll also ignore these other historical records of the flood Randy. Because they must in order to hold on to their secular belief system.\n \n Abiogenesis and the Origin of Life\n\n \n We don't ignore it. We look at the circumstances-all these stories are from civilizations/groups that live on or near flood plains. Floods are common place. Catastrophic floods, not so much.\n \n You, however, must ignore things. \n \n For example; where is the global layer of sediments which the flood would have had to have laid down? Such a sediment layer would be quite thick, and uniformly found around the globe, and would consist of particles sorted by density. We would expect to find no signs of life within this layer (no tracks or burrows, and no signs of growing plant life such as paleosols are tree roots). This sedimentary layer would show signs of being layed down in water. As well, any animal fossils (plant too), would be indiscrimately mixed. We would expect, for example, to find trilobites alongside modern day rays, rabbits with velociraptors, etc.\n \n Now, can you point out where such a global layer exists Archie? If it doesn't, that pretty much debunks the flood \"theory\". But you just ignore that don't you?", 
   {}, 
   341408, 
   null, 
   1232752020.0
  ], 
  [
   341481, 
   null, 
   "obvious_child", 
   "http://creationwiki.org/Chinese_characters_for_Noah%27s_ark\n\n \n That's the best you got? \n \n CG202.2: Chinese Hihking flood story\n \n \n \nThe Supreme Sovereign ordered the water god Gong Gong to create a flood as punishment and warning for human misbehavior. Gong Gong extended the flood for 22 years, and people had to live in high mountain caves and in trees, fighting with wild animals for scarce resources. Unable to persuade the Supreme Sovereign to stop the flood, and told by an owl and a turkey about _Xirang_ or Growing Soil, the supernatural hero Gun stole Growing Soil from heaven to dam the waters. Before Gun was finished, however, the Supreme Sovereign sent the fire god Zhu Rong to execute him for his theft. The Growing Soil was taken back to heaven, and the floods continued. However, Gun's body didn't decay, and when it was cut apart three years later, his son Yu emerged in the form of a horned dragon. Gun's body also transformed into a dragon at that time and thenceforth lived quietly in the deeps. The Supreme Sovereign was fearful of Yu's power, so he cooperated and gave Yu the Growing Soil and the use of the dragon Ying. Yu led other gods to drive away Gong Gong, distributed the Growing Soil to remove most of the flood, and led the people to fashion rivers from Ying's tracks and thus channel the remaining floodwaters to the sea. [Walls, pp. 94-100]\n\n \n Show of hands, how many people think that is the same story? \n \n Flood Stories from Around the World", 
   {}, 
   341392, 
   null, 
   1232763000.0
  ], 
  [
   341482, 
   null, 
   "obvious_child", 
   "f it doesn't, that pretty much debunks the flood \"theory\". But you just ignore that don't you?\n\n \n The \"flood: scientifically possible?\" thread is evidence that arch ignores essentially everything scientifically and factually relevant about the flood. \n \n Fossil record shows sorting largely by complexity, not density. Huh. That's magic water!\n \n Geological record lacks a uniform layer of sediment similar to the K-T iridium layer. Magic water again!\n \n Geological record doesn't support massive geological changes happening in 4,000 years. Magic Land perhaps? \n \n Basic marine organisms can't tolerate massive salinity changes. Maybe Noah had a giant magical aquarium? emoticon_xkill", 
   {}, 
   341461, 
   null, 
   1232763180.0
  ], 
  [
   341484, 
   null, 
   "baconsbud", 
   "Shouldn't this belong in religion section? What does a story about a supposed flood from Chinese mythology have to do with evolution or creationism.", 
   {
    "post_info": {
     "post_title": "why"
    }
   }, 
   341482, 
   null, 
   1232767080.0
  ], 
  [
   341502, 
   null, 
   "Archangel", 
   "We don't ignore it. We look at the circumstances-all these stories are from civilizations/groups that live on or near flood plains. Floods are common place. Catastrophic floods, not so much.\n \n You, however, must ignore things.\n\n \n Sure you ignore, excuse, justify and interpret any and all info according to your own preconceived notions and comfort zones. Not to mention according to your fleshly understanding which completely ignores the supernatural nature of the great flood. \n \n That's why you come up with foolishness like every one of these stories took place in flood plains, as if you could ever prove that at all based on current topography. And yet you boldly make the claim as if it's some proven fact. And you guys will say that the story of Gilgamesh precedes the writing of Genesis, therefore Genesis must have stolen the story from the Babylonians rather them being separate records of the same event. What ignorance and rationalization that is in order to justify a fallacious denial of the Genesis account.\n \n Here's an example why that is. There are hundreds of books written about the Moon Landing. So there is obviously a first account written about it. And I'm sure that years later, other books were also written on that same exact event. Are those later books lies? Or were their facts stolen from the prior books, or taken from the event itself, just as the first book was? So you see, your excuses and attempts to dismiss the great flood for such irrational reasons don't make any sense at all. \n \n \n For example; where is the global layer of sediments which the flood would have had to have laid down? Such a sediment layer would be quite thick, and uniformly found around the globe, and would consist of particles sorted by density. \n\n \n And we see that all over the world, yet you will explain it away once it's shown to you.\n Turbidites and Water Sorting\n \n There are some other interesting things to note about the geologic column. Many of its layers, wherever they are found in the world, are sorted with the courser material on the bottom and the finer material on the top of that individual layer (Except in the case of underwater slumps where the material is sorted fine to course). 2 Does this sorting make sense to have happened over millions of years? Sorting like this does not take place today except in specific circumstances. This kind of sorting only occurs naturally in water, and specifically in underwater mudslides called turbidites. I think it is interesting that much of the geologic column looks exactly like turbiditic layering.3 In fact, geologist today no longer accept the long prevailing hypothesis of uniformitarian deposition, but have opted instead for a more \"punctuated\" formation of much of the column. These punctuations are generally felt to be the result of sudden catastrophic events with long intervening periods of relative quietness. The does make some sense in the fact of the fact that turbidites create sedimentary layers almost instantly. However, turbidite flow does not flatten or significantly disrupt lower layers. Thus, any erosion or unevenness in lower layers will be preserved. The fact that the layers are generally flat seems to indicate that they were already very flat before the next turbidite came along.The Geologic Column\n \n \n We would expect to find no signs of life within this layer (no tracks or burrows, and no signs of growing plant life such as paleosols are tree roots). \n\n \n Prove it! Prove that there would be no rooted trees at all within the sedimentary layers at all. And prove that there would be no tracks or burrows or evidence of plant life as we find. In fact we would expect to find all of those things as evidence that this event was fast and cataclysmic in order to find all of these things together in the same areas.\n \n \n This sedimentary layer would show signs of being layed down in water. \n\n \n It has been shown in evidence all around the world with something as fragile as a leaf extending through multiple varves. The Geologic Column\n \n \n As well, any animal fossils (plant too), would be indiscrimately mixed. \n\n \n And they have been found in volume buried together in the same strata in Ohio also. Vertebrate Fossils - Ohio History Central - A product of the Ohio Historical Society\n \n \n We would expect, for example, to find trilobites alongside modern day rays, rabbits with velociraptors, etc.\n\n \n You mean like this?\n Pleistocene or Ice Age mammals, such as mammoths and musk oxen, had been found in Lake Bonneville deposits along the Wasatch Front as early as the 1870s. The Salt Lake Tribune noted a musk ox skull found near downtown Salt Lake City in 1871. Pleistocene fossils, including invertebrates, fish, and birds, as well as the large extinct mammals, continue to be found in Pleistocene deposits throughout Utah.Utah History Encyclopedia\n \n And evidence similar to this has been found all over the world. But you ignore it or interpret it to fit your agenda. This \n \n Why? And who cares what YOU would expect to find when we are speaking about what happened in reality? It's all a matter of interpreting the same available info and we interpret it very differently. But only in your mind does that make your interpretation correct and ours wrong. \n In the Beginning: Compelling Evidence for Creation and the Flood - Testing the Theories\n \n Can you explain these aberrations in the fossil record? In the Beginning: Compelling Evidence for Creation and the Flood - 25.## Out-of-Place Fossils", 
   {}, 
   341461, 
   null, 
   1232780220.0
  ], 
  [
   341504, 
   null, 
   "T.Q", 
   "And we see that all over the world, yet you will explain it away once it's shown to you.\n\n No we don't. I want you to tell me the precise layer that is globally found. \n \n \nProve it! Prove that there would be no rooted trees at all within the sedimentary layers at all. And prove that there would be no tracks or burrows or evidence of plant life as we find. In fact we would expect to find all of those things as evidence that this event was fast and cataclysmic in order to find all of these things together in the same areas.\n\n Archie, instead of deciding before hand that I'm wrong, read what I'm saying. What trees were growing during this flood? I'm guessing there were no acorns sprouting into oaks during the flood. Therefore, in this flood sediment, we would find no rooted trees. We would find no burrows, and we would find no tracks.\n \n \n Now we've seen you can't answer my question. Whether this is because you didn't understand it, or didn't want to consider it, I don't know. But there is no global flood sediment which meets the criteria neccessary to demonstrate a global flood.", 
   {}, 
   341502, 
   null, 
   1232786340.0
  ], 
  [
   341519, 
   null, 
   "Archangel", 
   "Here is the Creationist explanation for the strata problem tq. This explains the interpretation much better than I can since I'm not a geologist just as you aren't. Top Evidences Against the Theory of Evolution\n \n As it points out though, the full rock strata is found nowhere in the world. It is made up of columns superimposed from different regions all over the world. The whole strata is 100 miles thick but there is no locality more than one mile and even this locality is the Grand Canyon. Read on to at least understand our interpretation of the available evidence and why we believe it supports the Flood more effectively than evolution.", 
   {}, 
   341504, 
   null, 
   1232827620.0
  ], 
  [
   341521, 
   null, 
   "T.Q", 
   "Here is the Creationist explanation for the strata problem tq. This explains the interpretation much better than I can since I'm not a geologist just as you aren't. Top Evidences Against the Theory of Evolution\n \n As it points out though, the full rock strata is found nowhere in the world. It is made up of columns superimposed from different regions all over the world. The whole strata is 100 miles thick but there is no locality more than one mile and even this locality is the Grand Canyon. Read on to at least understand our interpretation of the available evidence and why we believe it supports the Flood more effectively than evolution.\n\n \n Archie, read what I wrote again. \n \n What you presented is not what I said should be found if the global flood were a reality. We should not find fossils layered by complexity. We should find the vast majority of strata would be sedimentary, and these sediments would be organized by grain size. Again, we would expect to see no signs of life within these strata-no tracks, no burrows, no roots, etc.", 
   {}, 
   341519, 
   null, 
   1232827980.0
  ], 
  [
   341636, 
   null, 
   "Huntard", 
   "Anyone who thinks the flood happened, have a look at this:  100 Categories of Evidence Against Noah's Flood\n \n Now, if you can refute all those points, then the flood becomes possible, until then, go do some research.", 
   {
    "post_info": {
     "post_title": "The flood happened? These 100 points say it didn't"
    }
   }, 
   341521, 
   null, 
   1232883780.0
  ], 
  [
   341642, 
   null, 
   "Archangel", 
   "Archie, read what I wrote again. \n \n What you presented is not what I said should be found if the global flood were a reality. \n\n \n So what. Who say's you are the arbiter of what would be found in the flood? My link explains the creationist interpretation of the evidence.\n \n \n We should not find fossils layered by complexity. We should find the vast majority of strata would be sedimentary, and these sediments would be organized by grain size. \n\n \n Above you said we should find fossils layered by complexity, and the link did show that strata is organized by grain size.\n \n \n Again, we would expect to see no signs of life within these strata-no tracks, no burrows, no roots, etc.\n\n \n Post 13 answered your preceding questions, then you asked for the precise layer that is the global flood and I posted a link which explained the creationist interpretation of that evidence. And now you're asking for my evidence which supports your claims for what should appear if the flood occurred when my evidence answers the question just fine.", 
   {}, 
   341521, 
   null, 
   1232891820.0
  ], 
  [
   341644, 
   null, 
   "Archangel", 
   "Anyone who thinks the flood happened, have a look at this:  100 Categories of Evidence Against Noah's Flood\n \n Now, if you can refute all those points, then the flood becomes possible, until then, go do some research.\n\n \n The second poster answered the first 5 points which effectively nullified the results of the rest of the claims made. See here: EvC Forum: 100 Categories of Evidence Against Noah?s Flood See post #2 by someone who cares.", 
   {}, 
   341636, 
   null, 
   1232893080.0
  ], 
  [
   341683, 
   null, 
   "T.Q", 
   "You just don't understand, do you Archie?", 
   {}, 
   341644, 
   null, 
   1232920140.0
  ], 
  [
   341692, 
   null, 
   "Archangel", 
   "You just don't understand, do you Archie?\n\n \n YOU? And the way your brain works? No I don't tq, and I doubt I ever will.", 
   {}, 
   341683, 
   null, 
   1232922480.0
  ], 
  [
   341695, 
   null, 
   "Penfold", 
   "I suspect he meant how the world works. No magic necessary.", 
   {}, 
   341692, 
   null, 
   1232923860.0
  ], 
  [
   341907, 
   null, 
   "obvious_child", 
   "You just don't understand, do you Archie?\n\n \n do they ever?\n \n When has a creationist ever trying to argue away the problem of sorting by complexity rather then density? \n \n Magic water perhaps? \n \n I'd love to see an argument as to why a super light, low density tiny dinosaur managed to sink faster then a high density, heavy mammoth. HUH. \n \n If I put a gold brick into an aquarium at the same time as a bird feather, which do you think will sink faster? \n \n If you're not insane, you'd say gold.\n \n If you're a creationist, the feather.", 
   {}, 
   341683, 
   null, 
   1233031860.0
  ], 
  [
   341952, 
   null, 
   "pandion", 
   "When has a creationist ever trying to argue away the problem of sorting by complexity rather then density?\nAnd then, these same creationists will try to tell you that the seashells and other marine fossils found in the rock on the tops of mountains are evidence that the flood once covered the mountains. Mind that these fossils are not just found on the mountains, but in the mountains. And so, while they argue about hydrodynamic sorting sorting sea creatures at the bottom with dinosaurs in the middle while sloths and mammoths could run for the high ground (along with humans), and while they argue that the rains and the flood washed the habitats down the mountains, somehow the flood also washed bottom dwelling sea creatures to the tops of mountains.\n \n Creationist arguments aren't even consistent.", 
   {}, 
   341907, 
   null, 
   1233041280.0
  ], 
  [
   341987, 
   null, 
   "obvious_child", 
   "On top of that creationists argue that marine species like clams couldn't survive a flood of water longer then giant sloths.\n \n hahahaha. Zoologists these people aren't.", 
   {}, 
   341952, 
   null, 
   1233047280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evidence for the Flood: chinese characters", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12259-evidence-flood-chinese-characters.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 12259, 
  "discussion_files": [
   [
    "29019.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12259-evidence-flood-chinese-characters-print.html"
   ], 
   [
    "29020.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12259-evidence-flood-chinese-characters-2-print.html"
   ]
  ], 
  "identifier": 12259
 }
]