[
 [
  [
   341393, 
   null, 
   "RandyA", 
   "Startling evidence for Noah&#8217;s Flood\n \n 'There is no sight on earth which matches Grand Canyon. There are other canyons, other mountains and other rivers, but this Canyon excels all in scenic grandeur. Can any visitor, upon viewing Grand Canyon, grasp and appreciate the spectacle spread before him? The ornate sculpture work and the wealth of color are like no other landscape. They suggest an alien world. The scale is too outrageous. The sheer size and majesty engulf the intruder, surpassing his ability to take it in.'1\n \n \n Anyone who has stood on the rim and looked down into Grand Canyon would readily echo these words as one's breath is taken away with the sheer magnitude of the spectacle. The Canyon stretches for 277 miles (446 kilometres) through northern Arizona, attains a depth of more than 1 mile (1.6 kilometres), and ranges from 4 miles (6.4 kilometres) to 18 miles (29 kilometres) in width. In the walls of the Canyon can be seen flat-lying rock layers that were once sand, mud or lime. Now hardened, they look like pages of a giant book as they stretch uniformly right through the Canyon and underneath the plateau country to the north and south and deeper to the east.\n \n The Coconino Sandstone\n \n To begin to comprehend the awesome scale of these rock layers, we can choose any one for detailed examination. Perhaps the easiest of these rock layers to spot, since it readily catches the eye, is a thick, pale buff coloured to almost white sandstone near the top of the Canyon walls. Geologists have given the different rock layers names, and this one is called the Coconino Sandstone (see Figures 1 and 2). It is estimated to have an average thickness of 315 feet (96 metres) and, with equivalent sandstones to the east, covers an area of about 200,000 square miles (518,000 square kilometres).2 That is an area more than twice the size of the Australian State of Victoria, or almost twice the area of the US State of Colorado! Thus the volume of this sandstone is conservatively estimated at 10,000 cubic miles (41,700 cubic kilometres). That's a lot of sand!\n \n \n What do these rock layers in Grand Canyon mean? What do they tell us about the earth's past? For example, how did all the sand in this Coconino Sandstone layer and its equivalents get to where it is today?\n \n To answer these questions geologists study the features within rock layers like the Coconino Sandstone, and even the sand grains themselves. An easily noticed feature of the Coconino Sandstone is the distinct cross layers of sand within it called cross beds (see Figure 3, right). For many years evolutionary geologists have interpreted these cross beds by comparing them with currently forming sand deposits - the sand dunes in deserts which are dominated by sand grains made up of the mineral quartz, and which have inclined internal sand beds. Thus it has been proposed that the Coconino Sandstone accumulated over thousands and thousands of years in an immense windy desert by migrating sand dunes, the cross beds forming on the down-wind sides of the dunes as sand was deposited there.3\n \n \n The Coconino Sandstone is also noted for the large number of fossilized footprints, usually in sequences called trackways. These appear to have been made by four-footed vertebrates moving across the original sand surfaces (see Figure 4, left). These fossil footprint trackways were compared to the tracks made by reptiles on desert sand dunes,4 so it was then assumed that these fossilized footprints in the Coconino Sandstone must have been made in dry desert sands which were then covered up by wind-blown sand, subsequent cementation forming the sandstone and fossilizing the prints.\n \n Yet another feature that evolutionary geologists have used to argue that the Coconino Sandstone represents the remains of a long period of dry desert conditions is the sand grains themselves. Geologists have studied the sand grains from modern desert dunes and under the microscope they often show pitted or frosted surfaces. Similar grain surface textures have also been observed in sandstone layers containing very thick cross beds such as the Coconino Sandstone, so again this comparison has strengthened the belief that the Coconino Sandstone was deposited as dunes in a desert.\n \n At first glance this interpretation would appear to be an embarrassment to Bible-believing geologists who are unanimous in their belief that it must have been Noah's Flood that deposited the flat lying beds of what were once sand, mud and lime, but are now exposed as the rock layers in the walls of the Canyon.\n \n Above the Coconino Sandstone is the Toroweap Formation and below is the Hermit Formation, both of which geologists agree are made up of sediments that were either deposited by and/or in water. 5,6 How could there have been a period of dry desert conditions in the middle of the Flood year when 'all the high hills under the whole heaven were covered' (Genesis 7:19) by water?\n \n This seeming problem has certainly not been lost on those, even from within the Christian community, opposed to Flood geologists and creationists in general. For example, Dr Davis Young, Professor of Geology at Calvin College in Grand Rapids, Michigan, in a recent book being marketed in Christian bookshops, has merely echoed the interpretations made by evolutionary geologists of the characteristics of the Coconino Sandstone, arguing against the Flood as being the agent for depositing the Coconino Sandstone. He is most definite in his consideration of the desert dune model:\n \n 'The Coconino Sandstone contains spectacular cross bedding, vertebrate track fossils, and pitted and frosted sand grain surfaces. All these features are consistent with formation of the Coconino as desert sand dunes. The sandstone is composed almost entirely of quartz grains, and pure quartz sand does not form in floods ... no flood of any size could have produced such deposits of sand ...'7\n \n Those footprints\n \n The footprint trackways in the Coconino Sandstone have recently been re-examined in the light of experimental studies by Dr Leonard Brand of Loma Linda University in California.8 His research program involved careful surveying and detailed measurements of 82 fossilized vertebrate trackways discovered in the Coconino Sandstone along the Hermit Trail in Grand Canyon. He then observed and measured 236 experimental trackways made by living amphibians and reptiles in experimental chambers. These tracks were formed on sand beneath the water, on moist sand at the water's edge, and on dry sand, the sand mostly sloping at an angle of 25 degrees, although some observations were made on slopes of 15deg; and 20° for comparison. Observations were also made of the underwater locomotion of five species of salamanders (amphibians) both in the laboratory and in their natural habitat, and measurements were again taken of their trackways.\n \n A detailed statistical analysis of these data led to the conclusion, with a high degree of probability that the fossil tracks must have been made underwater. Whereas the experimental animals produce footprints under all test conditions, both up and down the 25° slopes of the laboratory 'dunes', all but one of the fossil trackways could only have been made by the animals in question climbing uphill. Toe imprints were generally distinct, whereas the prints of the soles were indistinct. These and other details were present in over 80% of the fossil, underwater and wet sand tracks, but less than 12% of the dry sand and damp sand tracks had any toe marks. Dry sand uphill tracks were usually just depressions, with no details. Wet sand tracks were quite different from the fossil tracks in certain features. Added to this, the observations of the locomotive behaviour of the living salamanders indicated that all spent the majority of their locomotion time walking on the bottom, underwater, rather than swimming.\n \n Putting together all of his observations, Dr Brand thus came to the conclusion that the configurations and characteristics of the animals trackways made on the submerged sand surfaces most closely resembled the fossilized quadruped trackways of the Coconino Sandstone. Indeed, when the locomotion behaviour of the living amphibians is taken into account, the fossilized trackways can be interpreted as implying that the animals must have been entirely under water (not swimming at the surface) and moving upslope (against the current) in an attempt to get out of the water. This interpretation fits with the concept of a global Flood, which overwhelmed even four-footed reptiles and amphibians that normally spend most of their time in the water.\n \n Not content with these initial studies, Dr Brand has continued (with the help of a colleague) to pursue this line of research. He recently published further results,9 which were so significant that a brief report of their work appeared in Science News10 and Geology Today. 11\n \n His careful analysis of the fossilized trackways in the Coconino Sandstone, this time not only from the Hermit Trail in Grand Canyon but from other trails and locations, again revealed that all but one had to have been made by animals moving up cross bed slopes. Furthermore, these tracks often show that the animals were moving in one direction while their feet were pointing in a different direction. It would appear that the animals were walking in a current of water, not air. Other trackways start or stop abruptly, with no sign that the animals' missing tracks were covered by some disturbance such as shifting sediments. It appears that these animals simply swam away from the sediment.\n \n Because many of the tracks have characteristics that are 'just about impossible' to explain unless the animals were moving underwater, Dr Brand suggested that newt-like animals made the tracks while walking under water and being pushed by a current. To test his ideas, he and his colleague videotaped living newts walking through a laboratory tank with running water. All 238 trackways made by the newts had features similar to the fossilized trackways in the Coconino Sandstone, and their videotaped behaviour while making the trackways thus indicated how the animals that made the fossilized trackways might have been moving.\n \n These additional studies confirmed the conclusions of his earlier researches. Thus, Dr Brand concluded that all his data suggest that the Coconino Sandstone fossil tracks should not be used as evidence for desert wind deposition of dry sand to form the Coconino Sandstone, but rather point to underwater deposition. These evidence from such careful experimental studies by a Flood geologist overturn the original interpretation by evolutionists of these Coconino Sandstone fossil footprints, and thus call into question their use by Young and others as an argument against the Flood.\n \n Desert 'dunes'?\n \n The desert sand dune model for the origin of the Coconino Sandstone has also recently been challenged by Glen Visher12, Professor of Geology at the University of Tulsa in Oklahoma, and not a creationist geologist. Visher noted that large storms, or amplified tides, today produce submarine sand dunes called 'sand waves'. These modern sand waves on the sea floor contain large cross beds composed of sand with very high quartz purity. Visher has thus interpreted the Coconino Sandstone as a submarine sand wave deposit accumulated by water, not wind. This of course is directly contrary to Young's claims, which after all are just the repeated opinions of other evolutionary geologists.\n \n Furthermore, there is other evidence that casts grave doubts on the view that the Coconino Sandstone cross beds formed in desert dunes. The average angle of slope of the Coconino cross beds is about 25° from the horizontal, less than the average angle of slope of sand beds within most modern desert sand dunes. Those sand beds slope at an angle of more than 25°, with some beds inclined as much as 30° to 34°, the angle of 'rest' of dry sand. On the other hand, modern oceanic sand waves do not have 'avalanche' faces of sand as common as desert dunes, and therefore, have lower average dips of cross beds.\n \n Visher also points to other positive evidence for accumulation of the Coconino Sandstone in water. Within the Coconino Sandstone is a feature known technically as 'parting lineation', which is known to be commonly formed on sand surfaces during brief erosional bursts beneath fast-flowing water. It is not known from any desert sand dunes. Thus Visher also uses this feature as evidence of vigorous water currents accumulating the sand, which forms the Coconino Sandstone.\n \n Similarly, Visher has noted that the different grain sizes of sand within any sandstone are a reflection of the process that deposited the sand. Consequently, he performed sand grain size analyses of the Coconino Sandstone and modern sand waves, and found that the Coconino Sandstone does not compare as favourably to dune sands from modern deserts.\n \n He found that not only is the pitting not diagnostic of the last Process to have deposited the sand grains (pitting can, for example, form first by wind impacts, followed by redeposition by water), but pitting and frosting of sand grains can form outside a desert environment.13 For example, geologists have described how pitting on the surface of sand grains can form by chemical processes during the cementation of sand.\n Sand wave deposition\n \n Figure 5. Schematic diagram showing the formation of cross beds during sand deposition by migration of underwater sand waves due to sustained water flow.\n \n A considerable body of evidence is now available which indicates that the Coconino Sandstone was deposited by the ocean, and not by desert accumulation of sand dunes as emphatically maintained by most evolutionary geologists, including Christians like Davis Young. The cross beds within the Coconino Sandstone (that is, the inclined beds of sand within the overall horizontal layer of sandstone) are excellent evidence that ocean currents moved the sand rapidly as dune-like mounds called sand waves.14\n \n Figure 5 (right) shows the way sand waves have been observed to produce cross beds in layers of sand. The water current moves over the sand surface building up mounds of sand. The current erodes sand from the 'up-current' side of the sand wave and deposits it as inclined layers on the 'down-current' side of the sand wave. Thus the sand wave moves in the direction of current flow as the inclined strata continue to be deposited on the down-current side of the sand wave. Continued erosion of sand by the current removes both the up-current side and top of the sand wave, the only part usually preserved being just the lower half of the down-current side. Thus the height of the cross beds preserved is just a fraction of the original sand wave height. Continued transportation of further sand will result in repeated layers containing inclined cross beds. These will be stacked up on each other.\n \n Sand waves have been observed on certain parts of the ocean floor and in rivers, and have been produced in laboratory studies. Consequently, it has been demonstrated that the sand wave height is related to the water depth.15 As the water depth increases so does the height of the sand waves which are produced. The heights of the sand waves are approximately one-fifth of the water depth. Similarly, the velocities of the water currents that produce sand waves have been determined.\n \n Thus we have the means to calculate both the depth and velocity of the water responsible for transporting as sand waves the sand that now makes up the cross beds of the Coconino Sandstone. The thickest sets of cross beds in the Coconino Sandstone so far reported are 30 feet (9 metres) thick.16 Cross beds of that height imply sand waves at least 60 feet (18 metres) high and a water depth of around 300 feet (between 90 and 95 metres). For water that deep to make and move sand waves as high as 60 feet (18 metres) the minimum current velocity would need to be over 3 feet per second (95 centimetres per second) or 2 miles per hour. The maximum current velocity would have been almost 5.5 feet per second (165 cm or 1.65 metres per second) or 3.75 miles per hour. Beyond that velocity experimental and observational evidence has shown that flat sand beds only would be formed.\n \n Now to have transported in such deep water the volume of sand that now makes up the Coconino Sandstone these current velocities would have to have been sustained in the one direction perhaps for days. Modern tides and normal ocean currents do not have these velocities in the open ocean, although deep-sea currents have been reported to attain velocities of between 50 cm and 250 cm (2.5 metres) per second through geographical restrictions. Thus catastrophic events provide the only mechanism, which can produce high velocity ocean currents over a wide area.\n \n Hurricanes (or cyclones in the southern hemisphere) are thought to make modern sand waves of smaller size than those that have produced the cross beds in the Coconino Sandstone, but no measurements of hurricane driven currents approaching these velocities in deep water have been reported. The most severe modern ocean currents known have been generated during a tsunami or 'tidal wave'. In shallow oceans tsunami-induced currents have been reported on occasion to exceed 500 cm (5 metres) per second, and currents moving in the one direction have been sustained for hours.19 Such an event would be able to move large quantities of sand and, in its waning stages, build huge sand waves in deep water. Consequently, a tsunami provides the best modern analogy for understanding how large-scale cross beds such as those in the Coconino Sandstone could form.\n \n Noah's Flood?\n \n We can thus imagine how the Flood would deposit the Coconino Sandstone (and its equivalents), which covers an area of 200,000 square miles (518,000 square kilometres) averages 315 feet (96 metres) thick, and contains a volume of sand conservatively estimated at 10,000 cubic miles (41,700 cubic kilometres). But where could such an enormous quantity of sand come from? Cross beds within the Coconino dip consistently toward the south, indicating that the sand came from the north. However, along its northern occurrence, the Coconino rests directly on the Hermit Formation, which consists of siltstone and shale and so would not have been an ample source of sand of the type now found in the Coconino Sandstone. Consequently, this enormous volume of sand would have to have been transported a considerable distance, perhaps at least 200 or 300 miles (320 or 480 kilometres). At the current velocities envisaged sand could be transported that distance in a matter of a few days!\n \n Thus the evidence within the Coconino Sandstone does not support the evolutionary geologists interpretation of slow and gradual deposition of sand in a desert environment with dunes being climbed by wandering four-footed vertebrates. On the contrary, a careful examination of the evidence, backed up by experiments and observations of processes operating today indicates catastrophic deposition of the sand by deep fast-moving water in a matter of days, totally consistent with conditions envisaged during the Flood.", 
   {
    "post_info": {
     "post_title": "Evidence for the flood: Grand Canyon, sandstone, footprints, desert dunes"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1232724960.0
  ], 
  [
   341440, 
   null, 
   "trebor", 
   "CC365: Coconino footprints\n \n Response:\n \n 1. The evidence for footprints being made underwater comes from rather ambiguous statistical studies, but is contradicted by evidence (Lockley 1992; Lockley and Hunt 1995; Loope 1992), including the following:\n \n * \"One of the most common observations is that the tracks have bulges or sand crescents on one side, thereby proving that they were made on inclined surfaces\" (Lockley and Hunt 1995).\n * Tracks showing possible loping, running, and galloping gaits are found throughout the Coconino Sandstone. These can only have been made on dry land.\n * Tracks of small arthropods, attributable to spiders, centipedes, millipedes, and scorpions, occur abundantly in the Coconino Sandstone. (Schur [2000] has some excellent pictures.) Some of these trackways can only be made on completely dry sand.\n * Raindrop impressions also appear. \n \n 2. The Coconino Sandstone covers an area of 200,000 square miles. Snelling and Austin (1992) proposed that thousands of cubic miles of sand were transported from hundreds of miles north. Forces violent enough to transport the sand would have killed any animals that got in the way. There would have been nothing alive within a hundred miles of where the footprints were found.\n \n 3. Brand himself, in the conclusion to one of his papers, wrote that: \"The data do suggest that the Coconino Sandstone fossil trackways may have been produced in either subaqueous sand or subaerial damp sand\" (1996). So Brand's own work, taken at face value, does not necessarily indicate that the footprints were made underwater. \n \n There is abundant geological evidence that the Coconino Sandstone was eolian. (CC365.1: Coconino Sandstone deposition environment.)\n \n The Coconino Sandstone, the origin of which is conventionally attributed to desert sand dunes, was deposited by water. Evidence for this (in addition to the character of fossil footprints therein) includes cross-bedding angles of only 25 degrees, not the 30-34 degrees one expects from desert dunes.\n Source:\n Snelling, Andrew A. and Steven A. Austin, 1992. Grand Canyon: Startling evidence for Noah's Flood! Creation Ex Nihilo 15(1): 47. Startling evidence for Noah&#8217;s Flood\n Response:\n \n 1. Eolian (wind-blown) and subaqueous dunes have superficial similarities, but they differ in particulars. There is a great deal of diverse evidence that the Coconino Sandstone originated as eolian desert dunes. As McKee (1979, 204) stated:\n \n The basis for considering the Coconino Sandstone to be of eolian origin involves numerous criteria, some of which are distinctive of an eolian environment and others merely compatible with but not diagnostic of it. No single type of evidence seems entirely conclusive, but, together, the various features present very strong evidence. The principal criteria of dune deposition are as follows:\n \n 1. The extent and homogeneity of the sand body.\n \n 2. The tabular-planar and wedge-planar type and large scale of cross-stratification. The common high-angle deposits are interpreted as slipfaces on the lee sides of dunes, and the relatively rare low-angle cross-strata that dip toward the opposite quadrant apparently represent deposits of windward slopes.\n \n 3. Slump marks of several varieties preserved on the steeply dipping surfaces of lee-side deposits. These are distinctive of dry sand avalanching.\n \n 4. Ripple marks which are common on surfaces of high-angle crossbedding suggest eolian deposition both by their high indexes (above 15) and by their orientation with axes parallel to dip slope.\n \n 5. The local preservation of a distinctive type of rain pit. Such pits illustrate the cohesion of sand grains with added moisture and a reorientation of the crater axes with respect to bedding slopes.\n \n 6. Successions of miniature rises or steps ascending dip slopes of crossbeds.\n \n 7. The preservation in fine sand of reptile footprints and probable millipede trails with sharp definition and clear impression.\n \n 8. The consistent orientation of reptilian tracks up (not down) the steep foreset slopes. \n \n Since McKee published, additional types of terrestrial trace fossils, paleosols, and other distinctive eolian sedimentary structures have been recognized in Coconino and related eolian strata.\n \n If a person looks carefully at modern dunes -- for example, the Great Sand Dunes, White Sands, and Nebraska Sand Hills -- he or she will find an abundance of climbing translatent beds, with coarsening-up laminae and rare foreset laminae that form only by the migration and accretion of low-amplitude wind ripples in eolian environments. Such beds form only in terrestrial eolian environments and are completely absent from marine or lacustrine environments because the wind ripples that create them simply do not form under water and underwater analogues of these sedimentary. The fact that wind ripple and the distinctive bedding and laminations occur throughout the Coconino Sandstone and other similar strata -- for example, the Navajo and Entrada -- clearly refutes the marine hypothesis for their origin.\n \n 2. Sand waves deposited in water possess very low angle cross-beds, rarely steeper than 10 degrees. Cross-bedding in eolian dunes occurs at various angles. The general range in slope of the cross-beds is from 11 to 34 degrees. The average appears to be close to 25-28 degrees. The average slope of cross-bedding does not have to be equal to 30 to 34 degrees, which is the maximum slope of dry sand, to be from a sand dune. The maximum slope of cross-bedding within the Coconino Sandstone does get as steep as 30 to 34 degrees (McKee 1979; Reineck and Singh 1980). The 30-34 degree slope is produced from sand avalanching down the lee slip face of the dune. The beds and laminae produced by wind ripple migration can form cross-bedding and lamination that has slopes up to 20 degrees within a sand dune. Given that this cross-bedding is present everywhere in the Coconino Sandstone, it greatly decreases the average slope of the cross-bedding within the Coconino Sandstone. In addition, grain-fall processes produce low, inclined lamination and beds with slopes that average between 20 to 30 degrees and range from 0 to 40 degrees. The presence of grain-fall bedding and lamination within the Coconino, not only refutes the hypotheses concerning the underwater or marine origin of the Coconino Sandstone but also again greatly decreases the average slope of the cross-bedding found in the Coconino Sandstone. Thus, it is completely reasonable that the average slope of the cross-bedding in the Coconino Sandstone is less than the average slope of dry sand -- that is 30 to 34 degrees -- because the cascading of sand down the lee side of the sand dune is not the only process producing cross-beds and laminations in dune sands (Hunter 1977).", 
   {}, 
   341393, 
   null, 
   1232742120.0
  ], 
  [
   341739, 
   null, 
   "prschuster", 
   "I know nothing about the origin of the Cocino sandstone. But what difference does this issue make anyway? Even if it were the result of flooding it would not be evidence for a world wide flood. It is already well known that there have been huge inland seas from time to time on this continent.", 
   {}, 
   341440, 
   null, 
   1232941800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evidence for the flood: Grand Canyon, sandstone, footprints, desert dunes", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12260-evidence-flood-grand-canyon-sandstone-footprints-desert-dunes.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 12260, 
  "discussion_files": [
   [
    "4738.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12260-evidence-flood-grand-canyon-sandstone-footprints-desert-dunes-print.html"
   ]
  ], 
  "identifier": 12260
 }
]