[
 [
  [
   342119, 
   null, 
   "foundit66", 
   "DENVER - The New Life Church, a nationally known evangelical institution that fired its founding pastor, Ted Haggard, in 2006 over accusations that he had had sex with a male prostitute, made payments starting in 2007 to a young male church member who had a relationship with Mr. Haggard before the dismissal, the church's pastor told worshipers on Sunday.\n \n The payments - part of a confidential legal settlement in 2007 that included money for counseling and college expenses - came from insurance money, not donations from members, the senior pastor of New Life, Brady Boyd, said in his sermon at the church in Colorado Springs.\n \n Mr. Boyd said in an interview on Monday that the payments, and what has now amounted to second body blow of scandal, were kept quiet for two years partly because of legal constraints, and partly because of ministerial confidentiality rules, since the man had sought out church authorities for counseling about the affair. Mr. Boyd declined to identify the young man, but said he is now in his 20s and was over 18 at the time of the relationship. Mr. Haggard is now 52.\n \n Mr. Boyd said he had decided to break the silence because the young man called a few weeks ago and said he was thinking of going public himself.\n \n \"We weren't hiding him - we were trying to do the honorable thing,\" Mr. Boyd said in the interview. He described the legal agreement in 2007 as, \"not so a much a settlement as it was compassionate assistance - we were trying to help the young man by being discreet.\"\n \n Mr. Haggard could not be reached for comment.\n \n But in an e-mail statement issued by a public relations firm for an HBO documentary about Mr. Haggard, he said there had been \"no physical contact\" with the young man, though he said he had asked forgiveness for what he described as an \"inappropriate relationship.\"\n \n In an interview with The Associated Press this month, Mr. Haggard said he was selling insurance and debt-reduction software and that his sexual identity was hard to pin down. \"The stereotypical boxes don't work for me,\" he said. \"My story's got some gray areas in it. And, of course, I'm sad about that, but it's the reality.\"\n \n The news opens not only another chapter in Mr. Haggard's story, but also a whole new set of tangled questions about what was known of the pastor's life. It also comes, not entirely by coincidence, just a few days before the HBO documentary, \"The Trials of Ted Haggard,\" is broadcast, beginning Thursday.\n \n Mr. Boyd said the church's disclosure was forced when the young man, who no longer attends New Life, called a few weeks ago and told church leaders he was so angered by advertising for the film, which he said seemed overly sympathetic to Mr. Haggard, that he was thinking of breaking his silence.The New York Times < Log In\n \n This reads like \"hush money\".\n \"not so a much a settlement as it was compassionate assistance - we were trying to help the young man by being discreet\"\n \n And the evangelical church used INSURANCE money?\n What type of \"insurance\" covers payments to an ex-pastors prior \"inappropriate relationship\"?\n Aren't those the words Haggard and the pastorial elite used to describe his \"relationship\" with the prostitute???\n \n This is part of the bigger picture on the problems I have with churches attempting to condemn homosexuality. It typically involves one dishonest situation after another.\n If they can't even come forward and openly say that one of their own did these gay things, then WHY should anyone trust them when they \"quote\" others who claim they no longer do gay things...\n \n One lie after another... :xbanghead", 
   {
    "post_info": {
     "post_title": "Pastor in Gay Scandal: Story Just Keeps Going..."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1233121560.0
  ], 
  [
   342137, 
   null, 
   "jyoshu", 
   "Who gives a farfegnugen what they do or don't come out and say about this? These sort of stories \"just keep going\" because people like yourself want to perpetuate them and judge churches by the lens of a single issue that gets way too much press already. Does anyone even CARE about the Haggard thing anymore?", 
   {}, 
   342119, 
   null, 
   1233161160.0
  ], 
  [
   342139, 
   null, 
   "thelmoose", 
   "Who gives a farfegnugen what they do or don't come out and say about this? These sort of stories \"just keep going\" because people like yourself want to perpetuate them and judge churches by the lens of a single issue that gets way too much press already. Does anyone even CARE about the Haggard thing anymore?\n\n \n The issue is that the New Life church kept Haggard on as its leader when they knew he was diddling with boys in the congregation. Apparently there are others that they hushed up as well. They only canned Haggard after the prostitute/crystal meth story became public. Thus they didn't mind Haggard's behavior if they could keep it quiet.\n \n I think this is a bigger deal than you are pretending to make it.", 
   {}, 
   342137, 
   null, 
   1233161640.0
  ], 
  [
   342142, 
   null, 
   "Archangel", 
   "\n The payments - part of a confidential legal settlement in 2007 that included money for counseling and college expenses - came from insurance money, not donations from members, the senior pastor of New Life, Brady Boyd, said in his sermon at the church in Colorado Springs.\n\n \n \nThis reads like \"hush money\".\n\n \n So you're implying that an insurance company was an accessory to an under the table hush money payoff? Can you prove this, or are we to just accept your opinion which is founded in anti-christian bigotry and hatred?\n \n \nAnd the evangelical church used INSURANCE money?\n What type of \"insurance\" covers payments to an ex-pastors prior \"inappropriate relationship\"?\n\n \n It's called liability insurance. And I don't know why you see fit to just assume that anything these people say in a public setting is an automatic lie when it can and would be exposed as a lie when it was denied by the insurance company, if it was a lie.\n \n \nThis is part of the bigger picture on the problems I have with churches attempting to condemn homosexuality. It typically involves one dishonest situation after another.\n\n \n Point out one dishonest situation after another which this church has participated in. Show where they have been anything but totally up front with this terribly embarrassing situation in which they have done nothing to cover up or deny the sin and betrayal of trust that their senior pastor committed? \n \n \nIf they can't even come forward and openly say that one of their own did these gay things, then WHY should anyone trust them when they \"quote\" others who claim they no longer do gay things...\n \n One lie after another... :xbanghead\n\n \n Show the quotes of any church representatives denying what Haggard did or even attempted to justify, cover up, or excuse his actions. Go on foundit support your allegations with something more than dishonest accusations and cynically based lip service which has absolutely no basis in fact at all. SUPPLY ACTUAL QUOTES, NOT JUST UNSUPPORTED ALLEGATIONS WHICH ARE BASED ON YOUR PERSONAL ANTI-CHRISTIAN HATRED. :xbanghead", 
   {
    "unicode_changes_made": true
   }, 
   342119, 
   null, 
   1233164760.0
  ], 
  [
   342143, 
   null, 
   "Archangel", 
   "The issue is that the New Life church kept Haggard on as its leader when they knew he was diddling with boys in the congregation. Apparently there are others that they hushed up as well. They only canned Haggard after the prostitute/crystal meth story became public. Thus they didn't mind Haggard's behavior if they could keep it quiet.\n \n I think this is a bigger deal than you are pretending to make it.\n\n \n I've missed these reports. Got an evidence of these allegations from any objective News source?", 
   {}, 
   342139, 
   null, 
   1233164880.0
  ], 
  [
   342144, 
   null, 
   "foundit66", 
   "Who gives a farfegnugen what they do or don't come out and say about this?\n\n As long as people keep quoting \"religious\" stories about \"ex-gays\" as some kind of proof of how things can be, I think the other side of the story should also be known.\n \n I don't see how you can make the statement you just made, and then quote the ex-gays regarding \"what they do ... come out and say\".\n \n \n \nThese sort of stories \"just keep going\" because people like yourself want to perpetuate them and judge churches by the lens of a single issue that gets way too much press already. Does anyone even CARE about the Haggard thing anymore?\n\n Jyoshu, this would NEVER HAVE BEEN a story if Haggard hadn't actively condemned homosexuals.\n It was his hypocrisy that made this a story. Not the fact that it was a \"church\".\n \n And who said anything about judging the church \"by the lens of a single issue\"?\n That's just your strawman coming out again.\n I'm sure this church has given financial aid to people who need it, but this is the \"GAY RIGHTS\" thread section, so that's what's discussed here... emoticon_rolleyes", 
   {}, 
   342137, 
   null, 
   1233165660.0
  ], 
  [
   342145, 
   null, 
   "jyoshu", 
   "The issue is that the New Life church kept Haggard on as its leader when they knew he was diddling with boys in the congregation. Apparently there are others that they hushed up as well. They only canned Haggard after the prostitute/crystal meth story became public. Thus they didn't mind Haggard's behavior if they could keep it quiet.\n \n I think this is a bigger deal than you are pretending to make it.\n\n \n Sorry, I didn't catch that issue on the initial read.\n \n The article clearly said the new senior pastor pointed out that \"church trustees and staff members were aware of no accusations before Mr. Haggard&#8217;s dismissal in November 2006.\" Even if they had been, I think often these situations are more complicated than they appear on the surface. It's very likely that the church didn't really believe Haggard was actually DOING anything with the young male church member. (Not boy\"s\", by the way. But that's how these things go, isn't it? Accusers talk about it, and next thing you know the singular has been changed to the plural, assistance turns into \"hush money\", and suddenly it's all a big conspiracy.) And given the complete lack of legal action toward Haggard when there certainly would be if there were anything to this, it may be that there was good reason for the church to assume that. For sure, it probably wasn't that cut and dry. And for that matter, what does \"young man\" mean exactly? You're clearly intimating \"underage\" or \"with a minor\" here; there's nothing in the article that really clears that up, from what I can see. Not that it would make it ok as he was a married man. \n \n On another note, if the allegations ARE true, it's yet another case of a gay man involved in bad stuff, and the perpetuating the news of that can never be good for gay people. Some here are trying to use it as a way to point fingers at churches, but the reality is that repeating stories of these sort of cases (such as in the Catholic Church) have probably done more harm in terms of the perception about gays than good.\n \n Regardless, this church needs to heal over this; they no doubt feel victimized by Haggard too, who led them along and lied to them. I think it would be nice if people could learn to leave them alone.\n \n \nAs long as people keep quoting \"religious\" stories about \"ex-gays\" as some kind of proof of how things can be, I think the other side of the story should also be known.\n \n I don't see how you can make the statement you just made, and then quote the ex-gays regarding \"what they do ... come out and say\".\n\n \n Because unlike you, I'm not passing judgment on people based on those statements, or more importantly assuming it's part of some larger trend of dishonesty about churches (even though it all fallaciously begs the question re. dishonesty in THIS case on the part of the church to begin with). I'm not the one sitting back assuming that those ex-gays are lying or taking an Anything-But-Legit approach to what they're saying. I'm simply saying no one really cares about the Haggard soap opera / fiasco. And that's what it has become. Something that belongs on the Jerry Springer show.", 
   {}, 
   342139, 
   null, 
   1233165900.0
  ], 
  [
   342147, 
   null, 
   "foundit66", 
   "So you're implying that an insurance company was an accessory to an under the table hush money payoff? Can you prove this, or are we to just accept your opinion which is founded in anti-christian bigotry and hatred?\n\n It's founded on logic. \"anti-christian bigotry\" has nothing to do with it.\n Put on your thinking cap and explain to me what type of \"insurance\" money can be given out in a situation where two people have an \"indecent relationship\", where at the end of the legal proceedings both sides are bound to silence on the situation...\n \n DUH!\n \n The article also explicitly says that the legal agreement, which includes paying this young man money, ALSO includes binding them to silence.\n \n \n \nIt's called liability insurance. And I don't know why you see fit to just assume that anything these people say in a public setting is an automatic lie when it can and would be exposed as a lie when it was denied by the insurance company, if it was a lie.\n\n I didn't say \"lie\".\n However, I did say \"dishonest\" and it is entirely dishonest for the church to pretend the image that Haggard only used this one gay prostitute, and then PAY OTHER MEN TO BE SILENT as entirely dishonest.\n \n \n \nPoint out one dishonest situation after another which this church has participated in. Show where they have been anything but totally up front with this terribly embarrassing situation in which they have done nothing to cover up or deny the sin and betrayal of trust that their senior pastor committed? \n\n Did you even read the article?\n The legal agreement was written to silence the young man.\n They could have also performed this \"agreement\" and MADE IT PUBLIC if they had so chosen.\n \n How can you question where they were not \"totally up front\" on a situation with a contract binding the parties to SILENCE???\n :xbanghead", 
   {}, 
   342142, 
   null, 
   1233166020.0
  ], 
  [
   342152, 
   null, 
   "jyoshu", 
   "So you're implying that an insurance company was an accessory to an under the table hush money payoff? Can you prove this .... ?\n\n \n Of course he can't prove it. You're just supposed to accept it as gospel based on the supposed \"logic\" of it all. emoticon_rolleyes ' Come on, Arch! Get with the program here! [slapping AA on the side of the head]", 
   {}, 
   342147, 
   null, 
   1233166440.0
  ], 
  [
   342153, 
   null, 
   "foundit66", 
   "Accusers talk about it, and next thing you know the singular has been changed to the plural, assistance turns into \"hush money\", and suddenly it's all a big conspiracy.[/I])\n\n Jyoshu, there is MORE that has come out on this issue...\n The CHURCH ITSELF admits that it's \"plural\"...\n COLORADO SPRINGS, Colo. --\n The gay prostitute who had a sexual relationship with New Life Church founder Ted Haggard has posted a video on YouTube saying several male church members contacted him to tell him that the pastor had inappropriate relations with them before he resigned in 2006.\n \n Mike Jones, whose revelations led to Haggard's dismissal from the church, said he made the video to express his anger at New Life church - both for failing to help the men, and for refusing to meet with him.\n \n Jones said he contacted Brady Boyd, New Life's senior pastor since August 2007, about Haggard's alleged relationships.\n \n \"I wanted to talk to him about the other young men that were coming to me with their stories. This was serious. And you know, Boyd refused to meet with me,\" said Jones, whose video comes on the heels of a revelation last week that Haggard had an inappropriate relationship with a male church volunteer.\n \n Boyd did not return phone calls Monday, but in an e-mail to congregants sent on Friday, he said the church did receive reports of \"a number of incidents of inappropriate behavior.\"\n \n \"In each case, we have tried our very best to do the right thing, including disciplinary action when appropriate,\" Boyd wrote. \"We renew our invitation today for anyone who believes he or she has been hurt to please come forward.\"Ledger-Enquirer.com | 01/26/2009 | Haggard had relations with several church members, prostitute says\n \n \nAnd given the complete lack of legal action toward Haggard when there certainly would be if there were anything to this, it may be that there was good reason for the church to assume that.\n\n \"lack of legal action towards Haggard\"? emoticon_xdonno\n Haggard was being kicked out. The target of \"legal action\" would not be \"Haggard\" in the first place.\n \n The first young man in question talked to the church, and this \"silence\" and \"payment\" are the consequences of that legal action.\n I am astounded you guys can't look at the elephant and admit it's an elephant!\n \n \n \nOn another note, if the allegations ARE true, it's yet another case of a gay man involved in bad stuff, and the perpetuating the news of that can never be good for gay people.\n\n What?\n You're trying to spin this towards gay men in general? emoticon_rolleyes\n \n The real issue is how the church causes gay men to repress themselves, and then THIS sort of junk comes to light.\n There are NUMEROUS articles on this forum posted about the dangers of people repressing homosexuality. The REPRESSION is the problem.\n \n \n \nRegardless, this church needs to heal over this; they no doubt feel victimized by Haggard too, who led them along and lied to them. I think it would be nice if people could learn to leave them alone.\n\n Doesn't \"healing\" require honesty?\n Do you think just hiding the bodies is the first legitimate step towards \"healing\"?\n \n And in addition, binding Haggard's victims to SILENCE???\n How do you think that works with THEIR healing???\n The silence is HINDERING the healing.", 
   {}, 
   342145, 
   null, 
   1233166560.0
  ], 
  [
   342154, 
   null, 
   "foundit66", 
   "Of course he can't prove it. You're just supposed to accept it as gospel based on the supposed \"logic\" of it all. emoticon_rolleyes ' Come on, Arch! Get with the program here! [slapping AA on the side of the head]\n\n \n You know, it's really obvious that when Jyoshu has no better counter-argument, he obviously goes in for mocking people for their argument...\n \n Jyoshu? Do you have a BETTER explanation, other than the one I have given?\n Naw. You just want to criticize me for concluding the obvious... emoticon_xhoho", 
   {}, 
   342152, 
   null, 
   1233166680.0
  ], 
  [
   342159, 
   null, 
   "jyoshu", 
   "Boyd did not return phone calls Monday, but in an e-mail to congregants sent on Friday, he said the church did receive reports of \"a number of incidents of inappropriate behavior.\"\n\n \n And so you make make the jump of assumption that number of INCIDENTS means multiple victims. \n \n I am SO glad you are not a trial judge, Foundit. Because if law worked on the basis that you tend to approach issues by assuming a dollar means a hundred, the innocent 'till proven guilty philosophy would be out the window by now ... You guys take MAJOR, SERIOUS allegations and base your assumptions on things like what you think is \"logic\" rather than FACTS. \"Incidents\" isn't the same as many 'victims', until there are facts--FACTS--present to support that. (In the same vein that we see happening in a different thread, opposition doesn't mean HATE.) This is a real problem with the way you guys approach things. And we see it over and over here ...\n \n \n\"lack of legal action towards Haggard\"? emoticon_xdonno\n Haggard was being kicked out. The target of \"legal action\" would not be \"Haggard\" in the first place.\n\n \n You don't understand what I'm saying. Inappropriate action with a minor is ILLEGAL. It would involve legal action by the POLICE. I'm not talking aboul civil action.\n \n \nThe real issue is how the church causes gay men to repress themselves, and then THIS sort of junk comes to light.\n There are NUMEROUS articles on this forum posted about the dangers of people repressing homosexuality. The REPRESSION is the problem.\n\n \n Sorry, but the church doesn't force anyone to abuse kids. The person is completely free to leave the church and live their life the way they want. What you're saying is like claiming it's a company's fault if an employee goes postal and kills someone due to job stress. No, the employee can leave the company ANY TIME if the stress is not something he can live with. Churches don't turn people into automatons. They have freedom of choice--that's exactly WHY some people DO leave the church. You're just trying to use this is an excuse to say something bad about churches, Foundit. Your comment claiming that churches attempting to condemn homosexuality \"typically involves one dishonest situation after another.\" is a dead giveway. And after a comment like that, for you to even BRING UP anyone generalizing a situation toward gay men is just sad.\n \n \nDoesn't \"healing\" require honesty?\n Do you think just hiding the bodies is the first legitimate step towards \"healing\"?\n\n \n It also requires people to stop trying to stab the church any chance they get. As if you have ANY sense of benevolence toward this church that you'd even care they heal, anyway.", 
   {}, 
   342153, 
   null, 
   1233167760.0
  ], 
  [
   342211, 
   null, 
   "foundit66", 
   "And so you make make the jump of assumption that number of INCIDENTS means multiple victims.\n I am SO glad you are not a trial judge, Foundit.\n\n If there's one thing I can count on, it's your insistence on 100%, beyond any possibility of apologetic excuse creation, demand for absolute proof (with video-tape) if anything involves criticism of Christianity or evangelicals or some association thereof...\n \n Jyoshu, if this were a TRIAL, I would NOT declare \"guilty\" off any of this. Furthermore, if you had stopped to THINK before your rush to hyperbole, I haven't even called for any type of criminal investigation. Much less declared any absolute standard like \"beyond a shadow of a doubt\" conclusion.\n I am dealing with the evidence at hand, whereas you are, as usual, refusing to come up with any more viable alternative and indicting others for stating the obvious conclusion.\n \n Plus, I have already given other verification that multiple VICTIMS exist, so it isn't just \"number of incidents\".\n Did you miss this part of the article \"...several male church members contacted him to tell him that the pastor had inappropriate relations with them before he resigned in 2006\"\n \n Did you even bother to read the whole article before you rushed to condemn me? If only you held yourself up to the same \"trial judge\" standards, but I know better than to expect that...\n \n To state it explicitly, NO. It wasn't just \"number of incidents\".\n Try reading next time before you rush in based on three words...\n \n \n \nYou don't understand what I'm saying. Inappropriate action with a minor is ILLEGAL. It would involve legal action by the POLICE. I'm not talking aboul civil action.\n\n I didn't understand what you didn't say.\n Thanks for elaborating after the fact...\n \n \n \nSorry, but the church doesn't force anyone to abuse kids. The person is completely free to leave the church and live their life the way they want.\n\n Your response is ignoring TONS of civil and criminal case law history whereby the organization that the person was a major player in, acting \"inappropriately\", has definitive legal repercussions for the larger organization itself.\n Yeah. The company \"does not force\" the boss to act illegally, but that doesn't mean the company can't be held liable (given circumstances) for the bosses actions...\n \n \n \nYou're just trying to use this is an excuse to say something bad about churches, Foundit. Your comment claiming that churches attempting to condemn homosexuality \"typically involves one dishonest situation after another.\" is a dead giveway. And after a comment like that, for you to even BRING UP anyone generalizing a situation toward gay men is just sad.\n\n Jyoshu, first of all I criticize the church for THEIR actions in this. THEIR COVERUP. THAT is the point which you fail to address.\n Additionally, this isn't the only issue.\n In fact, there is a long list of anti-gay organizations with definitive \"inappropriate\" actions.\n And trust me. I am NOT using this one example to \"stereo-type\" anything.\n \n \n \nIt also requires people to stop trying to stab the church any chance they get. As if you have ANY sense of benevolence toward this church that you'd even care they heal, anyway.\n\n ROFLMAO.\n That, in and of itself, demonstrates the type of callous disregard for the reality of the situation.\n The church IS NOT THE VICTIM here.\n The church COVERED UP the issue, which wasn't good for the REAL victim, which was the young man who was victimized.\n And it came around and caused him LATER stress when he saw how \"Haggard\" was being treated. This young man NEVER got justice, and this lack of justice HARMED him psychologically.\n \n \"benevolence toward this church that you'd even care they heal\"\n LOL! The CHURCH isn't the one that needs the healing.\n But it obviously shows where YOUR priorities are...\n And that is PRECISELY the mentality I am talking about...\n Time and time again, the \"ex-gay\" or \"reparative therapy\" groups put the CHURCH or the EX-GAY CAUSE or the ATTACK ON HOMOSEXUALITY BEFORE the interests of the actual individuals they are supposed to treat or \"counsel\"...\n \n You just proved my point!", 
   {}, 
   342159, 
   null, 
   1233179700.0
  ], 
  [
   342233, 
   null, 
   "sinjin", 
   "Haggard is obviously not a Christian after all. Are the congregation members he had relations with still Christians? If not, were they ever? I get confused. And where does the Holy Spirit go while you're sinning your pants off?", 
   {}, 
   342211, 
   null, 
   1233186600.0
  ], 
  [
   342240, 
   null, 
   "gansao", 
   "Haggard is obviously not a Christian after all. Are the congregation members he had relations with still Christians? If not, were they ever? I get confused.\n\n The church is not necessarily the religion, thats why you are confused.\n \n \nAnd where does the Holy Spirit go while you're sinning your pants off?\n\n That does not actually mean anything at all .", 
   {}, 
   342233, 
   null, 
   1233188220.0
  ], 
  [
   342244, 
   null, 
   "sinjin", 
   "The church is not necessarily the religion, thats why you are confused.\nTrue Christians are like responsible pit bull owners. Everything's fine until it's not.\n \n \nThat does not actually mean anything at all .\nDemanding comment on your part.", 
   {}, 
   342240, 
   null, 
   1233189840.0
  ], 
  [
   342245, 
   null, 
   "Penfold", 
   "Haggard is obviously not a Christian after all. Are the congregation members he had relations with still Christians? If not, were they ever? I get confused. And where does the Holy Spirit go while you're sinning your pants off?\n\n \n No true Christian..... As for the HS, as it's supposedly immanent, it must be in your pants with you!emoticon_ic", 
   {}, 
   342233, 
   null, 
   1233190200.0
  ], 
  [
   342249, 
   null, 
   "foundit66", 
   "One other things I find intriguing about the article and the church reaction is that some people routinely insist that it is \"gay sex\" which is the real problem, and argue against any position that claims the church extends its fight against gay individuals (not just the sex)...\n \n But here, the article quotes Mr. Haggard (via a PR firm). \"But in an e-mail statement issued by a public relations firm for an HBO documentary about Mr. Haggard, he said there had been \"no physical contact\" with the young man, though he said he had asked forgiveness for what he described as an \"inappropriate relationship.\"\n The other article I quoted states: \"Boyd did not return phone calls Monday, but in an e-mail to congregants sent on Friday, he said the church did receive reports of \"a number of incidents of inappropriate behavior.\"\"\n \n So if \"gay sex\" is the only taboo, and they supposedly had \"no physical contact\", what \"inappropriate behavior\" could there have been?\n It's all so contradictory...\n \n \n \nNo true Christian..... As for the HS, as it's supposedly immanent, it must be in your pants with you!\n\n :p", 
   {
    "unicode_changes_made": true
   }, 
   342240, 
   null, 
   1233197100.0
  ], 
  [
   342259, 
   null, 
   "Archangel", 
   "It's founded on logic. \"anti-christian bigotry\" has nothing to do with it.\n\n \n Sure it does; that's why you surf the internet searching out any and every single negative article and story you can find which gives you ammo to attack christians with. And each of these stories which involve an individuals sin or shortcoming, you use to condemn the whole body. So at least be honest and admit that you are motivated by anti-christian bigotry.\n \n \nPut on your thinking cap and explain to me what type of \"insurance\" money can be given out in a situation where two people have an \"indecent relationship\", where at the end of the legal proceedings both sides are bound to silence on the situation...\n\n \n No foundit, you put on your thinking cap for once. And the answer to your question is here from an actual insurance company which sells it to churches. Church Mutual Insurance Company - Insurance Coverage\n Comprehensive and specialized coverage. We offer property, general liability, sexual molestation/misconduct liability, professional liability, employment practices liability, employee benefits liability, workers' compensation, auto, and umbrella liability insurance. The property and liability coverages are designed specifically for the exposures of religious ministries. More coverage details.\n \nThe article also explicitly says that the legal agreement, which includes paying this young man money, ALSO includes binding them to silence.\n\n \n Really? Then why didn't the pastor just threaten the young man with a law suit for breach of contract if he spoke out rather than make the announcement to the church body because the young man told him he was considering speaking out about Haggard?? If silence, rather than remaining silent in order to protect the victim was the churches motivation for remaining silent, then they could have recouped every penny paid in response to this issue, plus punitive damages. And the Insurance company would have been the plaintiff.\n \n \nI didn't say \"lie\".\n However, I did say \"dishonest\".\n\n \n To speak dishonestly is to lie, and you know it. Don't play a game of semantics here. Everything you said implied they have lied, deceived, covered up the truth and attempted to pay hush money to that person. \n \n \nDid you even read the article?\n The legal agreement was written to silence the young man.\n They could have also performed this \"agreement\" and MADE IT PUBLIC if they had so chosen.\n\n \n It is absolutely reasonable and even expected that the church would have a position of complete silence on this issue so as not to further traumatize or embarrass this young man in public. Now rather than continue to make libelous claims as you lie about the church's position or actions here, just provide objective evidence that the church paid hush money or attempted to silence this young man rather than remained silent in order to protect him? \n \n \nHow can you question where they were not \"totally up front\" on a situation with a contract binding the parties to SILENCE???\n :xbanghead\n\n \n See my answer above; that's how!", 
   {}, 
   342147, 
   null, 
   1233241080.0
  ], 
  [
   342261, 
   null, 
   "Penfold", 
   "Does anyone else find a discordant note in this spirited defence of the church? Why would a specialist insurer offer as a selling point, cover for \"sexual molestation/misconduct\" within their specifically designed ministry package? They obviously see it as part and parcel of the day to day exposure to risk.", 
   {}, 
   342259, 
   null, 
   1233242700.0
  ], 
  [
   342266, 
   null, 
   "jyoshu", 
   "If there's one thing I can count on, it's your insistence on 100%, beyond any possibility of apologetic excuse creation, demand for absolute proof (with video-tape) if anything involves criticism of Christianity or evangelicals or some association thereof...\n\n \n And if there's one thing I can count on, it's your insistence that we can assume guilt and should make a public spectacle of the matter before even investigating any matter. \n \n \nI am dealing with the evidence at hand, whereas you are, as usual, refusing to come up with any more viable alternative and indicting others for stating the obvious conclusion.\n\n \n Yeah, you're dealing with all that 'evidence' (ooh, a few people made an accusation against a pastor everyone is angry at) and you've basically assumed guilt here on the part of the church leaders AND Haggard. An accusation automatically means to you that, a.) it's true, apparently, and b.) there was some conspiracy \"cover-up\" by the church. emoticon_rolleyes Again, it's funny how the police don't seem to think there's anything to this, apparently--but YOU sure do.\n \n And before you start dishonestly misrepresenting here--no one is saying the 'young man' wasn't victimized. No one is saying something didn't go horribly wrong here. But rushing to judgment on things doesn't help anyone or anything either.\n \n \nPlus, I have already given other verification that multiple VICTIMS exist, so it isn't just \"number of incidents\".\n Did you miss this part of the article \"...several male church members contacted him to tell him that the pastor had inappropriate relations with them before he resigned in 2006\"\n \n Did you even bother to read the whole article before you rushed to condemn me? If only you held yourself up to the same \"trial judge\" standards, but I know better than to expect that...\n\n \n And these need to be investigated from a LEGAL standpoint, rather than people like you doing a rush to judgment. That church has more than 10,000 members in it, and when you have THAT many people, \n \n If we were talking about a TOWN here (which is appropriate in terms of those numbers), should we ASSUME that \"several\" accusations made against the mayor or aldermen are legit just BASED ON THE FACT THOSE ACCUSATIONS ARE THERE? No. But you hold up this standard about churches that throws out the presumption of innocence. That seems to be the only arena--Christians--where you do that, Foundit. Hmm ... now, wonder why that is? :)\n \n Come back when someone is actually found guilty of something (or heck, even deemed worthy of investigation by the authorities would be at least SOMETHING).\n \n \nCLAFCLO. Didn't say it means the company can't be held liable. That's a different issue than whether or not the church LEADERSHIP should have been public or not.\n\n \n What people like you don't get sometimes is that pastors who do this terrible stuff is new territory for churches sometimes. It's not like they were seeking to get an abusive gay pastor. The leadership at that church was likely as shellshocked as anyone. And sometimes it's not easy to no what to do in a situation that is new or THAT shocking, and sometimes there's a period of flat out denial.\n \n There's no reason to be looking for any excuse to point a finger at churches like this. You should be giving them at least SOME benefit of the doubt, and drop this transparent guilty-till-proven innocent approach of yours. At least until some FACTS are found.\n \n \nThe church IS NOT THE VICTIM here.\n\n \n No, not \"THE\" victim--but the church WAS among the victims here too. That congregation was lied to by this Haggard. They were led along under ONE assumption, and something sinister turned out to be the case. How is it then, that they were not also victims here? When trust is broken like that, there often has to be healing. Get in the real world, Foundit.\n \n Foundit, after all this time, do you still not realize that churches are made up of PEOPLE--not JUST some evil beurocratic committee ('cause I know that's how you think of church leadership)? We'd better review this, before you dishonestly misrepresent it ...\n \n - Your position: the \"young man\" was a victim\n \n - My position: both the \"young man\" AND the church was a victim\n \n Just so you don't try and pull your junk trying to portray me or anyone here as saying the young man wasn't a victim. That's not up for debate; everyone knows that already. \n \n \nThe church COVERED UP the issue, which wasn't good for the REAL victim, which was the young man who was victimized.\n\n \n The church LEADERSHIP may have \"covered it up\". No one is saying that's not a possibility. But I'd be curious as to what you expect church leaders to do, exactly. Put up a sign that says \"HEY, WE HAD A PASTOR WHO WAS ABUSIVE\"? How, exactly, is it that you think they \"covered it up\"? Your \"hush money\" allegation? And what good would it have done to make a public spectacle out of it anyway? It's hilarious how people like you want churches to go through bad things as publicly as possibly, but you absolutely HATE it when the shoe is on the foot and things PUBLICLY come to light about the gay pride movement! :p\n \n \nLOL! The CHURCH isn't the one that needs the healing.\n\n \n You're wrong; yes they are. BOTH need healing (the \"young man\" AND the church--and by 'church' I mean the CONGREGATION.) Haggard lied to the church and dragged this through this mess too. That you can't see the BIGGER picture here (or refuse to) doesn't surprise me one bit though. To do so would require you to not have to say bad things about Christians so much ...\n \n It's funny how you want to see situations like this in terms of it affecting PEOPLE and INDIVIDUALS when it's convenient for you argument and cause, but if it has anything to do with a CHURCH, you can't bring yourself to do that. emoticon_xangel", 
   {}, 
   342211, 
   null, 
   1233249540.0
  ], 
  [
   342267, 
   null, 
   "jyoshu", 
   "They obviously see it as part and parcel of the day to day exposure to risk.\n\n \n Why shouldn't they? There's always the risk of lawsuit or spectacle-making allegations made by disgruntled people in this litigation-prone era, regardless of whether or not the situation really did or didn't happen. Any professional group or person who does any sort of counseling or offers such services would be very foolish to not have such insurance. In other words, I think any person that does that sort of work--and this includes legit counselors, psychologists, clergy, etc.--would say there is ALWAYS risk there. You probably wouldn't be able to find a counseling services organization or group that didn't have insurance to cover this sort of thing, and really, anyone in a professional role such as that would be pretty stupid to not do so.", 
   {}, 
   342261, 
   null, 
   1233250080.0
  ], 
  [
   342272, 
   null, 
   "foundit66", 
   "Sure it does; that's why you surf the internet searching out any and every single negative article and story you can find which gives you ammo to attack christians with.\n\n Archie, you DO NOT want to go there.\n Cause we BOTH KNOW that you have a history of doing precisely that. And you found stuff like \"Paul Cameron\" resources and white supremacists who have echoed your sentiments, and you posted them.\n \n And as for your claim, you are just plain wrong.\n Haggard's stuff broke on national news. I didn't have to go \"searching\" for anything.\n If anything, I have an interest in documenting how gays are discriminated against and harmed. Just because Christians are typically involved doesn't mean they were my target.\n \n What you just pulled is like complaining a person is \"anti-man\" because the person does Rape research.\n \n \n \nAnd each of these stories which involve an individuals sin or shortcoming, you use to condemn the whole body. So at least be honest and admit that you are motivated by anti-christian bigotry.\n\n Again, very wrong.\n There are a LOT of Christians out there who would find your approach VERY anti-Christian.\n I am against the people who bash gays. Do NOT confuse that with the whole group of Christians.\n Cause if Jyoshu cared about it when the anti-gay side said it, he would correct you on that...\n \n \n \nNo foundit, you put on your thinking cap for once. And the answer to your question is here from an actual insurance company which sells it to churches. Church Mutual Insurance Company - Insurance CoverageComprehensive and specialized coverage. We offer property, general liability, sexual molestation/misconduct liability, professional liability, employment practices liability, employee benefits liability, workers' compensation, auto, and umbrella liability insurance. The property and liability coverages are designed specifically for the exposures of religious ministries. More coverage details.\n\n As usual, you don't answer my question, and you don't even realize it.\n I asked: \"Put on your thinking cap and explain to me what type of \"insurance\" money can be given out in a situation where two people have an \"indecent relationship\", where at the end of the legal proceedings both sides are bound to silence on the situation...\"\n Do you see \"indecent relationship\" on that list?\n No. It's not there.\n I see \"sexual molestation\" on that list. But no \"indecent relationship\".\n My point is that if insurance \"covered\" this, it involved a whole LOT more than an \"indecent relationship\" with \"no physical contact\".\n \n \n \nThe article also explicitly says that the legal agreement, which includes paying this young man money, ALSO includes binding them to silence.\n\n \nReally? Then why didn't the pastor just threaten the young man with a law suit for breach of contract if he spoke out rather than make the announcement to the church body because the young man told him he was considering speaking out about Haggard??\n\n I invite the viewing public to read WHAT I ACTUALLY SAID.\n Did I say anything about \"threatening the young man with a law suit\"? No.\n And the article itself EXPLICITLY states that the young man and the church were told to keep quiet. The article explicitly states they were \"kept quiet\" due to \"legal restraints\".\n \n \n \nIf silence, rather than remaining silent in order to protect the victim was the churches motivation for remaining silent, then they could have recouped every penny paid in response to this issue, plus punitive damages. And the Insurance company would have been the plaintiff.\n\n Again, Archie you don't have the big picture here.\n The man DID NOT say they had sex.\n The church fell all over themselves to get their spin on things out before the young man could say too much, but the young man DID NOT say they had sex.\n Absent that, how is the contract broken?\n \n Furthermore, I kind of wish the church would break the contract, but they lack the moral back-bone to stick to honesty on this. If the church decided to take back the money, the young man has NOTHING TO KEEP HIM QUIET.\n Ergo, he can tell the whole story.\n I wonder if Haggard shared meth with this kid...\n \n \n \nTo speak dishonestly is to lie, and you know it. Don't play a game of semantics here. Everything you said implied they have lied, deceived, covered up the truth and attempted to pay hush money to that person. \n\n http://www.4forums.com/political/gay-rights-debates/12282-christian-newswire-spreading-bigotry.html#post342210\n I just wasted a web-page of non-topical discussion with \"Lurch\" who obviously disagrees with you.\n What I am \"not getting into\" is another pointless discussion which fixates endlessly on how a word is defined.\n This isn't semantics.\n The church was part of COVERING UP THE TRUTH.\n For you to quibble over whether that is \"dishonest\" is incredibly ridiculous. I actually have higher standards for Christianity than you do, cause I see such a ploy as INCREDIBLY un-christian.\n \n \n \nIt is absolutely reasonable and even expected that the church would have a position of complete silence on this issue so as not to further traumatize or embarrass this young man in public. Now rather than continue to make libelous claims as you lie about the church's position or actions here, just provide objective evidence that the church paid hush money or attempted to silence this young man rather than remained silent in order to protect him? \n\n Why did the church insist the young man had to keep quiet?\n Do you think it helps victims to have to be kept quiet about what they went through? For justice to be denied?\n And THAT is part of what prompted the whole story coming out in the first place. The young man could not handle Haggard being seen as something he was not. He couldn't take the \"silence\" that the church's legal position imposed upon him.\n \n \n \nSee my answer above; that's how!\n\n See my answer above; that's how not!", 
   {}, 
   342259, 
   null, 
   1233252480.0
  ], 
  [
   342289, 
   null, 
   "Archangel", 
   "Archie, you DO NOT want to go there.\n Cause we BOTH KNOW that you have a history of doing precisely that.\n\n I want to go precisely there foundit, just to expose your typically skewed interpretation of reality if for no other reason. Here is the link to every thread I have started; 59 of them; please note the specific subject matter of each of the \"four\" debates I have started on the Gay Rights Forum. 2 of them are gay related but not an attack on homosexuals, where as the other 2 expose the corruption of what the gay agenda represents. 4Forums.com Political Debates and Polls - Search Results\n \n Here is the link to threads you have started: 4Forums.com Political Debates and Polls - Search Results around 110 out of 160 are in the Gay Rights Forum, and the vast majority of them are anti-christian in nature. So NO FOUNDIT, I don't have a history of doing the same thing. What I have a history of is defending against your endless and persistent attacks on Christianity by pointing to any sin committed by any individual you can label a christian. You thrive on making sweeping generalizations which you will argue in favor of ad infinitum as you link them to the larger body of Christ.\n \n \n And as for your claim, you are just plain wrong.\n Haggard's stuff broke on national news. I didn't have to go \"searching\" for anything.\n If anything, I have an interest in documenting how gays are discriminated against and harmed. Just because Christians are typically involved doesn't mean they were my target.\n\n \n Sure, Haggards stuff broke on National News, but only the homosexual community is attempting to condemn the whole of Christianity by distorting the churches part in it. This thread is more about the church than it is about Haggard and your evidence is the word of a homosexual prostitute as if he's a credible source at all. Go figure huh?\n \n \nAgain, very wrong.\n There are a LOT of Christians out there who would find your approach VERY anti-Christian.\n I am against the people who bash gays. Do NOT confuse that with the whole group of Christians.\n Cause if Jyoshu cared about it when the anti-gay side said it, he would correct you on that...\n\n \n I repeat for clarification: most every thread you start is motivated by anti-christian bigotry and hatred. Own it cuz you represent it and all anyone need do is click on that link to your threads above for solid undeniable evidence of the quality of the threads you post here.\n \n \nAs usual, you don't answer my question, and you don't even realize it.\n I asked: \"Put on your thinking cap and explain to me what type of \"insurance\" money can be given out in a situation where two people have an \"indecent relationship\", where at the end of the legal proceedings both sides are bound to silence on the situation...\"\n Do you see \"indecent relationship\" on that list?\n No. It's not there.\n I see \"sexual molestation\" on that list. But no \"indecent relationship\".\n My point is that if insurance \"covered\" this, it involved a whole LOT more than an \"indecent relationship\" with \"no physical contact\".\n\n \n According to Haggard on Oprah yesterday, he had no sexual contact at all with that guy who was over 18 years old at the time. So prove he had sexual contact with anyone else or stop making unsupported accusations.\n \n \nI invite the viewing public to read WHAT I ACTUALLY SAID.\n Did I say anything about \"threatening the young man with a law suit\"? No.\n\n \n Correct, I said it. If such a clause existed as a legal requirement of a hush money pay off as you assert, then when this guy contacted the church and said he wanted to go public, all they legal staff had to do was to say you signed a legal non disclosure document and if you break that agreement we will sue you for every penny we have given you and we will win in court. This tells me the church kept this private for the sake of the victim, but not because of a non disclosure agreement which you are stretching in order to imply it exists.\n \n \nAnd the article itself EXPLICITLY states that the young man and the church were told to keep quiet. The article explicitly states they were \"kept quiet\" due to \"legal restraints\".\n\n \n Being told to remain confidential isn't making it a legal requirement of the monetary assistance they gave this guy for counseling or else they could have prevented him from speaking when he said he wanted to.\n \n \nAgain, Archie you don't have the big picture here.\n The man DID NOT say they had sex.\n The church fell all over themselves to get their spin on things out before the young man could say too much, but the young man DID NOT say they had sex.\n Absent that, how is the contract broken?\n\n \n Exactly, because they didn't have sex. The point is a legal one. If a non-disclosure agreement was a part of the settlement, then it doesn't matter what occurred. The victim had no right to ever speak publicly about it or else he would have revoked that compensation. There was no force to require him to remain silent according to your own link.\n \n \nFurthermore, I kind of wish the church would break the contract, but they lack the moral back-bone to stick to honesty on this. If the church decided to take back the money, the young man has NOTHING TO KEEP HIM QUIET.\n Ergo, he can tell the whole story.\n I wonder if Haggard shared meth with this kid...\n\n \n Foundit, your own article said the guy contacted the church a few weeks ago saying he was thinking about speaking out in light of Haggards current press. This is what motivated the pastor to publicly announce what he did to the church. So how can you say in good conscience that the victim is being silenced by the church? He obviously isn't. Are you completely incapable of viewing anything regarding christians objectively?", 
   {}, 
   342272, 
   null, 
   1233258900.0
  ], 
  [
   342316, 
   null, 
   "gansao", 
   "True Christians are like responsible pit bull owners. Everything's fine until it's not.\n \n\n \n Your are more confused than I thoughtemoticon_rolleyes", 
   {}, 
   342244, 
   null, 
   1233266640.0
  ], 
  [
   342317, 
   null, 
   "foundit66", 
   "I want to go precisely there foundit, just to expose your typically skewed interpretation of reality if for no other reason. Here is the link to every thread I have started; 59 of them; please note the specific subject matter of each of the \"four\" debates I have started on the Gay Rights Forum. 2 of them are gay related but not an attack on homosexuals, where as the other 2 expose the corruption of what the gay agenda represents. 4Forums.com Political Debates and Polls - Search Results\n\n This is the second time you've tried that obfuscation.\n Just cause you don't \"start threads\" doesn't mean anything about your blatantly anti-gay habits while posting.\n You prefer to post your slurs against gays in EXISTING threads that you didn't start. That doesn't mean you don't post slurs against gays.\n \n \n \nHere is the link to threads you have started: 4Forums.com Political Debates and Polls - Search Results around 110 out of 160 are in the Gay Rights Forum, and the vast majority of them are anti-christian in nature. So NO FOUNDIT, I don't have a history of doing the same thing.\n\n Actually, it would be more accurate to realize they are \"anti- anti-gay Christian\".\n I have no problem with Christians who don't actively espouse discrimination against gays, or who don't lie about gays, or who just leave gays alone.\n What you can't seem to wrap your head around is the idea that people can think homosexuality is \"immoral\", without turning it into an attack on gays.\n \n \n \n What I have a history of is defending against your endless and persistent attacks on Christianity by pointing to any sin committed by any individual you can label a christian. You thrive on making sweeping generalizations which you will argue in favor of ad infinitum as you link them to the larger body of Christ.\n\n Let me make that statement a little more accurate, except it's coming from me...\n What I have a history of is defending against your endless and persistent attacks on homosexuals by pointing to any irrational prejudice committed by anti-gay individuals, who happen to label themselves as a christian. You thrive on making sweeping generalizations which you will argue in favor of ad infinitum as you link them to the larger body of gays in general.\n \n \n \nSure, Haggards stuff broke on National News, but only the homosexual community is attempting to condemn the whole of Christianity by distorting the churches part in it.\n\n What distortion?\n Where is the \"distortion\"?\n \n I have tossed out a variety of facts. I have also pointed to contradictions in the church's story. I have pointed to things which are logical conclusions, based on the evidence at hand.\n I have distorted nothing.\n \n \n \nThis thread is more about the church than it is about Haggard and your evidence is the word of a homosexual prostitute as if he's a credible source at all. Go figure huh?\n\n The only thing I have quoted the gay prostitute on is his corroboration that there are multiple victims.\n And considering the church HAS ALREADY HID this issue in the first place, while the gay prostitute has been nothing but honest, I'd say it's the church that has to prove their credibility...\n \n \n \nI repeat for clarification: most every thread you start is motivated by anti-christian bigotry and hatred. Own it cuz you represent it and all anyone need do is click on that link to your threads above for solid undeniable evidence of the quality of the threads you post here.\n\n You can \"repeat\" yourself until you're blue in the face.\n My motivation is the defense of gays. Just because I point out that the attacks typically come from a \"Christian\" source dosen't mean that all of Christianity is like that.\n And the really funny thing is that no matter how often I point that out to you, it won't sink into your head.\n Another funny thing is that I have to CORRECT you on that, while it's usually Jyoshu's schtick to try to complain if somebody categorizes Christianity as \"anti-gay\".\n \n \n \nAccording to Haggard on Oprah yesterday, he had no sexual contact at all with that guy who was over 18 years old at the time. So prove he had sexual contact with anyone else or stop making unsupported accusations.\n\n Yeah. You trust Haggard, the guy who PURCHASED a gay prostitute repeatedly, AND meth.\n Funny how your double standards work...\n \n Haggard has already been busted for deception. Using him as a resource for defense is insane.\n \n \n \nCorrect, I said it. If such a clause existed as a legal requirement of a hush money pay off as you assert, then when this guy contacted the church and said he wanted to go public, all they legal staff had to do was to say you signed a legal non disclosure document and if you break that agreement we will sue you for every penny we have given you and we will win in court. This tells me the church kept this private for the sake of the victim, but not because of a non disclosure agreement which you are stretching in order to imply it exists.\n\n Don't do that.\n The issue is that the church REQUIRED THE VICTIM to be silent.\n That is NOT in the interests of the victim. The victim should have the right to do what he wants.\n \n And like I said, since the victim has not said \"we have had sexual contact\", no contract is broken.\n I would LOVE for somebody to ask him directly, so he could settle (for you and Jyoshu) EXACTLY WHAT he is required to be kept silent on.\n This is obvious to any but those who refuse to see.\n \n It's funny how you guys can take creation of the world and eternal damnation and belief in Jesus as absolute truths...\n ... but when it comes to putting two and two together for this case, you demand absolute proof and refuse to admit the most obvious conclusion.\n If all of Christianity applied such standards to their OWN religious beliefs, there would be no church...\n \n \n \nBeing told to remain confidential isn't making it a legal requirement of the monetary assistance they gave this guy for counseling or else they could have prevented him from speaking when he said he wanted to.\n\n Archie, how do you think these \"stay silent by legal contract\" things work in the first place?\n The victim WAS GIVEN SOMETHING in order to get him to sign the contract.\n Do you think he was approached and was told \"Here's a lot of money. And we'd like you to sign this confidentiality contract, but you don't have to\".\n The apologetic nonsense on this board is absolutely AMAZING!\n \n \n \nExactly, because they didn't have sex.\n\n Again, I would love for somebody to interview this victim to remove the excuses that you guys keep throwing out there.\n I would love for the contract to be made public, so you guys wouldn't be able to hide under a rock to avoid the obvious.\n I point to the obvious conclusion, and you make up all sorts of nonsense that makes no sense.\n \n \n \nThe point is a legal one. If a non-disclosure agreement was a part of the settlement, then it doesn't matter what occurred. The victim had no right to ever speak publicly about it or else he would have revoked that compensation. There was no force to require him to remain silent according to your own link.\n\n My link EXPLICITLY SAID the legal contract kept them quiet.\n A non-disclosure agreement WAS part of the settlement, and \"what occurred\" matters cause IT IS THE TRUTH.\n And \"the victim\" has every right to \"speak publicly\". He just cannot violate the contract which will SPECIFY WHAT he cannot say.\n \n \n \nFoundit, your own article said the guy contacted the church a few weeks ago saying he was thinking about speaking out in light of Haggards current press. This is what motivated the pastor to publicly announce what he did to the church. So how can you say in good conscience that the victim is being silenced by the church? He obviously isn't. Are you completely incapable of viewing anything regarding christians objectively?\n\n Again, you come up with 2+2 and say \"rabbit\".\n He told the church he was thinking about speaking out. That was what motivated the pastor to speak publicly.\n But the WORDS OF THE ARTICLE and the EXPLICIT STATEMENT OF THE CHURCH are what DIRECTLY EXPLAIN that there was a contract which silenced both parties on some issue.", 
   {}, 
   342289, 
   null, 
   1233266940.0
  ], 
  [
   342323, 
   null, 
   "foundit66", 
   "And if there's one thing I can count on, it's your insistence that we can assume guilt and should make a public spectacle of the matter before even investigating any matter.\n\n Jyoshu? I think if you had your way NOBODY could comment on it because you would ALWAYS find something that \"we don't know\" and thus nobody can make any logical conclusions. \n \n I am presenting the obvious conclusion. You are free to interject any different conclusion you think is more viable.\n But you don't, cause you can't, cause the conclusion I have reached IS the obvious one with the facts on hand.\n There is no logic in tying people's hands from not THINKING about this and coming to a conclusion with what we know.\n \n Lord knows that you and Archie have no problem taking \"well, a person who claims to have talked to god said this about homosexual sex being a sin thousands of years ago\", and \"assuming guilt\" based on that.\n Do you criticize people (like anti-gay Christians) who want to deny gays rights and repeat that they think gays are going to hell based on this sketchy evidence?\n Of course not, cause that's your \"religious beliefs\"...\n \n But this LOGICALLY CONCLUDED ANALYSIS is the one you balk at...\n \n \n \nYeah, you're dealing with all that 'evidence' (ooh, a few people made an accusation against a pastor everyone is angry at) and you've basically assumed guilt here on the part of the church leaders AND Haggard. An accusation automatically means to you that, a.) it's true, apparently, and b.) there was some conspiracy \"cover-up\" by the church. emoticon_rolleyes Again, it's funny how the police don't seem to think there's anything to this, apparently--but YOU sure do.\n\n What crime has actually been committed?\n I haven't \"assumed\" any crime, so the lack of police involvement is not surprising.\n It doesn't mean that the church didn't do a \"cover-up\" of something that would have been EMBARRASSING.\n They lost a LOT of members off the last scandal. You think the church didn't have a monetary interest in preventing other scandals being made known???\n \n The insurance company PAID OUT. WHAT sort of situation could have occurred that would make an insurance company pay out?\n \"improper relationship\" with \"no physical contact\" is sure as heck NOT on that list...\n \n \n \nAnd before you start dishonestly misrepresenting here--no one is saying the 'young man' wasn't victimized. No one is saying something didn't go horribly wrong here. But rushing to judgment on things doesn't help anyone or anything either.\n\n You know what's really funny here?\n The CHURCH is the one holding the cards. THEY HAVE the information.\n WHY don't you have any commentary for THEM to release the truth? Or at the very least, allow the young man to talk about what he wants to with no legal repercussions.\n \n \n \nAnd these need to be investigated from a LEGAL standpoint, rather than people like you doing a rush to judgment. That church has more than 10,000 members in it, and when you have THAT many people, \n If we were talking about a TOWN here (which is appropriate in terms of those numbers), should we ASSUME that \"several\" accusations made against the mayor or aldermen are legit just BASED ON THE FACT THOSE ACCUSATIONS ARE THERE? No.\n\n Over and OVER and OVER again, you pretend to provide a \"summary\" of the situation, but you leave out KEY DETAILS.\n You failed to mention that in this case, the mayor had a LONG TERM RELATIONSHIP with a prostitute, whom he bought METH from.\n You failed to mention that the \"city council\" (or church leadership) paid another victim to be silent via a legal contract.\n \n You leave out key pieces of information on the situation, and pretend we're \"rushing to judgment\".\n A LOT of what I have done is state questions, that lead to obvious conclusions.\n The story that the \"mayor\" and the \"city council\" are putting out there DOES NOT MAKE SENSE.\n \n And instead of you ADMITTING that their story doesn't make sense, you criticize anybody who comes to an obvious conclusion on the situation.\n \n \n \n \nWhat people like you don't get sometimes is that pastors who do this terrible stuff is new territory for churches sometimes. It's not like they were seeking to get an abusive gay pastor. The leadership at that church was likely as shellshocked as anyone. And sometimes it's not easy to no what to do in a situation that is new or THAT shocking, and sometimes there's a period of flat out denial.\n\n And how many years later into this \"denial\" are we?\n How much time did we go through where the church paid the victim to keep quiet?\n \n I could understand a situation where they had an inital reaction, but in this they kept it in a situation where the victim was bound to silence for how many months???\n \n \n \nThere's no reason to be looking for any excuse to point a finger at churches like this.\n\n WoW!\n The church has the power keeping this situation silent.\n You say we don't have enough information, and evidently can't reach any personal conclusion with existing info...\n And yet you have absolutely no criticism for the church?\n \n Funny how convenient that is for you.\n \n \n \nYou should be giving them at least SOME benefit of the doubt, and drop this transparent guilty-till-proven innocent approach of yours. At least until some FACTS are found.\n\n Facts have been found.\n If you want to find out MORE facts, then I suggest you start asking questions as to why the church HAS NOT RELEASED REAL facts on the situation.\n \n \n \nNo, not \"THE\" victim--but the church WAS among the victims here too. That congregation was lied to by this Haggard. They were led along under ONE assumption, and something sinister turned out to be the case. How is it then, that they were not also victims here? When trust is broken like that, there often has to be healing. Get in the real world, Foundit.\n\n In the big picture, you're comparing mountains to ant-hills.\n \n And on another hand, it's amusing how people talk about gays being victimized by anti-gay Christians, and the harm we experience. You try to hinder any realization of harm by denigrating it.\n But here, a \"lie\" is something that brings about a \"victim\" categorization by you...\n \n What about all the gays that anti-gay Christians LIE about?\n Is it wrong to talk about the HARM that is experienced there?\n \n Your double-standards are showing...\n \n \n \nThe church LEADERSHIP may have \"covered it up\". No one is saying that's not a possibility. But I'd be curious as to what you expect church leaders to do, exactly. Put up a sign that says \"HEY, WE HAD A PASTOR WHO WAS ABUSIVE\"? How, exactly, is it that you think they \"covered it up\"? Your \"hush money\" allegation?\n\n If they were truly interested in honesty and helping the victim, they would aid the victim without requiring him to be quiet.\n What the victim says would be HIS choice, independent of any aid.\n \n Requiring him to be quiet demonstrated where their true interests lay.\n \n \n \nAnd what good would it have done to make a public spectacle out of it anyway?\n\n As the victim explicitly stated, he had problems with how Haggard was being portrayed.\n Justice is a part of \"healing\".\n The public thinking one thing about Haggard, ignoring what his victim went through, only prolongs the pain.\n \n \n \nIt's hilarious how people like you want churches to go through bad things as publicly as possibly, but you absolutely HATE it when the shoe is on the foot and things PUBLICLY come to light about the gay pride movement!\n\n Jyoshu, if any anti-Christian homosexual were to make a PUBLIC point of being anti-Christian, and then that same person was found out to be Christian, I would think that homosexual SHOULD be brought under a spotlight.\n \n The church LOST the right to keep it quiet when they opened their mouths to attack gays.", 
   {}, 
   342289, 
   null, 
   1233269760.0
  ], 
  [
   342333, 
   null, 
   "jyoshu", 
   "I am presenting the obvious conclusion. You are free to interject any different conclusion you think is more viable.\n\n \n My conclusions are to NOT connect dots that aren't necessarily there. \n \n a.) It was probably a case of the church being in denial--and yes, that can go on a long time, and\n b.) the church very well may HAVE been trying to help the \"young man\" out with money. \n and c.) it could have been what YOU'RE saying. But I'm not going to ASSUME that, as you are.\n \n \nBut this LOGICALLY CONCLUDED ANALYSIS is the one you balk at...\n\n \n If \"logic\" is rushing to judgment and filling in things for which aren't a given at all, then sure, that would be your logic. Luckily for all of us, the world doesn't normally operate that way.\n \n \nWhat crime has actually been committed?\n\n \n Foundit, that's exactly the POINT. if it was sex with a minor as has been intimated here, the police WOULD be involved at this point. There's no indication they are. Heck, for all we know this may have been an adult and an consensual relationship. But hey, when you go on things that HAVEN'T been said rather than things that have, that's what happens! emoticon_frazzled\n \n \nI haven't \"assumed\" any crime, so the lack of police involvement is not surprising.\n\n \n !!! Wow! So if it wasn't a crime, then it was consensual and the \"young man\" was an adult. Why are you demanding justice then? Why is it so important the church tell the world about this, if it WASN'T something that could be criminal activity?\n \n \nIt doesn't mean that the church didn't do a \"cover-up\" of something that \n would have been EMBARRASSING.\n\n \n BINGO. That's the bottom line, isn't it? :) This is all about seeing the church embarrased. 'Cause you don't like the fact they were anti-gay.\n \n \nThe insurance company PAID OUT. WHAT sort of situation could have occurred that would make an insurance company pay out? \"improper relationship\" with \"no physical contact\" is sure as heck NOT on that list...\n\n \n If there was physical contact, where are the police?\n \n \nAnd instead of you ADMITTING that their story doesn't make sense, you criticize anybody who comes to an obvious conclusion on the situation.\n\n \n Foundit, one thing I've come to realize, is that you seem to have this idea that everything in the world has to operate in a very narrow, surprise-free way. Never anything out there that would seem out of the ordinary. Sorry, but the world OFTEN just doesn't operate that way. Sometimes odd things DO happen, without it meaning someone is up to something evil and dastardly .... \n \n It DOES make sense for some of us in religion. I would not be surprised at all if they REALLY WERE trying to help this \"young man\" out. \n \n To use an example of things not always being what they seem, it doesn't always \"make sense\" for a gay person to lash out at someone, but that doesn't mean he's a evil person necessarily. There may be reasons for what he did, like mistreated over time .... you've argued that very sort of thing, so you SHOULD understand what I'm saying here. \n \n \nThe church has the power keeping this situation silent.\n\n \n No they didn't. They can't force anyone to say or not say anything.\n \n \nIf they were truly interested in honesty and helping the victim, they would aid the victim without requiring him to be quiet.\n What the victim says would be HIS choice, independent of any aid. Requiring him to be quiet ...\n\n \n Huh??? emoticon_confused emoticon_xdonno Where in the article does it say the church \"required\" him to be quiet? How, pray tell, could they \"require\" anyone to be quiet? Even if they indeed PAID off someone to be quiet, that's no requirement. \n \n But again, no one is saying the church leadership didn't do this. You're the one making defacto assumptions here.\n \n \nJustice is a part of \"healing\".\n\n \n \"Justice\" for what?? By who's standards? Do you mean the church leaders? 'Cause the \"justice\" you seem to be demanding would continue the scandal for the whole church.\n \n Naw ... you want \"justice\" because you want to see the church damaged. They're an \"anti-gay\" church, and that's really what this is about. for you. Not compassion on any \"young man\", and not true justice for anything.\n \n \nThe public thinking one thing about Haggard, ignoring what his victim went through, only prolongs the pain.\n\n \n His victim apparently doesn't care THAT much, if he took money to stay quiet. Obviously he wanted some money, RATHER than going public. Nothing necessarily wrong with that, but call it what it is.", 
   {}, 
   342323, 
   null, 
   1233275520.0
  ], 
  [
   342347, 
   null, 
   "foundit66", 
   "My conclusions are to NOT connect dots that aren't necessarily there. \n\n What dot isn't there?\n Let me guess. You want to respond by trying to talk about my CONCLUSIONS instead of the EVIDENCE which actually lead to the conclusion...\n \n \n \na.) It was probably a case of the church being in denial--and yes, that can go on a long time, and\n\n I think the word you're looking for is \"cover-up\". Not \"denial\".\n There is no rational reason to conclude \"denial\".\n \n \n \nb.) the church very well may HAVE been trying to help the \"young man\" out with money. \n\n And again, you try to make claims in blatant contradiction of the evidence.\n The church used INSURANCE MONEY.\n Does the insurance cover \"the church wants to help the young man out with money\"???\n No.\n \n \n \nand c.) it could have been what YOU'RE saying. But I'm not going to ASSUME that, as you are.\n\n I am simply pointing to the most obvious conclusion, and how the church's own statements are not coinciding with the facts.\n If you can point to a conclusion that has MORE LOGIC AND REASON pointing that way, then do so.\n As it is, you're just tossing out junk willy-nilly.\n \n \n \nFoundit, that's exactly the POINT. if it was sex with a minor as has been intimated here...\n\n Quote the \"intimation\".\n I grow bored with these strawman arguments...\n \n \n \n!!! Wow! So if it wasn't a crime, then it was consensual and the \"young man\" was an adult. Why are you demanding justice then? Why is it so important the church tell the world about this, if it WASN'T something that could be criminal activity?\n\n You misunderstand my meaning on \"justice\". I am not talking about legal justice.\n There is a moral justice as well in acknowledging the existence of being wronged, as opposed to sweeping it under the covers...\n \n And I am amused at how you don't argue against the young man being a victim, but you try to contest \"justice\"?\n \n \n \nBINGO. That's the bottom line, isn't it? :) This is all about seeing the church embarrased. 'Cause you don't like the fact they were anti-gay.\n\n As usual, you misrepresent my point.\n The embarrassment was the CHURCH'S motivation. THAT is why they included the confidentiality agreement.\n \n \n \nIf there was physical contact, where are the police?\n\n Probably the same place they were for the majority of the Catholic church molestations that were covered up.\n Absent...\n \n \n \nFoundit, one thing I've come to realize...\n\n Is something thoroughly non-topical...\n < yawn <\n \n \n \nIt DOES make sense for some of us in religion. I would not be surprised at all if they REALLY WERE trying to help this \"young man\" out.\n\n How are they helping him out by legally binding him to silence on the issue?\n That is not helping him out.\n That is helping THEM out...\n \n \n \nNo they didn't. They can't force anyone to say or not say anything.\n\n Jyoshu, this obfuscation of yours is pointless.\n The CHURCH REPRESENTATIVE ADMITTED there was a confidentiality agreement.\n The CHURCH REPRESENTATIVE ADMITTED there was a confidentiality agreement.\n The CHURCH REPRESENTATIVE ADMITTED there was a confidentiality agreement.\n \n \n \nHuh??? emoticon_confused emoticon_xdonno Where in the article does it say the church \"required\" him to be quiet? How, pray tell, could they \"require\" anyone to be quiet? Even if they indeed PAID off someone to be quiet, that's no requirement.\n\n Are you serious?\n Confidentiality agreements are typically part and parcel of undisclosed transgressions involving legal settlements.\n \n \n \nBut again, no one is saying the church leadership didn't do this. You're the one making defacto assumptions here.\n\n Translation?\n Jyoshu can't present any reason for anybody to believe \"his\" desired interpretation of things, so he'll just criticize anybody for coming to a negative conclusion, ignoring how obvious...\n \n \n \n\"Justice\" for what?? By who's standards?\n\n The standards of the victim. Duh.\n \n \n \nHis victim apparently doesn't care THAT much, if he took money to stay quiet. Obviously he wanted some money, RATHER than going public. Nothing necessarily wrong with that, but call it what it is.\n\n ROFLMAO!\n So a man is wronged, and you try to propagandically paint that as \"he wanted some money\".\n \n Let's see how that works for other situations...\n Prosecuting D.A. procured false testimony to falsely imprison a man. The man \"wants some money\" when he sues. (ignore the victimhood)\n John hits Mary with his car. Mary \"wants some money\" ... (ignore the victimhood)\n A catholic priest molests a boy. The boy \"wants some money\" when the church pays to keep him quiet... (ignore victimhood)\n \n Like I pointed out earlier, your interests are JUST for the church. The image of the church.\n If the church can cover that up? Who cares?\n Might as well reason that the cheating husband should keep it quiet cause the wife could get damaged by the falsehood that was his marriage vow...", 
   {}, 
   342333, 
   null, 
   1233282600.0
  ], 
  [
   342365, 
   null, 
   "jyoshu", 
   "What dot isn't there?\n\n \n Um ... that the church was trying to buy this guy's silence!!??? Your MAIN assertion is a dot here, Foundit. \n \n \nI think the word you're looking for is \"cover-up\". Not \"denial\".\n There is no rational reason to conclude \"denial\".\n\n \n You're wrong; yes there is.  Religion does this all the time. They are in denial that gays are really gay. Things take awhile longer in religion. It's the same reason Galilieo couldn't get the RCC to come around to his position. It's the same reason evolution has taken so long to be accepted by religion, Foundit. Denial 'aint' just a river in Egypt. (And for the record, I'm pleasantly surprised at you, Foundit, not taking this chance to jump on someone actually ADMITTING to a problem in religion and milking it for all it's worth. Maybe you're making some progress here by not doing so ...) \n \n \nAnd again, you try to make claims in blatant contradiction of the evidence.\n The church used INSURANCE MONEY.\n Does the insurance cover \"the church wants to help the young man out with money\"???\n\n \n It depends on how it was handled. If there was claim made, and then the insurance co. gave them the $, then it was THEIR money at that point to do what they wanted--and that INCLUDES helping someone with it. But of course, we don't know, do we, Foundit? emoticon_rolleyes You just assume WITHOUT knowing.\n \n \nI am simply pointing to the most obvious conclusion, and how the church's own statements are not coinciding with the facts.\n If you can point to a conclusion that has MORE LOGIC AND REASON pointing that way, then do so.\n As it is, you're just tossing out junk willy-nilly.\n\n \n The facts are inconclusive. And the church's statements need to be taken into consideration AS evidence. You would throw them out, apparently--again ASSUMING guilt and ASSUMING the statements aren't honest. The \"willy nilly\" here is YOUR approach. It's \"obvious\" to you, because that's what you WANT to be the case.\n \n \nQuote the \"intimation\".\n I grow bored with these strawman arguments...\n\n \n I didn't say YOU intimated it. But you're not exactly distancing yourself from the intimation either. Are you saying you DON'T think that's the case here? It's no strawman, btw. It's part and parcel to the issue--if he was an ADULT, and it was CONSENSUAL, then why the heck are you making such a big freaking deal about this, anyway??? If legal and consensual, then there's nothing you should BE demanding justice for. If it was consensual and of legal age, then he DIDN'T victimize this person. If it wasn't consensual or WASN'T of legal age, then the police should be involved REGARDLESS of your judgments of the situation. This is a case where if it demands justice of ANY sort, then it happens to BE illegal. But the applicable converse of that is that if it ISN'T illegal--and that's what seems to be case--then the case of 'victimization' is pretty darn thin, even if it's NOT a legal matter.\n \n And again, if non-consensual and non 'of-age' inappropriate relationship ISN'T what you all hot and bothered about here, then what is it?? What, specifically, is your BEEF with all this?? WHAT is the basis for your accusation of victimization here on the part of the church? The police OBVIOUSLY don't think there's anything criminal going on here, or they'd be prosecuting it. If there's nothing criminal, then what's your BEEF?? WHAT are you alleging here?\n \n \nYou misunderstand my meaning on \"justice\". I am not talking about legal justice. There is a moral justice as well in acknowledging the existence of being wronged, as opposed to sweeping it under the covers...\n\n \n Yeah ... moral because that's something that is an eye-of-the-beholder sort-of-thing. emoticon_rolleyes Moral justice over what? The point here is that if whatever was done was so NON-melevolent that there's nothing that could be construed as a CRIMINAL problem, then what's the problem here?? What, SPECIFICALLY, are you alleging here that happened?? 'Cause frankly, I don't think you know WHAT happened AT ALL. emoticon_xdonno\n \n If there was no criminal act here, then WHAT is it exactly, that you're calling for justice? Even if it's NOT legal?\n \n \nAnd I am amused at how you don't argue against the young man being a victim, but you try to contest \"justice\"?\n\n \n A victim over WHAT, Foundit?? WHAT are you assuming happened??? Geez!\n \n \nAs usual, you misrepresent my point.\n The embarrassment was the CHURCH'S motivation. THAT is why they included the confidentiality agreement.\n\n \n Say whaaaaa???? Why in the world would a church be MOTIVATED to be embarrassed? Are you even TRYING to think through this, at this point? \n \n \nHow are they helping him out by legally binding him to silence on the issue?\n \n Are you serious?\n Confidentiality agreements are typically part and parcel of undisclosed transgressions involving legal settlements.\n\n \n Foundit, you are leaving out a HUGE factor in this issue: the \"young man\" didn't HAVE to sign any agreement AT ALL. No one held a gun to his head. (and you were chastising earlier about leaving out key points. Shame, shame .... :) ) If being public was important to this \"young man\", he could have gone public instead of signing ANYTHING. That's the bottom line. You're trying to make this ENTIRELY about the church, when there's the 900lb elephant in the room that whoever this man was (and we have no idea of ANYTHING about him) didn't have sign anything. He was NEVER \"required\" to do anything or NOT do anything here.\n \n \nROFLMAO!\n So a man is wronged, and you try to propagandically paint that as \"he wanted some money\".\n\n \n Nope, didn't say that.\n \n But the man agreed to this, Foundit. That's that part you're ignoring. He AGREED to taking money for the solence. Whether money was his motivation, I have no idea. But it doesn't matter--that's what he agreed to do. He wasn't forced to do so. He wasn't \"required\" to do it. But that's what he did.\n \n \nLet's see how that works for other situations...\n Prosecuting D.A. procured false testimony to falsely imprison a man. The man \"wants some money\" when he sues. (ignore the victimhood)\n\n \n Nope. No one going to prison here. This is a case of someone GETTING something, not AVOIDING something. \n \n \nJohn hits Mary with his car. Mary \"wants some money\" ... (ignore the victimhood)\n\n \n So, the church is like \"John\", and \"Mary\" is like the \"young man\"? I'm not sure you realize this doesn't HELP your point here, Foundit! :)\n \n \nA catholic priest molests a boy. The boy \"wants some money\" when the church pays to keep him quiet... (ignore victimhood)\n\n \n Again, you miss the point. If the boy is truly a victim, he doesn't have to take any money at all. He can instead be as vocal about this as he wants, instead. NO ONE is making his take any money.\n \n \nLike I pointed out earlier, your interests are JUST for the church. The image of the church.\n If the church can cover that up? Who cares?\n\n \n No, I just find it odd that all these examples would TAKE \"hush money.\" Look, victimization either REALLY means something, or it doesn't. If someone can can be BOUGHT that easily, something's a little odd here. \n \n But if it makes you feel better, I agree the church shouldn't have TRIED to buy their silence, IF that's really what happened. You're assuming it is, of course, because you're biased against any church that would take an supposedly \"anti-gay\" position. You view the \"young man\" as the possible victim here. I view him as a possible victim, but ALSO the church as something that needs to fall under the presumption of innocence until there are conclusive facts. Just as we would anything else. We don't need to make an exception where the CHURCH doesn't fall under presumption-of-innocence when we apply that to other things.", 
   {}, 
   342347, 
   null, 
   1233296580.0
  ], 
  [
   342370, 
   null, 
   "chester", 
   "I can't help but wonder whether those who are so busy defending Haggard and his \"church\" by saying, \"Well, they're both adults, and it shouldn't be anyone else's business.\" think the same about President Clinton and Lewinsky.\n \n There were two consenting adults there as wll.", 
   {}, 
   342365, 
   null, 
   1233328440.0
  ], 
  [
   342387, 
   null, 
   "foundit66", 
   "Um ... that the church was trying to buy this guy's silence!!??? Your MAIN assertion is a dot here, Foundit. \n\n The article says that one of the reasons they were silent was because of \"legal constraints\". The obvious conclusion is that the insurance payments included a confidentiality requirement.\n What's your explanation?\n \n \n \nYou're wrong; yes there is.  Religion does this all the time. They are in denial that gays are really gay.\n\n Quite frankly, the categorization of \"gay\" is almost irrelevant to this case.\n Does that somehow change the \"legal constraint\" from the insurance company? emoticon_xdonno\n Does Haggard \"being gay\" mean that the victim is somehow less of a victim? emoticon_xdonno\n \n But on another level, THIS IS PRECISELY what I am talking about regarding \"ex-gay\" and \"reparative therapy\" groups, and why they cannot be trusted in their assessment of \"curing\" a patient.\n \n \n \nIt depends on how it was handled. If there was claim made, and then the insurance co. gave them the $, then it was THEIR money at that point to do what they wanted--and that INCLUDES helping someone with it. But of course, we don't know, do we, Foundit? emoticon_rolleyes You just assume WITHOUT knowing.\n\n I think the \"claim\" is the big issue at hand here.\n What \"claim\" would justify this payout?\n Archie supplied a list.\n \n \n \nThe facts are inconclusive. And the church's statements need to be taken into consideration AS evidence. You would throw them out, apparently--again ASSUMING guilt and ASSUMING the statements aren't honest.\n\n I am including the church's statements.\n The church is the one that admitted to the \"legal constraint\" for silence.\n I am also questioning their statements where they don't make sense.\n \n And for the record, you need to stop tossing the word \"assuming\" around like it means I have condemned these people, incontrovertibly, with no question of other possibilities.\n While other possibilities exist, they aren't as likely.\n If new evidence arises, then another possibility could come to the front as most likely.\n \n If things were left up to you, it would seem like you would have it so the church would never be criticized for their silence, and the circumstances would never be known. Everybody would just sit back and think \"that's interesting\", \"assuming\" the best cause there is no video-tape proof for any other conclusion.\n \n \n \nI didn't say YOU intimated it. But you're not exactly distancing yourself from the intimation either.\n\n If you see anybody here doing that, then COMPLAIN TO THEM.\n \n And for the record Jyoshu, there are TONS of junk you don't \"distance yourself from\" either. I don't think you want to start applying THAT standard...\n \n \n \nIt's part and parcel to the issue--if he was an ADULT, and it was CONSENSUAL, then why the heck are you making such a big freaking deal about this, anyway???\n\n Asked and answered.\n For one, the victim talks about being victimized.\n For two, it goes to the whole credibility of the \"ex-gay\" and \"reparative therapy\" claims, cause when the church habitually refuses to be honest about these things, HOW can you trust them in their claims that somebody has \"changed\"?\n \n \n \nIf legal and consensual, then there's nothing you should BE demanding justice for. If it was consensual and of legal age, then he DIDN'T victimize this person. If it wasn't consensual or WASN'T of legal age, then the police should be involved REGARDLESS of your judgments of the situation. This is a case where if it demands justice of ANY sort, then it happens to BE illegal.\n\n You're still stuck on that word, aren't you...\n I never said that the justice required anything more than public vindication.\n In fact, I already stated that the \"justice\" I was referring to wasn't a criminal prosecution.\n The \"justice\" involved is what the victim decides he wants to pursue, and the church shouldn't stand in the way of that. They have NO business doing that.\n \n \n \nYeah ... moral because that's something that is an eye-of-the-beholder sort-of-thing. emoticon_rolleyes Moral justice over what?\n\n You ever read the constitution Jyoshu?\n I take it quite seriously.\n In it, we have a constitutional amendment for the right of \"redress of grievances\". That's one of our fundamental civil rights.\n And like many things constitutional, there is a fundamental in the spirit of the statement, and this man should be free to pursue whatever \"redress of grievances\" he wants to.\n Whether his goals should be sated is another question entirely. But that doesn't mean the church should arbitrarily stand in his way.\n \n \n \nThe point here is that if whatever was done was so NON-melevolent that there's nothing that could be construed as a CRIMINAL problem, then what's the problem here??\n\n I have to chuckle at that statement.\n You just described virtually every \"gay\" issue around here.\n Being gay is not illegal, but anti-gay Christians pump MILLIONS into trying to slur gays and discriminate against gays, when we've done nothing to them...\n \n And here you are, throwing up quite a fuss when it's the \"Christians\" we are asking about (and note, JUST ASKING), but when it's the gays who are discriminated against and victimized, that's not your concern... emoticon_xgood\n \n I guess what I'm trying to say is that I would take your complaint a little more seriously, if only you would...\n \n \n \nWhat, SPECIFICALLY, are you alleging here that happened?? 'Cause frankly, I don't think you know WHAT happened AT ALL. emoticon_xdonno\n\n ROFLMAO!\n FIRST you insist that I am assuming too much, facts not in evidence.\n NOW you complain that I'm not assuming enough... emoticon_xgood\n \n \n \nSay whaaaaa???? Why in the world would a church be MOTIVATED to be embarrassed? Are you even TRYING to think through this, at this point?\n\n Are you?\n Obviously, the church wouldn't be motivated to be embarrassed.\n If you had stopped to think, you would realize that the church AVOIDED embarrassment.\n The church was motivated to AVOID embarrassment.\n \n \n \nFoundit, you are leaving out a HUGE factor in this issue: the \"young man\" didn't HAVE to sign any agreement AT ALL. No one held a gun to his head.\n\n The agreement would obviously be part of the settlement.\n The church was looking for a way to further their own interests, in keeping the victim silent.\n \n I think the church should have helped the young man in the same way Christ would have. Without constraints...\n \n \n \nIf being public was important to this \"young man\", he could have gone public instead of signing ANYTHING. That's the bottom line. You're trying to make this ENTIRELY about the church, when there's the 900lb elephant in the room that whoever this man was (and we have no idea of ANYTHING about him) didn't have sign anything. He was NEVER \"required\" to do anything or NOT do anything here.\n\n We \"have no idea of anything about him\", except that the church and the insurance company deemed it worthy to hand out a settlement in the range of six digits.\n Of course the church could have been lying to the insurance company. That could explain the insurance payout.\n Or the church could have thought the young man didn't deserve anything and wanted to take it to trial, but they acquiesced to the insurance company anyways.\n < end sarcasm <\n \n Jyoshu, if you think you have a better explanation, then give it.\n I can listen.\n \n But I'm not going to sit back and just put the blinders on cause the picture is incomplete.\n \n \n \nBut the man agreed to this, Foundit. That's that part you're ignoring. He AGREED to taking money for the solence. Whether money was his motivation, I have no idea. But it doesn't matter--that's what he agreed to do. He wasn't forced to do so. He wasn't \"required\" to do it. But that's what he did.\n\n Again, the church (if their interests have no selfishness involved) would not require the young man to silence.\n He agreed to take the money, when there were probably people telling him he would get none if he didn't sign for silence.\n \n \n \nNope. No one going to prison here. This is a case of someone GETTING something, not AVOIDING something. \n\n It's an ANALOGY.\n \n \n \nSo, the church is like \"John\", and \"Mary\" is like the \"young man\"? I'm not sure you realize this doesn't HELP your point here, Foundit!\n\n I'm pretty sure you don't see my point...\n \n \n \nNo, I just find it odd that all these examples would TAKE \"hush money.\" Look, victimization either REALLY means something, or it doesn't. If someone can can be BOUGHT that easily, something's a little odd here. \n\n \"bought that easily\"? emoticon_xdonno\n It's funny how you criticize me for not knowing details, but then you toss things like that out...\n \n And you're wrong about victimization \"meaning something or it doesn't\".\n One of the problems with the Catholic church scandal is that the church would pay the victims to be silent. The parents of the victims took the money, thinking this was all they could get out of the church. Going public would result in their kid going through scrutiny, defense lawyers claiming he was lying, testifying in open court about the embarrassing and painful rape ...\n \n And the parents have the child's best interests at heart.\n And there is NO QUESTION that the kids were victims.\n So does the victimization not \"mean\" something there????\n \n \n \nBut if it makes you feel better, I agree the church shouldn't have TRIED to buy their silence, IF that's really what happened.\n\n That's one of the main points being made.\n Glad we could make some progress on that.\n \n And what other explanation is there for the church's admission to a \"legal constraint\"?\n \n \n \nYou're assuming it is, of course, because ...\n\n Because of the evidence I have already laid out.\n REPEATEDLY.\n Please don't pretend otherwise by throwing out arguments I have never made in the first place. You're just trying for the ol' strawman again.\n I know it's tempting, but don't do it...\n \n \n \nI view him as a possible victim, but ALSO the church as something that needs to fall under the presumption of innocence until there are conclusive facts. Just as we would anything else. We don't need to make an exception where the CHURCH doesn't fall under presumption-of-innocence when we apply that to other things.\n\n Haggard is the one with \"guilt\".\n The main thing the church deserves scrutiny for is the cover-up.\n And unless you have a better explanation for the church's admission to \"legal constraints\" upon the parties for silence, what else is there?", 
   {}, 
   342365, 
   null, 
   1233341880.0
  ], 
  [
   342593, 
   null, 
   "jyoshu", 
   "The article says that one of the reasons they were silent was because of \"legal constraints\". The obvious conclusion is that the insurance payments included a confidentiality requirement.\n What's your explanation?\n\n \n \nI am including the church's statements.\n The church is the one that admitted to the \"legal constraint\" for silence.\n \n\n \n The point is that no one had to sign any agreement, no matter WHAT it included, or not.\n \n Give this at least some fleeting thought here. Let's throw out a hypothetical situation so you can get this concept ...\n [*]Let's say, hypothetically, that someone offers you money to stop posting on message forums[*]You take the moneyDoes that mean you were FORCED to stop posting on forums? No. You CHOSE to do so, by accepting such a condition. You didn't have to do that at all. Do you get it now?\n \n \nQuite frankly, the categorization of \"gay\" is almost irrelevant to this case.\n\n \n Irrelevant; the whole thing (not just the 'gay' part) still likely involved some denial.\n \n \nBut on another level, THIS IS PRECISELY what I am talking about regarding \"ex-gay\" and \"reparative therapy\" groups, and why they cannot be trusted in their assessment of \"curing\" a patient.\n\n \n Then don't try to be an 'ex-gay', Foundit. That's the thing about your position, and really it ALWAYS pertains to the approach gay pride proponents take toward the \"ex-gay movement\": it still ultimately comes down to letting people do what they want to do. No one holds a gun to your head about this. What you categorize as \"groups\" is really individuals simply making the choice they want to live differently than you do. It doesn't fit the prescription that the gay pride movement has for gays, which is the real reason it riles you. You throw out accusations that it's 'harmful' or that they 'can't be trusted' all day, and it's really beside the point. It's like throwing accusations out about holistic living companies telling people they are better off growing all their food in their backyard, when in fact these people WANT to do this. Whether or not the holistic food company is being dishonest or not, it doesn't change that fact. What drives the 'ex-gay movement' are the GAYS who want to live differently, not the movement itself. It's sort of like religion. No one has to be religious if they don't want to be. The option of going to church is there, for whoever wants it. It's their choice; no one holds a gun to anyone's head.\n \n \nAnd for the record, you need to stop tossing the word \"assuming\" around like it means I have condemned these people, incontrovertibly, with no question of other possibilities.\n\n \n Funny how you don't even acknowledge those possibilities unless someone challenges you on them. You only want to talk about the possibilities that present the church in the worst possible light. \n \n \nWhile other possibilities exist, they aren't as likely.\n\n \n That's a matter of opinion. This is an issue of you seeing the evidence one way (biased because of your positions on this, frankly). I already told you, religious groups don't expect people like that pastor to come along and cause the problems that got caused, and much of the problem here was denial. I've been around religion long enough to know that was VERY LIKELY the case, rather than subversive intentions by the leadership of the church. You're approaching this from the standpoint of someone outside churches like this. It's like someone making an assumption about gays, for instance, without being one and understanding the factors that can often influence things.\n \n \nAsked and answered.\n For one, the victim talks about being victimized.\n For two, it goes to the whole credibility of the \"ex-gay\" and \"reparative therapy\" claims, cause when the church habitually refuses to be honest about these things, HOW can you trust them in their claims that somebody has \"changed\"?\n\n \n Re. the 1st point, yes, there has been a claim here about victimization. But typically that means we should put a question on the table, NOT a conclusion. If claim of victimization were all that was necessary to assume guilt on any matter, society would be a mess! There are OBVIOUS reasons things don't work that way.\n \n Re. the second point, you're trying to use a conclusion for a premise. Circular reasoning. On one hand you indicate guilt here demonstrates a lack-of-trust. Then you turn right around and name lack-of-trust as a reason that they are guilty ... emoticon_xdonno\n \n Surely that's not ALL the reasons you can give for making a big deal over this. Please tell me that's not all you've got ... emoticon_wow\n \n \nYou ever read the constitution Jyoshu?\n I take it quite seriously.\n In it, we have a constitutional amendment for the right of \"redress of grievances\". That's one of our fundamental civil rights. \n And like many things constitutional, there is a fundamental in the spirit of the statement, and this man should be free to pursue whatever \"redress of grievances\" he wants to.\n\n \n Now that's got to be one of the most immediately ironic things I've ever seen anyone do on this forum. Bringing up the constitution here? When this WHOLE THING is a case of you not applying a presumption of innocence to begin with??\n \n Have YOU ever read the constitution? 'Cause if you're going to talk about a 'fundamental' in the spirit of a constitutional statement, one has to wonder why you're not applying the 'fundamental' of due process here which pertains to the concept of the presumption of innocence. \n \n And regarding the man being free to pursue a redress of grievances, CLAFCLO. No one's talking about taking away this man's freedom to do that.\n \n \nI have to chuckle at that statement.\n You just described virtually every \"gay\" issue around here.\n Being gay is not illegal, but anti-gay Christians pump MILLIONS into trying to slur gays and discriminate against gays, when we've done nothing to them...\n \n And here you are, throwing up quite a fuss when it's the \"Christians\" we are asking about (and note, JUST ASKING), but when it's the gays who are discriminated against and victimized, that's not your concern... emoticon_xgood\n \n I guess what I'm trying to say is that I would take your complaint a little more seriously, if only you would...\n\n \n Right back 'atcha. What you're saying is exactly one reason why I don't take many of your complaints as seriously as I would otherwise ... (Hey, there's nothing illegal about things like listing resitential addresses of people who supported Prop 8. Oh, it's a bad idea for OTHER reasons?? Well, never mind them!)\n \n \nROFLMAO!\n FIRST you insist that I am assuming too much, facts not in evidence.\n NOW you complain that I'm not assuming enough... emoticon_xgood\n\n \n That's right. You commit both errors. You presume guilt WITHOUT enough evidence when you want to, but then aren't assuming enough of the facts to come to a presumption. That's called bias.\n \n \nI think the church should have helped the young man in the same way Christ would have. Without constraints...\n\n \n Wow! emoticon_wow Quite frankly, Foundit, you flat out just don't know what you're talking about here. I think you need to go read some of those scriptures where Jesus helped people ...\n \n Mark 7: 34-36 - He looked up to heaven and with a deep sigh said to him, \"Ephphatha!\" (which means, \"Be opened!\" ). At this, the man's ears were opened, his tongue was loosened and he began to speak plainly. Jesus commanded them not to tell anyone. \n \n Matt 9:29, 30 - Then he touched their eyes and said, \"According to your faith will it be done to you\"; and their sight was restored. Jesus warned them sternly, \"See that no one knows about this.\"\n \n Luke 5: 12-14 - While Jesus was in one of the towns, a man came along who was covered with leprosy. When he saw Jesus, he fell with his face to the ground and begged him, \"Lord, if you are willing, you can make me clean.\" Jesus reached out his hand and touched the man. \"I am willing,\" he said. \"Be clean!\" And immediately the leprosy left him.  Then Jesus ordered him, \"Don't tell anyone, but go, show yourself to the priest and offer the sacrifices that Moses commanded for your cleansing, as a testimony to them.\" \n It's pretty obvious you're wrong here; Christ DID put constraints of silence (!!!) on people he helped. A number of times. \n \n And if the man needed money, and the church provided it (irrespective of the issue of applying insurance $) why would you take such a position that constraints are bad? This reminds me of people who cry foul over missionaries who put a constraint on people in other counties to hear the Christian gospel to receive aid. But those missionaries didn't HAVE to give aid at all!! ANY giving is over and above what would have been there otherwise. Ever heard the phrase \"don't look a gift horse in the mouth?\" If a homeless guy comes to your door, and you give him $20 with the constraint that he ONLY use it on food, why is that a problem? And again, even if they were really trying to BUY the guy's silence, no one forced the man to do this. It needs to be kept in mind that the 'young man' in the church didn't have to accept that money (and therefore constraint) at all.\n \n \nOf course the church could have been lying to the insurance company. That could explain the insurance payout.\n Or the church could have thought the young man didn't deserve anything and wanted to take it to trial, but they acquiesced to the insurance company anyways.\n < end sarcasm <\n\n \n Yeah, anything that assumes something BAD on the part of the church. emoticon_rolleyes\n \n \nJyoshu, if you think you have a better explanation, then give it.\n I can listen.\n\n \n I already have. And obviously, you're not listening.\n \n \nAgain, the church (if their interests have no selfishness involved) would not require the young man to silence.\n\n \n It depends. They very well could have been simply trying to 'put the issue to bed' so to speak, and try to ensure no one would try to belabor the scandal, so the church could get on with healing. Or they may have found the young man's accusations questionable, but genuinely wanted to help him out so they tried to find a way to do that without allowing him to further false accusations. Or the constraint of silence may have been aimed more at the act of giving in the sense of it being one of benevolence (IOW, not 'covering up' something, but keeping an act of help private--i.e. they have actually done it FOR THE YOUNG MAN'S privacy. That's more toward the reason the current pastor gave; why should we automatically assume that's not a legit claim?) It's not like these aren't common things. Again, I'm not saying YOUR possibilities are wrong. I'm saying yours aren't the only ones out there, and yours ONLY presume guilt on the part of the church here. You're the one jumping to the hard conclusions here, not me. I can EASILY see a church as not necessarily out to engage in some \"cover-up\" here with that $, based on the experience I've had in churches and how they often think, so I think it could go either way.\n \n \nHe agreed to take the money, when there were probably people telling him he would get none if he didn't sign for silence.\n\n \n Well .... yeah. Then apparently he didn't feel that his accusation was particularly that important, if it was a situation where he could be \"bought\".\n \n \nOne of the problems with the Catholic church scandal is that the church would pay the victims to be silent. The parents of the victims took the money, thinking this was all they could get out of the church ...\n\n \n And another problem with those scandals is that there were people in some cases making stuff up to try and get some money out of the church. All these cases have to be evaluated independently before guilt should be assumed on the part of churches.", 
   {}, 
   342387, 
   null, 
   1233530640.0
  ], 
  [
   342670, 
   null, 
   "foundit66", 
   "The point is that no one had to sign any agreement, no matter WHAT it included, or not.\n\n No. That is YOUR point, attempting to ignore other salient points...\n \n WHY would the church insist that the victim should remain silent?\n \n \n \nIrrelevant; the whole thing (not just the 'gay' part) still likely involved some denial.\n\n Let's say a lesbian is involved in a hit and run.\n A pastor comes along and says \"she's not a lesbian\".\n Woman (lesbian, bisexual, confused, just curious) is still lying in the street, bleeding.\n \n DOES IT MATTER whether or not she was a lesbian to the logical recourse of how to address the situation???\n Likewise, if I said \"Haggard was 100% straight\", DOES IT MATTER with regards to how to treat the victim? Is the victim somehow soothed by that?\n \n If the \"gay\" aspect did confuse the church, it only shows how thoroughly irrational they are on the subject of homosexuality....\n \n \n \nThen don't try to be an 'ex-gay', Foundit. That's the thing about your position, and really it ALWAYS pertains to the approach gay pride proponents take toward the \"ex-gay movement\": it still ultimately comes down to letting people do what they want to do.\n\n 1) I have no idea what you think you mean by your first statement.\n If you don't think \"ex-gay\" involves some effort... Some \"trying\"...\n Then you are just bafflingly lost on the issue.\n \n 2) Again with the pointless obfuscation.\n I HAVE NEVER advocated against \"letting people do what they want to do\".\n My issue is that they be informed with the BIG PICTURE TRUTH.\n \n \n \nWhat you categorize as \"groups\" is really individuals simply making the choice they want to live differently than you do.\n\n No. What I classify as \"groups\" are NARTH, PFOX, Exodus International, ...\n \n I find this new approach of yours amusing. Maybe I'll just start referring to the APA as \"individuals\"...\n \n \n \nIt doesn't fit the prescription that the gay pride movement has for gays, which is the real reason it riles you. You throw out accusations that it's 'harmful' or that they 'can't be trusted' all day, and it's really beside the point.\n\n No. Again, you're wrong.\n It is besides YOUR point, which in some ways is incredibly disturbing.\n Gays get harmed by reparative therapy.\n Reparative therapy DO NOT INFORM parents of the harm, and they oversell their \"success\" claims.\n And that is \"besides the point\" to you???\n \n \n \nIt's like throwing accusations out about holistic living companies telling people they are better off growing all their food in their backyard, when in fact these people WANT to do this.\n\n 1) This isn't \"accusations\". These are documented and researched harms.\n I've even quoted three group leaders as EXPLICITLY SAYING that they have harmed gays, and apologized.\n 2) Jyoshu, QUIT OBFUSCATING.\n This issue has NEVER been about whether or not the person involved would be \"better off\" just being gay. If by some miracle, the anti-gay movement developed a methodology that was 50% effective with no side-effects, EVERY SINGLE THING I have ACTUALLY talked about would be muted.\n \n NONE of my discussion has EVER revolved around \"they don't need to change\".\n The issue is DOCUMENTED HARM, and that people should know the risks before they get into it.\n \n This SHOULD BE a no-brainer.\n A COMPLETE \"Yeah. That makes sense\" issue.\n For any drug company, the people involved RESEARCH the potential side-effects, they WARN the patients of them, they TRACK the recovery, and they observe for potential RELAPSES.\n That is GOOD MEDICAL TREATMENT.\n \n But since it involves a \"gay\" issue, combined with \"religion\", you don't give a flying fig.\n \n \n \nWhether or not the holistic food company is being dishonest or not, it doesn't change that fact.\n\n LOL!\n It goes beyond that.\n If the holistic food WAS DAMAGING the people involved, the FDA would get involved.\n I'm just asking for something similar here, along with some honesty.\n \n What really amuses me about this is the fact that, by analogy, you're demonstrating YOU do not care if the reparative therapy groups, or ex-gay groups, are being \"dishonest\"....\n Unless you didn't intend for the analogy to stretch that far, in which case you should explicitly state that you do care whether or not the reparative therapy groups are dishonest...\n \n \n \nWhat drives the 'ex-gay movement' are the GAYS who want to live differently, not the movement itself. It's sort of like religion. No one has to be religious if they don't want to be. The option of going to church is there, for whoever wants it. It's their choice; no one holds a gun to anyone's head.\n\n So all these \"reparative therapy\" groups, they are run by GAYS or EX-GAYS then, right?\n Not STRAIGHT people who want gays to go straight?\n There is NEVER any straight influence, like perhaps straight parents who force their gay kid into the camp, regardless of whether or not the gay kid wants to go?\n < end sarcasm <\n \n Do you actually believe the junk you throw out there?\n \n \n \nFunny how you don't even acknowledge those possibilities unless someone challenges you on them. You only want to talk about the possibilities that present the church in the worst possible light. \n\n Jyoshu, I want people to not get hurt.\n YOUR interest is to fixate on the church, and how the church could look.\n \n And quite frankly, I didn't think I needed to \"acknowledge\" the obvious...\n When I ASK QUESTIONS about the situation, and ask for more likely POSSIBILITIES, I would think most bright people could interpret what that means...\n \n \n \nThat's a matter of opinion.\n\n Yes.\n And you're free to voice yours.\n I refuse to allow you to obfuscate mine...\n I refuse to allow you to abuse conclusions based on logic and reason...\n \n \n \nThis is an issue of you seeing the evidence one way (biased because of your positions on this, frankly). I already told you, religious groups don't expect people like that pastor to come along and cause the problems that got caused, and much of the problem here was denial.\n\n I think the real problem is your bias...\n And I am open to people explaining other ways to \"see\" the evidence.\n You just don't have any better way, so you criticize me for even trying...\n \n You are right that \"religious groups don't expect people like that pastor to come along and cause the problems that got caused\". The main problem is what these people did AFTERWARDS.\n \n And regarding \"much of the problem here was denial\", you toss that out there like a buzz-word, but it's meaningless.\n HOW does it matter whether or not Haggard was gay, or the victim was gay, when people are being victimized?\n Unless you're saying that the church was in \"denial\" over whether he was a victim, in which case it begs the question of why the SIX FIGURE SETTLEMENT.\n Why insist the victim has to remain silent?\n \n \n \nRe. the 1st point, yes, there has been a claim here about victimization. But typically that means we should put a question on the table, NOT a conclusion. If claim of victimization were all that was necessary to assume guilt on any matter, society would be a mess! There are OBVIOUS reasons things don't work that way.\n\n Again, if this were a trial, I would use trial standards.\n But basically you're ignoring the fact that the question HAS BEEN PUT on the table.\n And the funny thing about questions is that they get answered in some shape or form, and THAT is the problem you have here.\n You want it to REMAIN a question, and the rest of us just to walk away...\n \n \n \nRe. the second point, you're trying to use a conclusion for a premise. Circular reasoning. On one hand you indicate guilt here demonstrates a lack-of-trust. Then you turn right around and name lack-of-trust as a reason that they are guilty ... emoticon_xdonno\n\n I have no idea whose argument you just think you were repeating.\n It wasn't mine.\n Quote me.\n \n \n \nNow that's got to be one of the most immediately ironic things I've ever seen anyone do on this forum. Bringing up the constitution here? When this WHOLE THING is a case of you not applying a presumption of innocence to begin with??\n\n And my point obviously went WAYYY over your head.\n I was talking about \"redress of grievances\" being a RIGHT. It was important enough to put in the first AMENDMENT.\n Demonstrates how fundamental the idea is to our American way of life.\n \n And THAT was my point. How important \"redress of grievances\" was....\n But of course, you completely ignored it. And now you try to side-track my point...\n \n \n \nHave YOU ever read the constitution?\n\n Yes, I have.\n Can you point out what section I am actually guilty of?\n Cause I see myself exercising my free speech right. I am depriving nobody of due process. I am not punishing without a trial.\n I have a right to an opinion.\n \n \n \nAnd regarding the man being free to pursue a redress of grievances, CLAFCLO. No one's talking about taking away this man's freedom to do that.\n\n OMG. Forest for the trees, after you have CLIMBED a tree (in the middle of the forest) to get a better look...\n If the man is required to be kept silent, obviously he CANNOT pursue redress of grievances. His first amendment free speech is impinged upon.\n \n \n \nRight back 'atcha. What you're saying is exactly one reason why I don't take many of your complaints as seriously as I would otherwise ... (Hey, there's nothing illegal about things like listing resitential addresses of people who supported Prop 8. Oh, it's a bad idea for OTHER reasons?? Well, never mind them!)\n\n Jyoshu, you and I and a LONG LIST OF OTHER PEOPLE know you were NEVER taking these complaints \"seriously\" when other people have registered them before me, on this and other boards.\n \n Moreover, regarding the non-topical \"Prop 8\" example, I'll repost your statement on that thread and address it there.\n \n \n \nThat's right. You commit both errors. You presume guilt WITHOUT enough evidence when you want to, but then aren't assuming enough of the facts to come to a presumption. That's called bias.\n\n I am not assuming enough of the facts to come to a presumption... emoticon_wow\n People don't assume \"facts\" Jyoshu.\n \n And your complaint is nonsensical.\n When logic points in a certain direction, I acknowledge it.\n When there is no evidence to make a conclusion, I don't make it.\n To pretend that is somehow proof of \"bias\" is just plain nonsense.\n \n If I was biased, I would make the conclusion DESPITE the lack of evidence...\n THAT would be an example of bias.\n \n \n \nWow! emoticon_wow Quite frankly, Foundit, you flat out just don't know what you're talking about here. I think you need to go read some of those scriptures where Jesus helped people ...\n \n Mark 7: 34-36 - He looked up to heaven and with a deep sigh said to him, \"Ephphatha!\" (which means, \"Be opened!\" ). At this, the man's ears were opened, his tongue was loosened and he began to speak plainly. Jesus commanded them not to tell anyone. \n\n And without surprise, you fail to quote the WHOLE of verse 36...\n Mar 7:36 And he charged them that they should tell no man: but the more he charged them, so much the more a great deal they published [it];\n \n \nMatt 9:29, 30 - Then he touched their eyes and said, \"According to your faith will it be done to you\"; and their sight was restored. Jesus warned them sternly, \"See that no one knows about this.\"\n\n Or admit what the next verse said...\n Mat 9:31 But they, when they were departed, spread abroad his fame in all that country.\n \n \nLuke 5: 12-14 - While Jesus was in one of the towns, a man came along who was covered with leprosy. When he saw Jesus, he fell with his face to the ground and begged him, \"Lord, if you are willing, you can make me clean.\" Jesus reached out his hand and touched the man. \"I am willing,\" he said. \"Be clean!\" And immediately the leprosy left him.  Then Jesus ordered him, \"Don't tell anyone, but go, show yourself to the priest and offer the sacrifices that Moses commanded for your cleansing, as a testimony to them.\" \n It's pretty obvious you're wrong here; Christ DID put constraints of silence (!!!) on people he helped. A number of times. \n\n And again, you fail to quote THE NEXT VERSE...\n Luk 5:15 But so much the more went there a fame abroad of him: and great multitudes came together to hear, and to be healed by him of their infirmities.\n Jesus told them to be silent, KNOWING that would only push them to repeat his deeds even more...\n It was an obvious ploy, unless you're going to claim that the all knowing Lord was clueless on the consequences of his actions...\n \n Either you didn't know that, and I DID (which would be really embarrassing for you that I knew it better than you...)\n Or you were trying to misrepresent the situation purposely...", 
   {}, 
   342593, 
   null, 
   1233605760.0
  ], 
  [
   342703, 
   null, 
   "jyoshu", 
   "No. That is YOUR point, attempting to ignore other salient points... WHY would the church insist that the victim should remain silent?\n\n \n I gave you reasons for this already. Are you listening, here?\n \n \nIf the \"gay\" aspect did confuse the church, it only shows how thoroughly irrational they are on the subject of homosexuality....\n\n \n Wow--news flash ..... some churches have a big problem with homosexuality. \n \n Who'da thunk THAT?? emoticon_xdonno\n \n Foundit, quite frankly, if you're JUST NOW coming to the conclusion that a church discovering their pastor is gay would throw a church like this for a loop, you're REALLY late to the party here ... I mean, do you not realize this aspect of the situation is a pretty OBVIOUS one? To make some comment in passing about how it shows they're whole view is irrational here is like saying it would be irrational for Planned Parenthood to be thrown into some confusion to suddenly discover their director was a closeted staunch pro-lifer. They're not allowing the idea of a gay pastor??? Gee, they're an evangelical conservative church. Who'da EVER expected THAT? emoticon_wow\n \n \nI HAVE NEVER advocated against \"letting people do what they want to do\". My issue is that they be informed with the BIG PICTURE TRUTH.\n\n \n Do you seriously not think many ex-gays KNOW it's impossible to just stop being gay? Do you just have this idea that these people are abandoning their brain here altogether???? Part of the problem is that people like yourself just don't really understand a lot of this \"ex-gay\" movement at all. You obviously don't realize it's very much of a RELIGIOUS movement. One of self-denial and change of ACTIONS. Groups like NARTH who HAVE actually perpetrated the idea of some physiological change have been pounced on as if that's all the movement is comprised of. \n \n \nNo. What I classify as \"groups\" are NARTH, PFOX, Exodus International, ...\n\n \n Well, there you go. Hate to tell you this, but it's a heck of a lot bigger than that ... \n \n \nNo. Again, you're wrong.\n It is besides YOUR point, which in some ways is incredibly disturbing.\n Gays get harmed by reparative therapy.\n\n \n Define 'reparative therapy', Foundit. Clarify your terminology here, because it MATTERS what you mean here.\n \n \nReparative therapy DO NOT INFORM parents of the harm, and they oversell their \"success\" claims.\n\n \n Again, define that phrase. \n \n \n1) This isn't \"accusations\". These are documented and researched harms.\n\n \n If someone puts out a study that says \"churches harm people\", does that mean churches should stop being churches? What are you SUGGESTING needs to happen here, Foundit? \n \n \nNONE of my discussion has EVER revolved around \"they don't need to change\".\n The issue is DOCUMENTED HARM, and that people should know the risks before they get into it.\n\n \n So you're seriously telling me that you'd be JUST FINE with these groups if they eliminated the areas that are claimed to be harmful? If they say \"it's perfectly fine to be gay, but if you want to live differently, we want to support you\", you're just fine what that? Quite frankly, I really don't believe you. If you say the HARM is the issue, then you should be willing to focus on the areas where they're harming and let this movement continue otherwise.\n \n \nBut since it involves a \"gay\" issue, combined with \"religion\", you don't give a flying fig.\n\n \n That's because in many cases, it's a RELIGIOUS issue. You haven't defined what you SPECIFICALLY mean by the \"reparative therapy\" movement here, so until you do, there's nothing to go on here. Do you ONLY mean groups that promote PHYSIOLOGICAL change? 'Cause if that's the limit of what you're riled over, I don't have any disagreement with THAT. I don't think anyone here would. No one in their right mind would think a person can change their sexuality. But the \"ex-gay movement\" doesn't just consist of groups promoting PHYSIOLOGICAL change. It consists of RELIGIOUS groups, like the \"love won out\" churches and so forth. When you say \"reparative therapy\" causes harm, are you referring to JUST groups that promote the physiological change thing? A lot of it focuses on changing behavior.\n \n \nIt goes beyond that.\n If the holistic food WAS DAMAGING the people involved, the FDA would get involved.\n\n \n No, it your rebuttal would only apply if it was damaging to holistic food eaters to ONLY eat their own food rather than going to grocery stores.\n \n \nI'm just asking for something similar here, along with some honesty.\n\n \n Stop it with \"honesty\" garbage, Foundit. Everyone here is being completely honest with you; you need to STOP generalizing about the 'ex-gay movement' and DEFINE WHAT YOU MEAN. Look in the mirror with these comments on honesty and stop flinging personal comments.\n \n \nSo all these \"reparative therapy\" groups, they are run by GAYS or EX-GAYS then, right?\n Not STRAIGHT people who want gays to go straight?\n\n \n What difference does that really make? You comment reveals a bias that a straight person running something like that automatically brings it into suspicion. It doesn't. If it's truly bad, it's bad regardless of whether those who run it are gay OR straight. If it's NOT bad it's that way REGARDLESS of whether those who run it are gay or straight. You're talking about something that's INDEPENDENT of whether or not this stuff is valid.\n \n \nJyoshu, I want people to not get hurt.\n\n \n NO ONE wants people to get hurt, Foundit.  So address areas within the ex-gay movement (rather than the WHOLE movement) that cause harm! :xbanghead What you're doing is like someone looking at highway accidents and saying \"driving automobiles can kill people\", as if that means we all need to stop driving automobiles! No, you don't get to take that off the table--you address the SPECIFIC things WITHIN that which causes harm.\n \n \nWhy insist the victim has to remain silent?\n\n \n Read this carefully, because I don't know how else it can be said ...\n \n He didn't HAVE to remain silent, Foundit.  No one MADE him take the money with it's constraints. I'm saying JUST THE OPPOSITE of what you are claiming I said. I'm not saying he had to be silent--I'm pointing out to you he DIDN'T have to.\n \n \nAnd the funny thing about questions is that they get answered in some shape or form, and THAT is the problem you have here.\n You want it to REMAIN a question, and the rest of us just to walk away...\n\n \n Again, you're the one coming to hard conclusions here. You're the one passing judgment. You never allowed it to be a question in the first place.\n \n \nAnd my point obviously went WAYYY over your head. I was talking about \"redress of grievances\" being a RIGHT. \n\n \n \nIf the man is required to be kept silent, obviously he CANNOT pursue redress of grievances. \n\n \n Then your point is pointless. No one here thinks the young man's right should be taken away. Who's arguing he shouldn't be allowed to do that, Foundit?\n \n \nI am not assuming enough of the facts to come to a presumption... emoticon_wow\n People don't assume \"facts\" Jyoshu.\n\n \n Er ... I would think that if there are FACTS, they should ALWAYS be assumed ... We \"don't NOT\" assume the earth is round when planning a satellite trajectory. That the earth is round is a FACT, and so we DO assume it. Your problem is that you chalk things up as fact that actually fall under the category of \"there-is-evidence-for.\" You see some evidence that happens to work well for you ideological political views, and you upgrade that to \"fact\" status because it provides more 'ammunition' for your ideology. You assume it's FACT that \"reparative therapy\"--whatever the heck that does mean, specifically--is harmful, when in fact what you have is evidence that it is in SOME cases. What you don't know is whether it's ALWAYS harmful, to what degree it's harmful in those cases that it is, or what TYPES of reparative therapy are harmful. Again, part of the problem here is that we're dealing with terms for which there is no real consensus on what they EXACTLY mean, which is why I'm wishing you would clarify what YOU think it means, specifically.\n \n \nIt was an obvious ploy, unless you're going to claim that the all knowing Lord was clueless on the consequences of his actions...\n\n \n LOL!! Foundit, Jesus DIDN'T say a lot more than he DID say. I suppose now we should assume anything he DIDN'T say supercedes what he DID. What we know is that a.) he told these people one thing. Then b.) they went out and did something else. The didn't do what Jesus said do. Gee, that just HAS to mean Jesus actually meant something ELSE ... emoticon_rolleyes It's downright funny how you play up some NON-conventional way of interpreting the scripture here to avoid having to admit that you were just wrong ... emoticon_xgood", 
   {}, 
   342670, 
   null, 
   1233622500.0
  ], 
  [
   342790, 
   null, 
   "foundit66", 
   "I gave you reasons for this already. Are you listening, here?\n\n In your last post, and I have since addressed them...\n \n \n \nWow--news flash ..... some churches have a big problem with homosexuality. \n\n Let's try to get the context correct here, okay?\n The \"churches have a big problem with homosexuality\".\n The PROBLEM I am talking about is on the end OF THE CHURCHES who get IRRATIONAL on the subject.\n They pretend they have expertise and cosmic knowledge that they don't have. They act in ways that are counter-productive for common good.\n In ways that are counter-productive for spiritual good.\n \n To avoid statement ambiguity, the issue I am talking about is some churches ARE a big problem, when it comes to the issue of homosexuality.\n \n \n \nFoundit, quite frankly, if you're JUST NOW coming to the conclusion that a church discovering their pastor is gay would throw a church like this for a loop, you're REALLY late to the party here ...\n\n Jyoshu, quite frankly, if you have any thought in your head that that could be the case, then you are \"REALLY late to the party here\".\n Suffering from SEVERE reading comprehension problems if you think I am \"just now\" coming to that conclusion.\n 'mmmkay? emoticon_xgood\n \n \n \nTo make some comment in passing about how it shows they're whole view is irrational ...\n\n Jyoshu, as difficult as it may be for you to get this, at worst I was being overly optimistic about the church's capability to think rationally on this.\n I whole-heartedly acknowledge the church can be irrational on the issue of gays. I have given multiple examples in the past.\n But it's like saying \"Yeah, I knew Bob would insult his wife in public, but I had no idea he was going to take a knife and killer her\"...\n \n \n \nDo you seriously not think many ex-gays KNOW it's impossible to just stop being gay?\n\n Jyoshu, it's not the \"ex-gay\" knowledge that is the issue.\n LOOK on the web-site of testimonials you gave me.\n Do any ADMIT that \"it's impossible to stop being gay\"?\n \n THAT is the issue.\n Honesty in ADVERTISING.\n Just because the tobacco execs admit to themselves \"Yeah, smoking causes cancer\" doesn't mean that their staunch insistence TO THE PUBLIC on otherwise is somehow mitigated.\n \n \n \nPart of the problem is that people like yourself just don't really understand a lot of this \"ex-gay\" movement at all. You obviously don't realize it's very much of a RELIGIOUS movement. One of self-denial and change of ACTIONS. Groups like NARTH who HAVE actually perpetrated the idea of some physiological change have been pounced on as if that's all the movement is comprised of.\n\n Jyoshu, we understand the \"ex-gay\" movement all too well.\n I also understand that you want people to focus on what YOU CLAIM the \"ex-gay\" community is like.\n But when we look at what is put forth in the literature... emoticon_xdonno\n \n \n \nWell, there you go. Hate to tell you this, but it's a heck of a lot bigger than that ... \n\n Can you document your claim?\n Cause quite frankly, you're trying to make these measly grass-roots molehills into the mountains to obstruct the REAL mountains.\n \n \n \nDefine 'reparative therapy', Foundit. Clarify your terminology here, because it MATTERS what you mean here.\n\n Therapy aimed at changing sexual orientation.\n (And note, this includes claims of ADDING a straight attraction, not just changing somebody to not be gay)\n \n Is this where you do your little shell game to try to exaggerate the \"we just encourage people to deny sexual urges\" as being a lot bigger than it actually is?\n \n \n \nIf someone puts out a study that says \"churches harm people\", does that mean churches should stop being churches? What are you SUGGESTING needs to happen here, Foundit? \n\n Are you not listening?\n I want an honest account of the effects of the therapy.\n People admitting \"this is how rare our \"success\" is\". Admitting \"these are the potential negative consequences\". Admitting \"we have no actual psychologists on staff\" etc, etc, etc...\n Full disclosure, akin to that required for the drug companies.\n \n \n \nSo you're seriously telling me that you'd be JUST FINE with these groups if they eliminated the areas that are claimed to be harmful? If they say \"it's perfectly fine to be gay, but if you want to live differently, we want to support you\", you're just fine what that? Quite frankly, I really don't believe you.\n\n Just out of curiousity, is my presence in this conversation even necessary?\n Cause it looks like you can have this conversation all by yourself and my presence is not needed...\n \n I would still have an opinion that the people who are gay and want to \"change\" are doing so needlessly. The issue of how anti-gay groups push the \"you need to change\" would still be addressed, like how it would be addressed if anti-Christian people insisted that Christians shouldn't believe in Christ...\n \n But quite frankly, that would move from an \"8\" to a \"3\" on the importance of issue scale, IMO.\n \n \n \nIf you say the HARM is the issue, then you should be willing to focus on the areas where they're harming and let this movement continue otherwise.\n\n I'm a big believer in personal choice.\n But the choice should be informed.\n If a guy is told that a ride is completely safe, and it turns out not to be, his choice to get on that ride was made under false claims.\n However, if the guy is told that the ride is NOT safe, and truthfully warned of the problem, then he has made an informed choice and the responsibility is his.\n \n The \"harm\" is an issue on multiple levels.\n IMO, it shows the callous disregard that the \"ex-gay\" movement has towards the actual therapy, and concentrating more on the political agenda in being able to make the claim.\n But by analogy, if Archie wanted to start a service where atheists paid for him to make fun of them, that's the choice of atheists on whether or not they use the service.\n While I personally may find this repugnant, it's between two consenting adults.\n \n Likewise, there are a variety of drug warnings for negative side-effects. The patient must decide whether or not he wants to risk the negative side-effect, in his choice for taking the drug.\n \n \n \nThat's because in many cases, it's a RELIGIOUS issue. You haven't defined what you SPECIFICALLY mean by the \"reparative therapy\" movement here, so until you do, there's nothing to go on here.\n\n Jyoshu, distinguishing between \"religious\" and \"non-religious\" ex-gay efforts is something you're introducing NEW in this post, so let's acknowledge that and address the topic.\n \n Saying over and over again that I have not \"defined\" something that you JUST NOW asked for is nonsensical.\n \n \n \nDo you ONLY mean groups that promote PHYSIOLOGICAL change?\n\n physiology:\n 1 : a branch of biology that deals with the functions and activities of life or of living matter (as organs, tissues, or cells) and of the physical and chemical phenomena involved - compare anatomy 2 : the organic processes and phenomena of an organism or any of its parts or of a particular bodily process\n \n I don't understand your question, as from my position gays are \"physiologically\" identical to straights.\n It's our psychological characteristics which are different. Who we are attracted to is not \"physiology\".\n \n \n \nNo one in their right mind would think a person can change their sexuality.\n\n Did you read the testimonials you quoted to me earlier?\n Do you understand that a lot of these ex-gay groups proclaim that there is no \"being gay\" in the first place?\n \n There are an awful lot of groups out there that would involve not \"in their right mind\".\n \n \n \nBut the \"ex-gay movement\" doesn't just consist of groups promoting PHYSIOLOGICAL change. It consists of RELIGIOUS groups, like the \"love won out\" churches and so forth. When you say \"reparative therapy\" causes harm, are you referring to JUST groups that promote the physiological change thing? A lot of it focuses on changing behavior.\n\n Some of the mechanisms of harm do not care about the distinctions you raise.\n Many of these groups use shame as a motivator to push for the change, whatever form the change may take.\n Compared to therapies like with \"alcoholism\" or \"drug addiction\", the patient is not shamed.\n \n \n \nNo, it your rebuttal would only apply if it was damaging to holistic food eaters to ONLY eat their own food rather than going to grocery stores.\n\n What is the grocery store supposed to be in the non-analogy situation?\n \n \n \nStop it with \"honesty\" garbage, Foundit. Everyone here is being completely honest with you; you need to STOP generalizing about the 'ex-gay movement' and DEFINE WHAT YOU MEAN.\n\n Jyoshu, let me tell you about honesty.\n When these organizations talk about their successes and exaggerate them, but fail to acknowledge their failures and harms to their patients, that is an honesty issue.\n Do you think a drug company would be \"honest\" if it exaggerated its positive effects, and then refused to acknowledge it's negative side-effects and failures?\n \n \n \nWhat difference does that really make?\n\n < yawn <\n I refer you to your previous comment, which prompted my reply.\n You are ignoring the context of my statement, and assuming all sorts of nonsense never intended.\n Review the context and get back to me. I'm not entertaining your confusion when you don't want to pay attention.\n \n \n \nNO ONE wants people to get hurt, Foundit. \n\n Gee. You just described every drunk driver that's killed somebody...\n < end sarcasm <\n What people \"want\" is irrelevant. If a doctor gets his patient killed, and says \"I didn't want that to happen\", does it affect whether or not he committed gross negligence in care of his patient directly leading to his patient's death?\n \n \n \nSo address areas within the ex-gay movement (rather than the WHOLE movement) that cause harm!\n\n I have been.\n \n \n \nWhat you're doing is like someone looking at highway accidents and saying \"driving automobiles can kill people\", as if that means we all need to stop driving automobiles! No, you don't get to take that off the table--you address the SPECIFIC things WITHIN that which causes harm.\n\n It's funny how you take a statement like me saying \"I want people to not get hurt.\", and then you deride me for it.\n Amazing!\n \n It would be more to the issue that I want drunk drivers off the road. You are insisting that every driver that has a drink is not a danger. And I am open to that possibility.\n But the thing you need to appreciate is that currently, these ex-gay groups ARE ON the highway, and they don't tell people that they have been drinking when they invite others to get on their bus. They don't tell people the harm that they have caused people in the past, and continue to cause in the future.", 
   {
    "unicode_changes_made": true
   }, 
   342703, 
   null, 
   1233694920.0
  ], 
  [
   342792, 
   null, 
   "foundit66", 
   "Read this carefully, because I don't know how else it can be said ...\n He didn't HAVE to remain silent, Foundit.  No one MADE him take the money with it's constraints. I'm saying JUST THE OPPOSITE of what you are claiming I said. I'm not saying he had to be silent--I'm pointing out to you he DIDN'T have to.\n\n If somebody offers you help, but you have to remain silent...\n And you have another option without help, but you get to be free in what you say...\n \n That's the scenario we have.\n And the point is that the church had no right to demand his silence.\n Sure, he could have walked away from the church's help, but demanding his silence was out of the question.\n \n \n \nAgain, you're the one coming to hard conclusions here. You're the one passing judgment. You never allowed it to be a question in the first place.\n\n I refer back to my original post, which was filled with questions...And the evangelical church used INSURANCE money?\n What type of \"insurance\" covers payments to an ex-pastors prior \"inappropriate relationship\"?\n Aren't those the words Haggard and the pastorial elite used to describe his \"relationship\" with the prostitute???\n \n \nThen your point is pointless. No one here thinks the young man's right should be taken away. Who's arguing he shouldn't be allowed to do that, Foundit?\n\n Sigh.\n I am arguing against the church's actions.\n I made a statement against the church's actions.\n \n YOU saw fit to but in, with what is looking more and more like just general confusion, failing to realize what I was really talking about.\n My point is not \"pointless\", as I am demonstrating where the church went wrong. If we all agree that they did wrong, that is not \"pointless\".\n \n \n \nEr ... I would think that if there are FACTS, they should ALWAYS be assumed ...\n\n Pointless semantics?\n Or do you have a point in this diatribe?\n \n \n \nYou see some evidence that happens to work well for you ideological political views, and you upgrade that to \"fact\" status because it provides more 'ammunition' for your ideology.\n\n When I use WHAT THE CHURCH ITSELF HAS ADMITTED, I guess maybe I should have allowed for the possibility that they were misrepresenting the situation to make it worse than it actually was???\n The \"evidence\" I am talking about is what the CHURCH ITSELF HAS ADMITTED.\n \n \n \nYou assume it's FACT that \"reparative therapy\"--whatever the heck that does mean, specifically--is harmful, when in fact what you have is evidence that it is in SOME cases.\n\n Quibbling pointlessly over semantics.\n By analogy, somebody assumes \"drunk driving\" is harmful, when what we actually have is evidence that in SOME cases, it has caused harm...\n \n Wow!\n \n \n \nWhat you don't know is whether it's ALWAYS harmful, to what degree it's harmful in those cases that it is, or what TYPES of reparative therapy are harmful.\n\n Sigh.\n Again, I refer to the DRUG COMPANIES.\n They put out a product. Their claims are held to scrutiny regarding how effective they claim their product is. They document the negative side-effects. They do research on the risk.\n THAT is what I am asking for here.\n \n I am just astounded that you try to obfuscate that like I'm somehow not doing due diligence when it's the reparative therapy groups that refuse to answer these questions.\n When a drug company wants to take a drug to market, they have to do this work. THEY have to provide substantiation on levels of \"harmful\", or if it's \"ALWAYS harmful\". THEY have to show to what level it is \"harmful\", or what types of their drug are harmful.\n \n I can document the harm. Do you need me to start spewing research studies at you?\n I think it would be pointless cause you'd ignore them anyways. Or else you'd try to proclaim that it's *not a contested issue*, and then insist that I \"don't know\" just the same...\n \n Would it help if I started linking to research studies documenting the harm?\n \n \n \nAgain, part of the problem here is that we're dealing with terms for which there is no real consensus on what they EXACTLY mean, which is why I'm wishing you would clarify what YOU think it means, specifically.\n\n One funny thing with adjectives is that they can lose meaning. It's helpful when some people try to \"vaguify\" the issue to the point of pointless abstraction, to ignore the concrete specifics.\n So, let's remove confusion.\n Suicide? I hold that it's a harm. You?\n Depression? I hold that it's a harm. You?\n Drug / Alcohol Addiction? I hold that it's a harm. You?\n \n \n \nLOL!! Foundit, Jesus DIDN'T say a lot more than he DID say. I suppose now we should assume anything he DIDN'T say supercedes what he DID. What we know is that a.) he told these people one thing. Then b.) they went out and did something else. The didn't do what Jesus said do.\n\n Obviously you're not going to listen to me.\n So I'll just quote fellow Christian interpretations on the subject, to show what was REALLY going on.\n And between the church's request for silence and Jesus's request for silence, we've got apples and oranges.\n The church requested that an embarrassing VICTIMIZATION be kept silent.\n Jesus requested that his GOOD WORK be kept silent.\n \n By your approach, I guess when the Catholics paid off the child molestation victims to be silent, that had \"biblical precedent\", huh...\n 6. He ordered it to be kept very private, but it was made very public (1.) It was his humility, that he charged them they should tell no man, v. 36. Most men will proclaim their own goodness, or, at least, desire that others should proclaim it; but Christ, though he was himself in no danger of being puffed up with it, knowing that we are, would thus set us an example of self-denial, as in other things, so especially in praise and applause. We should take pleasure in doing good, but not in its being known. (2.) It was their zeal, that, though he charged them to say nothing of it, yet they published it, before Christ would have had it published. But they meant honestly, and therefore it is to be reckoned rather an act of indiscretion than an act of disobedienceBlue Letter Bible - Commentaries\n 4. The charge he gave them to keep it private (v. 30), See that no man know it. He gave them this charge, (1.) To set us an example of that humility and lowliness of mind, which he would have us to learn of him. Note, In the good we do, we must not seek our own praise, but only the glory of God.Blue Letter Bible - Commentaries\n \n The fact that you actually try to use these examples of biblical silence, as a justification for the church hiding their embarrassment, should be repugnant to Christians.", 
   {}, 
   342790, 
   null, 
   1233697500.0
  ], 
  [
   342863, 
   null, 
   "jyoshu", 
   "And the point is that the church had no right to demand his silence.\n Sure, he could have walked away from the church's help, but demanding his silence was out of the question.\n\n \n A LEGAL right? You're wrong; they certainly did have the right to put in such a provision. The option of not taking the deal IS the way to avoid having to be silent here. If someone contracts a person out for engineering work, and that contract has aprovision in there that you can't give information regarding the project to the company's competitors, we don't say the company has no right to demand silence' there. Silence provisions are not THAT uncommon F, and they exist for many reasons. No one has to take any deal if silence is a problem for them.\n \n \nThe \"evidence\" I am talking about is what the CHURCH ITSELF HAS ADMITTED.\n\n \n That's like saying that if someone \"admits\" to speeding on their vehicle, it means they INTENDED to commit vehicular homicide ... emoticon_rolleyes No one here is arguing the church didn't \"admit\" its actions--I'm talking about you jumping to conclusions that it means the church was up to something underhanded and wrong ... (the cover-up conspiracy theory thing) \n \n \nAgain, I refer to the DRUG COMPANIES.\n They put out a product. Their claims are held to scrutiny regarding how effective they claim their product is. They document the negative side-effects. They do research on the risk.\n THAT is what I am asking for here.\n\n \n So you're fine with \"reparative therapy\" organizations being out there and doing their thing as long as they include disclaimers and document negative side-effects? Your beef with the likes of Exodus and Narth would be satistified if they did that?\n \n \nI can document the harm.\n\n \n No, what you able to document is what some studies by psychological groups have said. Listen carefully ..... part of the problem here is that psychology is not like physical effects of drugs, which are MUCH easier to determine as causality. It's one thing to be able to attribute a person getting a rash or getting sick to having taken a given medicine. It's another thing altogether to say that a form of therapy or counseling is what caused someone to go and kill themselves, particularly when there are often other issues already there as well. Surely you understand the difference. What happens is that people like yourself who WANT it to be the case will approach the psychological studies as if it were something as cut and dry and as obviously causal as a physical reaction to medicine. (The drug company examples.) The differences are one reason WHY some have taken such issue with relying so heavily on these studies for the sort of positions you take on this sort of thing. \n \n \nSo I'll just quote fellow Christian interpretations on the subject, to show what was REALLY going on.\n\n \n Nothing you just quoted indicate anything about Jesus saying one thing but actually intending a different effect--ulterior motives, basically, which is essentially the argument you were making, when you said \"Jesus told them to be silent, KNOWING that would only push them to repeat his deeds even more... It was an obvious ploy\".\n \n In fact, what you quoted ironically demonstrates the OPPOSITE of what you're claiming--they focus on the 'zeal' and 'seeking their own praise' as the problem. \n \n \nAnd between the church's request for silence and Jesus's request for silence, we've got apples and oranges. The church requested that an embarrassing VICTIMIZATION be kept silent.\n\n \n Foundit, do you understand the concept of a \"settlement\"? It means that, when all parties agree, the issue is SETTLED. Frankly, it sounds like you would only be open to a settlement that would allow people to keep talking about something over and over for as long as they want. If something is going to truly be settled, why shouldn't there be a provision there that essentially says this incident should be dropped as something to make a public issue? And if that provision IS a problem, then no one has to accept the settlement to begin with. \n \n I think the real problem here is you want to see the CHURCH continue to be embarrassed over this.\n \n \nThe fact that you actually try to use these examples of biblical silence, as a justification for the church hiding their embarrassment, should be repugnant to Christians.\n\n \n BLOWI. I didn't say or claim it was justification for anything. YOU made the claim that you think they should help the young man the way Christ would have; without contraints. I'm pointing out that obviously you can't claim with any certainty that Christ would have helped without constraists, as he did assign constraints on his help numerous times. In fact, given his propensity toward forgiveness, I think it better stands to reason that he wouldn't want to see a church congregation have to continue to be embarrassed over something ad-infinitum.", 
   {}, 
   342792, 
   null, 
   1233781320.0
  ], 
  [
   342874, 
   null, 
   "foundit66", 
   "A LEGAL right? You're wrong; they certainly did have the right to put in such a provision. The option of not taking the deal IS the way to avoid having to be silent here. If someone contracts a person out for engineering work, and that contract has aprovision in there that you can't give information regarding the project to the company's competitors, we don't say the company has no right to demand silence' there. Silence provisions are not THAT uncommon F, and they exist for many reasons. No one has to take any deal if silence is a problem for them.\n\n I am talking moral right, of a person supposedly interested in helping the other person.\n The move by the church to request silence was selfish. It hindered the victim's recovery.\n \n \n \nThat's like saying that if someone \"admits\" to speeding on their vehicle, it means they INTENDED to commit vehicular homicide ... emoticon_rolleyes No one here is arguing the church didn't \"admit\" its actions--I'm talking about you jumping to conclusions that it means the church was up to something underhanded and wrong ... (the cover-up conspiracy theory thing) \n\n Your analogy has jumped the track and is pointlessly hyperbolic.\n It would be more like saying \"John's son hit another person with a car. John provided some aid, and insisted that the provided aid be conditional upon the victim being silent. The act of demanding the victim be silent was a selfish request.\"\n \n I don't know what you think I have said that could possibly be analogous to \"intended to commit vehicular homicide\". \n \n \n \nSo you're fine with \"reparative therapy\" organizations being out there and doing their thing as long as they include disclaimers and document negative side-effects? Your beef with the likes of Exodus and Narth would be satistified if they did that?\n\n How many times am I going to have to answer this question.\n \n I would still have complaints regarding the POINT of the effort.\n Kind of like a black man would be offended at the idea that blacks had to undergo \"therapy\" to become white...\n \n But the complaints would be less of an issue than the current situation, which I see as just plain indefensible.\n \n \n \nNo, what you able to document is what some studies by psychological groups have said. Listen carefully ..... part of the problem here is that psychology is not like physical effects of drugs, which are MUCH easier to determine as causality. It's one thing to be able to attribute a person getting a rash or getting sick to having taken a given medicine. It's another thing altogether to say that a form of therapy or counseling is what caused someone to go and kill themselves, particularly when there are often other issues already there as well.\n\n Some of the research has already been presented, documenting the claims and the methodology of evaluation for \"harm\" to gays.\n If I posted more info, regarding reparative therapy specific attempts, would you actually discuss it in a SPECIFIC CONTEXT?\n \n Or is this reply of yours simply a vague attempt to pretend confusion, while the truth is that when ACTUAL STUDIES ARE PRESENTED, you present minimal refutation...\n \n Moreover, would suicide letters detailing why the reparative therapy victims committed suicide be helpful to you?\n Would that be enough evidence for you?\n \n I have already quoted EX-REPARATIVE THERAPY GROUP LEADERS who have admitted they have harmed their patients.\n And yet you continue to try to obfuscate, as you ignore the evidence provided to you...\n \n \n \nNothing you just quoted indicate anything about Jesus saying one thing but actually intending a different effect--ulterior motives, basically, which is essentially the argument you were making, when you said \"Jesus told them to be silent, KNOWING that would only push them to repeat his deeds even more... It was an obvious ploy\".\n\n What I quoted demonstrates a CHRISTIAN INTERPRETATION of the \"silence\" issue.\n These CHRISTIAN interpretations clearly establish a different approach, beyond your pretense that there is a \"biblical\" precedent for helping somebody and LEGALLY BINDING somebody to silence for selfish reasons, and Jesus's approach.\n \n \n \nFoundit, do you understand the concept of a \"settlement\"? It means that, when all parties agree, the issue is SETTLED. Frankly, it sounds like you would only be open to a settlement that would allow people to keep talking about something over and over for as long as they want. If something is going to truly be settled, why shouldn't there be a provision there that essentially says this incident should be dropped as something to make a public issue?\n\n Oh yeah. That makes perfect sense.\n So you agree then with the Catholic church requiring the child molestation victims to be silent....\n < end sarcasm <\n \n I have already explained why it should not be a provision. It hinders healing.\n And with the Catholic example, it also helps the problem to continue unaddressed.\n \n \n \nBLOWI. I didn't say or claim it was justification for anything. YOU made the claim that you think they should help the young man the way Christ would have; without contraints. I'm pointing out that obviously you can't claim with any certainty that Christ would have helped without constraists, as he did assign constraints on his help numerous times. In fact, given his propensity toward forgiveness, I think it better stands to reason that he wouldn't want to see a church congregation have to continue to be embarrassed over something ad-infinitum.\n\n Christ may have asked, but he didn't require.\n The church's situation was a LEGAL REQUIREMENT upon the man.\n \n And furthermore, you keep focusing on the \"embarrassment\" of the church. I think that's your real concern here.\n Have you ever shown any real concern for the victim here?\n Or are you just busy trying to paint the church as a victim...", 
   {}, 
   342863, 
   null, 
   1233785400.0
  ], 
  [
   342913, 
   null, 
   "MrWriteLA", 
   "The Gist: Haggard's Pump 'n Go: Serving You 24/7\n \n...the Colorado Springs TV news station which broke the story reported only a few details -- that Haggard once masturbated in front of Haas and sent Haas sexually explicit messages, and that the New Life Church paid him hush money to stay silent about it -- and did not even remotely present the fuller picture that Grant Haas lays out, which is very much about the abuse and exploitation that has gone on at New Life Church and is likely still going on. \n \n Haas came on my show and spoke about his relationship with Haggard in full detail and about others in the church as well as how the church responded to his allegations. It was a very long interview that stretched over an hour and a half. I've provided a video clip of one part here. I will post more audio/video tomorrow and in coming days.\n \n In this clip we discuss the \"Twenty-four/Seven Program\" at New Life Church, a sort of Bible boot camp where young men, 18-23, are worked out intensely and get all cut up and muscled while also praying to Jesus, immersed in this 24 hours a day, often being woken up at all hours of the night. Haggard and another man who is described as \"struggling with homosexuality\" often oversaw the program, including going to the gym with the young men in the morning to work out and shower with them. They often went on training missions -- including simulated counter-terrorism missions, as Christians under attack, and you'll hear about all of that. (Please don't mind the grimaces on my face throughout: I really wasn't that shocked and disgusted about what I was hearing! We had some technical/sound issues in the studio, and I was trying to cope with those problems, on the computer and to my producers, and was pretty frustrated by them, hence some of the looks on my face). As I said, I will post more, and Pam Spaulding pretty much live-blogged the interview with a lot of details.\n \n Below are some excerpts from the detailed notes of events that Grant Haas wrote in his own words and gave me, and which I used throughout the interview. He pretty much recited these statements back during the interview, as I went through them, and I'll be posting some of our discussions in coming days.\n \n Upon first meeting Ted Haggard, after telling him he was \"struggling with homosexuality\":\n Immediately Pastor Haggard's eyes light up and he became very concerned. He insisted that I take his personal cell phone number and give him a call Monday morning so he could take me to lunch and discuss my problems....He began to explain that most men struggle with homosexual desires and began to regurgitate information that would be found in Alfred's Kinsey's sexual research reports. He described that some of his staff had strong homosexual desires, some had no homosexual desires, but most fell somewhere in the middle (the Kinsey scale of sexuality)..He began asking me questions about my sexual preferences in the bedroom. Questions about what types of sex I like (example: bondage, toys, groups, bathhouses, top, bottom, versatile, drugs). Ted explained to me that since I preferred to be in a \"top\" position that it would be easy to become straight because \"an ####### is similar to a vagina.\"As things progressed Haggard told him about the \"party formula:\"\n Eventually he started asking me what kinds of things I was into (oral, anal, rimming, bondage, porn, etc.). Then he began to explain a \"party formula\" to me. He explained that the \"party formula\" usually involved taking crystal-meth, poppers, Viagra, renting pornography and jerking off alone or with others. He told me that he knew a lot of people who were into this type of activity and found it very enjoyable.Haggard would often text message Haas while Haggard was high, Haas said, which was often, including during sermons but mostly while Haggard was away: \n The next weekend I started receiving text messages from him again. This time he was at LAX airport in the VIP-Red Carpet Room. He began sending me messages like \"the room is spinning\", \"I think I'm gonna throw up\", and \"I did way too much\". He began to go into detail on how he had bought porn, poppers, and meth and that he jerked off of over two hours.\n", 
   {
    "unicode_changes_made": true
   }, 
   342119, 
   null, 
   1233816720.0
  ], 
  [
   343353, 
   null, 
   "foundit66", 
   "The Gist: Haggard's Pump 'n Go: Serving You 24/7\n\n I heard about that the other day. Really disturbing!\n \n The \"Twenty-four/Seven Program\" was particularly disturbing. It reminded me of one author telling how he went to one of the anti-gay groups (can't remember their name) and they showed the author all their \"research\" on the \"gay lifestyle\". The anti-gay group \"research\" basically consisted of desk drawers filled with gay porn for their \"research\" and a room which had sex toys for their \"research\".\n But at least THAT example didn't have young adults subjected to this type of \"treatment\".\n \n I hate to think of any kid who is forced by their parents to go to any \"camp\" run by individuals like that. But of course, some would argue \"it's a parents right\" to subject their kid to such insanity, and not question the issue any further...\n \n I have also seen the Haggard documentary, and was astounded at some of the junk that was going on. The church officials exiled Haggard from the state of Colorado, and from his \"home\" church. And of course, they told him he couldn't speak to the \"media\" either. They are thorough on keeping people quiet on the transgressions.\n Great \"forgiveness\" these guys got going on. Especially considering how their statements AFTER the first scandal broke tried to obfuscate a full understanding of what Haggard was guilty of.\n Since then, Haggard has been allowed to return to Colorado, but evidently still can't go back to the church he helped found.", 
   {}, 
   342913, 
   null, 
   1234213800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Pastor in Gay Scandal: Story Just Keeps Going...", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12283-pastor-gay-scandal-story-just-keeps-going.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12283, 
  "discussion_files": [
   [
    "22113.html", 
    "http://www.4forums.com/political/gay-rights-debates/12283-pastor-gay-scandal-story-just-keeps-going-print.html"
   ], 
   [
    "22114.html", 
    "http://www.4forums.com/political/gay-rights-debates/12283-pastor-gay-scandal-story-just-keeps-going-3-print.html"
   ], 
   [
    "22115.html", 
    "http://www.4forums.com/political/gay-rights-debates/12283-pastor-gay-scandal-story-just-keeps-going-2-print.html"
   ]
  ], 
  "identifier": 12283
 }
]