[
 [
  [
   342461, 
   null, 
   "Superlite27", 
   "If this is the forum for liars, where is the forum for accusors?\n \n Oh well, I still challenge Penfold to \"put his money where his mouth is\".\n \n \n \nIf you stuck to reality instead of diverting into these strawman rants, then I suppose your entertainment value would be less. The point is not sickness patterns, but lethal lead patterns, which occurrence is minimised by sufficient regulation.\n\n \n O.K. PROVE IT!\n \n I will offer links to specific individuals lives that have been saved by firearms if asked.\n \n If shootings are \"minimised by sufficient regulation\" as you continuously claim, show me.\n \n Show me some links to people's lives who have been saved by gun control laws. I can do it on my side. I can show you links to lives saved by firearms. Now. Put up on your side. Link to some lives saved by gun control. Either that, or stop with the lies.\n \n PUT UP OR SHUT UP!", 
   {
    "post_info": {
     "post_title": "Challenge to Penfold"
    }
   }, 
   null, 
   null, 
   1233418560.0
  ], 
  [
   342470, 
   null, 
   "Penfold", 
   "London and New York both have a little over 8 million population. Gun homicide rates are 2.4 per 100,000, and 6.8 per 100,000 respectively. The higher one has less gun restriction. Reference to individual anecdotes are not evidence, except of your poor understanding. As to your unnecessary combative insultive tone, it is so passe.", 
   {}, 
   342461, 
   null, 
   1233427980.0
  ], 
  [
   342555, 
   null, 
   "Superlite27", 
   "Reference to individual anecdotes are not evidence\n\n \n Explain this.\n \n So concrete, factual instances of a firearm saving an individual life, cannot prove that firearms save individual lives?\n \n I can post many.\n \n Or is it that since you cannot post any individual instances of gun control saving an individual life, you cannot admit THERE IS NO PROOF, you have to dismiss the entire system as \"not evidence\"?\n \n I guess concrete evidence only counts if it supports your claim. Otherwise, it doesn't count, huh?\n \n I bet if the shoe were on the other foot, you'd be shoving it my face at every available opportunity. If you could post 10 links to gun control laws saving a life, and I couldn't show an instance of the opposite, you'd be pointing out the truth and using it to support your claim because you would have EVIDENCE!\n \n Yet, if the other guy has evidence and you do not, the only way to avoid the complete collapse of your claim is to discredit the entire category:\n \n \nReference to individual anecdotes are not evidence\n\n \n Yeah. If I was lying, I wouldn't want to have to provide evidence to back up my claim either.", 
   {}, 
   342470, 
   null, 
   1233506280.0
  ], 
  [
   342557, 
   null, 
   "Penfold", 
   "Please read the following. You are abusing the terms of this forum. You have it backward.\n \n \"If someone claims you are lying, you can use this forum to have them prove it. A quote and a link to the accusation are mandatory. Keep it to one specific accusation per thread. Remember, being mistaken or wrong is not necessarily lying.\"\n \n I'll let it go this time. emoticon_rolleyes", 
   {}, 
   342555, 
   null, 
   1233507180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Challenge to Penfold", 
  "url": "http://www.4forums.com/political/liars-corner/12302-challenge-penfold.html", 
  "breadcrumbs": [
   "Liars Corner"
  ], 
  "id_number": 12302, 
  "discussion_files": [
   [
    "24120.html", 
    "http://www.4forums.com/political/liars-corner/12302-challenge-penfold-print.html"
   ]
  ], 
  "identifier": 12302
 }
]