[
 [
  [
   342939, 
   null, 
   "daewoo", 
   "ABC News: Ginsburg Is Hospitalized With Pancreatic Cancer\n \n \nGinsburg Is Hospitalized With Pancreatic Cancer\n \n Supreme Court Justice Ruth Bader Ginsburg had surgery Thursday after being diagnosed with pancreatic cancer, the court said.\n \n Ginsburg, 75, had the surgery at the Memorial Sloan-Kettering Cancer Center in New York. She will remain in the hospital for seven to 10 days, said her surgeon, Dr. Murray Brennan, according to a release issued by the court.\n \n The court announcement said the cancer is apparently in the early stages.\n \n In 1999, Ginsburg had surgery for colon cancer and had chemotherapy and radiation treatment. The only woman on the court, she has been a justice since 1993.\n\n \n Pancreatic cancer is an extremely painful and horrible way to go. Who would have ever thought that reading that somebody is dying of such a dread disease would make me giggle??", 
   {
    "post_info": {
     "post_title": "Evil troll woman soon to bite the dust"
    }
   }, 
   null, 
   null, 
   1233867780.0
  ], 
  [
   342943, 
   null, 
   "Steeeeve", 
   "?? A little harsh don't you think? She isn't that bad of a person and best friends with Justice Scalia haha.", 
   {}, 
   342939, 
   null, 
   1233871860.0
  ], 
  [
   342948, 
   null, 
   "daewoo", 
   "Ginsburg prefers ruling that created \"limited political backlash\" (her words). That is ####. A judge should be concerned with justice, not politics. I dislike Scalia for the same reason. Unconstitutional is unconstitutional. Failing to strike down, in its entirety, a law, or an entire line of legislation, because you want to avoid \"sweeping changes\" makes you complicit to a crime.\n \n The supreme court was supposed the be the arbitrator between the people and the government. They are there to provide justice, not political expediency. \n \n All that stuff that congress does that is outside their powers is done because supreme court justices have allowed it, and later justices who did not desire to make sweeping changes, or who opted for limited political backlash, lacked the testicular fortitude to reverse those terrible rulings. \n \n It has gotten to the point where you can not, in honesty, point to the supreme court for direction in what is and is not constitutional because their entire history has become one of rulings that require logic that is so convoluted as to be ridiculous.\n \n Frankly I think the founders screwed up by making the supreme court justices political appointees.", 
   {}, 
   342943, 
   null, 
   1233873420.0
  ], 
  [
   342977, 
   null, 
   "Steeeeve", 
   "Ginsburg prefers ruling that created \"limited political backlash\" (her words). That is ####. A judge should be concerned with justice, not politics. I dislike Scalia for the same reason. Unconstitutional is unconstitutional. Failing to strike down, in its entirety, a law, or an entire line of legislation, because you want to avoid \"sweeping changes\" makes you complicit to a crime.\nJustice Thomas, is that you!? Scalia doesn't believe in the \"political backlash\" like Ginsburg....he just believes in some level of Stare decisis which is where the \"sweeping changes\" comes from. This would be something like removing the incorporation doctrine which Scalia fully admits goes against the meaning of the 14th amendment. So with Scalia you get about 95% justice and 5% anti-sweeping changes. With Ginsburg and the like you get social policy because they don't think we can wait for the legislature to do their job...or really the states.\n \n \nThe supreme court was supposed the be the arbitrator between the people and the government. They are there to provide justice, not political expediency. \nTalk to the anti-federalists...they were the ones that predicted the judicial branch would become the most powerful branch (as opposed to the weakest). But I do agree.\n \n \nAll that stuff that congress does that is outside their powers is done because supreme court justices have allowed it, and later justices who did not desire to make sweeping changes, or who opted for limited political backlash, lacked the testicular fortitude to reverse those terrible rulings. \nScalia is the only one with this policy and I believe it exists so he doesn't become a Ron Paul. Ron Paul is right about everything he says but no one is going to listen to the guy because he is too black and white to talk to and so nothing ever gets done. Scalia approaches it like \"baby steps\" back towards the constitution. You can disagree with this I suppose, I'm still, not sure how I feel about it but I am sure that having 9 Scalia and Thomas's is better than our current make-up.\n \n Thomas takes the Ron Paul approach but seems to be willing to give a little on \"interstate commerce\". \n \n \nIt has gotten to the point where you can not, in honesty, point to the supreme court for direction in what is and is not constitutional because their entire history has become one of rulings that require logic that is so convoluted as to be ridiculous.\nThis is evidenced by the length of the opinions. Back in the 1800s they were like 2 pages. This wasn't because it took longer to write them then, it was because all you said was \"the Xth amendment doesn't mean that so get lost\". \n \n Now you have to justify it somehow and you do that by using confusion..or as you say \"convoluted logic\".\n \n Don't get me wrong though...we have always have \"willful judges\" as Scalia has said, and we always will.\n \n \nFrankly I think the founders screwed up by making the supreme court justices political appointees.\nRead the anti-federalists papers...they will make you feel better about the judiciary.", 
   {}, 
   342948, 
   null, 
   1233935580.0
  ], 
  [
   342979, 
   null, 
   "Archangel", 
   "I take no pleasure at all in Ginsburg's suffering, but I do find solace in the fact that the court is quite young and Obama probably wont be replacing anymore of them unless health concerns arise over the next 4 years.\n U.S. Supreme Court Justices", 
   {}, 
   342977, 
   null, 
   1233936960.0
  ], 
  [
   342989, 
   null, 
   "daewoo", 
   "Justice Thomas, is that you!? Scalia doesn't believe in the \"political backlash\" like Ginsburg....he just believes in some level of Stare decisis which is where the \"sweeping changes\" comes from. This would be something like removing the incorporation doctrine which Scalia fully admits goes against the meaning of the 14th amendment. So with Scalia you get about 95% justice and 5% anti-sweeping changes. With Ginsburg and the like you get social policy because they don't think we can wait for the legislature to do their job...or really the states.\n\n \n IMO his anti sweeping changes thing and ginsburgs \"political backlach\" thing are about the same. In both cases you have SUPREME COURT JUSTICES who do not want to rock the boat. \n \n \nTalk to the anti-federalists...they were the ones that predicted the judicial branch would become the most powerful branch (as opposed to the weakest). But I do agree.\n\n \n IMO the anti-federalists were right about a lot of things. For example, they opposed the bill of rights. On the surface, that would seem like a bad idea, but then you look at their logic and it becomes apparent that they were right. They argued that if we had a bill of rights, eventually we would reach the point that those rights in the bill of rights would be the only rights the people had left. They argued that instead the focus should be on ensuring that the government be kept strictly to the powers enumerated in the constitution, and that a government on that short a leash could hardly find ways to oppress the people or deprive them of their rights. \n \n What has happened is exaclty what they warned would happen. The government was more or less given free reign to grow as big as it wanted and people came to view the bill of rights as our only rights. Now we have gotten to the point that various judges and lawyers have explained to us over time that we do not actually even have THOSE...at least not in any meaningful way. \n \n \nScalia is the only one with this policy and I believe it exists so he doesn't become a Ron Paul. Ron Paul is right about everything he says but no one is going to listen to the guy because he is too black and white to talk to and so nothing ever gets done. Scalia approaches it like \"baby steps\" back towards the constitution. You can disagree with this I suppose, I'm still, not sure how I feel about it but I am sure that having 9 Scalia and Thomas's is better than our current make-up.\n\n \n Yea...we can suffer through a few hundred years of tyranny while justices take baby steps to avoid rocking the boat. Americans are sitting in prison right now, charged with violating laws that are completely and blatantly unconstitutional while those A-holes are taking baby steps. Jefferson is rolling in his grave. \n \n \nThis is evidenced by the length of the opinions. Back in the 1800s they were like 2 pages. This wasn't because it took longer to write them then, it was because all you said was \"the Xth amendment doesn't mean that so get lost\". \n\n \n 2 pages, hand written, and the first 1.75 pages was a recap of the case. \n \n \nDon't get me wrong though...we have always have \"willful judges\" as Scalia has said, and we always will.\n\n \n This is true. Unfortunately with our current system...or at least the way our current system has been put into practice...we are stuck with those willful judges until the day they die or chose to retire, and we are stuck with their garbage rulings forever because we are taking baby steps, not rocking the boat, avoiding political turmoil, and applying stare decisis.", 
   {}, 
   342977, 
   null, 
   1233943620.0
  ], 
  [
   343006, 
   null, 
   "Steeeeve", 
   "IMO his anti sweeping changes thing and ginsburgs \"political backlach\" thing are about the same. In both cases you have SUPREME COURT JUSTICES who do not want to rock the boat. \nWell we will have to disagree on this. Scalia hasn't really invented any new doctrines like the others have.\n \n \n\n IMO the anti-federalists were right about a lot of things. For example, they opposed the bill of rights. On the surface, that would seem like a bad idea, but then you look at their logic and it becomes apparent that they were right. They argued that if we had a bill of rights, eventually we would reach the point that those rights in the bill of rights would be the only rights the people had left. They argued that instead the focus should be on ensuring that the government be kept strictly to the powers enumerated in the constitution, and that a government on that short a leash could hardly find ways to oppress the people or deprive them of their rights. \nThe anti-federalists were the ones who wanted a Bill of Rights. The federalists got this one right in that we shouldn't have had one. The two sides compromised on the wrong things.\n \n \nYea...we can suffer through a few hundred years of tyranny while justices take baby steps to avoid rocking the boat. Americans are sitting in prison right now, charged with violating laws that are completely and blatantly unconstitutional while those A-holes are taking baby steps. Jefferson is rolling in his grave. \nWe can always get 9 Breyers...might make you appreciate what we have now haha. I'm waiting for the day when we declare certain parts of the constitution unconstitutional.", 
   {}, 
   342989, 
   null, 
   1233952980.0
  ], 
  [
   343010, 
   null, 
   "simone", 
   "ABC News: Ginsburg Is Hospitalized With Pancreatic Cancer\n \n \n \n Pancreatic cancer is an extremely painful and horrible way to go. Who would have ever thought that reading that somebody is dying of such a dread disease would make me giggle??\n\n Why does this rather physically-small woman frighten and enrage you?", 
   {}, 
   342939, 
   null, 
   1233955020.0
  ], 
  [
   343057, 
   null, 
   "chester", 
   "Why does this rather physically-small woman frighten and enrage you?\n\n \n There are some here who are frightened and enraged by the fact that there is someone who is far more intelligent than they - and a woman to boot.emoticon_cry", 
   {}, 
   343010, 
   null, 
   1234012980.0
  ], 
  [
   345934, 
   null, 
   "Chuz Life", 
   "Why does this rather physically-small woman frighten and enrage you?\n\n \n Incalculable, the number of children aborted because of the words, positions and rulings of that tinly little woman,\n \n Their blood is not only on her hands but also upon the hands of those who supported her in her rulings. \n \n How is Ruth Vader Ginsburg can be considered any less culpable than were the guards at the gates of auschwitz is beyond me.\n \n But (as they say) it is what it is.", 
   {
    "post_info": {
     "post_title": "Incalculable,..."
    }
   }, 
   343010, 
   null, 
   1236185760.0
  ], 
  [
   345943, 
   null, 
   "chester", 
   "Can anyone here say \"Over the Top\"?", 
   {}, 
   345934, 
   null, 
   1236188100.0
  ], 
  [
   345944, 
   null, 
   "snakespit", 
   "I take no pleasure at all in Ginsburg's suffering, but I do find solace in the fact that the court is quite young and Obama probably wont be replacing anymore of them unless health concerns arise over the next 4 years.\n U.S. Supreme Court Justices\n\n \n Those are the ages they were appointed at, not the age that they are now. \n \n Stevens is 88.\n Scalia is 72.\n Kennedy is 72.\n Countess Dracula is 75.\n \n Not exactly a bunch of spring chickens. If Obama were to serve a second term, he is almost assured to be replacing at least 1, perhaps more.", 
   {
    "post_info": {
     "post_title": "Holy inattention to detail Batman!"
    }
   }, 
   342979, 
   null, 
   1236188160.0
  ], 
  [
   345970, 
   null, 
   "TRIGGER", 
   "Are we dicussing Darth Vader Ginsburg?emoticon_rolleyes", 
   {}, 
   345944, 
   null, 
   1236214140.0
  ], 
  [
   345987, 
   null, 
   "Penfold", 
   "No, they are discussing a frail old lady suffering from an excruciatingly painful terminal cancer. Can't you just feel the love and compassion? emoticon_rolleyes", 
   {}, 
   345970, 
   null, 
   1236220980.0
  ], 
  [
   345994, 
   null, 
   "Chuz Life", 
   "No, they are discussing a frail old lady suffering from an excruciatingly painful terminal cancer. Can't you just feel the love and compassion? emoticon_rolleyes\n\n \n Ohhhh! \n \n You almost had me! I almost started writing an apology.\n \n But, I couldn't do it because the memories of Ruth Vader Ginsburg's dissent on the \"Partial Bith Abortion Ban\" \n \n Your remember what a \"Partial Birth Abortion\" is don't you?\n \n \"(1) A moral, medical, and ethical consensus exists that the practice of performing a partial-birth abortion -- an abortion in which a physician delivers an unborn child's body until only the head remains inside the womb, punctures the back of the child's skull with a Sharp instrument, and sucks the child's brains out before completing deliveryof the dead infant -- is a gruesome and inhumane procedure that is never medically necessaryand should be prohibited.\"\n \n How much do you think \"partial birth abortion\" should be legal?\n \n Well, let's read what Ruth Vader Ginsburg wrote in her dissent about the ban. Ok?\n \n \"In sum, the notion that the Partial-Birth Abortion Ban Act furthers any legitimate governmental interest is, quite simply, irrational. The Court&#8217;s defense of the statute provides no saving explanation. In candor, the Act, and the Court&#8217;s defense of it, cannot be understood as anything other than an effort to chip away at a right declared again and again by this Court&#8212;and with increasing comprehension of its centrality to women&#8217;s lives.\"-- Ruth Vader Ginsburg\n \n Yeah,... beyond words.", 
   {
    "post_info": {
     "post_title": "Poor little old lady,.."
    }
   }, 
   345987, 
   null, 
   1236226800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evil troll woman soon to bite the dust", 
  "url": "http://www.4forums.com/political/current-events-debates/12318-evil-troll-woman-soon-bite-dust.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 12318, 
  "discussion_files": [
   [
    "5458.html", 
    "http://www.4forums.com/political/current-events-debates/12318-evil-troll-woman-soon-bite-dust-print.html"
   ]
  ], 
  "identifier": 12318
 }
]